{"Nigel Milsom has been a finalist in the Wynne Prize, the Blake Prize, and the Brett Whiteley Travelling Art Scholarship.": [{"url": "https://www.theguardian.com/artanddesign/2015/jul/17/archibald-prize-2015-exhibition-review", "page_content": "There are always upsets and curveballs in the Archibald prize. Most of the time, the art world debate concerns itself with the perennial questions of deserving winners or overlooked finalists or cruel exclusions. But it’s not often a genuine surprise comes along, as with Nigel Milsom, who has won the 2015 prize for his portrait of criminal barrister Charles Waterstreet.\n\nTo catch you up on their joint story, Milsom was jailed for an armed robbery committed shortly after he won the Sulman prize in 2012. Waterstreet defended Milsom and the artist was eventually released in 2014. While in jail, Milsom also won the 2013 Doug Moran prize. His return to the Art Gallery of New South Wales as the winner of the $100,000 Archibald isn’t so much a tale of personal redemption for Milsom, but the success story of an incredibly talented artist.\n\nThe crop of finalists for 2015 was eclectic, with a few very strong contenders for winner. Milsom’s work, easily the largest and most commanding picture with the sepulchral figure of Waterstreet looming from the dark shadows like Nosfertau, towers over the rest of the works, including Mitch Cairns’s more modest portrait of artist Peter Powditch, hung alongside Milsom’s work and awarded the runner-up sticker of “highly commended” by the gallery trustees.\n\n\n\nOf the rest of the 47 finalists, there are some interesting pictures including Sally Ross’s graphic and precise portrait of Eva Orner, Marc Etherington’s faux naïve portrait of artist Del Kathryn Barton and Tony Curran’s portrait adapted from an iPad sketch of businessman Luke Grealy.\n\nThe wooden spoon is once again hotly contested with Bruno Jean Grasswill’s frankly ghastly image of actor Michael Caton taking the Packing Room prize, thus disqualifying it from further shame, but the real winner of worst in show goes to Shaun Gladwell for his portrait of Mark Donaldson VC. Gladwell, who is better known as a video artist, made his initial reputation as a painter but this picture, a faint reprise of German neo-expressionism, is hugely unconvincing.\n\nThe Archibald is a curious beast, with seemingly little rhyme or reason to the ebb and flow of quality in its paintings and subjects. It’s something I always wondered about: why this selection? Why this winner?\n\nIn 2014, I was invited to take part in the selection of the Salon des Refuses, the SH Ervin Gallery’s show of Archibald and Wynne prize rejects. The insight I gleaned from the experience is that of the 1,000 plus works that are usually entered, the vast majority have no chance – Sunday painters, protest works, amateurs and others just having a go.\n\nWhen it gets down to the business of real contenders, the Archibald is a competition between about 60 paintings and, for all the hoopla and storied history, the prize is no different to any in your local community hall – it’s all down to who enters.\n\nThe Wynne winner, Natasha Bieniek’s Biophilia, measuring just 9cm by 9cm. Photograph: Mim Stirling/AGNSW\n\nThe companion prizes to the Archibald are the Wynne prize for landscape or figure sculpture and the Sulman prize for genre painting or mural art, a pair of awards always fascinating for the oddities they throw up, both in finalists and winners.\n\nThe miniature landscape and eventual Wynne winner, Biophilia, by Natasha Bieniek is a gem, literally as smallest work in the category, too easily obscured by some commanding paintings by Kate Shaw, Ildiko Kovacs, Angus Nivison and Aaron Kinnane.\n\nSome of the more eccentric works steal more attention, such as Theo Papathomas’s Constructed Landscape – a strange and intriguing picture of paint runs and crazed surfaces – and Neil Haddon’s The First Time Again, a meta-landscape mash up of samples from John Glover and Paul Gaugin and the reflectiveness of your granny’s ornamental biscuit tins.\n\nThe 2015 Sulman has been won by Jason Phu for his Chinese ink and paper work, I was at yum cha when in rolled the three severed heads of Buddha: Fear, Malice and Death. Like much of Phu’s recent art , it’s a funny, gentle and autobiographical work, part manic poet, hungover cartoonist.\n\nJason Phu’s Sulman-winning artwork. Photograph: Mim Stirling/AGNSW\n\nSelected by artist and former AGNSW trustee, Lindy Lee, this year’s Sulman is dominated by other graphic works such as David Egan’s Strolling beyond Infinity, Kate Beynon’s Gaveyard Scene and Dapeng Liu’s The Temple, the Sailing Boat and the Trolleybus ‒ a surrealistic mountain scape. But for me, the greatest interest is always with the “ring-ins”, such as Stephen Ormandy’s gorgeous and playful Attention Seeker and Tom Carment’s quietly beautiful series of miniatures Sydney Structures."}, {"url": "https://theconversation.com/nigel-milsom-wins-the-archibald-our-most-fun-festival-of-faces-44717", "page_content": "When announcing this year’s Archibald Prize, the President of Trustees at the Art Gallery of New South Wales, Guido Belgiorno-Nettis, said that judging the annual competitions was “absolutely the most fun thing you can do as a trustee”. This year’s prize exhibitions are an indication that they are all having a lot of fun.\n\nThe guide to winning\n\nThe choice of winner for the Archibald, Nigel Milsom’s Judo House Part 6 (The White Bird) – main image – is a portrait of the showman barrister, Charles Waterstreet was widely predicted, as was the runner-up Mitch Cairns’ angular portrait of artist Peter Powditch. There were several reasons for this.\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\nFirst, the Archibald is – in essence – not an art prize but a celebration of the personalities who define Australia, and especially Sydney. Waterstreet, the flamboyant inspiration for the ABC television series Rake, has to be a front runner on those grounds alone.\n\nIn addition, Milsom was the winner of the 2013 Moran Prize – and a convicted criminal – all of which makes good copy. The Archibald is, above all things, about media coverage.\n\nThe other guide to the winner comes from the hanging. In the 1950s and 60s the Gallery director, Hal Missingham, used to write the telegrams for the winner before the judging. The Trustees were furious with him, but he had their measure.\n\nFor the 33 years of Edmund Capon’s directorship it became very easy to work out which work was most likely to win. For well over a week before the final judging, the winner would be hanging in the central court on one of the long walls – either opposite where the announcement would be made, or adjacent to it.\n\nThe Director always chose the location.\n\nUnder the terms of JF Archibald’s will, the prize must be judged by the Trustees. Since the rise of curators and professional gallery directors, only a few trustees are artists, but the current crop include some extremely knowledgeable collectors and art patrons.\n\nThe lighter and livelier exhibition is a reflection of their broad understanding that the Archibald exists to celebrate portraiture and people, not to elevate the status of the artists.\n\n© the artist. Photograph courtesy of AGSNW, Mim Sterling\n\nFor me, the most impressive painting that was hung in the “winning room” this year is still Kerry McInnis’s Omar Musa, the poetry of unease – a muted study of one of this coming generation’s most interesting writers.\n\nThe Archibald rules\n\nOne of the unspoken rules for hanging the Archibald, and the reason for the primacy of the central room, is the need to create a space for television cameras to film from a relative distance before zooming on the detail, the artist and the subject.\n\nJust outside the favoured room the curator has installed what is probably the most unusual painting to enter the Archibald.\n\nPaul Ryan has previously been exhibited, but this year’s Thirteen Noahs easily outdoes his previous efforts.\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\nIt is a compilation of paintings of the character actor Noah Taylor, based on different images, some distorted, each superimposed on discarded artworks – including a tapestry and ping pong bats. Taylor has inserted himself in such a wide range of characters on film and television that it makes sense for him to appear as a part of the scenery with kitsch naked ladies, landscapes and a dog. It might not have been awarded the prize, but it is easily the most exciting work in the show.\n\nThe dead and the famous\n\nThere are sub-themes in the exhibition.\n\nTwo portraits of the recently dead could not provide a greater contrast.\n\nJohn Beard has painted Bill Wright, the much loved curator, director and artist as pale ghost seen through a veil of striped primary colours. It is a celebration of his life and his values.\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\nPeter Churcher has painted his mother, Betty Churcher, on her deathbed as a slack jawed empty shell with just a flicker of life in one eye. I can understand the impulse that led the artist to paint her as she faded from life, but this work needs a more sensitive context than the boisterous Archibald.\n\nMore than almost anyone I knew, Betty Churcher was very conscious of her public image.\n\nIn her last interview with Leigh Sales she went to an enormous effort to look immaculate, because she was speaking to her legacy.\n\nAnother surprising disappointment is Shaun Gladwell’s monochrome portrait of Mark Donaldson VC, where a skull crashes onto the subject’s helmeted head.\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\nGladwell’s style here is deliberately reminiscent of action hero comic books, and it does not quite work in this context.\n\nTianli Zu also uses monochrome (plus a burst of lurid green shoes) for his portrait of Edmund Capon, “Edmund, your Twomblys are behind you”, a reference to Capon’s most distinguished acquisition for the Gallery’s collection.\n\nHe has chosen to give the former director an especially gnarled face, which contrasts with the stylishly painted building.\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\nIf it were dependant on subject matter, the clear winners would have been portraits of artists and people working in the arts.\n\nFilippa Buttitta has painted the much loved Judy Cassab while Tom Carment has a self portrait of his own ageing face.\n\nRodney Pople, an Archibald regular, has painted Frannie Hopkirk, Brett Whiteley’s sister looking bug-eyed, while former National Portrait Gallery director Andrew Sayers has a portrait of Tim Bonyhady but manages to give him an expression that looks a bit like Sayers himself.\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\nPerhaps the selection of so many people from the arts is a retreat from the current abysmal state of Australian politics – the only politicians included are those mad mavericks, Bob Katter and Cory Bernardi – neither with works that are especially memorable.\n\nThere is a sign of a better world with Sally Ross’s very sweet portrait of documentary film maker Eva Orner, which hangs adjacent to Guy Morgan’s portrait of Louise Voigt, the CEO of Barnardo’s Australia.\n\nThe Wynne Prize, also judged by the Trustees, is often overlooked in the annual festival of faces. Mostly that neglect is justified, but this year the Trustees have reached out and given the prize to a young Melbourne artist Natasha Bieniek.\n\nI get the impression that, having done their duty by the public and paid homage to the sheer exuberant sensationalism of the Archibald, the Trustees have collectively released their inner aesthete and indulged in supporting both quality and the coming generation. As Guido Belgiorno-Nettis says, judging these prizes is “absolutely the most fun thing”.\n\n\n\nSee also:\n\nCongratulations Natasha Bieniek, but the Wynne Prize is deeply flawed\n\n\n\nThe Archibald Prize exhibition will show at the Art Gallery of NSW from July 18 - September 27. More details here\n\nSee the rest of the Archibald Prize Finalist portraits here:\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\n© the artist - photograph courtesy of © AGNSW, Felicity Jenkins\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins\n\n© the artist - photograph courtesy of © AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photgraph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling.\n\n© the artist, photograph courtesy of AGNSW, Mim Sterling.\n\n© the artist, photograph courtesy of AGNSW, Mim Sterling.\n\n© the artist, photograph courtesy of AGNSW, Mim Sterling.\n\n© the artist, photograph courtesy of AGNSW, Felicity Jenkins.\n\n© the artist, photograph courtesy of AGNSW, Mim Sterling.\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling\n\n© the artist, photgraph courtesy of AGNSW, Jenni Carter\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling.\n\n© the artist, photgraph courtesy of AGNSW, Mim Sterling."}, {"url": "https://limelightmagazine.com.au/news/2015-archibald-wynne-and-sulman-prize-winners-announced/", "page_content": "Paintings by Nigel Milsom, Natasha Bieniek and Jason Phu awarded the 2015 Prizes.\n\n\n\nNewcastle artist Nigel Milsom has been announced as the winner of the 2015 Archibald Prize ($100,000) for his portrait of Charles Waterstreet, a barrister whom the artist has previously employed but has known since birth. Titled Judo house pt 6 (the white bird) , Waterstreet is depicted as a gaunt, decrepit figure, with almost-geometrically angular facial features, gazing downwards and out of the frame. While the top of the work’s backdrop places its figure in front of a set of dark grey drapes, the Renaissance technique of chiaroscuro is used to full effect in the lower quadrants, with the muted tones of the angular and elongated fingers strongly contrasted against a consuming darkness.\n\n\n\nJudo house pt 6 (the white bird) by Charles Waterstreet\n\nAlso presented yesterday were the winners of the Art Gallery of New South Wales’ Wynne ($50,000) and Sulman ($40,000) Prizes. For the “best landscape painting of Australian scenery,” Accademia d’Arte-trained Melbourne-based artist Natasha Bieniek was named the winner. Her work, Biophilia, which measures in at only 81-sqaure centimetres..."}, {"url": "https://www.theguardian.com/artanddesign/2013/oct/24/nigel-milsom-wins-art-prize", "page_content": "A painter jailed for holding up a Sydney convenience store has won Australia's richest art prize.\n\nNigel Milsom was awarded the $150,000 Doug Moran National Portrait Prize for his work, Uncle Paddy, in Sydney on Wednesday.\n\nThe prize was collected on Milsom's behalf by Kerry Crowley of the Yuill Crowley Gallery in Sydney, which represents Milsom. She said he would be \"thrilled\" at news of the win.\n\nJudge Daniel Thomas said fellow judge Ben Quilty knew Milsom and described him as a sweet, gentle person.\n\nThomas, a leading figure in the Australian art scene, said he didn't mind awarding such a handsome sum to a prison inmate, given the supreme quality of Milsom's work and the positive effect the prize could have on his life.\n\n\"Even someone who has gotten into some state of punishment for whatever he did could come good,\" he said. \"So that's how I reconciled myself with Milsom getting that money.\"\n\nMilsom's Uncle Paddy portrait features cubist-like brush strokes in his subject's face, which soften in his shirt.\n\nMilsom's Uncle Paddy portrait employs cubist-like brush strokes. Photograph: Evans Media\n\n\"He has an extraordinarily refined technique, the brushwork, so smooth, so delicate,\" Thomas said.\n\nHe said he admired the imagery in the portrait even more than the technique.\n\n\"It's a very old-fashioned Australian face,\" Thomas said.\n\nUpon entering for the prize artists had to provide a description of their work. In his statement, Milsom wrote that his portrait was of his grandfather's friend Paddy, who used to have beers with him at a NSW leagues club every Saturday night.\n\nPaddy was one of the few non-family members to attend Milsom's grandfather's funeral.\n\n\"I knew that Paddy's Saturday nights would never be the same,\" Milsom said. \"There is a quiet sadness about Paddy that seems to stem from the realisation that death will be visiting him soon, too. When I painted his portrait I got a sense that he has learnt to sit with this feeling of sadness, which has given him a greater strength and wisdom.\"\n\nPhotographer and filmmaker John Janson-Moore took out the $50,000 Moran Contemporary Photographic Prize for his work Nyirripi Girl With Finger."}, {"url": "https://www.unsw.edu.au/news/2015/07/a-d-grads-win-2015-archibald---sulman-prizes", "page_content": "Congratulations to Master of Fine Arts graduate Nigel Milsom, who has been announced as the winner of the prestigious Archibald Prize 2015.\n\nMilsom won the $100,000 prize for his portrait of barrister Charles Waterstreet, titled Judo house pt 6 (the white bird). Milsom forged a bond with Waterstreet who represented him in court in 2012. Waterstreet is the co-creator of the ABC TV series Rake, which is loosely based on his professional and personal life.\n\nThe Archibald Prize is awarded annually to the best portrait, 'preferentially of some man or woman distinguished in art, letters, science or politics, painted by any artist resident in Australasia’.\n\nDean of UNSW Art & Design, Professor Ross Harley said \"We are thrilled for Nigel. The Archibald brings contemporary art into living rooms across the country and is one of the most high profile cultural awards made annually. Over the past 3 sucessive years, UNSW Art & Design students and alumni have been recognised by winning the Archibald Prize and we congratulate each of the finalists and participants in these prestigious exhibitions.\"\n\nOther UNSW A&D alumni who were selected as finalists for the 2015 Archibald Prize include; Tony Costa, Filippa Buttita, Tony Curran, Tim Gregory, Nigel Milsom, and Shaun Gladwell.\n\nBachelor of Fine Arts graduate Jason Phu was announced the winner of The Sir John Sulman Prize for his work I was at yum cha when in rolled the three severed heads of Buddha: Fear, Malice and Death.\n\nThe $40,000 Sulman is awarded to the best subject painting, genre painting or mural project by an Australian artist. Phu had the honour of being a finalist in both the Archibald and the Sulman Prizes.\n\nPhu’s bold ink works explore his heritage as a Chinese-Australian born to parents who lived through the Cultural Revolution and Vietnam War. His Sulman piece, I was at yum cha when in rolled the three severed heads of Buddha: Fear, Malice and Death, flips the peaceful, calming symbology of Buddha into something “quirky, stupid and hateful” and contrasts it with yum cha, which he describes as a quintessentially Australian rite. More.\n\nAlumni Jasper Knight, Noel McKenna, Stephen Ormandy and post graduate student and 2014 Archibald winner Fiona Lowry were also finalists in The Sulman Prize.\n\nMaster of Fine Arts graduate Viola Dominello was a finalist in the Wynne Prize and was awarded the John & Elizabeth Newham Pring Memorial Prize for the best watercolour by a woman artist.\n\nThe Wynne Prize finalists included A&D graduates Celia Morgan, Louis Pratt, Aida Tomescu and Karl de Waal.\n\nThe Archibald, Wynne and Sulman Prize finalists’ exhibition is on at the Art Gallery of New South Wales 18 July – 27 September, 2015."}, {"url": "https://www.broadsheet.com.au/sydney/art-and-design/article/nigel-milsom-wins-2015-archibald-prize", "page_content": "It was a relationship forged behind bars that led to artist and former inmate Nigel Milsom asking criminal barrister Charles Waterstreet if he could paint his portrait. Waterstreet agreed and now the portrait, Judo house pt 6 (the white bird) has been named the winner of the 2015 Archibald Prize. Accepting his award at the Art Gallery of New South Wales, a clearly humbled Milsom says Waterstreet was responsible for restoring his faith in the legal system.\n\nIn 2012, Milsom was sentenced to a maximum of six years in jail for armed robbery. He was serving that sentence in Cessnock Correctional Centre when he was awarded the $150,000 Doug Moran National Portrait Prize in 2013, before being released mid-last year.\n\nSpeaking before a large crowd of media, fellow Archibald finalists and Waterstreet himself, Milsom dedicated the award to his family and friends, thanking them and Waterstreet for supporting him during such trying times. “My relationship with Charlie started to become fairly serious when he represented me in court,” Milsom says. “The painting is about when you’re in that particular situation, all your faith is placed into another human being and in some ways they become almost mythical in your imagination.” Milsom’s oil on linen portrait is the largest of the 47 Archibald finalists, and depicts Waterstreet as a giant, almost fabulous figure complete with skeletal hands emerging from the dark background. “It’s Charlie reaching out to say, ‘I’m here to help’,” Milsom says, describing the portrait as, “An attempt to depict him as a giant; part-man part-mythical creature, with hands that appear otherworldly.”"}, {"url": "https://www.artshub.com.au/news/news/artshubs-2022-archibald-wynne-and-sulman-predictions-2548516/", "page_content": "Every year we take a stab at a bit of crystal ball gazing across the crop of finalists for the prestigious Archibald, Wynne and Sulman Prizes.\n\nThis year 115 finalists will vie for Australia’s top prizes, with 58 entries by men, 54 by women (a literal flip of those gender stats for last year), and in a first, one non-binary artist recorded and two collaboration.\n\nThis year, 816 entries were received for the 2022 Archibald Prize (down on last year which received 938 entries), with 52 making it into the finalist cut. The record stands with 1,068 entries set in 2020.\n\nWith 20 entries by Aboriginal artists – the highest known in the prize’s history – a trend logged also in this year’s Sulman Prize with a high of 19 Aboriginal artist entries this year, we see the results of the past years encouraging confidence in our First Nations artists to apply.\n\nOverall the Sulman Prize received 491 entries (again also down from 546 last year) with 29 finalists. It will be judged this year by artist Joan Ross. Meanwhile, the Wynne marched in with 601 entries, almost on par with last year, with 34 finalists making this week’s cut.\n\nFor those of you who love gambling odds, that is a 6% chance of being selected as a finalist.\n\nRead: Does being an Archibald finalist help?\n\nWe often label these exhibitions as predictable – a pool of the usual suspects – but with 69% first timers for the Sulman, 50% for the Wynne and 27% for the Archi’, it would dispel popular belief.\n\nPacking room winner gets it rolling\n\nOn 5 May, Sydney-based artist Claus Stangl has won this year’s Archibald Packing Room Prize with a 3D-style portrait of Academy Award-winning and Emmy-nominated New Zealand writer, director and actor Taika Waititi.\n\nStangl, a self-taught artist who was born in England, said he wanted ‘to execute it in a playful cinematic style, reminiscent of the movies of the seventies and eighties that were popular when he was child.’\n\nStangl captured Waititi during a sitting with the award-winning director while he was in Sydney making the upcoming Thor: Love and Thunder (released on July 8) which he wrote, directed and portrayed Korg.\n\nIt is the fourth time Stangl has entered the Archibald Prize and the second time he has been a finalist.\n\nThe Packing Room Prize is a $3,000 cash prize judged by the Art Gallery staff who receive, unpack and hang the entries, including head packer Brett Cuthbertson, who holds 52% of the vote.\n\n‘It’s the first time I’ve seen a 3D painting come in, but it’s kind of a fake 3D …I’m very happy this is my last Packing Room Prize choice. I think people wouldn’t have expected me to pick this one, I usually pick more realistic-style portraits, so it’s nice to go off with a bang!’ said Cuthbertson.\n\nThis year he retires as head packer from the Gallery after 41 years.\n\nOur prediction for the 2022 Archibald Prize\n\nLewis Miller, Deborah Conway, 2022 Archibald Prize Finalist, AGNSW. Image supplied.\n\nWho: Lewis Miller\n\nWhat: Deborah Conway\n\nWhy: I was really torn on this one between Lewis Miller’s painting of Deborah Conway and Robert Hannaford’s stunning self portrait Hirsute self-portrait. Hannaford has been an Archibald finalist on 26 previous occasions – eight of those self-portraits – and winning the People’s Choice three times. Is this his time?\n\nPerhaps due, but I think the collective mindset at the moment globally is not for celebrating a white male of Hannaford’s generation (b.1944) – despite how good his painting might be.\n\nThis is not said to discredit Miller’s painting in any way (who, we might also add, is a male of the same vintage b.1959); the difference here is the celebration of the strength and resilience of a female performer.\n\nThe last two years performing artists have had a hell of a time, thanks to the pandemic, and it is also a time that the sector has reframed gender balance. It is laudable that despite the difficulties of the time, the two worked on this piece only with live sittings. There is a confidence that comes across in its casual pose, sketchy style and framing, that only veterans like Conway and Miller can muster with ease. It is gracefully uncomplicated.\n\nMiller has been an Archibald finalist on 17 previous occasions, and won the prize in 1998 with a portrait of artist Allan Mitelman.\n\nArtsHub Highly Commends:\n\nOther portraits delivered this year that we feel were worthy of mention – and have a serious go at the running – are: Ann Cape’s painting of artist Euan Macleod titled, Walking a tightrope; Robert Malherbe’s painting of his wife, an award-winning motion graphics designer, titled Dana, head in hands, which he says was influenced by Edvard Munch’s 1893 painting The scream; and Laura Jones’ painting of Brooke Boney, a Gamilaroi woman from Muswellbrook, NSW, and the first Indigenous presenter in the history of Australian breakfast television, with her dog Jimmy.\n\nPast Archibald winner Fiona Lowry (who won with a portrait of Penelope Seidler in 2014) returns with another architectural connection, and a solid painting with a portrait of Glenn Murcutt, but our guess not 2022’s winner.\n\nAnd, we also want to pay a nod to Natasha Walsh’s self-portrait that riffs off Brett Whiteley’s much loved 1976 Archibald-winning work Self-portrait in the studio; she won the 2018 Brett Whiteley Travelling Art Scholarship at the age of 24. Perhaps a runner for the People’s Choice?\n\nThe past winners have been:\n\nPeter Wegner’s portrait of Guy Warren at 100 (2021);\n\nWestern Arrernte artist, Vincent Namatjira with his painting, Stand strong for who you are, a portrait of Adam Goodes, and first Aboriginal artist to win (2020);\n\nTony Costa with a portrait of former Art Gallery of NSW (AGNSW) Trustee Lindy Lee (2019);\n\nYvette Coppersmith with Self-portrait, after George Lambert (2018);\n\nMitch with a portrait of artist wife Agatha Gothe-Snape (2017);\n\nLouise Hearman with a portrait of Barry [Humphries] (2016) – a first time entrant;\n\nNigel Milsom’s painting Judo house part 6 (the white bird) – a portrait of Milsom’s barrister Charles Waterstreet (2015);\n\nFiona Lowry’s portrait of art patron Penelope Seidler (2014);\n\nView the Archibald Prize 2022 finalists.\n\nJuz Kitson, An unwavering truth. She walks in beauty, of the night and all that’s best of dark and bright. In memory of the wildfires, 2022 Wynne Prize Finalist, AGNSW. Image supplied.\n\nOur predictions for the 2022 Wynne Prize\n\nWho: Juz Kitson\n\nWhat: An unwavering truth. She walks in beauty, of the night and all that’s best of dark and bright. In memory of the wildfires\n\nWhy: For me the Wynne felt a natural pick this year. For the past six years we have witnessed the prize being awarded to First Nations artists. While it has been important to rebalance the prize with this Indigenous lens, a short stand out this year is a new work by ceramic-based artist Juz Kitson.\n\nKitson has a built a reputation for extending the medium, her technically exquisite pieces also offering a strong conceptual foundation, drawing our reactions and emotions of the viewer when encountering her work.\n\nThis work (with its very long title) ‘reflects on the opposing themes of vulnerability and strength, and an undeniable tension after raging wildfires devastated the south coast of Australia and the landscape around my home and studio,’ Kitson explained.\n\nIt captures ‘the beauty of the dark trees vitrified by fire, despite the charred remains that lay like ruins,’ adding that the porcelain elements appear ‘to bristle as if in fight or flight, prompting the audience to acknowledge the entanglements between humans and nature.’\n\nArtsHub Highly Commends:\n\nA super smart work by hyper-real artist Sam Leach, titled Machine-assisted memory of Harewood Farm, Meadows, blends family history and childhood memories with artificial intelligence modelling, geology and thoughts on how we contruct notions of place.\n\nA further standout work, also taking its cue from the bushfires and legacies of wilderness protection and activism, is a collaborative work by Wona Bae and Charlie Lawler, titled Franklin River valley, lutruwita/Tasmania (topographic relief).\n\nWe also want to give a nod to Dean Cross’ Untitled (landscape painting in the 21st century) and the inclusion of two further ceramics pieces this year by Judith Pungarta and Hayley Panangka.\n\nThe past winners have been:\n\nNyapanyapa Yunupiŋu, Garak – night sky (2021);\n\nHubert Pareroultja for his painting Tjoritja (West MacDonnell Rangers, NT) (2020);\n\nSylvia Ken with her painting Seven Sisters (2019);\n\nYukultji Napangati in 2018;\n\nBetty Kuntiwa Pumani won the prize in 2017;\n\nThe Ken Family Collaborative (which also included Sylvia Ken) and their painting Seven Sisters in 2016;\n\nNatasha Bieniek’s tiny hyper-real painting won in 2015;\n\nMichael Johnson’s expansive abstraction in 2014;\n\nAnd for two years running, the Wynne was awarded to Imants Tillers (2013 and 2012).\n\nView the Wynne Prize 2022 finalists.\n\nOur prediction for the 2022 Sulman Prize\n\nSophie Victoria, The spectacle, 2022 Sulman Prize Finalist, AGNSW. Image supplied.\n\nWho: Sophie Victoria\n\nWhat: The spectacle\n\nWhy: Always a funky one due to its broad category (awarded for the best subject painting, genre painting or mural project), we feel that Sophie Victoria’s The spectacle is a great fit – ambitious, fresh, and materially engaged.\n\nVictoria explains that the title, The spectacle, references Guy Debord’s 1967 book La société du spectacle (The society of the spectacle), in which he offers a critique of contemporary consumerism and commodity fetishism.\n\nShe has wrapped the painting with iridescent material used for fashion items, such as bags, clothes and shoes – luscious eye candy that snags the viewer. It transforms the work into a hyperreal object that sits somewhere between the history of painting and the history of consumerism. One is deliciously caught in its theatrics and light play, and in doing so questions the ‘idealised filters that permeate our image culture.’\n\nArtsHub Highly Commends:\n\nIt was a tough call on the Sulman this year with an incredible work by Danie Mellor vying for the accolade. In After the end of the world, two men carry ancestral remains past the watchful eyes of colonial settlers. When you think of the Sulman as a prize that speaks to subject and genre painting this is a smart entry.\n\nThe painting is located against a backdrop of Rainforest Country in North Queensland, where Mellor’s Aboriginal family comes from. In the painting the men persist with ceremony and ritual despite the desecration around them – a message for our times. It is a moving narrative and strong painting to boot!\n\nAlso deserving of a nod this year is Will Cooke with the digital print, As one door closes, another opens – a twist pairing an actual site-specific public artwork with its concept abstraction; and Brodie Cullen’s A gronk’s grace for its desire to ‘interfere with traditional frameworks of painting’, by stretching an old salvaged mattress.\n\nThe past winners have been:\n\nGeorgia Spain’s fleshy painting Getting down or falling up (2021);\n\nFilipino-Australian Marikit Santiago won with a family portrait The divine (2020);\n\nMcLean Edwards with his quirky painting The first girl that knocked on his door (2019);\n\nAboriginal artist Kaylene Whiskey (2018);\n\nJoan Ross’ Oh history, you lied to me (2017);\n\nA domestic interior by Esther Stewart (2016);\n\nJason Phu’s ink on paper which looked at his Chinese heritage (2015);\n\nAndrew Sullivan’s quirky hyper-real fantasy T-rex (tyrant lizard king) (2014)\n\nView the Sulman Prize 2022 finalists.\n\nThe winners of the Archibald, Wynne and Sulman Prizes will be announced Friday, 13 May.\n\nFinalists in all Prizes will be exhibited at the Art Gallery of NSW from 14 May to 28 August 2022."}, {"url": "https://newsroom.unsw.edu.au/news/art-architecture-design/unsw-graduate-nigel-milsom-wins-archibald-prize", "page_content": "Nigel Milsom’s gothic portrait of Sydney barrister Charles Waterstreet has won the 2015 Archibald prize, the third consecutive year of success for UNSW Art & Design in one of Australia’s most prestigious portrait competitions.\n\nNigel Milsom’s gothic portrait of Sydney barrister Charles Waterstreet has won the 2015 Archibald prize, the third consecutive year of success for UNSW Art & Design in one of Australia’s most prestigious portrait competitions.\n\nMilsom, who graduated from UNSW with a Bachelor and Master of Fine Arts, said he was shocked to receive the $100,000 prize for his work of Waterstreet, who represented him in court and became what he described as a “mythical kind of saviour”.\n\n“So much hinged on what he had to say and do, and it’s a painting that’s really sort of showing him as a giant in my life at the time,” said Milsom of the winning work Judo house pt 6 (the white bird).\n\n“It’s a picture that to me represents a kind of dependence.”\n\nMilsom said he was drawn to Waterstreet’s complexity and otherworldly feel, likening the features of the iconic co-creator and inspiration behind the ABC series Rake to those of a scarecrow or insect.\n\nIt is the third year in a row that a UNSW Art & Design student or graduate has been successful in the Archibald.\n\nMaster of Fine Arts student Fiona Lowry won in 2014 for her ethereal portrait of the architect Penelope Seidler, and graduate Del Kathryn Barton received the prize in 2013 for her painting of actor Hugo Weaving – her second Archibald nod.\n\nDean of UNSW Art & Design Professor Ross Harley congratulated Milsom on the honour.\n\n“We are thrilled for Nigel. The Archibald brings contemporary art into living rooms across the country and is one of the most high profile cultural awards made annually,” Harley said.\n\n“Over the past three years UNSW Art & Design students and alumni have been recognised by winning the Archibald prize and we congratulate each of the finalists and participants.”\n\nUNSW also shone in the Sir John Sulman prize, with graduate Jason Phu’s I was at yum cha when in rolled three severed heads of Buddha: Fear, Malice and Death winning the award for the best subject painting, genre painting or mural project by an Australian artist.\n\nPhu was a finalist in both the Sulman and Archibald prizes. His irreverent ink and calligraphy work draws on the tensions inherent in his Chinese-Australian upbringing.\n\nMaster of Fine Arts graduate Viola Dominello won the John & Elizabeth Newham Pring Memorial Prize for best watercolour by a woman artist.\n\nSix UNSW alumni were named in the field of 47 finalists in this year’s Archibald prize and five were in the running for the Sulman.\n\nThe Archibald, Wynne and Sulman Prize finalists’ exhibition is on at the Art Gallery of New South Wales from 18 July to 27 September."}, {"url": "https://theconversation.com/from-gum-trees-to-cities-to-sweeping-deserts-how-125-years-of-the-wynne-prize-traces-australias-shifting-relationship-to-our-landscape-179764", "page_content": "It is fair to say that Richard Wynne, who died in 1895, would not recognise many recent entries in the art prize that he endowed with £1,000 to reward a “landscape painting of Australian scenery”.\n\nSince 1999, when Gloria Tamerre Petyarre was awarded the Wynne Prize for her magical sequence of Leaves, the Wynne has been dominated by works by Indigenous artists living in communities in central and northern Australia.\n\nRather than inhibiting artists from different traditions, the presence of such superb art appears to have inspired non-Indigenous artists to also be their best. It is therefore well worth a visit to see the full range of entries in the Art Gallery of NSW’s annual festival of prizes.\n\nNot all appreciate this liberation of landscape. In 2017, the veteran Australian artist John Olsen attacked the awarding of the Wynne Prize to Betty Kuntiwa Pumani for Antara, a painting of her mother’s Country.\n\nHe claimed the “real” Australian landscape tradition was represented by artists such as Elioth Gruner and Brett Whiteley, while Pumani’s painting was of “a cloud cuckoo land”.\n\nFrom memory this may have been the year that the gallery changed the design of the exhibition spaces so that the most exciting Wynne entries – almost all by Indigenous artists – filled the large central court.\n\nAs a young man in the 1950s, Olsen had demonstrated against the reactionary conservatism of the Trustees of the Art Gallery of NSW; in his old age he objected to their openness to new ideas.\n\nBoth Olsen’s pomposity and the dreariness of an Australian landscape tradition that colonises the land was mocked by Abdul Abdullah in his painting A Terrible Burden, a Wynne finalist in 2019.\n\nCourtesy of the Artist and Yavuz Gallery’\n\nAbdullah has expressed surprise at Olsen’s strident defence of the conservative tradition of Australian landscape as his own paintings are so abstract, although he tells me “his cultural contribution doesn’t hold a flame to Ken Done, who is very good at painting ‘place’.”\n\nRead more: 'I think Archie would be pleased': 100 years of our most famous portrait prize and my almost 50 years watching it evolve\n\nOrigins of the prize\n\nAs with its more famous partner competition, the Archibald Prize, the Wynne is not quite what its benefactor envisaged.\n\nRichard Wynne’s will originally designated the Art Society of NSW as the body to administer the prize, not the Art Gallery of NSW. In 1895, shortly after Wynne’s death, the Art Society experienced an acrimonious split when a number of artists led by Tom Roberts and Julian Ashton established a rival body, The Society of Artists.\n\nBy the time the prize was first awarded in 1897 the executors, Perpetual Trustees, decided it was more prudent to have it administered by the Art Gallery than a group of squabbling artists.\n\nArt Gallery of New South Wales\n\nThe tensions between artists is perhaps one reason why for many years there was no formal exhibition of entries. Walter Withers was awarded the first prize in 1897 for a painting that had already been bought by the Art Gallery. As he wrote to the Argus:\n\nI was unaware that such a prize existed until I read the telegram in your issue of November 24, announcing the honour that had been done to my work.\n\nA search through both the National Library’s Trove and the Art Gallery of NSW’s digital archive shows that, as with all art prizes judged by a committee, on many occasions considerations other than merit influenced the judges’ decisions.\n\nIn 1898 the Trustees began the practice of both visiting Art Society exhibitions and inviting interested artists to deposit their offerings for consideration. This was also the first year the prize was awarded to William Lister Lister, a stalwart of the Art Society (later renamed the Royal Art Society of NSW). He was awarded the prize a total of seven times.\n\nArt Gallery of New South Wales\n\nWith the exception of the 1898 award, Lister Lister was a trustee and therefore a judge on each of the other six times he won. He was not alone in this.\n\nSydney Long, a fellow trustee and fellow member of the Royal Art Society, was awarded the Wynne in 1938 and 1940. The only artist to be awarded the Wynne more often than Lister Lister was the South Australian, Hans Heysen, who was awarded the prize eight times. Heysen, from South Australia, exhibited with the Society of Artists.\n\n© C Heysen\n\nFor many years, it is fair to say many of the decisions governing the Art Gallery of NSW were a fine balance between two competing factions, with each taking it in turn to award the various prizes to their members and supporters.\n\nIn 1899, the young George Lambert, associated with the Society of Artists, was awarded the Wynne for his heroic painting of horses ploughing through mud, Across the Black Soil Plains. He was also awarded the NSW Government’s newly established Travelling Art Scholarship, a recognition of his precocious talent.\n\nArt Gallery of New South Wales\n\nThe eccentric nature of the management of the prize led to the situation in 1921 when the Trustees commissioned Elioth Gruner to paint The Valley of the Tweed, with the prize as a part of the commission.\n\nThe cosy duopoly of the art societies was challenged in 1943 after William Lister Lister’s sudden death.\n\nInstead of replacing him with another representative of the Royal Art Society, the minister for education, Clive Evatt, appointed his sister-in-law, the collector and painter of modern art, Mary Alice Evatt, to be the first woman trustee in the gallery’s history.\n\nIn January 1944, Evatt advocated for William Dobell’s portrait of Joshua Smith to win the Archibald Prize. The following year she voted for the Wynne to go to Sali Herman’s urban landscape, McElhone Stairs, a painting with a complete absence of gum trees, painted by a Jewish immigrant who exhibited with the Contemporary Art Society.\n\nThe Wynne continued to reward interesting paintings when Russell Drysdale won with Sofala (1947), and Lloyd Rees for The Harbour from McMahon’s Point(1950).\n\nA changeable landscape\n\nBy the early 1960s, the old exhibiting societies were less relevant to artists trying to establish a career. But the new dealer galleries understood the value of prizes to their artists’ profiles.\n\nThe new superstars of Australian art, John Olsen, Fred Williams and Brett Whiteley, began to be listed as prize winners.\n\nThe Wynne was still very much a “boy’s club”, as if the Australian landscape could only be captured by one gender. Lorna Nimmo had won in 1941, but her watercolours did not appeal to the Trustees.\n\nIt took until 1971 for Margaret Woodward to be the next woman winner, with her painting, Karri Country.\n\nShe was followed in 1994 with Suzanne Archer’s Waratah Wedderburn.\n\n(While the prize is most well known for its landscapes, figurative sculptures can also enter, and Rosemary Madigan had won with her classic stone torso in 1986.)\n\nCourtesy of the artist\n\nAnn Thomson was awarded the 1998 prize with her abstract painting, Yellow Sound, which may have encouraged the Trustees to cast their net wider. For the following year the Wynne Prize was awarded to Gloria Tamerre Petyarre.\n\nThis bastion of the Australian landscape tradition was never the same again.\n\nEasily the most memorable painting to be awarded the Wynne in recent years was in 2016, when the Ken family collaborative painted Seven Sisters, the grand narrative of protecting country.\n\nCourtesy of the Artists, Tjala Arts and Jan Murphy Gallery\n\nAlthough some non-Aboriginal artists have won this century, Aboriginal art continues to dominate. The gallery now also hosts the Roberts Family prize, specifically for work by Indigenous artists.\n\nWhat we are seeing here in this oldest, and potentially crustiest of art prizes, is concrete evidence of a whole new tradition of Australian art – or rather evidence that the oldest tradition is using art as a means to reclaim the land.\n\nRead more: Australians' favourites show Aboriginal art can transcend social divisions and art boundaries"}, {"url": "https://theconversation.com/europe/topics/archibald-prize-2696", "page_content": "© the artist, image © Art Gallery of New South Wales, Jenni Carter April 28, 2023 From joyous celebration to the depths of grief: the new orthodoxy of the Archibald prize is there is no orthodoxy The Archibald Prize and the Royal Easter Show have a great deal in common. Both are enjoyed by the general public, but the entrants in the competitions are very serious about winning.\n\nState Library NSW April 13, 2023 From radical to reactionary: the achievements and legacy of the influential artist John Olsen Some of the media response to the death of John Olsen has been to proclaim the late artist as a ‘genius’. He was more complex than that.\n\n© the artist, image © AGNSW, Mim Stirling May 13, 2022 ‘I can’t think of a more timely painting’: Blak Douglas’s Moby Dickens is a deserving winner of the 2022 Archibald Prize This year’s winning Archibald Prize portrait, Moby Dickens by Blak Douglas, encapsulates the justifiable rage felt by people living in flooded Bundjalung country\n\n© the artist, image © AGNSW, Mim Stirling May 6, 2022 The Archibald 2022 finalists: sitters speaking up to power; artists speaking back to the canon Under the cloud of an election, this year’s Archibald prize is mercifully a politician-free zone. However the artists do have issues …\n\nAGNSW/Peter Wegner/Photo Jenni Carter June 4, 2021 Peter Wegner’s portrait of Guy Warren at 100 wins the 100th Archibald Prize In its centenary year, the Trustees of the Art Gallery of New South Wales could not resist the symbolism of awarding the Archibald Prize to Peter Werner’s portrait of the 100 year old Guy Warren.\n\n© Estate of Clifton Pugh June 2, 2021 ‘I think Archie would be pleased’: 100 years of our most famous portrait prize and my almost 50 years watching it evolve It’s 100 years since the Art Gallery of NSW first held the Archibald Prize. Though loathed by some critics, it is an annual snapshot of the kind of society we are, and who our heroes might be.\n\nPhoto: AGNSW/Mim Stirling September 28, 2020 At last, the arts Revolution — Archibald winners flag the end of white male dominance For the first time in its 99 year-history, the Archibald Prize has been won by an Indigenous painter. The Wynne and Sulman Prize winners also signal a time of change.\n\nPhoto: AGNSW, Felicity Jenkins Sitter: Dujuan Hoosen - documentary star ('In my blood it runs') September 17, 2020 ‘The most refreshing Archibald exhibition I can remember’: the 2020 portrait prize finalists Most years, the Archibald exhibition is worth viewing as an amusing exercise in social history. This year it is worth seeing for the art.\n\nPhoto: AGNSW, Felicity Jenkins Sitter: Lindy Lee - artist May 10, 2019 The zen of portraiture: Tony Costa wins the 2019 Archibald Prize The annual announcement of the Archibald Prize is one of Sydney’s great spectacles. This year’s winning portrait depicts one of Australia’s leading artists, Lindy Lee.\n\nPhoto: AGNSW, Jenni Carter Sitter: Benjamin Law - author, journalist and broadcaster May 3, 2019 Puckish charm and no politicians: the 2019 Archibald Prize Perhaps as a reflection of the current state of national affairs, this year’s Archibald Prize exhibition is a politician-free zone.\n\nNational Portrait Gallery, Canberra Purchased 1999 © Lou Klepac February 28, 2019 Friday essay: Nora Heysen, more than her father’s daughter Nora Heysen was the first woman to be awarded the Archibald Prize, but for most of her life she was defined not by her art, but by her relationship to her famous father, the artist Hans Heysen.\n\n© the artist Photo: AGNSW, Felicity Jenkins May 4, 2018 The 2018 Archibald, Sulman and Wynne prizes show a changing of the guard The lively reconfiguring of the Archibald, Wynne and Sulman exhibitions means it is harder to work out which paintings the judges are considering as potential winners.\n\n© the artist Photo: Felicity Jenkins, AGNSW July 23, 2017 Politics of landscape: the 2017 Wynne Prize finalists The standard of the 2017 Wynne finalists is as haphazard as previous years, hampered by a sense of tokenism and conventional landscapes, but works by Napanyapa Yunupingu and Juz Kitson stand out.\n\n© the artist Photo: Jenni Carter, AGNSW July 21, 2017 The Archibald finalists – and why Tony Albert deserves to win The packers’ favourite has gained prominence and there are few portraits of politicians in this year’s popular art prize. The stand out work is a deceptively innocent re-appropriation of Aboriginal kitsch.\n\nPhoto: © AGNSW, Nick Kreisler July 15, 2016 A very serious painting of Barry Humphries is a welcome prize winner This year’s Archibald Prize winner is a painting with great affection for its subject. Louise Hearman’s Barry was a surprise choice – but it deserves to find an ultimate home in the National Portrait Gallery.\n\nDetail of Michael McWilliams The usurpers (self-portrait) © Michael McWilliams Photo: © AGNSW, Nick Kreisler July 8, 2016 Patchwork, ironic, serious and kitsch: the best of the Archibald finalists The Archibald Prize is a curious beast – an art prize judged mostly by philanthropists. Despite this, there are plenty of finalists worth considering.\n\n© Nigel Milsom, photgraph courtesy of AGNSW, Mim Sterling July 17, 2015 Nigel Milsom wins the Archibald, our ‘most fun’ festival of faces Nigel Milsom has won the 2015 Archibald Prize for his portrait of barrister Charles Waterstreet. It’s clear the regime of the Archibald Prize is quickly, and positively, shifting."}]}