{"Bane has toured extensively throughout the United States, Europe, and Japan.": [{"url": "https://www.equalvision.com/artists/bane/", "page_content": "The bittersweet final album comes nearly twenty years after Bane’s first release, which led the band on countless tours and earned them widespread respect for being one of the hardest working bands in the business. Since their inception in 1995, Bane has toured all across the world countless times and has released three full-length albums: 1999’s It All Comes Down To This, 2001’s Give Blood, and 2005’s The Note, in addition to several 7”, EP and compilation releases.\n\nLongtime Equal Vision Records’ band Bane has released their fourth and final full-length album, Don’t Wait Up, on May 13, 2014. The album was recorded in Haverhill, MA with producer Jay Maas (Defeater, Bane).\n\nLongtime Equal Vision Records’ band Bane has released their fourth and final full-length album, Don’t Wait Up, on May 13, 2014. The album was recorded in Haverhill, MA with producer Jay Maas (Defeater, Bane).\n\nThe bittersweet final album comes nearly twenty years after Bane’s first release, which led the band on countless tours and earned them widespread respect for being one of the hardest working bands in the business. Since their inception in 1995, Bane has toured all across the world countless times and has released three full-length albums: 1999’s It All Comes Down To This, 2001’s Give Blood, and 2005’s The Note, in addition to several 7”, EP and compilation releases.\n\nBane recently headlined in support of the album on a US tour this Spring, featuring support from Turnstile and Take Offense. Despite being the band’s final album, they will continue to tour heavily in 2015, with US dates announced with the likes of Axis and Eternal Sleep, and a massive Europe/UK run with Comeback Kid.\n\n“I can’t believe we did it…but we did it. To me it means, we’re leaving,” shares vocalist Aaron Bedard of the new album in the band’s recent behind-the-scenes video. “This is us with our jackets on, our hair is clean and we’re walking out the door and we look back at our loved ones and we’re like…don’t wait up…we’re going to be out late tonight.”"}, {"url": "http://www.pamelaz.com/pzbios.html", "page_content": "PAMELA Z\n\nbio\n\nrésumé | bio (500 words) | short bio (250 words) | shorter bio (100 words) | home | contact | notes on Pamela Z's name\n\nPamela Z long bio (500 words)\n\nPamela Z is a composer/performer and media artist working with voice, live electronic processing, sampled sound, and video. A pioneer of live digital looping techniques, she processes her voice in real time to create dense, complex sonic layers. Her solo works combine experimental extended vocal techniques, operatic bel canto, found objects, text, and sampled concrète sounds. She uses MAX MSP and Isadora software on a MacBook Pro along with custom MIDI controllers that allow her to manipulate sound and image with physical gestures. Her performances range in scale from small concerts in galleries to large-scale multi-media works in theaters and concert halls. In addition to her performances, she has a growing body of installation works using multi-channel sound and video.\n\nPamela Z has toured extensively throughout the United States, Europe, and Japan – performing in international festivals and venues including Bang on a Can at Lincoln Center (NY); La Biennale di Venezia; San Francisco Symphony’s SoundBox, the Japan Interlink Festival; Other Minds (San Francisco); and Pina Bausch Tanztheater's Festival (Wuppertal, Germany). She has received commissions to compose live and fixed-media scores for choreographers and film/video artists. Her large-scale, performance works, including Memory Trace, Baggage Allowance, Voci, and Gaijin, have been presented at venues like the Kitchen in New York, Yerba Buena Center for the Arts, Theater Artaud (Z Space) in San Francisco, the Museum of Contemporary Art in Chicago, as well as at theaters in Washington D.C. and Budapest. Her one-act opera Wunderkabinet inspired by the Museum of Jurassic Technology (co-composed with Matthew Brubeck) premiered at The LAB in San Francisco, and was presented at REDCAT in LA and Open Ears Festival in Canada. She has shown work in exhibitions at the Whitney Museum (New York); Savvy Contemporary (Berlin); the Tang Museum (Saratoga Springs NY); the Dakar Biennale (Sénégal); Krannert Art Museum (IL), and the Kitchen (NY).\n\nMs. Z has received commissions from chamber ensembles including Kronos Quartet, Eighth Blackbird, Bang On A Can All Stars; Ethel, Del Sol Quartet, California E.A.R. Unit; Left Coast Chamber Ensemble; and Empyrean Ensemble. She recently composed a work for soprano Julia Bullock and the San Francisco Symphony. She has collaborated with a wide range of artists including Joan La Barbara, Joan Jeanrenaud, Brenda Way (ODC Dance), Miya Masaoka, Jeanne Finley + John Muse, Shinichi Iova Koga (Inkboat), and Luciano Chessa. She has participated in New Music Theatre’s John Cage festivals, and has performed with The San Francisco Contemporary Music Players.\n\nPamela Z is the recipient of many honors and awards including the Rome Prize, Foundation for Contemporary Arts Dorothea Tanning Award, American Academy of Arts and Letters Award, United States Artists Fellowship, the Guggenheim Fellowship, the Doris Duke Artist Impact Award, a Robert Rauschenberg Foundation residency, the Herb Alpert Award in the Arts; the Creative Capital Fund; the MAP Fund, the ASCAP Music Award; an Ars Electronica honorable mention; and the NEA Japan/US Friendship Commission Fellowship. She holds a music degree from the University of Colorado at Boulder. For more information visit: www.pamelaz.com\n\nPamela Z short bio (250 words)\n\nrésumé | bio (500 words) | short (250 words) | shorter (100 words) | home | contact | notes on Pamela Z's name\n\nPamela Z is a composer/performer and media artist working primarily with voice, live electronics, sampled sound, and video. A pioneer of live looping, she processes her voice to create complex sonic layers. Her solo works combine experimental extended vocal techniques, operatic bel canto, found objects, text, digital processing, and wireless MIDI controllers that allow her to manipulate sound with physical gestures. In addition to her solo work, she has been commissioned to compose scores for dance, theatre, film, and chamber ensembles including Kronos Quartet, Eighth Blackbird, the Bang on a Can All Stars, Julia Bullock with SF Symphony, and the LA Philharmonic New Music Group. Her interdisciplinary performances have been presented at venues including The Kitchen (NY), Yerba Buena Center for the Arts (SF), REDCAT (LA), and MCA (Chicago), and her installations have been presented at such exhibition spaces as the Whitney (NY), Savvy Contemporary (Berlin), and the Krannert (IL). Pamela Z has toured extensively throughout the US, Europe, and Japan. She has performed in numerous festivals including Bang on a Can (NY), Interlink (Japan), Other Minds (San Francisco), La Biennale di Venezia (Italy), Dak’Art (Sénégal) and Pina Bausch Tanztheater Festival (Wuppertal). She’s a recipient of numerous awards including the Rome Prize, Foundation for Contemporary Arts Dorothea Tanning Award, United States Artists, Robert Rauschenberg Foundation, the Guggenheim, Doris Duke Artist Impact Award, Herb Alpert Award, an Ars Electronica honorable mention, and the American Academy of Arts and Letters Award. She holds a music degree from the University of Colorado, Boulder. www.pamelaz.com\n\nPamela Z shorter bio (100 words)\n\nrésumé | bio (500 words) | short (250 words) | shorter (100 words) | home | contact | notes on Pamela Z's name\n\nPamela Z is a composer/performer and media artist making works for voice, electronics, samples, gesture activated MIDI controllers, and video. She has toured throughout the US, Europe, and Japan. Her work has been presented at venues and exhibitions including Bang on a Can (NY), the Japan Interlink Festival, Other Minds (SF), and the Venice Biennale, and the Dakar Biennale. She has composed scores for dance, film, and chamber ensembles (including Kronos Quartet and Eighth Blackbird). Her awards include the Rome Prize, Foundation for Contemporary Arts Dorothea Tanning Award, the Guggenheim, American Academy of Arts and Letters, and Robert Rauschenberg Foundation. www.pamelaz.com\n\nrésumé | bio (500 words) | short (250 words) | shorter (100 words) | home | contact | notes on Pamela Z's name\n\nNotes on Pamela Z's Name:\n\nPamela Z's full, legal name is Pamela Z (first name Pamela, last name Z), and should be treated thusly in print.\n\nPamela Z is not a \"stage name\" or alias, and she doesn't go by any other name.\n\nThere is no punctuation following the Z (as it is a not an initial letter of a longer name; it is her entire last name).\n\nWhen listed in a table of contents or index where other names are alphabetized by last name, her name should appear under Z (not P) as Z is her last name, not a middle initial or appendage of her first name.\n\nrésumé | bio (500 words) | short (250 words) | shorter (100 words) | home | contact | notes on Pamela Z's name\n\n\n\n"}, {"url": "https://www.yellowjackets.com/the-band/dane-alderson", "page_content": "In 2001, at the age of 18, backed by James Muller and Scott Lambie, he achieved 3rd place at the National Australian Jazz Bass Awards, held at the Wangaratta Jazz Festival, where he also performed with the critically acclaimed jazz/fusion band ‘K’ featuring Andrew Fisenden, Grant Windsor & Graeme Blevins. In 2002, he won the James Morrison Scholarship, and also completed his Bachelor of Music (Jazz Performance) degree at the West Australian Academy of Performing Arts, where he studied with some of Australia’s finest musicians including Graeme Lyall, Ray Walker, Chris Tarr and Paul Pooley. He was also a member of the West Australian Youth Jazz Orchestra Composers Ensemble for two years, under the direction of Graeme Lyall.\n\n+ Read More\n\nDane performs regularly throughout Europe & Australia with James Morrison’s group ‘On The Edge’. He was also featured on James’ album ‘On The Edge’ which was recorded live at the Sydney Opera House. Dane was one of the founding members of the award winning & internationally acclaimed Perth group ‘Void’ which consists of Tom O’Halloran on keys, Troy Roberts on sax & Andrew Fisenden on drums. The band has toured throughout the United States & Europe and released the self titled studio album ‘Void’ in ’06. In August 2010, Dane was the solo support act for one of the most innovative & highly respected electric bassists of our time, Victor Wooten, during his Masterclass tour of Australia. Dane has also toured extensively throughout Asia with the Melbourne based fusion group ‘Logic’ featuring Ben Vanderwal on drums, Glenn Cannon on guitar and Tim Wilson on sax.\n\nWith various bands and ensembles, Dane has performed at many festivals such as: the Hong Kong Jazz Festival, the Jarasum Jazz Festival, the Java Jazz Festival, the Beishan Jazz Festival, Melbourne International festival, the Burghausen Jazz Festival, the Aalen Jazz Festival, Perth International Arts Festival, the Beijing Jazz Festival, the Fremantle International Jazz Festival, the Joy of Jazz Festival Johannesburg and many more.\n\nDane performs regularly with the West Australian Symphony Orchestra, the Tasmanian Symphony Orchestra and the BBC Concert Orchestra and highly acclaimed musicians such as Stanley Jordan, Jamie Oehlers, Joe Chindamo, Matthew Jodrell, Ben Vanderwal, Tim Jago, Paul Bollenback, John D’Earth, Carter Beauford, Butch Taylor, Robert Jospe, Randy Johnson, Kate Ceberano, Emma Pask, Jeremy Gregory, Dave Samuels, Victor Wooten, Michael Manring, Simon Stockhausen and James Muller. As of April 2015, Dane has been touring, performing and recording with the internationally renowned and multiple Grammy Award winning jazz/fusion band ‘The Yellowjackets’ featuring Bob Mintzer on sax, Russell Ferrante on piano and Will Kennedy on the drums. The band currently has an extensive international touring schedule and will be releasing a brand new album titled ‘Cohearance’ in April 2016."}, {"url": "https://steinhardt.nyu.edu/people/stephanie-baer", "page_content": "Stephanie Baer, Director of String Studies, Professor of Viola and Professor of Chamber Music at NYU, has been an active member of the New York musical community for many years. A widely experienced chamber musiciain, Ms. Baer has toured extensively throughout Europe, Asia and Africa. She is presently a member of the \"Metamorphosis\" Piano Quartet. Ms. Baer has toured throughout the United States as a member of the Arioso Ensemble, has been principal violist and chamber soloist at the Carmel Bach Festival where she performed on Baroque and modern viola, and has performed at the Mostly Mozart, the Monadnock and the White Mountains Festivals.\n\n\n\nMs. Baer is a former member of \"New Music Today\" and has been a guest artist with The Group for Contemporary Music, the Steve Reich Ensemble and \"Meet the Moderns\". She has recorded with such artists as Philip Glass, John Adams, Steve Reich and The Modern Jazz Quartet. Ms. Baer is currently principal violist for the Broadway show \"The Phantom of the Opera\", is a member of the Orchestra of St. Luke's, the Mostly Mozart Festival Orchestra and the New York Chamber Symphony. She is a former principal violist of the New Jersey Symphony and has performed with Orpheus, the New York City Ballet, the New York City Opera, the Brooklyn Philharmonic and many other ensembles in the New York area. Ms. Baer has been on the faculties of Bard College, Vassar College and the Conservatory of Music of Brooklyn College. Ms. Baer holds B.M. and M.M. degrees from the Mannes College of Music and a Diploma of Honor from the Academia Chigiana, Siena, Italy. She is also a recipient of the prestigious C.B. Jackson Master's Award for Musical Excellence from the Berkshire Music Festival, Tanglewood. Her teachers include William Primrose, Dorothy Delay, Michael Tree, Bruno Giuranna, Joyce Robbins, Karen Tuttle and Karen Ritscher. She has coached chamber music with members of the Juilliard and Guarneri Quartets as well as with Felix Galimir."}, {"url": "https://www.panonthenet.com/tnt/bios/bands/phase2-bio.htm", "page_content": "tap/click for bio\n\nPHASE II PAN GROOVE, celebrating forty-seven years in 2019, was formed in August 1972 by a small group of innovative musicians, out of Starlift Steel Orchestra, who were seeking to produce a more creative sound on pan, by experimenting not only with different types of music, but also with the combined effects of contemporary instruments and pan. The original founding members were Len “Boogsie” Sharpe, Barry Howard, Andy Phillips, Selwyn Tarradath, Noel Seon and Rawle Mitchell.\n\nUndoubtedly, the most distinguishing feature about Phase II Pan Groove is the fact that, from its inception, the bold decision was taken to promote the performing of original compositions in steelband competitions, earlier pioneered by Ray Holman. In keeping with this policy, the band consistently elected to perform pieces specifically composed and arranged for the instrument, by its charismatic leader and Musical Director Len “Boogsie” Sharpe.\n\nDespite this calculated disadvantage, Phase II, after an initial period of non-acceptance, was able to gain some recognition as from 1977, when the band captured its first North Zonal title, and thereafter emerged as Champions of the North for a then unprecedented four consecutive years (1986-1989), eventually creating history in 1987 by becoming the first unsponsored band to win the national Panorama competition, as well as the first band to do so performing its own tune. This feat was repeated in 1988, and from that year, the band has very rarely placed lower than in the top three positions, including its most recent national titles in 2005, 2006, 2008, and this year, 2013.\n\nAt the Steelband Musical Festival, “Boogsie” has been dubbed the Mozart of Pan by foreign adjudicators, as his compositions have been able to stand alongside those of the great classical masters. This was evident at the Festival of 1986, when the band captured third place, performing “Dance of the Douens” composed by “Boogsie.”\n\nOver the years Phase II has toured extensively throughout North America, the Caribbean, Europe, South Africa and Japan, and had the distinction of being part of the cultural contingent that accompanied our Soca Worriers to the Football World Cup in Germany 2006. Its virtuoso Musical Director, generally regarded as the world’s premier panist, along with his acknowledged genius as a composer and arranger, has toured extensively around the world as a solo artist, sharing stages with some of the world’s greatest jazz musicians, including legendary jazz drummer Max Roach. He has been inducted as an honorary distinguished fellow of the University of Trinidad and Tobago where he now teaches musical improvisation, and was awarded the Chaconia Silver Medal in 1988 and the Humming Bird Medal Gold at the 2009 awards ceremony, for his contribution to the art form.\n\nClick for more on Phase II Pan Groove\n\nPhase II in Pictures - 2014\n\nChampion Years - 1987, 1988, 2005, 2006, 2008, 2013, 2014\n\nVideo Performances - 2013, 2008, 2006, 2005, 1988, 1987\n\nPhase II Arranger 2013 - 2019 - 2020 - Len “Boogsie” Sharpe\n\nManager: Errol Skerritt\n\nAdditional info below posted with special permission from the BestOfTrinidad.com by Ronald C. Emrit - check link for updates"}, {"url": "https://www.lonnieholley.com/blog/2018/1/26/bio", "page_content": "Lonnie Holley (born 1950; Birmingham, Alabama)\n\nSince 1979, Holley has devoted his life to the practice of improvisational creativity. His art and music, born out of struggle, hardship, but perhaps more importantly, out of furious curiosity and biological necessity, has manifested itself in drawing, painting, sculpture, photography, performance, music, and filmmaking. Holley’s sculptures are constructed from found materials in the oldest tradition of African American sculpture. Objects, already imbued with cultural and artistic metaphor, are combined into narrative sculptures that commemorate places, people, and events. His work is now in collections of major museums throughout the world (The Museums of Fine Arts, San Francisco; The Metropolitan Museum of Art; The Philadelphia Museum of Art; The Smithsonian American Art Museum; The National Gallery of Art, Washington, DC, and many others), on permanent display in the United Nations, and been displayed in the White House Rose Garden.\n\nHolley did not start making and performing music in a studio nor does his creative process mirror that of the typical musician. His music and lyrics are improvised on the spot and morph and evolve with every event, concert, and recording. In Holley’s original art environment, he would construct and deconstruct his visual works, repurposing their elements for new pieces. This often led to the transfer of individual narratives into the new work creating a cumulative composite image that has depth and purpose beyond its original singular meaning. The layers of sound in Holley’s music, likewise, are the result of decades of evolving experimentation.\n\nHolley has released five critically acclaimed albums––Just Before Music, 2012; Keeping a Record of It, 2013; MITH, 2018; National Freedom, 2020; Broken Mirror: A Selfie Reflection (with Matthew E. White), 2021. His sixth album, Oh Me Oh My, produced by Jacknife Lee, which includes collaborations with Bon Iver, Michael Stipe (REM), Moor Mother, Sharon Van Etten, and Rokia Koné, comes out March 10, 2023, on Jagjaguwar.\n\nHe has toured extensively throughout the United States, Europe, Brazil, Australia, and New Zealand, and shared stages with Bon Iver, Animal Collective, Deerhunter, Bill Callahan, Saul Williams, Tinariwen, Daniel Lanois, and many others.\n\nHe has also experimented with film, photography, and video throughout his career. His directorial debut, the short narrative film I Snuck Off the Slave Ship, premiered at the 2019 Sundance Film Festival.\n\nThe 2023 podcast, Unreformed: The Story of the Alabama Industrial School for Negro Children, follows the history of the infamous reform school in Alabama (which many refer to as a “slave camp for kids”) and profiles Holley’s early life and the struggles he and so many others suffered at the hands of the state of Alabama.\n\nIn 2022 Holley was named a USA Artist Fellow. His visual art is represented by Blum & Poe Gallery (Los Angeles) and Edel Assanti Gallery (London). He continues to make art and music from his home and studio in Atlanta, Georgia."}, {"url": "https://www.mundotish.com/about", "page_content": "Tish Hinojosa is a Mexican-American Singer Songwriter born in San Antonio Texas and living most recently in Austin, Texas. She is the youngest of 13 children born to two Mexican immigrants who, as stated in her song “West Side of Town,” “made a good life the hard way…”\n\nHer songs blend the genres of country, folk and Hispanic music in a way that can only be described as a musical melting pot; unique and insightful. She sings and writes in Spanish and English and has many bilingual songs, including a full album of children’s songs that has often been used by teachers as a tool for teaching the Spanish language. The Chicago Tribune put it succinctly “Simply put, Hinojosa is a first-class songwriter.”\n\nHinojosa started playing guitar and singing in her early years of high school at 14. She was influenced by her Mexican parents’ kitchen radio with its eclectic Latino programming, her older sisters sixties records and the seventies folk rock she grew up with. By the time she started college she was playing gigs at local coffee houses and student gatherings on campus.\n\nIn 1979 she was invited to sing at the Kerrville Folk Festival, but was also required to present some original songs. Even though she had never written before, she won the New Folk Songwriters contest that year and launched her career as a writer.\n\nTish moved to Northern New Mexico in 1979, to follow her friends and mentors Bill and Bonnie Hearne where she learned about country music and gathered experience as a singer, a writer, a band leader as well as a back-up singer for fellow Texan Michael Martin Murphey.\n\nIn New Mexico she also met her former husband, Craig Barker and decided to try her hand at singing and songwriting in Nashville. While there, she worked as a demo singer for Mel Tillis’ publishing company alongside legendary songwriter and producer Buddy Cannon. She had her first child Adam, in Nashville in 1984.\n\nAfter a couple of years on the Nashville scene Hinojosa and her young family decided that “Music Row” wasn’t the right answer and returned to New Mexico, where she gave birth to her second child, Maria (Nina) in 1987. They eventually decided to relocate to Austin, Texas where there was a growing and vibrant “Alternative Country” music scene.\n\nJust after the move to Texas, Tish decided to give Nashville one final shot. She drove all night with her babies and a niece in the car for help and moral support and presented some of her original songs at a songwriters showcase at the famed Bluebird Café.\n\nAfter the session she was approached by an A&M record executive with the coveted words, “I like what I heard.” A few months later she was signed by her first major record label (A&M) and her national and international career were on their way. She released her first studio album Homeland the next year.\n\nThis album met with great success and ultimately one of the songs “Adonde Voy,” was covered by Linda Ronstadt. It became a multi-platinum release in Korea for Tish.\n\nHer songs have been covered by other artists; she has written and worked with, Peter Rowan, Joan Baez, Chris Hillman, Booker T. Jones, Kris Kristofferson and Pete Seeger.\n\nHinojosa’s music catalog now includes 14 studio albums as well as live albums and retrospectives. She has played at the White House for President and Mrs. Bill Clinton and at The Texas Governor’s mansion for then Governor George W. Bush. She was inducted into the Texas Songwriters Association Music Legends Hall of Fame in 2018. She was awarded membership to The Texas Institute of Letters, as only the second songwriter ever to be given the honor of membership, in 2019.\n\nThroughout her career Tish has contributed her talent to numerous causes such as bilingual education, immigration, and farm workers rights. She continues in these endeavors today.\n\nHinojosa has toured extensively throughout the United States, North America, Europe and Korea in her 40 plus year career. She moved to Hamburg, Germany in 2005 where she gained a greater appreciation of European city life and the deep history and culture of that continent. She returned to Austin in 2013.\n\nShe now splits her time between Austin, Texas and Tubac, Arizona with her husband Lynn, and loves being “Abuelita” to her 4 grandchildren ranging from 13 years to 16 months (with number 5 on the way).\n\nCurrently Tish is ramping up her solo career and tour dates after an 18-month hiatus due to COVID. She also continues to play and write with her Latina music trio The Texicana Mamas, (launched in 2018) who released their first album in 2020, amid the pandemic. Coincidentally, their initial gig was played at the Bluebird Café; they have since played at The Kennedy Center in Washington, DC in early 2020 (just pre-pandemic) and will grace the stage at the Grand Ole Opry in Nashville in September 2021. They are slated to headline at the Kerrville Folk Festival in October of this year (2021). This group will tour together as soon as conditions allow.\n\n\"Simply put, Hinojosa is a first class songwriter\"\n\n- CHICAGO TRIBUNE -"}, {"url": "https://www.translateen.com/sentence/toured-in-sentence-examples/", "page_content": "\"Toured\"\n\n(1) The president toured a factory.\n\n(2) The senator toured the factory.\n\n(3) The governor toured the disaster area.\n\n(4) The mayor toured the new community center.\n\n(5) The ballet company toured all over the world.\n\n(6) Kazutoshi's band has toured around the world.\n\n(7) The legislator toured a new hospital facility.\n\n(8) The councilors toured the new community center.\n\n(9) The assemblyman toured the new hospital facility.\n\n(10) The admasses of visitors toured the historic site.\n\nSentence For \"Toured\"\n\n(11) The backsplit home we toured had a beautiful backyard.\n\n(12) The contemporary dance company toured internationally.\n\n(13) The Ataris have toured extensively throughout the world.\n\n(14) The student ambassador greeted me as I toured the campus.\n\n(15) The diplomat toured a cultural landmark in the host country.\n\n(16) I virtually toured a college campus before deciding to apply.\n\n(17) The sprawling campus spread below us as we toured the university.\n\n(18) I virtually toured a college campus to see if I wanted to attend.\n\n(19) I played the guitar in a band, and we toured all over the country.\n\n(20) Buffalo Bill's Wild West show toured the United States and Europe.\n\n\"Toured\" In A Sentence\n\n(21) The cabinet minister toured a factory to learn about job creation.\n\n(22) McFly has toured extensively throughout the UK and internationally.\n\n(23) The ambassador toured the city, and he was impressed by its beauty.\n\n(24) Eisley has toured with bands such as Coldplay and Taking Back Sunday.\n\n(25) The grandeur of the palace aroused awe in the visitors who toured it.\n\n(26) She played the drums in a band, and they toured all over the country.\n\n(27) The students were agog into awe as they toured the prestigious campus.\n\n(28) The band had previously toured with some of the biggest names in music.\n\n(29) Anna Pavlova toured extensively throughout Europe and the United States.\n\n(30) Voivod has toured extensively throughout North America, Europe, and Asia.\n\n\"Toured\" Sentence\n\n(31) The musician toured impecuniously for years before finally making it big.\n\n(32) The caravan of musicians toured the country performing at various venues.\n\n(33) The architecture of the building we toured was intriguing and innovative.\n\n(34) The affluent musician had a private recording studio and toured the world.\n\n(35) The caravan of musicians toured the country performing at different venues.\n\n(36) The musician toured nomadically, performing in different cities every night.\n\n(37) Buffalo Bill's Wild West show toured throughout the United States and Europe.\n\n(38) Many people know Buffalo Bill for his Wild West shows that toured the country.\n\n(39) The boss asked the new employee to walk behind with him as they toured the office.\n\n(40) The musician toured bicoastally, performing in venues from New York to California.\n\n\"Toured\" Sentence Examples\n\n(41) The governor toured the factory, and the workers were impressed with his knowledge.\n\n(42) The college students toured the firehouse as part of their community service project.\n\n(43) The embassadors of India toured a local university to learn about American education.\n\n(44) We toured the brewhouse and learned about the different types of hops used in brewing.\n\n(45) As we toured the city, the guide explained the significance of each monument and statue.\n\n(46) Inna is known for her energetic performances and has toured extensively around the world.\n\n(47) The students were advised to stay together as they toured the dangerous parts of the city.\n\n(48) The buyer toured several homes, and they finally found one that met all of their criteria.\n\n(49) The elite group of musicians toured the world, and their performances were always sold out.\n\n(50) As we toured the bastide's castle, we learned about the many battles that were fought there.\n\nSentence With \"Toured\"\n\n(51) As we toured the ancient ruins, the guide told us stories of the people who once lived there.\n\n(52) David is a musician in his midthirties, who has released several albums and toured internationally.\n\n(53) The buyer toured several homes, but they ultimately chose the one with the best layout and location.\n\n(54) Baillie is a talented musician who has released several albums and toured extensively throughout the UK.\n\n(55) The mayor toured the new hospital facility, and he praised the staff for their hard work and dedication.\n\n(56) As we toured the vineyards of Bordeaux, we learned about the different grape varieties used in winemaking.\n\n(57) The Governor General toured the historic site, and he learned about the rich cultural heritage of the country.\n\n(58) Although he was impecunious, Jack was a talented musician, and he played in a band that toured all over the country.\n\n(59) Even though they came from different backgrounds, they found a common love for dance, and formed a dance group that toured the world.\n\n(60) Copeland, who is a renowned musician, has released several albums and toured extensively, but he still finds time to mentor young artists.\n\nUse \"Toured\" In A Sentence\n\n(61) He is a professional musician who has toured the world with some of the biggest names in the industry, but he still finds time to teach music to underprivileged children.\n\n(62) What is the modern definition of \" Toured \"?\n\n(63) How to use \" Toured \" with Example Sentences.\n\n(64) If you had to explain to someone who was learning English what \" Toured \" is, what would you say?\n\n(65) Maybe it seems like a simple question, but the meaning of the word \" Toured \" can get slippery.\n\n(66) The best definition of \" Toured \" I’ve heard so far.\n\n(67) \" Toured \" - definition, pictures, pronunciation and usage note.\n\n(68) What is the best definition of \" Toured \"?\n\n(69) What is the definition of \" Toured \"?\n\n(70) What is \" Toured \"? detailed definition and meaning.\n\n(71) Use \" Toured \" in a sentence.\n\n(72) The word \" Toured \" in example sentences.\n\n(73) English sentences with audio using the word \" Toured \".\n\n(74) What is definition of \" Toured \" by Merriam-Webster.\n\n(75) \" Toured \" in a sentence (esp. good sentence like quote, proverb...).\n\n(76) How do you write a good sentence with \" Toured \"?\n\n(77) \" Toured \" sentence examples.\n\n(78) \" Toured \" in a sentence.\n\n(79) Here are 100 fantastic examples of sentences and phrases with the word \" Toured \".\n\n(80) How do you explain \" Toured \"?\n\n(81) What can I say instead of \" Toured \"?\n\n(82) What is a synonym for \" Toured \"?\n\n(83) What is a antonym for \" Toured \"?\n\n(84) What do you mean by \" Toured \"?\n\n(85) What is another word for \" Toured \"?\n\n(86) What is the best definition of \" Toured \"?\n\n(87) What is \" Toured \" definition and meaning?\n\n(88) How to use \" Toured \" in a sentence.\n\n(89) The word \" Toured \" in example sentences.\n\n(90) \" Toured \" meaning in English, \" Toured \" definitions.\n\n(91) Primary meanings of \" Toured \".\n\n(92) Full definitions of \" Toured \".\n\n(93) Full meaning of \" Toured \".\n\n(94) The word \" Toured \" in example sentences.\n\n(95) Best definition of \" Toured \".\n\n(96) Define \" Toured \" in one sentence, define \" Toured \" in one word.\n\n(97) What is the meaning of \" Toured \" in a sentence.\n\n(98) The word \" Toured \" in example sentences.\n\n(99) What is the origin and root of \" Toured \".\n\nLearning English Faster Through Complete Sentences With \"Toured\"\n\nSentences are everywhere.\n\nWithout sentences, language doesn’t really work.\n\nWhen you first started learning English, you may have memorized words such as English meaning of the word \"Toured\"; But now that you have a better understanding of the language, there’s a better way for you to learn meaning of \"Toured\" through sentence examples.\n\nTrue, there are still words that you don’t know. But if you learn whole sentences with \"Toured\", instead of the word \"Toured\" by itself, you can learn a lot faster!\n\nFocus Your English Learning On Sentences With \"Toured\".\n\nWhy Is Focusing on Sentences Important?\n\nSentences are more than just strings of words. They’re thoughts, ideas and stories. Just like letters build words, words build sentences. Sentences build language, and give it personality.\n\nAgain, without sentences, there’s no real communication. If you were only reading words right now, you wouldn’t be able to understand what I’m saying to you at all.\n\n- The Word \"Toured\" in Example Sentences.\n\n- \"Toured\" in a sentence.\n\n- How to use \"Toured\" in a sentence.\n\n- 10 examples of sentences \"Toured\".\n\n- 20 examples of simple sentences \"Toured\".\n\n\n\nAll the parts of speech in English are used to make sentences. All sentences include two parts: the subject and the verb (this is also known as the predicate). The subject is the person or thing that does something or that is described in the sentence. The verb is the action the person or thing takes or the description of the person or thing. If a sentence doesn’t have a subject and a verb, it is not a complete sentence (e.g., In the sentence “Went to bed,” we don’t know who went to bed).\n\nFour Types Of Sentence Structure.\n\nSimple Sentences With \"Toured\"\n\nA simple sentence with \"Toured\"contains a subject and a verb, and it may also have an object and modifiers. However, it contains only one independent clause.\n\nCompound Sentences With \"Toured\"\n\nA compound sentence with \"Toured\" contains at least two independent clauses. These two independent clauses can be combined with a comma and a coordinating conjunction or with a semicolon.\n\nComplex Sentences With \"Toured\"\n\nA complex sentence with \"Toured\" contains at least one independent clause and at least one dependent clause. Dependent clauses can refer to the subject (who, which) the sequence/time (since, while), or the causal elements (because, if) of the independent clause.\n\nCompound-Complex Sentences With \"Toured\"\n\nSentence types can also be combined. A compound-complex sentence with \"Toured\" contains at least two independent clauses and at least one dependent clause."}, {"url": "https://www.linguee.com/english-german/translation/a+has+toured+extensively.html", "page_content": "ffl ff, soprano, has toured extensively with Ensemble [...] Sequentia and appears on eight BMG/Deutsche Harmonia Mundi [...] recordings, including the Grammy-nominated Canticles of Ecstacy. toccataclassics.com toccataclassics.com ffl ff, soprEnsemble ffl ff, Sopran, hat ausführlich mit dem Ensemble [...] Sequentia konzertiert und ist auf acht BMG/deutsche harmonia mundi-Produktionen [...] zu hören, darunter auch den Grammy-nominierten Canticles of Ecstacy. toccataclassics.com toccataclassics.com ffl ffEnsemble\n\nBlackie is a regular guest at the Armagh [...] Pipers Club and has toured extensively with various [...] dance troupes in the USA, China, Taiwan [...] and Dubai, including a performance in Carnegie Hall in 1998! He has recently returned from a concert tour of Sweden and in November Michael will be guest artist at the Amnesty International Concert in Stockholm. ffmusik.de ffmusik.de Pipers Clubvarious Blackie ist regelmäßiger Gast des Armagh Pipers Club und [...] war mit verschiedenen irischen [...] Tanz-Projekten intensiv auf Tournee in Europa, den USA, China, [...] Taiwan und Dubai. 2008 war er [...] nicht nur für eine Konzerttournee in Schweden, sondern wurde auch noch für ein Gastspiel später im November für Amnesty International in Stockholm eingeladen. ffmusik.de ffmusik.de Tanz-Projekten iden USA, China,\n\nSince then he has toured extensively and given a lot [...] of concerts in Russia, where he played with the most famous orchestras [...] such as the Moscow Radio Symphony Orchestra with Vladimir Fedoseev, the State Symphony Orchestra with Evgeny Svetlanov, the St Petersburg Philharmonic Orchestra with Yuri Temirkanov and in other countries like Belgium, Germany, Italy, Spain, Great Britain, Switzerland, Poland, Austria, Malaysia, Turkey, Canada, the Czech Republic, Brazil, China, Japan, the Netherlands, France, etc. suavisartists.ch suavisartists.ch Since thegiven a lot Er tretet regelmässig in Russland mit renommierten [...] Orchestern auf - wie dem Moskau Radio-Sinfonie-Orchester unter Vladimir [...] Fedoseev, dem Staatlichen Sinfonie-Orchester unter Evgeny Svetlanov, dem Petersburger Philharmonischen Orchester unter Yuri Temirkanov, sowie bei Konzerten in anderen Ländern wie Belgien, Deutschland, Italien, Spanien, Grossbritannien, Schweiz, Polen, Österreich, Malaien, Türkei, Kanada, Tschechische Republik, Brasilien, China, Japan, Niederlanden, Frankreich, usw. suavisartists.ch suavisartists.ch in Russland mit renommierten\n\nHe has special relationships with many of the worlds leading Chamber Orchestras, in particular the [...] Academy of St Martins' in the [...] Fields, with whom he has toured extensively, Scottish Chamber Orchestra, [...] the City of London [...] Sinfonia, Camerata Salzburg, and the Swedish Chamber Orchestra. michael-collins.co.uk michael-collins.co.uk Fields, with whottish Chamber Orchestra, Besonders enge Beziehungen hat er mit vielen der weltweit führenden Kammerorchester, insbesonders der Academy of St. [...] Martin in the Fields, mit [...] diesem Orchester hat er unfangreiche Tourneen gemacht, dem Scottish [...] Chamber Orchestra, City of [...] London Sinfonia, Camerata Salzburg und dem Swedischen Kammer Orchester. michael-collins.co.uk michael-collins.co.uk diesemcottish\n\nChristoph Schoener has toured extensively, giving organ [...] concerts in many cathedrals and the major musical centres of Germany and Europe. christophschoener.de christophschoener.de Christoph Schoing organ Als Organist konzertierte Christoph Schoener in vielen [...] Kathedralen und Musikzentren Deutschlands und Europas. christophschoener.de christophschoener.de nist konzertierte Christoph Schoener in vielen\n\nShe studied singing in London, Hamburg, Berlin and Adelaide, and [...] has worked as a concert artist touring [...] Australia and Europe. She has toured extensively across Germany and [...] Switzerland. hilaryoneill.com hilaryoneill.com Australia and Europe.ss Germany and Sie hat in London, Hamburg, Berlin und Adelaide [...] Gesang studiert und hat ausgiebige Tourneen als Konzertmusikerin [...] durch Australien und Europa gegeben. hilaryoneill.com hilaryoneill.com Gesangusikerin\n\nApart from that, the [...] five musicians have toured extensively, appearing in [...] concerts all around Europe, with particularly [...] frequent visits to Germany, Italy, Austria (where the ensemble has been a regular feature of the Christmas and New Year concert seasons at Salzburg's Mozarteum ), Hungary, the Netherlands and Belgium. pbe.cz pbe.cz five musicearing in Die fünf Musiker geben Konzerte in einer Reihe europäischer [...] Länder, am häufigsten besuchen sie Deutschland, Italien, Ungarn, [...] Belgie, Niederlanden und Österreich (wo sie im Rahmen der Advent- und Neujahrskonzerte regelmässig im Salzburger Mozarteum auftreten). pbe.cz pbe.cz Die fünfe in einer Reihe europäischer\n\nHe has toured extensively with leading British Traditional Jazz bands, and made the move [...] to Karlsruhe, Germany, in 1982. noe-jazz.de noe-jazz.de leading British Traditional Jazz bands, and made the move Er hat lange mit führenden britischen Traditional Jazz Bands getourt und hat sich im Jahre [...] 1982 in Karlsruhe niedergelassen. noe-jazz.de noe-jazz.de nden britischen Traditional Jm Jahre\n\nUnder Franz Welser-Möst's direction, [...] the Orchestra has toured extensively, to critical [...] acclaim. kdschmid.co.uk kdschmid.co.uk the Orchecritical Unter Welser-Mösts Leitung unternahm das Cleveland [...] Orchestra zahlreiche von der Kritik gelobte Tourneen. kdschmid.co.uk kdschmid.co.uk Orchestra zahlreiche von der Kri\n\nFor the past ten years, SWDA has toured extensively on five continents. berliner-festspiele.de berliner-festspiele.de For the past ten years,ive continents. Seit zehn Jahren tourt die SWDA mit zahlreichen Gastspielen auf fünf Kontinenten. berliner-festspiele.de berliner-festspiele.de Seit zehhlf Kontinenten.\n\nSince 1978 Bauer has toured extensively, performing at international [...] festivals around the world from Abidjan to Zürich. sundropproductions.de sundropproductions.de Since 1978 Bforming at international Seit 1978 hat Stefan Bauer auf zahlreichen Tourneen gespielt, die ihn [...] auf Festivals rund um den Globus führten - von Abidjan bis Zürich. sundropproductions.de sundropproductions.de auf zadie ihn\n\nThe musicians have toured extensively in Canada, the [...] United States, Belgium, France, The Czech Republic and Germany. 2007.musikfests...elesanssouci.de 2007.musikfests...elesanssouci.de The musicanada, the Zahlreiche Tourneen führten die Musiker in den letzten [...] Jahren in die Vereinigten Staaten, nach Belgien, Frankreich, Tschechien und Deutschland. 2007.musikfests...elesanssouci.de 2007.musikfests...elesanssouci.de usiletzt\n\nAlready early in his career, Sebastian Tewinkel conducted numerous well-known orchestras, among them the Stuttgart Philharmonic Orchestra, the NDR Radio Philharmony Hannover, the Halle Philharmonic State Orchestra, the Sofia Symphony Orchestra and the Munich Chamber Orchestra. He has toured extensively throughout Europe, as well as Russia and Japan. swdko-pforzheim.de swdko-pforzheim.de Already early in his career, Sebastian Tewinkel conducted numerous well-known orchestras, among them the Stuttgart Philharmonic Orchestra, the NDR Radio Philharmony Hannover, the Halle Philharmonic State Orchestra, the Sofia Symphony Orchestra and the Munich Chamber Orchestraughout Europe, as well as Russia and Japan. Früh stand er bereits am Pult zahlreicher renommierter Orchester (Stuttgarter Philharmoniker, Radio-Philharmonie Hannover des NDR, Philharmonisches Staatsorchester Halle, Sinfonieorchester Sofia, Münchener Kammerorchester, Württembergisches Kammerorchester Heilbronn u.a.) und gastierte in vielen europäischen Ländern, Russland und Japan. swdko-pforzheim.de swdko-pforzheim.de Früh stand er bereits am Pult zahlreicher renommierter Orchester (Stuttgarter Philharmoniker, Radio-Philharmonie Hannover des NDR, Philharmonisches Staatsorchester Halle, Sinfonieorchester Sofia, Münchener Kammerorchester, Württembergisches Kammerorchester Heilbronn u.a.) und gastierte in vielen europäischen Ländern, Russland und Japan.\n\nThey have toured extensively together, concentrating on the sonatas of Mozart and Beethoven, but illuminating [...] these with [...] works by lesser known contemporaries such as Benda, Schobert and Vorisek. lindanicholson.co.uk lindanicholson.co.uk ther, concentrating on the sonatas of Mozart and Beethoven, but illuminating Auf ihren ausgedehnten Konzerttourneen konzentrierten die beiden Musiker sich vor allem auf die Sonaten [...] von Mozart und Beethoven, [...] ergänzten diese aber auch mit Werken unbekannterer Zeitgenossen, wie Benda, Schobert und Vorisek. lindanicholson.co.uk lindanicholson.co.uk Aurten die beiden Musiker sichdie Sonaten\n\nThe ensemble, which to its loyal fans is known as Coco, is not only popular [...] in Denmark but has also toured extensively at an international level. bookingculturum.dk bookingculturum.dk in Denmarkn international level. Das Ensemble, bei eingeschworenen Fans unter [...] dem Namen Coco\" bekannt, ist nicht nur in Dänemark [...] erfolgreich, sondern geht auch regelmäßig international auf [...] Tournée. bookingculturum.dk bookingculturum.dk erfolgreicional auf\n\nShe has toured the world extensively and worked with [...] Nat King Cole and Edith Piaf. cuba-erleben.de cuba-erleben.de worked with Sie hat die Welt lange bereist und unter anderem mit [...] Nat King Cole und Edith Piaf gearbeitet. cuba-erleben.de cuba-erleben.de anderem mit\n\nOutside Europe it has performed concerts at [...] many Japanese venues and has extensively toured the United States of [...] America. asops.cz asops.cz many Japanese venuesUnited States of Außerhalb von Europa konzertierte sie in vielen Städten [...] Japans und absolvierte eine ausgedehnte Tournee durch die Vereinigten [...] Staaten von Amerika. asops.cz asops.cz Japansereinigten\n\nElegant Machinery toured extensively during the mid 90's, and had a couple of chart climbers in [...] Sweden and several performances [...] on Swedish radio and television during the same period. protain.de protain.de Elegant Maching the mid 90's,uple of chart climbers in Mitte der 90ziger tourte Elegant Machinery in verschiedenen Ländern und hatte einige Chartplatzierungen [...] in Schweden sowie [...] Auftritte im Schwedischen Fernsehen und Radio. protain.de protain.de Mitery in verschiedenenplatzierungen\n\nIn addition, a [...] multimedia exhibition toured 13 cities in Germany, showing how the country's market leader in the lip care segment has developed from [...] the original version to the current product line. beiersdorf.com beiersdorf.com multimedia exhibiities in Germany, showing how the country's market leader in the lip care segloped from Eine multimediale Ausstellung, die durch 13 deutsche Städte tourte, präsentierte zudem die Entwicklung des deutschen Marktführers [...] in der Lippenpflege - vom Ur-Labello [...] bis zur aktuellen Produktlinie. beiersdorf.de beiersdorf.de Eine multimediale Ausstellung, die durch 13 deutte zudem die Entwicklung des deutschen Marktführers\n\nFrom 1991 to 2001 he was music director [...] of the Orchestre National de France, [...] with which he toured extensively on the five continents. [...] In 1996 he was appointed music [...] director of the NHK Symphony in Tokyo, with which he toured Europe, the United States, China, and Southeast Asia. kdschmid.co.uk kdschmid.co.uk with whiche five continents. Von 1991 bis 2001 war er Music Director [...] des Orchestre National de France, mit [...] dem er zahlreiche Konzertreisen auf den fünf Kontinenten [...] unternahm. 1996 ernannte man [...] ihn zum Music Director des NHK Symphony Orchestra in Tokio, mit dem er in Europa, den USA, China und Südostasien gastierte. kdschmid.co.uk kdschmid.co.uk dem er zahfünf Kontinenten\n\nSince that time she has undisputably become one of the best [...] in the world at her craft, and has toured through Europe, as well as North [...] and South America. ifet.de ifet.de in the world at her craft,ugh Europe, as well as North Inzwischen zählt sie unumstritten zu den [...] Weltbesten ihres Fachs, tourte schon durch Europa sowie Nord- und Südamerika. ifet.de ifet.de Weltbesteropa sowie No\n\nPascoal appeared at the renowned jazz festivals in [...] Montreux and Berlin and also toured extensively. intuition-music.com intuition-music.com Montreux and Berlin and Pascoal trat auf den einschlägigen Jazzfestivals in Montreux und Berlin [...] auf und absolvierte flächendeckende Tourneen. intuition-music.com intuition-music.com auf und\n\nTheir concept of performing has proven to be [...] successful in a wide variety of venues and settings as the band has extensively toured in North America, Europe and Asia from small clubs to big festival [...] stages and anything in between o-tonemusic.de o-tonemusic.de successful in a wide variety of venues and settings as theorth America, Europe and Asia from small clubs to big festival Das Konzept ihrer Auftritte hat sich als erfolgreich erwiesen an unterschiedlichen [...] Veranstaltungsorten da die Band [...] mittlerweile ausgiebig durch Nordamerika, Europa und Asien getourt ist, in kleinen Clubs, genauso wie auf riesigen Festivals haben sie schon gespielt [...] und in allem was dazwischen liegt. o-tonemusic.de o-tonemusic.de mittlordamerika, Euronen Clubs, genauso wie auf riesigeespielt\n\nsion has extensively discussed the [...] application of the Black List in the framework of the Working Group 'Irregularities [...] and Mutual Assistance - Agricultural Products' and is committed to presenting a second report to the European Parliament and to the Council containing a comprehensive assessment of the black list Regulation and suggested options for action. eur-lex.europa.eu eur-lex.europa.eu The Commisussed the ie Kommission hat die Anwendung der \"Schwarzen [...] Liste\" im Rahmen der Arbeitsgruppe \"Unregelmäßigkeiten und gegenseitige [...] Amtshilfe - landwirtschaftliche Erzeugnisse\" ausführlich erörtert und ist verpflichtet, dem Europäischen Parlament und dem Rat einen zweiten Bericht vorzulegen, der eine umfassende Bewertung der fraglichen Verordnung (Schwarze Liste) sowie die empfohlenen Optionen für ein Tätigwerden enthält. eur-lex.europa.eu eur-lex.europa.eu der \"Schwarzen\n\nAs set out in recitals 86 [...] to 109, the Commission has extensively examined whether GVG [...] (or any other railway undertaking [...] from another Member State) would have alternatives to renting traction from FS (Trenitalia) on the Italian segment of the planned passenger transport service between Basle and Milan. eur-lex.europa.eu eur-lex.europa.eu to 109, the Commisined whether GVG Wie in den Randnrn. [...] 86-109 ausgeführt, hat die Kommission eingehend geprüft, ob [...] der GVG (oder einem sonstigen Eisenbahnunternehmen [...] aus einem anderen Mitgliedstaat) für den Erhalt von Lokomotiven und Lokomotivführern Alternativen zur Miete von Traktionsleistungen von FS (Trenitalia) für die geplante Personenbeförderung zwischen Basel und Mailand zur Verfügung stehen. eur-lex.europa.eu eur-lex.europa.eu 86-109t, ob\n\nDuring the [...] recent years they have extensively toured from coast to [...] coast throughout the USA. wod.de wod.de recent yearscoast to In den letzten Jahren tourten sie von Küste zu Küste [...] durch die USA und gaben zahlreiche Konzerte. wod.de wod.de In den letztüste zu Küste\n\nHe played extensively Latin music and toured through countries like Indonesia, [...] Korea, Japan and the Caribbean. salsaholic.de salsaholic.de He pln musicugh countries like Indonesia, Er spielte ausgiebig lateinamerikanische Musik und tourte durch Länder wie [...] Indonesien, Korea, Japan und die Karibik. salsaholic.de salsaholic.de kanischr wie\n\nOps has toured numerous European countries (Austria, Germany, Switzerland, Great Britain, Belgium, the Netherlands, Croatia, Slovakia, Spain, Italy, Greece and Poland) and went several times to Japan, Brazil or Argentina. philharmonique-strasbourg.com philharmonique-strasbourg.com Therous European countries (Austria, Germany, Switzerland, Great Britain, Belgium, the Netherlands, Croatia, Slovakia, Spain, Italy, Greece and Poland) and went several times to Japan, Brazil or Argentina. philharmonique-strasbourg.com philharmonique-strasbourg.com Das Orchester gastierte in vielen europäischen Ländern (Österreich, Deutschland, Schweiz, Großbritannien, Belgien, Niederlande, Kroatien, Slowakei, Slowenien, Spanien, Italien, Griechenland, Polen) und mehrmals in Japan, Brasilien und Argentinien."}, {"url": "https://stanbush.com/biography/", "page_content": "Worldwide icon of melodic rock Stan Bush is best known for his song “The Touch,” made famous by Transformers: The Movie (1986). An anthem for Transformers fans around the world, “The Touch” was remixed in 2013 by High Moon Studios for their hit video game Transformers: Fall of Cybertron. It has also been featured on ABC’s The Goldbergs, NBC’s Chuck, FOX’s American Dad, in RBN’s Guitar Hero, Deep Silver’s Saints Row IV and in the motion picture Boogie Nights. In 2014, Stan was inducted into the Transformers Hall of Fame.\n\nDare To Dream is Stan Bush’s 14th studio album and is a modern masterpiece replete with the sweetness of nostalgia. The official release of the Dare To Dream album will be in November, 2020! The epic track “Born to Fight” is featured in the Autumn 2020 Netflix campaign celebrating their two most popular anime shows, BAKI and Kengan Ashura.\n\nThe Dare To Dream album also includes the hit single “The 80’s,” released in 2019 and supported by a popular music video. The title track, “Dare to Dream,” is about believing in yourself and letting go. There’s no limit to what we can do if we just “Dare to Dream.” Another great track, “The Times of Your Life” is about living life to the fullest and savoring every moment. These songs offer a positively-charged ray of hope in today’s troubled times. There are powerful ballads and memorable songs throughout this inspiring album.\n\n\n\nIn 2010, Stan Bush issued the audio gem Dream The Dream, and one of the music videos the album spawned, “Your Time,” became a viral hit on YouTube. Bush’s active involvement with social media channels like YouTube and Twitter keeps his ever-growing fanbase engaged, while he remains on top of his game musically. His first digital-only release, “Heat of the Battle,” was released for download at the end of 2010. Stan’s critically-acclaimed 2007 release In This Life was named “Album of the Year” by RockUnited.com! It features “Til All Are One,” the official theme of the global gathering of Transformers fans, BotCon."}]}