{"Bane is a hardcore punk band from Washington, D.C., formed in 1995.": [{"url": "https://www.nytimes.com/2023/06/06/arts/music/hardcore-music-diversity.html", "page_content": "Others struggled to find suitable role models. The Zulu drummer and vocalist Christine Cadette, 23, cited Paramore’s Hayley Williams as a key inspiration. “But also,” she said, “I couldn’t really relate because, at the end of the day, she’s a white cis female, so there’s not really any females that look like me doing exactly that.”\n\nScout Cartagena, who uses gender-neutral pronouns, reflected on the lack of diversity within the underground that inspired them to start Break Free Fest in 2017. “For a long time, it’s just been a struggle to see people on the stage who looked like me, or were talking about things I cared about,” they said. A typical sight was “some suburban punk white kid, talking about a breakup.” As Cartagena, 30, put it, “I just wanted more.”\n\nThat “more” has arrived in waves during the past decade. The short-lived but hugely impactful G.L.O.S.S., from Olympia, Wash., brought a vociferous trans-feminist perspective to hardcore. Zulu situates the genre on the spectrum of progressive Black thought. The band’s 2019 debut EP, “Our Day Will Come,” opened with a sample of Nina Simone discussing the importance of Black pride, and juxtaposed searing blast beats and walloping breakdowns with a snippet of a 1962 Malcolm X speech in which he posed the question “Who taught you to hate yourself?”\n\nOn “A New Tomorrow,” both the songs as well as “Créme de Cassis,” a lovely mid-album spoken interlude by the poet Alesia Miller, drive home the importance of celebrating Black joy even when considering Black pain. In “From Tha Gods to Earth,” Lei and Cadette trade off bellowed lines that first look back to slavery (“400 years and still/Here I am/I won’t forget”) but then ahead to a time when “Clouds part and hope seeps through.”\n\n“People think that because we’re in a heavy band, we’re talking about Black struggles, they expect us to be angry about it, but really there’s things that we can enjoy and things that we do celebrate,” Cadette said. “Zulu is not about aggression and all that; it’s about love.”\n\nFor Cartagena, Lei’s buoyant performance style is a welcoming beacon. “I say they have the best moves of any frontperson onstage — just, like, sliding and moon walking and just moving their shoulders,” they said. “It just reminds me of my people.”"}, {"url": "https://www.bandsintown.com/e/1028075914-bane-at-franklin-music-hall", "page_content": "Bane, a hardcore punk band, began as a side project between Aaron Dalbec (then of Converge) and Aaron Bedard (who had previously sang for the Worcester, Massachusetts hardcore band Backbone). They went into the studio in December of 1995 with a few friends and released a 5 song demo. The next year saw the release of their first EP, and many shows throughout central Massachusetts. The home crowd reactions in all the incarnations of The Space, The Espresso Bar and The Palladium were positive. Spring of 1997 saw the release of the Free To Think, Free To Be EP, where 1998 saw the release of the Holding This Moment EP and CD collection, plus the first US Tour.\n\n\n\nBane can be classified as a posi hardcore band from the Worcester area that is known for its energy, anthems, honesty and promotion of tolerance and unity within the hardcore scene."}, {"url": "https://www.britannica.com/topic/Fugazi", "page_content": "Fugazi, American hardcore punk band known as much for its anticorporate politics as for its intense, dynamic music. The members were drummer Brendan Canty (b. March 9, 1966, Teaneck, New Jersey, U.S.), bass player Joe Lally (b. December 3, 1963, Rockville, Maryland), vocalist-guitarist Ian MacKaye (b. April 16, 1962, Washington, D.C.), and vocalist-guitarist Guy Picciotto (b. September 17, 1965, Washington, D.C.).\n\nFormed in 1987, the band emerged from the Washington, D.C., punk scene. All four members had already played in local bands; MacKaye had been a member of influential hardcore band Minor Threat and cofounded the independent label Dischord Records in 1980. By the time Fugazi had released its full-length debut, 13 Songs, in 1989, it had established a unique sound: building from the raw energy of 1980s hardcore bands such as Black Flag, Fugazi created its own brand of intricate song structures and stop-and-start dynamics, often fueled by call-and-response exchanges between dual singers MacKaye and Picciotto.\n\nThe group quickly developed a reputation for its integrity and its grassroots ethos. Despite lucrative offers from major labels, Fugazi remained self-managed and self-produced, releasing all its albums on Dischord. The band refused to charge more than $6 for admission to its exclusively all-ages shows and kept the price of its CDs under about $12—gestures intended to keep Fugazi accessible to its loyal fan base. Especially in light of the popular explosion of alternative and punk bands in the 1990s, Fugazi’s adherence to the punk movement’s original do-it-yourself populist stance earned the band a great deal of respect among its peers.\n\nOver the course of the 1990s, on albums such as Repeater (1990), Steady Diet of Nothing (1991), In on the Kill Taker (1992), Red Medicine (1995), and End Hits (1998), Fugazi retained its churning rhythms and raw emotion, but its song structures became more varied and its lyrics more oblique and less overtly political (the band had sometimes been criticized for being too didactic and politically correct in its earlier efforts). Fugazi became known for its intense live performances, marked by consistently tight sets and the magnetic stage presences of MacKaye and Picciotto. Onstage, the band utilized its trademark sound—the buildup of extreme tension followed by calm—to draw its audience into a visceral, emotional experience. Yet Fugazi stood out among its contemporaries in its opposition to slam dancing (the aggressive body-jarring collisions that were the preferred dance form of fans of hardcore).\n\nIn 1999 a documentary about the band, titled Instrument, was released, followed in 2001 by both a full album, The Argument, and an extended-play CD, Furniture. Shortly after a performance in London in 2002, the band announced an “indefinite hiatus.”"}, {"url": "https://www.nytimes.com/interactive/2022/03/11/magazine/plants-protest.html", "page_content": "MaRy J. BLigE oN tHe BeAuTy oF VuLNeRabiLiTy\n\nBlige is now 51, with 9 Grammy Awards, two Academy Award nominations and three Golden Globe nominations, with a hit for seemingly every era of hip-hop and R.&B. since her debut. She was 17 and living in public housing in Yonkers, N.Y., when she sang Anita Baker’s entire “Rapture” album to the music executive Andre Harrell, which led to her record deal. She has spent the ensuing years longing for love on records, finding and losing it in front of the world. Where so much of popular music has been geared toward showing just enough vulnerability to bolster your own fierceness, Blige’s particular brand of honesty and approachability brings out something tender in listeners and collaborators alike. Read More\n\n/ One of Mary J. Blige’s earliest lyrics, from her breakout sophomore album, “My Life,” encapsulates the theme that has become central to her 30-plus year career: “How can I love somebody else/If I can’t love myself enough to know/When it’s time/Time to let go?” It is a question that went beyond the tendency of pop and R.&B. songs of the time to look outward (Why won’t you love me?), or to focus purely on the singer’s desires (I need romance) and turned the gaze inward, acknowledging the work to be done on the self first. The lyric also introduced one of Blige’s hallmarks: She doesn’t provide her listeners with answers to life’s big questions, instead complicating the inquiry itself, time and again. More than a guide, she is a fellow traveler.\n\nDuring the heyday of mid-’90s New York hip-hop, when gritty, gun-toting street narratives dominated the culture, Blige’s vocals helped add nuance to the image of city life and the relationships that governed it. She softened Method Man on his devotional “I’ll be There for You/You’re All I Need to Get By” and added uptown swagger to Jay-Z’s Mafioso flow on “Can’t Knock the Hustle.” In the early 2000s Blige brought soul to Talib Kweli’s “I Try” and a sense of ease and warmth to Common’s “Come Close.” In the years since, Blige’s list of featuring spots has grown to include Ludacris, Lil Wayne, Drake, Kendrick Lamar, Kid Cudi and Wyclef Jean. If you want a track to have real feeling, you call Mary.\n\nIn this year’s Super Bowl halftime show, Blige appeared alongside some of the biggest names in hip-hop, past and present, and sang about her joy and her heartbreak. She performed her bouncy club anthem “Family Affair,” (wherein she gifts us with the word “dancery”), and then her ballad “No More Drama” with a kind of controlled anguish, ending sprawled out on the stage in an act of triumphant depletion. As her peers rapped about their own enduring greatness (Dr. Dre and Snoop Dogg’s “Still D.R.E.”) and offered broader affirmations for their people (Kendrick Lamar’s “Alright”), Blige kept the show grounded in raw, introspective emotion, even while clad in Swarovski crystals and thigh-high boots.\n\nThis February Blige also released her 15th studio album, “Good Morning Gorgeous,\" her first since her divorce from the music producer Kendu Isaacs was finalized in 2018.The production of the album feels in step with current trends, with features from Anderson .Paak and songwriting assistance from H.E.R., but the substance of the songs is classic Blige: honest about her failures and unabashed about her desire to be loved. On the Starz show “Power Book II: Ghost,” Blige currently plays Monet, the calculating, occasionally murderous wife of an incarcerated drug kingpin. Blige has said that the character reminds her of women she grew up around: sole providers willing to do whatever it takes to survive in a ruthless, male-dominated world.\n\nBlige and I spoke on Zoom the Friday after her Super Bowl performance, in a moment of relative calm before she traveled to Cleveland to perform at N.B.A. All Star Weekend. Though her music is often informed by pain, Blige is more interested in taking stock of life’s fluctuations and grabbing whatever joy is within reach along the way.\n\nSo many songs on your new album feel really contemporary but also so genuinely Mary — “Rent Money,” “Failing in Love,” “Here with Me.” How do songs like that begin for you, from a writing perspective? A song begins from an experience, a feeling. Feeling, like, empty, or depleted — what does that mean? What word can define feeling that way? Getting nothing back in return — I think that would be “Rent Money.” And “Failing in Love” is what I seem to keep doing. I’m single, and I’m cool with it now, but the relationship thing, I don’t know what’s going on with it. That’s where “Failing” came from: Sometimes I feel like I failed when it comes to love. “Here With Me,” that’s just how I want to feel — I want to be with someone. I want to feel someone and be with someone and be able to sing those lyrics, you know?\n\nOne of your hallmarks is how personal you are in your music. During something like your decade-plus marriage, how do you decide how much of yourself to put in your songs, and how much to hold back? Well, I’m not going to say anything that I don’t want to say. You’re not going to find out anything about me that I don’t want you to find out.\n\nThe world is always “Gimme more, gimme more, I need gossip, I need this, I need that” — I’m not going to give you gossip. I’m just going to give you what I know I can confirm, what I know I can stand and talk about and not feel like I don’t have anything left. What I give is what people deal with, what we go through every single day.\n\nI’m not afraid of the world, not at all — I’ve been going through hell since I was little. I’m not afraid to say, OK: I’m going through this, and I need help just like everybody else on Earth needs help. But I’m not going to give up nothing that I don’t want to give up. That’s why I’m comfortable. People in this world can’t force me to do anything.\n\nIs that something you’ve believed from the beginning, or is that a part of your evolution as a songwriter? From the beginning. Ever since I was a little kid, you cannot force me to do things. If you try, it’s always a bad experience for you and me.\n\nThere’s this assumption that the thing that makes you so powerful is that you lay it all out. But in reality, one thing that makes you so powerful is that you know which parts of you are going to touch other people. I don’t think people care about the details too much! They just care about the part that they can relate to directly with you. “Me too, girl, me too.” They don’t even care about how you got on that floor. They just know that you were down there — with them. I just give them enough to say, “Me, too. I’m hurting too.”\n\nIt feels like this is what I’m supposed to be doing. I got a divorce, you know: OK, Mary, how’d you get through this? Because the world saw you go through all this. It’s an assignment for me to do that. It might not be everybody else’s assignment. But there are a lot of women who love me and respect me and follow me, and want to know — not the details, but how to get to the other side. How did you get to the other side with class and dignity when everybody was tearing you down and teasing you, and the person that you were with was destroying you? I made a way that’s like, Whatever your truth is, speak it.\n\nYou have a philosophy in terms of what you reveal. Do you have one on a language level? Do you ever cross something out because it’s just not a Mary kind of word? I do. There are certain things I would never say. And I don’t like to be too literal. “Failing in Love” is an experience. “Rent Money” is an experience. It wasn’t like, “My rent is due, so the song is called ‘Rent Money’” — it was like, Everything is due.\n\nI was thinking about Roy Ayers’s “Everybody Loves the Sunshine,” which you sample on “My Life.” The lyrics of that song are pretty straightforward — it’s “bees and things and flowers.” And that’s what I love about it! That was the first song I really heard, when I was 4 years old. When you think of the sunshine, you think of bees and trees — it’s very A-B-C, 1-2-3. It’s not literal, it’s just plain and simple. I like to write like that, too, plain and simple. Because people get it. Something in the color of that music, something in the keys, something that just drives me crazy in a good way. It has so much medicine and healing. They didn’t have to say anything else but just bees and trees and flowers, and I’m in. “Whatever drug y’all are taking, I’m taking, too.”\n\nYou said you love the color of that song. What color is that song to you? That’s gold. There’s something very regal and shiny about it.\n\nYou often mention colors in relation to your songs. I hadn’t realized that you’re a synesthesia person. When you listen to music, do you often see colors? Every time. As soon as it comes on, I can tell you what color it is.\n\n“Good Morning Gorgeous” is what color? Purple. It’s royal, an arrival of something new and powerful.\n\nAnd “Real Love?” “Real Love” is light, like a sunny-day sky blue. Almost all the songs on “My Life” are blue. “Be Happy,” blue. “All Night Long,” blue. “Don’t Go,” blue. “I’m The Only Woman,” dark blue.\n\nThe new album’s themes feel very 2022: positive affirmations, self-care, vulnerability, the benefits of talk therapy. Your openness made you so beloved, for decades. But were there ever opportunities or things that didn’t come to you, because you were so real? A lot of people don’t come to me. A lot of people run away from me, because I’m so open. Everybody’s not ready to be open! That’s the professional downside: A lot of people will run. And a lot of people will stay, because they want to get to the other side. If I weren’t getting to the other side, everybody would be running. People run when they’re not ready to get to the other side, to get out — when it’s comfortable. I’m always in a place where it’s uncomfortable, because I’m always trying to get to the other side of any kind of self-hatred, negativity, self-pity. And not everybody’s ready.\n\nWhen you say people, do you mean other artists, or listeners? I mean some peers, some friends. They’re not ready. Some people run. What I love about doing this is you get to see who is who. The one who is just in it for who you are — famous, or whatever — you see them run when it gets hard. But the ones that love you stay, and they hurt with you, heal with you, cry with you. That’s the beauty of vulnerability. It weeds out all the B.S.\n\nGrowing up listening to your music, you always seemed to be one of the girls in the boys’ club — so affiliated with hip-hop, which was so male-dominated. Because of that, when you were the only woman onstage at the Super Bowl, it felt very natural. Was that something you gave any thought to, being the only woman? Well yeah, of course. I’m always in that situation. Because hip-hop is such a male-dominated field, and I happen to be the Queen of Hip-Hop Soul. But I’ve never had a problem, a run-in, any negativity, with my male peers, ever. They love me, they respect me, they call on me. I know how to carry myself. I love that about myself, that I can handle myself with these men.\n\nIn the studio, has it ever been difficult to be so vulnerable about things like your romantic experience, in such a male-dominated setting? Not at all. Most of them are like, “Me too, I’m going through it too!” That’s another thing — you’d be surprised what vulnerability can bring. It just opens everybody up. And it’s beautiful because now we can all get some healing together. Now we can write this song together. Like me and Anderson .Paak writing “Love Without the Heartbreak” — that was a heavy session! But he can relate. Doing the whole “My Life” album with my brother Puff — that was a lot. He was going through what he was going through, and I was going through what I was going through.\n\nHas it ever felt like some kind of negotiation when you were the only female voice on a track with men who were, perhaps, expressing negative views about women on the same song? Well, I know who I am. I know they aren’t talking to me. Even when I didn’t love myself, I knew they weren’t talking to me. These are my friends and my brothers, and they’re talking about whoever they’re talking about, and that’s on them. Whatever they have to come through, they have to come through. I don’t like men speaking negatively about women, but I’m not everybody’s boss, I’m not your mother. I’m your friend. So that’s between you and God and whoever you’re speaking about.\n\nWhen I was younger, that wasn’t something that was on my mind. What was on my mind was making a hot record, a record that we can both relate to together. Like “You’re All I Need.” That’s a beautiful song. Method Man’s speaking highly about women.\n\nI’m always struck by hearing you talk about your ascendant years — how, behind the scenes, you didn’t feel that you were all that, that you were beautiful, that you were as great as everybody said you were. During those years, what was the thing that kept you creating? The fan base, the love for the music, that was my survival. I didn’t have anything else. I was a girl from the hood who didn’t really have much. And then when I got something — which was love from people who didn’t even know me — it was like, wow, OK.\n\nIt was the only thing that made me feel good. Everything else about me was like, Yeah, whatever. It was always hard to see myself as a beautiful person — because of so many things I don’t want to talk about that happened in life, from childhood to being a young adult in the music business. The music and the people and the fans and the money — the things that came with it — helped me to cover up everything else.\n\nIn the “My Life” documentary, you said that Diddy helped you see yourself as a real artist. What is your definition of a real artist? In my case, a person who’s not afraid to give of oneself to heal, or to help someone else heal. A person who’s not afraid to experiment.\n\nThe reason I say that about Diddy is that I was afraid to bring some of the songs to him for the “My Life” album. And that was my first experience as an artist speaking from a place of hurt, a place of “I need help.” And I was afraid to go to him, because I didn’t know how he was going to receive it. Because, you know, the “What’s the 411?” album was not like that. And when I brought it to him, he went crazy. That’s when I knew: OK, this is what I do. This is what I do as an artist. I’m an artist. Puff believes in me, and he sees me. He told me that — he said, “You’re a real artist now.”\n\nAs 2022 Mary, do you have anything you wish you could have said to 1998 Mary? If she would have listened to me — because she wasn’t listening to anyone — I would tell her that you have no idea what the future holds for you. I need you to get ready. But you can’t tell her to get ready. Because she ain’t ready.\n\nI think about the years in the late 2000s, early ’10s, when it seemed like R.&B. took a back seat to music that was more dance focused, electronic focused. And those are the years when you went to London and put out the amazing “London Sessions,” which feels like a bridge to current trends. How did you feel during those years, when everybody was trying to make songs for a different kind of club? I felt normal. But I was feeling forced by the labels to do something that would move the needle more, on the charts or whatever. Try this, try that. I could have just kept making the type of music I was making, but the labels wanted dance remixes. I felt like I was being pushed to do things I didn’t want to do, but you know, when the label speaks, sometimes you have to do what they say, because it’s their money. I got in a lot of trouble fighting for the R.&B. singles I wanted to keep. It didn’t hurt anything, but it didn’t help anything either.\n\nBut sometimes, dipping your toe into that genre — like the songs with Disclosure, or Kaytranada and BADBADNOTGOOD — doesn’t feel like you got lost. In those songs, no, because I was doing what I wanted to do. I picked Disclosure because I thought they were hot! I saw a video of theirs, and I was like, Who is this? It felt like they knew where we came from, they were sampling everything we were sampling. They knew their history, hip-hop music and R.&B. And Kaytranada, he’s us. I like to do stuff when it feels like I’m not alienating who I am and where my music history comes from. I like to stay where my world is not crossing over to theirs — they’re crossing over to me.\n\nThis interview has been edited and condensed.\n\nAngela Flournoy is the author of the novel “The Turner House.” She has received fellowships from the National Endowment for the Arts and the American Academy in Berlin. Arielle Bobb-Willis is a photographer from New York. Her work can be seen in the traveling “New Black Vanguard” gallery show and book."}, {"url": "https://www.last.fm/tag/emo/artists", "page_content": "1,430,832 listeners\n\nThere are two artists with this name\n\n1. A popular rock band\n\n2. A funk group\n\n1. Brand New is an American rock band that formed in 2000 in Merrick,…"}, {"url": "https://www.nme.com/blogs/nme-blogs/best-female-fronted-punk-bands-2344471", "page_content": "The punk rock movement began in the mid-1970s, with bands like Ramones and Sex Pistols lording over an era of youthful rebellion – littered with leather jackets, S&M pants, and raucous anti-authoritarianism.\n\nBut, often overlooked, are the huge contributions women made to this musical genre. Female-led bands like the Patti Smith Group and Blondie gained popularity in the 1970s, and played a key role in the development of punk rock. These women also plugged into the feminist movement, and spoke out about the issues facing them in their songs.\n\nHere’s the best female-fronted punk rock bands, from the 1970s to today.\n\nPatti Smith, Patti Smith Group\n\nAdvertisement\n\nYears active: 1974–1979.\n\nWho they were: One of the most influential bands on the New York City punk rock scene. Led by Patti Smith – the so-called “punk poet laureate” – the group released four albums and dominated punk in the US. Smith’s debut album with her band ‘Horses’ is widely lauded as one of the greatest albums to come out of the American punk rock movement.\n\nBest Track: ‘Gloria: In Excelsis Deo’.\n\nDebbie Harry, Blondie\n\nYears active: 1974–1982, 1997–present.\n\nWho they are: Pioneers of the American punk rock and new wave scenes in the 1970s. Founded by lead singer Debbie Harry with guitarist Chris Stein, the band is known for combining an eclectic mix of genres, including punk, pop, disco, rap, and reggae. They were considered an underground band until breaking into the mainstream, with the release of their internationally successful ‘Parallel Lines.’ The band broke-up in 1982, but re-formed in 1997 – touring and playing at big festivals like Glastonbury – and have released eleven studio albums in total.\n\nBest Track: ‘Heart of Glass’.\n\nSiouxsie Sioux, Siouxsie and the Banshees\n\nAdvertisement\n\nYears active: 1976–1996, 2002.\n\nWho they are: The unofficial founders of post-punk. Formed after singer Siouxie Sioux met her future bandmate Steven Severin at a Roxy Music concert, Siouxsie and the Banshees were initially lumped into a scene that journalists dubbed the ‘Bromley Contingent’. That said, the band had very little in common with Sex Pistols aside from geography and a drive to push musical boundaries.\n\nWhile all of the punk bands around them courted label attention from the start, Siouxsie and the Banshees didn’t sign a record deal until 1978; with the backing of Polydor, they finally released their debut single ‘Hong Kong Garden’ that same year. At the time, reviewed in NME, Paul Rambali praised it for “the most original, intoxicating guitar playing I heard in a long, long time”. Recorded in one week, their debut album ‘The Scream’ is now regarded as a landmark post-punk album; documenting the suburbia they grew up. Up until the band disbanded in 1996 (Siouxsie and bandmate Budgie later turned their attention to the Creatures) The Banshees released constantly innovative music; pushing the limitations with every release.\n\nBest Track: ‘Spellbound’\n\nBeth Ditto, Gossip\n\nYears active: 1999–2016.\n\nWho they were: A three-piece from Washington, USA, Gossip stormed gained international success for their critically-acclaimed debut album ‘Standing in the Way of Control’. Frontwoman Ditto – self-described as a “fat, feminist lesbian from Arkansas” – is well known for her energetic, frenetic and sweaty performances. Currently pursuing a solo career, alongside working in fashion, Ditto has been outspoken about LGBTQ+ equality throughout her career and has done a great deal for promoting body image positivity. She doesn’t shave her armpits or use deodorant – once reportedly saying “I think punks usually smell” – and caused mild controversy when she told NME in 2006 that she ate squirrels as a kid.\n\nBest Track: ‘Standing in the Way of Control’.\n\nPoly Styrene, X-Ray Spex\n\nYears active: 1976–1979, 1991, 1995–1996, 2008.\n\nWho they were: A punk band from London. Self-described as “deliberate underachievers”, the band only released one album, the punk rock classic ‘Germfree Adolescent’, with uncredited saxophone parts from on-off band member Lora Logic, before breaking up in 1979. They re-formed to play various one-off gigs, including a sellout show at the Brixton Academy in 1991, and also got back together to release a second album, ‘Conscious Consumer’, in 1995. They were considered one of the most exciting and innovative band’s on the British punk rock scene, with a progressive and feminist outlook, and known for their anti-consumerism themes in their songs. Poly Styrene tragically died from breast cancer in 2011, aged 53.\n\nBest Track: ‘Oh Bondage Up Yours!’\n\nThe Slits\n\nYears Active: 1976–1982, 2005–2010.\n\nWho they are: Making raucous punk with a feminist lean, The Slits’ music was defined by joyful mayhem; nodding heavily to the backing vocals of French yé-yé bands, a relaxed strain of dub, and a general apitude for do-it-yourself scrappiness. Their 1979 debut album ‘Cut’ – which featured Ari Up Viv Albertine and Tessa Pollitt in a rose garden wearing loincloths and covered in mud – is both playful and pointed, refusing to play the part of the ‘Typical Girls’ who were often ignored or sidelined in the punkscene. Listening to ‘Cut’ today, its enormous influence on the Riot Grrrl movement of the 90s is obvious, and it’s rightly regarded as a classic of the era.\n\nBest Track: ‘Shoplifting’\n\nBrody Dalle, The Distillers\n\nYears active: 1998–present.\n\nWho they are: An punk bank formed in LA by Brody Dalle, who was brought up in Australia. Dalle’s is known for her distinctive, raspy voice. The group released three albums The band recently got back together to play their first show in 13 years in San Diego, California.\n\nBest Track: ‘City of Angels’.\n\nCourtney Love, Hole\n\nYears active: 1989–2002, 2010–2012.\n\nWho they were: An American alternative rock band founded by frontwoman Courtney Love and guitarist Eric Erlandson. The group’s early works – like debut album ‘Pretty on the Inside’ – were heavily influenced by the LA punk scene. In their later years, the band opted for a more mainstream rock sound. In total, Hole released four studio albums. The band’s line-up frequently changed throughout the years, and included bassist Kristen Pfaff between 1993 until her death from a heroin overdose in 1994 – just two months after the death of Love’s husband and Nirvana frontman Kurt Cobain. Love’s songwriting for Hole often addressed gender issues and scholars have credited her for reflecting the third-wave feminist movement in her tracks in the 1990s.\n\nBest Track: Teenage Whore.\n\nKim Shattuck, The Muffs\n\nYears active: 1991–present.\n\nWho they are: A punk band created in Southern California in 1991, led by singer and guitarist Kim Shattuck. The band broke-up in 1999, but re-formed to release a fifth album ‘Really Really Happy’, before splitting again. Three core members of the group, including Shattuck, later got the band back together, putting out a sixth album ‘Whoop Dee Doo’ in 2014, and playing gigs. Shattuck briefly played bass for the Pixies on their European tour in 2013.\n\nBest Track: ‘Kids in America’.\n\nThe Donnas\n\nYears active: 1993–2012, currently on hiatus.\n\nWho they are: An all-woman punk rock band based in Palo Alto, California. Currently on hiatus, the band has released seven studio albums. Their sound is influenced by Ramones, Kiss, AC/DC, and The Runaways.\n\nBest Track: ‘Take it Off’.\n\nPussy Riot\n\nYears active: 2011\n\nWho they are: A Russian protest punk rock group founded in Moscow. The group, which has around 11 female members, are known for its provocative guerrilla performances in public places, which are posted online and often protest against Russian president Vladimir Putin and his repressive policies. Pussy Riot gained international attention when three of its members were arrested in March 2012 “hooliganism motivated by religious hatred,” after they held a performance in Moscow’s Cathedral of Christ the Savior. While one member was released in October 2012, the other two remained served 21 months in prison before they were let out in December 2013. The group members are outspoken supporters of feminist and LGBTQ+ issues.\n\nBest Track: ‘Police State’.\n\nDream Wife:\n\nYears active: 2016 – present.\n\nWho they are: An all-female, punk-pop three-piece from Brighton – and one of the most exciting bands in the UK right now. The band are known for their sweaty, frenetic and moshing performances, where they frequently urge all the “bad bitches” to come to the front and take up space. They’re full of catchy melodies and addictive riffs – and are outspoken feminist issues, including stopping women being sexually assaulted at gigs, and should Dream Wife released their eponymous debut album in January this year. Read NME’s five-star review here.\n\nBest Track: ‘F.U.U.’"}, {"url": "https://matthewsheahan.com/2023/06/04/new-yorks-most-punk-band-leaves-the-stage/", "page_content": "In the early 2000s, I picked up a copy of the punk rock newspaper The New York Waste, and paged through the show listings, record reviews and other articles. I came across a comic strip, ‘Last In Line for the Gang Bank, the GG Allin Story,’ a comic biography of late punk rock musician GG Allin.\n\nGG Allin was a legendary punk rock performer known for his obscene and violent performances. His posthumous notoriety has grown in recent years but at the time his legend was more restricted to a smaller circle of punk rock die-hards.\n\nHoly shit, I thought, someone is writing a comic-strip biography of GG Allin’s life and that is the coolest thing ever!\n\nI read this comic strip religiously in every issue of the New York Waste. At the bottom of every comic in a small banner or border was a web address that looked somewhat cryptic. Unable to resist, I fired up my large desktop computer at home (this was several years before smart phones became publicly available) and visited the web address to find it was for a band called World War IX. Their guitar player, Justin Melkmann, was the man behind the GG Allin comic.\n\nBased on the strength of this awesome comic alone, I made a mental note to see World War IX play at the earliest opportunity.\n\nI first saw the band play at CB’s Basement, a smaller, downstairs venue attached to the legendary CBGB’s. They were the kind of raw, no-frills garage punk rock that I can never get enough of. They brought a loud punk sound with catchy tunes and, importantly, a sense of humor.\n\nAfter their set, I found their guitar player, Justin, and told him that I liked his comic, and that World War IX was playing great music. I was in the process of getting my band Blackout Shoppers off the ground and we promised to stay in touch.\n\nFast forward a few months, and Blackout Shoppers and World War IX were playing shows together frequently, and the first recordings that Blackout Shoppers ever had for sale was a split 7-inch record with World War IX called ‘Larceny Armageddon,’ playing off the names of our bands.\n\nPeople have been arguing over what constitutes “punk” since 1975. If you ask 100 punk rock fans for a definition of punk, you will get 100 different answers. We can agree maybe on two key attributes that make a band punk: an aggressive, often purposely offensive style of rock, and a base level of honesty with its fans and the general public.\n\nMany punk bands try to act as if they are completely above the fray, that because they play this tyle of music they exist on a higher moral plane than those that play more lucrative genres. I can tell you first-hand that punk musicians harbor all the same egos and insecurities that the rest of the rock world has. As much of a joy as it is to play music, there comes a time in every band member’s life when they look at other bands and say to themselves, “Why can’t we have what they have?” or otherwise questions or gripes about their position in the entertainment industry food chain.\n\nWorld War IX has a case for being New York’s punkest band of the last few decades. It played a raw, aggressive punk rock style that evolved but never mellowed, and it was very honest with its fans. Especially as told through Justin’s comics, World War IX narrated its own journey with all the pitfalls and aggravations that come with keeping a band afloat for years. Lineup changes, issues with drugs and alcohol, job worries and marriages and the weight of the world that is crushing at times have all been illustrated with humor, grit and ultimately gratitude.\n\nAs World War IX embraced its creativity, I had the opportunity to share the stage with them as a member of Blackout Shoppers and other bands, and I also had the chance to play villains in several of their music videos for Cutlass Supreme, Carrera con el Diablo and Bender Royale. I cannot think of an instance when I had a bad time at a World War IX show, or had a bad time with a member of World War IX.\n\nI felt great joy when my friend Philthy Phill became their singer. A super-creative soul who has embraced the arts of writing, stand-up comedy, and music while surviving in New York, Phill was a natural choice when the band was looking for a singer once more. It was a sign that the forces of the world had brought on a confluence of punk rock perfection when Phill was on the mic. His departure from New York is what got Blackout Shoppers back on stage and playing again regularly after a few years on semi-hiatus.\n\nPhill was replaced on singing duties by Johnny C., previously of the band Citizen Blast Kane. A few years later, World War IX decided to call it quits. There wasn’t any big drama or dispute over money (there is no money in punk rock!), but there comes a time when a band just feels it has run out of road and needs to move on and do other things. That time came for World War IX, and the band decided last year that they would play a final show this January at Otto’s Shrunken Head.\n\nWorld got out that WWIX was breaking up and having a final show. People from all over the country made plans to fly to New York for the event. The band invited all their former members to return to play one last time. Most importantly, Philthy Phill would be coming in from Indiana.\n\nThe night arrived for World War IX to say a loud farewell. Otto’s was packed and first on the stage was Cash Bribe, featuring WWIX bass player Brian Jackson on bass. Cash Bribe kicked things off with hardcore fury that blended old school Black Flag with heavier distortion and more metal-sounding riffs, truly a modern hardcore band building on gritty, guitar-fueled punk.\n\nAll but one of Dr. Ex and the Break-Ups are World War IX alumni, and Dr. Ex took the stage next to play classic garage rock with a more punk rock treatment; imagine Question Mark and the Mysterians after an all-night drug orgy with The Kinks. The jean jackets, white-frame sunglasses, and keyboard-infused rock set them apart from the rest of the night’s entertainment.\n\nPhiladelphia’s Loafass was next, and beer flew everywhere as things were getting heated up. Loafass brings a funk-influenced punk-hardcore sound and their work is a testament to the longevity of music that is made with the intention of having a good time. Loafass has been around for more than 25 years; and they are the same intense fun they were when I first saw them in 2003.\n\nMy band Blackout Shoppers were next, and before we started, I mentioned to the audience that while the four of us as a band have nearly 200 years of bad decisions under our belts, one of the soundest decisions any of us have ever made was befriending World War IX. “World War IX, you are the best, we are Blackout Shoppers.”\n\nThen it was time for World War IX to take the stage. What followed was a chaotic masterpiece of a punk rock sendoff. It was a loud, demented family reunion that was extremely energetic and sweaty, and amazingly raucous fun. The songs were delivered with the kind of energy punk rock is famous for. It was a sweet relief to see one of my favorite bands of all time go out with a the kind of impressive roar that its history deserved. World War IX left the stage a battered, beer-soaked mess. It left the New York punk scene better than it found it. We are grateful for having been there to listen."}, {"url": "https://www.gamesradar.com/dc-comics-july-2022-solicitations-covers/", "page_content": "DC's July 2022 solicitations are full of the summer month's traditional emphasis on hotdogs, baseball, and fireworks ... just without the hotdogs and baseball.\n\nBut look up, it's bringing the fireworks.\n\nSo what's happening in July?\n\nBoth core Batman titles - Detective Comics and Batman - get brand new creative teams and brand new storylines. But rest assured, both star Bruce Wayne.\n\nHe's dead elsewhere.\n\nWhat else? Dark Crisis continues, of course, and not only is the Aquamen ongoing series joining the … well, the wake , but the event gets a new special with the mouthful of a title Dark Crisis: Worlds Without a Justice League - Superman #1 .\n\nDC vs. Vampires expands with a new monochromatic (that's fancy talk for black and white) companion six-issue series All-Out War teaming Constantine, Booster Gold, Deathstroke, Mary Marvel, Bane, Deadman, Azrael, and Blade against the Nightwing led vampires (okay, the Blade part isn't true).\n\nDC gets Dwayne Johnson's face on a cover as soon as they can with Black Adam: The Justice Society Files #1 , the first of a series of one-shots featuring the members of the Justice Society that will co-star in The Rock's Black Adam, beginning with Hawkman.\n\nAnd that's just a taste of the month's new offerings.\n\nSo check out all of DC's July 2022 solicitations and covers and you can also check out the DC April 2022 solicitations, the DC May 2022 solicitations, and the DC June 2022 solicitations and/or scroll through all of DC and Marvel's most recent solicitations (including Marvel's May edition) on our solicitations tab.\n\nDC July 2022 Spotlight comic books\n\nBATMAN #125\n\nWritten by CHIP ZDARSKY\n\nArt and cover by JORGE JIMENEZ\n\nBackup art by BELÉN ORTEGA\n\nVariant covers by JIM LEE, SCOTT WILLIAMS, GABRIELE DELL'OTTO, INHYUK LEE, and FRANCESCO MATTINA\n\nAcetate variant cover by SIMONE DI MEO A\n\n1:25 wraparound variant cover by JORGE JIMENEZ\n\n1:50 variant cover by JOCK\n\n1:125 variant cover by ALEX GARNER\n\n1:250 variant cover by CHIP ZDARSKY\n\n1:500 variant cover by JIM LEE and SCOTT WILLIAMS\n\n$5.99 US | 48 pages | Variant $6.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nSuperstar writer Chip Zdarsky joins legendary artist Jorge Jimenez to define a new era in Batman!\n\nBruce Wayne is at a turning point, haunted by dreams of a dark future, while Gotham City billionaires are being gruesomely murdered. With the discovery of an archenemy's involvement and a tragedy unfolding, the Dark Knight's nightmares are just beginning.\n\n\"Failsafe\" starts here.\n\nAnd in the backup, there's chaos in Gotham as the underworld fights over one of its crown jewels…and Selina Kyle is caught in the middle. Can she stop the bloodshed and maybe even make a little money in the process?\n\nImage 1 of 10 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDETECTIVE COMICS #1062\n\nWritten by RAM V\n\nArt by RAFAEL ALBUQUERQUE\n\nCover by EVAN CAGLE\n\nBackup written by SIMON SPURRIER\n\nBackup art by DANI\n\nVariant covers by LEE BERMEJO and J.H. WILLIAMS III\n\n1:25 variant cover by INHYUK LEE\n\n1:50 foil variant cover by J.H. WILLIAMS III\n\n$4.99 US | 40 pages | Variant $5.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nGotham Nocturne part 1 of 4: \"Overture.\" It's a new era for the detective of the night as we introduce award-winning new series writer Ram V (Catwoman, The Many Deaths of Laila Starr), and artist extraordinaire Rafael Albuquerque (American Vampire, Superman/Batman)! Together, they'll be turning Gotham into a tragic yet beautiful gothic opera for our eyes and ears to feast on.\n\nSomething is terribly wrong with Batman. No matter the tests Bruce takes, nor the numbers he counts, the greatest detective in the world can't pin down the source of this creeping dread—of his own inner demons and a looming mortality. Meanwhile, real demons roam the shadows as an ancient melody haunts the Gotham night. Here now the curtains rise and as the eerie tune streams in…who is human, who is demon, who is to tell? As Batman investigates the songs and the demons of Gotham, he is forced to confront the oldest question…whether there has been a demon within him all along…and if so, what does it want?…and why hasn't it taken over yet?\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nFLASHPOINT BEYOND #3\n\nWritten by GEOFF JOHNS, JEREMY ADAMS, and TIM SHERIDAN\n\nArt by XERMÁNICO\n\nCover by MITCH GERADS\n\nVariant cover by XERMÁNICO\n\n1:25 variant cover by DAVID MARQUEZ\n\n1:50 variant cover by IVAN REIS\n\n$3.99 US | 32 pages | 3 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nThe DC event of 2022 continues! Thomas Wayne's investigation into the Clockwork Killer goes sideways when he is confronted by a deadly alien invader the world knows as...Project: Superman? But what's happened to the Kryptonian and Krypton in the World of Flashpoint? Will Thomas Wayne do what he has to in order to stop Superman—or has he changed? And what are those strange earthquakes now erupting across reality?\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDARK CRISIS #2\n\nTHE HOUSE OF NIGHTWING BURNS!\n\nWritten by JOSHUA WILLIAMSON\n\nArt and cover by DANIEL SAMPERE\n\nVariant cover by JULIET NNEKA\n\n1:25 variant cover by MARIO FOCCILLO\n\n1:50 variant cover by LUCIO PARRILLO\n\n$4.99 | 32 pages | 2 of 7 | Variant $5.99 US (card stock)\n\nON SALE 7/5/22\n\nAs the good people of the world mourn the loss of the Justice League, the forces of evil have seized the opportunity to wreak havoc in a world without its heroes! Leading the charge is a super-powered Slade Wilson…but this time there's something dark fueling his rage. With a massive army laying siege to Titans Tower, only Nightwing will have what it takes to stand in the way of Deathstroke's forces—but is this a fight Dick Grayson can win? Look, up in the sky—reinforcements are on the way! It's a bird! It's a plane! It's…uh-oh...it's Cyborg Superman. The world burns as Pariah and the Great Darkness make their play for planet Earth in this jaw-dropping second issue!\n\nImage 1 of 6 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDARK CRISIS: WORLDS WITHOUT A JUSTICE LEAGUE - SUPERMAN #1\n\nWritten by TOM KING\n\nArt and cover by CHRIS BURNHAM\n\nBackup written by BRANDON THOMAS and CHUCK BROWN\n\nBackup art by FICO OSSIO\n\n1:25 variant cover by STEVE BEACH\n\n1:50 foil variant cover by CHRIS BURNHAM\n\n$4.99 | 40 pages | (All covers card stock)\n\nON SALE 7/12/22\n\n\n\nWhen Pariah and his forces of the Great Darkness laid waste to the most powerful superheroes of all time, all hope was lost…with the Man of Steel suffering the same fate as that of his comrades, join us for a look at a world of dreams he would never have thought possible while alive. Where there's life there's hope, and with that hope comes a deeper unraveling of the tapestry of DCU's biggest event of 2022!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nDARK CRISIS: YOUNG JUSTICE #2\n\nTALE OF TWO WONDER GIRLS!\n\nWritten by MEGHAN FITZMARTIN\n\nArt by LAURA BRAGA\n\nCover by MAX DUNBAR\n\nVariant cover by NIKOLA ČIŽMEŠIJA\n\n$3.99 US | 32 pages\n\n2 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\nImpulse, Superboy, and Tim Drake were just saved by Cassie Sandsmark, Wonder Girl in the strange fantasy word they're trapped in. And she's here to help them navigate their retro surroundings. But…Cassie Sandsmark is back on our Earth searching for her friends alongside Red Tornado and the superhero formerly known as Arrowette. Which Cassie is lying and who's about to get burned?!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nTHE FLASH #784\n\nWritten by JEREMY ADAMS\n\nArt by AMANCAY NAHUELPAN\n\nCover by TAURIN CLARKE\n\nVariant cover by BENGAL\n\n$3.99 US | 32 pages\n\nVariant $4.99 US (card stock)\n\nON SALE 7/19/22\n\nThe search for Barry Allen! Wally and Wallace have arrived on the planet Pariah has trapped Barry on—but it's not quite a happy reunion among the Flashes. The Dark Crisis tie-in storyline continues!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBLACK ADAM - THE JUSTICE SOCIETY FILES: HAWKMAN #1\n\nWritten by CAVAN SCOTT and BRYAN Q. MILLER\n\nArt by SCOT EATON, MARCO SANTUCCI, and NORM RAPMUND\n\nCover by KAARE ANDREWS\n\nPhoto variant cover\n\n$5.99 US | 48 pages | Variant $6.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nLong ago, Hawkman was the leader of the Justice Society, but what is he now? Still a hero or another relic in a museum? Everything changes when he finds himself haunted by not only the past, but also the vengeful spirit of a wayward thief. Will this Gentleman Ghost be the death of Hawkman or will he deliver a warning from beyond the grave? The road to Black Adam begins here. Also in this issue: As a pivotal moment in the life of Teth-Adam and his son Hurut begins to unfold in ancient Kahndaq, modern-day Kahndaq meets a new hero—antiquities professor by day, \"cultural recovery specialist\" by night, Adrianna Tomaz. And unfortunately for Adrianna, she's about to \"liberate\" a sacred totem from the wrong interested party—Intergang!\n\nImage 1 of 1 (Image credit: DC)\n\nARTEMIS: WANTED #1\n\nWritten by VITA AYALA\n\nArt by SKYLAR PATRIDGE\n\nCover by MATTEO SCALERA\n\nVariant cover by KAMOME SHIRAHAMA\n\n1:25 variant cover by BECKY CLOONAN\n\n$5.99 US | 48 pages | One-shot | Variant $6.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\nAfter the events of Trial of the Amazons, Artemis is on the run from her sisters for her sins. She may say it was all in the name of peace, but not even Wonder Woman believes a word she says. Now the former member of the Bana-Mighdall is wanted by not only her people, but all Amazon tribes!\n\nIs there a future for a warrior who has destroyed her past? Find out as Artemis travels the world searching for answers and a new path forward. She'll need all the help she can get, and it may come from the unlikeliest of sources…the Gods!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDC: MECH #1\n\nWritten by KENNY PORTER\n\nArt and cover by BALDEMAR RIVAS\n\nVariant cover by DAN MORA\n\n1:25 variant cover by RICARDO LÓPEZ ORTIZ\n\n1:100 variant cover by KARL KERSCHL\n\nTeam wraparound variant cover by BALDEMAR RIVAS\n\n$3.99 US | 32 pages | 1 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nAt the end of World War II, Earth was invaded by giant mechanized parademons from a planet called Apokolips. Earth's protectors, the Justice Society of America, were devastated, and with them, the age of superheroes came to an end and the era of the Mech began.\n\nIn the ensuing years, the world has stockpiled colossal battle suits piloted by elite warriors, waiting for the day Apokolips returns. But when Kal-El, the last son of a dying world, crash-lands in Metropolis with his own war suit, he'll face down two of Earth's finest Mech fighters, the Flash and Batman.\n\nThe dawn of a brave new mechanized DCU is here from the rising star creative team of Kenny Porter (The Flash: The Fastest Man Alive, Fearless) and Baldemar Rivas (Robins, Batman: Urban Legends).\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nYOUNG JUSTICE: TARGETS #1\n\nWritten by GREG WEISMAN\n\nArt and cover by CHRISTOPHER JONES\n\nVariant cover by MEGHAN HETRICK\n\n1:25 variant cover by TRAVIS MERCER\n\n$3.99 US | 32 pages | 1 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nQueen Perdita has been kidnapped! Mysterious armored assailants have snatched the Vlatavan royal out from beneath Bowhunter Security, leaving Green Arrow and Black Canary poisoned and comatose in the process! Now a rallying cry echoes around the globe, and across super-teams, to band together and rescue Perdita!\n\nYoung Justice co-creator Greg Weisman and Christopher Jones bring you an action-packed follow-up to Young Justice: Phantoms that will rock the team to its core!\n\nPlus, each issue includes a bonus story detailing previously unseen adventures from past seasons of Young Justice!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nSUPERMAN: SPACE AGE #1\n\nWritten by MARK RUSSELL\n\nArt and cover by MIKE ALLRED\n\nVariant cover by STEVE RUDE\n\n1:25 variant cover by NICK DERINGTON\n\n1:50 variant cover by MIKE ALLRED\n\n$9.99 US | 80 pages | 1 of 3 | Prestige\n\nON SALE 7/26/22\n\n\n\nMeet Clark Kent, a young reporter who just learned that the world will soon come to an end (Crisis on Infinite Earths) and there is nothing he can do to save it. Sounds like a job for his alter ego…Superman!\n\nAfter years of standing idle, the young man from Krypton defies the wishes of his fathers to come out to the world as the first superhero of the Space Age. As each decade passes and each new danger emerges, he wonders if this is the one that will kill him and everyone he loves. Superman realizes that even good intentions are not without their backlash as the world around him transforms into a place as determined to destroy itself as he is to save it.\n\nUniting the critically acclaimed writer Mark Russell (One-Star Squadron and The Flintstones) and Eisner-winner Mike Allred (Silver Surfer and Bowie: Stardust, Rayguns & Moonage Daydreams) for the first time, this series promises fans an unforgettable journey through U.S. history and culture starring our beloved characters.\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBATMAN: WHITE KNIGHT PRESENTS: RED HOOD #1\n\nWritten by SEAN MURPHY and CLAY McCORMACK\n\nArt by SIMONE DI MEO\n\nCover by SEAN MURPHY\n\nVariant cover by OLIVIER COIPEL\n\n1:25 variant cover by SIMONE DI MEO\n\n1:50 variant cover by OLIVIER COIPEL\n\n$4.99 US | 32 pages | 1 of 2 | (All covers card stock)\n\nON SALE 7/26/22\n\nThe world of Batman: White Knight continues to expand in this exciting new miniseries! With things heating up in Neo-Gotham, Jason Todd revisits his post-Robin past to find the one ally he believes will help him turn the tide in the battle against Derek Powers.\n\n\"Bruce Wayne is Batman.\" Four words that saved Jason's life and destroyed his future forever. Banished by his mentor and damaged by The Joker, the former Robin is left to become something different, something stronger, a relentless force for justice in the city…Red Hood! With nobody to answer to, he walks the dangerous line between hero and villain. That is until he meets Gan, a local girl from East Backport who needs his help to save her neighborhood from a super-criminal terrorizing its citizens. And she's willing to fight alongside him, whatever it takes!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBATMAN: CURSE OF THE WHITE KNIGHT DELUXE EDITION\n\nWritten by SEAN MURPHY\n\nArt and cover by SEAN MURPHY\n\n$49.99 US | 280 pages | 7 1/16\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-681-7\n\nON SALE 9/27/22\n\n\n\nFrom superstar writer/artist Sean Murphy comes the second thrilling chapter in the White Knight saga. After the events of Batman: White Knight, The Joker is behind bars, the Bat-Family has integrated Batman's mobile arsenal into the GTO, and Harley Quinn has moved on with her life. But unbeknownst to them, the Clown Prince of Crime still has an ace up his sleeve: he knows a dark secret about the Wayne family that threatens to change their legacy! To help even the playing field, The Joker recruits his own avenging angel, Azrael, to carry out this final act of revenge. Will Gotham City burn under the sword of Azrael, and will the Wayne name forever be tainted? This deluxe edition of the acclaimed story collects the entire eight-issue series as well as the Batman: White Knight Presents Von Freeze one-shot written by Murphy and illustrated by Batman: The Dark Knight Returns inker Klaus Janson, and features a brand-new cover by Murphy.\n\nImage 1 of 1 (Image credit: DC)\n\nBATMAN/SUPERMAN: WORLD'S FINEST #5\n\nWritten by MARK WAID\n\nArt and cover by DAN MORA\n\nVariant cover by FRANCESCO MATTINA\n\n1:25 variant cover by PETE WOODS\n\n1:50 variant cover by ALEXANDER LOZANO\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\nTHE FIRST ARC OF WORLD'S FINEST CONCLUDES WITH A SHOCKING FORESHADOWING OF DCU EVENTS TO COME!\n\nThe sinister machinations of the devil Nezha have run ragged the Man of Steel and the Dark Knight ever since he made his first terri fying debut in Detective Comics #1050…but what secrets does this villain hold for the future of the DCU? Clues abound for the next big DCU series in this climactic final chapter to the first arc of World's Finest!\n\n\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDC VS. VAMPIRES: ALL-OUT WAR #1\n\nWritten by MATTHEW ROSENBERG and ALEX PAKNADEL\n\nArt by PASQUALE QUALANO\n\nBackup written and drawn by GUILLAUME SINGELIN\n\nCover by ALAN QUAH\n\nVariant cover by KAEL NGU\n\n1:25 variant cover by JAMES STOKOE\n\n1:50 variant cover by EJIKURE\n\n$3.99 US | 32 pages | 1 of 6 | Black and White | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\nOne of the last secret, underground human cities is facing total annihilation and its leader—John Constantine—must plan a suicide mission to assassinate a key lieutenant in the vampire empire! Against unreal odds and with an unlikely team including Booster Gold, Deathstroke, and Mary Marvel, does the Hellblazer have one more trick up his sleeve?\n\nA gritty, violent, monochromatic companion series to DC vs. Vampires, this series will feature a brutal story with a cadre of talented creators delivering 32 pages of original content for $3.99!\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nMULTIVERSITY: TEEN JUSTICE #2\n\nWritten by IVAN COHEN and DANNY LORE\n\nArt by MARCO FAILLA\n\nCover by ROBBI RODRIGUEZ\n\nVariant cover by STEPHANIE HANS\n\n$3.99 US | 32 pages | 2 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nThe explosive miniseries starring Kid Quick and their allies shifts into even higher gear as Teen Justice investigates the Church of Blood! When efforts to infiltrate the mysterious church backfire, one hero faces a devastating loss! Plus: Supergirl and Robin attract surprising allies when they discover an unexpected mystery, Aquagirl finds herself out of her element (and then some), and an encounter with the Justice Guild threatens the future of Teen Justice!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nDC July 2022 Spotlight graphic novels and collections\n\nBATMAN VS. ROBIN: ROAD TO WAR\n\nWritten by JOSHUA WILLIAMSON, PETER J. TOMASI, and ROBBIE THOMPSON\n\nArt by BRAD WALKER, GLEB MELNIKOV, JAVIER FERNANDEZ, and more\n\nCover by JORGE JIMENEZ and ALEJANDRO SÁNCHEZ\n\n$16.99 US | 176 pages | 6 5/8\" x 10 3/16\" | Softcover\n\nISBN: 978-1-77951-792-0\n\nON SALE 8/9/22\n\nA storm is coming…and a battle years in the making between Bruce Wayne and Damian Wayne is on the horizon. A major turning point in the lives of Batman and Robin brought to you by writers Robbie Thompson (Suicide Squad, Teen Titans), Peter J. Tomasi (Batman & Robin, Detective Comics), and Joshua Williamson (The Flash, Dark Crisis), featuring stunning artwork by Eduardo Pansica (Suicide Squad), Gleb Melnikov (Jinny Hex, Robin), and more!\n\nCollects Teen Titans #43-44, Teen Titans Annual #2, Detective Comics #1032-1033, and a two-part backup feature that sets the stage for a new chapter in the life of Damian Wayne, originally presented in Batman #106 and Detective Comics #1034.\n\nImage 1 of 1 (Image credit: DC)\n\nCONSTANTINE: DISTORTED ILLUSIONS\n\nWritten by KAMI GARCIA\n\nArt and cover by ISAAC GOODHART\n\n$16.99 US | 192 pages | 6\" x 9\" | Softcover\n\nISBN: 978-1-77950-773-0\n\nON SALE 9/27/22\n\n\n\nJohn Constantine is, and has always been, a magician of the highest caliber—who doesn't need additional training from any highbrow magician, thank you very much.\n\nBut a magical apprenticeship in the United States is a good excuse to get out of London…and in Washington, D.C., he can join his best friend's punk band, Mucous Membrane. When the band begins to dabble in magic, a complicated spell gets out of hand…and the disastrous consequences might be more than Constantine can handle.\n\nJoin #1 New York Times bestselling author Kami Garcia (Teen Titans: Raven, Beautiful Creatures) and artist Isaac Goodhart (Victor and Nora: A Gotham Love Story) in the most thrilling magical team-up of the year!\n\nImage 1 of 1 (Image credit: DC)\n\nDEADMAN TELLS THE SPOOKY TALES\n\nWritten by FRANCO\n\nArt by SARA RICHARD, ISAAC GOODHART, AGNES GARBOWSKA, DEREK CHARM, CHRISTOPHER UMINGA, and others\n\nCover by SARA RICHARD\n\n9.99 US | 160 pages | 5 1/2\" x 8\" | Softcover\n\nISBN: 978-1-77950-384-8\n\nON SALE 9/27/22\n\n\n\nEver had the feeling that you were being watched? Ever taken a dark shortcut on the way home? Wondered what might just be living under your bed? Well, Deadman knows…has always known…and he's here to shed some light on those spine-tingling adventures and things that go bump in the night.\n\nWritten by New York Times bestselling and Eisner Award-winning writer Franco and featuring art by some of DC Comics' favorite artists, Deadman Tells the Spooky Tales is sure to keep you on the edge of your seat through these hair-raising stories.\n\nRead at your own risk…\n\nImage 1 of 1 (Image credit: DC)\n\nBATMAN: ONE DARK KNIGHT\n\nWritten by JOCK\n\nArt and cover by JOCK\n\n$29.99 US | 168 pages | 8 1/2\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-028-0\n\nON SALE 9/20/22\n\n\n\nIt was the sort of mission Batman had run a thousand times. From high above the sweltering summer streets of Gotham, Batman would escort the GCPD as the dangerous metahuman supervillain known as E.M.P. was transferred from a temporary holding cell to his permanent home at Blackgate Prison in Gotham Harbor. E.M.P.'s electrical powers posed a dangerous threat, but the situation was well in hand. Until it wasn't. Now every light in Gotham is out, the police have been knocked into disarray, and a broken, bleeding Batman must fight his way to Blackgate, block by block, dragging E.M.P. behind him. But it's not just the gangs who want to make life difficult for him. The dark corners of Gotham contain many surprises…and E.M.P. has many more shocks to deliver before the night is through! One of the most iconic Batman artists of the 21st century, the incomparable Jock (The Batman Who Laughs, Batman: The Black Mirror), has focused all his storytelling powers on the tale of one very, very dark night in Gotham City. It's always darkest before the dawn—if it ever comes… Collects Batman: One Dark Knight #1-3.\n\nImage 1 of 1 (Image credit: DC)\n\nI AM BATMAN VOL. 1\n\nWritten by JOHN RIDLEY\n\nArt by OLIVIER COIPEL, STEPHEN SEGOVIA, and TRAVEL FOREMAN\n\nCollection cover by OLIVIER COIPEL\n\n$24.99 US | 176 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-661-9\n\nON SALE 8/23/22\n\nIn the throes of Future State, the streets of Gotham City cry for justice and Jace Fox answers the call! With a new and improved Batsuit, Jace hits the streets to inspire and protect as he seeks out the voice of misinformation and violence—the anarchistic Anti-Oracle! Can the new Dark Knight counterbalance a plan to foment armed rebellion in the citizens of Gotham?! Can one man inspire a city?! Collecting I Am Batman #0-5!\n\n\"Exciting, brutal, and unnerving.\" — AIPT\n\n\"A fantastic reframing of a protector of Gotham City, one that comes not from the ivory tower but rather the corners of the city that people would rather forget.\" — ComicBook.com\n\nImage 1 of 1 (Image credit: DC)\n\nROBIN & BATMAN\n\nWritten by JEFF LEMIRE\n\nArt and cover by DUSTIN NGUYEN\n\n$24.99 US | 144 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-659-6\n\nON SALE 8/16/22\n\n\n\nThe legendary story of Batman and Robin has reached nearly mythic proportions. The crime-fighting Dynamic Duo are always one step ahead of the criminals they pursue and no case is too big for the pair. This isn't that story. This is the story of a young Dick Grayson, newly orphaned, struggling to find his way in a strange, difficult, dark new world…this is the story of Robin and Batman. Collecting Robin & Batman #1-3!\n\n\"Amazing in every sense. The story is great. The art is beautiful. The combo is unreal.\" — Graphic Policy\n\n\"A gorgeous retelling of the first days of the iconic dynamic duo, focusing deeply on the characters and their traumas, personalities, and the struggles to retain who they are in this burgeoning partnership.\" — Comicon\n\nImage 1 of 1 (Image credit: DC)\n\nHARLEY QUINN: THE ANIMATED SERIES VOL. 1: THE EAT. BANG! KILL. TOUR\n\nWritten by TEE FRANKLIN\n\nArt by MAX SARIN and ERICH OWEN\n\nCover by MAX SARIN\n\n$24.99 US | 144 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-664-0\n\nON SALE 8/30/22\n\n\n\nHarley and Ivy are on the road trip of the century! Following the wedding disaster of the decade, Harley Quinn and Poison Ivy end up on the run from Commissioner Gordon and the GCPD! But as fun as that all sounds, Ivy still worries about her actions after Kite Man left her at the altar…luckily, Harley's got the perfect scheme to shake her out of her wedding day blues. A HarlIvy Moon! But when they come face-to-face with one obstacle after another—old lovers? trust issues? childhood trauma?—not to mention a bevy of villains with their own bones to pick, will this Thelma and Louise-style journey end in victory, or tragedy?\n\nThis hardcover packs in the entire run of the GLAAD Media Award-nominated series. Collects Harley Quinn: The Animated Series: The Eat. Bang! Kill. Tour #1-6.\n\nImage 1 of 1 (Image credit: DC)\n\nHARLEY QUINN: 30 YEARS OF THE MAID OF MISCHIEF THE DELUXE EDITION\n\nWritten by VARIOUS\n\nArt by VARIOUS\n\nCover by JIM LEE and SCOTT WILLIAMS\n\n$49.99 US | 336 pages | 7 1/16\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-718-0\n\nON SALE 9/6/22\n\n\n\nCelebrate three decades of madcap fun with DC's breakout antihero—Harley Quinn!\n\nPacking a mallet and a PhD, this Gotham City Siren isn't afraid to dish out some punishment or insightful psychotherapy when needed. Whether she's making a ruckus in Gotham City for good ol' Bats and Mr. J or living it up in Coney Island with her motley crew of pals, adventure and absurdity are never far behind. Featuring more than a dozen tales of anarchic antics spanning Harley's comics career, this deluxe hardcover collection is sure to crack some sides and heads.\n\nCollects stories from The Batman Adventures #12, Detective Comics #831, The Batman and Robin Adventures #18, Batman: Gotham Adventures #10, Batman: Gotham Knights #14, Harley Quinn #3, Gotham City Sirens #20-21, Harley Quinn Holiday Special #1, Harley Quinn: Be Careful What You Wish For Special Edition #1, Harley Quinn 25th Anniversary Special #1, Harley Quinn: Make 'em Laugh #3, Harley Quinn Black + White + Red #14, Batman #98, and a brand-new story from Harley Quinn 30th Anniversary Special #1.\n\nImage 1 of 1 (Image credit: DC)\n\nWONDER GIRL: HOMECOMING\n\nWritten by JOËLLE JONES\n\nArt by JOËLLE JONES, ADRIANA MELO, and LEILA DEL DUCA\n\nCover by JOËLLE JONES\n\n$39.99 US | 272 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-666-4\n\nON SALE 8/30/22\n\n\n\nThe story of Yara Flor starts here! Raised in the far-off land of Boise, Idaho, Yara has always felt something was missing from her life—and now she is headed to Brazil to find it. Little does she know her arrival will set off a series of events that will change the world of Wonder Woman forever. Her return has been prophesied, and with that prophecy comes the undivided attention of benevolent gods from pantheons beyond. Danger lurks around every corner, but is this young hero ready for her journey? Collects Future State: Wonder Woman #1-2, Infinite Frontier #0, Wonder Girl #1-7, and Trial of the Amazons: Wonder Girl #1-2.\n\nImage 1 of 1 (Image credit: DC)\n\nWONDER WOMAN BLACK & GOLD\n\nWritten by MARIKO TAMAKI, BECKY CLOONAN, STEPHANIE WILLIAMS, and others\n\nArt by RYAN SOOK, JAMIE McKELVIE, MARGUERITE SAUVAGE, and others\n\nCover by JEN BARTEL\n\n$39.99 US | 272 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-658-9\n\nON SALE 8/9/22\n\n\n\nIn celebration of Wonder Woman's 80th anniversary, DC Comics proudly presents a new anthology starring the Amazon Princess embellished in the color of her famous lasso. You won't want to miss these thrilling tales celebrating the woman who inspires us all…and that's the truth! Witness comics' brightest stars engaging with moments throughout Diana's history, encouraging fans to rediscover some of her most fearsome villains and iconic allies! Collects Wonder Woman: Black & Gold #1-6.\n\n\n\nImage 1 of 1 (Image credit: DC)\n\nDC July 2022 comic books\n\nACTION COMICS #1045\n\nWritten by PHILLIP KENNEDY JOHNSON\n\nArt by RICCARDO FEDERICI\n\nBackup story art by DAVID LAPHAM\n\nCover by LUCIO PARRILLO\n\nVariant cover by RAFAEL SARMENTO\n\n$4.99 US | 40 pages | Variant $5.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nThe Warworld Revolution escalates as Superman gains the upper hand, forcing Mongul to take desperate measures. Meanwhile, a fallen ally of Superman is resurrected…at a terrible cost. A new connection to Jack Kirby's Fourth World is revealed as the Warworld Saga's mind-blowing conclusion nears! Then, in \"A World Without Clark Kent\"—Lois Lane and John Henry Irons race against time to save Thao-La, testing the limits of the mysterious element Genesis!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nAQUAMAN & THE FLASH: VOIDSONG #2\n\nWritten by JACKSON LANZING and COLLIN KELLY\n\nArt by VASCO GEORGIEV\n\nCover by MIKE PERKINS\n\nVariant cover by VASCO GEORGIEV\n\n$6.99 US | 56 pages | 2 of 3 | Prestige\n\nON SALE 7/19/22\n\n\n\nThe true purpose of the Voidsong is revealed! The end of the world was just the beginning! With the Voidsong's influence spreading deep into the fabric of reality, Aquaman and the Flash are the only heroes left standing. The apocalyptic circumstances seem to have finally forged a true partnership between these two disparate heroes, which raises a glimmer of hope. But as they head beneath the waves to do battle with the entity behind the song, what closely guarded secret will shatter the trust they'd formed?\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nAQUAMAN: ANDROMEDA #2\n\nWritten by RAM V\n\nArt and cover by CHRISTIAN WARD\n\nVariant cover by DOUG BRAITHWAITE\n\n1:25 variant cover by CASPAR WIJNGAARD\n\n$6.99 US | 48 pages | 2 of 3 | 8 1/2\" x 10 7/8\" | Prestige Plus\n\nON SALE 8/2/22\n\n\n\nWhen an underwater explosion rocks the crew of the Andromeda, Aquaman comes to their rescue, but the damage has already been done. The explosion has damaged the ship's core and unleashed a sickness that will threaten everyone on board. But as tensions flare, Black Manta makes his move—it's information he's after, but what do ancient aliens have to do with Atlantis?\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nAQUAMEN #6\n\nWritten by CHUCK BROWN and BRANDON THOMAS\n\nArt by SAMI BASRI\n\nCover by TRAVIS MOORE\n\nVariant cover by FICO OSSIO\n\nVariant cover by PHILIP TAN\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nA Dark Crisis tie-in issue! After hearing about Arthur's death, Mera and the others must each find a way to come to terms with their loss and move forward. In his time of grief, Jackson finds comfort from the last person he ever expected…his father!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nBATGIRLS #8\n\nWritten by BECKY CLOONAN and MICHAEL W. CONRAD\n\nArt and cover by ROBBI RODRIGUEZ\n\nCover by JORGE CORONA\n\nVariant cover by AUDREY MOK\n\n1:25 variant cover by RIAN GONZALES\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nThe Batgirls break into the Iceberg Lounge in order to rescue Seer, who's held hostage by the Saints! Nightwing and Oracle get dressed up and go undercover to help the Batgirls, while also making the mission a date night! But why would they help Seer, the very person who's been hacking into their network and harassing them? Read here to find out!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBATMAN BEYOND: NEO-YEAR #4\n\nWritten by COLLIN KELLY and JACKSON LANZING\n\nArt and cover by MAX DUNBAR\n\nVariant cover by CHRISTIAN WARD\n\n$3.99 US | 32 pages | 4 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nThe Sword of Gotham strikes! Neo-gotham gave Terry McGinnis a chance to leave—he was warned a Batman could not live in this new city. Terry refused and now he'll have to live with the consequences: a fight for his life with Neo-Gotham's unstoppable soldier, the Sword of Gotham. Tonight Batman Beyond falls.\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nBATMAN: FORTRESS #3\n\nWritten by GARY WHITTA\n\nArt and cover by DARICK ROBERTSON\n\nVariant cover by MICO SUAYAN\n\n$3.99 US | 32 pages | 3 of 8 | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nTime is running out after a disastrous first encounter with the invading alien force, and Batman is forced to change his tactics and team up with the last person on Earth he could have expected. The mystery deepens around the absent Man of Steel, as the alien motives become more clear…Could there be secrets to his disappearance at the Fortress of Solitude?\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nBATMAN: KILLING TIME #5\n\nWritten by TOM KING\n\nArt and cover by DAVID MARQUEZ\n\nVariant cover by KAEL NGU\n\n1:25 variant cover by BEN OLIVER\n\n$4.99 US | 40 pages | 5 of 6 | Variant $5.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nThe heist of the century has gone so far sideways that an all-out and very bloody gang war is imminent, with Batman, Riddler, and Catwoman caught in the crossfire. What is the mysterious object that so many are willing to murder so many for, and how does it connect to Bruce Wayne? As we reach the climax of this thrilling series, the clock strikes its deadly hour—the time for killing is here!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBATMAN: THE KNIGHT #7\n\nWritten by CHIP ZDARSKY\n\nArt and cover by CARMINE DI GIANDOMENICO\n\nVariant cover by RICCARDO FEDERICI\n\n$4.99 US | 40 pages | 7 of 10 | Variant $5.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\nMagic is in the air as Bruce Wayne travels to New York City to study under the legendary John Zatara and his daughter, Zatanna. But there's dark magic loose in the Big Apple, and Bruce's path toward becoming Batman must cross it. Will a man who is training his body and mind to combat crime be ready for a spiritual threat?\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nBATMAN: URBAN LEGENDS #17\n\nWritten by RYAN CADY, JOEY ESPOSITO, ALEX PAKNADEL, and DAN WATTERS\n\nArt by GLEB MELNIKOV, SERG ACUÑA, AMANCAY NAHUELPAN, and RILEY ROSSMO\n\nCover by JIM CHEUNG and JAY DAVID RAMOS\n\nVariant covers by GLEB MELNIKOV, SEBASTIAN FIUMARA, and GARY FRANK\n\n$7.99 US | 64 pages | Prestige\n\nON SALE 7/12/22\n\n\n\nA blockbuster issue! Batman teams up with the Flash, Aquaman, and Black Adam in three spectacular stories in this special issue of Batman: Urban Legends, celebrating the Dark Knight's monumental year on the silver screen! Also features a Bat-villain-centric bonus story. Brought to you by four stellar creative teams. Perfect for old fans and new readers alike!\n\n\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBLACK ADAM #2\n\nWritten by CHRISTOPHER PRIEST\n\nArt by RAFA SANDOVAL\n\nCover by IRVIN RODRIGUEZ\n\nVariant covers by RAFA SANDOVAL and BRANDON PETERSON\n\n1:25 variant cover by SIMONE DI MEO\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\n\"I am not a hero, I'm a god.\" Who is Black Adam? His power and his very life draining from him, Theo Teth-Adam is confronted by a specter from his past haunting him with the treachery he employed to gain his powers and forcing him to confront an inescapable truth: there is no redemption for Black Adam.\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nBLOOD SYNDICATE: SEASON ONE #3\n\nWritten by GEOFFREY THORNE\n\nArt by CHRISCROSS and JUAN CASTRO\n\nCover by DEXTER SOY\n\nVariant cover by JAMAL IGLE\n\n$3.99 US | 32 pages | 3 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nWith Wise Son framed for the attack on the Blue Street Syndicate HQ, the Paris Island police are looking for answers…but Wise doesn't break easily. He's got secrets to keep—including the story of just what went down in Sadaqah and how he, Tech-9, and Iron Butterfly got their powers!\n\nImage 1 of 1 (Image credit: DC)\n\nCATWOMAN #45\n\nWritten by TINI HOWARD\n\nArt by NICO LEON\n\nCover by JEFF DÉKAL\n\nVariant cover by JENNY FRISON\n\n1:25 variant cover by SOZOMAIKA\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\nRoman Sionis has been brought to his knees, but enough is enough. Catwoman's vacation is over and it's time to get back to work. But Selina has never been Gotham's only protector, and she'll have to contend with a well-meaning family of bats…What's that old saying? The enemy of my enemy…should back off and let me handle it!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDC VS. VAMPIRES #7\n\nWritten by MATTHEW ROSENBERG and JAMES TYNION IV\n\nArt by OTTO SCHMIDT\n\nCover by GUILLEM MARCH\n\nVariant cover by FRANCESCO MATTINA\n\n1:25 variant cover by LEIRIX\n\n$3.99 US | 32 pages | 7 of 12 | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nThe nightmarish second arc begins! The Earth is now cloaked in darkness as the victorious vampire empire has taken full control. Pockets of humanity can still be found, and they struggle to live but hope fades with every darker day. The leaders of the last surviving resistance force—Green Arrow, Batgirl, and Supergirl—hatch a desperate plan to save the world…or die trying!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDEATHSTROKE INC. #11\n\nWritten by ED BRISSON\n\nArt by DEXTER SOY\n\nCover by MIKEL JANÍN\n\nVariant cover by FRANCESCO MATTINA\n\n1:25 variant cover by IVAN TAO\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\n\"Deathstroke: Year One\" continues! To escape the banality of family life, Slade Wilson, the failed soldier and test subject, undertakes his first assassination mission. His target is the last surviving doctor from the experiment that gave him his powers! Slade doesn't need his heightened senses to tell him something is wrong with all of this…but will his intuition stay his hand when the time comes for the final death stroke?\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nDUO #3\n\nWritten by GREG PAK\n\nArt by KHOI PHAM and SCOTT HANNA\n\nCover by DIKE RUAN\n\nVariant cover by JESSICA FONG\n\n$3.99 US | 32 pages | 3 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\nEnter the Immutables, who make Dr. Kelly Vu and Dr. David Kim's super-heroic body-sharing problems feel downright frivolous when they make their position clear—mere humans are not meant to live forever, and these godlike beings will put an end to anyone who tries!\n\nImage 1 of 1 (Image credit: DC)\n\nFABLES #153\n\nWritten by BILL WILLINGHAM\n\nArt by MARK BUCKINGHAM and STEVE LEIALOHA\n\nCover by QISTINA KHALIDAH\n\nVariant cover by MARK BUCKINGHAM\n\n$3.99 US | 32 pages | 3 of 12 | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\n\"Don't come back until you've had a big adventure!\" What's the worst that could happen? In order to get a bit of work done, Bigby has sent his young ones off into the Black Forest, but to Snow, this only spells danger. How well equipped are her cubs to face down the creatures that lurk within the woods?\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nFUTURE STATE: GOTHAM #15\n\nWritten by DENNIS CULVER\n\nArt by GEOFFO\n\nCover by SIMONE DI MEO\n\nVariant cover by MIKE BOWDEN\n\n3.99 US | 32 pages | Black and White | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\n\"Batmen at War \" part three! There's a new Batman in Gotham City and his name is…Dick Grayson? The only problem is, Jace Fox and Bruce Wayne still claim the name and neither is willing to give it up! Now it's all-out war, with Jason Todd and Hunter Panic caught in the middle. Plus: Damian Wayne is back and that's bad news for everyone!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nHARLEY QUINN #17\n\nWritten by STEPHANIE PHILLIPS\n\nArt and cover by RILEY ROSSMO\n\nVariant cover by DERRICK CHEW\n\n1:25 variant cover by LEIRIX\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nIt's the moment we've been building toward for months! The rumble in the jungle! But actually in Gotham, because we're not in the jungle. It's the throwdown showdown between me, your hyper-verbal, semi-reformed former villain, and Verdict, the violent vigilante vowing to have vengeance on…well, everybody! Can I clear my name after being locked up for a crime I didn't commit?\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nI AM BATMAN #11\n\nWritten by JOHN RIDLEY\n\nArt and cover by CHRISTIAN DUCE\n\nVariant cover by SALVADOR LAROCCA\n\n1:25 variant cover by RAFAEL ALBUQUERQUE\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nFollowing the stunning conclusion of the previous issue, Jace Fox and his \"task force\" are upended! Taking Manray into custody could be a deadly prospect for Chubb and Whitaker…and what secrets does this mass murderer hold?\n\n\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nJUSTICE LEAGUE VS. THE LEGION OF SUPER-HEROES #5\n\nWritten by BRIAN MICHAEL BENDIS\n\nArt and cover by SCOTT GODLEWSKI\n\nVariant cover by TRAVIS MOORE\n\n3.99 US | 32 pages | 5 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nWith the reveal of who is behind the great darkness that is tearing the galaxy apart, the Justice League and the Legion of Super-Heroes are at odds over how to handle the incomprehensible evil that has brought them together. This time-spanning epic stars all your favorite superheroes from two different time periods! Batman! Saturn Girl! Superman! Brainiac 5! Naomi!...and dozens more race into battle to save the galaxy from being pulled apart! But at what cost? Will everyone survive this?\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nLOONEY TUNES #267\n\nWritten by SHOLLY FISCH\n\nArt by WALTER CARZON and HORACIO OTTOLINI\n\nCover by WALTER CARZON\n\n$2.99 US | 32 pages\n\nON SALE 7/19/22\n\n\n\nIt was bad enough when Foghorn Leghorn came down with a bad case of (what else?) chicken pox. But now the farmyard is quarantined, and Foghorn's \"cooped\" up for a week with his archrival, the Barnyard Dawg. With nowhere to go and nothing to do, an ever-escalating war of pranks and practical jokes begins. How long will it take before the situation blows up out of all proportion?\n\nImage 1 of 1 (Image credit: DC)\n\nMAD MAGAZINE #27\n\nWritten by THE USUAL GANG OF IDIOTS\n\nArt by THE USUAL GANG OF IDIOTS WITH CRAYONS\n\nCover by A YET-TO-BE-DETERMINED IDIOT\n\n$5.99 US | 56 pages\n\nON SALE 8/2/22\n\n\n\nCelebrate 70 years of America's longest-running humor magazine! MAD continues to skewer everything pop culture! The October issue features a spooktacular variety of horrific classic parodies plus monstrous MAD favorites like Spy vs. Spy, \"A MAD Look at…\" by Sergio Aragonés, and more from the Usual Gang of Idiots. MAD will surely make the whole family shudder with laughter and shiver with silliness.\n\nImage 1 of 1 (Image credit: DC)\n\nMONKEY PRINCE #6\n\nWritten by GENE LUEN YANG 楊謹倫\n\nArt and cover by BERNARD CHANG 張伯納\n\nVariant cover by MARCUS TO 杜世柱\n\n1:25 variant cover by KIM JACINTO\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nMarcus finds himself and his traveling-henchpeople parents in Amnesty Bay on their next villain's gig…with Black Manta! And that only means one thing—Monkey Prince finds himself in yet another new high school! But when a mysterious goth girl named Sandra appears in school, Monkey Prince discovers she's the key to finding Monkey King's jingu bang…which is located somewhere in Atlantis!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nNAOMI: SEASON TWO #5\n\nWritten by BRIAN MICHAEL BENDIS and DAVID F. WALKER\n\nArt and cover by JAMAL CAMPBELL\n\n$3.99 US | 32 pages | 5 of 6\n\nON SALE 7/12/22\n\n\n\nThe penultimate issue of this blockbuster miniseries sees Naomi McDuffie face to face with a full-scale invasion! The town of Port Oswego has been invaded by a nightmare called Zumbado. Now Naomi must fight with everything she's got to protect her adopted hometown from the onslaught from her homeworld. All this and a very super special reveal!\n\nImage 1 of 1 (Image credit: DC)\n\nNIGHTWING #94\n\nWritten by TOM TAYLOR\n\nArt and cover by BRUNO REDONDO\n\nVariant cover by JAMAL CAMPBELL\n\n1:25 variant cover by DAVID TALASKI\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/19/22\n\n\n\nThere's a new commissioner in town, and it's none other than Maggie Sawyer! But one clean commissioner does not make a whole bad basket of Blüdhaven police officers good, and now Blockbuster is forced to lean more on Nightwing's sister, Mayor Zucco, to oversee the old commissioner's illegal dealings…Then, an attack on Haven reveals some shocking truths to Nightwing and Oracle that make it difficult to recover from.\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nNUBIA: QUEEN OF THE AMAZONS #2\n\nWritten by STEPHANIE WILLIAMS\n\nArt by ALITHA MARTINEZ and MARK MORALES\n\nCover by KHARY RANDOLPH\n\nVariant cover by TAURIN CLARKE\n\n$3.99 US | 32 pages | 2 of 4 | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nAfter a disastrous first foray into Man's World as queen of the Amazons, Nubia is left at death's door! As she fights for her life, her fellow Amazons search for the culprit who tried to assassinate their beloved leader. The clock is ticking: Will this trip in the name of peace prove fatal?\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nPOISON IVY #2\n\nWritten by G. WILLOW WILSON\n\nArt by MARCIO TAKARA\n\nCover by JESSICA FONG\n\nVariant covers by JENNY FRISON and CLAIRE ROE\n\n1:25 variant cover by ÁLVARO MARTÍNEZ BUENO\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/5/22\n\n\n\nDestroying humanity is a lot of work, and a girl's gotta eat! On her journey to doom humankind, Ivy makes a pit stop at a roadside restaurant, where she meets a hungry poet who makes her question her motives—at least until the cops show up. Ivy has left Gotham, but she can't seem to escape the law!\n\nImage 1 of 4 (Image credit: DC) (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nROBIN #16\n\nWritten by JOSHUA WILLIAMSON\n\nArt and cover by ROGER CRUZ and NORM RAPMUND\n\nVariant cover by SIMONE DI MEO\n\n1:25 ROBIN '66 variant cover by DAN SCHOENING\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nRobin's investigation into Lazarus Island is put on hold as Lord Death Man strikes. Damian and Hawke are called to Tokyo by Flatline to help her deal with her crazed mentor. Which means…killer-bros road trip!\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nSUPERMAN: SON OF KAL-EL #13\n\nWritten by TOM TAYLOR and NICOLE MAINES\n\nArt by CLAYTON HENRY\n\nCover by TRAVIS MOORE\n\nVariant cover by A.L. KAPLAN\n\n1:25 variant cover by CLAYTON HENRY\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nIt's the dramatic DCU debut of Dreamer! When every hero on Earth is threatened by Henry Bendix's machinations, it's a race against time for Dreamer to warn Superman before it happens! But will this mysterious new ally's premonition become a nightmare for Jonathan Kent?\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nTASK FORCE Z #10\n\nWritten by MATTHEW ROSENBERG\n\nArt and cover by EDDY BARROWS and EBER FERREIRA\n\nVariant cover by TRAVIS MERCER\n\n1:25 variant cover by RYAN BROWN\n\n$3.99 US | 32 pages | 10 of 12 | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nThe rise of Powers Industries! Red Hood and what remains of his Task Force Z squad are on the run and investigating the secrets of their former benefactor, Powers Industries. What they discover will change Batman history forever. Meanwhile, inside Powers Industries, Mr. Bloom and Man-Bat are hard at work betraying their teammates with no remorse.\n\nImage 1 of 3 (Image credit: DC) (Image credit: DC) (Image credit: DC)\n\nTHE JURASSIC LEAGUE #3\n\nWritten by DANIEL WARREN JOHNSON and JUAN GEDEON\n\nArt by JUAN GEDEON\n\nCover by DANIEL WARREN JOHNSON\n\nVariant cover by GUSTAVO DUARTE\n\n$3.99 US | 32 pages | 3 of 6 | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nWith Wonderdon entering the fray to help Batsaur and Supersaur defeat Brontozarro, the Jurassic League has officially formed! But Darkseid's mysterious machinations continue to reveal themselves, and this Triassic trinity might not be enough to stop him. Luckily a heroic hadrosaur has joined the battle. Enter the Green Torch!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nTHE SANDMAN UNIVERSE: NIGHTMARE COUNTRY #4\n\nWritten by JAMES TYNION IV\n\nArt by LISANDRO ESTHERREN and DANI\n\nCover by REIKO MURAKAMI\n\nVariant cover by DANI\n\n1:25 variant cover by DAVE JOHNSON\n\n$3.99 US | 32 pages | Variant $4.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nThe Corinthian's hunt for answers about the Smiling Man transcends even his own self-preservation as he returns to the waking world—and his unlikely human partner—in defiance of Dream's orders. But when he finds out just how many people have seen the Smiling Man? Then the bodies are going to start hitting the floor…\n\nImage 1 of 1 (Image credit: DC)\n\nTHE SWAMP THING #15\n\nWritten by RAM V\n\nArt and cover by MIKE PERKINS\n\nVariant cover by CHARLIE ADLARD\n\n$3.99 US | 32 pages | 15 of 16 | Variant $4.99 US (card stock)\n\nON SALE 7/26/22\n\n\n\nThe Earth stands on the precipice of destruction as the Parliament of Trees considers a truly dangerous proposal from the Pale Pilgrim. Now Swamp Thing is all that stands between the natural world and Armageddon…or is he? Enter Trinity—an unprecedented being created by humankind's most destructive moment who may prove to be our only hope of salvation.\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nWONDER WOMAN #789\n\nWritten by BECKY CLOONAN, MICHAEL W. CONRAD, and JORDIE BELLAIRE\n\nArt by EMANUELA LUPACCHINO and PAULINA GANUCHEAU\n\nCover by YANICK PAQUETTE\n\nVariant cover by PAUL POPE\n\n$4.99 US | 40 pages\n\nVariant $5.99 US (card stock)\n\nON SALE 7/12/22\n\n\n\nMan-ifest your future! Thanks to Cizko's new catchphrase, he's gained fans, and more importantly, soldiers in his war against Wonder Woman. But with Checkmate at our hero's side, the depraved doctor will have to bring in big guns like...the Duke of Deception! Will this former agent of Ares prove too much for the Amazon Princess? Plus, a growing danger lurks on the island of Diana's youth in our backup story!\n\nImage 1 of 2 (Image credit: DC) (Image credit: DC)\n\nDC July 2022 collections\n\nDC POSTER PORTFOLIO: BRIAN BOLLAND Art and cover by BRIAN BOLLAND $24.99 US | 42 pages | 12\" x 16\" | Softcover\n\nISBN: 978-1-77951-749-4\n\nON SALE 12/27/22\n\n\n\nOne of DC's most acclaimed artists finally receives his own poster book! Showcasing nearly four decades of Brian Bolland's amazing covers ranging from Animal Man to The Joker to Zatanna, this collection features 20 removable pages that can be kept together as a single portfolio or individually framed for display.\n\nImage 1 of 1 (Image credit: DC)\n\nDEATHSTROKE INC. VOL. 1: KING OF THE SUPER-VILLAINS\n\nWritten by JOSHUA WILLIAMSON\n\nArt by HOWARD PORTER, PAOLO PANTALENA, and TREVOR HAIRSINE\n\nCover by FRANCESCO MATTINA\n\n$29.99 US | 208 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-657-2\n\nON SALE 8/9/22\n\n\n\nAfter suffering too many losses, Slade Wilson decides it's time for a change. When he's enlisted to work with an ages-old secret organization called T.R.U.S.T. that wants to take down the heavy-hitter villains, he's all in. They'll supply him with an all-new team and resources for his new mission into the depths of the weirdest parts of the DCU. Including a new partner…Black Canary! Collects Deathstroke Inc. #1-7 and Batman: Urban Legends #6.\n\nImage 1 of 1 (Image credit: DC)\n\nHARLEY QUINN & THE GOTHAM CITY SIRENS OMNIBUS (2022 EDITION)\n\nWritten by PAUL DINI, PETER CALLOWAY, TONY BEDARD, and others\n\nArt by GUILLEM MARCH, ANDRES GUINALDO, and others\n\nCover by GUILLEM MARCH\n\n$100.00 US | 648 pages | 7 1/4\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-676-3\n\nON SALE 9/20/22\n\n\n\nOffered again! Catwoman, Poison Ivy, and Harley Quinn are tired of playing by other people's rules. These tough ladies have a new agenda that's all their own, and they'll use any means necessary to pursue it. But can they get along and work as a team? This omnibus collects the complete 26-issue series as well as Catwoman #83, with an introduction by Paul Dini!\n\nImage 1 of 1 (Image credit: DC)\n\nHARLEY QUINN VOL. 2: KEEPSAKE\n\nWritten by STEPHANIE PHILLIPS\n\nArt by RILEY ROSSMO and LAURA BRAGA\n\nCover by RILEY ROSSMO\n\n$16.99 US | 168 pages | 6 5/8\" x 10 3/16\" | Softcover\n\nISBN: 978-1-77951-663-3\n\nON SALE 8/23/22\n\n\n\nHugo Strange, out-of-control orderlies, kidnapped clowns, and a new villain named Keepsake…it's a lot for any one former villain turned antihero turned real hero with impeccable fashion sense to handle. With all the Fear State happening in Gotham, I thought it would be a good time to go on a little camping trip. But, turns out, Gotham is gonna be Gotham. Keepsake's forming a new army, Hugo's playin' dress-up, and the city is literally tearing itself apart. Collects Harley Quinn #7-12!\n\nImage 1 of 1 (Image credit: DC)\n\nJOKER/HARLEY: CRIMINAL SANITY\n\nWritten by KAMI GARCIA\n\nArt by MICO SUAYAN, JASON BADOWER, and MIKE MAYHEW\n\nCover by FRANCESCO MATTINA\n\n$24.99 US | 312 pages | 8 1/2\" x 10 7/8\" | Softcover\n\nISBN: 978-1-77951-720-3\n\nON SALE 9/13/22\n\n\n\nIn Gotham City, heinous acts of violence occur daily. Harley Quinn, forensic psychiatrist, consults with the GCPD on its worst cases. But one unsolved murder still haunts her—her roommate was the last victim of the notorious serial killer known as The Joker. Five years later, that case remains unsolved, and as Harley's past and present cases collide, she must decide how far she is willing to go. Joker/Harley: Criminal Sanity introduces readers to a Joker and Harley Quinn unlike any they've seen before, utilizing forensic psychiatry, behavior analysis, and psychological profiles to create a true-to-life take on these iconic characters that is more terrifying than any psychotic fantasy. This collection includes issues #1-8, Joker/Harley: Criminal Sanity – Secret Files #1, and an all-new story from the Harley Quinn 30th Anniversary Special!\n\nImage 1 of 1 (Image credit: DC)\n\nTHE JOKER PRESENTS: A PUZZLEBOX\n\nWritten by MATTHEW ROSENBERG\n\nArt by JESUS MERINO, JOSHUA HIXSON, KERON GRANT, DANI, VICENTE CIFUENTES, DOMINIKE \"DOMO\" STANTON, JUNI BA, VANESA DEL REY, RICARDO LÓPEZ ORTIZ, CHRISTOPHER MOONEYHAM, FREDDIE E. WILLIAMS II, SHAWN CRYSTAL, JUAN DOE, and MIKE NORTON\n\nCover by CHIP ZDARSKY\n\n39.99 US | 248 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-662-6\n\nON SALE 8/23/22\n\n\n\nYou can call Yhe Joker a lot of things—psychopathic, murderous, disturbed, obsessed, anarchic, maybe even genuinely funny. But one thing no one would call him, regardless of what side of the law they might fall on, is dependable. The Joker will double-cross his own partners on a whim, let alone anyone trying to stop him. Yet when it comes to solving one of the strangest, most perplexing mysteries to ever hit Gotham, the Joker's word is about all that the GCPD has. A mystery with the most unreliable narrator in the DC Universe, this seven-issue miniseries finds Commissioner Gordon and the rest of the GCPD with a headline-grabbing crime on their hands, a suspect list that includes just about every villain in Gotham, and only the Clown Prince of Crime's testimony as a lead. But how much of what The Joker says can you believe? Was he behind the crime, or just a witness? Is that red stain on his shirt just a little strawberry jelly like he claims? And most importantly, who killed the Riddler? On top of all the puzzles and mysteries and the crazy cast of characters, this collection showcases some of the finest talent working in comics today. Collects The Joker Presents: A Puzzlebox #1-7.\n\nImage 1 of 1 (Image credit: DC)\n\nHOUSE OF MYSTERY: THE BRONZE AGE OMNIBUS VOL. 3\n\nWritten by VARIOUS\n\nArt by VARIOUS\n\nCover by RYAN SOOK\n\n$150.00 US | 912 pages | 7 1/16\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-132-4\n\nON SALE 9/27/22\n\n\n\nWelcome to the House of Mystery, where bone-chilling (and rib-tickling) revelations haunt every dark and shadowed room—and people are dying to get in! This third volume of deliciously devilish tales spearheaded by legendary comics editor Joe Orlando showcases even more of the Bronze Age's greatest writers and illustrators. Collects House of Mystery #227-254.\n\nImage 1 of 1 (Image credit: DC)\n\nKAMANDI BY JACK KIRBY VOL. 1\n\nWritten by JACK KIRBY Art and cover by JACK KIRBY $39.99 US | 456 pages | 6 5/8\" x 10 3/16\"| Softcover\n\nISBN: 978-1-77951-631-2\n\nON SALE 8/9/22\n\n\n\nA great disaster has destroyed civilization, leaving a young boy to search for safe haven in a world populated by mutated animals and strange wonders. Join Kamandi's band of anthropomorphic supporting characters as they search for answers and adventure across the wastelands of Earth! In this volume, legendary comics creator Jack Kirby introduces a whole new world as Kamandi faces dangers unimaginable with an open heart, a savvy mind, and brave friends! Collects Jack Kirby's run on Kamandi, the Last Boy on Earth #1-20.\n\nImage 1 of 1 (Image credit: DC)\n\nNEW TEEN TITANS OMNIBUS VOL. 1 (2022 EDITION)\n\nWritten by MARV WOLFMAN\n\nArt by GEORGE PÉREZ, ROMEO TANGHAL, and others\n\nCover by GEORGE PÉREZ and DICK GIORDANO\n\n$100.00 US | 692 pages | 7 1/4\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-672-5\n\nON SALE 9/13/22\n\n\n\nOffered again! In 1980, writer Marv Wolfman and artist George Pérez introduced a timeless team including Robin, Kid Flash, Wonder Girl, Cyborg, Changeling, Raven, and Starfire! This omnibus edition collects the team's debut in DC Comics Presents #26, plus The New Teen Titans #1-20, The New Teen Titans Annual #1, The Best of DC (Blue Ribbon Digest) #18, and Tales of the New Teen Titans #1-4.\n\nImage 1 of 1 (Image credit: DC)\n\nSUPERMAN: ACTION COMICS VOL. 2: THE ARENA\n\nWritten by PHILLIP KENNEDY JOHNSON\n\nArt by DANIEL SAMPERE, MIGUEL MENDONÇA, RICCARDO FEDERICI, DALE EAGLESHAM, and WILL CONRAD\n\nCover by DANIEL SAMPERE\n\n$16.99 US | 200 pages | 6 5/8\" x 10 3/16\" | Softcover\n\nISBN: 978-1-77951-717-3\n\nON SALE 8/30/22\n\n\n\nSuperman's greatest battle is only beginning! After learning of an enslaved race with mysterious ties to Krypton, Superman and the Authority travel across space to dethrone the new Mongul and liberate Warworld. But Mongul and his champions are prepared! Now Superman, powerless and captured, will need to team up with other gladiators to turn Warworld's inhabitants against their masters, while the Authority fights Mongul's rule from the shadows. Which heroes will survive, and what will be Warworld's fate? Collects Action Comics #1036-1041.\n\nImage 1 of 1 (Image credit: DC)\n\nTHE JOKER VOL. 2\n\nWritten by JAMES TYNION IV and MATTHEW ROSENBERG\n\nArt and cover by GUILLEM MARCH and FRANCESCO FRANCAVILLA\n\n$24.99 US | 160 pages | 6 5/8\" x 10 3/16\" | Hardcover\n\nISBN: 978-1-77951-665-7\n\nON SALE 8/30/22\n\n\n\nAfter barely surviving in the jungles of Belize, The Joker's fled to Europe! Jim Gordon pursues the super-villain, but the seeds of doubt are sprouting…If The Joker didn't gas Arkham Asylum, who did? And what's the next move for Vengeance, daughter of Bane?\n\nCollecting The Joker #6-9 and The Joker 2021 Annual #1!\n\nImage 1 of 1 (Image credit: DC)\n\nTHE SWAMP THING VOLUME 2: CONDUIT\n\nWritten by RAM V\n\nArt and cover by MIKE PERKINS\n\n$16.99 US | 160 pages | 6 5/8\" x 10 3/16\" | Softcover\n\nISBN: 978-1-77951-716-6\n\nON SALE 8/16/22\n\n\n\nLevi Kamei finds himself pulled into service as the avatar of the Green: first to London, where the scars of old wars and the dangers of past ideologies resurface and then to the land of his making, the Kaziranga wetlands, where he must stop a deadly bio-agent before it poisons the Green, and finally to a terrifying reunion with his brother, Jacob, now transformed into the villainous Hedera. But with these events come revelations as the secrets of Levi's past are revealed and his life, and our world, will never be the same because of them. Collects The Swamp Thing #5-10.\n\nImage 1 of 1 (Image credit: DC)\n\nWHO'S WHO OMNIBUS VOL. 2\n\nWritten by VARIOUS\n\nArt by VARIOUS\n\nCover by BRIAN BOLLAND, GEORGE PÉREZ, and others\n\n$150.00 US | 1,216 pages | 7 1/16\" x 10 7/8\" | Hardcover\n\nISBN: 978-1-77951-519-3\n\nON SALE 9/6/22\n\n\n\nDC's encyclopedia of heroes and villains steps into the 1990s in this massive hardcover continuing the classic Who's Who biography series! Also includes the spin-off series Who's Who in the Legion of Super-Heroes, spotlighting DC's greatest team of the 30th century. Collects Who's Who in the Legion of Super-Heroes #1-7, Who's Who in the DC Universe #1-16, and Who's Who in the DC Universe Update 1993 #1-2.\n\nImage 1 of 1 (Image credit: DC)\n\nWONDER WOMAN VOL. 2: THROUGH A GLASS DARKLY\n\nWritten by BECKY CLOONAN and MICHAEL W. CONRAD\n\nArt by MARCIO TAKARA, TRAVIS MOORE, JIM CHEUNG, and STEVE PUGH\n\nCover by TRAVIS MOORE\n\n$19.99 US | 192 pages | 6 5/8\" x 10 3/16\" | Softcover\n\nISBN: 978-1-77951-660-2\n\nON SALE 8/16/22\n\n\n\nWonder Woman has completed an unforgettable odyssey, but her return to the land of the living won't let her rest in peace any more than her adventures in the Sphere of the Gods! With help from Deadman, Diana must battle new warriors sent by an old foe while she tries to discover what the future holds for the greatest hero of them all! Collects Wonder Woman #780-784, Wonder Woman 2021 Annual #1, and a story from Wonder Woman 80th Anniversary 100-Page Super Spectacular #1.\n\n"}, {"url": "https://docslib.org/doc/5039927/rock-candy-magazine", "page_content": "HARD , S WEET & S TICK Y\n\nMIKE TRAMP’S FIRST GIG FIVE T OP Y OUTUBE FRASHERS – THA T AREN’T MET ALLICA! VINT AGE LED ZEP\n\nMOSCO W MUSIC PEACE FESTIV AL STRICTL Y OLD SCHOOL BADGES MÖTLEY CRÜE’S LAME CANCELLA TION EXCUSE\n\nT ONY IOMMI MEETS APRICOT CR UMBLE MA GNUM SLEEVE DISSECTED\n\nISSUE\n\n2\n\nJune–J ul y 2017\n\n£9.99\n\nMAHOGANY RUSH - ‘LIVE’ FR ANK MARINO - ‘WHA T’S NEXT’ FR ANK MARINO\n\n‘THE POWER OF ROCK AND ROLL ’\n\nFR ANK MARINO - ‘JUGGERNAUT’ CREED - ‘S/T’ SURVIVOR\n\n‘EYE OF THE TIGER’\n\nKING KOBR A - ‘READY TO STRIKE’ KING KOBR A\n\n‘THRILL OF A LIFETIME’\n\n707 - ‘S/T’ 707 - ‘THE SECOND ALBUM’ 707 - ‘MEGAFORCE’ OUTLAWS - ‘PLA YIN’ TO WIN’\n\nSAMMY HAGAR\n\n‘ ALL NIGHT LONG’\n\nSAL TY DOG\n\n‘EVERY DOG HA S IT’S DA Y’\n\nTYKETTO - ‘DON’T COME EA SY’ KICK AXE - ‘VICES’ KICK AXE\n\n‘WELCOME TO THE CLUB’\n\nKICK AXE - ‘ROCK THE WORLD’\n\nNYMPHS -’S/T’ RTZ - ‘RETURN TO ZERO’ W ARTHCHILD AMERICA\n\n‘CLIMBIN’ THE W ALLS’\n\nGIRL - ‘SHEER GREED’ GIRL - ‘W A STED Y OUTH’ LOVE/HA TE\n\n‘BLACKOUT IN THE RED ROOM’\n\nTARGET - ‘S/T’ TARGET - ‘CAPTURED’ MAYDA Y - ‘S/T’ MAYDA Y - ‘REVENGE’ BAD BOY - ‘THE BAND THAT\n\nMIL WAUKEE MADE F AMOUS’\n\nBAD BOY - ‘BACK TO BACK’\n\nCOLLEC TORS\n\nEDITIONS\n\nOUT NOW\n\nREMAS TERED\n\n& RELOADED\n\nA V AILABLE FROM ALL GOOD RECORD ST ORES OR DIRECTL Y T O Y OUR DOOR FROM\n\nWWW .ROCKCANDYRECORDS .COM - LOOK OUT FOR SPECIAL OFFERS\n\nDISTRIBUED BY\n\nCOMIN G SOON\n\nCOLLECTOR’S EDITION\n\nREMASTERED\n\n& RELOADED\n\nLILLIAN AXE - ‘S/T’ LILLIAN AXE - ‘LOVE+W AR ’ W ARR ANT - ‘CHERRY PIE’ W ARR ANT - ‘DIRTY ROTTEN FIL THY\n\nSTINKING RICH’\n\nMOTHER’S FINEST - ‘IRON AGE’\n\nBAD ENGLISH - ‘S/T’ JETBOY - ‘FEEL THE SHAKE’ DOKKEN\n\n‘BEAST FROM THE EA ST’\n\nSTONE FURY\n\n‘BURNS LIKE A STAR ’\n\nALANNAH MILES - ‘S/T’"}, {"url": "https://downinthevalley.com/Store", "page_content": "The Wood Brothers have learned to trust their hearts. For the better part of two decades, they've cemented their reputation as freethinking songwriters, road warriors, and community builders, creating a catalog of diverse music and a loyal audience who’ve grown alongside them through the years. That evolution continues with Heart is the Hero, the band's eighth studio album. Recorded analog to 16-track tape, this latest effort finds its three creators embracing the chemistry of their acclaimed live shows by capturing their performances in real-time direct from the studio floor with nary a computer in sight. An acoustic-driven album that electrifies, Heart is the Hero is stocked with songs that target not only the heart, but the head and hips, too.\n\n\n\n\"We love records that come from the era of less tracks and more care,\" explains co-founder Oliver Wood. \"When you use a computer during the tracking process, you have an infinite number of tracks at your disposal, which implies that nothing is permanent, and everything can be fixed. Tape gives you limitations that force you to be creative and intentional. You don't look at the music on a screen; you listen to it, and you learn to focus on the feeling of the performance.”\n\n\n\nThroughout Heart is the Hero, those performances are matched by the visceral storytelling and songwriting chops that have turned The Wood Brothers into Grammy-nominated leaders of American roots music, even as their music reaches far beyond the genre's borders. The stripped-down swagger of \"Pilgrim'' underscores Oliver's reminder to slow down and experience each moment as an interactive observer, rather than a passive tourist. A similar theme anchors “Between the Beats,\" where Oliver draws upon a meditation technique — maintaining one's focus on the space between heartbeats — to reach a new level of presence. The gentle sway of country soul gem “Rollin’ On,” featuring horns by Matt Glassmeyer and Roy Agee, expounds on the time-honored tradition of love as the guiding light through darkness, while ”Mean Man World\" finds Chris Wood singing about his responsibilities as a father whose young daughter is poised to inherit an uncertain future. \"Line Those Pockets'' is a universal call for mercy and understanding over materialism. \"Everybody's just trying to be happy, so put your money away; line those pockets with grace,\" the band sings in three-part harmony during the song's chorus, which emphasizes compassion over cash as the world's true currency. Together, these songs offer a snapshot of a spirited, independent-minded group at the peak of its powers, always pushing forward and seeking to evolve beyond what’s come before.\n\n\n\n\"There's still acoustic guitar, upright bass, and percussion on this album — things people use all the time — but we're always thinking, 'How can we make this sound like us, but not like something we've already done?'\" Oliver says. \"Sometimes, the only way to do that is to get weird.”\n\n\n\nThat sense of exploration pumps its way through Heart is the Hero like lifeblood. Arriving on the heels of 2019's Live at The Fillmore, 2020's Kingdom In My Mind, and Oliver Wood's solo album Always Smilin' — all of which were released on Honey Jar Records, the band's independent label— Heart is the Hero is bold, bright, and singularly creative, a fully realized collective effort ultimately greater than the sum of its parts. Perhaps that's to be expected from a group whose willingness to experiment has earned acclaim from Rolling Stone and NPR, as well as an annual touring schedule of sold-out music halls and theaters on both sides of the Atlantic. Ask The Wood Brothers, though, and they'll tell you to expect the unexpected.\n\n\n\n\"We are never satisfied if we are not searching for new musical recipes,\" says Jano Rix, nodding to the uncharted territory that Heart is the Hero covers. Chris Wood agrees, adding, \"We are one of those bands that isn't easily categorized. We know what our strengths are, but we can’t help but push the envelope, as well. It’s too much fun.\""}]}