{"Bane's most recent album is Don't Wait Up, which was released in 2014.": [{"url": "https://www.hitthefloor.com/reviews/bane-dont-wait-album-review/", "page_content": "Earlier this year, a video surfaced to do with the future of legendary hardcore punk outfit. Whilst there was much speculation as to whether or not the band would break up, details of a new album entitled Don’t Wait Up surfaced. But most importantly highlighted, it was officially confirmed – Don’t Wait Up was indeed the final album which will ever be released by Bane. When we got our hands on this, one thing was definitely apparent… this is it.\n\nThe missing piece of the puzzle. The epitaph on the gravestone. The final chapter of the book which we have been paying close attention to over all these years. This is the last lap for which Bane will run. They have accepted their fate and they realise they cannot do this forever, but on the evidence of this album, they are about to make more of a mark than they ever have done in their careers with, what is quite frankly, the best album they have ever put out in their entire lifespan.\n\nThe album was recorded at Getaway Recordings by Jay Mass from the band Defeater. What Mass has done here is provide a truly honourable and terrific recording which does more to compliment Bane’s sound than ever before. The production is absolutely hench as well. A big sound which is crystal clear and spacious enough, mixed to near-perfection and more importantly, enable Bane to deliver their most poignant and sonically heavy album to date.\n\nThroughout the entire listening experience, there is that knowing sense of foreboding and content in bizarrely equal measure. You know you do not want this to end by any means and when you realise you have not even pressed the ‘play’ button yet, this is even more unnerving. The whole album has one solid theme throughout – trying to say goodbye through the medium of retrospective memories and thoughts, learning how to let go of what will soon be no more. Thematically and lyrically, vocalist Aaron Bedard truly proves that he is arguably one of hardcore’s most underrated lyricists and at the same time writes the most honest and open words he has ever committed to pen and pad.\n\nMusically speaking, the band even in their veteran age prove to sound more important, honed and focussed than they ever have done. Drummer Bob Mahoney is as tight and as powerful as he ever has been, and guitarists and bassist respectively – Aaron Dalbec, Zach Jordan, and James Siboni all work seamlessly in a unison that is so frighteningly near-perfect that they sound like they are born to be united as collective guitarists on the same page. Hell, the whole band sounds fucking better than they ever have done!\n\nFrom the get go with the thunderous adrenaline charged opening track ‘Non-Negotiable‘, it is quite clear that this album is about to grab you by the scruff and take you on a very intense and at times emotional ten-song ride that makes up Don’t Wait Up. It is the sound of classic, raw and pure hardcore punk at its bare bones played sublimely.\n\nIt is only until we get to the third track ‘Calling Hours‘ that we hear what could be the most diverse song that Bane have ever released to date. An extremely touching song that features guest vocals from members of Down To Nothing, Have Heart, Rotting Out and Code Orange Kids. Musically speaking, as well as being diverse this is possibly the most emotive song they have ever put out. It has the same emotional power that could almost be felt on a track equally as intense such as ‘Dream House‘ by Deafheaven. But only with much more achingly gorgeous vocals, especially with the presence of Reba Meyers, who really shows just how much of a talented singer she is. As well as the song being emotionally powerful, it really does take your breath away and towards the last half of the song, it really will choke you up a little if you let yourself go and absorb yourself in to the roller coaster that it truly is.\n\nThe whole album is littered with hardcore classics. Tracks such as ‘Park St‘, ‘Lost At Sea‘, and even the power-violence leaning ‘What Awaits Us Now‘ are all bonafide mosh pit classics in the making. In all fairness, there is not one bad song on this album by any means. This quite literally is all killer, no filler in ever sense of the meaning.\n\nBut it is the final song that really will hit home with the listener – ‘Final Backward Glance‘. In all of the years that this reviewer has been listening to music, NEVER in his life has he been more affected by a hardcore punk song to the point of actually (and unashamedly) shedding tear towards the final minute and a half. This could well possibly the most devastating song Bane have ever released in their history as a band. The music, the lyrics, everything about it. What really makes it more affecting is the tenacity, honesty and startling conviction in Bedard’s voice as he at first gently proclaims “I was never much good at saying goodbye“, until the point where he elevates the velocity and volume of his voice where you can actually hear him start to crack up and break down, if you listen closely enough.\n\nDon’t Wait Up is quite easily the best hardcore album of 2014. We will also go on record as to say this is most definitely a hands down contender for album of the year as well, without a shadow of a doubt. The ten songs that are included in this album are a tornado of musical fury, emotional conviction in its purest form and a beautifully constructed goodbye to everyone that has ever supported the band in any way possible.\n\nIf there is any album you should be listening to this year, it is this album. Don’t Wait Up is the swan song of one of the most loved and revered hardcore bands in recent memory. Whilst in studio essence, this is the final say in their career, they will still be touring for the next year or so. So for the love of all that is holy, do NOT delay in going to see Bane one last time before they are not within arms grasp. Saying goodbye to such a loved band really has never been so hard. A sheer masterpiece of an album.\n\nWe will leave this review on this note regarding what the meaning of Don’t Wait Up means in Aaron Bedard’s words – “To me it means we are leaving. This is us with our jackets on, our hair is clean, we are walking out the door and we look back at our loved ones, and say “don’t wait up, we are going to be out late tonight”.“"}, {"url": "https://www.punknews.org/review/12656/bane-dont-wait-up", "page_content": "Don't Wait Up is Bane's newest and FINAL studio album. Up to this point, the last full length album that Bane recorded was The Note in 2005 making Don't Wait Up their first studio album in 8 years. In a music scene where longevity is rare, Bane has managed to delivered some of the most solid releases in hardcore while maintaining an intense touring schedule since the late 90's.\n\n\n\nListening to Don't Wait Up is like meeting up with a long lost friend...you pick up right where you left off. \"Non–Negotiation\" and \"All the Way Through\" pulled me right in with chugging guitars, fast beats and smart lyrics in true Bane fashion. Surprisingly, one of the highest points of the record is \"Calling Hours\" which has numerous guest vocals from the likes of: Pat Flynn (Have Heart), David Wood (Down to Nothing) and Walter Delgado(Rotting Out). Although Bane has not had guest vocals on tracks in the past I found this vocal style a nice change of pace and reminder of the many awesome tours Bane has done and the generation of Hardcore bands they influenced\n\n\n\nDon't Wait Up ends with a track titled \"Final Backward Glance\" which is a fitting end to not only a consistent and well thought out record but a decade and a half of great music and memories. \"Final Backward Glance\" ends with an energy filled chorus that practically forces you to shout along as if it were the last song of a set. I found this track similar to \"Ali vs. Frazier I\" off of Give Blood which made my listening experience quite a nostalgic one. I don't know exactly what it was about \"Final Backward Glance\" that caused me to ponder life in the Give Blood Era of 2001, but I found it refreshing to reminisce regardless. \"Final Backward Glance\" made me feel as timeless as Bane's sound.\n\n\n\nBy the time the track ended I felt some very mixed emotions about the album. Firstly, it made me glad to know that Bane had the opportunity to end their career on their own terms. We can name so many amazing bands we wish had the same opportunity before they disbanded. Bane truly has control of their destiny and mark they left on Hardcore. It's really an achievement when a Hardcore band can be consistent yet innovative. Too many bands in Hardcore tend to become stale with their sound and end up blending in rather than sticking out. This is not how Bane will be remembered.\n\n\n\nThe listening experience was also a bit of melancholy one. By the time \"Calling Hours\" ended I began realizing \"holy shit, Bane is over.\" Thanks to Bane and a handful of other bands, I was introduced to a different side of punk and a different side of myself. I had no way of knowing this experience would last a lifetime. I like to think that Bane would like to be remembered as a band that influenced many and gave us something to yell for not at. This album is a statement that backs that up.\n\n\n\nIf you have never listened to Bane, I would say start with Give Blood not Don't Wait Up. It would be like reading the last chapter of a book and then reading from the beginning. If you love Bane, listen to the entire album in order. Although there some great stand alone tracks, the beest experience for listening is the entire work.\n\n\n\n\n\n"}, {"url": "https://killyourstereo.com/reviews/bane-dont-wait-up/rveqoKOipaQ/16-05-14", "page_content": "Bane have spent almost two full decades producing some excellent hardcore music and taking it around the world. However, earlier this year the band announced they would be calling it quits at the end of the year. ‘Don’t Wait Up’ is (at least in terms of recorded material) the band’s farewell note, or final salute if you will. This means that for both fans of the group and the band themselves, there is a lot riding on this record.\n\n\n\nKnowing that it’s their last offering, Bane have gone all out to produce a final effort to be proud of delivering. It doesn’t bring anything new to the table - but it doesn’t matter, because what’s at the table already is pretty damn great. You get the idea that the band isn’t so much writing to please a ‘new generation’ or expand their fanbase, or really, putting out a record that is written for anyone aside from the people who are already following the band, and in that regard, it serves as a very fitting goodbye.\n\n\n\nThe groups kick the record off hard, with chugging guitars and powerful drums that you can expect from them, holding up through the first two tracks, ‘Non-Negotiable’ and ‘All The Way Through’ before bringing things down very briefly in ‘Calling Hours’, which is one of the best tracks on 'Don't Wait Up'. Built around some well thought out texture changes, the song features some huge riffs and gang vocals while vocalist Aaron Bedard takes to the mic with incredible levels of passion and vigour.\n\n\n\nFor the most part, the album reflects lyrically on the ups and downs of having been in a band so long. One track, however, stands out lyrically in a big way. ‘Wrong Planet’ sees Bedard recalling the horrifying memories of child abuse, while also pushing the positive impact that music had on getting him to a better place.\n\n"}, {"url": "https://www.punkrocktheory.com/music_reviews/bane-%E2%80%93-don%E2%80%99t-wait", "page_content": "Oh Bane, why are you doing this? Are you really this mean? I mean, come on… you’ve kept us waiting for eight years. Eight! Then you finally do release a new album but immediately tell us that it will be your last one ever. That’s downright evil. But okay, at least you gave us “Don’t Wait Up” which comes with ten songs that serve as a 30-minute reminder of why I fell in love with hardcore in the first place. The riffs that hit you harder than a ton of bricks, the heart-on-your-sleeve lyrics, the gang vocals and the pummeling drums that want to make you smash everything in sight, all the while incorporating subtle layers of melody.\n\nThese Boston natives kick off their swan song with “Non-Negotiable” and “All The Way Through”, two vintage Bane tracks that will inspire circle pits worldwide. Next up is one of the most diverse songs the band has ever written - “Calling Hours” - which comes with a slew of guest vocals by Pat Flynn (Have Heart), Walter Delgado (Rotting Out), David Wood (Down to Nothing, Terror) and Reba Meyers (Code Orange Kids). And from there on the band just keeps on going, no holds barred. It's a non-stop barrage of pounding drums, crushing riffage and Aaron Bedard’s visceral growls that is bursting at the seams with energy and passion.\n\nIt’s not often that a band goes into the studio, not only knowing that this will be their last album but actually writing about it as well (“Final Backward Glance”). It makes for an incredibly powerful, intense hardcore album that sees the band going out on a high note. Gonna miss you guys!"}, {"url": "https://www.altpress.com/bane_dont_wait_up_album_premiere/", "page_content": "Almost nine years to the day after their previous full length release, The Note, Bane are set to release their fourth and final album Don't Wait Up next week. But don't let the word \"final\" scare you. The band told us they still have plenty of shows in them.\n\n\"We truly did throw our hearts into these songs and hope that you're going to like them,\" Bane told us in a statement. \"The plan is to tour heavily in the next year or two. We'd love to see some of you out there.\"\n\n\"We are anxious and so excited to get this new record out there, and would like to thank Alternative Press for allowing us to stream it here a few days early.\"\n\nWe know you're anxious and excited, too, so without further ado, stream Don't Wait Up below:\n\n\n\nNORTH AMERICAN TOUR DATES:\n\n\n\nMay 09 Worcester, MA @ Palladium (upstairs) [CD Release Show]\n\n\n\nMay 23 Toronto, ON @ Hard Luck\n\n\n\nMay 24 Howell, MI @ Bled Fest+\n\n\n\nMay 25 Pittsburgh, PA @ Smiling Moose\n\n\n\nMay 26 Cleveland, OH @ The Foundary\n\n\n\nMay 27 Chicago, IL @ Beat Kitchen\n\n\n\nMay 28 Iowa City, IA @ Blue Moose\n\n\n\nMay 30 Denver, CO @ Marquis Theatre\n\n\n\nMay 31 Salt Lake City, UT @ Loading Dock\n\n\n\nJun 02 Seattle, WA @ El Corazon\n\n\n\nJun 03 Portland, OR @ Alhambra Theater\n\n\n\nJun 04 San Francisco, CA @ Thee Parkside\n\n\n\nJun 05 Los Angeles, CA @ Echo\n\n\n\nJun 06 Anaheim, CA @ Chain Reaction\n\n\n\nJun 07 Phoenix, AZ @ The Underground\n\n\n\nJun 09 Dallas, TX @ Club Dada\n\n\n\nJun 10 Austin, TX @ Red 7\n\n\n\nJun 11 Houston, TX @ Walter’s Downtown\n\n\n\nJun 13 Orlando, FL @ Backbooth\n\n\n\nJun 14 Pembroke Pines, FL @ The Talent Farm\n\n\n\nJun 15 Jacksonville, FL @ Underbelly\n\n\n\nJun 16 Atlanta, GA @ Mammal Gallery\n\n\n\nJun 17 Wilmington, NC @ Ortons\n\n\n\nJun 18 Washington, DC @ DC9\n\n\n\nJun 19 Philadelphia, PA @ First Unitarian Church\n\n\n\nJun 21 Montebello, QC @ Amnesia Rock Fest+\n\n\n\nJun 22 Boston, MA @ Middle East Upstairs (matinee)\n\n\n\nJun 22 Boston, MA @ Middle East Upstairs (evening) [Sold Out]\n\n\n\n"}, {"url": "https://www.equalvision.com/news/bane-announce-final-album-dont-wait-up-and-tour-plans/", "page_content": "News\n\nBane announce final album, Don’t Wait Up, and tour plans\n\nApril 4, 2014\n\nLongtime Equal Vision Records’ band Bane will release their fourth and final full-length album, Don’t Wait Up, on May 13.\n\nThe album was recorded in Haverhill, MA with producer Jay Maas (Defeater, Bane).\n\nBane will headline in support of the album on a US tour this Spring, featuring support from Turnstile and Take Offense.\n\nAll upcoming shows can be found below. A second set of US tour dates will be announced in the coming weeks.\n\nThe bittersweet announcement of the forthcoming final album comes nearly twenty years after Bane’s first release, which led the band on countless tours and earned them widespread respect for being one of the hardest working bands in the business. Since their inception in 1995, Bane has toured all across the world countless times and has released three full-length albums: 1999’s It All Comes Down To This, 2001’s Give Blood, and 2005’s The Note, in addition to several 7”, EP and compilation releases.\n\n“I can’t believe we did it…but we did it. To me it means, we’re leaving,” shares vocalist Aaron Bedard of the new album in the band’s recent behind-the-scenes video. “This is us with our jackets on, our hair is clean and we’re walking out the door and we look back at our loved ones and we’re like…don’t wait up…we’re going to be out late tonight.”\n\nPreorder options, including vinyl, for Don’t Wait Up are available now at equalvision.merchnow.com.\n\nTRACKLISTING\n\nDon’t Wait Up\n\n1. Non-Negotiable\n\n2. All the Way Through\n\n3. Calling Hours\n\n4. Park St.\n\n5. What Awaits Us Now\n\n6. Hard to Find\n\n7. Lost at Sea\n\n8. Post Hoc\n\n9. Wrong Planet\n\n10. Final Backward Glance\n\nBane w/Turnstile and Take Offense\n\nMay 23 Toronto, ON @ Hard Luck*\n\nMay 24 Howell, MI @ Bled Fest+\n\nMay 25 Pittsburgh, PA @ Smiling Moose\n\nMay 26 Cleveland, OH @ The Foundary\n\nMay 27 Chicago, IL @ Subterranean\n\nMay 28 Iowa City, IA @ Blue Moose\n\nMay 30 Denver, CO @ Marquis Theatre\n\nMay 31 Salt Lake City, UT @ Loading Dock\n\nJun 02 Seattle, WA @ El Corazon\n\nJun 03 Portland, OR @ Alhambra Theater\n\nJun 04 San Francisco, CA @ Thee Parkside\n\nJun 05 Los Angeles, CA @ Echo\n\nJun 06 Anaheim, CA @ Chain Reaction\n\nJun 21 Montebello, QC @ Amnesia Rock Fest+\n\n* Bane w/Take Offense only\n\n+ Festival"}, {"url": "https://www.altpress.com/bane_release_trailer_for_final_album_dont_wait_up/", "page_content": "Boston hardcore band Bane have released a trailer for their final studio album, Don't Wait Up, which will be out worldwide May 13 on Equal Vision Records and May 9 in Europe via End Hits Records.\n\n\"It's gonna be a little sad not to be the dude from Bane anymore, I really liked that, that was fun for a long, long time. Yeah, we're just like every other band, and at some point we have to stop,\" reflects singer Aaron Bedard.\n\nSong clips in the video are taken from the album."}, {"url": "https://newalbumreleases.net/65151/bane-dont-wait-up-2014/", "page_content": "\n\nArtist: Bane\n\n\n\nAlbum: Don’t Wait Up\n\n\n\nReleased: 2014\n\n\n\nStyle: Melodic Hardcore\n\n\n\nFormat: MP3 320Kbps / FLAC\n\n\n\nSize: 88 Mb\n\n\n\n\n\n\n\nTracklist:\n\n01 – Non-Negotiable\n\n02 – All The Way Through\n\n03 – Calling Hours (Feat. Pat Flynn, Walter Delgado, David Wood , Reba Meyers)\n\n04 – Park St\n\n05 – What Awaits Us Now\n\n06 – Hard To Find\n\n07 – Lost At Sea\n\n08 – Post Hoc\n\n09 – Wrong Planet\n\n10 – Final Backward Glance\n\n\n\nDOWNLOAD LINKS:\n\nRAPIDGATOR: DOWNLOAD\n\nFLAC (220 Mb):\n\nHITFILE: DOWNLOAD\n\n\n\n\n\n"}, {"url": "http://underthegunreview.net/2014/03/28/bane-releases-trailer-for-final-album-dont-wait-up/", "page_content": "Boston hardcore legends Bane released a trailer today for their upcoming album, Don’t Wait Up. The trailer, at least to longtime fans of the band, is very emotional, as they chronicle what it was like putting together their final album before they call it quits. Bane is one of the most influential modern hardcore bands in the scene, and while it’s sad to see them go, the way they are gracefully turning out the lights on their 19-year-old band is extremely respectable, and bands should be taking notes on how to say goodbye.\n\nDon’t Wait Up comes out on May 10 on Equal Vision Records, and it is their first album in 9 years. If this isn’t one of your most anticipated hardcore records of 2014, I don’t know what is. Pre-orders are coming soon.\n\nCheck out the trailer after the break, as well as the artwork for their new record. Are you excited? Sad? Let us know in the comments."}]}