{"Adam Collis appeared in The Fault in Our Stars.": [{"url": "https://www.vulture.com/2022/01/the-fault-in-our-stars-anniversary.html", "page_content": "Photo: Twentieth Century Fox\n\nJanuary, 2012: Mission: Impossible — Ghost Protocol reigned at the box office, a new show called Girls premiered on HBO, Lana Del Rey told us we were Born to Die … and a young-adult novel about two kids with cancer falling in love became a massive sensation. The sixth book from John Green, The Fault in Our Stars, debuted January 10 at No. 1 on the New York Times best-seller list, where it would stay for months. Within the year, there’d be special editions, nearly a million copies printed, and the announcement of a highly anticipated movie adaptation, not to mention a fan base of readers larger and more passionate than the book world had seen since perhaps Twilight.\n\nA decade after its release, the success of TFIOS seems obvious. Of course a YA romance about star-crossed teens would do well! Of course the endlessly quotable, social-media-savvy John Green would become a celebrity! Of course Hollywood would green-light a movie based on the book three weeks after its debut! But back at the start of 2012, the “sick teen” genre barely existed, Green was just a decently popular author known best for his vlogs, and theaters were filled with movies about supernatural kids, not super-unlucky ones. TFIOS wasn’t a guaranteed hit — far from it.\n\nYet thanks to some clever marketing and stellar reviews, a hit it became, and the world hasn’t been the same since. In celebration of the book’s tenth anniversary, here are the biggest effects that TFIOS has had on our lives a decade out.\n\nThe Rise of the “Sick Teens in Love” Genre\n\nAs you may recall, The Fault in Our Stars tells the story of Hazel and Gus, two high-schoolers with cancer who embark on a star-crossed romance. It wasn’t the first book to portray high-schoolers dealing with illness while pursuing love (see A Time to Die, Too Young to Die, even the Judy Blume scoliosis classic Deenie). But most of those works came out decades earlier. The enormous success of Green’s book led to a renewed interest in the genre. From Five Feet Apart, a romance novel featuring teens with cystic fibrosis, to Everything, Everything, Nicola Yoon’s best seller about a lovestruck girl suffering from Munchausen syndrome by proxy, to Me and Earl and the Dying Girl, a critics’ darling with a plot summarized by its title, both Hollywood and the young-adult publishing industry have been awash in these stories ever since TFIOS’ debut, and audiences have responded in droves at the bookstore and the box office.\n\nThe Rise of Shailene Woodley\n\nAt the beginning of 2012, Woodley was still starring on The Secret Life of the American Teenager but beginning to emerge as a legitimate talent thanks to a Golden Globe–nominated performance in 2011’s The Descendants. The moment she was cast as Hazel in the film adaptation of The Fault in Our Stars, however, her star rose drastically, and her resulting performance earned a wave of rave reviews that jump-started an adult career that’s still going strong today.\n\nThe Rise of John Green\n\nLike Woodley, Green became a true celebrity thanks to The Fault in Our Stars, albeit in quite a different way. Prior to the book’s release, the author was well-known in two worlds: young-adult fiction because of the success of his previous novels like Looking for Alaska and YouTube because of his popular VlogBrothers channel with his brother, Hank. After TFIOS came out, though, Green became the rare writer (alongside other YA heavyweights like J.K. Rowling and Judy Blume) to become a household name, thanks in large part to his savvy social-media presence and genuine enthusiasm for all things pop culture.\n\nThe Rise of the Manic Pixie Dream Boy\n\nAlthough the “manic pixie dream girl” has been a widely known stock character since the mid-aughts, there were few notable examples of her male version until The Fault in Our Stars introduced Augustus Waters. Quirky, thoughtful, ultraliterate, and hot (duh), Gus is pure teen fantasy: a quote-giving, floppy-haired Tumblr mood board come to life. And once audiences were introduced to Ansel Elgort in the movie version, the “manic pixie dream boy” fully took hold, both in fiction (i.e., every Cole Sprouse character) and in real life (Harry Styles, Pete Davidson, Machine Gun Kelly … the list goes on). Even Jack Dawson has been recategorized as a MPDB before his time.\n\nThe Rise of Adults Proudly Loving YA\n\nTo be clear, The Fault in Our Stars is far, far from the first novel aimed at teens to capture adults’ hearts. From Speak to The Book Thief to Ready Player One, the YA world has long been filled with works that appeal to readers of all ages, and it’s nonsensical that there’s ever been a stigma against grown-ups loving the genre. Yet unfortunately, that shaming was alive and well during the early 2010s. Still, when TFIOS came out, millions of adult readers found themselves obsessing over Green’s novel and connecting deeply to its adolescent protagonists. The belated communal realization that YA books could be as smart, well-developed, and captivating as any others led to a surge in the genre’s popularity, and while the stigma hasn’t disappeared completely, it’s certainly become far less controversial for a 40-year-old to be caught reading Sarah Dessen or Angie Thomas on the subway.\n\nThe Rise of Charli XCX\n\nYes, the rise of Charli XCX and her ultrahit “Boom Clap” can technically be attributed to TFIOS’ release, as the song appeared on the film’s soundtrack. With the ridiculously catchy track, XCX went from an up-and-coming talent to a serious star — and the rest of us were stuck with “the beat goes on and on and on” in our heads for years to come.\n\nThe Rise of Everyone and Their Mother Getting a Quote Tattoo\n\n“My thoughts are stars I cannot fathom into constellations.” “I fell in love the way you fall asleep: slowly, then all at once.” “Some infinities are bigger than other infinities.” With so many memorable lines, TFIOS inspired an ungodly number of quote tattoos after the releases of both the book and film. Whether every person who got one back then still feels as strongly about the decision today is unknown, but hopefully their clouds and infinity signs still look cool, at least. Okay? Okay."}, {"url": "https://bookanalysis.com/john-green/the-fault-in-our-stars/themes-analysis/", "page_content": "‘The Fault in Our Stars’ uses human-relatable themes to tell the story of its primary characters, Hazel and Augustus. Though the novel follows a tragic story, it shows the happy-sad relationship between the primary characters. The story’s focus on the weaknesses and struggles of its characters made it become a popular attraction for teenagers and young adults.\n\n\n\n\n\nThemes\n\nLove and Friendship\n\nLove and friendship are the primary themes of ‘The Fault in Our Stars.’ Throughout the novel, John Green showed how Hazel and Augustus sailed through their love for each other. The story focused on its primary character’s relationship and showed how it slowly progressed from mutual friendship to love.\n\nOn meeting Augustus, Hazel became attracted to him, and soon, she shared her most prized possession with him. On introducing him to ‘An Imperial Affliction,’ their relationship blossoms, and after they go to Amsterdam to meet Peter Van Houten, Hazel realizes she has fallen for Augustus. After professing their love for each other, Augustus reveals that his cancer is back. Hazel begins to navigate through the experience of seeing the person she loves fade from existence.\n\nThe novel shows how powerful friendships get. Isaac and Augustus had a strong bond that lived beyond Augustus’s death; this showed the value of their relationship.\n\n\n\n\n\nPain and Suffering\n\nThough the novel showed moments of happiness and love in its characters’ lives, it focused more on their reality, pain, and suffering. As a novel that narrates the struggle of living with cancer, the story of ‘The Fault in Our Stars’ perfectly portrays the suffering associated with cancer.\n\nThe novel’s attention to the reality of cancer made it an extremely relatable book. After Hazel met Augustus, she realized that she could not escape her life of suffering. On meeting Peter Van Houten, she got forced to confront her reality as Van Houten told her that her ailment was nothing but an effect of evolution; this made her realize that she could never escape the pain. She had to watch Augustus gradually become a shadow of himself; this ate away at her, and when he died, she felt trapped in a cage of her pain and suffering.\n\n\n\n\n\nIdentity\n\nIn ‘The Fault in Our Stars,’ Hazel and Augustus tried to navigate a life of pain and suffering while simultaneously discovering their feelings for each other. Augustus was a person who believed that leaving a mark in life was crucial. However, Hazel argued otherwise, stating that the legacy left behind by great people will turn into nothing but scars. The novel showed how Hazel, Isaac, Augustus, and other teenagers struggled to find their identity in a world of cancer and pain.\n\n\n\n\n\nLife and Death\n\nDeath is a primary theme in ‘The Fault in Our Stars.’ Though Hazel tried to show her strength amid suffering, she admitted that her death would bring undiluted pain to her parents and those around her. Seeing herself as a time grenade, she desperately tried to protect her family from the future impact of her death. With her life getting shorter and shorter, Hazel tried to resist falling in love with Augustus because she feared that death would only hurt him more. After Augustus revealed that he was dying from cancer, Hazel began to wish that her life was a bit different. The pain of watching Augustus die tormented her.\n\n\n\n\n\nComing of Age\n\nOne thing the novel talks about is maturity. The loss of innocence became a crucial turning point in Hazel and Augustus’s lives as they matured into adulthood. They realized that their lives would circle cancer, pain, and death.\n\n\n\n\n\nAnalysis of Key Moments\n\nHazel’s doctor and mother advise her to attend a support group. On joining the support group, Hazel meets Augustus, a seventeen-year-old boy who had his right leg removed due to Osteosarcoma. Hazel and Augustus become friends. They exchange their favorite novels. Hazel gives him ‘An Imperial Affliction,’ and she collects ‘The Prince of Dawn.’ Augustus gets frustrated by An Imperial Affliction’s ending but learns from Hazel that Peter Van Houten, its author, has moved to Amsterdam. Isaac, Augustus’s friend, gets dumped by his girlfriend, Monica. Augustus reveals to Hazel that he has tracked Peter Van Houten’s assistant, Lidewiji Vliegenthart, and has begun an exchange of emails with Van Houten. Hazel and Augustus start exchanging emails with Van Houten, and finally, they get invited to Amsterdam. Augustus uses his genie wish to get tickets for Hazel, himself, and her mother to see Van Houten. Hazel meets Van Houten but discovers he is a mean alcoholic. He refuses to answer her question, and in a fit of rage, she storms out of his house. Van Houten’s assistant takes Hazel and Augustus to Anne Frank’s house. Hazel and Augustus kiss for the first time. Hazel and Augustus lose their virginity to each other. Augustus reveals that his cancer had returned and spread throughout his body. On returning home, Augustus’s health deteriorates, and he dies. Van Houten tries to apologize to Hazel at Augustus’s funeral, but she rejects his apology. Van Houten’s assistant tells Hazel of the letters Augustus had sent to Van Houten, and on reading one, she discovers he wrote an obituary for her.\n\n\n\n\n\nStyle, Tone, and Figurative Language\n\n‘The Fault in Our Stars’ employs a sad but vibrant tone but the melancholy switches when Hazels falls in love with Augustus and becomes a happy tone. Hazel’s straightforwardness made the story progress rapidly as she served as the narrator from a first-person’s perspective.\n\nThe story uses similes, metaphors, personifications, and allusions to create a delicately interesting word structure. Metaphors like Augustus’s use of cigarettes created an ironic portrayal of the story’s narrative.\n\n\n\n\n\nAnalysis of Symbols\n\nAn Imperial Affliction\n\nThe book ‘An Imperial Affliction’ has many metaphorical reflections on Hazel’s life. She admitted to the book being like a Bible for her because it was one of the few novels that understood what it felt like to be dying. Hazel stated that Peter Van Houten was a writer who understood death. After reading the book numerously, Hazel became addicted to the fate of the story’s characters; this makes her travel to Amsterdam in search of answers. However, on reaching Amsterdam, she got hit by reality as she discovered that Van Houten had no suitable answer to her questions.\n\n\n\n\n\nCigarettes\n\nIn the novel, Augustus kept a cigarette pack. When asked about why he had a cigarette placed in his mouth, he stated that it was a representation of trying to prove that one had power over a force of evil. The cigarette symbolizes the belief that something can only harm a person when they let it hurt them.\n\n\n\n\n\nOxygen Tank\n\nThroughout the novel, Hazel always uses an oxygen tank. The tank represents the blockade that stood between life and death for Hazel.\n\n\n\n\n\nFAQs\n\nWhat are the primary themes of The Fault in Our Stars? ‘The Fault in Our Stars’ implements many themes synonymous with teenagers; this includes themes of coming of age, love, and identity. The novel exploited the concept of pain in its characters’ lives. What happens to Isaac in The Fault in Our Stars? Isaac is August’s friend who had eye cancer. When Isaac got scheduled to undergo surgery, he and Monica broke up. The surgery was successful, but he lost his eye and became blind. Does Hazel die in the Fault in Our Stars? Though the novel did not show whether Hazel died or not, John Green revealed that she died one year after Augustus’s death. What do Augustus’s cigarettes represent? When Hazel got angry at Augustus for putting a cigarette in his mouth, he told her that the cigarette was a metaphor. He explained that having the cigarette in his mouth without smoking gave him power over death."}, {"url": "https://www.looper.com/843829/the-ending-of-the-fault-in-our-stars-explained/", "page_content": "Prior to meeting Gus, Hazel is isolated in her world. She has no close friends and keeps a distance from her parents. She wants to minimalize the damage her death will cause, evidenced in her \"grenade\" monologue. She's diagnosed with depression, an effect of which is her obsessive rereading of the novel \"An Imperial Affliction.\" Gus and his friend Isaac (Nat Wolff) are the first new people she lets into her life in years.\n\nHazel shares \"An Imperial Affliction\" with Gus, which is about a girl, Anna, struggling with and ultimately dying from cancer. But the book ends abruptly in the middle of a sentence and provides little resolution. Many of Hazel's lingering questions about the story revolve around the supporting characters, wondering how they move on after the girl's death.\n\nHazel's obsession with the novel can be considered a metaphor for her lack of control. She's not only a teenager with limited freedoms, but also has an incurable disease — traits she and Anna share. Rereading the novel is one of the few things she can control. Where \"An Imperial Affliction\" ends both tragically and vaguely, Hazel hopes for a different ending for herself. She refuses to live happily in the present and to think of her life as something of joy.\n\nGus develops many of these obsessions since he's scared of oblivion, but he has the means to confront the uncertainty of \"An Imperial Affliction\" head-on: his Make-A-Wish.\n\nIf you or someone you know is struggling with mental health, please contact the Crisis Text Line by texting HOME to 741741, call the National Alliance on Mental Illness helpline at 1-800-950-NAMI (6264), or visit the National Institute of Mental Health website."}, {"url": "https://bookanalysis.com/john-green/the-fault-in-our-stars/summary/", "page_content": "‘The Fault in Our Stars’ by John Green tells the story of Hazel, a young sixteen-year-old girl who struggles with thyroid cancer. She meets Augustus and falls for him. However, her life changes when she meets the writer she has always cherished and discovers he is far from the person she imagined.\n\n\n\n\n\n‘Spoiler-Free’ Summary of The Fault in Our Stars\n\n‘The Fault in Our Stars’ starts with Hazel, a sixteen-year-old with thyroid cancer. With advice from her mother and doctor, she goes to a cancer support group. While in the support group, she meets a seventeen-year-old boy called Augustus. Soon, Hazel and Augustus become friends, and she introduces him to her favorite book. As time passes, Hazel finds herself falling for Augustus as they become close. Augustus decides to help Hazel with her biggest dream and uses his cancer wish. He arranges a journey that would take them to meet Hazel’s idol.\n\nHowever, on meeting her idol, she gets faced with reality, and she discovers that he is not the person she imagines him to be. Hazel leaves with Augustus and her idol’s assistant to go on a tour. She finally admits her feelings for Augustus, and they become lovers.\n\nOn returning home, Augustus tells Hazel about the development discovered concerning his condition, forcing her to admit that she will lose the love of her life. Augustus drifts farther and farther away from her until he fades away. Later, Hazel discovers a letter from Augustus that contains her future obituary.\n\n\n\n\n\nThe Fault in Our Stars Plot Summary\n\nSpoiler alert: important details of the novel are revealed below.\n\n‘The Fault in Our Stars’ tells the story of the main character Hazel Grace Lancaster, a sixteen-year-old with thyroid cancer. With cancer spreading to her lungs, Hazel gets hooked to a machine that enables her to breathe. After visiting her doctor, Maria, she is given a flyer to attend a support group. Initially reluctant to go, she joins the support group. She meets Patrick, a middle-aged man who is the group’s leader. While in the support group, Hazel meets Isaac, a boy who was partially blind from eye cancer.\n\nAfter attending the support group for a few weeks, Hazel meets Augustus Waters, a seventeen-year-old boy who had his right leg removed because of Osteosarcoma. With Augustus being Isaac’s friend, he and Hazel become close. With them being friends, Hazel introduces Augustus to her favorite novel ‘An Imperial Affliction’ by Peter Van Houten. Augustus receives Hazel’s novel, and in exchange, he gives her his favorite, ‘The Prince of Dawn.’ After reading ‘An Imperial Affliction,’ he calls Hazel and expresses his displeasure with the novel’s ending. Hazels tell him of her plans to try and reach out to Van Houten in search of an answer to his book’s ending. However, she explains to Augustus that Van Houten relocated to Amsterdam.\n\nA week later, Augustus reveals to Hazel that he had managed to contact Van Houten’s assistant, Lidewiji Vliegenthart, and sent a message to Van Houten. He tells her that he received a response from Van Houten and had begun to exchange emails with him. Excited, Hazel asks if Van Houten wants to answer her question. However, he tells her that she should come to Amsterdam. Although she gets excited, Hazel realizes that she can not travel to Amsterdam due to a lack of money and her medical condition.\n\nAugustus surprises Hazel with two tickets to Amsterdam, and they travel to meet Van Houten. On reaching Van Houten’s house, Hazel and Augustus get shocked to meet a drunk hostile Van Houten. Though asking him for an answer to the ending of his novel, Van Houten violently reacts and tells Hazel she was nothing but a flaw in nature. Realizing she would never get an answer from her once favorite writer, Hazel leaves Van Houten’s residence. However, she and Augustus get treated to a tour of Amsterdam by Lidewiji, Van Houten’s assistant.\n\nOn visiting Anne Frank’s house, they kiss for the first time. Later that night, they lose their virginity to each other. Augustus reveals to Hazel that his cancer has returned and spread throughout his body.\n\nAfter returning home, Isaac tells Hazel and Augustus that his surgery was successful, but he lost his eye. Augustus’s health deteriorates as he becomes weaker and weaker. He requests that Hazel write his obituary and read it out to him. Eight days after reading his obituary to him, Augustus dies.\n\nVan Houten tries to apologize to Hazel, but she rejects his apology. She gets contacted by Lidewiji, who tells her about some letters that Augustus sent to Van Houten. She realizes that Augustus had written an obituary for her. Hazel reads the letter from him, and in it, he tells her that getting hurt is a constant, but one can choose who hurts them. He tells her he is glad that she was his choice. The novel ends with Hazel stating that she is happy Augustus is her choice.\n\n\n\n\n\nFAQs\n\nWhat happened at the end of The Fault in Our Stars? In the ending of ‘The Fault in Our Stars,’ Lidewiji sends Hazel a letter Augustus sent to Van Houten. On receiving the letter, she discovers that Augustus had written an obituary for her. His letter states that though one could not prevent getting hurt, one could choose who hurt them. He tells Hazel that he likes that she is his choice. What is the best age to read The Fault in Our Stars? Though ‘The Fault in Our Stars’ is a young adult novel, it is not suitable for children under 14. The story may be too mature for younger audiences. Hence, the best age to read would be 14 above. Who is Kaitlyn in The Fault in Our Stars? Kaitlyn is Hazel’s only friend from life before cancer. After she got diagnosed, Hazel had to stop attending school physically, and it caused her to lose contact with most of her classmates. However, Kaitlyn still remained in touch with her. Is The Fault in Our Stars sad? ‘The Fault in Our Stars’ is a sad novel that tells the story of Hazel and how she met Augustus, a boy that changed her perception of life and love, which also is one of the main themes in ‘The Fault in Our Stars’. The story took a happy tone when Hazel and Augustus became friends."}, {"url": "https://kidadl.com/facts/the-fault-in-our-stars-facts-a-film-based-on-a-true-life-story", "page_content": "In the summer of 2014, the world was introduced to 'The Fault In Our Stars.'\n\nThis romantic drama was based on the best-selling novel of the same name by John Green. It told the story of two young cancer patients who fell in love.\n\nThe film was a huge success, both commercially and critically. But what many people don't know is that the story is based on a true-life story. The script of the movie was written by Scott Neustadter and Michael H. Weber. Josh Boone directed the movie. We will now take a look at some facts about 'The Fault In Our Stars' that you may not have known. Continue reading to learn more about the inspiration behind this book.\n\nActors And Characters In 'The Fault In Our Stars'\n\nThe main characters in the film are Hazel Grace Lancaster and Augustus Waters. These characters are cancer patients who meet at a support group for young people with cancer. The two of them quickly fall in love and embark on a journey together. Other significant characters in the film include Peter Van Houten, Isaac, and Augustus' mother. Shailene Woodley, Ansel Elgort, Nat Wolff, Laura Dern, Sam Trammell, and Willem Dafoer are some of the actors in the movie.\n\nHazel Grace Lancaster is the main character in 'The Fault In Our Stars.' She is a 16-year-old cancer patient who has been diagnosed with stage IV thyroid cancer.\n\nCancer has metastasized to her lungs, forcing her to use an oxygen tank. Hazel is forced to attend a cancer support group, where she meets Augustus Waters. The role of Hazel was played by Shailene Woodley, who is best known for her roles in the 'Divergent' series and 'The Secret Life Of The American Teenager.'\n\nAugustus Waters is the male lead in 'The Fault In Our Stars.' He is a 17-year-old cancer patient who meets and falls in love with Hazel Grace Lancaster.\n\nBefore losing his leg to a type of bone cancer called osteosarcoma, he was a basketball star. Ansel Elgort portrays Augustus in the film.\n\nNat Wolff was cast as Issac in the movie. In the novel, Issac is a male character. He has eye cancer which has caused him to go blind. Hazel and Issac attend the same support group.\n\nIn the novel and the film, Peter Van Houten is the author of a book-within-the-book, 'An Imperial Affliction.' Actor Willem Dafoe played the role. In the film, he is shown to be a reclusive and eccentric writer.\n\nHazel and Augustus meet him when they travel to Amsterdam in an attempt to find out more about the book.\n\nBehind The Scene Facts Of 'The Fault In Our Stars'\n\nYou know all there is to know about Hazel, but you don't know everything there is to know about Augustus.\n\nAnsel revealed that he spent a lot of time with Tanner Boatwright, his body double who had lost his leg in a hunting accident, to actually know how things are for him and portray the character in a much better way.\n\nBelieve it or not, the film was shot in less than three months—two months of shooting in Pittsburgh and three days in Amsterdam.\n\nWhile we all thought Ansel lost a few pounds by the end of the film to fit in character, he did not lose any. The costume department came up with a brilliant idea as it would be unhealthy for Ansel to lose 10-15 lb (4.5-6.8 kg) just for a couple of scenes. They decided to size up his clothes to make it look like he had lost weight. Brilliant, right?\n\nBudget And Awards Won For 'The Fault In Our Stars'\n\n'The Fault In Our Stars' had a modest budget of $12 million (gross). This is relatively low for a Hollywood blockbuster.\n\nHowever, the film went on to gross over $300 million at the worldwide box office.\n\n15th Golden Trailer Award, Teen Choice Awards 2014, Young Hollywood Awards, 18th Hollywood Film Awards, 41st People's Choice Awards, and MTV Movie Awards are some of the awards the movie has won.\n\n'The Fault in Our Stars' was named TIME Magazine's #1 Fiction Book of 2012 after debuting at #1 on the New York Times bestseller list.\n\nDid You Know...\n\nThough most of the movie will make you weep, there are some fun facts that you might want to know if you are a fan.\n\nAugustus keeps Issac company after his breakup with Monica. At the time, he sings 'I've Been Breaking All The Rules,' which is a line from the song 'Rules' by Nat and Alex Wolff.\n\nMost of the authors find it difficult to pick out a favorite scene but not John Green. John Green said that most of his favorite scenes in the movie come from Nat Wolff. He added that Nat's subtle comedy has made the scenes even more interesting.\n\nThe flawless scenes in the movie have made fans appreciate the director. Fans were shocked to find out that 'The Fault In Our Stars' was just the second movie directed by Josh Boone. Previously, he worked on a minor movie, 'Stuck In Love.'\n\nShailene Woodley was not the choice for the lead role as the crew felt that she was too pretty and healthy-looking. However, following the audition, Josh Boone stated that out of the 250 actresses that auditioned for the part, he was only able to picture Shailene in Hazel's place. When Shailene chopped her hair off for the role, she donated it to children with hair loss.\n\nFAQs\n\nHow is Natalie Portman connected to Hazel?\n\nAccording to Augustus, Hazel reminded him of Natalie Portman from 'V For Vendetta.'\n\nHow old is Hazel in 'The Fault In Our Stars'?\n\nHazel is 16 years old in 'The Fault In Our Stars.'\n\nIs 'The Fault In Our Stars' based on a true story?\n\nYes, 'The Fault In Our Stars' is based on a true story. John Green, the author, got the inspiration for 'The Fault In Our Stars' after working in a children's hospital. John Green said that the character of Hazel Grace is inspired by his friend Esther Earl who passed away due to thyroid cancer at the age of 16.\n\nWhat is the central message of 'The Fault In Our Stars'?\n\n'The Fault In Our Stars' is a story about two young people who fall in love despite the odds. It is a story of hope, courage, and resilience in the face of adversity. The key message of the film is that even though life may be difficult at times, it is still worth living.\n\nIs Hazel a girl in 'The Fault In Our Stars'?\n\nYes, Hazel is a girl in 'The Fault In Our Stars.' She is the main character of the story and is played by actress Shailene Woodley in the film."}, {"url": "https://movie.douban.com/review/6837853/", "page_content": "这篇影评可能有剧透\n\nPS：想用影片名当评论名，是因为这个名字太妙了，并且也很好听。\n\n\n\n多年前，第N次刷完《大话西游》后特别有感觉地浓重忧伤了几日，并写下了一篇名叫“爱情故事”的影评，那篇评些什么内容我现在忘得差不多了，只记得结尾处我对为此伤心了几日的自己写下了：从未谈过恋爱的人反而最喜欢对恋爱指手画脚。看来，我又要忍不住指手画脚一次了 。\n\n\n\n传说中死亡和爱情是艺术创作永恒不灭的母题，又有传说，一流的电影是由二流的剧本三流的故事产生的，剧本太好的话留给导演和演员的空间就不太多了。那么，这个让我“哭晕在办公室”的故事究竟是怎样的构成的呢：\n\n\n\n癌症女孩A生活在一个由药物和医院组成的世界中，但除去这点致命伤，她有世界上最好的父母以及比很多同龄女孩更聪慧敏锐的头脑，她对世界没有人云亦云的想法，爱看书爱思考，喜欢独处，但没有文艺青年的酸腐味道，其实她的生活在我这个外人看来已经好过世上千千万万身体健康的行尸走肉了。过于理性的头脑使她随时处于迎接死亡的戒备状态。直到某一天她在很不情愿参加的癌症互助会上邂逅阳光男孩B。男孩崇拜英雄，害怕死后被遗忘，有着干净的笑容，看见A的第一眼就朝A放电，但看电影时不用任何暗示作为观众你明白这个人绝对不是谁都放电的，他有点喜欢她，第一眼就有点喜欢。\n\n一向孤冷的A还以少有的微笑，这时你会明白貌似A也不反感B，甚至偏好感，这对于没有打算向外界敞开心胸的A而言很难得。在互助会上B讲述了自己害怕死后被遗忘的忧虑，A从未在互助会上发言，但为了回应B她第一次开口了：总有一天谁都会消失，每个人都会被遗忘，哪怕是伟大如莫扎特，若干年后也没有人会专门留下来为了记住他，更别说在座的各位了，所以如果恐惧这点，最好趁早将其抛之脑后，因为其余人都是这么做的。\n\n\n\nA说完后B还以难以捉摸的笑容，不一定是认同A的说法，要知道这样的恐惧并不是旁人三言两语就能够消除的。但B似乎很享受听A讲话，不管内容是什么。之后的故事，也许按照诸君的期望发展，只是置换到两具将死之躯上面，很多都进行得很缓慢或者根本无法顺利开展，他们当了很久的朋友才有一个非恋人式的拥抱，以及很久很久以后才有了第一个KISS。但是他们喜欢四目相对，喜欢对着对方的眼睛谈话，喜欢倾听对方的喜好和需求，把对方的兴趣爱好当做自己的一样对待。\n\n\n\nA的愿望在13岁那年为了迪斯尼被用掉，然而她现在有了更想要实现的愿望却没办法实现，B在与A交流的过程中熟知了A与那本爱不释手的小说的情缘，在鄙视A轻易用掉愿望的同时已经打定主意把自己的愿望送给A并陪同她去荷兰完成心愿，尽管中间因为身体缘故又出现一些波折，最终二人以及A的母亲三人一同前往荷兰，在见到作家的前一晚两人终于互诉衷肠决定以情侣身份相处并度过了心醉的一夜。\n\n\n\n无奈A见到向往已久的作家后与自己想象的大相径庭，颓废作家不肯告知故事的结局，并责怪A太过较真，说一本书完了故事也就完了，故事里的人物也不需要继续他们的命运，还抛出一个无限比另一个无限大这样的“谬论”惹恼了A，A失望而归，毕竟这是支撑一个绝症患者的故事，而她亲眼见证了这个故事的缔造者将它捏碎。B一路追赶，生怕A为此更难受一个劲儿地说：没关系没关系，我可以为你写一个更棒地故事，你不要难过。\n\n\n\n然后，二人走到一个廊椅上坐下，这时候A的情绪已然平复了许多，B在此之前都一直扮演着A的小太阳的角色，一直一直温暖着A，但是B选择在这个时候告诉A：我的腿又开始萎缩了，我只是一直没敢告诉你。这时候的B露出了片中第一次的绝望的神情，我猜，他起初只是单纯地想要借此来平衡A的失落，因为心细如他明白安慰一个人最好地办法不是一个劲儿的说不要难过不要难过没什么大不了的。而是告诉她我曾经或者现在比你的状况还要糟糕，也许世界对你不公平，但是我要让你感觉到我们俩是一样的，我对于你而言是公平的，如果我能有幸成为你的全世界，那世界的不公又有什么大不了的。想象一下中情花毒的小龙女，杨过的方法是我也中吧，想象一下大仇在胸无法释怀的不幸福的萧大哥吧，阿朱的方式是我死换你幸福。但是现实是B并没有他想象地那样强大，他还没来得及用自己的伤痛换取A的公平，他自己就已经开始倾斜了。\n\n\n\n电影也从这个时候开始转换角色，B的伤痛开始由A接管，因为他们已经正式相爱了，而A事实上远比B要强大，后面的故事有点悲伤了。A开始病发，住院，坐轮椅，又开始更加害怕被遗忘，B说：我知道这很幼稚，但我一直期待自己成为一个英雄，身负一个伟大的故事，会被刊登在报纸上，我本该成为一个与众不同的人。\n\n\n\nA告诉他：你本来就与众不同，你总是痴迷于让人们记住你。我觉得你很特别，难道这还不够吗。你认为要过有意义的人生，要每个人都记住你、爱你，但你猜怎么着，这就是你的人生，你只能得到这些，我、你的家人、你能面对的世界，就是这些。如果这些于你还不够，那我很抱歉，你至少不是两手空空。因为我爱你，我会记得你。\n\n\n\n这席话对B好像很受用，我猜依然不是这些话本身有多么能带给他力量，二是说这些话的人是A，这就能够带给他力量。他总是愿意聆听她的每一句话，愿意发自内心地崇拜她，一个少年他崇拜比自己还要小的少女。不是带着痴迷的崇拜，而是用爱她的方式来崇拜。很难想象的一种关系，我从未见识过的一种关系。据说，人在经历真正的爱情的时候整个灵魂会升得无限高，他会释放身体里所有的善意来对待他所面对的世界，并且心甘情愿。\n\n\n\n之后，B想出了一个他能够接受死亡的最不坏的方法——预演葬礼，他要求A和好朋友C分别写悼词给他，然后他们三在教堂里一起出席了有当事人参加的葬礼。眼盲的C笑嘻嘻说了一大堆损友的话最后严肃地说道：如果未来的某天我能够安装电子眼重见光明，我一定会拒绝，因为我不想看到一个没有你的世界。\n\n\n\nA的悼词：B是我此生灾星下的恋人，我们的爱情故事如史诗般荡气回肠。我没有办法开口诉说，只要讲起，我便要被淹没在泪水之中……\n\n\n\n八天之后，B走了，A在葬礼上没有念此前准备好的话，而是说了许许多多安慰活人的假话，因为A渐渐明白，葬礼不是办给死人的，是用来安慰活人的，B坚持要预演葬礼，是因为真正的葬礼根本不属于他。作家突然出现在B的葬礼上，并试图解释A此前对小说的疑问，无奈A此刻沉浸在B的离去的巨大悲痛之中，加之本身厌恶作家，不留情面地把作家赶走了。C来找A，二人相互安慰，C告诉A，B真的很在乎她，每次一提起她就一个劲儿地说个没完。这个片段让我想起知乎的一个问答，问：一个男生什么时候才算真正喜欢上一个女生。最好的一个答案是：他做任何事都会想起要是她在就好了。\n\n\n\nC还问A见到作家没有，说B曾给作家写了一封信，这时A才想起早已经把作家试图给她的信揉碎。A回到车里找到褶皱的信纸，打开读到B写给作家求助的信：我是如此好的人却写不好字，你是如此糟糕的人却能写出好句子。我要求你帮我写一封悼词给A，因为我文笔不好……你不必担心她是否比你聪明,因为你清楚她就是。她风趣而不刻薄，我爱她.这世上你没办法选择不受伤害，但你可以选择被谁伤害。\n\n\n\n最后，故事在B的信中结束了，B直到死后都还依然在给A力量，给她延续生命一个最好的理由，那就是：不要忘记他，不要忘记他们的岁月，那里尽是美好。\n\n\n\n这大概印证了福克纳的《野棕榈》里的那句话“她不在了，一半的记忆也已不存在。如果我不在了，那么所有的记忆也将不在了。是的，他想，在悲伤与虚无之间我选择悲伤。”\n\n\n\n\n\n我从小迷恋各种故事，正如直到现在号称喜欢电影的我也仍然停留在它是否是一个好故事的层面。我想我能与故事们相处自如，如同活生生的人一样，我与它们分别相处之后，它们之中有些能伤害我，有些能给我力量，有些让我大开眼界，有些让我很快遗忘。而我发现我喜欢的是那些不一定有完美的结局却一定能在很多很多细节上面触动我灵魂的真善美的故事。A和B的故事讲完了，现在我想谈谈它。谈谈我得到的，或者说我想得到的。\n\n\n\n如果把这个故事定性成一个典型的爱情故事，那它是合格的，作为由大银幕来讲述的爱情故事，它更是做足了全套功夫。男女主角爱情角逐的时空都是被设定好的：泰坦尼克只有三天，空间只在一艘船上；都敏俊离开地球只剩下一个月的时日，空间只在俩人的家中。同理A和B亦是如此，同样的境遇很容易心心相惜，这样的恋爱很水到渠成，或者说很容易上手。相对封闭的空间+极其有限的倒数的时间+全心全意为对方着想的男女主=合格的浪漫爱情。\n\n\n\n那么除此之外这个故事也具备了太多非典型的因素。我想这些才是创作者想要与观众互动和摩擦的焦点，爱情，只是一种载体。玄机隐藏在其中。\n\n\n\n\n\n被遗忘\n\n记得谁曾经说过：人们在惧怕死亡的成分中至少有一半是恐惧被世界彻底遗忘。在A与B第一次碰面的时候，B就很坦然地说出了自己的恐惧，可以还原一下B当时的话：我十八岁成了半机械人，半条退没了，但我一直想成为不平凡的人，我想要很多人记住我，我不想被遗忘。\n\n很轻松地语调讲述沉重的经历，越是满不在乎其实越在乎。我想他当时主要是想说给A听，让A第一时间了解他，对他也产生一点兴趣。很顺利地，A对此作出了回应。告知他不必自寻烦恼，因为每个人都会被遗忘，这是全人类共同地命运，并不只是针对他个人。这是他们第一次交流。\n\n但是通过这次交流，银幕外的我们能够思考的就太多了，因为我坚信这是个普适的并且永远没有标准答案的问题，它并不会因为导演借着A的三言两语就能够让所有和B有一样恐惧的观众释怀。A的答案只是千万种之一，或许我们跟B一样爱听她讲，但并不能轻易地被它说服。B在留给A的信中说他在A生病进入IUC的时候偷偷潜入病房望着虽然病重却仍然活生生的A，想象了一下没有他们俩的世界。他觉得是没有办法接受的。\n\n\n\n其实这一点上，我比较倾向于B的感受，我觉得害怕被遗忘是每个人都会有的恐惧，尤其是当你知道死神随时都会将自己带走的时候。走后的世界是你没有办法知晓的。浩瀚的宇宙中，我们谁的消失都是微不足道的。而存在唯有对于我们自己而言才是有意义的。我们消失了，我们的意义也就消失了，就像我们从来没有来过一样。正是因为如此，某种意义上，所有的苟延馋喘都好过于彻底消失。\n\n\n\n公平\n\n如果你是这样想的：我不认为爱情里面有绝对的公平，如果真的爱，就不会计较谁付出得更多。这话我耳朵都要起茧子了，也不知道是谁发明的。是啊，谈恋爱的时候不计较，分手后慢慢算账。总觉得，一份有诚意的恋爱关系中，公平也许是最必不可缺的一环了，它是保证二人能走多远的基石。如果恋爱关系中长期存在不公，这份感情到崩盘时大多会酿成惨剧或者永远不能磨灭的伤害。\n\n\n\n如果你没办法界定什么是公平，那我想也许你会明白什么是不公平。豆瓣上曾有这样一条广播大概能浇我心中之块垒：\n\n\n\n“ 中国情侣没有交流，有的是听和服从、哄和被哄、发嗲和撒娇、指责或批评、抱怨与开解、倾听和安慰。没有交流，没有两个对等的人深度地对话，不，连浅显的对话都没有。因为除了琐碎，没什么可聊的。”\n\n\n\n也许很多观众都把这部片子或者这个故事当做千千万万小清新爱情故事一样一带而过，并没有认为它有多么特别。但它对我而言很有意义，是因为它呈现了我所能想象的最好的恋爱的模样。A和B的相处方式是我最向往的一种。在这种关系中我充分地体会到了怜悯、尊重、公平、理性和诗意。而这些往往在很多别的恋爱关系中是被遗忘或者舍弃了的。直到最后他们都小心翼翼地保持着这段关系的平衡，仔细打理夹杂在其中的尘埃，他们仿佛是两个找到同一件绝世珍宝的收藏家。\n\n真正的爱情，不是相互占有，而是我能拿出多少东西给对方，而该自己保留的我绝对不会舍弃：自尊、独处的时光、及时表达意见的权利…..有了这些我才能继续更好地和你相爱。\n\n这里有一段A和B的对话时全片所有的我喜欢的片段中最最喜欢的一段，也是最能够表达这段关系中珍贵的地方。\n\n当A得知自己原本能够去荷兰却因为身体缘故只能被困在家中绝望时，她打给B说自己家的后花园有一座小时候爸爸搭给她的秋千，大概因为身体缘故她不能使用它。\n\n这时候B调笑说：那我要来看看这泪之秋千了。\n\nA苦笑\n\nB：我明白你的意思，这真是个悲伤的秋千架。我希望你明白，即使你跟我保持距离，我对你的深情也丝毫不减。一切试图让我幸免于你的努力都是白费。（这男的哪里文笔差，简直就是诗人）\n\nA：你看，我喜欢你，我喜欢和你一起度过的时光。但我不能让这种情况继续下去。\n\nB：为什么？\n\nA：因为我不想伤害你。\n\nB：我不介意。\n\nA：你不明白的。\n\nB：我明白。我知道你在说什么。我说，我不在乎。能被你伤害是我的荣幸。\n\nA：嘿，B，我是颗手榴弹，有一天我会爆炸，当我醒来我会摧毁我周遭的一切。我觉得我有义务减少伤亡人数。\n\nB笑：你颗手榴弹。\n\nB知道无法用言语让A信服他的决心，那就行动好了，要知道“最好的告白是长久的陪伴。”\n\n看了片子的人会明白这段美妙在哪里，在此就不再赘述了。\n\n\n\n死亡\n\n一直以来作家海明威给世人的印象随着他的“硬汉原型”深入人心，但他又被施泰因称作“迷惘的一代”的代表，在我眼中，迷惘跟某种柔软有关。至少是硬的反面。迷惘不是一种清闲的徜徉，而是一种焦虑的徘徊，它意味着灵魂的飘忽不定和一声叹息。海明威在目睹或者经历了一切人间悲惨剧之后在家书中写道：死亡，是一件很简单的事。最后，这位二十世纪爵士时代的经典硬汉用猎枪自绝于世了。\n\n想想无数场战争中、天灾人祸中，有多少死亡变成一件很简单的事。简单到他们只是数字中的一员，连代表他们的符号都是群体化的。\n\n说回影片，这部片子另一个让我欣赏之处，就在于，它所要讨论的问题在逐渐升级，由小到大。它始终在引导我们跟随这群患癌者一起思考用怎样的姿态来面对死亡会更好一点。如果说B是对于被遗忘的恐惧。那么A却是对于自己消失的影响的担忧，换句话说她更加恐惧被遗忘。A在13岁的时候差一点撒手人寰，她明白父母对自己的爱，但她和父母的关系仍然有些冷漠，因为妈妈说了一句：我从此就不再是母亲了。A一直耿耿于怀，她害怕母亲将自己遗忘，害怕自己的离去等于自己从未来过。当母亲告诉她，伤痛肯定是会有的，但是人能够带着伤痛活下去，并且自己永远是她的母亲。A才像小孩一样和妈妈真正讲和。\n\n常听人评价一次自杀事件都会以这样的语句：他就这样轻易的结束了自己的生命。\n\n谎言太多了，数都数不过来。听我说，没有人能轻易地死亡。无论何时，死亡都是一件无比沉重的事件。它意味着我不再能够与这个世界互动，也不再有可能性。我爱的、我恨的、我不屑的、我参与的不参与的，一切的一切都没有了。它是一场世界上最隆重的告别仪式。你说，死亡怎么可能是一件简单的事。\n\n\n\n“有些无穷比别的无穷更大”\n\n这是我还没想好的部分，不说了。在我这儿，这部片子的角色相当于《怦然心动》的续集，我承认我是在持续亢奋的状态下看完的，并且我很有很久没有这样和一部电影触电了，我很喜欢，不管你怎么想。"}, {"url": "https://www.sparknotes.com/lit/the-fault-in-our-stars/", "page_content": "Thank You!\n\nYou’ve successfully purchased a group discount. Your group members can use the joining link below to redeem their group membership. You'll also receive an email with the link.\n\nNo URL Copy\n\nMembers will be prompted to log in or create an account to redeem their group membership."}, {"url": "https://www.sparknotes.com/lit/the-fault-in-our-stars/summary/", "page_content": "Seventeen-year-old Hazel Grace Lancaster reluctantly attends a cancer patients' support group at her mother’s behest. Because of her cancer, she uses a portable oxygen tank to breathe properly. In one of the meetings she catches the eye of a teenage boy, and through the course of the meeting she learns the boy’s name is Augustus Waters. He's there to support their mutual friend, Isaac. Isaac had a tumor in one eye that he had removed, and now he has to have his other eye taken out as well. After the meeting ends, Augustus approaches Hazel and tells her she looks like Natalie Portman in V for Vendetta. He invites Hazel to his house to watch the movie, and while hanging out, the two discuss their experiences with cancer. Hazel reveals she has thyroid cancer that has spread to her lungs. Augustus had osteosarcoma, but he is now cancer free after having his leg amputated. Before Augustus takes Hazel home, they agree to read one another’s favorite novels. Augustus gives Hazel The Price of Dawn, and Hazel recommends An Imperial Affliction.\n\nHazel explains the magnificence of An Imperial Affliction: It is a novel about a girl named Anna who has cancer, and it's the only account she's read of living with cancer that matches her experience. She describes how the novel maddeningly ends midsentence, denying the reader closure about the fate of the novel’s characters. She speculates about the novel’s mysterious author, Peter Van Houten, who fled to Amsterdam after the novel was published and hasn’t been heard from since.\n\nA week after Hazel and Augustus discuss the literary meaning of An Imperial Affliction, Augustus miraculously reveals he tracked down Van Houten's assistant, Lidewij, and through her he's managed to start an email correspondence with the reclusive author. He shares Van Houten's letter with Hazel, and she devises a list of questions to send Van Houten, hoping to clear up the novel’s ambiguous conclusion. Hazel is most concerned with the fate of Anna’s mother. She figures that if Anna’s mother survives her daughter’s death, then her own parents will be alright after Hazel dies. Van Houten eventually replies, saying he could only answer Hazel’s questions in person. He invites her to stop by if she is ever in Amsterdam.\n\nShortly after Augustus invites Hazel on a picnic. It turns out he's planned an elaborate Dutch-themed picnic where he reveals that a charitable foundation that grants the wishes of kids with cancer has agreed to grant his: he's taking the two of them to Amsterdam to meet Van Houten. She is thrilled, but when he touches her face she feels hesitant for some reason. Over time she realizes that she likes him a lot, but she knows she'll hurt him when she dies. She compares herself to a grenade.\n\nIn the midst of her struggle over what to do about Augustus, Hazel suffers a serious episode in which her lungs fill with fluid and she goes to the ICU. When she is released after a period of days, she learns that Augustus never left the hospital’s waiting room. He delivers Hazel another letter from Van Houten, this one more personal and more cryptic than the last. After reading the letter, Hazel is more determined than ever to go to Amsterdam. There is a problem though: Her parents and her team of doctors don’t think Hazel is strong enough to travel. The situation seems hopeless until one of the physicians most familiar with her case, Dr. Maria, convinces Hazel’s parents that Hazel must travel because she needs to live her life.\n\nThe plans are made for Augustus, Hazel, and Hazel's mother to go to Amsterdam, but when Hazel and Augustus meet Van Houten they find that, instead of a prolific genius, he is a mean-spirited drunk who claims he cannot answer any of Hazel’s questions. The two leave Van Houten’s in utter disappointment, and accompanied by Lidewij, who feels horrified by Van Houten's behavior, they tour Anne Frank’s house. At the end of the tour, Augustus and Hazel share a romantic kiss, to the applause of spectators. They head back to the hotel where they make love for the first and only time. The following day, Augustus confesses that while Hazel was in the ICU he had a body scan which revealed his cancer has returned and spread everywhere. They return to Indianapolis, and Hazel realizes Augustus is now the grenade. As his condition worsens he is less prone to his typical charm and confidence. He becomes vulnerable and scared, but is still a beautiful boy in Hazel’s mind. As this change occurs, she ceases calling him Augustus and starts referring to him as just Gus, as his parents do. Hazel recognizes that she loves him now as much as ever. Augustus’s condition deteriorates quickly. In his final days Augustus arranges a prefuneral for himself, and Isaac and Hazel give eulogies. Hazel steals a line from Van Houten about larger and smaller infinities. She says how much she loves Augustus, and that she would not trade their short time together for anything in the world.\n\nAugustus dies eight days later. Hazel is astonished to find Van Houten at the funeral. Van Houten explains that he and Gus maintained correspondence and that Augustus demanded Van Houten make up for ruining the trip to Amsterdam by coming to his funeral to see Hazel. Van Houten abstractly reveals the fate of Anna’s mother, but Hazel is not interested. A few days later Isaac informs Hazel that Augustus was writing something for her. He had hinted about writing a sequel to An Imperial Affliction for her, and as Hazel scrambles to locate the pages she encounters Van Houten once more. He drunkenly reveals that Anna was the name of his daughter. She died of cancer when she was eight, and An Imperial Affliction was his literary attempt at reconciling himself with her death. Hazel tells Van Houten to sober up and write another book.\n\nEventually Hazel learns that Augustus sent the pages to Van Houten because he wanted Van Houten to use the pages to compose a well-written eulogy about Hazel. Lidewij forces Van Houten to read the pages and sends them straight off to Hazel. The novel concludes with Hazel reading Augustus’s words. He says getting hurt in this world is inevitable, but we do get to choose who we allow to hurt us, and that he his happy with his choice. He hopes she likes her choice too. The final words of the novel come from Hazel, who says she does."}], "Adam Collis appeared in The Social Network.": [{"url": "https://www.businessinsider.com/look-inside-life-people-the-social-network-ten-years-later-2020-10", "page_content": "It's been 10 years since actor Jesse Eisenberg appeared on movie screens as Mark Zuckerberg in a dramatized version of Facebook's founding story in the movie \"The Social Network.\"\n\nJesse Eisenberg attends the 'The Social Network' premiere during the 5th Rome International Film Festival on November 1, 2010 in Rome, Italy. Photo by Tullio M. Puglia/Getty Images\n\nThe two-hour-long David Fincher and Aaron Sorkin modern classic holds a 96% rating on Rotten Tomatoes and has raked in close to $100 million in US box office earnings.\n\n\"Mr. Fincher and Mr. Sorkin offer up a creation story for the digital age and something of a morality tale, one driven by desire, marked by triumph, tainted by betrayal and inspired by the new gospel: the geek shall inherit the earth,\" film critic Manohla Dargis wrote for The New York Times in 2010.\n\nWhile the movie has entertained many over the last decade and earned more than a few fans, one person in particular has remained unimpressed — Mark Zuckerberg."}, {"url": "https://www.theringer.com/movies/2020/9/22/21450318/mark-zuckerberg-the-social-network-origin-story", "page_content": "On the cusp of the 25th anniversary of Se7en and the 10th anniversary of The Social Network, The Ringer hereby dubs Sept. 21-25 David Fincher Week. Join us all throughout the week as we celebrate and examine the man, the myth, and his impeccable body of work.\n\nIn 2017, Mark Zuckerberg returned to Harvard for a victory lap that most people can only dream of. Twelve years after the Facebook CEO dropped out of school to run what would become the largest online social network in the world, the elite Ivy League would give him an honorary degree. Facebook celebrated the event as an opportunity to showcase the company’s history and display a more personal side of its CEO, organizing a few public broadcasts ahead of the speech. One of those included a visit to Kirkland House H33, the room where it all started.\n\n“This is the first time that we’ve been back in this dorm since I left,” Zuckerberg said in a Facebook Live video that he was filming from his smartphone. With his college sweetheart Priscilla Chan in tow, he directed viewers toward his old desk, and the rooms where his Facebook cofounders (and then-roommates) Dustin Moskovitz and Chris Hughes worked and slept. After some reminiscing about tiny bed sizes and dining hall cuisine, he addressed an incident that has, over the span of the past decade, become millennial folklore.\n\n“One weekend I wanted to build this prank website, FaceMash,” he said with his signature indecipherable smile. “I basically sat here for, like, three days straight, and just coded this thing. And it was a prank. It was kind of funny but also a little bit in poor taste.” He summarized how it spread quickly, froze his laptop, and caused Harvard officials to turn off the entire dorm’s internet connection. “That was probably one of my more memorable moments from Kirkland House, just sitting here, and, like, I’m trying to fix this, Dustin’s trying to do his computer-science problem set, Chris is trying to write some paper for social studies or whatever he’s studying, and all the sudden the internet goes dark.”\n\nLive from my old dorm room at Harvard. Posted by Mark Zuckerberg on Tuesday, May 23, 2017\n\nAs Zuckerberg tells it, the story of FaceMash was nothing more than an innocent college gag that ended in a night of forced unproductivity. But chances are, most people watching that day remember it differently, as the riveting sequence of events at the start of a major Hollywood blockbuster called The Social Network. After conquering the business world, Zuckerberg had finally earned the approval of the elite institution he’d once antagonized. But sitting at his old dorm room desk years later, it seemed his one remaining challenge was to reclaim his past.\n\nIn the decade since The Social Network’s release, Facebook has become so omnipresent and unregulated that no misstep—whether related to privacy, anti-trust laws, geopolitics, or genocide—has managed to etch away at its dominance. Because Zuckerberg holds control of somewhere around 60 percent of Facebook’s voting shares, he alone can determine what people see when they log on to Facebook and Instagram, what privacy settings they have access to, and the difference between violent and incendiary speech. As Chris Hughes, that same cofounder he roomed with back at Harvard, wrote in a 2019 New York Times op-ed, “Mark’s influence is staggering, far beyond that of anyone else in the private sector or in government.”\n\nIn tandem with that growing influence, Zuckerberg’s public persona is now so heavily managed that you’d have a better time deciphering the feelings of the AI assistant he once built to run his house than determining what he’s really thinking. Maybe that’s why Aaron Sorkin’s version of the ambitious boy hacker still clings to the public’s imagination. The more Zuckerberg has been shrouded in corporate armor, the more people have turned to his silver-screen depiction for clues.\n\nHow exactly did a Hollywood film beat the most powerful unelected man in America at telling his own origin story? It all begins with an enterprising science-fiction writer with a penchant for, uh, literary embellishment.\n\n\n\nThe Book\n\nBefore Ben Mezrich signed what was reportedly a million-dollar-plus book deal to write The Accidental Billionaires: The Founding of Facebook, a Tale of Sex, Money, Genius, and Betrayal, his reporting credentials had been dragged through the mud. His previous book, Bringing Down the House, about a troupe of MIT students who used advanced blackjack techniques to win millions of dollars in Vegas, was the first “true” story he’d ever written, and it showed. Not long after it came out in 2002, its main characters debunked its most lurid details: They did not collaborate with strippers to cash their chips, the underground Chinatown casino where they supposedly practiced didn’t exist, and a private detective with “narrow ice-blue eyes” never beat them up in a casino bathroom. Still, those flourishes helped Mezrich more than they hurt him. The book sold over 1 million copies, and eventually became a Kevin Spacey–produced heist film called 21.\n\nWith Accidental Billionaires, it was more of the same. The book’s first cover advertised a tale of college debauchery with a slinky red bra and broken martini glass. Its narrative goes like this: Zuckerberg is a dorky nobody who, like everyone else at Harvard, is determined to join one of the school’s elite social clubs. (Mezrich, a Harvard graduate himself, emphasizes in vivid, knowing detail just how important this kind of membership is to meeting women and getting laid.) Scorned by a mystery woman one evening, Zuckerberg gets drunk in his dorm room and revenge-codes a campus-specific Hot or Not site.\n\nThat part, at least, was a real-life incident that was documented in the LiveJournal updates Zuckerberg used to narrate his creation of the burgeoning social media tool: “Jessica A— is a bitch,” he wrote. “I need to think of something to take my mind off her. I need to think of something to occupy my mind. Easy enough, now I just need an idea.” Another entry: “I’m a little intoxicated, not gonna lie. So what if it’s not even 10 p.m. and it’s a Tuesday night? What? The Kirkland facebook is open on my desktop and some of these people have pretty horrendous facebook pics. I almost want to put some of these faces next to pictures of farm animals and have people vote on which is more attractive.” Later: “Yea, it’s on. I’m not exactly sure how the farm animals are going to fit into this whole thing (you can’t really ever be sure with farm animals . . .), but I like the idea of comparing two people together.”\n\nSign up for the The Ringer Newsletter Thanks for signing up! Check your inbox for a welcome email. Email (required) Oops. Something went wrong. Please enter a valid email and try again. By submitting your email, you agree to our Terms and Privacy Notice . You can opt out at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Subscribe\n\nFaceMash goes viral and inspires Zuckerberg to make something bigger. Meanwhile, two pedigreed rowers named Tyler and Cameron Winklevoss ask him to help with their own campus social network. He leads them on, while partnering with his best friend, Eduardo Saverin, to create a fast-growing competing product. Eventually, Sean Parker, the cofounder of Napster, swoops in whispering sweet nothings of VC funding in Zuckerberg’s ear. The two hatch a scheme to push Saverin out of the company. (Parker’s affinity for women and parties, meanwhile, seals his fate.) Zuckerberg emerges alone atop the fastest growing social network in the world.\n\nA year before the book came out, speculation about its sourcing was rampant. Gawker leaked Mezrich’s initial proposal, noting that the story leaned heavily on Saverin’s account and that “many facts seem off.” In particular, the blog questioned a bizarre scene in which one of the founders of Sun Microsystems invites Zuckerberg to eat koala on his yacht. When The New York Times later obtained an early galley, it highlighted other “possible fabrications,” including a moment where Zuckerberg leaves a San Francisco party with a Victoria’s Secret model. (At that point, Zuckerberg was already dating his now-wife, Chan.) When the Times reached out to the book’s publisher, a publicist shrugged off concerns of veracity, saying: “This is not reportage. It is big, juicy fun.”\n\nEven with Gawker Media’s steady drumbeat of criticism and the occasional privacy flare-up, Zuckerberg still enjoyed a relatively peaceful, even flattering relationship with the media. His interviews with Wired and Techcrunch were never hostile, and mostly portrayed him as a young, awkward, and very, very smart entrepreneur. In the business press, he was genuinely admired for building a company that was well on its way to an IPO at the tender age of 25. Shortly after the movie came out, his blank expression even appeared on the cover of Time magazine’s “Person of the Year” issue—something that now seems unthinkable. “The Social Network is a rich, dramatic portrait of a furious, socially handicapped genius who spits corrosive monologues in a monotone to hide his inner pain,” the story’s author, Lev Grossman, wrote. “This character bears almost no resemblance to the actual Mark Zuckerberg. The reality is much more complicated.”\n\nThe Movie\n\nWhen The Social Network hit theaters in 2010, Facebook was the tech industry’s golden goose egg, and Zuckerberg its attentive countryman in menswear basics. It was the most visited website in the United States. Its hacker-friendly slogan “Move Fast and Break Things,” earned it a reputation in the Valley as a bold, forward-thinking innovator that wasn’t afraid to take risks. And, thanks in part to the growth of the company’s advertising operations, it would earn about $2 billion in revenue that year.\n\nMost importantly, the public had come to see Facebook and Mark Zuckerberg as one and the same. When the website launched in 2004, the phrase “A Mark Zuckerberg Production” was stamped at the bottom of every single page. In subsequent years, the CEO was frequently quoted in The Harvard Crimson and other Ivy League newspapers discussing new features. At one point, he even returned to his alma mater to recruit people to work there. As his cabal of engineers rolled out new features from their raucous Palo Alto incubator, Mark led by example, tagging himself in photos and feverishly “liking” things. I was in the final class of students who received their college emails and joined Facebook, before it was opened up to the public, and seeing a tech CEO use social media at all felt intimate, novel. I recall thinking of Zuckerberg as a kind of millennial icon who was using his superior coding skills to enhance our social lives. A somewhat bland one, but an icon nonetheless.\n\nWhatever goodwill Zuckerberg had earned by making a fun platform ran thinner as Facebook pushed to expand. In 2006, the company premiered “News Feed”—the now-standard homepage that summarizes the profile changes, posts, birthdays, and upcoming events of everyone in a user’s social network—and faced its first real privacy scandal. People complained the update made it too easy for other people to track their individual activities. A “Students Against Facebook News Feed” group was started, and gained over 100,000 members in a day. TV stations and protestors lined up on the street outside of the company’s Palo Alto office. Zuckerberg responded to the fervor in a Facebook post titled “Calm Down. Breathe. We Hear You.” “Stalking isn’t cool, but being able to know what’s going on in your friends’ lives is,” he wrote with frat boy confidence, promising to add privacy tools.\n\nBut after the dust settled from that incident, little versions of the News Feed saga kept happening again and again and again. Journalists soon began to posit that Facebook’s cavalier privacy efforts were not a result of inexperience, but of its leader’s stubborn indifference to criticism and disdain for users. In May of 2010, Nicholas Carlson unearthed an instant message exchange from Zuckerberg’s Harvard days in which the CEO offers an unnamed friend access to his fellow classmates’ information. “I have over 4,000 emails, pictures, addresses, SNS,” he wrote. “What? How’d you manage that one,” the anonymous recipient of these messages responded. “People just submitted it,” Zuckerberg concluded. “I don’t know why. They ‘trust me.’ Dumb fucks.” In a mostly flattering New Yorker profile that Facebook timed to come out ahead of The Social Network’s release, Zuckerberg said he regretted these messages, but they nonetheless seemed to confirm an increasingly frustrated public’s suspicions that, no matter how many public pledges Zuckerberg made to protect user data, he was sitting in a giant mansion somewhere, snickering at all the chumps who’d trusted him.\n\nThe team entrusted with making The Social Network would only build off that impression. Once Gawker leaked Mezrich’s proposal, the film adaptation was set in motion. Aaron Sorkin, then famous for his loquacious political drama The West Wing, signed on to write the script, and David Fincher, who’d earned a reputation for composing intellectual thrillers like Fight Club and Zodiac, would direct. Together, they cast a trio of hot 20-something actors: Jesse Eisenberg as Zuckerberg, Andrew Garfield as Saverin, and singer Justin Timberlake as Parker. Scott Rudin, one of the film’s producers, attempted to secure Facebook’s cooperation, but the company considered any material sourced from Accidental Billionaires to be fiction. In the end, the team felt it had enough public records to stick with the Mezrich treatment anyway. Sorkin said he nevertheless took “extra care” knowing his subjects were real people. “You feel a special responsibility, knowing what a loud sound a Hollywood movie makes,” he later told The Hollywood Reporter.\n\nThough Sorkin’s script contains no koala entrées, the moments in which he chose to exercise his creative liberties were some of the most memorable. Specifically when he imagines a breakup between Zuckerberg and the woman who inspired FaceMash in the first few minutes of the movie. In the subsequent drunken code-a-thon that follows, Sorkin embellishes Zuckerberg’s LiveJournal rant by adding a few more cruel lines about the fictitious ex’s last name and bra size. Tonally, his version wasn’t so different from Zuckerberg’s original entries, or even your average Reddit post. But—combined with the made-up breakup and the fact that Chan was completely left out of the film—Sorkin’s additions made Zuckerberg seem extra callous. In the movie’s closing scene, after the Facebook creator has betrayed his collaborators and claimed his place atop the social totem pole, he returns to that same ex’s Facebook profile, refreshing it over and over again to see whether she has accepted his friend request. As history would prove, it was just the right amount of real and fake to burrow deep into people’s brains as Facebook canon.\n\nThe Reception\n\nAs emails from the 2014 Sony hack showed, Zuckerberg had tried and failed to stop the film from being made. So ahead of its release, Facebook’s in-house PR agency, Outcast, devised a strategy to avoid slamming the film or attacking its creators. Instead, they would offer a counternarrative, in The New Yorker and, with help from cofounder Chris Hughes, in The New York Times. When NPR’s Guy Raz asked about the film in 2010, Zuckerberg called it “fiction.”\n\nInternally, Facebook tried to embrace the film. On opening weekend, it held an all-staff showing at Century Cinema 16 in Mountain View (which, coincidentally, was also where I saw Independence Day, Jack, and many other classics as a kid). “We had some fun with it,” Mark Zuckerberg said during a Q&A years later, after it became clear the movie would not go away. “I mean we knew that everyone who works at Facebook was going to want to see it anyway, because how often does someone make a major movie about your company?” Zuckerberg added that, for a while after the showing, Facebook employees would make fun of him by mixing appletinis in the office—a reference to the scene in the movie where his character first meets Parker and consumes several of the cocktails.\n\nBut to viewers who didn’t work at Facebook, The Social Network depicted a more sinister version of the 20-something to whom millions of users had entrusted their photos, birthdays, and interests. A version who trampled over his fellow students’ security in the name of a tasteless prank, who willingly pushed his friends and classmates out of the way to get what he wanted, and who was far less interested in Facebook’s stated mission of “connecting people” than he was in consolidating power. As Times reviewer Manohla Dargis put it:\n\nThe price of that ambition, at least as dramatized here, is borne by those around Mark, who remains a strategic cipher throughout: a Facebook page without a profile photo. Charmless and awkward in groups larger than one, he rarely breaks into a smile and, if memory serves, never says thank you. He seems wary at some moments, coolly calculating at others: When his eyes haven’t gone dead, you can see him working all the angles.\n\nHis tech-industry peers took less precaution to separate fact from fiction. “It says something about the characters in a film, and in the valley, when the most likable characters are the lawyers,” one tech worker tweeted. Another chimed, “I don’t know whether to hate Zuck or Parker or try to become them. Or both.” Tech journalist Jon Dube summarized the public sentiment most succinctly: “Made Zuck look pretty bad.”\n\nThe movie was an immediate hit, grossing $224.9 million worldwide. It earned eight Academy Award nominations and three actual Oscars. The Times staff apparently covered it so much that it became the subject of a Variety column. And it soon became a beloved, oft-parodied fixture in popular culture. The same month the movie premiered, a Forbes poll found that “63 percent of Americans didn’t trust Facebook with their personal information.”\n\nThe Corporate Makeover\n\nFollowing the release of a major-motion picture that made its founder look like a socially inept hacker, the company needed to run damage control, especially given the IPO on the horizon. Privately, Zuckerberg would spend the next few years ensuring he was protected from the public eye, spending $30 million on the four homes that surrounded his Palo Alto property, building a 6-foot lava rock wall around his 700-acre estate in Kauai, and hiring a private security detail to patrol the perimeters of his properties (and, apparently, protect his trash). But publicly, he embarked on a campaign to soften his image. The day the film premiered, he went on Oprah to announce he was giving a $100 million grant to the Newark school system. A few months later, he appeared on Saturday Night Live where he and the host, Jesse Eisenberg, made awkward small talk. He got a Hungarian sheepdog named Beast and made it a Facebook page. He reduced his annual salary to $1 a year.\n\nFacebook later created an entire team to maintain Zuckerberg’s Facebook profile. Some of them deleted harassing comments on the threads he posted, others followed him around and took professional photos as he went for a run or hung out with his family. His annual New Year’s resolutions evolved from simple stuff like “wear a tie everyday” in 2009, to symbolic endeavors like “meet a person from every U.S. state” in 2017. His staff even went so far as to quietly delete all his old Facebook messenger conversations. Occasional telling tidbits—like Zuckerberg’s affinity for the game Risk—would filter through the press, buttressing the myth of the domineering nerd, but outwardly he maintained the polished aura of a CEO, with more production value and much, much less personality.\n\nHe also made a point to improve his public speaking. The old Mark Zuckerberg preferred to let his employees run meetings while occasionally yelling the word “Domination!” into the ether. But in late 2014, the new Zuck 2.0 would stream live “Town Halls” from his Facebook page, answering questions on a range of topics from employees and users. During the very first session at the company’s Menlo Park headquarters, the mic was handed to a woman named Lori who had flown in from Povo, Utah, to repeat a question she had posted on one of the CEO’s threads. “I’m a huge movie fan, and one of my top-10 favorite movies is The Social Network, and my question has always been to you: How accurate is the story compared to the real-life story of Facebook’s beginnings?”\n\nZuckerberg laughed nervously. “Wow, I haven’t spent a lot of time thinking about that movie in a while,” he said, “I kinda blocked that one out.” He then went on to make several points. That, one, his life was far less interesting than the movie made it out to be: “The reality is that writing a code and then building a product and then building a company actually is not a glamorous enough thing to make a movie about, so you can imagine that a lot of the stuff they probably had to embellish and make up. Because if they were really making a movie, it would’ve been of me sitting at a computer and coding for two hours straight, which probably would’ve just not been that good of a movie. And these guys, I think, want to win awards and sell tickets. So that’s kind of where they went with it.” Two, that he had never met the people who’d made the movie about his life, aside from his brief encounter with Eisenberg: “I think he was a little afraid to meet me, after his portrayal, but I tried to be nice.” Three, the premise of the movie—that Zuckerberg was motivated to make Facebook so he could meet girls—was messed up. “They just kind of made up a bunch of stuff that I found kind of hurtful.” And four, he’d begun dating Chan before he even started Facebook. (This is technically true. The two met in the bathroom line of the preemptive “going-away party” his Jewish frat threw him after he’d met with Harvard’s administrative board about the FaceMash incident.) In sum: “I think the real story is just, you know, a lot of hard work.”\n\nThe Legacy\n\nZuckerberg’s motivations for maintaining an air-tight public persona have shifted over the years, away from his Social Network portrayal and toward a steady stream of scandals. After Donald Trump won the 2016 presidential election, and accusations of social media bubbles and Russian interference soared, Zuckerberg embarked on a public relations tour of roughly 30 states with a professional photographer in tow. He pet a service dog in Montana, drove a tractor in Wisconsin, and watched a rodeo in Texas. Each stop warranted its own crisp Facebook post, and each update seemed more careful and apolitical than the previous. After he’d finally completed the project he gave a Q&A about what he’d learned, concluding, blandly, that “the biggest takeaway by far is that community, and especially local community, are much more important to people than we realize.” It appeared Zuckerberg’s aim was to demonstrate to users he didn’t think of them as numbers, or chumps, but people—even if the way Facebook operates indicated otherwise. But without any kind of political bent or spice to his messaging, the campaign felt weird, like after years hidden away behind a computer he was on a quest to learn about the human race for the very first time.\n\nThe more canned Zuckerberg has become, the more the public has turned to his silver screen depiction for answers.The Social Network is stamped into the company’s DNA. As Steven Levy describes in the first chapter of Facebook: The Inside Story, Zuckerberg is asked about the movie in places as far flung as Nigeria. In 2018, The New Yorker reported that Facebook executives still refer to The Social Network resentfully as “the movie.” “From its facts to its essence to its portrayal, I think that was a very unfair picture,” Facebook COO Sheryl Sandberg said in the same piece. “I still think it forms the basis of a lot of what people believe about Mark.” Ahead of one of the most consequential presidential elections in recent history, the public continues to take stock of Facebook’s negative effect on public discourse, news, and democracy. And in those terms, David Fincher’s masterpiece has felt all the more relevant; spiritually, if not factually, correct. More than anything, in a 10-year vacuum of personality, the better story won."}, {"url": "https://www.insider.com/the-social-network-cast-then-now-photos", "page_content": "\"The Social Network,\" directed by David Fincher and written by Aaron Sorkin, was released on October 1, 2010.\n\nThe movie was based on Ben Mezrich's book \"The Accidental Billionaires\" and centered on how Mark Zuckerberg became the cofounder of Facebook and found himself in the middle of two lawsuits.\n\nEisenberg, who portrayed Zuckerberg, earned an Oscar nomination for his role in the film.\n\nSince then, he's portrayed Lex Luthor in the DC Extended Universe and reprised his \"Zombieland\" role for a 2019 sequel.\n\nAndrew Garfield, who played Eduardo Saverin in \"The Social Network,\" went on to portray Peter Parker/Spider-Man in the \"Amazing Spider-Man\" movies.\n\nVisit Insider's homepage for more stories.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nIt's been 10 years since David Fincher's award-winning film \"The Social Network\" hit theaters.\n\nThe movie was released in October 2010 with a screenplay written by Aaron Sorkin, adapted from Ben Mezrich's book \"The Accidental Billionaires.\"\n\nThe film, which went on to win three Oscars, starred Jesse Eisenberg as Mark Zuckerberg, the cofounder of Facebook who found himself in the middle of two lawsuits after the social media site took off.\n\n\"The Social Network\" featured a stellar cast that also included Andrew Garfield, Justin Timberlake, and Armie Hammer.\n\nHere's was the cast has been up to since the movie was released."}, {"url": "https://medium.com/@collisadam/catalyst-founding-members-8bc727b903cc", "page_content": "Catalyst Founding Members Adam Collis · Follow · Feb 5, 2020 6 min read -- Listen Share\n\nCatalyst is powered by organisations and people that believe in the mission of connecting people to collaborate through crowdsourcing solutions to the challenges we face in education.\n\nCatalyst logo\n\nIn no particular order, they are:\n\nProfessor Stephen Heppell\n\nEducation & Policy Leader\n\nHeppell.net\n\nProf Stephen Heppell\n\n“Making learning better is complex. It’s the details, the aggregation of marginal gains, that add up to real progress. Real change in this millennium is appearing from the bottom up — authentic voices in real situations. Catalyst puts those voices in the same ring.\n\n“Education today is facing a myriad of challenges. We’re not setting out to fix everything in one fail swoop, this is about creating a global place where people already tackling those tough issues in education, often differently, can come together to share ways of tackling them”.\n\nSMART Technologies\n\nSMART Technologies logo\n\n“For the past 32 years, we’ve had the privilege of working with leaders, administrators and government officials from all over the world. We built Catalyst to provide a place for leaders everywhere to join together, to learn from each other and most importantly, to deliver impactful change for education.\n\n“You may know SMART as the inventor of the SMART board, and while this is an important part of who we are and where we’ve come from, at our core we are an education outcomes company. We’re proud of our roots, but also aware that putting more technology into classrooms isn’t single handedly going to drive outcomes in learning globally. Outcomes take leadership and a partnership between curriculum, practices and technology. Fundamentally, what will drive outcomes and an impactful education system, is all of you. We hope Catalyst provides a place for you to do that.\n\n“Our singular purpose is to inspire greatness that exists in every learner. We’re humbled to launch this important, global community and movement. We look forward to sharing, to learning, to participating in the global challenges and to transforming education globally alongside all of you”.\n\nGreg Estell, President and CEO, SMART Technologies\n\nKen Shelton\n\nEducational Strategist & Consultant\n\nKen Shelton\n\n“We need a shift in how we look at teaching and learning in addition to our overall learning culture. In my work as an educator over the past 22 years, I’ve seen incredible people working in siloes, or worse, isolation, each driving their own agendas for change. Catalyst brings us all together to share, to learn, to motivate each other, and to ultimately drive forward much-needed changes in learning and learning culture, globally.\n\n“I believe that mindsets are more powerful than skillsets. Culture is more powerful than pedagogy. We can apply these perspectives to our teaching practice, to our schools, to our districts. As we prepare young people for the future, we must also apply it to ourselves and our educator peers.\n\n“Catalyst enables individuals with similar mindsets to combine, co-create, and accelerate positive change in education. Shifts in mindsets transcend time, shifts in culture create sustainability and the two combined transcend generations. I’m excited for all we can/will achieve together, and for the learnings that will take place on that journey”.\n\nLearnit\n\nLearnit logo\n\n“At Learnit, we believe great conversations among great people can have incredible impact. Catalyst enables educator leaders globally to join those conversations, to connect with like minded peers and to drive meaningful change in learning.\n\n“Some of the greatest people and organisations making change today in learning are doing so at a local scale. Catalyst enables those groups to share their learnings in a safe place, to iterate, to collaborate and to improve. From Birmingham to Botswana and from New York to New Delhi, Catalyst brings impactful people and projects together to learn, to share and to grow.\n\n“There are no egos here, just the united desire to give everyone, regardless of age, ethnicity or wealth, the opportunity to reach their greatest potential in a rapidly evolving world. We’re excited to partner with Catalyst and to build a globally connected community of education changemakers”.\n\nKaty Fryatt, Founder, Learnit\n\nOperation Impact by HILT\n\nOperation Impact by HILT\n\n“Operation Impact is an initiative led by the Harvard Initiative for Learning & Teaching with applications open to students from both Harvard and MIT. Our mission is to empower students to become agents of change in the field of education. By providing students with resources, funding, and connections, we have built a runway for their innovative ideas to take off and have a measurable impact on learners of all ages globally.\n\n“You don’t solve a complicated problem like education with one field alone. You need a business mind. You need a technology mind. You need a marketing, sales mind. You need a pedagogy mind. Imagine a place where all those people come together to solve some of education’s biggest challenges, but also to support each other and to share learnings. Innovators often feel isolated, Catalyst aims to forge connections and spur action to transform the field.\n\n“Catalyst is a place for crowdsourcing ideas from incredible projects and people driving impactful change in education around the world. Together, we can be truly greater than the sum of our parts”.\n\nJaime B. Goldstein, Director of Strategic Projects and Innovation Grants, Harvard Initiative for Learning and Teaching\n\nNancy Conrad\n\nFounder and Chairman, Conrad Foundation\n\nConrad Foundation logo\n\nA former teacher, Nancy has become a recognized leader in transformative education and named one of the top 100\n\nleaders in STEM education, serving as a featured speaker at national and international conferences.\n\nHer presentations include TED, MIT, and, the Global Competiveness Forum in Riyadh, Saudi Arabia. She also presented at the Global Diversity Leadership Conference at Harvard University and the National Modeling and Simulation Coalition conference in Washington, D.C.\n\nNancy has also testified before the U.S. House of Representatives Committee on Science, Space and Technology detailing how the Conrad Foundation exemplifies the use of partnership to improve STEM education. She is the wife of late astronaut Pete Conrad, who during the Apollo 12 mission became the third man to walk on the Moon.\n\nThe Network Digital Education\n\nNDE logo\n\nThe Network Digital Education wants to encourage people to play an active role in shaping digital education and the future of teaching and learning. It is a nationwide platform for all those seeking support in the area of implementing digital education connecting experts from theory and practice who use their knowledge to make relevant educational topics accessible. The networks’ members provide information, promote the exchange between different institutions through workshops and other events, and provide non-binding, cross-system help on specific issues. The Digital Education Network is open to all those who wish to advance the development of comprehensive digital education and, above all, help schools to implement it. Schools will find here valuable impulses for the use of digital media in teaching as well as checklists, best-practice examples and networking opportunities.\n\n“Digitization is the foundation for a forward-looking educational landscape that can succeed through the networking of people, organizations and technologies.”\n\nDr. Sarah Henkelmann, Speaker of Network Digital Education:\n\nSo now you kmow! Come and get involved"}, {"url": "https://search.asu.edu/profile/1459701", "page_content": "Long Bio\n\nAdam Collis is a filmmaker and film professor dedicated to making distinctive feature films and to giving his students one of a kind opportunities to learn filmmaking directly from world class filmmakers from both studio and independent realms. He accomplishes this by connecting his students and Hollywood pros through video conferences, at in-class visits, and on actual feature film sets.\n\nSix months after graduating from University of South California's (USC) School of Cinematic Arts, Professor Collis directed the 20th Century Fox feature film, Sunset Strip (2000), starring Simon Baker (The Mentalist) and Jared Leto (Dallas Buyer's Club).\n\nProfessor Collis has directed short form and feature length documentaries. Additionally, he earned his MBA from UCLA's Anderson School of Business where he led a six-month, six-person research study on new business models for Independent Films.\n\nIn 2014, he produced and directed Car Dogs, starring Patrick Adams (Suits), George Lopez, Nia Vardalos (My Big Fat Greek Wedding), and Oscar winner Octavia Spencer (The Help). Next up for Professor Collis is The Long Blue Yonder, which is being produced by Brunson Green (The Help) and has Tye Sheridan (Mud) attached in the lead role.\n\nProfessor Collis also has a particular interest in helping young filmmakers get their footing in Hollywood. As a professor of practice of film directing at Arizona State University, he's created classes, programs and internships, including the successful Skype-screening series, Hollywood Invades Tempe, which hosted more than a dozen major Hollywood filmakers and executives."}, {"url": "https://alchetron.com/Adam-Collis", "page_content": "Adam Collis is an American filmmaker and actor. He attended the Duke University from 1986 to 1990 and the University of California, Los Angeles from 2007 to 2010. He also studied cinema at the University of Southern California from 1991 to 1997. Collis first work was the assistant director for the Scott Derrickson's short Love in the Ruins (1995). In 1998, he played \"Crankshaft\" in Eric Koyanagi's Hundred Percent.\n\nHe has also directed several shorts and documentaries, including the award winning short film, Mad Boy, I'll Blow Your Blues Away. In 2000, Collis directed Sunset Strip, a feature film about the Los Angeles rock 'n roll scene in the early 1970s. The film was produced by Art Linson and starred Simon Baker, Nick Stahl, Jared Leto and Anna Friel. He received awards and nominations from the Aspen Shortsfest, Austin Film Festival, Hamptons International Film Festival, Los Angeles Independent Film Festival, New York Comedy Festival, and Palm Springs International Festival of Short Films.\n\nInfamous amongst his students for coining the term \"Image Size Variation\" and \"Psycho-Emotional Instrument\" when referring to directing actors."}, {"url": "https://socialblade.com/youtube/channel/UCBx6Qlb1rQjj5msTry9-8xg", "page_content": "YouTube Twitch Facebook Instagram Twitter TikTok Dailymotion Odysee Trovo Mixer DLive StoryFire\n\nAdam Collis @toadythedoady Uploads\n\n0 0 Subscribers\n\n4 4 Video Views\n\n0 0 Country\n\nCA CA Channel Type\n\nUser Created\n\nFeb 25th, 2018\n\nIn order to use the favoriting feature on Social Blade, you'll need to be logged into our dashboard.\n\nIn order to edit this user safely, you'll need to be logged into our dashboard.\n\nIt Seems that you've reached your limit on how many you can favorite. If you'd like to get more favorites, please consider upgrading to a premium account Upgrade to Premium"}, {"url": "https://medium.com/@collisadam/thats-a-wrap-global-launch-events-b07a7b4c35e5", "page_content": "That’s a Wrap — Global Launch Events Adam Collis · Follow · Feb 5, 2020 3 min read -- Listen Share\n\nWashington, District of Columbia in the United States was the site of the fourth and final launch event for Catalyst.\n\nIn collaboration with the District of Columbia Public Schools, more than 30 education leaders and change makers gathered at the Duke Ellington School of Arts to discuss the importance of Social and Emotional Learning and revisit the key takeaways from the Sydney, Johannesburg and London launch events.\n\nDuke Ellington\n\nKen Shelton, Catalyst founding member and thought leader, moderated the event that was co-hosted by Dewayne J. McClary, Director, Educational Technology & Library Programs at District of Columbia Public Schools. Attendees gathered at the Duke Ellington School of Art, a famed school within DCPS known to offer a dual curriculum encompassing professional arts training and academic enrichment, in preparation for college and careers in the arts.\n\nSpecial guest, Scarlett Lewis Founder & Chief Movement Officer at the Jesse Lewis Choose Love Movement, shared her story and movement that started when Scarlett’s son, Jesse, was tragically killed in the Sandy Hook school shooting.\n\nScarlett Lewis\n\nScarlett’s research demonstrates that social and emotional curriculum is at the heart of school safety. Started in 2016, the Jesse Choose Love movement is in over 85 countries and has impacted more than one million educators and students. The program focuses on four important character values — Courage, Gratitude, Forgiveness, and Compassion in Action — which cultivates optimism, resilience and personal responsibility. Important elements of the program are positive psychology, mindfulness, neuroscience, character values, and curriculum to help educators understand and implement the necessary practices. These were demonstrated for the Catalyst attendees and everyone was provided two interactive lessons to take back to their institutions.\n\nFollowing Scarlett’s keynote, the Catalyst attendees discussed the ways in which Social and Emotional learning is part of their specific curriculum and coaching for teachers and students. Defined by CASEL (Collaborative for Academic, Social, and Emotional Learning) SEL is the process through which children and adults acquire and effectively apply the knowledge, attitudes, and skills necessary to understand and manage emotions, set and achieve positive goals, feel and show empathy for others, establish and maintain positive relationships, and make responsible decisions.\n\nIn the roundtable discussions at the Catalyst event, the attendees shared ideas and best practices in small groups.\n\nThe first question discussed in the small groups was how SEL can better prepare learners. Groups discussed curriculum, research and practices they are implementing for classroom learning. One big hurdle discussed was the rational for helping teachers embrace the addition of SEL curriculum with the core curriculum already being implemented. Catalyst attendees discussed how to motivate teachers in an already compressed learning day.\n\nGroup discussions\n\nThe conversation shifted to learners and providing a learning environment that delivers on the promise of SEL. Attendees provided specific examples of why SEL is important and how teaching practices can change to bring SEL to the forefront.\n\nInterestingly enough, Catalyst leaders stated that while not formal, SEL practices have been in classrooms for many years, but without rigor or consistency. The focus on specific SEL practices is welcome to ensure that we can assess the results of the effort and determine whether specific curriculum and practices can support student success in the world.\n\nOnce again, our members continued to ask for physical Catalyst events to further the movement and continue the dialogue in addition to the online platform. Follow us to hear about the next in-person workshop."}, {"url": "https://medium.com/education-change-agents/thats-a-wrap-global-launch-events-b07a7b4c35e5", "page_content": "That’s a Wrap — Global Launch Events Adam Collis · Follow · Feb 5, 2020 3 min read -- Listen Share\n\nWashington, District of Columbia in the United States was the site of the fourth and final launch event for Catalyst.\n\nIn collaboration with the District of Columbia Public Schools, more than 30 education leaders and change makers gathered at the Duke Ellington School of Arts to discuss the importance of Social and Emotional Learning and revisit the key takeaways from the Sydney, Johannesburg and London launch events.\n\nDuke Ellington\n\nKen Shelton, Catalyst founding member and thought leader, moderated the event that was co-hosted by Dewayne J. McClary, Director, Educational Technology & Library Programs at District of Columbia Public Schools. Attendees gathered at the Duke Ellington School of Art, a famed school within DCPS known to offer a dual curriculum encompassing professional arts training and academic enrichment, in preparation for college and careers in the arts.\n\nSpecial guest, Scarlett Lewis Founder & Chief Movement Officer at the Jesse Lewis Choose Love Movement, shared her story and movement that started when Scarlett’s son, Jesse, was tragically killed in the Sandy Hook school shooting.\n\nScarlett Lewis\n\nScarlett’s research demonstrates that social and emotional curriculum is at the heart of school safety. Started in 2016, the Jesse Choose Love movement is in over 85 countries and has impacted more than one million educators and students. The program focuses on four important character values — Courage, Gratitude, Forgiveness, and Compassion in Action — which cultivates optimism, resilience and personal responsibility. Important elements of the program are positive psychology, mindfulness, neuroscience, character values, and curriculum to help educators understand and implement the necessary practices. These were demonstrated for the Catalyst attendees and everyone was provided two interactive lessons to take back to their institutions.\n\nFollowing Scarlett’s keynote, the Catalyst attendees discussed the ways in which Social and Emotional learning is part of their specific curriculum and coaching for teachers and students. Defined by CASEL (Collaborative for Academic, Social, and Emotional Learning) SEL is the process through which children and adults acquire and effectively apply the knowledge, attitudes, and skills necessary to understand and manage emotions, set and achieve positive goals, feel and show empathy for others, establish and maintain positive relationships, and make responsible decisions.\n\nIn the roundtable discussions at the Catalyst event, the attendees shared ideas and best practices in small groups.\n\nThe first question discussed in the small groups was how SEL can better prepare learners. Groups discussed curriculum, research and practices they are implementing for classroom learning. One big hurdle discussed was the rational for helping teachers embrace the addition of SEL curriculum with the core curriculum already being implemented. Catalyst attendees discussed how to motivate teachers in an already compressed learning day.\n\nGroup discussions\n\nThe conversation shifted to learners and providing a learning environment that delivers on the promise of SEL. Attendees provided specific examples of why SEL is important and how teaching practices can change to bring SEL to the forefront.\n\nInterestingly enough, Catalyst leaders stated that while not formal, SEL practices have been in classrooms for many years, but without rigor or consistency. The focus on specific SEL practices is welcome to ensure that we can assess the results of the effort and determine whether specific curriculum and practices can support student success in the world.\n\nOnce again, our members continued to ask for physical Catalyst events to further the movement and continue the dialogue in addition to the online platform. Follow us to hear about the next in-person workshop."}, {"url": "https://www.businessinsider.com/look-inside-life-people-the-social-network-ten-years-later-2020-10", "page_content": "It's been 10 years since actor Jesse Eisenberg appeared on movie screens as Mark Zuckerberg in a dramatized version of Facebook's founding story in the movie \"The Social Network.\"\n\nJesse Eisenberg attends the 'The Social Network' premiere during the 5th Rome International Film Festival on November 1, 2010 in Rome, Italy. Photo by Tullio M. Puglia/Getty Images\n\nThe two-hour-long David Fincher and Aaron Sorkin modern classic holds a 96% rating on Rotten Tomatoes and has raked in close to $100 million in US box office earnings.\n\n\"Mr. Fincher and Mr. Sorkin offer up a creation story for the digital age and something of a morality tale, one driven by desire, marked by triumph, tainted by betrayal and inspired by the new gospel: the geek shall inherit the earth,\" film critic Manohla Dargis wrote for The New York Times in 2010.\n\nWhile the movie has entertained many over the last decade and earned more than a few fans, one person in particular has remained unimpressed — Mark Zuckerberg."}], "Adam Collis appeared in The Amazing Spider-Man.": [{"url": "https://www.insider.com/celebrities-in-spider-man-movies-2021-11", "page_content": "Octavia Spencer appeared at the wrestling event Peter competes in to try and win cash for a car.\n\nYou can spot Octavia Spencer 37 minutes into the original \"Spider-Man.\" Columbia Pictures\n\nThe Academy Award winner had a small cameo in 2002's \"Spider-Man\" as the \"check-in girl\" letting people into the wrestling match.\n\nIn the scene, Spencer's character tries to warn him about entering into the match and proceeds to tell him that they're not responsible for any injuries he sustains."}, {"url": "https://donttellharry.com/2019/11/05/who-are-the-villains-in-the-amazing-spider-man-films/", "page_content": "In 2012, Sony Pictures launched a series of live-action Spider-Man movies under the title The Amazing Spider-Man. The short-lived series – which ran between 2012 and 2014 – covered two films, The Amazing Spider-Man (2012) and The Amazing Spider-Man 2 (2014).\n\nAcross the course of the two films, the series introduced a number of villains. Some became a key focus of the story, while others were merely background players, introduced for inclusion in future movies (which never materialised).\n\nBut who are the villains of The Amazing Spider-Man films?\n\nAdvertisements Advertisements\n\n______________\n\nThe Amazing Spider-Man (2012)\n\nHere are the villains of The Amazing Spider-Man…\n\nDr. Curt Connors/The Lizard – Rhys Ifans\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\n“Poor Peter Parker. No father. No mother. No uncle. You’re all alone.”\n\nThe primary villain of The Amazing Spider-Man is Dr. Curtis Connors – a scientist at Oscorp who is working on research involving cross-species genetics. Connors’ research has the potential to help amputees regrow lost limbs – something that he himself would benefit from, having previously lost his right arm.\n\nUpon piecing together a potentially successful formula – with the help of Peter Parker – Connors experiments on himself. But while the experiment gives Connors a new arm, it also transforms him into The Lizard – a deranged, humanoid reptile.\n\nAdvertisements\n\n______________\n\nConvenience store thief – Leif Gantvoort\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nThe second core villain, yet perhaps the most important one on this list, is an unnamed thief who appears in the first half of The Amazing Spider-Man. This thief is arguably the most important villain on this list as he leads Peter Parker down a path towards being a hero.\n\nThe unnamed man robs a convenience store in front of Peter Parker. Parker has the opportunity to stop him, but chooses not to – even though he is powerful enough to do so.\n\nDue to Peter’s inactions, the thief runs away from the store and straight into the path of Peter’s uncle, Ben Parker. The thief shoots and kills Uncle Ben, turning Peter’s world upside down in the process.\n\nAdvertisements\n\n______________\n\nGustav Fiers/The Gentleman – Michael Massee\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nA third villain appears in The Amazing Spider-Man in the shape of a mysterious figure who pops up during a post-credit scene. Although he is credited as ‘Man in the Shadows’, this figure is Gustav Fiers, aka The Gentleman.\n\nThe Gentleman only appears briefly in the movie, in order to establish his presence as a background player in The Amazing Spider-Man movie series.\n\nNorman Osborn\n\nIn addition to the above, Norman Osborn (known in the comics as Spidey’s arch enemy the Green Goblin) is mentioned in The Amazing Spider-Man. However, the character does not have a physical presence in this movie.\n\nAnd now onto The Amazing Spider-Man 2…\n\nAdvertisements Advertisements\n\n______________\n\nThe Amazing Spider-Man 2 (2014)\n\nHere are the villains of The Amazing Spider-Man 2…\n\nMax Dillon/Electro – Jamie Foxx\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\n“Don’t you know? I’m Electro!”\n\nMax Dillon is an Oscorp employee, with a very low opinion of himself. Max thinks he is a nobody, until Spider-Man saves his life and he suddenly sees value in his existence.\n\nThis act leads Dillon to believe he and Spider-Man are best friends, and he obsesses over the wall-crawler. But this obsession takes a sinister turn when Dillon acquires electric-based abilities in an accident, and he takes a path towards becoming a supervillain.\n\nAdvertisements\n\n______________\n\nNorman Osborn – Chris Cooper\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\n“This is not how I imagined I would die. Looking at my son and seeing a stranger.”\n\nNorman Osborn appears briefly in The Amazing Spider-Man 2, as the bed ridden owner of Oscorp. Osborn is dying from a degenerative disease called retroviral hypodysplasia – which has caused him to mutate and eventually leads to his death.\n\nAdvertisements\n\n______________\n\nHarry Osborn/Green Goblin – Dane DeHaan\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nHarry Osborn is a childhood friend of Peter Parker, but the pair drift apart when Harry is sent away to boarding school. When his father becomes ill, Harry returns to New York to take over Oscorp.\n\nSuffering from retroviral hypodysplasia – the same condition that kills his father – Harry searches for a cure, which he believes can be found in Spider-Man’s blood. But when Spider-Man refuses to help him, Harry injects himself with an experimental formula, which transforms him into a goblin-like creature.\n\nAdvertisements\n\n______________\n\nGustav Fiers/The Gentleman – Michael Massee\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nThe shadowy figure known as The Gentleman reappears in The Amazing Spider-Man 2. He is once again depicted as a background player, only this time it is clear he is working for Harry Osborn.\n\nThe Gentleman – namechecked as Mr. Fiers in the movie – is building a team of supervillains, which will potentially include the Vulture and Doctor Octopus. His first recruit/test subject, is The Rhino.\n\nAdvertisements\n\n______________\n\nAleksei Sytsevich/Rhino – Paul Giamatti\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nAleksei Sytsevich is a Russian mobster, who is introduced towards the beginning of The Amazing Spider-Man 2, during a dramatic police chase. Sytsevich has stolen a truck filled with plutonium and Spider-Man and a squad of police cars are on his trail.\n\nSpider-Man catches Sytsevich – humiliating him in the process – and this leads to the character’s incarceration in the prison known as The Vault. But Sytsevich breaks out of the prison, with help from The Gentleman, and is given a battle suit which turns him into The Rhino.\n\nAdvertisements\n\n______________\n\nAlistair Smythe – B.J. Novak\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nAlistair Smythe appears as an employee of Oscorp. He bosses Max Dillon around and views him as nothing more than an underling.\n\nFans of the comics will know Smythe for his connection to the Spidey-hunting robots called the Spider Slayers. However, this is not something which is mentioned in The Amazing Spider-Man 2 and Smythe merely appears in the movie as a background character.\n\nAdvertisements Advertisements\n\nAdditional Spider-Man villains\n\nIn addition to the above villains, The Amazing Spider-Man 2 teases a couple of classic Spider-Man adversaries. These villains include Doctor Octopus and the Vulture, who are part of Oscorp’s secretive ‘Special Projects’ department.\n\n______________\n\nThere are only two entries in The Amazing Spider-Man series, yet across the two films a significant number of villains are introduced into the Spider-Man movie mythology. Some of these villains are used as primary characters, while others are being lined up for an appearance in the aborted The Amazing Spider-Man 3.\n\nThe Amazing Spider-Man 3 never came to pass, but should you wish to know more about the proposed project then take a look through my post: ‘What happened to The Amazing Spider-Man 3?’ This post will tell you what was planned for the film and why it was cancelled.\n\nAs for the villains of The Amazing Spider-Man, who is your favourite? Is The Lizard the best villain of the series, or do you think Electro is the highlight of the films? Perhaps you wanted to see more from The Gentleman? Whatever your thoughts, please sound off in the comments section.\n\nRead more:\n\nAdvertisements\n\nAdvertisements"}, {"url": "https://www.insider.com/amazing-spider-man-andrew-garfield-movies-details-easter-eggs-references-2021-12", "page_content": "Uncle Ben holding a box of trophies in \"The Amazing Spider-Man\" seems like a callback to a subtle detail in Sam Raimi's \"Spider-Man.\"\n\nMartin Sheen in \"The Amazing Spider-Man.\" Columbia Pictures; Columbia Pictures\n\nIn Raimi's film, trophies are seen along a ledge by the staircase of the Parker home. But the detail is never addressed by the characters, so it's unclear to whom the awards belong.\n\nIn \"TASM,\" the trophies are part of a conversation in which Aunt May (Sally Field) tells Uncle Ben (Martin Sheen) not to leave that \"filthy box\" in her kitchen."}, {"url": "https://www.looper.com/716787/the-untold-truth-of-the-amazing-spider-man/", "page_content": "The Untold Truth Of The Amazing Spider-Man\n\nOn the soundtrack to the original \"Spider-Man\" movie, Chad Kroeger and Josey Scott sang about how only a hero could save us, but they weren't gonna stand there and wait. While the song was written for the 2002 Spidey, it feels apt for \"The Amazing Spider-Man\" films too. Just as fans were growing attached to Andrew Garfield's webslinger, he disappeared into the Marvel ether alongside other retired comic book movie heroes like Nicolas Cage's Ghost Rider and Wesley Snipes' Blade.\n\nYet, as another pair of singers once told us: \"There can be miracles when you believe.\" That miracle happened in 2021, as Garfield's web-head returned in \"Spider-Man: No Way Home.\" It was a welcome reminder that he was better than some fans may remember, and that maybe Marvel loyalists had been too harsh on the films in hindsight. Looking back, the production of these movies is a fascinating story unto themselves, one filled with fights, heartache, and even a near suffocation on set. Let's swing right into the untold story of \"The Amazing Spider-Man.\""}, {"url": "https://donttellharry.com/2019/11/03/who-is-the-man-in-the-shadows-in-the-amazing-spider-man-movies/", "page_content": "If you have watched The Amazing Spider-Man movies (2012-2014), then you probably are wondering who the Man in the Shadows is? He is the character who appears in both films, yet slinks around in the background with limited screen time.\n\nWell, if you want to know a little bit more about the Man in the Shadows, you have come to the right place. Not only will I tell you where he can be found in both Amazing movies, but I can also tell you who he is and what he is doing in the films.\n\nFirst up, let’s recap where he can be found in each picture.\n\nAdvertisements Advertisements\n\n_______\n\nThe Amazing Spider-Man (2012)\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nThe Man in the Shadows makes his first appearance at the end of The Amazing Spider-Man. If you don’t sit through a few of the end credits you will miss him.\n\nAfter the initial set of credits appear, a scene opens up to show Dr. Curt Connors in a prison cell. Connors has been put in the cell following his transformation into The Lizard and it is here that he receives a visitor.\n\nAdvertisements\n\nAlthough Connors appears to be alone, a voice suddenly calls out from the shadows. It is here that the following exchange takes place:\n\nThe Man in the Shadows: “Hello doctor. Did you tell the boy?”\n\nConnors: “Tell him what?”\n\nThe Man in the Shadows: “Did you tell the boy the truth about his father?”\n\nConnors: “No.”\n\nThe Man in the Shadows: “Well that’s very good. We’ll let him be for now.”\n\nConnors: “You should leave him alone.”\n\nAfter this exchange there is a flash of lightning, followed by the feeling that Connors is now alone in his cell. The scene fades to black and the credits continue.\n\nThere is no explanation as to who the voice belongs to, and the character is not named during the exchange. However, in the credits, the character is listed as ‘Man in the Shadows’, with actor Michael Massee taking on the part.\n\nThe “boy” that is mentioned during the exchange is Peter Parker.\n\nAdvertisements Advertisements\n\n_______\n\nThe Amazing Spider-Man 2\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nWhen the ‘Man in the Shadows’ reappears it is during the final act of The Amazing Spider-Man 2. This time he visits Harry Osborn, who is locked up at Ravencroft Institute following his transformation into the Green Goblin.\n\nOnce again there is an exchange.\n\nAdvertisements\n\nHarry: “You’ve made progress.”\n\nThe Man in the Shadows: “I’ve identified several worthy candidates. Now that Spider-Man’s gone, this city will never be the same.”\n\nHarry: “Oh, I’m counting on that.”\n\nThe Man in the Shadows: “Speaking of progress, you’re looking better.”\n\nHarry: “It comes and goes. Tell me more.”\n\nThe Man in the Shadows: “How many men did you have in mind?”\n\nHarry: “I want to keep it small. Everything you need is already at Oscorp.”\n\nCut to a scene at Oscorp, and a voice-activated security system identifies the ‘Man in the Shadows’ as Mr. Fiers. Here, Fiers is seen walking past a collection of weapons, including the tentacles of Doctor Octopus, the wings of the Vulture, and a Rhino suit.\n\nThe discussion that took place between Harry and Fiers is about the formation of a supervillain group. Oscorp has been developing weapons and Fiers has an idea of who he can recruit for the team.\n\nAdvertisements Advertisements\n\n_______\n\nWho is Mr. Fiers?\n\nImage: ©Marvel Comics\n\nSo, thanks to a namedrop in The Amazing Spider-Man 2, it is established that the Man in the Shadows is actually called Mr. Fiers. In Spider-Man mythology, Mr. Fiers is better known as Gustav Fiers aka The Gentleman.\n\nThe Gentleman originated in a series of Spider-Man novels, beginning with Spider-Man: The Gathering of the Sinister Six, which was published in 1999. He later reappeared in Spider-Man: Revenge of the Sinister Six and Spider-Man: Secret of the Sinister Six, before being transported across to the comics.\n\nAs you might have guessed by now, the character was a background player in the formation of the villainous Sinister Six – a team of Spider-Man’s most fearsome foes.\n\nAdvertisements\n\n_______\n\nWhat is The Gentleman’s role in The Amazing Spider-Man movies?\n\nImage: ©Sony Pictures/Columbia Pictures/Marvel Entertainment\n\nAlthough his motivations are never truly explained in the Amazing movies, from his brief appearances as well as his exchanges with Curt Connors and Harry Osborn, The Gentleman appears to be keeping a careful watch on everything to do with Spider-Man.\n\nIn The Amazing Spider-Man it is established that The Gentleman knows Peter’s secret identity. When he mentions the “truth” about Peter’s father, he is referring to an experiment that Richard Parker was working on, which indirectly transformed Peter into Spider-Man.\n\nReading between the lines, The Gentleman is intrigued by this situation and is happy to sit back and watch what Spider-Man does next. He is interested to see what choices Spidey makes and whether this will benefit him.\n\nAdvertisements\n\nFast forward to The Amazing Spider-Man 2 and The Gentleman is now working closely with Harry Osborn on a project to form a team. He mentions that Spider-Man has “gone” which suggests this exchange takes place during a period in which Spidey is on a leave of absence (following the death of his girlfriend, Gwen Stacy).\n\nFrom this second exchange it is now clear that Spider-Man is no longer of interest to The Gentleman and this group he is putting together will include new people.\n\nAs The Amazing Spider-Man film series ended after the second entry, the full details of the group remain somewhat of a mystery. However, thanks to a few details revealed on screen, as well as some behind the scenes information regarding the Amazing series, some of the motivations of The Gentleman can be pieced together.\n\nFirstly, the group he is trying to form is the Sinister Six. The group that he helped create in the aforementioned Spider-Man novels, is the same group he is trying to create in the film series.\n\nHow do I know this? Because when The Amazing Spider-Man 2 was in production, Sony Pictures – the studio behind the Spider-Man movies – was in discussions to develop a film based around the Sinister Six. The film was to be released after The Amazing Spider-Man 2, but before The Amazing Spider-Man 3.\n\nWhile neither the Sinister Six movie or The Amazing Spider-Man 3 went ahead, director Marc Webb has let out a few titbits about what the films might have included. I’ve written a post about The Amazing Spider-Man 3, which you should check out, but in short, a newly resurrected Norman Osborn would have been involved in some capacity, and the Vulture would have been part of the team.\n\nAdvertisements\n\nAs for the rest of the group, well Doctor Octopus’s tentacles were viewed in The Amazing Spider-Man 2 and the Rhino was introduced at the very end of the movie. The Green Goblin – be it Norman or Harry – would likely have been included in the team too.\n\nSo, that’s Green Goblin, Vulture, Doctor Octopus and Vulture. That covers four spaces in the team of six.\n\nThe other two spots could have been left over for established characters, such as The Lizard who was already part of the movie series, or they could have been reserved for new blood. It has never been made clear.\n\nAdvertisements\n\nEither way, The Gentleman was introduced into The Amazing Spider-Man films to help usher in the Sinister Six. Had the series lasted a little longer we would have seen his plan come to fruition, but instead we were largely given a background player that lurked in the shadows.\n\nSo, next time you watch The Amazing Spider-Man and The Amazing Spider-Man 2, keep an eye out for The Gentleman. He is up to something and now you know what it is.\n\nRead more:\n\nAdvertisements\n\nAdvertisements"}, {"url": "https://www.ign.com/articles/all-the-spideys-in-spider-man-across-the-spider-verse-full-spoilers-edition", "page_content": "The first trailer for Spider-Man: Across the Spider-Verse starts with Miles Morales’s mother telling him to take care of himself, and that’s advice he really should take to heart, because he’s about to wind up in a really sticky situation where a whole multiverse worth of Spider-People are after him. But who are these faces, some familiar and some new?\n\nWith Across the Spider-Verse swinging its way into theaters, here’s a slideshow of every Spidey we’ve been able to pick out from the various trailers and posters. Note that the slideshow has been updated for the movie's release, so beware of spoilers ahead!\n\nIGN gave Across the Spider-Verse an 8, with reviewer Tom Jorgensen writing: \"Spider-Man: Across the Spider-Verse surges with visual inventiveness and vibrance in an undeniably strong evolution of the style established in Into the Spider-Verse. Miles and Gwen’s search for their place in the multiverse is relentless and exciting, almost to a fault, and though the plot is often an afterthought to the pure chaos of creation on display, strong performances and character arcs that feel true to the heroes we met last time help ensure that Across the Spider-Verse is a more-than-worthy follow-up to an all-time classic.\"\n\nIf you need a refresher on all things Spider-Verse, here's our breakdown of 5 things to remember before watching Across the Spider-Verse. You can also see where the original Into the Spider-Verse ranks on our list of the best animated action movies, or brush up on every Spider-Man movie and series in development.\n\nYou can also vote on your favorite Spider-Verse character in the sequel by heading over to our Across the Spider-Verse Face-Off.\n\nClick above to start playing the Face-Off!"}, {"url": "https://www.ign.com/articles/amazing-spider-man-3-trending-as-fans-call-for-andrew-garfield-to-star-in-new-movie", "page_content": "Warning: This article contains spoilers for Spider-Man: No Way Home ! Be sure to check out IGN's review of the new Spider-Man movie .\n\nSpider-Man fans want to see Andrew Garfield back as Peter Parker, as The Amazing Spider-Man 3 trends on Twitter.\n\nIt’s no secret that Andrew Garfield’s Amazing Spider-Man trilogy was cut short after the poor performance of its second instalment, The Amazing Spider-Man 2 . Goofy effects, a dodgy script and a cringey take on iconic villain Electro made it difficult for Sony to justify carrying on – ultimately resulting in the third film in the trilogy being cancelled.\n\nBut now, it looks as though Spider-Man fans want Andrew Garfield back.\n\nAmazing Spider-Man 2 Photo Gallery 10 Images\n\nAccording to Comicbook.com , his recent appearance in Spider-Man: No Way Home has sparked a wave of support for Andrew Garfield’s Peter Parker.\n\n“Andrew Garfield stole many scenes of Spider-Man: No Way Home with his tragicomic (and meta) performance as ‘Peter 3’,” said Comicbook.com. “After getting a reminder of everything that Andrew Garfield can be as Spider-Man, Marvel fans now want Sony to make The Amazing Spider-Man 3 actually happen!”\n\nAnd with an outpouring of love on Twitter , it looks as though fans want to see that third Amazing Spider-Man movie after all.\n\nAndrew Garfield did an incredible job in The Amazing Spider-Man franchise and it has always bothered me that his performance was so overlooked.\n\n\n\nHe deserves the chance to end his Spidey’s story in The Amazing Spider-Man 3. #MakeTASM3 pic.twitter.com/ZTmJxuUf2i — Michael Patterson (@michaelp93) December 20, 2021\n\nNow I’m seeing a lot of make TASM 3 tweets, and even though TASM 2 wasn’t all that amazing, I still want Andrew to receive a closure for his films cause he absolutely fucking deserves it. Make it happen Sony and Marvel. #MakeTASM3 pic.twitter.com/IhBZV1QIPE — Sentinel 🍻 (@Sentinel_OpsYT) December 19, 2021\n\nI love Tom Holland, he’s the best possible take on this cinematic Spider-Man, charming, endearing, exuberant, you love him immediately.\n\n\n\nI like Tobey Maguire\n\n\n\nBut to me, the Spider-Man who feels the most like the Comic Book take on the character is Andrew Garfield. #MakeTASM3 pic.twitter.com/iL5B0HjxgD — Coy Jandreau (@CoyJandreau) December 20, 2021\n\nThe hashtag #MakeTASM3 is packed full of support for Andrew Garfield and is a rallying cry to Sony and Marvel to finish off The Amazing Spider-Man trilogy.\n\nSpider-Man: No Way Home stars Tom Holland as Peter Parker, alongside Tobey Maguire and Andrew Garfield as two alternative Peter Parker’s from separate universes in the multiverse.\n\nLoading Play\n\nWhether or not there’s enough attention to make The Amazing Spider-Man 3 worth exploring remains to be seen. But with some fans comparing it to the Snyder Cut, it could be only a matter of time before we see Andrew Garfield swing back onto our screens - especially after Spider-Man: No Way Home snagged a $253 million opening weekend .\n\nSpider-Man: No Way Home opened in theatres on December 17, 2021.\n\nRyan Leston is an entertainment journalist and film critic for IGN. You can follow him on Twitter."}, {"url": "https://www.looper.com/674452/what-you-dont-know-about-andrew-garfields-spider-man/", "page_content": "What You Don't Know About Andrew Garfield's Spider-Man\n\nOne can argue that among all the actors who portrayed Spider-Man in live action over the last two decades, Andrew Garfield has faced the toughest battle of all. His two films, \"The Amazing Spider-Man\" and \"The Amazing Spider-Man 2,\" were the weakest-performing among Sony's live-action Spider-Man movies, according to Screen Rant. The two films, which were directed by Marc Webb, are also currently the lowest-rated Spider-Man movies on Rotten Tomatoes. As for the actor himself, Andrew has described his time in Spider-Man's webbed boots as \"heartbreaking,\" which is undeniably a tragic thing to hear from someone who grew up with a deep affection for the character.\n\nThe abrupt end to Andrew's run as the webslinger has raised many questions about the ill-fated franchise, including why the planned trilogy became a duology and what the future could have been like for Andrew's version of Spider-Man. Given how the meteoric success of the Marvel Cinematic Universe has enabled his successor Tom Holland to meet and work with other superheroes, it's interesting to think about the position Andrew's Spider-Man could have been in, had the actor's time as the wallcrawler not been cut short. From the circumstances that brought about \"The Amazing Spider-Man\" and its sequel to the ways Andrew embraced being Spider-Man, here are some interesting facts about the English actor's take on the beloved superhero."}]}