{"Adam Collis is currently based in Los Angeles.": [{"url": "https://search.asu.edu/profile/1459701", "page_content": "Long Bio\n\nAdam Collis is a filmmaker and film professor dedicated to making distinctive feature films and to giving his students one of a kind opportunities to learn filmmaking directly from world class filmmakers from both studio and independent realms. He accomplishes this by connecting his students and Hollywood pros through video conferences, at in-class visits, and on actual feature film sets.\n\nSix months after graduating from University of South California's (USC) School of Cinematic Arts, Professor Collis directed the 20th Century Fox feature film, Sunset Strip (2000), starring Simon Baker (The Mentalist) and Jared Leto (Dallas Buyer's Club).\n\nProfessor Collis has directed short form and feature length documentaries. Additionally, he earned his MBA from UCLA's Anderson School of Business where he led a six-month, six-person research study on new business models for Independent Films.\n\nIn 2014, he produced and directed Car Dogs, starring Patrick Adams (Suits), George Lopez, Nia Vardalos (My Big Fat Greek Wedding), and Oscar winner Octavia Spencer (The Help). Next up for Professor Collis is The Long Blue Yonder, which is being produced by Brunson Green (The Help) and has Tye Sheridan (Mud) attached in the lead role.\n\nProfessor Collis also has a particular interest in helping young filmmakers get their footing in Hollywood. As a professor of practice of film directing at Arizona State University, he's created classes, programs and internships, including the successful Skype-screening series, Hollywood Invades Tempe, which hosted more than a dozen major Hollywood filmakers and executives."}, {"url": "https://peoplepill.com/people/adam-collis/", "page_content": "Adam Collis is an American filmmaker and actor. He attended the Duke University from 1986 to 1990 and the University of California, Los Angeles from 2007 to 2010. He also studied cinema at the University of Southern California from 1991 to 1997. Collis first work was the assistant director for the Scott Derrickson's short Love in the Ruins (1995). In 1998, he played \"Crankshaft\" in Eric Koyanagi's Hundred Percent.\n\nHe has also directed several shorts and documentaries, including the award winning short film, Mad Boy, I'll Blow Your Blues Away. In 2000, Collis directed Sunset Strip, a feature film about the Los Angeles rock 'n roll scene in the early 1970s. The film was produced by Art Linson and starred Simon Baker, Nick Stahl, Jared Leto and Anna Friel. He received awards and nominations from the Aspen Shortsfest, Austin Film Festival, Hamptons International Film Festival, Los Angeles Independent Film Festival, New York Comedy Festival, and Palm Springs International Festival of Short Films.\n\nInfamous amongst his students for coining the term \"Image Size Variation\" and \"Psycho-Emotional Instrument\" when referring to directing actors."}, {"url": "https://cocofinder.com/name/adam-collis", "page_content": "Disclaimer: CocoFinder's mission is to give people easy and affordable access to public record information, but CocoFinder does not provide private investigator services or consumer reports, and is not a consumer reporting agency per the Fair Credit Reporting Act. You may not use our site or service or the information provided to make decisions about employment, admission, consumer credit, insurance, tenant screening or any other purpose that would require FCRA compliance. For more information governing permitted and prohibited uses, please review our \"Do's & Don'ts\" and Terms & Conditions.\n\nOur site includes links to third-party websites or services we partner with. If you make a purchase through these links, we will receive payment of commissions, referral fees, or rewards at no extra cost to you.\n\nCopyright © 2023 CocoFinder. All trademarks are the property of their respective owners."}, {"url": "https://alchetron.com/Adam-Collis", "page_content": "Adam Collis is an American filmmaker and actor. He attended the Duke University from 1986 to 1990 and the University of California, Los Angeles from 2007 to 2010. He also studied cinema at the University of Southern California from 1991 to 1997. Collis first work was the assistant director for the Scott Derrickson's short Love in the Ruins (1995). In 1998, he played \"Crankshaft\" in Eric Koyanagi's Hundred Percent.\n\nHe has also directed several shorts and documentaries, including the award winning short film, Mad Boy, I'll Blow Your Blues Away. In 2000, Collis directed Sunset Strip, a feature film about the Los Angeles rock 'n roll scene in the early 1970s. The film was produced by Art Linson and starred Simon Baker, Nick Stahl, Jared Leto and Anna Friel. He received awards and nominations from the Aspen Shortsfest, Austin Film Festival, Hamptons International Film Festival, Los Angeles Independent Film Festival, New York Comedy Festival, and Palm Springs International Festival of Short Films.\n\nInfamous amongst his students for coining the term \"Image Size Variation\" and \"Psycho-Emotional Instrument\" when referring to directing actors."}, {"url": "https://prabook.com/web/adam.collis/2545482", "page_content": "Adam Collis\n\nActor director\n\n1995 United States of America\n\nCollis first work was the assistant director for the Scott Derrickson\"s short Love in the Ruins (1995). In 1998, he played \"Crankshaft\" in Eric Koyanagi\"s Hundred Percent. He has also directed several shorts and documentaries, including the award winning short film, Mad Boy, I\"ll Blow Your Blues Away. In 2000, Collis directed Sunset Strip, a feature film about the Los Angeles rock \"n roll scene in the early 1970s. The film was produced by Art Linson and starred Simon Baker, Nick Stahl, Jared Leto and Anna Friel. Infamous amongst his students for coining the term \"Image Size Variation\" and \"Psycho-Emotional Instrument\" when referring to directing actors."}, {"url": "https://www.azcentral.com/story/entertainment/movies/billgoodykoontz/2017/03/23/car-dogs-director-adam-collis-interview-arizona-film/99524354/", "page_content": "Bill Goodykoontz\n\nUSA TODAY NETWORK\n\nAdam Collis thinks big.\n\nThe director of “Car Dogs,” a dark comedy about a car dealership set in and filmed in Scottsdale that opens in Harkins Theatres across the Valley on Friday, March 24, envisions a lot of success for the film, but not just in the usual make-or-break box-office fashion. The amiable, chatty Collis has more in mind: reinventing the way independent film is made and financed.\n\nRELATED:Arizona-based 'Car Dogs' familiar but fun\n\nCollis, a film professor at Arizona State University, made the movie with 85 ASU interns, as part of the school’s Film Spark program. The film premiered in Scottsdale on Monday, March 20. If it does well in Phoenix, the hope is that other markets will pick up the film.\n\nThings To Do app: Get the best in events, dining and travel right on your device\n\n“The really important idea for me is that the people of Phoenix have the chance to enjoy a super entertaining film that has Phoenix all over it … and in addition to going and watching an entertaining movie that has so much Phoenix in it, there’s also this opportunity to launch a national release that didn’t get launched out of LA or New York,” Collis said. “We can do it right here. To me that’s exciting.”\n\nAnd more than that.\n\n“That is a transformative idea for independent cinema,” Collis said, “if we launch this movie out of Phoenix and all of a sudden Detroit says, what the heck is happening over there in Phoenix, we want to put the movie on our circuit, and all of a sudden a theater chain in Wisconsin says, what’s that “Car Dogs” thing, I want that over here – and it starts here, at ASU and Phoenix? That changes the game for independent cinema, because that can create a model that we here in Phoenix will be the first mover on, and be able to replicate, but then other markets and other universities could do the same.”\n\nThe film, whose cast includes George Lopez, Nia Vardalos, Octavia Spencer and several other actors whose faces you would recognize, if not their names, is set in a Scottsdale dealership owned by a jerk, played by Chris Mulkey, who will only offer his son (Patrick J. Adams) his own dealership if he and his team can sell 300 cars. In a lengthy interview recently, Collis talked about how the film, written by Mark Edward King, of Scottsdale, came about, and how high his hopes are for it.\n\nQuestion: What made you want to make the film?\n\nAnswer: First and foremost, it’s always great to have a fun movie about a team of car salesmen trying to accomplish this impossible task of trying to sell more cars than have ever been sold in a single day. I go to the movies to be entertained, so to have the opportunity to do a movie that sat at the nexus between “Glengarry Glen Ross” and “Ocean’s Eleven,” that sounded like a lot of fun.\n\nThere’s a whole variety of other reasons, not the least of which was the opportunity to explore the moral question of what are you willing to do? Are you willing to do whatever it takes to get what you want in business and in life? And what does that really mean? That’s a big part of what motivated me to do the film.\n\nQ: It’s certainly a relatable experience for most people.\n\nA: One of the most-compelling reasons was because I knew it was a movie everyone can relate to, because nearly everyone has bought a car. It’s an emotional touch point for nearly every American. It’s baseball, hot dogs and buying cars. That what it means to be an American, and the relatability of this car-buying experience was one of the things that really drew me to the material. But I don’t want to be too highfalutin ... I do think that there is a compelling metaphor that the movie makes about the free-market society in which we live and the moral obligation that each of us has to do the right thing in order to have the freedom to preserve that free-market opportunity.\n\nQ: And you had ASU students helping on the set.\n\nA: We didn’t just make a movie and give 85 students the chance to learn feature filmmaking from an Oscar-winning cast and crew. We built an entire supply chain. We built out soup-to-nuts a way to finance movies; the balances, risk and reward; a way to make a movie, where we have a teaching hospital for aspiring filmmakers; but the most important one is we built out an entire launch pad, which is effectively its release mechanism, where we’re partnering with ASU and Harkins … to launch a movie that, if it gets into orbit, we have the opportunity to expand the release.\n\nQ: Do you have a memorable car-buying experience?\n\nA: The first time I ever bought a car, I actually brought … my best friend from film school with me. He grew up on a car lot. I said I’ve never done this. I’d just done “Sunset Strip” (the first film Collis directed, released on 2000) and made a whole bunch of money and I need to get a vehicle, can you walk me through this? And sure enough, he was guiding me through every step, down to where the car salesman said, “Excuse me, I need to go talk to my manager.” He went to go talk to his manager and (his friend) turned to me and said, “What are you willing to pay for this Subaru Outback?” I said this much money. He said write that amount on a check, and when he comes back he’s going to give you a number that’s higher than that, almost certainly and you just need to slide the check across the table and say, “This is what I am prepared to pay for the car today.” And it literally happened exactly like that. I slid the check across the table and (his friend) knew he wouldn’t be able to resist having the check right there, and sure enough, they took it. And so that was a time that I actually had some guidance. But I think one of fun parts of the movie is making this fun for people who actually buy cars.\n\nQ: Yeah, as fun as that could ever be.\n\nA: What’s been awesome, whether it was at the Phoenix Film Festival or other places we’ve screened the film, is the universal response that I get when I see people walking out of the film and they know that I’m the director and they kind of walk up to me with a big smile on their face and say, oh my God, that’s exactly what happened to me! Or they walk up to me with that big grin on their face because they’ve enjoyed the film and they say, oh my God, I’m so glad I watched your film, I’m about to buy a new car.\n\nQ: Did working with students ever slow down production?\n\nA: There’s no question that it made the production longer. I think that Car Dogs LLC and our amazing investors were inspired by the opportunity to give students the chance to learn filmmaking from an Oscar-winning cast and crew, and they were incredibly generous in allowing us to make the film in Arizona, as opposed to making it in a state with a tax incentive. But the opportunity to give students this incredible experiential learning opportunity … was inspiring to people, and ASU really owes a debt of gratitude to our “Car Dogs” investors.\n\nYou know, there were some things that came up, just even like loss and damage, students dropping equipment, slowing down production, that we knew could be part of that equation.\n\nQ: They are students, but they’re also part of a real production.\n\nA: By being able to learn in an academic environment, and also to be able to make mistakes without it costing you your job, that’s huge. That’s something I would tell students all the time. They’d make a big gaffe, and it might even cost the production a little something, and I would look at them and I would say, “What I’m really happy about right now is that you got to learn from that mistake without having to lose your job. But I want you to know that in the real world that mistake might have cost you your job. And that’s OK in this environment. And if you learn from it and it makes you a better professional when you get out in the real world, then this was all worth it.”\n\nQ: Did it put extra pressure on you, as both director and professor?\n\nA: Day two, for whatever reason my amazing assistant director, Sean Hobin, for reasons that are still a little confusing to me, scheduled our most-complex day, and we had like 40 set-ups, it was the second day, the students were still working it out, and that was a moment where I was like, “Oh my God, with all these students are we going to get through this?” But we got through that day and we made our day, and at the end of the production we got everything we wanted shot, and we made our budget, even with the students.\n\nQ: That’s impressive. And the crew must have had to work a little differently, too, at least at first.\n\nA: Our cinematographer on day one asked one of the students to go get a sandbag about 50 yards away. And on a film set you never run, it’s dangerous to run on a film set, but you have to walk with purpose. There is a briskness and speed at which you walk on a set. And so the student took the direction of the cinematographer, David Stump, and went sort of sidling off to get the sandbag as if they might be walking to go get a hoagie. And David just cupped his hands around his mouth and said, “WALK WITH PURPOSE!”\n\nThe students might cost you a little time, but at least they’re excited to be there. They’re really fired up, and they really want to be there. I think that while, sure, you had some on-the-job training that was going on, you had a bunch of students that were pumped.\n\nReach Goodykoontz at bill.goodykoontz@arizonarepublic.com. Facebook: facebook.com/GoodyOnFilm. Twitter: @goodyk.\n\nMORE AZCENTRAL ON SOCIAL: Facebook | Twitter | Instagram | Pinterest\n\n\n\n"}, {"url": "https://azbigmedia.com/lifestyle/consumer-news/movie-reviews/qa-scottsdale-based-director-car-dogs/", "page_content": "I recently sat down with Adam Collis, the director of the upcoming “Car Dogs”: a movie made by and for Arizonans. The film, which was shot in Scottsdale and features fierce competition between car salesmen, opens up a unique opportunity for the movie business in The Grand Canyon State.\n\nOur conversation has been edited for length:\n\nRyan Bordow: It’s so surreal to see a film set in a familiar area of Phoenix. Is the screenwriter of “Car Dogs” from Arizona as well? Why did this story need to be told here?\n\nAdam Collis: This is a movie that is handcrafted for Phoenix, Arizona. And the culmination of this story is that the people of Phoenix get to decide whether this is a movie that gets to have a national release. Here you have this script set in Scottsdale, written by a Scottsdale native, shot in Scottsdale, made with 85 ASU student interns — a film that’s going to be exhibited in Phoenix’s own Harkins Theaters across the valley. What we’ve done that’s really special is designed our release with Phoenix as the launch pad. We’re all going to gather around opening weekend to see if this rocket that we’ve built is going to actually take flight so that people across the country will see it. If, of course, the good people of Phoenix come out and watch this really entertaining movie that was basically made for them! We shot right under the Papago Buttes! This has got Arizona in it through and through.\n\nRB: I remember the notice that “Car Dogs” was looking for interns going out when I was a freshman film student at ASU four years ago. What was it like to see these students grow on set?\n\nAC: Gosh, they were like the Three Stooges at the beginning: just bumping into each other, hardly knowing what to do. By the end of it, you wouldn’t know that these student interns were student interns! I’ve had so much feedback from the cast and crew, from people that visited set — they really got to learn how to be a professional on a film set from these working Hollywood professionals.\n\nRB: That’s awesome.\n\nAC: And now they’ve taken that into their own professional lives. Not just what they learned, but they also have their first feature film credit: that’s always the hardest one to get because breaking in is the hardest thing to do. And in addition to that, because they got to work with this Oscar-winning cast and crew, they’ve got somebody to call when they go to Hollywood — or, if Hollywood filmmakers come to Phoenix! It’s a launch pad for those careers, and we’ve got to launch this movie out of Phoenix, man. That’s the big story here. What’s really at stake here is that Phoenix has the chance to not launch the national release of a major motion picture. If it does well in Phoenix, man: [explosion noise].\n\nRB: It expands to other theaters.\n\nAC: And that’s why as part of ASU — the most innovative school in the nation, above MIT and Stanford — this is as good of an example of ASU innovation as you will get. This is no different in the creative arts than the innovation that the School of Earth and Space Exploration is doing to launch satellites around the moon! They’re launching a satellite around the moon; we’re launching a rocket for independent film so that everyone in this nation can see that rocket up in the sky. That requires everybody supporting the effort: the good news is they’re not doing charity work; they get to come watch a really fun movie about their hometown!\n\nRB: Yeah. So, since you’re helping ASU students pursue the film world: why do you think it’s important that Arizonans pursue artistic endeavors?\n\nAC: You know, some things you just do because they’re right. It kills me that Arizona is not Hollywood’s backlot.\n\nRB: Me too!\n\nAC: That’s what I always say: Arizona should be Hollywood’s backlot. And you can attribute that quote to me!\n\nRB: [Laughs]\n\nAC: We’re an hour Southwest flight away from Hollywood! Hollywood’s money is Arizona’s to lose! You think a producer would rather go all the way to Atlanta and be half a country away from their family and friends in Los Angeles? No, man! If they were shooting their TV or film project in Arizona, they could skip back that night to tuck their kids into bed. This is too good of an opportunity for the Arizona economy, and for filmmakers because there’s so much creative opportunity in this state.\n\nRB: Makes sense to me. One of the actresses in “Car Dogs” is Octavia Spencer, who was just nominated for her second Oscar. What was it like for the interns to work with such a successful actress?\n\nAC: The scene that she’s in is the pivotal scene of the movie. It’s worth going to see this movie just to watch that scene alone. She was grace personified. She was incredibly generous to our students with her time and spirit; she was wildly enthusiastic about what we were doing with the students. She gave our film a gravitas that I will forever be grateful to her for. You can just point the camera at Octavia Spencer and she could read the alphabet, and you could not take your eyes off of her!\n\nRB: [Laughs] Lastly: March 24th is the release date of “Car Dogs”. Is there anything else in the future that Arizonans should be on the lookout for?\n\nAC: If the good people of Phoenix can light a rocket on March 24th, you’re going to see all kinds of movies being made in Arizona."}, {"url": "https://cocofinder.com/name/adam-collis", "page_content": "Disclaimer: CocoFinder's mission is to give people easy and affordable access to public record information, but CocoFinder does not provide private investigator services or consumer reports, and is not a consumer reporting agency per the Fair Credit Reporting Act. You may not use our site or service or the information provided to make decisions about employment, admission, consumer credit, insurance, tenant screening or any other purpose that would require FCRA compliance. For more information governing permitted and prohibited uses, please review our \"Do's & Don'ts\" and Terms & Conditions.\n\nOur site includes links to third-party websites or services we partner with. If you make a purchase through these links, we will receive payment of commissions, referral fees, or rewards at no extra cost to you.\n\nCopyright © 2023 CocoFinder. All trademarks are the property of their respective owners."}, {"url": "https://www.instantcheckmate.com/people/adam-collis/", "page_content": "public records summary\n\nAdam Collis\n\nAdam Collis’s full report may contain information on how to contact them such as phone numbers, addresses, and email addresses.\n\nThe personal information that is included in the full report could contain schools that they attended, degrees earned, and possible dates they attended the institutions.\n\nSocial Media profile section may have links to their Facebook, Twitter, LinkedIn, and dating app profiles.\n\nThe Finances section of the report may have a history of bankruptcies, liens, judgments, evictions, and UCC filings entered against Adam.\n\nIf you suspect Adam Collis has a criminal record, you could find more information in the Criminal Records section of the report.\n\nThe report may contain details on possible charges/offenses, the date the charges were filed, the court system used (civil or criminal), and where Adam may have been charged and convicted."}, {"url": "https://thegoodagent.ca/meet-the-good-agent-team/", "page_content": "I was raised in a “Real Estate Family”. My father was a Realtor in Calgary for almost 10 years before moving to Vancouver where he is currently a licensed agent. After only 6 months in the Real Estate industry, my mom had to quit her day job to become my dad’s full time Assistant. I consider myself a Calgarian having lived here since 1989. Before moving to Calgary, we immigrated to Brandon Manitoba.\n\nI didn’t know it then, but my training actually started in high school. Over dinner my parents would discuss real estate stories and news excessively. My dad had the most amazing stories, some I still tell my clients today. My meticulous father is one of the most competent, dutiful and loyal Agents I’ve ever worked with. He truly put his clients first in business. I’m proud to have him as my first mentor stepping into this industry.\n\nAlthough I officially launched my Real Estate career in 2005, I would say the seed of my passion for Real Estate was planted when I purchased my home in 2001. I was 21. Like most buyers, I made extensive sacrifices to buy my first home, including selling my first beloved motorcycle, and working 3 jobs simultaneously for a full year to save up. I couldn’t sleep the night before my possession. I was giddy and excited, overdosed on Better Homes & Garden magazines (Pinterest did not exist in 2001). When my Agent/dad handed me the keys to my first house, the exhilaration I felt is a high a chase through my clients until this very day. When I hand my clients their keys for the first time, I feel the same giddiness and excitement for them. Every hurdle my clients have crossed to buy a home, all the hours spent scrutinizing properties with me by their side, all their dreams come into fruition in this very moment. Whether is a purchase or sale, it’s a big deal. I take my job with all of it’s giddiness seriously.\n\nPrior to obtaining my license to be Realtor, I was a bilingual assistant (ESL), server & bartender, entrepreneur with phone books (if you meet me, ask me about this hilarious 3 year period of my life), and a 3rd year university drop out – computer science major. I finally had to accept that hours in a lab working on assignments and programming was not me. I craved interaction and found I enjoyed my shifts at Red Lobster more than heading to lectures at the University. Oh and in 2012 I took most of that year off of full time Real Estate. I went back to College. This time Fairview College for my motorcycle mechanics certificate. After I finished, I was employed to work on motorcycles as a junior mechanic 4 days a week while working part time as a Real Estate Agent around those hours. I learned a lot from that experience but mostly my appreciation for my Real Estate career was solidified by the end of 2012.\n\nAt the end of 2012 I joined a mega team. Although I benefited from the success of consistently being one of the top producers on that team, and achieving multiple awards, I was missing something. Remember, I value interaction. Being that busy and closing that many deals in a year, the quality of relationship I had with my clients was not to my satisfaction. There’s a difference between service and relationship. You can have the best of both with the right Agent.\n\nAs of January 1st 2017, I’m a proud Realtor and Managing Partner of The Good Agent Inc. We are well aware of all the reasons people shy aware from Realtors – we are here to change that!\n\nIn June of 2017, from the help of my wonderful new found work/life balance I was able to achieve, I got married and started a family all at once. I now have one more skill to add to my list of Real Estate Agent skills – being able to see a home through practical mom eyes. Life is good!"}]}