{"Alan Dinehart started his career on the stage.": [{"url": "https://www.broadwayworld.com/people/Alan-Dinehart/", "page_content": "Recommended For You\n\nGet Broadway's #1 Newsletter\n\nGet the best news & discounts for Broadway Shows & beyond."}, {"url": "https://www.broadwayworld.com/people/Allan-Dinehart/", "page_content": "Recommended For You\n\nGet Broadway's #1 Newsletter\n\nGet the best news & discounts for Broadway Shows & beyond."}, {"url": "https://www.broadwayworld.com/people/Allan--Dinehart/", "page_content": "Recommended For You\n\nGet Broadway's #1 Newsletter\n\nGet the best news & discounts for Broadway Shows & beyond."}, {"url": "https://immortalephemera.com/23741/1003-alan-dinehart/", "page_content": "Everything Immortal for October 3 ...\n\nBorn on this date ...\n\nWe have a handful of October 3rd birthdays to celebrate. A few are better known than the star I've chosen to focus on today, though none were nearly as active during such a short span as my pick, Alan Dinehart, was in 1930s and early '40s Hollywood.\n\nMore following the image of Alan Dinehart, born 1889-ish.\n\nIf you put a star by one of my top picks for October, Dante's Inferno (1935), and caught it on TCM earlier this week then you saw Alan Dinehart as Spencer Tracy's right hand man Jonesy. Another recent sighting was in The Whistler (1944) a few weeks back. Dinehart was seen offering advice to J. Carrol Naish in that first film of the Columbia series starring Richard Dix.\n\nAlan Dinehart was very active on Broadway from 1918 onwards and originally arrived in Hollywood as a leading man in 1931. But Dinehart was better suited for character roles and that is how we best remember him today. Dinehart typically played villains, or at the very least his characters were not completely on the level. I like him best for his brash businessmen, though I'd never want to sign a contract with one of his characters!\n\nAlan Dinehart was born in St. Paul, Minnesota, October 3, 1889. Maybe. No doubt about St. Paul, but every time new paperwork was filled out the rest gets called into question. His given first name was definitely Harold with the middle name of either Alan or Allen. In 1936 Alan Dinehart legally changed his name to that of his father, Mason Alan Dinehart, so that his youngest son could legally be known as Alan Dinehart III. I'd imagine that move didn't sit too well with his son by a previous marriage, Alan Dinehart, Jr.\n\nWhile the date on our Alan Dinehart's birth registration is given as October 5, later paper work, including his World War II draft registration card , give the date as October 3. The year Dinehart was born seems generally accepted as 1889, but it should be noted that on both his birth and draft registrations it is given as 1888, and in Dinehart's own hand on the latter. Dinehart's 1944 obituaries claimed he was 48, but Alan seemed flexible about his date of birth, even claiming he was just 40 on the 1930 census ... and he remained 40 on the 1940 census\n\nSome time after his birth Alan's father disappears (dies?) and the young man moved to Montana with his mother, Elizabeth, and stepfather, Louis Brasch. There he attended Butte High School where he had his first taste of acting.\n\nIn 1907 he married a Joe Trickey in Miles City, Montana, though I do not know what happened to this first Mrs. Dinehart. One way or another Alan left her behind when he took the cattle train to New York and embarked upon his acting career. He's said to have appeared in Applesauce in Chicago in 1910 and made his way to Broadway by 1918. In between he married a second time, to actress Marie Louise Dyer, with whom he'd have son Alan Dinehart, Jr. in 1918. It wasn't until after arriving in Hollywood that Dinehart would marry the woman he'd spend the rest of his life with, actress Mozelle Britton, in 1933.\n\nAlong with Alan's name change in 1936 came son Mason Alan Dinehart III, who would claim Irving S. Cobb as his godfather. In early 1939 Mozelle was involved in a terrible car accident, but she recovered and even played alongside Alan in a radio drama shortly before his death. Alan died in 1944; Mozelle in 1953. She was just 41. I'll leave it to you to decide how old Alan Dinehart was, I'll go with the flow and say 54.\n\nOne of Alan Dinehart's greatest triumphs came later in his career, off the screen and on the Broadway stage. His play Separate Rooms, which he wrote, directed and starred in along with Lyle Talbot and Glenda Farrell, was a Broadway hit playing over 600 times during 1940-41. That was after overcoming the lousy reviews which greeted it, no small feat.\n\nOther films you may have seen Alan Dinehart in include Lawyer Man (1932), where he's William Powell's uptown partner; as Cagney's competition in Jimmy the Gent (1934); and as Virginia Bruce's press agent in Born to Dance (1936) starring Eleanor Powell and James Stewart.\n\nYou've surely seen him in a number of other films as well: According to the IMDb, Alan Dinehart managed a total of 89 credited roles during his active Hollywood career from 1931 until his 1944 death. Mid-1930's newspaper reports noted that he typically worked in 15 films per year.\n\nBesides Lawyer Man, other movies featuring Alan Dinehart that I have previously written about on this site as The Payoff (1935) and The World Changes (1933).\n\nAlso\n\n... born on October 3 ... they're each better remembered for other projects, but I have to point to my Werewolf of London (1935) article in mentioning that co-stars Henry Hull and Warner Oland each celebrated their birthday on October 3.\n\nOland, best known for his portrayals of Charlie Chan, was the elder, born iN Sweden, 1879. While Hull, best recalled for Alfred Hitchcock's Lifeboat (1944), was Kentucky born in 1890.\n\nAlso born on October 3 were legend of the stage Eleanora Duse in 1858; character actor Charles Middleton in 1874; author of so many great stories turned into Depression era films, Damon Runyon, in 1880; director Leo McCarey, of so many favorite comedies, in 1896; and silent starlet Josephine Hill in 1899.\n\nTCM Pick\n\nYou can chop up today's TCM programming into four parts and all of them have something to recommend about them!\n\nThe day begins with five films starring character man James Gleason including the first Hildegarde Withers mystery, Penguin Pool Murder (1932) starring Edna May Oliver at 7:45 am. Next are three films directed by Leo McCarey, mentioned in the birthday section immediately above, beginning with Love Affair (1939) at 2 pm EST.\n\nThe first of TCM's Classic Horror marathons begins at 8 with The Mystery of the Wax Museum (1933), the first of four chillers featuring Lionel Atwill. That's followed by Doctor X (1932) at 9:30; Mark of the Vampire (1935) at 11:00 pm; and House of Dracula (1945) at 12:15 am.\n\nThe overnight is populated by zombies with George A. Romero's Night of the Living Dead (1968) airing at 2:45 am and the Val Lewton produced I Walked With a Zombie (1943) from Jacques Tourneur following at 4:30 am.\n\nTo pick just one? Well, if you've never seen any of these I'd feel you out some before insisting upon Night of the Living Dead, but since that one falls outside of the general timeline of this website I'd instead suggest Mark of the Vampire (1935), which besides Atwill also features Lionel Barrymore and Bela Lugosi.\n\nSales Notes\n\nI must really love the 1940 A and M Wix Cinema Cavalcade tobacco card sets because I'm constantly using examples from either the first or second volume to illustrate my posts!\n\nI've recently listed some higher grade examples, averaging about EX-MT or 7/10, to eBay in the Fixed Price/Buy it Now format. There are three different sized cards in these sets and so far I've listed all of the large and medium cards that I have on hand. The small ones are scanned and ready to be listed any day now.\n\nYou can find all of my Cinema Cavalcade cards on eBay HERE , including several from the tougher Volume 2 set that I listed soon before these Volume 1 beauties. (High grade only, EX-MT or better, HERE )\n\nAs an example we'll go with a favorite pose, that's also currently in stock, picturing Fredric March, Miriam Hopkins and Gary Cooper in Design for Living (1933), which I recently discovered will be airing on TCM this coming December 13 (right after Trouble in Paradise, fellow Hopkins and/or Lubitsch fans!). This is one of the large sized cards in the Cinema Cavalcade set:\n\nThat's About All ...\n\nSources for the Alan Dinehart piece at the top of the page follow below.\n\nHave a wonderful day!\n\nCliff\n\nSources\n\n\"Alan Dinehart of Stage, Film Dies.\" Oakland Tribune 18 Jul 1944: 10. NewspaperArchive. Web. 3 Oct 2012.\n\n18 Jul 1944: 10. NewspaperArchive. Web. 3 Oct 2012. \"Gets Legal Name.\" Jefferson City Post Tribune 3 Aug 1936: 3. NewspaperArchive. Web. 3 Oct 2012.\n\n3 Aug 1936: 3. NewspaperArchive. Web. 3 Oct 2012. \"Villain and General All Around Bad Man of Screen a Butte Boy Who Made Good.\" Montana Standard 9 feb 1936: 26. NewspaperArchive. Web. 3 Oct 2012.\n\nNote: All genealogical references were gathered through FamilySearch and are directly linked to in the Dinehart biography above.\n\nLike this: Like Loading..."}, {"url": "https://www.peliplat.com/en/library/celeb/pc12638884", "page_content": "Biography\n\nTall, heavy-set character actor Alan Dinehart dropped out of school to join a repertory company. He had extensive stage experience (including some 27 appearances on Broadway) and, by the time he was signed by Fox in 1931, he had worked not only as an actor but as a stage manager and writer. On screen he appeared for the most part in \"B\" pictures, notable exceptions being the MGM musical blockbuster Born to Dance (1936) and the 20th Century-Fox classic family drama Rebecca of Sunnybrook Farm (1938). Dinehart specialized in portraying blustering or shifty businessmen, crooked politicians or racketeers. While he is usually described as a supporting player, he actually started out in the early 1930s playing leading roles opposite some of the major female stars of the period. However, Dinehart's characters were rarely sympathetic. In Street of Women (1932) he essayed an architect who, bored with his society wife, indiscreetly keeps a mistress (Kay Francis) on the side. In Supernatural (193\n\nShow more\n\nShow less"}, {"url": "https://www.nytimes.com/1944/07/18/archives/alan-dinehart-48-film-stage-star-death-ends-his-career-of-30.html", "page_content": "Credit... The New York Times Archives\n\nJuly 18, 1944 , Page 19 Buy Reprints See the article in its original context fromJuly 18, 1944 , Page 19 View on timesmachine TimesMachine is an exclusive benefit for home delivery and digital subscribers.\n\nFull text is unavailable for this digitized archive article. Subscribers may view the full text of this article in its original form through TimesMachine."}, {"url": "https://www.wikiwand.com/en/Alan_Dinehart", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Alan Dinehart?\n\nSummarize this article for a 10 years old"}, {"url": "https://prabook.com/web/alan.dinehart/2554400", "page_content": "Alan Dinehart\n\nActor screenwriter\n\nOctober 3, 1889 (age 54) Saint Paul, Ramsey County, United States of America\n\nDinehart left school to appear on stage with a repertory company and had no screen experience when he signed a contract with Fox in May 1931. He became a character actor and supporting player in at least eighty-eight films between 1931 and 1944. Earlier, he appeared in more than twenty Broadway plays. Dinehart\"s likeness was drawn in caricature by Alex Gard for Sardi\"s, the New York City theater district restaurant. The picture is now part of the collection of the New York Public Library. Dinehart\"s first wife was the stage actress Louise Dyer (1895-1934), a native of Nassau County, New New York In 1933, Dinehart married the film actress Mozelle Britton (May 12, 1912 - May 18, 1953), a native of Oklahoma City, Oklahoma. They are entombed together at Forest Lawn Memorial Park in Glendale, California. Dinehart had two sons: from the first marriage, Alan Dinehart, Junior. (1918-1992), and from the second marriage, Mason Alan Dinehart, aka Alan Dinehart, III, born in Los Angeles in 1936. Mason Alan Dinehart was cast in several 1950s television series, including the role of a young Bat Masterson in the American Broadcasting Company/Desilu Studios western, The Life and Legend of Wyatt Earp, starring Hugh O\"Brian in the title role."}, {"url": "https://www.amazon.com/prime-video/actor/Alan-Dinehart/amzn1.dv.gti.2d3e8a0f-6ea3-411a-ae7e-682eff0481e8/", "page_content": "Alan Dinehart\n\nTall, heavy-set character actor Alan Dinehart dropped out of school to join a repertory company. He had extensive stage experience (including some 27 appearances on Broadway) and, by the time he was signed by Fox in 1931, he had worked not only as an actor but as a stage manager and writer. On screen he appeared for the most part in \"B\" pictures, notable exceptions being the MGM musical blockbuster Born to Dance (1936) and the 20th Century-Fox classic family drama Rebecca of Sunnybrook Farm (1938). Dinehart specialized in portraying blustering or shifty businessmen, crooked politicians or racketeers. While he is usually described as a supporting player, he actually started out in the early 1930s playing leading roles opposite some of the major female stars of the period.\n\nHowever, Dinehart's characters were rarely sympathetic. In Street of Women (1932) he essayed an architect who, bored with his society wife, indiscreetly keeps a mistress (Kay Francis) on the side. In Supernatural (1933) he was true to form as the phony spiritualist fleecing a wealthy socialite, played by Carole Lombard; and in Jimmy the Gent (1934) he was an urbane con artist in competition with James Cagney. On rarer occasions Alan found gainful employment as more benevolent characters, point in case his theatrical impressario Theodore von Eltz in Dance, Girl, Dance (1933). All of these performances attracted good reviews from Mordaunt Hall of the New York Times, ranging from \"excellent\" to \"bearing up valiantly\".\n\nIn unlikely contrast to his self-styled image of \"Hollywood's most versatile villain\", Dinehart had strong comedic inclinations, co-authoring several comedy plays towards the later stages of his career. The last and most successful of these, \"Separate Rooms\" (1940-1941), with Dinehart top-billed alongside Glenda Farrell and Lyle Talbot, became one of the longest-running non-musical plays on Broadway at the time, finally closing after 613 performances. Alan's son, Mason Alan Dinehart, followed in his father's footsteps and also became an actor, featured in several westerns and on television from the late 1940's."}, {"url": "https://dbpedia.org/page/Alan_Dinehart", "page_content": "آلان دينهارت (بالإنجليزية: Alan Dinehart)‏ مواليد 3 أكتوبر 1889 في سانت بول، الولايات المتحدة - الوفاة 18 يوليو 1944 في هوليوود، الولايات المتحدة، هو ممثل أمريكي بدأ مسيرته الفنية سنة 1931. من أعماله . (ar)\n\nMason Alan Dinehart Sr. (born Harold Alan Dinehart; October 3, 1889 – July 18, 1944) was an American actor, director, writer, and stage manager. (en)\n\nAlan Dinehart (* 3. Oktober 1889 in Saint Paul, Minnesota als Harold Alan Dinehart; † 18. Juli 1944 in Hollywood, Kalifornien) war ein US-amerikanischer Schauspieler und Autor. (de)\n\nAlan Dinehart (3 de octubre de 1889 – 17 de julio de 1944)​ fue un actor, director teatral y dramaturgo de nacionalidad estadounidense. (es)\n\nAlan Dinehart (parfois crédité Allan Dinehart) est un acteur, dramaturge et metteur en scène américain, de son nom complet Alan Mason Dinehart, né le 3 octobre 1889 à Saint Paul (Minnesota), mort le 17 juillet 1944 à Los Angeles — Quartier d'Hollywood (Californie). (fr)\n\nAlan Mason Dinehart, Sr. (3 Oktober 1889 – 17 Juli 1944) adalah aktor, sutradara, penulis skenario film dan teater berkebangsaan Amerika Serikat. Dia juga dikenal sebagai manajer pertunjukan. (in)"}], "Alan Dinehart was born in New York City": [{"url": "https://www.wikiwand.com/en/Alan_Dinehart", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Alan Dinehart?\n\nSummarize this article for a 10 years old"}, {"url": "https://immortalephemera.com/23741/1003-alan-dinehart/", "page_content": "Everything Immortal for October 3 ...\n\nBorn on this date ...\n\nWe have a handful of October 3rd birthdays to celebrate. A few are better known than the star I've chosen to focus on today, though none were nearly as active during such a short span as my pick, Alan Dinehart, was in 1930s and early '40s Hollywood.\n\nMore following the image of Alan Dinehart, born 1889-ish.\n\nIf you put a star by one of my top picks for October, Dante's Inferno (1935), and caught it on TCM earlier this week then you saw Alan Dinehart as Spencer Tracy's right hand man Jonesy. Another recent sighting was in The Whistler (1944) a few weeks back. Dinehart was seen offering advice to J. Carrol Naish in that first film of the Columbia series starring Richard Dix.\n\nAlan Dinehart was very active on Broadway from 1918 onwards and originally arrived in Hollywood as a leading man in 1931. But Dinehart was better suited for character roles and that is how we best remember him today. Dinehart typically played villains, or at the very least his characters were not completely on the level. I like him best for his brash businessmen, though I'd never want to sign a contract with one of his characters!\n\nAlan Dinehart was born in St. Paul, Minnesota, October 3, 1889. Maybe. No doubt about St. Paul, but every time new paperwork was filled out the rest gets called into question. His given first name was definitely Harold with the middle name of either Alan or Allen. In 1936 Alan Dinehart legally changed his name to that of his father, Mason Alan Dinehart, so that his youngest son could legally be known as Alan Dinehart III. I'd imagine that move didn't sit too well with his son by a previous marriage, Alan Dinehart, Jr.\n\nWhile the date on our Alan Dinehart's birth registration is given as October 5, later paper work, including his World War II draft registration card , give the date as October 3. The year Dinehart was born seems generally accepted as 1889, but it should be noted that on both his birth and draft registrations it is given as 1888, and in Dinehart's own hand on the latter. Dinehart's 1944 obituaries claimed he was 48, but Alan seemed flexible about his date of birth, even claiming he was just 40 on the 1930 census ... and he remained 40 on the 1940 census\n\nSome time after his birth Alan's father disappears (dies?) and the young man moved to Montana with his mother, Elizabeth, and stepfather, Louis Brasch. There he attended Butte High School where he had his first taste of acting.\n\nIn 1907 he married a Joe Trickey in Miles City, Montana, though I do not know what happened to this first Mrs. Dinehart. One way or another Alan left her behind when he took the cattle train to New York and embarked upon his acting career. He's said to have appeared in Applesauce in Chicago in 1910 and made his way to Broadway by 1918. In between he married a second time, to actress Marie Louise Dyer, with whom he'd have son Alan Dinehart, Jr. in 1918. It wasn't until after arriving in Hollywood that Dinehart would marry the woman he'd spend the rest of his life with, actress Mozelle Britton, in 1933.\n\nAlong with Alan's name change in 1936 came son Mason Alan Dinehart III, who would claim Irving S. Cobb as his godfather. In early 1939 Mozelle was involved in a terrible car accident, but she recovered and even played alongside Alan in a radio drama shortly before his death. Alan died in 1944; Mozelle in 1953. She was just 41. I'll leave it to you to decide how old Alan Dinehart was, I'll go with the flow and say 54.\n\nOne of Alan Dinehart's greatest triumphs came later in his career, off the screen and on the Broadway stage. His play Separate Rooms, which he wrote, directed and starred in along with Lyle Talbot and Glenda Farrell, was a Broadway hit playing over 600 times during 1940-41. That was after overcoming the lousy reviews which greeted it, no small feat.\n\nOther films you may have seen Alan Dinehart in include Lawyer Man (1932), where he's William Powell's uptown partner; as Cagney's competition in Jimmy the Gent (1934); and as Virginia Bruce's press agent in Born to Dance (1936) starring Eleanor Powell and James Stewart.\n\nYou've surely seen him in a number of other films as well: According to the IMDb, Alan Dinehart managed a total of 89 credited roles during his active Hollywood career from 1931 until his 1944 death. Mid-1930's newspaper reports noted that he typically worked in 15 films per year.\n\nBesides Lawyer Man, other movies featuring Alan Dinehart that I have previously written about on this site as The Payoff (1935) and The World Changes (1933).\n\nAlso\n\n... born on October 3 ... they're each better remembered for other projects, but I have to point to my Werewolf of London (1935) article in mentioning that co-stars Henry Hull and Warner Oland each celebrated their birthday on October 3.\n\nOland, best known for his portrayals of Charlie Chan, was the elder, born iN Sweden, 1879. While Hull, best recalled for Alfred Hitchcock's Lifeboat (1944), was Kentucky born in 1890.\n\nAlso born on October 3 were legend of the stage Eleanora Duse in 1858; character actor Charles Middleton in 1874; author of so many great stories turned into Depression era films, Damon Runyon, in 1880; director Leo McCarey, of so many favorite comedies, in 1896; and silent starlet Josephine Hill in 1899.\n\nTCM Pick\n\nYou can chop up today's TCM programming into four parts and all of them have something to recommend about them!\n\nThe day begins with five films starring character man James Gleason including the first Hildegarde Withers mystery, Penguin Pool Murder (1932) starring Edna May Oliver at 7:45 am. Next are three films directed by Leo McCarey, mentioned in the birthday section immediately above, beginning with Love Affair (1939) at 2 pm EST.\n\nThe first of TCM's Classic Horror marathons begins at 8 with The Mystery of the Wax Museum (1933), the first of four chillers featuring Lionel Atwill. That's followed by Doctor X (1932) at 9:30; Mark of the Vampire (1935) at 11:00 pm; and House of Dracula (1945) at 12:15 am.\n\nThe overnight is populated by zombies with George A. Romero's Night of the Living Dead (1968) airing at 2:45 am and the Val Lewton produced I Walked With a Zombie (1943) from Jacques Tourneur following at 4:30 am.\n\nTo pick just one? Well, if you've never seen any of these I'd feel you out some before insisting upon Night of the Living Dead, but since that one falls outside of the general timeline of this website I'd instead suggest Mark of the Vampire (1935), which besides Atwill also features Lionel Barrymore and Bela Lugosi.\n\nSales Notes\n\nI must really love the 1940 A and M Wix Cinema Cavalcade tobacco card sets because I'm constantly using examples from either the first or second volume to illustrate my posts!\n\nI've recently listed some higher grade examples, averaging about EX-MT or 7/10, to eBay in the Fixed Price/Buy it Now format. There are three different sized cards in these sets and so far I've listed all of the large and medium cards that I have on hand. The small ones are scanned and ready to be listed any day now.\n\nYou can find all of my Cinema Cavalcade cards on eBay HERE , including several from the tougher Volume 2 set that I listed soon before these Volume 1 beauties. (High grade only, EX-MT or better, HERE )\n\nAs an example we'll go with a favorite pose, that's also currently in stock, picturing Fredric March, Miriam Hopkins and Gary Cooper in Design for Living (1933), which I recently discovered will be airing on TCM this coming December 13 (right after Trouble in Paradise, fellow Hopkins and/or Lubitsch fans!). This is one of the large sized cards in the Cinema Cavalcade set:\n\nThat's About All ...\n\nSources for the Alan Dinehart piece at the top of the page follow below.\n\nHave a wonderful day!\n\nCliff\n\nSources\n\n\"Alan Dinehart of Stage, Film Dies.\" Oakland Tribune 18 Jul 1944: 10. NewspaperArchive. Web. 3 Oct 2012.\n\n18 Jul 1944: 10. NewspaperArchive. Web. 3 Oct 2012. \"Gets Legal Name.\" Jefferson City Post Tribune 3 Aug 1936: 3. NewspaperArchive. Web. 3 Oct 2012.\n\n3 Aug 1936: 3. NewspaperArchive. Web. 3 Oct 2012. \"Villain and General All Around Bad Man of Screen a Butte Boy Who Made Good.\" Montana Standard 9 feb 1936: 26. NewspaperArchive. Web. 3 Oct 2012.\n\nNote: All genealogical references were gathered through FamilySearch and are directly linked to in the Dinehart biography above.\n\nLike this: Like Loading..."}, {"url": "https://prabook.com/web/alan.dinehart/2554400", "page_content": "Alan Dinehart\n\nActor screenwriter\n\nOctober 3, 1889 (age 54) Saint Paul, Ramsey County, United States of America\n\nDinehart left school to appear on stage with a repertory company and had no screen experience when he signed a contract with Fox in May 1931. He became a character actor and supporting player in at least eighty-eight films between 1931 and 1944. Earlier, he appeared in more than twenty Broadway plays. Dinehart\"s likeness was drawn in caricature by Alex Gard for Sardi\"s, the New York City theater district restaurant. The picture is now part of the collection of the New York Public Library. Dinehart\"s first wife was the stage actress Louise Dyer (1895-1934), a native of Nassau County, New New York In 1933, Dinehart married the film actress Mozelle Britton (May 12, 1912 - May 18, 1953), a native of Oklahoma City, Oklahoma. They are entombed together at Forest Lawn Memorial Park in Glendale, California. Dinehart had two sons: from the first marriage, Alan Dinehart, Junior. (1918-1992), and from the second marriage, Mason Alan Dinehart, aka Alan Dinehart, III, born in Los Angeles in 1936. Mason Alan Dinehart was cast in several 1950s television series, including the role of a young Bat Masterson in the American Broadcasting Company/Desilu Studios western, The Life and Legend of Wyatt Earp, starring Hugh O\"Brian in the title role."}, {"url": "https://www.broadwayworld.com/people/Alan-Dinehart/", "page_content": "Recommended For You\n\nGet Broadway's #1 Newsletter\n\nGet the best news & discounts for Broadway Shows & beyond."}, {"url": "https://www.celebsagewiki.com/alan-dinehart", "page_content": "Age, Biography and Wiki\n\nAlan Dinehart (Alan Frederick Dinehart Jr.) was born on 12 March, 1918 in Minneapolis, Minnesota, USA, is an Actor, Miscellaneous, Producer. Discover Alan Dinehart's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of Alan Dinehart networth?\n\nPopular As Alan Frederick Dinehart Jr. Occupation actor,miscellaneous,producer Age 74 years old Zodiac Sign Pisces Born 12 March 1918 Birthday 12 March Birthplace Minneapolis, Minnesota, USA Date of death 14 March, 1992 Died Place Los Angeles, California, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 12 March. He is a member of famous Actor with the age 74 years old group.\n\nAlan Dinehart Height, Weight & Measurements\n\nAt 74 years old, Alan Dinehart height not available right now. We will update Alan Dinehart's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Alan Dinehart's Wife?\n\nHis wife is Collette Lyons (26 December 1942 - 1950) ( annulled)\n\nFamily Parents Not Available Wife Collette Lyons (26 December 1942 - 1950) ( annulled) Sibling Not Available Children Not Available\n\nAlan Dinehart Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Alan Dinehart worth at the age of 74 years old? Alan Dinehart’s income source is mostly from being a successful Actor. He is from USA. We have estimated Alan Dinehart's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nAlan Dinehart Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://celebritymanual.com/82912/", "page_content": "Alan Dinehart is a very famous star. He was born in St. Paul, Minnesota, USA. He is 133 years old(Libra), Alan Dinehart’s name was Harold Alan Dinehart when he was a child. Alan Dinehart’s profession is: Actor、Additional Crew. He has many lovers. their names are: Mozelle Britton (1933- 17 July 1944) (his death) (2 children)、Louise Dyer Dinehart(1912- 1932) (divorced) (1 child). Alan Dinehart first acted in a movie The Brat. Here, let’s get to know the basic information about Alan Dinehart!\n\nAlan Dinehart Personal Details\n\nName Alan Dinehart Nickname Not Known BirthName Harold Alan Dinehart Profession Actor、Additional Crew Height Not Known Born October 3,1889in St. Paul, Minnesota, USA Born Address St. Paul, Minnesota, USA Died July 17,1944in Hollywood, California, USA (heart attack) Spouse Mozelle Britton (1933- 17 July 1944) (his death) (2 children)、Louise Dyer Dinehart(1912- 1932) (divorced) (1 child) Children Not Known Relatives Not Known Parents Not Known Star Sign Libra\n\nAlan Dinehart Biography\n\nAlan Dinehart, a big, burly character actor, dropped out of school to join a repertoire company. He had extensive stage experience (including some 27 Broadway appearances) and by the time he was signed by Fox in 1931 he had worked not only as an actor but also as a stage manager and writer. . On screen, he appeared mostly in “B” pictures, notable exceptions being the MGM musical blockbuster Born to Dance (1936) and the classic 20th Century-Fox family drama Rebecca of Sunnybrook Farm (1938) . Dinehart specialized in portraying swaggering or devious businessmen, crooked politicians or racketeers. While he’s usually portrayed as a supporting player, he actually started out in the early 1930s playing lead roles opposite some of the leading female stars of the time.\n\nContrary to his self-proclaimed image as “Hollywood’s most versatile villain”, Dinehart had strong comedic inclinations, co-writing several comedy plays towards the later stages of his career. The last and most successful of these, “Separate Rooms” (1940-1941), with Dinehart headlining alongside Glenda Farrell and Lyle Talbot, became one of the longest-running non-musical pieces by Broadway at the time, eventually closing after 613 performances. Alan’s son, Mason Alan Dinehart, followed in his father’s footsteps and also became an actor, featured in several westerns and on television beginning in the late 1940s.\n\nHowever, Dinehart’s characters were rarely likable. In Street of Women (1932), he tried an architect who, weary of his socialite wife, indiscreetly keeps a mistress (Kay Francis) next door. In Supernatural (1933), he was true to train the bogus spiritualist swindling a wealthy socialite, played by Carole Lombard; and in Jimmy the Gent (1934) he was an urban trickster competing with James Cagney. On rarer occasions, Alan found gainful employment as more benevolent characters, in case his theatrical impresario Theodore von Eltz in Dance, Girl, Dance (1933). All of these performances drew good reviews from The New York Times’ Mordaunt Hall, ranging from “excellent” to “endure valiantly”.\n\nAlan Dinehart Trivia\n\nFather of actor Alan Dinehart, father of Mason Alan Dinehart.\n\nAccording to the San Bernardino Sun of July 18, 1944, Dinehart died of complications from double pneumonia.\n\nHis voice sounded like William Holden’s.\n\nHollywood supporting player in many films until the mid-1940s.\n\nPerformed on Broadway from 1918 to 1941."}, {"url": "https://www.celebsagewiki.com/mason-alan-dinehart", "page_content": "Age, Biography and Wiki\n\nMason Alan Dinehart (Mason Alan Dinehart III) was born on 30 April, 1936 in Hollywood, California, USA, is an Actor. Discover Mason Alan Dinehart's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 85 years old?\n\nPopular As Mason Alan Dinehart III Occupation actor Age 87 years old Zodiac Sign Taurus Born 30 April 1936 Birthday 30 April Birthplace Hollywood, California, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 30 April. He is a member of famous Actor with the age 87 years old group.\n\nMason Alan Dinehart Height, Weight & Measurements\n\nAt 87 years old, Mason Alan Dinehart height not available right now. We will update Mason Alan Dinehart's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Mason Alan Dinehart's Wife?\n\nHis wife is Mirande Gazal (1982 - present) ( 4 children), Barbara Blakely (30 July 1959 - 1965) ( 2 children), Evelyn Myers (1954 - 1958) ( 2 children)\n\nFamily Parents Not Available Wife Mirande Gazal (1982 - present) ( 4 children), Barbara Blakely (30 July 1959 - 1965) ( 2 children), Evelyn Myers (1954 - 1958) ( 2 children) Sibling Not Available Children Not Available\n\nMason Alan Dinehart Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Mason Alan Dinehart worth at the age of 87 years old? Mason Alan Dinehart’s income source is mostly from being a successful Actor. He is from USA. We have estimated Mason Alan Dinehart's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nMason Alan Dinehart Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.wikiwand.com/en/Allan_Dinehart", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Allan Dinehart?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.celebsages.com/alan-dinehart/", "page_content": "Birth Name: Mason Alan Dinehart Occupation: Movie Actor Place Of Birth: Minnesota Date Of Birth: October 3, 1889 Date Of Death: July 17, 1944 Cause Of Death: N/A Ethnicity: White Nationality: American\n\nAlan Dinehart was born on the 3rd of October, 1889. He was known for being a Movie Actor. American Broadway and film actor who appeared in more than 20 Broadway plays and 85 pictures including noteworthy works such as Bureau of Missing Persons and Charlie Chan at the Race Track. Alan Dinehart was born in Minnesota. His first two feature film debuts came in 1931 when he appeared in The Brat and Girls About Town. He played the role of Bat Masterson in the western television series The Life and Legend of Wyatt Earp.\n\nAlan Dinehart was a Libra and was born in the G.I. Generation.\n\nJUMP TO: Alan Dinehart’s biography , facts , family , personal life , zodiac , videos and related celebs .\n\nChildhood\n\nAlan Dinehart was born in 1880s.\n\nMason Alan Dinehart is part of G.I. Generation also known as The Greatest Generation. This generation experienced much of their youth during the Great Depression and rapid technological innovation such as the radio and the telephone. The initials \"G.I.\" is military terminology referring to \"Government Issue\" or \"General Issue\".\n\nEducation\n\nAlan’s education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nAlan Dinehart’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Alan Dinehart’s parents.\n\nAssociated with\n\nPersonal Life\n\nLike many famous people and celebrities, Alan Dinehart kept his personal life private. Once more details are available, we will update this section.\n\nAlan Dinehart was born in the Year of the Ox.\n\nFast Facts\n\nREAL NAME: Mason Alan Dinehart NICKNAME: Alan\n\nRELIGION: Unknown AGE GENERATION: G.I. Generation BIRTH SIGN: Libra BIRTH DAY: Thursday DEATH DAY: Monday\n\nVideos\n\n\n\n\n\nHoroscope\n\nZodiac Sign: Alan Dinehart was a Libra. People of this zodiac sign like harmony, gentleness, sharing with others, the outdoors, and dislike violence, injustice, loudmouths, conformity. The strengths of this sign are being cooperative, diplomatic, gracious, fair-minded, social, while weaknesses can be indecisive, holding a grudge and self-pity. The greatest overall compatibility with Libra is Aries and Sagittarius.\n\nChinese Zodiac: Alan Dinehart was born in the Year of the Rabbit. People born under this sign are persistent and straightforward. They have a strong faith and can be seen as stubborn in their old ways.\n\n\n\n\n\nRuling Planet: Alan Dinehart had a ruling planet of Venus and has a ruling planet of Venus and by astrological associations Friday is ruled by Venus. Venus is the planet of love, harmony, money and possessions. Venus is graceful, charming, sensual and social. People who are born with Mars as the ruling planet have beauty, charm and sensuality.\n\nAlan Dinehart’s birth sign is Libra and he had a ruling planet of Venus.\n\nDon’t miss\n\nWho’s the richest Movie Actor in the world?\n\nWho are the richest people in the world?\n\nWhen is Alan Dinehart’s birthday?\n\nFans also viewed"}, {"url": "https://happyhappybirthday.net/en/age/alan-dinehart-person_yqxasle", "page_content": "Alan Dinehart\n\n(1889-1944)\n\nActor (1889-1944) – Alan Dinehart was born in Saint Paul (capital of the state of Minnesota, United States; county seat of Ramsey County, Minnesota) on October 3rd, 1889 and died in Hollywood (neighborhood in Los Angeles, California, United States) on July 17th, 1944 at the age of 54. Today Alan Dinehart would be 133 years old.\n\nAge how old was Alan Dinehart when he died? 54 Alan Dinehart died in 1944 at the age of 54.\n\nBiographical data\n\nAlan Dinehart\n\nBirthday When was Alan Dinehart born? Alan Dinehart was born on October 3rd, 1889.\n\nDeath When did Alan Dinehart die? Alan Dinehart died on July 17th, 1944 at the age of 54 in Hollywood (neighborhood in Los Angeles, California, United States). Today Alan Dinehart would be 133 years old.\n\nPlace of Birth Where was Alan Dinehart born? Saint Paul (capital of the state of Minnesota, United States; county seat of Ramsey County, Minnesota).\n\nDeath place Where did Alan Dinehart die? Hollywood (neighborhood in Los Angeles, California, United States).\n\n♎ ♎ Zodiac What is the zodiac sign of Alan Dinehart? Alan Dinehart was born in the zodiac sign Libra (The Scales)."}]}