{"Alan Dinehart transitioned to sound films in the early 1930s.": [{"url": "https://www.britannica.com/art/history-of-the-motion-picture/Postsynchronization", "page_content": "The technological development that most liberated the sound film, however, was the practice known variously as postsynchronization, rerecording, or dubbing, in which image and sound are printed on separate pieces of film so that they can be manipulated independently. Postsynchronization enabled filmmakers to edit images freely again. Because the overwhelming emphasis of the period from 1928 to 1931 had been on obtaining high-quality sound in production, however, the idea that the sound track could be modified after it was recorded took a while to catch on. Many motion-picture artists and technicians felt that sound should be reproduced in films exactly as it had originally been produced on the set; they believed that anything less than an absolute pairing of sound and image would confuse audiences.\n\nFor several years, both practice and ideology dictated that sound and image be recorded simultaneously, so that everything heard on the sound track would be seen on the screen and vice versa. A vocal minority of film artists nevertheless viewed this practice of synchronous, “naturalistic” sound recording as a threat to the cinema. In their 1928 manifesto “Sound and Image,” the Soviet directors Sergei Eisenstein, Vsevolod Pudovkin, and Grigory Aleksandrov denounced synchronous sound in favour of asynchronous, contrapuntal sound—sound that would counterpoint the images it accompanied to become another dynamic element in the montage process. Like the practical editing problem, the theoretical debate over the appropriate use of sound was eventually resolved by the practice of postsynchronization.\n\nPostsynchronization seems to have first been used by the American director King Vidor for a sequence in which the hero is chased through Arkansas swamplands in the all-Black musical Hallelujah (1929). Vidor shot the action on location without sound, using a freely moving camera. Later, in the studio, he added to the film a separately recorded sound track containing both naturalistic and impressionistic effects. In the following year Lewis Milestone’s All Quiet on the Western Front and G.W. Pabst’s Westfront 1918 both used postsynchronization for their battle scenes. Ernst Lubitsch used dubbing in his first American sound films, the dynamic musicals The Love Parade (1929) and Monte Carlo (1930), as did the French director René Clair in Sous les toits de Paris (Under the Roofs of Paris, 1930). In all these early instances, sound was recorded and rerecorded on a single track, although some American directors, including Milestone and the Russian-born Armenian Rouben Mamoulian (Applause, 1929; City Streets, 1931), had experimented with multiple microphone setups and overlapping dialogue as early as 1929. Generally, through 1932, either dialogue or music dominated the sound track unless they had been simultaneously recorded on the set. In 1933, however, technology was introduced that allowed filmmakers to mix separately recorded tracks for background music, sound effects, and synchronized dialogue at the dubbing stage. By the late 1930s, postsynchronization and multiple-channel mixing had become standard industry procedure."}, {"url": "https://blog.scienceandmediamuseum.org.uk/brief-history-of-sound-in-film/", "page_content": "How did we get from the era of silent films to the stereo surround sound of today’s cinemas? Ewan Grainger takes a whistle-stop tour of the history of sound in film.\n\nMany of us are familiar with the sight of pianists and even entire orchestras at film screenings of the ‘silent era’ (1894–1927) that look so alien when compared to cinema technology today. But how did sound in cinema evolve from the sometimes-peculiar era of silent films to what we know today? In this post we will take you on a whistle-stop tour of the story of sound in film.\n\nMuybridge and Edison\n\nWhen attending a lecture utilising Eadweard Muybridge’s Zoopraxiscope, Thomas Edison began pondering the idea of sound and film. You may be familiar with this Zoopraxiscope, a method of projection which allowed Muybridge and others to study complex and difficult to observe actions, like a horse running, fencing, dancing, or boxing.\n\nMuybridge’s experiments in moving images inspired Edison to consider marrying moving images with his existing phonogram sound technology. This technology, with its limited amplification of sound, provided more immersive audio experiences for a single viewer. But this was far from synchronisation as we know today.\n\nBy 1894, Edison—inspired by Muybridge’s early successes—had placed much faith in his Kinetoscope. This was a personal viewing device that used a series of pulleys and gears to pull longer strips of film before a viewing port. And, while you won’t likely see this on MTV, below is the only surviving footage of possibly the first-ever music video utilising a phonograph mechanism, allowing for the playback of sound in time with moving images.\n\n﻿\n\nThe Vitaphone\n\nLater patents, such as the Vitaphone used by Warner Bros., would enter into people’s lives in the 1920s. The Vitaphone system was produced alongside Bell Telephone Company and Western Electric to gain a monopoly over film and sound technology in America. Expensive equipping costs for both industry and cinemas saw an initial rejection of this next great leap. But when sound burst into cinemas with the likes of Don Juan in 1926 and The Jazz Singer in 1927, it became clear the technology was here to stay.\n\nHowever, even these bombshell productions were at times hemmed in by still having sound recorded onto a shellac disc that could only store five minutes at a time. This stifled the creative freedom of film-makers significantly; even technologically groundbreaking films like The Jazz Singer still contained many silent speech intertitles.\n\nSound on film\n\nEventually, derivatives from outside Edison’s grasp and inspired by the shortcomings of the Vitaphone system emerged. This came in many forms such as the Fox-owned Movietone (1927) and RCA’s Photophone (1927).\n\nAfter much corporate espionage, personal competition, and sabotage to rival the greatest spy novels, the two systems were agreed upon as a standard for all the major American film studios. Europe would standardise on Tobis-Klangfilm and Tri-Ergon systems. This finally saw the leap to sound synchronisation on the physical film reels itself, as seen in the rare example of preserved Photophone film strips shown above.\n\nThis technology allowed for fluidity in film once again. From here, more complex and epic films emerged, such as King Kong in 1933.\n\nThe 1940s–50s: The television threat and multi-track sound\n\nEarly combinations of sound and projection technology existed in the 1930s, and by the 1940s, the issue of capturing sound synchronised footage onto film had been widely solved. By the late 1940s, this technology was widespread to the point that production could exist around the country. An example is the Gaumont-Kalee GK21 35mm cinema projector pictured to the right: manufactured by the Leeds-based company A Kershaw and Sons Ltd, it is now on display in Pictureville Bar at the National Science and Media Museum.\n\nIn the same period, however, the threat of TV emerged, and audiences needed to be stunned into going to the cinema. In terms of sound technology, this meant surround sound would again throw standardisation into disarray as the widening of screen aspect ratios called for more epic audio. One of the most popular processes, Cinerama, utilised a complex system of seven audio channels.\n\nAs screen sizes increased, so too did the need for deeper soundscapes. However, with this came a strange throwback to the earliest cinemas, in which a small army of personnel was needed in the theatre itself. Projectionists, sound controllers and engineers of all calibres were needed to bring widescreen and surround sound to life.\n\nSo, audiences were treated to epics like The Wizard of Oz as early as 1939 and the first Star Wars film as late as 1977. However, in this period of expanding auditory spectacle, those behind the scenes scrambled for standardisation amid a spiralling technological web. This is where Ray Dolby enters the story.\n\nDolby and the future\n\nIn 1938, the ‘Academy curve’ offered a crude solution to the question of how to standardise sound technology in cinemas. This is a method of chopping off the highs and lows of soundwave frequencies so that almost any cinema could project sound alongside film consistently. For many countries still struggling to bring film to rural areas, this technology was a miracle, allowing audio immersion only dreamt of before. But Ray Dolby knew better was possible.\n\nIn 1966, the noise reduction system Dolby A became standard in the recording industry. It eliminated the hissing sound that came with earlier standardisation efforts. This was achieved by having four channels all pressed onto the film strips themselves, which not only allowed more flexibility in the editing suite but also meant fewer people were needed on site to operate the technology.\n\nFrom here, Dolby improved on the system to bring about Dolby Stereo, a revolutionary surround system of compression that allowed cinema designers to consider the acoustics of any given theatre. When Star Wars premiered in 1977, audiences in local village cinemas could enjoy a comparable audio experience to that of their big city counterparts.\n\nBut what next? Will the pandemic push personal viewing and virtual reality sales, further forcing audio engineers to create more intricate technology to meet demands? Will this spell out a decline in shared viewing, making audio on a grand scale a smaller part of our lives?\n\nNothing is certain, but what can be said is that artificial intelligence and remastered audio seem to have combined with a keen interest in nostalgia to bring about new editing possibilities in audio from home. So perhaps here lies the next great leap in sound in film.\n\nFurther reading and sources"}, {"url": "https://zhuanlan.zhihu.com/p/434462055", "page_content": "有声电影初期\n\n1929年，华尔街股市大跌，美国进入经济大萧条时期，有声电影的发展正好在大萧条初期。\n\n1926-1927年，华纳兄弟公司推出一些加上音乐和声音的电影，在美国和欧洲一些国家受到欢迎，到1929年，美国的电影制片厂全面采用有声电影。\n\n不同于世界上其他国家，从无声电影转向有声电影是技术变革迫使，美国更多的是电影工业内部发展需要，无声电影的市场发展陷入低潮，市场需要新的形势的刺激，有声电影正是在这样的背景下发展起来的。\n\n有声电影初期，由于技术的不成熟，会出现很多问题，相比于默片时期，电影似乎处于倒退，娴熟的叙事剪辑技巧要根据落后的声音设备调整。初期的尝试性作品有《百老汇歌舞》（1929）、《掌声》（1929）、《琼宫艳史》（1929）、《哈利路亚》（1929）等。\n\n随着技术的不断完善，有声电影开始取代无声电影成为主要的电影形式。\n\n类型片的发展\n\n1939年，二战爆发，美国由于军火生意的原因经济开始复苏，并且在战后一举成为世界第一强国。电影工业也得益于美国经济的飞速发展，在这一时期充分发展。\n\n随着无声电影转向有声电影，电影市场结构发生了变化，形成了寡头垄断的局面。此时，派拉蒙、米高梅、福克斯、华纳兄弟、RKO、环球、哥伦比亚和联美八家电影公司主导整个美国电影工业。\n\n这一时期重要的导演有自无声时代开始创作的老一代导演卓别林、约瑟夫·冯·斯登堡、刘别谦、约翰·福特、霍华德·霍克斯、威廉·惠勒、弗兰克·鲍沙，新一代的导演乔治·顾柯、鲁本·马摩里安、文森特·弗里德、莱普史顿·史特吉、约翰·休斯顿、奥逊·威尔斯，还有其他国家的移民导演希区柯克、大卫·塞兹尼克、弗里茨·朗格、比利·怀尔德、奥托·普雷明格等。\n\n默片晚期初步形成的类型片进一步发展，出现了一些新的类型。如声音的引入形成的歌舞片，主要作品有《今夜爱我》（1932）、《第四十二街》（1933）、《摇摆时代》（1936）、《乐曲响起》、《绿野仙踪》（1939）、《相逢圣路易》、《封面女郎》（1944）等。\n\n其他类型如乖僻喜剧《费城故事》（1940）、《浮生若梦》（1938）、《20世纪特别快车》（1934）、《一夜风流》、《背叛你的人》、《战时新郎》（1948）、《妙药春情》（1952）；\n\n恐怖电影《野猫与金丝雀》、《德拉库拉》（1931）、《弗兰肯斯坦》（1931）、《黑暗古宅》（1932）、《木乃伊》（1932）、《豹人》（1942）；\n\n社会问题片《我们每天的面包》（1934）、《天涯逃亡人》（1932）、《野孩子》（1933）、《狂怒》（1936）、《愤怒的葡萄》（1940）等；\n\n强盗片《下层社会》（1927）、《小凯撒》（1930）、《公敌》（1931）、《疤脸大盗》（1932）等；\n\n黑色电影《马耳他之鹰》（1941）、《三楼的陌生人》（1940）、《失去的周末》、《恐怖内阁》、《红色收获》（1929）、《双重赔偿》（1944）等；\n\n战争电影《西线无战事》（1930）、《空中堡垒》（1943）、《目标缅甸》（1945）、《硫磺岛浴血战》（1945）等"}, {"url": "https://www.flickchart.com/charts.aspx?actor=alan+dinehart&decade=1930", "page_content": "Build A Custom Chart\n\nFilter By Decade/Year 21st Century The 2020s The 2010s The 2000s The 1990s The 1980s The 1970s The 1960s The 1950s The 1940s The 1930s The 1920s The 1910s The 1900s The 1890s The 1880s --- 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906 1905 1904 1903 1902 1901 1900 1899 1898 1897 1896 1895 1894 1893 1892 1891 1890\n\nFilter By Genre 2010 Florida Film Festival 2010 SXSW Festival Absurd Comedy Action Action Comedy Action Thriller Actuality Film Addiction Drama Adventure Adventure Comedy Adventure Drama Alien Invasion Films Americana Animal Picture Animated Musical Animation Anime Anthology Film Anti-War Film Apocalyptic Film Australian New Wave Avant-garde / Experimental Based-on-18th-Century-Literature Based-on-19th-Century-Literature Based-on-20th-Century-Literature Based-on-21st-Century-Literature Based-on-a-True-Story Based-on-Comics Based-on-Manga Based-on-Shakespeare Based-on-Television Based-on-Theatre Beach Party Film Berlin School Biker Film Biography Biopic Black Comedy Blaxploitation Body Horror Bollywood British New Wave British Noir Buddy Film Cannibal Film Canuxploitation Caper Carsploitation Cartoon Chase Movie Childhood Drama City Symphony film Combat Films Comedy Comedy Drama Comedy of Errors Comedy of Manners Comedy Thriller Comedy Western Coming-of-Age Commedia all’italiana Con Artist / Hustler Concert Film Costume Adventure Costume Horror Costume Romance Courtroom Drama Crime Crime Comedy Crime Drama Crime Thriller Cross-Dressing / Gender-Bending Culture and Society Cyberpunk / Tech Noir Cyborg / Android / Robot Czechoslovak New Wave Dance Film Detective Film Direct-to-Stream Disaster Film Docudrama Documentary Dogme 95 Domestic Comedy Drama Dystopian Film Ensemble Film Epic Erotic Drama Erotic Thriller Escape Film Essay Film Exploitation Film Fairy Tales and Legends Family Family Drama Family-Oriented Adventure Family-Oriented Comedy Family-Oriented Drama Family-Oriented Fantasy Fantasy Fantasy Adventure Fantasy Comedy Farce Female-Directed Film Feminist Film Femme Fatale Film Noir Folk Horror Foreign Language Film Found Footage Film French Impressionist Film French New Wave Gangster Film Gay and Lesbian Film German Expressionist Film Ghost Film Giallo Girls-with-Guns Glamorized Spy Film Gothic Film Grey Area Gross-Out Comedy Haunted House Film Heaven-Can-Wait Fantasies Heavenly Comedy Heroic Bloodshed Historical Epic Historical Film History Hitman / Assassin Film Holiday Film Home Invasion Film Hong Kong New Wave Horror Horror Comedy Hybrid Western Hyperlink Film Iranian New Wave Italian Neorealism Japanese New Wave J-Horror Jidaigeki Jukebox Musical Jungle Film Juvenile Delinquency Film K-Horror Krimi Film Law and Crime Made-for-Television Magic Realism Marriage Drama Martial Arts Media Documentary Media Satire Medical Drama Melodrama Message Movie Military and War Military Comedy Mindbender Mini-Series Mockumentary Monster Film Mountain Film Mumblecore Music Musical Musical Comedy Musical Drama Musical Romance Mystery Natural Horror New French Extremism New German Cinema New Hollywood Newspaper Film Ninja Film Odd Couple Film Outlaw Ozploitation Paranoid Thriller Parody/Spoof Period Film Pink Eiga Police Comedy Police Detective Film Police Drama Polish Film School Political Drama Political Satire Political Thriller Politics and Government Poliziotteschi Post-Apocalyptic Film Post-Noir Pre-Code Hollywood Prehistoric Fantasy Prison Film Prostitution Film Psychological Drama Psychological Horror Psychological Sci-Fi Psychological Thriller Religious Comedy Religious Drama Religious Horror Reunion Films Revenge Film Revisionist Western Road Movie Rock Musical Romance Romanian New Wave Romantic Adventure Romantic Comedy Romantic Drama Romantic Epic Romantic Fantasy Romantic Mystery Rural Drama Sadistic Horror Samurai Film Satire Science Fiction Sci-Fi Action Sci-Fi Comedy Sci-Fi Disaster Film Sci-Fi Horror Screwball Comedy Sea Adventure Serial Serial Killer Film Sex Comedy Sex Horror Shark Film Shocksploitation Short Film Showbiz Comedy Showbiz Drama Silent Film Singing Cowboy Slapstick Slasher Film Slice of Life Slow Cinema Social History Social Issues Social Problem Film Sociology Softcore Sex Film Sophisticated Comedy Space Adventure Spaghetti Western Splatter Film Sports and Recreation Sports Comedy Sports Drama Spy Comedy Spy Film Stand-up Comedy Stoner Comedy Stop-Motion Superhero Film Supernatural Comedy Supernatural Drama Supernatural Horror Supernatural Thriller Surrealist Film Survival Film Swashbuckler Sword-and-Sandal Sword-and-Sorcery Teen Movie Thriller Time Travel Film Tokusatsu Traditional Western Tragi-comedy True Crime Unglamorized Spy Film Urban Comedy Urban Drama Vampire Film Video Game War War Adventure War Drama War Epic War Romance Werewolf Film Western Whodunit Witchcraft Women-in-Prison Workplace Comedy Wuxia Film Yakuza Film Yugoslav Black Wave Zombie Film\n\nFilter By Franchise 1,000 Noir Films: They Shot Dark Pictures, Didn't They? 1001 Movies You Must See Before You Die 2011 AFI Film Festival 2011 Fantastic Fest 2011 Florida Film Festival 2011 SXSW Festival 2012 AFI Film Festival 2012 Fantastic Fest 2012 SXSW Festival 2012 TCM Fest 20th Century Fox Cinema Classics Collection 20th Century Fox Marquee Musicals 3 Ninjas 84th Academy Awards Nominated 85th Academy Awards Nominated 86th Academy Awards Nominated 87th Academy Awards Nominated 88 Films 88th Academy Awards Nominated 89th Academy Awards Nominated A.V. Club's 50 Best Films of the 90s A.V. Club's The New Cult Canon A24 Films AACTA Award for Best Film Nominated AACTA Award for Best Film Winning AACTA International Award for Best Film Winning Abbott and Costello Academy Award Best Cinematography Nominated Academy Award Best Cinematography Winning Academy Award Best Foreign Language Film Nominated Academy Award Best Foreign Language Film Winning Academy Award Best Picture Nominated Academy Award Best Picture Winning Academy Award for Best Adapted Screenplay Winning Academy Award for Best Animated Feature Film Nominated Academy Award for Best Animated Feature Film Winning Academy Award for Best Animated Short Film Nominated Academy Award for Best Animated Short Film Winning Academy Award for Best Documentary Feature Nominated Academy Award for Best Documentary Feature Winning Academy Award for Best Original Screenplay Nominated Academy Award for Best Original Screenplay Winning Academy Award for Best Production Design Nominated Academy Award for Best Production Design Winning Academy Award for Best Short Film Winning Academy Award Nominated The Advocate's Top 175 Essential Films of All Time for LGBT Viewers AFI's 100 Years...100 Cheers AFI's 100 Years...100 Laughs AFI's 100 Years...100 Movies 10th Anniversary Edition AFI's 100 Years...100 Passions AFI's 100 Years...100 Thrills AFI's Greatest Movie Musicals After Dark Horrorfest Airport Alamo Drafthouse 100 Alice in Wonderland Alien Allan Quatermain Allied Artists Pictures Amanda Award for Best Norwegian Film Winning Amblin Entertainment American Film Theatre American International Pictures American Pie American Zoetrope Amicus Productions The Amityville Horror Anchor Bay Entertainment Andy Hardy AnimEigo Annapurna Pictures Annie Award for Best Animated Feature Nominated Annie Award for Best Animated Feature Winning Apatow Productions April Fool's Argos Films Arrow Films Arthaus Arthouse Films Artificial Eye ASA Film Åsa-Nisse Asterix The Asylum Austin Powers Babylon 5 Back to the Future The Bad News Bears Bad Robot Productions BAFTA Award for Best British Film Nominated BAFTA Award for Best British Film Winning BAFTA Award for Best Film Nominated BAFTA Award for Best Film Winning BAFTA Award for Best Foreign Language Film Nominated BAFTA Award for Best Foreign Language Film Winning A Band Apart Barbie Batman Battlestar Galactica BBC Films BBC's 100 Greatest American Films Belgian Film Critics Association Grand Prix Winning Betty Boop Beverly Hills Cop BFI Big Golden Arena for Best Film Winning Billion-Dollar Film Club Blade The Blair Witch Project Bleeding Skull's Best Trash-Horror Films of the 1980s Bloody Disgusting Selects Bloody Earth Films Blue Underground Blumhouse Productions Bodil Award for Best Danish Film Winning Bosko Boston Blackie Boston Society of Film Critics Award for Best Film Winning Boston Society of Film Critics Award for Best Foreign Language Film Winning The Bowery Boys Bratz Breaking Glass Pictures Bring it On British Lion Films Brooksfilms Buddy Bugs Bunny Bulldog Drummond Busan International Film Festival New Currents Award Winning Cahiers du cinéma: Top 10 Lists Camp Motion Pictures Canadian Screen Award for Best Picture Nominated Canadian Screen Award for Best Picture Winning Cannes Camera d’Or Winning Cannes Caméra d'Or Winning Cannes Grand Prix Cannes Grand Prix du Festival International du Film Cannes Jury Prize Cannes Palme d'Or Winning Cannes Prix du scénario Cannes Prix Un Certain Regard Cannon Films Captain America Carolco Pictures Carry On Castle Rock Entertainment César Award for Best Film Nominated César Award for Best Film Winning Channel Four Films Charles Dickens Charlie Brown Charlie Chan Cheech & Chong Chemical Burn Entertainment Chicago Film Critics Association Award for Best Film Winning Children of the Corn Child's Play The Chronicles of Narnia The Chronicles of Riddick Cinema 16 Cinema Epoch Cinema Eye's 25 Most Influential Documentaries The Cinema Guild The Cinemaholic's 100 Best Japanese Movies of All Time The Cinemaholic's 100 Best Movies of All Time CinemaScope Cinerama The Cisco Kid Cities of Love CJ Entertainment CMV-Laservision Code Red Coffin Joe Cohen Film Collection Complex's 100 Best Movies Of The Complex Decade Complex's 50 Indie Movies You Need to See Before You Die Complex's 50 Most Disturbing Movies Complex's 50 Worst Romantic Comedies Concorde Pictures Conjuring Universe The Criterion Collection Criterion Eclipse Critics' Choice Documentary Awards Winning Critics' Choice Movie Award for Best Documentary Feature Winning Critics' Choice Movie Award for Best Foreign Language Film Winning Critics' Choice Movie Award for Best Picture Winning Critters Crocodile Dundee Crown International Pictures Crystal Globe Grand Prix Award Winning Cult Epics Daffy Duck Danger After Dark Danielle Steel Dark Horse Comics Dark Shadows Dark Sky Films David di Donatello Award for Best Film Winning DC Comics DC Extended Universe De Laurentiis Entertainment Group Death Race Death Wish Detriot Film Critics Society Award for Best Film Winning Die Hard Dimension Extreme Dimension Films Dirty Harry Discotek Media Discworld Doctor Who Donald Duck Dr. Seuss Dracula Drafthouse Films Dragon Ball Dragon Dynasty DreamWorks Animation DreamWorks SKG Droopy Ealing Studios East Side Kids Edgar Allan Poe Edgar Wallace Elder's Best Film You've Never Seen Elder's Film That Changed My Life Elmer Fudd Elmore Leonard Embassy Pictures Empire Award for Best British Film Winning Empire Award for Best Comedy Winning Empire Award for Best Film Winning Empire Award for Best Horror Winning Empire Award for Best Sci-Fi/Fantasy Winning Empire Award for Best Thriller Winning Empire International Pictures Empire Magazine's 100 Best Films of World Cinema Empire Magazine's 50 Worst Movies Ever Ernest ESPN Films EuropaCorp European Film Award for Best Film Nominated European Film Award for Best Film Winning The Evil Dead The Exorcist The Eye Facets Video The Falcon Fangoria Films Fantastic Four Fantoma The Fast and the Furious Father of Four Fear Itself Female Convict Scorpion Film Comment Selects Film Movement Film Ventures International FilmDistrict Filmfare Award for Best Film Winning Final Destination First Run Features Flickchart Road Trip The Fly Focus Features Foghorn Leghorn Forbidden Hollywood Fox 2000 Pictures Fox Cinema Archives Fox Searchlight Pictures Frankenstein Free Willy French Syndicate of Cinema Critics Prix Léon Moussinac French Syndicate of Cinema Critics Prix Méliès Winning Friday The 13th Fu Manchu Full Moon Features G.I. Joe Gamera Gaumont Gdynia Film Festival Winning Genie Award for Best Motion Picture Nominated Genie Award for Best Motion Picture Winning German Film Award for Best Feature Film Winning Ghost House Pictures Ghost in the Shell Ghoulies Global Lens Collection The Godfather Godzilla Gold Hugo Winning Golden Bear for Best Film Winning Golden Calf for Best Feature Film Winning Golden Globe Award for Best Motion Picture Drama Winning Golden Globe Award for Best Motion Picture Musical or Comedy Winning Golden Globe Nominated Golden Harvest Golden Leopard Winning Golden Lion Winning Golden Raspberry Award for Worst Picture Golden Raspberry Award for Worst Picture Nominated Goofy Goya Award for Best European Film Winning Goya Award for Best Film Goya Award for Best Iberoamerican Film Winning Grand Prix des Amériques Winning The Green Hornet Green Lantern Grindhouse Releasing The Grudge Guldbagge Award for Best Swedish Film Nominated Guldbagge Award for Best Swedish Film Winning H.G. Wells H.P. Lovecraft The Hallmark Channel Halloween Hammer Film Productions Hannibal Lecter Happy Madison Productions Harry Palmer Harry Potter HBO Films Hellboy Hellraiser Hen's Tooth Video Herbie the Love Bug Hercules Highlander Hildegarde Withers The Hills Have Eyes The Hire The Hollywood Reporter's Hollywood's 100 Favorite Films Home Alone Hong Kong Category III Hong Kong Film Awards Best Film Winning Hong Kong Film Critics Society Award for Best Film winning Hornblower The Howling Hulk The Human Condition The Hunger Games Ice Age Icon Productions IFC Films IFC Midnight IFFR Tiger Award Winning Illumination Entertainment Ilsa IMAX Independent Spirit Award for Best Film Nominated Independent Spirit Award for Best Film Winning Independent Spirit Award for Best Foreign Film Nominated Independent Spirit Award for Best Foreign Film Winning Independent Spirit John Cassavetes Award Winning Indiana Jones Indiewire's 100 All-Time Greatest Films Directed by Women Indiewire's 100 Best Movies of the 2010s Inner Sanctum Mysteries The Invisible Man Ip Man Iron Man Jack Ryan Jackass James Bond Jason Bourne Jaws John le Carré Jolly Frolics Jönssonligan Jungle Jim Jurassic Park Kamen Rider The Karate Kid King Kong Kino International Kino Lorber Studio Classics Koch Lorber Korean Film Archive's Top 100 Korean Films L.A. Noire 'Golden Film Reels' Collection Lakeshore Entertainment The Land Before Time Laurel and Hardy Legendary Pictures LEGO Leonard Maltin’s 151 Best Movies You’ve Never Seen Leprechaun Lethal Weapon Lifetime Television Lionsgate Entertainment Lippert Pictures Little White Lies's 100 Great Movies By Female Directors Little Women Living Dead London Film Critics' Circle Award for Film of the Year London Film Critics' Circle British Film of the Year Winning London Film Critics' Circle Foreign Language Film of the Year Winning Lone Wolf and Cub Looney Tunes The Lord of the Rings Love, Death & Robots Lucasfilm Lucky Luke Lucky Stars Lupin III Lux Prize Nominated Lux Prize Winning Ma and Pa Kettle Mad Max Madagascar Madman Films Magnet Releasing The Magnificent Seven Magnolia Pictures Maisie Malibu Bay Films The Man from U.N.C.L.E. Martin Beck Marvel Cinematic Universe Marvel Comics Marvin the Martian Marx Brothers Masters of Cinema Masters of Horror The Matrix Meatballs Meet The Parents Menemsha Films Merchant Ivory Productions Merrie Melodies Merry Film MGM Classics Collection Michael Crichton Mickey Mouse Midnite Movies Millennium Millennium Films Miramax Films Mission: Impossible Mondo Macabro Monogram Pictures Monster High Monster Pictures Monty Python Moscow International Film Festival Top Prize Winning Mr. Moto MTV Films MTV Movie Award for Best Movie Nominated MTV Movie Award for Best Movie Winning The Mummy The Muppets Music Box Films Mya Communication Mystery Science Theater 3000 Mythica NAACP Image Award for Outstanding Motion Picture Winning The Naked Gun Naruto National Board of Review Award for Best Film Winning National Film Registry National Lampoon National Society of Film Critics Award for Best Film Winning Netflix Originals New Horizons Picture Corp New Line Cinema New World Pictures New York Film Critics Circle Award for Best Film Winning New York Film Critics Circle Award for Best Foreign Language Film Winning Night of the Demons A Nightmare on Elm Street Nikkatsu No Foolin' Nordic Council Film Prize Nominated Nordic Council Film Prize Winning Nordisk Film NoShame Films Odeon Entertainment Best of British Collection Olive Films The Olsen Gang The Omen Online Film Critics Society Award for Best Picture Winning Open Road Films Orion Pictures Oscilloscope OSS 117 Other Cinema Palisades Tartan Palm Pictures Paramount Vantage Paranormal Activity Paste Magazine's 100 Best “B Movies” of All Time Paste Magazine's 100 Best Documentaries of All Time Paste Magazine's 100 Best Film Noirs of All Time Paste Magazine's 100 Best Martial Arts Movies of All Time Paste Magazine's 100 Best Silent Films of All Time Paste Magazine's 40 Best Films from the Netherlands Pathfinder Pictures Pekka Puupää Pepé Le Pew Phantasm Philip K. Dick The Pink Panther Piranha Pirates of the Caribbean Pixar Animation Studios Planet of the Apes Platinum Dunes PM Entertainment Pokémon Police Academy Poltergeist Popeye Porky Pig Predator Private Snafu Prix Jean Vigo Prix Louis-Delluc Producers Guild of America Award for Best Theatrical Motion Picture Winning Producers Releasing Corporation Prom Night Psycho The Punisher Puppet Master Queer Palm Nominated Queer Palm Winning Quentin Tarantino's Cinematic Influences RadiusTWC Rambo The Rank Organisation Raro Video Ray Harryhausen REC Red Peony Gambler Redemption Films Regency Films Relativity Media Republic Pictures Resident Evil Retromedia Entertainment Retro-Seduction Cinema Revenge of the Nerds Revolution Studios The Ring RKO Pictures Road to... Roadside Attractions Robin Hood RoboCop Rocky Roger Ebert's Great Movies Roger Rabbit Rolling Thunder Pictures Rue Morgue's 200 Alternative Horror Films You Need To See Rush Hour Saga Studio The Saint Samuel Goldwyn Company San Diego Film Critics Society Award for Best Film Winning The Santa Clause Sartana Satellite Award for Best Documentary Film Winning Satellite Award for Best Film Nominated Satellite Award for Best Film Winning Satellite Award for Best Foreign Language Film Winning Saturday Night Live Saturn Award for Best Fantasy Film Winning Saturn Award for Best Horror or Thriller Film Nominated Saturn Award for Best Horror or Thriller Film Winning Saturn Award for Best International Film Nominated Saturn Award for Best International Film Winning Saturn Award for Best Science Fiction Film Nominated Saturn Award for Best Science Fiction Film Winning Saw Scanners Scary Movie Scooby-Doo Scorpion Releasing Scream Scream Factory Screamfest Best Picture Winning Screen Gems Second Run Seduction Cinema Seventh Art Severin Films Shadow Distribution Shaft Shameless Screen Entertainment Sharknado Sharpe Shaw Brothers Studios Sherlock Holmes Shôchiku Shock-O-Rama Shout! Factory Shrek Shriek Show SIFF Golden Space Needle Winning Sight & Sound's Greatest Films of All Time Poll Silent Night, Deadly Night Silly Symphonies Silver Bear Jury Grand Prix Winning The Skywalker Saga Slant Magazine's 100 Best Films of the 1990s Slant Magazine's 100 Essential Films Slant Magazine's 50 Essential LGBT Films Slant Magazine's 'Best of the Aughts' Sleepaway Camp Sleepy Eyes Of Death Something Weird Video Sony Martini Movies Sony Pictures Choice Collection Sony Pictures Classics Speedy Gonzales Spider-Man Spike Lee's Essential Film List Spy Kids Spyglass Entertainment Star Trek Star Wars Stargate The Stepfather Stephen King Stockholm International Film Festival Bronze Horse Winning Strand Releasing Stray Cat Rock Studio Ghibli StudioCanal Subspecies Subversive Cinema Summit Entertainment Sundance Film Festival Grand Jury Prize Documentary Winning Sundance Film Festival Grand Jury Prize Dramatic Winning Sundance Selects Sunn Classic Pictures Suomen Filmiteollisuus Superman The Sweeney Syfy Originals Sylvester the Cat Synapse Films Tales from the Crypt Talkartoons Tarzan Taz TCM Underground Teenage Mutant Ninja Turtles The Terminator The Texas Chainsaw Massacre They Shoot Pictures, Don't They? They Shoot Pictures, Don't They? Top 1000 of the 21st Century They Shoot Zombies, Don't They? Top 1000 Horror Movies The Thin Man THINKFilm Thor The Three Musketeers The Three Stooges TIFF Best Canadian Feature Film Winning Tigon British Film Productions Time Out: Hong Kong's 100 Greatest Hong Kong Films Time Out: London's 100 Best Bollywood Movies Time Out: London's 100 Best British Films Time Out: London's 100 Best Comedy Movies Time Out: London's 100 Best Horror Films Time Out: London's 100 Best Romantic Movies Time Out: London's 100 Best Sci-Fi Movies Time Out: London's 50 Greatest Monster Movies Time Out: London's 50 Greatest Westerns Time Out: New York's 100 Best Action Movies Time Out: New York's 100 Best Animated Movies Time Out: New York's 100 Best Movies of All Time Time Out: New York's 50 Best Foreign Films Time Out: New York's 50 Most Controversial Movies Time Out: Paris's 100 Best French Films Tintin Titanus TLA Releasing Todd-AO Toei Toho Tokyo Sakura Grand Prix Winning Tokyo Shock Tom and Jerry Torchy Blane Toronto Film Critics Association Award for Best Film Winning Toronto International Film Festival People's Choice Award Winning Touchstone Pictures The Toxic Avenger Toy Story Trancers Transformers Transilvania International Film Festival Winning Tremors Tribeca Film Tribeca Film Festival Best Documentary Feature Winning Tribeca Film Festival Best Narrative Feature Winning Trimark Pictures TriStar Pictures Troma Entertainment Troublemaker Studios Turner Classic Movies TWC-Dimension Tweety Bird The Twilight Saga Twilight Time Underworld Unearthed Films United Artists Universal International Pictures Universal Monsters Universal Soldier Universal Vault Series Unseen Cinema Uuno Turhapuro Val Lewton VCI Entertainment VeggieTales The Vengeance Trilogy Venice Film Festival Special Jury Prize Winning Vestron Pictures Video Nasties Village Roadshow Pictures Vinegar Syndrome VistaVision Wallander Walt Disney Animation Studios Walt Disney Cartoons Walt Disney Pictures Warner Archive Collection Warner Bros. Animation Warner Bros. Cartoons Warner Bros.-Seven Arts Washington D.C. Area Film Critics Association Award for Best Film Winning Washington D.C. Area Film Critics Association Award for Best Foreign Language Film Winning The Weinstein Company Well Go USA The Whistler Wild Bunch Wild East Productions WildEye Releasing Wile E. Coyote and Road Runner Winnetou Winnie the Pooh Witchcraft The Wizard of Oz Wizard World Louisville 2014 Wolf Man Working Title Films Writers Guild of America's 101 Funniest Screenplays Writers Guild of America's 101 Greatest Screenplays Wrong Turn WWE Studios X-Men Yosemite Sam Zatoichi Zeitgeist Films Zentropa Entertainments Zorro\n\nSort by: Ranking Sort by: Newest Added To Site Sort by: Newest Added By User Sort by: Release Date\n\nHere are a few examples of ways\n\nyou can filter the charts:"}, {"url": "https://www.filmfansite.org.uk/actor/d_actor/dinehart_alan.html", "page_content": "Career / Biography\n\nAlan Dinehart was a film actor in the 1930s and 1940s.\n\n"}, {"url": "https://immortalephemera.com/23741/1003-alan-dinehart/", "page_content": "Everything Immortal for October 3 ...\n\nBorn on this date ...\n\nWe have a handful of October 3rd birthdays to celebrate. A few are better known than the star I've chosen to focus on today, though none were nearly as active during such a short span as my pick, Alan Dinehart, was in 1930s and early '40s Hollywood.\n\nMore following the image of Alan Dinehart, born 1889-ish.\n\nIf you put a star by one of my top picks for October, Dante's Inferno (1935), and caught it on TCM earlier this week then you saw Alan Dinehart as Spencer Tracy's right hand man Jonesy. Another recent sighting was in The Whistler (1944) a few weeks back. Dinehart was seen offering advice to J. Carrol Naish in that first film of the Columbia series starring Richard Dix.\n\nAlan Dinehart was very active on Broadway from 1918 onwards and originally arrived in Hollywood as a leading man in 1931. But Dinehart was better suited for character roles and that is how we best remember him today. Dinehart typically played villains, or at the very least his characters were not completely on the level. I like him best for his brash businessmen, though I'd never want to sign a contract with one of his characters!\n\nAlan Dinehart was born in St. Paul, Minnesota, October 3, 1889. Maybe. No doubt about St. Paul, but every time new paperwork was filled out the rest gets called into question. His given first name was definitely Harold with the middle name of either Alan or Allen. In 1936 Alan Dinehart legally changed his name to that of his father, Mason Alan Dinehart, so that his youngest son could legally be known as Alan Dinehart III. I'd imagine that move didn't sit too well with his son by a previous marriage, Alan Dinehart, Jr.\n\nWhile the date on our Alan Dinehart's birth registration is given as October 5, later paper work, including his World War II draft registration card , give the date as October 3. The year Dinehart was born seems generally accepted as 1889, but it should be noted that on both his birth and draft registrations it is given as 1888, and in Dinehart's own hand on the latter. Dinehart's 1944 obituaries claimed he was 48, but Alan seemed flexible about his date of birth, even claiming he was just 40 on the 1930 census ... and he remained 40 on the 1940 census\n\nSome time after his birth Alan's father disappears (dies?) and the young man moved to Montana with his mother, Elizabeth, and stepfather, Louis Brasch. There he attended Butte High School where he had his first taste of acting.\n\nIn 1907 he married a Joe Trickey in Miles City, Montana, though I do not know what happened to this first Mrs. Dinehart. One way or another Alan left her behind when he took the cattle train to New York and embarked upon his acting career. He's said to have appeared in Applesauce in Chicago in 1910 and made his way to Broadway by 1918. In between he married a second time, to actress Marie Louise Dyer, with whom he'd have son Alan Dinehart, Jr. in 1918. It wasn't until after arriving in Hollywood that Dinehart would marry the woman he'd spend the rest of his life with, actress Mozelle Britton, in 1933.\n\nAlong with Alan's name change in 1936 came son Mason Alan Dinehart III, who would claim Irving S. Cobb as his godfather. In early 1939 Mozelle was involved in a terrible car accident, but she recovered and even played alongside Alan in a radio drama shortly before his death. Alan died in 1944; Mozelle in 1953. She was just 41. I'll leave it to you to decide how old Alan Dinehart was, I'll go with the flow and say 54.\n\nOne of Alan Dinehart's greatest triumphs came later in his career, off the screen and on the Broadway stage. His play Separate Rooms, which he wrote, directed and starred in along with Lyle Talbot and Glenda Farrell, was a Broadway hit playing over 600 times during 1940-41. That was after overcoming the lousy reviews which greeted it, no small feat.\n\nOther films you may have seen Alan Dinehart in include Lawyer Man (1932), where he's William Powell's uptown partner; as Cagney's competition in Jimmy the Gent (1934); and as Virginia Bruce's press agent in Born to Dance (1936) starring Eleanor Powell and James Stewart.\n\nYou've surely seen him in a number of other films as well: According to the IMDb, Alan Dinehart managed a total of 89 credited roles during his active Hollywood career from 1931 until his 1944 death. Mid-1930's newspaper reports noted that he typically worked in 15 films per year.\n\nBesides Lawyer Man, other movies featuring Alan Dinehart that I have previously written about on this site as The Payoff (1935) and The World Changes (1933).\n\nAlso\n\n... born on October 3 ... they're each better remembered for other projects, but I have to point to my Werewolf of London (1935) article in mentioning that co-stars Henry Hull and Warner Oland each celebrated their birthday on October 3.\n\nOland, best known for his portrayals of Charlie Chan, was the elder, born iN Sweden, 1879. While Hull, best recalled for Alfred Hitchcock's Lifeboat (1944), was Kentucky born in 1890.\n\nAlso born on October 3 were legend of the stage Eleanora Duse in 1858; character actor Charles Middleton in 1874; author of so many great stories turned into Depression era films, Damon Runyon, in 1880; director Leo McCarey, of so many favorite comedies, in 1896; and silent starlet Josephine Hill in 1899.\n\nTCM Pick\n\nYou can chop up today's TCM programming into four parts and all of them have something to recommend about them!\n\nThe day begins with five films starring character man James Gleason including the first Hildegarde Withers mystery, Penguin Pool Murder (1932) starring Edna May Oliver at 7:45 am. Next are three films directed by Leo McCarey, mentioned in the birthday section immediately above, beginning with Love Affair (1939) at 2 pm EST.\n\nThe first of TCM's Classic Horror marathons begins at 8 with The Mystery of the Wax Museum (1933), the first of four chillers featuring Lionel Atwill. That's followed by Doctor X (1932) at 9:30; Mark of the Vampire (1935) at 11:00 pm; and House of Dracula (1945) at 12:15 am.\n\nThe overnight is populated by zombies with George A. Romero's Night of the Living Dead (1968) airing at 2:45 am and the Val Lewton produced I Walked With a Zombie (1943) from Jacques Tourneur following at 4:30 am.\n\nTo pick just one? Well, if you've never seen any of these I'd feel you out some before insisting upon Night of the Living Dead, but since that one falls outside of the general timeline of this website I'd instead suggest Mark of the Vampire (1935), which besides Atwill also features Lionel Barrymore and Bela Lugosi.\n\nSales Notes\n\nI must really love the 1940 A and M Wix Cinema Cavalcade tobacco card sets because I'm constantly using examples from either the first or second volume to illustrate my posts!\n\nI've recently listed some higher grade examples, averaging about EX-MT or 7/10, to eBay in the Fixed Price/Buy it Now format. There are three different sized cards in these sets and so far I've listed all of the large and medium cards that I have on hand. The small ones are scanned and ready to be listed any day now.\n\nYou can find all of my Cinema Cavalcade cards on eBay HERE , including several from the tougher Volume 2 set that I listed soon before these Volume 1 beauties. (High grade only, EX-MT or better, HERE )\n\nAs an example we'll go with a favorite pose, that's also currently in stock, picturing Fredric March, Miriam Hopkins and Gary Cooper in Design for Living (1933), which I recently discovered will be airing on TCM this coming December 13 (right after Trouble in Paradise, fellow Hopkins and/or Lubitsch fans!). This is one of the large sized cards in the Cinema Cavalcade set:\n\nThat's About All ...\n\nSources for the Alan Dinehart piece at the top of the page follow below.\n\nHave a wonderful day!\n\nCliff\n\nSources\n\n\"Alan Dinehart of Stage, Film Dies.\" Oakland Tribune 18 Jul 1944: 10. NewspaperArchive. Web. 3 Oct 2012.\n\n18 Jul 1944: 10. NewspaperArchive. Web. 3 Oct 2012. \"Gets Legal Name.\" Jefferson City Post Tribune 3 Aug 1936: 3. NewspaperArchive. Web. 3 Oct 2012.\n\n3 Aug 1936: 3. NewspaperArchive. Web. 3 Oct 2012. \"Villain and General All Around Bad Man of Screen a Butte Boy Who Made Good.\" Montana Standard 9 feb 1936: 26. NewspaperArchive. Web. 3 Oct 2012.\n\nNote: All genealogical references were gathered through FamilySearch and are directly linked to in the Dinehart biography above.\n\nLike this: Like Loading..."}, {"url": "https://videolibrarian.com/articles/essays/how-talkies-changed-the-acting-industry/", "page_content": "Imagine having a successful career knowing the ins and outs of it for many years. Then when you least expect it, the advancement of technology changes how your job works. Some can adapt to the changes very well while others can’t bring themselves to do so. These conflicting emotions took place when the film industry transitioned from silent films to sound films a.k.a “talkies.” In honor of National Silent Movie Day, here is a media education lesson for you on how the transition from silent to sound films changed the acting industry forever.\n\nWhen you think about it, silent film collections were never 100% silent. Musical accompaniment allowed audiences to feel the emotions running through the characters and situations. At the time, the only way to bring recorded sound to an index of movies was through cylinders or discs of recordings. However, these devices could only hold four minutes of sound, were hard to amplify for the entire audience, and struggled to sync with the action on screen.\n\nAfter a ton of experimental attempts, 1927’s The Jazz Singer changed everything by having a movie recorded in a Vitaphone—a sound-on disc that involves the process of recording all of the audio on a phonograph record and then syncing it in real-time with the projector. Actors actually heard Al Jolson speak lines for the first time that were spontaneous and natural considering they were ad-libbed. Then in 1928, the first “100%” talkie came about with Lights of New York, and sound films were born.\n\nWith sound being incorporated into films, this changed the Hollywood definition of performance. According to Backstage, there were a lot of actors who succeeded in “talkies.” Swedish actress Greta Garbo was one of the biggest box office performers of the silent era. Then when sound came to film, her thick Swedish accent did not turn audiences or filmmakers away as her low, husky voice fit in with the mysterious characters she played. Her first sound film Anna Christie was actually marketed as “Garbo speaks!” being the biggest box office hit of 1930 and earned her an Oscar nomination.\n\nAnother star that transitioned to sound that you can add to your movie library was John Barrymore whose stage talents in comedy and Shakespeare helped him fit in very well with sound films. His thundering stage-trained voice had him star in huge hits like Grand Hotel. Carole Lombard started in silent slapstick comedies of the 1920s with her energetic performances being brought onto classics like My Man Godfrey. This film earned her an Oscar nomination and “talkies” helped critics put her on their top comedian's list.\n\nBoris Karloff would be typecast as Indian or Arabic villains for silent films despite being British. When he transitioned to sound films, his most famous role came in 1931’s Frankenstein. While playing this classic monster was still silent, his subtle yet powerful performance wowed audiences which launched his classic horror film career. And if you want to hear his voice in full, just listen to him narrate the animated classic Christmas film How the Grinch Stole Christmas.\n\nSome stars may have succeeded with this transition, but sound movies ruined the careers of a lot of stars. According to Daily Telegraph, flapper sex symbol Clara Bow, known for her silent pantomime-style acting, said she “hated talkies” calling them “stiff and limiting.” After all, hidden microphones restricted movements. Silent actors were used to directors screaming out directions while the cameras rolled as well as using exaggerated facial expressions and movements to convey emotion.\n\nActors like Douglas Fairbanks retired from acting when he was almost 50 after four “talkies” as he felt technical restrictions ruined it for him. Mary Pickford won Best Actress for her role in Coquette, but she didn’t enjoy the new changes to film either and retired in 1933 only returning to film with silent film star Charlie Chaplin in the mid-1950s.\n\nVilma Banky’s popularity as a silent All-American character hit a decline when she revealed her Hungarian accent while playing a cook in This is Heaven. Charlie Chaplin resisted talking in movies because he also felt “talkies” were a limited field. But, he was still willing to lend his voice when it counted, like when he delivered one of the best speeches you’ll ever hear in a movie in The Great Dictator.\n\nSilent films and sound films clearly hit different nerves with different actors. Some actors used “talkies” as an opportunity to show off their powerful voices and were seen in a new light and sound. Others felt more comfortable acting using movements and animated facial expressions. It’s unfortunate that the challenging transition to sound led to early retirement for other actors, but they will always live on in the silent era film archive of cinema history."}, {"url": "https://www.moma.org/calendar/events/7214", "page_content": "If you would like to reproduce an image of a work of art in MoMA’s collection, or an image of a MoMA publication or archival material (including installation views, checklists, and press releases), please contact Art Resource (publication in North America) or Scala Archives (publication in all other geographic locations).\n\nMoMA licenses archival audio and select out of copyright film clips from our film collection. At this time, MoMA produced video cannot be licensed by MoMA/Scala. All requests to license archival audio or out of copyright film clips should be addressed to Scala Archives at [email protected]. Motion picture film stills cannot be licensed by MoMA/Scala. For access to motion picture film stills for research purposes, please contact the Film Study Center at [email protected]. For more information about film loans and our Circulating Film and Video Library, please visit https://www.moma.org/research/circulating-film.\n\nIf you would like to reproduce text from a MoMA publication, please email [email protected]. If you would like to publish text from MoMA’s archival materials, please fill out this permission form and send to [email protected]."}, {"url": "https://zhuanlan.zhihu.com/p/442415824", "page_content": "在“三·一独立运动”之后，日本采用了较为温和的“文化统治”，对电影的控制自然进一步收紧。这一时期，有声技术逐渐传入，韩国电影进入了从无声电影到有声电影的过渡时期，题材也从之前正面抗日转为民族启蒙主题。\n\n1935年，韩国出现了第一部有声电影——李明雨执导的《春香传》,其后四年一直处于无声到有声的转型时期，这一时期的代表性作品有安钟和执导的《流入银河的爱情》（1953）；方汉骏导演的《洒水车》、《汉江》（1938）；杉基采的《无情》（1939）；尹逢春的《图生路》（1938）；李英椿的《回归处》（1939）等。\n\n1941年1月，朝鲜总督府颁布《朝鲜电影令》，封闭了当时国内十家电影公司，对于韩国电影进行全面封杀，韩国电影进入最为黑暗的阶段，1940-1945年拍摄影片几乎全都是宣传“日韩一体”或者对于日本进行美化的影片，韩国本土电影消失，电影彻底沦为日本皇民化的工具。"}, {"url": "https://www.britannica.com/art/history-of-the-motion-picture/Postsynchronization", "page_content": "The technological development that most liberated the sound film, however, was the practice known variously as postsynchronization, rerecording, or dubbing, in which image and sound are printed on separate pieces of film so that they can be manipulated independently. Postsynchronization enabled filmmakers to edit images freely again. Because the overwhelming emphasis of the period from 1928 to 1931 had been on obtaining high-quality sound in production, however, the idea that the sound track could be modified after it was recorded took a while to catch on. Many motion-picture artists and technicians felt that sound should be reproduced in films exactly as it had originally been produced on the set; they believed that anything less than an absolute pairing of sound and image would confuse audiences.\n\nFor several years, both practice and ideology dictated that sound and image be recorded simultaneously, so that everything heard on the sound track would be seen on the screen and vice versa. A vocal minority of film artists nevertheless viewed this practice of synchronous, “naturalistic” sound recording as a threat to the cinema. In their 1928 manifesto “Sound and Image,” the Soviet directors Sergei Eisenstein, Vsevolod Pudovkin, and Grigory Aleksandrov denounced synchronous sound in favour of asynchronous, contrapuntal sound—sound that would counterpoint the images it accompanied to become another dynamic element in the montage process. Like the practical editing problem, the theoretical debate over the appropriate use of sound was eventually resolved by the practice of postsynchronization.\n\nPostsynchronization seems to have first been used by the American director King Vidor for a sequence in which the hero is chased through Arkansas swamplands in the all-Black musical Hallelujah (1929). Vidor shot the action on location without sound, using a freely moving camera. Later, in the studio, he added to the film a separately recorded sound track containing both naturalistic and impressionistic effects. In the following year Lewis Milestone’s All Quiet on the Western Front and G.W. Pabst’s Westfront 1918 both used postsynchronization for their battle scenes. Ernst Lubitsch used dubbing in his first American sound films, the dynamic musicals The Love Parade (1929) and Monte Carlo (1930), as did the French director René Clair in Sous les toits de Paris (Under the Roofs of Paris, 1930). In all these early instances, sound was recorded and rerecorded on a single track, although some American directors, including Milestone and the Russian-born Armenian Rouben Mamoulian (Applause, 1929; City Streets, 1931), had experimented with multiple microphone setups and overlapping dialogue as early as 1929. Generally, through 1932, either dialogue or music dominated the sound track unless they had been simultaneously recorded on the set. In 1933, however, technology was introduced that allowed filmmakers to mix separately recorded tracks for background music, sound effects, and synchronized dialogue at the dubbing stage. By the late 1930s, postsynchronization and multiple-channel mixing had become standard industry procedure."}], "Alan Dinehart appeared in popular films such as The Big Broadcast (1932), The Invisible Man (1933), and The Little Minister (1934).": [{"url": "https://www.cinema.ucla.edu/events/2015/03/16/big-broadcast-milky-way", "page_content": "\n\nIn the late 1920s, the talkies introduced a wave of all-star revues, such as MGM’s The Hollywood Revue of 1929 and Warner Bros.’s The Show of Shows (1929), which were inspired by the boisterous spirit of vaudeville. Paramount used this variety format as a vehicle to showcase a dazzling array of radio personalities—15 total—whose stardom was built on coast-to-coast radio programs, record sales and nightclub shows. Radio was in its golden age, and Hollywood had found ways to capitalize on its popularity.\n\nThe Big Broadcast stars Bing Crosby in his first major role in a feature. The crooner had made his screen debut in Universal’s King of Jazz (1930) as part of The Rhythm Boys trio. Crosby later signed with Mack Sennett, starring in a string of successful musical comedy shorts. In The Big Broadcast, Crosby portrays a radio heartthrob whose perennial tardiness—caused by Sharon Lynn’s vampy Mona Lowe (a play on the tune “Moanin’ Low”)—leads a sponsor to pull the plug on the WADX station. When Mona jilts him for another man, the inconsolable (and inebriated) Bing enters a suicide pact with newfound friend Leslie (Stuart Erwin), an equally lovelorn Texas oilman. In the sober light of day, Leslie resolves to set things right by buying the radio station and preparing the next big broadcast.\n\nThe loose narrative interweaves performances by each of the radio talents, among them the Boswell Sisters, Cab Calloway (who steals the show with “Kickin’ the Gong Around”) and the Mills Brothers. Burns and Allen make their feature film debut as the distressed station manager and his birdbrained stenographer. Director Frank Tuttle, who had been making comedies since the early 1920s, further animates the film by employing a number of delightful camera tricks that harken back to slapstick two-reelers. The film proved to be a hit, prompting Paramount to revisit the variety format with International House (1933) and three more Big Broadcast pictures in the 1930s. —Jennifer Rhee\n\nDirector: Frank Tuttle. Production: Paramount Publix Corp. Distribution: Paramount Publix Corp. Screenwriter: George Marion Jr. Based on the play Wild Waves by William Ford. Cinematographer: George Folsey. Cast: Stuart Erwin, Bing Crosby, Leila Hyams, Sharon Lynn, Gracie Allen. 35mm, b/w, 80 min.\n\nRestored by UCLA Film & Television Archive and Universal Pictures from a 35mm acetate composite fine grain master positive and a 35mm nitrate composite print. Laboratory services by The Stanford Theatre Film Laboratory, BluWave Audio. Special thanks to: Bob O’Neil, Michael Feinberg.\n\n\n\n"}, {"url": "https://www.imdb.com/title/tt0022815/reviews", "page_content": "8 /10\n\nThis is a zippy little precode with a most unusual plot line.\n\n\n\nGabby Denton (Edmund Lowe) is the irresponsible type. He blows all of the money that he won gambling and now needs a job. He asks for a job as mechanic at his brother-in-law. Beef's (James Gleason's) garage and gets one. It's not long before Gabby figures out that Beef is in cahoots with some car thieves in the same building as the auto repair shop. Here I have to get into architecture, because it has a major place in the plot. Beef's garage is in an eight story building. The repair shop is on the second floor, the auto paint shop that is fronting for the auto theft ring is on the sixth floor and a speakeasy is on the seventh. There is a circular ramp/driveway that connects the floors together so you can drive from the street all the way to the seventh floor if you wish.\n\n\n\nThrown into this mix is the marvelous Wynne Gibson as Silver, a saucy blonde who is the girlfriend of the titular head of the auto theft ring, Jenkins (Alan Dinehart). Gabby ends up towing her wrecked car one day, and the two embark on an affair punctuated with lots of precode dialogue that consists of rhetoric so ribald that I'm surprised it made it to the screen.\n\n\n\nGabby: What are you sitting on?\n\n\n\nSilver: Please judge, do I have to answer that?\n\n\n\nGabby figures the car thieves and Beef's involvement - he's doing it for extra cash for his wife and kid - is Beef's business. But then one day Beef's son and Gabby's nephew is run over by a speeding car and Gabby ties it to a stolen car that was speeding up the ramp where the garage is moments later. At this point, things get dicey.\n\n\n\nThis is a great precode with a marvelous cast. I always loved Edmund Lowe as the extremely flawed guy who is the private eye or the reporter or in this case just an average Joe who gets mixed up in a dangerous situation. This was a most unusual role for James Gleason, and you need to watch the film to see what I mean. Dickie Moore as Gleason's son is cute as a button. And Alan Dinehart as the titular head of the theft ring always excelled as the slimy weasel with a refined veneer. When you see the real brains of the ring - George Rossener - you figure out why there's a front man. He's playing a deaf mute, but he is also no fun to look at and has a perpetual scowl on his face.\n\n\n\nThen there are the strange little things that make the film such as the autopen that the mute gangster uses to communicate with Dinehart and a wedding chapel that is across the street from the garage where everybody who gets married gets interviewed by a radio host and then there is the little person groom at the beginning of the film who gets the last laugh.\n\n\n\nI'd highly recommend it as a great example of a precode film. It has everything - including that macabre scene I mentioned in the title. If anything sticks with you years after you see it, it will be that one scene."}, {"url": "https://www.imdb.com/title/tt0022675/reviews", "page_content": "10 /10\n\nWarning: Spoilers\n\nMusicals hadn't quite come back in fashion but one that certainly helped was \"The Big Broadcast\". Radio favourites had always been popular in the movies (\"Check and Double Check\" (1930) featuring Amos and Andy) even if only for the novelty, so Paramount was excited enough about a movie built around current radio stars to finance the short lived Broadway show \"Wild Waves\" in order to gain screen rights.\n\n\n\nThe slim story about an unreliable radio star was tailor made for Bing Crosby who actually played himself!! Frank Tuttle directed with a breezy comic style, featuring some visual gimmicks such as a black cat stopping in it's tracks and an opening which has radio acts coming to life from lobby photos and singing a few bars of a song which is associated with them. The surrealistic start combines rhythmic sound and action. Crosby, the station's popular star is late again but that doesn't deter Cab Calloway, who launches into the frenetic \"Hot Toddy\". When the station manager goes on the warpath the clock puts on an alarmed face, a black cat melts under a door and Cab Calloway's microphone even jumps along with the swinging beat. Bing is mobbed the instant he arrives and the crush carries him up in the lift and leaves him, lip stick smeared, at the microphone where he only has time for the last line of \"I Surrender, Dear\". This is a terrifically fun movie by the way. He instantly goes to the men's room where he gives a fantastic scat version of \"Dinah\" with the beat of the song provided by the shoe shine boy and his trusty towel and in another scene Bing gives a casual vocal treatment to \"Please\", accompanied by Eddie Lang on guitar - for me two of the movie's highlights.\n\n\n\nThe irate sponsor, Mr. Clapsaddle (George Barbier), gives the order - \"Bing must be sacked\"!!! Even the switchboard operators (a harmonizing trio called \"Major, Sharp and Minor\") get into the act with a Boswell inspired blues number - \"Have You Heard That Bing is Through\". Meanwhile Texas oil millionaire Leslie McWhinney (Stuart Erwin) is crying into his beer because \"a dame has taken him for all his dough\"!! He is in New York to look up the fiancée that left him for the Big City - it is none other than Mr. Burn's (George Burns) efficient secretary (well efficient compared to Gracie) Anita (Leila Hyams). Bing also finds he is unlucky in love - his girl Mona Lowe (a play on the song \"Moanin' Low)(Sharon Lynne) has given him the air and to the strains of street singer Arthur Tracy's rendition of \"Here Lies Love\" he takes McWhinney back to his place. With the \"Crosby Cry\" in full force his rendition of \"Here Lies Love\" soon has McWhinney crying into his pillow and a very weird scene follows when they both decide to end it all but are stopped by the visiting ghost of Arthur Tracy!!!!\n\n\n\nMcWhinney hasn't lost all his money and buys the radio station to give as a wedding present to Anita and Bing. Yes, there is a muddled love triangle going on - Leslie loves Anita who is star struck about Bing but when Mona returns Bing is once again putty in her hands and it is doubtful if he will make it to the big broadcast that night. The radio stars were interspersed with the funny amblings of Leslie, on a night mission to see if he can secure a recording of \"Please\" as a backup in case of a Bing no show!! Definitely the highlights for me were the Mills Brothers performing \"Hold That Tiger\", the Boswell Sisters crazily scatting to \"Crazy People\" and Cab Calloway's zany drug inspired \"Kicking the Gong Around\". Not so pleasant was Kate Smith's very fruity interpretation of \"It Was So Beautiful\". I know she was known as the Songbird of the South but I think Annette Hanshaw's version is so much better. Kate Smith also owed the cameraman no favours and showed why she fared so much better on radio than she did on the movies.\n\n\n\nBing Crosby having just finished a series of two reel Mack Sennett shorts and bringing the same insouciant personality that he seemed to have in real life, fared the best but despite the popularity of the film it was almost five years before a follow up, \"The Big Broadcast of 1936\" was produced."}, {"url": "https://www.kozaksclassiccinema.com/the-big-broadcast-1932/", "page_content": "The Big Broadcast (1932). 80 minutes. Directed by Frank Tuttle. Starring Bing Crosby (as Bing Hornsby), Stuart Erwin (as Leslie McWhinney), Leila Hyams (as Anita Rogers), Sharon Lynn (as Mona Lowe), George Burns (as Mr. Burns), and Gracie Allen (as reception clerk). Featuring musical performances by Cab Calloway, The Mills Brothers, The Boswell Sisters, Vincent Lopez and His Orchestra, Eddie Lang, Donald Novis, Kate Smith, and Arthur Tracy.\n\nFor a modern audience, watching The Big Broadcast—the first installment of the Big Broadcast film series that Paramount produced in the 1930s—is like watching two different movies at once. On the one hand, it can be enjoyed as a nostalgic, even escapist trip through the past: the movie features a plethora of wonderful period musical acts (including Cab Calloway, The Boswell Sisters, and The Mills Brothers) and boasts some delightful vintage comedy in the form of radio stars George Burns and Gracie Allen. But at least as interesting is what makes the movie challenging and sometimes wonderfully unpalatable, including the somewhat surreal meta-comic plot where Bing Crosby essentially plays himself, which involves all of the weirdness that stems from a celebrity participating in a feature-length cameo on screen. The depiction is both celebratory (which we might expect) and oddly unflattering (which comes as more of a surprise): Bing is portrayed both as a magnetic crooner who is mobbed in public by crowds of desirous women and as a chronically late and suicidal loser. As a pre-Code film, The Big Broadcast presents us accordingly with taboo topics such as his attempted suicide and even domestic violence, using a light and humorous touch in treating these subjects that would have found repudiation under the enforcement of the Hollywood Production Code approximately two years later and is in questionable taste even today. Overall, the radio-friendly atmosphere combines with this edginess to form an at times bizarre film that manages to be both above-board and devious at the same time.\n\nIn the film, the habitually late Bing Hornsby misses a broadcast at radio station WADX, where he is employed as a regular performer, and is subsequently fired. He takes his termination in stride because he is getting married the next day to his girlfriend Mona, but he then learns that Mona has run off with another man. In a speakeasy, Bing commiserates with new acquaintance Leslie McWhinney, who has also been jilted, and the two end up at Bing’s apartment, where Bing persuades Leslie to commit suicide with him. Leslie’s ex-girlfriend Anita (who also works at Bing’s former station) checks up on Bing, whom she is enamored with, and prevents the two from being successful in their attempt. Bing begins to date Anita.\n\nMeanwhile, the station manager Mr. Burns learns that WADX is bankrupt, and its assets are seized by the bank. Leslie surprises everyone by buying the station (it turns out that he is secretly a Texas oil tycoon) and by planning a big broadcast that will feature Bing and a cavalcade of stars, including The Boswell Sisters singing “Crazy People,” Cab Calloway performing “Kickin’ the Gong Around,” Kate Smith warbling “It Was So Beautiful,” Donald Novis presenting a musical arrangement of the poem “Trees,” The Mills Brothers singing their hit “Tiger Rag,” and Vincent Lopez and His Orchestra performing a fun percussion-based piece (“Drummer Man”). However, Bing feigns drunkenness on the night of the broadcast and tells Leslie that he is unable to perform; he has also left Anita to reunite with Mona. Leslie frantically scrambles to track down a record of Bing singing that he can use in place of the performer on the air, but his efforts to replace Bing are disastrous. In the nick of time, Bing shows up, bringing about Leslie and Anita’s reconciliation (he has deliberately acted to repel her and bring them back together) and saving the show.\n\nIt is true that the film at times has the feel of a retro compilation of early 1930s’ American radio stars performing their hit material. But far from being a mere relic of earlier times, The Big Broadcast pushes boundaries even in the twenty-first century. For example, the depiction of its protagonist is at times decidedly unpleasant for a mainstream Hollywood film, then or now. Because Bing plays a character referred to throughout by his own unusual first name, the film opens up the possibility for the audience to conflate the Bing we see on screen with the real Bing Crosby, and what we see on screen is not all good. From the very beginning, Bing is shown to be deficient in professionalism: he is chronically late to shows (he completely misses the broadcast in the first scene) and is fired just before the station is shut down. Leslie purchases the station for Anita but wants Bing to run it because the responsibility of doing so, Leslie says, may be just the thing Bing needs to whip him into shape—a contrivance that acknowledges everyone’s favorite crooner lacks maturity and respectability.\n\nThe Big Broadcast is eager to show us Bing’s deficiencies as they apply to romance as well, where he is a cad at best. Bing steals Leslie’s girlfriend Anita, then runs off with Mona without telling her. He also apparently physically assaults Mona before the big broadcast, giving her a black eye, and rather than repent for what he has done, creepily sings “Please” to her in the last scene while making a fist and appearing to threaten her through the glass window of the studio. Moreover, the movie suggests (albeit in a playful fashion) that Bing, whose sexual magnetism on screen is tied to his musical prowess, is not even a skillful singer: Leslie, in his first scene with the crooner, does not recognize Bing and observes that his singing is flat and unaccomplished (“My voice slips like that, too, sometimes,” he remarks). The Big Broadcast is the kind of movie that allows a character to say that to its hallowed star.\n\nBut perhaps none of that is as bewildering as the sustained episode where Bing attempts suicide with Leslie in his apartment during a power outage. To be fair, Leslie is the one who inadvertently introduces the idea of suicide to Bing, but Bing, who is deep in mourning for his lost love Mona, embraces the notion fully and quickly hatches a plan, bringing two funereal candles and pillows into the dark kitchen where they are to do the deed. With a smirk on his face and a near wink in his eye, Bing turns on the stove gas and the two lie back. As if all of this were not sufficiently bizarre, the kitchen radio, which is built into the wall, lights up and metamorphoses into an animated skull. It then changes into Arthur Tracy’s singing head and his disembodied hands, which perform Bing’s hit “Here Lies Love” on the accordion as animated mists from the gas swirl around playfully like spirits from a cartoon. The kitchen scene is reminiscent of the sort of Betty Boop short you might see during the Halloween season; we even hear a slide whistle and the sounds of tinkling bones, which come straight out of the early animation world.\n\nWhen Leslie begins to object to what they are doing and asks to open a window, Bing commands him to lie down—at which point the independent nature of Leslie’s participation seems to diminish and Bing inches closer to being culpable for Leslie’s demise. Without a moment to spare, Anita and a porter that she has summoned appear at the door to check on Bing; they light a match to see better, and a loud explosion follows. No one is hurt, but the scene, up to and including its ending, is exceedingly macabre, presenting a suicide attempt that quickly metamorphoses into a potential act of manslaughter and reckless endangerment yet remains infused with romance, fantasy, and humor. Unbelievably Bing’s own popular music and therefore his personal brand are linked to everything that we see; in the uninhibited times of pre-Code Hollywood, perhaps the risk to Bing’s career posed by the suicide scene seemed less concerning. In any case, the attempt is treated so lightly and Bing’s portrayal is so unsavory that it is hard to imagine the scene would be acceptable in any form under the Hollywood Production Code as it came to be enforced just a few years later, or even today.\n\nThe Big Broadcast remains provocative today due to its bizarre use of radio superstar Bing in these scenes, but one of its most flagrant displays of subversive behavior occurs in Cab Calloway’s performance on the air, where the movie’s pre-Code nature spills into the music studio. Calloway sings “Kickin’ the Gong Around” (a sequel to his well-known “Minnie the Moocher”), and as he narrates a scene full of “cokies” who are “high” and “low” and have run out of “junk” in Chinatown, he appears to actually mime snorting cocaine out of his hand three separate times (pretending to arrange lines of the drug on his palm at one point); he then shudders with his upper torso and wipes his nose. Calloway’s lyrics offer no condemnation of any of the drug users involved in the story that he tells, including his subject Minnie, who herself “kick[s] the gong around” (a euphemism for smoking opium):\n\nIt was down in Chinatown,\n\nAll the cokies laid around—\n\nSome were high and some were mighty low.\n\nThere were millions on the floor\n\nWhen a knock came on the door,\n\nAnd there stood old Smoky Joe.\n\n\n\n\n\nHe was sweatin’, cold and pale,\n\nHe was lookin’ for his frail,\n\nHe was broke and all his junk ran out.\n\nAs he stood and looked around,\n\nNobody made a sound,\n\nAnd then you hear old cokie shout:\n\n\n\nSaying, “Tell me where is Minnie?\n\nI want Minnie!\n\nHas she been here,\n\nKickin’ the gong around?”\n\nThere is something about watching him pretending to participate in the squalid drug use of the scene he narrates in his immaculate white tuxedo with tails that sends the movie right over the edge at that point. His appearance and demeanor while performing, including his signature and slightly surreal dancing, are magnetic and cool, making his behavior—all of it—not only entertaining but invigorating. “Kickin’ the Gong Around” is an unapologetic and brazen contribution to the film, and Calloway’s performance ties with Bing’s suicide scene for the honor of being the weirdest sequence we see.\n\nThe Big Broadcast contains a whole world of pre-Code oddities such as its ethically compromised main character, the bizarre suicide attempt, and Calloway’s simulated snorting, but it also bears the playful sexual hallmarks of wilder cinematic times. For example, although Bing lives alone, nevertheless random women appear in his bathrobe and bedroom; in one scene, Leslie calls Bing’s building manager to complain that Mona has been hiding there, reporting “I just found a girl in our boudoir—is that customary?” In another scene, Anita appears nude in Bing’s shower (discreetly but barely covered up by some well-placed hands and camera work). Bing, who thinks she is really Leslie, reaches over to the shower curtain for a bit of rough play with his friend and through the curtain smacks Anita on the bottom. He then accidentally drops his soap into the shower (while she is still nude behind the curtain) and gropes for it around her legs. In the same scene, Leslie absentmindedly dresses in Anita’s discarded and lacy negligee.\n\nLeslie is not the only one linked to women’s underwear (or cross-dressing) in this film, and what women (and men) are wearing close to their skin comes up in more than one conversation. At the station, when Anita is reading back a note she is writing for Mr. Burns about Bing’s negligent behavior, she stumbles on the line, “During the entire current week, you have been in a neg…,” to which Bing pops in and responds “In a negligee?” It is not surprising that women’s intimates are on his mind as the sponsor of WADX happens to be an underwear brand (the Good Tide Girdle Company). But our attention is drawn to the female anatomy when it is fully clothed as well. When Leslie is describing to Bing how Anita can dance, he implores Bing to “feel how solid she is” (“Where?” Bing asks, bewildered). Leslie then traces his hands over the space above her backside to emphasize how well it moves when she rhumbas. The Big Broadcast does not focus exclusively on sexual gags, either visual or verbal—for movies that are more in that vein, I recommend other pre-Code films such as Murder at the Vanities (1934) or Baby Face (1933)—but they do make for a film that has a free-and-easy way with sexual mores.\n\nThe sexual comedy can come off as risqué, perhaps even vulgar, but elsewhere in the film the humor is less sex-centric and still very funny. For example, the exchanges between Burns and Allen around the radio station have a beautiful comic rhythm. The first time we see Bing is also amusing: he is identified in the streets on his way to the studio by a horde of adoring female fans that attacks him and grasps for his dropped glove as if it were the relic of someone holy. The soundtrack switches to the Yale fight song for the occasion as Bing is smothered with heavy lipstick kisses and mistakenly grabs a lady’s hat to wear back to the studio instead of his own.\n\nThere is also the long sequence where Leslie learns that Bing is drunk and unable to perform (he is only pretending to be drunk), and seeks out a record of Bing singing “Please” to play on the big broadcast in the singer’s absence. As Leslie passes from an apartment building to a record store to the studio lobby, the multiple copies of the record he obtains are obliterated in fantastic ways. (Watching the many, many records destroyed over the course of this sequence, especially the hundreds that drop and shatter in the record shop, may bring some pain to audiophiles.) Interestingly, while Leslie’s journey to the studio has an instrumental soundtrack and notable sound effects, it is filmed as a silent montage, without dialogue, and relies heavily on the use of gesture to convey meaning. The silent-era comedy of the sequence is amusing but also lends a neat structural counterpoint to the sounds of the big broadcast that is taking place simultaneously at the radio station.\n\nIn addition to the clever use (and avoidance of) sound in the final sequence, The Big Broadcast harkens back to the visual ingenuity of artier silent fare as it establishes a playful and energetic atmosphere. For example, when the Good Tide Girdle Company owner complains that Crosby is late to an on-air performance, we see a shot of his hand banging repeatedly on Mr. Burns’s desk. The film cuts from this shot to a shot of what we will learn is Bing’s hand banging on a taxi’s steering wheel horn in a quick transition that keeps us on our feet. The stylish editing is supported by stylish camera work: in the first performance by Cab Calloway’s band, the camera follows the trombone player up and down the length of his instrument, and the string bass is traced from low to high as well. When the camera is focused on Calloway’s conducting, it cranes down and towards him in a moving shot. Later when The Boswell Sisters are seated at a telephone switchboard, we see them in a shot from above, swaying and humming. There is also the angled shot of the record shop owner yelling at Leslie from his apartment over the store, and a long tracking shot of Leslie running along the station hallway on the night of the big broadcast. Many of these shots and transitions are reminiscent of some of the better silent-era European movies from only a few years earlier, and together they combine to make The Big Broadcast a pleasure to watch.\n\nWe might reflect that in spite of the successful comic content, much of the film remains offbeat, even potentially unsettling, but there is at least one way in which Bing’s plotline overcomes its peculiar nature and becomes, in a way, chic—namely, because Bing loses by reuniting with the loathsome Mona in a relationship that is, to say the least, unadmirable. In other films, Bing is typically portrayed as a cool cat crooner who glides through his career with a hip but understated sense of humor, and while he is undoubtedly associated with what would become his characteristic laissez-faire attitude and easygoing demeanor in films such as Holiday Inn (1942) and later White Christmas (1954), The Big Broadcast is willing to commit to the idea of Bing as loser all the way to the end. The result is that Bing appears both radically undesirable and undeniably smooth as he allows the film to poke holes in his celebrity veneer. It is admittedly not a mainstream Hollywood ending, but it is a refreshingly twisted way of appreciating a mega-star at the start of his career."}, {"url": "https://letterboxd.com/film/the-big-broadcast/", "page_content": "The first and the best of the ‘Big Broadcast’ movies.\n\nA grand collection of acts singing with the comedy of Burns&Allen.\n\nWhat held the action together is the backstage view of how a 1932 radio station operated.\n\nBing Crosby in real life liked the idea of recording his shows , he invested in new technologies that allowed him to do the East coast shows live, but play recordings unbeknownst to the other time zones."}, {"url": "https://www.imdb.com/title/tt0029912/reviews", "page_content": "7 /10\n\nWarning: Spoilers\n\nEssentially, a variety show, with the uniting plot theme of a race between 2 ocean liners: the Colossal, and the newer and bigger Gigantic. The race is from NYC to Cherbourg ,France, in about 2 1/2 days. The first third of the film is dominated by the hijinks of Bob Hope(as Buzz Fielding) and especially W.C. Fields, as both T.F. and S.B. Bellows, who own the Gigantic. S.B. is the younger, goofier, brother. T.F. arranges for him to be on the Colossal, so that he can hopefully pull some stunt that will cause it to lose the race. We see T.F only briefly, at the beginning.\n\n\n\nHope begins in jail on a delinquent alimony charge. He's supposed to be the emcee for the variety show to be held on the Gigantic. His 3 ex-wives, as a group, come to see him in jail, but don't offer to bail him out. However, current girlfriend Dorothy(Lamour) does get him released in time to board the liner and take his position. His wives(Shirley Ross, as Cleo, Grace Bradley, as Grace, and Virginia Vale, as Joan) evidently find out about his release and board the ship to try to discourage him from marrying a fourth, who will cut in on their alimony payments(assuming he can make them). Hope has a $50,000. bet on the Gigantic to win, so the ex-wives want to make sure they get a slice of that, if the Gigantic wins.\n\n\n\nMeanwhile, S.B. takes his car to a filling station. A misunderstanding leads to one of his tires overinflating, causing a massive blowout. With just 3 tires, he drives off after tossing his partially used cigar out the window. He knocks over one of the gas pumps on his exit, causing gasoline to spray out on his still lit cigar, resulting in an explosion engulfing the filling station. Ignoring the destruction and probable deaths he has caused, he takes in a round of golf. He has a whole bevy of caddies and irons, and gets around in his specially modified golf bike, with folded wings that stick up from the sides, and a propeller behind. After a series of irregularities in his golf game, he calls it a day, pushes down his folded wings, turns on his propeller and takes off, flying over the ocean toward the 2 liners. He makes a perfect landing on the Gigantic, whether by accident or design. Aboard, S.B. soon causes important mischief when he touches the end of his umbrella to one of the giant coils that powers the radio transmitter, causing a cloud of smoke and sparks.(Why he wasn't killed nor even harmed isn't explained!). This puts the transmitter out of service for a while, which means it can't be used to power the ship(?) past the Colossal, which is well ahead. Later, it's discovered that a piece of the umbrella was touching a coil, shorting out the transmitter. With this removed, the transmitter is again working and begins to greatly accelerate the Gigantic. Later, he would play a game of 'dirty pool', with many irregularities.\n\n\n\nAt about the half way mark, Martha Raye finally makes an appearance. She is one of several survivors of a sunken yacht, and is S.B.'s daughter, with a similar penchant for accidentally causing problems. She used her legendary big mouth to blow the lifeboat sail toward the Gigantic. Aboard, she immediately starts to shatter windows and mirrors with her supposed ugliness. Her biggest contribution to the ongoings was to sing the spritely romantic ditty \"Mama, that Moon is Here Again\", initially mainly to her new beloved: Scoop(Lynn Overmann). While still singing it, she was then tossed and swung around by a bevy of sailors. Later, as part of the big production in which the history of dance is sampled, she would lead a group sing and dance of the exuberant 'Truckin'(They're going Hollywood in Harlem). I could have used more songs and skits featuring Martha. She was such a unique talent.\n\n\n\nAmong the other talents, Shep Fields and his band played a number that included a cartoon segment. Tito Guizar sang a couple of songs, followed by Dorothy Lamour, who serenaded her new found love: Leif Erikson, with the Ralph Rainger and Leo Robin romantic ballad \"You Took the Words Right Out of my Heart\". Later, she would do an encore. Kirsten Flagstad did an excellent rendition of Wagner's \"Brunnhilde's Battle Cry\" Patricia Wilder was supposed to do a little comedy and song act, but it was a nothing. Incidentally, Ben Blue's attempts at comedy stank, as usual.\n\n\n\nRainger and Robin composed the most remembered new song \"Thanks for the Memories\", with Hope and Shirley Ross going back and forth, singing the lyrics, which involve remembering the good times they used to have together....Lastly, a series of old and new songs were sung and danced to in a celebration of various dance forms through history. Pleasant, but unmemorable."}, {"url": "https://immortalephemera.com/12668/lawyer-man-1932-william-powell-joan-blondell/", "page_content": "It was an impassioned courtroom defense made by Lionel Barrymore in A Free Soul (1931) that won him the Academy Award for Best Actor in 1931. Talking pictures are just a natural for lawyers, after all, who can talk like a mouthpiece? In November 1931 Counsellor-at-Law starring Paul Muni as George Simon would open on Broadway and be the longest running play of the season. It'd be made into a film by Universal that was released at the end of 1933. Counsellor at Law, the film (minus the hyphens), replaced Muni with John Barrymore, who also played a lawyer in 1932's State's Attorney at RKO, a movie which credits Gene Fowler as one of the writers.\n\nIn 1931 Fowler had published The Great Mouthpiece , a life of the colorful real-life lawyer, William J. Fallon. Fallon earned hefty fees successfully defending the notorious in cases as dramatic as the films which would follow. He spent big too and became quite popular along the Great White Way, especially with the ladies. The best portrayal of Fallon is Warren William's breakout role in The Mouthpiece, also 1932. From late that same year came Warner Brothers' Lawyer Man, starring William Powell as a fast-talking, leg-loving defender in the Fallon tradition, Anton Adam.\n\nLawyer Man premiered in New York on Christmas Eve, 1932 but didn't go into general release until January 7, 1933. Thus the conflicting release dates you'll see with this title.\n\nIt's interesting to note that very little of Lawyer Man actually takes place in court. The best scenes of The Mouthpiece came inside the courtroom where audiences got to see William's Fallon character, Vince Day, in action molding the law to his own purposes and often shocking his own clients with his brazenness. Lawyer Man, on the other hand, goes out of its way to avoid the courtroom, keeping the focus on the hallways during trials and muting what went on behind the court's closed doors. Lawyer Man, like the title says, is about the man.\n\nAt the start of Lawyer Man defense attorney Anton Adam is a man of the people, bumping shoulders in the crowded Manhattan Streets and taking on charity cases at his East Side offices where his secretary Olga (Joan Blondell) micro-manages his professional life with hopes of taming Adam's private life as well. But Anton loves a pretty girl, his eyes drawn to every pair of shapely legs in their path, leaving the childlike Ogla to huff and puff in frustration whenever Anton is distracted by a new woman.\n\nDespite the seemingly meager setting of Adam's law office he manages to crush well-heeled prosecutor Granville Bentley (Alan Dinehart) in a case and receives a call to come to Bentley's offices for a meeting. While Olga is especially nervous about Bentley's invitation, a reserved Anton arrives, still looking a bit shabby, and is surprised with an offer of a partnership by the uptown lawyer. He's moving on up. The vast Bentley and Adam offices not only have a fantastic view of the city, but they come with legs attached, as Anton is soon in the clutches of Bentley's sister, Babs, played by uptown vamp Helen Vinson.\n\nAfter whipping local political boss Gilmurry (David Landau) in a case, Anton bumps into him in a club and Gilmurry does his best to get Anton to jump over to his side. Anton isn't going for that, but he is going for Claire Dodd, playing actress Ginny St. Johns, an acquaintance of Gilmurry's. Ginny is all over Anton and gets him excited professionally as well when she has him initiate a breach of promise suit for her against a city hall doctor named Gresham (Kenneth Thomson). Gresham's brother is a judge and both men are Gilmurry cronies. Partner Bentley warns Anton to stay away from a case as trashy as this, but Anton, as always, has something to prove and is smitten with Ginny as well, so he's working doubly hard.\n\nSo he's got Joan Blondell making big eyes at him in his office; he's got Helen Vinson playing cat and mouse with him from up above his usual sphere; and he's got Claire Dodd clinging to him out on the town. Poor guy. But it all cracks pretty quick when Dodd's Ginny tells him she wants to drop her case and Gresham, with Ginny's help, records Anton telling her the case is too valuable to drop. Anton is indicted and Bentley dissolves the partnership. Vinson's Babs becomes unreachable. Professionally broken Anton goes begging to Gilmurry who tells him he's a wash-out and he wants no part of him.\n\n\"Everybody's walked out on you but the landlord,\" Blondell says. Anton replies softly to Olga, \"Except you.\" He looks out amongst the people of the city, \"pushing, shoving, trampling each other,\" and declares that \"They made a shyster out of me. Okay. I'll be the biggest, busiest shyster that ever hit this town.\" Anton pushes himself into full Fallon mode, always making sure to grab a sizable cut. Opportunity knocks once more when he has the opportunity to squeeze Gilmurry.\n\nAnton is an interesting character in that no matter how much he gouges his clients it's pretty clear that money is not his primary motivation. Here he differs from the real Fallon and from William's Vince Day, who appear to have worshiped the almighty dollar over all. For William Powell's Anton Adam power is the motivation. What's more, it's an in-your-face kind of power preceded by a cry of \"I'll show you,\" before knuckling down and actually showing them.\n\nWhile Bentley and Babs and Ginny St. Johns will disappear once and for all, and while the relationship with Blondell's Olga is supposed to be the common thread throughout Anton Adam's life and career, I found his uneasy interaction with Gilmurry to be the most interesting facet of Lawyer Man. In another movie Gilmurry would be the strong arm and Adam would be trying to literally save his own skin after double-crossing him. Not in Lawyer Man.\n\nOh sure, Gilmurry has thugs (fresh faced Allen Jenkins and Jack La Rue!), but his meetings with Adam always remain cordial. When Powell's Adam stalls Gilmurry prior to a meeting and Gilmurry enters Adam's office to find him putting together a jigsaw puzzle he isn't insulted, he just kind of smirks. They have their talk, then Gilmurry, looming over Adam's desk casually grabs a piece of the puzzle and puts it in place. It's a nice little touch to show business is business, but these men really don't dislike one another.\n\nYes, Adam and Gilmurry insult each other freely, but neither seems to take the others words too hard, perhaps because they can see the truth in what the other man says. At one point Adam puts the squeeze on Gilmurry for an extra $10,000 in fees. Gilmurry not only pays but makes Adam an offer to come work for him.\n\nGilmurry is played by David Landau, a character actor who appeared in over 30 films from 1931-34. He died in September 1935, age 56. Landau had a long career on the stage prior to coming to Hollywood, which best I can tell began around the turn of the century. He worked in a stock company owned by Charles B. Newhall and married Newhall's daughter, Frances, in 1903. In 1906 Frances convinced her husband to change his name from David Magee to David Landau and from that time going forward Landau's name regularly appears in the dramatic sections of the New York newspapers. His gruff voice and craggy long face made Landau a great villain on the screen for the short time he was able to play on it. In Lawyer Man he's more disreputable than villainous, but he's excellent nonetheless.\n\nLawyer Man is the last of 10 films made featuring hardworking Joan Blondell in 1932. I think you could make the case that Powell's presence looms so largely over Lawyer Man that any actress could have played Olga, but I'm still glad it was Blondell. While Helen Vinson and Claire Dodd just have to make an entrance to get a leading man drooling, the pure and sassy Blondell provides a definite balance and at least one woman to root for in Lawyer Man. The problem is Olga's only goal is Anton and since she works for him she can't be too aggressive about it. She's the voice that's always in his ear, but Anton has to fall down several times before he begins to hear her. Blondell's energy upgrades the role of Olga from a part we'd otherwise forget to someone for us to pull for amongst the muck and corruption surrounding everyone else, including even Anton.\n\nWhile I'd take Vince Day and The Mouthpiece over Anton Adam and Lawyer Man any day, William Powell is still perfect for this part. On the heels of two other pre-code gems for Warner's, Jewel Robbery and One Way Passage (both 1932), Powell continues to be the slick and fast talking leading man that we sometimes forget existed prior to The Thin Man. It may be a bit early for the debonair label which always seems to find him, but Powell, circa 1932, sure is a charmer!\n\nWhen the staid Alan Dinehart proposes a partnership because he's \"not a spellbinder when it comes to juries,\" we know that any mouthpiece William Powell plays is. And again, we barely get to see Powell in the courtroom, but because of who he is, and how confident his Anton Adam is throughout Lawyer Man, we know he would be fantastic in front of any jury. Lionel Barrymore needed that courtroom speech to cop his Oscar for A Free Soul; With Powell the performance is implied.\n\nLawyer Man has been a favorite in my collection of movies for quite some time now. I often watch it back to back with The Mouthpiece, the similarities of which should now be obvious. I've always found both movies underrated and generally overlooked and have wished to see both get the wider audience that comes with a mainstream DVD release for several years now. While I can understand how The Mouthpiece has managed to avoid rediscovery, I can't say the same for Lawyer Man given the presence of two major and perpetually beloved stars in William Powell and Joan Blondell.\n\nFans of movies about lawyers should really check this one out and William Powell fans simply have to see Lawyer Man.\n\nSources:\n\n\"Actor's Widow Bares Poverty.\" Oakland Tribune 24 September 1935: 16.\n\n\"In Other Days.\" Oakland Tribune 13 October 1935: 29.\n\n\"Portrait of a Lawyer.\" Galveston Daily News 11 October 1931: 13.\n\nRelated Links:\n\nThe Great Mouthpiece by Jacob A. Stein in Legal Spectator, April 2003.\n\nLike this: Like Loading..."}, {"url": "https://www.discogs.com/release/4844358-Various-The-Big-Broadcast-1932-1982", "page_content": "A1 Con Charlton – ABC Announcer Con Charlton On First Day Of Transmission 1.7.1932\n\nA2 ABC Military Band – ABC Military Band Conducted By Stephen Yorke\n\nA3 P.P. Eckersley – Writtle Calling By BBC Announcer P.P. Eckersley\n\nA4 Art Leonard – Art Leonard - Banish The Budget Blues\n\nA5 The Rt. Hon. J.A. Lyons* – The Rt. Hon. J.A. Lyons New Year's Message 12.12.1934\n\nA6 Art Leonard – Art Leonard - Lone Girl Flyer\n\nA7 Prince Henry, Duke Of Gloucester – Prince Henry, Duke Of Gloucester, Inauguration Speech Of First Flight Airmail Plane From Australia To England 10.12.1934\n\nA8 Jean Batten – Mascot Airport After Record Breaking Solo Flight From England 13.10.1936\n\nA9 Clem Williams – Let's Take A Trip To Melbourne\n\nA10 Prince Henry, Duke Of Gloucester – Prince Henry, Duke Of Gloucester - Message From King George V For Melbourne Centenary, 1934\n\nA11 No Artist – Big Ben Chimes\n\nA12 H.M. King George V* – H.M. King George V, Silver Jubilee Message To Empire, London, 6.5.1935\n\nA13 Gladys Moncrieff – Love Will Find A Way\n\nA14 Sir John Reith – Death Of H.M. King George V, Announcement By Sir John Reith, London, 21.1.1936\n\nA15 Band Of The Scots Guard* – The Day Thou Gavest Lord Is Ended\n\nA16 The Rt. Hon. J.A. Lyons* – The Rt. Hon. J.A. Lyons: Message To The People Of Australia On The Death Of King George V\n\nA17 Howard Marshall – Announcer Howard Marshall Describes Scenes In London At Time Of Funeral Of King George V, 28.1.1936\n\nA18 Freddy Grisewood – News Bulletin: Germany Re-occupies The Rhineland. Announcer Freddy Grisewood, Hitler 7.3.1936\n\nA19 H.M. King Edward VIII* – Abdication Speech By H.M. King Edward VIII, 11.12.1936\n\nA20 Dame Clara Butt* – Land Of Hope And Glory\n\nA21 Adolf Hitler Richard Strauss – Hitler Announces Opening Of Berlin Olympic Games: Speech Followed By Singing Of Olympic Hymn, Conducted By Richard Strauss, 1.8.1936\n\nA22 The Rt. Hon. William Morris Hughes* – The Rt. Hon. William Morris Hughes Promoting Australia's 150th Anniversary Celebrations, Sydney, 29.10.1937\n\nA23 Donald Bradman* – Cricketer Donald Bradman (Now Sir Donald) After Final Match With Britain For The Ashes, Melbourne, 7.3.1937\n\nA24 Sir Charles Moses – Sir Charles Moses Talks To Dame Lotte Lehmann About Her Visit To Australia To Sing Opera, Perth 24.6.1937\n\nA25 Dame Lotte Lehmann* – Dame Lotte Lehmann - Air De Leonore From Fidelio\n\nA26 Rt. Hon. Neville Chamberlain* – News Bulletin: Rt. Hon. Neville Chamberlain's Visit To Berchtesgaden, Germany To See Hitler, 14.9.1938\n\nA27 Rt. Hon. Neville Chamberlain* – News Bulletin: Rt. Hon. Neville Chamberlain At German Airport After His Meeting With Hitler, Munich, 16.9.1938\n\nA28 The Rt. Hon. Sir Earl Page* – The Rt. Hon. Sir Earl Page Conveys News Of Death Of The Rt. Hon. J.A. Lyons To The Nation, 1939\n\nA29 The Rt. Hon. R.G. Menzies* – The Rt. Hon. R.G. Menzies After Becoming Prime Minister, 1939\n\nA30 No Artist – Patriotic German Song\n\nA31 The Rt. Hon. Neville Chamberlain* – The Rt. Hon. Neville Chamberlain Brings An Assurance Of Peace With Germany At Heston Airport, England, 30.9.1938\n\nA32 Lionel Marson – BBC News Bulletin: Lionel Marson Announces Invasion Of Poland, 1.9.1939\n\nA33 The Rt. Hon. Neville Chamberlain* – BBC News Bulletin: The Rt. Hon. Neville Chamberlain Announces That Britain Is At War With Germany, 3.9.1939\n\nA34 The Rt. Hon. R.G. Menzies* – The Rt. Hon. R.G. Menzies Announces That Australia Is At War With Germany, 3.9.1939\n\nA35 Hitler* – Hitler: Soldiers Marching And Singing\n\nB1 No Artist – On To Victory, War Time Propaganda Music 1940\n\nB2 Colonel Britton – Colonel Britton (Douglas Ritchie) On The V For Victory Call Sign, 31.7.1941\n\nB3 London Philharmonic Orchestra* – London Philharmonic Orchestra - Allegro Con Brio - Beethoven's 5th Symphony In C Minor Op. 67\n\nB4 Charles Gardner – BBC Commentator Charles Gardner On Cliffs Of Dover Describes A 'Dogfight' Between British And German Planes, 14.7.1940\n\nB5 The Rt. Hon. Neville Chamberlain* – The Rt. Hon. Neville Chamberlain: Resignation Speech, 10.5.1940\n\nB6 No Artist – Air Raid Siren\n\nB7 The Rt. Hon. Winston Churchill* – The Rt. Hon. Winston Churchill: 'This Was Their Finest Hour' Speech, 18.6.1940\n\nB8 Vera Lynn – Vera Lynn - The White Cliffs Of Dover\n\nB9 H.R.H. The Princess Elizabeth* Princess Margaret* – H.R.H. The Princess Elizabeth And The Princess Margaret Speak To Children Abroad: Official Broadcast To Empire, 1940\n\nB10 The Rt. Hon. Winston Churchill* – The Rt. Hon. Winston Churchill: Speech In Support Of Australia's War Loan Campaign, 16.4.1941\n\nB11 Lt. Jim Davidson* AIF Entertainment Unit – Fall In Brother (Lt. Jim Davidson, Conductor ABC Dance Band With Vocal Chorus, AIF Entertainment Unit)\n\nB12 Franklin D. Roosevelt – President Franklin D. Roosevelt Asks The US Congress To Declare War On Japan After Pearl Harbour, 1941\n\nB13 The Rt. Hon. John Curtin* – The Rt. Hon. John Curtin Declares War On Japan, 8.12.1941\n\nB14 Lt. Jim Davidson* AIF Entertainment Unit – Who'll Put The 'I' In The AIF (Lt. Jim Davidson, Conductor ABC Dance Band With Vocal Chorus, AIF Entertainment Unit)\n\nB15 The Rt. Hon. John Curtin* – The Rt. Hon. John Curtin Warns The Nation Of Sterner Times Ahead, 8.12.1941\n\nB16 The Rt. Hon. John Curtin* – The Rt. Hon. John Curtin Announces The Fall Of Singapore, 15.2.1942\n\nB17 The Rt. Hon. John Curtin* – The Rt. Hon. John Curtin Speaks To Nation After Japanese Attack On Darwin, 17.2.1942\n\nB18 No Artist – Excerpt From Munition Broadcast 'They Also Serve', 20.11.1942\n\nB19 No Artist – Excerpt From 'They Also Serve', Featuring Female Munitions Worker. Recorded Adelaide, 20.11.1942\n\nB20 Gert And Daisie* – Gert And Daisie (Elise And Doris Waters) - Song Promoting War-time Rationing\n\nB21 Heath Burdock – ABC News Bulletin Read By Heath Burdock, Mass Slaughter Of Jews In Europe, 25.11.1942\n\nB22 No Artist – Air Raid Siren\n\nB23 No Artist – ABC News Bulletin On Progress Of War In The Middle East, 5.12.1942\n\nB24 No Artist – General Montgomery, Private Speech To 8th Army Officers Before El Alamein, 13.8.1942\n\nB25 No Artist – Gunfire, Lilli Marlene Sung In German\n\nB26 Chester Wilmot – ABC War-time Correspondent Chester Wilmot Talks In The Field To 'Popeye', An Australian Soldier At Tobruk\n\nB27 Wilfrid Thomas Jim Davidson (3) ABC Dance Band* – Out Of The Bag, ABC Entertainment Show Featuring Wilfrid Thomas, Jim Davidson And His ABC Dance Band\n\nB28 John Snagge – News Bulletin, BBC Announcer John Snagge Announces D-Day Landings On Normandy Coast, 6.6.1944\n\nB29 Air Commodore Hellmore* – Air Commodore Hellmore Describes Scene From A Mitchell Bomber Over The Normandy Coast, D-Day 6.6.1944\n\nB30 General Dwight D. Eisenhower* – General Dwight D. Eisenhower Reports On D-Day Landings, 6.6.1944\n\nB31 Dick Bentley George Trevare And His Dance Orchestra* – Dick Bentley With George Trevare And His Dance Orchestra - Der Fuehrer's Face\n\nB32 Chester Wilmot – ABC War-time Correspondent Chester Wilmot Describes Crossing Of The Rhine At Riesa By 51st Highland Division, 1945\n\nB33 Unknown Artist – BBC World Service Announcement, Hitler Is Dead, 1.5.1945\n\nB34 Sir Charles Moses – ABC War-time Correspondent, Sir Charles Moses, Account Of the Bombing Of Wessel, Germany 25.3.1945\n\nB35 Gracie Fields – Sing As We Go\n\nB36 Stuart Hibberd – BBC News Bulletin, Stuart Hibberd Announces Berlin Has Fallen, 2.5.1945\n\nB37 Stuart Hibberd – BBC News Bulletin, Stuart Hibberd Announces Cessation Of Hostilities In Europe, 8.5.1945\n\nB38 The Rt. Hon. Winston Churchill* – The Rt. Hon. Winston Churchill Announces The Signing Of Unconditional Surrender To The Allied Expeditionary Force, 8.5.1945\n\nB39 Unknown Artist – Comedy Item From AIF Concert In Tobruk 1941 Referring To the Relief Of The 9th Division\n\nB40 Unknown Artist – ABC News Bulletin: A Complaint About The 'Kid Glove' Treatment Of Nazi Official, Herman Goering, 16.5.1945\n\nB41 Bebe Scott – I'm Very Very Australian\n\nB42 The Rt. Hon. Winston Churchill* – The Rt. Hon. Winston Churchill: Speech To The Nation Concerning War With Japan, 8.5.1945\n\nB43 President Harry S. Truman* – President Harry S. Truman Announces The Dropping Of Atomic Bomb On Hiroshima, 6.8.1945\n\nB44 Chaplain William Downing – Chaplain William Downing Delivers A Prayer For The Safety Of US Pilots Before Dropping Atom Bomb On Hiroshima, 6.8.1945\n\nB45 No Artist – Atom Bomb Explosion\n\nB46 Dame Vera Lynn* – Dame Vera Lynn - When The Lights Go On Again\n\nC1 Reg Neal – Prisoners Of War Return To Adelaide From Singapore. Description By Reg Neal, 21.9.1945\n\nC2 No Artist – Excerpts From Trials Of Nazi War Criminals At Nuremburg, November 1945\n\nC3 Jim Gussey The ABC Dance Band* – ABC Hit Parade - ABC Entertainment Show With Jim Gussey And The ABC Dance Band\n\nC4 Unknown Artist – ABC's First Broadcast From The House Of Representatives, Parliament House, Canberra, 10.7.1946\n\nC5 The Rt. Hon. Winston Churchill* – The Rt. Hon. Winston Churchill: Excerpt From Lecture 'Russia - The Iron Curtain', 5.3.1946\n\nC6 Stafford Dyson – 'Radio Rodeo' ABC Rural Dramatic Series Recorded In South Australia By Stafford Dyson, 28.7.1947\n\nC7 Reg Neal – 'Bee In A Bonnet' ABC Program. Reg Neal Interviews Mrs Catherine King, Presenter Of The Women's Session In WA, 3.6.1947\n\nC8 Mama Reid – Concerto In Jazz - Melbourne 1948\n\nC9 Dr H.V. Evatt – Dr H.V. Evatt, President Of The General Assembly, Announces The Voting On The United Nations Universal Declaration Of Human Rights, 10.12.1948\n\nC10 The Rt. Hon. William Morris Hughes* – The Rt. Hon. William Morris Hughes Talks About The White Australia Policy, 22.4.1949\n\nC11 Dr J.J. Stolz – Arunta Aboriginal Religious Service At Hermannsburg Mission, SA Recorded By Lucien May, 8.8.1951. Interview With Dr J.J. Stolz, President Of The Evangelical Lutheran Church\n\nC12 President Harry S. Truman* – President Harry S. Truman Announces Invasion Of South Korea, June 1950\n\nC13 Dick Bentley Jim Gussey – Dick Bentley And Jim Gussey - 'Gently Bently' - ABC Comedy Program With The ABC Show Band, 14.9.1951\n\nC14 The Rt. Hon. J.B. Chifley* – The Rt. Hon. J.B. Chifley: Election Speech About The Labour Party's Attitude To Communism, 24.4.1951\n\nC15 US Senator J. McCarthy* – US Senator J. McCarthy Talks About Communism, 1952\n\nC16 Governor Adlai Stevenson* President Harry S. Truman* – Governor Adlai Stevenson And President Harry S. Truman Comment On Communism\n\nC17 Big Ben* – Big Ben Chimes\n\nC18 The Rt. Hon. R.G. Menzies* – The Rt. Hon. R.G. Menzies Announces The Death Of King George VI, 6.2.1952\n\nC19 Central Band Of The Royal Australian Air Force* – Recognition Fanfare, Conducted By Wing Commander J.L. Wallace\n\nC20 No Artist – Coronation Of H.M. Elizabeth II, By The Archbishop Of Canterbury In Westminster Abbey, 2.6.1953\n\nC21 Sir Edmund Hilary* – Sir Edmund Hilary Talks About His Successful Climb Of Mt Everest With His Guide Tensing, 1953\n\nC22 Bruce Webber (3) – ABC Announcer Bruce Webber: H.M. Queen Elizabeth II Arrives In Australia, 3.2.1954\n\nC23 No Artist – Response By Woman Spectator Amongst Australian Crowds Welcoming H.M. Queen Elizabeth II, 1954\n\nC24 H.M. Queen Elizabeth II* – H.M. Queen Elizabeth II Talks To the Nation On Arrival In Australia, 1954\n\nC25 Unknown Artist – Operation 'Wombat', Announcement Of First Trial Of Atomic Weapon In Australia, 1955\n\nC26 Fred Hartley And His Players – Fred'The Fred Hartley Show', Announced By Arthur Wyndham, 10.1.1955\n\nC27 H.R.H. The Duke Of Edinburgh – H.R.H. The Duke Of Edinburgh Opens The Olympic Games In Melbourne, 22.11.1956\n\nC28 Betty Cuthbert – Betty Cuthbert Wins Women's 100 Metres At The Melbourne Olympics , 1956\n\nC29 Michael Carlton (2) – ABC Announcer Michael Carlton Announces The Opening Night Of ABC Television In Australia, 2.11.1956\n\nC30 Mac (62) Barbara* Jimmy (103) – 'The Argonauts': ABC Children's Program With Mac, Barbara And Jimmy\n\nC31 Sir Robert Helpmann* – Andrea Talks To Sir Robert Helpmann\n\nC32 J.J. Cahill – Premier Of NSW, J.J. Cahill, Talks About The Opening Of the Opera House, 7.8.1957\n\nC33 Sir Ian Clunies Ross – Excerpt From A Speech By Sir Ian Clunies Ross On The Problem Of Rabbits In Australia, 23.12.1958\n\nC34 Spike Milligan Richard Eisdell – Idiot Weekly: An ABC Comedy Program Featuring Spike Milligan And Michael Eisdell, 30.6.1959\n\nC35 No Artist – Russian Premier Krushchev's Visit To The USA To Meet President Eisenhower, Summer 1959\n\nD1 The Tornados – Telstar\n\nD2 President J.F. Kennedy* – President J.F. Kennedy Talks About Landing A Man On The Moon, 25.5.1961\n\nD3 No Artist – Announcement That Major Yuri Gagarin, A Russian Cosmonaut, Is The First Man In Space, 12.4.1961\n\nD4 Dr Martin Luther King* – Dr Martin Luther King, Black Civil Rights Leader, 28.8.1963\n\nD5 No Artist – An American Reporter Describes The Scene Of The Assassination Of President J.F. Kennedy, 22.11.1963\n\nD6 No Artist – Funeral Ceremony For President J.F. Kennedy, 25.11.1963\n\nD7 The Beatles – Love Me Do\n\nD8 The Rt. Hon. Sir R.G. Menzies* – The Rt. Hon. Sir R.G. Menzies's Speech Of Welcome To H.M. Queen Elizabeth II At Parliament House Reception, Canberra, 19.2.1963\n\nD10 No Artist – Decimal Currency Jingle: Commercial Publicising The Changeover From Sterling To Decimal Currency, 14.2.1966\n\nD11 President Lyndon Johnson* – President Lyndon Johnson's Speech At Luncheon Given In His Honour At Parliament House, Canberra, 21.10.1966\n\nD12 Barry Sadler – The Ballad Of The Green Berets\n\nD13 No Artist – First Public National Service Ballot, 10.3.1965\n\nD14 No Artist – ABC News Bulletin: Disappearance Of The Prime Minister Harold Holt, 18.12.1966\n\nD15 No Artist – 'Bring'Em Home'. Conscientious Objector, Simon Townsend, At A Sydney Anti-Vietnam Demonstration, 1969\n\nD16 Neil Armstrong (2) Edwin Aldrin Michael Collins (2) – Landing Of The First Men On the Moon (Neil Armstrong, Edwin Aldrin And Michael Collins). American Astronauts Talk To Houston, USA, 21.7.1969\n\nD17 Donovan – Universal Soldier\n\nD18 Richard Neville (3) – Richard Neville Talks About 'Playpower' And Youth Culture, 1970\n\nD19 Germaine Greer – Germaine Greer Talks About A Women's Revolution, 19.1.1972\n\nD20 Unknown Artist – 'It's Time': Australian Labor Party Election Campaign Jingle, 1972\n\nD21 The Hon. E.G. Whitlam* – LHoeader Of The Federal Opposition, The Hon. E.G. Whitlam, Delivers Campaign Speech For The ALP, Blacktown Civic Centre, Sydney, 13.11.1972\n\nD22 Richard Combe – 'Pop Scene On A Monday': ABC Pop Music Program With Announcer Richard Combe\n\nD23 President R. Nixon* – President R. Nixon Speaks About Involvement Of His Staff In The Watergate Scandal, 1.5.1973\n\nD24 Paul McCartney – The Long And Winding Road\n\nD25 President R. Nixon* – President R. Nixon Resigns, 9.8.1974\n\nD26 Kevin Chapman (5) – ABC News Bulletin Read By Kevin Chapman: Surrender Of South Vietnam, 30.4.1975\n\nD27 No Artist – Opening Broadcast Of ABC's First Rock Music Station, 2JJ, 19.1.1975\n\nD28 The Rt. Hon. Malcolm Fraser* – The Rt. Hon. Malcolm Fraser Speaks About The Right Of Government To Govern For Three Years, Unless There Are Extraordinary Circumstances, 21.3.1975\n\nD29 The Hon. E.G. Whitlam* – ABC News Bulletin Read By Peter Young: Dismissal Of The Prime Minister, The Hon. E.G. Whitlam By The Governor-General And The Double Dissolution Of Parliament, 11.11.1975\n\nD30 Whitlam* – The Governor-General's Secretary Reads The Proclamation Dissolving Both Houses Of Parliament: Whitlam Responds, 11.11.1975\n\nD31 The Rt. Hon. Malcolm Fraser* – The Rt. Hon. Malcolm Fraser Speaking As Caretaker Prime Minister, 28.11.1975\n\nD32 Skyhooks – Living In The Seventies\n\nD33 Gillian Waite – Opening Broadcast Of the 'Coming Out Show', ABC Women's Program. Announcer Gillian Waite, 8.3.1975\n\nD34 Unknown Artist – Official Announcement From NASA Headquarters In Texas Of Return Of US Spacecraft Skylab To Earth In WA, 1979\n\nD35 Dr Patrick Steptoe – Dr Patrick Steptoe Interview Following Birth Of World's First 'Test-Tube' Baby\n\nD36 No Artist – 'Fanfare' - Broadcast Of The Royal Wedding Ceremony Of H.R.H. The Prince Charles And The Lady Diana Spencer, St Paul's Cathedral, 30.7.1981\n\nD37 Jeff McMullen (6) – ABC Report On The Australian Meat Substitution Scandal: Reporter Jeff McMullen, 13.8.1981\n\nD38 No Artist – Nationalistic Fervour Of Argentinians About The Falklands Islands Crisis, 11.4.1982\n\nD39 The Rt. Hon. Margaret Thatcher* – The Rt. Hon. Margaret Thatcher Announces That There Are 'White Flags' Over Port Stanley, House Of Commons, 15.6.1982\n\nD40 Tracey Wickham – Tracey Wickham Takes Oath For All Competing Athletes At Commonwealth Games, Brisbane, 1982"}, {"url": "https://www.imdb.com/title/tt0023125/reviews", "page_content": "8 /10\n\nWarning: Spoilers\n\nWilliam Powell was a master of the double take. I can't think of any actor who used it more often or better for comic effect. In \"Lawyer Man,\" he must have done a dozen or more double takes. They range from the obvious scene stoppers of a knowing look on his face and turn of the head, to more subtle light pauses with a stern or amusing look as if to catch a breath. We see the first big one in the opening scene when he is stepping out of his office building onto an open market street on New York's East Side.\n\n\n\nAn iceman is delivering a block of ice and is entering the building with it over his shoulder. Powell's character, Anton Adam, says, \"Good morning, Jake. How's the ice business?\" Iceman, \"Not so hot.\" Powell pauses a second and turns his head toward the iceman who has passed him in the doorway. There's no way the audience could miss the humor of the dialog with Powell's double take that allows just enough time for it to sink in. One might say the double take multiplies (doubles) the comedy of the lines.\n\n\n\nThis movie isn't billed as a comedy, and one can see why. It's one of the earliest films about city machine politics and corruption, and shady aspects of a political justice system. But, this drama and crime movie has a good dose of comedy. It's mostly in Powell's character, rather than situations. This is the story about a New York East Side (of the 1930s) lawyer who makes good and moves up to Park Avenue.\n\n\n\nAdam has been in the East Side defending the poor and the down and out for some years. He is well known and liked in the neighborhood, and by the cops and by others in his profession. He then tackles a case that beats the political machinery. That starts him on a rise and track of prominence. After a double-cross by the machine connections, his reputation is hurt among the high-class set. So, he starts over defending low-life criminals and others. But now he takes some shady cases and charges them accordingly. He has become a shyster, in his own words. There's nothing in the film that indicates he did anything illegal himself, but that he was defending a lot of people who were shady operators and getting them off. He wins and builds himself back up.\n\n\n\nWhen he gets appointed assistant district attorney, he comments about being back on the right side of the law. Indeed, Anton Adam's character seems to have high ideals about justice. In a very early scene, he turns down a case from a man who he says must come to justice. When the man leaves and Adam's secretary comes into the office, Adam says of the guy, \"Just a small-time mouse trying to be a big time rat.\"\n\n\n\nJoan Blondell is Olga Michaels, Adam's long-time and faithful secretary and confidant. She's crazy in love with the guy, but keeps her composure, and he doesn't know it until toward the end of the film. Adam has one weakness, which we see in his glances at pretty women. It's likely more in his head than in practice, though, because when he gets with an attractive stage performer, he is shy and awkward.\n\n\n\nOlga knows his weakness, and some of the humor of the film is when she brings him up short for it. An exchange between the two sums up the situation. Olga, \"I worked for a successful man once, and you know why he was a success?\" Anton, \"Sure, because you worked for him.\" Olga, \"No! 'Cause he left the dames alone.\" After the double- cross, Olga says to Anton, \"That's what happens when a smart lawyer gets mixed up with a dumb blonde.\"\n\n\n\nThe supporting cast in \"Lawyer Man\" are all very good. David Landau is especially good as John Gilmurry who runs the local political machine. Alan Dinehart plays Granville Bentley, the Park Avenue attorney whom Adam beats in a big case and who then invites Adam to be his partner. Claire Dodd is very good as Virginia St. Johns and Allen Jenkins plays a usual heavy or hooligan role as Izzy Levine.\n\n\n\nThis is a very good film that most adults should enjoy. Here are a couple more favorite lines from the movie.\n\n\n\nOlga, \"Who's gonna take your case?\" Anton, \"I am. I know. I have a sap for a client.\"\n\n\n\nOlga, \"Remember, I told you about taking these cases against those big uptown lawyers. They got too much pull.\" Anton, \"Yeah, well I got a lot of push.\"\n\n\n\nOn a historical note for younger generations, the iceman was a common site in America before the mid-20th century. In the years before electric refrigerators, the iceman delivered blocks of ice to homes that had iceboxes. The lady of the house would use an ice pick to chip the ice block into pieces to fit in the top of the icebox. The term \"icebox\" continued to be used for decades, referring to the refrigerator. More than a few early crime movies had murders committed with ice picks. I doubt if one could be found in a 21st century home."}, {"url": "https://www.imdb.com/search/title/?year=1932&title_type=feature&", "page_content": "69 min | Drama, Music, Mystery\n\n5.7 Rate this 1 2 3 4 5 6 7 8 9 10 5.7 / 10 X\n\nThirteen years ago, somebody murdered the wealthy host of a dinner party. Now, the guests from that event reunite at the creepy house where the crime took place to figure out who inherited the victim's estate.\n\nDirector: Albert Ray | Stars: Ginger Rogers, Lyle Talbot, J. Farrell MacDonald, Paul Hurst\n\nVotes: 843"}]}