{"Alan Dinehart appeared in more than 200 films between 1915 and 1944, often playing suave, debonair leading men.": [{"url": "https://www.wikiwand.com/en/Alan_Dinehart", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Alan Dinehart?\n\nSummarize this article for a 10 years old"}, {"url": "https://wiki.alquds.edu/?query=Alan_Dinehart", "page_content": "For his second son and former actor, see Mason Alan Dinehart\n\nAmerican actor (1889–1944)\n\nMason Alan Dinehart Sr. (born Harold Alan Dinehart; October 3, 1889 – July 18, 1944) was an American actor, director, writer, and stage manager.\n\nBiography [ edit ]\n\nDinehart initially studied to be a priest, but he turned to the theater instead. His first acting experience came at Missoula University in Montana. He was active in Vaudeville before moving into other areas of entertainment.[1]\n\nHe left school to appear on stage with a repertory company and had no screen experience when he signed a contract with Fox in May 1931. He became a character actor and supporting player in at least eighty-eight films between 1931 and 1944. Earlier, he appeared in more than twenty Broadway plays.\n\nDinehart co-wrote and starred in the Broadway play Separate Rooms, which opened on March 23, 1940 at the Maxine Elliott Theatre and ran for 613 performances.[2]\n\nDinehart's likeness was drawn in caricature by Alex Gard for Sardi's, the New York City theater district restaurant. The picture is now part of the collection of the New York Public Library.[3]\n\nDinehart's second son, Mason Alan Dinehart, was cast in several 1950s television series, including the role of a young Bat Masterson in the ABC/Desilu Studios western, The Life and Legend of Wyatt Earp, starring Hugh O'Brian in the title role.\n\nPersonal life [ edit ]\n\nIn 1936, Dinehart had his name legally changed to Mason Alan Dinehart. He had been baptized Harold Alan Dinehart, but his wife explained that the change would permit their son to be legally named Alan Dinehart III.[4]\n\nDeath [ edit ]\n\nDinehart suffered heart failure and died on 17 July 1944.[citation needed] Some reports stated the cause as a heart attack and the day of death as July 18 at age 54.[5]\n\nSelected filmography [ edit ]"}, {"url": "https://alchetron.com/Alan-Dinehart", "page_content": "Alan Mason Dinehart, Sr. (October 3, 1889 in St. Paul, Minnesota – July 18, 1944, in Hollywood, California) was an American actor, director, writer, and stage manager.\n\nBiography\n\nDinehart initially studied to be a priest, but he turned to the theater instead. His first acting experience came at Missoula University in Montana. He was active in Vaudeville before moving into other areas of entertainment.\n\nHe left school to appear on stage with a repertory company and had no screen experience when he signed a contract with Fox in May 1931. He became a character actor and supporting player in at least eighty-eight films between 1931 and 1944. Earlier, he appeared in more than twenty Broadway plays.\n\nDinehart's likeness was drawn in caricature by Alex Gard for Sardi's, the New York City theater district restaurant. The picture is now part of the collection of the New York Public Library.\n\nDinehart's second son, Mason Alan Dinehart, was cast in several 1950s television series, including the role of a young Bat Masterson in the ABC/Desilu Studios western, The Life and Legend of Wyatt Earp, starring Hugh O'Brian in the title role.\n\nPersonal life\n\nIn 1936, Dinehart had his name legally changed to Mason Alan Dinehart. He had been baptized Harold Alan Dinehart, but his wife explained that the change would permit their son to be legally named Alan Dinehart III.\n\nDeath\n\nDinehart suffered heart failure and died on 17 July 1944. Some reports stated the cause as a heart attack and the day of death as July 18 at age 48."}, {"url": "https://prabook.com/web/alan.dinehart/2554400", "page_content": "Alan Dinehart\n\nActor screenwriter\n\nOctober 3, 1889 (age 54) Saint Paul, Ramsey County, United States of America\n\nDinehart left school to appear on stage with a repertory company and had no screen experience when he signed a contract with Fox in May 1931. He became a character actor and supporting player in at least eighty-eight films between 1931 and 1944. Earlier, he appeared in more than twenty Broadway plays. Dinehart\"s likeness was drawn in caricature by Alex Gard for Sardi\"s, the New York City theater district restaurant. The picture is now part of the collection of the New York Public Library. Dinehart\"s first wife was the stage actress Louise Dyer (1895-1934), a native of Nassau County, New New York In 1933, Dinehart married the film actress Mozelle Britton (May 12, 1912 - May 18, 1953), a native of Oklahoma City, Oklahoma. They are entombed together at Forest Lawn Memorial Park in Glendale, California. Dinehart had two sons: from the first marriage, Alan Dinehart, Junior. (1918-1992), and from the second marriage, Mason Alan Dinehart, aka Alan Dinehart, III, born in Los Angeles in 1936. Mason Alan Dinehart was cast in several 1950s television series, including the role of a young Bat Masterson in the American Broadcasting Company/Desilu Studios western, The Life and Legend of Wyatt Earp, starring Hugh O\"Brian in the title role."}, {"url": "https://www.amazon.com/prime-video/actor/Alan-Dinehart/nm0003062/", "page_content": "Alan Dinehart\n\nTall, heavy-set character actor Alan Dinehart dropped out of school to join a repertory company. He had extensive stage experience (including some 27 appearances on Broadway) and, by the time he was signed by Fox in 1931, he had worked not only as an actor but as a stage manager and writer. On screen he appeared for the most part in \"B\" pictures, notable exceptions being the MGM musical blockbuster Born to Dance (1936) and the 20th Century-Fox classic family drama Rebecca of Sunnybrook Farm (1938). Dinehart specialized in portraying blustering or shifty businessmen, crooked politicians or racketeers. While he is usually described as a supporting player, he actually started out in the early 1930s playing leading roles opposite some of the major female stars of the period.\n\nHowever, Dinehart's characters were rarely sympathetic. In Street of Women (1932) he essayed an architect who, bored with his society wife, indiscreetly keeps a mistress (Kay Francis) on the side. In Supernatural (1933) he was true to form as the phony spiritualist fleecing a wealthy socialite, played by Carole Lombard; and in Jimmy the Gent (1934) he was an urbane con artist in competition with James Cagney. On rarer occasions Alan found gainful employment as more benevolent characters, point in case his theatrical impressario Theodore von Eltz in Dance, Girl, Dance (1933). All of these performances attracted good reviews from Mordaunt Hall of the New York Times, ranging from \"excellent\" to \"bearing up valiantly\".\n\nIn unlikely contrast to his self-styled image of \"Hollywood's most versatile villain\", Dinehart had strong comedic inclinations, co-authoring several comedy plays towards the later stages of his career. The last and most successful of these, \"Separate Rooms\" (1940-1941), with Dinehart top-billed alongside Glenda Farrell and Lyle Talbot, became one of the longest-running non-musical plays on Broadway at the time, finally closing after 613 performances. Alan's son, Mason Alan Dinehart, followed in his father's footsteps and also became an actor, featured in several westerns and on television from the late 1940's."}, {"url": "https://www.liquisearch.com/alan_dinehart", "page_content": "Alan Dinehart\n\nAlan Mason Dinehart, Sr. (born October 3, 1889 in St. Paul, Minnesota - died July 17, 1944, in Hollywood, California), was an American actor, director, writer, and stage manager. He became a character actor and supporting player in at least eighty-eight films between 1931 and 1944. Earlier, he appeared in more than twenty Broadway plays.\n\nHe left school to appear on stage with a repertory company and had no screen experience when he signed a contract with Fox in May 1931.\n\nDinehart's likeness was drawn in caricature by Alex Gard for Sardi's, the New York City theater district restaurant. The picture is now part of the collection of the New York Public Library.\n\nDinehart's first wife was the stage actress Louise Dyer (1895-1934), a native of Nassau County, New York. They were divorced in 1932. In 1933, Dinehart married the film actress Mozelle Britton (May 12, 1912 - May 18, 1953), a native of Oklahoma City, Oklahoma. They are entombed together at Forest Lawn Memorial Park in Glendale, California.\n\nDinehart had two sons: from the first marriage, Alan Dinehart, Jr. (1918-1992), and from the second marriage, Mason Alan Dinehart, aka Alan Dinehart, III, born in Los Angeles in 1936.\n\nMason Alan Dinehart was cast in several 1950s television series, including the role of a young Bat Masterson in the ABC/Desilu Studios western, The Life and Legend of Wyatt Earp, starring Hugh O'Brian in the title role."}, {"url": "https://www.famousbirthdays.com/people/alan-dinehart.html", "page_content": "About\n\nAmerican Broadway and film actor who appeared in more than 20 Broadway plays and 85 pictures including noteworthy works such as Bureau of Missing Persons and Charlie Chan at the Race Track.\n\nBefore Fame\n\nHis first two feature film debuts came in 1931 when he appeared in The Brat and Girls About Town.\n\nTrivia\n\nHe played the role of Bat Masterson in the western television series The Life and Legend of Wyatt Earp.\n\nFamily Life\n\nHe divorced his first wife Louise Dyer Dinehart in 1932 and a year later married Mozelle Britton who he was with until he passed.\n\nAssociated With\n\nHe appeared as Arthur Skinner in the film Sweet Rosie O'Grady which starred Betty Grable as Madeleine Marlowe/Rosie O'Grady."}, {"url": "https://www.broadwayworld.com/people/Alan-Dinehart/", "page_content": "Recommended For You\n\nGet Broadway's #1 Newsletter\n\nGet the best news & discounts for Broadway Shows & beyond."}, {"url": "https://www.rottentomatoes.com/celebrity/allan_dinehart", "page_content": "Log in or sign up for Rotten Tomatoes\n\nContinue with Google\n\nContinue with Email\n\nEmail\n\nNew Where is the password field?\n\nContinue\n\nTrouble logging in?\n\nBy continuing, you agree to the Privacy Policy and the Terms and Policies, and to receive email from Rotten Tomatoes."}, {"url": "https://www.theirbirthdays.com/alan-dinehart", "page_content": "About\n\nAmerican Broadway and film actor who appeared in more than 20 Broadway plays and 85 pictures including noteworthy works such as Bureau of Missing Persons and Charlie Chan at the Race Track.\n\nBefore Fame\n\nHis first two feature film debuts came in 1931 when he appeared in The Brat and Girls About Town.\n\nTrivia\n\nHe played the role of Bat Masterson in the western television series The Life and Legend of Wyatt Earp.\n\nFamily Life\n\nHe divorced his first wife Louise Dyer Dinehart in 1932 and a year later married Mozelle Britton who he was with until he passed.\n\nAssociated With\n\nHe appeared as Arthur Skinner in the film Sweet Rosie O'Grady which starred Betty Grable as Madeleine Marlowe/Rosie O'Grady."}]}