{"Sylvain Barrier (born 28 April 1992) is a French motorcycle racer.": [{"url": "https://www.worldsbk.com/en/rider/Sylvain+Barrier/1594", "page_content": "Barrier joined the WorldSBK paddock at the age of 17, participating in the now defunct FIM Superstock 600 Cup. After picking up three podiums across two seasons, the French rider moved up to the FIM Superstock 1000 Cup, where he truly began to hone his talents. Entering the series in 2008, Barrier finally managed to clinch the title in 2012, becoming a two-time winner the following year.\n\nSuccess in STK1000 earned him a move up to WorldSBK at the end of 2013. However, injuries at the start of the following year – first at the opening round in Australia, followed by a car accident back in France – meant that Barrier was only able to take part in the final six rounds of 2014. An unsuccessful return to STK1000 in 2015 led to another shot at WorldSBK in 2016 with Pedercini Racing; yet injury hit the Frenchman once again, leaving him on the sidelines after just three rounds.\n\nReturning to the championship in 2019 for two wildcard appearances, Barrier will join the series as a full-time entry in 2020 alongside Brixx Performance, competing onboard a Ducati V4 R."}, {"url": "https://www.fimewc.fr/driver/sylvain-barrier", "page_content": "June 13th, 2021\n\nYoshimura SERT Motul triumph at the 24 Heures Motos\n\nThe new Franco-Japanese alliance Yoshimura SERT Motul have clinched a victory in their first outing at the 24 Heures Motos. Suzuki came in ahead of Webike SRC Kawasaki France Trickstar and BMW Motorrad World Endurance Team at Le Mans, the first round of the 2021 FIM EWC. The first Honda and Superstock winner National Motos finished in 5th place."}, {"url": "https://wiki2.org/en/Sylvain_Barrier", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nFrench motorcycle racer\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013.[1][2]\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut[3] in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.[4]\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nYear Bike 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Pos Pts R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 2013 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR POR POR ITA ITA RUS RUS GBR GBR GER GER TUR TUR USA USA FRA FRA SPA\n\n12 SPA\n\n13 31st 7 2014 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR MAL MAL SMR\n\n15 SMR\n\n11 POR\n\n10 POR\n\n11 USA\n\n12 USA\n\nDNS SPA\n\n10 SPA\n\n11 FRA\n\n10 FRA\n\nRet QAT\n\n14 QAT\n\nRet 15th 40 2015 BMW AUS\n\n15 AUS\n\n12 THA\n\n14 THA\n\n13 SPA SPA NED NED ITA ITA GBR GBR POR POR SMR SMR USA USA MAL MAL SPA SPA FRA FRA QAT QAT 28th 10 2016 Kawasaki AUS\n\n15 AUS\n\n15 THA\n\n16 THA\n\n17 SPA\n\n16 SPA\n\nRet NED NED ITA ITA MAL MAL GBR GBR ITA ITA USA USA GER GER FRA FRA SPA SPA QAT QAT 32nd 2\n\nYear Bike 1 2 3 4 5 6 7 8 9 10 11 12 13 Pts R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 2019 Ducati AUS AUS AUS THA THA THA SPA SPA SPA NED NED NED ITA ITA ITA SPA SPA SPA ITA ITA ITA GBR GBR GBR USA USA USA POR\n\n17 POR\n\n18 POR\n\n18 FRA\n\n17 FRA\n\n18 FRA\n\n13 ARG ARG ARG QAT QAT QAT 26th 3 2020 Ducati AUS AUS AUS SPA\n\n16 SPA\n\n21 SPA\n\nRet POR\n\n18 POR\n\n16 POR\n\n15 SPA\n\n12 SPA\n\n18 SPA\n\n16 SPA\n\nRet SPA\n\n19 SPA\n\nRet SPA\n\n18 SPA\n\n15 SPA\n\nRet FRA\n\n13 FRA\n\n13 FRA\n\n12 POR\n\nDNS POR\n\nDNS POR\n\nDNS 20th 12\n\nReferences"}, {"url": "https://peoplepill.com/people/sylvain-barrier/", "page_content": "Sylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2017, he will compete in the MotoAmerica Superbike Championship aboard a BMW S1000RR.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\nYear Make 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Pos. Pts R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 2013 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR POR POR ITA ITA RUS RUS GBR GBR GER GER TUR TUR USA USA FRA FRA SPA\n\n12 SPA\n\n13 31st 7 2014 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR MAL MAL SMR\n\n15 SMR\n\n11 POR\n\n10 POR\n\n11 USA\n\n12 USA\n\nDNS SPA\n\n10 SPA\n\n11 FRA\n\n10 FRA\n\nRet QAT\n\n14 QAT\n\nRet 15th 40 2015 BMW AUS\n\n15 AUS\n\n12 THA\n\n14 THA\n\n13 SPA SPA NED NED ITA ITA GBR GBR POR POR SMR SMR USA USA MAL MAL SPA SPA FRA FRA QAT QAT 28th 10 2016 Kawasaki AUS\n\n15 AUS\n\n15 THA\n\n16 THA\n\n17 SPA\n\n16 SPA\n\nRet NED NED ITA ITA MAL MAL GBR GBR ITA ITA USA USA GER GER FRA FRA SPA SPA QAT QAT 32nd 2"}, {"url": "https://www.howold.co/person/sylvain-barrier/biography", "page_content": "Sylvain Barrier Biography\n\nFrench motorcycle racer\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the *le in 2012, and again in 2013.\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nReferences\n\nExternal links"}, {"url": "https://www.celebsagewiki.com/sylvain-barrier", "page_content": "Age, Biography and Wiki\n\nSylvain Barrier was born on 20 October, 1988 in Oyonnax, France, is a French motorcycle racer. Discover Sylvain Barrier's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 34 years old?\n\nPopular As N/A Occupation N/A Age 34 years old Zodiac Sign Libra Born 20 October 1988 Birthday 20 October Birthplace Oyonnax, France Nationality French\n\nWe recommend you to check the complete list of Famous People born on 20 October. He is a member of famous Racer with the age 34 years old group.\n\nSylvain Barrier Height, Weight & Measurements\n\nAt 34 years old, Sylvain Barrier height not available right now. We will update Sylvain Barrier's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nSylvain Barrier Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Sylvain Barrier worth at the age of 34 years old? Sylvain Barrier’s income source is mostly from being a successful Racer. He is from French. We have estimated Sylvain Barrier's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Racer\n\nSylvain Barrier Social Network\n\nTimeline"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=40760561&lang=en", "page_content": "Sylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013.\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nReferences"}, {"url": "https://depthbio.com/sylvain-barrier/", "page_content": "Sylvain Barrier is a famous French motorcycle racer. He was born on October 20, 1988 and his birthplace is Oyonnax.\n\nOn Depthbio.com, Sylvain is listed as a successful Motorcycle Racer who was born in the year of 1988. He is also ranked in the richest person list from France. His first name is Sylvain and his last name is Barrier.\n\nSylvain Barrier Net Worth: $2 million\n\nCheck out How much Money Does Sylvain Barrier Make?? – Per Year/ Per Month, Latest Income/ Salary, What is Sylvain Barrier Total property value, Source of income, car collection, and How does Sylvain Barrier become So rich?\n\nEstimated Latest Income/Salary\n\nPer Week: $8,000\n\nPer Month: $32,000\n\nPer year: $3,80,000\n\nSylvain Barrier Biography, Wikipedia\n\nQuick Bio of Sylvain Barrier – Wiki, How old Age, Birthday, How tall Height, Body Measurements, Early and Personal Life include Sylvain Barrier Girlfriend/ Boyfriend, Relationship, Affair, Dating, Breakup, rumors, etc.\n\nReal Name Sylvain Barrier Nick Name Gender Male Popular as Motorcycle Racer Profession Motorcycle Racer Nationality France Religion Not Available\n\nSylvain Barrier Age, Birthday\n\nSylvain Barriers birthday is on 20- Oct -1988 and was born on Thursday. Sylvain Barrier is 33 years old. Sylvain Star Sign is Libra and his Birth Flower is Marigold & Cosmos.\n\nDate of Birth October 20, 1988 Place Of Birth Oyonnax Day of Birth Thursday How Old/ Age 33 Birth Sign Libra\n\nSylvain Barrier Height, Body Info\n\nPeople ask how tall is Sylvain Barrier? According to Depthbio Database, Sylvain Barrier height is Not Available.\n\nHeight Not Available Weight Not Available Bust Hip Waist Not Available Hair Color Not Available Eye Color Not Available Horoscope Libra Attraction Straight\n\nSylvain Barrier Wife, Kids, Parents\n\nIs Sylvain Barrier married? How many children does Sylvain Barrier have? Its a commom question. But Sylvain Barrier personal Life is not available to us.\n\nFather Name To be updated Mother Name To be updated Brother Not Available Sister Not Available Husband/ Wife Under Review Son Not Available Daughter Not Available Total Children Not Available Affairs/ Dating Not Available\n\nEarly Life, Education and Facts\n\nSchool will be updated College will be updated University will be updated High Education Not Available Degree Not Available\n\nHow rich is Sylvain Barrier in 2022?\n\nThe estimated net worth of Sylvain Barrier: $2 million dollars. Sylvain Barrier has earned; a good amount of money as a successful Motorcycle Racer. So Sylvain Barriers total Property or net-income is around $2 million.\n\nNet Worth 2022 $2 million Monthly Income $32,000 Annual Income $3,80,000 Source of Income Motorcycle Racer Networth Verification Not verified\n\nSylvain Barrier Social Media\n\nVisit Sylvain Barrier Official Facebook, Twitter, Instagram, Pinterest Profile account and YouTube Blog there is Sylvain Barrier has a lot of fans and followers. We will add Sylvain Barrier Website and other Media Platforms if It is available on the web.\n\nFacebook\n\nTwitter\n\nInstagram\n\nYouTube\n\nWebsite\n\nFrequently Asked Questions\n\nWe have Covered Sylvain Barrier many things and Facts above, but there are some more Faqs mentioned below. If You Find other Information about Sylvain Barrier Life Story to add or update, Please Share in to comment box.\n\nWhen is Sylvain Barrier Birhthday?\n\nOctober 20, 1988\n\nHow old is Sylvain Barrier?\n\n33\n\nWhat is Sylvain Barrier Real Name?\n\nSylvain Barrier\n\nWhat is Sylvain Barrier Religion?\n\nUnder Review\n\nWhat is Sylvain Barriers net worth?\n\nEstimated Net worth $2 million\n\nWhat is Sylvain Barrier Income Source?\n\nSuccessfull Motorcycle Racer\n\nHow much get Sylvain Barrier Salary?\n\nEstimated Salary: Unknown\n\nWhat is his/her Latest News?\n\nUnder Review\n\nWhat is the info Source?\n\nWikipedia, Newspaper, Social Media."}, {"url": "https://buzzlearn.com/sylvain-barrier/", "page_content": "Learn about Sylvain Barrier Net Worth, Biography, Age, Birthday, Height, Early Life, Family, Dating, Partner, Wiki, and Facts.\n\nWho is Sylvain Barrier:\n\nSylvain Barrier is a famous French motorcycle racer. He was born on October 20, 1988 and his birthplace is Oyonnax.\n\nOn Buzzlearn.com, Sylvain is listed as a successful Motorcycle Racer who was born in the year of 1988. He is also ranked in the richest person list from France. His first name is “Sylvain” and his last name is “Barrier”.\n\nBiography:\n\nBio / Wiki Full Name Sylvain Barrier Occupation Motorcycle Racer Age 34 Date of Birth October 20, 1988 Place of Birth Oyonnax Star Sign Libra Country France Gender Male\n\nBirthday, Age & Zodiac Sign:\n\nSylvain Barrier’s birthday is on 20-Oct-1988 and was born on Thursday. He is 34 years old. Sylvain sun sign is Libra and his birth flower is Marigold & Cosmos.\n\nBirthdate 20-Oct Day of Birth Thursday Year of Birth 1988 Birth Sign Libra Birth Sign Duality Assertive Birth Sign Modality & Element Cardinal Air Opposite Sign Aries\n\nHeight, Weight & Physical Stats:\n\nBody measurements informations are given below:\n\nHeight N/A Weight N/A Bust N/A Waist N/A Hip N/A Hair Color N/A Eye Color N/A Shoe Size N/A\n\nEarly Life and Family:\n\nFamily Information Parents Name Not known Spouse Name Not known Children Name Unknown Number of Children(s) Not available Partner Name N/A Relative(s) Name N/A\n\nEducation:\n\nEducation N/A Alma mater N/A University N/A College N/A High School N/A School N/A\n\nSylvain Barrier Net Worth:\n\nSylvain Barrier’s net worth or net income is estimated to be $1 million – $2 million dollars. He has made such an amount of wealth from his primary career as a Motorcycle Racer.\n\nNet Worth $1 million – $2 million Annual Salary Under review Source of Income Motorcycle Racer Verification Status of Wealth Not verified\n\nDead or Alive?\n\nAccording to our database, Sylvain Barrier is still alive.\n\nQuick Facts:\n\nHere are some interesting facts about Sylvain Barrier:\n\n* He is originated from France.\n\n* His Star sign is Libra and zodiac sign element is Air.\n\n* His duality is Assertive and opposite sun sign is Aries.\n\nFrequently Asked Questions (FAQs):\n\nWhy is Sylvain Barrier famous? He is famous for being a successful Motorcycle Racer. Where is he from? He is from France. How tall is he? His height is not available. How much does he earn? His estimated earning is $1 million – $2 million. Is he married? Marital status is not available. How many children(s) does he have? Not available.\n\nReference: Wiki and Newspapers."}, {"url": "https://biogossipy.com/sylvain-barrier/", "page_content": "Sylvain Barrier net worth, birthday, age, height, weight, wiki, fact 2021-22! In this article, we will discover how old is Sylvain Barrier? Who is Sylvain Barrier dating now & how much money does Sylvain Barrier have?\n\nSHORT PROFILE Father Not Available Mother Not Available Siblings Not Available Spouse Not Known Children(s) Not Available\n\nSylvain Barrier Biography\n\nSylvain Barrier is a famous Racer, who was born on October 20, 1988 in France. According to Astrologers, zodiac sign is Libra.\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2018, he will compete in the British Superbike Championship aboard a BMW S1000RR.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nEthnicity, religion & political views\n\nMany peoples want to know what is Sylvain Barrier ethnicity, nationality, Ancestry & Race? Let’s check it out!\n\nAs per public resource, IMDb & Wikipedia, Sylvain Barrier’s ethnicity is Not Known. We will update Sylvain Barrier’s religion & political views in this article. Please check the article again after few days.\n\nSylvain Barrier Net Worth\n\nSylvain Barrier is one of the richest Racer & listed on most popular Racer. According to our analysis, Wikipedia, Forbes & Business Insider, Sylvain Barrier net worth is approximately $1.5 Million.\n\nSylvain Barrier Net Worth & Salary Net Worth $1.5 Million Salary Under Review Source of Income Racer Cars Not Available House Living in own house.\n\nSylvain Barrier Height\n\nSylvain Barrier’s height Not available right now. weight Not Known & body measurements will update soon.\n\nSylvain Barrier Height & Body Stats Height Unknown Weight Not Known Body Measurements Under Review Eye Color Not Available Hair Color Not Available Feet/Shoe Size Not Available\n\nWho is Sylvain Barrier dating?\n\nAccording to our records, Sylvain Barrier is possibily single & has not been previously engaged. As of June 2021, Sylvain Barrier’s is not dating anyone.\n\nRelationships Record: We have no records of past relationships for Sylvain Barrier. You may help us to build the dating records for Sylvain Barrier!\n\nFacts & Trivia\n\nRanked on the list of most popular Racer. Also ranked in the elit list of famous celebrity born in France. Sylvain Barrier celebrates birthday on October 20 of every year.\n\nYou may read full biography about Sylvain Barrier from Wikipedia."}]}