{"Sylvain Barrier moved to the FIM Superstock 1000 Cup in 2011.": [{"url": "https://www.worldsbk.com/en/rider/Sylvain+Barrier/1594", "page_content": "Barrier joined the WorldSBK paddock at the age of 17, participating in the now defunct FIM Superstock 600 Cup. After picking up three podiums across two seasons, the French rider moved up to the FIM Superstock 1000 Cup, where he truly began to hone his talents. Entering the series in 2008, Barrier finally managed to clinch the title in 2012, becoming a two-time winner the following year.\n\nSuccess in STK1000 earned him a move up to WorldSBK at the end of 2013. However, injuries at the start of the following year – first at the opening round in Australia, followed by a car accident back in France – meant that Barrier was only able to take part in the final six rounds of 2014. An unsuccessful return to STK1000 in 2015 led to another shot at WorldSBK in 2016 with Pedercini Racing; yet injury hit the Frenchman once again, leaving him on the sidelines after just three rounds.\n\nReturning to the championship in 2019 for two wildcard appearances, Barrier will join the series as a full-time entry in 2020 alongside Brixx Performance, competing onboard a Ducati V4 R."}, {"url": "https://www.press.bmwgroup.com/global/article/detail/T0132987EN/sylvain-barrier:-champion-on-the-bmw-s-1000-rr", "page_content": "The French rider from the BMW Motorrad Italia GoldBet STK Team wins the 2012 FIM Superstock 1000 Cup.\n\nMagny-Cours, 7th October 2012. Another title win for the BMW S 1000 RR: French rider Sylvain Barrier was crowned champion at the season finale of the 2012 FIM Superstock 1000 Cup at Magny-Cours (FRA). For his BMW Motorrad Italia GoldBet STK Team it was the second title win in three years competing in the series, after the triumphant season with Ayrton Badovini (ITA) back in 2010.\n\nIn the season’s ten races, 23-year old Sylvain celebrated four victories, which was more than any other rider. In total, the Frenchman rode his RR to six podium finishes and claimed seven pole positions. Over the course of the year, he also showed his spirit to never give up. He fought his way back to the top after a setback halfway through the season when he suffered a severe shoulder injury that put him a long way back in his title campaign. At the penultimate round two weeks ago at Portimão (POR), Sylvain retook the lead by finishing the race in second. He arrived with an advantage of three points to his closest rival at the season finale on home soil. At the last race of the year he secured the title by claiming another podium and finishing second. The first to congratulate him straight after the finish line was his mentor, double Superbike world champion James Toseland (GBR).\n\n“I still cannot believe I won the title,” Sylvain enthused. “The hard work done with the team throughout the season has paid off and I want to thank the guys, my family, James, the Clinica Mobile and everyone who supported me during the year. It was a tough race, but I was feeling very comfortable on the bike from the warm-up. I rode very carefully on the first two laps because the rear tyre was not warmed up properly and also Eddi La Marra and Bryan Staring had already crashed. I tried to maintain the gap I had with the following riders and at the same I concentrated on making the tyres work properly and did not push to the limit. It's been a fabulous week-end and I am over the moon!”\n\n“The result achieved today in the FIM Superstock 1000 Cup is amazing,” said Andrea Buzzoni, General Manager BMW Motorrad Italia. “We built on our success from 2010 and won the title again thanks to a very high-level team, a rider of unquestionable talent – who was able to grow and mature even more – and a bike that proved once more to be the best not only in the worldwide market but also on track.”\n\n“We’re extremely happy about Sylvain’s Superstock 1000 Cup title win, especially if we consider the fact that three rounds ago we were 31 points behind in the standings,” commented Serafino Foti, BMW Motorrad Italia GoldBet Superbike Team Sporting Director. “The credit for this achievement goes to all the people who supported us, to our sponsors, to BMW and especially to the team that has done an incredible job. Sylvain brilliantly kept total concentration in both tough and important times and very well deserved the title.”"}, {"url": "https://www.worldsbk.com/en/news/2014/Superstock+1000+Flashback", "page_content": "This season sees the 10th year of FIM Superstock 1000cc Cup competition, and with a new look format and plenty of new faces the prospect of another exciting battle seems inevitable.\n\nSTK1000 racing began in the late 1990’s and initially ran as a European championship before gaining FIM status in 2005.\n\n\n\nBritish riders dominated the first three years with Karl Harris and James Ellison taking the honours. Since then 7 Italians, a Belgian, an Australian and a Frenchman have been victorious with Sylvain Barrier (the Champion in 2012 and 2013) being the only rider since Ellison to defend his crown.\n\n\n\nIn terms of machinery there has been a variety of manufacturers claim the title, but the absence of Kawasaki on the winners list is perhaps somewhat surprising.\n\n\n\nLooking through the list of past winners, it is clear to see why this category proves to be so popular with no less than 5 former champions racing in the 2014 eni FIM Superbike World Championship.\n\n\n\n1999: Karl Harris (Suzuki GSX-R 750) European Championship\n\n2000: James Ellison (Honda CBR 900)\n\n2001: James Ellison (Suzuki GSX-R 1000)\n\n2002: Vittorio Iannuzzo (Suzuki GSX-R 1000)\n\n2003: Michel Fabrizio (Suzuki GSX-R 1000)\n\n2004: Lorenzo Alfonsi (Yamaha YZF R1)\n\n2005: Didier Van Keymeulen (Yamaha YZF R1) FIM Cup\n\n2006: Alex Polita (Suzuki GSX-R 1000)\n\n2007: Niccolò Canepa (Ducati 1098S)\n\n2008: Brendan Roberts (Ducati 1098R)\n\n2009: Xavier Simeon (Ducati 1098R)\n\n2010: Ayrton Badovini (BMW S1000RR)\n\n2011: Davide Giugliano (Ducati 1098R)\n\n2012: Sylvain Barrier (BMW S 1000 RR)\n\n2013: Sylvain Barrier (BMW HP4)\n\n\n\nThis year’s series will be decided over 7 rounds, beginning in Spain at MotorLand Aragon on April 13th."}, {"url": "https://www.press.bmwgroup.com/global/article/detail/T0149869EN/wsbk-debut-for-sylvain-barrier-with-bmw-at-jerez", "page_content": "Superstock champion Sylvain Barrier will ride a third BMW S 1000 RR of the BMW Motorrad GoldBet SBK Team for the season finale at Jerez – Markus Reiterberger takes over his Superstock BMW HP4.\n\n\n\n\n\nMunich/Milano, 9th October 2013. Last weekend at Magny-Cours (FRA), he celebrated an early title defense in the FIM Superstock 1000 Cup and for the next round, he will be promoted to the highest class: BMW factory rider Sylvain Barrier will debut in the FIM Superbike World Championship at the season finale at Spanish Jerez (18th to 20th October). The 24-year old Frenchman will ride a third BMW S 1000 RR of the BMW Motorrad GoldBet SBK Team and join the team’s regular riders Marco Melandri (ITA) and Chaz Davies (GBR).\n\nWith giving him the opportunity to race in the Superbike World Championship, BMW Motorrad thanks Sylvain for the strong performances he showed in the FIM Superstock 1000 Cup, especially for the two titles he has won in the past and the current season. At Jerez, the factory team will enter a third RR in 2013 WSBK spec for Sylvain. His crew will be the same as in the Superstock class with additional support by BMW Motorrad HP RaceSupport.\n\n“This is really great news, I am so excited that BMW has given me the chance to debut in World Superbikes”, said an enthusiastic Sylvain Barrier. “This is the perfect present for my 25th birthday, which I will celebrate on Sunday at Jerez. The years with the BMW Motorrad GoldBet STK Team have been amazing, and for sure, this will be another highlight. It has always been my target to race in World Superbikes and I want to thank BMW for making this reality. I will give my very best to pay BMW back for this great opportunity. I cannot wait to come to Jerez and to jump on the RR!”\n\n“We are happy to offer this opportunity to Sylvain, he more than deserves this”, said Andrea Buzzoni, General Manager BMW Motorrad WSBK. “He’s been with us for three years and we’ve seen him growing up. Last year he had a competitive bike and he made, once more, a winning bike out of it. This year he won another challenge: to make the new BMW HP4, equipped with an innovative electronic damping system, the DDC, a winning bike on its debut. Sylvain developed this system during the season, showing that he is a sensitive tester and, also, able to understand this new technology. And, in addition, he also confirmed he is a fast and talented rider. There’s no doubt that Sylvain is ready to step up to a higher series. We’re happy to offer him the debut in the last race of the season, on the stage of World Superbike.”\n\nIn the FIM Superstock 1000 Cup, the duties on Sylvain’s BMW HP4 will be taken over by another rider who impressed on his BMW this season: Markus Reiterberger will race for the BMW Motorrad GoldBet STK Team at Jerez. The 19-year old German is the man of the year in the International German Motorcycle Championship (IDM). In only his first full season in the series, he celebrated an early title win. In addition, he started as a wild-card entry at the German round of the Superbike World Championship at Nürburgring, scoring points in both races. Reiterberger also has a wealth of experience of riding with BMW in the FIM Superstock 1000 Cup, racing a RR in the series in the 2011 and 2012 seasons."}, {"url": "https://www.worldsbk.com/en/news/2013/Sylvain%20Barrier%20dominates%20STK1000%20Aragon%20race", "page_content": "Sylvain Barrier dominates STK1000 Aragon race\n\nSylvain Barrier concludes the first battle of his FIM Superstock 1000 Cup Title defence campaign in the best way by winning the 12-lap race at Alcaniz MotorLand Aragon. The BMW Motorrad GoldBet rider, after he got the lead from Niccolò Canepa (Barni Racing Ducati) on lap 3 at Turn 16, down the long straight, rode comfortably and kept a pace quick enough not to let the former WSBK rider close the gap.\n\n\n\nBarrier's 6th win in the series completes the perfect weekend for the French youngster, who has proved once again to be the man to beat in 2013, following yesterday's pole position. The STK1000 comeback for Niccolò Canepa proved to be a successful one: the experienced rider from Genova led the early part of the race and tried not to lose contact with Barrier, but the lack of horsepower on the straight didn't help his mission.\n\n\n\n3rd rider on the podium was Argentinian Leandro Mercado (Team Pedercini Kawasaki), back for a full Superstock 1000 with some great confidence shown on track. Wasted opportunity for Jeremy Guarnoni (MRS Kawasaki), who early on during the race was closing the gap with the front but, due to a small mistake that pushed him back to 10th place, was forced to make his way back to a final 4th, snatched from Eddi La Marra (Barni Racing Ducati) on the last lap thanks to an overtaking manoeuvre at Turn 16 - and a 0.040 seconds margin on the finish line.\n\n\n\nPotential podium finisher Lorenzo Savadori (Team Pedercini Kawasaki) lost control of his ZX-10R on lap 7, while he was on 3rd position and closing the gap to the front. Ironically, the Italian has set the new lap record of the Spanish track in 2'01.074, on the third lap."}, {"url": "https://au.motorsport.com/wsbk/news/garnier-racing-jr-superstock-1000-valencia-summary/2893762/", "page_content": "DIFFICULT BEGINNING FOR BLACK AND BARRIER\n\nBoth started well, but unfortunately Gregg Black and Sylvain Barrier did not have much luck later in the first race of the Superstock 1000 FIM Cup in Valencia (Spain). One had to retire because of a technical problem and the other one crashed.\n\nGregg Black started 26th and was quickly 16th after a very good start. He stayed in that position for the first two laps, but his brakes stopped working properly and he had to retire in the pits.\n\nSylvain Barrier started well also, from the 4th position on the front row. After the first lap, he was second behind Claudio Corti (Suzuki). During 9 laps out of 23 he was with the leading group of 5 riders: Corti, Xavier Simeon (Ducati), Maxime Berger (Honda), Javi Fores (Kawasaki) and Sylvain. Unfortunately he crashed on the next lap.\n\nSylvain Barrier: \" The beginning of the race was correct. I had a good start and I was second in the first curve. I was careful because the temperature of the tyres was not hot enough yet. Two riders passed me in the main straight and I went to 4th position. I tried a new line to pass these guys, so a entered a corner wide. But I lost the front on some bumps. It's a shame because I could have finished 4th.\"\n\nGregg Black: \" My start was good, from the 26th to the 16th position. In the second lap, I was closing the gap on Ortega who was in front of me. But on the third lap my front brake was not working properly anymore and I had to retire. Considering that Ortega finished 9th, a top 10 finish would have been possible.\"\n\nMichel Garnier, team owner: \" There is not we can do against the Ducati. Sylvain wanted too much too soon. He should have kept the 5th position. With 3 laps to go, he had a good margin. Gregg retired because of a front brake problem.\"\n\n-credit: grjt"}, {"url": "https://www.thesportsdb.com/player/34172468-Sylvain-Barrier", "page_content": "Motul Portuguese Round (Superpole Race) 09 Aug 2020 Motul Portuguese Round Race 2 09 Aug 2020 Motul Portuguese Round Race 1 08 Aug 2020\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2020, he will compete in the WorldSBK Championship aboard a Ducati Panigale V4 R.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\n\n\nNone found...None Found..."}, {"url": "https://www.beinsports.com/us/motorsports/news/two-time-fim-superstock-1000-champion-sylvain/503492", "page_content": "Dorna Communications\n\nSylvain Barrier, a two-time FIM Superstock 1000 Champion, will be riding a Scheibe Racing BMW S1000RR Superbike in the 2017 MotoAmerica AMA/FIM North American Road Racing Series.\n\nFrenchman Barrier said the deal came about through his connection to BMW Motorrad Motorsport, with whom he won both of his Championships.\n\n“I was in the big show in Milan, EICMA,” the 28-year-old told Roadracingworld.com during the MotoAmerica/Dunlop test at Circuit of The Americas. “I was talking with the big boss of BMW Motorsport in Munich. I was talking with him and he said in the U.S. he had a big opportunity to do the [MotoAmerica], and he had Steve Scheibe doing a team, and it’s quite good. We started to talk. After that, I get in touch with Steve and here we are right now.”\n\nBarrier said he did not start following the racing in America until 2016, when riders he knew like Toni Elias and Claudio Corti started competing in the MotoAmerica series.\n\n“Yeah, for sure, because I know them from Europe. I was curious to see what was going on over here, and it was quite good,” said Barrier. “From last year, [MotoAmerica] get really famous in Europe, like a lot of people were talking about it.”\n\nAs for his test at COTA, Barrier said there was a lot of new things to take in, so he focused on getting comfortable and not trying to do too much too fast.\n\nFinal lap for the #hayesbrakes #scheiberacing bmw #Barrier28 good couple of days of tire testing at #COTA. Full video coming soon. #bmwmotorrad #bmwmotorsport A post shared by Ryan Stephen (@freestylesupermoto) on Mar 30, 2017 at 6:59pm PDT\n\n“Today was the first time on the bike and the first time on the track,” Barrier said, after the first day of the test. “I love the track. Really, I love the track. Also, first time on the U.S. Dunlops. It was quite interesting. There was a lot of things to learn, a lot of things to have sensation with, but it’s ok. Every session we improve. In the last session we put on the new tires, but it’s so easy to get in the air. I wanted to keep my foot on the ground just to be OK. I know I can go faster for sure, easy, but I wasn’t ready to do it today. I just want to take my time. The first days, even the first race is very important [to make] the base really strong to come back more stronger and more faster for the future.”\n\nIn spite of it being his first visit to COTA, his BMW being closer to Superstock than Superbike spec (except for a set of Öhlins forks and Hayes brake calipers), and him not using a qualifying tire at the end of the test, Barrier finished with a best lap time of 2:12.155, which ranked him 13thoverall and ninth among Superbike riders."}, {"url": "https://www.worldsbk.com/en/news/2015/Barrier+joins+Yamaha+in+Superstock+1000", "page_content": "Just two days after it was announced by BMW that Sylvain Barrier had been replaced for the rest of the World Superbike season by Ayrton Badovini, Yamaha has revealed that the Frenchman has joined its assault in Superstock 1000. The new partnership begins with immediate effect, starting in Aragon this weekend.\n\n‘Yamaha is proud to announce that two-time Superstock 1000 Champion Sylvain Barrier has been added to Yamaha’s competitive line-up for the FIM Superstock 1000 Cup, starting this weekend with the opening round at MotorLand Aragón,’ reads a communiqué, issued by Yamaha from the Spanish track on Thursday evening.\n\n‘Barrier will join Michele Magnoni as a full-time rider for the G.M Racing team and is sure to play a key role in further developing the all-new YZF-R1M as Yamaha hunts for glory in the STK1000 series. Though the Frenchman hasn’t tested the YZF-R1M before, his high-level of experience in the Superbike and STK1000 class still makes him a force to be reckoned with.’\n\nThis boosts an already strong field to a total of 35 riders, with Barrier having won the 2013 round of Superstock 1000 at MotorLand.\n\n“I am really happy to be riding with Yamaha,” says 26-year-old Barrier. “It’s a new project for me and it gives me a different kind of energy because I come from Superbike and now I get to try the new YZF-R1M and join a new family. I look forward to getting on the bike. I rode the old YZF-R1 in 2009 for just one year, but I haven’t tried the new one yet, it will be the first time this weekend. I really want to try the new YZF-R1M and I am really excited.\n\n“When I heard I had the opportunity to work together with Yamaha and ride the Italian and Superstock Championship I immediately responded, ‘Yes, I want to’. Now we just need to get on the bike, ride and learn. I won the Superstock race in Aragon in 2013. It was the first race of the year. I like the circuit, it has a nice layout and normally the weather is good there, so it’s quite an enjoyable track.”\n\nBarrier is one of only two riders to have clinched back-to-back Superstock 1000 titles, having achieved the feat in 2012 and 2013. The only other rider to have done so is Britain’s James Ellison, who clinched the crowns of 2000 and 2001."}, {"url": "https://www.wikiwand.com/en/European_Superstock_1000_Championship", "page_content": "The European Superstock 1000 Championship, formerly FIM Superstock 1000 Cup or Superstock 1000 FIM Cup, was a supporting class to the Superbike World Championship.\n\nQuick facts: Sport, Founded, Ceased, Last champion(s)... ▼ European Superstock 1000 Championship Sport Motorcycle sport Founded 1999 Ceased 2018 Last\n\nchampion(s) Markus Reiterberger (rider)\n\nBMW (manufacturer)"}], "Sylvain Barrier finished fourth in the FIM Superstock 1000 Cup in 2011.": [{"url": "https://www.worldsbk.com/en/rider/Sylvain+Barrier/1594", "page_content": "Barrier joined the WorldSBK paddock at the age of 17, participating in the now defunct FIM Superstock 600 Cup. After picking up three podiums across two seasons, the French rider moved up to the FIM Superstock 1000 Cup, where he truly began to hone his talents. Entering the series in 2008, Barrier finally managed to clinch the title in 2012, becoming a two-time winner the following year.\n\nSuccess in STK1000 earned him a move up to WorldSBK at the end of 2013. However, injuries at the start of the following year – first at the opening round in Australia, followed by a car accident back in France – meant that Barrier was only able to take part in the final six rounds of 2014. An unsuccessful return to STK1000 in 2015 led to another shot at WorldSBK in 2016 with Pedercini Racing; yet injury hit the Frenchman once again, leaving him on the sidelines after just three rounds.\n\nReturning to the championship in 2019 for two wildcard appearances, Barrier will join the series as a full-time entry in 2020 alongside Brixx Performance, competing onboard a Ducati V4 R."}, {"url": "https://www.press.bmwgroup.com/global/article/detail/T0132987EN/sylvain-barrier:-champion-on-the-bmw-s-1000-rr", "page_content": "The French rider from the BMW Motorrad Italia GoldBet STK Team wins the 2012 FIM Superstock 1000 Cup.\n\nMagny-Cours, 7th October 2012. Another title win for the BMW S 1000 RR: French rider Sylvain Barrier was crowned champion at the season finale of the 2012 FIM Superstock 1000 Cup at Magny-Cours (FRA). For his BMW Motorrad Italia GoldBet STK Team it was the second title win in three years competing in the series, after the triumphant season with Ayrton Badovini (ITA) back in 2010.\n\nIn the season’s ten races, 23-year old Sylvain celebrated four victories, which was more than any other rider. In total, the Frenchman rode his RR to six podium finishes and claimed seven pole positions. Over the course of the year, he also showed his spirit to never give up. He fought his way back to the top after a setback halfway through the season when he suffered a severe shoulder injury that put him a long way back in his title campaign. At the penultimate round two weeks ago at Portimão (POR), Sylvain retook the lead by finishing the race in second. He arrived with an advantage of three points to his closest rival at the season finale on home soil. At the last race of the year he secured the title by claiming another podium and finishing second. The first to congratulate him straight after the finish line was his mentor, double Superbike world champion James Toseland (GBR).\n\n“I still cannot believe I won the title,” Sylvain enthused. “The hard work done with the team throughout the season has paid off and I want to thank the guys, my family, James, the Clinica Mobile and everyone who supported me during the year. It was a tough race, but I was feeling very comfortable on the bike from the warm-up. I rode very carefully on the first two laps because the rear tyre was not warmed up properly and also Eddi La Marra and Bryan Staring had already crashed. I tried to maintain the gap I had with the following riders and at the same I concentrated on making the tyres work properly and did not push to the limit. It's been a fabulous week-end and I am over the moon!”\n\n“The result achieved today in the FIM Superstock 1000 Cup is amazing,” said Andrea Buzzoni, General Manager BMW Motorrad Italia. “We built on our success from 2010 and won the title again thanks to a very high-level team, a rider of unquestionable talent – who was able to grow and mature even more – and a bike that proved once more to be the best not only in the worldwide market but also on track.”\n\n“We’re extremely happy about Sylvain’s Superstock 1000 Cup title win, especially if we consider the fact that three rounds ago we were 31 points behind in the standings,” commented Serafino Foti, BMW Motorrad Italia GoldBet Superbike Team Sporting Director. “The credit for this achievement goes to all the people who supported us, to our sponsors, to BMW and especially to the team that has done an incredible job. Sylvain brilliantly kept total concentration in both tough and important times and very well deserved the title.”"}, {"url": "https://www.worldsbk.com/en/news/2014/Superstock+1000+Flashback", "page_content": "This season sees the 10th year of FIM Superstock 1000cc Cup competition, and with a new look format and plenty of new faces the prospect of another exciting battle seems inevitable.\n\nSTK1000 racing began in the late 1990’s and initially ran as a European championship before gaining FIM status in 2005.\n\n\n\nBritish riders dominated the first three years with Karl Harris and James Ellison taking the honours. Since then 7 Italians, a Belgian, an Australian and a Frenchman have been victorious with Sylvain Barrier (the Champion in 2012 and 2013) being the only rider since Ellison to defend his crown.\n\n\n\nIn terms of machinery there has been a variety of manufacturers claim the title, but the absence of Kawasaki on the winners list is perhaps somewhat surprising.\n\n\n\nLooking through the list of past winners, it is clear to see why this category proves to be so popular with no less than 5 former champions racing in the 2014 eni FIM Superbike World Championship.\n\n\n\n1999: Karl Harris (Suzuki GSX-R 750) European Championship\n\n2000: James Ellison (Honda CBR 900)\n\n2001: James Ellison (Suzuki GSX-R 1000)\n\n2002: Vittorio Iannuzzo (Suzuki GSX-R 1000)\n\n2003: Michel Fabrizio (Suzuki GSX-R 1000)\n\n2004: Lorenzo Alfonsi (Yamaha YZF R1)\n\n2005: Didier Van Keymeulen (Yamaha YZF R1) FIM Cup\n\n2006: Alex Polita (Suzuki GSX-R 1000)\n\n2007: Niccolò Canepa (Ducati 1098S)\n\n2008: Brendan Roberts (Ducati 1098R)\n\n2009: Xavier Simeon (Ducati 1098R)\n\n2010: Ayrton Badovini (BMW S1000RR)\n\n2011: Davide Giugliano (Ducati 1098R)\n\n2012: Sylvain Barrier (BMW S 1000 RR)\n\n2013: Sylvain Barrier (BMW HP4)\n\n\n\nThis year’s series will be decided over 7 rounds, beginning in Spain at MotorLand Aragon on April 13th."}, {"url": "https://www.thesportsdb.com/player/34172468-Sylvain-Barrier", "page_content": "Motul Portuguese Round (Superpole Race) 09 Aug 2020 Motul Portuguese Round Race 2 09 Aug 2020 Motul Portuguese Round Race 1 08 Aug 2020\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2020, he will compete in the WorldSBK Championship aboard a Ducati Panigale V4 R.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\n\n\nNone found...None Found..."}, {"url": "https://us.motorsport.com/wsbk/news/garnier-racing-jr-superstock-1000-valencia-summary/2893761/", "page_content": "DIFFICULT BEGINNING FOR BLACK AND BARRIER\n\nBoth started well, but unfortunately Gregg Black and Sylvain Barrier did not have much luck later in the first race of the Superstock 1000 FIM Cup in Valencia (Spain). One had to retire because of a technical problem and the other one crashed.\n\nGregg Black started 26th and was quickly 16th after a very good start. He stayed in that position for the first two laps, but his brakes stopped working properly and he had to retire in the pits.\n\nSylvain Barrier started well also, from the 4th position on the front row. After the first lap, he was second behind Claudio Corti (Suzuki). During 9 laps out of 23 he was with the leading group of 5 riders: Corti, Xavier Simeon (Ducati), Maxime Berger (Honda), Javi Fores (Kawasaki) and Sylvain. Unfortunately he crashed on the next lap.\n\nSylvain Barrier: \" The beginning of the race was correct. I had a good start and I was second in the first curve. I was careful because the temperature of the tyres was not hot enough yet. Two riders passed me in the main straight and I went to 4th position. I tried a new line to pass these guys, so a entered a corner wide. But I lost the front on some bumps. It's a shame because I could have finished 4th.\"\n\nGregg Black: \" My start was good, from the 26th to the 16th position. In the second lap, I was closing the gap on Ortega who was in front of me. But on the third lap my front brake was not working properly anymore and I had to retire. Considering that Ortega finished 9th, a top 10 finish would have been possible.\"\n\nMichel Garnier, team owner: \" There is not we can do against the Ducati. Sylvain wanted too much too soon. He should have kept the 5th position. With 3 laps to go, he had a good margin. Gregg retired because of a front brake problem.\"\n\n-credit: grjt"}, {"url": "https://au.motorsport.com/wsbk/news/garnier-racing-jr-superstock-1000-valencia-summary/2893762/", "page_content": "DIFFICULT BEGINNING FOR BLACK AND BARRIER\n\nBoth started well, but unfortunately Gregg Black and Sylvain Barrier did not have much luck later in the first race of the Superstock 1000 FIM Cup in Valencia (Spain). One had to retire because of a technical problem and the other one crashed.\n\nGregg Black started 26th and was quickly 16th after a very good start. He stayed in that position for the first two laps, but his brakes stopped working properly and he had to retire in the pits.\n\nSylvain Barrier started well also, from the 4th position on the front row. After the first lap, he was second behind Claudio Corti (Suzuki). During 9 laps out of 23 he was with the leading group of 5 riders: Corti, Xavier Simeon (Ducati), Maxime Berger (Honda), Javi Fores (Kawasaki) and Sylvain. Unfortunately he crashed on the next lap.\n\nSylvain Barrier: \" The beginning of the race was correct. I had a good start and I was second in the first curve. I was careful because the temperature of the tyres was not hot enough yet. Two riders passed me in the main straight and I went to 4th position. I tried a new line to pass these guys, so a entered a corner wide. But I lost the front on some bumps. It's a shame because I could have finished 4th.\"\n\nGregg Black: \" My start was good, from the 26th to the 16th position. In the second lap, I was closing the gap on Ortega who was in front of me. But on the third lap my front brake was not working properly anymore and I had to retire. Considering that Ortega finished 9th, a top 10 finish would have been possible.\"\n\nMichel Garnier, team owner: \" There is not we can do against the Ducati. Sylvain wanted too much too soon. He should have kept the 5th position. With 3 laps to go, he had a good margin. Gregg retired because of a front brake problem.\"\n\n-credit: grjt"}, {"url": "https://www.beinsports.com/us/motorsports/news/two-time-fim-superstock-1000-champion-sylvain/503492", "page_content": "Dorna Communications\n\nSylvain Barrier, a two-time FIM Superstock 1000 Champion, will be riding a Scheibe Racing BMW S1000RR Superbike in the 2017 MotoAmerica AMA/FIM North American Road Racing Series.\n\nFrenchman Barrier said the deal came about through his connection to BMW Motorrad Motorsport, with whom he won both of his Championships.\n\n“I was in the big show in Milan, EICMA,” the 28-year-old told Roadracingworld.com during the MotoAmerica/Dunlop test at Circuit of The Americas. “I was talking with the big boss of BMW Motorsport in Munich. I was talking with him and he said in the U.S. he had a big opportunity to do the [MotoAmerica], and he had Steve Scheibe doing a team, and it’s quite good. We started to talk. After that, I get in touch with Steve and here we are right now.”\n\nBarrier said he did not start following the racing in America until 2016, when riders he knew like Toni Elias and Claudio Corti started competing in the MotoAmerica series.\n\n“Yeah, for sure, because I know them from Europe. I was curious to see what was going on over here, and it was quite good,” said Barrier. “From last year, [MotoAmerica] get really famous in Europe, like a lot of people were talking about it.”\n\nAs for his test at COTA, Barrier said there was a lot of new things to take in, so he focused on getting comfortable and not trying to do too much too fast.\n\nFinal lap for the #hayesbrakes #scheiberacing bmw #Barrier28 good couple of days of tire testing at #COTA. Full video coming soon. #bmwmotorrad #bmwmotorsport A post shared by Ryan Stephen (@freestylesupermoto) on Mar 30, 2017 at 6:59pm PDT\n\n“Today was the first time on the bike and the first time on the track,” Barrier said, after the first day of the test. “I love the track. Really, I love the track. Also, first time on the U.S. Dunlops. It was quite interesting. There was a lot of things to learn, a lot of things to have sensation with, but it’s ok. Every session we improve. In the last session we put on the new tires, but it’s so easy to get in the air. I wanted to keep my foot on the ground just to be OK. I know I can go faster for sure, easy, but I wasn’t ready to do it today. I just want to take my time. The first days, even the first race is very important [to make] the base really strong to come back more stronger and more faster for the future.”\n\nIn spite of it being his first visit to COTA, his BMW being closer to Superstock than Superbike spec (except for a set of Öhlins forks and Hayes brake calipers), and him not using a qualifying tire at the end of the test, Barrier finished with a best lap time of 2:12.155, which ranked him 13thoverall and ninth among Superbike riders."}, {"url": "https://www.worldsbk.com/en/news/2013/Sylvain%20Barrier%20dominates%20STK1000%20Aragon%20race", "page_content": "Sylvain Barrier dominates STK1000 Aragon race\n\nSylvain Barrier concludes the first battle of his FIM Superstock 1000 Cup Title defence campaign in the best way by winning the 12-lap race at Alcaniz MotorLand Aragon. The BMW Motorrad GoldBet rider, after he got the lead from Niccolò Canepa (Barni Racing Ducati) on lap 3 at Turn 16, down the long straight, rode comfortably and kept a pace quick enough not to let the former WSBK rider close the gap.\n\n\n\nBarrier's 6th win in the series completes the perfect weekend for the French youngster, who has proved once again to be the man to beat in 2013, following yesterday's pole position. The STK1000 comeback for Niccolò Canepa proved to be a successful one: the experienced rider from Genova led the early part of the race and tried not to lose contact with Barrier, but the lack of horsepower on the straight didn't help his mission.\n\n\n\n3rd rider on the podium was Argentinian Leandro Mercado (Team Pedercini Kawasaki), back for a full Superstock 1000 with some great confidence shown on track. Wasted opportunity for Jeremy Guarnoni (MRS Kawasaki), who early on during the race was closing the gap with the front but, due to a small mistake that pushed him back to 10th place, was forced to make his way back to a final 4th, snatched from Eddi La Marra (Barni Racing Ducati) on the last lap thanks to an overtaking manoeuvre at Turn 16 - and a 0.040 seconds margin on the finish line.\n\n\n\nPotential podium finisher Lorenzo Savadori (Team Pedercini Kawasaki) lost control of his ZX-10R on lap 7, while he was on 3rd position and closing the gap to the front. Ironically, the Italian has set the new lap record of the Spanish track in 2'01.074, on the third lap."}, {"url": "https://wikizero.com/www///Sylvain_Barrier", "page_content": "French motorcycle racer\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013.[1][2]\n\nCareer [ edit ]\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut[3] in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.[4]\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics [ edit ]\n\nSuperbike World Championship [ edit ]\n\nRaces by year [ edit ]\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nYear Bike 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Pos Pts R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 2013 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR POR POR ITA ITA RUS RUS GBR GBR GER GER TUR TUR USA USA FRA FRA SPA\n\n12 SPA\n\n13 31st 7 2014 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR MAL MAL SMR\n\n15 SMR\n\n11 POR\n\n10 POR\n\n11 USA\n\n12 USA\n\nDNS SPA\n\n10 SPA\n\n11 FRA\n\n10 FRA\n\nRet QAT\n\n14 QAT\n\nRet 15th 40 2015 BMW AUS\n\n15 AUS\n\n12 THA\n\n14 THA\n\n13 SPA SPA NED NED ITA ITA GBR GBR POR POR SMR SMR USA USA MAL MAL SPA SPA FRA FRA QAT QAT 28th 10 2016 Kawasaki AUS\n\n15 AUS\n\n15 THA\n\n16 THA\n\n17 SPA\n\n16 SPA\n\nRet NED NED ITA ITA MAL MAL GBR GBR ITA ITA USA USA GER GER FRA FRA SPA SPA QAT QAT 32nd 2\n\nYear Bike 1 2 3 4 5 6 7 8 9 10 11 12 13 Pts R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 2019 Ducati AUS AUS AUS THA THA THA SPA SPA SPA NED NED NED ITA ITA ITA SPA SPA SPA ITA ITA ITA GBR GBR GBR USA USA USA POR\n\n17 POR\n\n18 POR\n\n18 FRA\n\n17 FRA\n\n18 FRA\n\n13 ARG ARG ARG QAT QAT QAT 26th 3 2020 Ducati AUS AUS AUS SPA\n\n16 SPA\n\n21 SPA\n\nRet POR\n\n18 POR\n\n16 POR\n\n15 SPA\n\n12 SPA\n\n18 SPA\n\n16 SPA\n\nRet SPA\n\n19 SPA\n\nRet SPA\n\n18 SPA\n\n15 SPA\n\nRet FRA\n\n13 FRA\n\n13 FRA\n\n12 POR\n\nDNS POR\n\nDNS POR\n\nDNS 20th 12"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=40760561&lang=en", "page_content": "Sylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013.\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nReferences"}]}