{"Sylvain Barrier began his career in the French 125cc Championship in 2006.": [{"url": "https://www.press.bmwgroup.com/global/article/detail/T0133091EN/bmw-motorrad-italia-goldbet-sbk-team-sylvain-barrier-2012-fim-superstock-1000-cup-champion", "page_content": "French rider Sylvain Barrier was crowned champion at the season finale of the 2012 FIM Superstock 1000 Cup at Magny-Cours (FRA). For his BMW Motorrad Italia GoldBet SBK Team it was the second title win in three years competing in the series, after the triumphant season with Ayrton Badovini (ITA) back in 2010.\n\nIn the season’s ten races, 23-year old Sylvain celebrated four victories, which was more than any other rider. In total, the Frenchman rode his BMW S 1000 RR to six podium finishes and claimed seven pole positions. Over the course of the year, he also showed his spirit to never give up. He fought his way back to the top after a setback halfway through the season when he suffered a severe shoulder injury that put him a long way back in his title campaign. At the penultimate round two weeks ago at Portimão (POR), Sylvain retook the lead by finishing the race in second. He arrived with an advantage of three points to his closest rival at the season finale on home soil. At the last race of the year he secured the title by claiming another podium and finishing second. The first to congratulate him straight after the finish line was his mentor, double Superbike world champion James Toseland (GBR).\n\n“I still cannot believe I won the title,” Sylvain enthused. “The hard work done with the team throughout the season has paid off and I want to thank the guys, my family, James, the Clinica Mobile and everyone who supported me during the year. It was a tough race, but I was feeling very comfortable on the bike from the warm-up. I rode very carefully on the first two laps because the rear tyre was not warmed up properly and also Eddi La Marra and Bryan Staring had already crashed. I tried to maintain the gap I had with the following riders and at the same I concentrated on making the tyres work properly and did not push to the limit. It's been a fabulous week-end and I am over the moon!”\n\n“The result achieved today in the FIM Superstock 1000 Cup is amazing,” said Andrea Buzzoni, General Manager BMW Motorrad Italia. “We built on our success from 2010 and won the title again thanks to a very high-level team, a rider of unquestionable talent – who was able to grow and mature even more – and a bike that proved once more to be the best not only in the worldwide market but also on track.”\n\n“We’re extremely happy about Sylvain’s Superstock 1000 Cup title win, especially if we consider the fact that three rounds ago we were 31 points behind in the standings,” commented Serafino Foti, BMW Motorrad Italia GoldBet Superbike Team Sporting Director. “The credit for this achievement goes to all the people who supported us, to our sponsors, to BMW and especially to the team that has done an incredible job. Sylvain brilliantly kept total concentration in both tough and important times and very well deserved the title.”"}, {"url": "https://www.fimewc.com/driver/sylvain-barrier", "page_content": "June 13th, 2021\n\nYoshimura SERT Motul triumph at the 24 Heures Motos\n\nThe new Franco-Japanese alliance Yoshimura SERT Motul have clinched a victory in their first outing at the 24 Heures Motos. Suzuki came in ahead of Webike SRC Kawasaki France Trickstar and BMW Motorrad World Endurance Team at Le Mans, the first round of the 2021 FIM EWC. The first Honda and Superstock winner National Motos finished in 5th place."}, {"url": "https://www.thesportsdb.com/player/34172468-Sylvain-Barrier", "page_content": "Motul Portuguese Round (Superpole Race) 09 Aug 2020 Motul Portuguese Round Race 2 09 Aug 2020 Motul Portuguese Round Race 1 08 Aug 2020\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2020, he will compete in the WorldSBK Championship aboard a Ducati Panigale V4 R.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\n\n\nNone found...None Found..."}, {"url": "https://peoplepill.com/people/sylvain-barrier/", "page_content": "Sylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2017, he will compete in the MotoAmerica Superbike Championship aboard a BMW S1000RR.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\nYear Make 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Pos. Pts R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 2013 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR POR POR ITA ITA RUS RUS GBR GBR GER GER TUR TUR USA USA FRA FRA SPA\n\n12 SPA\n\n13 31st 7 2014 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR MAL MAL SMR\n\n15 SMR\n\n11 POR\n\n10 POR\n\n11 USA\n\n12 USA\n\nDNS SPA\n\n10 SPA\n\n11 FRA\n\n10 FRA\n\nRet QAT\n\n14 QAT\n\nRet 15th 40 2015 BMW AUS\n\n15 AUS\n\n12 THA\n\n14 THA\n\n13 SPA SPA NED NED ITA ITA GBR GBR POR POR SMR SMR USA USA MAL MAL SPA SPA FRA FRA QAT QAT 28th 10 2016 Kawasaki AUS\n\n15 AUS\n\n15 THA\n\n16 THA\n\n17 SPA\n\n16 SPA\n\nRet NED NED ITA ITA MAL MAL GBR GBR ITA ITA USA USA GER GER FRA FRA SPA SPA QAT QAT 32nd 2"}, {"url": "https://www.howold.co/person/sylvain-barrier/biography", "page_content": "Sylvain Barrier Biography\n\nFrench motorcycle racer\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the *le in 2012, and again in 2013.\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nReferences\n\nExternal links"}, {"url": "https://www.visordown.com/news/racing/wsb/sylvain-barrier-swaps-bsb-worldsbk-tilt-ducati", "page_content": "Sylvain Barrier returns to the World Superbike Championship ranks this weekend at Portimao after abandoning initial plans to compete in the British Superbike Championship.\n\nA two-time champion in the now defunct FIM Superstock 1000, Barrier began the 2019 season in the British series riding a new Ducati Panigale V4 R under the Brixx Racing banner.\n\nHowever, the team hasn’t started a BSB race since round four and instead re-emerged during August’s WorldSBK test at Portimao with the bike now conforming to the world championship regulations to allow it to race there.\n\nAs such, Barrier will be on the grid in Portimao, raising the Ducati contingent to five alongside the factory Aruba.it machines of Alvaro Bautista and Chaz Davies, Eugene Laverty on the Go Eleven bike and Barni Racing’s Michael Ruben Rinaldi.\n\nBarrier – whose career has been beset by injuries since winning back-to-back SSTK1000 titles in 2012 and 2013 - has previously raced in WorldSBK but not since 2016 when he competed with the Pedercini Kawasaki team.\n\nPortimao WorldSBK Schedule\n\nWorldSBK Acerbis Portuguese Round, Autódromo Internacional do Algarve Event Schedule (GMT +0) Friday 6 September 9:00 - 9:30 WorldSSP 300 FP1 (Group A) 9:45 - 10:15 WorldSSP 300 FP1 (Group B) 10:30 - 11:20 WorldSBK FP1 11:30 - 12:15 WorldSSP FP1 13:30 - 14:00 WorldSSP 300 FP2 (Group A) 14:15 - 14:45 WorldSSP 300 FP2 (Group B) 15:00 - 15:50 WorldSBK FP2 16:00 - 16:45 WorldSSP FP2 Saturday 7 September 09:00 - 9:20 WorldSBK FP3 09:30 - 09:50 WorldSSP FP3 10:00 - 10:15 WorldSSP 300 FP3 (Group A) 10:25 - 10:40 WorldSSP 300 FP3 (Group B) 11:00 - 11:25 WorldSBK Superpole 11:40 - 12:05 WorldSSP Superpole 12:20 - 12:40 WorldSSP 300 Superpole (Group A) 12:50 - 13:10 WorldSSP 300 Superpole (Group B) 14:00 WorldSBK RACE 1 15:15 WorldSSP 300 Last Chance Race Sunday 8 September 09:00 - 09:15 WorldSBK Warm-up 09:25 - 09:40 WorldSSP Warm-up 09:50 - 10:05 WorldSSP 300 Warm-up 11:00 WorldSBK SUPERPOLE RACE 12:15 WorldSSP RACE 14:00 WorldSBK RACE 2 15:15 WorldSSP 300 RACE"}, {"url": "https://www.press.bmwgroup.com/global/article/detail/T0132987EN/sylvain-barrier:-champion-on-the-bmw-s-1000-rr", "page_content": "The French rider from the BMW Motorrad Italia GoldBet STK Team wins the 2012 FIM Superstock 1000 Cup.\n\nMagny-Cours, 7th October 2012. Another title win for the BMW S 1000 RR: French rider Sylvain Barrier was crowned champion at the season finale of the 2012 FIM Superstock 1000 Cup at Magny-Cours (FRA). For his BMW Motorrad Italia GoldBet STK Team it was the second title win in three years competing in the series, after the triumphant season with Ayrton Badovini (ITA) back in 2010.\n\nIn the season’s ten races, 23-year old Sylvain celebrated four victories, which was more than any other rider. In total, the Frenchman rode his RR to six podium finishes and claimed seven pole positions. Over the course of the year, he also showed his spirit to never give up. He fought his way back to the top after a setback halfway through the season when he suffered a severe shoulder injury that put him a long way back in his title campaign. At the penultimate round two weeks ago at Portimão (POR), Sylvain retook the lead by finishing the race in second. He arrived with an advantage of three points to his closest rival at the season finale on home soil. At the last race of the year he secured the title by claiming another podium and finishing second. The first to congratulate him straight after the finish line was his mentor, double Superbike world champion James Toseland (GBR).\n\n“I still cannot believe I won the title,” Sylvain enthused. “The hard work done with the team throughout the season has paid off and I want to thank the guys, my family, James, the Clinica Mobile and everyone who supported me during the year. It was a tough race, but I was feeling very comfortable on the bike from the warm-up. I rode very carefully on the first two laps because the rear tyre was not warmed up properly and also Eddi La Marra and Bryan Staring had already crashed. I tried to maintain the gap I had with the following riders and at the same I concentrated on making the tyres work properly and did not push to the limit. It's been a fabulous week-end and I am over the moon!”\n\n“The result achieved today in the FIM Superstock 1000 Cup is amazing,” said Andrea Buzzoni, General Manager BMW Motorrad Italia. “We built on our success from 2010 and won the title again thanks to a very high-level team, a rider of unquestionable talent – who was able to grow and mature even more – and a bike that proved once more to be the best not only in the worldwide market but also on track.”\n\n“We’re extremely happy about Sylvain’s Superstock 1000 Cup title win, especially if we consider the fact that three rounds ago we were 31 points behind in the standings,” commented Serafino Foti, BMW Motorrad Italia GoldBet Superbike Team Sporting Director. “The credit for this achievement goes to all the people who supported us, to our sponsors, to BMW and especially to the team that has done an incredible job. Sylvain brilliantly kept total concentration in both tough and important times and very well deserved the title.”"}, {"url": "https://www.celebsagewiki.com/sylvain-barrier", "page_content": "Age, Biography and Wiki\n\nSylvain Barrier was born on 20 October, 1988 in Oyonnax, France, is a French motorcycle racer. Discover Sylvain Barrier's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 34 years old?\n\nPopular As N/A Occupation N/A Age 34 years old Zodiac Sign Libra Born 20 October 1988 Birthday 20 October Birthplace Oyonnax, France Nationality French\n\nWe recommend you to check the complete list of Famous People born on 20 October. He is a member of famous Racer with the age 34 years old group.\n\nSylvain Barrier Height, Weight & Measurements\n\nAt 34 years old, Sylvain Barrier height not available right now. We will update Sylvain Barrier's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nSylvain Barrier Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Sylvain Barrier worth at the age of 34 years old? Sylvain Barrier’s income source is mostly from being a successful Racer. He is from French. We have estimated Sylvain Barrier's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Racer\n\nSylvain Barrier Social Network\n\nTimeline"}, {"url": "https://www.motorsport.com/driver/sylvain-barrier/20633/", "page_content": "1 This is tracking: With information stored on your device ( for example cookies ), we and our partners can personalize advertisements and content based on your usage profile and / or measure the performance of advertisements and content. From this data, we derive knowledge about usage behavior and preferences in order to optimize content and advertisements.\n\nSave and / or retrieve information on a device\n\nMeasure ad performance\n\nEnsure security, prevent fraud and correct errors\n\nChoosing simple ads\n\nMeasure content performance\n\nProvide advertisements or content technically\n\nCreate a personalized ad profile\n\nUse market research to gain insights about target groups\n\nMerge with offline data sources\n\nSelect personalized ads\n\nDevelop and improve products\n\nLink different devices\n\nCreate a personalized content profile\n\nUse accurate location data\n\nReceive and use automatically sent device properties for identification\n\nSelect personalized content\n\nActively query device properties for identification"}, {"url": "https://alchetron.com/Sylvain-Barrier", "page_content": "Sylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2017, he will compete in the MotoAmerica Superbike Championship aboard a BMW S1000RR.\n\nContents\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nInterview sylvain barrier\n\n"}], "Sylvain Barrier moved to the European Superstock 600 Championship in 2008.": [{"url": "https://www.worldsbk.com/en/rider/Sylvain+Barrier/1594", "page_content": "Barrier joined the WorldSBK paddock at the age of 17, participating in the now defunct FIM Superstock 600 Cup. After picking up three podiums across two seasons, the French rider moved up to the FIM Superstock 1000 Cup, where he truly began to hone his talents. Entering the series in 2008, Barrier finally managed to clinch the title in 2012, becoming a two-time winner the following year.\n\nSuccess in STK1000 earned him a move up to WorldSBK at the end of 2013. However, injuries at the start of the following year – first at the opening round in Australia, followed by a car accident back in France – meant that Barrier was only able to take part in the final six rounds of 2014. An unsuccessful return to STK1000 in 2015 led to another shot at WorldSBK in 2016 with Pedercini Racing; yet injury hit the Frenchman once again, leaving him on the sidelines after just three rounds.\n\nReturning to the championship in 2019 for two wildcard appearances, Barrier will join the series as a full-time entry in 2020 alongside Brixx Performance, competing onboard a Ducati V4 R."}, {"url": "https://www.thesportsdb.com/player/34172468-Sylvain-Barrier", "page_content": "Motul Portuguese Round (Superpole Race) 09 Aug 2020 Motul Portuguese Round Race 2 09 Aug 2020 Motul Portuguese Round Race 1 08 Aug 2020\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013. In 2020, he will compete in the WorldSBK Championship aboard a Ducati Panigale V4 R.\n\nHe has raced in the championship since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his World Superbike Championship debut. in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\n\n\nNone found...None Found..."}, {"url": "https://www.worldsbk.com/en/news/2010/Garnier%20Team%20discloses%202010%20Superstock%20plans", "page_content": "Garnier Team discloses 2010 Superstock plans\n\nThe Garnier Racing Team Junior is based in Brazey en Plaine, in Burgundy, France, and was created at the beginning of 2009 by entrepreneur Michel Garnier.\n\n\n\nIts new purpose is to enter Sylvain Barrier and Michaël Savary in the 2010 Superstock 1000 FIM Cup - on BMW equipment this time.\n\n\n\nIn 2009, the team finished fifth overall and first of the Yamahas with Barrier, and it was also the best French team. This season, the Garnier Racing Team Junior is racing with BMW S1000RR, which is proving to be a popular machine with privateers.\n\n\n\nMichel Garnier, the team owner explained his 2010 plans. \"Our goal for the 2009 season was to be in the top five with Sylvain Barrier. We achieved that. 2010 is an important year for me and my team; with newcomers Alex Chantraine, David Illescat and Nicolas Petit who are professional technicians well known in the racing community. Our team is very motivated to take our two young riders to the highest level of the championship. We are discovering the BMW S 1000RR, which is a very promising motorcycle, but still unknown to us. But we are confident. The team is still looking for sponsors. I would like to thank my friends, my partners and the people supporting us in this great adventure. Thank you everybody.\"\n\n\n\nSylvain Barrier was born on October 20, 1988, in Oyonnax, France, and in 2009, he finished overall fifth in the championship, with three podiums at Misano, Assen and Magny-Cours.\n\n\n\nMichaël Savary was born on September 15, 1987 at Sedeilles in Switzerland. He finished seventh in the European Superstock 600 Championship in 2006, and then eighth in 2007. He started in Superstock 1000 the following year and finished 19th of the FIM Cup. In 2009, he was 11th."}, {"url": "https://www.celebsagewiki.com/sylvain-barrier", "page_content": "Age, Biography and Wiki\n\nSylvain Barrier was born on 20 October, 1988 in Oyonnax, France, is a French motorcycle racer. Discover Sylvain Barrier's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 34 years old?\n\nPopular As N/A Occupation N/A Age 34 years old Zodiac Sign Libra Born 20 October 1988 Birthday 20 October Birthplace Oyonnax, France Nationality French\n\nWe recommend you to check the complete list of Famous People born on 20 October. He is a member of famous Racer with the age 34 years old group.\n\nSylvain Barrier Height, Weight & Measurements\n\nAt 34 years old, Sylvain Barrier height not available right now. We will update Sylvain Barrier's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nSylvain Barrier Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Sylvain Barrier worth at the age of 34 years old? Sylvain Barrier’s income source is mostly from being a successful Racer. He is from French. We have estimated Sylvain Barrier's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Racer\n\nSylvain Barrier Social Network\n\nTimeline"}, {"url": "https://www.howold.co/person/sylvain-barrier/biography", "page_content": "Sylvain Barrier Biography\n\nFrench motorcycle racer\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the *le in 2012, and again in 2013.\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nReferences\n\nExternal links"}, {"url": "https://www.press.bmwgroup.com/global/article/detail/T0132987EN/sylvain-barrier:-champion-on-the-bmw-s-1000-rr", "page_content": "The French rider from the BMW Motorrad Italia GoldBet STK Team wins the 2012 FIM Superstock 1000 Cup.\n\nMagny-Cours, 7th October 2012. Another title win for the BMW S 1000 RR: French rider Sylvain Barrier was crowned champion at the season finale of the 2012 FIM Superstock 1000 Cup at Magny-Cours (FRA). For his BMW Motorrad Italia GoldBet STK Team it was the second title win in three years competing in the series, after the triumphant season with Ayrton Badovini (ITA) back in 2010.\n\nIn the season’s ten races, 23-year old Sylvain celebrated four victories, which was more than any other rider. In total, the Frenchman rode his RR to six podium finishes and claimed seven pole positions. Over the course of the year, he also showed his spirit to never give up. He fought his way back to the top after a setback halfway through the season when he suffered a severe shoulder injury that put him a long way back in his title campaign. At the penultimate round two weeks ago at Portimão (POR), Sylvain retook the lead by finishing the race in second. He arrived with an advantage of three points to his closest rival at the season finale on home soil. At the last race of the year he secured the title by claiming another podium and finishing second. The first to congratulate him straight after the finish line was his mentor, double Superbike world champion James Toseland (GBR).\n\n“I still cannot believe I won the title,” Sylvain enthused. “The hard work done with the team throughout the season has paid off and I want to thank the guys, my family, James, the Clinica Mobile and everyone who supported me during the year. It was a tough race, but I was feeling very comfortable on the bike from the warm-up. I rode very carefully on the first two laps because the rear tyre was not warmed up properly and also Eddi La Marra and Bryan Staring had already crashed. I tried to maintain the gap I had with the following riders and at the same I concentrated on making the tyres work properly and did not push to the limit. It's been a fabulous week-end and I am over the moon!”\n\n“The result achieved today in the FIM Superstock 1000 Cup is amazing,” said Andrea Buzzoni, General Manager BMW Motorrad Italia. “We built on our success from 2010 and won the title again thanks to a very high-level team, a rider of unquestionable talent – who was able to grow and mature even more – and a bike that proved once more to be the best not only in the worldwide market but also on track.”\n\n“We’re extremely happy about Sylvain’s Superstock 1000 Cup title win, especially if we consider the fact that three rounds ago we were 31 points behind in the standings,” commented Serafino Foti, BMW Motorrad Italia GoldBet Superbike Team Sporting Director. “The credit for this achievement goes to all the people who supported us, to our sponsors, to BMW and especially to the team that has done an incredible job. Sylvain brilliantly kept total concentration in both tough and important times and very well deserved the title.”"}, {"url": "https://wikizero.com/www///Sylvain_Barrier", "page_content": "French motorcycle racer\n\nSylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013.[1][2]\n\nCareer [ edit ]\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut[3] in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.[4]\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics [ edit ]\n\nSuperbike World Championship [ edit ]\n\nRaces by year [ edit ]\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nYear Bike 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Pos Pts R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 R1 R2 2013 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR POR POR ITA ITA RUS RUS GBR GBR GER GER TUR TUR USA USA FRA FRA SPA\n\n12 SPA\n\n13 31st 7 2014 BMW AUS AUS SPA SPA NED NED ITA ITA GBR GBR MAL MAL SMR\n\n15 SMR\n\n11 POR\n\n10 POR\n\n11 USA\n\n12 USA\n\nDNS SPA\n\n10 SPA\n\n11 FRA\n\n10 FRA\n\nRet QAT\n\n14 QAT\n\nRet 15th 40 2015 BMW AUS\n\n15 AUS\n\n12 THA\n\n14 THA\n\n13 SPA SPA NED NED ITA ITA GBR GBR POR POR SMR SMR USA USA MAL MAL SPA SPA FRA FRA QAT QAT 28th 10 2016 Kawasaki AUS\n\n15 AUS\n\n15 THA\n\n16 THA\n\n17 SPA\n\n16 SPA\n\nRet NED NED ITA ITA MAL MAL GBR GBR ITA ITA USA USA GER GER FRA FRA SPA SPA QAT QAT 32nd 2\n\nYear Bike 1 2 3 4 5 6 7 8 9 10 11 12 13 Pts R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 R1 SR R2 2019 Ducati AUS AUS AUS THA THA THA SPA SPA SPA NED NED NED ITA ITA ITA SPA SPA SPA ITA ITA ITA GBR GBR GBR USA USA USA POR\n\n17 POR\n\n18 POR\n\n18 FRA\n\n17 FRA\n\n18 FRA\n\n13 ARG ARG ARG QAT QAT QAT 26th 3 2020 Ducati AUS AUS AUS SPA\n\n16 SPA\n\n21 SPA\n\nRet POR\n\n18 POR\n\n16 POR\n\n15 SPA\n\n12 SPA\n\n18 SPA\n\n16 SPA\n\nRet SPA\n\n19 SPA\n\nRet SPA\n\n18 SPA\n\n15 SPA\n\nRet FRA\n\n13 FRA\n\n13 FRA\n\n12 POR\n\nDNS POR\n\nDNS POR\n\nDNS 20th 12"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=40760561&lang=en", "page_content": "Sylvain Barrier (born 20 October 1988 in Oyonnax) is a French motorcycle racer. He has won the FIM Superstock 1000 Cup twice, winning the title in 2012, and again in 2013.\n\nCareer\n\nHe has raced in the FIM Superstock 1000 Cup since 2008, mostly in a BMW machinery finishing 6th in 2010 with two podiums, 4th in 2011 with a 1 win and 4 podiums, and champion in 2012 and 2013, he previously raced in the European Superstock 600 championship in 2006 and 2007. In his first season in the FIM Superstock 1000 Championship in 2008 he finished 16th, and in 2009 he finished 5th both years aboard a Yamaha. He made his Superbike World Championship debut in the Jerez circuit finishing 12th in Race 1, and 13th in Race 2, scoring 7 points during the weekend, however also turned the last race for the BMW factory team, as BMW Motorrad announced his withdrawal as an official team in July.\n\nIn 2018 he competed in the British Superbike Championship aboard a BMW S1000RR.\n\nCareer statistics\n\nSuperbike World Championship\n\nRaces by year\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap)\n\nReferences"}, {"url": "https://www.crash.net/wss/interview/217671/1/exclusive-sylvain-barrier-sstk-1000-qa", "page_content": "After a hectic start to the year, which saw him lose his BMW Italia World Superbike ride , Sylvain Barrier is back in the European Superstock 1000 series with Yamaha for the rest of 2015. Having had no time to test before the first round at Aragon, the Frenchman was playing catch-up all weekend.\n\nHis prospects of a strong first showing aboard the new R1 weren't helped by a heavy spill on Saturday morning which required a subsequent hospital visit. Yet the 26-year old still managed a gritty eleventh place finish on Sunday while riding with several cracked ribs.\n\nBarrier spoke to Crash.net on Saturday evening at Aragon about his split with BMW, the potential for a Superbike return in 2016, and his new role as Michelin test rider.\n\nCrash.net:\n\nAfter losing your ride with BMW you've ended up back in the series you've won twice. Was it your first choice to return to the European Superstock 1000 class?\n\nSylvain Barrier:\n\nI was looking honestly everywhere. BSB, IDM, everywhere. But I wanted to stay in the paddock of Superbike. I call every team in the paddock but everything was taken. There was quite some people who wanted to have me. The thing is I don't want to wait for a rider to crash, get injured and take his ride. For me it's not really correct. I prefer to go back to where I was. I'm doing some development for Michelin for the MotoGP. I'm in the Italian series with the same team. They give me the chance to maybe come into Superbike next year. But they say I need to fight. If everything come easy it's not my way to do things.\n\nYamaha gave me the chance to come back. Now it's in my side to give everything to show them and show me what I'm able to do. Also if one day I have children I can tell them what we need to do. I don't want to sit on the sofa when I'm 50 years old and say, 'Oh, if I did this I could be world champion.' No, [I have to] give everything and after show my children how to do it and how to be a better person.\n\nCrash.net:\n\nAre you still upset with BMW's decision?\n\nSylvain Barrier:\n\nHonestly I think I can be a better person. When you stay for five years with the same team you don't feel lazy. You think, 'Ok, I'm here and everything is good.' But when this happens it gives you the feeling in the heart to battle. For sure this what they did was not the correct way to do things but it will help me to become a better person.\n\nCrash.net:\n\nDid you foresee the split with BMW?\n\nSylvain Barrier:\n\nFrom the beginning of the year I was always saying the two first races will be quite difficult because Phillip Island I don't really like the circuit. After Thailand I didn't know the circuit. The first race was a complete disaster. In the second race I begin to enjoy on the bike. I was enjoying the qualifying. In the race I didn't have the good feeling to really push. The bike was quite good and I need to over-push. I wasn't feeling the confidence to do it. I thought, 'take this race easy, then in Aragon battle.' The bike is good and I wanted to battle. The team said, 'See you in Aragon.'\n\nBut when we come back from Thailand they didn't call me to tell me that. They called my manager and they say this to him. I am going out with my manager's daughter. He called his daughter and asked, 'Is Sylvain not professional?' But everything was fine. We understand the [ex-BMW WSBK] manager Andrea Dosoli go away and a new one comes. Also they say from the car accident last year, when I was not in contract with BMW at this moment, that it was bad for the image of BMW. We come back and finish some races second and third. Ok, I maybe was not battling with [David] Salom but I was in front of him in many race. I don't know exactly what happened. Maybe [Ayrton] Badovini is Italian, it is BMW Italia. I don't blame anyone. Just the way they did it is not really professional. They do it all [behind] the back and this is not really nice after five years.\n\nCrash.net:\n\nYou stood by BMW when they didn't provide you with a Superbike after your first Superstock 1000 title. Does that make their decision more difficult to accept?\n\nSylvain Barrier:\n\nThe deal was you win the championship you go to Superbike [in 2012]. I win the championship and they take Davies and Melandri [for the 2013 season]. What is the plan? 'You go back to Superstock.' And after you will get a Superbike in a professional team. I was like perfect. I will do again. After two race or three race BMW take the decision to stop everything. I thought, 'For fuck sake!' I sign again for this for 'Evo'. We do 'Evo' and it was not what I expect. If this happen in your life it's for a reason. You need to take the best and try to grow up. It's what I do now. If I come back from now I will be much stronger and it will be much better for me.\n\nCrash.net:\n\nWhat are your first impressions of the new Yamaha R1?\n\nSylvain Barrier:\n\nIt's completely a new bike and we didn't make any tests before we come here. On Monday I was under contract with BMW. We make all this at the last minute. We need to learn to the bike. Yesterday was a good day but we make the lap time with the new tyres. We didn't do anything else. We just put the new tyres and then try to understand the handling of the bike. The lap time was coming easy. This means the potential of the bike is really high. The bike is standard. It's Stock from the shop. We have the suspension. The session is really good. This morning I go with the tyres from the day before. I do three laps and come back in but the last thing I use for the second practice yesterday. We changed the spring on the bike. When I changed direction in the middle of the corner then the front is straight away go away because the track is a little bit cold. We only have four tyres all weekend. So it's difficult to imagine all that.\n\nAlso I was a little bit too aggressive. It's the game. But from the first time we get on the bike after two days we have one second free on people that are doing this for three months. It's not really bad. It means the bike is quite easy to ride straight away. We just need to understand more the bike.\n\nNow she's [the bike] the boss. I'm like 'ok'. We need to find a couple of things and it will be fine. But we need a little bit more time. The family of Yamaha is really great. Everybody we eat in the same hospitality. Everyone talk to everyone. It's intense competition but it's quite natural. This is quite nice.\n\nCrash.net:\n\nThe chance to race Yamaha's R1 in the World Superbike series next year is a nice incentive...\n\nSylvain Barrier:\n\nSuperbike was something else. I'm rider official for Michelin to develop the MotoGP tyres. I work with them for many years and they really like the way I speak about the tyres. I'm quite easy to live with and to do all the things. I think I will make a really good job. I don't know where it will bring us but for sure it will be fun.\n\nCrash.net:\n\nThe depth of quality in this class has significantly increased this year. Do you feel it will be harder to regain your title?\n\nSylvain Barrier:\n\nI'm quite happy. Just one thing I think is, 'Why don't they fire me before?' I can make one or two test before this race and be much more stronger. Now I am quite limited but I need to take the race like a practice. This morning I was a little ambition more than talent, like Stoner said. I leaned over, get back the front, I said, 'Come back!' but it didn't listen. It was not good.\n\nCrash.net:\n\nYou suffered a fairly big fall on Saturday morning and were taken to hospital. What happened?\n\nSylvain Barrier:\n\nFor the crash I just lose the front and the bike come on me. We have the security here [on the handlebar] and my glove stay in. It brings me then the bike go up. It does a spin, it come on me and I was made to go to the hospital for checks. I have two ribs cracked. The shoulder is painful and the muscle [in the arm]. Honestly on the bike it's quite hard. But I can ride and this is a good thing."}, {"url": "https://www.worldsbk.com/en/news/2014/Superstock+1000+Flashback", "page_content": "This season sees the 10th year of FIM Superstock 1000cc Cup competition, and with a new look format and plenty of new faces the prospect of another exciting battle seems inevitable.\n\nSTK1000 racing began in the late 1990’s and initially ran as a European championship before gaining FIM status in 2005.\n\n\n\nBritish riders dominated the first three years with Karl Harris and James Ellison taking the honours. Since then 7 Italians, a Belgian, an Australian and a Frenchman have been victorious with Sylvain Barrier (the Champion in 2012 and 2013) being the only rider since Ellison to defend his crown.\n\n\n\nIn terms of machinery there has been a variety of manufacturers claim the title, but the absence of Kawasaki on the winners list is perhaps somewhat surprising.\n\n\n\nLooking through the list of past winners, it is clear to see why this category proves to be so popular with no less than 5 former champions racing in the 2014 eni FIM Superbike World Championship.\n\n\n\n1999: Karl Harris (Suzuki GSX-R 750) European Championship\n\n2000: James Ellison (Honda CBR 900)\n\n2001: James Ellison (Suzuki GSX-R 1000)\n\n2002: Vittorio Iannuzzo (Suzuki GSX-R 1000)\n\n2003: Michel Fabrizio (Suzuki GSX-R 1000)\n\n2004: Lorenzo Alfonsi (Yamaha YZF R1)\n\n2005: Didier Van Keymeulen (Yamaha YZF R1) FIM Cup\n\n2006: Alex Polita (Suzuki GSX-R 1000)\n\n2007: Niccolò Canepa (Ducati 1098S)\n\n2008: Brendan Roberts (Ducati 1098R)\n\n2009: Xavier Simeon (Ducati 1098R)\n\n2010: Ayrton Badovini (BMW S1000RR)\n\n2011: Davide Giugliano (Ducati 1098R)\n\n2012: Sylvain Barrier (BMW S 1000 RR)\n\n2013: Sylvain Barrier (BMW HP4)\n\n\n\nThis year’s series will be decided over 7 rounds, beginning in Spain at MotorLand Aragon on April 13th."}]}