{"Kirill Karabits was born in Kiev, Ukraine.": [{"url": "https://www.theguardian.com/music/2022/mar/17/bournemouth-symphony-orchestra-kirill-karabits-review-ukraine-sibelius", "page_content": "Conductors don’t normally receive a standing ovation before they have even reached the podium, but these are not normal times. Ukrainian-born Kirill Karabits was making his first appearance with the Bournemouth Symphony Orchestra since Russia invaded his homeland, and the Poole audience, many of them brandishing sunflowers, the national flower of Ukraine, gave him the warmest possible welcome. As he explained in a brief speech, Karabits had considered changing his programme to include a work by a Ukrainian composer, but reckoned that, over the 13 years that he has been the orchestra’s chief, the BSO had probably performed more Ukrainian music than any other orchestra outside the country itself, and so he had decided to leave things as planned.\n\nIn fact the concert ended with a work whose finale has often been regarded as a symbol of resistance to Russian rule, Sibelius’s Second Symphony. Like all the really convincing Sibelius conductors, Karabits did not impose himself obviously on the music, never pushing too hard or micro-managing the phrases, yet his performance still had real cumulative power, and the various strands of the belligerent finale were drawn together with unanswerable conviction.\n\nBefore the interval he had conducted Tintagel, the best known of the three symphonic poems that Arnold Bax composed during the first world war. Bax and Sibelius were good friends – Bax devoted his Fifth Symphony to the Finn – but in Tintagel at least it’s Debussy, his orchestral Images in particular, that is the more obvious model, and Karabits and his orchestra revelled in its intricate play of sonorities. They had begun with All These Lighted Things, which the American Elizabeth Ogonek composed for the Chicago Symphony Orchestra in 2017 – three nicely shaped miniatures, vividly scored and each with the ghost of a dance form behind it, and all finally cut short by a shatteringly brief climax that ebbs away in shards of metallic percussion."}, {"url": "https://www.classicfm.com/artists/kirill-karabits/", "page_content": "Biography\n\nUkranian conductor Kirill Karabits is in his sixth season as Principal Conductor of the Bournemouth Symphony Orchestra, Classic FM's Orchestra in the South of England. In 2013 he won the Conductor category at the prestigious Royal Philharmonic Society awards.\n\nKirill Karabits was born on 26 December 1976 in Kiev, Ukraine. His father was a conductor and composer.\n\n\n\nKirill studied piano and, by 13, developed an interest in conducting.\n\n\n\nHe studied at the National Tchaikovsky Music Academy. In 1995, he went to the Vienna Musikhochschule, gaining a diploma in conducting.\n\n\n\nHe has done scholarly work in archives, such as transcribing the Johannes Passion of C.P.E. Bach, which was thought to be lost.\n\n\n\nHe also discovered Telemann's unknown opera, Pastorelle en Musique.\n\n\n\nHe made his first public conducting appearance at 19.\n\n\n\nIn October 2006, Karabits made his first appearance with the Bournemouth Symphony Orchestra, and returned in October 2007. In November that year, the BSO announced his appointment as their 13th Principal Conductor.\n\n\n\nWith the BSO, he has recorded music of Shchedrin for the Naxos label, and Khachaturian for Onyx Classics.\n\n\n\nIn August 2011, Karabits and the BSO agreed on a three-season extension of his contract as principal conductor through the 2015-2016 season.\n\n\n\nIn May 2013, he received the Conductor award at the Royal Philharmonic Society Awards.\n\n\n\nKarabits works frequently with young musicians, including at Aspen Music Festival and School and with the Beethoven Academy Orchestra at the Ludwig van Beethoven Easter Festival.\n\n\n\nHe also enjoys great success as an opera conductor, working regularly at Glyndebourne Festival Opera.\n\n\n\nDid you know?\n\n\n\nKarabits is the first Ukrainian conductor to be named principal conductor of a UK orchestra."}, {"url": "https://uk.news.yahoo.com/bso-chief-conductor-speaks-exclusively-050000783.html", "page_content": "BSO chief conductor speaks exclusively about his family in Ukraine after invasion\n\nBSO conductor Kirill Karabits at the Lighthouse in Poole.\n\nBOURNEMOUTH Symphony Orchestra’s chief conductor has spoken exclusively about the Russian invasion of Ukraine, urging the west to help the country in which he was born.\n\nUkrainian-born conductor Kirill Karabits who has been with the world-famous Poole-based orchestra for 14 years, condemned the invasion by Russia earlier this week.\n\nHe said: “I strongly condemn the Russian invasion. The politicians should sit down and start talking as soon as possible and stop the violence. When people are dying the most important and urgent thing to do is stop it.\n\nBournemouth Echo: Kirill Karabits\n\nKirill Karabits\n\n“Two days ago, I wouldn’t have mentioned that something like that would have happened. We are living in a very different world right now. I wouldn’t have thought an open invasion like that would become a reality.\n\n“I am devastated and I feel pain for Ukraine and am very worried about the people.”\n\nBorn in Kyiv, Mr Karabits’ mother and sister still live in the capital and are currently having to hide.\n\n“They are in shelter in the city centre. There is a danger of aviation strikes and missiles flying in the sky. I worry for them.\n\n“It is a violent and aggressive move undertaken by the Russian authorities. Hopefully it can be stopped soon.”\n\nRead more: Warnings of cyber attacks after Russian invasion of Ukraine\n\nUkraine’s president Volodymyr Zelenskyy said on Thursday night 137 people had been killed after Vladimir Putin launched a full-scale invasion of the former Soviet nation.\n\nMr Zelenskyy described them as “heroes” in a video address on Friday, confirming a further 316 people have been wounded.\n\nMr Karabits added: “I feel terribly sorry for the people who are dying in order to protect Ukraine. To my opinion the western countries should concentrate on finding the solution to stop the conflict and help Ukrainian people more than anything else at this moment.\n\n“We know that Europe and Britain were very helpful recently in providing the military help and introducing the sanctions all of which didn’t prevent Russia from the invasion, so peaceful diplomatic negotiations need to be held, now it is the moment of truth.\n\n“The whole world should be on Ukraine’s side at the moment in order to force the peaceful solution, resolve the conflict and stop the violence.”"}, {"url": "https://www.celebsagewiki.com/kirill-karabits", "page_content": "Age, Biography and Wiki\n\nKirill Karabits was born on 26 December, 1976 in Kyiv, Ukraine, is a Ukrainian conductor. Discover Kirill Karabits's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 46 years old?\n\nPopular As N/A Occupation Conductor Age 46 years old Zodiac Sign Capricorn Born 26 December 1976 Birthday 26 December Birthplace Kyiv, Ukraine Nationality Ukraine\n\nWe recommend you to check the complete list of Famous People born on 26 December. He is a member of famous Conductor with the age 46 years old group.\n\nKirill Karabits Height, Weight & Measurements\n\nAt 46 years old, Kirill Karabits height not available right now. We will update Kirill Karabits's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nKirill Karabits Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Kirill Karabits worth at the age of 46 years old? Kirill Karabits’s income source is mostly from being a successful Conductor. He is from Ukraine. We have estimated Kirill Karabits's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Conductor\n\nKirill Karabits Social Network\n\nTimeline"}, {"url": "https://peoplepill.com/people/kirill-karabits/", "page_content": "Kirill Karabits (Ukrainian: Кирило Карабиць, Kyrylo Karabyts) (born 26 December 1976, in Kiev [then in the Ukrainian SSR of the Soviet Union]) is a Ukrainian conductor. His father was the conductor and composer Ivan Karabyts.\n\nIn his youth, Karabits studied piano, flugelhorn, musicology and composition developing an interest in conducting at age 13. His early teachers included Tatiana Kozlov. In Kiev, he studied at the Lysenko Music School, and later at the National Tchaikovsky Music Academy. In 1995, he began studies at the Vienna Musikhochschule and earned a diploma in orchestral conducting after five years of study. He also attended the Internationale Bachakademie Stuttgart, where he was a pupil of Helmuth Rilling and Peter Gulke. He has done scholarly work on the musical archive of the Berliner Singakademie, such as transcribing the 1784 Johannes Passion of Carl Philipp Emanuel Bach, which was thought to be lost.\n\nKarabits made his first public conducting appearance at age 19. He was assistant conductor of the Budapest Festival Orchestra from 1998 to 2000. He also served as associate conductor of the Orchestre Philharmonique de Radio France from 2002 to 2005.\n\nFrom 2005 to 2007 Karabits held a position of a principal guest conductor of Orchestre Philharmonique de Strasbourg.\n\nIn October 2006, Karabits made his first conducting appearance with the Bournemouth Symphony Orchestra (BSO), and returned in October 2007, where both concerts received acclaim. In November 2007, the BSO announced the appointment of Karabits as their 13th Principal Conductor, after a unanimous vote from the orchestra musicians, effective with the 2009–2010 season. Karabits held the title of Principal Conductor-Designate for the 2008–2009 season, with three concert appearances. He made his first conducting appearance at The Proms with the BSO in August 2009, and formally took up the BSO principal conductorship in October 2009. He is the first Ukrainian conductor to be named principal conductor of a UK orchestra. His initial contract was for 4 years. With the BSO, Karabits has recorded music of Rodion Shchedrin for the Naxos label, and music of Aram Khachaturian for the Onyx Classics label. In August 2011, Karabits and the BSO agreed on a three-year extension of his contract as principal conductor through the 2015–2016 season. In April 2015, the BSO announced that Karabits had signed a rolling contract as principal conductor, to extend his tenure to a minimum date of 2018.\n\nKarabits first conducted the I,CULTURE Orchestra of Poland in 2013. In September 2014, the orchestra announced the appointment of Karabits as its new artistic director. In November 2014, he made his first guest-conducting appearances with the Staatskapelle Weimar. He first conducted a production at the Deutsches Nationaltheater and Staatskapelle Weimar in March 2015. Based on these appearances, in July 2015, the Deutsches Nationaltheater and Staatskapelle Weimar named Karabits their next Generalmusikdirector (GMD) and chief conductor, effective with the 2016-2017 season, with an initial contract of 3 years."}, {"url": "https://www.bournemouthecho.co.uk/news/19953977.bso-kirill-karabits-russian-invasion-ukraine/", "page_content": "Ukrainian-born conductor Kirill Karabits who has been with the world-famous Poole-based orchestra for 14 years, condemned the invasion by Russia earlier this week.\n\nHe said: “I strongly condemn the Russian invasion. The politicians should sit down and start talking as soon as possible and stop the violence. When people are dying the most important and urgent thing to do is stop it.\n\nKirill Karabits\n\n“Two days ago, I wouldn’t have mentioned that something like that would have happened. We are living in a very different world right now. I wouldn’t have thought an open invasion like that would become a reality.\n\n“I am devastated and I feel pain for Ukraine and am very worried about the people.”\n\nBorn in Kyiv, Mr Karabits’ mother and sister still live in the capital and are currently having to hide.\n\n“They are in shelter in the city centre. There is a danger of aviation strikes and missiles flying in the sky. I worry for them.\n\n“It is a violent and aggressive move undertaken by the Russian authorities. Hopefully it can be stopped soon.”\n\nRead more: Warnings of cyber attacks after Russian invasion of Ukraine\n\nUkraine’s president Volodymyr Zelenskyy said on Thursday night 137 people had been killed after Vladimir Putin launched a full-scale invasion of the former Soviet nation.\n\nMr Zelenskyy described them as “heroes” in a video address on Friday, confirming a further 316 people have been wounded.\n\nMr Karabits added: “I feel terribly sorry for the people who are dying in order to protect Ukraine. To my opinion the western countries should concentrate on finding the solution to stop the conflict and help Ukrainian people more than anything else at this moment.\n\n“We know that Europe and Britain were very helpful recently in providing the military help and introducing the sanctions all of which didn’t prevent Russia from the invasion, so peaceful diplomatic negotiations need to be held, now it is the moment of truth.\n\n“The whole world should be on Ukraine’s side at the moment in order to force the peaceful solution, resolve the conflict and stop the violence.”"}, {"url": "https://www.eclassical.com/conductors/karabits-kirill/", "page_content": "Copyright © 2009 eClassical.com\n\nPermission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled \"GNU Free Documentation License\".\n\nUkrainian conductor Kirill Karabits (b.1976).Karabits' early teachers included Tatiana Kozlov. In Kiev, he studied at the Lysenko Music School, and later at the National Tchaikovsky Music Academy. In 1995, he began studies at the Vienna Musikhochschule and earned a diploma in orchestral conducting after five years of study.Karabits was assistant conductor of the Budapest Festival Orchestra from 1998 to 2000. He also served as associate conductor of the Orchestre Philharmonique de Radio France from 2002 to 2005.In October 2006, Karabits made his first conducting appearance with the Bournemouth Symphony Orchestra (BSO), and returned in October 2007, where both concerts received acclaim. In November 2007, the BSO announced the appointment of Karabits as their 13th Principal Conductor, after a unanimous vote from the orchestra musicians, effective with the 2009-2010 season. He is the first Ukrainian conductor to be named principal conductor of a UK orchestra."}, {"url": "https://en-academic.com/dic.nsf/enwiki/8132476/", "page_content": "Kirill Karabits (born December 1976, Kiev ) is a Ukraninian conductor. His father was the conductor and composer Ivan Karabyts . In Kiev , he studied at the Lysenko Music School and later at the National Tchaikovsky Music Academy. In 1995, he began studies at the Vienna Musikhochschule and earned a diploma in orchestral conducting after five years of study. He also attended the International Bach Academy in Stuttgart, where he was a pupil of Helmuth Rilling and Peter Gulke. He has done scholarly work on the musical archive of the Berliner Singakademie, such as transcribing the 1784 \"Johannes Passion\" of Carl Philipp Emanuel Bach, which prior was thought to be lost.\n\nKarabits was assistant conductor of the Budapest Festival Orchestra from 1998 to 2000. He also served as associate conductor of the Orchestre Philharmonique de Radio France from 2002 to 2005.\n\nIn October 2006, Karabits made his first conducting appearance with the Bournemouth Symphony Orchestra (BSO), and returned in October 2007 [ cite news | author=Geoffrey Norris | title=Kirill Karabits: Triumphant blend of virile verve and fine focus | url=http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2007/10/19/bmclassical119.xml | work=Telegraph | date=19 October 2007 | accessdate=2007-12-04 ] , where both concerts received acclaim. [ cite news | author=Geoffrey Norris | title=The young ones seize the baton | url=http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2007/11/26/bmmusic126.xml | work=Telegraph | date=26 November 2007 | accessdate=2007-12-04 ] In November 2007, the BSO announced the appointment of Karabits as their 13th principal conductor, after a unanimous vote from the orchestra musicians. [ cite news | url=http://www.gramophone.co.uk/newsMainTemplate.asp?storyID=2917&newssectionID=1 | title=Bournemouth Symphony Orchestra names new chief conductor | publisher=\"Gramophone\" | author=James Inverne | date=23 November 2007 | accessdate=2007-12-04 ] Karabits is scheduled to serve as the orchestra's Principal Conductor-Designate for the 2008-2009 season, and to become Principal Conductor full-time with the 2009-2010 season. [ cite press release | url=http://www.bsolive.com/news/newsdetail.htm?articleid=151794 | title=Karabits appointed new Principal Conductor | publisher=Bournemouth Symphony Orchestra | date=29 November 2007 | accessdate=2007-12-04 ] He is the first Ukranian conductor to be named principal conductor of a UK orchestra. [ cite news | url=http://www.playbillarts.com/news/article/7410.html | title=Karabits to Succeed Alsop as Bournemouth Symphony Principal Conductor | publisher=\"Playbill Arts\" | author=Kevin Shihoten| date=27 November 2007 | accessdate=2007-12-04 ]\n\nReferences\n\nExternal links"}, {"url": "https://www.liquisearch.com/kirill_karabits", "page_content": "Kirill Karabits (born 26 December 1976, in Kiev, in the Ukrainian SSR of the Soviet Union) is a Ukrainian conductor. His father was the conductor and composer Ivan Karabyts.\n\nIn his youth, Karabits studied piano, and developed an interest in conducting at age 13. His early teachers included Tatiana Kozlov. In Kiev, he studied at the Lysenko Music School, and later at the National Tchaikovsky Music Academy. In 1995, he began studies at the Vienna Musikhochschule and earned a diploma in orchestral conducting after five years of study. He also attended the Internationale Bachakademie Stuttgart, where he was a pupil of Helmuth Rilling and Peter Gulke. He has done scholarly work on the musical archive of the Berliner Singakademie, such as transcribing the 1784 Johannes Passion of Carl Philipp Emanuel Bach, which was thought to be lost.\n\nKarabits made his first public conducting appearance at age 19. He was assistant conductor of the Budapest Festival Orchestra from 1998 to 2000. He also served as associate conductor of the Orchestre Philharmonique de Radio France from 2002 to 2005.\n\nIn October 2006, Karabits made his first conducting appearance with the Bournemouth Symphony Orchestra (BSO), and returned in October 2007, where both concerts received acclaim. In November 2007, the BSO announced the appointment of Karabits as their 13th Principal Conductor, after a unanimous vote from the orchestra musicians, effective with the 2009-2010 season. Karabits held the title of Principal Conductor-Designate for the 2008-2009 season, with three concert appearances. He made his first conducting appearance at The Proms with the BSO in August 2009, and formally took up the BSO principal conductorship in October 2009. He is the first Ukrainian conductor to be named principal conductor of a UK orchestra. His initial contract was for 4 years. With the BSO, Karabits has recorded music of Rodion Shchedrin for the Naxos label, and music of Aram Khachaturian for the Onyx Classics label. In August 2011, Karabits and the BSO agreed on a three-season extension of his contract as principal conductor through the 2015-2016 season."}, {"url": "https://www.allmusic.com/artist/kirill-karabits-mn0002019870/biography", "page_content": "Conductor Kirill Karabits has had a varied career that has included leadership of large symphony orchestras and smaller groups. He became the first Ukrainian named principal conductor of a major orchestra in the U.K. when he assumed that position with the Bournemouth Symphony Orchestra in 2009.\n\nKarabits was born in Kiev, Ukraine, on December 26, 1976. His father, Ivan Karabits, was a composer and conductor. Young Kirill studied piano, composition, and musicology, but when he was 13, he became interested in the idea of becoming a conductor. He studied at Kiev's Lysenko Music School and then moved on to the city's Petro Tchaikovsky National Music Academy of Ukraine, also known as the Kiev Conservatory. In 1995, he moved to Austria for studies at the Musikhochschule Wien, where he earned a diploma in 2000. He also studied at the International Bach Academy in Stuttgart, Germany, working with famed Bach conductor Helmuth Rilling, as well as Peter Gülke. By the time he completed his studies, Karabits had already launched his professional career as associate conductor of the Budapest Festival Orchestra. He held the same position with the Radio France Philharmonic Orchestra from 2002 to 2005, and then led France's Strasbourg Philharmonic from 2005 to 2007. After several guest conducting appearances with the Bournemouth Symphony Orchestra in the U.K., he was unanimously approved by the orchestra's musicians as its principal conductor; he ascended the podium in 2009 and remained in that position as of 2020 after several contract extensions. Karabits also served as artistic director of the I, CULTURE youth orchestra in Poland in the mid-2010s, and as the general music director of the Deutsches Nationaltheater and the Staatskapelle Weimar from 2016 to 2018.\n\nKarabits has amassed a substantial recording catalog, issuing albums with several of the aforementioned ensembles on the Onyx, Decca, and Audite labels, among several others. He has conducted Russian and Western music with equal enthusiasm, recording a complete cycle of Prokofiev's symphonies for Onyx with the Bournemouth Symphony. In 2020, he released a recording Liszt's Dante Symphony and the rarer Tasso: Lamento e Trionfo symphonic poem with the Staatskapelle Weimar for Audite."}], "Kirill Karabits studied at the Kiev Conservatory and the Royal Northern College of Music in Manchester.": [{"url": "https://bachtrack.com/interview-kirill-karabits-bournemouth-symphony-orchestra-september-2019", "page_content": "When Kirill Karabits was appointed Chief Conductor of the Bournemouth Symphony Orchestra in 2009, he thought it was the right place to practise and develop his mainstream repertoire. Ten years later it has become his most adventurous place. “I can experiment and do pieces which I can’t do anywhere else,” he tells me. “The programmes I introduce are received with interest and curiosity by the orchestra and I think the most significant achievement is that the audience, in all our residencies, still believes in us. It’s all a question of balance. Of course the audience wants to hear music they know, but you have to push them a little bit, challenge them. We are mutually supporting each other and the audience joined us on our journey.”\n\nKirill Karabits © Konrad Kwik\n\nThat journey started with a Beethoven cycle, for Karabits the turning point in his growth together with the orchestra. “It’s nothing unusual, but it was a very important element in our relationship. I said ‘If we can find each other in Beethoven, then we can do anything together.’” Not only did they find each other, it was followed by a successful cycle of Prokofiev symphonies in 2014 after which Karabits realised that the audience and the musicians were ready – and hungry – for an even more adventurous step. “I thought discovering unknown masterpieces that got lost in history or for political reasons would be a way to connect to my roots,” the Ukrainian conductor explains. Their Voices from the East series continues to prove to be incredibly popular with both critics and audiences and opened some completely new names to people. “I’d consider Kara Karayev or Boris Lyatoshynsky classical composers, but it’s different in the UK. For Avet Terterian’s Third Symphony we brought two duduk players (an Armenian folk instrument) from Yerevan to Poole. It’s very interesting and special music and the result was absolutely astonishing.”\n\nFor the composer’s Fourth Symphony, their orchestral librarian Alastair Simpson had to organise the one handwritten (and unpublished!) score of the first edition from the Terterian Estate in Armenia. But why go to all this trouble? “Because it is a unique piece of music that the composer wrote, the score is still pure. The composer only gives you ideas and directions, but he tells the conductor that he has to shape the piece himself.”\n\nKarabits’ and the audience’s fondest memories of the last ten years are not of the mainstream performances, but of the more unusual ones, programmes that challenged the musicians and listeners alike: Shostakovich’s Fourteenth Symphony sung in Russian, Prokofiev’s Second (“a very difficult piece to listen to, even for musicians”) or a semi-staged version of Salome. Amongst those stellar moments, one shines the brightest: the recording of his father’s concertos for orchestra. “In the Ukraine it’s actually the other way around. There, I am still considered the son of my father.” Ivan Karabits, a student of Lyatoshynsky, was a prolific composer, conductor and professor at the Kiev Conservatory. His concertos combine elements of Mahler, Shostakovich and Ukrainian folk music and represent the traditional concertos for orchestras in the 20th century, starting with Bartók, Lutosławski and Shchedrin. “This music is a showcase in which the orchestra presents all its capacities, all its emotions.”\n\nFor a short period during his student years, Karabits followed in his father’s composing footsteps. “It was an important time in my life, but I was always more passionate about conducting. It’s difficult to start a career as a conductor and composition was the closest to it. If you decide to dedicate your life to composition, you need to do only that, you need to have something to say, something new, and I felt that there was so much music composed already.”\n\n“I’ve always been more interested in being the interpreter. Composers don’t create an intimate version of a piece and it is our job to demonstrate what the composer wants. Some composers let you add a little bit more of yourself, others stay away and hide, because everything is in the score already. But it’s not enough to do what’s written in the score, you have to believe in it and tell the whole story. Stravinsky, for example, wrote most of what he wanted into the score; Liszt, on the other hand, gives you complete freedom. He’s not only giving you freedom, he’s asking you to interpret his music. What you see on paper is only a symbolic way of notational ideas that he wants you to experience. You have to put Liszt’s music completely through yourself, otherwise it becomes dull and uninteresting.”\n\nManuscript of Vor hundert Jahren © Liszt Ferenc Academy of Music\n\nLiszt also plays a significant role in the BSO’s upcoming season. Together with the British dramaturg Gerard McBurney, Karabits brings to stage the long-lost piece Vor hundert Jahren (A hundred years ago), an orchestral melodrama composed by Liszt to accompany the play by Friedrich Halm. Although its first performance during the festivities celebrating Schiller’s 100th birthday in November 1859 was favourable received, it was never published and only one autograph score survived. “It’s a work for two actors, some visual elements and orchestra. I’ve already conducted the original German version in Weimar [where Karabits has been Music Director for the past three years] and we will perform an English translation [by Richard Stokes] in Poole and London.\" In the current political climate in the UK, with the country asking again whether it is part of Europe and its culture, Karabits agrees that the work might be quite challenging and provocative. \"It’s about the unification of Germany, so there are some open questions…\"\n\nFor the Beethoven festivities, including the Beethoven Weekender at the Barbican in February, Karabits has his very own approach. “It’s music that pushes the limits. His symphonies are iconic, but you have to make the orchestra vibrate, you have to make the music speak. Masterpieces are sometimes presented like music in a museum. But this music is still very much alive, it still influences today. There’s no such thing as right and wrong, there’s only a convincing element that comes through the energy, the emotional investment of the orchestra. It’s the feeling of doing something on the limit.”\n\nOther Karabits highlights for next season include a semi-staged performance of Elektra, “the culmination of what we’ve already started with Salome”; working with their artist-in-residence, Gabriela Montero; and welcoming some of the BSO’s favourite soloists, including Steven Isserlis.\n\nAnd his goals for the next ten years? “I’m mainly interested in continuing our series Voices from the East. Performing unknown music doesn’t sound special at all, but every project, every piece has the power to change you. The BSO has always taken risks, they believe in works to become masterpieces. They played the world premiere of Lutosławski’s Cello Concerto and gave the UK premiere of several works by Tchaikovsky, Richard Strauss and Saint-Saëns. I want to broaden the repertoire for symphony orchestras, I want to create something new. The last ten years have been quite a journey, but the journey still continues.”\n\nClick here for all upcoming concerts of the Bournemouth Symphony Orchestra\n\nThis interview was sponsored by the Bournemouth Symphony Orchestra"}, {"url": "https://www.eclassical.com/conductors/karabits-kirill/", "page_content": "Copyright © 2009 eClassical.com\n\nPermission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled \"GNU Free Documentation License\".\n\nUkrainian conductor Kirill Karabits (b.1976).Karabits' early teachers included Tatiana Kozlov. In Kiev, he studied at the Lysenko Music School, and later at the National Tchaikovsky Music Academy. In 1995, he began studies at the Vienna Musikhochschule and earned a diploma in orchestral conducting after five years of study.Karabits was assistant conductor of the Budapest Festival Orchestra from 1998 to 2000. He also served as associate conductor of the Orchestre Philharmonique de Radio France from 2002 to 2005.In October 2006, Karabits made his first conducting appearance with the Bournemouth Symphony Orchestra (BSO), and returned in October 2007, where both concerts received acclaim. In November 2007, the BSO announced the appointment of Karabits as their 13th Principal Conductor, after a unanimous vote from the orchestra musicians, effective with the 2009-2010 season. He is the first Ukrainian conductor to be named principal conductor of a UK orchestra."}, {"url": "https://www.allmusic.com/artist/kirill-karabits-mn0002019870/biography", "page_content": "Conductor Kirill Karabits has had a varied career that has included leadership of large symphony orchestras and smaller groups. He became the first Ukrainian named principal conductor of a major orchestra in the U.K. when he assumed that position with the Bournemouth Symphony Orchestra in 2009.\n\nKarabits was born in Kiev, Ukraine, on December 26, 1976. His father, Ivan Karabits, was a composer and conductor. Young Kirill studied piano, composition, and musicology, but when he was 13, he became interested in the idea of becoming a conductor. He studied at Kiev's Lysenko Music School and then moved on to the city's Petro Tchaikovsky National Music Academy of Ukraine, also known as the Kiev Conservatory. In 1995, he moved to Austria for studies at the Musikhochschule Wien, where he earned a diploma in 2000. He also studied at the International Bach Academy in Stuttgart, Germany, working with famed Bach conductor Helmuth Rilling, as well as Peter Gülke. By the time he completed his studies, Karabits had already launched his professional career as associate conductor of the Budapest Festival Orchestra. He held the same position with the Radio France Philharmonic Orchestra from 2002 to 2005, and then led France's Strasbourg Philharmonic from 2005 to 2007. After several guest conducting appearances with the Bournemouth Symphony Orchestra in the U.K., he was unanimously approved by the orchestra's musicians as its principal conductor; he ascended the podium in 2009 and remained in that position as of 2020 after several contract extensions. Karabits also served as artistic director of the I, CULTURE youth orchestra in Poland in the mid-2010s, and as the general music director of the Deutsches Nationaltheater and the Staatskapelle Weimar from 2016 to 2018.\n\nKarabits has amassed a substantial recording catalog, issuing albums with several of the aforementioned ensembles on the Onyx, Decca, and Audite labels, among several others. He has conducted Russian and Western music with equal enthusiasm, recording a complete cycle of Prokofiev's symphonies for Onyx with the Bournemouth Symphony. In 2020, he released a recording Liszt's Dante Symphony and the rarer Tasso: Lamento e Trionfo symphonic poem with the Staatskapelle Weimar for Audite."}, {"url": "https://kirillkarabits.com/biography/", "page_content": "Chief Conductor: Bournemouth Symphony Orchestra\n\nKarabits is an inspired architect….He has an energising presence on the podium, without being domineering…he paced the whirlwind finale in a way that brought the house down.\n\nSince 2008 Kirill Karabits has held the position of Chief Conductor of Bournemouth Symphony Orchestra. Together they have been recording a Prokofiev cycle since 2013, of which Symphony No.5 was released to critical acclaim in July 2015 shortly before its performance at the BBC Proms. The 2015-16 season opened with hugely successful concert performances of Salome and the orchestra also gave a sell-out Classic FM Live concert at the Royal Albert Hall in April 2015.\n\nFrom 2016 Karabits assumed the position of General Music Director and Principal Conductor of the Deutsches Nationaltheater and Staatskapelle Weimar.\n\nKarabits has worked with many of the leading ensembles of Europe, Asia and North America, including the Cleveland, Philadelphia and San Fransisco Symphony orchestras, Philharmonia Orchestra, Rotterdam Philharmonic, Yomiuri Nippon Symphony Orchestra, Orchestra Filarmonica del Teatro La Fenice and the BBC Symphony Orchestra – including a concertante version of Bluebeard’s Castle at the Barbican Centre. In spring 2016, he conducted the Russian National Orchestra on their tour of the US and returned to the RNO in August 2016 to conduct two concerts at the Edinburgh International Festival both with Mikhail Pletnev as a soloist. Summer 2016 also saw his debut with the Chicago Symphony at the Ravinia Festival.\n\nA prolific opera conductor, Karabits has conducted at Glyndebourne Festival Opera (La bohème and Eugene Onegin), English National Opera (Don Giovanni) and the Bolshoi Theatre. He also conducted Der fliegende Holländer at the Wagner Geneva Festival in celebration of the composer’s anniversary, and recently returned to Staatsoper Hamburg to conduct Madama Butterfly. The 2016-17 season will see debuts at both the Deutsche Oper and Oper Stuttgart.\n\nWorking with the next generation of bright musicians is of great importance to Karabits and as Artistic Director of I, CULTURE Orchestra he conducted them on their European tour in August 2015 with Lisa Batiashvili as soloist. In 2012 and 2014 he conducted the televised finals of the BBC Young Musician of the Year Award (working with the Royal Northern Sinfonia and BBC Scottish Symphony Orchestra).\n\nHe was named Conductor of the Year at the 2013 Royal Philharmonic Society Music Awards."}, {"url": "https://www.qobuz.com/us-en/interpreter/kirill-karabits/270629", "page_content": "Kirill Karabits\n\nConductor Kirill Karabits has had a varied career that has included leadership of large symphony orchestras and smaller groups. He became the first Ukrainian named principal conductor of a major orchestra in the U.K. when he assumed that position with the Bournemouth Symphony Orchestra in 2009. Karabits was born in Kiev, Ukraine, on December 26, 1976. His father, Ivan Karabits, was a composer and conductor. Young Kirill studied piano, composition, and musicology, but when he was 13, he became interested in the idea of becoming a conductor. He studied at Kiev's Lysenko Music School and then moved on to the city's Petro Tchaikovsky National Music Academy of Ukraine, also known as the Kiev Conservatory. In 1995, he moved to Austria for studies at the Musikhochschule Wien, where he earned a diploma in 2000. He also studied at the International Bach Academy in Stuttgart, Germany, working with famed Bach conductor Helmuth Rilling, as well as Peter Gülke. By the time he completed his studies, Karabits had already launched his professional career as associate conductor of the Budapest Festival Orchestra. He held the same position with the Radio France Philharmonic Orchestra from 2002 to 2005, and then led France's Strasbourg Philharmonic from 2005 to 2007. After several guest conducting appearances with the Bournemouth Symphony Orchestra in the U.K., he was unanimously approved by the orchestra's musicians as its principal conductor; he ascended the podium in 2009 and remained in that position as of 2020 after several contract extensions. Karabits also served as artistic director of the I, CULTURE youth orchestra in Poland in the mid-2010s, and as the general music director of the Deutsches Nationaltheater and the Staatskapelle Weimar from 2016 to 2018. Karabits has amassed a substantial recording catalog, issuing albums with several of the aforementioned ensembles on the Onyx, Decca, and Audite labels, among several others. He has conducted Russian and Western music with equal enthusiasm, recording a complete cycle of Prokofiev's symphonies for Onyx with the Bournemouth Symphony. In 2020, he released a recording Liszt's Dante Symphony and the rarer Tasso: Lamento e Trionfo symphonic poem with the Staatskapelle Weimar for Audite.\n\n© James Manheim /TiVo\n\nRead more"}, {"url": "https://www.manchesterworld.uk/news/how-a-top-manchester-music-school-is-helping-musicians-who-fled-ukraine-due-to-war-and-how-you-can-donate-3746705", "page_content": "The Royal Northern College of Music (RNCM) has launched a new fund to support musicians displaced by Russia’s brutal invasion of Ukraine.\n\nThe Royal Northern College of Music. Photo: RNCM\n\nA top Manchester music school has launched a new fund to support musical talent forced to flee from Ukraine by Russia’s invasion of the country.\n\nThe Royal Northern College of Music (RNCM) has set up the RNCM Ukrainian Musicians Fund which it is hoped will ensure young musicians will not have their careers and ambitions wrecked by war.\n\nAdvertisement\n\nAdvertisement\n\nThe conservatoire on Oxford Road hopes to raise enough money to provide all the support people fleeing a conflict zone need for their studies in Manchester.\n\nThe appeal is being backed by a pianist who studied at the RNCM and is originally from Ukraine,who spoke movingly about seeing first hand the devastation of war in his homeland.\n\nWhat is the RNCM doing to support Ukrainian musicians?\n\nThe RNCM has unveiled the RNCM Ukrainian Musicians Fund to support musical talent displaced by the war in the country.\n\nThe music school says the aim is to ensure that Ukraine does not suffer the loss of an entire generation of musicians and that those already studying are given the opportunity to fulfil their dreams.\n\nWar damage at the Kharkiv Music Boarding School in Ukraine. Photo: Ivan Hovorun\n\nAdvertisement\n\nAdvertisement\n\nThe fund is aiming to raise enough money not only to cover fee bursaries but to provide additional support for living costs, English language training and wraparound support that will include counselling, health and wellbeing care.\n\nThis is because musicians leaving Ukraine are coming out of a country that has already been occupied for four months and suffered billions of pounds of infrastructure damage.\n\nThe RNCM says it wants musicians to feel safe and secure as part of the organisation while they are studying in the city.\n\nRead More How you can help Ukrainians and where to donate in Greater Manchester\n\n‘I’ve walked through streets that have been totally destroyed’\n\nPianist Ivan Hovorun studied at the RNCM and is from the Ukrainian city of Lviv.\n\nAdvertisement\n\nAdvertisement\n\nHe has seen the devastation resulting from the invasion of Ukraine, a country rich in musical culture and home to leading conservatories such as the Lviv National Musical Academy and The Kiev Conservatory.\n\nIvan’s career has seen him play around the world and now he has pledged to support the next generation of musicians from his home country by helping to raise money for the RNCM Ukrainian Music Fund, including by playing a special recital.\n\nHe said: “I grew up and studied in Lviv, and I’ve walked through the streets and places that have been totally destroyed.\n\nIvan Hovorun\n\n“I am in constant contact with my friends there, as they try to defend their homes and cities.\n\nAdvertisement\n\nAdvertisement\n\n“It is 10 years since I studied at the RNCM, where for seven years of study I literally lived, and I have most pleasant memories of the those years and concerts.\n\n“Since March 2022 I have been supporting Ukraine through different events and I am now supporting Ukrainian students of my alma mater. I think it is my mission to help.\n\n“It is very important for global music culture that newly coming generation of Ukrainian music students will have access to the unique facilities, instruments, sources of information, concert platforms and fantastic teachers.”\n\nRead More Pop singer Maksym Komisarchuk who was on The Voice Kids in Ukraine doing fund-raising gig in Manchester\n\nWhat has the RNCM said?\n\nManus Carey, deputy principal at the RNCM, said: “We want to do everything that we can to ensure that these young musicians who have been displaced from their training have every opportunity to flourish, both in their music and as part of the communities of the RNCM and the city of Manchester.\n\nAdvertisement\n\nAdvertisement\n\n“It’s unimaginable to think of what is happening in Ukraine, but as part of the international community of musicians it is our aim to give these talented young musicians a sense of hope.”\n\nRob Buckland, head of saxophone at the RNCM, spoke about one of the Ukrainian students, saying: “From the very first note, I knew that she was a really talented saxophonist with a special gift for melody and phrasing. Her playing is fundamentally connected to her very being, and she plays with a really entrancing connection to the music.\n\n“To be able to provide this young saxophonist with the support to be able to live and study in Manchester, to find the very best in herself, and feel safe and secure in the incredible learning environment that is the RNCM, will mean more to her than she can ever say.”\n\nCan I help to support the fund?\n\nThe RNCM Ukrainian Musicians Fund is online here. Donations can be made online, either through a suggested amount of £25, £50, £100, £250 or £500 or by entering another sum.\n\nAdvertisement\n\nAdvertisement"}, {"url": "https://www.karabits.com/en/biography/", "page_content": "Celebrated Ukrainian composer and conductor\n\nThe music heritage of Ivan Karabits - one of Ukraine’s XX-th century leading composers, represents a number of stage, vocal, symphonic and chamber works. Following the tradition of Mahler and Schostakovich the musical language of Ivan Karabits has deep roots in Ukrainian and Slavonic symphonic and folk tradition of past centuries and has left a deep influence on various generations of Ukrainian composers of the second half of XX-th century.\n\nBorn in 1945 in a Greek village Yalta in the Donetsk region of Ukraine he graduated from the Kiev Conservatory in 1974 where he studied with prominent Ukrainian composer Boris Lyatoshinsky. Ivan Karabits began winning recognition while still a student at the age of 24 when he became as a laureate of all-Union competition for young composers. He has since won many more awards and honor for his works and held the title of “People Artist of Ukraine”. Professor of the composition at the Kiev Tchaikovsky Music Academy, founder and artistic director of the Ukrainian Internatinal Festival “Kiev Music Fest”, music advisor to the Ministry of Culture of Ukraine, member of Ukraine’s State Comission on UNESCO Affairs, chairman of the jury of international competition for young pianists in memory of Vladimir Horowitz, Music Director of the State ensemble of soloists “Kiev Camerata”.\n\nHis works are frequently performed throughout the countries of the former Soviet Union, and many of his compositions have been heard by audiences in France, Germany, Finland, Italy, Argentina, England, and the United States.\n\nThe initial period of creative work of the composer is characteristic of the free use of dodecaphony. The works of the early period (1st sonata for cello, sinfonietta for string orchestra, sonatina for piano) are characteristic of expressive type of expression and search of the individual style. In 70-80s the composer displayed his interest in conceptual immensity in implementation of philosophical problems (themes of Motherland, memory, moral obligations). There was a priority of symphonic genres in their correlation with scene and vocal genres, instrumental concert (“Sad Bozhestvennykh Pisen (Garden of Divine Songs) Concert for choir, soloists and orchestra) versified by H. H. Skovoroda, “Kyivski Fresky (Kyiv Frescoes) opera-oratorio, three concerts for orchestra).\n\nSymphonic style of I. Karabits displayed draft for dramatic type as the main one in synthesis of different genre fundamentals (in correlation of epos, drama and lyrics in “Piat Pisen Pro Ukrainu” (Five Songs about Ukraine) epic symphony, conflict dramatic and lyric fundamentals in the Third Symphony). Music lexis of composer reflects the various vectors of style landmarks: different genre and style layers of Ukrainian folklore (duma, plangent song, instrumental affectations) and national professional music art (remarkable chants, canticle, choir culture of baroque, stylistics of B. Liatoshynsky), music classics of the 20th century (G. Mahler, D. Shostakovich, S. Bartok, I. Stravinsky) and modern trends, mass genres.\n\nUniversality of music language of the works of next period was determined by the synthesis of different elements of modern composers techniques (non-serial dodecaphony, pointillism, clusters, aleatory composition, sonority) in combination with new acoustical and new modal pitch organization, interception of different style trends (neoclassicism, neobaroque, neoimpressionism, jazz lexis). In sphere of images there is the increase of tragic principle and actualization of the theme of penitence (Concert No. 3 “Holosinnia” (Lamentations), concert-triptych for orchestra), a new implementation of the theme of pantheism (“Music from Waterside”)"}, {"url": "https://www.yuanfanyang.com/media", "page_content": "Yuanfan Yang performs the Grieg Piano Concerto in A minor, Op. 16 with the Royal Northern Sinfonia, conducted by Kirill Karabits. Recorded live in 2012 at The Sage Gateshead in Newcastle, UK, and broadcast live on BBC Two national television as part of the Grand Final of the BBC Young Musician of the Year 2012 competition.\n\nYuanfan Yang performs the Tchaikovsky Piano Concerto no. 1 in B- flat minor, Op. 23 with Leeds Sinfonia, conducted by Justin Doyle.\n\nDocumentary and highlights of Yuanfan Yang's winning performance in the Keyboard Category of the BBC Young Musician of the Year 2012 competition. This was broadcast on BBC Four national television."}, {"url": "https://www.theguardian.com/music/2020/mar/08/hitting-the-right-notes-leading-conductors-on-the-women-composers-we-should-listen-to", "page_content": "Last year, Women in Music’s survey of major classical concerts confirmed that classical music is a man’s world. Only 2.3% of works programmed in the 2018-19 season by 15 of the world’s major orchestras were written by women. A survey of the same 15 major orchestras for this current season reveals a tiny improvement – of 3,997 works being performedin 2019-20’s concerts, 142 have been written by female composers, ie 3.6%. Progress is glacially slow, and the gender imbalance is too often framed as a problem for women alone to grapple with. (I am reminded of Marin Alsop, who, when asked why there are so few women conductors, will reply “I dont know. Ask the men.”) And so, on International Women’s Day, we asked 10 of the UK’s leading male conductors to nominate a female composer whose music deserves wider recognition. Their responses have been fascinating, and prove that there is a vast wealth of music out there that can enrich our musical lives. Imogen Tilden\n\nGermaine Tailleferre (1892-1983), chosen by Edward Gardner\n\nGermaine Tailleferre (1892-1983) Photograph: Lipnitzki/Roger Viollet/Getty Images\n\nI came across Germaine Tailleferre when researching French orchestral music of the early part of the 20th century and was shocked that I hadn’t heard of her before. The Ballade for Piano and Orchestra is a beautiful woven tapestry, but for me the great works lie in her chamber music; a string quartet full of colour, perhaps overlooked because of its brevity. Listen to Valse Lente and Arabesque, both miniatures that have a surface of the nonchalant style that’s so reminiscent of that period of French music, but with an undercoat of wistful pain. Image is a gem, with an orientalist slant that reminds me of her friend and mentor Ravel and a harmony that looks forward, like Boulanger, to Messiaen.\n\nEdward Gardner is the principal conductor designate of the London Philharmonic Orchestra.\n\nBetsy Jolas (b. 1926), chosen by Simon Rattle\n\nBetsy Jolas Photograph: Léonard Roussel\n\nBetsy Jolas is one of those people I used to read about. She formed the Domaine musical (a concert society) with Pierre Boulez and took over Messiaen’s position as composition professor at the Paris Conservatoire. I would think, “[Hers] must be interesting music”, but I’d never had the opportunity to hear a note of it. That is, until I met Betsy at a dinner party. I was sat next to her and fell completely in love! When you start talking to her, she tells you about when Varèse came to dinner, and when she sang the Verdi Requiem conducted by Toscanini. She’s truly a walking encyclopaedia. “If her music is one tenth as extraordinary as she is, then we really have something,” I thought. That evening I was able to hear some of her music on YouTube, and by the end of the next week I had commissioned a piece from her for the Berlin Philharmonic, as part of the Tapas series. She came up with a beautiful 13-minute composition called A Little Summer Suite. It’s full of depth, humour and thought. I’m not sure it’s the kind of piece a young person could write. It has a wisdom of a certain age. The Berlin Philharmonic leapt on it with joy. We realised immediately how well she could hear everything and how she knew exactly what she wanted. Her music is wonderful. I was thrilled to have introduced her to the Berlin audience, and to be able to bring her music to London three years later in a concert in February 2019.\n\nSimon Rattle is music director of the London Symphony Orchestra.\n\nFranghiz Ali-Zadeh (b. 1947), chosen by Kirill Karabits\n\nAzerbaijan’s Franghiz Ali-Zadeh in 2000. Photograph: Hiroyuki Ito/Getty Images\n\nThis week I conducted the music of Franghiz Ali-Zadeh with the Minnesota Orchestra. Franghiz is one of Azerbaijan’s leading composers, and the roots of her music lie in the traditions of her native country. She often combines modern symphonic traditions with the folk art form called Mugham. Using her unique musical language in the symphonic, chamber and choral compositions, she continues the tradition of her teacher, the iconic composer of Azerbaijan, Kara Karayev (1918-82), who himself studied with Shostakovich in Moscow. Franghiz’s work is a unique blend of European and eastern music. At Bournemouth Symphony Orchestra we’ve recorded Karayev within our exploration of repertoire from former Soviet countries, Voices from the East. I discovered this music through my late father, the Ukrainian composer Ivan Karabits; it means a lot to me, to bring these voices to UK audiences.\n\nKirill Karabits is chief conductor of Bournemouth Symphony Orchestra. The next concert in the Voices from the East series is on 6 May.\n\nGrażyna Bacewicz (1909-1969), chosen by Nicholas Collon\n\nAs a child, Bacewicz was a violin prodigy and highly proficient pianist, who aged 23 went to study composition in Paris with Nadia Boulanger. Bacewicz became one of Poland’s leading composers, paving the way for other female composers from younger generations, while simultaneously performing as leader of the Polish Radio Symphony Orchestra. I’m planning to programme her Music for Strings, Trumpets and Percussion in my first season as chief conductor with the Finnish Radio Symphony Orchestra. Written in 1958, it’s a blistering piece; acerbic, virtuosic, full of rhythmic drive. It’s for a very unusual lineup; the string writing alongside percussion is reminiscent perhaps of Bartók, but Bacewicz adds five trumpets on top – I imagine them placed around the back of the strings, inviting us into some kind of infernal dance.\n\nNicholas Collon is founder and principal conductor of Aurora Orchestra.\n\nElla Milch-Sheriff (b. 1954), chosen by Omer Meir Wellber\n\nMelting pot ... Omer Meir Wellber with Ella Milch-Sheriff. Photograph: Jens Gerber\n\nI greatly admire the music of Ella Milch-Sheriff, a composer from Israel. Last week I premiered a work of hers at the Gewandhaus Orchestra in Leipzig that was a huge success. Her music is important for political and social reasons: she represents second generation holocaust survivors and she lives and breathes controversial Israeli society. Hebrew is her mother tongue but her closeness to the German language is dominant. In her operatic work she constantly deals with specific German-Jewish-Israeli complexities and puts them in human context – and that is very important in today’s world. Her music reflects a melting pot of Arab, Mediterranean and Israeli culture through her use of various instruments from different backgrounds and playing with colours in beautiful and very unique orchestrations, making the listener aware and conscious of conflict, but also of unity.\n\nOmer Meir Wellber is chief conductor of the BBC Philharmonic.\n\nLouise Farrenc (1804-1875), chosen by Lars Vogt\n\nCelebrated ... Louise Farrenc. Photograph: The Picture Art Collection/Alamy Stock Photo\n\nLouise Farrenc’s music was widely performed and celebrated during her lifetime but has largely fallen into obscurity since. Well-known as a concert pianist, she taught at the Paris Conservatoire and composed a wide range of works, including three fantastic symphonies and a large assortment of chamber music. As musical director of Royal Northern Sinfonia, I was excited to have Farrenc’s unapologetic and powerful Third Symphony brought to life earlier this season. There is no doubt that she faced an enormous challenge in having her ability recognised, but Farrenc’s work firmly stands its ground among the symphonic greats that dominated music of the mid-19th century.\n\nLars Vogt is music director of the Royal Northern Sinfonia.\n\nShruthi Rajasekar (b. 1996), chosen by Robert Hollingworth\n\nNumbers is a great title for a piece: a series of sung numbers and overlapping time signatures that is funky to conduct and fun for the singers. Its Indian-American composer, Shruthi Rajasekar, was one of three young female composers (out of four) on the National Youth Choir of Great Britain Young Composers Scheme last summer. They all wrote pieces for the choir during the course, but this one stood out to me because it was very different from vocal music with expressive text to worry about. The lack of that freed the singers to listen even more and to have fun. The numbers reference our current digital ones and zeroes, also the decimal system (leading to a nicely lopsided section in two groups of a fast five) and even the Babylonian system of 60, thus the constant appearance of “59”. But the numbers aren’t academic – they’re fun: along with some unusual instructions to the singers such as “imperious, but less certain”. I researched some of her other pieces on her website and enjoyed the Indian rhythmic influences, but still I come back to this enjoyable piece that does what it says on the tin.\n\nRobert Hollingworth is director of I Fagiolini.\n\nGalina Ustvolskaya (1919-2006), chosen by Vasily Petrenko\n\nExistential expressionism ... Galina Ustvolskaya.\n\nRussian-born Ustvolskaya’s legacy is an example of almost ultimate existential expressionism, an individual cry against life’s circumstances, and a search for spiritual comfort in very uncomfortable living conditions. In her music she was, probably, a direct descendant of Mahler and Shostakovich. She also had an exceptional and unusual life, living almost as a hermit for many years.\n\nVasily Petrenko is chief conductor of the Royal Liverpool Philharmonic.\n\nDora Pejačević (1885-1923), chosen by Sakari Oramo\n\nDora Pejačević was a largely self-taught Hungarian-Croatian composer. Her musical output consists mostly of songs and piano music, but she also wrote what is considered the first symphony by a Croatian composer. Her Symphony in F sharp minor (1916-1917, revised 1920) is a very ambitious, large-scale work and shows the composer in complete control of her means: the form is unorthodox but compelling with some very interesting kaleidoscopic moments, the orchestration quite dark in colours and the expression very passionate. The first complete performance was in Dresden in 1920 and was very favourably reviewed. Pejačević was a member of an important noble family but later became distanced from her class and embraced modern ideas of a merit-based society, as opposed to the old ways of aristocratic entitlement. In her development as a composer, she made her way from the earlier, salon-like small-scale pieces to her later music, such as the Symphony and the Phantasie Concertante for piano and orchestra.Her creative life was cut short by complications from childbirth in 1923.\n\nSakari Oramo is chief conductor of the BBC Symphony Orchestra.\n\nKaija Saariaho (b. 1952), chosen by Santtu-Matias Rouvali\n\nFor most people, Finnish music means one thing: Sibelius. But since his time, new generations of composers have taken Finnish composition forward in a number of directions. The most prominent of those is Kaija Saariaho. To say she is a modern-day Sibelius wouldn’t be right, but, with a shared history and culture come themes that you find from a lot of Nordic composers: the landscape of the north, journeys and storytelling. Kaija’s music tells stories from all over the world – and even from beyond the stars. From her electronic works in the 1980s in Paris, to her more recent pieces such as her clarinet concerto D’Om le Vrai Sens, her music always draws me in to its narrative, with its vivid details. Where other composers can get lost in sound effects or structure, she always lets her music breathe and paint a picture.\n\nRather than her operas, it’s her music for orchestra that I have been conducting for years. One memory that is particularly special is my debut with the Orchestre Philharmonique de Radio France in Paris in a programme of all-Finnish music, including the French premieres of three of Kaija’s pieces: Asteroid 4179: Toutatis, Laterna magica and Leino Songs (sung by the Finnish soprano Anu Komsi). I’ve been proud to conduct Kaija’s music at both orchestras where I am chief conductor, in Tampere, Finland, and Gothenburg, Sweden, so I look forward to bringing her music to London.\n\nSanttu-Matias Rouvali is principal conductor designate of the Philharmonia."}, {"url": "https://en-academic.com/dic.nsf/enwiki/8132476/", "page_content": "Kirill Karabits (born December 1976, Kiev ) is a Ukraninian conductor. His father was the conductor and composer Ivan Karabyts . In Kiev , he studied at the Lysenko Music School and later at the National Tchaikovsky Music Academy. In 1995, he began studies at the Vienna Musikhochschule and earned a diploma in orchestral conducting after five years of study. He also attended the International Bach Academy in Stuttgart, where he was a pupil of Helmuth Rilling and Peter Gulke. He has done scholarly work on the musical archive of the Berliner Singakademie, such as transcribing the 1784 \"Johannes Passion\" of Carl Philipp Emanuel Bach, which prior was thought to be lost.\n\nKarabits was assistant conductor of the Budapest Festival Orchestra from 1998 to 2000. He also served as associate conductor of the Orchestre Philharmonique de Radio France from 2002 to 2005.\n\nIn October 2006, Karabits made his first conducting appearance with the Bournemouth Symphony Orchestra (BSO), and returned in October 2007 [ cite news | author=Geoffrey Norris | title=Kirill Karabits: Triumphant blend of virile verve and fine focus | url=http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2007/10/19/bmclassical119.xml | work=Telegraph | date=19 October 2007 | accessdate=2007-12-04 ] , where both concerts received acclaim. [ cite news | author=Geoffrey Norris | title=The young ones seize the baton | url=http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2007/11/26/bmmusic126.xml | work=Telegraph | date=26 November 2007 | accessdate=2007-12-04 ] In November 2007, the BSO announced the appointment of Karabits as their 13th principal conductor, after a unanimous vote from the orchestra musicians. [ cite news | url=http://www.gramophone.co.uk/newsMainTemplate.asp?storyID=2917&newssectionID=1 | title=Bournemouth Symphony Orchestra names new chief conductor | publisher=\"Gramophone\" | author=James Inverne | date=23 November 2007 | accessdate=2007-12-04 ] Karabits is scheduled to serve as the orchestra's Principal Conductor-Designate for the 2008-2009 season, and to become Principal Conductor full-time with the 2009-2010 season. [ cite press release | url=http://www.bsolive.com/news/newsdetail.htm?articleid=151794 | title=Karabits appointed new Principal Conductor | publisher=Bournemouth Symphony Orchestra | date=29 November 2007 | accessdate=2007-12-04 ] He is the first Ukranian conductor to be named principal conductor of a UK orchestra. [ cite news | url=http://www.playbillarts.com/news/article/7410.html | title=Karabits to Succeed Alsop as Bournemouth Symphony Principal Conductor | publisher=\"Playbill Arts\" | author=Kevin Shihoten| date=27 November 2007 | accessdate=2007-12-04 ]\n\nReferences\n\nExternal links"}]}