{"B. K. Anand was a member of the Board of Governors of the Indian Institute of Management, Ahmedabad.": [{"url": "https://www.archdaily.com/954387/louis-kahns-dormitories-for-the-indian-institute-of-management-ahmedabad-saved-from-demolition", "page_content": "As reported in The Times of India, the board of governors for the Indian Institute of Management, in Ahmedabad, India has canceled the proposal to demolish Louis Kahn’s buildings on campus and replacing them with new structures, after a worldwide pushback from the international architecture community.\n\nThe management’s expression of interest (EOI) to build new dorms instead of the structures erected by Louis Kahn, inviting architects to propose their visions, was withdrawn. The decision made by the board of governors of the institute was the result of an international movement that urged the officials to re-evaluate their plans of demolition. In fact, the administration plans to “bring down at least 14 of 18 dorms which were built between 1968 and 1978\" for showing \"problems of leakages from the roof, dampness in walls, leakages in toilet walls, slabs, etc.”, was abandoned.\n\nAccording to historian Robert McCarter, the unique buildings of Kahn created a new campus experience. In fact, he said that “What really makes those buildings work is the air that comes through individual rooms and then goes out into the shared space and then is evacuated from the building, so you get constant ventilation.” He also added in The Architect’s Newspaper that these dormitories were built using the same technology, as the main buildings that just underwent a successful renovation, explaining that there is no reason not to continue with this process.\n\nAfter various stakeholders wrote to the management and board with many online petitions, the BOG reconsidered his initial choice. Many petitions and letters made their way, with the mobilization of figures of the international architecture scene such as MoMA’s Glenn Lowry and Martino Stierli. Sarosh Anklesaria, Riyaz Tayyibji, Shubhra Raje, T. David Fitz-Gibbon Professor of Architecture at Carnegie Mellon University created a petition as soon as the news broke, collecting 700 signatures including Pritzker laureates Balkrishna Doshi, Rafael Moneo, and Alejandro Aravena, Tatiana Bilbao, Annabelle Selldorf, and Marlon Blackwell.\n\nOn January 1st, BoG chairman Kumar Mangalam Birla and other members of the Indian Institute of Management, Ahmedabad issued a letter explaining that “we are. […] withdrawing the expression of interest that was put out. We will deliberate on the feedback received, reevaluate the options, consult the best global conservation and structural experts, and chart out a course of action, which the institute will communicate in due course”.\n\nMoreover, the letter stated that “Many of you have been writing in ever since the Expression of Interest was put up for the design of the student housing at the main campus of the institute. You have sought to remind us that the dormitories designed by Louis Kahn are a cultural legacy and that these buildings are to be seen as an integral part of the ensemble of buildings that constitute the campus”. Finally, the BoG addressed its initial concerns of safety and stated that it will look into better solutions that protect the legacy of Louis Kahn and ensure the needs of the future.\n\nInfo via The Times of India and The Architect's Newspaper."}, {"url": "https://www.adb.org/who-we-are/organization/board-governors", "page_content": "Afghanistan Mohammad Khalid Payenda (Information as of July 2021) Governor for the Islamic Republic of Afghanistan in the Asian Development Bank\n\nActing Minister of Finance\n\nMinistry of Finance\n\nPashtunistan watt\n\nKabul, Afghanistan\n\nPhone: +93202924000 (ofc); Nazir Kabiri (Information as of July 2021)\n\nDeputy Minister for Policy\n\nMinistry of Finance of the Islamic Republic of Afghanistan\n\nKabul, Afghanistan\n\nPhone: +93 (0) 20 2924009, +93 (0) 795 126206\n\n[email protected] Alternate Governor for the Islamic Republic of Afghanistan in the Asian Development BankDeputy Minister for PolicyMinistry of Finance of the Islamic Republic of AfghanistanKabul, AfghanistanPhone: +93 (0) 20 2924009, +93 (0) 795 126206\n\nArmenia Vahe Hovhannisyan\n\nMinister of Finance\n\nMinistry of Finance of the Republic of Armenia\n\n1 Melik-Adamyan Street\n\nYerevan, 0010\n\nRepublic of Armenia\n\nPhone: (37411) 800002/800080\n\n[email protected] ; [email protected] Governor for Armenia in the Asian Development BankMinister of FinanceMinistry of Finance of the Republic of Armenia1 Melik-Adamyan StreetYerevan, 0010Republic of ArmeniaPhone: (37411) 800002/800080 Eduard Hakobyan\n\nDeputy Minister of Finance\n\nMinistry of Finance of the Republic of Armenia\n\n1 Melik-Adamyan\n\nYerevan, 0010\n\nRepublic of Armenia\n\nPhone: (37411) 800055\n\n[email protected] ; [email protected] Alternate Governor for Armenia in the Asian Development BankDeputy Minister of FinanceMinistry of Finance of the Republic of Armenia1 Melik-AdamyanYerevan, 0010Republic of ArmeniaPhone: (37411) 800055\n\nAustralia Jim Chalmers MP\n\nTreasurer of the Commonwealth of Australia\n\nParliament House\n\nCanberra ACT 2600\n\nAustralia\n\nFax: +61 2 6273 3420\n\nPhone: +61 2 6277 7340\n\n[email protected] Governor for Australia in the Asian Development BankTreasurer of the Commonwealth of AustraliaParliament HouseCanberra ACT 2600AustraliaFax: +61 2 6273 3420Phone: +61 2 6277 7340 Stephen Jones MP\n\nAssistant Treasurer and Minister for Financial Services\n\nPO Box 6022\n\nParliament House\n\nCanberra ACT 2600\n\nAustralia\n\nPhone: +612 6277 7230\n\n[email protected] Alternate Governor for Australia in the Asian Development BankAssistant Treasurer and Minister for Financial ServicesPO Box 6022Parliament HouseCanberra ACT 2600AustraliaPhone: +612 6277 7230\n\nAzerbaijan Samir Sharifov\n\nMinister of Finance\n\n83, Samed Vurgun Street\n\nAZ1022, Baku\n\nAzerbaijan\n\nFax: 99412 4044720 / 21\n\nPhone: 0099412 4044701\n\n[email protected] ; [email protected] Governor for Republic of Azerbaijan in the Asian Development BankMinister of Finance83, Samed Vurgun StreetAZ1022, BakuAzerbaijanFax: 99412 4044720 / 21Phone: 0099412 4044701 Mikayil Jabbarov\n\nMinister of Economy\n\nUzeyir Hajibeyli Street 84, Government House\n\nBaku AZ1000\n\nAzerbaijan\n\nFax: (99412) 490-2404\n\nPhone: +994124938867\n\n[email protected] Alternate Governor for Republic of Azerbaijan in the Asian Development BankMinister of EconomyUzeyir Hajibeyli Street 84, Government HouseBaku AZ1000AzerbaijanFax: (99412) 490-2404Phone: +994124938867\n\nBangladesh A H M Mustafa Kamal\n\nMinister for Finance\n\nMinistry of Finance\n\nEconomic Relations Division, Ministry of Finance\n\nSher-e-Bangla Nagar, Dhaka\n\nBlock # 6, Ground Floor\n\nBangladesh\n\nFax: +8802-9514404, +8802-48110580\n\nPhone: +8802-48121100, +880-2-9514477\n\n[email protected] ; [email protected] Governor for People's Republic of Bangladesh in the Asian Development BankMinister for FinanceMinistry of FinanceEconomic Relations Division, Ministry of FinanceSher-e-Bangla Nagar, DhakaBlock # 6, Ground FloorBangladeshFax: +8802-9514404, +8802-48110580Phone: +8802-48121100, +880-2-9514477 Sharifa Khan\n\nSecretary, Economic Relations Division\n\nMinistry of Finance\n\nRoom: 03, Block: 08\n\nSher-e-Bangla Nagar, Dhaka.\n\nBangladesh\n\nFax: +8802-9180788\n\nPhone: +8802-48117636; +8801-844274269 (mobile)\n\n[email protected] Alternate Governor for People's Republic of Bangladesh in the Asian Development BankSecretary, Economic Relations DivisionMinistry of FinanceRoom: 03, Block: 08Sher-e-Bangla Nagar, Dhaka.BangladeshFax: +8802-9180788Phone: +8802-48117636; +8801-844274269 (mobile)\n\nBhutan Namgay Tshering\n\nFinance Minister\n\nMinistry of Finance\n\nP.O. Box 117\n\nTashichhodzong\n\nThimphu: Bhutan\n\nFax: +975-2-323154\n\nPhone: +975-2-323154; +975-2-322717\n\n[email protected] Governor for the Kingdom of Bhutan in the Asian Development BankFinance MinisterMinistry of FinanceP.O. Box 117TashichhodzongThimphu: BhutanFax: +975-2-323154Phone: +975-2-323154; +975-2-322717 Leki Wangmo\n\nActing Secretary\n\nMinistry of Finance\n\nP.O. Box 117\n\nTashichhodzong\n\nThimphu: Bhutan\n\nPhone: +975-2-323154; +975-2-335720\n\n[email protected] Alternate Governor for the Kingdom of Bhutan in the Asian Development BankActing SecretaryMinistry of FinanceP.O. Box 117TashichhodzongThimphu: BhutanPhone: +975-2-323154; +975-2-335720\n\nBrunei Darussalam Dato Dr. Amin Liew Abdullah\n\nMinister at the Prime Minister’s Office and Minister of Finance and Economy II\n\nLevel 18, Ministry of Finance and Economy Building\n\nCommonwealth Drive, Bandar Seri Begawan BB3910\n\nBrunei Darussalam\n\nFax: 673 2383816\n\nPhone: 673 2383819\n\n[email protected] Governor for Brunei Darussalam in the Asian Development BankMinister at the Prime Minister’s Office and Minister of Finance and Economy IILevel 18, Ministry of Finance and Economy BuildingCommonwealth Drive, Bandar Seri Begawan BB3910Brunei DarussalamFax: 673 2383816Phone: 673 2383819 Pengiran Datin Zety Sufina Dato Sani\n\nDeputy Minister of Finance and Economy (Fiscal)\n\nMinistry of Finance and Economy\n\nLevel 17 Ministry of Finance and Economy Building,\n\nCommonwealth Drive\n\nBandar Seri Begawan, Brunei Darussalam BB3910\n\nFax: +6732 383849\n\nPhone: +6732 383849\n\n[email protected] Alternate Governor for Brunei Darussalam in the Asian Development BankDeputy Minister of Finance and Economy (Fiscal)Ministry of Finance and EconomyLevel 17 Ministry of Finance and Economy Building,Commonwealth DriveBandar Seri Begawan, Brunei Darussalam BB3910Fax: +6732 383849Phone: +6732 383849\n\nCambodia Aun Pornmoniroth\n\nDeputy Prime Minister, Minister of Economy and Finance\n\nMinistry of Economy and Finance\n\nStreet 92, Sangkat Wat Phnom\n\nKhan Daun Penh\n\nPhnom Penh, Cambodia\n\nFax: +855 23 724 664\n\nPhone: +855 23 427 798\n\n[email protected] Governor for Kingdom of Cambodia in the Asian Development BankDeputy Prime Minister, Minister of Economy and FinanceMinistry of Economy and FinanceStreet 92, Sangkat Wat PhnomKhan Daun PenhPhnom Penh, CambodiaFax: +855 23 724 664Phone: +855 23 427 798 Vongsey Vissoth\n\nPermanent Secretary of State, Ministry of Economy and Finance\n\nStreet 92, Sangkat Wat Phnom\n\nKhan Daun Penh\n\nPhnom Penh, Cambodia\n\nFax: +855 23 430 169\n\n[email protected] Alternate Governor for Kingdom of Cambodia in the Asian Development BankPermanent Secretary of State, Ministry of Economy and FinanceStreet 92, Sangkat Wat PhnomKhan Daun PenhPhnom Penh, CambodiaFax: +855 23 430 169\n\nCanada Harjit S. Sajjan\n\nMinister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada\n\n125 Sussex Drive\n\nOttawa, Ontario\n\nK1A 0G2\n\nCanada\n\nFax: +1 613 996 9800\n\nPhone: 343-203-6238\n\n[email protected] .ca Governor for Canada in the Asian Development BankMinister of International Development and Minister responsible for the Pacific Economic Development Agency of Canada125 Sussex DriveOttawa, OntarioK1A 0G2CanadaFax: +1 613 996 9800Phone: 343-203-6238 Alternate Governor: Vacant\n\nChina, People's Republic of Liu Kun\n\nMinister of Finance\n\nSanlihe, Xicheng District\n\nBeijing 100820\n\nPeople's Republic of China\n\nFax: 86-10-68551125\n\nPhone: 86-10-68552873\n\n[email protected] Governor for the People's Republic of China in the Asian Development BankMinister of FinanceSanlihe, Xicheng DistrictBeijing 100820People's Republic of ChinaFax: 86-10-68551125Phone: 86-10-68552873 Wang Dongwei\n\nVice Finance Minister\n\nSanlihe Street, Xichengqu,\n\nBeijing 100820\n\nPeople's Republic of China\n\nFax: 86-10-68551119\n\nPhone: 86-10-68552058\n\n[email protected] Alternate Governor for the People's Republic of China in the Asian Development BankVice Finance MinisterSanlihe Street, Xichengqu,Beijing 100820People's Republic of ChinaFax: 86-10-68551119Phone: 86-10-68552058\n\nCook Islands Mark Brown\n\nPrime Minister of the Cook Islands\n\nGovernment of Cook Islands\n\nP.O. Box 3246\n\nRarotonga, Cook Islands\n\nFax: (682) 24178; (682) 21875\n\nPhone: (682) 29301\n\n[email protected] ; Governor for the Cook Islands in the Asian Development BankPrime Minister of the Cook IslandsGovernment of Cook IslandsP.O. Box 3246Rarotonga, Cook IslandsFax: (682) 24178; (682) 21875Phone: (682) 29301 [email protected] (Executive Assistant) Garth Henderson\n\nFinancial Secretary, Ministry of Finance and Economic Management\n\nMFEM Building\n\n1 Takuvaine Road\n\nP.O. Box 120 Avarua\n\nRarotonga, Cook Islands\n\nFax: (682) 23877; (682) 29465\n\nPhone: (682) 22878\n\n[email protected] ; Alternate Governor for the Cook Islands in the Asian Development BankFinancial Secretary, Ministry of Finance and Economic ManagementMFEM Building1 Takuvaine RoadP.O. Box 120 AvaruaRarotonga, Cook IslandsFax: (682) 23877; (682) 29465Phone: (682) 22878 [email protected] (Executive Assistant)\n\nDenmark Stephan Schönemann\n\nAmbassador and Under-Secretary for Global Development and Cooperation\n\nMinistry of Foreign Affairs\n\nAsiatisk Plads 2\n\nDK-1448 Copenhagen K\n\nDenmark\n\nFax: (45) 33 92 07 80 / (45) 33 92 07 48\n\nPhone: +45 32 5405 33; +45 32 5405 33\n\n[email protected] Governor for Denmark in the Asian Development BankAmbassador and Under-Secretary for Global Development and CooperationMinistry of Foreign AffairsAsiatisk Plads 2DK-1448 Copenhagen KDenmarkFax: (45) 33 92 07 80 / (45) 33 92 07 48Phone: +45 32 5405 33; +45 32 5405 33 Sigurd Halling Alternate Governor for Denmark in the Asian Development Bank\n\nHead of Department for Multilateral Cooperation\n\nMinistry of Foreign Affairs\n\nAsiatisk Plads 2\n\nDK-1448 Copenhagen K\n\nDenmark\n\nFiji Biman Prasad\n\nDeputy Prime Minister and Minister for Finance, Strategic Planning, National Development and Statistics\n\nRo Lalabalavu House, 370 Victoria Parade\n\nP O Box 2212, Government Buildings\n\nSuva, Republic of Fiji\n\nFax: (679) 3310807\n\nPhone: (679) 3309 866 Ext. 312301\n\n[email protected] Governor for the Republic of Fiji in the Asian Development BankDeputy Prime Minister and Minister for Finance, Strategic Planning, National Development and StatisticsRo Lalabalavu House, 370 Victoria ParadeP O Box 2212, Government BuildingsSuva, Republic of FijiFax: (679) 3310807Phone: (679) 3309 866 Ext. 312301 Shiri Krishna Gounder\n\nPermanent Secretary for Ministry of Finance, Strategic Planning and National Development and Statistics\n\nRo Lalabalavu House, 370 Victoria Parade\n\nP O Box 2212, Government Buildings\n\nSuva, Republic of Fiji\n\nFax: (679) 3223330\n\nPhone: (679) 330035\n\n[email protected] Alternate Governor for the Republic of Fiji in the Asian Development BankPermanent Secretary for Ministry of Finance, Strategic Planning and National Development and StatisticsRo Lalabalavu House, 370 Victoria ParadeP O Box 2212, Government BuildingsSuva, Republic of FijiFax: (679) 3223330Phone: (679) 330035\n\nFinland Pasi Hellman\n\nUnder-Secretary of State\n\nMinistry for Foreign Affairs\n\nLaivastokatu 22\n\nFIN-00160 Helsinki, Finland\n\nPhone: +358 295 350 945\n\n[email protected] , [email protected] Governor for Finland in the Asian Development BankUnder-Secretary of StateMinistry for Foreign AffairsLaivastokatu 22FIN-00160 Helsinki, FinlandPhone: +358 295 350 945 Titta Maja\n\nDirector General\n\nDepartment for Development Policy\n\nMinistry for Foreign Affairs\n\nLaivastokatu 22\n\nFIN-00160 Helsinki, Finland\n\nPhone: +358 295 351 916\n\n[email protected] Alternate Governor for Finland in the Asian Development BankDirector GeneralDepartment for Development PolicyMinistry for Foreign AffairsLaivastokatu 22FIN-00160 Helsinki, FinlandPhone: +358 295 351 916\n\nFrance Bruno Le Maire\n\nMinister for Economy and Finance\n\nMinistry of Economy and Finance\n\n139 rue de Bercy\n\n75572 Paris\n\nCedex 12, France\n\nPhone: 331-4487-1717\n\n[email protected] ; [email protected] Governor for France in the Asian Development BankMinister for Economy and FinanceMinistry of Economy and Finance139 rue de Bercy75572 ParisCedex 12, FrancePhone: 331-4487-1717 Emmanuel Moulin\n\nDirector General of the Treasury\n\nMinistry of Economy and Finance\n\n139 rue de Bercy - Télédoc 230\n\n75572 Cedex 12 Paris\n\nFrance\n\nPhone: +33 1 44 87 70 00\n\n[email protected] ; [email protected] ; [email protected] Alternate Governor for France in the Asian Development BankDirector General of the TreasuryMinistry of Economy and Finance139 rue de Bercy - Télédoc 23075572 Cedex 12 ParisFrancePhone: +33 1 44 87 70 00\n\nGeorgia Lasha Khutsishvili\n\nMinister of Finance of Georgia\n\n16 V, Gorgasali Street\n\n0114 Tbilisi, Georgia\n\nFax: 995-32-226-2409\n\nPhone: +99532 2262979\n\nMs. Salome Bakradze: Chair of the Board of Governors of the Asian Development Bank and Governor for Georgia in the Asian Development BankMinister of Finance of Georgia16 V, Gorgasali Street0114 Tbilisi, GeorgiaFax: 995-32-226-2409Phone: +99532 2262979Ms. Salome Bakradze: [email protected] Levan Davitashvili\n\nMinister of Economy and Sustainable Development\n\n2 Sanapiro Street\n\n0114 Tblisi, Georgia\n\nFax: +995 32 292 1534\n\nPhone: +995 595 009700 / +(995 32) 299 11 11\n\n[email protected] Alternate Governor for Georgia in the Asian Development BankMinister of Economy and Sustainable Development2 Sanapiro Street0114 Tblisi, GeorgiaFax: +995 32 292 1534Phone: +995 595 009700 / +(995 32) 299 11 11\n\nHong Kong, China Paul Chan Mo-po\n\nFinancial Secretary, the Government of Hong Kong Special Administrative Region\n\n25/F, Central Government Offices\n\n2 Tim Mei Avenue, Tamar\n\nHong Kong\n\nFax: +852 2840 0569\n\nPhone: +852 2810 2589\n\n[email protected] Governor for Hong Kong, China in the Asian Development BankFinancial Secretary, the Government of Hong Kong Special Administrative Region25/F, Central Government Offices2 Tim Mei Avenue, TamarHong KongFax: +852 2840 0569Phone: +852 2810 2589 Christopher Hui\n\nSecretary for Financial Services and the Treasury,\n\nthe Government of Hong Kong Special Administrative Region\n\n24/F, Central Government Offices\n\n2 Tim Mei Avenue, Tamar, Hong Kong\n\nFax: +852 2537 1736\n\nPhone: +852 2810 2280\n\n[email protected] ; [email protected] Alternate Governor for Hong Kong, China in the Asian Development BankSecretary for Financial Services and the Treasury,the Government of Hong Kong Special Administrative Region24/F, Central Government Offices2 Tim Mei Avenue, Tamar, Hong KongFax: +852 2537 1736Phone: +852 2810 2280\n\nIndia Nirmala Sitharaman\n\nMinister of Finance\n\nMinistry of Finance\n\nGovernment of India\n\nNew Delhi, India\n\nFax: 23092830 / 23092543\n\nPhone: 23092510 / 23092810\n\n[email protected] Governor for India in the Asian Development BankMinister of FinanceMinistry of FinanceGovernment of IndiaNew Delhi, IndiaFax: 23092830 / 23092543Phone: 23092510 / 23092810 Ajay Seth\n\nSecretary, Department of Economic Affairs\n\nMinistry of Finance\n\nGovernment of India, North Block\n\nNew Delhi 110001, India\n\nFax: 23094075\n\nPhone: 23092611 / 23092555\n\n[email protected] Alternate Governor for India in the Asian Development BankSecretary, Department of Economic AffairsMinistry of FinanceGovernment of India, North BlockNew Delhi 110001, IndiaFax: 23094075Phone: 23092611 / 23092555\n\nIndonesia Sri Mulyani Indrawati Governor for the Republic of Indonesia in the Asian Development Bank\n\nMinister of Finance\n\nMinistry of Finance of the Republic of Indonesia\n\nGedung Djuanda I\n\nJalan Dr. Wahidin Raya No. 1\n\nJakarta Pusat - Indonesia 10710\n\nFax: +6221-350 0842\n\nPhone: +6221-350 0840 Suharso Monoarfa Alternate Governor for the Republic of Indonesia in the Asian Development Bank\n\nMinister of National Development Planning/National Development Planning Agency\n\nMinistry of National Development Planning\n\nJalan Taman Surapati No. 2\n\nJakarta Pusat, Indonesia - 10310\n\nFax: +6221-3193 4779\n\nPhone: +6221-3193 4811\n\nJapan Shunichi Suzuki Governor for Japan in the Asian Development Bank\n\nMinister of Finance and Minister of State for Financial Services\n\nc/o Office of the Executive Director for Japan\n\n9th Floor, 6 ADB Ave, Mandaluyong City\n\n1550 Metro Manila Philippines\n\ncc: Financial Attache, Embassy of Japan\n\n2627 Roxas Blvd., Pasay 1300 Philippines\n\nFax: (632) 8632-6176 (ADB) (632) 8551-5783 (Embassy)\n\nPhone: (632) 8632-4444 (ADB) (632) 8551-5710 (Embassy) Kazuo Ueda Alternate Governor for Japan in the Asian Development Bank\n\nGovernor, Bank of Japan\n\nc/o Office of the Executive Director for Japan\n\n9th Floor, 6 ADB Avenue, Mandaluyong City\n\n1550 Metro Manila, Philippines\n\ncc: Financial Attache, Embassy of Japan\n\n2627 Roxas Boulevard, Pasay City 1300, Philippines\n\nFax: (632) 8632-6176 (ADB) (632) 8551-5783 (Embassy)\n\nPhone: (632) 8632-4444 (ADB) (632) 8551-5710 (Embassy)\n\nKazakhstan Alibek Kuantyrov\n\nMinister of National Economy\n\nMinistry of National Economy\n\n8 building, Mangilik El Avenue\n\nEsil District, Nur-Sultan City 010000\n\nRepublic of Kazakhstan\n\nFax: (7-7172) 743824\n\nPhone: (7-7172) 743801\n\n[email protected] ; [email protected] ; Governor for the Republic of Kazakhstan in the Asian Development BankMinister of National EconomyMinistry of National Economy8 building, Mangilik El AvenueEsil District, Nur-Sultan City 010000Republic of KazakhstanFax: (7-7172) 743824Phone: (7-7172) 743801 Dauren Kenbeil\n\nVice Minister of Finance\n\nMinistry of Finance\n\nHouse of Ministries, 8, Mangilik El Av., Entry 4\n\nNur-Sultan City 010000\n\nRepublic of Kazakhstan\n\nFax: (7-7172) 750476\n\nPhone: (7-7172) 750239/750230\n\nAssel Ismailova ( Alternate Governor for the Republic of Kazakhstan in the Asian Development BankVice Minister of FinanceMinistry of FinanceHouse of Ministries, 8, Mangilik El Av., Entry 4Nur-Sultan City 010000Republic of KazakhstanFax: (7-7172) 750476Phone: (7-7172) 750239/750230Assel Ismailova ( [email protected] );\n\nKiribati Teuea Toatu\n\nVice President and Minister for Finance and Economic Development\n\nP. O. Box 67\n\nBairiki, Tarawa\n\nKiribati\n\nFax: (686) 21307\n\nPhone: (686) 21802\n\n[email protected] ; [email protected] Governor for the Republic of Kiribati in the Asian Development BankVice President and Minister for Finance and Economic DevelopmentP. O. Box 67Bairiki, TarawaKiribatiFax: (686) 21307Phone: (686) 21802 Koin Uriam Kiritione\n\nSecretary of the Ministry of Finance and Economic Development\n\nP.O. Box 67\n\nBairiki, Tarawa\n\nKiribati\n\nFax: (686) 21307\n\nPhone: +686 74021806\n\n[email protected] Alternate Governor for the Republic of Kiribati in the Asian Development BankSecretary of the Ministry of Finance and Economic DevelopmentP.O. Box 67Bairiki, TarawaKiribatiFax: (686) 21307Phone: +686 74021806\n\nKorea, Republic of Kyungho Choo\n\nDeputy Prime Minister and Minister of Economy and Finance\n\nMinistry of Economy and Finance\n\nSejong Government Complex\n\n477, Galmae-ro, Sejong-si, 30109\n\nRepublic of Korea\n\nFax: 82-44-215-8000\n\nPhone: 82-44-215-2000\n\n[email protected] Governor for the Republic of Korea in the Asian Development BankDeputy Prime Minister and Minister of Economy and FinanceMinistry of Economy and FinanceSejong Government Complex477, Galmae-ro, Sejong-si, 30109Republic of KoreaFax: 82-44-215-8000Phone: 82-44-215-2000 Chang Yong Rhee\n\nGovernor, The Bank of Korea\n\n67, Sejong-daero, Jung-gu\n\nSeoul\n\nRepublic of Korea\n\nFax: +82-2-759-4758\n\nPhone: +82-2-759-5755/+82-2-759-5719\n\n[email protected] ; [email protected] Alternate Governor for the Republic of Korea in the Asian Development BankGovernor, The Bank of Korea67, Sejong-daero, Jung-guSeoulRepublic of KoreaFax: +82-2-759-4758Phone: +82-2-759-5755/+82-2-759-5719\n\nLao People's Democratic Republic Santiphab Phomvihane Governor for the Lao People's Democratic Republic in the Asian Development Bank\n\nMinister of Finance\n\nMinistry of Finance\n\n23 Singha Road\n\nP. O. Box 46\n\nVientiane\n\nLao People's Democratic Republic\n\nFax: (856 21) 911-366\n\nPhone: (856-21) 412-409, 417-459 Vathana Dalaloy\n\nVice Governor, Bank of Lao PDR\n\nYonnet Road\n\nVientiane\n\nLao People's Democratic Republic\n\nFax: (856-21) 213100\n\nPhone: (856-21) 21213202\n\n[email protected] Alternate Governor for the Lao People's Democratic Republic in the Asian Development BankVice Governor, Bank of Lao PDRYonnet RoadVientianeLao People's Democratic RepublicFax: (856-21) 213100Phone: (856-21) 21213202\n\nMalaysia Anwar Ibrahim\n\nPrime Minister and Minister of Finance\n\nLevel 12, Centre Block\n\nMinistry of Finance\n\nPrecinct 2, 62592 Putrajaya\n\nMalaysia\n\nFax: (+6)03-8882 3049\n\nPhone: (+6)03-8882 9178 / 9176\n\nMr. Abu Bakar Hj. Jambol ( Governor for Malaysia in the Asian Development BankPrime Minister and Minister of FinanceLevel 12, Centre BlockMinistry of FinancePrecinct 2, 62592 PutrajayaMalaysiaFax: (+6)03-8882 3049Phone: (+6)03-8882 9178 / 9176Mr. Abu Bakar Hj. Jambol ( [email protected] ); Ms. Nuwairani Khalid ( [email protected] ); Mr. Pua Kian Sien ( [email protected] ); Datuk Johan Mahmood Merican\n\nSecretary General of Treasury\n\nLevel 10, Centre Block\n\nMinistry of Finance\n\nNo. 5 Persiaran Perdana Presint 2\n\nFederal Government Administrative Centre\n\n62592 WP Putrajaya, Malaysia\n\nPhone: (+6) 03-8882 3333; (+6) 03-8882 4224\n\n[email protected] Alternate Governor for Malaysia in the Asian Development BankSecretary General of TreasuryLevel 10, Centre BlockMinistry of FinanceNo. 5 Persiaran Perdana Presint 2Federal Government Administrative Centre62592 WP Putrajaya, MalaysiaPhone: (+6) 03-8882 3333; (+6) 03-8882 4224\n\nMaldives Ibrahim Ameer\n\nMinister of Finance\n\nMinistry of Finance\n\nBlock 20379, Ameenee Magu Male\n\nMaldives\n\nFax: (960) 332 4432\n\nPhone: (960) 334-9200\n\n[email protected] Governor for Maldives in the Asian Development BankMinister of FinanceMinistry of FinanceBlock 20379, Ameenee Magu MaleMaldivesFax: (960) 332 4432Phone: (960) 334-9200 Mariyam Manarath Muneer\n\nDeputy Minister of Finance\n\nMinistry of Finance\n\nBlock 20379, Ameenee Magu Male\n\nMaldives\n\nFax: (960) 332 -7802 / 332-4432\n\nPhone: (960) 334-9430\n\n[email protected] ; [email protected] Alternate Governor for Maldives in the Asian Development BankDeputy Minister of FinanceMinistry of FinanceBlock 20379, Ameenee Magu MaleMaldivesFax: (960) 332 -7802 / 332-4432Phone: (960) 334-9430\n\nMicronesia, Federated States of Eugene Amor\n\nSecretary of Finance and Administration\n\nPO Box PS 158\n\nPalikir, Pohnpei\n\nFederated States of Micronesia 96941\n\nFax: (691) 320-5852\n\nPhone: (691) 320-2640\n\n[email protected] ; [email protected] Governor for the Federated States of Micronesia in the Asian Development BankSecretary of Finance and AdministrationPO Box PS 158Palikir, PohnpeiFederated States of Micronesia 96941Fax: (691) 320-5852Phone: (691) 320-2640 Lorin Robert\n\nSpecial Assistant to the President on Foreign and Political Affairs\n\nOffice of the President\n\nFSM National Government\n\nPO Box PS 34\n\nPalikir, Pohnpei FM 96941\n\nFederated States of Micronesia\n\nFax: (691) 320-2649\n\n[email protected] Alternate Governor for the Federated States of Micronesia in the Asian Development BankSpecial Assistant to the President on Foreign and Political AffairsOffice of the PresidentFSM National GovernmentPO Box PS 34Palikir, Pohnpei FM 96941Federated States of MicronesiaFax: (691) 320-2649\n\nMongolia Javkhlan Bold\n\nMinister of Finance\n\nGovernment Building No. 2\n\nS. Danzangiin Gudamj 5/1\n\nUlaanbaatar 15160\n\nMongolia\n\nFax: (976 51) 260247\n\nPhone: (976 51) 264694\n\n[email protected] ; [email protected] Governor for Mongolia in the Asian Development BankMinister of FinanceGovernment Building No. 2S. Danzangiin Gudamj 5/1Ulaanbaatar 15160MongoliaFax: (976 51) 260247Phone: (976 51) 264694 Lkhagvasuren Byadran\n\nGovernor, Bank of Mongolia (The Central Bank)\n\nBaga Toiruu-3, 15160\n\nUlaanbaatar-46\n\nMongolia\n\nFax: (976 11) 311471\n\nPhone: (976 11) 322169\n\nMs. Anu Molor - Alternate Governor for Mongolia in the Asian Development BankGovernor, Bank of Mongolia (The Central Bank)Baga Toiruu-3, 15160Ulaanbaatar-46MongoliaFax: (976 11) 311471Phone: (976 11) 322169Ms. Anu Molor - [email protected]\n\nMyanmar U Soe Win (Information as of January 2021)\n\nUnion Minister\n\nMinistry of Planning, Finance and Industry\n\nOffice Building No. 26, Nay Pyi Taw\n\nRepublic of the Union of Myanmar\n\nFax: +95 67 410 194\n\nPhone: +95 67 410 045\n\n[email protected] Governor for Republic of the Union of Myanmar in the Asian Development BankUnion MinisterMinistry of Planning, Finance and IndustryOffice Building No. 26, Nay Pyi TawRepublic of the Union of MyanmarFax: +95 67 410 194Phone: +95 67 410 045 U Tun Tun Naing (Information as of January 2021)\n\nPermanent Secretary\n\nMinistry of Planning, Finance and Industry\n\nOffice Building No. 32, Nay Pyi Taw\n\nRepublic of the Union of Myanmar\n\nFax: +95 67 406 410\n\nPhone: +95 67 406 411, 406 412\n\n[email protected] Alternate Governor for Republic of the Union of Myanmar in the Asian Development BankPermanent SecretaryMinistry of Planning, Finance and IndustryOffice Building No. 32, Nay Pyi TawRepublic of the Union of MyanmarFax: +95 67 406 410Phone: +95 67 406 411, 406 412\n\nNauru Martin Hunt MP\n\nMinister for Finance\n\nGovernment Offices, Yaren District\n\nRepublic of Nauru\n\nPhone: +674 557 3702; +674 557 3004\n\n[email protected] Governor for Nauru in the Asian Development BankMinister for FinanceGovernment Offices, Yaren DistrictRepublic of NauruPhone: +674 557 3702; +674 557 3004 John Petersen\n\nAdviser to the Minister for Finance\n\nDepartment of Finance, Ministry of Finance and Sustainable Development\n\nGovernment Offices, Yaren District\n\nRepublic of Nauru\n\nPhone: +61 417 750 989; +674 5573037\n\n[email protected] Alternate Governor for Nauru in the Asian Development BankAdviser to the Minister for FinanceDepartment of Finance, Ministry of Finance and Sustainable DevelopmentGovernment Offices, Yaren DistrictRepublic of NauruPhone: +61 417 750 989; +674 5573037\n\nNepal Prakash Sharan Mahat\n\nFinance Minister\n\nMinistry of Finance\n\nSinghadurbar\n\nKathmandu, Nepal\n\nFax: 977-1-4211 831\n\nPhone: 977-1-4200 417\n\n[email protected] Governor for Nepal in the Asian Development BankFinance MinisterMinistry of FinanceSinghadurbarKathmandu, NepalFax: 977-1-4211 831Phone: 977-1-4200 417 Arjun Prasad Pokharel\n\nSecretary for Ministry of Finance\n\nMinistry of Finance\n\nSinghadurbar\n\nKathmandu, Nepal\n\nFax: 9771 4211 164 / 9771 4211 165\n\nPhone: 977-1-4211161\n\n[email protected] Alternate Governor for Nepal in the Asian Development BankSecretary for Ministry of FinanceMinistry of FinanceSinghadurbarKathmandu, NepalFax: 9771 4211 164 / 9771 4211 165Phone: 977-1-4211161\n\nThe Netherlands Liesje Schreinemacher\n\nMinister for Foreign Trade and Development Cooperation\n\nMinistry of Foreign Affairs\n\nRijnstraat 8\n\nP.O. Box 20061, 2500 EB\n\nThe Hague, The Netherlands\n\nPhone: (31 – 70) 348 5026\n\n[email protected] Governor for The Netherlands in the Asian Development BankMinister for Foreign Trade and Development CooperationMinistry of Foreign AffairsRijnstraat 8P.O. Box 20061, 2500 EBThe Hague, The NetherlandsPhone: (31 – 70) 348 5026 Kitty van der Heijden\n\nDirector General, International Cooperation\n\nMinistry of Foreign Affairs\n\nBezuidenhoutseweg 67\n\nP.O. Box 20061, 2500 EB\n\nThe Hague, The Netherlands\n\nPhone: +31 70-348-6426\n\n[email protected] Alternate Governor for The Netherlands in the Asian Development BankDirector General, International CooperationMinistry of Foreign AffairsBezuidenhoutseweg 67P.O. Box 20061, 2500 EBThe Hague, The NetherlandsPhone: +31 70-348-6426\n\nNew Zealand Grant Robertson\n\nMinister of Finance\n\nPrivate Bag 18888\n\nParliament Buildings\n\nWellington 6160 New Zealand\n\nPhone: +64 4 817 8703\n\n[email protected] ; [email protected] Governor for New Zealand in the Asian Development BankMinister of FinancePrivate Bag 18888Parliament BuildingsWellington 6160 New ZealandPhone: +64 4 817 8703 Caralee McLiesh\n\nSecretary to the Treasury and Chief Executive\n\nThe Treasury\n\n1 The Terrace\n\nP.O. Box 3724, Wellington, New Zealand\n\nFax: +64 4 471 5191\n\nPhone: +64 4 917 6989\n\n[email protected] ; [email protected] Alternate Governor for New Zealand in the Asian Development BankSecretary to the Treasury and Chief ExecutiveThe Treasury1 The TerraceP.O. Box 3724, Wellington, New ZealandFax: +64 4 471 5191Phone: +64 4 917 6989\n\nNiue Dalton Emani Makamau Tagelagi\n\nPremier of Niue\n\nPO Box 40, Alofi\n\nNiue Island\n\nPhone: +(683) 4200\n\n[email protected] Governor for Niue in the Asian Development BankPremier of NiuePO Box 40, AlofiNiue IslandPhone: +(683) 4200 Wayne McCaughan\n\nGeneral Manager, Niue Development Bank\n\nAlofi, Niue Island\n\nPhone: +(683) 4220\n\n[email protected] Alternate Governor for Niue in the Asian Development BankGeneral Manager, Niue Development BankAlofi, Niue IslandPhone: +(683) 4220\n\nNorway Bjørg Sandkjær\n\nState Secretary (International Development)\n\nRoyal Ministry of Foreign Affairs\n\n7 Juni-Plassen, Victoria Terrase\n\nPB 8114 Dep. N-0032 Oslo, Norway\n\nPhone: +4723 950 050\n\n[email protected] Governor for Norway in the Asian Development BankState Secretary (International Development)Royal Ministry of Foreign Affairs7 Juni-Plassen, Victoria TerrasePB 8114 Dep. N-0032 Oslo, NorwayPhone: +4723 950 050 Bjørn Brede Hansen\n\nDirector\n\nSection for Multilateral Development Banks Royal Ministry of Foreign Affairs\n\nP. O. Box 8114 Dep.\n\n0032 Oslo 1, Norway\n\nFax: (47-2) 224-9580/81\n\nPhone: +47 23 95 15 33\n\n[email protected] Alternate Governor for Norway in the Asian Development BankDirectorSection for Multilateral Development Banks Royal Ministry of Foreign AffairsP. O. Box 8114 Dep.0032 Oslo 1, NorwayFax: (47-2) 224-9580/81Phone: +47 23 95 15 33\n\nPakistan Sardar Ayaz Sadiq\n\nMinister for Economic Affairs\n\nEconomic Affairs Division\n\nMinistry of Economic Affairs\n\n3rd Floor, C-Block, Pak Secretariat\n\nIslamabad, Pakistan\n\nFax: +92-51-9104016\n\nPhone: +92-51-9103961\n\n[email protected] Governor for the Islamic Republic of Pakistan in the Asian Development BankMinister for Economic AffairsEconomic Affairs DivisionMinistry of Economic Affairs3rd Floor, C-Block, Pak SecretariatIslamabad, PakistanFax: +92-51-9104016Phone: +92-51-9103961 Kazim Niaz\n\nSecretary, Ministry of Economic Affairs\n\nEconomic Affairs Division\n\nC-Block, Pak Secretariat\n\nIslamabad, Pakistan\n\nFax: (92-51) 9104016\n\nPhone: +92-51-9212769/ 9210629\n\n[email protected] Alternate Governor for the Islamic Republic of Pakistan in the Asian Development BankSecretary, Ministry of Economic AffairsEconomic Affairs DivisionC-Block, Pak SecretariatIslamabad, PakistanFax: (92-51) 9104016Phone: +92-51-9212769/ 9210629\n\nPapua New Guinea Ian Ling-Stuckey MP\n\nMinister for Treasury\n\nOffice of the Minister\n\nLevel 10, Treasury Building\n\nP. O. Box 542, Waigani 131\n\nPort Moresby, NCD\n\nPapua New Guinea\n\nFax: 675-323-2319\n\nPhone: +675 313 3587/3521\n\n[email protected] / [email protected] / [email protected] Governor for Papua New Guinea in the Asian Development BankMinister for TreasuryOffice of the MinisterLevel 10, Treasury BuildingP. O. Box 542, Waigani 131Port Moresby, NCDPapua New GuineaFax: 675-323-2319Phone: +675 313 3587/3521 Andrew Oaeke\n\nSecretary for Treasury\n\nDepartment of Treasury\n\nLevel 10, Treasury Building\n\nP.O. Box 542\n\nWaigani-131, NCD\n\nPapua New Guinea\n\nFax: 675-328-8804 / P.O. Box 5428844\n\nPhone: (675) 313 3614\n\n[email protected] ; [email protected] ; [email protected] Alternate Governor for Papua New Guinea in the Asian Development BankSecretary for TreasuryDepartment of TreasuryLevel 10, Treasury BuildingP.O. Box 542Waigani-131, NCDPapua New GuineaFax: 675-328-8804 / P.O. Box 5428844Phone: (675) 313 3614\n\nPortugal Fernando Medina\n\nMinister of Finance\n\nMinistry of Finance\n\nAv. Infante D. Henrique, No 1, 1o\n\n1149-009 Lisboa\n\nPortugal\n\nFax: 351 21 881 68 62\n\nPhone: 351 21 881 68 00\n\n[email protected] ; [email protected] ; [email protected] ; [email protected] ; [email protected] Governor for Portugal in the Asian Development BankMinister of FinanceMinistry of FinanceAv. Infante D. Henrique, No 1, 1o1149-009 LisboaPortugalFax: 351 21 881 68 62Phone: 351 21 881 68 00 Bernardo Ivo Cruz\n\nSecretary of State for Internationalization\n\nMinistry of Foreign Affairs\n\nLargo do Rilvas - 1399-030\n\nLisboa, Portugal\n\nFax: (+351) 21 394 60 70\n\nPhone: (+351) 21 394 6403 or (+351) 21 394 6405\n\n[email protected] ; [email protected] Alternate Governor for Portugal in the Asian Development BankSecretary of State for InternationalizationMinistry of Foreign AffairsLargo do Rilvas - 1399-030Lisboa, PortugalFax: (+351) 21 394 60 70Phone: (+351) 21 394 6403 or (+351) 21 394 6405\n\nSamoa Mulipola Anarosa Ale Molioo\n\nMinister of Finance\n\nLevel 5, FMFMII Building,\n\nMatagialalua,\n\nApia, Samoa\n\nFax: (685) 21312 / (685) 24779\n\nPhone: (685) 34364; (685) 34393; (685) 33060\n\n[email protected] Governor for the Independent State of Samoa in the Asian Development BankMinister of FinanceLevel 5, FMFMII Building,Matagialalua,Apia, SamoaFax: (685) 21312 / (685) 24779Phone: (685) 34364; (685) 34393; (685) 33060 Saoleitiiti Maeva Betham-Vaai\n\nChief Executive Officer\n\nMinistry of Finance\n\nLevel 6, Central Bank of Samoa Building\n\n2 Apia Boulevard\n\nApia\n\nSamoa\n\nPhone: (685) 34331\n\n[email protected] Alternate Governor for the Independent State of Samoa in the Asian Development BankChief Executive OfficerMinistry of FinanceLevel 6, Central Bank of Samoa Building2 Apia BoulevardApiaSamoaPhone: (685) 34331\n\nSingapore Lawrence Wong\n\nDeputy Prime Minister and Minister for Finance\n\nMinistry of Finance\n\nThe Treasury 100 High Street #10-00\n\n179434 Singapore\n\nFax: (65) 63374134\n\n[email protected] Governor for the Republic of Singapore in the Asian Development BankDeputy Prime Minister and Minister for FinanceMinistry of FinanceThe Treasury 100 High Street #10-00179434 SingaporeFax: (65) 63374134 Tan Ching Yee\n\nPermanent Secretary for Finance\n\nMinistry of Finance\n\nThe Treasury 100 High Street #10-00\n\n179434 Singapore\n\nFax: (65) 6337.4134\n\nPhone: (65) 6332.7207\n\n[email protected] Alternate Governor for the Republic of Singapore in the Asian Development BankPermanent Secretary for FinanceMinistry of FinanceThe Treasury 100 High Street #10-00179434 SingaporeFax: (65) 6337.4134Phone: (65) 6332.7207\n\nSolomon Islands Harry Degruit Kuma\n\nMinister for Finance and Treasury\n\nMinistry of Finance and Treasury\n\nPO Box 26, Honiara\n\nSolomon Islands\n\nFax: +677 27855\n\nPhone: +677 21074 (office)\n\n[email protected] Governor for the Solomon Islands in the Asian Development BankMinister for Finance and TreasuryMinistry of Finance and TreasuryPO Box 26, HoniaraSolomon IslandsFax: +677 27855Phone: +677 21074 (office) Mckinnie Dentana\n\nPermanent Secretary to the Ministry of Finance and Treasury\n\nP.O. Box 26, Honiara\n\nSolomon Islands\n\nFax: (677) 27855\n\nPhone: (677) 21074\n\n[email protected] , [email protected] Alternate Governor for the Solomon Islands in the Asian Development BankPermanent Secretary to the Ministry of Finance and TreasuryP.O. Box 26, HoniaraSolomon IslandsFax: (677) 27855Phone: (677) 21074\n\nSpain Nadia Calviño Santamaria\n\nFirst Vice-President of the Government of Spain and Minister of Economic Affairs and Digital Transition\n\nFirst Vice-Presidency and Ministry of Economic Affairs and Digital Transition\n\nPº Castellana, 162 – 2nd floor\n\n28071 Madrid, Spain\n\nPhone: +34 916037875 / 7869\n\n[email protected] ; [email protected] Governor for Spain in the Asian Development BankFirst Vice-President of the Government of Spain and Minister of Economic Affairs and Digital TransitionFirst Vice-Presidency and Ministry of Economic Affairs and Digital TransitionPº Castellana, 162 – 2nd floor28071 Madrid, SpainPhone: +34 916037875 / 7869 Gonzalo Garcia Andres\n\nSecretary of State for Economy and Business Affairs\n\nFirst Vice-presidency and Ministry of Economic Affairs and Digital Transition\n\nPº Castellana, 162 – 2nd floor\n\n28071 Madrid, Spain\n\nFax: +34 91 603 78 43\n\nPhone: +34 91 603 78 46\n\n[email protected] ; [email protected] ; [email protected] Alternate Governor for Spain in the Asian Development BankSecretary of State for Economy and Business AffairsFirst Vice-presidency and Ministry of Economic Affairs and Digital TransitionPº Castellana, 162 – 2nd floor28071 Madrid, SpainFax: +34 91 603 78 43Phone: +34 91 603 78 46\n\nSri Lanka Ranil Wickremesinghe\n\nPresident and Minister of Finance, Economic Stabilization and National Policies\n\nThe Secretariat\n\nColombo 01\n\nSri Lanka\n\nFax: 0112422507\n\nPhone: 011 2484600, 011 2151430\n\n[email protected] ; [email protected] Governor for the Democratic Socialist Republic of Sri Lanka in the Asian Development BankPresident and Minister of Finance, Economic Stabilization and National PoliciesThe SecretariatColombo 01Sri LankaFax: 0112422507Phone: 011 2484600, 011 2151430 K. M. Mahinda Siriwardana\n\nSecretary to the Treasury and Ministry of Finance, Economic Stabilization and National Policies\n\nThe Secretariat\n\nColombo 01\n\nSri Lanka\n\nFax: 011 2433349\n\nPhone: 011 2484510\n\n[email protected] Alternate Governor for the Democratic Socialist Republic of Sri Lanka in the Asian Development BankSecretary to the Treasury and Ministry of Finance, Economic Stabilization and National PoliciesThe SecretariatColombo 01Sri LankaFax: 011 2433349Phone: 011 2484510\n\nSweden Diana Janse\n\nState Secretary to the Minister for International Development Cooperation and Foreign Trade\n\nUtrikesdepartementet\n\nGustav Adolfs torg 1 SE 103 33 Stockholm\n\nSweden\n\nhttps://www.government.se/government-of-sweden/ministry-for-foreign-aff…\n\nFax: (46-8) 723-1176\n\nPhone: (46-8) 405-5574; 405-1000\n\nGovernor for Sweden in the Asian Development BankState Secretary to the Minister for International Development Cooperation and Foreign TradeUtrikesdepartementetGustav Adolfs torg 1 SE 103 33 StockholmSwedenFax: (46-8) 723-1176Phone: (46-8) 405-5574; 405-1000 [email protected] ; cc: [email protected] Sigrún Rawet\n\nDeputy Director-General Head of Global Agenda Department\n\nMinistry for Foreign Affairs\n\n103 39 Stockholm\n\nSweden\n\nPhone: +46 (0) 8 405 4256; Cell Ph. +46730862165\n\n[email protected] Alternate Governor for Sweden in the Asian Development BankDeputy Director-General Head of Global Agenda DepartmentMinistry for Foreign Affairs103 39 StockholmSwedenPhone: +46 (0) 8 405 4256; Cell Ph. +46730862165\n\nSwitzerland Dominique Paravicini\n\nHead of Economic Cooperation and Development\n\nState Secretariat for Economic Affairs SECO\n\nHolzikofenweg 36\n\n3003 Bern, Switzerland\n\nFax: 004131-3240954 or 3249239\n\nPhone: 004131-324-0754\n\n[email protected] ; [email protected] ; [email protected] ; [email protected] ; [email protected] Vice Chair of the Board of Governors of the Asian Development Bank and Governor for Switzerland in the Asian Development BankHead of Economic Cooperation and DevelopmentState Secretariat for Economic Affairs SECOHolzikofenweg 363003 Bern, SwitzerlandFax: 004131-3240954 or 3249239Phone: 004131-324-0754 Arno Wicki\n\nVice Director, Swiss Development Corporation and Head of the Section Asia and Latin America\n\nSwiss Agency for Development and Cooperation (SDC)\n\nFederal Department of Foreign Affairs\n\nFreiburgstrasse 130, 3003 Berne, Switzerland\n\nFax: 0041-31-323-2610\n\nPhone: 0041-31-322-5191\n\n[email protected] ; [email protected] ; [email protected] Alternate Governor for Switzerland in the Asian Development BankVice Director, Swiss Development Corporation and Head of the Section Asia and Latin AmericaSwiss Agency for Development and Cooperation (SDC)Federal Department of Foreign AffairsFreiburgstrasse 130, 3003 Berne, SwitzerlandFax: 0041-31-323-2610Phone: 0041-31-322-5191\n\nTajikistan Davlatali S. Said\n\nGovernor, Khatlon Region\n\nGovernment of Tajikistan\n\n80, Rudaki Avenue\n\nDushanbe, Tajikistan, 734001\n\nFax: 992 372 215 956\n\nPhone: 992 372 215 956\n\n[email protected] Governor for Republic of Tajikistan in the Asian Development BankGovernor, Khatlon RegionGovernment of Tajikistan80, Rudaki AvenueDushanbe, Tajikistan, 734001Fax: 992 372 215 956Phone: 992 372 215 956 Sadi Qodirzoda\n\nChairperson of the State Committee on Investment and State Property\n\n27, Shohtemur Street\n\n734000, Dushanbe, Tajikistan\n\nFax: +992 372 215729\n\nPhone: +992 372 218659\n\n[email protected] Alternate Governor for Republic of Tajikistan in the Asian Development BankChairperson of the State Committee on Investment and State Property27, Shohtemur Street734000, Dushanbe, TajikistanFax: +992 372 215729Phone: +992 372 218659\n\nThailand Arkhom Termpittayapaisith\n\nMinister of Finance\n\nMinistry of Finance\n\nRama VI Road\n\nBangkok, Thailand\n\nFax: 662 273 9404\n\nPhone: 662 126 5751\n\n[email protected] Governor for the Kingdom of Thailand in the Asian Development BankMinister of FinanceMinistry of FinanceRama VI RoadBangkok, ThailandFax: 662 273 9404Phone: 662 126 5751 Krisada Chinavicharana\n\nPermanent Secretary\n\nMinistry of Finance\n\nRama VI Road\n\nBangkok, Thailand\n\n(i) e-mail: (ii) telephone number: (iii) fax number:\n\nFax: 662 273 9402\n\nPhone: 662 126 5861\n\n[email protected] , [email protected] Alternate Governor for the Kingdom of Thailand in the Asian Development BankPermanent SecretaryMinistry of FinanceRama VI RoadBangkok, Thailand(i) e-mail: (ii) telephone number: (iii) fax number:Fax: 662 273 9402Phone: 662 126 5861\n\nTonga Tiofilusi Tiueti\n\nMinister for Finance and National Planning and Minister for Revenue and Customs\n\nMinistry of Finance\n\nP.O. Box 87, Level 3, St. George Government Building\n\nNuku'alofa, Tonga\n\nFax: (676)26-011; (676)21010\n\nPhone: (676)28-644 Direct: (676)7400710\n\n[email protected] ; Governor for the Kingdom of Tonga in the Asian Development BankMinister for Finance and National Planning and Minister for Revenue and CustomsMinistry of FinanceP.O. Box 87, Level 3, St. George Government BuildingNuku'alofa, TongaFax: (676)26-011; (676)21010Phone: (676)28-644 Direct: (676)7400710 Kilisitina Tiane Moala-Tuaimei’api\n\nChief Executive Officer\n\nMinistry of Finance\n\nSt. George Government Building Vuna Road\n\nPO Box 87 Nuku’alofa\n\nTonga\n\n[email protected] Alternate Governor for the Kingdom of Tonga in the Asian Development BankChief Executive OfficerMinistry of FinanceSt. George Government Building Vuna RoadPO Box 87 Nuku’alofaTonga\n\nTürkiye Murat Zaman\n\nDeputy Minister of Treasury and Finance\n\nMinistry of Treasury and Finance\n\nInönü Bulvarı No. 36\n\n06510 Emek, Ankara\n\nTürkiye\n\nFax: +90 (312) 212 22 97\n\nPhone: +90 (312) 204 71 61\n\n[email protected] r; [email protected] Governor for Türkiye in the Asian Development BankDeputy Minister of Treasury and FinanceMinistry of Treasury and FinanceInönü Bulvarı No. 3606510 Emek, AnkaraTürkiyeFax: +90 (312) 212 22 97Phone: +90 (312) 204 71 61 Kerem Dönmez\n\nDirector General for Foreign Economic Relations\n\nMinistry of Treasury and Finance\n\nÝnönü Bulvarý No:36 06510 Emek / Ankara\n\nRepublic of Türkiye\n\nFax: +90 312 204 73 66/67\n\nPhone: +90 312 204 73 57\n\n[email protected] ; [email protected] Alternate Governor for Türkiye in the Asian Development BankDirector General for Foreign Economic RelationsMinistry of Treasury and FinanceÝnönü Bulvarý No:36 06510 Emek / AnkaraRepublic of TürkiyeFax: +90 312 204 73 66/67Phone: +90 312 204 73 57\n\nTurkmenistan Toyly Malikov\n\nChairman of the Board of the Central Bank of Turkmenistan\n\n36, Bitarap Turkmenistan Street\n\n744000 Ashgabat, Turkmenistan\n\nFax: 993-12-925086\n\nPhone: 993-12-381004/ 03\n\nGovernor for Turkmenistan in the Asian Development BankChairman of the Board of the Central Bank of Turkmenistan36, Bitarap Turkmenistan Street744000 Ashgabat, TurkmenistanFax: 993-12-925086Phone: 993-12-381004/ 03 [email protected] and [email protected] Alternate Governor: Vacant\n\nTuvalu Seve Paeniu\n\nMinister of Finance\n\nMinistry of Finance\n\nGovernment of Tuvalu\n\nFunafuti\n\nTuvalu\n\nPhone: +688 20 201 ext 3074\n\n[email protected] ; [email protected] Governor for Tuvalu in the Asian Development BankMinister of FinanceMinistry of FinanceGovernment of TuvaluFunafutiTuvaluPhone: +688 20 201 ext 3074 Taufia Patolo\n\nSecretary of Finance\n\nMinistry of Finance and Economic Development\n\nGovernment of Tuvalu\n\nVaiaku, Funafuti, Tuvalu\n\nPhone: +688 20408; +688 20202\n\n[email protected] ; [email protected] Alternate Governor for Tuvalu in the Asian Development BankSecretary of FinanceMinistry of Finance and Economic DevelopmentGovernment of TuvaluVaiaku, Funafuti, TuvaluPhone: +688 20408; +688 20202\n\nUnited States Janet Yellen Governor for the United States in the Asian Development Bank\n\nSecretary, U.S. Department of the Treasury\n\n1500 Pennsylvania Avenue\n\nNW Washington, D.C. 20220\n\nUnited States of America Jose Fernandez Alternate Governor for the United States in the Asian Development Bank\n\nUnder Secretary for Economic Growth, Energy and the Environment, U.S. State Department\n\n2201 C St NW, Washington, DC 20520\n\nUnited States of America\n\nVanuatu John Dahmasing Salong MP\n\nMinister of Finance and Economic Management\n\nPrivate Mail Bag 9058\n\nPort Vila, Vanuatu\n\nFax: 678-27937; 25533\n\nPhone: 678-23032\n\n[email protected] Governor for the Republic of Vanuatu in the Asian Development BankMinister of Finance and Economic ManagementPrivate Mail Bag 9058Port Vila, VanuatuFax: 678-27937; 25533Phone: 678-23032 Letlet August\n\nDirector General, Ministry of Finance and Economic Management\n\nPrivate Mail Bag 9058\n\nPort Vila\n\nVanuatu\n\nFax: 678-23937/ 25533\n\nPhone: 678-23032\n\n[email protected] Alternate Governor for the Republic of Vanuatu in the Asian Development BankDirector General, Ministry of Finance and Economic ManagementPrivate Mail Bag 9058Port VilaVanuatuFax: 678-23937/ 25533Phone: 678-23032"}, {"url": "https://www.aiib.org/en/about-aiib/governance/board-governors/index.html", "page_content": "The Board of Governors holds an annual meeting and such other meetings as may be provided for by the Board of Governors or called by the Board of Directors.\n\n\n\n2022 Annual Meeting\n\nThe Bank’s 2022 Annual Meeting was held virtually on October 26-27, 2022. The Summary Proceedings is available here.\n\n\n\n2021 Annual Meeting\n\nThe Bank’s 2021 Annual Meeting was held virtually on October 26-28, 2021. The Summary Proceedings is available here.\n\n\n\n2020 Annual Meeting\n\nThe Bank’s 2020 Annual Meeting was held virtually on July 28-29, 2020. The Summary Proceedings is available here.\n\n\n\n2019 Annual Meeting\n\nThe Bank’s 2019 Annual Meeting was held in Luxembourg on July 12-13, 2019. The Summary Proceedings is available here.\n\n\n\n2018 Annual Meeting\n\nThe Bank’s 2018 Annual Meeting was held in Mumbai, India on June 25-26, 2018. The Summary Proceedings is available here.\n\n\n\n2017 Annual Meeting\n\nThe Bank’s 2017 Annual Meeting was held on Jeju Island in the Republic of Korea between June 16-18, 2017. The Summary Proceedings is available here.\n\n\n\n2016 Annual Meeting\n\nThe Bank’s First Annual Meeting was held in Beijing, China, between June 25-26, 2016. The Summary Proceedings of the First Annual Meeting of the Board of Governors is available here. This includes the full text of the Resolutions adopted by the Board of Governors, along with Governors’ statements. Provided below are links to other key materials from this meeting.\n\n\n\nInaugural Meeting:\n\nThe Bank’s Inaugural Meeting of the Board of Governors was held in Beijing, China, between January 16-17, 2016. The Summary Proceedings of the Inaugural Meeting of the Board of Governors is available here. This includes the full text of the Resolutions adopted by the Board of Governors, along with Governors' statements.\n\n\n\n"}, {"url": "https://www.rpsg.in/leadership", "page_content": "DR SANJIV GOENKA\n\nChairman\n\nDr. Sanjiv Goenka, is the Chairman of the 7 billion dollar RP Sanjiv Goenka Group since it's inception in 2011 . The Group has 50,000 employees worldwide and over five hundred thousand shareholders."}, {"url": "https://www.investopedia.com/terms/b/board-of-governors.asp", "page_content": "What Is a Board of Governors?\n\nA board of governors is a group of people appointed to oversee the management of an institution. The U.S. Postal Service, the BBC, the World Bank, numerous colleges and universities, as well as professional organizations (such as the CFA Institute), and regulatory bodies (such as the Financial Industry Regulatory Authority (FINRA)), all have boards of governors.\n\nIn the financial world, the best-known board of governors is that of the Federal Reserve, the central bank of the United States.\n\nKey Takeaways A board of governors oversees an organization's operations, including financial matters.\n\nThe most well-known board of governors in the U.S. is the Federal Reserve, whose responsibilities include analyzing domestic and international economic developments and overseeing operations of the Federal Reserve Banks.\n\nIn a corporation, a board of directors is an appointed group that oversees the business.\n\nMembers of the Federal Reserve's board of governors are nominated by the president and confirmed by the Senate.\n\nA competent and well-organized board of governors is seen as a key component of the success of an organization.\n\nUnderstanding a Board of Governors\n\nThe U.S. central bank's board of governors is composed of seven individuals who are appointed by the president and confirmed by the Senate. Members of the board of governors serve 14-year terms, running on a staggered basis to ensure continuity.\n\nLegally, appointments to the board are to consist of a \"fair representation of the financial, agricultural, industrial, and commercial interests and geographical divisions of the country.” In practice, appointments have predominantly been of academics and former banking professionals.\n\nOnly one governor can represent a Federal Reserve District.\n\nDuties of the Federal Reserve Board of Governors\n\nThe board of governors has seven of the 12 seats on the Federal Open Market Committee (FOMC), the body responsible for setting U.S. monetary policy. The current Federal Reserve Board has six members, with one vacancy as of May 2022.\n\nThe presidents of five of the 12 regional Reserve Banks make up the remaining members of the FOMC.\n\nThe chair of the Fed’s board of governors is responsible for chairing the FOMC.\n\nResponsibilities\n\nThe Federal Reserve Board:\n\nAnalyzes domestic and international economic developments\n\nSupervises and regulates the operations of the Federal Reserve Banks\n\nHas responsibility for America's payments system\n\nOversees and administers most consumer credit protection laws\n\nThe board has authority over changes in reserve requirements, and it must approve any change in the discount rate initiated by a Federal Reserve Bank.\n\nMembers of the board frequently testify before congressional committees on the economy, monetary policy, banking supervision and regulation, consumer credit protection, and financial markets.\n\nThey are also responsible for supervising the work of the regional Fed banks, including approving budgets and appointing directors.\n\nChairs of the Board of Governors\n\nThe current Federal Reserve Chair is Jerome Powell. Recent, notable chairs of the Fed’s Board of Governors include:\n\nJanet Yellen, the first female chair to be appointed, served from 2014 to 2018\n\nBen Bernanke, who led the Fed from 2006 to 2014 and oversaw a range of unconventional monetary policy actions to address the financial crisis of 2007-2008 and the recession that followed\n\nAlan Greenspan, whose time as chair spanned nearly 20 years and four presidential administrations\n\nThere have been a total of 16 Chairs of the Board of Governors of the Federal Reserve of the United States.\n\nBoard of Governors vs. Board of Directors\n\nNon-profit organizations, government divisions, and higher academic institutions typically have a board of governors as their governing body rather than a board of directors. Corporations, as required by law, have a board of directors appointed to oversee financial decisions and business operations.\n\nWhen two or more boards exist within an entity, the board of governors often reigns supreme as the decision-making authority.\n\nWho Are the Current Board of Governors of the Federal Reserve? A maximum of seven governors can serve on the Board of Governors of the Federal Reserve. The members of the current Board of Governors of the Federal Reserve are Jerome H. Powell, Michael S. Barr, Lael Brainard, Michelle W. Bowman, Lisa D. Cook, Philip N. Jefferson, and Christopher J. Waller.\n\n\n\nWho Nominates and Confirms the Fed Board of Governors? The governors of the Board of Governors of the Federal Reserve are nominated by the president of the United States and confirmed by the U.S. Senate.\n\n\n\nWhy Are the Fed Governors Appointed for Staggered 14-Year Terms? The purpose of the staggered terms is to ensure stability and continuity.\n\n\n\nWho Is the Current Chair of the Federal Reserve? The current chair of the Federal Reserve is Jerome H. Powell. He was sworn in for a second four-year term on May 23, 2022. He assumed the role following his confirmation in February 2018.\n\nWhat Are the 12 Banks of the Federal Reserve? The 12 banks of the Federal Reserve are the Federal Reserve Banks of San Francisco, Minneapolis, Dallas, Kansas City, St. Louis, Chicago, Cleveland, Atlanta, Boston, New York, Richmond, and Philadelphia.\n\nThe Bottom Line\n\nA board of governors is a group of highly qualified individuals responsible for overseeing and managing an institution. Most institutions, from corporations to nonprofit organizations to media outlets to government bodies have a board of governors. The most well-known board of governors is that of the U.S. Federal Reserve Board."}, {"url": "https://www.cfainstitute.org/en/about/governance/leadership/board", "page_content": "Mark Lazberger CFA Board Chair and Executive Committee Chair Member of CFA Societies Australia\n\nMark Lazberger, CFA, has had a career in investment management with more than 35 years’ experience in global leadership roles working in Australia, Europe and Asia. He currently has non-executive director positions on Yarra Capital Management, Fisher Funds Management and Omnia Capital Partners. Until the end of 2018, Mark was the chief executive officer of Colonial First State Global Asset Management (CFSGAM) and First State Investments (now known as First Sentier Investors). In that role, Mr. Lazberger led the investment management firm which was a global specialist investment manager operating in 15 locations across the world, covering Europe, the Middle East, Africa, Asia, North America, Australia, and New Zealand. Mr. Lazberger had responsibility for more than $180 billion in assets under management invested in listed equities, debt, infrastructure, and property. Prior to taking up that position in 2008, Mr. Lazberger served as President, International of State Street Global Advisors (SSGA). Before this, he was President and CEO of State Street Japan and a principal and regional managing director of SSGA’s businesses in Japan and Australia. He joined State Street in 1991. Mr. Lazberger has a bachelor of commerce degree from the University of Western Australia and served two terms on the Board of Governors of CFA Institute (2012-18). He is a director of the Children’s Cancer Institute, a member of the Future of Finance Advisory Council and served on the board of Sydney Theatre Company.\n\nTricia Rothschild CFA Board Vice Chair, Risk Committee Chair, and Society Partnership Advisory Council Co-Chair Member of CFA Society Chicago\n\nMs. Rothschild is an advisor to The TIFIN Group and a board member of the Financial Fitness Group. In her former role as president of Apex Fintech Solutions, she was responsible for the strategic planning, development, and overall growth of the company. She also directly oversaw internal and client-facing functions including sales, marketing, and product management.\n\n\n\nBefore joining Apex, Ms. Rothschild was Chief Product Officer and Co-Head of Global Markets at Morningstar, where she led a multi-million-dollar global portfolio of businesses including software, data, research and index solutions that served asset managers, wealth managers, and individual investors. In her 26-year career at the firm, she developed a focused advisor and wealth management segment strategy, launched the firm’s equity research business, drove content strategy for the firm’s individual investor website, and served as a securities analyst and editor.\n\n\n\nMs. Rothschild graduated with a bachelor of science degree from Northwestern University and holds a master’s degree in Russian and East European economics from Indiana University. She also sits on a small portfolio of private-company boards in the fintech and wealth-tech space.\n\nMargaret Franklin CFA President & CEO President and CEO 915 E High Street\n\nCharlottesville, VA 22902 Member of CFA Society Toronto\n\nMargaret Franklin, CFA, leads CFA Institute and its more than 170,000 members worldwide in promoting the highest standards of education, ethics, and professional excellence in the investment profession. She assumed her role in September 2019 and has more than 25 years of investment and wealth management experience.\n\n\n\nBefore joining CFA Institute, Ms. Franklin led International Wealth Management for North America and was president of BNY Mellon Wealth Management, Advisory Services in Canada. She also served as a board member of BNY Mellon Trust Company (Cayman). Margaret joined BNY Mellon in 2016.\n\n\n\nPrior to joining BNY Mellon, Ms. Franklin held multiple senior management positions, including president of Marret Private Wealth and COO of Marret Asset Management, a credit and hedge fund asset manager in Toronto. During that six-year tenure, she had direct oversight of all aspects of the private wealth business. Prior to joining Marret, Margaret was a partner with KJ Harrison & Partners.\n\n\n\nMs. Franklin began her career in the institutional business and has worked with pension plans, endowments, foundations, and government agencies at State Street Global Advisors, Mercer, and Barclays Global Investors.\n\n\n\nShe previously served as chair of CFA Institute Board of Governors and is a former president of the CFA Society Toronto Board. Ms. Franklin is a founding member of the CFA Institute Women in Investment Initiative, a past recipient of the Alfred C. Morley Distinguished Service Award in 2014, and a member of its Future of Finance Content Council.\n\n\n\nMs. Franklin earned a Bachelor of Administration in Economics from McMaster University in Ontario. She is a CFA charterholder and a member of the CFA Society Toronto.\n\nMarshall Bailey CFA Non-executive Chairman, MUFG Securities EMEA plc, and Non-executive Chair, Financial Services Compensation Scheme (FSCS) Member of CFA Society United Kingdom\n\nMarshall has substantial experience of leading complex international committees and boards. His background spans a range of sectors, including banking and capital markets, insurance, and regulation. His career spans over 30 years on three continents. In June 2018 he was made an Officer of the Most Excellent Order of the British Empire (OBE) for his contribution to financial services, and to charity. He cares passionately for financial literacy, market confidence, and good outcomes for investors.\n\n\n\nMarshall Bailey is Chairman of MUFG Securities EMEA and MUS(Asia) in Hong Kong, and also Chairs the Financial Services Compensation Scheme, as appointed by the FCA and Bank of England. In the past he has been Chairman of CIBC World Markets Plc in London, a Representative of the Saudi Arabian Public Investment Fund (PIF) on the board of the largest bank in the Kingdom, National Commercial Bank, Jeddah, where he was Chair the Group Risk Committee, announcing a $15 billion merger with Samba Financial Group. Also, as Chairman, he has completed a consolidation of of LCH Group Holdings, the world’s largest derivatives central clearing house, while on the Board of its parent, the London Stock Exchange Group during their $29 billion acquisition of Refinitiv. On these boards he has Chaired, or been a member of the Nominations, Risk and Remuneration Committee.\n\n\n\nMarshall holds a BA in Political Science from the University of Winnipeg, a Master of Arts in International Affairs and History from the Graduate Institute of International and Development Studies in Geneva, Switzerland and is a Chartered Financial Analyst. He has also completed the FT Non-Executive Directors' Diploma, and is currently completing the Certificate in ESG Investing, offered by the CFA Institute via the UK. In his spare time, Marshall is a sailor and is a qualified Ocean Yachtmaster with the Royal Yachting Association. He also buys himself a new putter each year in his seemingly futile pursuit of lower golf scores.\n\nAlexander Birkin Managing Partner, EMEIA Financial Services Consulting Leader, Ernst & Young LLP Member of CFA Society United Kingdom\n\nAlex Birkin is currently the Managing Partner and Leader of the EY EMEIA Financial Services Consulting business. He leads the practice that delivers business, technology, and people consulting services to banks, insurance companies, and wealth and asset managers.\n\n\n\nAlex was formerly the EY Global Wealth and Asset Management Consulting Leader and EMEIA Wealth and Asset Management Industry Leader. He was responsible for the services EY delivers to the wealth management, asset management, alternatives, and asset servicing sectors (WAM) in EMEIA and for the consulting services globally. Mr. Birkin is a member of the EY Global WAM Executive Committee, Global Consulting Extended Leadership Team, and EMEIA FSO Leadership Team. Mr. Birkin joined EY in 1997 as a graduate and became a partner after eight years in 2005. He has been advising the wealth and asset management industry for over 20 years. Mr. Birkin provides advice and consulting services to boards and executive management teams in the industry across a number of disciplines including strategy, business model transformation, digital transformation, technology, transaction integrations, growth strategies, cost reduction, regulatory driven business change and risk management. Mr. Birkin’s clients include global and boutique asset managers, private banks, wealth managers, alternative managers, and investor services firms based in EMEIA, the US, Asia, and Japan.\n\n\n\nIn addition to serving clients, Mr. Birkin has provided industry advice to the HM Treasury, investment trade associations, and regulators. He regularly publishes articles on industry trends, thought leadership on the next evolution of the industry, and is regularly asked to present at leading industry conferences in Europe, Middle East, Asia, and the US.\n\nDan Fasciano CFA Director, GW&K Investment Management Member of CFA Society Boston\n\nDan Fasciano, CFA is a Director at GW&K Investment Management, a $58 billion asset manager headquartered in Boston, Massachusetts. In his role, Dan is responsible for strategic leadership and growth of GW&K’s private wealth management practice.\n\n\n\nBefore joining GW&K in June 2021, Mr. Fasciano spent more than 10 years at BNY Mellon Wealth Management, most recently as National Director of Portfolio Management where he was a member of the firm's Investment Strategy Committee and chaired its National Account Review Committee.\n\n\n\nPrior to BNY Mellon, Mr. Fasciano served as the Treasury Director for the State of Florida and Head of the U.S. Investment office for UK-based Aviva Investors.\n\n\n\nMr. Fasciano formerly served as the chair of the CFA Institute Presidents Council and as the Presidents Council representative for the Eastern United States. He is a past board member and chair of CFA Society Boston. He received his BA from the University of New Hampshire and his MBA from Boston University. In addition to the CFA designation, Dan also maintains the Chartered Market Technician (CMT) and Charted Alternative Investment Analyst (CAIA) designations.\n\n\n\nOyebanji Fehintola CFA Senior Director, Africa Finance Corporation Member of CFA Society Nigeria\n\nBanji is a Senior Director and Head of Treasury & Financial Institutions at Africa Finance Corporation (AFC), a pan-African multilateral development finance institution created by sovereign African states to provide solutions to Africa’s infrastructure deficit. In his role, he oversees the management of AFC’s balance sheet with total assets of about US$8.5 billion as at end of 2021. He leads the implementation of AFC’s annual funding program in the international capital markets. He is also responsible for AFC’s financial institutions and trade business as well as the investor relations function. Banji joined AFC in January 2008 as the pioneer Treasurer of the Corporation, and he was instrumental in setting up the corporation’s treasury function and leading AFC to become one of the leading African credits in the international loan and debt capital markets. Banji has over two decades of experience in banking, advisory, and capital markets.\n\n\n\nBanji has led several landmark funding transactions for AFC, raising over US$10 billion in funding for the corporation since 2015. He manages AFC’s relationship with its rating agencies, global relationship banks, central banks, investors, and asset managers. Prior to joining AFC, Banji worked with the Fixed Income, Currencies, and Commodities team of Citibank Nigeria and the Tax and Business Advisory Division of former Arthur Andersen.\n\n\n\nBanji is a past board member and president of CFA Society Nigeria. He is a frequent speaker at global conferences on capital markets, and he also spends a considerable amount of his time teaching finance-related courses and mentoring young investment professionals.\n\n\n\nBanji has a Bachelor’s degree in Economics from the University of Ibadan, Nigeria, an MPhil degree in International Finance from the University of Glasgow, United Kingdom, and an MPhil degree in International Business from the International School of Management, Paris. In addition to being a CFA charterholder, Banji is also a Chartered Accountant.\n\nMei Gao CFA Partner & Portfolio Manager at IDG Capital Member of CFA Society Beijing\n\nMei Gao joined IDG Capital, a preeminent China-focused alternative asset management firm with over USD 30 billion of assets under management (AUM), as a Partner in 2016 to focus on cross-border investments. From 2003-2016, Mei held various leadership roles, including President and Head of Portfolio Management, at Fore Research & Management, a New York City-based hedge fund with over USD 3 billion of peak AUM, and gained extensive investment experience. In 2013, she was listed as one of “the 25 Most Powerful Women on Wall Street” by bussinessinsider.com. Mei started her career in finance at TD Securities where she spent five years managing the bank’s convertible arbitrage portfolio.\n\n\n\nMei currently serves on the board and investment committee of Cavamont Investment Advisors. She is a director of Generation Asia Acquisition Limited. She was also a board member of TCFA (The Chinese Finance Association) from 2004-2006.\n\n\n\nMei is a graduate of Wilfrid Laurier University (MBA) and Shantou University (BA). She is also a CFA charterholder.\n\nJoanne Hill PhD Chief Advisor for Research and Strategy, Cboe Vest Member of CFA Society South Carolina\n\nJoanne Hill has over 25 years of experience in research and strategy with an emphasis on indexes, options and quantitative investments. Prior to joining CBOE Vest, Dr. Hill worked with ProShares for 8 years, as Head of Institutional Investment Strategy, focusing on ETF research and education, and spent 17 years at Goldman Sachs, where she was a Managing Director leading global equity index and derivatives research and advising institutional investors on strategies using index and risk management tools.\n\nShe heads the research committee for the \"Q\" Group and the CFA Institute Research Foundation where she is also a board member. She also serves on the editorial board of the Financial Analysts Journal, Journal of Alternative Investments, and Journal of Index Investing.\n\nMoney Management Executive named Dr. Hill one of the ten inaugural recipients of the Top Women in Asset Management Awards. She was a Founding Member and Co-President of Women in ETFs and currently serves on their board. She is a member of the Investment Committee of the Montgomery County Public School Defined Benefit and Defined Contribution pension plans. Prior to her career on Wall Street, Dr. Hill was on the faculty of the University of Massachusetts (Amherst) and she has a Ph.D. in Finance from Syracuse University.\n\nHeinz Hockmann PhD Governance Committee Chair Advisory Council Member, Lovell Minnick Partners\n\nDr. Heinz J. Hockmann is a member of the Advisory Council of Lovell Minnick Partners LLC, a private equity company and buyout manager focusing on financial services and business services.\n\n\n\nHeinz was an executive officer at Commerzbank AG in Germany for nearly twenty years and was a Member of the Management Board of the Bank with responsibilities for asset management, private banking, and investment banking. Earlier in his career at Commerzbank, he formed its asset management business for international institutional clients and later built the bank’s global asset management platform. Afterwards, he ran the Management Board of Westfalenbank AG, a midsize bank for corporate and private clients, investment banking, and asset management. He then joined Fortis Investments and developed its asset management business in Germany, Austria, and Eastern Europe.\n\n\n\nIn 2008, Heinz co-founded Silk Invest, an investment management company headquartered in London and specialized in frontier markets with offices in various African and Middle Eastern countries. He serves on the Board of Silk Invest as well as the boards of several German companies in the financial services sector including WWK, a major German insurance company.\n\n\n\nHeinz holds a master’s degree from Bochum University, where he also received his PhD in 1983. He is a lecturer for Investment Banking and Commercial Banking at the Justus-Liebig University in Giessen.\n\nPunita Kumar-Sinha PhD, CFA Investment Subcommittee Chair Investment Professional & Board Member. Independent Director, Infosys, JSW Steel, Bharat Financial & Others. Managing Partner, Pacific Paradigm Advisors Boston/India Member of CFA Society Boston\n\nPunita Kumar-Sinha, PhD, CFA, has focused on investment management and governance roles during her 30-year career. Ms. Kumar-Sinha has been investing in emerging markets since the late 1980s and pioneered some of the first foreign investments in the Indian subcontinent in the early 1990s.\n\n\n\nCurrently, she is the Founding Partner, Pacific Paradigm Advisors, an independent investment advisory firm focused on Asia, and a Senior Advisor to companies in India and North America. She serves as an Independent Director and Chairs Audit, Stakeholders Relationship, and Risk Committees for many boards. Prior to this, Ms. Kumar-Sinha was a Senior Managing Director of Blackstone and the Head & Chief Investment Officer of Blackstone Asia Advisors. Prior to joining Blackstone, Ms. Kumar-Sinha was a Managing Director and Senior Portfolio Manager at Oppenheimer Asset Management Inc. and CIBC World Markets, where she also managed India and Asia funds. She has also worked at Batterymarch (a Legg Mason company), Standish Ayer & Wood (a BNY Mellon company), JP Morgan, and IFC/World Bank.\n\n\n\nMs. Kumar-Sinha is frequently featured in the media and at global conferences as an expert commentator on Asian capital markets and women’s issues. Ms. Kumar-Sinha has a PhD and a Master of Finance from the Wharton School, University of Pennsylvania. She received her undergraduate degree in Chemical Engineering with Distinction from the Indian Institute of Technology, New Delhi. She has an MBA and is a CFA charterholder. Ms. Kumar-Sinha is a member of CFA Institute, has been a member of the CFA Society Boston and India, a TiE Charter Member, and a member of the Council on Foreign Relations. Ms. Kumar-Sinha has been awarded the Distinguished Alumni Award from IIT Delhi. She has also been awarded the “Best Woman Director” in 2016 by Asian Center for Corporate Governance and Sustainability.\n\nYimei Li CFA CEO, China Asset Management Co. Ltd. Member of CFA Society Beijing\n\nYimei Li, CFA, is Chief Executive Officer at China Asset Management Co., Ltd. Ms. Li has been in that role since May 2018, serving one of the largest mutual fund companies in China with more than USD 170 billion AUM and 120 million investors. Before that, she was the CMO of ChinaAMC for 6 years, leading a team of more than 200 people. She started with international business, then worked in human resources, marketing, sales management, and the fin tech business. She served as the founder of ChinaAMC Wealth Management Company. She is also now in charge of the operation and IT functions of ChinaAMC.\n\n\n\nMs. Li also serves as the Vice Chair of Asset Management Association of China (AMAC) and is a member of that organization’s pension investment committee. She is very committed to bridge ideas and practices between regulators and market participants. She is a regular conference speaker and has given lectures to high officials of NGOs and charity groups on fund raising and marketing techniques.\n\n\n\nMs. Li graduated from Harvard University with a Master in Public Policy and from Renmin University of China with a Master in Economics. She holds the Chartered Financial Analyst® charter and is a member of CFA Society Beijing.\n\nGeoffrey Ng CFA Audit and Finance Committee Chair and Nominating Committee Chair Director, Fortress Capital Asset Management\n\nMember of CFA Society Malaysia\n\nGeoffrey Ng, CFA, is a director at Fortress Capital Asset Management, a Pan-Asian investment management company. He has over two decades of investment management and leadership experience. Previously, Mr. Ng served as chief executive officer and executive director at Hong Leong Asset Management; senior vice president, global emerging markets, at Dubai Investment Group; and chief investment officer at Pacific Mutual Fund. Mr. Ng is the independent non-executive chairman of Kronologi Asia Berhad, where he previously served as an independent non-executive director and is a member of the Audit, Nomination, Remuneration, and Share Grant Plan Committees. He holds the Certified Financial Planner designation and earned the Fintech: Future Commerce certification from the Massachusetts Institute of Technology and a CFA Institute Investment Foundations Certificate. Geoffrey has served on the Education Advisory Committee (vice chair and chair of the Practice Analysis subcommittee) and Council of Examiners, as well as vice president and treasurer for CFA Society Malaysia. Mr. Ng earned a Bachelor of Commerce (high honors) with a double major in accounting and finance from the Sprott School of Business at Carleton University. He is a CFA charterholder, holds a CFP certification, and has completed the MIT Fintech: Future Commerce program by the Massachusetts Institute of Technology.\n\nMaria Wilton CFA People and Culture Committee Chair Director, Victorian Funds Management Corporation Member of CFA Society Melbourne"}, {"url": "https://www.lawinsider.com/dictionary/member-of-the-board-of-governors", "page_content": "He is a Member of the Board of Governors of the Indian Institute of Management, Calcutta.He is on the Board of Olympic Gold Quest (OGQ), a Not for Profit organization.\n\nMember of the Board of Trustees: Molloy College; Member of the Board of Governors : Saint John’s University; and, received the 2001 Outstanding Alumni Award: Saint John’s University.\n\nDiamond, of Massachusetts, to be a Member of the Board of Governors of the Federal Reserve System for the unex- pired term of fourteen years from February 1, 2000.\n\nThe undertaking required by subsection 27.7.b. must be an unlimited general obligation of the Member of the Board of Governors but need not be secured and may be accepted without reference to financial ability to make repayment.\n\nAny vacancy in the position of a Member of the Board of Governors appointed pursuant to this Article VIII-B and not filled within ninety (90) days shall be filled by the majority vote of the other Members of the Board of Governors.\n\nThe Chief of Staff is responsible for representing the Medical Staff as an ex-officio voting Member of the Board of Governors .\n\nIn addition, the Immediate Past President is a Member of the Board of Governors and Executive Committee.\n\nTo supervise the receipt of all funds paid to the Association; to deposit said receipts as instructed by the Board of Governors and in accordance with his or her fiduciary responsibilities; and to prepare a monthly financial report and submit a copy thereof to each Member of the Board of Governors .\n\nHe is a Member of the International Advisory Board of GIC Private Limited, Singapore and International Advisory Panel of Monetary Authority of Singapore, Member of the Board of Governors of Indian Council for Research on International Economic Relations and The Anglo Scottish Education Society (Cathedral & John Connon School).\n\nThe Committee shall consist of three (3) representatives of the Employer, one of whom shall be a Member of the Board of Governors of Saint Mary's University who is not a member ex-officio or through faculty or student appointment, and three (3) representatives of the Union who shall serve during the academic year.\n\nBoard of Governors means the Board of Governors of the Federal Reserve System of the United States of America.\n\nRegulation T, U or X\" means Regulation T, U or X, respectively, of the Board of Governors of the Federal Reserve System as from time to time in effect and any successor to all or a portion thereof.\n\nRegulation T, U or X means Regulation T, U or X, respectively, of the Board of Governors of the Federal Reserve System as from time to time in effect and any successor to all or a portion thereof.\n\nCouncil of Governors means the council of governors of the corporation; “declaration of identity” has the meaning set out in rule 21.1;\n\nRegulations T, U and X” means, respectively, Regulations T, U and X of the Board of Governors of the Federal Reserve System (or any successor), as the same may be modified and supplemented and in effect from time to time.\n\nRegulations T, U and X means Regulations T, U and X of the Board of Governors of the Federal Reserve System (or any successor), as the same may be modified and supplemented and in effect from time to time.\n\nRegulation X means Regulation X of the Board as from time to time in effect and all official rulings and interpretations thereunder or thereof.\n\nFederal Reserve Board means the Board of Governors of the Federal Reserve System.\n\nMember of the Board means an individual who is a member of the Board or of the board of directors of a Subsidiary or an Affiliate.\n\nGovernors means the governors appointed and elected to the Local Governing Body of the Academy, from time to time.\n\nRegulation U means Regulation U of the Board as from time to time in effect and all official rulings and interpretations thereunder or thereof.\n\nRegulations D, T, U and X” means, respectively, Regulations D, T, U and X of the Board of Governors of the Federal Reserve System (or any successor), as the same may be modified and supplemented and in effect from time to time.\n\nRegulation T means Regulation T of the Board as from time to time in effect and all official rulings and interpretations thereunder or thereof.\n\nRegulation CF means Regulation Crowdfunding promulgated under the Securities Act.\n\nFRB means the Board of Governors of the Federal Reserve System of the United States.\n\nR.S. Board means the Board of Governors of the Federal Reserve System or any successor thereto.\n\nStaff Governor means an employee of the Academy Trust who may be appointed as a Governor pursuant to Article 50A;\n\nthe Parent Governors means the Governors appointed pursuant to Articles 53 to 58 inclusive;\n\nF.R.S. Board means the Board of Governors of the Federal Reserve System or any successor thereto.\n\nRegulation H Regulation H of the Board as in effect from time to time.\n\nMember of the University Community means students, faculty, or staff, or other persons affiliated with the University.\n\nMember of the Legislature means any person elected or\n\n(u) Person\" shall have the meaning given in Section 3(a)(9) of the Exchange Act, as modified and used in Sections 13(d) and 14(d) thereof, except that such term shall not include (i) the Company or any of its subsidiaries, (ii) a trustee or other fiduciary holding securities under an employee benefit plan of the Company or any of its Affiliates, (iii) an underwriter temporarily holding securities pursuant to an offering of such securities, (iv) a corporation owned, directly or indirectly, by the stockholders of the Company in substantially the same proportions as their ownership of stock of the Company or (v) the Exempt Holders.\n\nRegulation Y means Regulation Y of the Board of Governors of the Federal Reserve System, as the same may be in effect from time to time, and any successor regulations.\n\nMember of the public means any individual except when that individual is receiving an occupational dose."}, {"url": "https://www.afdb.org/en/about-us/organisational-structure/board-of-governors", "page_content": "The Board of Governors is the highest decision-making organ of the Bank, composed of one Governor and one Alternate Governor appointed by each Member Country. Each Governor represents his or her country and exercises a voting power proportionate to the capital subscription of his or her country. Governors and Alternate Governors are generally Ministers of Finance, or Economic Planning, Central Bank Governors, or other high-ranking officials. They serve for a term of five years, subject to termination and reappointment by the member country.\n\nThe Governors and Alternate Governors of the Bank are ex officio Governors and Alternate Governors of the African Development Fund.\n\nThe Boards (of the Bank and Fund) of Governors holds an Annual Meeting usually in May to review the Bank’s operations, make major policy decisions and provide strategic guidance.\n\nAll the powers of the Bank are vested in the Board of Governors although it has delegated some of those powers to the Board of Directors except the power to:\n\nIssue general directives concerning the credit policy of the Bank;\n\nDecrease the authorized capital stock of the Bank;\n\nEstablish or accept the administration of Special Funds;\n\nAuthorize the conclusion of general arrangements for cooperation with the authorities of African countries which have not yet attained independent status or of general agreements for co-operation with African Governments which have not yet acquired membership of the Bank, as well as of such agreements with other Governments and\n\nwith other international organizations;\n\nElect the President of the Bank, suspend or remove him from office and determine his remuneration and conditions of service;\n\nDetermine the remuneration of Directors and their alternates;\n\nSelect outside auditors to certify the general balance sheet and the statement of profit and loss of the bank and to select such other experts as may be necessary to examine and report on the general management of the Bank;\n\nApprove, after reviewing the report of the auditors, the general balance sheet and statement of profit and loss of the bank; and\n\nExercise such other powers as are expressly provided for that Board in the Bank Agreement."}, {"url": "https://www.irma.ac.in/about-irma/governance/board-of-governors", "page_content": "IRMA Board of Governors – Giving direction to team IRMA\n\nThe Board of Governors appointed by the IRMA Society, are responsible for managing the affairs of the Institute. The members on the Board comprise of eminent personalities from the field of education, public administration, development and co-operation, distinguished alumni and representatives of the faculty.\n\nIRMA Board Members\n\nDr. Dilip Rath Chairman Institute of Rural Management Anand Anand - 388001 View Profile\n\nShri Meenesh Shah Managing Director National Dairy Development Board Anand - 388001 View Profile\n\nShri Shailesh Kumar Singh, IAS Secretary Department of Rural Development Government of India , Ministry of Rural Development , Krishi Bhawan New Delhi - 110001\n\nMs. Manisha Chandra, IAS Commissioner & Secretary Commissionerate of Rural Development Government of Gujarat , 16/1, Dr Jivraj Mehta Bhavan, Sachivalaya Gandhinagar – 382010\n\nShri Manish Bandlish Managing Director Mother Dairy Fruit & Vegetable Private Limited A-3, NDDB House, Sector-1, Noida, Uttar Pradesh - 201 301 View Profile\n\nShri Pankaj Kumar Bansal, IAS Managing Director National Cooperative Development Corporation (NCDC) 4, Siri Institutional Area, Block A, Nipccd Campus, Hauz Khas, New Delhi, Delhi 110016\n\nShri Sangram R. Chaudhary In-charge Managing Director Banaskantha District Cooperative Milk Producers Union Ltd. Palanpur - 385001 View Profile\n\nDr. Pankaj Chandra Vice Chancellor Ahmedabad University Commerce Six Roads Navrangpura Ahmedabad - 380009\n\nProf. M H Suryanarayana Retd. Professor IGIDR Mumbai\n\nDr. R S Sodhi President Indian Dairy Association New Delhi View Profile\n\nDr. Devi Singh Former Vice-Chancellor FLAME University Pune\n\nShri K C Supekar Former Managing Director National Cooperative Dairy Federation of India Ltd. Anand View Profile\n\nProf. Anand Venkatesh Professor Institute of Rural Management Anand Anand - 388001 View Profile\n\nProf. Sushanta Kumar Sarma Associate Professor Institute of Rural Management Anand Anand - 388001 View Profile\n\nShri Srinivasan B President - Chairman's Office Reliance Industries Limited Maker Chambers, IV, 4th Floor Nariman Point Mumbai - 400021 View Profile\n\nMs. Promila Ayyangar Associate Partner Vyaktitva New Delhi View Profile\n\nDr. Umakant Dash Director & Member-Secretary Institute of Rural Management Anand Anand - 388 001"}, {"url": "https://www.worldbank.org/en/about/leadership/governors", "page_content": "The Boards of Governors consist of one Governor and one Alternate Governor appointed by each member country. The office is usually held by the country's minister of finance, governor of its central bank, or a senior official of similar rank. The Governors and Alternates serve for terms of five years and can be reappointed.\n\n\n\nIf the country is a member of the Bank and is also a member of the International Finance Corporation (IFC) or the International Development Association (IDA), then the appointed Governor and his or her alternate serve ex-officio as the Governor and Alternate on the IFC and IDA Boards of Governors. They also serve as representatives of their country on the Administrative Council of the International Center for Settlement of Investment Disputes (ICSID) unless otherwise noted. Multilateral Investment Guarantee Agency (MIGA) Governors and Alternates are appointed separately.\n\nRole of the Boards of Governors\n\nAll powers of the Bank are vested in the Boards of Governors, the Bank's senior decision-making body according to the Articles of Agreement. However, the Boards of Governors has delegated all powers to the Executive Directors except those mentioned in the Articles of Agreement. These powers include:"}]}