{"B. K. Anand was born on 8 August 1940.": [{"url": "https://www.kliponar.com/professor-bal-krishan-anand/", "page_content": "Born: 18 September 1917\n\nDied: 2 April 2007\n\nHe better known as B. K. Anand was an Indian physiologist and pharmacologist.\n\nHe was credited for the discovery of the feeding center in the hypothalamus in 1951.\n\nHe is considered the founder of modern Neurophysiology in India.\n\nHe was born in Lahore as Bal Krishan Anand in 1917.\n\nHe was born in Lahore as Bal Krishan Anand in 1917. He was graduated from King George Medical College in 1940 and obtained his M.D. degree in 1948.\n\nHe joined in 1949 the Lady Hardinge Medical College as a Professor of Physiology.\n\nHe went to Yale University as a Fellow of the Rockefeller Foundation in 1950 and worked with John Brobeck.\n\nThey had published their research work in 1951.\n\nHe returned to India in 1952 and continued his research at Lady Hardinge Medical College.\n\nHe joined the All India Institute of Medical Sciences as its first professor in the Department of Physiology in 1956.\n\nHe was instrumental in establishing the guidelines of education for M.B., B.S. and Postgraduate students.\n\nHe became Dean of that Institute.\n\nHe was instrumental in the establishment of the Sher-i-Kashmir Institute of Medical Sciences in 1982.\n\nClick here for more details\n\n(Visited 162 times, 1 visits today)"}, {"url": "https://www.thecalculatorsite.com/misc/age-calculator.php", "page_content": "Calculate your age in years, months, weeks and days based upon your date of birth, and find out you what day you were born on.\n\nDisclaimer: Whilst every effort has been made in building our calculator tools, we are not to be held liable for any damages or monetary losses arising out of or in connection with their use. Full disclaimer .\n\nHow old am I today?\n\nHow old you are can be calculated using your date of birth. By using mathematical calculation, it's possible to work out how many years, months, weeks and days have passed since you were born. If you know the time of your birth, it can be incorporated into the calculation to provide an even more precise result.\n\nHow old was I on X date?\n\nShould you want to know how old you were on a certain date in past history, or how old you will be at a future date, we've got you covered. Simply make use of our 'Age at Date' option in our calculator and enter a date in either the past or future. Our calculator will then make a calculation based upon that date.\n\nCalculating your age\n\nYour age can be calculated by finding the difference between your date of birth and the current date. What we are specifically finding out is how much time has passed since you were born. We can, of course, perform a rough calculation by subtracting the year of your birth from the current year, which will give you a figure for how many years old you are, or will be, in the current year.\n\nage (years) = current year - birth year\n\nAs an example, if I was born in 1995, my age in 2023 will be: 2023 - 1995 = 28 years.\n\nOf course, this only gives you a rough figure for how many years old you will be in the current year - it doesn't take into consideration the month and day of your birth compared to today's month and day. To calculate your exact age, including months and days, you need to deduct the numerical month and day of your birth from the current month and day.\n\nHow many days old am I?\n\nPeople regularly ask how they can work out their age, and I point them to this calculator (it's one of the reasons I created it). Although you can have a rough guess by multiplying your age in years by 365, you could still be out by up to several hundred days. This will in most part be because you'll be working on the basis of your age at your last birthday, and therefore excluding the days since.\n\nThere's also leap years to take into consideration. These occur once every four years and mean an extra day in the calendar (366 days in the year). Your best way to get an accurate calculation to how old you are in days is, therefore, to use the age calculator tool provided.\n\nHow old will I be in 2050?\n\nWorking out your age in the future is a simple process with our age calculator. Here's how to calculate how old you will be in 2050:\n\nEnter your day, month and year of birth. Set the 'age at date' to January 1 2050. Click the 'Calculate' button to find out what your age will be in 2050.\n\nHow old was the oldest person ever?\n\nThe oldest person ever recorded was Jeanne Calment, a woman from France. She was born on February 21, 1875 and lived until the age of 122 years and 164 days before passing away on August 4, 1997. 1\n\nOf the top 10 oldest people ever, all 10 are currently women. The oldest man ever is currently recorded as being Jiroemon Kimura from Japan. Plugging his date of birth into our age calculator tool reveals that he lived until the age of 116 years and 54 days. He passed away on June 12, 2013.\n\nWith that said, Fredie Blom, a South African man born on 8 May 1904, was recorded as 'unofficially' the world's oldest man ('unofficial' because he wasn't listed in the Guinness Book of World Records). Fredie died on 22 August 2020 at a said age of 116 years, 3 months, and 14 days.\n\nFamous people who turn 50 years of age in 2023 Name When age 50? Name When age 50? Pharrell Williams April 5 Seth MacFarlane October 26 Aishwarya Rai November 1 Ryan Giggs November 29 Jennifer Esposito April 11 Sachin Tendulkar April 24 Eddie Cibrian June 16 Kate Beckinsale July 26 Dave Chappelle August 24 Nas September 14 Tyra Banks December 4 Mos Def December 11 Harmony Korine January 4 Portia de Rossi January 31 Boris Kodjoe March 8 Jim Parsons March 24 Monica Lewinsky July 23 Vera Farmiga August 6 Kristen Wiig August 22 Rose McGowan September 5 Lena Headey October 3 Jason Kidd March 23 Larry Page March 26 Heidi Klum June 1 Brian Austin Green July 15 Sergey Brin August 21 Andrew Lincoln September 14 Adrien Brody April 14 Shannon Elizabeth September 7 Mario Lopez October 10\n\nThe above data is courtesy of Famous Birthdays.\n\nYou can use the birthday calculator if you want to find out your star sign, chinese zodiac sign, birthstone, famous people that you share your birthday with and the number one song and movie on your birthday.\n\nHow to age well\n\nA government researcher once quipped that \"Age is an issue of mind over matter. If you don't mind, it doesn't matter.\" Luis Bunuel, the Spanish filmmaker, joked that \"Age is something that doesn't matter unless you're a cheese\". Perhaps we can also add wine to that list?\n\nThese quotes are, of course, meant to be whimsical. There's little doubt that while you can't control your age, or predict what might happen to you, you can take actions to keep yourself healthy and give yourself the best chance of reaching a ripe old age. From food, to exercise and looking after your mental health. Here's a great article about how to age well from the New York Times.\n\nSharing your age\n\nShould you wish to share how old you are with others, you can do so by copying the link at the bottom of the results section. If you need some help with dates, we have a calculator to help you work out how many hours or days there are between two dates."}, {"url": "https://www.onthisday.com/date/1940/august/8", "page_content": "About August 8, 1940\n\nDay of the Week: Thursday\n\nHow Long Ago? 82 years, 10 months and 1 day\n\nLeap Year: Yes"}, {"url": "https://www.birthdayanswers.com/date/august-8-1940/", "page_content": "It was the 2nd Thursday of 1940. If you were born on this date your birthday numbers 8, 8 and 1940 reveal that your life path number is 3. Your zodiac sign is Leo with a ruling planet Sun, your birthstone is the Peridot and Sardonyx, and your birth flower is the Gladiolus. You are 82 old, and were born in 1940s, in the middle of Silent Generation. The generation you are born into makes an impact on your life. Swipe up to find out what it all means.\n\n→ August 8, 1940 was a Thursday\n\n→ Zodiac sign for this date is Leo\n\n→ This date was 30,255 days ago\n\n→ 1940 was the Year of the Dragon\n\n→ In 2023, August 8 is on Thursday\n\nView fun August 8, 1940 birthday facts that no one tells you about, such as your life path number, birthstone, ruling planet, zodiac sign and birth flower.\n\nYou have been alive for:\n\n\n\nPeople born on this day will turn 83 in exactly .\n\nIf you were born on this date:\n\nYou have been alive for . You were born in the Year of the Dragon. Your birth sign is Leo with a ruling planet Sun. There were precisely 1,026 full moons after you were born up to this day. Your billionth second was on was on April 16, 1972.\n\n→ You’ve slept 10,085 days or 27.63 years.\n\n→ Your next birthday is away\n\n→ You’ve been alive\n\n→ You were born in the Year of the Dragon\n\n→ You have been alive 726,129 hours\n\n→ You are 43,567,784 minutes old\n\n→ Age on next birthday: 83 years old\n\nYou were born on a Thursday\n\nAugust 8, 1940 was the 2nd Thursday of that year. It was also the 221st day and 8th month of 1940 in the Georgian calendar. The next time you can reuse 1940 calendar will be in 2024. Both calendars will be exactly the same.\n\nThere are left before your next birthday. Your 83rd birthday will be on a Friday and a birthday after that will be on a Thursday. The timer below is a countdown clock to your next birthday. It’s always accurate and is automatically updated.\n\nYour next birthday is in:\n\n\n\nFriday\n\nYou’ve slept 33% of your life!\n\nYour next birthday is on a\n\nAssuming you’ve been sleeping 8 hours daily since birth. Here is how much time you’ve spent sleeping so far:\n\nYou’ve slept 27.63 years of your life.\n\nYou’ve slept 331 month of your life.\n\nYou’ve slept 1,441 week of your life.\n\nYou’ve slept 10,085 days of your life.\n\nDid you know you have taken approximately 609,940,800 breaths since your birth? Moreover, using 80 beats per minute as average, your heart has beaten over 3,485,376,000 times. You have also blinked over 740,642,400 times in your lifetime.\n\n#1 Song on your birthday\n\nThe number one song in the US on the day of your birth was [Not available]. No song matches found.. (Billboard Hot 100 – August 8, 1940) . Ask your parents if they remember this popular song.\n\nDo you remember the number one song on your 14th birthday? It was [Not available]. No song matches found. (August 8, 1954) .\n\nCelebrities born on August 8, 1940\n\nYou share a birthday with We could not find a celebrity that shares a birthday with you. However, we update our database constantly, and invite you to check back later to see if we found someone with the same birthday..\n\nWe have over 150,000 celebrities in our database. We will continue to update this list with matching birthdays, so bookmark this page and check back often. You can also find out all celebrity birthdays born on August 8, 1940.\n\nWhat happened on August 8th\n\nBelow are some of the most important historical events that happened on 8 August 1940.\n\nSports in 1940\n\nEmperor Krishnadeva Raya is crowned, marking the beginning of the regeneration of the Vijayanagara Empire in Southern India.Venetian senate examines Galileo Galilei's telescope.US Congress unanimously chooses the dollar as the money unit for the United States.1st national march of Ku Klux Klan (between 25,000 and 40,000 marchers) in Washington, D.C.USSR establishes a communist government in North Korea.\n\nNBA – to win the NBA Finals.\n\nNHL – New York Rangers defeated Toronto Maple Leafs (4 - 2) to win the Stanley Cup.\n\nNFL –\n\nMLB – Cincinnati Reds beat Detroit Tigers (4 - 3) to win the World Series.\n\nYour life path number is 3\n\nSo what does your birthday really say about you and what does your life path number mean? On the next page, we’ll explain what your birth sign, ruling planet, age generation, birthstone, and birth flower mean — and more!\n\nContinue to the next page to discover the answers to the most important questions about your birthday."}, {"url": "https://coolconversion.com/i-was-born-in/8-1-1940", "page_content": "Born in August 1, 1940\n\nAge calculator\n\nThe day of the week you were born was 213. The symbol that represents 213 is 213 is .\n\nDo you want to calculate your chronological age? The day of the week you were born? How many years, months and days are you old? You can do it easily by using our age calculator above.\n\nPlease, just fill your date of birth (DOB) click the 'Go' button."}, {"url": "https://takemeback.to/08-August-1940", "page_content": "Old Newspapers from August 08, 1940\n\nBrowse US newspapers from August 08, 1940\n\nDiscover UK newspaper headlines from August 08, 1940\n\nOld Magazines from August 08, 1940\n\nBrowse your vintage magazines from August 08, 1940\n\nLooking for other vintage memories?\n\nLook at our old newspapers and magazines page\n\nSee also\n\nWhat happened on August 08 in history? Find out the list of August 8th major events\n\nWhat was 1940 famous for? Discover everything about 1940"}, {"url": "http://nutritionsocietyindia.com/dr-b-k-anand-memorial-award/", "page_content": "This was instituted by the Nutrition Society of India, in association with B. K. Anand Benevolent Trust, New Delhi, in the year 2014 in memory of Prof. Bal Kishan Anand, an internationally renowned physiologist.\n\nDr. Anand was born on September 18, 1917 in Lahore (now in Pakistan). All through his formative years, he was rated as an excellent student and won many scholarships, medals and prizes. He graduated in Medicine from King Edward Medical College, Lahore in 1940 and went on to do M.D. in three subjects – Medicine, Pathology and Physiology. Prof. Anand joined the Lady Hardinge Medical College as a Professor of Physiology at a tender age of 32 in 1949. As the first Rockefeller Foundation Fellow, he went to Yale University in 1950 and discovered the existence of a neural substrate which is responsible for regulating food intake that is now known as the Feeding Centre. In 1952, he returned to India and joined the Lady Hardings Medical College as Professor and Head, Department of Physiology. Under his leadership it became the first Medical College in the country to introduce human and mammalian experiments in Physiology in 1953. By 1955, Lady Hardings Medical College was recognized to start an M.D. course in Basic Medical Sciences and he also got the credit of establishing the first Neurophysiology Research Unit in Lady Hardings Medical College in the same year.\n\nDr. B K Anand joined the All India Institute of Medical Sciences (AIIMS) in 1956 as its first Professor in the Department of Physiology. He demonstrated his dynamic leadership by helping to structure the MBBS course to three phases of three semesters, each followed by a year of internship that included three months of rural posting. This pattern was quickly followed throughout the country. Dr. Anand was a member of the core team which laid down the policies and curriculum for postgraduate training in AIIMS that was soon accepted by the Medical Council of India for all Medical Colleges in India. In 1969, he went on to become the Dean of AIIMS.\n\nDr Anand’s tryst with science continued till the end of his long and distinguished scientific career by raising further questions related to the Neurobiology of feeding and satiety. The Neurophysiology Research Unit started by him at AIIMS continues to flourish even today. Besides understanding the neural basis of feeding and satiety, Dr. Anand and his team undertook studies to understand the role of limbic system in emotional and aggressive behaviour, the role of hypothalamus in reproduction as well as in cardiovascular, respiratory and gastrointestinal activities.\n\nIn 1955, Dr. B K Anand was instrumental in establishing the Association of Physiologist and Pharmacologists of India affiliated to the International Union of Physiological Sciences. In 1957, he also started the publication of Indian Journal of Physiology and Pharmacology that is now one of the best medical journals published in India. In 1974, he worked for the World Health Organization in New Delhi. Working in Health Manpower Development Division in South East Asia, he rendered advice for policy matters relating to education, nursing and paramedical manpower in the member countries. In 1977, he joined the Family Planning Foundation as its Biomedical Doctor and he held this position till his retirement in 1982 after successfully steering research in India in Biomedical Sciences especially in the development of contraceptives.\n\nIn 1982, after retiring from the Family Planning Foundation, he took up yet another challenge of establishing a Postgraduate Medical Institute in Srinagar at the behest of the late Shri Sheikh Abdullah. During the period 1982-1985, he served as the Director of Sher-i-Kashmir Institute of Medical Science, Srinagar. Throughout his career, he guided many students, practitioners, researchers and faculty. He authored numerous research publications.\n\nDr. Anand won numerous national and international awards and accolades. Most significant among them are the Shanti Swarup Bhatnagar Prize for Science and Technology in Medical Sciences in 1963 and Padma Shri in Medicine in 1969 from Government of India.\n\nDr.B.K.AnandAward presented every year to an outstanding person in the field of physiology, food and nutrition etc., within India.The Office-Bearers will recommend the names for consideration of the Committee Members of theDr.B.K.Anand award."}, {"url": "https://coolconversion.com/i-was-born-in/8-16-1940", "page_content": "Born in August 16, 1940\n\nAge calculator\n\nThe day of the week you were born was 228. The symbol that represents 228 is 228 is .\n\nDo you want to calculate your chronological age? The day of the week you were born? How many years, months and days are you old? You can do it easily by using our age calculator above.\n\nPlease, just fill your date of birth (DOB) click the 'Go' button."}, {"url": "https://prabook.com/web/anand.akerkar/318492", "page_content": "Anand Akerkar Edit Profile\n\nbiotechnologist\n\nAnand Akerkar, Indian, American Biotechnologist. Achievements include 15 patents in field Member New York Academy Sciences, American Association for Clinical Chemistry.\n\nBackground Akerkar, Anand was born on February 25, 1940 in Bombay, India. Son of Sakharam Bhaskar and Durgabai S. (Kashibai) Akerkar. came to the United States, 1969.\n\nEducation Doctor of Philosophy, Bombay University, 1968. Master of Business Administration, New York University, 1972.\n\nCareer President, Creative Scientific Technology, Great Neck, New York, since 1986. Scientific advisor United States Congressman Benjamin Gilman, New York, since 1976.\n\nAchievements Anand Akerkar has been listed as a noteworthy Biotechnologist by Marquis Who's Who.\n\nMembership Member New York Academy of Sciences, American Association for Clinical Chemistry."}, {"url": "https://www.calculatorsoup.com/calculators/time/age-calculator.php", "page_content": "Share this Answer Link: help Paste this link in email, text or social media.\n\nCalculator Use\n\nCalculate the age of a person, place or thing. The age calculator calculates age given a date of birth in years, months and days. You can also use this calculator to find length of time between two dates.\n\nThe age calculator finds the age time span in years months and days, months and days, and in total days only.\n\nHow to Calculate Age\n\nThis age calculator uses 2 similar but slightly different methods to calculate age. One method is used to give age in years, months and days, and also months and days. The other method is used to very precisely calculate age in total days only.\n\nWhen calculating age to the detailed level of days it's important to remember that not all months have the same number of days. Also, while a year has 365 days, a leap year has 366 days.\n\nWhen you calculate age in terms that include years, this calculator provides the answer in common terms. For example, a teenager might say he is 15 years old rather than saying he's 12 normal years old plus 3 leap years old. This age calculator uses the same assumption -- although we know years may have different lengths, we generalize between regular years and leap years, and call them equal.\n\nThe same is true for months. If a baby is 7 months old, the parents would not say she is 4 months that are 31 days long, plus 2 months that are 30 days long, plus 1 month that is 28 days long. We typically generalize across months of different lengths, and count them all equal as general months.\n\nThe age calculator finds age in terms that are commonly used, calling all years equal and all months equal. When calculating days however, the calculator uses a function to find the precise number of days between dates.\n\nIf you wanted to know how many days you've been alive you need to account for extra days in leap years. You also need to know the total number of months with 31 days, total months with 30 days, and total months with 28 days.\n\nThe age calculator uses a function that recognizes how many leap years are in a given time span. It also calculates the specific number of days in a partial year. For example, if you were born on March 5 and today is June 7, the calculator finds the exact number of days that occur between those dates.\n\nYour age in total number of days is calculated as:\n\nNumber of years, x, with 365 days = 365x plus\n\nNumber of years, y, with 366 days = 366y plus\n\nNumber of days in the remaining partial year\n\nThis calculator assumes the start date is day 0 and begins counting one full day after day 0. For example if you input the dates 03/15/2022 and 3/18/2022 into the calculator you will get a total age of 3 days. Day 1 is the 16th, day 2 is the 17th, and day 3 is the 18th. The 15th is not counted in the tally of days.\n\nDate Formats\n\nThe age calculator allows you to input single digit months and days. You do not have to pad them with a leading zero. You must input the 4-digit year however.\n\nUS date formatting can use a forward slash, a period, or a dash:\n\nmm/dd/yyyy\n\nmm.dd.yyyy\n\nmm-dd-yyyy\n\nEuropean date formatting can use a forward slash, a period, or a dash:\n\ndd/mm/yyyy\n\ndd.mm.yyyy\n\ndd-mm-yyyy\n\nInternational date formatting according to ISO 8601 use only a dash (-):\n\nyyyy-mm-dd\n\nToday's date is based on Greenwich Mean Time (GMT).\n\nRelated Calculators: Date Difference, Date ± Days or Business Days Calculator."}], "B. K. Anand is an Indian economist.": [{"url": "https://www.economist.com/business/2023/01/19/the-painful-development-of-indias-startups", "page_content": "“H ow long is your runway before takeoff?” That is how venture capitalists ( vc s) begin meetings in India these days, says Ananth Narayanan, founder of Mensa, one of the country’s newest unicorns (companies worth in excess of $1bn). Until recently the main question that mattered for India’s startup scene was valuation. But the mood has changed. Plunging share prices at companies that have gone public have made vc firms much warier about investing. Prizing unrealistic valuations has given way to worrying about how quickly startups might begin to make money. So far Mensa, which buys stakes in digital brands, is one of a handful of such firms that makes a profit.\n\nListen to this story. Enjoy more audio and podcasts on iOS or Android Your browser does not support the <audio> element.\n\nThat leaves plenty that do not. Since the beginning of 2021, the number of unicorns created in India has risen from 40 to 108. Only America and China have produced more. In 2021 promising startups had no trouble finding investors eager to fund fast-growing firms with big ideas. That year investment in startups tripled to $35bn. The momentum continued in 2022, with $3.7bn invested in March alone. Such was the clamour that startups had their pick of “founder friendly” investors who were not too bothered about supervision, the drudgery of background checks and other intrusive oversight.\n\nThe environment has since cooled. Investment in December was only $900m. One reason is the woeful performance of firms that went public in 2021: Zomato (food delivery), Freshworks (enterprise software), Paytm (payments), Policy Bazaar (insurance) and Nykaa (fashion). The share prices of each has tumbled in excess of 59%. And while a global rout in tech valuations has coincided with a broader sell-off, that is not true of India. The Sensex, an index of the country’s biggest 30 firms, is close to an all-time high and the economy is growing at a decent clip.\n\nThe poor performance means that other planned listings, such as that of PharmEasy, an online pharmacy, will not now go ahead. Acquisitions have been similarly hit. In October the $4.7bn purchase of BillDesk by PayU, both profitable payments companies, was cancelled. PayU’s owner Prosus, a local vc firm affiliated to Naspers, a Dutch-South African company, is widely believed to have walked away because the fall in Paytm’s share price created a new, and far lower, benchmark for what a payments company is worth.\n\nRe-evaluating what startups might be worth is now the foremost concern of all India’s vc firms. Funding hinges on assessing reserves, costs and the time needed to become profitable. In theory, this sort of information is available for all Indian firms because they are required to file public financial statements. But the system operates poorly. Of the 40 startups that have filed results for 2022 only three are profitable, according to Tracxn, a statistical service, and based on their annual spending, only five have enough cash to survive for over six months (see charts). In response to the tougher environment, costs are being cut. Inc42, an online publication tracking startups, counts 20,500 layoffs over the past year, probably foreshadowing a much bigger wave. Edtech has been especially hard hit, with 16 companies axing over 8,000 employees, the most coming at Byju, India’s most valuable startup, which is sacking 2,500 employees. A post-lockdown return to classrooms and low barriers to creating educational material online has raised doubts about the entire sector’s prospects. Byju has other problems. It was accused in July of inappropriately aggressive accounting and sales policies, which it denies. Other startups have also come under fire. BharatPe (payments), Trell (social media) and Zilingo (supply-chain management) saw founders quit last year after fraud accusations. BharatPe’s founder denies the allegations as does Trell; Zilingo is investigating the claims. On January 18th Amit Bhasin, a co-founder of GoMechanic, a car-repair firm, admitted to “errors in judgment as we followed growth at all costs, particularly in regard to financial reporting, which we deeply regret” after it cut 70% of its workers. These tribulations have brought the role of backers into question. Were firms sufficiently monitored? Were valuations credible? Sequoia Capital, a prominent Silicon Valley firm, has invested in GoMechanic, BahratPe, Trell, Zilingo and several edtech companies. It acknowledged in April the governance issues in various holdings and vowed to provide stricter oversight but has declined to comment further. Other foreign vc firms are rethinking how they approach India, too. A more diligent approach may be required.\n\nHow companies come to market is also set to change in response to the losses from public offerings. India’s stockmarket regulator made changes in September that will enable far greater scrutiny. It will force firms to provide information on the prices of private transactions that occurred before listings, as well as the key data used to derive valuations. Large investors will also be required to hold at least half of their shares through at least one accounting period to stop them selling shares during a spell of hype after an offering.\n\nThese changes may not head off the carnage to come. Anand Lunia of India Quotient, a vc firm in Bangalore, believes a quarter to half of the current unicorns will become zombie firms that will exist in name but cease to be funded or operate. His willingness to speak openly is unusual; his views are not. Yet for all the concerns about the immediate future, neither Mr Lunia nor many others who think sharp devaluations are coming are pessimistic about the long-term for startups. The economy is growing strongly and India is good at nurturing entrepreneurial software engineers whose skills increasingly apply in every industry. All of this suggests that the storm ahead will be followed by a resumption of growth, eventually.■\n\nTo stay on top of the biggest stories in business and technology, sign up to the Bottom Line, our weekly subscriber-only newsletter."}, {"url": "https://www.kliponar.com/professor-bal-krishan-anand/", "page_content": "Born: 18 September 1917\n\nDied: 2 April 2007\n\nHe better known as B. K. Anand was an Indian physiologist and pharmacologist.\n\nHe was credited for the discovery of the feeding center in the hypothalamus in 1951.\n\nHe is considered the founder of modern Neurophysiology in India.\n\nHe was born in Lahore as Bal Krishan Anand in 1917.\n\nHe was born in Lahore as Bal Krishan Anand in 1917. He was graduated from King George Medical College in 1940 and obtained his M.D. degree in 1948.\n\nHe joined in 1949 the Lady Hardinge Medical College as a Professor of Physiology.\n\nHe went to Yale University as a Fellow of the Rockefeller Foundation in 1950 and worked with John Brobeck.\n\nThey had published their research work in 1951.\n\nHe returned to India in 1952 and continued his research at Lady Hardinge Medical College.\n\nHe joined the All India Institute of Medical Sciences as its first professor in the Department of Physiology in 1956.\n\nHe was instrumental in establishing the guidelines of education for M.B., B.S. and Postgraduate students.\n\nHe became Dean of that Institute.\n\nHe was instrumental in the establishment of the Sher-i-Kashmir Institute of Medical Sciences in 1982.\n\nClick here for more details\n\n(Visited 162 times, 1 visits today)"}, {"url": "https://www.gudstory.com/anand-srinivasan-biography/", "page_content": "Anand Srinivasan is one of the best economists, authors as well as investors. Moreover, he is also a consultant from Chennai. Moreover, he is an excellent speaker on economically associated matters on Youtube. In addition, he is also the former director of Prakruthi Marketing Services Private Limited. Moreover, he is also a great person who worked immensely for Corona Creative Solutions 2009-2017.\n\nAnand Srinivasan Quick Wikis/ Bio\n\nName Anand Srinivasan Nick Name Anand Profession(s) Economist, Author, Investor and Consultant Birth Year May 13, 1967 Age 54 Years (As of 2021) Famous as Economist Gender Male Birthplace (Native) – Nationality Indian Zodiac Sign – Education – Religion Hindu Net Worth – Father Name – Mother Name – Marital Status Married Spouse – Kids –\n\nA Short Biography Of Anand Srinivasan\n\nSo, let’s talk about Anand Srinivasan’s life now. He was born in the year 1967 on 13th May. Therefore, he is currently 54 years old. People call him Anand as his nickname.\n\nHowever, there’s no information about her parents. Therefore we don’t know their name. As for his nationality, he is Indian with Hindu religion. We have no clue of his birthplace, however, currently, he lives in Tamil Nadu, Chennai.\n\nMoreover, his hobbies are studying information. In addition, he was also great at a study from childhood. So, he went to DAV Larger Secondary School in Diphu in his childhood. Thereafter he went to MS Ramaiah Institute of Know-how in Bangalore.\n\nAfter a great period of education, he soared higher and higher towards more infinite attainable knowledge. His exuberance at learning is unimaginable. Therefore, he became an economist with excellence. Moreover, he is also a great author and a consultant on various matters.\n\nADVERTISEMENT\n\nApart from his education and career, he is also a married man. However, we don’t know any info on his spouse or his children.\n\nSome More Interesting Facts On Anand Srinivasan\n\nSince we know that he is a consultant, let’s check out some of his advice. He said that if a middle-class person utilizes a credit card, it can be harmful. According to his views, if a person buys a product, which is greater than their budget, then he should earn a sufficient amount of money in order to buy that product.\n\nMoreover, he is of the view, that there’s no need to invest money in a start-up business. Furthermore, he holds the view that china might never let India grow. In addition, he is also an avid supporter of the National Congress Party.\n\nAlso read: Mustafa Raj (Priyamani Husband) Biography"}, {"url": "https://www.newsintv.com/biography/anand-srinivasan-economist/", "page_content": "Anand Srinivasan is an economic expert who is known for speeches about economics on his Youtube channel. He recently became popular on social media after he gave advice to a youngster about savings.\n\nAnand Srinivasan Biography, Age, Wiki, Height, Family\n\nBiography Name Anand Srinivasan Profession Economist Personal Life Date of Birth 13 May 1967 Age 56 Years Hometown Chennai, Tamil Nadu Current City Chennai, Tamil Nadu Nationality India Education Qualification Graduate Religion Hindu Caste Not Known Zodiac Sign Capricorn\n\nEarlier Life & Family\n\nFamily/Spouse Family Father – Not Known\n\nMother – Not Known\n\nSiblings – Not Known Marital Status Married Spouse/Partner Not Known Children Not Known\n\nAnand Srinivasan birthday was on 13 May 1967 and his age is 56 Years as of 2023. He was born in Chennai, Tamil Nadu, India.\n\nHis father and mother’s name is unknown. He went to DAV High Secondary School in Diphu, Assam to complete his schooling. He graduated in Economics from MS Ramaiah Institute of Technology, Bengaluru. He is currently living in Chennai, Tamil Nadu.\n\nAnand Srinivasan is Married and his wife’s name was not known. Unfortunately, there are no more personal pieces of information about her.\n\nAnand Srinivasan Height & Weight\n\nPhysical Appearance: Anand Srinivasan Height – 1.65 m and Weight is 90 Kg. He has Black color hair and Black color eye. He belongs to the Hindu religion and caste/community details are not known.\n\nPhysical Stats & More Height 1.65 m Weight 90 Kg Hair Color Black Eye Color Black\n\nAnand Srinivasan Career\n\nAfter getting graduation in Economics, he decided to become an economist. He also worked as a director in Prakruthi Marketing Services Private Limited (PMSRL).\n\nAnand also worked in Corona Creative Solutions till 2017. He is a great supporter of the National Congress Party. He once said that there is no need to invest to start a business.\n\nHe is well known for his statements about economics. In July 2022, he became an internet sensation when he advised a guy about how one should save money.\n\nAnand Srinivasan Social Media\n\nAnand is quite popular on social media with more than 20k followers on Facebook, Twitter and Instagram. He is active on Instagram as he used to upload videos of his speech about economics, the future of real estate and much more.\n\nInstagram anandsrinivasan Facebook anand.srinivasan.946 Twitter anand_srini\n\nIn conclusion, here completing about Anand Srinivasan Biography, age, Wikipedia, family, caste, height, weight and more. Go to Biography to know more about famous celebrities profiles. If you have any corrections or feedback on the above post then please feel free to Contact Us."}, {"url": "https://www.timesnownews.com/india/india-demographic-potential-augusto-claros-in-conversation-with-mk-anand-at-times-now-summit-2022-article-95833832", "page_content": "Subscribe to Notifications\n\nThe world is at the cusp of a once-in-a-millennia change, the impact of which will reverberate through different spheres of our existence for decades, if not centuries. And India is at the core of the impending event. In April 2023, India will overtake China as the world’s most populous country.\n\nIndia will be home to 1.42 billion people, most of whom will be of working age. But would it be naïve to have a linear, mostly positive, view of the opportunity, or is it time we mull over ways to channel this advantage to bring about real and perceptible change to the lives of India’s teeming billions?\n\nMK Anand, MD & CEO, Times Network, articulated these critical questions as he hosted an absorbing session with celebrated economist Augusto Lopez-Claros, Executive Director of the Global Governance Forum at the Times Now Summit 2022\n\nUnleashing India’s demographic potential\n\nTrue to this year’s theme ‘India: A Vibrant Democracy. Global Bright Spot’, the Anand-Augusto interaction looked at ways to unleash the true potential of India’s demographic advantage, while also deliberating on the mistakes that the nation must avoid.\n\nWhile demographic dividend, sustained high growth, stable political scenario and a resolute push to create infrastructure are the high points of the India story, there’s a lot of catching up that India will have to do when it comes to issues like education and healthcare to name a few. More importantly, is India’s population, especially the working population, equipped to take advantage of the opportunity?\n\nAnand said, “When everything is on par, if everyone’s productivity is equal, then countries with higher population are obviously stronger and bigger in terms of the market and therefore the negotiating power at the global high table. But productivity is not the same in all countries. And in the last 200-300 years that difference is stark because the technology that started in the West gave a very significant advantage.”\n\nReferring to the huge gap between the per capita GDP between the developed counties and the rest of the world, Anand brought into focus the India-China example. 30 years back, the Asian giants had a per capita GDP of around USD 300. While India progressed to its current level of USD 2,100, China grew exponentially to USD 11,000 in the same period.\n\nHowever, going beyond numbers, Anand pointed out that one must factor in that India has grown while being a robust democracy, an important distinction when it comes to the China example.\n\nAnand elucidated the point further by asking Augusto how he sees this change happening in terms of the quantity of the population, and the changes in the potential and the ‘quality’ of the population. This a challenge for the country, given the regional disparities in key indicators like per capita income, skills, and population growth. How should India navigate the conundrum?\n\nWhile agreeing with the positives of the population story, Augusto leaned on his global experience to propose the idea of ‘fiscal federalism’, he said, “I was actually quite surprised when I looked at the India data on income per capita across the various states. These regional differences in income per capita are quite common throughout the world. If we look at federal states like the US or the European Union , we will see these differences.”\n\n“There are a couple of surprising things about Indian data. One is the big gap. India has a state like Kerala which has an income per capita in PPP terms of over USD 9,000 which is higher than Ukraine was before the war. And then the country has Bihar, which is again on PPP terms approximately USD 2000 and practically, accounts to one-fifth of that of Kerala.”\n\nHow Did The World Do It?\n\nCiting global examples, Augusto said, “If we go back to 1990 and look at the income per capita of the three richest states and compare it with the income per capita of the three poorest states, the difference was 50 per cent. And that is comparable to what we see in the United States and in the European Union today.”\n\n“In fact, in those other parts of the world, there has been a tendency for catching up. The poorer countries' growth regions grow faster than the richer countries and eventually, there's some level of catch-up. In India, that 50 per cent by today is three times, which means the gap has widened spectacularly. Rich regions are becoming richer and poorer are staying behind in a big way and this is concerning.”\n\nThe Spain Story\n\n“When I was in my late 20s, I was the IMF Economist for Spain and at that time Spain was essentially rapidly integrating into the European economy together with Portugal they joined the European Union at the same time and they were sort of the poor cousins of Europe like Bihar of India with a huge difference in income per capita with respect to Germany the Netherlands and France,” Augusto said.\n\n“If we look at the data today, Spain has caught up. In other words, it has gone in exactly the reverse direction of what's happening in India. So, how did this happen? The European Union has an explicit program for its members, we call it fiscal federalism. It basically consists of countries like Germany and the Netherlands will have an income per capita that is above the average transfer of resources through the European Union budget to the countries that have income per capita below the average and they do large investments in infrastructure.”\n\n“I don't think you can do these conversions in India unless you do something like that, where you have an explicit program of transfers through the tax system from the richer regions to the poorer regions. If you don't do that, these differences are going to accentuate and the problem with income disparities of this nature is that then soon they become a political problem, not just an economic one,” Augusto asserted.\n\nIn response, Anand explained the ground realities in India, “That’s precisely what I was wondering, because if you look at the political map of India from a state’s points of view, that I was discussing, the richer parts have local governments which right now are only concerned about their regions. When you talk to ministers and those states, they are basically concerned about development, but it could be quite possible in the future, maybe a decade or two down the line that they come together and ask why is that resources are moving out here to there and what we are getting against that?”\n\nIndia must use its demographic potential in a manner that will help speed up its growth story. While there are challenges, the opportunity is also too big to let go at this juncture in our history."}, {"url": "https://www.ey.com/en_in/people/d-k-srivastava", "page_content": "Welcome to EY.com\n\n\n\nIn addition to cookies that are strictly necessary to operate this website, we use the following types of cookies to improve your experience and our services: Functional cookies to enhance your experience (e.g. remember settings), and Performance cookies to measure the website's performance and improve your experience., and Marketing/Targeting cookies, which are set by third parties with whom we execute marketing campaigns and allow us to provide you with content relevant to you.\n\n\n\n\n\nWe have detected that Do Not Track/Global Privacy Control is enabled in your browser; as a result, Marketing/Targeting cookies, which are set by third parties with whom we execute marketing campaigns and allow us to provide you with content relevant to you, are automatically disabled.\n\nYou may withdraw your consent to cookies at any time once you have entered the website through a link in the privacy policy, which you can find at the bottom of each page on the website.\n\nReview our cookie policy for more information.\n\nCustomize cookies\n\nI decline optional cookies"}, {"url": "https://wikimylinks.com/content/anand-srinivasan-wiki-biography-age-books-images-more", "page_content": "Anand Srinivasan is an Economist, Author, Investor, and Consultant from Chennai. He’s well-known for his speeches on matters associated with economics which airs on Youtube channels. He’s the previous director of Prakruthi Advertising and marketing Providers Personal Restricted, Chennai. He additionally labored in Corona Creative Solutions between 2009 to 2017.\n\nAnand Srinivasan Biography\n\nName Anand Srinivasan Real Name Anand Srinivasan Nickname Anand Career Economist, Author, Investor, and Consultant Date of Birth 13 Might 1967 Age 52 (As of 2019) Zodiac sign Yet to be updated Family Father: Yet to be updated\n\nMother: Yet to be updated Marital Standing Married Affairs/Girlfriends NA Spouse Yet to be updated Youngsters NA Religion Hindu Educational Qualification Yet to be updated School DAV Larger Secondary School, Diphu College MS Ramaiah Institute of Know-how, Bangalore Hobbies Studying Information Birth Place Yet to be updated Hometown Yet to be updated Current City Chennai, Tamil Nadu, India Nationality Indian\n\nAnand Srinivasan’s Official Social Profiles\n\nfb.com/anand.srinivasan.946\n\ntwitter.com/anand_srini\n\nInstagram: Yet to be updated\n\nFascinating info about Anand Srinivasan\n\nAnand says that utilizing a bank card is likely to be dangerous to the center class. Based on him, if an individual needs to purchase a product that is larger than his funds, then he ought to wait till he earns adequate cash for that product.\n\nHe strongly says that there is no such thing as a want to speculate cash to begin an enterprise.\n\nMoreover, he had stated, China won’t ever let India develop.\n\nAnand is a robust supporter of the Nationwide Congress Social gathering.\n\nAnand Srinivasan Images"}, {"url": "https://prabook.com/web/anand_narain.asthana/480472", "page_content": "Anand Narain Asthana Edit Profile\n\neconomist\n\nAnand Narain Asthana, Indian economist. Merit scholar, 1968; British Council fellow, 1988, Bennet fellow, 1991. Member Indian Institute Public Administration (life).\n\nBackground Asthana, Anand Narain was born on September 5, 1951 in Sitapur, India. Son of Mahabir Prasad and Savitri (Varma) Asthana.\n\nEducation Bachelor of Engineering, University Roorkee, India, 1972. Master of Science, University Bath, England, 1989. Doctor of Philosophy, Fordham University, New York, 1994.\n\n\n\nAttended program on fiscal decentralization, Harvard University, 1996.\n\nCareer Dist collector, State Government, Vidisha, India, 1982-1983; deputy secretary, State Government, Bhopal, India, 1983-1986; district collector, State Government, Betul, India, 1986-1987; additional commissioner, Sales Tax, Indore, India, 1987-1988; deputy secretary, director national drinking water mission, Government of India, New Delhi, 1989-1991; finance secretary, State Government of India, Bhopal, since 1994. Board directors State Industries Corporation, Bhopal, State Coopr Bank, Bhopal, State Marketing Federation, Bhopal.\n\nAchievements Anand Narain Asthana has been listed as a noteworthy economist by Marquis Who's Who.\n\nMembership Member Indian Institute Public Administration (life)."}, {"url": "https://www.economist.com/whichmba/2010/asia-ranking", "page_content": "How long before an Asian school reaches the top ten?\n\nThe balance of world power is shifting. Twenty years ago few commentators took the financial muscle of China or India seriously. Try finding someone who shares that view now. These new economic superpowers are not the only countries giving Western finance ministers sleepless nights. Six of the nations that make up Goldman Sachs's “Next 11” emerging economic powers—Bangladesh, Indonesia, Pakistan, the Philippines, South Korea and Vietnam—are in the eastern hemisphere.\n\nThe potential impact on business education is huge. The heavy flow of applicants from Asia to schools in Europe and America has already slowed as the East's best and brightest opt to study closer to home. So is the balance of the world's intellectual power shifting?\n\nAlthough some Asian and Australasian schools have fallen in The Economist's global ranking this year, having found it harder to place graduates in top jobs, in the long term their march upwards seems inexorable. Currently there are 13 schools that feature in our global top 100 (the Asian Institute of Management falls just outside); five years ago there were just nine. In ten years' time, it may be that the University of Hong Kong, Hong Kong University of Science and China Europe International Business School (CEIBS) will be challenging the best schools in North America and Europe for a position in the top ten.\n\nDemand is certainly on the rise. Score reports for the GMAT, the test used by business schools as part of the candidate-selection process, indicate that in the past five years the number of applicants from China, India, Hong Kong and Singapore sending their test scores to local schools has more than tripled. But to compete on the world stage they must also attract talent from farther afield. The signs are encouraging.\n\nAt CEIBS, based in Shanghai, the share of Western students in the full-time MBA programme has increased from 2% in 2005 to 22% in 2009. The National University of Singapore (NUS) has seen similar growth. Since 2006 there has been a threefold increase in the number of North American applicants for its MBA programmes and a more than fourfold increase in European applicants. Lim Yue Wen, the school's director of graduate studies, identifies several factors driving this demand, including the burgeoning Asian economy. “We have seen more multinational corporations setting up their regional headquarters in Asia, and in the process, the need for talent has risen accordingly … Thus, it is not surprising that students will want to be in Asia, where the action is.”\n\nIndia, for many years the largest exporter of students to Western business schools, is also seeing foreign applications grow, albeit more slowly. The Indian School of Business in Hyderabad reports that though international students make up only 5% of the current MBA class, international applications have almost doubled over the past two years. In a tentative global economy, the school believes, India continues to provide better opportunities for career progression. Given that it is not easy to start a career in a new country, it makes sense for Western applicants to consider studying in the region first.\n\nIf the GMAT is any indicator of student quality, these schools can also claim to attract a bright talent pool. The average score of a student at ceibs is 696 (out of 800), on a par with London Business School. Furthermore, the appeal of Asia appears to work for both sexes. Whereas Western business schools have long struggled to encourage more women into the classroom, in many MBA programmes in South-East Asia around 40% of the students are female. Hong Kong University tops the list with 48%.\n\nAs might be expected, a growing number of Western business schools are responding by setting up their own campuses in the region. Chicago and two French schools—INSEAD and ESSEC—are now well established in Singapore; Western Ontario's Ivey school has made a second home in Hong Kong; Vlerick, a Belgian school, and hec Paris have entered the Beijing market; and Duke University in North Carolina is developing campuses in Shanghai and New Delhi. Such expansion provides these schools with direct access to Asian mba recruiters as well as offering students the opportunity to learn in Asia. It also appeals to faculty, by providing research and case-study opportunities in the world's most dynamic regional economy.\n\nNot there yet\n\nBut there remain areas in which the business schools of Asia and Australasia will have to improve if they are to claim a place at the top table. For one, the region still lacks a school with the brand-recognition of longer established American and European schools. Here they can draw encouragement from the experience of European business schools like Spain's ie, little-known ten years ago, but now rising to global prominence.\n\nAsian schools also lack powerful alumni networks, which offer the fund-raising potential and career opportunities that are the lifeblood of schools in America and Europe. This also takes time, but as more alumni filter into the boardrooms of London, New York and Shanghai, momentum will inevitably build.\n\nFinally, there is an inability to attract the world's leading thinkers and best teachers. To date, many Asian business schools have relied on visiting faculty to make up their numbers, but they have struggled to convert these to permanent teaching positions. As schools develop research centres and provide direct access to Asia's banks, conglomerates and family businesses, professors will take a closer look at a permanent move east. The recent arrival of Arnoud de Meyer, director of Cambridge's Judge school, at the Singapore Management University might be a sign of things to come."}], "B. K. Anand was the former Chairman and Managing Director of the State Bank of India (SBI).": [{"url": "https://www.britannica.com/topic/State-Bank-of-India", "page_content": "State Bank of India (SBI), state-owned commercial bank and financial services company, nationalized by the Indian government in 1955. SBI maintains thousands of branches throughout India and offices in dozens of countries throughout the world. The bank’s headquarters are in Mumbai.\n\nThe oldest commercial bank in India, SBI originated in 1806 as the Bank of Calcutta. Three years later the bank was issued a royal charter and renamed the Bank of Bengal. Along with the Bank of Bombay (founded 1840) and the Bank of Madras (founded 1843), it was one of three so-called presidency banks, each of which was jointly owned by the provincial government and private subscribers. In 1921 the presidency banks were merged to form the Imperial Bank of India (IBI), which then became the largest commercial enterprise in the country. In 1955 the government of India and the country’s central bank, the Reserve Bank of India (founded 1935), assumed joint ownership of IBI, which was renamed the State Bank of India. Four years later, by the State Bank of India (Subsidiary Banks) Act, banks earlier operated by individual princely states became subsidiaries of SBI. The Reserve Bank’s share of SBI was transferred to the government in 2007. Since nationalization, SBI has served the needs of Indian economic development through rural-development initiatives and microcredit programs and by financing major agricultural and industrial projects and raising loans for the government.\n\nSBI is governed by a board of directors headed by a chairman. The chairman and managing directors of the bank are appointed by the government."}, {"url": "https://www.mckinsey.com/capabilities/strategy-and-corporate-finance/our-insights/how-the-state-bank-of-india-is-learning-from-crisis", "page_content": "How should a leader approach a challenge as unprecedented, volatile, and globally disruptive as the COVID-19 pandemic? As a learning experience. That’s the attitude of Rajnish Kumar, chairman of the State Bank of India (SBI). The veteran banker, who joined SBI in an entry-level role four decades ago, is now tasked with leading India’s largest financial institution through an uncertainty that no organization had anticipated.\n\nNonetheless, some of the digital initiatives SBI had undertaken before the crisis are helping to meet the moment. In 2017, for example, SBI launched YONO (“you only need one”), a mobile app that offers services for banking, investments, and trading, as well as a platform for online shopping. And, with 24 million accounts, it’s also the world’s largest digital bank. The institution began to rethink the operational side as well, reconsidering what a bank should be in the digital age. That includes service virtualization and remote work—plus a lot of deep reflection on India’s needs in the decades to come.\n\nShare Rajnish Kumar biography Rajnish Kumar is chairman of the State Bank of India. Kumar joined SBI in 1980, serving in various positions, including director, SBI Life Insurance, and managing director, National Banking Group, before taking office as chairman, in 2017. Kumar is a graduate of Chaudhary Charan Singh University.\n\nTaking the long view, as well as embracing and reappraising digital and what it can and should be, is a challenging leap for any legacy organization, and SBI faces an especially rich stew of challenges. With more than 22,000 branches, some 448 million customers, and a market share within India of about 23 percent, the partly state-owned, partly publicly traded bank has the dual mandate of serving all Indians—including those who have grown up with the notion of a bank as a brick-and-mortar institution—as well as its shareholders.\n\nRecently, on a videoconference with McKinsey’s Akash Lal and Joydeep Sengupta, Kumar took time to discuss his “CEO moment,” including how he is dealing with the crisis and reimagining SBI for the future. In addition to helping maintain the stability of India’s banking system and strengthening the bank’s own digital capabilities, Kumar is dealing with issues of personal leadership that will resonate with many global leaders, including how to avoid “los[ing] your cool in such circumstances” and living the idea that “whatever we learn through this process, it must not go to waste.”\n\nThe Quarterly: How are you doing in all of . . . this?\n\nRajnish Kumar: You know, we had tested for disruptions in a simulated environment. But this—this is testing in a real environment. No business or organization had anticipated that it would have to deal with the situation brought about by COVID-19. And, of course, it’s not confined to one country; it’s in all countries and economies. No question, we are in an unprecedented situation. I have spent almost 40 years now in the banking system. We are used to having disruptions, and there have always been localized disruptions. But nothing of this scale or effect.\n\nFortunately, we had been investing in our technology and digital capabilities and had been looking to build on that. So we have been able to keep our operations up and running, and there’s been no disruption of service as far as transactions go.\n\nThe Quarterly: How has that looked behind the scenes? What kinds of operational changes have you been making?\n\nRajnish Kumar: We have a work-from-home policy, but it was not tested in a big way, so this has been a good learning period. We also have a unique practice where in cities like Mumbai or Delhi—places where commuting is a major issue—we have residential real estate so our people can live close to the office or to global IT centers. But, of course, during the pandemic, they can’t come in. So for certain back-office or IT functions, we’ve procured laptops that have secure access to our full banking office.\n\nOver the long term, this raises exciting questions. How do we create the flexibility between an office or a workplace and build the capability to work from anywhere? This could perhaps bring huge productivity gains. How can we use this [crisis] to reimagine how we work?\n\nThe Quarterly: What does it mean to reimagine SBI’s operations in a post-COVID-19 world?\n\nRajnish Kumar: It starts with understanding which functions have to be done at the branch or at a physical office. We have to look at each and every office, floor by floor, each and every position, each and every role, and each and every person. Can I convert and have satellite offices? Why can’t you do the job from anywhere else?\n\nAnd how do we do that without impacting efficiency or diluting any control or policy functions? Whatever our approach, it has to be absolutely secure, because of the sensitivity around the data of the bank. There cannot be even a little bit of laxity in that. The current model is that you live at a place, and you work at a place. And in that process, you may have to travel 20 kilometers, you may have to travel 40 kilometers. Or, if you are lucky, you may not have to travel much.\n\nThis concept will undergo a change, but when it does, what will be the impact on individual human behavior? Not everybody would like to work from home. It may look like a very exciting idea, but when you sit at home for one month, you may realize it is not such an exciting idea. [Laughs.] So the flexibility around workplaces, and what the compensation structure should be, have to be thought through. We’re in a much better position now because our learnings are based on a real situation.\n\nThe Quarterly: What does all this mean for your customers as you look ahead?\n\nRajnish Kumar: Even before the pandemic, 90 percent of customer transactions were happening away from our physical branches—and, even though [the pandemic] has proved the robustness of our platform, we still have to build on our digital capabilities to serve customers better.\n\nOf course, we have many customers, including many senior citizens, who are not tech savvy and still prefer to visit a branch; it is an outing for them to come to a branch and talk to people. We also have a segment of customers who are underprivileged—and, again, not as tech savvy—who depend on us. So for people who want to come to the branches, we say, “Let them come!” We will, of course, serve them.\n\nBut there is a growing, largely urban middle class who are very familiar with technology and very comfortable with their smartphones. And more and more, people don’t want or need to travel for transactions, particularly banking transactions, but others as well—investments, shopping. That’s why we built out YONO.\n\nIn addition to banking transactions, YONO enables people to take loans, manage investments, and buy insurance. And there’s also online shopping, which is a big attraction—and a cool product. And many more functionalities are coming; we are in the process of building a B2B platform for YONO business, and development is a continuous process. We complete one thing and think, “What more can we do for the customer?” Our philosophy has been that whatever you imagine in terms of your daily needs, whatever you need to do, you should be able to do on one single platform.\n\nParticularly during the crisis, YONO has come in handy. During the lockdown, we’ve had 30,000 new users a day joining our existing users, often because they can’t visit their branch.\n\nThe Quarterly: Let’s change gears and talk about you as a leader for a moment. How do you approach the challenge of leading a large institution through uncertainty of this scale and scope?\n\nRajnish Kumar: I firmly believe that you need to be convinced of whatever you’re doing. That’s the starting point. Don’t do anything in a half-hearted manner. Once your personal commitment is established, it is crucial that people believe; whatever you do as a leader, you have to have credibility. If I say something and it applies to others but not me, I lose credibility. It’s important to remain connected to the ground and be accessible. Personal credibility and personal commitment matter a lot at the CEO level, and also from the top-management team, whose buy-in you need. Whatever we do, we always have to be aligned with the core values of the organization. We must resist the temptation to do things in a short-term manner or align goals with our own instincts.\n\nAnd whatever we do, ultimately, it has to benefit the people affected—whether they’re staff members or customers. If you do something that only benefits the organization, it’ll be a much harder push. The chances of success are much higher when everyone benefits.\n\nThe Quarterly: As a state-owned bank, how do you balance social responsibility with your duty to shareholders?\n\nRajnish Kumar: On the social-policy side, SBI is helping with the stability of the financial system and revival of economic growth. Action has to be coordinated between the bank, the government, and the various regulators. The quality of the government’s response depends on how honestly the feedback is reaching the government from the ground. As the CEO of SBI, I’m connected to the ground: what’s happening in the economy, to the individuals, to businesses. Based on what we’re observing, we make recommendations that help the government shape its response. If we say [to the government], “Look, we see a genuine problem here,” it adds more credibility. Our large size—and that we’re 57 percent owned by the government—also adds to our credibility.\n\nRegarding our duty to shareholders, there are certain interventions in the area of social banking that we have to do as a government-owned bank. And there’s a financial cost to that, which is reflected in our earnings. There’s no such obligation on the private sector. So when measured purely by returns to shareholders, there is a fairly huge difference. But I always say there are certain inherent advantages to public ownership, especially public confidence around keeping their money with the bank. Ultimately, shareholders will still look at the expected return on their equity. But performance shouldn’t be solely measured by the returns to shareholders. Corporations should be measured by what they’re doing for society as a whole. When that happens, the true worth of organizations would be more. Then again, I may say that, but investors in the stock market—they’re not going to like it. [Laughs.]\n\nThe Quarterly: Looking back, do you think that we will view this crisis as a speed bump or as an inflection point?\n\nRajnish Kumar: Oh, it will be a true inflection point. The world is not going to be the same as it was pre-COVID-19. There are a lot of questions around global supply chains. There are a lot of questions about new leaders, or whether a new world order will emerge. I think that this pandemic, in terms of implications, will be as big an event as World War II. We had a period where globalization was a panacea for everything. I don’t believe that thinking will remain. More self-reliance may become the norm, and the way we interact with people, the way we live our life, will shift as well.\n\nCould that conclusion change? Yes; with human nature, sometimes memory is very short. But I have my doubts that it will be business as usual. I think that big changes are inevitable after this pandemic. And whatever we learn through this process—it must not go to waste."}, {"url": "https://www.sidbi.in/en/directors", "page_content": "Shri Monomoy Mukherjee is presently working as Chief General Manager in National Bank for Agriculture and Rural Development (NABARD) and holds the charge of Secretary’s Department. He is also the Chief Compliance Officer of NABARD and its First Appellate Authority under RTI Act.\n\nHe has done his M.Sc in Chemistry from Delhi University and M.Tech (Catalysis Technology) from IIT, Kharagpur. He is Certified Associate of Indian Institute of Bankers and Certified Consultant for Training Need Assessment and Design of Training.\n\nHe has experience of 34 years across various offices and departments of NABARD including Faculty Member for 6 years. He has experience in development finance across Non-Farm Sector, Microfinance & Climate Space; Banking Technology and Human Resource Development."}, {"url": "https://www.zeebiz.com/india/news-anand-mahindra-uncle-keshub-mahindra-former-chairman-of-mahindra-mahindra-passes-away-230291", "page_content": "Keshub Mahindra passes away: Keshub Mahindra, India's oldest billionaire and Chairman Emeritus of Mahindra & Mahindra, passed away at the age of 99. He had a net worth of $1.2 billion and is known to for expanding the business of Mahindra Group during his long tenure of 48 years.\n\nHe retired as chairman of the company in August 2012 and his nephew Anand Mahindra took over as Chairman and Managing Director of the then $15.4 billion conglomerate.\n\nWho was Keshub Mahindra?\n\nKeshub Mahindra had joined the M&M board in 1948 and was elected Chairman in 1963. During the 48 years of his chairmanship, the Mahindra Group expanded from being an automobile manufacturer to other business segments like IT, real estate, financial services and hospitality.\n\nHe played key roles in forging business alliances with global majors such as the Willys Corporation, Mitsubishi, International Harvester, United Technologies, British Telecom and many others.\n\nKeshub had also served on a large number of Boards and Councils in both private and public domain. He was the founder Chairman of HUDCO, and also served on many corporate boards, including SAIL, Tata Steel, Tata Chemicals, Indian Hotels, IFC, ICICI and HDFC.\n\nBesides, he also held the position of President ASSOCHAM, the Employers' Federation of India and the Bombay Chamber of Commerce and Industry.\n\nHe was a member of the Sachar Commission on Company Law and Reforms, a member of the Prime Minister's Council on Trade and Industry and Chairman of the Indian Institute of Management, Ahmedabad.\n\nKeshub Mahindra passes away: PM Narendra Modi condoles death\n\nPrime Minister Narendra Modi expressed condolences over Keshub Mahindra's death, saying that the industry doyen will be remembered for his contributions to world of business and his philanthropic works. \"Anguished by the passing away of Shri Keshub Mahindra Ji. He will be remembered for his contribution to the world of business and his philanthropic efforts. Condolences to his family and friends. Om Shanti,\" he tweeted."}, {"url": "https://economictimes.indiatimes.com/bank-of-india/infocompanymanagement/companyid-11964.cms", "page_content": "Date Sources:Live BSE and NSE Quotes Service: TickerPlant | Corporate Data, F&O Data & Historical price volume data: Dion Global Solutions Ltd.\n\nBSE Quotes and Sensex are real-time and licensed from the Bombay Stock Exchange. NSE Quotes and Nifty are also real time and licenced from National Stock Exchange. All times stamps are reflecting IST (Indian Standard Time).\n\nBy using this site, you agree to the Terms of Service and Privacy Policy."}, {"url": "https://www.savethechildren.in/about-us/our-team/governing-council/", "page_content": "Swaroop Sampat Rawal\n\nTalented actress, former Miss India, and noted child rights activist, Swaroop Sampat Rawal is a superlative educational researcher and trainer. She travels across India to conduct workshops for teachers facilitating a general comprehension of life skills and drama in education. Selected by the former Gujarat Chief Minister to head an educational programme in the state, she has been training primary school teachers for the last seven years.\n\nShe also works with social workers and police personnel in Gujarat and other states, campaigning life skills and child rights. An expert communicator with over 20 years of experience dedicated to community development and advocacy within the field of education, she aims to help children overcome adversity."}, {"url": "https://www.havells.com/en/aboutus/directors.html", "page_content": "Subhash S Mundra Independent Director DIN : 00979731\n\nMr. S.S. Mundra retired as Deputy Governor of Reserve Bank of India on 30th July 2017 after completing a stint of three years. Prior to that, the last position held by him was as Chairman and Managing Director of Bank of Baroda from where he superannuated in July 2014. In his banking career spanning over four decades, Mr. Mundra held several important positions including that of Executive Director of Union Bank of India, Chief Executive of Bank of Baroda (European Operations) amongst others. He also served as RBI’s nominee on the Financial Stability Board (G20 Forum) and its various committees. Mr. Mundra was also the Vice-chair of OECD’s International Network on Financial Education (INFE).\n\nAmity University has conferred the Degree of Doctor of Philosophy (D.Phil.), Honoris Causa, upon Mr. Mundra, in recognition of his services in the field of banking and related areas.\n\nHe is now on the Board of BSE Ltd., DSP Investment Managers Pvt. Ltd., Indiabulls Housing Finance Limited, Airtel Payments Bank Limited, Acuite Ratings & Research Ltd., and Ayana Renewable Power Private Limited as Independent Director, besides being on various Advisory Boards such as of M/s. Encore Asset Reconstruction Pvt. Ltd., Global Risk Advisory Committee of PayU Global – Netherlands, India Advisory Board of Master Cards, Governing Board of IMT – Ghaziabad, to name a few."}, {"url": "https://www.financialexpress.com/industry/anand-burman-appointed-eveready-chairman/2613901/", "page_content": "Eveready Industries on Monday appointed Anand Chand Burman, former chairman of Dabur India, as chairman of the company after the Burmans last month reclassified themselves as promoters of the dry cell battery maker.\n\n“We write to inform you that at the meeting of the board of directors of the company held today, Anand Chand Burman has been designated as the chairman of the company,” Eveready said in a stock exchange filing.\n\nThe 70-year-old is a member of the fifth generation of the Dabur group’s founder’s family. He had taken charge as chairman of Dabur India in 2007 after having held the post of vice-chairman and various other roles. Other than the Dabur Group of companies, he is also on the board of Aviva Life Insurance and Ester Industries, among others.\n\nEveready’s board on July 12 appointed Anand Burman, Mohit Burman and Arjun Lamba, a close associate of the Burmans, as non-executive directors of the company, subject to the approval of shareholders. Sunil Kumar Alagh was appointed as an independent director for a period of five years, effective July 12.\n\nEarlier this year, the Burman family, promoters of Dabur India, reclassified themselves as promoters of the dry cell battery major, replacing the Khaitans.\n\nThis was after Puran Associates, VIC Enterprises, MB Finmart, together with Gyan Enterprises and Chowdry Associates — all investment arms of the family — became promoters of the Kolkata-based company following the completion of an open offer in June. The Burmans now have a 38.38% stake in Eveready, having acquired over 14% shares in the open offer.\n\nAditya and Amritanshu Khaitan had resigned from the board in March, after the Burmans declared plans for an open offer to acquire full control of the company. Aditya was non-executive chairman, while Amritanshu was managing director. Suvamoy Saha, who was then joint managing director, assumed charge as managing director.\n\nQ1 net falls 27.48%\n\nEveready Industries on Monday reported a 27.48 % year-on-year decline in its consolidated net profit to Rs 21.85 crore for the first quarter this fiscal. It had posted a net profit of Rs 30.13 crore in the first quarter last fiscal. Revenue from operations was up 18.87% y-o-y to Rs 335.38 crore during the quarter under review as against Rs 282.14 crore in the year-ago period.\n\n“We are glad to have commenced the year on a positive note with a robust growth in revenues, at 19%. This performance was realised despite the challenges witnessed during the quarter on account of inflationary conditions,” Saha said.\n\n“Given the strong recall enjoyed by Eveready, we are making all efforts to create momentum across business segments through an enhanced portfolio that will be supported by our core strengths i.e., sustained brand communication and effective distribution,” he said."}, {"url": "https://www.ipca.com/board-of-directors/", "page_content": "Premchand Godha\n\nExecutive Chairman\n\nMr. Premchand Godha, is a qualified Chartered Accountant and a Commerce graduate. He is also a first generation entrepreneur. He was in professional practice for five years before joining the company.\n\nMr. Godha is a Director on the Board of Directors of the Company since 31st October, 1975 and has been the Managing Director of the company since March 1983. He has over 45 years of experience in the pharmaceutical industry.\n\nUnder his leadership, the company has made tremendous growth in all spheres of activities and has brought Ipca to the forefront of the Indian Pharmaceutical industry."}, {"url": "https://www.worldbank.org/en/about/people/a/anshula-kant", "page_content": "Anshula Kant was appointed Managing Director and World Bank Group Chief Financial Officer on October 7, 2019. In this role, she is responsible for financial and risk management of the World Bank Group, reporting to the President. Among other key management duties, her work includes oversight of financial reporting, risk management and mobilization of IDA and other financial resources.\n\nThrough her work at the State Bank of India (SBI), Ms. Kant has more than 35 years of experience in banking, including retail and corporate banking, mortgage finance, local currency and foreign exchange instruments, and a diverse array of leadership challenges covering finance, risk, operations, treasury, funding, regulatory compliance and general management. As CFO of SBI, Ms. Kant managed $38 billion of revenues and total assets of $500 billion. Stewarding the organization, she greatly improved the capital base and focused on the long-term sustainability of SBI within her mandate.\n\nShe was a Managing Director and member of the Board of SBI from September 2018 till August 2019. With direct responsibility for the SBI's Risk, Compliance, and Stressed Asset Portfolio, Ms. Kant led the creation of investment opportunities while empowering risk management throughout the bank.\n\nMs. Kant, a native of India, earned her bachelor’s degree with honours in Economic from Lady Shri Ram College for Women and a master’s degree in Economics from Delhi School of Economics."}]}