{"Robert Emmett Keane directed several films, including The Iron Mask (1929) and The Three Musketeers (1921).": [{"url": "https://www.imdb.com/title/tt0020030/reviews", "page_content": "7 /10\n\nTHE IRON MASK (United Artists, 1929), directed by Allan Dwan, based on \"The Man in the Iron Mask\" by Alexander Dumas, a sequel to Dumas's THE THREE MUSKETEERS (United Artists, 1921), both starring Douglas Fairbanks as D'Artagnan and Marguerite De La Motte as Constance, is a worthy farewell to Fairbanks making his final silent screen adventure.\n\n\n\nThose familiar with the plot, which was remade several times on screen and television, including THE MAN IN THE IRON MASK (United Artists, 1939) with Louis Hayward, and/ or the most recent and satisfactory 1998 featuring Leonardo DiCaprio and Jeremy Irons, will find the story here not much different, but only shorter in its basic format, as is with its title. The story begins with King Louis XIII of France (Rolfe Sedan) receiving the news of the birth of his son, the future heir to the throne. The only problem is that the heir also has a twin. Since there cannot be two heirs, this news must be kept in utmost secrecy and anyone involved must be put away forever. Constance Beaucieux (Marguerite De La Motte), D'Artagnan's (Douglas Fairbanks), beloved, who was the midwife during the birth, is immediately put away in the Convent of Martes by orders of Count De Rochefort (Ullrich Haupt). Unaware of the secret, D'Artagnan tries to rescue Constance from being held prisoner against her will, but arrives too late. She has been stabbed by Milady De Winter (Dorothy Revier) after discovering the secret mark on her shoulder, the brand of a common criminal. Before Constance dies in D'Artagnan's arms, she utters her final words to him, \"the other one ...\" The death of Constance leaves D'Artagnan feeling empty and bitter. D'Artagnan, who has been reunited with his colleagues, The Three Musketeers, later saves them from being executed by orders of the Cardinal Richelieu (Nigel De Brulier). After D'Artagnan rescues Richelieu from De Rochefort's men, the Musketeers are pardoned, but find they must part company once more when D'Artagnan is appointed as guardian to the newborn infant and sent to Spain while the actual heir to the throne remains in France. Some twenty years later, the evil twin brother (William Bakewell), a spoiled young man, eventually learns his true identity and of his twin brother holding the throne in France from the villainous De Rochefort. The evil twin plots to take over the throne by having his brother abducted, and banishing him by having him locked in a dungeon with his face sealed in an iron mask for all eternity, and being given food from the guards from under the door, and with strict orders for him not to ever have any visitors. While taking control of the throne, the evil twin meets with his mother, Queen Anne (Belle Bennett), who immediately realizes what's happening. It is then up to the D'Artagnan and his musketeers, now older men, to reunite and save the day.\n\n\n\nFeatured in the supporting cast are Stanley Sanford as Porthos; Leon Bary as Athos; Gino Corrado as Aramis; Vera Lewis as Madame Peronne and Gordon Thorpe playing the boy prince and his evil twin.\n\n\n\nA satisfactory version that becomes a bit slow going at times due to a couple of flashbacks, but then picks up speed again with a memorable swashbuckling conclusion. THE IRON MASK was first introduced as part of the 12-week series on public television's THE SILENT YEARS (1975), hosted by Lillian Gish. Because this was Fairbanks' final silent adventure, released the final year of the silent era (1929), THE IRON MASK became the film chosen as the closing chapter to this series. Accompanied with an original piano score by William J. Perry, from the Paul Killiam collection, and running at the length of about 87 minutes, THE IRON MASK also consisted of color tinted scenes. Reportedly distributed theatrically with talking sequences, sound effects and an original musical score (which may still exist today), THE IRON MASK was later reissued in 1952 through Odyssey Pictures, eliminating the original title cards, replaced with narration by Douglas Fairbanks Jr., and accompanied by a new orchestral score. Available with the excellent Perry piano score on video cassette through Blackhawk Films in the 1980s, current video copies distributed in the 1990s present THE IRON MASK with its 1952 72 minute reissue format, the version which formerly aired on American Movie Classics from 1997-1998. Although the difference being the length and clearer picture quality, with the narration giving a better outlook and understanding to the storyline, silent film buffs would prefer to see THE IRON MASK restored to its original silent format. Thanks to KINO video, it's own copy has been restored with sound prologue with Doug Fairbanks himself as well as an orchestral score by Carl Davis. HO-LA! (***)"}, {"url": "https://www.moma.org/calendar/events/537", "page_content": "If you would like to reproduce an image of a work of art in MoMA’s collection, or an image of a MoMA publication or archival material (including installation views, checklists, and press releases), please contact Art Resource (publication in North America) or Scala Archives (publication in all other geographic locations).\n\nMoMA licenses archival audio and select out of copyright film clips from our film collection. At this time, MoMA produced video cannot be licensed by MoMA/Scala. All requests to license archival audio or out of copyright film clips should be addressed to Scala Archives at [email protected]. Motion picture film stills cannot be licensed by MoMA/Scala. For access to motion picture film stills for research purposes, please contact the Film Study Center at [email protected]. For more information about film loans and our Circulating Film and Video Library, please visit https://www.moma.org/research/circulating-film.\n\nIf you would like to reproduce text from a MoMA publication, please email [email protected]. If you would like to publish text from MoMA’s archival materials, please fill out this permission form and send to [email protected]."}, {"url": "https://archive.org/details/theironmask1929_202004", "page_content": "The Iron Mask is a 1929 American part-talkie adventure film directed by Allan Dwan. It is an adaptation of the last section of the novel The Vicomte de Bragelonne by Alexandre Dumas, père, which is itself based on the French legend of the Man in the Iron Mask. The story and this film is considered a sequel to The Three Musketeers. A 1921 film of The Three Musketeers was also made with Douglas Fairbanks.\n\n\n\n\n\nPublic Domain Movies: https://bit.ly/2qAfDoL\n\nAll 7/24 Pictures Content: https://bit.ly/2BHV3W0\n\n7/24 Pictures Original Content: https://bit.ly/2Pi6rjs\n\nBadass T-Shirts: https://bit.ly/2OZSaXE\n\nAddeddate 2020-04-13 18:31:23 Identifier theironmask1929_202004 Scanner Internet Archive HTML5 Uploader 1.6.4"}, {"url": "https://letterboxd.com/film/the-iron-mask/", "page_content": "My local cineclub streamed this yesterday, unfortunately, due to unknown conditions, they had to stop the live stream. Fortunately, the film is available on youtube (www.youtube.com/watch?v=LiQew3bpKjk) and I finished it today.\n\nIt's Douglas Fairbanks doing what he does best, being all swashbuckly and stuff and it is fun. It got me to think what an amazing spectacle must have been to go to the movies 100 years ago. Even today, I find silent cinema to be exciting and fun, and in a time when cinema wasn't as available as it is today, watching something like this must have been like going to see a concert or a theater play. What an amusing thought.\n\nAnd I have 500 followers! I'm also following every single one of these people (sorry if I missed someone), and that is a crazy thought for me. Hope everyone enjoys my reviews! I certainly enjoy reading yours!"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Film/TheIronMask", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Film/TheIronMask\n\nTous pour un et un pour tous!\n\n\"Come on! There is greater adventure beyond.\"\n\nThe Iron Mask is a 1929 silent film starring Douglas Fairbanks. It is one of many film adaptations of Alexandre Dumas's novel The Three Musketeers, drawing plot elements from that novel but taking most of the plot from Dumas's sequel The Vicomte de Bragelonne. The film is also a sequel to Fairbanks's 1921 film The Three Musketeers. It was directed by Allan Dwan.\n\nIn this one Fairbanks returns as D'Artagnan, and he and the Three Musketeers are having swashbuckling fun in 1638 France. Meanwhile, King Louis XIII is thrilled by the birth of his son and heir, the future King Louis XIV. The situation is immediately complicated when the birth of the boy is followed by the birth of a second boy, an identical twin brother. Cardinal Richelieu, fearing that the presence of two twin sons of the king raises the threat of dynastic instability and war, packs the second child, Philippe, off to the country to be raised in secret. D'Artagnan's lover, Constance, was the lady-in-waiting at the birth, and for this Richelieu has his dragon Count De Rochefort send Constance away to be imprisoned in a convent. D'Artagnan tries to rescue her but fails to arrive before tragedy strikes. Richelieu in turn breaks up the Musketeers, ordering Athos, Porthos, and Aramis to their home properties while assigning D'Artagnan to be a guardian of the boy Louis. De Rochefort has his own schemes, however, which involve a switcheroo of twin brothers.\n\nThe Iron Mask was one of the last major silent films released in Hollywood. It was Douglas Fairbanks' farewell to both the silent film medium and the action-adventure films that he had been making throughout The Roaring '20s. Fairbanks had no enthusiasm for talking films, and in any case he was 46 years old in 1929 and aging out of the action film genre. Fairbanks dabbled in talkies, making five films before he retired in 1934, but never made an action film again.\n\nThe story has been adapted for film several times, See also the the 1962 French film The Iron Mask and the 1998 American film The Man in the Iron Mask.\n\nTropes:"}, {"url": "https://www.wikiwand.com/en/The_Iron_Mask", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about The Iron Mask?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.tcm.com/tcmdb/title/498825/the-three-musketeers", "page_content": "In 1921, Douglas Fairbanks was on a roll. He had been in films for six years, just survived a potential scandal when he and Mary Pickford, the top female star in the world, divorced their respective spouses and married, and, with(1920), was in the process of inventing a new movie genre: the action film. A highly athletic man, Fairbanks understood how important personality was for an actor. His own larger-than-life, 100% All-American boyish charm had made him a star. That go-getter persona would translate well to foreign locales and other eras in films like(1922),(1924), and(1921).Having formed the United Artists distribution company with Pickford, D.W. Griffith, and his best friend, Charlie Chaplin, and producing the film himself for his own Douglas Fairbanks Pictures Corp., the star was free to choose whatever topic suited him, andwas a perfect fit. Not only was Alexandre Dumas' d'Artagnan Fairbanks' own personal hero, but the novel featured plenty of swordfights and had the potential for the type of graceful stunt work that had thrilled audiences in. Fairbanks and his good friend, the playwright Edward Knoblock, and scenario editor Lotta Woods based the film on Dumas' 1844 novel, but took some significant liberties with the plot in order to focus solely on one episode, namely d'Artagnan's frantic race to recover Queen Anne's (Mary MacLaren) diamond broach from the Duke of Buckingham (Thomas Holding). Other changes are apparent to readers of the novel: to maintain Fairbanks' good-guy image and steer clear of film censors, d'Artagnan's lady-love, Constance Bonacieu (Marguerite De La Motte), was no longer a married woman with whom he has an affair, but single, and the character of her husband was changed to her uncle. Another plot alteration was to remove Constance's poisoning by Milady de Winter (Barbara La Marr), which eliminated Milady's execution at the hands of the Musketeers in a revenge killing, as Dumas wrote. Fairbanks' biggest fans were young boys and it would be unthinkable that a Douglas Fairbanks film could have anything but a happy ending, because that was what they wanted.Although Fairbanks idolized d'Artagnan from his youth, re-reading the overtly violent and frankly sexual Dumas novel as an adult was a bit of a jolt. He would later remark that it was difficult to make d'Artagnan acceptable for a 1921 audience. \"[T]hat fellow was a brute and a bully. He went around picking quarrels with everybody and killing folks who hadn't done anything to get killed for. [...] It sounded all right in the book, but when you showed it in the picture you had to show men being run thru with swords and dying. [...] We steered away from the idea that he was killing people and that the people were dying by always giving his fights a comic finish.\"Directed by Fred Niblo, who had just helmed, and filmed by cinematographer Arthur Edeson (who would later shoot,1942)co-starred Léon Bary as Athos, George Siegmann as Porthos, and Eugene Pallette as Aramis. Adolphe Menjou played Louis XIII and Nigel De Brulier was Cardinal Richelieu. Shot at both the Douglas Fairbanks Studios for the small sets and the Robert Brunton Studios (later absorbed by Paramount Pictures) for the interiors, the film featured elaborate fight scenes choreographed by fencing expert H.J. Uyttenhove, who spent three months teaching the actors (including Menjou who had no fight scenes but wanted to learn) how to fence. Menjou later remembered that despite careful training by Uyttenhove, once Niblo said action, Fairbanks \"went completely unorthodox. He was all over the set, jumping over chairs and on top of tables, lashing away with his rapier as though it were a broadsword. The fencing instructor, who was an expert swordsman, tore his hair.\" Uyttenhove's protests went unheeded and Fairbanks continued to be Fairbanks. According to Menjou, whenwas released, \"fencing experts all over the world groaned at Doug's antics, but there were millions of movie-goers who thought he was the world's greatest swordsman.\"was a smash hit when it had its world premiere in New York City on August 28, 1921, with Fairbanks, Pickford, Charlie Chaplin, and boxer Jack Dempsey in attendance at the Lyric Theatre on Broadway. Tickets went for the large sum of $2, with scalpers getting as much as $5, to see Fairbanks forced to take bows before and after the film and during intermission. Along with the star, audiences were treated to a full orchestra to play the score and a costumed actor reading a prologue by Knoblock, later used in Fairbanks' sequel(1929).called the film \"[A] kind of combination of Dumas, Douglas, and delirium. One moment it boils with action and the next it snaps and sparkles with humor like d'Artagnan's own rapier.\" Made for a reported $748,768.76, the film would go on to make over $1.4 million in the United States, and cleaned up overseas, with the exception of France and predominately Francophone countries.The character of d'Artagnan stuck with Fairbanks; until his sudden death from a heart attack in 1939, he continued to wear d'Artagnan's moustache. Of, his son, Douglas Fairbanks, Jr., later mused, \"Whether it was d'Artagnan with Douglas Fairbanks or Douglas Fairbanks pretending to be d'Artagnan I don't know. It was an interchangeable identification.\"SOURCES:http://www.afi.com/members/catalog/DetailView.aspx?s=&Movie=12669Fairbanks, Douglas, and Leigh, KeriTibbetts, John C. and Welsh, James M.Vance, Jeffrey, Maietta, Tony and Cushman, RobertBy Lorraine LoBianco\n\nThe Three Musketeers (1921)\n\nIn 1921, Douglas Fairbanks was on a roll. He had been in films for six years, just survived a potential scandal when he and Mary Pickford, the top female star in the world, divorced their respective spouses and married, and, with The Mark of Zorro (1920), was in the process of inventing a new movie genre: the action film. A highly athletic man, Fairbanks understood how important personality was for an actor. His own larger-than-life, 100% All-American boyish charm had made him a star. That go-getter persona would translate well to foreign locales and other eras in films like Robin Hood (1922), The Thief of Bagdad (1924), and The Three Musketeers (1921). Having formed the United Artists distribution company with Pickford, D.W. Griffith, and his best friend, Charlie Chaplin, and producing the film himself for his own Douglas Fairbanks Pictures Corp., the star was free to choose whatever topic suited him, and The Three Musketeers was a perfect fit. Not only was Alexandre Dumas' d'Artagnan Fairbanks' own personal hero, but the novel featured plenty of swordfights and had the potential for the type of graceful stunt work that had thrilled audiences in The Mark of Zorro. Fairbanks and his good friend, the playwright Edward Knoblock, and scenario editor Lotta Woods based the film on Dumas' 1844 novel, but took some significant liberties with the plot in order to focus solely on one episode, namely d'Artagnan's frantic race to recover Queen Anne's (Mary MacLaren) diamond broach from the Duke of Buckingham (Thomas Holding). Other changes are apparent to readers of the novel: to maintain Fairbanks' good-guy image and steer clear of film censors, d'Artagnan's lady-love, Constance Bonacieu (Marguerite De La Motte), was no longer a married woman with whom he has an affair, but single, and the character of her husband was changed to her uncle. Another plot alteration was to remove Constance's poisoning by Milady de Winter (Barbara La Marr), which eliminated Milady's execution at the hands of the Musketeers in a revenge killing, as Dumas wrote. Fairbanks' biggest fans were young boys and it would be unthinkable that a Douglas Fairbanks film could have anything but a happy ending, because that was what they wanted. Although Fairbanks idolized d'Artagnan from his youth, re-reading the overtly violent and frankly sexual Dumas novel as an adult was a bit of a jolt. He would later remark that it was difficult to make d'Artagnan acceptable for a 1921 audience. \"[T]hat fellow was a brute and a bully. He went around picking quarrels with everybody and killing folks who hadn't done anything to get killed for. [...] It sounded all right in the book, but when you showed it in the picture you had to show men being run thru with swords and dying. [...] We steered away from the idea that he was killing people and that the people were dying by always giving his fights a comic finish.\" Directed by Fred Niblo, who had just helmed The Mark of Zorro, and filmed by cinematographer Arthur Edeson (who would later shoot Casablanca ,1942) The Three Musketeers co-starred Léon Bary as Athos, George Siegmann as Porthos, and Eugene Pallette as Aramis. Adolphe Menjou played Louis XIII and Nigel De Brulier was Cardinal Richelieu. Shot at both the Douglas Fairbanks Studios for the small sets and the Robert Brunton Studios (later absorbed by Paramount Pictures) for the interiors, the film featured elaborate fight scenes choreographed by fencing expert H.J. Uyttenhove, who spent three months teaching the actors (including Menjou who had no fight scenes but wanted to learn) how to fence. Menjou later remembered that despite careful training by Uyttenhove, once Niblo said action, Fairbanks \"went completely unorthodox. He was all over the set, jumping over chairs and on top of tables, lashing away with his rapier as though it were a broadsword. The fencing instructor, who was an expert swordsman, tore his hair.\" Uyttenhove's protests went unheeded and Fairbanks continued to be Fairbanks. According to Menjou, when The Three Musketeers was released, \"fencing experts all over the world groaned at Doug's antics, but there were millions of movie-goers who thought he was the world's greatest swordsman.\" The Three Musketeers was a smash hit when it had its world premiere in New York City on August 28, 1921, with Fairbanks, Pickford, Charlie Chaplin, and boxer Jack Dempsey in attendance at the Lyric Theatre on Broadway. Tickets went for the large sum of $2, with scalpers getting as much as $5, to see Fairbanks forced to take bows before and after the film and during intermission. Along with the star, audiences were treated to a full orchestra to play the score and a costumed actor reading a prologue by Knoblock, later used in Fairbanks' sequel The Iron Mask (1929). The New York Herald called the film \"[A] kind of combination of Dumas, Douglas, and delirium. One moment it boils with action and the next it snaps and sparkles with humor like d'Artagnan's own rapier.\" Made for a reported $748,768.76, the film would go on to make over $1.4 million in the United States, and cleaned up overseas, with the exception of France and predominately Francophone countries. The character of d'Artagnan stuck with Fairbanks; until his sudden death from a heart attack in 1939, he continued to wear d'Artagnan's moustache. Of The Three Musketeers, his son, Douglas Fairbanks, Jr., later mused, \"Whether it was d'Artagnan with Douglas Fairbanks or Douglas Fairbanks pretending to be d'Artagnan I don't know. It was an interchangeable identification.\" SOURCES: http://www.afi.com/members/catalog/DetailView.aspx?s=&Movie=12669 Fairbanks, Douglas, and Leigh, Keri Douglas Fairbanks: In His Own Words Tibbetts, John C. and Welsh, James M. Douglas Fairbanks and the American Century Vance, Jeffrey, Maietta, Tony and Cushman, Robert Douglas Fairbanks By Lorraine LoBianco"}, {"url": "https://www.rottentomatoes.com/celebrity/robert_emmett_keane", "page_content": "Log in or sign up for Rotten Tomatoes\n\nContinue with Google\n\nContinue with Email\n\nEmail\n\nNew Where is the password field?\n\nContinue\n\nTrouble logging in?\n\nBy continuing, you agree to the Privacy Policy and the Terms and Policies, and to receive email from Rotten Tomatoes."}, {"url": "https://letterboxd.com/film/the-man-in-the-iron-mask/", "page_content": "A glossy, successful version of Dumas' timeless tale, very different in focus and feel to Doug Fairbanks' take on the story, The Iron Mask, but with the same Cardinal Richelieu (Nigel de Brulier appearing briefly his fourth time out) and that same classic closing shot.\n\nAway from the realm of the star vehicle, the emphasis here is not on the ageing D'Artagnan - putting his life on the line for perhaps the last time - but on the title character, with Louis Hayward excelling in a dual role as the effete, pampered and murderous king, and his brave, empathetic, hounded brother - a finer man than he will ever be.\n\nHayward was one of the most talented and underrated leading…"}, {"url": "https://www.yidio.com/movie/the-iron-mask/35400", "page_content": "Description\n\nThe Iron Mask is a 1929 movie starring Douglas Fairbanks, Belle Bennett, and Marguerite De La Motte. The film is based on the famous novel by Alexandre Dumas, The Man in the Iron Mask, and it is a classic tale of action, adventure, and romance. The story takes place in 17th-century France, where King Louis XIII has died, and his scheming brother Philippe has taken the throne. The real heir, young Prince Louis, is imprisoned in a castle and forced to wear an iron mask to hide his identity.\n\nEnter D'Artagnan (Douglas Fairbanks), the legendary musketeer who comes to the rescue of the young prince. Along with his three companions, Porthos, Athos, and Aramis, D'Artagnan embarks on a dangerous mission to free the prince and restore him to the throne.\n\nBut the journey is not an easy one. They face treacherous enemies, including the evil Count De Rochefort (Ulrich Haupt) and the seductive Lady De Winter (Marguerite De La Motte). And throughout it all, D'Artagnan must also grapple with his love for the beautiful Constance Bonacieux (Belle Bennett).\n\nThe Iron Mask is a swashbuckling adventure that will keep audiences on the edge of their seats. With thrilling sword fights, daring rescues, and a cast of memorable characters, this film is a must-see for fans of action and romance.\n\nOne of the highlights of The Iron Mask is its stunning production design. The film features elaborate sets and costumes that transport viewers back to 17th-century France. The attention to detail is impressive, from the opulent royal palace to the dark and foreboding castle where the prince is imprisoned.\n\nThe cinematography is also noteworthy, with sweeping shots of the French countryside and close-ups that capture the emotion in the actors' performances. And the score, composed by Henry Hadley, adds to the film's sense of drama and excitement.\n\nDouglas Fairbanks is outstanding in the role of D'Artagnan. He exudes charisma and charm, and he handles the film's numerous action sequences with ease. Fairbanks was a master of the swashbuckler genre, and his performance in The Iron Mask is one of his best.\n\nBelle Bennett is equally impressive as Constance Bonacieux. She brings a sense of strength and intelligence to the character, making her much more than just a damsel in distress. And Marguerite De La Motte is excellent as Lady De Winter, the seductive villainess who will stop at nothing to achieve her goals.\n\nThe other actors in the film, including Nigel De Brulier as Father Joseph and William Bakewell as Prince Louis, also deliver strong performances.\n\nThe Iron Mask is a classic film that has stood the test of time. It is a thrilling adventure that will appeal to audiences of all ages. The movie is a testament to the enduring popularity of the swashbuckler genre, and it remains one of the best examples of its kind."}]}