{"Robert Emmett Keane made his film debut in 1915.": [{"url": "https://peoplepill.com/people/robert-emmett-keane/", "page_content": "Robert Emmett Keane (March 4, 1883 – July 2, 1981) was an American actor of both the stage and screen. He was also known professionally by the names: Emmett Keane, Robert Keane, R. Emmett Keane, and Robert E. Keane. He began on stage in the 1910s, with his first Broadway appearance being in the 1914 production of The Passing Show of 1914. He would continue on the stage through the mid-1930s, appearing in both London and New York theater productions. His film career began in 1930, and over the twenty-five years of that career he would appear in between 170-200 films. At the very tail end of his acting life he would make several appearances on the small screen. Married twice, the first time would be a short-lived union with Muriel Inetta Window, an opera singer, vaudeville actress and 1913 Peacock Girl with the Ziegfeld Follies. They were married in approximately 1916 and divorced in 1920. After his divorce, he would marry the actress Claire Whitney in 1921, and they would remain married until her death in 1969. He retired in 1958, and would die on July 2, 1981 and be buried in Forest Lawn Memorial Park in Los Angeles, next to his wife, Claire (although her grave is unmarked).\n\nFilmography\n\n(Per AFI database)"}, {"url": "https://deadorkicking.com/robert-emmett-keane-dead-or-alive/", "page_content": "Robert Emmett Keane Death\n\nRobert passed away on July 2, 1981 at the age of 98 in Hollywood, California.\n\nRobert Emmett Keane death quick facts: When did Robert Emmett Keane die? July 2, 1981\n\nHow old was Robert Emmett Keane when died? 98\n\nWhere did Robert Emmett Keane die? What was the location of death? Hollywood, California\n\nRobert Emmett Keane Birthday and Date of Death\n\nRobert Emmett Keane was born on March 4, 1883 and died on July 2, 1981. Robert was 98 years old at the time of death.\n\nBirthday: March 4, 1883\n\nDate of Death: July 2, 1981\n\nAge at Death: 98\n\nRobert Emmett Keane - Biography\n\nThe embodiment of businesslike dignity, actor Robert Emmett Keane was active in films from his 1929 debut in the talkie short Gossip through the 1956 second feature When Gangland Strikes. Because of his distinguished, above-reproach demeanor, Keane was often effectively cast as confidence men, shady attorneys and mystery murderers: after all, if he can convince the gullible folks people on-screen that he`s honest, it`s likely the audience will fall for the same line. Keane is warmly remembered by Laurel and Hardy fans for his roles in three of the team`s 20th Century-Fox films of the `40s, playing con artists in two of them (A-Haunting We Will Go and Jitterbugs). In the early `50s, Keane played Captain Brackett in the national touring company of Rodgers and Hammerstein`s musical triumph South Pacific. In private life, Robert Emmett Keane was the husband of Claire Whitney"}, {"url": "https://www.findagrave.com/memorial/5902693/robert-emmett-keane", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.celebnetworthpost.com/robert-emmett-keane", "page_content": "Robert Emmett Keane\n\nRobert Emmett Keane was born on March 4, 1883 in United States (98 years old). Robert Emmett Keane is an Actor, zodiac sign: Pisces. Nationality: United States. Approx. Net Worth: Undisclosed.\n\nNet Worth 2020 Undisclosed Find out more about Robert Emmett Keane net worth here.\n\nDoes Robert Emmett Keane Dead or Alive?\n\nAs per our current Database, Robert Emmett Keane died on July 2, 1981.\n\nPhysique\n\nHeight Weight Hair Colour Eye Colour Blood Type Tattoo(s) N/A N/A N/A N/A N/A N/A\n\nBiography\n\nBiography Timeline\n\n1914 Keane began on stage in the 1910s, his first Broadway appearance being in the 1914 production of The Passing Show of 1914. He would continue on the stage through the mid-1930s, appearing in both London and New York theater productions. His film career began in 1930, and over the twenty-five years of that career he would appear in between 170–200 films. At the very tail end of his acting life he would make several appearances on the small screen. 1916 Keane was married twice. His first marriage was to Muriel Inetta Window, an opera singer, vaudeville actress and 1913 Peacock Girl with the Ziegfeld Follies. They were married in approximately 1916 and divorced in 1920. After his divorce, he would marry the actress Claire Whitney in 1921, and they would remain married until her death in 1969. He retired in 1958, and died on July 2, 1981. He was buried in Forest Lawn Memorial Park in Los Angeles, next to his wife, Claire (although her grave is unmarked).\n\n🎂 Upcoming Birthday\n\nCurrently, Robert Emmett Keane is 140 years, 3 months and 7 days old. Robert Emmett Keane will celebrate 141st birthday on a Monday 4th of March 2024.\n\nFind out about Robert Emmett Keane birthday activities in timeline view here.\n\nRobert Emmett Keane trends\n\nFAQs"}, {"url": "https://everything.explained.today/%5C/Robert_Emmett_Keane/", "page_content": "Robert Emmett Keane Explained\n\nRobert Emmett Keane Birth Date: 4 March 1883 Birth Place: New York City, U.S. Death Place: Hollywood, California, U.S. Occupation: Actor Spouse: Muriel Inetta Window Turnley\n\n(m. 1916 - div. 1920)\n\nClaire Whitney\n\n(m. 1921–1969, her death) Yearsactive: 1914–1958\n\nRobert Emmett Keane (March 4, 1883 – July 2, 1981) was an American actor of both the stage and screen.\n\nBiography\n\nKeane began on stage in the 1910s, his first Broadway appearance being in the production of The Passing Show of 1914. He continued on the stage through the mid-1930s, appearing in both London and New York theater productions.[1] His film career began in 1930, and over the twenty-five years of that career he appeared in between 170 and 200 films.[2] At the very tail end of his acting life he made several appearances on the small screen.\n\nKeane was married twice. His first marriage was to Muriel Inetta Window, an opera singer, vaudeville actress and 1913 Peacock Girl with the Ziegfeld Follies. They were married in approximately 1916 and divorced in 1920. After his divorce, he married the actress Claire Whitney in 1921, and they remained married until her death in 1969.[3] He retired in 1958, and died on July 2, 1981. He was buried in Forest Lawn Memorial Park in Los Angeles, next to his wife, Claire (although her grave is unmarked).\n\nFilmography\n\n(Per AFI database)\n\nNotes and References"}, {"url": "https://www.findagrave.com/memorial/5902693/robert-emmett-keane", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.tcm.com/tcmdb/title/96440/you-came-along", "page_content": "\n\nShare\n\nKIM HUNTER, 1922-2002\n\n\n\nKim Hunter, the versatile, distinguished actress who won the Supporting Actress Academy Award for her portrayal as the long-suffering Stella in A Streetcar Named Desire (1951) and appeared as Dr. Zira in three Planet of the Apes movies, died in her Greenwich Village apartment from an apparent heart attack on September 11, 2002. She was 79.\n\n\n\nBorn Janet Cole in Detroit on November 12, 1922, where her mother was a concert pianist, she made her professional debut at 17 with a small theatre company in Miami. She gained notice immediately with her strong voice and alluring presence, and eventually studied at the Actors' Studio in New York.\n\n\n\nShe made a striking film debut in an eerie, low-budget RKO horror film, The Seventh Victim (1943), produced by Val Lewton. She played a similar ingenue role in another stylish cult flick, When Strangers Meet (1944) - a film directed by William Castle and notable for featuring Robert Mitchum in one of his first starring roles. Hunter's big break came two years later when Michael Powell and Emeric Pressburger cast her in their splendid romantic fantasy, Stairway to Heaven (1946).\n\n\n\nDespite her growing popularity as a screen actress, Hunter returned to the stage to make her Broadway debut as Stella in Tennessee Williams'A Streetcar Named Desire (1951). When Elia Kazan adapted the production for the silver screen, she continued her role as Stella opposite Marlon Brando, and won an Oscar as best supporting actress. A few more film roles followed, but sadly her screen career entered a lull in the late 1950s, after Hunter, a liberal Democrat, was listed as a communist sympathizer by Red Channels, a red-hunting booklet that influenced hiring by studios and the Television networks. Kim was blacklisted from both mediums despite never having been labeled a Communist, yet as a strong believer in civil rights she signed a lot of petitions and was a sponsor of a 1949 World Peace Conference in New York. She was widely praised in the industry for her testimony to the New York Supreme Court in 1962 against the publishers of Red Channels, and helped pave the way for clearance of many performers unjustly accused of Communist associations.\n\n\n\nHunter spent the next few years on the stage and didn't make a strong impression again in films until she was cast as Dr. Zira in the Planet of the Apes (1968), as a simian psychiatrist in the classic science fiction film. The success of that film encouraged her to continue playing the same character in two back-to-back sequels - Beneath the Planet of the Apes (1970) and Escape from the Planet of the Apes (1971). Hunter spent the remainder of her career on the stage and television, but she a terrific cameo role in Clint Eastwood's Midnight In The Garden Of Good And Evil (1997), one of her last films. She is survived by her daughter Kathryn, from her first marriage to William Baldwin, and her son Sean, from her marriage to actor and producer Robert Emmett.\n\n\n\nBy Michael T. Toole\n\n\n\nTCM REMEMBERS J. LEE THOMPSON, 1914 - 2002\n\n\n\nOscar-nominated director J. Lee Thompson died August 30th at the age of 88. Though he worked in several genres, Thompson was best-known for his action films. Thompson was born in Bristol England on August 1, 1914. After graduating from college he became a playwright and it was the appearance of one of his plays on London's famous West End that got him noticed by the British film studio, Elstree. His first filmed script was The Pride of Folly in 1937 and others appeared sporadically until his career was side-tracked during the war when Thompson served in the RAF as a B-29 tail gunner. (He also reportedly worked as a dialogue coach on Hitchcock's Jamaica Inn, 1939.) Thompson's directorial debut came in 1950 when he adapted his own play Double Error to the screen as Murder Without Crime. Throughout the decade he directed a variety of dramas and comedies until hitting it big in 1958 with Ice Cold in Alex (released in the US minus 50 minutes under the title Desert Attack). It was nominated for three BAFTAs and was enough of a commercial success that Thompson landed the film that made his career: The Guns of Navarone (1961). This enormous international hit snagged Thompson an Oscar nomination for Best Director. He immediately followed that with the original Cape Fear (1962) and his reputation was set. Though Thompson remained active almost three more decades he didn't reach that level again. He worked on Westerns (Mackenna's Gold, 1969), horror films (Eye of the Devil, 1967), literary adaptations (Huckleberry Finn, 1974) and others. During this time, Thompson directed two Planet of the Apes sequels but was kept most busy working with Charles Bronson, for whom he directed nine films. Thompson's last film was in 1989.\n\n\n\nKATRIN CARTLIDGE, 1961 - 2002\n\n\n\nThe news of actress Katrin Cartlidge's death at the age of 41 has come as a shock. It's not just the age but the thought that even though Cartlidge was already a major actress--despite a slender filmography--she held out the promise of even greater work, a promise that so few artists of any type can make. \"Fearless\" is perhaps the word most often used to describe Cartlidge but emotions are never enough for an actor; much more is required. Director Mike Leigh said she had \"the objective eye of an artist\" while remarking on her \"her deep-seated suspicion of all forms of woolly thinking and received ideas.\"\n\n\n\nCartlidge was born in London on May 15, 1961. Her first acting work was on the stage, in tiny independent theatres before she was selected by Peter Gill for the National Theatre. Cartlidge also worked as a dresser at the Royal Court where she later made one of her final stage appearances. She began appearing in the popular British TV series Brookside before making her first film in 1985, Sacred Hearts. A small role in the Robbie Coltrane-Rik Mayall vehicle Eat the Rich (1987) followed before Cartlidge had her first leading role in Mike Leigh's scathing Naked (1993).\n\n\n\nCartlidge never took a safe approach in her films. She told The Guardian that \"I try to work with film-makers who I feel will produce something original, revealing and provoking. If something provokes a reaction, it's well worth doing.\" You can see this in her choice of projects. Before the Rain (1994) dramatized violence in Macedonia in the wake of the Yugoslavian break-up and made Cartlidge something of a star in the area. She appeared in Lars Von Trier's controversial look at redemption, Breaking the Waves (1996), Leigh's sharply detailed story of aging friends Career Girls (1997), as one of Jack the Ripper's victims in From Hell (2001), as a call girl trying to leave the business in Clair Dolan (1998) and in the Oscar-winning film about Bosnia-Herzegovina, No Man's Land (2001). Her last work included a BBC adaptation of Crime and Punishment (2002), playing Salvador Dali's wife Gala in the BBC comedy-drama Surrealissimo (2002) and an appearance in Rosanna Arquette's directorial debut, Searching for Debra Winger (also 2002), a documentary about women in the film industry.\n\n\n\nCartlidge died September 7th from septicaemia brought on by pneumonia.\n\n\n\nBy Lang Thompson"}, {"url": "https://www.celeb-networth.com/robert-emmett-keane", "page_content": "Robert Emmett Keane\n\nRobert Emmett Keane was born on March 4, 1883 in United States (98 years old). Robert Emmett Keane is an Actor, zodiac sign: Pisces. Find out Robert Emmett Keanenet worth 2020, salary 2020 detail bellow.\n\nDoes Robert Emmett Keane Dead or Alive?\n\nAs per our current Database, Robert Emmett Keane died on July 2, 1981.\n\nNet Worth 2020 Undisclosed Salary 2020 Not known\n\nBiography Timeline\n\n1914 Keane began on stage in the 1910s, his first Broadway appearance being in the 1914 production of The Passing Show of 1914. He would continue on the stage through the mid-1930s, appearing in both London and New York theater productions. His film career began in 1930, and over the twenty-five years of that career he would appear in between 170–200 films. At the very tail end of his acting life he would make several appearances on the small screen. 1916 Keane was married twice. His first marriage was to Muriel Inetta Window, an opera singer, vaudeville actress and 1913 Peacock Girl with the Ziegfeld Follies. They were married in approximately 1916 and divorced in 1920. After his divorce, he would marry the actress Claire Whitney in 1921, and they would remain married until her death in 1969. He retired in 1958, and died on July 2, 1981. He was buried in Forest Lawn Memorial Park in Los Angeles, next to his wife, Claire (although her grave is unmarked).\n\n🎂 Upcoming Birthday\n\nCurrently, Robert Emmett Keane is 140 years, 3 months and 7 days old. Robert Emmett Keane will celebrate 141st birthday on a Monday 4th of March 2024. Below we countdown to Robert Emmett Keane upcoming birthday.\n\nDays Hours Minutes Seconds\n\nRobert Emmett Keane trends\n\nFAQs\n\nYou might intereintereststed in"}, {"url": "https://popularinside.com/robert-emmett-keane/", "page_content": "Do you want to know how much money Robert Emmett Keane has, how tall or short he is, how much his weight is, how much is his net worth, or how old he is? He is the most popular Actor. Maybe you’re curious about what kind of career he has or what his personal life is like.\n\nIf so, then this blog post is for you! We’ll be discussing the net worth’s, heights, weights, ages, careers, educational background, relationships, and affairs of Robert Emmett Keane. Keep reading to learn more!\n\nRobert Emmett Keane Short Bio\n\nMany people are fascinated by celebrities and their personal lives. Whether it’s your favorite actor or a famous musician, there is always something new to learn about them!\n\nWhat do you think of when you hear the word \"celebrity\"? Most people will automatically say that they think of someone who has achieved fame somehow, shape or form. But what does this mean? Is it just actors and musicians that are classified as celebrities?\n\nThe answer is no! There are all sorts of people who have acquired celebrity status for various reasons: athletes, politicians, entrepreneurs, etc. This article will be exploring what makes these individuals stars in the eyes of society and how they got to where they are today.\n\nYou may know Robert Emmett Keane as a celebrity, but have you ever wondered what his full name is, or where he was born? In this section, we’ll be taking a look at the full name, nickname, age, birthplace, and citizenship of Robert Emmett Keane. We hope you enjoy it!\n\nRobert Emmett Keane’s full name is Robert Emmett Keane and his nickname is Robert Emmett Keane. He was born in New York City, U.S. on 1883-03-04. Robert Emmett Keane is American by birth.\n\nFull Real Name Robert Emmett Keane Age (2022) Update Soon Nationality American Born Place New York City, U.S. Profession Actor\n\nSometimes it’s hard to keep up with the latest celebrity news, but don’t worry we have you covered. We bring you all the headlines and gossip in one place!\n\nRobert Emmett Keane Age and Birth Information\n\nDo you know, how old is Robert Emmett Keane? Here we will be discussing Robert Emmett Keane’s age and his date of birth. In order to figure out the answer to the question posed in the title, you will need to look at Robert Emmett Keane’s date of birth as well as his age. There are many different factors that can affect how quickly or slowly someone ages such as genetics, skin type, and health.\n\nFor example, a person with olive skin is more likely to show signs of aging faster than someone with fair skin because there is less pigment protecting them from sun damage.\n\nThrough my research on Robert Emmett Keane who has aged gracefully over time, it seems like he shares some similar habits which include wearing sunscreen daily even if he is not outside much and taking good care of his hair regularly.\n\nAre you interested to know about Robert Emmett Keane’s age and others birth information? In this section, we will reveal is Birthplace, Birthday, Age, Current Location, Hometown, etc.\n\nRobert Emmett Keane was born on 1883-03-04. His birthplace is New York City, U.S.. Robert Emmett Keane is Update Soon years old in 2022. Below the table, you can find all the information about his birthday.\n\nDate of Birth 1883-03-04 Age (2022) Update Soon Zodiac Update Soon\n\nRobert Emmett Keane Height and Physical Info\n\nSome people are indeed interested in the weight and height of celebrities, but there is a more important question to ask. How does this information affect our self-esteem? Height and weight seem to be a measure of attractiveness or success in life. It’s no secret that these numbers play into the way we feel about ourselves, which can lead to unhealthy habits. We need to stop obsessing over celebrity heights and weights because it will only make us feel worse about ourselves.\n\nI know you are curious about the height and weight of Robert Emmett Keane. You want to see if he is taller or shorter than you, heavier or lighter than you. Well, this blog is for all those that need their celebrity fix! We will show you how Robert Emmett Keane looks in a variety of different ways including how tall he is, how much he weighed, and pictures of him without makeup on as well as with makeup on.\n\nWhat do you think, Robert Emmett Keane’s height can be? This is a popular question. In the following section, we will know about the height and weight of Robert Emmett Keane.\n\nRobert Emmett Keane’s height is Update Soon and his weight is Update Soon. Weight can be changed.\n\nWeight Update Soon Height Update Soon\n\nRobert Emmett Keane Family Member and Details\n\nSome people might be curious about Robert Emmett Keane’s family. Here we will cover everything about his family. You will find here his father and mother’s names and their profession. We also cover here his sister, brother, and relatives information.\n\n*Parents – Update Soon\n\n*Relatives- Update Soon\n\nRobert Emmett Keane Wife and Affair\n\nDo you ever wonder how celebrities get away with their relationships? What are some of the things they do and don’t do to keep them a secret? It’s not easy, especially when your significant other is in another country. There are many things that can go wrong if someone finds out about it.\n\nAre you curious about Robert Emmett Keane’s relationship with his significant other? Do you want to know with whom he is dating, when did he break up, or what is going on in his love life? You have come to the right place. We will provide all the latest gossip about Robert Emmett Keane’s relationships and affairs.\n\nThis section is focused on Robert Emmett Keane’s current affair. Who is he dating, how long have they been together, and any juicy details that we can find out about him will be found here! If this sounds like a topic that interests you then read the full article.\n\nRobert Emmett Keane had a relationship with (m. 1916–div. 1920).\n\nMarital Status Married Dating With? (m. 1916–div. 1920)\n\nRobert Emmett Keane Net Worth and Income Source\n\nSome people measure success by the number of awards they have won, but for many others it is about their net worth. Money can’t buy happiness but it sure does help when you’re living life in luxury. Celebrities are no exception to this rule and some of them have had a pretty successful careers.\n\nDo you wonder how much money Robert Emmett Keane has? Well, here we will provide information on where Robert Emmett Keane getting his money from and just how wealthy he is. They may not look like they’re that rich, but these stars are definitely living the high life with some pretty impressive wealth!\n\nWhat is the net worth of Robert Emmett Keane? In 2022, the net worth of Robert Emmett Keane’s has increased significantly. We will discuss Robert Emmett Keane’s source of income, net worth, salary here. Actor is his main source of income.\n\nWondering about the net worth of Robert Emmett Keane? How much money does he make, you might think? But there are many controversies in this area that have been added to what we know for sure; such as salary and assets changing from time to time which can lead people into thinking one thing then soon after find out something else entirely different – even though their initial assumptions may only be accurate parts way through.\n\nRobert Emmett Keane’s net worth is $1M – $5M.\n\nSource of Income Actor Net Worth (2022) $1M – $5M\n\nSome FAQ About Robert Emmett Keane\n\n1. What is the age of Robert Emmett Keane?\n\nAnswer-Robert Emmett Keane is Update Soon years old in 2022.\n\n2. What is the Net Worth of Robert Emmett Keane?\n\nAnswer- Robert Emmett Keane’s net worth is $1M – $5M.\n\n3. Does he get married?\n\nAnswer– He is Married.\n\n4. What is the name of his Wife?\n\nAnswer– His wife’s name is (m. 1916–div. 1920).\n\n5. What is the height of Robert Emmett Keane?\n\nAnswer- Robert Emmett Keane’s height is Update Soon.\n\nConclusion\n\nThe end of this blog post has been a lot about Robert Emmett Keane and his long career, which is great for those who want to learn more about this Actor. We Covered his net worth, age, height, career, family, relationship and affair, wiki-bio, and more. How many things did you already know? If there are any facts, we got wrong or anything else you want to know, let us know in the comments section below!"}, {"url": "https://www.amazon.com/prime-video/actor/Robert-Emmett-Keane/amzn1.dv.gti.20db8c54-69c8-4608-9edc-00d8d68b9ee7", "page_content": "Robert Emmett Keane\n\nRobert Emmett Keane was one of Hollywood's more overworked character players to be found near the bottom of the credit list. An ex-vaudevillian, he appeared on Broadway from as early as 1914 and at the London Hippodrome two years later, invariably specialising in musicals and comedies. Keane did not enter films until 1929, but thereafter amassed an impressive record of almost 200 screen appearances, often for the smaller studios like RKO, Columbia and Monogram.\n\nA natural farceur with immaculate attire and trademark toothbrush moustache, he turned up in an assortment of roles ranging from timid clerks to dignified hotel managers, jewellers, headwaiters, judges and pathologists. In addition, he had a nice sideline in crooked defense attorneys, drunks and conmen, his expressive features equally adept at conveying befuddlement, querulousness or exasperation. The congenial Keane remained gainfully employed until his retirement in 1958. He was married to the New York-born actress Claire Whitney."}]}