{"Robert Emmett Keane was married to Mary Pickford.": [{"url": "https://www.britannica.com/biography/Mary-Pickford", "page_content": "Mary Pickford, original name Gladys Louise Smith, also known as Gladys Marie Smith, (born April 9, 1892, Toronto, Ontario, Canada—died May 29, 1979, Santa Monica, California, U.S.), Canadian-born American motion-picture actress who was “America’s sweetheart” of the silent screen and one of the first film stars. At the height of her career, she was one of the richest and most famous women in the United States.\n\n(Read Lillian Gish’s 1929 Britannica essay on silent film.)\n\nBritannica Quiz Pop Culture Quiz\n\nGladys Louise Smith grew up in precarious financial circumstances. Shortly after the death of her father, she began taking child’s roles in productions, and soon the rest of the family also began acting. She made her first stage appearance in a Toronto stock company at the age of seven. At eight she went on tour, and within 10 years she was playing on Broadway. She made her New York debut in David Belasco’s The Warrens of Virginia in December 1907. Belasco suggested that she change her name to Mary Pickford. At age 14 she had already learned more about stagecraft than many older actors, and her winsome face, framed by a mass of golden curls, made her appeal virtually irresistible.\n\nPickford began working as a motion-picture extra at D.W. Griffith’s Biograph Company, starring in his 1909 film The Violin Maker of Cremona. Though actors’ names were not listed in film credits, Pickford’s face quickly became well known. After appearing on Broadway in Belasco’s production A Good Little Devil in 1913, she turned permanently to the screen, rising to first rank with Adolph Zukor’s Famous Players Company. Her meteoric rise from an anonymous player to a star with her own production company (Mary Pickford Studios, created in 1916 by Famous Players) was attributable not only to the phenomenal popularity of her films but also to her dedication to her craft and her meticulous care in creating quality entertainments. The ringleted ingenue with an expression of sweet sincerity and invincible innocence that she played in such silent films as Hearts Adrift (1914), The Poor Little Rich Girl (1917), Rebecca of Sunnybrook Farm (1917), Stella Maris (1918), and Johanna Enlists (1918) enthralled audiences everywhere. She was known at first as the “Biograph Girl with the Curls” and then as “Our Mary” when that much of her name was revealed. With the release of Tess of the Storm Country in 1914, she was firmly established as “America’s Sweetheart.” In 1917 First National Films paid her $350,000 for each of three films, including the very successful Daddy-Long-Legs (1919).\n\nIn 1919 Pickford took the lead in organizing the United Artists Corporation with Griffith, Charlie Chaplin, and Douglas Fairbanks. In 1920, after the dissolution of her first marriage (1911–19) to actor Owen Moore, she married Fairbanks (divorced 1936). Pickford’s popularity continued unabated in Pollyanna (1920), Little Lord Fauntleroy (1921), Little Annie Rooney (1925), My Best Girl (1927), Coquette (1929; her first talking picture), The Taming of the Shrew (1929; her only film with Fairbanks), and Kiki (1931). Although she won an Academy Award for best actress for her performance in Coquette, Pickford’s popularity began to wane with the advent of sound.\n\nAfter making Secrets (1933), her 194th film, Pickford retired from the screen. Thereafter she devoted herself to United Artists, of which she was first vice president from 1935 and for which she produced several films. She also wrote Why Not Try God? (1934), The Demi-Widow (1935), and My Rendezvous with Life (1935), and in the 1930s she appeared on radio. In 1937 she married actor Charles (“Buddy”) Rogers. Her later years were spent on business and civic and charitable activities, and she eventually became a recluse at Pickfair, the lavish estate she had built with Fairbanks. Sunshine and Shadow, her autobiography, was published in 1955. She received an honorary Oscar in 1976 for her contributions to film; she accepted the award from Pickfair."}, {"url": "https://www.biography.com/actors/mary-pickford", "page_content": "(1892-1979)\n\nWho Was Mary Pickford?\n\nIn 1909, Mary Pickford appeared in 40 movies for D.W. Griffith's American Biography company. She also worked as a producer and co-founded United Artists, with Charlie Chaplin, and Douglas Fairbanks, Sr., who would become her second husband. Pickford retired from the screen in 1933 but continued to produce. She died in 1979.\n\nEarly Life\n\nActress, producer and screenwriter Gladys Mary Smith was born on April 8, 1892, in Toronto, Ontario, Canada. Known as \"America’s Sweetheart,\" Mary Pickford was a legendary film actress during the age of silent pictures. She often appeared on screen in young girl roles, even when she was an adult. Pickford began performing at the age of five on the stage and was known for a time as \"Baby Gladys.\" After touring in different shows and productions for more than nine years, she went to New York to conquer Broadway. Taking the stage name, Mary Pickford, she made her Broadway debut in The Warrens of Virginia.\n\nSoon after the show’s run, Pickford got into film, working for D. W. Griffith, a director and head of American Biography Company. At the time, most films were short and she appeared in more than 40 movies in 1909. When Griffith moved his operation to California the following year, Pickford went with him. Over the years, her fame grew as well as her salary. She became an international star, beloved for her beauty and charm.\n\nCreation of United Artists\n\nSome of Pickford’s greatest films were a collaborative effort with friend and writer-director Frances Marion. Together they worked on such hits as Rebecca of Sunnybrook Farm (1917) and Poor Little Rich Girl (1917). Pickford also worked behind the scenes as a producer and founded the United Artists (UA), a film company, in 1919, with Griffith, Charlie Chaplin and Douglas Fairbanks, Sr., who would become her second husband. She had been married to actor Owen Moore and divorced him to be with Fairbanks.\n\nPickford and Fairbanks married in 1920, becoming one of Hollywood’s earliest super couples. Fans adored the pairing, and the couple were known to host fabulous events at their home, called Pickfair, which were attended by many of the leading figures in film.\n\nIn the 1920s, Pickford continued to score more box-office hits with Polyanna (1920) and Little Lord Fauntleroy (1922). She went on to help establish the Academy of Motion Picture Arts and Sciences in 1927. Around this time, the film industry was changing and talking pictures were on the rise. In 1929, Pickford starred in her first talkie Coquette, which explored the dark side of a wealthy family. She won an Academy Award for her work on the film. Still she was never quite able to recreate the phenomenal success she had in silent pictures with the sound films. Her last film was 1933’s Secrets.\n\nLater Years\n\nAfter retiring from the screen, Pickford continued to be involved in filmmaking. She worked as a producer on such films as One Rainy Afternoon (1936), Susie Steps Out (1946) and Sleep, My Love (1948). She also was on the board of directors for UA for many years. She married her third husband, Charles “Buddy” Rogers, in 1937. They adopted two children and stayed together until her death.\n\nDeath\n\nIn her final years, Pickford became reclusive. She largely stayed home at Pickfair and choosing to only see a select few friends. She died on May 29, 1979, in Santa Monica, California.\n\nQUICK FACTS\n\nName: Mary Pickford\n\nBirth Year: 1892\n\nBirth date: April 8, 1892\n\nBirth City: Toronto\n\nBirth Country: Canada\n\nGender: Female\n\nBest Known For: Mary Pickford was a legendary silent film actress and was known as \"America’s Sweetheart.\" She was a founder of United Artists and helped establish the Academy.\n\nIndustries\n\nFilm\n\nAstrological Sign: Aries\n\nDeath Year: 1979\n\nDeath date: May 29, 1979\n\nDeath State: California\n\nDeath City: Santa Monica\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/pickford-1892-1979/", "page_content": "Mary Pickford was the most popular woman of her day. She was \"America's Sweetheart,\" and millions of fans around the world called her \"our Mary.\" Her rise to unprecedented global fame coincided with the rise of popular cinema, and during those early years of film, Mary Pickford was its most adored and dynamic star.\n\nCourtesy: Edward Wagenknecht\n\nHard Times\n\nMary Pickford, \"the Girl with the Golden Curls,\" was born Gladys Louise Smith in 1892, in Toronto, Canada. She was the eldest of three children born to John Charles and Charlotte Smith. Her father had a hard time holding a job and the family's financial circumstances were, at best, uncertain. Though it was not something the family admitted, it appears that John suffered from alcoholism. When Gladys was just three and her siblings still infants, their father moved out. Three years later, in 1898, he died of a cerebral hemorrhage. Pickford would later write, \"I can close my eyes and still hear that scream of Mother's at the moment Father passed on.\" His widow and three children were left with nothing.\n\nStage Debut\n\nThat same year, anxious to help support the family, Gladys made her theatrical debut. She played the role of a fatherless child in a typical melodrama of the day, The Silver King. Right from the start she possessed something indefinable that attracted the audience: star quality. She and her mother, Charlotte, built on this success to win more jobs and began a life on the road in touring shows. At age 15, Gladys went to New York to break into Broadway.\n\nThe Great White Way\n\nGladys had set her mind on working for a famous producer, David Belasco, one of the great theater impresarios of the day. She spent weeks waiting outside his office for an interview. One day, facing yet another refusal, Gladys became strident. Hearing the outburst, an associate of Belasco opened his door. Gladys marched in the office and declared, \"My life depends on seeing Mr. Belasco!\" Her tenacity -- and, no doubt, her beauty -- won her an audition.\n\nBecoming Mary Pickford\n\nBelasco offered Gladys a part in a production called The Warrens of Virginia. He recommended she adopt a new, more star-like name, and Mary Pickford was born out of a surname from her mother's family and a lie about her middle name: hating the name Louise, she told Belasco her middle name was Marie, then adapted it to Mary.\n\nAt a Crossroads\n\nIn 1909, after Mary had performed for a year in A Good Little Devil, the show folded. Pickford was nearly 17, an awkward age in her profession: she was too old to play a little girl, but too young to take on the role of leading lady. She wished to continue working for Belasco, but there were no prospects for future roles. Pickford grew anxious and turned, on her mother's advice, to the very last resort for actors of the day: the movies. She hoped the shift would be temporary, and that she would soon be back on Broadway.\n\nTough Negotiator\n\nReluctantly looking for work in film, Pickford again went to the top -- to the well-known director D.W. Griffith and his New York film company, Biograph. She had a disconcerting screen test, and an awkward encounter with Griffith, but he was attracted by her beauty, by her tumbling blonde curls, and by the \"intelligence which shone in her eyes.\" He offered her five dollars a day, three days a week. She challenged his proposal, demanding ten dollars a day (nearly $200 in 2003 dollars) and more for extra work. He accepted.\n\nThe Biograph Girl\n\nThe actress was as innovative as her director, and together the two experimented with new methods of filmmaking. Pickford quickly understood that a new style of acting was required for the movies. She toned down her performances to make them more intimate; she expressed emotion through her eyes, not with grandiose gestures. Audiences responded to Pickford's performances and began to identify her as the \"Biograph girl.\"\n\nWell Paid\n\nWith her mother's encouragement, Pickford moved from one company to another, always negotiating higher salaries. Finally, in 1913, she made a deal with Adolph Zukor, joining his Famous Players Film Company for the grand salary of $500 a week (over $9000 in 2003 dollars).\n\nFame\n\nIn her fifth film for Famous Players, Tess of the Storm Country (1914), Pickford played a poor but heroic young woman, Tess, who makes the noble decision to care for a baby born to an unwed mother. Her performance vaulted her to extraordinary heights of stardom. To the astonishment of Mary and Charlotte, her popularity kept growing as Cinderella (1914), Rags (1915), and Madame Butterfly (1915) followed. The journalist Adela Rogers St. John would later describe Pickford as \"the woman who was known to more people and loved by more people than any other woman that has been in all history.\" Her career at the top would also last longer than almost anyone in Hollywood history -- for more than a decade, until 1927, her box office numbers would hit all-time highs.\n\nBad Marriage\n\nWhile Pickford was soaring to the top, her personal life was in tatters. When she first started working at Biograph she had fallen in love with a handsome actor, Owen Moore. They were married in 1911. Pickford knew that Charlotte did not approve of Moore from the beginning, so initially she concealed her marriage from her mother, and her public. Soon Moore's temper and alcoholism surfaced, and as Pickford's career took off, her marriage fell apart.\n\nTwo Stars Meet\n\nIt was during this tumultuous period that Pickford met and fell in love with the dazzling, handsome film actor Douglas Fairbanks. Fairbanks was the polar opposite of Owen Moore: he was full of energy and optimism, had a charismatic personality, was a brilliant and ambitious actor, and did not drink. But they were both married and feared catastrophic consequences for their careers if they divorced. They appeared before huge crowds together on tours promoting war bonds for World War I, but they always managed to hide their relationship from the public.\n\nThe King and Queen\n\nFinally, Pickford and Fairbanks decided to risk everything: they divorced their spouses and were married privately in 1920. The public received them with open arms. It seemed like the perfect match: the union of America's most popular stars. For millions of adoring fans, they seemed to be royalty, living out a fairytale romance in a lavish Hollywood estate dubbed \"Pickfair.\"\n\nUnited Artists\n\nThe couple made headlines again when they joined with Charlie Chaplin and D.W. Griffith to establish United Artists in 1919. Never before had filmmakers taken so much control over the business side of their productions. The company was created to distribute the founders' films, eliminating the distributors' stranglehold on profits. \"The satisfaction was, in one word, freedom. It's a heady wine, and having tasted it, you find it impossible to go back to working for someone else,\" Pickford would admit.\n\nSuccess\n\nCapturing a bigger piece of the pie might have been sweet, but in the years to follow, the financial demands of United Artists would pressure Pickford to limit herself artistically, playing roles she knew her fans would love. In 1920, Pickford played Pollyanna. The movie grossed an impressive $1.1 million (more than $10 million today) and further solidified the little girl persona Pickford's fans loved. Over the next decade her characters would grow older, and her roles more demanding. The films she did for United Artists in the Twenties were enormously successful, as the nation emerged from World War I, women won the right to vote, and Americans shed Victorian morals in the modern, urbanizing Jazz Age.\n\nFlapper Haircut\n\nIn 1928, Pickford's mother died of breast cancer. In her grief, Pickford cut off her famous curls -- and was lambasted by her fans. \"You would have thought I had murdered someone, and perhaps I had, but only to give her successor a chance to live,\" Pickford would reflect. But she knew she could not continue to play teenagers; her age was beginning to make those roles less credible.\n\nEnd of an Era\n\nIn addition, the silent era was coming to a close. Pickford was the first major star to attempt a \"talkie\" -- a movie with synchronous sound -- but the results were disappointing. The technology was still cumbersome and she faced challenges at the box office from glamorous new stars like Marlene Dietrich and Mae West.\n\nBetrayal\n\nAt the same time, her husband was straying. Fairbanks's own movie career was slowly sinking as well, and he had become interested in a British socialite, Lady Sylvia Ashley. Pickford was wounded and betrayed. When the film that would be her last, Secrets(1933), lost money at the box office, she sensed her career was over. \"I've worked all my life,\" she said. \"Work has become my life. I can think of nothing to fill the void.\"\n\nTwilight\n\nIn 1936, Pickford divorced Fairbanks, and a year later she married her co-star from My Best Girl (1927), a younger man named Charles \"Buddy\" Rogers. Pickford's feelings for Fairbanks were still strong, but Rogers had proved to be a loyal and devoted companion. The couple adopted two children when Pickford was 51. Professionally, Pickford tried her hand at radio, wrote for magazines, and engaged in philanthropic pursuits, none of which were particularly successful. Her fall from fame left her unfocused and adrift. Pickford turned to drinking.\n\nAn American Legend\n\nPickford's last years were spent at Pickfair, in seclusion. In 1976, over four decades after Pickford's last performance, the Academy presented her with a lifetime achievement award. She was too frail to attend the ceremony, so a crew came out to Pickfair and taped the presentation. Audiences were stunned, even offended, to see how much she had aged. She died three years later, at the age of 87.\n\nLegacy of a Superstar\n\nPickford was the world's first international superstar. Her performances could be seen and admired anywhere, thanks to a new, portable, mechanically reproduceable art form. Pickford was the first to experience the glamour and excitement of enormous and extravagant fame — and the first to pay the price for its loss. In 1915, statisticians calculated that she was seen globally by 12 million people every day. At the height of her success, she was the richest woman in America — and she enjoyed a long career in front of the camera. By the late 1930s, her star had waned. Still, Pickford's contributions to the development of film — the major artistic invention of the twentieth century — make her one of the most important cultural figures in American history."}, {"url": "https://marypickford.org/caris-articles/mary-and-doug-marry/", "page_content": "Mary Pickford and Douglas Fairbanks were married on Sunday evening, March 28, 1920 and when the world learned of it three days later, the news was greeted with joy. On the front page, above the fold, the Los Angeles Times declared that the “famous film romance is crowned by nuptials,” almost as if the union had been expected for some time and had finally come to fruition.\n\nWhile movie fans were celebrating Hollywood’s new royal couple, Mary herself was breathing a huge sigh of relief. For almost two years, she had been agonizing as she lived a bifurcated life – making her films as she publicly pretended to be happily married to one man while privately in love with another.\n\nMary and Doug first met at a party in Tarrytown, New York, in November of 1915, both accompanied by their spouses. As their hostess, vaudeville star Elsie Janis put it after she and Doug and Mary took a long walk around her property, “Mr. Fairbanks and Miss Pickford had become Douglas and Mary by the time we dragged our weary bodies home.”\n\nBy early 1917, Doug and Mary had privately declared their love for each other and within months, they had worked out a variety of ruses to see each other, often enlisting trusted friends as beards. Charlie Chaplin was pulled in to be present when photos were taken at the studio, but more intricate plans were laid for their assignations. For instance, Doug and his screenwriter, Anita Loos, would head out on a horseback ride while Mary and her friend and screenwriter Frances Marion made a public point of going to a different stable and then – as prearranged – secretly met up with Doug and Anita. Doug and Mary went off, usually to his brother’s house in the Hollywood hills, and Frances and Anita rode together for an hour or two until they reunited with the couple.\n\nAt first, Frances was pleased to see Mary so content and had to admit there were benefits to the affair; Mary was more cheerful than ever and while she had always thought of Mary as pretty, when “she was with Doug, she actually looked sexy.”\n\nMary’s mother knew about the affair and tacitly approved. As Frances said later in life, ” ‘Mama’ loved Mary to be happy and Mary was never lovelier than when she was with Doug. That was enough for Mama – if only they both weren’t married to somebody else.”\n\nAs enamored as they were of each other, neither Doug nor Mary were anxious to make any drastic moves. Their stardom was too important to them and it was assumed that fans wanted to put their favorite actors on a pedestal and live vicariously through them. At least that’s what studio chiefs wanted their players to believe to keep them in line. The fact was that when it came to stars divorcing and remarrying, there was no path to follow.\n\nDoug and Mary might have been able to keep their relationship secret but a series of events – both international and domestic – intervened. First, the government reached out to them, along with Charlie Chaplin and Marie Dressler, to go on a nationwide tour to sell war bonds. Both Mary’s mother and Frances urged Mary not to go, but when she insisted, Charlotte went along and was rarely out of camera range. Enough fans and reporters noticed the way Mary and Doug looked at each other that questions were raised, but they kept repeating that they were just friends. The tour affirmed their popularity more than they could have imagined and that gave Doug the confidence he needed to divorce his wife Beth. She had been Doug’s manager and financial advisor, but now he turned to his brother Robert and Mary’s attorney Cap O’Brien for guidance. For $500,000 cash and full custody of their young son, Doug Jr., Beth filed for divorce in the fall of 1918 without naming a co-respondent.\n\nTwo months after the war was over, Mary and Doug joined Griffith and Chaplin in announcing the formation of United Artists. More meaningful looks, more questions raised about their relationship. When Beth married an old flame, Jim Evans, and Doug’s box office saw no negative effect, he began, according to one of his biographers, “wheedling, begging and threatening” Mary to divorce Owen. .\n\nAs Doug’s son later explained, “Dad wanted all of Mary – herself and her talent and her fame and her exclusive devotion. And he longed to be able to display their union to the world like a double trophy.”\n\nMary was petrified of making a mistake of such a magnitude that it could wipe out everything she had worked for. She turned to Frances and together they decided they were too close to the situation. If anyone from the outside could be trusted to give an honest assessment, it was Frances’s good friend, the writer Adela Rogers St. Johns. As difficult as it was for Mary to let anyone into her private circle, she agreed to invite Adela for tea. Like everyone else who went to the movies, Adela felt she already knew Mary, but the first thing that struck her as Mary introduced herself was that she had never before heard her voice. Adela was enchanted and, for once in her life, more than a bit in awe. As the three of them sat in Mary’s living room, Frances explained they needed her thoughts as a reporter, a fan of moving pictures and someone with a sense of public opinion. And someone they could trust to keep a secret.\n\nAdela knew that Mary and Owen’s marriage had been in name only for years, yet still she was surprised with Mary’s bluntness. “If I get a divorce and marry Douglas, will anyone ever go see my pictures again?” Mary asked, “Do you think they will forgive me?” Then Mary added something that would always echo in Adela’s mind as exemplifying how seriously she took her position: “Above all, there are my people to consider.”\n\n“My people” meant more than just those who depended upon her. Along with the business acumen that served her so well, Mary had almost an innate understanding of this new phenomenon called stardom; the public’s sense of ownership of the personalities they took into their hearts.\n\nAdela hedged her advice. “I think your chances are better than even if it’s handled carefully… All the world loves a lover.” Overall, she was encouraging, and Mary thanked her for coming, and excused herself. As soon as they were alone, Frances explained how complicated things had become for Mary. In addition to everything else, her adored brother Jack didn’t approve of Doug; he thought he was a charlatan trying to buy his own importance through his association with Mary. Frances and Adela both found Jack charming, yet also knew that was exactly how many saw his relationship with his sister. If Mary lost her stardom, she would be fine – she had enough money to live and support her family comfortably. But there was another nagging question — would Doug still love her if she was no longer a star?\n\nFrances left for New York as soon as Pollyanna, Mary’s first UA film, finished shooting. Frances’s fiancé Fred Thomson, the Army chaplain Mary had introduced her to on the set of Johanna Enlists, was finally coming home from the European War. And on November 1, 1919, the day before their Manhattan wedding, Mary arrived to be matron of honor. As usual, Charlotte was there as well. When they were alone, Mary told Frances she had finally made up her mind – she was willing to risk losing the title of “America’s sweetheart” because “I only want to be one man’s sweetheart.”\n\nOnce the decision was made, Charlotte and their attorney Cap O’Brien started making the necessary arrangements. First, a deal was made with Owen to buy his cooperation for $100,000. He even helped speed up the process by conveniently arriving in Minden, Nevada with his attorney after Mary and Charlotte had been in the state for only a few days. Publicly claiming he was scouting film locations, Owen’s presence allowed him to be served with papers so Mary could go to court the next day.\n\nShe arrived dressed in black with a veil, almost as if she was in mourning for the marriage. The newspapers reported her as being prostrate between sobs, explaining how she had been deserted by a drunkard who berated her at every turn. She was portrayed as a woman who had suffered beyond any normal standards of endurance. She had been felled by the flu at several points over the past year and now she said she was the brink of a physical breakdown. That was, after all, why she was in Nevada – to seek refuge and regain her health. Nevada’s divorce laws were already liberal, but they required a several month residency so Mary’s words were carefully gauged.\n\n“Do I understand you came into the state in good faith, seeking health and nothing else?” asked the judge.\n\n“Yes sir.”\n\n“And you have given up Los Angeles as your residence and your permanent residence is Genoa, Douglas County, Nevada?”\n\n“Until I have regained my health, this will be my home.”\n\nWell, there was obviously a miraculous recovery, because as soon as the decree was granted, Mary and Charlotte, making no public statements, boarded a train to Los Angeles that very evening. When she and her mother arrived home on the morning of March 5, they were surrounded by reporters. Realizing that the rumors would just keep churning until Mary made a statement, they invited a reporter from the Los Angeles Times to their home that evening. The main message was that Mary had no plans for the future except to “devote her life to producing films to gladden the hearts of her admirers.” But she was quoted as saying other things as well – the divorce been “unpremeditated,” the rumors she would marry Doug or anyone else were “absurd,” there had been no financial settlement with Owen and she was planning on returning often to Nevada.\n\nMary had told Frances she wanted to wait a year until she married Doug, but that resolve crumbled as he gave Mary an ultimatum; marry him now or he was leaving her. They had been in love for two years and he was not waiting any longer. And she was tired of resisting.\n\nDoug had recently completed renovation of his isolated “hunting lodge” in Beverly Hills and he was already getting in the habit of inviting a variety of people to dinner. However, two of the guests on Friday, March 26 were unusual: the Baptist minister J. Whitcomb Brougher and a certain Mr. Sparks, a local marriage license clerk. Sparks had never been invited to dine with Fairbanks before and knew enough to bring all the proper paperwork with him, but Mary refused to be married on a Friday night. Besides, she was dressed in black and she wanted to wed on a Sunday. And so, 48 hours later, they arrived at Brougher’s home on 4th Street in Los Angeles, along with Charlotte, the actress Marjorie Daw, Doug’s brother Robert and his wife Lorie. Mary wore a lovely white toile gown trimmed in green, and her present to Doug was a portrait of her in her wedding dress. Doug’s present to Mary was the Beverly Hills home he was so proud of, soon to be dubbed Pickfair.\n\nAdela had been right about the world loving lovers; The news was heralded on the front page of newspapers across the country as the closest thing to a formal coronation of the reigning king and queen of movies.1\n\nIn retrospect, all of the angst and lost sleep Mary had suffered over her decision seemed unnecessary and the pictures of both of them after the wedding reveal how truly happy they were. In the end, it was the fans who clamored to see Doug and Mary on their honeymoon in New York and Europe who put an end to any doubts they had about their careers. The Attorney General of Nevada would soon go to court with questions about the propriety of Mary’s divorce, but that’s a story for another day.\n\nSources\n\n1. NY Times March 7, 1920; NY Times March 31, 1920."}, {"url": "https://www.findagrave.com/memorial/5902693/robert-emmett-keane", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://movie.douban.com/celebrity/1002793/", "page_content": "影人简介 · · · · · ·\n\n\n\n\n\n玛丽·毕克馥对电影史上有深远的影响。她是联艺制片公司4位创始人之一（其他3位分别为当时她的夫婿道格拉斯·费尔班克斯、以及大... 玛丽·毕克馥（Mary Pickford，1892年4月8日－1979年5月29日），加拿大电影演员，曾获得过奥斯卡最佳女主角奖和奥斯卡终身成就奖。她有很多昵称，如\"美国甜心\"（\"America's Sweetheart\"）、\"小玛丽\"（\"Little Mary\"）、\"金色卷发的女孩\"（\"the girl with the golden curls\"）。她是最早在好莱坞奋斗的加拿大演员之一，也是最伟大的电影先行者之一。玛丽·毕克馥对电影史上有深远的影响。她是联艺制片公司4位创始人之一（其他3位分别为当时她的夫婿道格拉斯·费尔班克斯、以及大... (展开全部)\n\n玛丽·毕克馥（Mary Pickford，1892年4月8日－1979年5月29日），加拿大电影演员，曾获得过奥斯卡最佳女主角奖和奥斯卡终身成就奖。她有很多昵称，如\"美国甜心\"（\"America's Sweetheart\"）、\"小玛丽\"（\"Little Mary\"）、\"金色卷发的女孩\"（\"the girl with the golden curls\"）。她是最早在好莱坞奋斗的加拿大演员之一，也是最伟大的电影先行者之一。\n\n\n\n玛丽·毕克馥对电影史上有深远的影响。她是联艺制片公司4位创始人之一（其他3位分别为当时她的夫婿道格拉斯·费尔班克斯、以及大卫·格里菲斯、查理·卓别林）。她也是美国影艺学院36位创始人之一。\n\n\n\n1979年，五月 死于脑溢血。\n\n\n\n1999年，美国电影学会颁布了AFI百年百大明星，在评选出25位百年来最伟大的女演员中，玛丽·毕克馥名列第24位。"}, {"url": "https://wfpp.columbia.edu/pioneer/ccp-mary-pickford/", "page_content": "by Christel Schmidt Mary Pickford was born Gladys Smith in 1892 in Toronto, Canada. After her father was killed in an accident, Gladys became the family’s main breadwinner by performing in the theatre. She was seven years old. In fact, the stage became a family venture, as her younger siblings Lottie and Jack and even her mother took up the trade. But the drive and determination to be a star belonged solely to Gladys. In 1907, her ambition would take her to Broadway and famed producer-director David Belasco, who changed her name to Mary Pickford and gave her a part in “The Warrens of Virginia.” In 1909, when Pickford was between stage engagements, she approached director D. W. Griffith at the Biograph Company in New York and asked for work in moving pictures. She had no intention of working permanently in the new medium, but hoped the income would tide her over before she went back to Belasco and the stage. Pickford was intrigued with film acting, and before long she began to enjoy “posing” for motion pictures. She stayed with the Biograph Company, working as both an actress and writer from 1909 to 1911, leaving for a brief stint with the Independent Motion Picture Company (IMP), and later with Majestic Pictures Corporation. She returned to Griffith at Biograph in early 1912, finishing out the year with him. In 1913, after a run on Broadway in “A Good Little Devil,” Pickford made a definitive break from the stage by signing a motion picture contract with Adolph Zukor and the Famous Players Film Company. The year 1913 marked the dawn of the feature motion picture, and Pickford was about to become its biggest star. In fact, she came to feature films with a well-established legacy. In 1911, “Moving Picture Mary” was the first movie star to adorn the cover of the New York Dramatic Mirror, an honor previously bestowed only on theatrical stars. And because moviegoers had already singled Pickford out as a favorite, her success in features was guaranteed. In 1914, Pickford’s Tess of the Storm Country, the story of a fiery young woman fighting for the underclass, caused a sensation. The extraordinary reaction made Pickford an international star and created fan worship that had never before been witnessed. In turn, this success gave Mary Pickford incredible bargaining power. In 1916, Pickford had negotiated a contract that gave her a $10,000 a week salary, 50% of her film profits, and her own production company. Pickford would sign off on every aspect of her productions, from the script to the director. She was even known to have had a hand in editing. During these years she worked with directors Maurice Tourneur and Marshall Neilan, the writer Frances Marion, and made some of the best features of her career, including Poor Little Rich Girl (1917), Stella Maris (1918), and The Hoodlum (1919). Pickford is often remembered for her portrayals of children in films including Rebecca of Sunnybrook Farm (1917) and Daddy-Long-Legs (1919). The stories were adapted from popular novels and had been performed on stage with an adult actress (Edith Taliaferro and Ruth Chatterton) playing the role of a young girl. Pickford’s petite size and youthful beauty made her ideal for these parts, but it was her acting talent that seared these roles into the public consciousness. Her portrait of childhood captured both the simplicity and complexity of a young person’s inner world, and also its physicality, through body language and mannerism. In 1919, when she was only twenty-seven years old, Pickford cofounded United Artists, the first independent film distribution company, along with Charlie Chaplin, D. W. Griffith, and her future husband Douglas Fairbanks. Then in 1920 she and Fairbanks were wed in a private ceremony, but they shared their married life with the world. At first, the couple had feared a negative reaction (both were already married when they met), but their union only fed into the romantic fantasies many fans had about Hollywood. The couple was mobbed at every port on their whirlwind European honeymoon. Back in California, they relished their place as the King and Queen of Hollywood, holding court at their home, known as Pickfair. Pickford decided to make only one film a year after 1921, focusing on the quality of her productions. Many believe that she was at her creative peak during the teens, but her films of the 1920s were the most successful. Favorite titles from this decade include a remake of Tess of the Storm Country (1922), Rosita (1923), and Sparrows (1926). Her last silent film, My Best Girl (1927), would be one of the greatest of the era. The decade’s last year brought about major changes in the industry and for Mary Pickford. By 1929, the Talkies had all but obliterated silent film. Pickford knew she could not resist the change. She cut her old-fashioned curls and made two Talkies before the decade ended. Coquette (1929) won her an Oscar for best actress, and Taming of the Shrew (1929) featured the much-anticipated pairing of Pickford and Fairbanks. But even with good reviews and promotion, these films were not as successful as her silent pictures. She attempted two more sound features, then retired in 1933 after twenty-three years of making movies. And though she kept on producing films after retiring, the experience was not as rich as running her own career had been. Pickford, whose professional decline had begun in the same year as the death of her beloved mother, Gladys, in 1928, saw her brother and sister die in the 1930s. In 1936, her fairytale marriage to Fairbanks ended in divorce. Fairbanks died of heart failure only three years later. In 1937, Pickford married actor Charles “Buddy” Rogers, her costar in My Best Girl. The marriage lasted until Mary Pickford’s death in 1979. See also: Frances Marion\n\nBibliography\n\nBennett, Carl. “Mary Pickford Filmography.” Silent Era: Progressive Silent Film List. http://www.silentera.com/PSFL/filmographies/actresses/Pickford-Mary.html\n\nCard, James. “The Films of Mary Pickford.” Image: The Journal of the George Eastman House. Vol. 8, No. 4 (Dec 1959): 172-191.\n\nEyman, Scott. Mary Pickford, America’s Sweetheart. New York: Donald I. Fine, Inc., 1990.\n\nMoore, Robert F. “Mary Pickford, Manager.” Motion Picture Magazine (Aug. 1917): 69-70.\n\n“Nineteen Weeks for 'Daddy Long Legs' at Boston Theatre.” Motion Picture News (8 Nov. 1919): 3592.\n\nNiver, Kemp. Mary Pickford: Comedienne. Los Angeles: Artisan Press, 1969.\n\nPickford, Mary. “Ambassadors.” The Saturday Evening Post. August 23, 1930: 6-7, 117.\n\n------. “Moving Pictures.” Mary Pickford: Daily Talks. The McClure Newspaper Syndicate (7 Dec. 1915): n.p.\n\n------. Sunshine and Shadow. Garden City, NY: Doubleday, 1955.\n\n------. “Writing Scenarios.” Mary Pickford Daily Talks. The McClure Newspaper Syndicate (7 Dec. 1915): n.p.\n\nSchmidt, Christel. “Preserving Pickford: The Mary Pickford Collection and the Library of Congress.” The Moving Image Journal vol. 3, no. 1 (2003): 59-81.\n\n------. “The Search for a Film Legacy: Mary Pickford (1909-1933).” [online resource] (2010) http://pickfordfilmlegacy.tripod.com/\n\nSlide, Anthony. The Griffith Actresses. New York: A. S. Barnes and Company, 1973.\n\nWagenknecht, Edward. Movies in the Age of Innocence. Norman: University of Oklamoma Press, 1962.\n\nWhitfield, Eileen. Pickford: The Woman Who Made Hollywood. Lexington: The University of Kentucky Press, 1997.\n\nWindeler, Robert. Sweetheart: The Story of Mary Pickford. New York: Preager Publishers, 1973.\n\nZukor, Adolph with Dale Kramer. The Public Is Never Wrong. New York, G.P. Putnum’s Sons, 1953.\n\nArchival Paper Collections:\n\nLillian Gish papers and sound recordings, 1909-1992. New York Public Library, Billy Rose Theatre Division.\n\nMary Pickford papers, 1893-1983. Academy of Motion Picture Arts and Sciences, Margaret Herrick Library.\n\nMary Pickford scrapbook, Robinson Locke collection, 1870-1920. New York Public Library, Billy Rose Theatre Division.\n\nReminiscences of Mary Pickford. Columbia University, Rare Book and Manuscript Library.\n\nSamuel Stark. Theatre scrapbook collection, 1860-1950. Stanford University.\n\nRob Wagner papers, 1925-1942. University of California, Los Angles, Charles E. Young Research Library.\n\nUnited Artists Corporation Collection. Wisconsin Historical Society Library.\n\nFilmography\n\nA. Archival Filmography: Extant Film Titles:\n\n1. Mary Pickford as Actress\n\n\"1776\" or, The Hessian Renegades. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nThe Broken Locket. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Frank Powell, Kate Bruce, Arthur Johnson, si, b&w. Archive: Library of Congress.\n\nThe Cardinal's Conspiracy. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Frank Powell, Arthur Johnson, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Country Doctor. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Frank Powell, Kate Bruce, Gladys Egan, si, b&w. Archive: George Eastman Museum, Museum of Modern Art, Library of Congress, Cinémathèque Royale de Belgique, Národní Filmov Archiv.\n\nThe Faded Lilies. Dir. D.W. Griffith (Biograph Co. US 1909) cas.: Mary Picford, David Miles, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Gibson Goddess. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Mack Sennett, George Nichols, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Heart of An Outlaw. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Marion Leonard, Henry B. Walthall, si, b&w. Archive: Museum of Modern Art.\n\nHer First Biscuits. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, John R. Cumpson, Arthur Johnson, si, b&w. Archive: Library of Congress.\n\nHis Duty. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Kate Bruce, Owen Moore, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nHis Lost Love. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Owen Moore, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nHis Wife's Visitor. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, Frank Powell, James Kirkwood, si, b&w. Archive: Library of Congress.\n\nThe Indian Runner's Romance. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Owen Moore, Arthur Johnson, si, b&w. Archive: Library of Congress.\n\nIn Old Kentucky. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Henry B. Walthall, Kate Bruce, Verner Clarges, si, b&w. Archive: Library of Congress.\n\nIn the Watches of the Night. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, George Nichols, Gladys Egan, Marion Leonard, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Light That Came. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Ruth Hart, Marion Leonard, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nLines of White in a Sullen Sea. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Linda Arvidson, James Kirkwood, George Nichols, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Little Teacher. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Kate Bruce, Edward Dillon, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nThe Lonely Villa. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Gladys Egan, Adele DeGarde, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nA Midnight Adventure. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, Kate Bruce, Mack Sennett, si, b&w. Archive: Library of Congress.\n\nThe Mountaineer's Honor. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Owen Moore, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Necklace. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Arthur Johnson, Frank Powell, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nOh, Uncle. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, James Kirkwood, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Peachbasket Hat Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, John R. Cumpson, Anita Hendrie, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Restoration. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Owen Moore, James Kirkwood, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Renunciation. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Billy Quirk, Harry Solter, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nThe Sealed Room. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Henry B. Walthall, Arthur Johnson, si, b&w. Archive: Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Seventh Day. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Rose King, Frank Powell, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Slave. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Harry Solter, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Son's Return. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Anita Hendrie, Billy Quirk, Herbert Prior, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nSweet and Twenty. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, James Kirkwood, Florence Lawrence, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nTender Hearts. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Frank Powell, Lottie Pickford, si, b&w. Archive: Museum of Modern Art.\n\nThe Test. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, Marion Leonard, Arthur Johnson, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThey Would Elope. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, James Kirkwood, Kate Bruce, si, b&w. Archive: Library of Congress.\n\nThrough the Breakers. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, James Kirkwood, Adele DeGarde, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nTo Save Her Soul. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, George Nichols, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Trick That Failed. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Mack Sennett, Billy Quirk, si, b&w. Archive: Library of Congress.\n\nTwo Memories Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, David Miles, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Violin Maker of Cremona. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, David Miles, Owen Moore, Herbert Prior, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nThe Way of Man. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Arthur Johnson, Gladys Egan, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nWhat's Your Hurry? Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, George Nichols, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nAll On Account of the Milk. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Blanche Sweet, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nAn Arcadian Maid. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Mack Sennett, Kate Bruce, George Nichols, si, b&w. Archive: BFI National Archive, Library of Congress, UCLA Film & Television Archive.\n\nAs It Is In Life. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, George Nichols, Gladys Egan, Mack Sennett, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Call To Arms. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Narion Leonard, Joseph Graybill, si, b&w. Archive: Library of Congress.\n\nA Child's Impulse. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Vivian Prescott, Charles West, Joseph Graybill, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Decree of Destiny. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Joseph Graybill, Marion Sunshine, Clara Bracey, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Englishman and the Girl. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, George Nichols, Charles Craig, Kate Bruce, si, b&w. Archive: Library of Congress.\n\nA Gold Necklace. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Kate Bruce, Lottie Pickford, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nIn the Season of Buds. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Mack Sennett, Charles West, Kate Bruce, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Italian Barber. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Joseph Graybill, Marion Sunshine, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nLove Among the Roses. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Marion Leonard, Arthur Johnson, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nA Lucky Toothache. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Mack Sennett, Edward Dillon, Charles West, si, b&w. Archive: Library of Congress.\n\nMaid or Man. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Owen Moore, si, b&w. Archive: Museum of Modern Art.\n\nThe Mirror. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Owen Moore, William Shay, si, b&w. Archive: George Eastman Museum.\n\nMuggsy Becomes a Hero. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Grace Henderson, Edward Dillon, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nMuggsy's First Sweetheart. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Edward Dillon, Joseph Graybill, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nNever Again. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Mack Sennett, Anthony O’Sullivan, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Newlyweds. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Florence Barker, Charles West, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Plain Song. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Dell Henderson, Kate Bruce, W. Chrystie Miller, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nRamona. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Francis Grandon, Kate Bruce, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nA Rich Revenge. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Francis Grandon, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Romance of the Western Hills. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Dorothy West, Alfred Paget, si, b&w. Archive: Academy Film Archive, Library of Congress.\n\nSimple Charity. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Edwin August, W. Chrystie Miller, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Smoker. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Jack Pickford, Frank Opperman, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nThe Song of the Wildwood Flute. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Dark Cloud, Francis Grandon, Dell Henderson, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nThe Sorrows of the Unfaithful. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Edward Dillon, Gladys Egan, si, b&w. Archive: Library of Congress.\n\nThe Thread of Destiny. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Linda Arvidson, Francis J. Grandon, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThree Sisters. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Marion Sunshine, Vivian Prescott, Kate Bruce, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress.\n\nThe Twisted Trail. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, George Nichols, Kate Burce, si, b&w. Archive: Library of Congress.\n\nThe Two Brothers. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Dell Henderson, Marion Leonard, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Unchanging Sea. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Linda Arvidson, Arthur Johnson, Dell Henderson, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nA Victim of Jealousy. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, James Kirkwood, Florence Barker, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nWaiter No. 5. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, George Nichols, Claire McDowell, Jack Pickford, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nWhat the Daisy Said. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Gertrude Robinson, Joseph Graybill, Verner Clarges, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nWhen a Man Loves. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Dell Henderson, Charles West, George Nichols, si, b&w. Archive:Library of Congress, Museum of Modern Art.\n\nWhen We Were In Our 'Teens. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Joseph Graybill, Mack Sennett, si, b&w. Archive: Library of Congress.\n\nWhite Roses. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Edward Dillon, W. Chrystie Miller, Jack Pickford, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nWilful Peggy. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Clara Bracey, Henry B. Walthall, Claire McDowell, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Woman From Mellon's. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, George Nichols, Linda Arvidson, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nArtful Kate. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: Academy Film Archive, Library of Congress.\n\nAt a Quarter of Two. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: Library of Congress.\n\nIn Old Madrid. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: Library of Congress.\n\nIn the Sultan's Garden. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, King Baggot, Owen Moore, si, b&w. Archive: Library of Congress.\n\nThe Lighthouse Keeper. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, William E. Shay, J. Farrell MacDonald, si, b&w. Archive: Library of Congress.\n\nLittle Red Riding Hood. Dir.: Owen Moore (Majestic Co, US 1911) cas.: Mary Pickford, Owen Moore, James Kirkwood, Mayme Kelso, si, b&w. Archive: Library of Congress.\n\nA Manly Man. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, William Shay, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nSweet Memories. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Charlotte Pickford, Lottie Pickford, Jack Pickford, si, b&w. Archive: Library of Congress.\n\nA Timely Repentance. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, William Shey, Lucille Young, si, b&w. Archive: Library of Congress.\n\n‘Tween Two Loves. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, William Shey, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nWhen the Cat's Away. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Lottie Pickford, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nA Beast at Bay. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Edwin August, Alfred Paget, Mae Marsh, si, b&w. Archive: Academy Film Archive, BFI National Archive, Library of Congress, Museum of Modern Art.\n\nFate's Interception. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Wilfred Lucas, Charles Hill Mailes, Charles West, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Female of the Species. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Claire McDowell, Charles West, Dorothy Bernard, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nA Feud in the Kentucky Hills. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Charles Hill Mailes, Kate Bruce, Henry B. Walthall, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nFriends. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry Walthall, Lionel Barrymore, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nHome Folks. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Charles Hill Mailes, Kate Bruce, Robert Harron, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nIola's Promise. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Alfred Paget, Frank Evans, Dorothy Bernard, si, b&w. Archive: BFI National Archive, Library of Congress, UCLA Film & Television Archive.\n\nAn Indian Summer. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Kate Bruce, W. Chrystie Miller, Jack Pickford, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nThe Informer. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry Walthall, Walter Miller, Lillian Gish, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Inner Circle. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Adolph Lestina, Jack Pickford, Chalres Hill Mailes, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nJust Like a Woman. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford,Wilfred Lucas, Grace Henderson, Mae Marsh, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Lodging for the Night. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Charles West, Charles Hill Mailes, William Carroll, si, b&w. Archive: Library of Congress.\n\nThe Mender of the Nets. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Mabel Normand, Charles West, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nMy Baby. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry B. Walthall, Eldean Stewart, W. Chrystie Miller, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Narrow Road. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Elmer Booth, Charles Hill Mailes, Alfred Paget, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe New York Hat. Dir.: D.W. Griffith; sc.: Anita Loos (Biograph Co. US 1912) cas.: Mary Pickford, Lionel Barrymore, Charles Hill Mailes, Mae Marsh, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Old Actor. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, W. Chrystie Miller, Kate Bruce, Edwin August, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe One She Loved. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry B. Walthall, Lionel Barrymore, Kate Bruce, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nA Pueblo Legend. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford,Wilfred Lucas, Robert Harron, Jack Pickford, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe School Teacher and the Waif. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Edwin August, Charles Hill Mailes, Claire McDowell, si, b&w. Archive: Library of Congress.\n\nSo Near, Yet So Far. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Walter Miller, Robert Harron, Lillian Gish, si, b&w. Archive: George Eastman Museum,Library of Congress, Museum of Modern Art.\n\nThe Unwelcome Guest. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, W. Chrystie Miller, Claire McDowell, Jack Pickford, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nWith the Enemy's Help. Dir.: Wilfred Lucas (Biograph Co. US 1912) cas.: Mary Pickford, Blanche Sweet, Charles West, Charles Hill Mailes, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nWon by a Fish. Dir.: Mack Sennett (Biograph Co. US 1912) cas.: Mary Pickford, Edward Dillon, Dell Henderson, Kate Bruce, si, b&w. Archive: Academy Film Archive, Library of Congress, Museum of Modern Art.\n\nBehind the Scenes. Dir.: James Kirkwood (Famous Players Film Co. US 1914) cas.: Mary Pickford, James Kirkwood, Lowell Sherman, Ida Waterman, si, b&w. Archive: George Eastman Museum.\n\nCinderella. Dir.: James Kirkwood sc.: Austin Strong (Famous Players Film Co. US 1914) cas.: Mary Pickford, Owen Moore, Isabel Vernon, Georgia Wilson, si, b&w. Archive: Library of Congress, EYE Filmmuseum.\n\nA Good Little Devil. Dir.: Edwin S. Porter sc.: Austin Strong (Famous Players Film Co. US 1914) cas.: Mary Pickford, Ernest Truex, William Norris, Iva Merlin, si, b&w. Archive: BFI National Archive.\n\nThe Eagle's Mate. Dir.: James Kirkwood (Famous Players Film Co. US 1914) cas.: Mary Pickford, James Kirkwood, Ida Waterman, Robert Broderick, si, b&w. Archive: BFI National Archive, George Eastman Museum.\n\nTess of the Storm Country. Dir.: Edwin S. Porter (Famous Players Film Co. US 1914) cas.: Mary Pickford, Harold Lockwood, Olive Golden, David Hartford, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe Dawn of a Tomorrow. Dir.: James Kirkwood sc.: Eve Unsell (Famous Players Film Co. US 1915) cas.: Mary Pickford, David Powell, Forrest Robinson,, Margaret Seddon, si, b&w. Archive: Svenska Filminstitutet, Library of Congress.\n\nFanchon the Cricket. Dir.: James Kirkwood (Famous Players Film Co. US 1915) cas.: Mary Pickfod, Jack Standing, Lottie Pickford, Jack Pickford, si , b&w. Archive: BFI National Archive, George Eastman Museum.\n\nThe Foundling. Dir.: John B. O’Brien sc.: Frances Marion (Famous Players Film Co. US 1916) cas.: Maggie Weston, Edward Martindale, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nLittle Pal. Dir.: James Kirkwood sc.: Marshall Neilan (Famous Players Film Co. US 1915) cas.: Mary Pickford, Russell Bassett, George Anderson, William Lloyd, si, b&w. Archive: Cinémathèque Française.\n\nMadame Butterfly. Dir.: Sidney Olcott (Famous Players Film Co. US 1915) cas.: Mary Pickford, Marshall Neilan, Olive West, Jane Hall, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nMistress Nell. Dir.: James Kirkwood (Famous Players Film Co. US 1915) cas.: Mary Pickford, Owen Moore, Ruby Hoffman, Arthur Hoops, si, b&w. Archive: Museum of Modern Art, Národní Filmov Archiv.\n\nRags. Dir.: James Kirkwood sc.: Edith Barnard Delano (Famous Players Film Co. US 1915) cas.: Mary Pickford, Marshall Neilan, Joseph Manning, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Eternal Grind. Dir.: John B. O’Brien sc.: William H. Clifford (Famous Players Film Co. US 1916) cas.: Mary Pickford, Dorothy West, Loretta Blake, John Bowers, si, b&w. Archive: Cinémathèque Française.\n\nHulda from Holland. Dir.: John B. O’Brien sc.: Edith Barnard Delano (Famous Players Film Co. US 1916) cas.: Mary Pickford, John Bowers, Frank Losee, si, b&w. Archive: Národní Filmov Archiv.\n\nPoor Little Peppina. Dir.: Sidney Olcott sc.: Kate Jordan (Famous Players Film Co. US 1916) cas.: Mary Pickford, Antonio Maiori , Jack Pickford, Eugene O’Brien, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\n2. Mary Pickford as Producer and Actress\n\nLess than the Dust. Prod.: Mary Pickford, dir.: John Emerson sc.: Hector Turnbull (Mary Pickford Film Corp. US 1916) cas.: Mary Pickford, David Powell, Mary Alden, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe Little American. Prod. Cecil B. DeMille, Mary Pickford, dir.: Cecil B. DeMille, sc.: Jeanie Macpherson, Cecil B. DeMille, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Jack Holt, si, b&w, 6 reels, 5,925 ft. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive, Cineteca del Friuli.\n\nA Little Princess. Prod.: Mary Pickford, dir.: Marshall Neilan, sc.: Frances Marion, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp US 1917) cas.: Mary Pickford, Norman Kerry, Zasu Pitts, si, b&w, 35mm, 6 reels. Archive: George Eastman Museum, Library of Congress, EYE Filmmuseum, Filmoteca de Catalunya, UCLA Film & Television Archive.\n\nThe Poor Little Rich Girl. Prod.: Mary Pickford, dir.: Maurice Tourneur sc.: Frances Marion (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Madeline Traverse, Gladys Fairbanks, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Pride of the Clan. Prod. Mary Pickford, dir.: Maurice Tourneur sc.: Elaine Sterne, Charles E. Whittaker (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Matt Moore, Warren Cooke, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nRebecca of Sunnybrook Farm. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Josephine Crowell, Eugene O’Brien, Marjorie Daw, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nA Romance of the Redwoods. Prod.: Cecil B. DeMille, Mary Pickford, dir.: Cecil B. DeMille sc.: Jeannie MacPherson , Cecil B. DeMille (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Elliott Dexter, Raymond Hatton, si, b&w. Archive: George Eastman Museum.\n\nAmarilly of Clothes-Line Alley. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Norman Kerry, Kate Price, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nM'liss. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Thomas Meighan, Theodore Roberts, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nJohanna Enlists. Prod.: Mary Pickford, dir.: William Desmond Taylor sc.: Frances Marion (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Monte Blue, Douglas McLean, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nStella Maris. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Conway Tearle, Marcia Manon, Ida Waterman, si, b&w, 35mm., 6 reels. Archive: Cineteca del Friuli, George Eastman Museum, Library of Congress, Museum of Modern Art, National Film and Sound Archive of Australia.\n\nThe Heart o' the Hills. Prod.: Mary Pickford, dir.: Sidney A. Franklin sc.: Bernard McConville (Mary Pickford Film Corp. US 1919) cas.: Mary Pickford, Claire McDowell, Jack (John) Gilbert, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Hoodlum. Prod.: Mary Pickford, Dir.: Sidney A. Franklin (Mary Pickford Film Corp. US 1919) cas.: Mary Pickford, Ralph Lewis, Max Davidson, si, b&w. Archive: Academy Film Archive, George Eastman Museum, BFI National Archive.\n\n3. Mary Pickford as Producer, Actress, and Distributor (United Artists)\n\nPollyanna. Prod.: Mary Pickford, dir.: Paul Powell sc.: Frances Marion (Mary Pickford Film Corp. US 1920) cas.: Mary Pickford, Katherine Griffith, Herbert Prior, si, b&w. Archive: Cinémathèque Royale de Belgique, George Eastman Museum, Library of Congress.\n\nSuds. Prod.: Mary Pickford, dir.: Jack Dillon sc.: Waldemar Young (Mary Pickford Film Corp. US 1920) cas.: Mary Pickford, Harold Goodwin, Albert Austin, Rose Dione, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Národní Filmov Archiv.\n\nLittle Lord Fauntleroy. Prod.: Mary Pickford, dir.: Alfred E. Green Jack Pickford sc.: Bernard McConville (Mary Pickford Film Corp. US 1921) cas.: Mary Pickford, Claude Gillingwater, Joseph Dowling, Kate Price, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Love Light. Prod.: Mary Pickford, dir./sc.: Frances Marion (Mary Pickford Co. US 1921) cas.: Mary Pickford, Fred Thomson, si, b&w, 35mm, 8 reels. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive, Gosfilmofond.\n\nThrough the Back Door. Prod.: Mary Pickford, dir.: Alfred E. Green , Jack Pickford sc.: Marion Fairfax (Mary Pickford Film Corp. US 1921) cas.: Mary Pickford, Gertude Astor, Wilfred Lucas, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nTess of the Storm Country. Prod.: Mary Pickford, dir.: John S. Robertson, adp.: Elmer Harris (Mary Pickford Film Corp. US 1922) cas.: Lloyd Hughes, Gloria Hope, si, b&w [incomplete]. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive, Gosfilmofond.\n\nRosita. Prod.: Mary Pickford, dir.: Ernst Lubitsch sc.: Edward Knoblock (Mary Pickford Film Corp. US 1923) cas.: Mary Pickford, Irene Rich, George Walsh, si, b&w. Archive: Cinémathèque Royale de Belgique, Museum of Modern Art, Národní Filmov Archiv.\n\nDorothy Vernon of Haddon Hall. Prod.: Mary Pickford, dir.: Marshall Neilan, sc.: Waldemer Young (Mary Pickford Film Corp. US 1924) cas.: Mary Pickford, Allan Forest, Lottie Pickford Forrest, si, b&w. Archive: Cinémathèque Royale de Belgique, Filmoteka Narodowa, George Eastman Museum, Library of Congress, Gosfilmofond, UCLA Film & Television Archive, Deutsche Kinemathek.\n\nSparrows. Prod.: Mary Pickford, dir.: William Beaudine sc.: Winifred Dunn (Mary Pickford Film Corp. US 1926) cas.: Mary Pickford, Gustav von Seyffertitz, Roy Stewart, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nMy Best Girl. Prod.: Mary Pickford, dir.: Sam Taylor, sc.: Hope Loring, adp.: Allen McNeil, Tim Whelan (Mary Pickford Corp. US 1927) cas.: Mary Pickford, Charles (Buddy) Rogers, si, b&w, 35mm, 9 reels. Archive: Cinémathèque Royale de Belgique, George Eastman Museum, Library of Congress, Academy Film Archive.\n\n4. Mary Pickford as Screenwriter and Actress\n\nGetting Even. Dir.: D.W. Griffith, sc.: Mary Pickford (Biograph Co. US 1909) cas.:Mary Pickford, Billy Quirk, Mack Sennett, James Kirkwood, si, b&w. Archive: Library of Congress.\n\nThe Awakening. Dir.: D.W. Griffith, sc.: Mary Pickford (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Clara Bracy, Owen Moore, si, b&w. Archive: Library of Congress.\n\nMay and December. Dir.: Frank Powell, sc.: Mary Pickford (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Aart [USM].\n\nTheir First Misunderstanding. Dir.: Thomas H. Ince, George L. Tucker. sc.: George L. Tucker (IMP Co. US 1911) cas: Mary Pickford, Owen Moore, si, b&w. Archive: Library of Congress.\n\nThe Dream. Dir.: Thomas H. Ince, sc.: Mary Pickford (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, Lottie Pickford, si, b&w. Archive: Library of Congress.\n\nLena and the Geese. Dir.: D.W. Griffith, sc.: Mary Pickford (Biograph Co. US 1912) cas.: Mary Pickford, Kate Bruce, Mae Marsh, Edwin August, si, b&w. Archive: Academy Film Archive, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\n5. Mary Pickford as Producer, Screenwriter, and Actress\n\nDaddy-Long-Legs. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Agnes C. Johnston, Mary Pickford (Mary Pickford Film Corp. US 1919) cas.: Milla Davenport, Marshall Neilan, si, b&w. Archive: George Eastman Museum, Library of Congress, EYE Filmmuseum, UCLA Film & Television Archive.\n\n6. Mary Pickford as Producer, Screenwriter, Actress, and Distributor (United Artists)\n\nLittle Annie Rooney. Dir.: William Beaudine sc.: Hope Loring, Mary Pickford (Mary Pickford Film Corp. US 1925) cas.: William Haines, Walter James, Vola Vale, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\n7. Mary Pickford as Screenwriter\n\nThe Day After. Dir.: D.W. Griffith sc.: Mary Pickford (Biograph Co. US 1909) cas.: Marion Leonard, Arthur Johnson, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art, Academy Film Archive.\n\nMadame Rex. Dir.: D.W. Griffith sc.: Mary Pickford (Biograph Co. US 1911) cas.: Edwin August, Stephanie Longfellow, si, b&w. Archive: Museum of Modern Art.\n\nB. Filmography: Non-Extant Film Titles:\n\n1. Mary Pickford as Actress\n\nBack to the Soil, 1911; The Better Way, 1911; The Caddy's Dream, 1911; The Call of the Song, 1911; The Convert, 1911; The Courting of Mary, 1911; The Fair Dentist, 1911; The Fisher-Maid, 1911; For Her Brother's Sake, 1911; For the Queen's Honor, 1911; A Gasoline Engagement, 1911; Her Darkest Hour, 1911; His Dress Shirt, 1911; Honor Thy Father, 1911; Love Heeds Not the Showers, 1911; The Master and the Man, 1911; The Message in the Bottle, 1911; Pictureland, 1911; The Rose's Story, 1911; Science, 1911; The Secret of the Palm, 1911; The Sentinel Asleep, 1911; The Skating Bug, 1911; The Stampede, 1911; There is Life, 1911; The Toss of a Coin, 1911; Tracked, 1911; While There is Hope, Second Sight, 1911; Caprice, 1913; In the Bishop's Carriage, 1913; Hearts Adrift, 1914; Such a Little Queen, 1914; Esmeralda, 1915; A Girl of Yesterday, 1915.\n\n2. Mary Pickford as Screenwriter and Actress\n\nHearts Adrift, 1914; A Girl of Yesterday, 1915.\n\n3. Mary Pickford as Producer and Actress\n\nHow Could You, Jean?, 1918; Captain Kidd, Jr., 1919.\n\n4. Mary Pickford as Screenwriter\n\nCaught in the Act, 1911; The Medallion, 1911; When Fate Decrees, 1913.\n\nC. DVD Sources:\n\nAmarilly of Clothes-Line Alley. DVD (Image Entertainment US 2000)\n\nAmarilly of Clothes-Line Alley with The Dream. DVD. (The Milestone Collection US 2000)\n\nDaddy Long-Legs with What the Daisy Said. DVD. (The Milestone Collection US 1999)\n\nThrough the Back Door with Cinderella. DVD. (The Milestone Collection US 2005)\n\nDorothy Vernon of Haddon Hall. DVD. (Alpha Video US 2017)\n\nM'liss and Heart o' the Hills. DVD. (The Milestone Collection US 2005)\n\nHeart o' the Hills. DVD. (Alpha Video US 2013)\n\nThe Hoodlum. DVD. (Alpha Video US 2013)\n\nJohanna Enlists. DVD. (Alpha Video US 2016)\n\nLess than Dust. DVD. (Alpha Video US 2015)\n\nThe Little American. DVD. (Alpha Video US 2015)\n\nLittle Annie Rooney. DVD. (Alpha Video US 2017)\n\nLittle Lord Fauntleroy. DVD. (The Milestone Collection US 2015)\n\nWithout Lying Down with The Little Princess. DVD. (The Milestone Collection US 2003)\n\nTess of the Storm Country. DVD (Image Entertainment US 1999)\n\nStella Maris. DVD (Image Entertainment US 2000)\n\nThe Love Light. DVD (Image Entertainment US 2001)\n\nMadame Butterfly. DVD. (Alpha Video US 2015)\n\nThe Pride of the Clan with Sweet Memories. DVD. (Grapevine Video US 2013_\n\nSparrows with Wilful Peggy and The Mender of Nets. DVD. (The Milestone Collection US 1999)\n\nMy Best Girl. (The Milestone Collection US 1999)\n\nA Romance of the Redwoods. DVD. (Alpha Video US 2013)\n\nRebecca of Sunnybrook Farm. DVD. (Alpha Video US 2014)\n\nSuds. DVD. (The Milestone Collection US 2005)\n\nRags and Riches: Mary Pickford Collection. DVD. (Milestone US 2012)\n\nTreasures III: Social Issues in American Film, 1900-1934. DVD. Image Entertainment US 2007)\n\nThe Origins of Film Collection. DVD. (Smithsonian Video US 2001)\n\nGriffith Masterworks: Biograph Shorts (1908-1914. DVD. (Kino Video US 2002) - contains The New York Hat (1912)\n\nD.W. Griffith Years of Discovery, 1909-1913. DVD. (Image Entertainment US 2002) - contains The New York Hat (1912)\n\nD.W. Griffith Director, Vol. 3, 4, 5, 6. DVD. (Grapevine Video US 2011)\n\nThe Cecil B. DeMille Classics Collection. DVD. (Passport Video US 2007)\n\nMary Pickford Collection. DVD (St. Clair Vision US 2008)\n\nD. Streamed Media:\n\nThe New York Hat (1912) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Poor Little Rich Girl (1917) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Love Light (1921) is streaming online via Amazon Prime\n\nThe Love Light (1921) is streaming online via The Internet Archive\n\nLittle Annie Rooney (1925) is streaming online via Amazon Prime\n\nThe Little American (1916) is streaming online via Amazon Video (with Fandor subscription)\n\nSparrows (1926) is streaming online via Amazon Video (with Fandor subscription)\n\nFriends (1912) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Unchanging Sea (1910) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Hoodlum (1919) is streaming online via Amazon video (with Fandor subscription)\n\nThe Hoodlum (1919) is streaming online via The Internet Archive\n\nCinderella (1914) is streaming online via The Internet Archive\n\nJohanna Enlists (1918) is streaming online via The Internet Archive\n\nThe Little Princess (1917) is streaming online via The Internet Archive\n\nLittle Lord Fauntleroy (1921) is streaming online via The Internet Archive\n\nStella Maris (1918) is streaming online via The Internet Archive\n\nPoor Little Peppina (1916) is streaming online via The Internet Archive\n\nM'liss (1918) is streaming online via The Internet Archive\n\nM'liss (1918) is streaming online via Amazon Video\n\nThe Pride of the Clan (1917) is streaming online via The Internet Archive\n\nHeart o' the Hills (1919) is streaming online via The Internet Archive\n\nCredit Report\n\nThe Library of Congress has two 35mm prints of a 1968 reissue version of Pickford’s Taming of the Shrew deposited with the U.S. Copyright Office. The sound track on these prints is different than the original 1929 version. Several films exist as incomplete prints: A Timely Repentance, At a Quarter of Two, A Good Little Devil, Less than the Dust, Daddy-Long-Legs, The Hoodlum, Tess of the Storm Country. The author states that there are silent versions of Coquette and The Taming of the Shrew. It is believed that Mary Pickford wrote Their First Misunderstanding (1911), while IMDb credits George Loane Tucker.\n\nCitation\n\nSchmidt, Christel. \"Mary Pickford.\" In Jane Gaines, Radha Vatsal, and Monica Dall’Asta, eds. Women Film Pioneers Project. New York, NY: Columbia University Libraries, 2013. <https://doi.org/10.7916/d8-nkzz-e525>"}, {"url": "https://www.encyclopedia.com/women/encyclopedias-almanacs-transcripts-and-maps/pickford-mary-1893-1979", "page_content": "Pickford, Mary (1893–1979)\n\nCanadian-born film actress and first female studio executive whose ingenue screen persona captivated film audiences in a long series of Cinderella-style stories, many of which she wrote and/or produced. Born Gladys Louise Smith on April 8, 1893, in Toronto, Canada; died on May 29, 1979, in California, of heart disease; eldest of three children of Charlotte and John Smith; married Owen Moore, in 1911 (divorced 1920); married Douglas Fairbanks (an actor), in 1920 (divorced 1933); married Charles \"Buddy\" Rogers (an actor), in 1937; children: (second marriage) one stepson.\n\nBegan touring with a vaudeville company at age five, appeared on Broadway by the time she was 14, and in her first film at 16; became the highest-paid film actress up to that time, exercising nearly total control over her career; was among the four partners who formed United Artists Corporation (UA), a film distributor (1919); found her acting career languishing (mid-1920s) when she was no longer able to convincingly play ingenues and turned to more mature dramatic roles which were not well received; retired from the screen (1933) but remained actively involved in the business of film making into the 1950s; received a special Academy Award for her contributions to the industry (1976).\n\nFilmography:\n\nvarious silent shorts (1909–12); The Unwelcome Guest (1913); In a Bishop's Carriage (1913); Caprice (1913); A Good Little Devil (1914); Hearts Adrift (1914); Tess of the Storm Country (1914); The Eagle's Mate (1914); Such a Little Queen (1914); Behind the Scenes (1914); Cinderella (1914); Mistress Nell (1915); Fanchon the Cricket (1915); The Dawn of a Tomorrow (1915); Little Pal Rags (1915); A Girl of Yesterday (1915); Esmeralda (1915); Madame Butterfly (1915); Poor Little Peppina (1916); The Foundling (1916); The Eternal Grind (1916); Hulda from Holland (1916); Less Than the Dust (1916); The Pride of the Clan (1917); The Poor Little Rich Girl (1917); A Romance of the Redwoods(1917); The Little America (1917); Rebecca of Sunny-brook Farm (1917); The Little Princess (1917); Stella Maris (1918); Amarilly of Clothes-Line Alley (1918); M'Liss (1918); How Could You Jean? (1918); Johanna Enlists (1918); Captain Kidd Jr. (1919); Daddy Long Legs (1919); The Hoodlum (1919); Heart O' the Hills (1919); Pollyanna (1920); Suds (1920); The Love Light (1920); Little Lord Fauntleroy (1920); Through the Back Door (1920); Tess of the Storm Country (remake, 1922); Rosita (1923); Dorothy Verdon of Haddon Hall (1924); Little Annie Rooney (1925); Sparrows (1926); My Best Girl (1927); The Gaucho (1927); Coquette (first sound film, 1929); The Taming of the Shrew (1929); Secrets (1933).\n\nHalfway through the 1976 Academy Award ceremonies, the star-studded proceedings paused for the more subdued presentation of the Academy's annual Lifetime Achievement Award. Its 83-year-old recipient was too ill to accept the award in person and had chosen instead to address the gathering via closed circuit television from her home. The surprise, even shock, was almost audible when the image of an emaciated, pale old woman wearing an ill-fitting wig flickered on the screen, speaking in a voice barely above a whisper. It was difficult to believe that she had at one time been \"America's Sweetheart\" and the film industry's first female studio executive.\n\nMary Pickford's career mirrored the explosive growth of \"the flickers\" during the first 30 years of the century. There was no film industry at all when she was born on April 8, 1893, in Toronto, Canada; and the screen name by which she would be known to millions lay some years in the future. John and Charlotte Smith named their first child Gladys Louise, born shortly after they moved into a working-class neighborhood of Toronto where John had found a job as a printer. Charlotte took in sewing to help support the family. By 1897, Pickford's sister Charlotte and brother Jack, Jr., had arrived. John had managed to save enough from his printing job by then to buy and run his own concession stand on a Lake Ontario ferryboat. One winter's day, late for supper and impatiently waiting for the boat to dock, John tried to jump the last few feet ashore, striking his head on a dangling pulley. He died only hours later of a fractured skull. Pickford was six, Lottie just three, and little Jack barely one year old.\n\nFor the next year, Charlotte and her three children struggled to survive, often depending on food given to them by neighbors. Pickford looked after the younger ones and kept house, while Charlotte tried to earn as much as she could from her sewing. Even when she began letting out rooms in the house to boarders, it was impossible to make ends meet. One of these boarders, a stage manager at a Toronto theater, suggested that she put the young ones to work on the stage, where there was always a demand for children as extras. By September 1898, Pickford had made her stage debut at Toronto's Princess Theater, playing both a girl and a boy in a long-forgotten melodrama, The Silver King. Later, when the same play was presented by another stock company, Charlotte astutely brought Pickford to an audition for the same two parts. She was promptly hired.\n\nPickford loved the theater from the first—the smells, the excitement, the audience's laughter and applause. For her, she said many years later, it was \"an electric impulse, a definite vibration, a palpable bond.\" It was fortunate she took to the theater so naturally, for it rescued her family from destitution. Charlotte protected her children from the less desirable elements of the business and made life as normal for them as possible. \"It was through my mother that I first learned what the term love really means,\" a very grownup Mary Pickford once recalled. \"She diffused love in all directions, as a flower diffused perfume.\"\n\nFor nine years after her first appearance on a stage, Pickford trouped through Eastern Canada, the American Midwest, and the East in a long series of touring productions, many of them written and produced by entrepreneur Harold Reid. Reid took the entire Smith clan under his wing, often casting Charlotte in maid's roles and the two younger children as extras. But it was Pickford as \"Baby Gladys\" that audiences began to remember, especially in sentimental Reid productions like The Little Red Schoolhouse and Ellen Price Wood 's East Lynne. By 1901, the program for a production of East Lynne announced that \"the souvenirs tonight will be of Gladys Smith, the little tot whose work has been so much admired.\"\n\nAlthough the family sometimes had to break up to follow different tour routes, they would usually be reunited for the off-season summers in New York, where many of the circuits ended. At the end of the 1907 season, after 10 years on the road, 15-year-old Pickford wanted a permanent home and all that went with one. \"When I saw the things that other girls had,\" she remembered, \"I determined to have them. I'd have a fur coat one day, and it would be warmer because I had known what it was like to have insufficient wraps.\" While Charlotte took the younger children back to Toronto, Pickford stayed with friends in New York, intent on becoming a famous actress. That meant Broadway; and to many starry-eyed actresses in 1907, Broadway meant David Belasco.\n\nBelasco was one of the last Gilded Age theatrical managers and producers, known for lavish melodramatic productions like The Return of Peter Grimm and Tiger Rose, both of which would eventually be adapted by the upstart film industry. Belasco's style was perfectly suited to Pickford's experience from her road tours, but it took several months of letter-writing and fruitless visits to Belasco's office before the great man agreed to see her. He later admitted to being impressed at the determination shown by the blonde, curly-haired 15-year-old who, when he opened their interview with the rhetorical \"So you want to become an actress?,\" promptly and proudly answered \"I am an actress! I want to become a good one.\" It was Belasco who came up with a more memorable stage name by asking Gladys Smith to recite the names of her family members, stopping her when she mentioned her maternal grandmother, Elizabeth Denny Pickford . When Pickford also mentioned she'd always liked the name Marie, Mary Pickford was born. Mary hastily wired to Charlotte in Toronto: \"Gladys Smith now Mary Pickford. Engaged by David Belasco to appear on Broadway this fall.\"\n\nI have never been a happy woman. It is not my nature. —Mary Pickford\n\nThe play was William De Mille's The Warrens of Virginia. Belasco was apparently satisfied with her work, especially noting that Pickford was the first to arrive and the last to leave rehearsals, even on days when her scenes were not on the schedule. \"She would read and re-read her lines to find out which was the best way to speak them,\" he later remembered. \"She was a very creative and highly intelligent little body.\" His only advice to her was to \"always keep it natural.\" Since she was required at 15 to play a girl of 8, Pickford chose as her model Maude Adams , who as a grown woman was famous for her portrayal of the youthful Peter Pan. Mary learned from Adams that \"the facial muscles of the grownup are controlled, while those of a child only reflect passing moods,\" and that children hardly ever wrinkle their brows, even when surprised or afraid. It was observations like these that would serve her well under the more demanding eye of the camera. The Warrens of Virginia ran for two seasons—the first on Broadway during the winter of 1907–08, and the second on tour starting the following May. Pickford was paid $25 a week on Broadway, and given a $5-a-week raise for the road tour.\n\nAfter the show closed, however, her career as \"a Belasco girl\" seemed to stall, there being no parts for her in any of Belasco's upcoming productions. Charlotte dreaded the thought of going back on the road, with its possibility of splitting up the family yet again, and suggested to Mary that a temporary source of income might be found down on 14th Street, where the American Mutascope and Biograph Company had just turned an old brownstone into a studio for producing moving picture shows. On a winter's day late in 1908, Pickford took the trolley downtown and met the man who would do more for her career than David Belasco ever could.\n\nDavid Wark Griffith was a former actor who would transform what had been a novelty at peep shows and vaudeville halls into a powerful new method of storytelling. Although Biograph was just one of a handful of new companies hastily organized to take advantage of what was thought to be merely a fad, D.W. Griffith was among the first to see its real potential. By the time Mary arrived in the third-floor ballroom that was his makeshift studio, Griffith had been churning out one-reelers for more than a year. Even at this embryonic stage of her film career, Pickford showed a remarkable business sense by demanding, as \"a Belasco actress,\" double the usual $5-a-day salary and a $25-a-week minimum. Griffith agreed. On April 20, 1909, Mary Pickford stepped before the camera for the first time in a one-reel comedy called Her First Biscuits.\n\nThe work was not much to her liking, particularly the lack of rehearsal time and the demands placed on her to produce an emotion in less than ten feet of hand-cranked film. But it was steady work, from nine in the morning to eight at night, six days a week; and she could add to her income by following the example of many others in Griffith's troupe and writing scenarios—$25 for a one-reel story and $50 for a two-reeler. During her first six months with Biograph, she was able to save $1,200—more money than she had ever had at one time in all her years of trouping on the stage. Over time, she grew to appreciate Griffith's genius for intuitive directing. \"We just listened to his voice to get his feeling,\" she remembered. \"[He] devised ways and means of bringing actors out of themselves.\" Even the informal atmosphere of the studio began to appeal to her, especially the attentions of a fellow actor, Owen Moore, much to Charlotte's disapproval. Within three months, the New York Dramatic\n\nMirror specifically mentioned \"an ingenue whose work in Biograph pictures is attracting attention\" in its review of They Would Elope. The anonymity was standard at the time, the film companies fearing that name recognition would inspire their actors to ask for more money. Even fan mail was torn up before it could reach them. Mary was known to the public only as \"Little Mary\" or \"The Girl with the Golden Hair.\" During the summer of 1909, Florence Lawrence (\"The Biograph Girl,\" as the public knew her) was wooed away by another company. Griffith promptly made Mary the new Biograph Girl and the company's leading lady.\n\nIn less than a year, Pickford had appeared in 45 Biograph shorts and could count herself among the first group of motion picture idols, along with Mabel Normand , Harry Carey, and Blanche Sweet . One trade newspaper was sure that the success of Biograph's A Romance of the Western Hills \"is in great measure due to this actress, and this is a particularly fine example of her art.\" But Pickford was shrewd enough to realize that her success lay in playing young girls and innocent sweethearts and that she would never be a great dramatic actress. Typically, she accepted her position and made the most of it. \"I decided … to be a semiprecious stone,\" she said, \"rather than a paste imitation of something more glittering and gorgeous.\"\n\nIn January 1910, Pickford made her first trip with Griffith's troupe to California for two months of work in what was then still a semi-rural backwater not yet called Hollywood. The \"studio lot\" was just that—a vacant lot at the corner of Grand Avenue and Washington Boulevard in what is now the Culver City section of Los Angeles. The entire cast and crew lived in a boarding house nearby. Owen Moore came west with the troupe after being warned by Griffith, who had caught them necking behind some scenery, to treat Mary gently. A year later, back in New York, she and Moore were married secretly to avoid Charlotte's anger, the two of them continuing to live apart until Pickford finally broke down and confessed. Charlotte and Biograph hid the marriage from the public, fearing it would stain Mary's screen persona as the innocent young virgin. There were also rumors that Pickford had suffered a botched abortion which had left her unable to bear children.\n\nWhen Owen resigned from Biograph to join Carl Laemmle's Independent Motion Picture Company (IMP), Mary went with him. (\"Little Mary's an IMP now!\" crowed Laemmle in his advertising.) Pickford's reasons for leaving Griffith were more than romantic, however. Laemmle offered her $175 a week, which Moore jealously noted was more than his own salary. Several months later, Mary broke her contract with IMP, on grounds that she had been a minor when she signed it, and transferred her talents to Majestic Films, this time at an impressive $225 a week. But after only five films, shot in a drafty studio during a particularly cold Chicago winter, Pickford made amends and returned to Biograph in 1911, by which time her asking price had increased several fold. During her absence from Biograph, however, Griffith had discovered Lillian Gish . In 1912, while she was shooting her last film for Biograph, The New York Hat, Pickford cabled David Belasco that she wanted to return to the stage. \"I've been hiding in the pictures,\" she told him.\n\nBelasco immediately cast her as the poor blind girl in his 1913 production of Rostand's The Good Little Devil, which was seen by a former fur seller from Chicago who had the idea of creating a film company that would bring famous plays starring famous stage actors to movie audiences. Adolph Zukor called his company Famous Players. His first production was The Good Little Devil, with Pickford reprising her stage role to such effect that Zukor signed her to a contract for three pictures over fourteen weeks at a salary of $500 per week. For Zukor, Pickford appeared in The Bishop's Carriage, Caprice, and Uncle Tom's Cabin. By 1914, Zukor had signed her to a full year's contract, at $1,000 a week, and Pickford had announced her formal retirement from the stage. \"I'm in the movies for money,\" she bluntly told Photoplay. \"In … three years and eight months [in motion picture work], I was laid off only four weeks.\" That same year, she starred in what everyone agreed was her finest picture to date, Tess of the Storm Country, although privately Mary disliked the movie. In one-sheets promoting Tess, Famous Players billed her by name as \"American's foremost film actress.\"\n\nOver the next six years, Pickford starred in some of the most famous silents of the early cinema, such as Poor Little Rich Girl, Rebecca of Sunnybrook Farm, Suds, and The Little American. Along the way, Zukor merged his company with Jesse Lasky's Feature Play Company to form Famous Players Lasky, while Pickford's salary went from Zukor's initial $500 per week in 1914 to an astounding $10,000 per week in 1916. The two-year contract she signed that year was a model of shrewd negotiating based on her new-found star power, for it included clauses giving her 50% of the net receipts of each of her films, with a guaranteed minimum of $1 million, and complete creative control over her productions, from writers to directors to casting. The studio was legally obligated to provide her with a secretary and a press agent, along with \"parlour class accommodation\" on her frequent cross-country train trips between New York and Los Angeles. Like the film industry itself, Mary Pickford was growing up.\n\nOther actors were building star careers, too. Among them was Douglas Fairbanks, the dashing hero of such action films as The Three Musketeers and The Thief of Baghdad. Pickford and Fairbanks, who was also married, met frequently at social functions and premieres starting in 1914. By 1916, the two had become lovers, often meeting in secret at a house owned by Fairbanks' brother in the Hollywood Hills. But word was bound to leak out. Charlotte, who had tried to prevent Mary's marriage to Owen Moore, was now equally horrified at the possibility of a very public divorce; Moore himself, his career long eclipsed by that of his wife, began drinking to excess. In 1918, with the affair filling the newspapers, Fairbanks' wife Beth named Mary in public as her husband's paramour and demanded she step forward and admit it. Pickford called a conference with two friends, scriptwriter Frances Marion and journalist Adela Rogers St. Johns , to decide if her career could survive the scandal. Both of them assured her it would, for Mary's public was as much in love with her, they pointed out, as she was with Fairbanks. \"More than anything else I had wanted desperately to be approved of,\" Pickford wrote many years later, \"and that approval Douglas gave me. I had never believed anybody would speak of me, and to me, as he did.\" In 1919, Pickford began divorce proceedings in Nevada against Owen Moore, giving him $100,000 to hasten the proceedings; while Fair-banks gently persuaded his wife Beth to take similar action against him, citing \"an unknown woman\" as the cause of the separation. On March 28, 1920, little more than two weeks after her divorce from Moore became final, Pickford married Fairbanks at a private ceremony in Fairbanks' Hollywood home. As a wedding present, Fairbanks bought a rambling, rustic hunters' lodge in Benedict Canyon and remodeled it into a 22-room Tudor mansion he and Mary dubbed \"Pickfair,\" which became a social center for much of Hollywood's artistic elite for the next two decades.\n\nTo add to the turmoil of this period, Pick-ford's long-standing argument with Zukor over \"block-booking\" of her films reached a critical point. It was Zukor's practice to lure theaters into booking a package of less successful films by using a Mary Pickford picture as bait; without taking the whole package, theaters couldn't have Pickford's film—a practice Mary, and others in similar situations at other studios, felt cheapened the value of their work. In 1918, she refused to renew her contract with Zukor and signed instead with First National Pictures, at a salary of $750,000. In return for the lower salary, First National agreed to book her films separately from any others and, more important, gave Pickford the right to set up her own film company—The Mary Pickford Company—with Mary as its creative head and Charlotte as its business manager. (With her financial acumen, Charlotte had invested most of Mary's earnings safely and wisely, a practice that would see Pickford comfortably through the Depression when other Hollywood stars lost their fortunes.) A year after her signing with First National, however, rumors began spreading that First National and Famous Players would merge to form a virtual monopoly controlling the production and distribution of filmed entertainment. The result of the merger was Paramount Pictures; the answer to it from Pickford and three other key creative Hollywood personalities was United Artists.\n\nThe formidable combination of Mary Pickford, Douglas Fairbanks, Charlie Chaplin, and Pickford's old friend D.W. Griffith was in the form of an independent distribution company, the stock of which was not released to each partner until the required number of films, produced at each partner's expense, had been delivered. It was a direct challenge to the near total control the studios held over the choice, production, and distribution of an artist's work. \"The satisfaction was in one word: freedom,\" wrote Pickford. \"It's a heady wine, and having tasted it you find it impossible to go back working for someone else.\" She delivered the first of her required three films a year, via her own company, in the form of her 1920 adaptation of Eleanor Porter 's Pollyanna, which grossed well over $1 million worldwide. But there were problems with United Artists from the start. Charlie Chaplin, always meticulous about his films, didn't deliver a movie until 1923's A Woman of Paris, which fared badly at the box office and earned him Pickford's deepening displeasure as the years passed. Griffith, who brought the company some $8 million with his pictures in its first three years, was repeatedly rebuffed in his requests for production advances to complete his films, and left the company in 1924 to sign with Paramount. Efforts to increase United Artists' product by contracting films out to independent producers resulted in a string of financially unsuccessful pictures; and all the partners, including Pickford, repeatedly \"roadshowed\" their own films by renting a theater and opening a picture at their own expense, keeping all the revenue generated for themselves and dulling the market for the picture when it was handed over to UA.\n\nBut Pickford's films released during this period are among her best remembered—especially the adaptation of Frances Hodgson Burnett 's Little Lord Fauntleroy, in which Mary played both the title role and that of the child's mother, and a remake of her earlier Tess of the Storm Country. She stuck to her money-making formula of playing the working-class sweetheart beset by adversity who triumphs in the end, although by 1927's My Best Girl critics were hinting that it might be time for a 35-year-old woman to stop playing 18-year-old girls. As if to emphasize the need for a change, the industry's first talking film, The Jazz Singer, took the country by storm. My Best Girl would prove to be Pickford's last silent picture, as well as her last appearance as a sweet young thing. On June 21, 1928, Pickford walked into a fashionable beauty salon on New York's East 57th Street and walked out two hours later with the short, bobbed, heavily lacquered hair of a Jazz Age flapper. Two months later, she began work on her first \"talkie,\" in her first adult role.\n\nCoquette was little more than a stiffly photographed version of a popular Broadway play of the time, the camera tethered to its new, immobile sound apparatus and separated from the actors by a windowed, soundproof wall. Pickford was convinced the public would never accept the sound of her voice (\"That's not me!\" she protested on hearing herself for the first time. \"It's impossible!\"), and she had gone through two directors and two sound technicians before the picture was released to great acclaim in April 1929. It grossed nearly $1.5 million during its run and earned Pickford the Academy's Best Actress award at its second annual ceremony. But Coquette would prove to be her last successful picture. Her only screen appearance with her husband, in a 1929 film adaptation of The Taming of the Shrew, made only a modest profit, while Pickford herself shut down production on her next effort, Forever Yours, commenting later that it was \"the most stupid thing I ever saw, including me.\" She completed and released the film later under a new title, Secrets, but it still lost $100,000 at the box office.\n\nFairbanks' films were faring no better. Friends noted that he seemed to have lost interest in his screen career and was spending long periods of time away from Pickford, traveling around Europe on the pretense of making a travelogue while carrying on an affair with a former \"chorus girl\" from England. Pickford, too, had indulged in a series of amours, the longest running of which was with actor Buddy Rogers, who had played opposite her in My Best Girl. Rumors that her marriage was in trouble became so widespread that Mary was forced to answer Photoplay's inquiry in 1931 by saying, \"I cannot deny there may be a separation. I can only say there is none now.\" In June 1933, however, Pickford and Fairbanks were, indeed, legally separated. That same year, Mary officially announced her retirement from the screen and, for nearly a year, rarely left the isolation of Pickfair.\n\nShe briefly emerged in 1934 in a stage production of Alice in Wonderland (for which journalist Edmund Wilson claimed she had had a facelift) and in a weekly series of radio dramas which were indifferently received, as was a chat show replacement, \"Party at Pickfair.\" Two spiritually inclined books, Why Not Try God and My Rendezvous with Life, along with the novel Demi-Widow—all ghostwritten from Pickford's notes—appeared in 1934 and 1935. But it was the film business that kept beckoning. \"Let no one tell you they don't miss their career,\" she once wrote. \"I miss it terribly. It's a constant ache with me.\" One solution was to form a new film company in partnership with Jesse Lasky, the Pickford Lasky Production Company, which released two unsuccessful pictures through UA in 1935 before being disbanded.\n\nIn June 1937, Pickford announced her third marriage, to Buddy Rogers, who had abandoned his sporadic acting career to form a band. Mary accompanied Buddy and his group on their road tours, and it was during a stop in Chicago that she received the news that Douglas Fairbanks had died. \"My darling is gone,\" she was heard to whisper, for she and Fairbanks had remained close even after their separation. Gone with him was Pickford's most enduring link to the old, heady days of a Hollywood just discovering itself.\n\nFrom now on, the public saw or heard Mary Pickford only in bond drives during the war years or in occasional guest spots on national radio. But Hollywood's business community heard from her often, for she continued to take a direct hand in the increasingly troubled affairs of United Artists. Throughout the 1940s and 1950s, with Pickford and Chaplin the only remaining partners, UA slid precariously closer to bankruptcy. Their continuing rift over business practices which had always been mediated by Fairbanks now grew wider. Pickford accused Chaplin of using United Artists as a private banking account for his infrequent films, while Chaplin complained that she was dictatorial and trying to force him out. A series of disastrous deals with outside producers resulted in ruinously expensive lawsuits and no new product. The ill feeling reached its nadir when Pickford allowed herself to be interviewed by the FBI during the McCarthy era, Chaplin being suspected at the time of Communist sympathies and eventually forced to flee the country. He never forgave her.\n\nHalfway through 1949, UA had already hemorrhaged $400 million and was on the brink of bankruptcy. It was saved by a group of investors to whom Pickford signed over control of the company in 1951 and to whom she sold her remaining shares for around $3 million. She took some satisfaction from the fact that Chaplin had done the same, a year earlier, for little more than $1 million. (United Artists survived and even prospered under its new leadership and became part of MGM/UA Enterprises in 1981.) With the last vestige of her most productive period now gone, Pickford lived quietly and in increasing obscurity at Pickfair. Director Billy Wilder considered her for the part of Norma Desmond in his Sunset Boulevard, but after he realized that he could not bear to show \"America's Sweetheart\" as a faded, delusional movie star, the part went to Gloria Swanson .\n\nA lawyer who visited Pickford in the late 1950s described her as \"a lovely person, but sad in some respects. Hollywood had sort of passed her by. She knew it, and didn't like it.\" Her name was kept alive through her generous donations to the Motion Picture Country Home and Hospital for indigent and retired entertainers, and by the announcement that she had given those of her films which survived, some 50 titles from her Biograph and Famous Players days, to the American Film Institute. Most of her remaining films shot on fragile nitrate stock had deteriorated beyond repair.\n\nIn a rare interview given in 1970, Pickford admitted that the film world had changed to such an extent that she knew she could never go back. \"Making movies was fun,\" she said of her early days, \"[but] there is not much fun today when one mistake can be fatal. In the old days, a star was loved through good, bad, and indifferent pictures. Today, three bad pictures and a star is finished.\" She hinted, too, that her memories were too fragile to withstand the brutal business of modern-day film making. \"I think illusions are so important,\" she said. \"That's why I haven't gone back to pictures.\"\n\nMary did not disclose that she had been diagnosed with advanced heart disease and that her strength was leaving her. Even so, on the night her frail image appeared before the Academy Award audience, she rallied sufficiently to request the camera crew to shoot only her left side so that the slight bump on her nose which had vexed lighting directors in the old days would not be apparent.\n\nAmong the last to see her was her stepson, Douglas Fairbanks, Jr., who was a frequent visitor to Pickfair after his father's death. \"She would be talking,\" he once reported, \"and I would suddenly realize that she thought I was my father. It was at those times that I realized that she always remained in love with him.\" On May 29, 1979, Mary Pickford died peacefully at a Santa Monica hospital, after lapsing into a coma at home.\n\nAt the Academy tribute held five months after her death, Douglas Fairbanks, Jr., reminded the audience that Pickford's great contribution to the industry had been her guardianship of creative rights. \"It was her idea,\" he said, \"that artists who created their own works from the beginning … should have the rewards due to them.\" But for Pickford, there was something even more precious. She recounted in her autobiography a visit to her native Toronto in 1944 during which she appeared before a group of adoring Air Force cadets about to go off to war. \"It is good to have lived to know that after so many years off the screen,\" she wrote, \"there were young men who could still pay me the sweetest and most gallant compliment of all—to ask me to be called their collective sweetheart.\"\n\nsources:\n\nEyman, Scott. Mary Pickford: America's Sweetheart. NY: Donald Fine, 1990.\n\nKatz, Ephraim. The Film Encyclopedia. 2nd ed. NY: HarperCollins, 1994.\n\nPickford, Mary. Sunshine and Shadow. NY: Doubleday, 1955.\n\nsuggested reading:\n\nWhitfield, Eileen. Pickford: The Woman Who Made Hollywood. KY: University of Kentucky Press, 1997.\n\nNorman Powers , writer-producer, Chelsea Lane Productions, New York, New York"}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/pickford-buddy-rogers-mary-pickford-and-their-children/", "page_content": "When Mary PIckford's marriage to Douglas Fairbanks fell apart, she increasingly turned to her friend and former co-star Buddy Rogers for support. He proposed to her and they married in 1937. Rogers was a handsome actor and musician. While some critics speculated that he was after Pickford's fame and fortune, his affection for her was widely acknowledged.\n\nCourtesy: Edward Magenknecht\n\nMidwestern Boy\n\nBorn in 1904, Charles \"Buddy\" Rogers was raised by an active, wholesome family in Olathe, Kansas. He was boyishly good-looking and musically talented. At the University of Kansas, he played several instruments and conducted a jazz band. When his father submitted his son's photo to a film company talent search in 1925, Rogers was selected as a finalist. Soon he went to New York for training.\n\nMy Best Girl\n\nRogers starred in a couple of films before landing a major role in Wings (1927). The film, an epic for its time, featured sequences of dogfights and collisions shot from the air. The role positioned Rogers to get the part of Joe Grant in a light romantic comedy, My Best Girl (1927) -- where he met Mary Pickford. In the love scenes, it was plain to everyone that the two had chemistry.\n\nA True Showman\n\nHis good looks and charm earned Rogers the nickname, \"America's Boyfriend.\" People loved him in romantic comedies, but his acting career faltered when he was cast in second-rate films. Rogers turned back to music, and with Pickford's help he organized an orchestra, the California Cavaliers. The Cavaliers played jazz versions of the day's popular hits. Rogers was a true showman, and though not the most talented musician, he entertained with a broad smile and engaging personality.\n\nParenthood\n\nPickford had always pictured herself becoming a mother. She had wanted to adopt a child with Fairbanks, in fact, but the marriage ended with no children. Six years after she and Buddy were married, Pickford, at age 51, realized that she was running out of time. The couple visited an orphanage, where a six-year-old boy dressed impeccably in a suit enchanted them. After a day spent entertaining the boy, Pickford was enamored with him. She and Rogers officially adopted Ronald \"Ronnie\" Charles Rogers in 1943.\n\nMary Pickford Library\n\nA Little Girl\n\nLess than a year after Ronnie joined the family, Pickford was back at the orphanage, marveling over babies. She was taken with a dark-haired girl with a bright countenance. \"More than I ever wanted anything in my life, I wanted that baby,\" Pickford would say. The impatient mother could hardly wait the few weeks it took to process the adoption papers. When the adoption was approved, she raced to pick up the child, Roxanne, and drove home in a frenzy. She had not even told Buddy, who was serving as a lieutenant in the Air Force, about the infant's arrival. In her excitement she had also failed to acquire all of the necessities for a baby's comfort, revealing her shortcomings as a parent.\n\nGrowing up at Pickfair\n\nThe children's life in a Hollywood mansion was not normal. \"It was so big,\" Ronnie would remember, \"you needed a road map to find the bathroom. I was in awe, but they told me I was going to be living there.\" Pickford and Rogers treated the children like theatrical props, sending them to boarding schools and posing them in family photographs when they were home on visits. Pickford became critical of their physical imperfections, including Ronnie's small stature and Roxanne's crooked teeth. Both children would later remark that their mother was too self-interested to provide genuine maternal love.\n\nOut of Sight\n\nAs Ronnie entered adolescence, he became cold and surly towards his mother. His sister grew rebellious. Both children married in their late teens, and Ronnie became so troubled that he once attempted suicide. Pickford went to see him in the hospital, complaining that he had interrupted a well-needed rest she was taking. It was at this point that the children faded from the public eye. Pickford and Rogers stopped talking about them and their friends stopped asking.\n\nDeprived\n\nJournalists reported that Roxanne and Ron worked odd jobs in the 1970s, and both lacked money. Devoted Pickford followers wondered why the children of a wealthy Hollywood icon should be financially deprived. After Pickford's death, their financial straits did not improve. Pickford's original will had granted each child $15,000, which she upped to $50,000 before she died. But the actual amounts they received from the estate were significantly smaller, according to Ronnie. Still, he had kind words for Mary Pickford. \"I miss my mother,\" he would say in 2003. \"Things didn't work out that much. You know. But I'll never forget her. I think that she was a good woman.\""}, {"url": "https://www.history.com/this-day-in-history/pickford-and-fairbanks-mobbed-by-crowds", "page_content": "Swarms of admirers mob the Hollywood film actors Mary Pickford and Douglas Fairbanks, who arrive in London on their honeymoon on June 21, 1920. Two of film’s earliest stars, Pickford and Fairbanks had been business partners since 1919, when they teamed up with Charlie Chaplin and director D.W. Griffith to form United Artists. As a wedding present for Pickford, Fairbanks bought an estate boasting 22 rooms and Beverly Hills’ first swimming pool. The couple dubbed the sprawling property “Pickfair.”\n\nThe couple had married in March 1920, just three-and-a-half weeks after Pickford’s divorce from her first husband, Owen Moore. On June 12, they left New York on the Red Star cruise liner Lapland for a much-delayed honeymoon in Europe. As reported in the New York Times: “Arriving in London, the pair were ‘mobbed’ to such an extent that they had to spend one week-end at Lord Northcliffes’ place in the Isle of Thanet and another at one of the country seats of the Duke of Sutherland.” According to the Times, Fairbanks bought an “Italian fast car” in Switzerland and hired a chauffeur to ferry him and his wife through Europe; during their trip, they visited the ex-Kaiser Wilhelm of Germany and were honored at a dinner in Paris attended by 200 of France’s most prominent actors.\n\nPickford was born Gladys Smith in 1893. Her father, a laborer, was killed on the job when she was five years old. She helped support her mother and two younger siblings with her vaudeville act, which she performed as “Baby Gladys.” At age 14, she won a lead role on Broadway and adopted her stage name, Mary Pickford. Two years later, she signed with Biograph for $40 a week. Pickford appeared in many silent films, starting with The Violin Maker of Cremona, Her First Biscuits and more than a dozen other films in 1909, working at a similar pace over the next few years. Her golden curls soon won her attention from movie audiences, even though at the time studios did not release actors’ names, for fear that celebrity would drive up their wages.\n\nA shrewd negotiator, Pickford hopped from studio to studio, boosting her salary each time, and she was soon billed by name. At age 18, she married her first husband, Owen Moore. By 1912, she was earning $500 a week at Adolph Zukor’s Famous Players Company. Four years later, her salary had grown to $10,000 a week, with a $300,000 bonus, plus her own production company, The Mary Pickford Co. Pickford exercised veto power over her films and had her pick of scripts, directors and co-stars. She typically played young, innocent girls but occasionally branched out: In 1929, she cut her trademark curls and played a flapper in the talkie Coquette, for which she won an Oscar.\n\nFairbanks was born in Denver in 1883 and began appearing on stage in 1901. He married his first wife, Anna Beth Sully, in 1907 and had one son, Douglas Fairbanks Jr., but the marriage ended in divorce. By 1915, he had switched to the fledgling film industry, where he was regularly cast as a swashbuckling hero. His films included The Three Musketeers (1921), Robin Hood (1922) and The Thief of Bagdad (1924). Unlike many other early stars, Fairbanks successfully made the transition to sound, but his career faded as he aged, and he appeared in his last film in 1934. For his part, Douglas Fairbanks Jr. became a leading man in films of the late 1930s and 1940s, playing roles similar to those of his father.\n\nPickford retired from acting in 1933 but continued to be a powerful movie producer and influential Hollywood force for many years. She and Fairbanks divorced in 1936; he died three years later, at the age of 56. Pickford remained a partner in United Artists until 1953. In 1975, she received a special Oscar for her contributions to American film. She died in 1979 at the age of 87."}], "Robert Emmett Keane and Mary Pickford divorced in 1933.": [{"url": "https://www.history.com/this-day-in-history/pickford-and-fairbanks-mobbed-by-crowds", "page_content": "Swarms of admirers mob the Hollywood film actors Mary Pickford and Douglas Fairbanks, who arrive in London on their honeymoon on June 21, 1920. Two of film’s earliest stars, Pickford and Fairbanks had been business partners since 1919, when they teamed up with Charlie Chaplin and director D.W. Griffith to form United Artists. As a wedding present for Pickford, Fairbanks bought an estate boasting 22 rooms and Beverly Hills’ first swimming pool. The couple dubbed the sprawling property “Pickfair.”\n\nThe couple had married in March 1920, just three-and-a-half weeks after Pickford’s divorce from her first husband, Owen Moore. On June 12, they left New York on the Red Star cruise liner Lapland for a much-delayed honeymoon in Europe. As reported in the New York Times: “Arriving in London, the pair were ‘mobbed’ to such an extent that they had to spend one week-end at Lord Northcliffes’ place in the Isle of Thanet and another at one of the country seats of the Duke of Sutherland.” According to the Times, Fairbanks bought an “Italian fast car” in Switzerland and hired a chauffeur to ferry him and his wife through Europe; during their trip, they visited the ex-Kaiser Wilhelm of Germany and were honored at a dinner in Paris attended by 200 of France’s most prominent actors.\n\nPickford was born Gladys Smith in 1893. Her father, a laborer, was killed on the job when she was five years old. She helped support her mother and two younger siblings with her vaudeville act, which she performed as “Baby Gladys.” At age 14, she won a lead role on Broadway and adopted her stage name, Mary Pickford. Two years later, she signed with Biograph for $40 a week. Pickford appeared in many silent films, starting with The Violin Maker of Cremona, Her First Biscuits and more than a dozen other films in 1909, working at a similar pace over the next few years. Her golden curls soon won her attention from movie audiences, even though at the time studios did not release actors’ names, for fear that celebrity would drive up their wages.\n\nA shrewd negotiator, Pickford hopped from studio to studio, boosting her salary each time, and she was soon billed by name. At age 18, she married her first husband, Owen Moore. By 1912, she was earning $500 a week at Adolph Zukor’s Famous Players Company. Four years later, her salary had grown to $10,000 a week, with a $300,000 bonus, plus her own production company, The Mary Pickford Co. Pickford exercised veto power over her films and had her pick of scripts, directors and co-stars. She typically played young, innocent girls but occasionally branched out: In 1929, she cut her trademark curls and played a flapper in the talkie Coquette, for which she won an Oscar.\n\nFairbanks was born in Denver in 1883 and began appearing on stage in 1901. He married his first wife, Anna Beth Sully, in 1907 and had one son, Douglas Fairbanks Jr., but the marriage ended in divorce. By 1915, he had switched to the fledgling film industry, where he was regularly cast as a swashbuckling hero. His films included The Three Musketeers (1921), Robin Hood (1922) and The Thief of Bagdad (1924). Unlike many other early stars, Fairbanks successfully made the transition to sound, but his career faded as he aged, and he appeared in his last film in 1934. For his part, Douglas Fairbanks Jr. became a leading man in films of the late 1930s and 1940s, playing roles similar to those of his father.\n\nPickford retired from acting in 1933 but continued to be a powerful movie producer and influential Hollywood force for many years. She and Fairbanks divorced in 1936; he died three years later, at the age of 56. Pickford remained a partner in United Artists until 1953. In 1975, she received a special Oscar for her contributions to American film. She died in 1979 at the age of 87."}, {"url": "https://wfpp.columbia.edu/pioneer/ccp-mary-pickford/", "page_content": "by Christel Schmidt Mary Pickford was born Gladys Smith in 1892 in Toronto, Canada. After her father was killed in an accident, Gladys became the family’s main breadwinner by performing in the theatre. She was seven years old. In fact, the stage became a family venture, as her younger siblings Lottie and Jack and even her mother took up the trade. But the drive and determination to be a star belonged solely to Gladys. In 1907, her ambition would take her to Broadway and famed producer-director David Belasco, who changed her name to Mary Pickford and gave her a part in “The Warrens of Virginia.” In 1909, when Pickford was between stage engagements, she approached director D. W. Griffith at the Biograph Company in New York and asked for work in moving pictures. She had no intention of working permanently in the new medium, but hoped the income would tide her over before she went back to Belasco and the stage. Pickford was intrigued with film acting, and before long she began to enjoy “posing” for motion pictures. She stayed with the Biograph Company, working as both an actress and writer from 1909 to 1911, leaving for a brief stint with the Independent Motion Picture Company (IMP), and later with Majestic Pictures Corporation. She returned to Griffith at Biograph in early 1912, finishing out the year with him. In 1913, after a run on Broadway in “A Good Little Devil,” Pickford made a definitive break from the stage by signing a motion picture contract with Adolph Zukor and the Famous Players Film Company. The year 1913 marked the dawn of the feature motion picture, and Pickford was about to become its biggest star. In fact, she came to feature films with a well-established legacy. In 1911, “Moving Picture Mary” was the first movie star to adorn the cover of the New York Dramatic Mirror, an honor previously bestowed only on theatrical stars. And because moviegoers had already singled Pickford out as a favorite, her success in features was guaranteed. In 1914, Pickford’s Tess of the Storm Country, the story of a fiery young woman fighting for the underclass, caused a sensation. The extraordinary reaction made Pickford an international star and created fan worship that had never before been witnessed. In turn, this success gave Mary Pickford incredible bargaining power. In 1916, Pickford had negotiated a contract that gave her a $10,000 a week salary, 50% of her film profits, and her own production company. Pickford would sign off on every aspect of her productions, from the script to the director. She was even known to have had a hand in editing. During these years she worked with directors Maurice Tourneur and Marshall Neilan, the writer Frances Marion, and made some of the best features of her career, including Poor Little Rich Girl (1917), Stella Maris (1918), and The Hoodlum (1919). Pickford is often remembered for her portrayals of children in films including Rebecca of Sunnybrook Farm (1917) and Daddy-Long-Legs (1919). The stories were adapted from popular novels and had been performed on stage with an adult actress (Edith Taliaferro and Ruth Chatterton) playing the role of a young girl. Pickford’s petite size and youthful beauty made her ideal for these parts, but it was her acting talent that seared these roles into the public consciousness. Her portrait of childhood captured both the simplicity and complexity of a young person’s inner world, and also its physicality, through body language and mannerism. In 1919, when she was only twenty-seven years old, Pickford cofounded United Artists, the first independent film distribution company, along with Charlie Chaplin, D. W. Griffith, and her future husband Douglas Fairbanks. Then in 1920 she and Fairbanks were wed in a private ceremony, but they shared their married life with the world. At first, the couple had feared a negative reaction (both were already married when they met), but their union only fed into the romantic fantasies many fans had about Hollywood. The couple was mobbed at every port on their whirlwind European honeymoon. Back in California, they relished their place as the King and Queen of Hollywood, holding court at their home, known as Pickfair. Pickford decided to make only one film a year after 1921, focusing on the quality of her productions. Many believe that she was at her creative peak during the teens, but her films of the 1920s were the most successful. Favorite titles from this decade include a remake of Tess of the Storm Country (1922), Rosita (1923), and Sparrows (1926). Her last silent film, My Best Girl (1927), would be one of the greatest of the era. The decade’s last year brought about major changes in the industry and for Mary Pickford. By 1929, the Talkies had all but obliterated silent film. Pickford knew she could not resist the change. She cut her old-fashioned curls and made two Talkies before the decade ended. Coquette (1929) won her an Oscar for best actress, and Taming of the Shrew (1929) featured the much-anticipated pairing of Pickford and Fairbanks. But even with good reviews and promotion, these films were not as successful as her silent pictures. She attempted two more sound features, then retired in 1933 after twenty-three years of making movies. And though she kept on producing films after retiring, the experience was not as rich as running her own career had been. Pickford, whose professional decline had begun in the same year as the death of her beloved mother, Gladys, in 1928, saw her brother and sister die in the 1930s. In 1936, her fairytale marriage to Fairbanks ended in divorce. Fairbanks died of heart failure only three years later. In 1937, Pickford married actor Charles “Buddy” Rogers, her costar in My Best Girl. The marriage lasted until Mary Pickford’s death in 1979. See also: Frances Marion\n\nBibliography\n\nBennett, Carl. “Mary Pickford Filmography.” Silent Era: Progressive Silent Film List. http://www.silentera.com/PSFL/filmographies/actresses/Pickford-Mary.html\n\nCard, James. “The Films of Mary Pickford.” Image: The Journal of the George Eastman House. Vol. 8, No. 4 (Dec 1959): 172-191.\n\nEyman, Scott. Mary Pickford, America’s Sweetheart. New York: Donald I. Fine, Inc., 1990.\n\nMoore, Robert F. “Mary Pickford, Manager.” Motion Picture Magazine (Aug. 1917): 69-70.\n\n“Nineteen Weeks for 'Daddy Long Legs' at Boston Theatre.” Motion Picture News (8 Nov. 1919): 3592.\n\nNiver, Kemp. Mary Pickford: Comedienne. Los Angeles: Artisan Press, 1969.\n\nPickford, Mary. “Ambassadors.” The Saturday Evening Post. August 23, 1930: 6-7, 117.\n\n------. “Moving Pictures.” Mary Pickford: Daily Talks. The McClure Newspaper Syndicate (7 Dec. 1915): n.p.\n\n------. Sunshine and Shadow. Garden City, NY: Doubleday, 1955.\n\n------. “Writing Scenarios.” Mary Pickford Daily Talks. The McClure Newspaper Syndicate (7 Dec. 1915): n.p.\n\nSchmidt, Christel. “Preserving Pickford: The Mary Pickford Collection and the Library of Congress.” The Moving Image Journal vol. 3, no. 1 (2003): 59-81.\n\n------. “The Search for a Film Legacy: Mary Pickford (1909-1933).” [online resource] (2010) http://pickfordfilmlegacy.tripod.com/\n\nSlide, Anthony. The Griffith Actresses. New York: A. S. Barnes and Company, 1973.\n\nWagenknecht, Edward. Movies in the Age of Innocence. Norman: University of Oklamoma Press, 1962.\n\nWhitfield, Eileen. Pickford: The Woman Who Made Hollywood. Lexington: The University of Kentucky Press, 1997.\n\nWindeler, Robert. Sweetheart: The Story of Mary Pickford. New York: Preager Publishers, 1973.\n\nZukor, Adolph with Dale Kramer. The Public Is Never Wrong. New York, G.P. Putnum’s Sons, 1953.\n\nArchival Paper Collections:\n\nLillian Gish papers and sound recordings, 1909-1992. New York Public Library, Billy Rose Theatre Division.\n\nMary Pickford papers, 1893-1983. Academy of Motion Picture Arts and Sciences, Margaret Herrick Library.\n\nMary Pickford scrapbook, Robinson Locke collection, 1870-1920. New York Public Library, Billy Rose Theatre Division.\n\nReminiscences of Mary Pickford. Columbia University, Rare Book and Manuscript Library.\n\nSamuel Stark. Theatre scrapbook collection, 1860-1950. Stanford University.\n\nRob Wagner papers, 1925-1942. University of California, Los Angles, Charles E. Young Research Library.\n\nUnited Artists Corporation Collection. Wisconsin Historical Society Library.\n\nFilmography\n\nA. Archival Filmography: Extant Film Titles:\n\n1. Mary Pickford as Actress\n\n\"1776\" or, The Hessian Renegades. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nThe Broken Locket. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Frank Powell, Kate Bruce, Arthur Johnson, si, b&w. Archive: Library of Congress.\n\nThe Cardinal's Conspiracy. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Frank Powell, Arthur Johnson, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Country Doctor. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Frank Powell, Kate Bruce, Gladys Egan, si, b&w. Archive: George Eastman Museum, Museum of Modern Art, Library of Congress, Cinémathèque Royale de Belgique, Národní Filmov Archiv.\n\nThe Faded Lilies. Dir. D.W. Griffith (Biograph Co. US 1909) cas.: Mary Picford, David Miles, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Gibson Goddess. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Mack Sennett, George Nichols, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Heart of An Outlaw. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Marion Leonard, Henry B. Walthall, si, b&w. Archive: Museum of Modern Art.\n\nHer First Biscuits. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, John R. Cumpson, Arthur Johnson, si, b&w. Archive: Library of Congress.\n\nHis Duty. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Kate Bruce, Owen Moore, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nHis Lost Love. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Owen Moore, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nHis Wife's Visitor. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, Frank Powell, James Kirkwood, si, b&w. Archive: Library of Congress.\n\nThe Indian Runner's Romance. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Owen Moore, Arthur Johnson, si, b&w. Archive: Library of Congress.\n\nIn Old Kentucky. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Henry B. Walthall, Kate Bruce, Verner Clarges, si, b&w. Archive: Library of Congress.\n\nIn the Watches of the Night. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, George Nichols, Gladys Egan, Marion Leonard, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Light That Came. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Ruth Hart, Marion Leonard, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nLines of White in a Sullen Sea. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Linda Arvidson, James Kirkwood, George Nichols, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Little Teacher. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Kate Bruce, Edward Dillon, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nThe Lonely Villa. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Gladys Egan, Adele DeGarde, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nA Midnight Adventure. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, Kate Bruce, Mack Sennett, si, b&w. Archive: Library of Congress.\n\nThe Mountaineer's Honor. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Owen Moore, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Necklace. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Arthur Johnson, Frank Powell, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nOh, Uncle. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, James Kirkwood, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Peachbasket Hat Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, John R. Cumpson, Anita Hendrie, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Restoration. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Owen Moore, James Kirkwood, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Renunciation. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Billy Quirk, Harry Solter, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nThe Sealed Room. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, Henry B. Walthall, Arthur Johnson, si, b&w. Archive: Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Seventh Day. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Rose King, Frank Powell, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Slave. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Harry Solter, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Son's Return. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Anita Hendrie, Billy Quirk, Herbert Prior, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nSweet and Twenty. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, James Kirkwood, Florence Lawrence, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nTender Hearts. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, James Kirkwood, Frank Powell, Lottie Pickford, si, b&w. Archive: Museum of Modern Art.\n\nThe Test. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, Marion Leonard, Arthur Johnson, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThey Would Elope. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, James Kirkwood, Kate Bruce, si, b&w. Archive: Library of Congress.\n\nThrough the Breakers. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, James Kirkwood, Adele DeGarde, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nTo Save Her Soul. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, George Nichols, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Trick That Failed. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Mack Sennett, Billy Quirk, si, b&w. Archive: Library of Congress.\n\nTwo Memories Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Marion Leonard, David Miles, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Violin Maker of Cremona. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, David Miles, Owen Moore, Herbert Prior, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nThe Way of Man. Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Florence Lawrence, Arthur Johnson, Gladys Egan, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nWhat's Your Hurry? Dir.: D.W. Griffith (Biograph Co. US 1909) cas.: Mary Pickford, Billy Quirk, George Nichols, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nAll On Account of the Milk. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Blanche Sweet, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nAn Arcadian Maid. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Mack Sennett, Kate Bruce, George Nichols, si, b&w. Archive: BFI National Archive, Library of Congress, UCLA Film & Television Archive.\n\nAs It Is In Life. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, George Nichols, Gladys Egan, Mack Sennett, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Call To Arms. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Narion Leonard, Joseph Graybill, si, b&w. Archive: Library of Congress.\n\nA Child's Impulse. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Vivian Prescott, Charles West, Joseph Graybill, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Decree of Destiny. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Joseph Graybill, Marion Sunshine, Clara Bracey, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Englishman and the Girl. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, George Nichols, Charles Craig, Kate Bruce, si, b&w. Archive: Library of Congress.\n\nA Gold Necklace. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Kate Bruce, Lottie Pickford, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nIn the Season of Buds. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Mack Sennett, Charles West, Kate Bruce, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Italian Barber. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Joseph Graybill, Marion Sunshine, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nLove Among the Roses. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Marion Leonard, Arthur Johnson, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nA Lucky Toothache. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Mack Sennett, Edward Dillon, Charles West, si, b&w. Archive: Library of Congress.\n\nMaid or Man. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Owen Moore, si, b&w. Archive: Museum of Modern Art.\n\nThe Mirror. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Owen Moore, William Shay, si, b&w. Archive: George Eastman Museum.\n\nMuggsy Becomes a Hero. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Grace Henderson, Edward Dillon, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nMuggsy's First Sweetheart. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Edward Dillon, Joseph Graybill, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nNever Again. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Mack Sennett, Anthony O’Sullivan, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Newlyweds. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Florence Barker, Charles West, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Plain Song. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Dell Henderson, Kate Bruce, W. Chrystie Miller, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nRamona. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Francis Grandon, Kate Bruce, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nA Rich Revenge. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Francis Grandon, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Romance of the Western Hills. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Dorothy West, Alfred Paget, si, b&w. Archive: Academy Film Archive, Library of Congress.\n\nSimple Charity. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Edwin August, W. Chrystie Miller, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Smoker. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Jack Pickford, Frank Opperman, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nThe Song of the Wildwood Flute. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Dark Cloud, Francis Grandon, Dell Henderson, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nThe Sorrows of the Unfaithful. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Edward Dillon, Gladys Egan, si, b&w. Archive: Library of Congress.\n\nThe Thread of Destiny. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Henry B. Walthall, Linda Arvidson, Francis J. Grandon, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThree Sisters. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Marion Sunshine, Vivian Prescott, Kate Bruce, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress.\n\nThe Twisted Trail. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, George Nichols, Kate Burce, si, b&w. Archive: Library of Congress.\n\nThe Two Brothers. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Arthur Johnson, Dell Henderson, Marion Leonard, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Unchanging Sea. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Linda Arvidson, Arthur Johnson, Dell Henderson, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nA Victim of Jealousy. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, James Kirkwood, Florence Barker, Mack Sennett, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nWaiter No. 5. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, George Nichols, Claire McDowell, Jack Pickford, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nWhat the Daisy Said. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Gertrude Robinson, Joseph Graybill, Verner Clarges, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nWhen a Man Loves. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Dell Henderson, Charles West, George Nichols, si, b&w. Archive:Library of Congress, Museum of Modern Art.\n\nWhen We Were In Our 'Teens. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Joseph Graybill, Mack Sennett, si, b&w. Archive: Library of Congress.\n\nWhite Roses. Dir.: Frank Powell (Biograph Co. US 1910) cas.: Mary Pickford, Edward Dillon, W. Chrystie Miller, Jack Pickford, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nWilful Peggy. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Clara Bracey, Henry B. Walthall, Claire McDowell, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nThe Woman From Mellon's. Dir.: D.W. Griffith (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, George Nichols, Linda Arvidson, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nArtful Kate. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: Academy Film Archive, Library of Congress.\n\nAt a Quarter of Two. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: Library of Congress.\n\nIn Old Madrid. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, si, b&w. Archive: Library of Congress.\n\nIn the Sultan's Garden. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, King Baggot, Owen Moore, si, b&w. Archive: Library of Congress.\n\nThe Lighthouse Keeper. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, William E. Shay, J. Farrell MacDonald, si, b&w. Archive: Library of Congress.\n\nLittle Red Riding Hood. Dir.: Owen Moore (Majestic Co, US 1911) cas.: Mary Pickford, Owen Moore, James Kirkwood, Mayme Kelso, si, b&w. Archive: Library of Congress.\n\nA Manly Man. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, William Shay, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nSweet Memories. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Charlotte Pickford, Lottie Pickford, Jack Pickford, si, b&w. Archive: Library of Congress.\n\nA Timely Repentance. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, William Shey, Lucille Young, si, b&w. Archive: Library of Congress.\n\n‘Tween Two Loves. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, William Shey, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nWhen the Cat's Away. Dir.: Thomas H. Ince (IMP Co. US 1911) cas.: Mary Pickford, Lottie Pickford, si, b&w. Archive: Library of Congress, UCLA Film & Television Archive.\n\nA Beast at Bay. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Edwin August, Alfred Paget, Mae Marsh, si, b&w. Archive: Academy Film Archive, BFI National Archive, Library of Congress, Museum of Modern Art.\n\nFate's Interception. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Wilfred Lucas, Charles Hill Mailes, Charles West, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Female of the Species. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Claire McDowell, Charles West, Dorothy Bernard, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nA Feud in the Kentucky Hills. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Charles Hill Mailes, Kate Bruce, Henry B. Walthall, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nFriends. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry Walthall, Lionel Barrymore, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nHome Folks. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Charles Hill Mailes, Kate Bruce, Robert Harron, si, b&w. Archive: BFI National Archive, Library of Congress, Museum of Modern Art.\n\nIola's Promise. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Alfred Paget, Frank Evans, Dorothy Bernard, si, b&w. Archive: BFI National Archive, Library of Congress, UCLA Film & Television Archive.\n\nAn Indian Summer. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Kate Bruce, W. Chrystie Miller, Jack Pickford, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\nThe Informer. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry Walthall, Walter Miller, Lillian Gish, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Inner Circle. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Adolph Lestina, Jack Pickford, Chalres Hill Mailes, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nJust Like a Woman. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford,Wilfred Lucas, Grace Henderson, Mae Marsh, si, b&w. Archive: Library of Congress, Museum of Modern Art.\n\nA Lodging for the Night. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Charles West, Charles Hill Mailes, William Carroll, si, b&w. Archive: Library of Congress.\n\nThe Mender of the Nets. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Mabel Normand, Charles West, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nMy Baby. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry B. Walthall, Eldean Stewart, W. Chrystie Miller, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Narrow Road. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Elmer Booth, Charles Hill Mailes, Alfred Paget, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe New York Hat. Dir.: D.W. Griffith; sc.: Anita Loos (Biograph Co. US 1912) cas.: Mary Pickford, Lionel Barrymore, Charles Hill Mailes, Mae Marsh, si, b&w. Archive: Academy Film Archive, BFI National Archive, George Eastman Museum, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\nThe Old Actor. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, W. Chrystie Miller, Kate Bruce, Edwin August, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe One She Loved. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Henry B. Walthall, Lionel Barrymore, Kate Bruce, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nA Pueblo Legend. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford,Wilfred Lucas, Robert Harron, Jack Pickford, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe School Teacher and the Waif. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Edwin August, Charles Hill Mailes, Claire McDowell, si, b&w. Archive: Library of Congress.\n\nSo Near, Yet So Far. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, Walter Miller, Robert Harron, Lillian Gish, si, b&w. Archive: George Eastman Museum,Library of Congress, Museum of Modern Art.\n\nThe Unwelcome Guest. Dir.: D.W. Griffith (Biograph Co. US 1912) cas.: Mary Pickford, W. Chrystie Miller, Claire McDowell, Jack Pickford, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nWith the Enemy's Help. Dir.: Wilfred Lucas (Biograph Co. US 1912) cas.: Mary Pickford, Blanche Sweet, Charles West, Charles Hill Mailes, si, b&w. Archive: BFI National Archive, Library of Congress.\n\nWon by a Fish. Dir.: Mack Sennett (Biograph Co. US 1912) cas.: Mary Pickford, Edward Dillon, Dell Henderson, Kate Bruce, si, b&w. Archive: Academy Film Archive, Library of Congress, Museum of Modern Art.\n\nBehind the Scenes. Dir.: James Kirkwood (Famous Players Film Co. US 1914) cas.: Mary Pickford, James Kirkwood, Lowell Sherman, Ida Waterman, si, b&w. Archive: George Eastman Museum.\n\nCinderella. Dir.: James Kirkwood sc.: Austin Strong (Famous Players Film Co. US 1914) cas.: Mary Pickford, Owen Moore, Isabel Vernon, Georgia Wilson, si, b&w. Archive: Library of Congress, EYE Filmmuseum.\n\nA Good Little Devil. Dir.: Edwin S. Porter sc.: Austin Strong (Famous Players Film Co. US 1914) cas.: Mary Pickford, Ernest Truex, William Norris, Iva Merlin, si, b&w. Archive: BFI National Archive.\n\nThe Eagle's Mate. Dir.: James Kirkwood (Famous Players Film Co. US 1914) cas.: Mary Pickford, James Kirkwood, Ida Waterman, Robert Broderick, si, b&w. Archive: BFI National Archive, George Eastman Museum.\n\nTess of the Storm Country. Dir.: Edwin S. Porter (Famous Players Film Co. US 1914) cas.: Mary Pickford, Harold Lockwood, Olive Golden, David Hartford, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe Dawn of a Tomorrow. Dir.: James Kirkwood sc.: Eve Unsell (Famous Players Film Co. US 1915) cas.: Mary Pickford, David Powell, Forrest Robinson,, Margaret Seddon, si, b&w. Archive: Svenska Filminstitutet, Library of Congress.\n\nFanchon the Cricket. Dir.: James Kirkwood (Famous Players Film Co. US 1915) cas.: Mary Pickfod, Jack Standing, Lottie Pickford, Jack Pickford, si , b&w. Archive: BFI National Archive, George Eastman Museum.\n\nThe Foundling. Dir.: John B. O’Brien sc.: Frances Marion (Famous Players Film Co. US 1916) cas.: Maggie Weston, Edward Martindale, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nLittle Pal. Dir.: James Kirkwood sc.: Marshall Neilan (Famous Players Film Co. US 1915) cas.: Mary Pickford, Russell Bassett, George Anderson, William Lloyd, si, b&w. Archive: Cinémathèque Française.\n\nMadame Butterfly. Dir.: Sidney Olcott (Famous Players Film Co. US 1915) cas.: Mary Pickford, Marshall Neilan, Olive West, Jane Hall, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nMistress Nell. Dir.: James Kirkwood (Famous Players Film Co. US 1915) cas.: Mary Pickford, Owen Moore, Ruby Hoffman, Arthur Hoops, si, b&w. Archive: Museum of Modern Art, Národní Filmov Archiv.\n\nRags. Dir.: James Kirkwood sc.: Edith Barnard Delano (Famous Players Film Co. US 1915) cas.: Mary Pickford, Marshall Neilan, Joseph Manning, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Eternal Grind. Dir.: John B. O’Brien sc.: William H. Clifford (Famous Players Film Co. US 1916) cas.: Mary Pickford, Dorothy West, Loretta Blake, John Bowers, si, b&w. Archive: Cinémathèque Française.\n\nHulda from Holland. Dir.: John B. O’Brien sc.: Edith Barnard Delano (Famous Players Film Co. US 1916) cas.: Mary Pickford, John Bowers, Frank Losee, si, b&w. Archive: Národní Filmov Archiv.\n\nPoor Little Peppina. Dir.: Sidney Olcott sc.: Kate Jordan (Famous Players Film Co. US 1916) cas.: Mary Pickford, Antonio Maiori , Jack Pickford, Eugene O’Brien, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\n2. Mary Pickford as Producer and Actress\n\nLess than the Dust. Prod.: Mary Pickford, dir.: John Emerson sc.: Hector Turnbull (Mary Pickford Film Corp. US 1916) cas.: Mary Pickford, David Powell, Mary Alden, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nThe Little American. Prod. Cecil B. DeMille, Mary Pickford, dir.: Cecil B. DeMille, sc.: Jeanie Macpherson, Cecil B. DeMille, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Jack Holt, si, b&w, 6 reels, 5,925 ft. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive, Cineteca del Friuli.\n\nA Little Princess. Prod.: Mary Pickford, dir.: Marshall Neilan, sc.: Frances Marion, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp US 1917) cas.: Mary Pickford, Norman Kerry, Zasu Pitts, si, b&w, 35mm, 6 reels. Archive: George Eastman Museum, Library of Congress, EYE Filmmuseum, Filmoteca de Catalunya, UCLA Film & Television Archive.\n\nThe Poor Little Rich Girl. Prod.: Mary Pickford, dir.: Maurice Tourneur sc.: Frances Marion (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Madeline Traverse, Gladys Fairbanks, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nThe Pride of the Clan. Prod. Mary Pickford, dir.: Maurice Tourneur sc.: Elaine Sterne, Charles E. Whittaker (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Matt Moore, Warren Cooke, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nRebecca of Sunnybrook Farm. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Josephine Crowell, Eugene O’Brien, Marjorie Daw, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nA Romance of the Redwoods. Prod.: Cecil B. DeMille, Mary Pickford, dir.: Cecil B. DeMille sc.: Jeannie MacPherson , Cecil B. DeMille (Mary Pickford Film Corp. US 1917) cas.: Mary Pickford, Elliott Dexter, Raymond Hatton, si, b&w. Archive: George Eastman Museum.\n\nAmarilly of Clothes-Line Alley. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Norman Kerry, Kate Price, si, b&w. Archive: George Eastman Museum, Library of Congress, Museum of Modern Art.\n\nM'liss. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Thomas Meighan, Theodore Roberts, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nJohanna Enlists. Prod.: Mary Pickford, dir.: William Desmond Taylor sc.: Frances Marion (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Monte Blue, Douglas McLean, si, b&w. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nStella Maris. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Frances Marion, cost.: Lucy Duff-Gordon (Mary Pickford Film Corp. US 1918) cas.: Mary Pickford, Conway Tearle, Marcia Manon, Ida Waterman, si, b&w, 35mm., 6 reels. Archive: Cineteca del Friuli, George Eastman Museum, Library of Congress, Museum of Modern Art, National Film and Sound Archive of Australia.\n\nThe Heart o' the Hills. Prod.: Mary Pickford, dir.: Sidney A. Franklin sc.: Bernard McConville (Mary Pickford Film Corp. US 1919) cas.: Mary Pickford, Claire McDowell, Jack (John) Gilbert, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Hoodlum. Prod.: Mary Pickford, Dir.: Sidney A. Franklin (Mary Pickford Film Corp. US 1919) cas.: Mary Pickford, Ralph Lewis, Max Davidson, si, b&w. Archive: Academy Film Archive, George Eastman Museum, BFI National Archive.\n\n3. Mary Pickford as Producer, Actress, and Distributor (United Artists)\n\nPollyanna. Prod.: Mary Pickford, dir.: Paul Powell sc.: Frances Marion (Mary Pickford Film Corp. US 1920) cas.: Mary Pickford, Katherine Griffith, Herbert Prior, si, b&w. Archive: Cinémathèque Royale de Belgique, George Eastman Museum, Library of Congress.\n\nSuds. Prod.: Mary Pickford, dir.: Jack Dillon sc.: Waldemar Young (Mary Pickford Film Corp. US 1920) cas.: Mary Pickford, Harold Goodwin, Albert Austin, Rose Dione, si, b&w. Archive: BFI National Archive, George Eastman Museum, Library of Congress, Národní Filmov Archiv.\n\nLittle Lord Fauntleroy. Prod.: Mary Pickford, dir.: Alfred E. Green Jack Pickford sc.: Bernard McConville (Mary Pickford Film Corp. US 1921) cas.: Mary Pickford, Claude Gillingwater, Joseph Dowling, Kate Price, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nThe Love Light. Prod.: Mary Pickford, dir./sc.: Frances Marion (Mary Pickford Co. US 1921) cas.: Mary Pickford, Fred Thomson, si, b&w, 35mm, 8 reels. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive, Gosfilmofond.\n\nThrough the Back Door. Prod.: Mary Pickford, dir.: Alfred E. Green , Jack Pickford sc.: Marion Fairfax (Mary Pickford Film Corp. US 1921) cas.: Mary Pickford, Gertude Astor, Wilfred Lucas, si, b&w. Archive: George Eastman Museum, Library of Congress.\n\nTess of the Storm Country. Prod.: Mary Pickford, dir.: John S. Robertson, adp.: Elmer Harris (Mary Pickford Film Corp. US 1922) cas.: Lloyd Hughes, Gloria Hope, si, b&w [incomplete]. Archive: George Eastman Museum, Library of Congress, UCLA Film & Television Archive, Gosfilmofond.\n\nRosita. Prod.: Mary Pickford, dir.: Ernst Lubitsch sc.: Edward Knoblock (Mary Pickford Film Corp. US 1923) cas.: Mary Pickford, Irene Rich, George Walsh, si, b&w. Archive: Cinémathèque Royale de Belgique, Museum of Modern Art, Národní Filmov Archiv.\n\nDorothy Vernon of Haddon Hall. Prod.: Mary Pickford, dir.: Marshall Neilan, sc.: Waldemer Young (Mary Pickford Film Corp. US 1924) cas.: Mary Pickford, Allan Forest, Lottie Pickford Forrest, si, b&w. Archive: Cinémathèque Royale de Belgique, Filmoteka Narodowa, George Eastman Museum, Library of Congress, Gosfilmofond, UCLA Film & Television Archive, Deutsche Kinemathek.\n\nSparrows. Prod.: Mary Pickford, dir.: William Beaudine sc.: Winifred Dunn (Mary Pickford Film Corp. US 1926) cas.: Mary Pickford, Gustav von Seyffertitz, Roy Stewart, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress, UCLA Film & Television Archive.\n\nMy Best Girl. Prod.: Mary Pickford, dir.: Sam Taylor, sc.: Hope Loring, adp.: Allen McNeil, Tim Whelan (Mary Pickford Corp. US 1927) cas.: Mary Pickford, Charles (Buddy) Rogers, si, b&w, 35mm, 9 reels. Archive: Cinémathèque Royale de Belgique, George Eastman Museum, Library of Congress, Academy Film Archive.\n\n4. Mary Pickford as Screenwriter and Actress\n\nGetting Even. Dir.: D.W. Griffith, sc.: Mary Pickford (Biograph Co. US 1909) cas.:Mary Pickford, Billy Quirk, Mack Sennett, James Kirkwood, si, b&w. Archive: Library of Congress.\n\nThe Awakening. Dir.: D.W. Griffith, sc.: Mary Pickford (Biograph Co. US 1909) cas.: Mary Pickford, Arthur Johnson, Clara Bracy, Owen Moore, si, b&w. Archive: Library of Congress.\n\nMay and December. Dir.: Frank Powell, sc.: Mary Pickford (Biograph Co. US 1910) cas.: Mary Pickford, Billy Quirk, Kate Bruce, si, b&w. Archive: Library of Congress, Museum of Modern Aart [USM].\n\nTheir First Misunderstanding. Dir.: Thomas H. Ince, George L. Tucker. sc.: George L. Tucker (IMP Co. US 1911) cas: Mary Pickford, Owen Moore, si, b&w. Archive: Library of Congress.\n\nThe Dream. Dir.: Thomas H. Ince, sc.: Mary Pickford (IMP Co. US 1911) cas.: Mary Pickford, Owen Moore, Lottie Pickford, si, b&w. Archive: Library of Congress.\n\nLena and the Geese. Dir.: D.W. Griffith, sc.: Mary Pickford (Biograph Co. US 1912) cas.: Mary Pickford, Kate Bruce, Mae Marsh, Edwin August, si, b&w. Archive: Academy Film Archive, Library of Congress, Museum of Modern Art, UCLA Film & Television Archive.\n\n5. Mary Pickford as Producer, Screenwriter, and Actress\n\nDaddy-Long-Legs. Prod.: Mary Pickford, dir.: Marshall Neilan sc.: Agnes C. Johnston, Mary Pickford (Mary Pickford Film Corp. US 1919) cas.: Milla Davenport, Marshall Neilan, si, b&w. Archive: George Eastman Museum, Library of Congress, EYE Filmmuseum, UCLA Film & Television Archive.\n\n6. Mary Pickford as Producer, Screenwriter, Actress, and Distributor (United Artists)\n\nLittle Annie Rooney. Dir.: William Beaudine sc.: Hope Loring, Mary Pickford (Mary Pickford Film Corp. US 1925) cas.: William Haines, Walter James, Vola Vale, si, b&w. Archive: Academy Film Archive, George Eastman Museum, Library of Congress.\n\n7. Mary Pickford as Screenwriter\n\nThe Day After. Dir.: D.W. Griffith sc.: Mary Pickford (Biograph Co. US 1909) cas.: Marion Leonard, Arthur Johnson, James Kirkwood, si, b&w. Archive: Library of Congress, Museum of Modern Art, Academy Film Archive.\n\nMadame Rex. Dir.: D.W. Griffith sc.: Mary Pickford (Biograph Co. US 1911) cas.: Edwin August, Stephanie Longfellow, si, b&w. Archive: Museum of Modern Art.\n\nB. Filmography: Non-Extant Film Titles:\n\n1. Mary Pickford as Actress\n\nBack to the Soil, 1911; The Better Way, 1911; The Caddy's Dream, 1911; The Call of the Song, 1911; The Convert, 1911; The Courting of Mary, 1911; The Fair Dentist, 1911; The Fisher-Maid, 1911; For Her Brother's Sake, 1911; For the Queen's Honor, 1911; A Gasoline Engagement, 1911; Her Darkest Hour, 1911; His Dress Shirt, 1911; Honor Thy Father, 1911; Love Heeds Not the Showers, 1911; The Master and the Man, 1911; The Message in the Bottle, 1911; Pictureland, 1911; The Rose's Story, 1911; Science, 1911; The Secret of the Palm, 1911; The Sentinel Asleep, 1911; The Skating Bug, 1911; The Stampede, 1911; There is Life, 1911; The Toss of a Coin, 1911; Tracked, 1911; While There is Hope, Second Sight, 1911; Caprice, 1913; In the Bishop's Carriage, 1913; Hearts Adrift, 1914; Such a Little Queen, 1914; Esmeralda, 1915; A Girl of Yesterday, 1915.\n\n2. Mary Pickford as Screenwriter and Actress\n\nHearts Adrift, 1914; A Girl of Yesterday, 1915.\n\n3. Mary Pickford as Producer and Actress\n\nHow Could You, Jean?, 1918; Captain Kidd, Jr., 1919.\n\n4. Mary Pickford as Screenwriter\n\nCaught in the Act, 1911; The Medallion, 1911; When Fate Decrees, 1913.\n\nC. DVD Sources:\n\nAmarilly of Clothes-Line Alley. DVD (Image Entertainment US 2000)\n\nAmarilly of Clothes-Line Alley with The Dream. DVD. (The Milestone Collection US 2000)\n\nDaddy Long-Legs with What the Daisy Said. DVD. (The Milestone Collection US 1999)\n\nThrough the Back Door with Cinderella. DVD. (The Milestone Collection US 2005)\n\nDorothy Vernon of Haddon Hall. DVD. (Alpha Video US 2017)\n\nM'liss and Heart o' the Hills. DVD. (The Milestone Collection US 2005)\n\nHeart o' the Hills. DVD. (Alpha Video US 2013)\n\nThe Hoodlum. DVD. (Alpha Video US 2013)\n\nJohanna Enlists. DVD. (Alpha Video US 2016)\n\nLess than Dust. DVD. (Alpha Video US 2015)\n\nThe Little American. DVD. (Alpha Video US 2015)\n\nLittle Annie Rooney. DVD. (Alpha Video US 2017)\n\nLittle Lord Fauntleroy. DVD. (The Milestone Collection US 2015)\n\nWithout Lying Down with The Little Princess. DVD. (The Milestone Collection US 2003)\n\nTess of the Storm Country. DVD (Image Entertainment US 1999)\n\nStella Maris. DVD (Image Entertainment US 2000)\n\nThe Love Light. DVD (Image Entertainment US 2001)\n\nMadame Butterfly. DVD. (Alpha Video US 2015)\n\nThe Pride of the Clan with Sweet Memories. DVD. (Grapevine Video US 2013_\n\nSparrows with Wilful Peggy and The Mender of Nets. DVD. (The Milestone Collection US 1999)\n\nMy Best Girl. (The Milestone Collection US 1999)\n\nA Romance of the Redwoods. DVD. (Alpha Video US 2013)\n\nRebecca of Sunnybrook Farm. DVD. (Alpha Video US 2014)\n\nSuds. DVD. (The Milestone Collection US 2005)\n\nRags and Riches: Mary Pickford Collection. DVD. (Milestone US 2012)\n\nTreasures III: Social Issues in American Film, 1900-1934. DVD. Image Entertainment US 2007)\n\nThe Origins of Film Collection. DVD. (Smithsonian Video US 2001)\n\nGriffith Masterworks: Biograph Shorts (1908-1914. DVD. (Kino Video US 2002) - contains The New York Hat (1912)\n\nD.W. Griffith Years of Discovery, 1909-1913. DVD. (Image Entertainment US 2002) - contains The New York Hat (1912)\n\nD.W. Griffith Director, Vol. 3, 4, 5, 6. DVD. (Grapevine Video US 2011)\n\nThe Cecil B. DeMille Classics Collection. DVD. (Passport Video US 2007)\n\nMary Pickford Collection. DVD (St. Clair Vision US 2008)\n\nD. Streamed Media:\n\nThe New York Hat (1912) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Poor Little Rich Girl (1917) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Love Light (1921) is streaming online via Amazon Prime\n\nThe Love Light (1921) is streaming online via The Internet Archive\n\nLittle Annie Rooney (1925) is streaming online via Amazon Prime\n\nThe Little American (1916) is streaming online via Amazon Video (with Fandor subscription)\n\nSparrows (1926) is streaming online via Amazon Video (with Fandor subscription)\n\nFriends (1912) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Unchanging Sea (1910) is streaming online via Amazon Video (with Fandor subscription)\n\nThe Hoodlum (1919) is streaming online via Amazon video (with Fandor subscription)\n\nThe Hoodlum (1919) is streaming online via The Internet Archive\n\nCinderella (1914) is streaming online via The Internet Archive\n\nJohanna Enlists (1918) is streaming online via The Internet Archive\n\nThe Little Princess (1917) is streaming online via The Internet Archive\n\nLittle Lord Fauntleroy (1921) is streaming online via The Internet Archive\n\nStella Maris (1918) is streaming online via The Internet Archive\n\nPoor Little Peppina (1916) is streaming online via The Internet Archive\n\nM'liss (1918) is streaming online via The Internet Archive\n\nM'liss (1918) is streaming online via Amazon Video\n\nThe Pride of the Clan (1917) is streaming online via The Internet Archive\n\nHeart o' the Hills (1919) is streaming online via The Internet Archive\n\nCredit Report\n\nThe Library of Congress has two 35mm prints of a 1968 reissue version of Pickford’s Taming of the Shrew deposited with the U.S. Copyright Office. The sound track on these prints is different than the original 1929 version. Several films exist as incomplete prints: A Timely Repentance, At a Quarter of Two, A Good Little Devil, Less than the Dust, Daddy-Long-Legs, The Hoodlum, Tess of the Storm Country. The author states that there are silent versions of Coquette and The Taming of the Shrew. It is believed that Mary Pickford wrote Their First Misunderstanding (1911), while IMDb credits George Loane Tucker.\n\nCitation\n\nSchmidt, Christel. \"Mary Pickford.\" In Jane Gaines, Radha Vatsal, and Monica Dall’Asta, eds. Women Film Pioneers Project. New York, NY: Columbia University Libraries, 2013. <https://doi.org/10.7916/d8-nkzz-e525>"}, {"url": "https://www.pbs.org/wgbh/americanexperience/features/pickford-long-decline/", "page_content": "Mary Pickford reached unprecedented heights of fame -- and fell from stardom into semi-obscurity. Many remember her career and her films, but few know of the years that followed. Pickford's life is a cautionary tale for aspiring stars, highlighting the triumphs and the troubles of fame.\n\nMary Pickford Library\n\nThe Talkies\n\nThe era of synchronized sound began in 1926, when Warner Brothers released Don Juan with sound effects and a musical accompaniment. Many in Hollywood were skeptical of introducing sound to film. Top filmmaker D.W. Griffith dismissed the idea, saying \"speaking movies are impossible. When a century has passed, all thought of our so-called 'talking pictures' will be abandoned.\" Pickford considered sound a frivolous ornamentation to the medium, \"like putting lip rouge on the Venus de Milo.\" But audiences responded with rapturous excitement, just as they had when the earliest, simplest films had debuted.\n\nThe Future\n\nSoon, the powerful stars of the silent cinema were no longer in control. Talkies had arrived, and by 1930 silent film would be a dead medium. Pickford attempted a talkie -- she was the first major silent film star to try it -- and though she disliked pictures with sound, she saw that they were the future. She tried to adapt, using techniques from her stage acting days, and achieved reasonable success with Coquette in 1929. But the film quality was poor, with distracting background noise, and Pickford's flirtatious character troubled audiences who had typecast her as an innocent, years before.\n\nProblems\n\nWith sound, Pickford faced new challenges. How would she incorporate her voice into her screen acting, rather than relying on expressions and gestures? Could she make the transition to quiet sets, which eliminated dialogue with the director? How would she deal with the particular limitations of the existing sound technology? Actors' movements were restricted, because they had to stay in range of a microphone. The problem led to stilted performances.\n\nOut of Fashion\n\nHowever, Pickford's greatest challenges were not related to sound. They were the new expectations from fans, who wanted jazzier stories and sexier stars. Pickford's relative age and her association with old-fashioned roles hindered her as much as sound technology did. Pickford made five talking films, attempting to keep pace with the new technology. Yet she recognized the approaching end to her career and her stardom.\n\nMarriage Troubles\n\nIf this was not enough, her marriage to Douglas Fairbanks was also in crisis. As early as 1925, Pickford realized that her husband was drifting from her. He too, was struggling with the advent of sound and the limits his age was placing on his brand of physical comedy. Accustomed to the limelight and public adoration, Fairbanks grew fearful and unsettled by the shift in his career. As their marriage fell apart, Pickford succumbed to her family's affliction: alcoholism.\n\nA New Companion\n\nPickford's former co-star and companion Buddy Rogers started proposing in 1936, after Pickford and Fairbanks divorced. It was common knowledge that Rogers loved Pickford from the moment he met her. Tongues wagged over the age difference; Pickford was 12 years his senior. To some, Pickford's acceptance of Rogers looked like an act of revenge on Fairbanks, who divorced Pickford and married his longtime mistress that same year.\n\nLoyal Partner\n\nPickford and Rogers were married in 1937, and after living briefly at Rogers' home, moved back to Pickfair, the estate Fairbanks and Pickford had shared. Rogers was devoted to his new wife, though she sometimes called him \"Douglas\" when she'd had too much to drink.\n\nRecluse\n\nIn the 1940s and 1950s, Pickford tried producing movies and working in radio. But what she was best at was selling Mary Pickford, not developing the talent of others. Without her mother and without Fairbanks, she seemed to have lost her touch. When she wasn't working, she filled her time with charity events and increasingly troubled relations with her two adopted children. More and more, she secluded herself at Pickfair and anesthetized herself with alcohol.\n\nA Second Oscar\n\nIn 1976 Pickford was awarded her second Oscar (her first was for Coquette in 1930), for lifetime achievement in the motion picture industry. She was too weak to attend the ceremony, so the awards show producers filmed her at Pickfair. Pickford cut an eerie figure, dressed in a satin robe with a fur collar and draped in jewels. Her wig of blonde curls, false eyelashes, and garish lipstick made her a ghost of the vivacious beauty she had been. The public was appalled by her appearance and her garbled speech. Mike Royko of the Los Angeles Times wrote, \"Mary Pickford, the one-time screen darling of America, has managed to offend people. She did it by growing old.\""}, {"url": "https://oneroomwithaview.com/2014/04/07/mary-pickford-the-rise-and-fall-of-americas-sweetheart/", "page_content": "She was the first star of the silver screen, the undisputed Queen of Hollywood and one half of its ultimate power couple, a pioneer of screen acting and a savvy businesswoman. Known as ‘America’s Sweetheart’, a nod to her talent for playing little-girl roles, which she did until well into her thirties, Mary Pickford was, nonetheless, a woman who knew her own mind and took charge of her own career. She may have looked young and innocent with her flowing hair and a diminutive stature, but Pickford, ‘The Girl with the Golden Curls’ and ‘Little Mary’, was tough.\n\nHaving endured hardship during the early years of her childhood in Canada, Pickford started earning money at seven years old when she made her stage debut at Toronto’s Princess Theatre in 1899, under her real name of Gladys Smith. The family then began a spate of six years touring around America with third-rate theatre companies. After failed attempts to land a Broadway role, she finally succeeded in 1906, and in 1907 her determination saw powerful theatre producer David Belasco agree to meet with her. Gladys Smith emerged from this meeting as Mary Pickford.\n\nLife as an actress, however, was still not steady enough so Pickford found herself making the demeaning decision (for a theatre actress) to appear in moving pictures. In 1909 she began working at D.W. Griffith’s Biograph Company, neatly negotiating herself a salary of double the going rate ($10 a day). She featured in 51 films that year, playing all sizes and sorts of parts.\n\nWorking alongside innovator Griffith, Pickford quickly learned to consider and appreciate the technical aspects of filming, and more specifically the relationship of the actor with the camera. Pickford realised that when on screen, far less of the stylized, grandiose theatre acting was required and naturalistic movements and expressions came across far better. Her talent for self-appraisal also saw Pickford recognise her aptitude for light, comical roles. 1910’s Wilful Peggy gave her her first opportunity to play a character as she wanted to, making Peggy vibrant and resilient in contrast to the more usual insipid, Victorian female characters of the day. This characterization would become Pickford’s trademark.\n\nSoon, Mary Pickford was the most popular actress at Biograph and the next few years saw her making films in California and swapping to Carl Laemmle’s Independent Moving Pictures Company for 1911 as the industry hit its stride. In 1913 she joined Adolph Zuckor’s illustrious company Famous Players in Famous Plays, later known as Paramount Pictures. Pickford’s career blossomed as she received her first above-title marquee billing in 1914’s Hearts Adrift (the success and critical acclaim of which she used as the basis for her first of many salary increases). Some of her most famous and enduring pictures were made during these years, such as The Poor Little Rich Girl and Rebecca of Sunnybrook Farm (both 1917).\n\n1919 heralded the most important move of Pickford’s career: she formed the independent film production company United Artists, alongside Charlie Chaplin, D.W. Griffith and Douglas Fairbanks (this event is popularly believed to be the origin of the phrase “the lunatics are taking over the asylum!”). She could now have complete control over how she distributed her films, as well as continuing to produce and perform in them. More triumphs followed, such as Pollyanna (1920) and Little Lord Fauntleroy (1921).\n\nFairbanks and Pickford by this time were involved in an affair and would go on to divorce their respective spouses and marry in 1920. This union would put ‘Brangelina’ to shame. Pickford was regarded as the most famous woman in the world and Fairbanks was a massive star in his own right, famous for his daring stunt work and swashbuckling roles. They were the first stars to officially put their hands in cement outside Grauman’s Chinese Theater. Anyone who was anyone was clamouring for an invitation to a gathering at their Hollywood mansion, dubbed ‘Pickfair’. Guests included George Bernard Shaw, H.G. Wells, Albert Einstein, Amelia Earhart, F. Scott Fitzgerald and, of course, Fairbanks’ close friend Chaplin.\n\nThe advent of talkies in 1927 was to signal the beginning of the end for Pickford. Despite earning the first Academy Award for an actress in a sound picture for 1929’s Coquette, the audiences could not warm to a Pickford that spoke. Speaking showed Mary Pickford to be a woman in her mid-thirties, as did her new bob hairstyle (Pickford having cut off her celebrated curls after the death of her mother), and no longer ‘America’s Sweetheart’. Following the commercial failure of Pickford and Fairbanks teaming up for The Taming of the Shrew later that year, Pickford’s career was all but over. She made only three more pictures and retired from acting in 1933. She and Fairbanks were divorced in 1936.\n\nMary Pickford’s star faded into obscurity as the actress failed to find new work and slumped into alcoholism, the same addiction that had infected her entire family. Decades of nothingness followed and Pickford became a virtual recluse. 1976, however, brought an Honorary Academy Award for the actress in recognition of her vast contribution to the motion picture industry. She was, after all, a founding member of the Academy."}, {"url": "https://www.closerweekly.com/posts/inside-mary-pickford-and-douglas-fairbanks-love-story-divorce/", "page_content": "A little after 10:30 p.m. on March 28, 1920, “America’s Sweetheart” Mary Pickford married the love of her life, dashing actor Douglas Fairbanks, in a secret ceremony witnessed by only a handful of trusted people.\n\nMary had agonized that fans might frown on their marriage — both were wed to others when they started their affair — but her worries were baseless. Throngs of well-wishers greeted the couple at every stop on their European honeymoon.\n\nGlasshouse Images/Shutterstock\n\n“They were more beloved and better known than anybody in the world,” explains Tracey Goessel, author of The First King of Hollywood: The Life of Douglas Fairbanks. “The fact that these two adored people were in love with each other made everybody feel good.”\n\nIn the nascent years of the motion picture industry, no stars shined brighter than “Mary and Doug.” The first to ever have her name in marquee lights, Mary, with her trademark curls, built her career playing sweet, innocent heroines, while Douglas brought daredevil heroes like Zorro and Robin Hood to the big screen.\n\n“They embodied the youth, optimism and energy of their era,” says Goessel. “And the public interest in their marriage only added fuel to the fire of their fame.”\n\nDouglas brought his bride home to a hunting lodge in then-unglamorous Beverly Hills. They christened it “Pickfair” and turned it into a 25-room mansion complete with a home theater and LA’s first in-ground swimming pool. “For the first seven years of their marriage, they were never apart for a single night,” notes Goessel.\n\nThe couple threw lavish dinners with guests including Charlie Chaplin, Amelia Earhart, Albert Einstein and F. Scott Fitzgerald. “They would get prints of films from other studios and everyone would get together and watch,” says Goessel.\n\nEND OF A DREAM\n\nThe late 1920s began to tarnish the luster of this golden couple. In 1928, Mary’s mother died of cancer and the grief-stricken star began drinking. She and Douglas also had trouble adapting to the new technology of “talking” pictures. Finally, seeds of distrust began to cause cracks in their marriage.\n\nHistoria/Shutterstock\n\nAfter Mary heard whispers of Douglas’ flirtation with a teenage actress, she allowed her husband to catch her getting cozy with a costar. “Fairbanks was pathologically jealous, so he assumed she had strayed,” says Goessel. She hadn’t, but the damage was done. “Each thought the other had sinned first, so Douglas became a discreet rake. And Mary did begin an affair with her co-star.”\n\nTheir marriage proved unsalvageable and they divorced in 1936. “After trying to get Mary to take him back, Douglas rebounded and married his lover,” says Goessel. “He regretted it every day for the rest of his life.” The actor filmed his last feature in 1934 and died of a heart attack in 1939.\n\nMary’s Academy Award for Best Actress in 1930 would become her swan song. She retired from films in 1933. Although she would remarry and adopt two children, she became an alcoholic and spent her last decade as a recluse at Pickfair, the mansion she and Douglas had built together. She passed away in 1979 at age 87.\n\n— Louise A Barile, with reporting by Katie Bruno"}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/mary-pickford", "page_content": "Canadian-born film actress Mary Pickford.\n\nMary Pickford, née Gladys Louise Smith, actor, producer and writer (born 8 April 1892 in Toronto, ON; died 29 May 1979 in Santa Monica, California). Pickford was a pioneering figure of early cinema who became one of the most renowned stars of the silent film era. She was a trailblazer for women in the motion picture industry.\n\nEarly Life\n\nMary Pickford was the eldest child of Charlotte (née Hennessey) and John Charles Smith. She had a sister, Charlotte (Lottie) (1893–1936); and a brother, John (Jack) (1896–1933). At about the age of four, she fell ill with diphtheria, and was baptized by a Roman Catholic priest and her middle name was changed to Marie. John Smith died in 1898, apparently from a head injury suffered in a fall, leaving his family almost destitute. In need of money, Charlotte rented a room to a stage manager of the Cummings Stock Company of Toronto. He suggested that Charlotte cast her young daughters in a play. Pickford made her stage debut with the Valentine Stock Company in 1898 in Bootle’s Baby. In 1900, she performed at Toronto’s Princess Theatre. She played two parts, a boy and a girl, in The Silver King by Henry Arthur Jones and Henry Herman . That led to further roles in Toronto theatres. The following year, the whole family joined a touring theatrical troupe. In 1907, they joined the David Belasco Theatre Company in New York. At Belasco’s suggestion, Gladys changed her name to Mary Pickford, a combination of her own middle name and that of her maternal grandfather, John Pickford Hennessey. Charlotte, Lottie and Jack also adopted the name Pickford. That year, Pickford began her long run in William de Mille’s hit play The Warrens of Virginia at the Belasco Theatre on Broadway.\n\nFirst Movie Roles\n\nIn 1909, Pickford sought work in the new medium of motion pictures. She made her first cinematic appearance in the American Mutoscope and Biograph Company’s short film Her First Biscuits, directed by D.W. Griffith. She signed with the Biograph Company at $10 a day, and was given her first starring movie role in The Violin Maker of Cremona. It was quickly followed by They Would Elope.\n\nIn January 1910, Pickford went with Biograph to California, where she continued to make films directed by Griffith. By this time, Pickford was attracting the attention of audiences and critics. Although Pickford was only slightly more than five feet tall, her feisty characters dominated the screen. She had an instinctive understanding of how to play for the camera as opposed to a live theatre audience. Unlike the many stage actors who failed to make the transition to cinema, Pickford moved to the vanguard of performers who fused psychological realism with silent film’s balletic gesture. The result was an unprecedented intimacy between the actor on the screen and the movie theatre audience. This new relationship, sparked by Pickford’s acting genius and her onscreen image as a comic spitfire, triggered a Mary Pickford craze that grew more intense with the advent of feature films that were more than an hour long.\n\nWhen popular star Florence Lawrence left Biograph in 1910 to join Carl Laemmle’s Independent Moving Picture Company (IMP), Pickford replaced her as “The Biograph Girl.” But within the year she broke with Biograph and signed with IMP. In 1911, Pickford married actor Owen Moore. He was her leading man that year in Their First Misunderstanding.\n\nBetween 1912 and 1919, Pickford made films for several studios, working with such directors as Griffith, Owen Moore, Mack Sennett, Wilfred Lucas and Cecil B. DeMille. Among the dozens of films in which Pickford starred during this period were The Informer (1912), The Unwelcome Guest (1913), Cinderella (1914), Madame Butterfly (1915), The Foundling (1916), Rebecca of Sunnybrook Farm (1917), Poor Little Rich Girl (1917), Stella Maris (1918) and The Hoodlum (1919). She also formed her own production company, and on some projects contributed as a scriptwriter. In the winter of 1912–13, Pickford took a temporary leave from filmmaking to star in Belasco’s Broadway production of Rosamund Gerard and Maurice Rostand’s play A Good Little Devil.\n\nBy 1919, Pickford was one of the most popular stars in the evolving motion picture community of Hollywood, as well as one of the most highly paid. She was affectionately called “The Girl With the Golden Hair,” “Little Mary,” “Goldilocks” and “The Girl With the Curls.” But in spite of her Canadian background, she was most famously known as “America’s Sweetheart.”\n\nUnited Artists\n\nIn February 1919, Pickford, Griffith and film stars Douglas Fairbanks and Charlie Chaplin officially formed United Artists Corporation in order to maintain greater financial and artistic control over their productions. Pickford established the Mary Pickford Company, which produced films exclusively for distribution by United Artists. Her first movie made under the new arrangement, Pollyanna (1920), grossed over a million dollars.\n\nPickford and Fairbanks\n\nIn March 1920, Pickford divorced Moore on the grounds of desertion. Later that month, she married Fairbanks and became an American citizen. They moved into a Beverley Hills mansion they called “Pickfair.” Hollywood’s most glamorous couple had a European honeymoon and was mobbed by fans in London and Paris.\n\nPickford was now at the height of her acting career and made some of her most memorable films: Little Lord Fauntleroy (1921), Tess of the Storm Country (1922), Rosita (1923), Dorothy Vernon of Haddon Hall (1924), Little Annie Rooney (1925) and Sparrows (1926). In 1921, Pickford was a co-founder and first vice-president of the Motion Picture Relief Fund, which provided financial assistance for film industry employees in need. Jack and Lottie Pickford also had success as movie actors, but they never reached the same level of fame as Mary.\n\nIn May 1926, Sid Grauman’s Egyptian Theatre in Hollywood made movie history by featuring a double premiere: Pickford’s Sparrows and Fairbanks’ The Black Pirate, in which Pickford made an uncredited cameo appearance. In 1927, Pickford and Fairbanks were the first stars to make imprints of their hands and feet in cement in the forefront of Grauman’s Chinese Theatre. That year, they were among the 36 founders of the Academy of Motion Picture Arts and Sciences (known for the Academy Awards, or “The Oscars”). Fairbanks was elected its first president.\n\nChanging Times\n\nIn 1927, Pickford co-starred with Charles “Buddy” Rogers in My Best Girl. It was her last silent movie. The enormous success of the first “talking picture,” The Jazz Singer, starring Al Jolson, marked the end of the silent film era.\n\nPickford lost her mother to cancer in 1928. Overcoming grief and an initial ambivalence toward the new medium of sound, she starred in Coquette (1929), for which she received the Academy Award for Best Actress. That year, Pickford was also in The Taming of the Shrew, the only film in which she and Fairbanks co-starred. It failed at the box office.\n\nPickford’s final major screen appearance was in Secrets (1933). It opened the same week President Franklin D. Roosevelt ordered a temporary closure of the banks as a measure to fight the Great Depression. Like all other films released that week, Secrets did poorly at the box office. Now past the age at which she could play the perky young heroines that had endeared her to audiences, Pickford retired from acting. However, she was still active as a producer.\n\nPickford separated from Fairbanks in 1933 on grounds of infidelity and eventually divorced him. In 1934, Pickford published a novel, The Demi-Widow, written with the assistance of Belle Burns Gromer. She also wrote Why Not Try God?, a booklet promoting Christian Science. A similar booklet, My Rendezvous With Life, would follow a year later.\n\nIn May 1934, Pickford made a triumphant return to her hometown of Toronto. She was given an official civic reception, and crowds of fans jammed the downtown streets. Pickford was presented with a gold Centennial medal, and in a speech in which she paid homage to her parents, she said, “I am proud to be a Canadian.”\n\nPickford married Buddy Rogers in 1937. They adopted two children: Ronald Charles Pickford Rogers and Roxanne Pickford Rogers.\n\nLater Years\n\nPickford engaged in business enterprises such as Mary Pickford Cosmetics, was co-founder of the Society of Independent Motion Picture Producers, and established the Mary Pickford Charitable Trust, later renamed the Mary Pickford Foundation. But in her declining years she became reclusive and was plagued by alcoholism and depression. Her participation in 1953 in the first television broadcast of the Academy Awards was one of very few public appearances. In 1976, Pickford did not attend the Academy Awards ceremony to receive an honorary lifetime achievement Oscar. She accepted the award from Pickfair.\n\nStating that she “wished to die as a Canadian,” Pickford successfully applied to reclaim her Canadian citizenship. At the time of her death from a stroke, she held dual Canadian-American citizenship. Mary Pickford is recognized internationally as a dynamic and iconic figure in the history of cinema. In Toronto she is honoured with a bust and a plaque at the Hospital for Sick Children, which now occupies the site of her birth, and with a star on Canada’s Walk of Fame."}, {"url": "https://www.investors.com/news/management/leaders-and-success/mary-pickford-was-first-movie-superstar/", "page_content": "Mary Pickford was a dirt-poor theater actress of 17 when she made her silent-film debut in 1909.\n\nThrough a combination of pioneering acting skills, savvy business sense and fierce determination, she became the most famous woman in the world within a decade on her way to building a filmmaking empire.\n\nPickford co-founded the Academy of Motion Picture Arts & Sciences, whose 85th annual Academy Awards ceremony was to be held Sunday. The Academy's late historian Robert Cushman called her \"the most popular, powerful, prominent and influential woman in the history of cinema.\"\n\nPickford (1892-1979) was born in Toronto as Gladys Marie Smith (her stage name would come from her mother's side of the family).\n\nHer father, an alcoholic, left the family when she was 3 and died three years later. Her mother could barely pay the bills with sewing and taking in boarders.\n\nAt 7, Pickford won a part in a local theater production and soon became the family's breadwinner. Two younger siblings joined the stock company and, accompanied by their mother, toured Canada and America.\n\n\"She shouldered the family cause with focus and ruthless efficiency,\" Eileen Whitfield, author of \"Pickford: The Woman Who Made Hollywood,\" told IBD. \"She was tenacious, single-minded, determined, uncomplaining, uncompromising — a fanatic.\"\n\nBig Apple, Big Plan\n\nAfter six years of struggle, Pickford vowed to be in a production on Broadway within a year or she would quit theater entirely. She set her sights on New York's top impresario, David Belasco.\n\n\"Pickford spent most of the summer of 1907 sitting in his outer office on casting days, but went unnoticed,\" wrote Christel Schmidt, editor of a new assessment of her career, \"Mary Pickford: Queen of the Movies.\" \"She decided to seek an introduction and approached the maid of one of his stars, receiving permission to use the star's name. She then caused such a fuss with the office boy that Belasco's manager came out to meet her.\"\n\nWhen Belasco himself met with Pickford a few weeks later, he asked why she had chosen him. Her response: \"My mother always told me to aim high or not at all.\"\n\nCharmed by her chutzpah, he cast her in a supporting role and chose her stage name.\n\nPickford's early lesson is that persistence beyond reason will pay off.\n\nIn 1909, director D.W. Griffith gave Pickford a screen test and was impressed by her grasp of a more intimate type of acting for the camera. He offered her the standard $5 per day, but in a show of brazen self-confidence, she insisted on double that and a guarantee of $40 a week — worth $1,000 today. The following year she traveled to Hollywood with Griffith's crew.\n\n\"She was a naturalistic actor by instinct, feeling her way into character, at a time when broad gestures and melodramatic expressions were common,\" wrote Molly Haskell in the Schmidt volume. \"Director George Cukor said that Pickford invented screen acting and was the first method actress. In appearance alone, she ranges from the winsomely beautiful to the almost unrecognizably, even grotesquely plain. Then there are her amazingly varied incarnations: child, adolescent, and mother; she is a tomboy and coquette; the queen of Herzegovina and a cockney laundress; she is sweet, fierce and ingenious; she plays Spanish, French, Scottish, and even Asian.\"\n\nMost of her movies — such as \"Tess of the Storm Country,\" \"The Poor Little Rich Girl,\" \"Rebecca of Sunnybrook Farm\" and \"Stella Maris\" — were hits. Initially, they didn't mention the names of the cast; even so, Pickford soon became a household name.\n\nIn 1916 she signed an unprecedented contract with the Famous Players studio, giving her half the profits of the movies she starred in, with a guarantee of $500,000 a year (at a time when the average job in the U.S. paid $750), as well as a signing bonus of $300,000 — and $40,000 to compensate her and her mother for the month they spent negotiating the deal.\n\nShe also received creative control of her films. \"Pickford had a reputation as a savvy negotiator who was able to survey the landscape of the industry, assess the value she brought to the endeavor and make sure she was compensated for her contributions,\" said Laura Isabel Serna, a professor at the University of Southern California's School of Cinematic Arts. \"Over the course of her career during the silent period she pursued profitable partnerships with producers and other performers. She managed her own career and was constantly analyzing trends in the types of films audiences preferred and positioning herself to not only make money, but also shape the power of the star system in organizing an entire industry.\"\n\nPickford's lesson is to develop the self-confidence to demand what you deserve.\n\nBonding With America\n\nIn 1918, having become a passionate American citizen, Pickford did an exhausting tour of the U.S. to promote Liberty Bond sales for the World War I effort. She spoke to 50,000 people at one rally on Wall Street, and at a speech in Chicago she raised $5 million, worth $75 million today.\n\nThe next year, Pickford, her boyfriend, actor Douglas Fairbanks; their best friend, actor Charlie Chaplin; and director Griffith formed United Artists. This was an independent production company devoted to letting filmmakers and actors work on projects the way they wanted and distribute movies in the optimum way. Prior to this, studios distributed pictures only to theaters they owned.\n\nThe UA actors whom they regularly worked with shared their vision of artistic integrity and stayed loyal through the firm's financial ups and downs. Some of Pickford's top UA pictures were \"My Best Girl,\" \"Little Lord Fauntleroy,\" \"Sparrows\" and \"Dorothy Vernon of Haddon Hall.\"\n\nIn 1920, Pickford and Fairbanks married and went to Europe for their honeymoon, meeting a mob everywhere from Paris to Moscow.\n\n\"They became the first celebrity supercouple; their movies spread American culture and values around the world and made them the nation's unofficial ambassadors,\" wrote Schmidt.\n\nIn 1927, Pickford was one of three women and 33 men who founded the Academy to promote quality filmmaking. Today, one of its offices in Hollywood is the Pickford Center for Motion Picture Study.\n\nHands-On\n\nPickford became devoted to preservation of early films and spearheaded what is now the Motion Picture & Television Fund to help those in the industry in need.\n\nIn late 1927, the first movie with sound, \"The Jazz Singer,\" debuted. Most stars and directors of the silent-movie era, including Pickford, were convinced it was a passing fad. Yet two years later she became one of the first stars to appear in a talkie. \"Coquette\" was a smash hit and earned her the Academy Award for best actress.\n\nAlthough she had an adequate voice for the new medium, her other sound picture efforts didn't do well at the box office.\n\nMany silent-film producers went under once they turned to sound. Stars from the old era also had trouble. \"Silent-film actors were expected to have the voices that the audience had imagined for them,\" said Whitfield. \"Much of the dialogue in the early talkies was inane or incoherent. Performers spoke with exaggerated diction and were victims of bad recordings. The artists of the silent era were masters of a different, now discarded, art form.\"\n\nIn 1933, Pickford divorced Fairbanks and retired from acting, having appeared in 236 films. She continued to produce for UA. One of her best returns came from the Marx brothers' \"Love Happy\" of 1949.\n\nShe sold her remaining UA shares in 1959 for $3 million, worth $23 million today. Pickford pursued other ventures, including nationally syndicated radio programs, advice columns, writing books and a cosmetics company, as well as philanthropy. In 1976 the Academy honored her with its Lifetime Achievement award.\n\nIn 2009, a documentary, \"Mary Pickford: The Muse of the Movies\" was released to acclaim.\n\nWhen Pickford died at 87, her estate was valued at $10 million, but may have been worth as much as $50 million, says Whitfield. Her charitable work is carried on by the Mary Pickford Foundation. The Mary Pickford Institute for Film Education won an award in 2012 for its use of digital technology."}, {"url": "https://news.amomama.com/230799-inside-mary-pickford-douglas-fairbanks-i.html", "page_content": "Getty Images\n\nIn the history of Hollywood couples, there were none quite as significant as that of the legendary pair, Mary Pickford and Douglas Fairbanks. Both huge names of their time, they were among the first to see a lot of things in the industry.\n\nAdvertisement\n\nMary Pickford and Douglas Fairbanks were both legends in their own right. Fairbank was responsible for bringing to the screen characters like Robin Hood and Zorro.\n\nPickford, a child star, was among the first female actresses to experience paparazzi after hitting the silver screen for the first time. Together, the pair were a power couple.\n\nMary Pickford and Douglas Fairbanks stand at the Grand Central Terminal on November 1, 1931 | Photo: Getty Images\n\nAdvertisement\n\nBOTH CAME FROM PREVIOUS MARRIAGES\n\nTheir relationship was not straightforward, however. Pickford was married to Owen Moore and Fairbanks to Anna Beth Sully when the two met. Pickford was especially concerned with the public perception of her.\n\nShe waited three years to divorce Moore and finally tie the knot with Fairbanks, whom she married after merely three and a half weeks from her divorce finalization.\n\nAdvertisement\n\nOVERWHELMINGLY POSITIVE RESPONSE\n\nDespite her worry that fans would be upset, the public was delighted that the two got married. Both were highly admired and drew crowds at every stop of their honeymoon travels.\n\nTracey Goessel, who wrote a biographical book titled, \"The First King of Hollywood: The Life of Douglas Fairbanks,\" commented on the two's relationship, saying:\n\n\"[Mary and Douglas] embodied the youth, optimism, and energy of their era. And the public interest in their marriage only added fuel to the fire of their fame.\"\n\nAdvertisement\n\nBLISSFUL START TO THEIR UNION\n\nDouglas and Pickford enjoyed their privileged life together, just as they enjoyed each other's company. Goessel claims that they slept together every single night in the first seven years of their union.\n\nThe couple had reconstructed a hunting lodge into a 25-room mansion that features Los Angeles' first in-ground swimming pool. Guests reportedly included F. Scott Fitzgerald, Amelia Earhart, and Albert Einstein.\n\nAdvertisement\n\nA CRUMBLING MARRIAGE\n\nUnfortunately, the couple's bliss would not last. In 1928, after Pickford's mother passed away, the actress turned to drinking. Crossing over to the silver screen was a challenge for both, and trust within the relationship also began to crack.\n\nAfter hearing Fairbanks had flirted with a younger actress, Pickford let her husband get sight of her cozying up with her colleague. Fairbanks, who was a very jealous man, came to believe his wife had cheated.\n\nBoth of them held a sense of mistrust, seeing the other as the initial sinner. Eventually, Pickford did have an affair with her co-star. By 1936, she and Fairbanks got divorced.\n\nAdvertisement\n\nAdvertisement\n\nREGRETS AND DEATH\n\nPickford would get married to Charles Rogers the year after. Fairbanks did attempt to get his wife back but to no avail. He married his lover, an act he came to regret.\n\nIn 1939, Fairbanks passed away from a heart attack. Three daces later, Mary also passed away after years in seclusion at the Beverly Hills mansion. She left behind two adopted children.\n\nFRED AND JOANNE ROGERS' LOVE STORY\n\nA more recent love story in Hollywood is that of the iconic Mister Rogers and his wife, Joanne. Fred Rogers is perhaps the family man for all families in the nation.\n\nAdvertisement\n\nJoanne Rogers at the U.S. Postal Service Dedication of the Mister Rogers Forever Stamp at WQED's Fred Rogers Studio on March 23, 2018 | Photo: Getty Images\n\nHe himself had enjoyed a 50-year marriage to wife Joanne since their meeting during a Rollins College tour. The pair's relationship was built on friendship and humor.\n\nThe two got married in July of 1952. Joanne moved to New York City while Fred worked for NBC. The couple had two sons, Jim and John. Sadly, Fred passed away in 2003 after a bout with stomach cancer."}, {"url": "https://www.biography.com/actors/mary-pickford", "page_content": "(1892-1979)\n\nWho Was Mary Pickford?\n\nIn 1909, Mary Pickford appeared in 40 movies for D.W. Griffith's American Biography company. She also worked as a producer and co-founded United Artists, with Charlie Chaplin, and Douglas Fairbanks, Sr., who would become her second husband. Pickford retired from the screen in 1933 but continued to produce. She died in 1979.\n\nEarly Life\n\nActress, producer and screenwriter Gladys Mary Smith was born on April 8, 1892, in Toronto, Ontario, Canada. Known as \"America’s Sweetheart,\" Mary Pickford was a legendary film actress during the age of silent pictures. She often appeared on screen in young girl roles, even when she was an adult. Pickford began performing at the age of five on the stage and was known for a time as \"Baby Gladys.\" After touring in different shows and productions for more than nine years, she went to New York to conquer Broadway. Taking the stage name, Mary Pickford, she made her Broadway debut in The Warrens of Virginia.\n\nSoon after the show’s run, Pickford got into film, working for D. W. Griffith, a director and head of American Biography Company. At the time, most films were short and she appeared in more than 40 movies in 1909. When Griffith moved his operation to California the following year, Pickford went with him. Over the years, her fame grew as well as her salary. She became an international star, beloved for her beauty and charm.\n\nCreation of United Artists\n\nSome of Pickford’s greatest films were a collaborative effort with friend and writer-director Frances Marion. Together they worked on such hits as Rebecca of Sunnybrook Farm (1917) and Poor Little Rich Girl (1917). Pickford also worked behind the scenes as a producer and founded the United Artists (UA), a film company, in 1919, with Griffith, Charlie Chaplin and Douglas Fairbanks, Sr., who would become her second husband. She had been married to actor Owen Moore and divorced him to be with Fairbanks.\n\nPickford and Fairbanks married in 1920, becoming one of Hollywood’s earliest super couples. Fans adored the pairing, and the couple were known to host fabulous events at their home, called Pickfair, which were attended by many of the leading figures in film.\n\nIn the 1920s, Pickford continued to score more box-office hits with Polyanna (1920) and Little Lord Fauntleroy (1922). She went on to help establish the Academy of Motion Picture Arts and Sciences in 1927. Around this time, the film industry was changing and talking pictures were on the rise. In 1929, Pickford starred in her first talkie Coquette, which explored the dark side of a wealthy family. She won an Academy Award for her work on the film. Still she was never quite able to recreate the phenomenal success she had in silent pictures with the sound films. Her last film was 1933’s Secrets.\n\nLater Years\n\nAfter retiring from the screen, Pickford continued to be involved in filmmaking. She worked as a producer on such films as One Rainy Afternoon (1936), Susie Steps Out (1946) and Sleep, My Love (1948). She also was on the board of directors for UA for many years. She married her third husband, Charles “Buddy” Rogers, in 1937. They adopted two children and stayed together until her death.\n\nDeath\n\nIn her final years, Pickford became reclusive. She largely stayed home at Pickfair and choosing to only see a select few friends. She died on May 29, 1979, in Santa Monica, California.\n\nQUICK FACTS\n\nName: Mary Pickford\n\nBirth Year: 1892\n\nBirth date: April 8, 1892\n\nBirth City: Toronto\n\nBirth Country: Canada\n\nGender: Female\n\nBest Known For: Mary Pickford was a legendary silent film actress and was known as \"America’s Sweetheart.\" She was a founder of United Artists and helped establish the Academy.\n\nIndustries\n\nFilm\n\nAstrological Sign: Aries\n\nDeath Year: 1979\n\nDeath date: May 29, 1979\n\nDeath State: California\n\nDeath City: Santa Monica\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.britannica.com/biography/Mary-Pickford", "page_content": "Mary Pickford, original name Gladys Louise Smith, also known as Gladys Marie Smith, (born April 9, 1892, Toronto, Ontario, Canada—died May 29, 1979, Santa Monica, California, U.S.), Canadian-born American motion-picture actress who was “America’s sweetheart” of the silent screen and one of the first film stars. At the height of her career, she was one of the richest and most famous women in the United States.\n\n(Read Lillian Gish’s 1929 Britannica essay on silent film.)\n\nBritannica Quiz Oscar-Worthy Movie Trivia\n\nGladys Louise Smith grew up in precarious financial circumstances. Shortly after the death of her father, she began taking child’s roles in productions, and soon the rest of the family also began acting. She made her first stage appearance in a Toronto stock company at the age of seven. At eight she went on tour, and within 10 years she was playing on Broadway. She made her New York debut in David Belasco’s The Warrens of Virginia in December 1907. Belasco suggested that she change her name to Mary Pickford. At age 14 she had already learned more about stagecraft than many older actors, and her winsome face, framed by a mass of golden curls, made her appeal virtually irresistible.\n\nPickford began working as a motion-picture extra at D.W. Griffith’s Biograph Company, starring in his 1909 film The Violin Maker of Cremona. Though actors’ names were not listed in film credits, Pickford’s face quickly became well known. After appearing on Broadway in Belasco’s production A Good Little Devil in 1913, she turned permanently to the screen, rising to first rank with Adolph Zukor’s Famous Players Company. Her meteoric rise from an anonymous player to a star with her own production company (Mary Pickford Studios, created in 1916 by Famous Players) was attributable not only to the phenomenal popularity of her films but also to her dedication to her craft and her meticulous care in creating quality entertainments. The ringleted ingenue with an expression of sweet sincerity and invincible innocence that she played in such silent films as Hearts Adrift (1914), The Poor Little Rich Girl (1917), Rebecca of Sunnybrook Farm (1917), Stella Maris (1918), and Johanna Enlists (1918) enthralled audiences everywhere. She was known at first as the “Biograph Girl with the Curls” and then as “Our Mary” when that much of her name was revealed. With the release of Tess of the Storm Country in 1914, she was firmly established as “America’s Sweetheart.” In 1917 First National Films paid her $350,000 for each of three films, including the very successful Daddy-Long-Legs (1919).\n\nIn 1919 Pickford took the lead in organizing the United Artists Corporation with Griffith, Charlie Chaplin, and Douglas Fairbanks. In 1920, after the dissolution of her first marriage (1911–19) to actor Owen Moore, she married Fairbanks (divorced 1936). Pickford’s popularity continued unabated in Pollyanna (1920), Little Lord Fauntleroy (1921), Little Annie Rooney (1925), My Best Girl (1927), Coquette (1929; her first talking picture), The Taming of the Shrew (1929; her only film with Fairbanks), and Kiki (1931). Although she won an Academy Award for best actress for her performance in Coquette, Pickford’s popularity began to wane with the advent of sound.\n\nAfter making Secrets (1933), her 194th film, Pickford retired from the screen. Thereafter she devoted herself to United Artists, of which she was first vice president from 1935 and for which she produced several films. She also wrote Why Not Try God? (1934), The Demi-Widow (1935), and My Rendezvous with Life (1935), and in the 1930s she appeared on radio. In 1937 she married actor Charles (“Buddy”) Rogers. Her later years were spent on business and civic and charitable activities, and she eventually became a recluse at Pickfair, the lavish estate she had built with Fairbanks. Sunshine and Shadow, her autobiography, was published in 1955. She received an honorary Oscar in 1976 for her contributions to film; she accepted the award from Pickfair."}]}