{"Riccardo Tisci's design style at Givenchy was modern and edgy, often featuring bold prints and streetwear-inspired silhouettes.": [{"url": "https://www.vogue.com/article/from-the-archives-riccardo-tisci-givenchy", "page_content": "Legend has it that when the young Italian designer Riccardo Tisci interviewed for the top spot at Givenchy, he was the only candidate not to mention the founder’s muse Audrey Hepburn, the petite actress known for a cool, ladylike perfection. Hepburn was, in short, the polar opposite of the fiery femme fatale Tisci has attracted to his Givenchy, since arriving at the LVMH label in 2005. “Me, I like clothes very painted on the body—really to the millimeter,” the designer told Vogue in 2012.\n\nTicsi’s flame has attracted such glittering divas as Beyoncé and Rihanna, drawn, one imagines, not just to the obvious sex appeal of Tisci’s reveal/conceal dresses, but to their exquisite craftsmanship. Tisci, who designs ready-to-wear and couture, is known for taking traditional feminine and fragile furbelows, like fringe and beads and lace, and using them to express strength. His Catholic upbringing, on the other hand, might explain his tendency to the Gothic and his finely tuned sense of transgression.\n\nGirl power is a subject that Tisci is intimately acquainted with, having been raised, after his father’s early death, by his mother and eight sisters. He has carried this knowledge, and his (Italian) love of family over into his work. Tisci’s posse is creative, diverse, and inclusive—and not just on paper. The designer cast his friend Lea T, who is transgender, in his shows and campaigns. This is but one example of Tisci’s gift for keeping things “real.” He’s a designer who forges genuine connections, to his friends and his clientele, as well as to the street. As the designer told Vogue: “I like to get emotions out of things.” Take a look at 12 years of his sensational work captured in the pages of the magazine."}, {"url": "https://www.vogue.com/article/riccardo-tisci-givenchy-creative-director", "page_content": "If you are one of Riccardo Tisci’s 2 million Instagram followers then you probably know that the Givenchy designer is a star magnet. Not only is Beyoncé a superfan—who wears (and sings about!) his clothes—but he’s also beloved by Madonna, Rihanna, Adele, Rooney, and Naomi.\n\nAs the talented Leo celebrates his birthday, we dig a bit into his bio. Maybe you’ve read that Mariacarla Boscono is this Italian’s muse, but did you know that he has eight sisters and that he surfs more than the Web? Maybe not. This compilation of fascinating tidbits gives a little more insight into Tisci’s world.\n\nPhoto: Courtesy of @riccardotisci17\n\nFamily matters—always.\n\n“I was in the real world from a young age, and I think that is a big influence in my work,” Tisci, the youngest of nine siblings who helped support his family from a young age, told Vogue. What the family lacked in material wealth they made up for with emotional warmth: “In my house there’s always been so much happiness, and always serenity,” the designer said. (And, according to the Financial Times, when Tisci signed with Givenchy he was able to “save the family home.”)"}, {"url": "https://www.nytimes.com/2017/02/02/t-magazine/fashion/riccardo-tisci-givenchy-quit-highlights.html", "page_content": "2) He Was Something of a Red-Carpet Whisperer\n\nTisci’s designs became practically synonymous with award shows, galas — or, really, wherever a celebrity was wearing clothes. He has dressed countless celebrities, including Michelle Obama, Cate Blanchett and Julia Roberts. Madonna sported his designs on red carpets (she wore a design with no derrière to the Met Gala), at her concerts (Tisci created pieces for her 2008 “Sticky & Sweet” tour) as well as at the Super Bowl (he outfitted her for her 2012 performance, above center). Beyoncé wore his designs to the Met Gala for five years in a row, most notably a dress made entirely out of latex (above left) last year. As Tisci told the New York Times’s Jacob Bernstein: “I don’t dress celebrities for the sake of dressing celebrities. I dress people I like.”\n\nImage Riccardo Tisci and Lea T Credit... BFAnyc.com\n\n3) He Pushed Unorthodox Ideas of Beauty\n\nTisci cast his transgender Brazilian-born personal assistant and fit model, Leandra Medeiros Cerezo, in Givenchy’s fall/winter 2010 campaign, introducing her to the fashion world; she dubbed herself Lea T, the “T” standing for “Tisci” because she felt a part of the designer’s family. Tisci continued to promote Lea T as the face of Givenchy, and they paved the way for what most might consider to be nonconventional models. (She has also thrived outside the walls of the French fashion house, becoming the first transgender face of Redken and even appearing on “The Oprah Winfrey Show.”) Tisci championed untraditional ideas of beauty across the board — booking the albino model Stephen Thompson and countless androgynous talents."}, {"url": "https://www.dazeddigital.com/fashion/article/34578/1/how-riccardo-tisci-defined-a-golden-age-at-givenchy", "page_content": "12 years is a long time in any job, but in an era of interchangeable creative directors, Riccardo Tisci’s lengthy tenure seems even more remarkable. Tisci came to Givenchy as an almost unknown – LVMH appointed him to the storied house with only one show of his own to his name (after a few years designing at Ruffo Research). Now, it’s almost impossible to imagine fashion without him, so central has he become to the dialogue around the intersections between fashion, celebrity, and subculture.\n\nTisci’s Givenchy has seen several incarnations. When he first arrived at the house, his aesthetic was pure goth, as epitomised by long term muse and friend, the model Mariacarla Boscono. Tisci’s first collection saw her in black, floor length, witch-y gowns, while other girls got to wear latex headpieces, intricately crafted leather jackets, and many layered tulle skirts. The designer’s preferred look, a strange and sexed up romanticism, was established from his very first outing. From there, he’s been able to play many variations on the theme, from drowned sailor goths, to tribal goths, to Catholic goths, to urban goths, to well, goth goths. It’s not like he invented the colour but, thanks in no small part to Tisci, we’ve spent another good decade in black.\n\n“It’s not like he invented the colour but, thanks in no small part to Tisci, we’ve spent another good decade in black”\n\nIn his menswear, Tisci established just as strong an aesthetic. Leggings under shorts? That was him, whether they be elaborately laced or in ruched leather. Otherwordly facial piercings were another of his trademarks, alongside the now ubiquitous printed t-shirt. Tisci’s preoccupation with streetwear first appeared in his menswear, where he riffed on a sort of slender, high fashion hip hop look, with shorts and oversized t-shirts (that occasionally just happened to be in pink lace). What was once cutting edge now seems commonplace. Slowly this aesthetic seeped into his womenswear, with what looked like luxurious New Era caps, and sweaters that appeared each season in various guises, whether it be the instantly recognizable spliced Bambi graphic, or the snarling rottweilers and panthers. The culmination was in fact his collaboration with Nike, which sold out pretty instantly. Tisci’s men and women were always ‘fierce’, to use an outdated turn of phrase that once sounded marvelously apt."}, {"url": "https://www.vogue.co.uk/article/riccardo-tisci", "page_content": "Riccardo Tisci is the creative director of Givenchy, one of the world's most respected French fashion houses. Since his appointment in 2005, he has made the label his own - adding his own melancholic, often Gothic and sometimes fetishistic, design take.\n\nTisci was born in Taranto, Southern Italy, in 1974. He has\n\neight sisters, something he says has influenced his design\n\naesthetic. \"I love romanticism and sensuality, maybe because I come\n\nfrom a family with eight sisters,\" he told the *New York\n\nTimes* in 2007."}, {"url": "https://graziamagazine.com/articles/riccardo-tisci-givenchy-best-artistic-collaborators/", "page_content": "\n\nThe Givenchy Spring Summer 2016 show was art directed by Tisci’s close collaborator, Marina Abramović\n\nCredit: Victor Virgile/Gamma-Rapho via Getty Images\n\nIt’s likely that, when reflecting on the defining characteristics of his incredible 12-year tenure at Givenchy, people will recall the connections that Riccardo Tisci made with others as readily as they will his breathtaking takes on haute couture and ready-to-wear.\n\nAmongst his contemporaries, the well-connected designer was an early champion of diversity and often unconventional beauty, assembling what he called a ‘gang’ that included transgender model and muse Lea T, Naomi Campbell, Joan Smalls, as well as the musicians ANOHNI and Li Yuchun, amongst others. Tisci was also quick to align himself with celebrities of an ilk that many at the time wouldn’t dream of associating with, creating moments that would guarantee his place in the firmament of fashion and culture.\n\nAnd while his high-profile collaborations – Nike, Beyoncé, Madonna, Kanye West and Jay Z – garnered the Italian designer a great deal of popular acclaim, his many endeavours into other, more quiet creative realms suggested Tisci was interested in much more than high wattage moments.\n\nBelow, revisit five of Riccardo Tisci’s most memorable artistic collaborations over the course of his time at Givenchy.\n\nMarina Abramovic\n\nOn occasion of his tenth year at Givenchy in 2015, Tisci decamped to New York’s Pier 26 to present his women’s spring/summer 2016 collection on the anniversary of 9/11 in the shadow of the Freedom Tower.\n\nTisci’s black-and-white show was art directed by the controversial performance artist Marina Abramovic, who stationed silent performers throughout the show, which for the first time was also open to the public. Their austere performances and Tisci’s universally praised collection of couture-worthy looks proved to be a fitting tribute to the city and an industry that had so warmly embraced him over the course of the last decade.\n\nTisci and Abramobic’s relationship was also the focus of a great deal many more memorable moments during his time at Givenchy. The designer enlisted the artist to feature in his guest-edited ‘Religion’ edition of Visionaire in 2011, which featured a Pietà style image of Ambramovic and Tisci – the designer posing as if breastfeeding from the artist.\n\nIn a much more subdued image, Abramovic also starred in the brand’s Spring/Summer 2013 advertising campaign, shot by Tisci’s good friends, Mert & Marcus.\n\n\n\nPerformers overlook the runway at the Givenchy Spring Summer 2016 fashion show during New York Fashion Week on September 11, 2015\n\nCredit: Catwalking/Getty Images\n\nKehinde Wiley\n\nFor An Economy of Grace, Kehinde Wiley’s first body of work dedicated to all female subjects, the artist asked Tisci to create custom-made couture gowns for each of his street cast models.\n\nPosed in a manner that replicated the historical portraits of society women seen by the artist at the Louvre by artists like Jacques-Louis David, Thomas Gainsborough and John Singer Sargent, among others, the women ranged from Rikers Island prison guards to teen mothers. It was the artist’s intention to create “a rightful place for them within art history, which has to date been an almost exclusively white domain.”\n\n\n\nA work from Kehinde Wiley’s An Economy of Grace, The Two Sisters, 2012, oil on linen, 96″ x 72″\n\nCredit: Courtesy of the artist\n\nBenjamin Shine\n\nIn 2013, Tisci created a line of sweatshirts with the British-born, Canberra-based artist Benjamin Shine, featuring the kind of Madonna-and-Child iconography informed by Tisci’s strict Catholic upbringing that the designer so heavily drew on for his collections – only this time rendered in the artist’s signature tulle formations.\n\nThe following year, Tisci created the first instalment of what would become an ongoing and extremely popular collaboration with Nike, drawing on another reliable component of his design oeuvre – think Fall 2013’s now iconic Bambi sweatshirts and the seasonal variations that have followed.\n\nShine’s collaboration with Tisci also paved the way for his incredible collaboration with John Galliano and Maison Margiela’s most recent Artisanal collection.\n\n\n\nCredit: Courtesy of the artist/Givenchy\n\nPaul Veroude\n\nRumours of Tisci’s departure from Givenchy have been percolating for years. It was at the time that he showed his Spring 2015 Menswear collection that they reached a fever pitch, the intimation being that he was Gucci-bound (Frida Giannini presented what would be her final menswear collection for Gucci the week prior).\n\nIt was in Paris that week, however, that Tisci would issue something of a statement to the contrary.\n\nIn a vast hanger, Tisci’s models circled a deconstructed Cessna that had been “exploded” by the Dutch artist Paul Veroude, whose work celebrates the power of machinery through the process of deconstruction. The almost anatomical, worshipful diagram was also something of a cipher for Tisci’s pious sartorial precision and devotion to his craft.\n\n\n\nAt the Spring 2015 Givenchy menswear show, Dutch sculptor Paul Veroude deconstructed a Cessna for an installation commissioned by the house\n\nCredit: Michel Dufour/Wireimage\n\nM/M Paris\n\nA more surreptitious, though nonetheless significant, collaboration has been the one Tisci has enjoyed with M/M Paris, the creative consultancy helmed by Michael Amzalag and Mathias Augustyniak.\n\nThe acclaimed design duo designed all of Tisci’s show invitations for the house for the duration of his tenure at Givenchy and in 2013, in occasion of their 20th anniversary, Amzalag and Augustyniak released The Givenchy Files to celebrate their ongoing collaboration: a hardback, limited edition tome amassing their always memorable designs for the Parisian house.\n\n\n\n“Celebration”: M/M Paris’s invitation for Riccardo Tisci’s 10th anniversary show, featuring a likeness of Tisci’s chief muse, Italian supermodel Mariacarla Boscono\n\nCredit: M/M Paris/Instagram\n\nTile image: Catwalking/Getty Images\n\nCover image: Courtesy of Benjamin Shine/Givenchy"}, {"url": "https://www.glamour.com/story/best-givenchy-style-moments-riccardo-tisci", "page_content": "Today it was announced that Riccardo Tisci, the beloved Italian-born artistic director of Givenchy, has exited his post at the French haute couture label. The news came as a genuine shock to those who've admired his forward-thinking work during his 12-year tenure at the house, and also to those who appreciated his influence when it came to marrying high fashion and pop culture.\n\nIn recent years Tisci's sculptural designs could be seen on pretty much any major red carpet, thanks to A-listers like Rooney Mara and Meryl Streep. Having a close relationship with Beyoncé, the designer has created the megastar's dresses for the annual Met Gala every year since 2012, as well as several tour costumes. And let's not forget about the Kardashians—for a while, Tisci was the only high-end designer who would dress Kim when she first started dating Kanye West (mostly as a result of Tisci's friendship with West). Fashion insiders might have rolled their at eyes at first, but—as we well know—they quickly followed suit, and the relationship between the reality star and the designer solidified Tisci's status in the pop culture stratum and led him to design one of the most talked-about dresses in decades: Kim's bridal gown for her wedding to West in 2014.\n\nAnd it's not just gowns he's known for, either: The 42-year-old pioneered the notion that streetwear and couture could coexist harmoniously, even within the same look. Tisci started working closely with West when the rapper's image shifted from retired notions of hip-hop dressing to elevated loungewear, arguably kicking off style movements we now know as athleisure and normcore. In 2011 West wore an oversize Givenchy T-shirt emblazoned with a Rottweiler (one of Tisci's signatures) that caused a tabloid frenzy. Almost instantaneously that tee could be seen on any celebrity, street-style star, and fashion-loving human imaginable. The price point was high, but not nearly as high as owning an off-the-runway Givenchy piece, which meant it wasn't impossible to get your hands on Tisci's luxurious streetwear if you were willing to shell out; it could be argued that the designer was a pioneer of democratizing high fashion, creating deceptively affordable It Items we all wanted.\n\nIt also should be said that West first paired his Rottweiler tee with a pleated leather skirt, causing the Internet to basically implode. Now, six years later, we're in a cultural moment when gender norms are being challenged left and right, fashion is more inclusive than ever, and Givenchy is still at the top of the pack while other steeped-in-history French labels are struggling to maintain relevance. Was Tisci on to something? You be the judge.\n\nHere we've rounded up some of the most iconic Givenchy looks that Tisci has been responsible for. We'll just be waiting patiently over here for his next move…."}, {"url": "https://www.lifestyleasia.com/sg/style/fashion/riccardo-tisci-exits-givenchy/", "page_content": "12 years in, and Givenchy without Ricardo Tisci seems like an unfathomable concept. The French maison has been a consistent nucleus of fashion’s forwardness in an ever-changing industry. becoming a powerhouse for electrifying runways, edgy apparel, and meticulous construction. Beyond that, Tisci’s influence has allowed Givenchy to attain the ideal balance of appeal, gripping sartorially-conscious consumers both young and mature.\n\nIn a sudden turn, Tisci announced his departure from Givenchy. His fall menswear and spring couture lines, showcased January 20, were the last he will exhibit under the label. The split was touted to be “mutual and amicable” according to WWD, following the end of his contract on January 31.\n\nThere are no replacements in line to take over Tisci as creative director yet, and the house will not be showing at the upcoming Paris Fashion Week in light of the change. Murmurs are intensifying that Tisci will be joining Versace, who admitted earlier this month that they have been pursuing the designer.\n\nBefore the dust settles and Tisci’s influence becomes divorced from Givenchy entirely, we look back at some of the iconic pieces that’ll remain his legacy."}, {"url": "https://www.nytimes.com/2017/02/02/fashion/riccardo-tisci-givenchy-departure.html", "page_content": "LVMH, which also has brands such as Louis Vuitton, Céline and Fendi in its portfolio, does not break down the performance of individual maisons in its financial results. But the number of employees at Givenchy has more than tripled since Mr. Tisci joined the house in 2005, and sales revenue is believed to have grown to around 500 million euros ($539 million) annually. There are now 72 free-standing stores worldwide (compared with seven in 2005), with a Rome flagship set to open this year, and plans for a London store are underway for next year. Last week, LVMH, the world’s biggest luxury group, posted record revenue and profits for 2016, beating expectations because of strong sales in the United States and Europe and a pickup in demand in Asia.\n\n“Riccardo has accomplished everything a designer can do for a brand, clocking a very respectable tenure and creating a fully realized language for them,” Ms. Fargo said.\n\nSo, why leave?\n\nMr. Tisci said in his statement, “I now wish to focus on my personal interests and passions.” But rumors have suggested he may be headed to Versace. It would mean going home to Italy, and to a brand whose unabashed Italian sex and power-woman aesthetic mirrors his own. And Mr. Tisci is close to Donatella Versace (he shocked fashion in 2015 when he featured Ms. Versace, at least nominally a rival designer, in a Givenchy ad campaign).\n\nBesides, the suggestion, briefly beloved of the industry, that a designer needs a timeout from the increasingly endless show seasons, which was posited when both Mr. Simons and Ms. Waight Keller left their posts, increasingly seems like smoke and mirrors. After Dior, Mr. Simons took an even bigger job at Calvin Klein, and Ms. Waight Keller is said to be moving to a different brand (Givenchy?)."}, {"url": "https://www.theguardian.com/fashion/2013/sep/30/riccardo-tisci-elegance-givenchy-paris-fashion-week", "page_content": "Walking into the Givenchy show space on Sunday evening, editors and buyers at Paris fashion week were greeted by a pile-up of smoking cars. It isn't what most expect from a fashion show but Riccardo Tisci, the creative director of the French house, has become known for his ability to create a fashion week \"moment\". This was a set that suggested such a moment had arrived.\n\nThe show began with a bang – literally. It was soundtracked by Senegalese percussion troupe Sing Sing Rhythms, who played traditional Saba drums live. The front row was peppered with celebrities notably Kanye West and Kim Kardashian all in black, with many wearing last season's Givenchy.\n\nNoomi Rapace, Lily Collins, Kim Kardashian, Kanye West and Ciara attend the Givenchy show. Photograph: Michel Dufour/WireImage\n\nThe clothes saw Tisci take a U-turn from the streetwear influence of last season and head towards something more classical. The show notes suggested an attitude of \"sensuality and strength\". Taking the car pile-up as a metaphor, it felt as if the Givenchy girl's urban dream had crashed to a halt. In its place was something simpler, almost nomadic.\n\nModels close the Givenchy spring/summer 2014 show. Photograph: Charles Platiau/Reuters\n\nClothes that people have worn for hundreds of years were the inspiration. Elements of traditional dress from across the globe, from Indian saris to Japanese kimonos, Masai jewellery to the wraps of Northern Africa, filled the collection. The casting, as always at Givenchy, was equally diverse; the Puerto-Rican supermodel Joan Smalls, a favourite of the brand, led the way for a number of newer faces.\n\nA model wears a glitter mask during the Givenchy show. Photograph: Pascal Le Segretain/Getty Images\n\nIf glitter masks and sequin tabards proved to be Instagram magnets, the collection still featured some subtler hits, such as perfectly tailored trousers, patchworked in red and blue, and a black one-shouldered onesie. Modern draping held the collection together, particularly in the slouchy kneelength silk dresses in an earthy palette that were designed to reveal bandeau bra tops beneath. As much Madame Gres as they were 80s stretch queen Norma Kamali, the dresses will chime with the brand's hip but fashion-savvy fan base.\n\nThe orange sandals that should become the \"it\" item of next summer. Photograph: Pascal Le Segretain/Getty Images\n\nThey were worn with flat two-strap sandals decorated with bold orange jewels along the thick sole – an instant \"it\" shoe for next summer. Tisci might have reduced his direct references to the streets but this collection's fusions will still appeal to women eager to wear his designs."}]}