{"Riccardo Tisci collaborated with high-profile celebrities, including Madonna, Kanye West, and Beyoncé, during his time at Givenchy.": [{"url": "https://www.vogue.co.uk/article/riccardo-tisci", "page_content": "Riccardo Tisci is the creative director of Givenchy, one of the world's most respected French fashion houses. Since his appointment in 2005, he has made the label his own - adding his own melancholic, often Gothic and sometimes fetishistic, design take.\n\nTisci was born in Taranto, Southern Italy, in 1974. He has\n\neight sisters, something he says has influenced his design\n\naesthetic. \"I love romanticism and sensuality, maybe because I come\n\nfrom a family with eight sisters,\" he told the *New York\n\nTimes* in 2007."}, {"url": "https://www.glamour.com/story/kim-kardashian-riccardo-tisci-fashion-friendship", "page_content": "It’s rumored that the E! star had been shut out from one of the fashion industry’s biggest events, the Met Gala, for years. (West was reportedly forced to attend solo in 2012 because of this.) But when Tisci was tapped to cochair the ball in 2013, he insisted that Kardashian attend—naysayers be damned. “I needed to have my gang with me, and Anna [Wintour] understood,” he told The Hollywood Reporter. “Not everyone was positive about it—fine. I say, ‘It's your problem if you have a problem with Kim coming.’”\n\nTisci also dressed Kardashian, then pregnant with her and West’s first child, for her big Met Gala debut in a long-sleeved floral gown with matching gloves that drew mixed reactions from press and fans alike—still, it was far and away the night’s most talked- and tweeted-about look, establishing Kardashian’s style-star status practically overnight.\n\nJamie McCarthy\n\nEven with Tisci’s support, though, Kardashian continued to face fashion roadblocks: After she appeared in a spread for Elle’s March 2013 issue, stylist Nicola Formichetti admitted that it was “a challenge” to call in designer samples for her shoot. “People wouldn’t lend me the clothes,” he told the magazine. “But that’s fashion snobbery.”\n\nWhile Tisci’s newly minted muse benefited plenty from their partnership, it could be said that his own brand also reaped some of the rewards as well: In 2013, Givenchy was the eighth most googled high-fashion brand, cracking the top 10 for the first time ever—thanks in large part to Kardashian’s Met Gala dress, along with her first post-baby appearance with West at Givenchy’s runway show that September. Kardashian, meanwhile, was the year’s third most googled person."}, {"url": "https://graziamagazine.com/articles/riccardo-tisci-givenchy-best-artistic-collaborators/", "page_content": "\n\nThe Givenchy Spring Summer 2016 show was art directed by Tisci’s close collaborator, Marina Abramović\n\nCredit: Victor Virgile/Gamma-Rapho via Getty Images\n\nIt’s likely that, when reflecting on the defining characteristics of his incredible 12-year tenure at Givenchy, people will recall the connections that Riccardo Tisci made with others as readily as they will his breathtaking takes on haute couture and ready-to-wear.\n\nAmongst his contemporaries, the well-connected designer was an early champion of diversity and often unconventional beauty, assembling what he called a ‘gang’ that included transgender model and muse Lea T, Naomi Campbell, Joan Smalls, as well as the musicians ANOHNI and Li Yuchun, amongst others. Tisci was also quick to align himself with celebrities of an ilk that many at the time wouldn’t dream of associating with, creating moments that would guarantee his place in the firmament of fashion and culture.\n\nAnd while his high-profile collaborations – Nike, Beyoncé, Madonna, Kanye West and Jay Z – garnered the Italian designer a great deal of popular acclaim, his many endeavours into other, more quiet creative realms suggested Tisci was interested in much more than high wattage moments.\n\nBelow, revisit five of Riccardo Tisci’s most memorable artistic collaborations over the course of his time at Givenchy.\n\nMarina Abramovic\n\nOn occasion of his tenth year at Givenchy in 2015, Tisci decamped to New York’s Pier 26 to present his women’s spring/summer 2016 collection on the anniversary of 9/11 in the shadow of the Freedom Tower.\n\nTisci’s black-and-white show was art directed by the controversial performance artist Marina Abramovic, who stationed silent performers throughout the show, which for the first time was also open to the public. Their austere performances and Tisci’s universally praised collection of couture-worthy looks proved to be a fitting tribute to the city and an industry that had so warmly embraced him over the course of the last decade.\n\nTisci and Abramobic’s relationship was also the focus of a great deal many more memorable moments during his time at Givenchy. The designer enlisted the artist to feature in his guest-edited ‘Religion’ edition of Visionaire in 2011, which featured a Pietà style image of Ambramovic and Tisci – the designer posing as if breastfeeding from the artist.\n\nIn a much more subdued image, Abramovic also starred in the brand’s Spring/Summer 2013 advertising campaign, shot by Tisci’s good friends, Mert & Marcus.\n\n\n\nPerformers overlook the runway at the Givenchy Spring Summer 2016 fashion show during New York Fashion Week on September 11, 2015\n\nCredit: Catwalking/Getty Images\n\nKehinde Wiley\n\nFor An Economy of Grace, Kehinde Wiley’s first body of work dedicated to all female subjects, the artist asked Tisci to create custom-made couture gowns for each of his street cast models.\n\nPosed in a manner that replicated the historical portraits of society women seen by the artist at the Louvre by artists like Jacques-Louis David, Thomas Gainsborough and John Singer Sargent, among others, the women ranged from Rikers Island prison guards to teen mothers. It was the artist’s intention to create “a rightful place for them within art history, which has to date been an almost exclusively white domain.”\n\n\n\nA work from Kehinde Wiley’s An Economy of Grace, The Two Sisters, 2012, oil on linen, 96″ x 72″\n\nCredit: Courtesy of the artist\n\nBenjamin Shine\n\nIn 2013, Tisci created a line of sweatshirts with the British-born, Canberra-based artist Benjamin Shine, featuring the kind of Madonna-and-Child iconography informed by Tisci’s strict Catholic upbringing that the designer so heavily drew on for his collections – only this time rendered in the artist’s signature tulle formations.\n\nThe following year, Tisci created the first instalment of what would become an ongoing and extremely popular collaboration with Nike, drawing on another reliable component of his design oeuvre – think Fall 2013’s now iconic Bambi sweatshirts and the seasonal variations that have followed.\n\nShine’s collaboration with Tisci also paved the way for his incredible collaboration with John Galliano and Maison Margiela’s most recent Artisanal collection.\n\n\n\nCredit: Courtesy of the artist/Givenchy\n\nPaul Veroude\n\nRumours of Tisci’s departure from Givenchy have been percolating for years. It was at the time that he showed his Spring 2015 Menswear collection that they reached a fever pitch, the intimation being that he was Gucci-bound (Frida Giannini presented what would be her final menswear collection for Gucci the week prior).\n\nIt was in Paris that week, however, that Tisci would issue something of a statement to the contrary.\n\nIn a vast hanger, Tisci’s models circled a deconstructed Cessna that had been “exploded” by the Dutch artist Paul Veroude, whose work celebrates the power of machinery through the process of deconstruction. The almost anatomical, worshipful diagram was also something of a cipher for Tisci’s pious sartorial precision and devotion to his craft.\n\n\n\nAt the Spring 2015 Givenchy menswear show, Dutch sculptor Paul Veroude deconstructed a Cessna for an installation commissioned by the house\n\nCredit: Michel Dufour/Wireimage\n\nM/M Paris\n\nA more surreptitious, though nonetheless significant, collaboration has been the one Tisci has enjoyed with M/M Paris, the creative consultancy helmed by Michael Amzalag and Mathias Augustyniak.\n\nThe acclaimed design duo designed all of Tisci’s show invitations for the house for the duration of his tenure at Givenchy and in 2013, in occasion of their 20th anniversary, Amzalag and Augustyniak released The Givenchy Files to celebrate their ongoing collaboration: a hardback, limited edition tome amassing their always memorable designs for the Parisian house.\n\n\n\n“Celebration”: M/M Paris’s invitation for Riccardo Tisci’s 10th anniversary show, featuring a likeness of Tisci’s chief muse, Italian supermodel Mariacarla Boscono\n\nCredit: M/M Paris/Instagram\n\nTile image: Catwalking/Getty Images\n\nCover image: Courtesy of Benjamin Shine/Givenchy"}, {"url": "https://www.vogue.co.uk/fashion/article/riccardo-tisci-life-in-looks", "page_content": "After bowing out of his creative directorship at Burberry with a goth-at-the-beach spring/summer 2023 show and Shakira-fronted Christmas campaign, Riccardo Tisci is taking a break. But don’t think he’s forgotten about the industry completely. Already, the designer has fashioned his first solo work in 17 years for friend Michaela Coel and now, he’s sifted through his vast archive to compile his Life in Looks for British Vogue. For a man who has collaborated with Madonna, Beyoncé and Rihanna, and calls Naomi Campbell and Mariacarla Boscono muses and sisters, this is no mean feat. It was also, says Tisci, highly emotional.\n\nWhile there have been obvious professional highs – including the first Riccardo Tisci show, which saw friends Karen Elson and Liya Kebede model his anti-polished, pro-gothic looks for free, and Givenchy’s anniversary show during which the rain clouds parted and a glorious sunset backdropped his darkly sensual work – many of the Italian’s creatives wins are deeply personal. He accepted that coveted Givenchy contract in 2005, for example, not because of the prestige, but because of the pay cheque that would enable him to save his mother from selling the family home to make ends meet.\n\nTisci’s collaboration with Nike, back when it was unheard of for a couturier to elevate sportswear into high fashion, was also rooted in a childhood where a simple pair of trainers acted as a great leveller and allowed him to fit in. And so, years down the line, when industry outsider Kim Kardashian was not considered in vogue, it was Tisci who stepped forward to dress the then-heavily pregnant reality TV star for the 2013 Met Gala – an event she was only allowed to attend as the plus one of Kanye West. The blossoming rose gown he made was symbolic of the woman he saw: a strong individual expressing one of the most powerful acts of femininity.\n\nIt is unsurprising, then, that before Tisci’s next move (a new vacancy at Gucci has just become available), he is taking stock of his core values: making his new house in London a home, spending time with the eight sisters who shaped him and, he reveals, “trying to have a child”. Rather than jumping into the next project, “simplicity” is the biggest trend in Tisci’s life right now – and it looks good. Watch the designer talk through every major stepping stone on his journey so far, below."}, {"url": "https://www.gq.com/gallery/the-unabridged-history-of-kanye-west-as-fashion-designerand-the-11-year-road-to-todays-adidas-show", "page_content": "**November/December 2013: Kanye’s Radio Press Tour Features More Shots at the Fashion Industry **\n\nWhen Nike didn’t offer Kanye the design deal he felt he deserved—one that should have included royalties on every pair of sneakers sold, according to an interview West gave to Hot 97 personality Angie Martinez—he lampooned the brand for “marginalizing” him due to his celebrity status. West told Martinez about a time when he asked Nike when the Air Yeezy 2 Red Octobers were set to release. When they replied, “We don’t know,” he took it as a sign that he was being cut out of the brand’s braintrust and, above all, completely undervalued as a creative entity. On the Breakfast Club radio show in November 2013, he said, incredulously, that Nike had not asked him to design new products in almost three years despite the success of the Yeezys. In West’s view, Nike had grown weary of his accomplishments, fearing that by giving him a broader design deal, they would be opening the door for his products to eventually compete with, or even overshadow, Nike’s main line designs. As West said in a separate radio interview with Hot 97, “As soon as [the Yeezy] was too big, it’s scary. Nike is, like, ‘No. We’re not going to let you blow to [that] level. We already have Jordan Brand, we already have that one baby. And we don’t even like that we have to compete with brand Jordan.”\n\nTo further expand his point, West then went on Power 99 radio in Philadelphia and described how big name fashion brands don’t respect the influence people like him—specifically, black rappers—have on consumers. “[They’re], like, ‘All you can do is promote our products…all we want to do is keep serving y’all with these Louis Vuitton prints until none of your bills are paid.” He then went on to describe his issue with the way that “good design” seems to only be available to those with money. “I had a conversation [with Alexander Wang],” West told the station, “just from a philanthropist perspective, as an influencer of clothing. I bought the $1,000 dollar Balenciaga sneakers because I thought it had a nice shape. Now there’s kids saving up their check for four weeks because it does have a nice shape, and they also saw me wear it. But these kids don’t need to be buying no $1,000 sneakers, and the shape that is good doesn’t have to be $1000.” Ultimately, it seems his need for corporate structure stems further than just job security, but as a way to keep costs down and get his designs onto as many people as possible by designing clothes that are available at a democratic price."}, {"url": "https://www.wmagazine.com/story/riccardo-tisci-a-beyonce-and-kim-kardashian-favorite-leaves-givenchy", "page_content": "Riccardo Tisci will exit the house of Givenchy after serving nearly 12 years as its chief designer. The longest-serving creative director aside from Hubert de Givenchy himself, Tisci helped push the French house to a cultural relevance it had not seen in years. With a flair for adding gothic touches and a speed dial that seemed to include everyone from Kim Kardashian and Beyoncé to Marina Abramović and Pedro Almodovar, Tisci’s influence, both at the legacy French house and on his own, is felt throughout culture.\n\nIn a statement on Instagram attached to a picture of a sun setting, Tisci wished a public farewell to his Givenchy staff.\n\n“A giant heartfelt thank you to #givenchy, #lvmh, my incredible team, the magical atelier and everyone who made these 93 collections possible and all the other crazy adventures,” he wrote. “Your love and support, in the day and in the night, will forever remain in my heart.”\n\nOn Twitter he was blunter, simply writing, “That’s all, Folks!”\n\nThe news comes just a short time after the Italian-born designer showed both the label’s Fall 2017 men’s collection and Fall 2017 couture. WWD reports that his split from the company was effective as of January 31st, after his most recent contract expired. Givenchy’s parent company LVMH, which also owns Louis Vuitton and Dior, will have its in-house studio design the fall collection to show retailers in lieu of a runway show on March 5 during the upcoming Paris Fashion Week, though custom dresses Tisci was working on for celebrity clients for both the Grammy and Academy Awards red carpets will still be completed. Fittingly, Givenchy became a red carpet favorite under Tisci’s tenure.\n\nTisci’s exit comes amid growing speculation that he may take over the reigns at Versace. Tisci, who is from Southern Italy, is good friends with Donatella Versace, and even took the unusual step of casting the competing designer in Givenchy’s own ad campaign back in 2015. And just eight weeks ago, Tisci posted a picture of Gianni Versace on Instagram to commemorate the late designer’s birthday and hashtagged the photo with “#idol” and “#master.”\n\nFor the moment, however, indications of his future plans remain just that—speculation.\n\nTisci had brought stability to a couture house the had come to be known as something of a springboard after the 1995 retirement of Monsieur de Givenchy. John Galliano briefly held the position of creative director for two years after Givenchy’s retirement, but the English designer was quickly reassigned to fellow LVMH brand Dior and Alexander McQueen, who replaced Galliano, didn’t stay long either and found greater success with his namesake label. Julien MacDonald helmed the house in the early ’00s, but his time is mostly forgotten. Tisci was named creative director of couture and the women’s line in 2005, and soon took over duties as the menswear designer in 2007.\n\nHe had a gift for putting high fashion in touch with popular culture without necessarily cheapening the brand. He designed Kardashian’s wedding gown for her marriage to Kanye West, for instance. Givenchy T-shirts bearing images of an angry rottweilers and Disney’s Bambi became streetwear sensations. He also designed tour costumes for Beyoncé, Rihanna and Madonna.\n\nTisci had a direct line several artistic and underground figures as well, like Abramovic and the musician Anohni, for whom he art directed a Naomi Campbell-starring music video called “Drone Bomb Me. Tisci was also an early champion of transgender models on the runway—Lea T, a transgender model, is a close friend and frequent muse and model for the house.\n\nWith Tisci’s flair for capturing the interest of high culture, pop culture and underground culture, it only seemed natural that the designer would one day be destined for bigger things. Only time will tell where he goes next, though it’s unlikely we’ll have to wait long for more clarification.\n\nEvery Time Beyoncé Slayed in Givenchy Beyoncé in Givenchy at the 2015 Met Ball. Photo by Sherly Rabbani and Josephine Solimene. Jay Z and Beyonce in Givenchy at the 2014 Met Ball. Photo by Sherly Rabbani and Josephine Solimene. Beyoncé Knowles in Givenchy Haute Couture at the 2012 Met Ball. Givenchy by Riccardo Tisci’s silk satin bra and skirt, mink glasses, and necklace. Photographer: Patrick Demarchelier Stylist: Alex White Marc Jacobs’s silk organza top; Givenchy by Riccardo Tisci’s silk satin bra; Atsuko Kudo’s latex briefs. Prabal Gurung gloves; Marc Jacobs headband; Ofira’s 18k black gold, sapphire, and diamond earrings; Louis Vuitton belt, socks, and shoes; Wolford hosiery. Beauty Note: Showstopping eyes are easily mastered with L’Oréal Paris Studio Secrets Professional Color Smokes Eye Shadow in Blackened Smokes. Photographer: Patrick Demarchelier Stylist: Alex White Givenchy by Riccardo Tisci’s angora sweater, crinoline and wool skirt, cap, and shoes. Lorraine Schwartz’s 18k white gold and emerald earrings, David Yurman’s 18k yellow gold and diamond ring. Beauty Note: Hair stays shiny and smooth with L’Oréal Paris EverSleek Humidity Defying Leave-In Crème. Photographer: Patrick Demarchelier Stylist: Alex White Beyoncé wears Louis Vuitton’s silk top, cashmere shorts, hat, and mask; Givenchy by Riccardo Tisci’s silk satin bra. Lorraine Schwartz’s earrings, ­David Yurman’s ring. Marc Jacobs’s cotton and silk lace blouse; Givenchy by Riccardo Tisci’s silk satin bra; Louis Vuitton’s leather and fur shorts. Marc Jacobs beret; David Yurman’s silver, black rhodium, and diamond earrings; de Grisogono’s 18k white gold and diamond cuff; Givenchy by Riccardo Tisci shoes. Photographer: Patrick Demarchelier Stylist: Alex White INFO 1/8\n\nWatch Riccardo Tisci recount his wild 40th birthday party:"}, {"url": "https://www.highsnobiety.com/p/riccardo-tisci-kanye-west-kim-kardashian/", "page_content": "It's no secret that Italian fashion designer Riccardo Tisci has a number of close celebrity friends. Probably first to come to mind are it couple Kanye West and Kim Kardashian. Upon forging a relationship with 'Ye years ago, Tisci then got to know Kim off of the strength of Kanye, as he then became quite find of her as well.\n\nAt the time, the Armenian goddess wasn't nearly as accepted in fashion circles, but Riccardo didn't care. It was a family thing. \"By nobody,\" Tisci said when speaking on Kim and her lack of acceptance. \"And she’s a sweet girl. And Kanye and me, we did it together. Every designer is dying to dress her now. I didn’t care what people thought about Kim. In the beginning, I met her because of my respect for Kanye, and then I liked her a lot and we became friends. I got killed because of this. But I didn’t care. That is a friend, you see. And this is why, when they got married, they asked me to dress them. They say, 'You’ve always been with us. You’ve been a real friend.' If I like somebody, I like somebody. If I don’t like somebody, I don’t like somebody.\"\n\nTisci has also had his hands of design in Kanye and Jay Z's Watch the Throne tour, Rihanna's 'Diamonds' tour and Jay Z and Beyonce's 'On the Run' tour, to name additional Kanye West connections.\n\nTo dig into this entire sit-down that Riccardo Tisci had with Yahoo Style, simply follow here."}, {"url": "https://www.businessoffashion.com/community/people/riccardo-tisci", "page_content": "Riccardo Tisci is an Italian designer, renowned for his work at Givenchy, a French house that Tisci resurrected to its former profitable glory and his latest work at Burbery. Impressively, the designer crafted distinct brand identities for all of Givenchy’s product categories across women’s and men’s ready-to-wear and haute couture lines. At Burberry, he lifted sales after faltering period, and revamping the company's brand identity.\n\nTisci grew up in a tight-knit, single-parent, working-class family in Italy. The designer describes his family life as hugely influential on him and remembers his childhood as one filled with love. Tisci left regular school aged 11 to enroll in art school in Milan. “I wanted to express myself and I couldn't really do it through words at that point,\" he told The Daily Telegraph. The designer was selected for a scholarship by Central Saint Martins, from which he graduated in 1999. He then held design positions at Puma, Antonio Berardi and with Ruffo Research, before embarking on his own brand in 2004. As a result of his bold, powerfully-feminine designs, Tisci was announced as the creative director of Givenchy’s womenswear and haute couture lines in 2005. After announcing his amicable departure from the house in February 2017 with a subsequent sabbatical, Tisci was named chief creative officer at Burberry in March 2018, succeeding Christopher Bailey .\n\nTisci’s creations found willing consumers immediately; the designer’s vision for Givenchy initially found traction with consumers rather than editors. In just two years Tisci had revitalised the house’s couture business. He chose to stop showing couture in 2012, taking the business behind the scenes in-house once more.\n\nIn May 2008 he was appointed chief designer of menswear and menswear accessories in addition to his womenswear role. His menswear collections have received rampant critical acclaim and caused the formation of tribe-like followers, many of whom, such as Kanye West, are very much in the public eye. Tisci’s marriage of streetwear influences, Parisian sensibilities and global motifs made Givenchy’s printed sweatshirts a fashion staple, as well as broadening the brand’s appeal exponentially.\n\nFollowing over a decade of experience at the creative helm of Givenchy, Tisci transitioned to Burberry, an announcement that sent share prices soaring by over 5 percent. Joining Marco Gobetti a second time, who also joined Burberry as its chief executive following a stint at Givenchy, Tisci took on plans to reinvigorate product and consumer experiences and expand Burberry's first venture into high end streetwear after a partnership with Gosha Rubchinsky in 2018. Under Tisci's watch, both Burberry's London flagship location and it's monogram logo underwent a revamp, the latter of which debuted with a series of international pop-up installations featuring the new Peter Saville -designed Burberry logo. Following the highly anticipated first Spring/Summer 2019 collection and logo redesign, Burberry reported a 4 percent rise in first quarter comparable store sales in 2019."}, {"url": "https://www.hollywoodreporter.com/news/general-news/givenchys-riccardo-tisci-why-he-782524/#!", "page_content": "This story first appeared in the March 27 issue of The Hollywood Reporter magazine.\n\nA smartly dressed sea of Parisians are gathered in an apartment replete with gilt moldings and white flowers on historic Rue de Presbourg. At the center of the black-swathed, expensive clutch-carrying creme de la creme de la French fashion crowd is a slender Italian man in an untucked red plaid shirt and white sneakers. You’d never know by his attire that he’s the most important person in the room — a room that contains Jessica Chastain, Amanda Seyfried, Kim Kardashian, Kanye West and Katy Perry — except you do. Fresh from his startling fall 2015 show, Givenchy head designer Riccardo Tisci is “having a moment,” as he puts it, atop the international luxury brand mountain.\n\nDuring the recent awards season alone, he dressed Julianne Moore twice, Julia Roberts, Chastain, Rosamund Pike and even Jared Leto in his lavender Oscars tux. He created Madonna‘s two Grammy looks, not to mention her 2012 Super Bowl looks. Among his most conspicuous achievements is having made Kardashian’s gown and West’s tux for their 2014 wedding, which he attended. Now 10 years in as creative director of Givenchy — overseeing women’s haute couture and ready-to-wear as well as men’s, shoes, bags and accessories — the 40-year-old Tisci (pronounced “Tissi”) is carrying on the tradition of Hubert de Givenchy, whose association with Hollywood is legend as the couturier of choice for Audrey Hepburn. On the business side, the brand, owned by LVMH, reportedly brought in more than $270 million in revenue in 2013, followed by a huge retail expansion with more than 20 openings in 2014. During the past several years, Beyonce, Claire Danes, Jennifer Connelly, Naomi Watts and Rihanna (whose 2013 tour costumes Tisci also designed) all have graced major carpets in Givenchy.\n\nBlanchett at the 2011 Oscars in lavender Givenchy.\n\nRead more Front Row Report, Givenchy: Kim, Kanye and Katy Perry Attend the Show\n\nThe evening after the party, Tisci is perched on a divan in the Givenchy couture building atelier where Hepburn did fittings with Hubert. “He was one of the first Parisian designers working in Hollywood,” says Tisci in a thick Italian accent. “It’s a very strong feeling when I’m working in here. It reminds me that the world I live in is amazing.”\n\nTisci was installed at Givenchy in 2005, having worked only for Puma, Ruffo Research and on one season of his own line. He had practically no reputation; expectations weren’t high. Being shrewd, he knew how to handle that. “I didn’t do any interviews at the beginning,” he says. “I really wanted people to forget Givenchy a little bit — and to gain back the respect. The first big emotional moment for me was Nicole Kidman in a black dress in 2007. Then Naomi Watts chose a striped dress — another moment! We did a Mermaid collection in 2007 couture, and there were three dresses my team didn’t love. But I was obsessed with one of those black dresses. Then Cate Blanchett wears it in Berlin! I was shocked. Even my mother was shocked!”\n\nPike in her 2015 Oscars dress, which Tisci coaxed her to wear.\n\nThe relationship with Blanchett grew to include Oscar and SAG Awards gowns. “My favorite Oscar look of all time is the lavender gown on Cate in 2011,” says Blanchett’s stylist, Elizabeth Stewart (who also works with Chastain and Seyfried). “Riccardo holds a very special place in my heart. When he shot Amanda Seyfried for his campaign a few years back, the look was pure him and pure her — that takes talent.”\n\nRead more Riccardo Tisci Opens Men’s Givenchy Store in Paris\n\nA week after his Blanchett moment, “I get a call from Madonna,” recalls Tisci. It turned out to be the beginning of a beautiful friendship: “In magazines I’d seen her wearing a few of our pieces. Then I did the Latin collection in 2008, and Madonna’s stylist Arianne Phillips wanted a dress for a video. A few days after, I get a call from Madonna herself to meet me in New York. Can you imagine? The ultimate icon.” At the meeting, the pop star diffused Tisci’s nerves with “a joke that made me turn red! Now we are friends. I know what she likes. I know what she wants to show of her body — like all women.”\n\nOne of Tisci’s unique talents is knowing how to flatter a shape and make a woman look like a bombshell — albeit a sophisticated one. “Some women are very aware of the best of their bodies,” he says. “Some are not. Me, I’m very honest. We work with some princesses, and I say, ‘Baby, that’s not right.’ I won’t argue, but I will be upfront. It’s my job to tell them what looks best. Cate, Madonna or Jessica, when you start knowing them and their bodies well after years, it’s easy. With Rosamund [Pike at the Oscars], she listened to me a bit more because she has a fear of fashion, and I wanted for her a big fashion moment. I said, ‘For me, this is what you should do.’ She was afraid of the red; she almost didn’t wear it. But she went for it — it was a moment!”\n\nFor the 2013 Met Gala, Tisci dressed Mara, who says, “Riccardo combines two of my favorite things: romance with a bit of edge. His dresses feel of-the-moment or even of-the-future — a little bit gothic, a little bit punk, always unique.”\n\nOscar nominee Pike confirms the story: “Riccardo has a fire in his belly! There’s an enfant terrible inside of him. He wanted the dress to have a corset and a big split up the front, which was really bold. I felt very vulnerable about an Oscar dress — you can be eaten alive! Then I realized, in the end, it made me feel relaxed, free and even safe.”\n\nSee more Paris Fashion Week’s Front Row\n\nAmong designers who often work with Hollywood — Dior, Lanvin, Valentino, Chanel, Michael Kors — Tisci truly is friends with what he calls his “tribe”: Chastain, Madonna, Rooney Mara (who wore Givenchy throughout the 2012 awards season), Kim and Kanye, Seyfried and Moore. Italian family obsession drives him to such intimacy: He has eight sisters and is close to his mother, who sits front row at every show. “For me, it’s not so much the girls of the moment,” he says. “Sometimes we make clothes for an actress with no projects out, possibly not even famous yet. I don’t use stars to sell clothes — I dress my friends. People talk about the movie business, the fashion business. It’s about people for me.” What traits does his “tribe” share? “Intelligence first. Beauty is great, but not when you have nothing to say. They are confident. They have talent.” Significantly, in an age of red-carpet appearance fees, Instagram endorsements and brand ambassadors, Givenchy never has paid a star to wear the brand. “I find that very sad, very cynical,” says Tisci. “It shouldn’t be about money; it should be about beauty, passion and family.”\n\nMoore, one of Tisci’s “tribe,” in Givenchy haute couture at the 2015 SAG Awards.\n\nHaving graduated from London design school Central Saint Martins (where John Galliano and Alexander McQueen also went before stints at Givenchy), Tisci was ready for Paris couture with his first Givenchy show in July 2005 (couture only being done during the past decade by the likes of Chanel, Valentino, Dior, Armani and Elie Saab). Despite several highly successful seasons, he suspended couture shows in 2012: “All these women working on one dress — it can take 300 hours to make a top! And people saw it from a runway and couldn’t see the workmanship. So I do couture for Hollywood and real life. When actresses wear these dresses at major events, the world is watching. The way we do couture now is personal — it’s modern.” Says Moore, who sported couture during the recent awards season: “Riccardo is always present for fittings for major events — I love it. He’s so precise about fit and proportion. When he designed my Golden Globes dress, he submitted 40 sketches. Leslie [Fremar, Moore’s stylist] and I were blown away! We winnowed to three, and I wore two. Both were spectacular.” Adds Fremar: “Coming from Vogue, I know that in some fashion circles Hollywood is secondary. Some designers still have a hard time embracing the red carpet. Riccardo loves it! He’s so passionate. When we asked for an awards-season dress, he sent a book! Not everyone can interpret a body into a shape. His dresses fit like a glove: amazing on paper, better in person.”\n\nRead more Kim Kardashian Wears Givenchy to Her Wedding (Photo)\n\nFremar is among a lucky few. “We do say no a lot,” says Tisci of the many requests from actresses and stylists, “and I’m very upfront about it. Not rude. I say: ‘I don’t think we are right for you, and you are probably not right for us. Why should we waste time?’ ” With no hesitation, he mentions his favorite stylists: Fremar, Stewart and Phillips. “I work with people who know what they want,” says Tisci. “It can be the person who completes the relationship between you and the actress: A third opinion can be very important. But I’ve been in a situation where I had to tell the stylist to shut up.”\n\nStewart has put Roberts in a number of Givenchy looks — a jumpsuit at the recent SAG Awards, a lace peplum gown at the 2014 Oscars — so it wasn’t a huge surprise when Tisci reached out for the actress to star in his spring 2015 ad campaign. But it was shocking when the somewhat anti-style Oscar winner, who never had done a fashion campaign, said yes. The black-and-white result of Roberts in a brilliantly cut suit (for which she reportedly was paid less than $1 million, compared with Jennifer Lawrence‘s $15 million Dior campaign) “was a big success because she let herself go, with very little hair and makeup,” he says. “It’s a new way of seeing Julia.”\n\nGivenchy and Audrey Hepburn at a 1958 fitting.\n\nThen there’s Kardashian. It was Tisci who made her a person of fashion interest. “Kanye is a friend for seven years,” he explains, “so when he called me up and said, ‘I’m dating a girl; I want you to meet her,’ I jumped. She’s intelligent, sweet, beautiful. She’s the girlfriend of my friend. I’m not into judgment. She started coming to my shows, and some people criticized me. But I love Kanye and now I love Kim, and I didn’t care what people thought.” Tisci invited Kardashian to the 2013 Met Ball, which he co-hosted. “I needed to have my gang with me, and Anna [Wintour] understood. Not everyone was positive about it — fine. I say, ‘It’s your problem if you have a problem with Kim coming.’ Then, after two years, I was proud when she received the cover of American Vogue. Four or five years ago, no fashion house would touch her. But Kim represents the woman of today — she defines society today.”\n\nRead more Fashion Month: 10 Doppelgangers on the Runways\n\nTisci himself has been a subject of speculation, for being offered the stewardship of Dior before Raf Simons took the job; Gucci, even before Frida Giannini resigned; and Chanel, as Karl Lagerfeld‘s possible heir. “I know,” he says with a laugh. “I think it’s a compliment. I don’t call myself a genius; I just want to do my job properly. I literally saved this house of Givenchy out of pure love,” he declares, showing major confidence, for he believes in nothing so much as his design talent — a faith validated by wildly enthusiastic reviews (often commenting on his goth sensibilities, which Tisci deems “dark romance”) and sales. Most of his fall 2015 collection sold out before it hit a store floor.\n\nAudrey Hepburn donned Givenchy in 1954’s ‘Sabrina.’\n\nIn contrast to his bold collections, Tisci constantly describes himself as “shy.” But his personal Instagram posts — his 40th birthday in Ibiza, vacations in St. Tropez — have won him many fashion fans, and the Givenchy brand’s feed has 1.8 million followers. “When I was a teenager — I grew up quite poor [in Como, Italy] — I cut out pictures to make fashion scrapbooks. Now Instagram is my scrapbook. If it gives kids hope that they can live their dreams, then it’s positive.”\n\nTisci’s fall 2015 show was set in a high school gym, with models in Victorian-style velvet devore dresses, black architectural suits and chola-style braids (courtesy of makeup artist Pat McGrath) walking among old TVs, motorcycle helmets and video games. “I wanted to do ‘chola Victorian,’ ” says Tisci. “I wasn’t worried because I knew the clothes were strong.” Not unlike their creator. “What I’m most proud of,” he says, “is two things: couture and business. I’ve got a gift from God that is very rare — the clothes are wearable. I can do couture, and I can do street. I come from the street. I’m probably lucky I come from such a poor family. Perhaps that is a gift, too.”"}, {"url": "https://www.vogue.com/article/fashion-runway-givenchy-clare-waight-keller-beyonce-kim-kardashian-west", "page_content": "\n\n\n\n1 / 5 Chevron Chevron Photo: Getty Images Solange Knowles\n\nChanges are afoot at Givenchy as former Chloé designer Clare Waight Keller readies herself to step into the role of artistic director at the LVMH-owned house on May 2. She replaces Riccardo Tisci who served a 12-year stint at the label, turning it into a successful brand beloved by both high-wattage stars and the fashion obsessives who follow their every move.\n\nDuring his tenure at Givenchy, Tisci was one of the first designers to put his stamp on luxury streetwear, creating T-shirts with Bambi cartoons and Rottweilers that became style totems for the Instagram generation. The designer brilliantly balanced edgy, skater-kid-inspired ready-to-wear with entrancing and dramatic couture gowns that he designed for the ultra-famous women in his inner circle. Tisci counts Beyoncé and Kim Kardashian West among his most loyal fans; in fact he was one of the first big designers to dress Mrs. Yeezy when others were still unsure of her sartorial bonafides. Tisci has also walked the Met Gala red carpet with a bare bottom Madonna and partied it up on more than one occasion with Bella Hadid and Kendall Jenner."}]}