{"Riccardo Tisci left Givenchy in 2017 and was succeeded by Clare Waight Keller..": [{"url": "https://www.nytimes.com/2017/02/02/fashion/riccardo-tisci-givenchy-departure.html", "page_content": "LVMH, which also has brands such as Louis Vuitton, Céline and Fendi in its portfolio, does not break down the performance of individual maisons in its financial results. But the number of employees at Givenchy has more than tripled since Mr. Tisci joined the house in 2005, and sales revenue is believed to have grown to around 500 million euros ($539 million) annually. There are now 72 free-standing stores worldwide (compared with seven in 2005), with a Rome flagship set to open this year, and plans for a London store are underway for next year. Last week, LVMH, the world’s biggest luxury group, posted record revenue and profits for 2016, beating expectations because of strong sales in the United States and Europe and a pickup in demand in Asia.\n\n“Riccardo has accomplished everything a designer can do for a brand, clocking a very respectable tenure and creating a fully realized language for them,” Ms. Fargo said.\n\nSo, why leave?\n\nMr. Tisci said in his statement, “I now wish to focus on my personal interests and passions.” But rumors have suggested he may be headed to Versace. It would mean going home to Italy, and to a brand whose unabashed Italian sex and power-woman aesthetic mirrors his own. And Mr. Tisci is close to Donatella Versace (he shocked fashion in 2015 when he featured Ms. Versace, at least nominally a rival designer, in a Givenchy ad campaign).\n\nBesides, the suggestion, briefly beloved of the industry, that a designer needs a timeout from the increasingly endless show seasons, which was posited when both Mr. Simons and Ms. Waight Keller left their posts, increasingly seems like smoke and mirrors. After Dior, Mr. Simons took an even bigger job at Calvin Klein, and Ms. Waight Keller is said to be moving to a different brand (Givenchy?)."}, {"url": "https://www.vogue.co.uk/article/riccardo-tisci-leaves-givenchy", "page_content": "RICCARDO TISCI has left his role at Givenchy after 12 years at the helm. His departure was confirmed today by the house, who told WWD that his final collections have already been shown - during menswear and couture weeks in Paris.\n\nGetty\n\nRead more: Givenchy By Riccardo Tisci In Vogue\n\n“The chapter Riccardo Tisci has written with the house of Givenchy over the last 12 years represents an incredible vision to sustain its continuous success, and I would like to warmly thank him for his core contribution to the house’s development,\" Bernard Arnault, chairman and chief executive officer of Givenchy owner LVMH, said today."}, {"url": "https://www.theguardian.com/fashion/2017/mar/16/clare-waight-keller-becomes-the-first-female-artistic-director-at-givenchy", "page_content": "Clare Waight Keller has been announced as the new artistic director of Givenchy. The news came in the most modern of ways: Givenchy posted a photograph of the British designer on Instagram with the caption: “Clare Waight Keller. New Artistic Director.” It was then shared with Givenchy’s 7.7 million followers.\n\n\n\nWaight Keller replaces Riccardo Tisci, who left Givenchy last month. She will be the first woman to design for Givenchy, and the second major female appointment that parent company LVMH has made in the last 12 months, following Maria Grazia Chiuri’s appointment last June as creative director of Christian Dior.\n\nThe now cult tracksuit on the Spring Summer 2016 Chloé catwalk. Photograph: Rex/Shutterstock\n\nFormerly creative director at Chloé, Waight Keller showed her final collection for the house earlier this month. The Royal College of Art graduate is an industry veteran, having also designed for Pringle of Scotland, and Gucci. Givenchy will be her first time designing couture.\n\nThe designer is well-liked for her straight-talking style and an aesthetic that puts female-friendly elegance and ease at the top of the agenda. This is a departure for Givenchy. During his 12-year tenure, Tisci made streetwear and street style part of the Givenchy house codes, creating hoodies with bold prints, track pants and rockn’roll-influenced leather goods. Fans included Kanye West and Rihanna. This look was successful, too: during this period, the house is thought to have expanded six times. Tisci is now expected to join Versace.\n\n\n\nA model on the Chloe AW 2017 catwalk, where Waight Keller’s was creative director. Photograph: Francois Mori/AP\n\nWith her work at Chloé, Waight Keller has developed an indisputably feminine aesthetic. Big hitters included 70s floral prints, dresses with oversized frills and pinafore dresses, alongside her now cult designer tracksuit and a collection inspired by women on motorbikes. Her fans tend to be artistic: Solange Knowles, Isabelle Hupert and Clemence Poesy all attended her last Chloé show.\n\nRiccardo Tisci, formerly of Givenchy. Photograph: Etienne Laurent/EPA\n\nA model on the Givenchy AW 2017 catwalk. Photograph: Francois Mori/AP\n\nThe appointment perhaps signals that LVMH want the brand to return to the quieter, expensively chic look that suits its founder, Hubert de Givenchy, in the year that Givenchy celebrates 65 years, and made it so popular among women like Audrey Hepburn and Jackie Onassis. The post announcing Waight Keller’s appointment was preceded with a quote from de Givenchy which read: “true elegance comes with a natural gesture, an attitude in simplicity.”\n\nIt could also be that Waight Keller’s work at Chloe was a faithful update of the Chloé girl, as imagined by its founder Gaby Aghion – and her ability to translate heritage to contemporary will have been noted by Givenchy.\n\nThe industry will be intrigued to see what Weight Keller’s approach is. In a statement, she said “Hubert de Givenchy’s confident style has always been an inspiration and I am very grateful for the opportunity to be a part of this legendary house’s history.”"}, {"url": "https://www.harpersbazaar.com/fashion/designers/a32106670/clare-waight-keller-leaves-givenchy/", "page_content": "Clare Waight Keller is parting ways with Givenchy after serving as the brand's artistic director for three years.\n\nThe designer famously created Meghan Markle's wedding gown and was the first woman to helm the French fashion house.\n\nChanges are afoot at Givenchy. After three years at the helm, Clare Waight Keller has stepped down from her role as Givenchy's artistic director.\n\nIn a statement shared with WWD, Keller explained, \"Focusing on a world based on haute couture has been one of the highlights of my professional journey.\"\n\nThe designer continued, \"I have shared so many incredible moments with the brilliant Givenchy ateliers and design teams: Your exceptional talent and dedication will forever remain in my memories. My heartfelt thanks go out to each of the unsung heroes and heroines behind the scenes, for their contribution from product to communications and retail, and every global team member, partner and supplier in between.\"\n\nMeghan Markle presents Clare Waight Keller with the British Designer of the Year Womenswear Award at The Fashion Awards 2018. Joe Maher/BFC // Getty Images\n\nKeller was appointed as artistic director of Givenchy in 2017, following Riccardo Tisci, and became the first female designer to ever hold the coveted role. \"As the first woman to be the Artistic Director of this legendary Maison, I feel honored to have been given the opportunity to cherish its legacy and bring it new life,\" she also said in her statement.\n\nKeller made international headlines in May 2018 for creating Meghan Markle's iconic wedding gown. \"I'm so proud to have been part of it,\" the designer said of her involvement in the royal wedding. The Duchess of Sussex even honored Keller at the British Fashion Awards later that year.\n\nModels present Keller’s final collection with Givenchy on March 1, 2020. LUCAS BARIOULET // Getty Images\n\nWWD reports that Keller's stepping down aligns with the end of her contract. Her final collection with the maison was Fall 2020 Ready-to-Wear, which debuted in Paris on March 1.\n\nPrior to her post at Givenchy, Keller was the creative director of Chloé, but stepped down in 2017 after six years with the brand. It's unclear what she'll be doing next, or who her successor at Givenchy will be.\n\n"}, {"url": "https://www.vogue.com/article/givenchy-designer-clare-waight-keller-artistic-director-announcement", "page_content": "Today Givenchy announced Clare Waight Keller as the brand’s new artistic director, confirming months of industry speculation. Waight Keller will oversee all creative responsibilities at the house, including women’s and men’s ready-to-wear and accessories, as well as haute couture. The appointment is effective May 2.\n\n“The teams join me in warmly welcoming Clare Waight Keller into the Givenchy family,” said Philippe Fortunato, CEO of Givenchy, in a statement. “I am very excited to see Clare bring her singular sense of elegance and modernity to Givenchy. By exploring our maison’s 65-year heritage and the outstanding savoir faire of its ateliers, I am convinced Clare will help Givenchy reach its full potential.”\n\nWaight Keller replaces Riccardo Tisci, who left the LVMH-owned brand after his combined Fall 2017 men’s and Spring 2017 haute couture show in January, reportedly for Versace, though that appointment has not been made official.\n\n“I am very happy to have Clare Waight Keller join the LVMH Group,” Bernard Arnault, the chairman and CEO of LVMH, said in the same statement. “I believe her widespread expertise and vision will allow Givenchy to enter the next phase of its unique path.”\n\nFormerly the creative director of Chloé, Waight Keller is to be the first woman to lead at Givenchy. Previous designers to hold the role include John Galliano, Alexander McQueen, and Julien Macdonald—all Brits, like Waight Keller herself. With 12 years at the house, Tisci, who is Italian, enjoyed the longest tenure after founder Hubert de Givenchy himself.\n\n“Hubert de Givenchy’s confident style has always been an inspiration, and I am very grateful for the opportunity to be a part of this legendary house’s history,” said Waight Keller. “I look forward to working with the teams and writing a new chapter in this beautiful story.”\n\nWaight Keller’s aesthetic is dissimilar from that of her direct predecessor—bohemian with a sporty side of tomboy, where Tisci’s was provocative and racy. But during her six years at Chloé, she built a vivid world through hit handbags, evocative advertising, a well-cast front row wearing the house’s latest offerings, and lively social feeds.\n\nHer first collection for the brand, for Spring 2018, will be shown in Paris in October."}, {"url": "https://www.nytimes.com/2017/03/16/fashion/givenchy-clare-waight-keller.html", "page_content": "Though Ms. Waight Keller, who began her career working at Calvin Klein in New York and with Tom Ford at Gucci, was also in charge of men’s wear at Pringle, she has never worked with an haute couture atelier before. Givenchy suspended its formal couture shows in 2012, first holding static presentations of the collection instead, and more recently incorporating some couture looks into its men’s wear shows in January and June. But the fact that Ms. Waight Keller has been specifically given responsibility for the highest form of fashion’s art suggests that a return to a more formal couture offering may be in the future.\n\nIt also suggests that the idea was false that Ms. Waight Keller, who has three children and has recently moved her family to London from Paris, was taking time off after Chloé because of the pressures of today’s fashion cycle. Her responsibilities at Givenchy, after all, will be significantly greater than her responsibilities at Chloé: She will be overseeing at least eight collections a year, as opposed to four.\n\nLVMH does not break down the performance of individual brands in its financial results, but the Givenchy annual sales revenue is believed to be to around 500 million euros, or more than $530 million,) and there are 72 free-standing stores worldwide. In January, LVMH reported revenue of €37.6 billion in 2016, an increase of 5 percent, beating expectations because of strong sales in the United States and Europe, and a pickup in demand in Asia.\n\nAlong with the move of Raf Simons to Calvin Klein from Christian Dior, the switch by Ms. Waight Keller should put to rest the recent theory that designers are rebelling against the relentless demands of the system by stepping off the hamster wheel.\n\nPerhaps most significantly of all, though, her appointment at the helm of one of LVMH’s signature brands is further indication that the largest luxury group in the world is increasingly focused on the talents of women designers, and changing a historical pattern that has seen most large brands with significant women’s wear profiles run by male creatives. (In June, Christian Dior, the structural owner of LVMH, named Maria Grazia Chiuri as artistic director.)\n\nIn her new role — like Phoebe Philo, the creative director of Céline, another LVMH brand (who, when she was creative director of Chloé, became the first designer to ever take a formal maternity leave) — Ms. Waight Keller will move between London and Paris, where the Givenchy atelier is based."}, {"url": "https://wwd.com/fashion-news/designer-luxury/clare-waight-keller-is-named-givenchy-designer-replacing-riccardo-tisci-10844962/", "page_content": "NEW YORK — Clare Waight Keller, Givenchy’s next artistic director, is to show her first collection for the French house during Paris Fashion Week in October and has been tasked with propelling its roots as a Fifties couture house further into the modern age.\n\n“She has this great ability to break the rules and innovate without making a revolution,” said Givenchy chief executive officer Philippe Fortunato, who confirmed the hire exclusively to WWD. “Her very focused approach will help the brand in building the ongoing momentum we have — and taking it to the next level.”\n\nGivenchy noted that her creative responsibilities include women’s and men’s ready-to-wear and accessories collections as well as couture. May 2 is her start date.\n\nWaight Keller becomes Givenchy’s sixth couturier and the first woman at the creative helm, thrusting the former Chloé designer into the haute spotlight as Givenchy marks its 65th anniversary this year.\n\nIn a statement, Waight Keller said founder Hubert de Givenchy’s “confident style has always been an inspiration.”\n\nBernard Arnault, chairman and ceo of LVMH Moët Hennessy Louis Vuitton, said Waight Keller’s “widespread expertise will allow Givenchy to enter the next phase of its unique path.”\n\nThe choice of Waight Keller suggests Givenchy is ready to turn a page on the daring, Goth-tinged fashions plied by Riccardo Tisci over a stellar 12-year tenure and explore a more subdued version of the aristocratic elegance and architectural flair associated with the house.\n\nAsked if the industry should expect a radical change in aesthetic, Fortunato replied: “You’ll have to wait and see. The development of the Givenchy wardrobe will see an evolution.\n\nMore: Givenchy, A Design Evolution: From Hubert de Givenchy to Riccardo Tisci\n\n“The fact of having for the first time a woman envisioning the brand, designing for women and men, is unique for the house. That by itself will give it a different angle and a different point of view from the past,” he noted.\n\nIn an interview, the executive lauded Waight Keller’s leadership abilities; her eye for beautiful fabrics and her “strong and emotional” appreciation for French savoir faire.\n\nModels on the runway at Chloé’s spring 2016 show. Giovanni Giannoni/WWD\n\n“She also has a great ability to be able to narrate a very powerful brand story,” Fortunato said. “When we were discussing the project, she came up with a strong and compelling vision for the house.”\n\nThe executive also highlighted the British designer’s varied international experience, calling her a citizen of the world. It is understood she will split her time between London and Paris.\n\nBoasting a strong background in knitwear and men’s wear — and a reputation for cutting a killer pair of pants — Waight Keller served as senior women’s designer at Gucci during the Tom Ford era, and has also worked at Ralph Lauren and Calvin Klein in New York.\n\nShe joined Chloé in 2011 after a six-year stint designing Pringle of Scotland. A calm, soft-spoken woman with a ready smile, Waight Keller brought a sure and steady hand to Chloe, rejuvenating its rtw and accessories business and winning largely positive reviews for her feminine-yet-gamine collections. Her expertise in leather goods, a lucrative category, could be a boon to Givenchy, which rarely featured handbags on the runway.\n\nMore: Clare Waight Keller: A Runway Retrospective\n\nTisci exited earlier this year following the expiration of his latest contract with the house, part of LVMH, which also controls Fendi, Céline, Kenzo, Loewe and Pucci.\n\nThe fall women’s collection, presented on showroom rails during Paris Fashion Week earlier this month, was credited to the Givenchy studio, as will the forthcoming resort, spring 2018 men’s and pre-spring 2018 women’s ready-to-wear collections.\n\nThe format to present those collections has yet to be determined.\n\nUnder Fortunato, Givenchy invested substantially to restore, harmonize and optimize its archive as an exploration and inspiration tool for the design teams, and Waight Keller was told only to “embrace the world of Givenchy and what we stand for.”\n\n“It’s a big book. It’s 65 years of history to which she’ll be adding a very important new chapter,” he explained. “She’s a very interesting balance between magic and logic, and I’m personally very, very excited to have her on board.”\n\nTisci was the most successful of a string of designers who have led Givenchy following the 1995 retirement of the founder.\n\nAfter a brief stint by John Galliano, who moved on to Christian Dior, Alexander McQueen tried his hand. But his eclectic collections — space aliens one season, rockabilly the next — failed to galvanize the house. Julien Macdonald went back to a style rooted in French elegance and sophistication, but did not win much acclaim.\n\nGivenchy’s muses ran the gamut, from the demure Audrey Hepburn (pictured here, in 1954), to Kim Kardashian West. Paramount/REX/Shutterstock\n\nTisci brought stability — and heat — to the storied name, immediately making inroads with the world’s leading specialty stores and staging pulse-pounding shows attended by his wide clutch of celebrity friends, from Kanye West to Julia Roberts.\n\nSetting a daring template informed by the energy of the club scene and tinged with sexual provocation, Tisci quickly became one of fashion’s most influential and original designers.\n\nAccording to sources, Versace has held extensive discussions with Tisci, but the Milan-based fashion house has remained mum about any proposed change in creative leadership.\n\nWaight Keller joins a house that has recently demonstrated strong momentum.\n\nAccording to market sources, Givenchy grew more than sixfold in size during the Tisci era, and the brand’s revenues are now north of 500 million euros, or $540 million at current exchange. The number of employees has risen to more than 930 from 290 in 2005.\n\nMore: See Clare Waight Keller’s Final Chloé Collection\n\nFortunato has been spearheading its recent expansion and the brand has been tracking strong sales momentum and profitability, according to market sources.\n\nOnce dependent on wholesale, Givenchy continues its retail rollout, with Qatar and Rome boutiques slated to open this summer and a London flagship in the works for early 2018.\n\nThe company also recently took over direct distribution of its collections in two key luxury markets: Dubai and Singapore.\n\nGivenchy today boasts 72 freestanding stores, compared to only seven in 2005 when Tisci arrived.\n\nRelated stories:\n\nGivenchy Presents In-Between-Designers Collection at Paris Fashion Week\n\nGivenchy Girls Through the Years: From Audrey Hepburn to Kim Kardashian West\n\nRiccardo Tisci’s Move to Versace Said Near\n\nTisci at Versace: Retailers Swoon as Deal Said Done"}, {"url": "https://wwd.com/fashion-news/designer-luxury/riccardo-tisci-leaves-givenchy-wwd-10774902/", "page_content": "Riccardo Tisci, who revved up and reinvented Givenchy in his own edgy image, has exited the French house after an electrifying 12-year tenure.\n\nThe French couture house confirmed his departure exclusively to WWD, noting that his last collections were fall men’s wear and spring couture, which were paraded together at the National Library of France in Paris on Jan. 20.\n\nSources described the parting as mutual and amicable, the separation effective Jan. 31 following the expiration of his latest employment agreement.\n\nTisci invited friend and fellow designer, Donatella Versace to pose for a fall 2015 ad campaign.\n\nTisci’s departure is sure to intensify speculation he is heading to Versace.\n\nWWD broke the news on Jan. 19 that the Milan-based house has been chasing Tisci, who has long expressed his admiration for the work of the late Gianni Versace and cultivated a close friendship with his sister Donatella, whom he invited to pose in a Givenchy ad campaign in 2015.\n\nIn light of Tisci’s departure, Givenchy will not stage a runway show on March 5 during Paris Fashion Week.\n\nIt is understood the fall women’s collection will be designed by the studio and sold to retailers in Givenchy’s Paris showroom as usual.\n\nThe format for presenting the collection to the press has yet to be determined.\n\nMore: See Riccardo Tisci’s Last Givenchy Show\n\nGivenchy’s ateliers are also working on some of Tisci’s final designs as sources told WWD that he has lined up stars to wear custom couture outfits at the Grammy Awards on Feb. 12 and the Academy Awards on Feb. 26.\n\nCelebrities in Tisci’s orbit include the likes of Meryl Streep, Beyoncé (who on Wednesday revealed she and her husband Jay Z are expecting twins), Julia Roberts, Cate Blanchett, Ciara and Kanye West.\n\nKim Kardashian chose Givenchy couture for her 2015 wedding. Kim Kardashian West Instagram\n\nGivenchy did not provide any timelines for naming a successor and declined all comment on potential candidates.\n\nTisci’s exit is the latest tremor as creative upheaval spreads through the top ranks of international fashion.\n\nOver the past year, Christian Dior, Yves Saint Laurent, Valentino, Marni, Lanvin, Chloé, Jil Sander, Ermenegildo Zegna, Roberto Cavalli, Oscar de la Renta, Salvatore Ferragamo and Carven have all made changes in creative leadership.\n\nAs Givenchy draws up its list of potential candidates, it could draw on such well-known designers on the market as Hedi Slimane, Alber Elbaz, Peter Dundas, Clare Waight Keller, Rodolfo Paglialunga and Peter Copping. Buzzy designers like Balmain’s Olivier Rousteing could also be on its radar.\n\nIn a statement, Bernard Arnault, chairman and chief executive officer of LVMH Moët Hennessy Louis Vuitton, Givenchy’s parent, lauded Tisci’s accomplishments.\n\n“The chapter Riccardo Tisci has written with the house of Givenchy over the last 12 years represents an incredible vision to sustain its continuous success, and I would like to warmly thank him for his core contribution to the house’s development.”\n\nFor his part, Tisci said, “I have very special affection for the House of Givenchy and its beautiful teams. I want to thank the LVMH Group and Monsieur Bernard Arnault for giving me the platform to express my creativity over the years. I now wish to focus on my personal interests and passions.”\n\nJeweled everything at Givenchy’s spring 2012 couture show. Penske Med/REX/Shutterstock\n\nA bundle of creative energy forever shod in Nike sneakers, Tisci was a daring, uncharacteristic hire for LVMH, which has a track record of casting media stars to helm its fashion brands, which also include Fendi, Céline, Kenzo, Loewe and Pucci.\n\nTisci was relatively unknown, and just 30, when he was recruited by then Givenchy ceo Marco Gobbetti, who is to assume the management helm of Burberry later this year.\n\nTisci succeeded a string of designers who, to varying degrees, encountered some bumps on the road to brand rejuvenation following the 1995 retirement of founder Hubert de Givenchy.\n\nAfter a brief stint by John Galliano, who moved on to Dior, Alexander McQueen tried his hand. But his eclectic collections — space aliens one season, rockabilly the next — failed to galvanize the house. Next up was Julien Macdonald, who went back to a style rooted in French elegance and sophistication, but did not win much acclaim.\n\nTisci brought stability — and heat — to the storied name, immediately making inroads with the world’s leading specialty stores and spawning a series of hit leather goods, kicking off with the Nightingale bag.\n\nHe took on design duties for men’s wear three years later, and helped ignite the streetwear trend with his T-shirts printed with snarling Rottweilers or big stars, among his fetish motifs.\n\nSetting a daring template informed by the energy of the club scene and tinged with sexual provocation, Tisci quickly became one of men’s wear’s most influential and original designers.\n\nHe had recently expressed a desire to extend Givenchy’s reach as a lifestyle brand, having introduced a range of clothes for babies and children that is slated for July delivery.\n\nAccording to market sources, Givenchy increased more than sixfold in size during the Tisci era, and the brand’s revenues are now north of 500 million euros, or $540 million at current exchange. The number of employees has risen to more than 930 from 290 in 2005.\n\nPhilippe Fortunato, ceo of Givenchy, has been spearheading its recent expansion thrust and credited Tisci’s “visionary qualities that led to a strong growth of the brand.”\n\nFueled by Tisci’s design chops, powerful communication skills and clutch of A-list celebrity friends, the brand has been tracking strong sales momentum and profitability, sources said. Once dependent on wholesale, Givenchy continues its retail rollout, with a Rome boutique slated to open this year and a London flagship in the works for early 2018.\n\nMore: Riccardo Tisci’s Givenchy Gang: Celebrity Squad Pictures\n\nThe company also recently took over direct distribution of its collections in two key luxury markets: Dubai and Singapore.\n\nGivenchy today boasts 72 freestanding stores, compared to only seven in 2005 when Tisci arrived.\n\nSomething of a fashion wunderkind, Tisci grew up poor in Taranto, Italy, and Como during the boom years for Versace, Armani and Valentino.\n\nAt 16, fresh out of art school, he landed a job designing fabrics for an Italian textile firm, at which point his destiny became clear. A year later, he was at Central Saint Martins and earning British scholarships that allowed him to finish his degree.\n\nHis first work experiences were in Italy, with Stefano Guerrero, Antonio Berardi, Coccapani and Ruffo Research, while he nurtured his signature label with a strong following in London. When Ruffo went bankrupt, he went soul-searching in India, gathered up his strength and returned to Milan and staged a show that would all but seal his employment contract at Givenchy.\n\nTisci, a friend of Madonna’s, has designed looks for the singer’s tours and other events. Here is the duo at 2016’s Met Gala, outfitted in Givenchy. David Fisher/REX/Shutterstock\n\nOnce installed at the couture house, he brought a dark, Goth-tinged fierceness and severity, which he ultimately married to more romantic inclinations, clashing together such disparate influences as Victorian dressing and chola culture to produce runway fireworks.\n\nTisci would seem a natural for Versace, given his penchant for bold prints, demonstrative hardware and tough chic.\n\n“I’m mature, and I’m different, but I was born a daring designer and I’m going to die as a daring designer. That is me,” he told WWD last year.\n\nAs reported, Versace is rethinking the timing of its initial public offering as it embarks on a significant expansion plan ahead of a listing.\n\nAsked on Jan. 19 about Tisci’s potential arrival at the company, a spokesman said, “Donatella Versace is the creative director of the company and at this time we do not have any plans to change that. Beyond that, of course, we do not comment on rumors.”\n\nWere Donatella Versace to welcome a designer of Tisci’s stature, it would be in line with her past efforts to champion young talent. Versace tapped Christopher Kane in 2009 to help relaunch the Versus line and, when the two parted ways, she forged a new path for the brand, developing it into a seasonless line with a strong digital component, with the intention of working with young designers with a fresh approach. In 2013, she tapped Anthony Vaccarello as a guest designer for Versus, and then named him its creative director until he departed to join Saint Laurent.\n\nTo be sure, a leading designer such as Tisci would ramp up the brand’s “cool factor,” social media reach and appeal. The designer boasts 1.8 million followers on Instagram.\n\nTisci posted on his account following the news that he was leaving Givenchy: “A giant heartfelt thank you to #givenchy, #lvmh, my incredible team, the magical atelier and everyone who made these 93 collections possible and all the other crazy adventures. Your love and support, in the day and in the night, will forever remain in my heart. #love #givenchy #forever”\n\nWhen Donatella Versace appeared in the Givenchy ads, Tisci told WWD: “There’s no jealousy and no competition between us. It’s a real, pure friendship: Somebody who’s part of my gang, part of my family. We want to give a message of friendship and love.”\n\nMore: Riccardo Tisci’s Most Memorable Givenchy Campaigns: A Look Back\n\nAt that time, Versace echoed the sentiment, and gave a resounding endorsement to her Paris-based counterpart: “Riccardo Tisci is extremely talented and, above all, my dear friend. We are family. I want to get rid of the old system, work together, support each other and make fashion a true global community.”\n\nThe Blackstone Group bought a 20 percent stake in Versace in 2014. Family members hold the rest of the equity.\n\nVersace’s own stores are increasingly becoming the engine behind the brand’s growth, as shown by its performance in 2015, when retail sales were up 28.9 percent to 400.7 million euros, or $440.7 million.\n\nIn 2015, earnings before interest, taxes, depreciation and amortization rose 19.9 percent to 81 million euros, or $89.1 million. The Milan-based group saw revenues increase 17.5 percent to 645 million euros, or $709.5 million.\n\nDollar figures were converted from the euro at average exchange rates for the periods in question."}, {"url": "https://www.vogue.com/article/riccardo-tisci-leaves-givenchy", "page_content": "Riccardo Tisci is leaving Givenchy, the Paris house announced today.\n\nHis Fall 2017 menswear collection and Spring 2017 Haute Couture collection, shown together on the runway in Paris on January 20, were his last for the label after a 12-year run. Tisci looked to the American West for that show, but the rumors that have persisted for weeks have the Italian designer headed home, so to speak. He is thought to be joining the Milan-based brand Versace.\n\nTisci’s exit ends one of the fashion business’s longest and most successful appointments. In the last year and a half, Dior, Lanvin, Saint Laurent, Valentino, Chloé, and more have seen their creative directors leave, and more and more, the three-year creative director stint is becoming the new normal. The industry has changed dramatically since Tisci’s early days at Givenchy, and wherever he winds up—Versace or elsewhere—it would be a unique case were he to reproduce a similarly long run.\n\nSee Tisci’s best work in Vogue, and stay tuned for updates."}, {"url": "https://www.vogue.com/fashion-shows/designer/givenchy", "page_content": "For the first 43 years of its existence, the house of Givenchy was a monument to conservative good taste. Even so, right out of the box, innovation was also part of the equation. Hubert de Givenchy made a mark with his debut collection in 1952: It was based on separates, which a woman could mix and match rather than wear slavishly as demonstrated by a designer, and that was a novel concept for the time. That the couturier was the youngest on Paris’s scene (and a very handsome 6-foot-6) didn’t hurt his reviews either.\n\nGivenchy was taken under the wing of the Spanish master Cristóbal Balenciaga, and afterward his work became less obviously youth oriented. He and his mentor were described by The New York Times as “undisputedly the world’s most prophetic designers.” During this era he introduced (simultaneously with Balenciaga) the revolutionary chemise, or sack dress, acclaimed as “a genuinely new fashion shape.” He is also credited with pioneering the princess silhouette, and when the cinematic sprite Audrey Hepburn first donned Givenchy’s Little Black Dress, his name became forever linked with the Sabrina neckline.\n\nLVMH acquired the house of Givenchy in 1988, and the great man himself hung up his white lab coat (in which he was famous for working) by the end of 1995. After that, the company fell into a sort of dissolute decline. If Givenchy was “the master of non-assaultive style,” as one reporter put it, his first two successors, John Galliano and Alexander McQueen, relied more on shock and awe. “Parisian chic—with mayhem,” is how the latter described his approach in Women’s Wear Daily in 1998.\n\nIt began to chart a brighter course with the appointment of Riccardo Tisci, a young Italian with a gothic sensibility, as creative director in 2005. Tisci celebrated his 10th anniversary at the label on September 11, 2015, with a New York show for the industry and more than 800 members of the public. In 2017, Tisci departed the label and was succeeded by Clare Waight Keller, who had spent the prior six years at Chloé. At Givenchy, she established a knack for elegant suiting and red carpet dresses early on. She became a household on May 19, 2018, when 29 million people around the world watched Meghan Markle marry Prince Harry in a long-sleeved, bonded-satin wedding gown of Waight Keller's design."}]}