{"Lester Germer was a member of the National Academy of Sciences and the American Philosophical Society.": [{"url": "https://www.wikiwand.com/en/Lester_Germer", "page_content": "Lester Halbert Germer (October 10, 1896 – October 3, 1971) was an American physicist.[1] With Clinton Davisson, he proved the wave-particle duality of matter in the Davisson–Germer experiment, which was important to the development of the electron microscope. These studies supported the theoretical work of De Broglie. He also studied thermionics, erosion of metals, and contact physics. He was awarded the Elliott Cresson Medal in 1931.\n\nQuick facts: Lester Germer, Born, Died, Nationality, Alma&... ▼\n\nA former fighter pilot in World War I, Germer subsequently worked at Bell Labs in New Jersey.\n\nIn 1945 (at the age of 49), Germer launched a side career as a rock climber. He climbed widely around the Northeast United States, and especially at New York's Shawangunk Ridge. Although the Appalachian Mountain Club was dominant in the area at the time, and strictly regulated rock climbing, Lester was never associated with the club, and found himself in conflict with the leading climber in the area, Hans Kraus, who was head of the AMC's Safety Committee. He was once turned down for climbing certification with the comment \"Likes people too much and is too enthusiastic.\" Lester was known for being generous and friendly. He was once called \"A one man climbing school.\"\n\nIn 1971, one week before his 75th birthday, Lester Germer died of a massive heart attack while lead climbing a rock climb at the Shawangunk Ridge (Eyebrow, 5.6). Until that moment, Lester had a 26-year perfect safety record in rock climbing; he had never even taken a leader fall."}, {"url": "https://pantheon.world/profile/person/Lester_Germer", "page_content": "Lester Germer\n\nLester Halbert Germer (October 10, 1896 – October 3, 1971) was an American physicist. With Clinton Davisson, he proved the wave-particle duality of matter in the Davisson–Germer experiment, which was important to the development of the electron microscope. These studies supported the theoretical work of De Broglie . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Lester Germer has received more than 55,722 page views. His biography is available in 21 different languages on Wikipedia (up from 19 in 2019) . Lester Germer is the 521st most popular physicist (down from 516th in 2019), the 4,636th most popular biography from United States (down from 4,423rd in 2019) and the 102nd most popular American Physicist."}, {"url": "https://prabook.com/web/lester_halbert.germer/1105923", "page_content": "Lester Halbert Germer\n\nphysicist\n\nOctober 10, 1896 (age 74) Chicago, Cook County, United States of America\n\nWith Clinton Davisson, he proved the wave-particle duality of matter in the Davisson–Germer experiment, which was important to the development of the electron microscope. These studies supported the theoretical work of De Broglie. He was awarded the Elliott Cresson Medal in 1931. A former fighter pilot in World War I, Germer subsequently worked at Bell Labs in New Jersey. In 1945 (at the age of 49), Germer launched a side career as a rock climber. He climbed widely around the Northeast United States, and especially at New York\"s Shawangunk Ridge. Although the Appalachian Mountain Club was dominant in the area at the time, and strictly regulated rock climbing, Lester was never associated with the club, and found himself in conflict with the leading climber in the area Hans Kraus, who was head of the Administrative Management College\"s Safety Committee. He was once turned down for climbing certification with the comment \"Likes people too much and is too enthusiastic.\" Lester was known for being generous and friendly. He was once called \"A one man climbing school.\" In 1971, one week before his 75th birthday, Lester Germer died of a massive heart attack while lead climbing a rock climb at the Shawangunk Ridge (Eyebrow, 56). Until that moment, Lester had a twenty six year perfect safety record in rock climbing. He had never even taken a leader fall."}, {"url": "https://prabook.com/web/lester.germer/3760428", "page_content": "Lester Germer\n\nphysicist scientist\n\nJanuary 10, 1896 (age 74) Chicago, Illinois, United States\n\nUpon graduation in 1917 Germer obtained a position at the Western Electric Company in New York City, the engineering and research arm of the American Telephone and Telegraph Company (AT&T). Two months later he volunteered for the army as a pilot, serving in France, where he was officially credited with having brought down four German warplanes. Following his discharge of February 5, 1919, Germer was given a medical examination and was treated for shock and nervous strain. On March 1, 1919, Germer returned to his position at Western Electric and was assigned to work with Dr. Clinton J. Davisson, an electron physicist who was doing research on a reliable, distortionless repeater, or amplifier, for use in the long-distance telephone lines of AT&T. While studying the effect of positive ion bombardment on the efficiency of electron emission for oxide coated cathodes, Davisson and Germer noted that electrons directed at metal targets were reflected without loss of energy, a surprising result. While Davisson and a newly appointed colleague, Charles Kunsman, began to pursue studies with the elastically scattered electrons, Germer was assigned to a new project on thermionic emission. He and Davisson published important results on this topic in 1922, and in 1924 Germer published the results of further studies as his Ph. D. dissertation. Germer's hectic schedule (work, graduate school, and raising a family) was interrupted from April 1923 to July 1924, during which time he was treated for a nervous breakdown probably linked to a severe, recurrent sinus infection that was aggravated by noxious gas overseas. Shortly after Germer returned to work in 1924, he was reassigned to the electron scattering studies that had been assigned to Kunsman in 1920 but had been abandoned in late 1923, at which time Kunsman left the company. On February 5, 1925, while the electron tube previously used by Davisson and Kunsman was being reactivated, an accident occurred that eventually changed the character of the investigation. The heated, evacuated tube cracked, the nickel target was damaged, and the experiments were halted. When the tube was repaired and the experiments resumed, a surprisingly different pattern of the scattered electrons was observed. Attempts to explain this new behavior on the basis of the altered crystal structure of the nickel target were inconclusive, and Davisson and Germer expanded their study. Two years later, after further experimentation and after Davisson had obtained new theoretical insights during a trip to England and attendance at the 1926 meeting of the British Association for the Advancement of Science, Davisson and Germer realized that the new behavior of the scattered electrons could best be understood by attributing wave properties to them. In a series of papers published by Davisson and Germer, both jointly and separately, during the period 1927-1929, they demonstrated conclusively that electrons, like light, have the physical characteristics of waves as well as particles. Davisson and Germer realized that their discovery also had potential for yielding information about the structure of the material from which the electrons were scattered. Germer pursued these studies, using both the scattering method he and Davisson had developed, and also an electron transmission method developed by George P. Thomson in England, publishing over twenty papers in the field. At that time he developed an interest in the behavior of metal contacts under electrical discharge, another subject of interest to AT&T, which he pursued until 1957, publishing nearly twenty papers on this topic. Having completed this long series of studies, Germer's interest in electron diffraction was rekindled when a colleague at Bell Telephone Laboratories asked him to assist in developing a modified form of the electron scattering apparatus he and Davisson had used thirty years earlier. After Germer and his colleagues perfected this method, it proved to be so fruitful for the investigation of surface structures that Germer, even after his retirement from Bell Labs in 1961, continued this work as a research associate at Cornell University. During this time, besides publishing the results of his own research, he traveled to locations all over the world, lecturing and giving advice on the technique and interpretation of low-energy electron diffraction studies (LEED), a technique that has become indispensable to many fields of research. He died after a fall while climbing near Gardiner, New York."}, {"url": "https://www.ucla.edu/about/awards-and-honors/faculty/national-academy-of-sciences", "page_content": "The National Academy of Sciences (NAS) is a private, non-profit organization of distinguished scholars.\n\nNAS was established by Congress and signed into law by President Abraham Lincoln in 1863 with the mission of providing independent, objective advice to the nation on matters related to science and technology.\n\nNAS members are elected to membership by their peers for their contributions to research. Its members are active participants in the international scientific community and committed to furthering science in America. A total of approximately 500 members of the NAS have won Nobel Prizes, and the Proceedings of the National Academy of Sciences, founded in 1914, is today one of the most prestigious international journals publishing original research results.\n\nA pair of independent scientific bodies -- the National Academy of Engineering (NAE) and the National Academy of Medicine (NAM, previously the Institute of Medicine) -- were founded under the NAS charter in 1964 and 1970, respectively. In the National Academies of Sciences, Engineering, and Medicine, these three academies also work together to conduct research and provide independent, objective analysis and advice to the nation. They also encourage education and research, honor outstanding achievements in science and engineering, and increase public understanding in these fields. Its service to the government has become so crucial that Congress and the White House have passed legislation and issued executive orders reaffirming its role."}, {"url": "https://statmodeling.stat.columbia.edu/2021/08/15/national-academy-of-sciences-scandal-and-the-concept-of-countervailing-power/", "page_content": "Sander Greenland points us to this news article by Christina Jewett, “National Academies’ Report Took Pharma-Friendly Stance After Millions in Gifts From Drugmakers”:\n\nTo several U.S. senators, it looked wasteful, even outrageous. Every year, taxpayers pay for at least $750 million worth of expensive pharmaceuticals that are simply thrown away. Companies ship many of the drugs in “Costco”-size vials, one lawmaker said, that once opened usually cannot be resealed or saved for other patients. Yet pharma gets paid for every drop. So Congress turned to the prestigious National Academies of Sciences, Engineering and Medicine for advice, given its reputation for “independent, objective reports” on such matters. The national academies’ influential report, released in February, struck physicians who’ve tracked the issue as distinctly friendly to Big Pharma. It advised against an effort to recoup millions for the discarded drugs. It concluded that Medicare should stop tracking the cost of the drug waste altogether. Yet the report left out a few key facts, a KHN investigation has found. Among them: One committee member was paid $1.4 million to serve on the board of a pharmaceutical corporation in 2019 and in 2020 joined the board of a biotechnology company that lists government “cost containment” efforts as a risk to its bottom line. Another committee member reported consulting income from 11 to 13 pharmaceutical companies, including eight that Medicare records show have earned millions billing for drug waste. His pharma ties were disclosed in unrelated publications in 2019 through this year. . . .\n\nBut:\n\nIn a statement emailed to KHN, the national academies said the two members with undisclosed board and consulting roles had “no current conflicts of interest during the time the [drug waste] study was being conducted” from January 2020 through February.\n\nWhat??? The committee member joined the board of a biotechnology company that lists government “cost containment” efforts as a risk to its bottom line—-and that wasn’t a “current conflict of interest”? Ahhhh, maybe I see. The study was conducted in Jan-Feb 2020, so if the board member didn’t join the company until later in the year, it’s not a “current” conflict. In the other direction, the member served on that phrarma board in 2019, but that was before 2020. So, massive conflict before, massive conflict after, but no conflict during those two months.\n\nNot a good look, National Academy of Sciences.\n\nAnd this statement from a spokesperson for the academies:\n\nProtecting the integrity, independence, and objectivity of our study process is of the utmost importance to the National Academies.\n\nI don’t think so, and I’ll get to why I don’t think so in a bit.\n\nBut first some more background, again from Jewett’s article:\n\nBefore and while [an influential 2016 paper on drug waste] was making waves, physicians who would eventually be on the national academies committee were forging alliances with the pharmaceutical industry. Dr. Kavita Patel reported earning a speaking fee in 2015 from the Pharmaceutical Research and Manufacturers of America, or PhRMA, of $5,001 to $15,000. She also accrued assets valued at more than $50,000 for her role as a pharmaceutical company board member, according to 2015 and 2018 disclosures filed with the Government Accountability Office. Dr. Anupam Jena, who also served on the committee, wrote a 2018 article with staff members of PhRMA arguing that medications should be valued not for their actual benefit, but rather for the potential for innovation that comes with making new therapies.\n\nWhat jumps out at me here is that neither half of the corruption equation seems objectionable on its own. I’ve earned between $5,001 to $15,000 as a corporate speaking fee, I’ve done corporate consulting. And, on the other side, the position that medications be valued for their potential for innovation is not unreasonable.\n\nThat said, I agree with the critics that there’s a big ethical problem here. So where is it coming from. I see two issues. First, as noted in the linked article, the conflicts of interests are hidden. The authors of this report being paid big bucks by pharma companies—that should be stated right up front, not kept as a secret to be found by enterprising reporters. Second, the involvement of the National Academy of Sciences, a quasi-governmental organization that is some sort of representative of prestige academia.\n\nMy connections\n\nThis story interests me directly for several reasons:\n\n1. Pharmaceutical support. Over the years, I’ve received several thousand dollars of research support from pharmaceutical companies. I’ve spoken at pharma companies for free and for pay and I’ve worked with colleagues in the industry. I get as annoyed as anyone about the worst abuses in pharmaceutical research (fake experiments, hidden data, and all the rest). So it’s complicated. It’s an industry that does lots of things, including bad things that make lots of money.\n\n2. Corporate support more generally. I’m in the habit of taking cash where it comes. I say no sometimes, but I say yes a lot too. Here’s a partial list. I feel pretty strongly about my own integrity, but if you don’t want to trust some of my views because of conflict of interest, that’s fair enough. It’s a price I pay for the $.\n\n3. The National Academy of Sciences. From my perspective as an outsider, the NAS seems to me to have three functions:\n\n(a) It produces the journal, PNAS.\n\n(b) It’s a society that honors prominent scientists.\n\n(c) It provides occasional advice to the government.\n\nMy connections are: (a) I’ve published in the journal, criticized papers in the journal, and a few years ago I got them to fix their slogan; (b) I know lots of people who’ve been honored by the academy; (c) I’ve given advice to some NAS panels.\n\nIt’s no surprise to me that NAS members have corporate support. Free money is something that comes to you when you become more prominent—it’s a gravitational kind of thing—so it makes sense that many of the country’s most prominent scientists have been, like me, willing to take some of the money that has been offered to them. I used to think I’d always want money and I’d always want to be on TV. I no longer want to ever be on TV again but I’m still accepting cash, so I can easily believe that others would too.\n\nWhat I don’t fully understand is how the three functions of the NAS fit together. I get that NAS members are involved in the PNAS process, but a lot of this must have to do with the management of the journal. Thirty years ago, PNAS was pretty obscure. But somewhere along the way, it became a top journal. And it serves a useful role, no joke. In addition to being a repository for prominent scientists to promote their favorite junk research, it’s also place for publishing interdisciplinary work that could be hard to get published elsewhere, as with our paper on penumbras which borders political science and sociology. I don’t really know how PNAS achieved its prominence. I’m guessing it had some enterprising editors—but that just seems like a journal thing, not particularly connected to the National Academy.\n\nFinally, I don’t think the three roles of the NAS—journal publisher, honorary society and advice-giver—go together so well. From one perspective, sure, if the government is getting advice from scientists, why not take advice from the best? The trouble is, the NAS is not the best scientists; rather it’s the most honored, which is not the same thing at all! I say this as a much-honored scientist myself. These organizations operate in the manner of links on a chain, with people nominating their friends or people they’ve heard of. So you’ll get some well-connected scientists, that’s for sure.\n\nBut that’s fine too: no filter is perfect, and it’s not so bad for the government to be getting advice from well-connected scientists. My problem is that the whole point of the honorary society is to say how wonderful its members are, which is strongly in opposition to the goal of a scientific journal, which is to explore uncertainty, and the goal of an advice-giving society, which is to . . . explore uncertainty.\n\nThe NAS’s contradictory roles\n\nTo me, the problem of that controversial NAS report was not the involvement of corporate-funded members—in this day and age, this would be hard to avoid—but rather that a key role of the NAS is to extol its members. The extolling role leads to PNAS publishing papers that understate uncertainty while favoring NAS members’ favorite theories, and it leads to NAS reports that dismiss concerns of corruption and bias. To even bring up the possibility of bias is a contradiction of the NAS role of saying how goddam wonderful its members are.\n\nCountervailing power\n\nThe bad news is that the NAS produced that report full of unacknowledged conflicts of interest. The good news is that the above-linked investigative article by Christina Jewett came out. I don’t know how much attention it received, but it did at least reach Sander Greenland, and then me, and now all of you. Jewett’s article was published by . . . KHN. What’s that? I clicked to find out:\n\nKHN (Kaiser Health News) is a national newsroom that produces in-depth journalism about health issues. Together with Policy Analysis and Polling, KHN is one of the three major operating programs at KFF (Kaiser Family Foundation). KFF is an endowed nonprofit organization providing information on health issues to the nation. KHN reports on how the health care system — hospitals, doctors, nurses, insurers, governments, consumers — works. In addition to this website, our stories are published by news organizations throughout the country. Our site also features daily summaries of major health care news. . . .\n\nKaiser is a large health maintenance organization . . . ummm, according to Wikipedia, it’s an “integrated managed care consortium.” Anyway, here’s my point. Pharma is big business. Health care is big business. In many ways, pharma and health care are natural allies, but one place where they differ is drug costs. The big business that is Kaiser is a countervailing force to the big business that is pharma.\n\nCountervailing power is a good thing. It would be bad news if the folks at the Kaiser foundation were like, “Hey, we’re rich businesspeople, pharma’s rich businesspeople, let’s not rock the boat, let’s focus on the common enemy and fight to lower taxes and business regulation.” Or if they were like, “Hey, health care is a science-based field, the NAS promotes the prestige of science, so let’s not rock the boat, let’s work together to increase science funding and not do anything to make scientists look bad.” OK, maybe they do this sort of thing sometimes, and that’s cool too, that’s part of their story. But not all the time. Kaiser is willing to rock the boat, they’re annoyed enough about overpaying for drugs that they’re willing to blow the whistle, they’re annoyed enough about scientists shilling for shillings that they’re willing to call them on it.\n\nRemember that famous Walter Matthau saying that poker “exemplifies the worst aspects of capitalism that have made our country so great”? That’s kind of what I think here. It would be so easy for the Kaiser foundation to play by gentleman’s rules and not do anything to upset their fine colleagues in pharmaceuticals or the esteemed members of the National Academy of Sciences. But instead they are motivated by . . . not greed, I think, maybe “annoyance” is a better word . . . they let their annoyance get the better of them and they lash out. They have a little tantrum, and in doing so they play an absolutely necessary role, a source of countervailing power. They’re comfortable enough not to have to do this, but they don’t like overpaying for drugs and they don’t like it when a bunch of stuffed shirts with Ph.D.’s try to justify it. Good for them, and it’s a good thing that there’s some economic competition in the world, as well as a stable political system by which they can offer such criticism without fear of getting bombed or sued out of existence.\n\nLet me emphasize . . .\n\nI don’t, repeat don’t, think of the pharmaceutical industry or the National Academy of Sciences as the bad guys. I use pharmaceutical industry products all the time, I’ve worked with many colleagues from different pharma companies, I’ve even spoken to pharma groups for free. Similarly, I know lots of excellent NAS members, I’ve published in PNAS and learned a lot from articles by others published in that journal. It’s not at all a criticism of these fine people and organizations to say that these institutions, like any other, can have bad sides, hence the need for internal and external checks on their power and activities. The Kaiser foundation serves as one of these checks, and that’s a good thing. And I also appreciate the aspects of our economy and society that allow these checks to work, which can enable all the good people in pharma and science to do even better work.\n\nP.S. John Kenneth Galbraith doesn’t get full respect nowadays but I’m with Mankiw that he’s one of the great economists of the 20th century. As well as having many good ideas (such as countervailing power, the topic of the above post), Galbraith was also involved, less successfully, in politics and punditry, and it seems that when he wrote about the academic field of economics he did not show sufficient respect for some of the other work in that field. I can see how this could’ve annoyed many of his colleagues, but from the current perspective, many decades later, I feel like we can look past the various lowlights of Galbraith’s career and focus on his many positive contributions. In any sensible world, the concept of countervailing power would be considered much more important than, say, the concept of rational addiction.\n\nP.P.S. It seems that I got the KHN story wrong. There is no ongoing relationship between Kaiser Permanente (the health-care consortium) and KFF (the foundation that funds Kaiser Health News) and there hasn’t been for decades, so for better or worse this does not seem to be an example of countervailing power in economics but rather a more direct example of the value of the free press, in this case funded by a nonprofit foundation rather than from the usual subscriptions-and-advertising model. Overall I think I’d be happier if this had been an example of countervailing power in a capitalist system, because that would seem more scalable and robust than relying on the good fortune that the Kaiser foundation got organized to do this sort of thing. Also I’m bummed because the HMO-vs.-pharma angle was cute, and now I’ll have to retract that Galbraith praise. Countervailing power is a pretty idea, but maybe plain old political ideology is what matters now."}, {"url": "https://www.northwestern.edu/faculty-accolades/academies/national-academy-of-sciences.html", "page_content": "National Academy of Sciences\n\nThe National Academy of Sciences is a private, nonprofit institution that was established under a congressional charter signed by President Abraham Lincoln in 1863. It recognizes achievement in science by election to membership, and — with the National Academy of Engineering and the National Academy of Medicine — provides science, engineering, and health policy advice to the federal government and other organizations. Members are elected to the National Academy of Sciences in recognition of their distinguished and continuing achievements in original research. Membership is a widely accepted mark of excellence in science and is considered one of the highest honors that a scientist can receive. Current NAS membership totals approximately 2,400 members and 500 international members, of which approximately 190 have received Nobel prizes.\n\nAnthropology Thomas McDade , Weinberg College of Arts and Sciences (2021)\n\n, Weinberg College of Arts and Sciences (2021) Christopher Kuzawa , Weinberg College of Arts and Sciences (2018)\n\n, Weinberg College of Arts and Sciences (2018) James Allison Brown, Weinberg College of Arts and Sciences (2013)\n\nApplied Physical Sciences Gerald Gabrielse, Weinberg College of Arts and Sciences (2007)\n\nBiochemistry Olke Cornelis Uhlenbeck, Weinberg College of Arts and Sciences (1993)\n\nChemistry Michael Wasielewski , Weinberg College of Arts and Sciences (2021)\n\n, Weinberg College of Arts and Sciences (2021) Samuel Stupp , McCormick School of Engineering and Applied Science (2020)\n\n, McCormick School of Engineering and Applied Science (2020) Amy Rosenzweig , Weinberg College of Arts and Sciences (2017)\n\n, Weinberg College of Arts and Sciences (2017) J. Fraser Stoddart , Weinberg College of Arts and Sciences (2014)\n\n, Weinberg College of Arts and Sciences (2014) Monica Olvera de la Cruz , McCormick School of Engineering and Applied Science (2012)\n\n, McCormick School of Engineering and Applied Science (2012) Chad Mirkin , Weinberg College of Arts and Sciences (2010)\n\n, Weinberg College of Arts and Sciences (2010) Brian Hoffman , Weinberg College of Arts and Sciences (2006)\n\n, Weinberg College of Arts and Sciences (2006) George Schatz , Weinberg College of Arts and Sciences (2005)\n\n, Weinberg College of Arts and Sciences (2005) Mark Ratner , Weinberg College of Arts and Sciences (2002)\n\n, Weinberg College of Arts and Sciences (2002) Tobin Marks, Weinberg College of Arts and Sciences (1993)\n\nEconomic Sciences Charles Manski, Weinberg College of Arts and Sciences (2009)\n\nEngineering Sciences Julio Ottino , McCormick School of Engineering and Applied Science (2022)\n\n, McCormick School of Engineering and Applied Science (2022) Yonggang Huang , McCormick School of Engineering and Applied Science (2020)\n\n, McCormick School of Engineering and Applied Science (2020) John Rogers , McCormick School of Engineering and Applied Science (2015)\n\n, McCormick School of Engineering and Applied Science (2015) Zdenek Bazant, McCormick School of Engineering and Applied Science (2002)\n\nMathematics Bryna Kra, Weinberg College of Arts and Sciences (2010)\n\nMicrobial Biology Robert Lamb , Weinberg College of Arts and Sciences (2003)\n\n, Weinberg College of Arts and Sciences (2003) Patricia Spear, Feinberg School of Medicine (2002)\n\nPhysics Vicky Kalogera, Weinberg College of Arts and Sciences (2018)\n\nPsychological and Cognitive Sciences Alice Eagly , Weinberg College of Arts and Sciences (2022)\n\n, Weinberg College of Arts and Sciences (2022) Dedre Gentner , Weinberg College of Arts and Sciences (2021)\n\n, Weinberg College of Arts and Sciences (2021) Douglas Medin, Weinberg College of Arts and Sciences (2005)"}, {"url": "http://nationalacademyofsciences.org/membership/", "page_content": "Membership Overview\n\nMembers are elected to the National Academy of Sciences in recognition of their distinguished and continuing achievements in original research. Membership is a widely accepted mark of excellence in science and is considered one of the highest honors that a scientist can receive. Current NAS membership totals approximately 2,400 members and 500 international members, of which approximately 190 have received Nobel prizes.\n\nBecoming a Member\n\nBecause membership is achieved by election, there is no membership application process. Although many names are suggested informally, only Academy members may submit formal nominations. Consideration of a candidate begins with his or her nomination, followed by an extensive and careful vetting process that results in a final ballot at the Academy's annual meeting in April each year. Currently, a maximum of 120 members may be elected annually. Members must be U.S. citizens; non-citizens are elected as international members, with a maximum of 30 elected annually.\n\nMembers are affiliated with a section (scientific discipline) in one of six Classes:\n\nPhysical and Mathematical Sciences\n\nBiological Sciences\n\nEngineering and Applied Sciences\n\nBiomedical Sciences\n\nBehavioral and Social Sciences\n\nApplied Biological, Agricultural, and Environmental Sciences\n\nVisit these resources to learn more about our members, their work, and their contributions to science:"}, {"url": "https://news.stanford.edu/report/2022/05/06/new-national-academy-sciences-members/", "page_content": "Eight Stanford University researchers are among the 120 newly elected members of the National Academy of Sciences. Scientists are elected to the NAS by their peers.\n\nImage credit: Courtesy National Academy of Sciences\n\nThe new members from Stanford are Greg Beroza, the Wayne Loel Professor of Earth Science and professor of geophysics in the School of Earth, Energy and Environmental Sciences; Yi Cui, director of the Precourt Institute for Energy, and Fortinet Founders Professor, and professor of materials science and engineering; Amir Dembo, the Marjorie Mhoon Fair Professor of Quantitative Science and professor of mathematics and of statistics in the School of Humanities and Sciences; Lance Dixon, a professor of particle physics and astrophysics at SLAC National Accelerator Laboratory; Matthew Gentzkow, Landau Professor of Technology and the Economy in the School of Humanities and Sciences, and senior fellow at the Stanford Institute for Economic Policy Research (SIEPR); Leonidas Guibas, the Paul Pigott Professor of Engineering and professor of computer science; Guido Imbens, Applied Econometrics Professor at Stanford Graduate School of Business, professor of economics in the School of Humanities and Sciences, and senior fellow at SIEPR; and Mark Kasevich, professor of physics and of applied physics in the School of Humanities and Sciences.\n\nGreg Beroza’s research explores source processes for shallow earthquakes, intermediate-depth earthquakes, induced earthquakes, and slow earthquakes. He works to improve earthquake monitoring by applying data mining and machine learning techniques, and develops methods to anticipate the strength of shaking in earthquakes using the ambient seismic field. His recent research has included detecting millions of imperceptibly small quakes using AI in diverse tectonic environments, developing protocols for managing risks from human-induced earthquakes, and developing the use of fiber-optic networks for earthquake studies.\n\nYi Cui studies nanoscience to enable clean energy and sustainability technologies. He is known for his seminal contributions on inventing breakthrough battery technologies for electric transportation and for storing renewable energy. He also has broad contributions on solar energy conversion, carbon-free hydrogen generation, cooling and warming textile, water and air filtration, and cryogenic electron microscopy for materials science.\n\nAmir Dembo’s research focuses on probability theory and stochastic processes, information theory, and large deviations theory. His work has applications in communications, control systems, and biomolecular sequence analysis. Dembo is co-author of the textbook Large Deviations Techniques and Applications.\n\nLance Dixon works on developing methods for high-precision calculations in quantum chromodynamics, a part of the Standard Model of elementary particle physics that deals with quarks and their interactions. Such calculations are essential to interpreting experimental particle physics data from the Large Hadron Collider at CERN. He has applied related methods to studying other quantum theories, including one known as supergravity.\n\n\n\nMatthew Gentzkow studies applied microeconomics, empirical industrial organization, and political economy with a focus on the media, politics, and health. Recently, Gentzkow has published studies on political polarization, social media use and disinformation, health care disparities, and consumer choices. Some of his most notable work is in media bias – including whether there’s demand for it.\n\nLeonidas Guibas works on algorithms for sensing, modeling, reasoning, rendering, and acting on the physical world. His interests span geometric and topological data analysis, machine learning and learning architectures for geometric data, 3D computer vision and robotics, geometric modeling and 3D content synthesis, geometric algorithms, and natural language and emotional affect as it relates to shape and form.\n\nGuido Imbens is most recognized for his work in econometrics, a method of studying economics using statistics. His research focuses on developing methods for drawing causal inferences in observational studies, using matching, instrumental variables, and regression discontinuity designs. In 2021, Imbens shared the Sveriges Riksbank Prize in Memory of Alfred Nobel Prize with David Card and Joshua Angrist “for their methodological contributions to the analysis of causal relationships.”\n\nMark Kasevich is an experimental physicist whose work informs development of high-accuracy navigation and sensing. His current research interests include quantum sensors of rotation and acceleration based on cold atoms (also known as quantum metrology), precision tests of general relativity, many-body quantum effects in Bose-condensed vapors, ultra-fast laser-induced phenomena, and advanced microscopy techniques.\n\nThe academy is a private, nonprofit institution that was created in 1863 to advise the nation on issues related to science and technology. Scholars are elected in recognition of their outstanding contributions to research. This year’s election brings the total of active academy members to 2,512."}, {"url": "https://news.mit.edu/2021/five-elected-national-academy-sciences-0430", "page_content": "The National Academy of Sciences has elected 120 new members and 30 international associates, including five professors from MIT — Dan Freedman, Robert Griffin, Larry Guth, Stephen Morris, and Gigliola Staffilani — in recognition of their “distinguished and continuing achievements in original research.” Current membership totals 2,461 active members and 511 international associates. Membership is one of the highest honors that a scientist can achieve.\n\nThe National Academy of Sciences is a private, nonprofit institution that was established under a congressional charter signed by President Abraham Lincoln in 1863. It recognizes achievement in science by election to membership, and — with the National Academy of Engineering and the National Academy of Medicine — provides science, engineering, and health policy advice to the federal government and other organizations.\n\nDaniel Freedman\n\nDaniel Freedman, professor emeritus in MIT’s departments of Mathematics and Physics, is also a visiting professor at Stanford University’s Institute for Theoretical Physics. Freedman's research is in quantum field theory, quantum gravity, and string theory, with an emphasis on the role of supersymmetry. More recently, one focus of his work is the AdS/CFT correspondence, a broad framework based on the equivalence of field theories in different spacetime dimensions, one with and one without gravity.\n\nHe received his BA from Wesleyan University in 1960, and his MS and PhD in physics from the University of Wisconsin in 1962 and 1964. Freedman held postdoctoral appointments at Imperial College, the University of California at Berkeley, and Princeton University before joining the faculty at the Institute of Theoretical Physics at SUNY Stony Brook. In 1980 he joined the MIT faculty in applied mathematics, and has been jointly appointed with the MIT theoretical physics faculty since 2001.\n\nFreedman was a distinguished alumni fellow at the University of Wisconsin-Madison, was a former Sloan and Guggenheim fellow, and was named Fellow of the American Academy of Arts and Sciences and of the American Physical Society. He has received the Special Breakthrough Prize in Fundamental Physics, the Dirac Medal and Prize, and the Dannie Heineman Prize.\n\nLarry Guth\n\nClaude E. Shannon Professor of Mathematics Larry Guth’s research interests are in metric geometry, with a focus on systolic inequality, and on finding connections between geometric inequalities and topology. More recently, Guth has been researching harmonic analysis and combinatorics, in relation to the Kakeya problem, an open question in Euclidean geometry that connects with restriction-type estimates in Fourier analysis and with estimates about incidences of lines in extremal combinatorics.\n\nGuth received his BS in mathematics from Yale University, and after receiving his PhD from MIT in 2005, he followed a postdoctoral position at Stanford with faculty appointments at the University of Toronto and the Courant. He joined the MIT math faculty in 2012.\n\nGuth received the Salem Prize in Mathematics for outstanding contributions to analysis, the Maryam Mirzakhani Prize in Mathematics, the American Mathematical Society's Bocher Prize, and the New Horizons in Mathematics Prize. He received the School of Science’s Teaching Prize in Graduate Education, and was named a Margaret MacVicar Faculty Fellow for exceptional undergraduate teaching.\n\nStephen Morris\n\nStephen Morris, the Peter A. Diamond Professor in Economics, is an economic theorist who has made important contributions to the foundations of game theory and mechanism design, as well as applications in macroeconomics, international economics, and finance. He has developed new ways of understanding and modeling the role of incomplete information in the economy, and its implications for analysis and policy.\n\nMorris received his undergraduate degree in mathematics and economics at Cambridge University, and his PhD from Yale University. He taught at the University of Pennsylvania, Yale University, and Princeton University before joining MIT’s Department of Economics in 2019.\n\nMorris is a fellow and was president of the Econometric Society. He is a member of the American Academy of Arts and Sciences, a research fellow of the Center for Economic Policy Research, and was a Sloan Research and Guggenheim Fellow.\n\nGigliola Staffilani\n\nGigliola Staffilani, the Abby Rockefeller Mauzé Professor of Mathematics, is a mathematical analyst whose research focuses on dispersive nonlinear partial differential equations. She is one of 59 new members who are women, the most elected to the NAS in a single year.\n\nStaffilani received the BS equivalent from the University of Bologna in 1989, and MS and PhD degrees from the University of Chicago in 1991 and 1995. She held positions at Princeton, Stanford, and Brown universities, and joined MIT in 2002.\n\nShe is a member of the Massachusetts Academy of Sciences, the American Academy of Arts and Sciences, and the National Academy of Sciences. She received a Guggenheim Fellowship and a Simons Fellowship in Mathematics, and is a fellow of the American Mathematical Society. At MIT, she received the inaugural MITx Prize for Teaching and Learning in MOOCs by the MIT Office of Digital Learning, the Earll M. Murman Award for Excellence in Undergraduate Advising, and the \"Committed to Caring\" award by the Office of Graduate Education.\n\nRobert Guy Griffin\n\nRobert Guy Griffin, the Arthur Amos Noyes Professor of Chemistry, is also director of the Francis Bitter Magnet Laboratory. He devotes a large fraction of the Griffin Group’s research efforts to develop new magnetic resonance techniques to study molecular structure and dynamics. He also develops high-field dynamic nuclear polarization for the study of biological solids.\n\nGriffin received his BS in 1964 from the University of Arkansas, and his PhD from Washington University in 1969. He joined the Francis Bitter Magnet Laboratory in 1972, and the Department of Chemistry’s faculty in 1989.\n\nHe was awarded the Richard R. Ernst Prize in Magnetic Resonance, sponsored by the Bruker BioSpin Corporation, for his pioneering contributions to high-resolution solid-state nuclear magnetic resonance as a whole, as well as its applications to biological systems. In particular, Griffin has developed widely used techniques for dipolar recoupling that permit internuclear distances to be measured during so-called “magic angle” spinning experiments.\n\nHe has also received the ISMAR (International Society of Magnetic Resonance) Prize, the Günther Laukien Prize for NMR research, and the Bijvoet Medal of the Bijvoet Center for Biomolecular Research of Utrecht University."}]}