{"Lester Germer made significant contributions to the development of the electron microscope and the study of low-temperature physics while working at Bell Laboratories from 1921 to 1956.": [{"url": "https://www.wikiwand.com/en/Lester_Germer", "page_content": "Lester Halbert Germer (October 10, 1896 – October 3, 1971) was an American physicist.[1] With Clinton Davisson, he proved the wave-particle duality of matter in the Davisson–Germer experiment, which was important to the development of the electron microscope. These studies supported the theoretical work of De Broglie. He also studied thermionics, erosion of metals, and contact physics. He was awarded the Elliott Cresson Medal in 1931.\n\nQuick facts: Lester Germer, Born, Died, Nationality, Alma&... ▼\n\nA former fighter pilot in World War I, Germer subsequently worked at Bell Labs in New Jersey.\n\nIn 1945 (at the age of 49), Germer launched a side career as a rock climber. He climbed widely around the Northeast United States, and especially at New York's Shawangunk Ridge. Although the Appalachian Mountain Club was dominant in the area at the time, and strictly regulated rock climbing, Lester was never associated with the club, and found himself in conflict with the leading climber in the area, Hans Kraus, who was head of the AMC's Safety Committee. He was once turned down for climbing certification with the comment \"Likes people too much and is too enthusiastic.\" Lester was known for being generous and friendly. He was once called \"A one man climbing school.\"\n\nIn 1971, one week before his 75th birthday, Lester Germer died of a massive heart attack while lead climbing a rock climb at the Shawangunk Ridge (Eyebrow, 5.6). Until that moment, Lester had a 26-year perfect safety record in rock climbing; he had never even taken a leader fall."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-540-70626-7_45", "page_content": "The Davisson—Germer experiment (1927) was the first measurement of the wavelengths of ► electrons. C. J. Davisson, who worked in the Bell Research Laboratories, received the Nobel Prize in Physics for the year 1937 together with George P. Thomson from the University of Aberdeen in Scotland, who independently also found experimental indications of electron diffraction. According to the Copenhagen Interpretation of Quantum Mechanics, ► wave-particle duality leads to particles also exhibiting wave-like properties like extension in space and interference.\n\nClinton J. Davisson (1881–1958) and Lester H. Germer (1896–1971) investigated the reflection of electron beams on the surface of nickel crystals. When the beam strikes the crystal, the nickel atoms in the crystal scatter the electrons in all directions. Their detector measured the intensity of the scattered electrons with respect to the incident electron beam. Their normal polycrystalline samples exhibited a very smooth angular distribution of scattered electrons. In early 1925, one of their samples was inadvertently recrystallized in a laboratory accident that changed its structure into nearly monocrystalline form. As a result, the angular distribution manifested sharp peaks at certain angles. As Davisson and Germer soon found out, other monocrystalline samples also exhibited such anomalous patterns, which differ with chemical constitution, angle of incidence and orientation of the sample. Only in late 1926 did they understand what was going on, when Davisson attended the meeting of the British Association for the Advancement of Science in Oxford. There Born spoke about de Broglie's ► matter-waves and Schrodinger's ► wave mechanics. Their later measurements completely confirmed the quantum mechanical predictions for electron wavelength λ as a function of momentum p: λ = h/p. But their initial experiments (unlike G.P Thomson's) were conducted in the context of industrial materials research on filaments for vacuum tubes, not under any specific theoretical guidance.\n\nKeywords\n\nScattered Electron\n\nNickel Atom\n\nAntecedent Condition\n\nAtomic Particle\n\nInitial Kinetic Energy\n\nThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, {"url": "https://pantheon.world/profile/person/Lester_Germer", "page_content": "Lester Germer\n\nLester Halbert Germer (October 10, 1896 – October 3, 1971) was an American physicist. With Clinton Davisson, he proved the wave-particle duality of matter in the Davisson–Germer experiment, which was important to the development of the electron microscope. These studies supported the theoretical work of De Broglie . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Lester Germer has received more than 55,722 page views. His biography is available in 21 different languages on Wikipedia (up from 19 in 2019) . Lester Germer is the 521st most popular physicist (down from 516th in 2019), the 4,636th most popular biography from United States (down from 4,423rd in 2019) and the 102nd most popular American Physicist."}, {"url": "https://prabook.com/web/lester.germer/3760428", "page_content": "Lester Germer\n\nphysicist scientist\n\nJanuary 10, 1896 (age 74) Chicago, Illinois, United States\n\nUpon graduation in 1917 Germer obtained a position at the Western Electric Company in New York City, the engineering and research arm of the American Telephone and Telegraph Company (AT&T). Two months later he volunteered for the army as a pilot, serving in France, where he was officially credited with having brought down four German warplanes. Following his discharge of February 5, 1919, Germer was given a medical examination and was treated for shock and nervous strain. On March 1, 1919, Germer returned to his position at Western Electric and was assigned to work with Dr. Clinton J. Davisson, an electron physicist who was doing research on a reliable, distortionless repeater, or amplifier, for use in the long-distance telephone lines of AT&T. While studying the effect of positive ion bombardment on the efficiency of electron emission for oxide coated cathodes, Davisson and Germer noted that electrons directed at metal targets were reflected without loss of energy, a surprising result. While Davisson and a newly appointed colleague, Charles Kunsman, began to pursue studies with the elastically scattered electrons, Germer was assigned to a new project on thermionic emission. He and Davisson published important results on this topic in 1922, and in 1924 Germer published the results of further studies as his Ph. D. dissertation. Germer's hectic schedule (work, graduate school, and raising a family) was interrupted from April 1923 to July 1924, during which time he was treated for a nervous breakdown probably linked to a severe, recurrent sinus infection that was aggravated by noxious gas overseas. Shortly after Germer returned to work in 1924, he was reassigned to the electron scattering studies that had been assigned to Kunsman in 1920 but had been abandoned in late 1923, at which time Kunsman left the company. On February 5, 1925, while the electron tube previously used by Davisson and Kunsman was being reactivated, an accident occurred that eventually changed the character of the investigation. The heated, evacuated tube cracked, the nickel target was damaged, and the experiments were halted. When the tube was repaired and the experiments resumed, a surprisingly different pattern of the scattered electrons was observed. Attempts to explain this new behavior on the basis of the altered crystal structure of the nickel target were inconclusive, and Davisson and Germer expanded their study. Two years later, after further experimentation and after Davisson had obtained new theoretical insights during a trip to England and attendance at the 1926 meeting of the British Association for the Advancement of Science, Davisson and Germer realized that the new behavior of the scattered electrons could best be understood by attributing wave properties to them. In a series of papers published by Davisson and Germer, both jointly and separately, during the period 1927-1929, they demonstrated conclusively that electrons, like light, have the physical characteristics of waves as well as particles. Davisson and Germer realized that their discovery also had potential for yielding information about the structure of the material from which the electrons were scattered. Germer pursued these studies, using both the scattering method he and Davisson had developed, and also an electron transmission method developed by George P. Thomson in England, publishing over twenty papers in the field. At that time he developed an interest in the behavior of metal contacts under electrical discharge, another subject of interest to AT&T, which he pursued until 1957, publishing nearly twenty papers on this topic. Having completed this long series of studies, Germer's interest in electron diffraction was rekindled when a colleague at Bell Telephone Laboratories asked him to assist in developing a modified form of the electron scattering apparatus he and Davisson had used thirty years earlier. After Germer and his colleagues perfected this method, it proved to be so fruitful for the investigation of surface structures that Germer, even after his retirement from Bell Labs in 1961, continued this work as a research associate at Cornell University. During this time, besides publishing the results of his own research, he traveled to locations all over the world, lecturing and giving advice on the technique and interpretation of low-energy electron diffraction studies (LEED), a technique that has become indispensable to many fields of research. He died after a fall while climbing near Gardiner, New York."}, {"url": "https://link.springer.com/article/10.1007/BF01127674", "page_content": "Rankin, R. (1905). The cathode ray oscillograph.The Electric Club J II:620–631.\n\nHittorf, W. (1869). Über die Elektrizitätsleitung der Gase, I und II. (On the electrical conductivity of gases.)Ann. Physik. Chemie,16:1–31 und 197–234, Münster, 9 October 1868.\n\nBusch, H. (1927). Über die Wirkungsweise der Konzentrierungsspule bei der Braunschen Röhre. (On the mode of action of the concentrating coil in the Braun tube.)Arch. Elektrotechnik 18:583–594, Jena, Physikalisches Institut, März 1927.\n\nRuska, E. Über eine Berechungsmethode des Kathodenstrahloszillographen auf Grund der experimentell gefundenen Abhängigkeit des Schreibfleckdurchmessers von der Stellung der Konzentrierspule. (On a method of designing a cathode ray oscillograph on the basis of the experimentally found dependence of the writing spot diameter on the position of the contrating coil.) Carried out from 1 November 1928 in the High Voltage Laboratory of the Technische Hochschule Berlin (Director Professor A. Matthias). Student Project thesis (117 pp.) submitted 10 May 1929.\n\nRuska, E. and Knoll, M. (1931). Die magnetische Sammelspule für schnelle Elektronenstrahlen. (The magnetic concentrating coil for fast electron beams.)Z. techn. Physik 12:389–400 und 448, submitted 18 April 1931.\n\nKnoll, M. Vorrichtung zur Konzentrierung des Elektronenstrahls eines Kathodenstrahloszillographen. (Devise for concentrating the electron beam of a cathode ray oscillograph.) German Patent No. 690809, patented on 10 November 1929, granted on 11 April 1940.\n\nRuska, E. Untersuchung elektrostatischer Sammelvorrichtungen als Ersatz der magnetischen Konzentrierspulen bei Kathodenstrahl-Oszillographen. (Investigation of electrostatic concentrating devices as a substitute for the magnetic concentrating coils in cathode ray oscillographs.) Begun on 18 July 1930 in the High Voltage Laboratory of the Technological University of Berlin (Direktor Professor Dr A. Matthias) and submitted on 23 December 1930 as a Diploma Project (pp. 1–90).\n\nKnoll, M. and Ruska, E. (1932). Beitrag zur geometrischen Elektronenoptik I und II. (Contribution to geometrical electron optics.)Ann. Physik. 12:607–640 und 641–661, submitted 10 September 1931.\n\nKnoll, M. Berechnungsgrundlagen und neuere Ausführungsformen des Kathodenstrahloszillographen. (The bases of design and new forms of construction of the cathode ray oscillograph.) Manuscript of a lecture in the Cranz-Colloquium at the Technological University of Berlin on 4 June 1931, pp. 1–26.\n\nRuska, Ernst (1980), “The Early Development of Electron Lenses and Electron Microscopy”, S. Hirzel Verlag Stuttgart, pp. 113–116.\n\nDe Broglie, L. (1925). Recherches sur la théorie des quanta. (Researches on the theory of quanta.) Thèse, Paris: Masson & Cie, 1924Ann. de Physiques 3:22–128.\n\nKnoll, M. and Ruska, E. (1932). Das Elektronenmikroskop. (The electron microscope.)Z. Physik. 78:318–339, submitted 16 June 1932.\n\nv. Borries, B. and Ruska, E. Magnetische Sammellinse kurzer Feldlänge. (Magnetic converging lens of short field length.) German Patent No. 680284, patented on 17 march 1932; Patent granted on 3 August 1939.\n\nRuska, E. (1934). Über ein magnetisches Objektiv für das Elektronenmikroskop. (On a magnetic objective lens for the electron microscope.) Dissertation of the Technological University of Berlin, submitted 31 August 1933.Z. Physik. 89:90–128, submitted 5 March 1934.\n\nRuska, E. (1934). Über Fortschritte im Bau und in der Leistung des magnetischen Elektronenmikroskops. (On progress in the construction and performance of the magnetic electron microscope.)Z. Physik. 87:580–602, submitted 12 December 1933.\n\nSee Reference 10, pp. 120–122.\n\nMarton, L. (1934). La microscope électronique des objects biologiques. (Electron microscopy of biological objects.)Acad. roy. de Belg. Bull de la Cl. des Sci., Ser. 5,20:439–446, Université libre de Bruxelles, Mai 1934.\n\nMarton, L. (1936). Le microscope électronique. (The electron microscope.)Rev. de Microbiol. appl. 2, 117–124.\n\nSee Reference 10, pp. 123–124.\n\nBorries, B. v. and Ruska, E. (1938). Vorläufige Mitteilung über Fortschritte im Bau und in der Leistung des Übermikroskops. (Preliminary communication on advances in the construction and performance of the Ultramicroscope.)Wiss. Veröff. a.d. Siemens-Werken 17:99–106.\n\nBorries, B. v. and Ruska, E. (1939). Ein Übermikroskop für Forschungsindustrie. (An Ultramicroscope for industrial research.)Naturwissenschaften 27:577–582, submitted 24 June 1939.\n\nRuska, E. (1950). Über neue magnetische Durchstrahlungs-Elektronenmikroskope im Strahlspannungsbereich von 40...220 kV, Teil I. (On new magnetic transmission-electron microscopes for beam voltages between 40 and 220 kV.)Kolloid-Zeitschrift 116:103–120, submitted 15 December 1949.\n\nRuska, E. and Wolff, O. (1956). Ein hochauflösendes 100-kV-Elektronenmikroskop mit Kleinfelddurchstrahlung (A high-resolution transmission electron microscope (100 kV) with small-area illumination.Zeitschrift für wissenschaftl. Mikroskopie und mikroskopische Technik 62:466–509, submitted 19 July 1955.\n\nRiecke, W. D. and Ruska, E. (1966). A 100 kV transmission electron microscope with single-field condenser objective. VI.Int. Congress for Electron Microscopy, Kyoto, Japan,I:19–20.\n\nZemlin, F., Reuber, E., Beckmann, B., Zeitler, E. and Dorset, D. L. (1985). Molecular Resolution Electron Micrographs of Monolamellar Paraffin Crystals.Science 229:461–462.\n\nDietrich, I., Fox, F., Knapek, E., Lefranc, G., Nachtrieb, K., Weyl, R. and Zerbst, H. (1971). Improvements in electron microscopy by application of superconductivity,Ultramicroscopy 2:241–249."}, {"url": "https://iopscience.iop.org/article/10.1088/0953-8984/20/30/304210/pdf", "page_content": "We apologize for the inconvenience...\n\nTo ensure we keep this website safe, please can you confirm you are a human by ticking the box below.\n\nIf you are unable to complete the above request please contact us using the below link, providing a screenshot of your experience.\n\nhttps://ioppublishing.org/contacts/"}, {"url": "https://www.britannica.com/technology/electron-microscope", "page_content": "Combinations of techniques have given rise to the scanning transmission electron microscope (STEM), which combines the methods of TEM and SEM, and the electron-probe microanalyzer , or microprobe analyzer, which allows a chemical analysis of the composition of materials to be made using the incident electron beam to excite the emission of characteristic X-rays by the chemical elements in the specimen. These X-rays are detected and analyzed by spectrometers built into the instrument. Microprobe analyzers are able to produce an electron scanning image so that structure and composition may be easily correlated.\n\nThe transmission electron microscope (TEM) can image specimens up to 1 micrometre in thickness. High-voltage electron microscopes are similar to TEMs but work at much higher voltages. The scanning electron microscope (SEM), in which a beam of electrons is scanned over the surface of a solid object, is used to build up an image of the details of the surface structure. The environmental scanning electron microscope (ESEM) can generate a scanned image of a specimen in an atmosphere, unlike the SEM, and is amenable to the study of moist specimens, including some living organisms.\n\nGerman physicist Manfred, Freiherr (baron) von Ardenne, and British electronic engineer Charles Oatley laid the foundations of transmission electron microscopy (in which the electron beam travels through the specimen) and scanning electron microscopy (in which the electron beam ejects from the sample other electrons that are then analyzed), which are most notably recorded in Ardenne’s book Elektronen-Übermikroskopie (1940). Further progress in the construction of electron microscopes was delayed during World War II but received an impetus in 1946 with the invention of the stigmator, which compensates for astigmatism of the objective lens , after which production became more widespread.\n\nFundamental research by many physicists in the first quarter of the 20th century suggested that cathode rays (i.e., electrons ) might be used in some way to increase microscope resolution . French physicist Louis de Broglie in 1924 opened the way with the suggestion that electron beams might be regarded as a form of wave motion . De Broglie derived the formula for their wavelength, which showed that, for example, for electrons accelerated by 60,000 volts (or 60 kilovolts [k]), the effective wavelength would be 0.05 angstrom (Å)—i.e., 1/100,000 that of green light. If such waves could be used in a microscope, then a considerable increase in resolution would result. In 1926 it was demonstrated that magnetic or electrostatic fields could serve as lenses for electrons or other charged particles. This discovery initiated the study of electron optics , and by 1931 German electrical engineers Max Knoll and Ernst Ruska had devised a two-lens electron microscope that produced images of the electron source. In 1933 a primitive electron microscope was built that imaged a specimen rather than the electron source, and in 1935 Knoll produced a scanned image of a solid surface. The resolution of the optical microscope was soon surpassed.\n\nOperating principles\n\nAlthough there are similarities in principle between the layout of optical and electron microscopes, in practice the two are very different. The conventional electron microscope requires that the electron beam be in a vacuum, because electrons cannot ordinarily travel an appreciable distance in air at atmospheric pressure. The column of the electron microscope is evacuated by pumps, and the specimens and any other necessary apparatus are introduced into the vacuum by means of air locks. Unlike the optical microscope, in which the lenses are of fixed focus and the distance between specimen and objective lens is varied, the electron microscope has variable-focus lenses, and the distance between specimen and objective lens and the separation of the lenses remain constant. The magnification is determined mainly by the value of the current (for magnetic lenses) through the intermediate and projector lens coils. The image is focused by changing the current through the objective lens coil. Another difference is that the optical microscope is usually operated so that the image is a virtual one, while in the electron microscope the final image is invariably real and is visualized on a fluorescent screen or recorded for study on a photographic plate in traditional instruments or—more usually in today’s laboratory—on a digital imaging system.\n\nIn the optical microscope the image is formed by absorption of light in the specimen; in the electron microscope the image results from a scattering of electrons by atoms in the specimen. A heavy atom is more effective in scattering than one of low atomic number, and the presence of heavy atoms will increase the image contrast. The electron microscopist may incorporate more heavy atoms into the specimen for this purpose.\n\nEarly microscopes relied on electrostatic lenses, but modern instruments use electromagnetic lenses. These consist of a solenoid of wire together with a magnetic pole piece that creates and concentrates a magnetic field. The lenses used for the condenser and projector system of the microscope differ from the objective lens only in details. For example, the manufacturing and performance tolerances for a condenser or projector lens are less demanding than for an objective lens.\n\nEfforts to improve the resolution of the electron microscope have tended toward production of a single-field condenser-objective lens of low aberrations. In such a lens, the upper part acts as a condenser and the lower as the objective; the specimen is inserted into the centre of the lens, where the axial magnetic field (the field along the axis of the instrument) is at a maximum.\n\nAll electron lenses show spherical aberration, distortion, coma, astigmatism, curvature of field, and chromatic aberration due to variations in the wavelengths within the electron beam. Such changes of electron velocity may be either due to variations in the high-voltage supply to the electron gun or due to energy losses from collisions of electrons with atoms in the specimen. The first effect may be minimized by careful stabilization of the high-voltage supply; and for the very thin specimens and the high electron energies commonly used, the second effect may usually be neglected. The resolving power of the microscope is ultimately limited by the spherical aberration of the objective lens. It is not possible to correct this aberration by adding a second lens of opposite characteristics, as can be done for the optical microscope, because magnetic electron lenses are always convergent. Computer-aided lens design has led to great improvements in performance, but electron lenses still require much smaller numerical apertures than do optical lenses in order to function optimally.\n\nAstigmatism in the electron microscope is largely due to deviations from cylindrical symmetry in the radial components of the magnetic field of the lens and is the result of imperfect construction of the lens. The interaction of the electron beam with residual gas molecules in the column may also lead to deposits along the beam path that charge up under the influence of the beam and introduce asymmetries. Astigmatism may usually be completely corrected by use of the stigmators fitted to the objective lens."}, {"url": "https://chem.libretexts.org/Bookshelves/Analytical_Chemistry/Physical_Methods_in_Chemistry_and_Nano_Science_(Barron)/07%3A_Molecular_and_Solid_State_Structure/7.04%3A_Low_Energy_Electron_Diffraction", "page_content": "Low energy electron diffraction (LEED) is a very powerful technique that allows for the characterization of the surface of materials. Its high surface sensitivity is due to the use of electrons with energies between 20-200 eV, which have wavelengths equal to 2.7 – 0.87 Å (comparable to the atomic spacing). Therefore, the electrons can be elastically scattered easily by the atoms in the first few layers of the sample. Its features, such as little penetration of low–energy electrons have positioned it as one of the most common techniques in surface science for the determination of the symmetry of the unit cell (qualitative analysis) and the position of the atoms in the crystal surface (quantitative analysis).\n\nHistory: Davisson and Germer Experiment In 1924 Louis de Brogile postulated that all forms of matter, such as electrons, have a wave-particle nature. Three years later after this postulate, the American physicists Clinton J. Davisson and Lester H. Germer (Figure \\(\\PageIndex{1}\\)) proved experimentally the wave nature of electrons at Bell Labs in New York, see Figure 1. At that time, they were investigating the distribution-in-angle of the elastically scattered electrons (electrons that have suffered no loss of kinetic energy) from the (111) face of a polycrystalline nickel, material composed of many randomly oriented crystals. Figure \\(\\PageIndex{1}\\) Clinton Davisson (right) and Lester Germer (left) in their laboratory, where they proved that electrons could act like waves in 1927. Author unknown, public domain. The experiment consisted of a beam of electrons from a heated tungsten filament directed against the polycrystalline nickel and an electron detector, which was mounted on an arc to observe the electrons at different angles. During the experiment, air entered in the vacuum chamber where the nickel was, producing an oxide layer on its surface. Davisson and Clinton reduced the nickel by heating it at high temperature. They did not realize that the thermal treatment changed the polycrystalline nickel to a nearly monocrystalline nickel, material composed of many oriented crystals. When they repeated the experiment, it was a great surprise that the distribution-in-angle of the scattered electrons manifested sharp peaks at certain angles. They soon realized that these peaks were interference patterns, and, in analogy to X-ray diffraction, the arrangement of atoms and not the structure of the atoms was responsible for the pattern of the scattered electrons. The results of Davisson and Germer were soon corroborated by George Paget Thomson, J. J. Thomson’s son. In 1937, both Davisson and Thomson were awarded with the Nobel Prize in Physics for their experimental discovery of the electron diffraction by crystals. It is noteworthy that 31 years after J. J. Thomson showed that the electron is a particle, his son showed that it is also a wave. Although the discovery of low-energy electron diffraction was in 1927, it became popular in the early 1960’s, when the advances in electronics and ultra-high vacuum technology made possible the commercial availability of LEED instruments. At the beginning, this technique was only used for qualitative characterization of surface ordering. Years later, the impact of computational technologies allowed the use of LEED for quantitative analysis of the position of atoms within a surface. This information is hidden in the energetic dependence of the diffraction spot intensities, which can be used to construct a LEED I-V curve.\n\nPrinciples and Diffraction Patterns Electrons can be considered as a stream of waves that hit a surface and are diffracted by regions with high electron density (the atoms). The electrons in the range of 20 to 200 eV can penetrate the sample for about 10 Å without loosing energy. Because of this reason, LEED is especially sensitive to surfaces, unlike X-ray diffraction, which gives information about the bulk-structure of a crystal due to its larger mean free path (around micrometers). Table \\(\\PageIndex{1}\\) compares general aspects of both techniques. Low Energy Electron Diffraction X-ray Diffraction Surface structure determination (high surface sensitivity) Bulk structures determination Sample single crystal Sample single-crystal or polycrystalline Sample must be have an oriented surface, sensitive to impurities Surface impurities not important Experiment in ultra-high vacuum Experiment usually at atmospheric pressure Experiment done mostly at constant incidence angle and variable wavelength (electron energy) Constant wavelength and variable incidence angle Diffraction pattern consists of beams visible at almost all energies Diffraction pattern consists of beams flashing out at specific wavelengths and angles Table \\(\\PageIndex{1}\\) Comparison between low energy electron diffraction and X-ray diffraction. Like X-ray diffraction, electron diffraction also follows the Bragg’s law, see Figure \\(\\PageIndex{2}\\), where λ is the wavelength, a is the atomic spacing, d is the spacing of the crystal layers, θ is the angle between the incident beam and the reflected beam, and n is an integer. For constructive interference between two waves, the path length difference (2a sinθ / 2d sinθ) must be an integral multiple of the wavelength. Figure \\(\\PageIndex{2}\\) Representation of the electron and X-ray diffraction. In LEED, the diffracted beams impact on a fluorescent screen and form a pattern of light spots (Figure \\(\\PageIndex{3}\\) a), which is a to-scale version of the reciprocal lattice of the unit cell. The reciprocal lattice is a set of imaginary points, where the direction of a vector from one point to another point is equal to the direction of a normal to one plane of atoms in the unit cell (real space). For example, an electron beam penetrates a few 2D-atomic layers, Figure \\(\\PageIndex{3}\\) b), so the reciprocal lattice seen by LEED consists of continues rods and discrete points per atomic layer, see Figure \\(\\PageIndex{3}\\) c. In this way, LEED patterns can give information about the size and shape of the real space unit cell, but nothing about the positions of the atoms. To gain this information about atomic positions, analysis of the spot intensities is required. For further information about reciprocal lattice and crystals refer to Crystal Structure and An Introduction to Single-Crystal X-Ray Crystallography. Figure \\(\\PageIndex{3}\\) (a) LEED pattern of Cu (100) surface, (b) 2D atomic layer (real space), and its (c) reciprocal lattice. (a) adapted from Z. Robinson, E. Ong, T. Mowll, P. Tyagi, D. Gaskill, H. Geisler, C. Ventrice, J. Phys. Chem. C, 2013, 117, 23919. Copyright: American Chemical Society 2013. Thanks to the hemispheric geometry of the green screen of LEED, we can observe the reciprocal lattice without distortion. It is important to take into account that the separation of the points in the reciprocal lattice and the real interplanar distance are inversely proportional, which means that if the atoms are more widely spaced, the spots in the pattern get closer and vice versa. In the case of superlattices, a periodic structure composed of layers of two materials, new points arise in addition to the original diffraction pattern.\n\nLEED Experimental Equipment The typical diagram of a LEED system is shown in Figure \\(\\PageIndex{4}\\). This system sends an electron beam to the surface of the sample, which comes from an electron gun behind a transparent hemispherical fluorescent screen. The electron gun consists of a heated cathode and a set of focusing lenses which send electrons at low energies. The electrons collide with the sample and diffract in different directions depending on the surface. Once diffracted, they are directed to the fluorescent screen. Before colliding with the screen, they must pass through four different grids (known as retarding grids), which contain a central hole through which the electron gun is inserted. The first grid is the nearest one to the sample and is connected to earth ground. A negative potential is applied to the second and third grids, which act as suppressor grids, given that they repel all electrons coming from non–elastic diffractions. These grids perform as filters, which only allow the highest–energy electrons to pass through; the electrons with the lowest energies are blocked in order to prevent a bad resolution image. The fourth grid protects the phosphor screen, which possesses positive charge from the negative grids. The remaining electrons collide with the luminescent screen, creating a phosphor glow (left side of Figure \\(\\PageIndex{4}\\)), where the light intensity depends on the electron intensity. Figure \\(\\PageIndex{4}\\) Schematic diagram of a typical LEED instrument and an example of the LEED pattern view by the CCD camera. Adapted from L. Meng, Y. Wang, L. Zhang, S. Du, R. Wu, L. Li, Y. Zhang, G. Li, H. Zhou, W. Hofer, H. Gao, Nano Letters, 2013, 13, 685. Copyright: American Chemical Society 2013. For conventional systems of LEED, it is necessary a method of data acquisition. In the past, the general method for analyzing the diffraction pattern was to manually take several dozen pictures. After the development of computers, the photographs were scanned and digitalized for further analysis through computational software. Years later, the use of the charge–coupled device (CCD) camera was incorporated, allowing rapid acquisition, the possibility to average frames during the acquisition in order to improve the signal, the immediate digitalization and channeling of LEED pattern. In the case of the IV curves, the intensities of the points are extracted making use of special algorithms. Figure \\(\\PageIndex{5}\\) shows a commercial LEED spectrometer with the CCD camera, which has to be in an ultra-high vacuum vessel. Figure \\(\\PageIndex{5}\\) Commercial LEED Spectrometer (OCI Vacuum Micro engineering Inc)."}, {"url": "https://www.geni.com/people/Lester-Germer/6000000024889691078", "page_content": "About Lester Germer\n\nhttp://en.wikipedia.org/wiki/Lester_Germer\n\nLester Halbert Germer (October 10, 1896 – October 3, 1971) was an American physicist. With Clinton Davisson, he proved the wave-particle duality of matter in the Davisson–Germer experiment, which was important to the development of the electron microscope. These studies supported the theoretical work of De Broglie. He also studied thermionics, erosion of metals, and contact physics. He was awarded the Elliott Cresson Medal in 1931.\n\nA former fighter pilot in World War I, Germer subsequently worked at Bell Labs in New Jersey.\n\nIn 1945 (at the age of 49), Germer launched a side career as a rock climber. He climbed widely around the Northeast United States, and especially at New York's Shawangunk Ridge. Although the Appalachian Mountain Club was dominant in the area at the time, and strictly regulated rock climbing, Lester was never associated with the club, and found himself in conflict with the leading climber in the area Hans Kraus, who was head of the AMC's Safety Committee. He was once turned down for climbing certification with the comment \"Likes people too much and is too enthusiastic.\" Lester was known for being generous and friendly. He was once called \"A one man climbing school.\"\n\nIn 1971, one week before his 75th birthday, Lester Germer died of a massive heart attack while lead climbing a rock climb at the Shawangunk Ridge (Eyebrow, 5.6). Until that moment, Lester had a twenty six year perfect safety record in rock climbing; he had never even taken a leader fall."}, {"url": "https://iopscience.iop.org/book/978-0-7503-2678-0/chapter/bk978-0-7503-2678-0ch15", "page_content": "We apologize for the inconvenience...\n\nTo ensure we keep this website safe, please can you confirm you are a human by ticking the box below.\n\nIf you are unable to complete the above request please contact us using the below link, providing a screenshot of your experience.\n\nhttps://ioppublishing.org/contacts/"}]}