{"Rod Morgenstein joined Winger in 1987.": [{"url": "http://www.rodmorgenstein.com/winger-bio.htm", "page_content": "\n\nKip Winger--Lead vocals, bass\n\nReb Beach--Lead guitar, vocals\n\nRod Morgenstein--Drums\n\nPaul Taylor--Guitar, keyboards, vocals\n\nJohn Roth--Guitar, keyboards, vocals\n\nWinger Is Back-- After a nine year hiatus, the original members of one of\n\nthe 80's most successful rock bands are back. Winger, the group who spawned\n\nno less than seven MTV and radio hits, is reuniting for a spring/summer 2002\n\nworld tour. Widely respected for their high caliber musicianship, diverse\n\nmusic backgrounds, and eclectic music, Winger has always stood apart from\n\nthe crowd and are clearly in a class of their own. The Metal Days (1987-93)\n\n\n\nDebut Release\n\nWinger forms in 1987.\n\n\n\nDebut album, Winger, is released in 1988 on Atlantic Records, and soars\n\nfar past the platinum mark in the U.S. and goes gold in Japan and Canada,\n\nestablishing Winger as one of the hottest new bands on the scene.\n\n\n\nRadio and MTV hits include \"Madalaine\", \"Seventeen\", \"Headed For A\n\nHeartbreak\" and \"Hungry\".\n\n\n\nThe companion home video, Winger: The Videos/Volume One, sails past the\n\nRIAA gold mark.\n\n\n\nWinger tours for over a year with the likes of Bad Company, Scorpions,\n\nCinderella, Bon Jovi, Poison, Skid Row and Tesla.\n\n\n\nBand is nominated in 1990 for an American Music Award for Best New Heavy\n\nMetal Band.\n\n\n\nSecond Release\n\n1990 release of In the Heart of the Young on Atlantic Records mines more\n\nRIAA platinum in the U.S. and gold in Japan.\n\n\n\nHit radio tracks and MTV videos include \"Can't Get Enuff\", \"Miles Away\"\n\nand \"Easy Come Easy Go\".\n\n\n\nWinger tours the world for 13 months playing over 230 dates with Kiss,\n\nScorpions, ZZ Top, Extreme and Slaughter.\n\n\n\nThird Release 1993-Winger releases the critically acclaimed Pull on Atlantic Records.\n\n\n\nThe track \"Down Incognito\" is a smash at radio.\n\n\n\nWinger tours the U.S., Japan and Canada.\n\nPost Metal Days (1993-2000)\n\nAfter the band wraps up a tour of Japan in the Fall of 1993, the members\n\neach go their separate ways to pursue individual goals. KIP WINGER--Moves to Santa Fe, New Mexico and builds his own recording\n\nstudio. Composes, arranges, performs, engineers and produces 3 solo records,\n\nThis Conversation Seems Like A Dream (1997), Made by Hand (1998) and Songs\n\nFrom the Ocean Floor (2000), which all receive worldwide critical acclaim.\n\nSolo tours of the US, Japan and Europe follow each release. Currently\n\nscoring music for film. REB BEACH--Records and tours the world with Alice Cooper from 1996-98..\n\nRecords and tours with Dokken from 1998 through 2001, including the hugely\n\nsuccessful Poison/Cinderella/Dokken/Slaughter summer 2000 US tour. Releases\n\nhis first solo recording, Masquerade in 2001. ROD MORGENSTEIN--Records and tours with the Dixie Dregs, Jazz is Dead, and\n\nRudess Morgenstein Project. Also records with Kip Winger, Platypus and Jelly\n\nJam ( featuring members of Dream Theater and King¹s X). Has been an\n\nAssociate Professor of Percussion at Berklee College of Music in Boston\n\nsince 1997. PAUL TAYLOR--Records, tours, and co-writes most of the songs on Steve\n\nPerry¹s For The Love Of Strange Medicine (1995). Tours with Alice Cooper in\n\n1996-97, Tommy Shaw in 1998, and John Waite in 1999. Also has been active\n\nwriting music for film and television. JOHN ROTH--Tours in 1998 throughout Europe with Kip Winger in support of\n\nThis Conversation Seems Like A Dream and Made by Hand. Records with Kip\n\nWinger for Songs From the Ocean Floor (2000). Presently working on his first\n\nsolo recording as well as performing live with the John Roth Band. 2002\n\nNearly nine years since Winger last performed live, the band members are\n\npumped to reunite for what will be an unforgettable spring/summer 2002 tour\n\nwith Poison, Cinderella, and Faster Pussycat. With a renewed energy and a\n\nvast combination of musical and creative diversity, Winger will bring their\n\nspecial brand of music back to their fans. See you there....\n\n\n\nCheck out Winger tour dates with Poison"}, {"url": "https://xsrock.com/winger-where-are-they-now/", "page_content": "Winger released their debut album “Winger in 1988 and it scored the band its first platinum-selling album. Winger released its second album In the Heart of the Young in 1990 and it also went platinum. Since then the band has released the following albums: Pull (1993), IV (2006), Karma (2009), and Better Days Comin’ (2014). The band is currently in the studio finishing a new album for release in the near future.\n\nOur article about Winger and Beavis & Butthead has been one of the most viewed in XS ROCK’s history. You can read it here: https://xsrock.com/how-beavis-butthead-ruined-wingers-coolness-at-the-peak-of-their-popularity/\n\nAnd now for the big question, Winger…Where Are They Now?\n\nKip Winger\n\nKip Winger (real name Charles Frederick Kip Winger) got his first break co-writing the song Bang Bang for Kix’s “Midnite Dynamite” album and playing bass and providing backup vocals on the Alice Cooper albums “Constrictor” and “Raise Your Fist And Yell”. Alice Cooper suggested that the band change their name to “Winger” from “Sahara”, which is what the band was using n the early days. Winger found success with two platinum albums, but their third album “Pull” didn’t meet the sales of the albums before it and the band went in different directions pursuing solo careers for quite some time. Kip Winger married Beatrice Richter in 1991 but tragedy would strike in 1996 when she was killed in a car accident. Kip Winger released the following solo albums: This Conversation Seems Like a Dream (1997), Down Incognito (1999), Songs from the Ocean Floor (2001), From the Moon to the Sun (2008), Ghosts – Suite No. 1 (2010) and Conversations with Nijinsky (2016). In 2019 Kip composed the soundtrack to “Get Jack” a musical thriller about Jack The Ripper. Kip is currently working on finishing the latest Winger album.\n\nhttps://www.kipwinger.com/\n\nReb Beach\n\nWhen Winger disbanded after the “Pull” album, Reb Beach (real name Richard Earl Beach Jr.) stayed very busy playing guitar for Alice Cooper and joined Dokken for the album “Erase The Slate” and also performed on their live album “Live From The Sun”. He would then go on to Whitesnake, where he still remains a member of the band as well as a member of Winger. Reb also has been in several so-called supergroups featuring all-star members from other well-known bands like The Mob and Black Swan. Reb Beach has also released several solo albums showcasing his guitar virtuoso skills with “The Fusion Demos”, “Masquerade”, and “A View From The Inside”.\n\nhttp://www.rebbeach.com\n\nRod Morgenstein\n\nPrior to joining Winger, drummer and percussionist Rod Morgenstein played with The Dixie Dregs and Steve Morse’s solo band. He’s also been involved as a member of several progressive rock groups like Platypus, Jelly Jam, and Rudess/Morgenstein Project alongside Dream Theater’s Jordan Rudess.\n\nhttp://www.rodmorgenstein.com/\n\nPaul Taylor\n\nPaul Taylor (real name Paul Horowitz) was playing in Alice Cooper’s solo band alongside Kip Winger back in 1987. The two would work on original songs in their downtime and would later use many of those songs for the first Winger album. Paul played on the first two Winger albums Winger (1988) and In the Heart of the Young (1990). He has rejoined the band for different tours over the years. He played on Alice Cooper’s “Fistful Of Alice” (1997) and former Journey singer Steve Perry’s solo album “For the Love of Strange Medicine” (1994)\n\nJohn Roth\n\nGuitarist John Roth joined Winger after working with Kip Winger on several of his solo albums. Roth has played on the following Winger albums: Winger IV (2006)\n\nWinger Live (2007), Karma (2009) Better Days Coming (2014). John Roth got his big break playing for Black Oak Arkansas when he was just 19. He has also toured and performed with the Starship, Eddie Money, Mike Reno of Loverboy, Taylor Dane, and more. He has also been in the critically acclaimed band Giant.\n\nhttp://johnroth.com/"}, {"url": "https://www.canadianclassicrock.com/artist-roster/winger/", "page_content": "Born in 1987 under the initiative of former ALICE COOPER band member Kip Winger (vocals, bass) and Reb Beach (guitars), WINGER’s line-up was completed by Paul Taylor (another ex ALICE COOPER on guitars and keyboards) and former DIXIE DREGS drummer Rod Morgenstein. WINGER recorded three very successful studio albums. The self-titled debut, was released in 1988 on Atlantic, achieved platinum status in the United States, and gold in Japan and Canada sporting such hits as “Madalaine”, “Seventeen” and “Headed For A Heartbreak”.\n\nIn 1990, the band was nominated for an American Music Award for “Best New Heavy Metal Band”. Shortly after, WINGER released its second album “In the Heart of the Young”, which went platinum in the U.S. and gold in Japan. The album included WINGER’s biggest hit “Miles Away”, who topped at #12 of Billboard charts in the USA. Their third and last studio album, “Pull”, was recorded in 1992/93 as a three-piece band, following Paul Taylor’s departure. Produced by Mike Shipley, on the following tour John Roth was called in to replace Paul Taylor.\n\nAfter the “Pull” tour, Kip Winger embarked on a solo career which encompassed 3 successful solo albums, singing with ALAN PARSONS live Project, 2 film scores plus performing over 400 acoustic shows and writing and producing for countless other artists. Reb Beach recorded one solo album, joined ALICE COOPER, DOKKEN and now WHITESNAKE, later joining Kelly Keagy (Night Ranger), Timothy Drury (WHITESNAKE) and Doug Pinnick (KING’S X) to form the Hard Rock combo “THE MOB”. Rod Morgenstein went on to form the RUDESS / MORGENSTEIN project with Jordan Rudess (DREAM THEATER) and later JELLY JAM with Ty Tabor (KING’S X) and John Myung (DREAM THEATER). He is currently associate professor at Berkley College of Music.\n\nIn 2001 the band returned to the studio to record the song “On the Inside” for “The Very Best of Winger”. In 2002 they reunited to tour the US and Canada on a bill with POISON and CINDERELLA. After years of consideration Kip Winger decided to reunite WINGER for a brand new album in 2006. The release of “IV” brought Winger to tour Europe, US and Japan with great success and was followed by the release of the band’s first live CD and DVD.\n\nThe inspiration for a new WINGER came about at the end of 2008, when Kip had the vision to melt the more commercial, heavier and song oriented approach of the first two albums with the more “thinking-man” approach of the last two studio records. Hence the title, “Karma” which represents Winger completing its full musical circle.\n\nThe result is an amazing new record where the four band members: Kip, Reb, Rod and John shine with an incredible instrumental and vocal prowess at the service of superb Hard Rock songs but with an uncanny sense of melody."}, {"url": "https://www.moderndrummer.com/2010/11/rod-morgenstein/", "page_content": "Rod Morgenstein: Cross-Genre Ripping\n\nRod Morgenstein is best known as the blazing left-handed drummer with the influential fusion band Dixie Dregs and the pop-metal band Winger. Rod’s professional career began in 1975 while he was still a student at the University of Miami, which is where a nascent Dregs—known at the time as Rock Ensemble II of the Studio Music and Jazz curriculum—honed their skills and recorded their album The Great Spectacular (released on CD in 1997). When the band temporarily disbanded in 1983, Morgenstein joined fellow Dreg Steve Morse to form the Steve Morse Band, with whom the drummer recorded two albums.\n\nIn 1986 Morgenstein moved to New York City and soon met singer/bassist Kip Winger and guitarist Reb Beach. Winger’s self-titled 1988 release went platinum in the U.S. and led to an American Music Award nomination for Best New Heavy Metal Band. Follow-up In The Heart Of The Young also went platinum. Although the group disbanded in 1993, they have since reunited on several occasions. Morgenstein also appeared on Kip Winger’s solo albums This Conversation Feels Like A Dream (1997) and Songs From The Ocean Floor (2001). Rod has also taken part in numerous prog-rock side projects and supergroups, such as the Rudess/Morgenstein Project, Platypus, and the Jelly Jam, featuring members of Dream Theater and King’s X.\n\nMorgenstein, who is a longtime columnist for Modern Drummer and a member of the 2011 MD Pro Panel, has released numerous instructional videos, CDs, and books, and is currently a professor of percussion at Berklee College of Music."}, {"url": "http://rodmorgenstein.com/about.html", "page_content": "ABOUT ROD\n\nRod\u0092s professional music career began as a founding member of the groundbreaking group the Dixie Dregs when, as a student at the University of Miami in Florida, he met Steve Morse, Andy West and Allen Sloan. The university was a hotbed of musical activity during this period, playing host to brilliant future talents like Pat Metheny, Jaco Pastorius, Danny Gottlieb, T Lavitz and Bruce Hornsby. Playing under the official Studio Music and Jazz curriculum title of Rock Ensemble II, the Dregs honed their fusionesque chops. It was here that the band recorded its classic Great Spectacular album now available on CD.\n\nThe Dixie Dregs' music combines rock, jazz, bluegrass, folk and classical influences into a rich, ever-changing tapestry of sound. All the while, Rod\u0092s drumming weaves its way seamlessly and colorfully through this swirling musical landscape.\n\nHis unique, dynamic and musical drumming style has led to Rod\u0092s winning the Best Progressive Rock Drummer award in Modern Drummer Magazine\u0092s Reader\u0092s Poll 5 years in a row (1986-1990) and Best All-Around Drummer (1999), earning him a permanent position in the magazine\u0092s prestigious Honor Roll. The Dixie Dregs, whose last 6 recordings have each received Grammy nominations for Best Rock Instrumental Performance, are best described in the following Philadelphia Inquirer concert review, \u0093The Dregs have their own unique language and style familiar to bluegrass and country music, refined with classical finesse and delivered with high-powered technology and rock energy. The band is possibly the most important, and certainly the most technically advanced, instrumental group in progressive fusion.\u0094\n\nWhen the group temporarily disbanded in 1983, Rod joined forces with Steve Morse who, along with bassist Jerry Peek, formed the Steve Morse Band. Rod remembers, \u0093One of our biggest breaks came when we had the opportunity to tour for 3 months with Rush on their 1985-1986 Power Windows tour. I felt a surge of popularity, both as a band and as a drummer, as a result of performing night after night in sold out arenas packed with appreciative progressive-rock fans. And it was more than obvious that many of them were drummers.\u0094\n\nThe Steve Morse Band recorded two albums, at which point Rod found himself at a crossroad in his career, as Steve Morse joined the reforming group Kansas. \u0093I was ready for a musical change and to try something both new and challenging.\u0094\n\nWithin a year of moving to New York City in 1986 after living in and around Atlanta, Georgia, for the previous 11 years, Rod met Kip Winger and Reb Beach, namesake and lead guitarist of the as-of-then-non-existent band Winger. \u0093Kip and Reb had been writing and recording demos and forever being rejected by record labels. I met them at a point in their lives where they were completely driven to get signed. Nothing could shake their determination. We got together and jammed, hit it off, and two months later they called to say they got a deal and to see if I\u0092d be interested in doing the record.\u0094\n\nThe rest is history! Their self-titled debut album in 1988 sold over two million copies worldwide, earning the band a platinum album in the U.S. and gold albums in Japan and Canada. It also led to an American Music Award nomination for Best New Heavy Metal Band. This album was followed by In the Heart of the Young and, once again, platinum and gold awards were in the offing, coupled with non-stop international touring.\n\nThe band ceased activities in 1993 after touring for the highly acclaimed Pull recording, as dramatic changes were taking place in the music scene. Alternative music had replaced metal as the accepted music of the day.\n\nIn 2002, WInger reunited for a summer tour with Poison, CInderella and Faster Pussycat in support of 'The Very Best of Winger', a greatest hits collection. And in 2006, the band released the critically acclaimed, 'Winger IV', followed by tours in Europe, US, Japan and Australia.\n\nIn 1993, when Winger temporarily disbanded, Kip Winger set out to record his first solo album, This Conversation Seems Like Dream (1997), a dramatic departure from the first three Winger recordings, drawing heavily on world percussive rhythms, dark imagery and heavy grooves. Rod recorded the drum tracks for this album and the more recent Songs From The Ocean Floor (2001) at Kip\u0092s home studio in Santa Fe, New Mexico.\n\n1997 also saw the self-titled debut release by the Rudess/Morgenstein Project, an instrumental progressive power-duo, featuring Rod and Dream Theater keyboardist extraordinaire Jordan Rudess. The seed for this project was planted one evening on the Dixie Dregs 1994 Full Circle tour in Fort Lauderdale, Florida, when a sudden power failure shut down the guitar, bass and violin rigs. For whatever reason, the keyboards remained unaffected. And what followed was a blistering, 10 minute drum/keyboard power-duo jam, which brought down the house. It was that evening\u0092s events, which inspired Rod and Jordan to form their \u0093small in numbers yet mighty in sound\u0094 band. The Rudess Morgenstein Project has played concerts in the US, Costa Rica, Venezuela, Mexico, Germany, Holland and the UK. Additionally, Rod recorded the drum tracks for Jordan's solo cds, ' Rhythm of Time' and 'The Road Home'.\n\nOther on-going projects that Rod is involved with are jam band Jazz Is Dead which features creative improvisations of the music by the Grateful Dead. Members of JID have included T Lavitz, Alphonso Johnson, Jeff Sipe, Billy Cobham, Jeff Pevar, Dave Livolsi, and Jimmy Herring, with an ever-changing line up. Another project is Platypus, whose two recordings feature John Myung (Dream Theater), Ty Tabor (King\u0092s X) and Derek Sherinian (Planet X). The music is a mix of instrumental and vocal tunes that blend many different styles together. An offshoot of Platypus is The Jelly Jam, a power trio featuring Rod, Ty Tabor and John Myung. Their debut release came out in 2001, and The Jelly Jam, '2' was released in 2004\n\nIn addition to his recording and touring credits, Rod is very active in drum education. He is currently a Professor of Percussion at Berklee College of Music in Boston, Mass. Also, his highly recognized instructional materials include videos, audio cassettes and books. His most recent offering is Drum Set Warm-Ups , touted as the definitive text for developing and improving all aspects of drum set playing. Additionally, Rod has been a columnist for Modern Drummer Magazine (U.S.), Rhythm Magazine (UK), Sticks Magazine (Germany) and is an international clinician and involved with product development for Sabian Cymbals (Signature Tri-Top Ride), and Vic Firth Sticks (Signature Sticks and Isolation Headphones), with whom he has been an endorser for many, many years."}, {"url": "http://www.metal-temple.com/site/catalogues/entry/musicians/kip_winger_reb_beach.htm", "page_content": "Age of the Wolf – A Pilgrimage to Nowhere · Undrask - God Emperor · Metal Church - Congregation of Annihilation · Death of Giants – Ventesorg · The Biscuit Merchant – Phobia · Artificial Sun – The Giants Collapse · Necronomicon - Constant to Death · Silkof Grove - Death Construction · D.R.E.P. – Drastically Reducing Earth’s Population · Terrifier - Trample The Weak, Devour The Dead Latest updates: We hope you enjoy your visit here. Please join or login if you have joined before. MT @ Facebook\n\n\n\nFollow @metaltemple\n\nNot logged in Username / E-mail address Password Remember me Be invisible\n\n\n\nUsers online 33 guests Welcome to our newest member, patrickbarnes Kip Winger, Reb Beach, Rod Morgenstein, Rob Roth (Winger) Interview with Kip Winger, Reb Beach, Rod Morgenstein, Rob Roth from Winger by Dimitris Kontogeorgakos at 20 March 2010, 9:03 PM Share this on Facebook | Share this on Twitter It was an interview planned to be contacted only with Kip Winger. Eventually, there was also Reb Beach and after a some time the rest of the band joined in turning this interview into a fruitful discussion. So, read below what was said leaving aside all the small talk in between that I mostly enjoyed. It is always nice to talk to really down to earth musicians who keep their feet to the ground no matter what. So, how did you find the show yesterday (01 December 2009) ?\n\nKip Winger: The crowd was amazing. Have you been there?\n\n\n\nYeah I did and it was really great. What about the venue; did you like it?\n\nKip Winger: What are you doing now? This is a really stupid question!\n\nReb Beach: (altering his voice) Did we like it? Did it look like we were having fun? Come on, we had a great time!\n\nKip Winger: Where is this question going? Are you going to ask us how do we feel playing into big arenas and now we are playing in small clubs?\n\n\n\n\n\n\n\nWait a minute guys I believe you have misunderstood me; if you waited for the next question you'd understand my point.\n\nKip Winger: Ok, let's hear it.\n\n\n\nBefore fixing a live date do you look the venue you are going to play?\n\nKip Winger: No. We sent a contract saying the size of the stage we play and we showed them yesterday but what we could possibly do?\n\nReb Beach: Could we say “Fuck you, we are not going to play” ?\n\nKip Winger: In this way the fans get fucked.\n\n\n\nSo, you played yesterday for the fans.\n\nKip Winger: Absolutely.\n\n\n\nSo, this where my initial question was going. I did not mean in any way to sound aggressive…\n\nKip Winger: Please don't take offense to anything we say…\n\nReb Beach: He is a nice guy Kip. But know that his answers will be totally different for mine because we are exactly the opposite in every way…(laughs)\n\n\n\nSo, Reb did someone steal your guitar pedal yesterday?\n\nReb Beach: Yeah someone stole it right off the stage. That was the first time someone has seen me angry. It was a very expensive pedal…\n\nKip Winger: The guys grabbed the pedal and run out of the club.\n\n\n\nTalking about a small venue… So, let's move on; you have played live in the US and in Europe can you spot the differences between them?\n\nKip Winger: In general I think the audiences in Europe are better because they listen to the music in more detail. Between New York and L.A. there are some great audiences but I just prefer…. mmm this is political incorrect. What I find is that the Europeans listen to the music more intensely than the Americans…\n\nReb Beach: (with a funny voice) So, are you saying that the Americans are musically dummer? (all laughing).\n\nKip Winger: I did not say that. I think Europeans take it more seriously like listening to the band and knowing everything about the band. You know it's a little more detailed.\n\n\n\nWill you tour the US?\n\nKip Winger: Hopefully we will. We are tying to plan that now but we have difficulties booking gigs since Reb is in WHITESNAKE, Rod teaches in Berkeley and John is also in GIANT, so it is tough you see.\n\n\n\n\n\n\n\nLet's talk about music; what are the differences between “Karma” and “IV” from your point of view?\n\nReb Beach: Well, I can say something here. Even that I feel nervous that Kip is sitting beside me and we have not done an interview together for years I have to say that with ”IV” I got to his house and he told me that he had a vision about how the album should be from front to back. “So, just sit there and when I need a guitar riff I am going to ask for”. So, I was the guitar-riff writer guy. But he did all the rest. That album was his baby and his vision.\n\nKip Winger: No….\n\nReb Beach: Yes, Kip, this was exactly the way and I won't do that ever again (laughs). You know he is the classical genius, a 76-piece orchestra guy who writes for ballets (actually he has wrote one lately) and this was his chance to kind of insert all that into a Rock album and do his thing. But, with ”Karma” when I got to his house he asked me “What do you want to do Reb?”, I said that I wanted to go back to the old sound.\n\n\n\nYeah, I also believe that this album is more guitar-driven than the previous.\n\nKip Winger: We took a six pack of beers, a bag of weed and sat down for 10 days and wrote these 10 songs.\n\n\n\n(John Roth and Rod Morgenstein joined the conversation) Kip Winger: Hey man, you can interview the whole band. Do you know how rare this is? I don't even know if this has ever happened.\n\n\n\nSo, now that you are all here I have to jump to this question; is Kip an easy person to work with?\n\nReb Beach: He is very easy.\n\nKip Winger: Do I have a bad reputation?\n\nReb Beach: He is awesome, he listens what you have to say and he is a genius. He will take your idea and make the most of it.\n\n\n\nReally, the writing process just took 10 days? Was it so intense?\n\nReb Beach: Yeah man, we wrote one song per day. Kip asked us to write a song per day or at least a piece of a song per day. I said OK, I am going to do it. I wrote one song in two months. But with Kip you get up in the morning and star working and by noon you are in the studio working all-day-long until you're done.\n\nKip Winger: That's why in Nashville where I live everybody fucking writes.\n\nReb Beach: For me this is impossible unless Kip is whipping me to work. But I can still get wasted while he is whipping me (laughs).\n\n\n\nWhat about the title of the album; is there a special meaning behind it?\n\nReb Beach: It is really about WINGER. Back in the 80s when we were listening to all those bands we were thinking that we could better than them. So, now we thought that this album could be successful and it would be like karma after all the bad things that happened to us.\n\n\n\nSo, Kip what is the story behind BLACKWOOD CREEK?\n\nKip Winger: We had a band with my brother and those guys so we did an album for the old-good-times sake.\n\n\n\n\n\n\n\nCan we expect something like this in the future?\n\nKip Winger: I really don't know. We finished this album mixing old ideas with some new ones in a 70s, very poppy and simple way. It was really cool.\n\n\n\nYou are all busy outside WINGER so my question is: can an artist be fully dedicated in a band when he is doing several things on the side?\n\nRod Morgenstein: This question could be “can walk and chew gum at the same time” ? After all, we have been doing this for so long so, yes, we manage with that…\n\nKip Winger: No matter in how many bands we are in, we have certain standards for this band and definite vibe that is pretty obvious when you see us live. This is 16 years of chemistry…\n\n\n\nAnother one question for Kip; you had the premier for “Ghosts” so, how does it feel like?\n\nKip Winger: Well, it was not like a premier since it was performed with the Tucson Symphony that was really cool. But the actual premier is the ballet with the choreography and all this stuff. It is a dream that came true for me. I wrote it a while ago but I was thinking of doing something like this like 20 years. It is very very exciting.\n\n\n\nHow different was it working for “Ghosts” when compare to the work with WINGER?\n\nKip Winger: I have been trying to do this for a long time. I actually felt like home. You know something, I am not a jammer. All these guys can jam really well but I am not like it. When I do music it has to be precisely where to do what. So, I do Rock music like orchestra music. It is all got to be in its place. I can jam with the band in the Blues but that's it…\n\nRod Morgenstein: We totally disagree with him because he can jam great.\n\n\n\nHave you ever thought of rearranging WINGER's music and add some classical elements?\n\nKip Winger: I thought of this two days ago. Maybe we can call it WINGER-suite (laughs). We could do “Rainbow In The Rose” or “Headed For A Heartbreak” or “Hungry”. Maybe we will do it. I do not know when, but I have thoughts about it.\n\n\n\n\n\nSo, you have been in the band almost for two decades; do you feel satisfied?\n\nRod Morgenstein: Well, this is not an easy question to answer; it is a mixture of feelings. There is the musical satisfaction in terms of you can listen to your CD and be proud of the band. It was a really interesting career all these years playing in all venue sizes but this band also had its ups and downs. When music changed all of a sudden and Metal took a dive with NIRVANA and PEARL JAM taking over the scene. Then there was a frustrating time period when everyone thought that this sound was very cool. So, to be is a combination of what we have accomplished in terms all the different albums we made but still we could do a lot better… John Roth Personally, I don't really care how many peopled are watching us live as long as they sing every single lyrics like last night. That is the most satisfied. When you make an album and send to the world you never know what the reaction will be. But when you see such a reaction as a performer it is the ultimate reward.\n\n\n\nThis is great to hear something like this from musicians who have been around so many years. Because, I think most of the new bands care more about the selling numbers than they do about the fans. Rod Morgenstein: Really? Who, for example?\n\n\n\nThere is no point of giving specific names. But it is the reality…\n\nKip Winger: You say that the new bands care of the albums they are selling?\n\n\n\nYeah I do.\n\nKip Winger: In that case, good luck.\n\nRod Morgenstein: Yeah, good luck because it is not the right time to worry about the numbers. If you are not doing it because you love it, then what's the point?\n\nKip Winger: You can hear the music, I think. This is why there is so much shitty music out there. On the other hand the Internet has brought in front many great bands and artists that you'd never have heard of them. So, it is really a double-edged sword.\n\n\n\nHave you ever thought of celebrating the 20 years with WINGER?\n\nKip Winger: Why? We don't feel that we have achieved something special. We were always trying hard so we never noticed what we have done.\n\nReb Beach: If you think hard we are an 80s band that came out on the late 80s. Actually it was 1989 when the Hard Rock scene was in its way down. But now we are all doing the same thing; playing in the same places like we do. Kip Winger: BON JOVI and DEF LEPARD were bigger than everybody else and they are still big.\n\nReb Beach: DEF LEPARD came out in 1980. I remember buying ”On Through The Night” and being jealous of the guitarist who had my age!\n\n\n\n\n\nHave you ever felt threatened by the press in any way?\n\nReb Beach: Just tonight! (laughs)\n\nKip Winger: Are you kidding? We were more attacked than every other band. What do you think? This is our question to you. Do you think that we were threatened?\n\n\n\nYeah, I believe so.\n\nKip Winger: Thank you! This was a rhetoric question after all. It definitely affected us back in those days, but what can you really do about it? Are you talking about the “Beavis And Butt-head” thing?\n\n\n\nNo, it is more of a general question.\n\nKip Winger: So, you are asking if we listen to the critics and read their reviews?\n\n\n\nYes.\n\nRod Morgenstein: We do read the reviews but we also know that this is what one person wrote and not a team of people. On the other hand we are humans; so, when a bad review comes in -especially in the first days- it hurts! I mean, you spent a lot of time working into the music and then one comes to say that it sucks.\n\n\n\nSo, thank you very much guys for your time. It was a real pleasure talking to the entire band.\n\n\n\nRating Unrated You do not have permission to rate Edited 10 June 2023 Edited 10 June 2023 : Ok, let's hear it.: No. We sent a contract saying the size of the stage we play and we showed them yesterday but what we could possibly do?: Could we say “Fuck you, we are not going to play” ?: In this way the fans get fucked.: Absolutely.: Please don't take offense to anything we say…: He is a nice guy. But know that his answers will be totally different for mine because we are exactly the opposite in every way…(laughs): Yeah someone stole it right off the stage. That was the first time someone has seen me angry. It was a very expensive pedal…: The guys grabbed the pedal and run out of the club.: In general I think the audiences in Europe are better because they listen to the music in more detail. Between New York and L.A. there are some great audiences but I just prefer…. mmm this is political incorrect. What I find is that the Europeans listen to the music more intensely than the Americans…: (with a funny voice) So, are you saying that the Americans are musically dummer? (all laughing).: I did not say that. I think Europeans take it more seriously like listening to the band and knowing everything about the band. You know it's a little more detailed.: Hopefully we will. We are tying to plan that now but we have difficulties booking gigs sinceis inteaches in Berkeley andis also in, so it is tough you see.: Well, I can say something here. Even that I feel nervous thatis sitting beside me and we have not done an interview together for years I have to say that withI got to his house and he told me that he had a vision about how the album should be from front to back. “So, just sit there and when I need a guitar riff I am going to ask for”. So, I was the guitar-riff writer guy. But he did all the rest. That album was his baby and his vision.: No….: Yes,, this was exactly the way and I won't do that ever again (laughs). You know he is the classical genius, a 76-piece orchestra guy who writes for ballets (actually he has wrote one lately) and this was his chance to kind of insert all that into a Rock album and do his thing. But, withwhen I got to his house he asked me “What do you want to do?”, I said that I wanted to go back to the old sound.: We took a six pack of beers, a bag of weed and sat down for 10 days and wrote these 10 songs.: Hey man, you can interview the whole band. Do you know how rare this is? I don't even know if this has ever happened.: He is very easy.: Do I have a bad reputation?: He is awesome, he listens what you have to say and he is a genius. He will take your idea and make the most of it.: Yeah man, we wrote one song per day.asked us to write a song per day or at least a piece of a song per day. I said OK, I am going to do it. I wrote one song in two months. But withyou get up in the morning and star working and by noon you are in the studio working all-day-long until you're done.: That's why in Nashville where I live everybody fucking writes.: For me this is impossible unlessis whipping me to work. But I can still get wasted while he is whipping me (laughs).: It is really about. Back in the 80s when we were listening to all those bands we were thinking that we could better than them. So, now we thought that this album could be successful and it would be like karma after all the bad things that happened to us.: We had a band with my brother and those guys so we did an album for the old-good-times sake.: I really don't know. We finished this album mixing old ideas with some new ones in a 70s, very poppy and simple way. It was really cool.: This question could be “can walk and chew gum at the same time” ? After all, we have been doing this for so long so, yes, we manage with that…: No matter in how many bands we are in, we have certain standards for this band and definite vibe that is pretty obvious when you see us live. This is 16 years of chemistry…: Well, it was not like a premier since it was performed with thethat was really cool. But the actual premier is the ballet with the choreography and all this stuff. It is a dream that came true for me. I wrote it a while ago but I was thinking of doing something like this like 20 years. It is very very exciting.: I have been trying to do this for a long time. I actually felt like home. You know something, I am not a jammer. All these guys can jam really well but I am not like it. When I do music it has to be precisely where to do what. So, I do Rock music like orchestra music. It is all got to be in its place. I can jam with the band in the Blues but that's it…: We totally disagree with him because he can jam great.: I thought of this two days ago. Maybe we can call it-suite (laughs). We could dooror. Maybe we will do it. I do not know when, but I have thoughts about it.: Well, this is not an easy question to answer; it is a mixture of feelings. There is the musical satisfaction in terms of you can listen to your CD and be proud of the band. It was a really interesting career all these years playing in all venue sizes but this band also had its ups and downs. When music changed all of a sudden and Metal took a dive withandtaking over the scene. Then there was a frustrating time period when everyone thought that this sound was very cool. So, to be is a combination of what we have accomplished in terms all the different albums we made but still we could do a lot better…Personally, I don't really care how many peopled are watching us live as long as they sing every single lyrics like last night. That is the most satisfied. When you make an album and send to the world you never know what the reaction will be. But when you see such a reaction as a performer it is the ultimate reward.: Really? Who, for example?: You say that the new bands care of the albums they are selling?: In that case, good luck.: Yeah, good luck because it is not the right time to worry about the numbers. If you are not doing it because you love it, then what's the point?: You can hear the music, I think. This is why there is so much shitty music out there. On the other hand the Internet has brought in front many great bands and artists that you'd never have heard of them. So, it is really a double-edged sword.: Why? We don't feel that we have achieved something special. We were always trying hard so we never noticed what we have done.: If you think hard we are an 80s band that came out on the late 80s. Actually it was 1989 when the Hard Rock scene was in its way down. But now we are all doing the same thing; playing in the same places like we do.andwere bigger than everybody else and they are still big.came out in 1980. I remember buyingand being jealous of the guitarist who had my age!: Just tonight! (laughs): Are you kidding? We were more attacked than every other band. What do you think? This is our question to you. Do you think that we were threatened?: Thank you! This was a rhetoric question after all. It definitely affected us back in those days, but what can you really do about it? Are you talking about thething?So, you are asking if we listen to the critics and read their reviews?We do read the reviews but we also know that this is what one person wrote and not a team of people. On the other hand we are humans; so, when a bad review comes in -especially in the first days- it hurts! I mean, you spent a lot of time working into the music and then one comes to say that it sucks."}, {"url": "http://rodmorgenstein.com/", "page_content": "After years of noodling with the idea of creating specialty tools for drummers, to help with the handful of pesky issues all drummers face at one time or another, the first tool - Wing Thing - has finally come to fruition. Please check it out at morgensteintool.com\n\nThanks.\n\n\n\n\n\nSee you on the road!\n\nRod\n\nHey Everybody,Rod here. After 45 years of amassing an enormous collection of drum sets, snare drums, cymbals, percussion, Winger clothing (from the good ole days), tour laminates, itineraries, posters and awards, drumheads, drumsticks, assorted hardware, and other mementos, I have decided to part with a tremendous amount of these items. Three of the major items I am parting with are drum sets from–\n\nThe Dixie Dregs, ‘Bring ‘Em Back Alive’, live recording (from The Center Stage in Atlanta, GA in early ’92) and tour, including an appearance on The Tonight Show with Jay Leno in December 1992 The 2002 ‘Hollyweird Summer Tour’ featuring Poison, Cinderella, Winger and Faster Pussycat, plus a Winger tour that followed in the fall of ‘02 The drum set used on several Dixie Dregs tours from the late ‘90’s through 2007\n\n\n\n\n\nRod It has been an amazing trip down memory lane sorting through hundreds of possessions, each one triggering a smile, a story, or an unforgettable memory I will cherish forever. If you are interested in checking out some of these items, you can contact my friend and fellow drummer, Ed Tucker, at Studio 3T studio3t@icloud.com Or join Ed’s Facebook group: Vintage Drum Collectors & Players. Type in “Rod Mo” in the question to join the group.It’s gonna take awhile before each and every item is listed, so make sure to check in over the coming weeks to see what new things have been added.Thanks for all the great years. It has been, and continues to be, an incredible ride.Rock On!Rod\n\nHere's a video clip of RA from one of the recent Rudess Morgenstein Project concerts courtesy of videographer Matthew Smith\n\n\n\n"}, {"url": "https://www.last.fm/music/Winger/+wiki", "page_content": "Winger is an American rock band that has combined elements of glam metal and progressive metal. Formed in New York City, Winger gained popularity during the late 1980s and early 1990s. The band's two platinum albums, Winger and In the Heart of the Young, along with charting singles \"Seventeen,\" \"Headed for a Heartbreak\" and \"Miles Away,\" put them on the top of the charts by the early 1990s. In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band.\" As the music scene changed in the early to mid-1990s due to the popularity of grunge, their success faded after their third release Pull.\n\nWinger disbanded in 1994. In 2001 they reunited and have since conducted several successful tours. In 2006, the band's 1993 touring line-up (minus Paul Taylor but including John Roth) reunited to record the band's first studio album in over 13 years, IV, and toured in support of the album into 2008.\n\nIn 2009, the band released their fifth album, Karma. As of 2013, Winger was performing on mini-tours, festivals and private events. Their most recent album, Better Days Comin', came out in 2014.\n\nHistory:\n\nMain career and break-up (1987–1994).\n\nThe debut album, Winger, was released on August 10, 1988 on Atlantic Records. The record was a success, achieving platinum status in the United States, and gold status in Japan and Canada. On February 11, 1989, the album peaked at number 21 on the Billboard 200, and was in various places on the chart for 63 weeks. Radio and MTV hits from the album included \"Madalaine\", \"Seventeen\", \"Headed for a Heartbreak\" and \"Hungry\". In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band\".\n\nShortly after that tour, Winger released its second album In the Heart of the Young, which went 1-and-1/2 platinum in the U.S. and gold in Japan. Hit radio tracks and MTV videos included \"Can't Get Enuff\", \"Miles Away\" and \"Easy Come Easy Go\".\n\nWinger followed the release of its second album with a 13-month world tour, playing over 230 dates with Kiss, Scorpions, ZZ Top, Extreme and Slaughter. Paul Taylor left the band after the tour, citing exhaustion after years of touring. Their third studio album, Pull, produced by Mike Shipley, was recorded in 1992/1993 as a three-piece band. It was originally to be called Blind Revolution Mad, after the opening song. Reportedly, Kip Winger, anticipating that critics would dismiss the album out of hand, renamed it Pull as a tongue-in-cheek reference to the CD being used by critics as a skeet-shooting target. The album was not as successful as the previous albums sales wise, but gained solid reviews. On the following tour, John Roth was called in to replace Paul Taylor on rhythm guitar. The album coincided with the rise of grunge, which swept aside the brand of melodic pop metal that Winger represented.\n\nIn the 1990s, Winger was subject to mockery from MTV's animated series Beavis and Butt-head. Series creator Mike Judge later revealed that he had been incorrectly informed that Kip Winger had asked the network not to make jokes about the band on the series, which led to further jokes about the band, but later learned from Winger himself that he had never made any such stipulation. “Stewart”, an early character from the TV show, wore a Winger t-shirt during the shows original run on MTV during the early 90s.\n\nAfter disbanding in 1994, bassist/lead vocalist Kip Winger went on to a solo career, guitarist Reb Beach went on to touring projects with artists Dokken, Alice Cooper and has held a permanent guitar spot in Whitesnake since 2002. The band's other members pursued or resumed careers as session musicians.\n\nReunions (2001–present)\n\nIn 2001, it was announced that all original members of the band would return to the studio to record the song \"On the Inside\" for The Very Best of Winger. In 2002, all five members embarked on a reunion tour of the U.S. and Canada on a bill with Poison. According to Kip Winger, in a 2008 interview with rock and roll comic C.C. Banana, it was important to include all five members because \"it was the big, long-awaited reunion so I wanted to include everybody who had ever been in the band.\" In 2003, it was confirmed that activity had been halted due to Reb Beach's touring commitment with Whitesnake as well as his solo album \"Masquerade\" and involvement with \"super-group\" project The Mob with King's X frontman Doug Pinnick and Night Ranger drummer Kelly Keagy.\n\nOn July 16, 2005, it was announced that Kip Winger would perform as the lead singer for the Alan Parsons Live Project at the Common Ground Music Festival in Lansing, Michigan. In May 2006, it was confirmed that Winger had reformed without one of its original members Paul Taylor, to record another album and tour Europe. The album, IV, was released in Europe in October and the nine-country \"Winger IV Tour\" ran in the last two weeks of the same month.\n\nOn February 25, 2008, the band performed in Providence, Rhode Island, as part of a benefit for survivors of the Station nightclub fire. The concert, along with other artists was debuted on VH1 Classic on March 23, 2008. In late 2009, it was confirmed that Winger would record a fifth album Karma, with a tour to support it. Most recently, John Roth became the guitarist for Giant and would appear on their forthcoming album Promise Land then set for release in February/March of 2010.\n\nWinger released their sixth studio album titled, Better Days Comin' in April 2014, after teasers were published on Kip Winger's website and on the official Winger Facebook page as well.\n\nAs of late 2018, Winger was playing club dates. They were scheduled on Dec 29, 2018 in Westland, Michigan.\n\nStyle and influences.\n\nThe band's musical style combines elements of glam metal and progressive metal. Kip Winger, in description of the band's musical ability and style, said, \"Our band was known to musicians, and a lot of musicians showed up to see me play — watching, trying to figure out how I'm playing. We were like the 'hair band' (version of) Dream Theater.\""}, {"url": "https://musicxplorer.com/artists/rod-morgenstein-drummer/", "page_content": "Rod Morgenstein- Drummer\n\nDixie Dregs and Grammy Nominee\n\nRod is a New York native, founding member, and drummer of the Dixie Dregs, a six-time Grammy nominee. Rod is a professor, teaching percussion at Berklee College of Music, in Boston, Massachusetts. Recently offering, Drum Set Warm-Ups , touted as the definitive text for developing and improving all aspects of drum-set playing. He is also a columnist for Modern Drummer magazine.\n\nThe beginning of the Dregs started in 1973, when he attended the University of Miami in Florida. There he met Steve Morse, Andy West, and Allen Sloan, playing under the official Studio Music and curriculum title of, Rock Ensemble II. At the university, The Dregs recorded their first album in 1975, The Great Spectacular, as a class project.\n\nThe Dregs had a rough time getting signed and were turned down and told their music was difficult to market because they were a jazz fusion band had no vocals, odd timing, and that their music combines rock, jazz, bluegrass, folk, and classical influences. The group was finally signed to Capricorn in 1977, and recorded several albums before they temporarily disbanded in 1983. Rod then joined Steve Morse’s new band and stayed for two albums before wanting a musical change to try something both new and challenging. The Dregs last reunion was a tour in 2018.\n\nWinger and Other Projects\n\nRod moved back to New York City and began auditioning for jobs, one of them turned out to be a band that Kip Winger was forming. Two months later, Rod received a call from the band, and they were off to record their self-titled, debut album, Winger, in 1988. It went double platinum. Winger followed up in 1990 with In the Heart of the Young. In 1993, they released the album, Pull, as grunge came in and changed the music scene. The band decided to take a break, but got back together in 2002, and have had sporadic reunions since, and continue to do so as time permits. Winger will be releasing a new album in 2021.\n\nRod’s other projects include the Rudess/Morgenstein Project, an instrumental progressive power-duo, featuring Rod and Dream Theater keyboardist extraordinaire, Jordan Rudess, with two albums to their credit. Rod is is involved with jam band, Jazz Is Dead, which features creative improvisations of the music by the Grateful Dead. Another project is, Platypus, whose two recordings feature: John Myung (Dream Theater), Ty Tabor (King’s X), and Derek Sherinian (Planet X). The music is a mix of instrumental and vocal tunes that blend many different styles together. An offshoot of Platypus is The Jelly Jam, a power trio featuring Rod, Ty Tabor, and John Myung. Their debut release came out in 2001, and The Jelly Jam, ‘2’ was released in 2004.\n\nInterview with Rod Morgenstein (Part 1)"}, {"url": "https://www.liverate.com/artists/winger", "page_content": "\"How good are they LIVE?\" in the last 12 months based on a score on 100 (as of 5/11/23)\n\n\"How good are they LIVE?\" based on a score on 100 (as of 5/11/23)\n\nBased on 9 concert reviews, the critic consensus is that Winger is rated as an average live performer.\n\nWinger is an American hard rock band formed in New York City, in 1987, that gained popularity during the late 1980s and early 1990s.\n\nCRITIC REVIEWS\n\n1013 Music Reviews (USA) % Winger / George Lynch – Medina Ballroom – Medina MN – March 5th 2022 Full Review\n\nJam Magazine (USA) % Kip Winger and the boys had us all singing as they called to mind all the hits and some heavy rockers, too. Full Review\n\n1013 Music Reviews (USA) % Winger and Firehouse are welcomed to the Medina Entertainment Center on February 10th, 2017 to a slew of excited 1980’s metal fans. Full Review\n\nNortheast Rock Review (USA) % WINGER March 18, 2016 Mohegan Sun Wolf Den Uncasville, CT Once again I am transported back into the 80s, sitting in the New Haven Coliseum watching my favorite shock rocker, Alice Cooper, watching and listening to one of the best backing bands in Rock n Roll back in 1987. Kane Roberts on Guitar, Paul Ta Full Review\n\nMaine Music News (USA) % With songs like: “Seventeen,” “Headed for a Heartbreak,” “Madalaine,” and “Hungry,” the album quickly charted and met platinum status in the States and gold status in booth Canada and Japan. Full Review\n\nRecord Collector Magazine (UK) % Kip does less posing than of yore, and more talking, but the focus was new album, Better Days Comin’, which impressed, even if the material is not as commercial as before. Full Review\n\nJam Magazine (USA) % In support of their current release Better Days Comin, and 26 years after the band's debut release, guitarists Reb Beach, John Roth and drummer Rod Morgenstein joined Kip onstage to take Dallas on a trip down Memory Lane. Full Review\n\nPast critic reviews published in"}], "Rod Morgenstein is best known for his work with the progressive rock band Winger": [{"url": "https://online.berklee.edu/faculty/rod-morgenstein", "page_content": "Berklee Online is the online school of Berklee College of Music, delivering access to Berklee’s acclaimed curriculum from anywhere in the world. We are the world’s largest online music school—30,000+ musicians from more than 140 countries have taken our courses—but classes cap at just 20 students per section.\n\nOur programs provide lifelong learning opportunities to people interested in music and working in the music industry. The courses range from beginner to advanced graduate level.\n\nBerklee Online offers more than 200 courses in every musical interest area: Everything from instruction on specific instruments (guitar, piano, bass, drums, voice) to music production software (Ableton, Pro Tools, Logic, and more) to larger concepts in music business, songwriting, theory, and composing for film, TV, and games\n\nAbsolutely! Just like the students studying on Berklee’s Boston campus, Berklee Online students receive instruction from the same world-renowned faculty, with the added benefit of having music industry professionals from around the world teaching as well. You’ll also receive guidance from Berklee-trained Academic Advisors, and have the opportunity to walk at the Commencement ceremony in Boston with your cohort of graduates who studied online and in-person.\n\nCertificate programs and online courses are offered on an open enrollment basis. Simply complete the online enrollment form and provide payment prior to the course start date and you’re ready to go! Degree programs require an application and supporting documentation. See the Admission Requirements for more details.\n\nWhat is the process to apply for/enroll in a Berklee Online program or course?\n\nBerklee Online degree students are eligible to request a Berklee ID. Upon acceptance into the program, degree students are also given a berklee.edu email address.\n\nStudents must enroll in a certificate by paying the $175 certificate registration fee prior to completing the final course in the program. All for-credit courses that have been awarded a passing grade and that align with a certificate program may transfer into that program.\n\nCan I upgrade from a lower-level certificate to a higher-level certificate?\n\nCHANGE CERTIFICATE: When a student wants to change their lower-level certificate to a higher-level certificate (or vice versa) prior to the completion of the program. There are no additional fees for this option other than the cost of additional courses, and you will only earn one certificate upon completion. STARTING A NEW CERTIFICATE: When a student wants to earn more than one certificate by having the courses from their lower-level certificate waived into a higher-level certificate. In this case, an additional $175 registration fee is required. Yes! Berklee Online offers two certificate options:\n\nFaculty\n\nWho teaches Berklee Online courses? Berklee faculty and seasoned professionals teach our courses. Our instructors are recognized experts in their respective fields—they’ve produced and engineered hundreds of artists and numerous award-winning projects, and several of their students have gone on to earn GRAMMY Award nominations.\n\nFinancial Aid\n\nAm I eligible for financial aid? Financial assistance is available for Berklee Online degree programs. This assistance may come from a variety of sources including federal awards, outside scholarships, and private loans.\n\n\n\nFederal financial aid is not available for non-degree programs. Non-degree students typically finance their costs out-of-pocket or with a private loan. Review our payment options.\n\nGraduation\n\nWhat happens if I turn in my graduation application late? Do I still need to apply by December 1 even if I don’t want to walk in the Commencement ceremony? Because we must coordinate with the Boston campus for Commencement, it is essential that students planning to walk in the ceremony submit their graduation application by 12:00 midnight ET on December 1. If you submit your application late, you will need to wait until the following year to walk.\n\n\n\nWe ask all students planning to graduate within the current academic year to apply for graduation by December 1, regardless of their plans to participate in Commencement. Late application for students who do not wish to walk will result in processing delays for your academic record and diploma, and your name may not be listed in the ceremony program.\n\nWhat’s the difference between graduating and walking in Commencement?\n\n\n\nYou can walk in Commencement when you are nine (9) credits or less away from completing your degree requirements by the end of the spring term. Please note: Berklee Online degree students are not required to walk in Commencement in Boston.\n\n\n\nYou graduate when you have met all of the following criteria: Attained at least a 2.70 cumulative GPA in concentrate courses\n\nHave a minimum cumulative GPA of 2.00\n\nFulfilled all program requirements AND completed a minimum of 120 credits for a single major or 165 for a dual major\n\nCompleted a minimum of 60 institutional credits for a single major or 105 institutional credits for a dual major\n\nFulfilled all financial obligations to the college Note Walking across the stage in Commencement does not mean that you have graduated. You will not officially graduate and receive your diploma until you meet all of the eligibility requirements. Great question! Walking in Commencement and graduating are two separate things.You can walk in Commencement when you are nine (9) credits or less away from completing your degree requirements by the end of the spring term. Please note: Berklee Online degree students are not required to walk in Commencement in Boston.You graduate when you have met all of the following criteria:Walking across the stage in Commencementmean that you have graduated. You will not officially graduate and receive your diploma until you meet all of the eligibility requirements.\n\nI just finished my last term at Berklee Online! What happens next? Is there anything I need to do? Congratulations on finishing! If you have already filled out a graduation application, you will want to double-check the \" Graduation Checklist \" to ensure you have taken care of all of the various items associated with graduating. If you have not filled out a graduation application, you will need to do that as soon as possible. You will not be able to graduate until we have received and processed your graduation application.\n\nWhen will I get my diploma?\n\n\n\nDiplomas are mailed to the address you include on your graduation application. If your mailing address changes after you have submitted your graduation application, be sure to update us at\n\n\n\nKeep in mind that if you are walking in Commencement, you will not receive your official diploma at the ceremony. You will receive your diploma within 6-8 weeks of completing your degree requirements. Please keep in mind that instructors have up to two (2) weeks to submit final grades after the term concludes.Diplomas are mailed to the address you include on your graduation application. If your mailing address changes after you have submitted your graduation application, be sure to update us at graduation@online.berklee.edu Keep in mind that if you are walking in Commencement, you will not receive your official diploma at the ceremony.\n\nTransfer Credits\n\nCan I find out how many transfer credits I am eligible for before I apply to the degree program? If you are interested in applying to the Bachelor of Arts degree program and would like an estimate of the amount of transfer credit you would receive, you can request an unofficial transfer evaluation by emailing a copy of your transcript(s) to the Berklee Online Transfer Team at transfer@online.berklee.edu . Be sure to include your name, major of interest, and any additional questions you may have. You can expect to receive your assessment within 7-10 business days.\n\nI didn’t receive credit on my Official Evaluation for all of the courses that I thought I would. What should I do? The earlier you contact us with questions or concerns regarding your evaluation, the easier it will be for us to address any issues. Therefore, it is very important when you first receive your official transfer evaluation that you review the information carefully.\n\n\n\nIf you notice a remaining requirement that you believe you’ve already fulfilled, first consult our document on Common Reasons Credit Does Not Transfer. It’s possible that the course you are thinking of didn’t meet our eligibility requirements.\n\n\n\nIf none of those exclusions apply, please fill out a Transfer Credit Equivalency Re-evaluation form for the courses you wish to have reconsidered.\n\n\n\nSometimes, we are not able to locate specific information for a course online and we are not able to determine an equivalency, but we are always happy to review additional material which will help us make that determination.\n\nDo my Berklee Online, Berklee campus, or Prior Learning Credit coursework count towards the 60 transfer credit limit? No, credits completed at Berklee or through the prior learning process do not count towards the 60 transfer credit limit. This maximum is for credit-bearing exams and undergraduate-level coursework completed externally.\n\nWhat is a credit deficiency and why do I need to make up credit? Credit deficiencies are caused by transferring a course that is less than three (3) credits to fulfill a three (3) credit Berklee Online requirement. Students with a credit deficiency will be short of the minimum number of credits required to graduate once they have completed their program requirements. In order to be eligible to graduate, you will need to make up the credits you are deficient in.\n\n\n\nWhile the Transfer Team does their best to avoid giving students credit deficiencies, it is not always possible. You can make up the credits you are deficient in by completing additional Berklee Online coursework, by applying for prior learning credit, or by completing additional external coursework in the area in which you are deficient.\n\n\n\nNote all external courses will first need to be approved by the Transfer Team.\n\nCan transfer credit fulfill prerequisites? It depends. Generally, transfer credit cannot be used to fulfill prerequisites unless we determine that the course you completed is a direct equivalent to one of the courses we offer at Berklee Online. Keep in mind that there are some courses which require you to pass a placement exam. For these you will need to achieve a passing grade on the test to fulfill the prerequisite, otherwise you will need to complete the appropriate Berklee Online course.\n\nCan I transfer credits to Berklee Online after I have started the degree program? Yes, you can. To determine if the coursework you already completed or are considering taking is eligible to fulfill your remaining degree requirements, contact the Transfer Team at transfer@online.berklee.edu\n\nI am a Berklee campus student. Can I transfer courses from Berklee Online to my campus-based program?\n\n\n\nFor additional questions about transferring courses from Berklee Online to Berklee's campus programs please contact the campus transcript evaluator at View a list of transferable courses to Berklee’s campus programs.For additional questions about transferring courses from Berklee Online to Berklee's campus programs please contact the campus transcript evaluator at transfercredits@berklee.edu\n\nAre Berklee Online courses transferable to other institutions? Berklee Online is regionally accredited by the New England Commission of Higher Education (NECHE), the same association that accredits our main campus and other leading academic institutions such as Harvard University and MIT. Our courses are transferable to other institutions, but it's up to the receiving institution to decide the number and types of courses that may transfer. We recommend getting a course pre-approved by an institution before enrolling.\n\nTuition\n\nHow do Berklee Online’s costs compare to other education options? Berklee Online’s programs have a tuition cost that is approximately 64 percent less than on-campus tuition at Berklee’s Boston campus. Moreover, a recent study revealed that the average annual tuition at for-profit colleges is more than twice as expensive as Berklee Online. Even average annual tuition at other accredited non-profit online universities is roughly $11,000 more expensive than tuition for a year with Berklee Online!\n\nHow much does a certificate program cost? There is a one time $175 registration fee per certificate program. Students may either pay per course term (at the $1,515 per credit course cost) or pay in full to receive a 10 percent discount. The registration fee and all courses for the term you wish to begin in must be paid in full in order to begin.\n\nHow much does an online Bachelor’s degree cost? Online undergraduate degree tuition is $59,160 for 120 credits for all majors except the guitar major. Tuition for the guitar major is $63,660. Students taking 10 courses per year can complete the degree in four years at a cost of $14,790 per year. (Note: Tuition and fees are subject to change.)\n\nHow much does an online master's degree cost? Online graduate degree tuition is $33,120 for 36 credits. The Master of Music in Music Production and Master of Arts in Music Business programs are designed to be completed in one year of study. Both programs are comprised of 12 three-credit courses that can be taken during four 12-week semesters."}, {"url": "https://wiki2.org/en/Rod_Morgenstein", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican drummer (born 1953)\n\nMusical artist\n\nRod Morgenstein (born April 19, 1953) is an American drummer, best known for his work with the rock bands Winger and Dixie Dregs.[1]\n\nHe also played with Fiona, Platypus, the Steve Morse Band, and Jelly Jam. He has also done session work with Jordan Rudess including his ventures with the Rudess/Morgenstein Project.[2] He also toured with Jazz Is Dead.[3][4] He has also been awarded Modern Drummer's \"Best Progressive Rock Drummer\" five years (1986-'90), \"Best All-Around Drummer\" (1999) and was inducted into magazine's Honor Roll.[5]\n\nHe worked for twenty years as a professor, teaching percussion at Berklee College of Music in Boston, Massachusetts. Morgenstein continues to tour with the band Winger. He has also been a columnist for Modern Drummer magazine.\n\nMorgenstein is known for his versatility of playing many styles of music.[6]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 29 998 13 798 32 084 3 772 49 185\n\nRod Morgenstein - Jordan Rudess: OVER THE EDGE - 1998\n\nRod Morgenstein - Jordan Rudess: CRUNCH (historic appearance...)\n\nEducation Spotlight: Rod Morgenstein on Rock Drums\n\nRod Morgenstein - Putting It All Together\n\nRod Morgenstein-Dregs Drum Solo Transcription\n\nEquipment\n\nMorgenstein currently uses Premier drums, Evans Drumheads, Sabian cymbals, Vic Firth drumsticks, and LP Percussion. He has, in the past, also used Remo drumheads and Paiste cymbals.\n\nDrums: Premier signia series (also uses the genista series):\n\n22\" x 18\" bass drums (x2)\n\n10\" x 9\" rack tom\n\n12\" x 10\" rack tom\n\n13\" x 11\" rack tom\n\n16\" x 16\" floor tom\n\n18\" x 16\" floor tom\n\n14\" x 6.5\" snare\n\n14\" x 4\" piccolo snare\n\nDrumheads: Evans:\n\nSnare: G1 Coated or Power Center Reverse Dot/300 Snare Side\n\nToms: EC2S Clear or G1 Clear (top and resonant)\n\nBass: EQ4 Clear/EQ3 Black Bass Reso\n\nDrumsticks: Vic Firth:\n\nVic Firth Rod Morgenstein signature drumsticks (Length 16.12\", Diameter: .610\")\n\n- described as essentially combining a 5B and 2B stick\n\nCymbals: Sabian:\n\nAA regular hi-hats 13\"\n\nHH china kang 10\"/AA splash 10\" (stacked)\n\nAA splash 12\"\n\nAA splash 10\"\n\nAA splash 8\"\n\nAAX stage crash 18\"/cymbal disc 12\" (stacked)\n\nAAX stage crash 16\" (or studio crash)\n\nAA splash 10\"\n\nSignature tri-top ride 21\"\n\nHH china 20\"\n\nHH thin crash 18\"\n\nPaiste cymbals (circa 1984):\n\nRUDE 14\" hi-hats\n\nFormula 602 11\" splash\n\nRUDE 16\" crash/ride\n\nRUDE 18\" crash/ride\n\n2002 18\" medium\n\nRUDE 20\" ride/crash\n\nFormula 602 22\" heavy\n\n2002 20\" china type\n\nSound Creation 22\" dark china\n\nCymbals circa 1988:\n\n3000 14\" sound edge hi-hats\n\nFormula 602 11\" splash\n\n3000 17\" thin crash\n\n3000 18\" thin crash\n\n3000 19\" thin crash\n\nRUDE 22\" ride/crash\n\nSound Creation 20\" dark china\n\nDiscography\n\nwith Dixie Dregs\n\nwith The Steve Morse Band\n\nwith Winger\n\nwith Fiona\n\nwith Rudess/Morgenstein Project\n\nwith Platypus\n\nwith The Jelly Jam\n\nThe Jelly Jam (2002)\n\n(2002) The Jelly Jam 2 (2004)\n\n(2004) Shall We Descend (2011)\n\n(2011) Profit (2016)\n\nReferences"}, {"url": "https://wikispro.com/rod-morgenstein-wiki-networth-age/", "page_content": "Rod Morgenstein is an American drummer and music educator. He is best known for his work with the rock band Winger and with the jazz fusion band Dixie Dregs.\n\nScroll Down and find everything about the Rod Morgenstein you need to know, latest relationships update, Family and how qualified he is. Rod Morgenstein’s Estimated Net Worth, Age, Biography, Career, Social media accounts i.e. Instagram, Facebook, Twitter, Family, Wiki. Also, learn details Info regarding the Current Net worth of Rod Morgenstein as well as Rod Morgenstein ‘s earnings, Worth, Salary, Property, and Income.\n\nRod Morgenstein, better known by the Family name Rod Morgenstein, is a popular Drummer. he was born on April 19, 1953, in New York City. is a beautiful and populous city located in New York City United States of America. Rod Morgenstein started his career as Drummer in 1973 when Rod Morgenstein was just 20 Years old. Soon, he became more successful in his profession within a limited period of time, where he influenced people on the bases of his career and earned a lot of fame. After a while, his career completed a full circle as he gained more importance. Rod Morgenstein went famous for his performance in his own country United States of America. as well as in other countries.\n\nIs he active in his profession of Drummer Or he Leave his profession?\n\nYes! he is still active in his profession and he has been working as Drummer from last 48 Years As he started his career in 1973\n\nFacts You Need to Know About: Rod Morgenstein Bio Who is Rod Morgenstein\n\nOn Wikispro, Rod is ranked in the list of most popular Drummer,s. Also, ranked in the list with that person who was born in 1953. Have to Position Among the list of Most Popular Drummer.\n\nRod Morgenstein Net Worth\n\nAccording to Wikipedia, Google, Forbes, IMDb, and various reliable online sources, Rod Morgenstein’s estimated net worth is as follows. Below you can check his net worth, salary and much more from previous years.\n\nRod‘s estimated net worth, monthly and yearly salary, primary source of income, cars, lifestyle, and much more information have been updated below. Let’s see, how rich is Rod Morgenstein in 2021?\n\nHere you will know how rich is Rod Morgenstein in 2021?\n\nRod who brought in $3 million and $5 million Networth Rod collected most of his earnings from his Yeezy sneakers While he had exaggerated over the years about the size of his business, the money he pulled in from his profession real–enough to rank as one of the biggest celebrity cashouts of all time. Krysten Rod Morgenstein’s Basic income source is mostly from being a successful Drummer.\n\nRod has a whopping net worth of $5 to $10 million. In addition to his massive social media following actor\n\nRod MorgensteinNet Worth Estimated Net Worth in 2021 $1 Million to $5 Million Approx Previous Year’s Net Worth (2020) Being Updated Annual Salary Being Updated Income Source Drummer\n\nNoted, Rod Morgenstein’s primary income source is Drummer, We are collecting information about Rod Morgenstein Cars, Monthly/Yearly Salary, Net worth from Wikipedia, Google, Forbes, and IMDb, will update you soon.\n\nRod Morgenstein: Age, Height & Weight\n\nRod Morgenstein’s age 67 years (as in 2021), height & weight. Dress & Shoe size Updated below scroll down and check all about height & weight. Dress & Shoe size of Rod Morgenstein.\n\nRod Social Media Activities.\n\nhe is a famous person on social media i.e. Instagram, Facebook, Twiter, Youtube, etc. Please scroll down to see information about Rod Morgenstein Social media accounts.\n\nRod Morgenstein’s official twitter account\n\nYou Can read Latest today tweets and post from Rod Morgenstein’s official twitter account below.\n\nRod Morgenstein , who had been reigning on Twitter for years. Drummer Rod Morgenstein has Lot of Twitter followers, with whom he shares the details of his life.\n\nThe popularity of his Profession on Twitter and also he has increased a lot followers on twitter in recent months. Maybe we shouldn’t be surprised about his’s social media savviness after his appearance in the film The Social Network. You can read today’s latest tweets and post from Rod Morgenstein’s official Twitter account below.\n\nRod Morgenstein’s Twitter timeline is shown below, a stream of tweets from the accounts that have today last tweet from Twitter that you want to know what he said on his last tweeted. Rod Morgenstein’s top and most recent tweets read from his Twitter account here\n\nTweets by paulanka\n\nhttps://twitter.com/rodmorgenstein\n\nRod Morgenstein’s Personal Facebook account\n\nRod Morgenstein Facebook Account is largely populated with selfies and screen grabs of his magazine covers. Rod Morgenstein has Lot of fans and appears to actively build his presence on Facebook. Rod Morgenstein has built his personality quite the fan base—with the social media following to prove it. Rod Morgenstein may take some flack for his oddball fashion sense, but his Facebook fans seem drawn to his no matter what he wears. Whether he’s singing, acting or cashing in on endorsements, Rod Morgenstein’s Facebook account is sure to keep fans clued in.\n\nOn his facebook account, he posts about his hobby, career and Daily routines, informing readers about his upcoming tour dates and progress in the studio, and also offers fans the occasional. On his Facebook page, the Rod Morgenstein is short on words, preferring to post sultry magazine covers and video clips.\n\nIf you’re also interesting into his occasional videos and posts on facebook Visit his account below\n\nhttps://www.facebook.com/Rodmorgensteinofficial\n\nRod Morgenstein’s Deezer account\n\nDeezer’s exclusive playlists feature songs by Rod Morgenstein that have been handpicked by his followers and fans. Rod Morgenstein is one of the famous artists around the world on Deezer. like as Rod Morgenstein, in collaboration with the organizers of International Women’s Day\n\nEntertainmentRod Morgenstein was the most streamed artist on Deezer in the last year, figures have shown. The Hello singer beat the likes of Little Mix and Rita Ora to top the personal music streaming platform’s list. The data, which was compiled to raise awareness Deezer has published some of its top lists of 2020. There’s also an interesting list of artists including ranked by how many ‘superfans’ – heavy streamers in this context – they have. Rod Morgenstein beat out BTS to top that chart, although the Beatles and Queen were also in the top 10. Like Spotify, Deezer is offering listeners their own personalised lists too, via its My Deezer Year promo.\n\nhttps://www.deezer.com/us/artist/us/artist/4563999\n\nRod Morgenstein’s Rod Morgenstein spotify artist profile\n\nRod Morgenstein Soundstreams and Stories are nowhere to be found on Spotify. Rod Morgenstein is available to his fan on spotify more about putting value on art and music. Rod believes that spotify plateform is valuable as well as rare, and what is valuable or rare should \\”be paid for.\\”. The \\”Cardigan” artist also saw that streaming is growing and his fans wanted his catalog to be on Spotify. \\”It is my opinion that music should not be free…I hope they (artists) don’t underestimate themselves or undervalue their art,\\” Rod Morgenstein shared.\n\nHere is a link to Rod Morgenstein spotify profile, is available to visit\n\nhref=”https://open.spotify.com/artist/2hHqzkX4zloXdcbyagZctb\n\nRod Morgenstein’s Visit Rod Morgenstein Website\n\nRod Morgenstein Being one of the most popular celebrities on Social Media, Rod Morgenstein’s has own website also has one of the most advanced WordPress designs on Rod website. When you land on Rod Morgenstein website you can see all the available options and categories in the navigation menu at the top of the page. However, only if you scroll down you can actually experience the kind of masterpiece that Rod Morgenstein’s website actually is.\n\nThe website of Rod Morgenstein has a solid responsive theme and it adapts nicely to any screens size. Do you already wonder what it is based on?\n\nRod Morgenstein has a massive collection of content on this site and it’s mind-blowing. Each of the boxes that you see on his page above is actually a different content Provides you various information. Make sure you experience this masterpiece website in action Visit it on below link\n\nHere is a link to Rod Morgenstein Website, is available to visit\n\nVisit Rod Morgenstein Website\n\nRod Morgenstein Biography First Name Rod Name Rod Morgenstein Complete Family Name Rod Morgenstein Date of Birth April 19, 1953 Birth Day April 19 Birth Years 1953 Birth Place New York City Birth City Birth Country United States of America Nationality/Country United States of America Race Being Updated Ethnicity Being Updated Sun sign, Horoscope, Zodiac Sign Aries Famous As Drummer Also Known for Drummer Occupation Drummer Years active 1973–present Started Career In 1973 How Old he was when he started his career? he was only 20 Years old when he started his career as Drummer\n\nRod Morgenstein Height, Weight and Body Measurement Height Weight Not Known Chest Size Not Known Waist Size Being Updated Shoe Size Being Updated Hair Color Being Updated Eye Color Being Updated Body Type Being Updated Sexual Orientation Being Updated\n\nRod Morgenstein Family, Parents, Siblings Spouse Parent Children 1 Father Don Menza Mother Mary McCartney Siblings Mike McGear, Sister Being Updated Brother Being Updated\n\nRod Morgenstein Current Affairs, Relation Ships, Dating What was Howland Chamberlain’s marital status? (Single, Engaged, Married, Fiancée in Relation or Divorce) Being Updated was Howland Chamberlain having any relationship affair? Being Updated Who was Howland Chamberlain’s girlfriend/Boyfriend? Being Updated"}, {"url": "https://music.metason.net/artistinfo?name=Rod%20Morgenstein", "page_content": "Rod Morgenstein\n\ndr, perc, *1953 US\n\nMusician of Rock\n\nRod Morgenstein (born April 19, 1953, in New York) is an American drummer and music educator. He is best known for his work with the late 1980s rock band Winger and with the jazz fusion band Dixie Dregs.He also played with Fiona, Platypus, The Steve Morse Band, and Jelly Jam. He has also done session work with Jordan Rudess including his ventures with the Rudess/Morgenstein Project. He also toured with Jazz is Dead. He has also been awarded Modern Drummer 's \"Best Progressive Rock Drummer\" five years (1986-'90), \"Best All-Around Drummer\" (1999) and was inducted into magazine's Honor Roll."}, {"url": "https://www.metal-rules.com/2007/03/08/winger-drummer-rod-morgenstein/", "page_content": "Spread the metal:\n\nINTERVIEW AND LIVE/INTERVIEW PICS BY MARKO SYRJALA\n\nTRANSCRIPTION BY ANDY OSBORN\n\nRod Morgenstein’s professional music career began as a founding member of the groundbreaking group Dixie Dregs in the 70’s. Morgenstein’s unique and dynamic drumming style has led Rod to win many awards, such as the Best Progressive Rock Drummer award in Modern Drummer Magazine’s Reader’s Poll five years in a row. He has worked with such names as the Steve Morse Band and Jordan Rudess, but there’s no doubt that he’s best known for his work with 80’s multi-platinum hard rockers Winger. The band released three albums before they wrapped it up in late 1993. Each member then went their separate ways to pursue individual goals. Kip Winger has released several solo albums. Reb Beach has worked on many projects and is now a member of the legendary Whitesnake. Paul Taylor did some commercials and projects, and Rod himself became an Associate Professor of Percussion at Berklee College of Music in Boston. He has also been doing different projects all the time. In 2006, Winger announced that the band would be back with the new album “IV.” Winger’s reunion tour reached Finland last October, and then I had a chance to sit down with Mr. Morgenstein himself and ask about the latest news and have a look back at some good old times.\n\nTHE REUNION, NEW LINEUP, AND FUTURE OF WINGER?\n\nTo be honest, I was surprised to hear the new album from you guys after 13 years. I have to ask why just now, why this album wasn’t released right after PULL, and what caused your breakup back in the day?\n\nWell, here’s the thing: I’ve been a professional musician for thirty years. I’ve played with many bands, and the most fun group of guys to tour with is these guys. We didn’t disband because we were fighting or enemies. It’s because Nirvana came on the scene in 1991, and it was essentially over for everyone. Record sales went from the millions down. “Pull” sold, and I think 300,000 records in America which by today’s standards, it’s like wow you’re happening, but back then, you had to go gold at minimum. So, what happened was MTV had been pounding our videos from 1988 until the end of 1991.\n\nWhen we came out with “Pull,” they said they would play “Down Incognito,” which was nice, but then they said, look, the alternative is in, and it’s just time to go out to pasture. When MTV suddenly stops playing all of the videos from metal bands, it sends a message to the record labels, and the labels say maybe it’s not worth pumping all the money into this music anymore. Then, everything happens at once. All the magazines are interested in Pearl Jam and Nirvana. We said, look, we had a great run. We have other things in music that we do, so let’s just let it end on a high note and see what happens down the road. Kip Winger is one of my best friends, and I’ve worked on his solo records, and then there are this Italian label, Frontiers, which for the last few years has been telling us we’re one of their favorite bands, so when you’re ready to do a record let’s do it. So, the time was right, and we’re all happy we did it. It was a wonderful opportunity to get together again. Four years ago, we got together to do the Poison and Cinderella US tour, which was a lot of fun. We just enjoy being together, and Reb is the funniest guy I know, so you just spend half the time laughing.\n\nWhat kind of expectations do you have regarding the sales of this new album?\n\nWell, we didn’t want any illusions with this record, so we said, let’s just do the record to remind people that Winger was a vital band and had something to say. And if all of our schedules line up and we can do some touring, let’s do it to see how much of our audience is there, to see if it’s even worth keeping it alive.\n\nDo you think this reunion is permanent and that Winger will continue making more albums in the future?\n\nWe’re not trying to think that far ahead. We all hope that will happen in our hearts, but if no people show up to a show, then you know, how much can you bang your head against the wall? But I think that turnouts will be pretty respectable. We’ll see. We have no idea if it’s going to sell a few thousand or even fifty-thousand or more?\n\nWhat happened to Paul Taylor. Why he’s not a part of this reunion?\n\nYeah, he’s taking another path. He wished us all well. He was coming in and hanging out with us while we were recording. Paul’s been very successful writing music for television. He co-wrote the theme for “Sabrina, the Teenage Witch,” and he’s making an incredible living off of that, and he’s the one that wrote “Miles Away,” which was our biggest hit. He’s now living in Nashville, pursuing a songwriting career. Yeah, touring is not something he’s interested in right now.\n\nYou have two new members in the band. Let’s start with guitarist John Roth. I know he has toured with you guys before, and he also plays on some of Kip’s solo stuff?\n\nWhen Paul left the band after the second album, we auditioned not many guys, but Johnny came to us through our manager at the time, who was a partner with Bon Jovi, Skid Rod Motley Crue. So Doug was managing us for PULL, and John was involved that Doug was also with, and he told us that he knew the perfect guy. He said he’s a great guitarist, a great singer, and he can also play keyboards. He was exactly what we wanted. One minute into jamming with him, we knew we didn’t want anyone else. The record was done, and we were like, wow, we’ll be touring. So the record was just me, Kip, and Reb.\n\nThen keyboardist Cenk Eroglu, he’s originally from Turkey, right?\n\nThatïs correct.\n\nHow did he end up being in Winger?\n\nYou know originally what happened was, this guy sent an e-mail to Kip saying, “I am from Istanbul, Turkey, and you are my favorite singer, Winger is my favorite band. I have to work with you.” So, I think he sent Kip some of his music, so Kip didn’t want to just fly out to Turkey, not knowing what to expect. But, it turns out he has some fame in Turkey as a performer, but he’s also a successful producer. Kip was actually blown away by some of the music, and then he made some trips to Istanbul, and the two of them were coming up to me with this incredible music that blended eastern and western culture. There were eastern percussion ensembles along with Kip’s voice, so I put the drums down to a bunch of music. They worked so hard on it over two or three years, and in the final analysis, when they got an album’s worth of music, they felt like they didn’t quite meet their mark. So, they want to continue on that path until they hit exactly what their vision was. In the meantime, Cenk used one or two tunes for his solo record, so that’s how that whole thing came about. Cenk played on the new record. He was in Nashville putting down records. But we couldnï¿½t work out his visa issues for the tour here.\n\nI have heard the new album a couple of times now, and I would say that my first impression is that it’s an even heavier album than “Pull” was. Was that on purpose?\n\nYou know, that’s such an easy question to answer. Well, you’re a musician, right? Anyone wants to have a career in music, so in a perfect world, we don’t listen to anything, and we just write music that is 100% what we want to do. But, when you do that, most probably never get a record deal because nobody knows where to fit it or how to market it, so it’s too unique. What most musicians do when they want to have a career is listen to everything that’s happening in the music business and say, is what I feel inside of me somehow compatible with trying to use some of the elements of music that labels are signing now to enable us to get a deal? I think that’s part of how a lot of musicians end up getting record deals. A lot of musicians are into a lot of different kinds of music. My career has spanned so many different styles. I still play with Steve Morse and The Dixie Dregs making this instrumental fusion music. I play with Jordan Rudess, the keyboardist from Dream Theater. We have a duo where we do this over-the-top progressive stuff. I also play in a Jazz Is Dead band, which had Alfonso Johnson and people for many years.\n\nWe would do this jam band Grateful Dead kind of stuff. Then I would play with the bassist from Dream Theater and Ty Tabor from King’s X to do this like power-pop so, what is the music that I love? I love it all! Whether, it’s the heavy metal of Winger or the fusion of the Dregs. The fact is that the first two Winger albums sounded the same, and “Pull” was a bit heavier, which is even heavier than that. To me, it’s not that you at one time were doing something that you were not true to, and this is something that you are true to. It’s just that musicians evolve. We go through a lot of changes.\n\nSo are you saying that Winger is heavy metal?\n\nMy career started the day that I got out of college with the Dixie Dregs. Nobody ever knew how to label us because we did rock and fusion and country, and they’d say: what are you guys? We’re just music! Once you put a label on it, everybody has a perception of what it is, and they start throwing the shit at you. Well yeah, most people would say that Winger is heavy metal, but if you hear “Blue Suede Shoes.” That’s not metal. That’s pop! And it almost has some progressive edges to it, but what about this other song? So, I don’t know what to call it anymore. I just want to call it music!\n\nGOLDEN 80ï¿½s WITH BEAVIS AND BUTTHEAD…\n\nBack in the 80ï¿½s Winger was often called one of the wimpiest bands existing. Why?\n\nYeah, well, I look at those pictures now, and I just laugh. I have great memories of it all, but some of it looks really silly. People have to realize that back then when we were doing it, all those bands were very serious about it. We would go to great lengths to have clothing made and our haircuts and having it permed. It looks funny now; it’s kind of like when you watch movies of England where they’re wearing funny hats. To them, it was very serious, and so back then, we didn’t look any better. We look like a bunch of clowns! Back then, it was what everyone was doing. The audience loved it, and they were buying millions and millions of records, so something was working. I dare say that a lot of it. The guitarists from the metal bands were certainly way better than the guitarists that followed in the alternative bands—Reb Beach, Andy Timmons from Danger Danger, etc. I could just go down lists of these great guitarists.\n\nWhat did you think about the character of “Beavis and Butthead” where they wore a Winger t-shirt?\n\nIt helped nail the coffin shut for our career. I remember watching it and laughing, then suddenly, I saw this nerdy, wimpy character, and he was wearing a Winger shirt. Not only that, but his parents wore Winger shirts! We tried to determine if we did something to the show’s creator, like why he chose us. Out of all the wimpy bands: Winger, Bon Jovi, White Lion, Danger Danger. Why Winger? We were never able to figure it out. Yeah, that really hurt, but it’s also very flattering. It means you mean something when someone chooses you to poke fun at.\n\nBeau Hill produced the first two Winger albums. How was it working with him back in the day?\n\nWell, Beau and Kip were best friends when they were teenagers. Then Beau was in a band called Airborne that had a record deal, but nothing really happened. Somehow, he ended up producing Rattï¿½s first album, so he came on the map as a producer. He’s the one that kind of secured the first Winger deal, now that he was a hot producer. He went to Atlantic Records and got us a deal, so he was the logical choice to produce the records. But what happens so often in the music business is you kind of live life, play your gigs, do your records, but you don’t see eye to eye how it should be done. I wasn’t particularly crazy about some aspects of the production, but many of the records were like that. I was just listening to “Seventeen,” and there are no cymbals! And the snare is the loudest thing, and it’s even louder than the vocals.\n\nYou mentioned that he produced Ratt’s first album; I think he produced five of their albums. There are not many cymbals there, either?\n\nIt’s part of his productions. There’s no reverb, and now when you listen to it now, it’s wimpy. I mean, listen to that and then listen to “Back in Black.” For years, Kip has wanted a chance to remix those albums.\n\nPull was produced by Mike Shipley, and that album was something very different?\n\nWe know in some ways that it should have been the first Winger album. It’s not that hindsight is 20/20. It’s just that you kind of wonder: what if this came first? “Seventeen” is the song that put us on the map, and it also has the most jokes made about. The lyrics are stupid! But the music is very cool. It was just, you know, it was sex, drugs, and rock N roll back then. Many bands did songs like that, but that was the one that people made fun of.\n\nMaybe that song is the reason for the whole Beavis and Butthead thing?\n\nMaybe, but it also sold a million albums, so? “laughs.”\n\nMEETING SEPULTURA, TOURING WITH SCORPIONS, PLAYING WITH ZENO, AND ALMOST WORKING WITH BLACK SABBATH.\n\nYou have been to Finland a couple of times before. Do you have any memories of those visits? Many people still remember when Winger played in a Giants of Rock festival, and your slot was right after Sepultura.\n\n[Laugh] Yeah, we will never forget that. See, bands like Winger and Sepultura should not be on the same bill. They have a much more hardcore audience. I remember playing “Miles Away” “laughs,” and you don’t play a ballad like that for Sepultura’s crowd. They don’t mix. There are a lot of different styles in the rock genre, and we talk about that. We remember that night. The sun was shining, and it was like noon PM-midnight. It was great. It was nice meeting the Sepultura guys because they were fans of the Dixie Dregs, so it was cool for me.\n\nI remember that once you played Finland with the Scorpions?\n\nYeah, that was in 1991. You know what? Scorpions were the first band that Winger ever played with. We weren’t a band that played clubs and eventually got a deal. We were musicians that did demos, our record came out, and suddenly our first show was on tour with the Scorpions in America. That was in September or October 1988.\n\nSpeaking of Scorpions, I’m going to meet with former Scorpions bassist Francis Bucholz in a few weeks. He’s now actually playing in Uli Jon Roth’s band, and we will see them in Sweden.\n\nHe’s playing with Uli?! You’re going to see them? Could you say HI! to both of those guys for me? I used to be in a band with Uli’s brother, Zeno, so it was a real thrill for me. I auditioned for them in New York City, and Uli was there too. I played with them, and that was really cool. So, I moved over to Hannover, Germany, then went to England to do a Black Sabbath tour. But, back then, Black Sabbath was only Toni Iommi. Eric Singer was on drums and Ray Gillen on vocals. Dave Spitz played bass, and there was the keyboard guy, Geoff Nichols. So, we did a tour of the UK with them.\n\nHow was that tour?\n\nIt was good. It was terrific. Zeno was a great man. It was a comedy of errors that made that not happen. They had signed the biggest record deal in the history of music as a new band. That’s how huge it was. I think EMI England, when they signed Zeno, thought that they would be the next Queen. We would drive around London and see billboards for Guinness Beer, and the next one was Zeno’s new album. They were spending huge amounts of money on it, but it just didn’t take.\n\nYou never recorded albums with them?\n\nNo, the record was just about to come out. They had three different drummers and producers on this record. I think that’s what part of the problem was. It was just the three guys in the band, and they just kept plugging in new musicians and different producers, and they recorded all over the world and spent, I don’t know how many hundreds of thousands of dollars on that record. By the time I got there, the writing was on the wall. I thought it was a good record, but who knows what goes on behind the scenes at labels? I’m excited; the last show that Winger is doing is in Nottingham, the UK, at this thing called Fire Fest. It’s a bunch of bands and one of the bands is called Fair Warning and the bass player from Zeno, when I was in the band, is going to be there. I’m really looking forward to seeing him.\n\nHow about Black Sabbath and the album “The Seventh Star”? You almost ended up joining the band in 1985?\n\nI think that was supposed to be a Tony Iommi solo record, and Glenn Hughes was the singer. You know what, it’s funny; I met Tony and Glenn in Atlanta when they were recording that record, and that’s where I was living. I was friends with Jeff Glixman, who I recently saw again at a Kansas concert in New York City. He used to be their producer. So I was living down in Atlanta in the 80s, and when Tony was recording the album, Jeff said, “Hey, you should come in and jam with Tony because I don’t know if Eric will be able to tour with them.” So, I went in and jammed with him, but I know I did a terrible job because I hate to confess this. I didn’t know a single song by Black Sabbath.\n\nWhen I was growing up, I listened to Led Zeppelin, Jethro Tull, Jimi Hendrix, and Cream. Jethro Tull was my favorite. Back then, because I’m very different now, Black Sabbath was too raw and basic. It was much simpler, like, you hear the song, and if you play an instrument, you can figure it out if you listen to it. Jethro Tull takes a lot more work. I was more in that mode of everything having to be complicated. I have really come like I’m going backward in a lot of ways in my older age. Now, I love the more simple, all about the vibe music that’s not just about the notes. So, when I went in to jam with Tony Iommi, I didn’t know anything. Sure I may have heard Ozzy’s voice saying, “I am Iron Man,” you know? That’s all I’d ever heard. Like an idiot, I didn’t even think to listen to Sabbath records before going in. All I thought in my mind was, “Oh right; he’s a rock guitarist. I’ll just hit my drums as hard as I can and not even play fills.” So, he was jamming, and I would start playing, and I had all these tom-toms that I wasn’t even using. Then, after the fact, I listened to some records, and Bill Wards uses toms all the time. So, I was clueless, is what I’m saying. I didn’t do my homework. Maybe if I did, I would have had a shot at playing with him. I think Eric Singer was already coming in to do “Seventh Star.” Eric is a great drummer, a great drummer.\n\nHe currently does a great job with KISS and Alice Cooper.\n\nYeah, when Winger toured with KISS, it was with Eric. I was becoming very friendly with him. That was in 1990, fall of 1990. Because then we came to Europe in December and played with Scorpions until 1991.\n\nDIXIE DREGS AND JORDAN RUDESS\n\nHow did your first band Dixie Dregs originally start?\n\nI started in college. We were all music students. I also played keyboards and piano, and I wasn’t sure if I wanted to be a drummer or piano player. I was in an improvisation class playing the piano. I played with many guitar players and me like fifteen of them. And one of them really stuck out to me. He had long blonde hair, while all of the other guitarists had big fat jazz hollow-body guitars, and there was the one guy who played like a bastardized Telecaster with four pickups and a Stratocaster neck and Gibson frets, and he didn’t sound like a jazz guitarist. The teacher was always yelling at him, saying, “Morse, can’t you sound like everybody else?” And I said this guy is unbelievable. One day he came up to me, and we didn’t know each other at all. He heard that I played the drums, and he told me his drummer had just broken his arm surfing. And he asked to fill in for some rehearsals while he was gone, and I said sure. I went into the first rehearsal, and they were doing Mahavishnu Orchestra covers, which was my favorite band; that band changed my band. I’d never heard anything like that. So we’re doing these covers, and we have an electric violinist there. Steve’s songwriting, I thought I’d died and gone to heaven. Here I was playing my favorite kind of music, and about a month or two later, the other drummer came back, and we started playing as a double drum band. But he was more of a meat and potatoes drummer, so he couldn’t really play in the different time signatures. It just wasn’t his thing. Everybody felt really bad, and we didn’t know what to do. Eventually, he just said, this isn’t my thing, and he left. So, I was the guy.\n\nYou guys have stayed very close?\n\nYeah, we have. The Dregs disbanded, and then Steve started the Steve Morse band, and he asked me to be a part of it. I did that for two records, and then Kansas reformed and asked him to join them. He told me he wanted to check it out, and living in Atlanta, we were all down south. I moved to New York, which is where I’m from originally. Within a year, I met Kip and Reb when they were doing demos and getting rejected from record labels left and right: “You suck, you suck, no, no, no!. So it was just luck and timing. When I met them, I was up in the offices of a management company. Then, I was leaving, and I didn’t know anybody was still there; Kip and Reb were using some recording gear. I expressed an interest in their music, and they said, okay, we’ll put you on the list of the twenty drummers that want to audition. They called me a few days later and said, “Hey, do you want to get together and jam?” Kip had left Alice Cooper by that time. He was doing session work at that time. He played on a Bee Gee’s record and did things like that.\n\nI have understood correctly, lice wanted to change the band’s direction, and that’s why Kip left the band?\n\nI thought Kip just left on his own. They were terrific friends, Kip and Alice.\n\nHow about Jordan Rudess (Dream Theater). You guys have been doing different projects over the years. How did you meet him in the first place?\n\nWell, the Dregs were in the midst of touring in 1994, and our keyboard player wasn’t able to do the last two months of the tour, and none of us had ever heard of Jordan. Until Dream Theater came around, no one had heard of him. He was recommended to us by Jan Hammer, the guy who also made Miami Vice’s music. He’s one of my favorite Keyboard players. So, Jordan sent us one of his solo records, and we were just floored by it. When he came down, we told him that he was in without an audition. Within three days, he learned the whole set just by listening to the songs. He has perfect pitch, he was a child prodigy, and he discovered his genius when he was nine. He came down to Steve Morse’s house, and he played everything perfectly. He would also say things like, “Did you also need me to play the bass line there?” [Laughs] It was unbelievable! The first show that he played with us. We had rehearsed on Thursday, and on Friday, we played a show in Florida. In the middle of the show, the guitar, violin, and bass rigs went down. But, drums can play whether the PA is working or not. And the keyboard PA was still there. So, rather than stop, we just started jamming, and it went on for, I don’t know, five or ten minutes. Everybody’s rigs were then fixed, and we went on to the show. We talked about it afterward and decided that we had to do something together. So, we spent 1995 and 1996 doing the Rudess/Morgenstein CD, which came out at the end of 1997. Every year, he and I managed to do a handful of gigs. Just this past May, we played in Venezuela and Costa Rica. We played with a Brazilian band called Angra, a good band.\n\nThen we headlined in Costa Rica, just keyboards and drums! He is so unbelievable. No keyboard player in the world can do what he does. Almost the entire show is live. It’s not like he presses a button to play a sequence. He programs the keyboard so the sustain pedal knows not to sustain the bass and leaves only the chords. Programs in pitch bends and stuff like that. We’re in the midst of doing another record. We have a lot of it done. So he’s doing that, and he has another Dream Theater and solo record that he’s working on. So, I’ll be doing some of that with him.\n\nI heard a rumor about Dixie Dregs and Kansas going on tour together. Is that true?\n\nThat I have never heard about, the Dregs manager is also the manager of Dream Theater. Actually, I live with him because I’m a professor at Berkley in Boston. He’s been trying for the longest time to get the Dregs out there, hooking us up with bands like King Crimson or something, instead of us doing the clubsï.\n\nSo that’s not going to happen anytime soon?\n\nNo, it’s not, but that would be awesome.\n\nWell, this will be the very last question. Will you guys be recording any shows from this current Winger tour?\n\nYeah, we were hoping to film a live DVD on this tour, but we’re not good without Cenk. The photo has the five of us, and he’s an essential part of the puzzle. We need to have the keyboards on many tunes plus another vocal because he’s a powerful singer. Our agency is looking for a tour for us in the US where we would have Cenk, and then we could do the live DVD.\n\nThanks for your time Rod!\n\nFOR MORE INFO, GO TO:\n\nWWW.WINGERTHEBAND.COM\n\nWWW.RODMORGENSTEIN.COM\n\nSPECIAL THANKS TO STEFAN FROM ZINK MUSIC AND MIKKO SAUKKONEN FROM BONNIERAMIGO FOR SETTING THIS INTERVIEW UP !!\n\nMORE PICTURES FROM WINGER SHOW IN HELSINKI 2006 !!!"}, {"url": "https://www.celebsagewiki.com/rod-morgenstein", "page_content": "Age, Biography and Wiki\n\nRod Morgenstein was born on 19 April, 1953 in New York, NY. Discover Rod Morgenstein's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 70 years old?\n\nPopular As N/A Occupation N/A Age 70 years old Zodiac Sign Aries Born 19 April 1953 Birthday 19 April Birthplace New York, NY Nationality NY\n\nWe recommend you to check the complete list of Famous People born on 19 April. He is a member of famous with the age 70 years old group.\n\nRod Morgenstein Height, Weight & Measurements\n\nAt 70 years old, Rod Morgenstein height not available right now. We will update Rod Morgenstein's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nRod Morgenstein Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Rod Morgenstein worth at the age of 70 years old? Rod Morgenstein’s income source is mostly from being a successful . He is from NY. We have estimated Rod Morgenstein's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nRod Morgenstein Social Network\n\nTimeline"}, {"url": "https://www.berklee.edu/berklee-today/spring-2000/The-Dregs-MTV", "page_content": "Every student wants to study with a teacher who has \"been there\" in the music business. Having seen the view from the top at two very different ends of the musical spectrum, Associate Professor of Drums Rod Morgenstein brings a lot to the table for his students. He became a poll-winning drummer as a result of his work with the legendary progressive rock instrumental group the Dixie Dregs (a.k.a. the Dregs), and later became known to teenage fans and millions of MTV viewers for his membership in the platinum-selling metal band Winger.\n\nAmong musicians, Morgenstein is widely known for his work with the Dregs. The band, led by guitarist Steve Morse, formed in the middle 1970s while Morgenstein and the rest of the band were students at the University of Miami. With virtually no radio support, but a great word-of-mouth reputation, the band became a force to be reckoned with. The Dregs received Grammy nominations for each of their last six recordings and much coverage in music trade magazines throughout the 1980s. Modern Drummer magazine named Morgenstein Best Progressive Rock Drummer for five consecutive years. He was recently voted Best All-Around Drummer in their 1999 reader's poll.\n\nHe has warm feelings for that era in his career and for the people that he met in the early days. \"I have this incredible feeling for Dregs fans,\" Morgenstein said. \"Some 25 years later, I still run into people who were behind us before we even had a record out. When we started out, we were in a car pulling a trailer and setting up our own gear after driving several hundred miles to a club. There would be 10 people in the audience, and five would leave screaming after the first song because they hated it. The other five would become fanatical fans for life who would invite us to stay at their homes--many times giving up their own beds so we could sleep in them. We established those types of relationships all around the country. Playing the Dregs reunion tour this past summer and running into longtime fans again reminded me of the influence that band had on some people.\"\n\nAfter the Dregs disbanded, Morgenstein continued touring and recording with the three-piece Steve Morse Band until 1986, when Morse took a gig with the group Kansas. Out of work for the first time since college, Morgenstein struggled a bit before surfacing as a member of the soon-to-be platinum-selling pop metal band Winger. Some progressive rock fans and critics were horrified. They claimed Morgenstein had sold out and joined a corporate rock band.\n\n\"I found that fascinating,\" said Morgenstein. \"How can you sell out in the music business? Nothing is a given. As hard as it was for the Dregs to get the message out playing instrumental music, for every band like that, there are probably a thousand rock bands. How many rock bands are lucky enough to even get signed--never mind sell some records?\n\n\"I didn't join Winger for the money, because when I started, we were only making about two hundred bucks a week. I went out with the band because my heart was in the music, and I was willing to give it a shot.\"\n\nWinger's success came after lead man Kip Winger and guitarist Reb Beach had struggled for years to get signed. As a favor, a producer helped them to get a small budget from Atlantic Records. The company pressed 13,000 copies of the first record. \"That's not the sign of a label getting behind a band expecting to make them huge,\" Morgenstein noted.\n\nAfter MTV started playing Winger's first video, the initial 13,000 records sold immediately. Within the year, the band's eponymous debut disc had sold nearly two million copies. Unfortunately, as the band became more popular, they started to become the butt of jokes as the heavy metal movement waned. Even the writers for the television series Beavis and Buttheadtook shots at the band.\n\n\"I don't want to name other bands and say why was it us and not them,\" said Morgenstein, \"but I consider myself to be a decent drummer, Reb Beach is a phenomenal guitar player, and Kip Winger is a serious musician who studied classical composition with teachers from Juilliard. If people would just listen to the songs on the record, I feel they would find some depth there.\"\n\nSince Winger, Morgenstein has worked with progressive rock groups like Platypus, featuring John Myung and Derek Sherinian of Dream Theater fame, and Ty Tabor, the guitarist for King's X. He is also part of Jazz Is Dead with bassist Alfonso Johnson, keyboard player T. Lavitz, and guitarist Jimmy Herring. The latter is an instrumental jam band that uses the music of the Grateful Dead as a launching pad for its exploratory improvisations. The project that is presently closest to Morgenstein's heart is the Rudess Morgenstein Project, a keyboard/drums power duo for which he has written half of the music. \"I have never written 50 percent of the material for any group,\" he said. \"This is new to me and is my proudest achievement.\"\n\nAs a teacher at Berklee, Morgenstein's reputation precedes him. \"A lot of the students who come to me are fans of the groups I've been in,\" he said. \"Some want to study the heavy metal style I played with Winger and others are interested in the fusion style that I played with the Dregs. I have written over 200 columns for drum magazines, and will soon have a book of drum set warm-ups published by Berklee Press, so there is always plenty to work on.\n\n\"Playing with Jazz Is Dead has brought a period of self-discovery. I have been pushed to find new sounds, new ways to hit the drums, and new grooves and fills. I pass that stuff on to my students. I like variety in life and in music. Doing all of these different things is keeping me young.\""}, {"url": "http://rodmorgenstein.com/", "page_content": "After years of noodling with the idea of creating specialty tools for drummers, to help with the handful of pesky issues all drummers face at one time or another, the first tool - Wing Thing - has finally come to fruition. Please check it out at morgensteintool.com\n\nThanks.\n\n\n\n\n\nSee you on the road!\n\nRod\n\nHey Everybody,Rod here. After 45 years of amassing an enormous collection of drum sets, snare drums, cymbals, percussion, Winger clothing (from the good ole days), tour laminates, itineraries, posters and awards, drumheads, drumsticks, assorted hardware, and other mementos, I have decided to part with a tremendous amount of these items. Three of the major items I am parting with are drum sets from–\n\nThe Dixie Dregs, ‘Bring ‘Em Back Alive’, live recording (from The Center Stage in Atlanta, GA in early ’92) and tour, including an appearance on The Tonight Show with Jay Leno in December 1992 The 2002 ‘Hollyweird Summer Tour’ featuring Poison, Cinderella, Winger and Faster Pussycat, plus a Winger tour that followed in the fall of ‘02 The drum set used on several Dixie Dregs tours from the late ‘90’s through 2007\n\n\n\n\n\nRod It has been an amazing trip down memory lane sorting through hundreds of possessions, each one triggering a smile, a story, or an unforgettable memory I will cherish forever. If you are interested in checking out some of these items, you can contact my friend and fellow drummer, Ed Tucker, at Studio 3T studio3t@icloud.com Or join Ed’s Facebook group: Vintage Drum Collectors & Players. Type in “Rod Mo” in the question to join the group.It’s gonna take awhile before each and every item is listed, so make sure to check in over the coming weeks to see what new things have been added.Thanks for all the great years. It has been, and continues to be, an incredible ride.Rock On!Rod\n\nHere's a video clip of RA from one of the recent Rudess Morgenstein Project concerts courtesy of videographer Matthew Smith\n\n\n\n"}, {"url": "https://alchetron.com/Rod-Morgenstein", "page_content": "Rod Morgenstein (born April 19, 1953) is an American drummer and music educator. He is best known for his work with the rock band Winger and with the jazz fusion band Dixie Dregs.\n\nContents\n\nHe also played with Fiona, Platypus, The Steve Morse Band, and Jelly Jam. He has also done session work with Jordan Rudess including his ventures with the Rudess/Morgenstein Project. He also toured with Jazz is Dead. He has also been awarded Modern Drummer 's \"Best Progressive Rock Drummer\" five years (1986-'90), \"Best All-Around Drummer\" (1999) and was inducted into magazine's Honor Roll.\n\nHe is currently a Professor teaching Percussion at Berklee College of Music in Boston, Massachusetts. Morgenstein plays Premier drums left-handed, and he still tours with the band Winger in Europe and in the United States. He has also been a columnist for Modern Drummer magazine.\n\nRod is known for his versatility of playing many styles of music.\n\nWinger released a live DVD/CD in November 2007.\n\nMorgenstein currently uses Premier drums, Evans Drumheads, Sabian cymbals, Vic Firth drumsticks, and LP Percussion. He has, in the past, also used Remo drumheads and Paiste cymbals."}, {"url": "https://www.musictimes.com/articles/84582/20220419/rod-morgenstein-now-2022-age-net-worth-current-work-winger.htm", "page_content": "Rod Morgenstein is turning 69 years old today! Happy Birthday, Rod Morgenstein!\n\nAmerican heavy metal band Winger guitarist Rod Morgenstein is celebrating his birthday today. Let's see what he is up to currently.\n\nWho is Rod Morgenstein?\n\nBorn in New York City on April 19, 1953, Rod Morgenstein rose to fame because of his important work as a drummer at the Winger and with the jazz fusion band Dixie Dregs.\n\nAs of this writing, Rod Morgenstein turned 69 years old today.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/gnwg0Yrckr0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nRod Morgenstein Music Career\n\nAside from the two bands, he has also notably played with Fiona, Platypus, Jelly Jam, and The Steve Morse Band.\n\nHis ventures also include working in some sessions with Jordan Rudess for the Rudess/Morgenstein Project.\n\nIn the late 1980s, Modern Drummer, a magazine for drummers and percussionists, awarded Rod Morgenstein as the Best Progressive Rock Drummer from 1986 until the 1990s.\n\nMorgenstein received the Best All-Around Drummer Award and induction into Modern Dummer's Honor Roll nine years later.\n\nREAD ALSO: Coachella 2022 Weekend 1 Surprises and Highlights You May Have Missed\n\nRod Morgenstein Net Worth\n\nAccording to Net Worth Post, Rod Morgenstein's current Net Worth is estimated to be $15 million.\n\nHis current net worth is primarily attributed to his long-time work as a drummer for numerous bands.\n\nThe 69-year-old drummer has been working with Winger for the past decades and has already been involved in six albums as the band's drummer.\n\nHe has also worked the most with Dixie Dregs - working on eight albums, with the last project released in 1994.\n\nRod Morgenstein Now 2022\n\nAside from being a prominent drummer, Rod Morgenstein also took on the role of sharing his musical expertise.\n\nMorgenstein is currently an Associate Professor at Berklee College of Music in Boston, Massachusetts, where he teaches percussion.\n\nAside from that, he also works as a columnist for the same publication, Modern Drummer, which inducted him into their Honor Roll in 1999.\n\nThe New York-born drummer was notably one of the many left-handed musicians in the rock scene, joining the likes of Kurt Cobain and Paul McCartney.\n\nLast February 2022, Winger seemed to be releasing new music soon as Rod Morgenstein was in the studio with Kip Winger and Paul Taylor.\n\nGreat hang in the studio today, Rod killing it on another 4 songs!#WingerVII pic.twitter.com/AD9R8q7WeX — Winger (@WingerTheBand) September 30, 2021\n\nWinger is on the road with their 2022 Winger Tour, the latest in Virginia, Minnesota.\n\nREAD ALSO: Eric Church Gives Realest Advice To Morgan Wallen Amid Their Controversies\n\n© 2015 MusicTimes.com All rights reserved. Do not reproduce without permission."}]}