{"Rod Morgenstein has released two solo albums: The Rod Morgenstein Project (1995) and Rod Morgenstein's Winger (1998).": [{"url": "https://www.drummerworld.com/drummers/Rod_Morgenstein.html", "page_content": "Rod’s professional music career began as a founding member of the groundbreaking group the Dixie Dregs when, as a student at the University of Miami in Florida, he met Steve Morse, Andy West and Allen Sloan. The university was a hotbed of musical activity during this period, playing host to brilliant future talents like Pat Metheny, Jaco Pastorius, Danny Gottlieb, T Lavitz and Bruce Hornsby. Playing under the official Studio Music and Jazz curriculum title of Rock Ensemble II, the Dregs honed their fusionesque chops. It was here that the band recorded its classic Great Spectacular album now available on CD.\n\n\n\nThe Dixie Dreg’s music combines rock, jazz, bluegrass, folk and classical influences into rich, ever-changing tapestry of sound. All the while, Rod’s drumming weaves its way seamlessly and colorfully through this swirling musical landscape.\n\n\n\nHis unique, dynamic and musical drumming style has led to Rod’s winning the Best Progressive Rock Drummer award in Modern Drummer Magazine’s Reader’s Poll 5 years in a row (1986-1990) and Best All-Around Drummer (1999), earning him a permanent position in the magazine’s prestigious Honor Roll. The Dixie Dregs, whose last 6 recordings have each received Grammy nominations for Best Rock Instrumental Performance, are best described in the following Philadelphia Inquirer concert review, “The Dregs have their own unique language and style familiar to bluegrass and country music, refined with classical finesse and delivered with high-powered technology and rock energy. The band is possible the most important, and certainly the most technically advanced, instrumental group in progressive fusion.”\n\n\n\nWhen the group temporarily disbanded in 1983, Rod joined forces with Steve Morse who, along with bassist Jerry Peek, formed the Steve Morse Band. Rod remembers, “One of our biggest breaks came when we had the opportunity to tour for 3 months with Rush on their 1985-1986 Power Windows tour. I felt a surge of popularity, both as a band and as a drummer, as a result of performing night after night in sold out arenas packed with appreciative progressive-rock fans. And it was more than obvious that many of them were drummers.”\n\n\n\nThe Steve Morse Band recorded two albums, at which point Rod found himself at a crossroad in his career, as Steve Morse joined the reforming group Kansas. “I was ready for a musical change and to try something both new and challenging.”\n\n\n\nWithin a year of moving to New York City in 1986 after living in and around Atlanta, Georgia, for the previous 11 years, Rod met Kip Winger and Reb Beack, namesake and lead guitarist of the as-of-then-non-existent band Winger. “Kip and Reb had been writing and recording demos and forever being rejected by record labels. I met them at a point in their lives where they were completely driven to get signed. Nothing could shake their determination. We got together and jammed, hit it off, and two months later they called to say they got a deal and to see if I’d be interested in doing the record.”\n\n\n\nThe rest is history! Their self-titled debut album in 1988 sold over two million copies worldwide, earning the band a platinum album in the U.S. and gold albums in Japan and Canada. It also led to an American Music Award nomination for Best New Heavy Metal Band. This album was followed by In the Heart of the Young and, once again, platinum and gold awards were in the offing, coupled with non-stop international touring.\n\n\n\nThe band ceased activities in 1993 after touring for the highly acclaimed Pull recording, as dramatic changes were taking place in the music scene. Alternative music had replaced metal as the accepted music of the day.\n\n\n\nAnd so, Kip Winger set out to record his first solo album, This Conversation Seems Like Dream (1997), a dramatic departure from the first three Winger recordings, drawing heavily on world percussive rhythms, dark imagery and heavy grooves. Rod recorded the drum tracks for this album and the more recent Songs From The Ocean Floor (2001) at Kip’s home studio in Santa Fe, New Mexico.\n\n\n\n1997 also saw the self-titled debut release by the Rudess/Morgenstein Project, an instrumental progressive power-duo, featuring Rod and Dream Theater keyboardist extraordinaire Jordan Rudess. The seed for this project was planted one evening on the Dixie Dregs 1994 Full Circle tour in Fort Lauderdale, Florida, when a sudden power failure shut down the guitar, bass and violin rigs. For whatever reason, the keyboards remained unaffected. And what followed was a blistering, 10 minute drum/keyboard power-duo jam, which brought down the house. It was that evening’s events, which inspired Rod and Jordan to form their “small in numbers yet mighty in sound” band\n\n\n\nOther on-going projects that Rod is involved with are jam band Jazz Is Dead which features creative improvisations of the music by the Grateful Dead. Members of JID have included T Lavitz, Alphonso Johnson, Jeff Sipe, Billy Cobham and Jimmy Herring, with an ever-changing line up. Another project is Platypus, whose two recordings feature John Myung (Dream Theater), Ty Tabor (King’s X) and Derek Sherinian (Planet X). The music is a mix of instrumental and vocal tunes that blend many different styles together. And offshoot of Platypus is Jelly Jam, a power trio featuring Rod, Ty Tabor and John Myung. Their first release is due out in 2001.\n\n\n\nIn addition to his recording and touring credits, Rod is very active in drum education. He is currently an Associate Professor of Percussion at Berklee College of Music in Boston, Mass. Also, his highly recognized instructional materials include videos, audio cassettes and books. His most recent offering is Drum Set Warm-Ups, touted as the definitive text for developing and improving all aspects of drum set playing. Additionally, Rod has been a columnist for Modern Drummer Magazine (U.S.), Rhythm Magazine (UK), Sticks Magazine (Germany) and is an international clinician and involved with product development for Premier Percussion (Rod Morgenstein Signature Drumheads), Sabian Cymbals (Signature Tri-Top Ride), and Vic Firth Sticks (Signature Sticks and Isolation Headphones), with whom he has been and endorser for many, many years.\n\n\n\nRod can be summed up in the following passage from a cover story in Modern Drummer Magazine: “You can see it in his face; Rod Morgenstein loves what he does for a living. Get him talking about drums and you’ll see those eyes start to crinkle as a warm, sincere smile spreads over his face. Get him behind a set of drums, and the same enthusiasm is evident in the way that he tears into the kit as though he’s been waiting for weeks to get at it. That’s not to imply that his playing is uncontrolled, because he is definitely in charge of everything that is happening on the drum set. It’s just to say that you never get the sense that Morgenstein has lost any of the initial excitement about the drums that makes people become drummers to begin with.”\n\n"}, {"url": "http://rodmorgenstein.com/about.html", "page_content": "ABOUT ROD\n\nRod\u0092s professional music career began as a founding member of the groundbreaking group the Dixie Dregs when, as a student at the University of Miami in Florida, he met Steve Morse, Andy West and Allen Sloan. The university was a hotbed of musical activity during this period, playing host to brilliant future talents like Pat Metheny, Jaco Pastorius, Danny Gottlieb, T Lavitz and Bruce Hornsby. Playing under the official Studio Music and Jazz curriculum title of Rock Ensemble II, the Dregs honed their fusionesque chops. It was here that the band recorded its classic Great Spectacular album now available on CD.\n\nThe Dixie Dregs' music combines rock, jazz, bluegrass, folk and classical influences into a rich, ever-changing tapestry of sound. All the while, Rod\u0092s drumming weaves its way seamlessly and colorfully through this swirling musical landscape.\n\nHis unique, dynamic and musical drumming style has led to Rod\u0092s winning the Best Progressive Rock Drummer award in Modern Drummer Magazine\u0092s Reader\u0092s Poll 5 years in a row (1986-1990) and Best All-Around Drummer (1999), earning him a permanent position in the magazine\u0092s prestigious Honor Roll. The Dixie Dregs, whose last 6 recordings have each received Grammy nominations for Best Rock Instrumental Performance, are best described in the following Philadelphia Inquirer concert review, \u0093The Dregs have their own unique language and style familiar to bluegrass and country music, refined with classical finesse and delivered with high-powered technology and rock energy. The band is possibly the most important, and certainly the most technically advanced, instrumental group in progressive fusion.\u0094\n\nWhen the group temporarily disbanded in 1983, Rod joined forces with Steve Morse who, along with bassist Jerry Peek, formed the Steve Morse Band. Rod remembers, \u0093One of our biggest breaks came when we had the opportunity to tour for 3 months with Rush on their 1985-1986 Power Windows tour. I felt a surge of popularity, both as a band and as a drummer, as a result of performing night after night in sold out arenas packed with appreciative progressive-rock fans. And it was more than obvious that many of them were drummers.\u0094\n\nThe Steve Morse Band recorded two albums, at which point Rod found himself at a crossroad in his career, as Steve Morse joined the reforming group Kansas. \u0093I was ready for a musical change and to try something both new and challenging.\u0094\n\nWithin a year of moving to New York City in 1986 after living in and around Atlanta, Georgia, for the previous 11 years, Rod met Kip Winger and Reb Beach, namesake and lead guitarist of the as-of-then-non-existent band Winger. \u0093Kip and Reb had been writing and recording demos and forever being rejected by record labels. I met them at a point in their lives where they were completely driven to get signed. Nothing could shake their determination. We got together and jammed, hit it off, and two months later they called to say they got a deal and to see if I\u0092d be interested in doing the record.\u0094\n\nThe rest is history! Their self-titled debut album in 1988 sold over two million copies worldwide, earning the band a platinum album in the U.S. and gold albums in Japan and Canada. It also led to an American Music Award nomination for Best New Heavy Metal Band. This album was followed by In the Heart of the Young and, once again, platinum and gold awards were in the offing, coupled with non-stop international touring.\n\nThe band ceased activities in 1993 after touring for the highly acclaimed Pull recording, as dramatic changes were taking place in the music scene. Alternative music had replaced metal as the accepted music of the day.\n\nIn 2002, WInger reunited for a summer tour with Poison, CInderella and Faster Pussycat in support of 'The Very Best of Winger', a greatest hits collection. And in 2006, the band released the critically acclaimed, 'Winger IV', followed by tours in Europe, US, Japan and Australia.\n\nIn 1993, when Winger temporarily disbanded, Kip Winger set out to record his first solo album, This Conversation Seems Like Dream (1997), a dramatic departure from the first three Winger recordings, drawing heavily on world percussive rhythms, dark imagery and heavy grooves. Rod recorded the drum tracks for this album and the more recent Songs From The Ocean Floor (2001) at Kip\u0092s home studio in Santa Fe, New Mexico.\n\n1997 also saw the self-titled debut release by the Rudess/Morgenstein Project, an instrumental progressive power-duo, featuring Rod and Dream Theater keyboardist extraordinaire Jordan Rudess. The seed for this project was planted one evening on the Dixie Dregs 1994 Full Circle tour in Fort Lauderdale, Florida, when a sudden power failure shut down the guitar, bass and violin rigs. For whatever reason, the keyboards remained unaffected. And what followed was a blistering, 10 minute drum/keyboard power-duo jam, which brought down the house. It was that evening\u0092s events, which inspired Rod and Jordan to form their \u0093small in numbers yet mighty in sound\u0094 band. The Rudess Morgenstein Project has played concerts in the US, Costa Rica, Venezuela, Mexico, Germany, Holland and the UK. Additionally, Rod recorded the drum tracks for Jordan's solo cds, ' Rhythm of Time' and 'The Road Home'.\n\nOther on-going projects that Rod is involved with are jam band Jazz Is Dead which features creative improvisations of the music by the Grateful Dead. Members of JID have included T Lavitz, Alphonso Johnson, Jeff Sipe, Billy Cobham, Jeff Pevar, Dave Livolsi, and Jimmy Herring, with an ever-changing line up. Another project is Platypus, whose two recordings feature John Myung (Dream Theater), Ty Tabor (King\u0092s X) and Derek Sherinian (Planet X). The music is a mix of instrumental and vocal tunes that blend many different styles together. An offshoot of Platypus is The Jelly Jam, a power trio featuring Rod, Ty Tabor and John Myung. Their debut release came out in 2001, and The Jelly Jam, '2' was released in 2004\n\nIn addition to his recording and touring credits, Rod is very active in drum education. He is currently a Professor of Percussion at Berklee College of Music in Boston, Mass. Also, his highly recognized instructional materials include videos, audio cassettes and books. His most recent offering is Drum Set Warm-Ups , touted as the definitive text for developing and improving all aspects of drum set playing. Additionally, Rod has been a columnist for Modern Drummer Magazine (U.S.), Rhythm Magazine (UK), Sticks Magazine (Germany) and is an international clinician and involved with product development for Sabian Cymbals (Signature Tri-Top Ride), and Vic Firth Sticks (Signature Sticks and Isolation Headphones), with whom he has been an endorser for many, many years."}, {"url": "http://www.rodmorgenstein.com/product.html", "page_content": "Other Products and Cool Stuff CD Releases on Dregs Records For the first time since its limited release on vinyl in 1975, the Dixie Dregs Great Spectactular album is now available on CD. Recorded when the band members were music students at the University of Miami, each CD is personally signed by Rod, Steve Morse, Andy West and Allen Sloan. For information on how to order this rare Dregs recording, click here. Also released on CD, the Dregs Industry Standard, featuring Steve Howe, Patrick Simmons, Alex Ligertwood and Mark O'Connor, and the Steve Morse Band's Stand Up, featuring Eric Johnson, Peter Frampton, Albert Lee, Mark O'Connor and Alex Ligertwood. For information on how to order these recordings, click here. dB22 and SIH1 Isolation Headphones, Kidphones (KIDP)\n\n----Vic Firth Inc. Being a drummer who suffers from hearing damage (\"This could never happen to ME\"), Rod developed the dB22 and SIH1 Isolation Headphones with the Vic Firth Co. These comfortable full ear-cup phones reduce ambient sound (surrounding noise levels) significantly, allowing for hours of hassle-free jamming. As an added plus, the headphones give the drums a deep, rich, crisp tone. The dB22 is strictly a hearing protector while the SIH1 is a high-quality stereo headset, perfectly suited for studio recording or playing along with your favorite tunes on your stereo or walkman. The difference between the SIH1 and a standard, conventional headset is that you no longer need to blast the music (risking serious damage to your hearing) in order to compete with the sheer volume of your drums. The isolation properties of the SIH1 headphones allow you to hear the music at a pleasant, comfortable volume while playing your drums as dynamically LOUD (or soft) as you desire. In a recording environment, the SIH1 headphones are also a life-saver for engineers, in that they eliminate annoying bleed-thru problems which occur when using a standard, conventional headset. Quite often, the high volume of sound coming from a conventional headset is picked up by virtually every mic in the kit, thus defeating the whole purpose of individually miking each drum for total isolation and control. Kidphones (KIDP) are non-electronic headphones specially sized for children and reduce overall noise levels by 22 decibels From the start, caring for kids' hearing is important! At present, Dave Weckl, Steve Gadd, Kenny Aronoff and a host of others are using the Vic Firth SIH1 isolation headphones. Just remember - hearing loss is PERMANENT. Be kind to your ears! For further information contact: Vic Firth Inc. at www.vicfirth.com Rod Morgenstein Signature Tri-Top Ride\n\n----Sabian Cymbals\n\nRaw bell and perimeter deliver penetrating cut, with lathed bow and edge offering a solid blend of definition and tone. 21\"\n\nFor more information check out www.sabian.com Rod Morgenstein Signature Drum Heads\n\n----Premier Percussion Designed for increased resonance and durability, and tested and re-tested through months of non-stop touring, these coated white heads are thicker than ambassadors for increased strength and lasting power, but thinner than emperors to ensure optimum sustain and projection. Check them out on Winger's Pull, Dixie Dregs Bring 'Em Back Alive and Full Circle, Kip Winger's This Conversation Seems Like A Dream and the recently released Rudess-Morgenstein Project. And hear why drummers like Doane Perry (Jethro Tull) and Nicko McBrain (Iron Maiden) are pounding on these versatile drum heads. For further information contact: Premier Percussion at www.premier-drums.com Rod Morgenstein Signature Drum Sticks\n\n----Vic Firth Inc. This versatile stick was designed for switching back and forth between jazz, fusion and rock formats. The overall size is a cross between a standard 5B and 2B, with a length of 16 1/8\" and a thickness of .610\". The tip achieves maximum cymbal definition and response, while the shoulder is full for high impact playing. For further information contact: Vic Firth Inc. at www.vicfirth.com Rod Morgenstein Midi Drum Sequences\n\n-----BEATBOY Here are some of the great reviews : Power Rock - The power grooves are excellent, especially the flurrious fills tucked into each track - unique material to be sure. Great stuff all around. Rod gets 5 stars ! - Keyboard Magazine\n\nPower Rock is fabulous; not only are the riffs and fills inspirational, it's fun just listening to the sequences. - Craig Anderton, EQ Magazine 1997 Buyer's Guide\n\nProgressive Rock - Some of his lightning blasts in this progressive rock section might make your module smoke. Tom and bass driven monsters (check out Locoline ) , odd time signatures and arm-twisting polyrhythms abound. Rod gets 5 stars! - Keyboard Magazine\n\nProgressive Rock - These are midi drums for the adventurous. -\n\nCraig Anderton, EQ Magazine These are real-time midi drum performances played by Rod in complete song form. Each of the two disks, Power Rock and Progressive Rock contain 20 complete songs, each with intros, verses, choruses, bridges, solo sections and endings. Songs can be used in their entirety or cut and pasted to your heart's content. Since this is midi information, the user has unlimited options for tailoring the drum and cymbal sounds to suit his or her personal and musical taste and needs. The range of grooves and feels on each disk is diverse, giving the songwriter/midi user well in excess of one hour of real time drumming by a real, live drummer. For further information contact: Beatboy at www.beatboy.com"}, {"url": "https://2loud2oldmusic.com/tag/rod-morgenstein/", "page_content": "Kip Winger finally re-releases his solo albums after a time period where they were out of print. The big difference this time is he has released them only in a box set simply called the Solo Box Set Collection. The set includes 5 CD including his 4 solo album as well as a bonus CD of bonus tracks from all the Japanese editions of his albums and one new song.\n\nBefore Kip started with his solo albums, you would know he was in the band Winger, obviously. Winger’s last studio album prior to the solo albums was 1993’s ‘Pull’ (and one of my favorite Winger albums). After this album, the band sort of dissolved and wasn’t doing anything anymore. Then in 1996 Kip started his solo career. That solo career produced 3 studio albums, 1 acoustic album and now some Classical pieces that he did not include in this set.\n\nBefore we get into the music, let’s talk about the set itself. It comes in a very sturdy box that was nice and thick, well made and should last a long time. The one thing you notice is the sad figure on the cover. I am sure it is some famous painting or something, but I do not know who it is or what the story is with the picture. Another thing you notice is Kip’s name. He now puts C.F. Kip Winger as his name. He has been doing that with his Classical pieces he has written and now it is spilling over into his other solo work. The C.F. are his initials for his name Charles Frederick Kip Winger. Maybe “Kip” didn’t sound professional enough for the classical music scene.\n\nContinue reading “C.F. Kip Winger – Solo Box Set Collection – Album Review” →"}, {"url": "http://www.rodmorgenstein.com/news.html", "page_content": "News 5-10-2023 Hey Everybody,\n\nAfter years of noodling with the idea of creating specialty tools for drummers, to help with the handful of pesky issues all drummers face at one time or another, the first tool - Wing Thing - has finally come to fruition. Please check it out at morgensteintool.com\n\nThanks.\n\nSee you on the road!\n\nRod 10-8-2020 Hey Everybody, Sadly, my mom, Helen, passed away this past Wednesday. I don’t think a more positive, ‘life is beautiful’ human being has ever graced this planet of ours. She truly was 'salt of the earth'. Along with my dad, Mel, her soulmate for 84 years, my mom lived a truly happy, content, and fulfilling life. Making it to the tender young age of 97 is a gift unto itself. Clearly, I got my musical abilities from her, as my dad was a clap-on-beats 1 and 3 kind of guy, but she was, instinctively, a backbeat girl, feeling the groove on where it’s supposed to be experienced - beats 2 and 4! This has been a trying year, having experienced so much loss. But, in the end, folks like my mom have instilled in me the belief that there is always a bright side of life to not only dwell on, but to embrace wholeheartedly. 7-13-2020 Hey Everybody,Rod here. After 45 years of amassing an enormous collection of drum sets, snare drums, cymbals, percussion, Winger clothing (from the good ole days), tour laminates, itineraries, posters and awards, drumheads, drumsticks, assorted hardware, and other mementos, I have decided to part with a tremendous amount of these items. Three of the major items I am parting with are drum sets from– The Dixie Dregs, ‘Bring ‘Em Back Alive’, live recording (from The Center Stage in Atlanta, GA in early ’92) and tour, including an appearance on The Tonight Show with Jay Leno in December 1992 The 2002 ‘Hollyweird Summer Tour’ featuring Poison, Cinderella, Winger and Faster Pussycat, plus a Winger tour that followed in the fall of ‘02 The drum set used on several Dixie Dregs tours from the late ‘90’s through 2007\n\nRod It has been an amazing trip down memory lane sorting through hundreds of possessions, each one triggering a smile, a story, or an unforgettable memory I will cherish forever. If you are interested in checking out some of these items, you can contact my friend and fellow drummer, Ed Tucker, at Studio 3T studio3t@icloud.com Or join Ed’s Facebook group: Vintage Drum Collectors & Players. Type in “Rod Mo” in the question to join the group.It’s gonna take awhile before each and every item is listed, so make sure to check in over the coming weeks to see what new things have been added.Thanks for all the great years. It has been, and continues to be, an incredible ride.Rock On!Rod 6-6-2020\n\n\n\nI was shocked and saddened this week to learn that my friend and Dixie Dregs drum tech and monitor ace, Skoots Lyndon, passed away. Skoots was the consummate band mate, always seeking perfection in everything he did. He was an extremely kind and generous human being, periodically checking in on me to see how my parents are doing and how life, in general is faring. He also happened to be one of the best storytellers who ever graced our planet. His years of touring the globe with Deep Purple, Dixie Dregs, Steve Morse Band, and numerous other acts, created a vast library of colorful stories; truly amazing stories that only a wordsmith like Skoots could impart to an audience lucky enough to be in his presence. My memory is filled with moments like these, where I would be hanging on every word, completely engrossed, often in stitches, for hours on end. RIP Skoots. Your memory will live on in the hearts of all of us who were so fortunate to have you in our live 4-26-2020 WINGER - Better Days Comin' - All-Star\n\n4-12-2020 ‘Hi, this is Mel, how can I help you?’ For years, these were the first words my dad would speak upon answering the phone. I think this phrase pretty much sums up the kind of person he was; always wanting to lend a helping hand in any way he could. My dad passed away yesterday and, almost immediately, the memories of an extraordinary life began flooding my brain. He was a professor by trade, having taught at a handful of colleges and universities in New York, including Columbia University. He would often comment that he never felt like he worked a day in his life, as his love of teaching and being among young, talented, motivated students inspired him to no end. At the age of 10, watching The Beatles on The Ed Sullivan Show along with my parents and sister, Carol, I knew then and there what I wanted to be when I grew up. From that day on, and continuing to this day, my parents have been my most ardent supporters, having attended nearly every single New York area concert I have played since 1976, be it with Winger, Dixie Dregs, Steve Morse Band, Rudess Morgenstein Project, The Jelly Jam, Jazz Is Dead, drum clinics and festivals, you name it. The last show they attended was the Dixie Dregs reunion concert at The Paramount Theater in Huntington, NY on March 15, 2018. After a recent hospital stay, an attendant came into the room with the wheelchair to escort my dad out of the building. I introduced myself to him, and he immediately reminded me that he knew who I was, having helped me a few years ago when I was being treated in the hospital’s ER for kidney stones. He also told me he was a guitarist, a major Dixie Dregs fan, and had seen the Dregs every single time we have played on Long Island since the ‘70’s. I then introduced him to my dad, to which he replied, ‘What, are you kidding, I know your dad, and I also know your mom. Every Dixie Dregs fan on Long Island knows them. They’re just as famous as the band members, because every Dregs fan who has come to your shows these past 40+ years sees your parents every single time. He then proceeded to tell me exactly where they were sitting at The Paramount Theater concert two years ago! My dad has been an inspiration to me, and many of my friends, for a lifetime. In fact, quite a few of my friends have told me that he has been a role model, playing a major part in how they try to live their lives. I am forever grateful to have had him in my life. The floodgates have opened, and the countless, beautiful memories of this amazingly special man, my dad, are everywhere I look… 1-10-20 Neil Peart was a Renaissance man. Most of us know him as the iconic drummer and lyricist of Rush. But beyond his exceptional talents in the world of music, Neil’s zest for life, thirst for knowledge, and quest for adventure led him down many divergent paths. I had the honor and pleasure of meeting Neil in 1985, when The Steve Morse Band toured with Rush as their opening act on the band’s Power Windows Tour. Most touring musicians will attest to the absolute joy and excitement of bringing their music to audiences around the globe. Most of these same musicians will also agree on the physical and emotional toll that endless touring can take on a human being. That said, a typical show day often consists of travel, sound checks, meet and greets, interviews, the performance, followed by more meet and greets. Well, as if this is not enough, a typical show day for Neil Peart on Rush’s ‘85/’86 ‘Power Windows Tour’ would usually begin in the wee hours of morning, as Neil would journey on his bicycle from the previous city (assuming said previous city was within 150 miles of the next gig). Neil would often be on his bike for hours, arriving in time for Rush’s sound check. Directly after sound check, he would have dinner, which was immediately followed by a one-hour conversational French language lesson with a local French-speaking tutor. Upon completing his French lesson, Neil would proceed to a private practice room and warm-up on a small drum kit prior to the band’s two-hour concert. After the concert, Neil would usually hang for a short time before excusing himself to go to the band’s tour bus, to work on one of his future literary creations. Sometime during this same time period, when he had some time off from touring, Neil flew to China, where he met up with a handful of bicycling enthusiasts for a 3-week journey through remote parts of the country. With pad and pen in hand (at the time, Neil felt that a camera interfered with the creative process) he would jot down highlights of the day’s experiences, which eventually culminated in one of his first literary works entitled, ‘Riding The Golden Lion’. In addition to the writing portion of this 39-page journal/book, Neil was involved in every step of the process in putting the book together, including choosing the cover art, font, page color and thickness, etc. I believe it was the first outing in what would become a passion of his, eventually authoring several critically acclaimed books. On the very last day off of The Steve Morse Band’s final leg of the Rush Power Windows Tour Neil, Alex, and Geddy took our band to an exotic restaurant for a memorable band dinner. Sitting cross-legged on pillows on the floor, in our very own private room, sans silverware, we dined on an incredible feast of delicacies using only our fingers. Alex, a wine expert and connoisseur, made sure the nectar of the Gods was flowing. So, there I am sitting next to Neil, chit-chatting while trying to think of something interesting and stimulating to say to this sophisticated, worldly, well-traveled man. Neil beat me to the punch, turning to me and posing the question, ‘So Rod, have you ever considered the effects of climate on the development of Western Civilization?’\n\nThat, in a nutshell, sums up the ever-inquisitive Neil Peart, always seeking knowledge and new experiences, never happy with the status quo. He is the textbook definition of ‘Carpe Diem’, seizing every moment of life to engage in something of importance, be it music, reading, writing, philosophizing, bicycling, motorcycling, sailing, cross-country skiing, trekking through foreign lands, climbing the highest peaks, and devoting himself to family. He is a truly inspiring human being, whose breath of humanity has touched millions around the world. I am forever grateful to have known this unique and special man. RIP Neil. 11/2/19 Hey Everybody, I am part of a very cool project, called The Road Crew, with Billy Sheehan on bass and some very talented musicians from my area. We are performing our first, and at the moment our only, concert on Long Island on December 18. Also on the bill will be Zebra guitarist/vocalist Randy Jackson. The Road Crew came about as a result of the tragic loss of a young child, who was run down in his front yard by someone who was texting while driving. This innocent, precious child, Rocco Cangemi, is the inspiration for his father, Joe Cangemi, putting The Road Crew together. Hope to see you there. 9/10/19\n\nDetroit Drummers Day featuring Rod\n\nSunday 9/15 @ The Token Lounge · Westland, Michigan 7/25/17 The Dixie Dregs' Original Lineup Will Reunite and Tour in 2018 The Dixie Dregs' Original Lineup Will Reunite and Tour in 2018 The original lineup of instrumental masters the Dixie Dregs will be hitting the road in 2018. Rod Morgenstein, Andy West, Allen Sloan, Steve Davidowski and Steve Morse—the same Dregs lineup behind 1977’s Free Fall—have officially reunited, as they announced yesterday via a very brief press release. The band’s website adds a few more details: “Hello, everyone! We are starting back at the beginning—with the band as it was in 1975 when we were touring the South and trying to get a record deal. Together we recorded our first commercially produced album, Free Fall. We are reincarnating the band and will announce 2018 tour dates soon. Welcome to the return of the Dixie Dregs!” Actually, there are already two 2018 dates on the band’s official site, and you can check them out here. Stay tuned for more details, folks. For more information, visit dixiedregs.com and follow along on Facebook. 7/20/17 - The Jelly Jam tour dates THE JELLY JAM\n\n8/11 Hartford, CT Infinity Hall\n\n8/12 New Hope, PA HAVANA\n\n8/13 Worcester, MA The Cove Music Hall\n\n8/18 Toronto, Canada The Rockpile\n\n8/19 Westland, MI The Token Lounge 11/8/16 'Rod Morgenstein of Winger, Dixie Dregs, The Jelly Jam, Rudess Morgenstein Project and Jazz Is Dead, has just been nominated in the Hall of Fame section of the 2017 Modern Drummer Magazine Readers Poll. If you would like to vote, just go to the following address\n\nThe address to vote is http://www.moderndrummer.com/modern-drummer-readers-poll-2017\n\n6/6/16 drumming interview w/Joe Bosso https://www.facebook.com/MusicAficionadoApp/posts/1126834377358421\n\n4/18/16 The Jelly Jam – featuring rock heavyweights John Myung (Dream Theater), Rod Morgenstein (Dixie Dregs, Winger) and Ty Tabor (King’s X) – release new album ‘Profit’ on May 27th. The Jelly Jam will release their epic new album Profit on 27th May 2016 via Music Theories Recordings/Mascot Label Group (Flying Colors, Gov’t Mule, Teramaze, Crippled Black Phoenix, Black Stone Cherry, Joe Bonamassa). The Jelly Jam featuring DREAM THEATER’s John Myung, WINGER’s Rod Morgenstein, and KING’S X Ty Tabor, will return in 2016 with a new album and their first ever world tour. Click here for more info Check out the Jelly Jam Channel on You Tube https://www.youtube.com/user/shallwedescend 11/28/15 - update from Rod 'Hey Everybody, please check out this promo clip of the new Jazz Is Dead cd, which was 12 years in the making. It's one of my favorite recordings and features a host of guest artists. Thanks, Rod'\n\nhttps://www.youtube.com/watch?v=K0ey99o5nT0&feature=youtu.be\n\n\n\nFor info on purchasing the cd, go to http://pevar.com/music/jazzisdead-gratefuljazz/ Hey Everybody, My drumming pal, April Samuels, is a breast cancer survivor who started an amazing foundation, Breast Cancer Can Stick It! In her own words, ‘we raise awareness and funds for a cure by orchestrating energetic, unique, music-minded events that ROCK to ultimately STICK IT to breast cancer’. On October 25, April’s foundation will be hosting a DRUMMATHON featuring Carmine and Vinnie Appice, and Matt Starr. It will, no doubt, be a day filled with a multitude of exciting drumming events. Please check out the website below for info on this important event. www.breastcancercanstickit.org/drummathon/ Thanks, Rod 6/1/13 - update from Rod I just performed at the Bonzo Bash in NYC (5/30) and Long Island (5/31) honoring\n\nwhat would have been John Bonham's 65th birthday. Over 20 drummers performed\n\nwith The Moby Dicks, an incredible Led Zeppelin cover band. It was one of those\n\nspecial moments that reminds you why you became a musician in the first place.\n\nAll these fantastic musicians gathered on one stage, paying their mutual respect\n\nfor a drummer and band that changed the world by playing their hearts out. I\n\nfelt so honored to be a part of it. 12/29/12 - update from Rod Hey Everybody, I just did a 10 Essential Drum Albums Interview with Joe Bosso for Music Radar Magazine,\n\ncheck it out here!\n\n\n\nAlso, I'll be playing with Jordan at the Korg booth at the NAMM Show in Anaheim, CA on Fri/Sat January 25/26 at 2:30pm. We're going to be doing the 23 minute version of Tarkus on Jordan's The Road Home cd! 4/22/12 - update from Rod Hey Everybody,\n\n\n\nI recently donated several autographed items, including my Sabian\n\nSignature ride cymbal, China cymbal, crash cymbal, splash cymbal, Vic Firth isolation headphones and a pair of my signature sticks to be auctioned off on e-bay May 1st to help raise money for DIRECT, a Tucson, AZ non-profit organization. This independent living center offers a variety of services to people with disabilities who want to become more self-sufficient. For info on this auction contact: Ron at 520.760.3043 or email him at troz57@msn.com 11/11 - update from Rod Hey Everybody,\n\nNovember 28 is the release date of The Jelly Jam's brand new cd, 'Shall We Descend'. You can check out the first single. 'Who's Comin'Now', at TheJellyJam.com. And you can order the cd at MolkenMusic.com Happy Thanksgiving. Rod 7/25/11 - update from Rod Hey Everybody, I will be doing a live video chat this Thursday July 28 at 4pm for my\n\nnew on-line Rock Drums course offered through Berklee Media.\n\nThis course features hours of video instruction, hundreds of audio\n\nclips and transcribed music examples, plus a boatload of very cool\n\nplay-a-long tracks.\n\nHope to see you there. Drum On.\n\nRod https://www.berkleemusic.com/openhouse-signup/?pid=3876 4/16/11 - update from Rod Hey Everybody, I have spent the past year developing an on-line course in Rock Drumming for Berklee Music, the media wing of Berklee College of Music. This 12 week course is available for college credit or non- credit and is an all-encompassing program incorporating hours of video instruction, hundreds of drumming audio examples and transcriptions, and multiple play-a-long tacks covering a vast number of rock drumming styles. As the teacher of this interactive course, I meet with students each week for a class chat, as well as give input on their weekly performance projects. I have had a blast putting this course together, drawing from nearly 40 years as a recording and touring musician. For more info check out the website below. Hope to see you in class! Rod www.berkleemusic.com/school/course? course_item_id=21848140&program=new_online_music_courses\n\n6/4/10 - update from Rod Hey Everybody,\n\n\n\nSonic Reality has released Epik Drums, a deluxe collection of drumkit and groove instruments created with legendary producer Ken Scott. Ken produced 2 Dixie Dregs records- 'What If' and 'Night of the Living Dregs', and has engineered and produced a who's who list of artists including the Beatles, David Bowie, Supertramp, and the Mahavishnu Orchestra. This package is packed with hours of drumming by me, Billy Cobham, Bob Siebenberg, Woody Woodmansey, and Terry Bozzio. Check it out at www.sonicreality.com\n\n\n\nWinger will be touring throughout the summer in support of our new cd, 'Karma', which was released in the fall of 2009. For tour dates check my 'In Concert' page. You can also get more info on the band at www.myspace.com/wingertheband and www.wingertheband.com\n\n\n\nThe Jelly Jam are up and running again, having recently cut basic tracks for Jelly Jam 3. Ty Tabor (guitarist with King's X) hopes to finish up the recording this fall. Look for its release by year's end or early 2011. We are also looking into the possibility of doing some live shows. Stay posted.\n\n\n\nFinished my 13th year of teaching at Berklee this past May. The talent just keeps getting better and better! There is a 5 minute drum lesson on this month's home page @ www.musicradar.com plus another lesson from last month.\n\n\n\n3 part interview on www.vicfirth.com\n\n\n\nC oming soon! Lessons at www.evansdrumheads.com\n\n\n\nOct/Nov: New WInger cd on Frontiers Records and Europe Tour dates to be announced soon. October '09 release from Sonic Reality--The recreation of drum sounds from classic albums recorded by producer Ken Scott and 5 legendary drummers: Rod Morgenstein (Dixie Dregs), Terry Bozzio (Missing Persons), Woody Woodmansey (David Bowie’s Spiders from Mars), Bill Cobham (Mahavishnu Orchestra) and Bob Siebenberg (Supertramp). 5/22/09 - update from Rod Hey Everybody,\n\n\n\nWinger is in the studio recording our 5th studio cd for Frontiers Records. It will be released fall '09 with touring to follow. The vibe this time around is in-your-face, good old slammin' rock 'n roll.\n\n\n\nJazz Is Dead is still in the mixing stages of the band's first studio recording. Hopefully, it will be completed and released by the end of the year or early 2010.\n\n\n\nSoon to be released from Sonic Reality is The Ken Scott Collection, a series of drum loops by 5 of the drummers Ken Scott has worked with including myself, Billy Cobham, Terry Bozzio, Woody Woodmansey, and Bob Siegerman. Ken's discography reads like a who's who of the recording industry, having been head engineer on the Beatle's White Album, and engineer/producer of such artists as David Bowie, Supertramp, Dixie Dregs and Mahavishnu Orchestra. Further info on this collection can be found at www.sonicreality.com/kenscottcollection.php\n\n\n\nI recently completed my 12th year at Berklee College of Music. The musical talent just seems to be getting better and better every year!!!\n\n\n\nHave a great summer.......... 7/1/08 - update from Rod Hey Everybody,\n\n\n\nIt's been a while........\n\n\n\nRecently, I was in California recording with legendary producer Ken Scott as part of a massive drum library project for Sonic Reality. Ken chose 6 drummers he has worked with including Terry Bozzio, Billy Cobham, Woody Woodmansey (David Bowie), Bob Seibenberg (Supertramp), and Nigel Olson (Elton John). Ken engineered and produced two classic Dixie Dregs records, 'What If' and 'Night of the Living Dregs'. His bio reads like a Who's Who of the record biz--The Beatles, Mahavishnu Orchestra, Missing Persons, David Bowie, Supertramp, Elton John, and Stanley Clarke to name a few. The drum library collection, which focuses on recreating the analog drum sounds from the 70's, will also feature a book on Ken's life and his ground-breaking engineering and recording techniques. The release date is scheduled for early 2009.\n\n\n\nJazz Is Dead guitarist, Jeff Pevar, is in the studio mixing the new Jazz Is Dead cd, finally! This recording will be, believe it or not, the first studio cd in the band's history. Look for the release in the latter part of this year or early 2009.\n\n\n\nWinger toured the US this past Feb/March, and is looking into touring South America this fall. Concert dates will be posted once they are confirmed. ALthough Winger has toured in nearly 25 countries, this will be the band's first tour in SA.\n\n\n\nRudess Morgenstein Project will play in Poland this October as part of the Percussion Festival in Opole, Poland. In addition to each of us performing a clinic, we will play several concerts. Info will be posted when the dates are officially set.\n\n\n\nI have been recording a cd with a phenomenal pianist by the name of Rob Apostle. Rob's music is an incredible blend of classical, jazz, and fusion music. Deceptively simple, this music will touch both musician and non-musician on a very deep and emotional level. No release date is set yet as it is in its early stages. I'll keep you posted as the project nears completion.\n\n\n\nMid-May completed my 11th year teaching at Berklee College of Music. What began in September 1997, filling in for a teacher who went off on a year's Sabbatical leave, has blossomed into an integral and very rewarding part of my professional music career. Also, midway through the semester I became a full professor. I wish to thank my incredible students for always continuing to inspire me.\n\n\n\nHave a COOL, wonderful summer............ 12/9/07 - update from Rod Japan and Australia were amazing! It's been way too long since WINGER played in Japan. The last time were toured there was for the PULL tour in '93. Sold out shows in Tokyo and Yokohama and awesome crowds in Osaka and Nagoya brought back so many great memories of touring in the good ole days! The trip to Australia was our first and I'm sure we'll be back, as the crowds were really enthusiastic there, too. We had a blast touring with Ratt for the 2 weeks, and got to hang out a bunch with those guys. All I can say is it was a TON OF FUN!!!\n\n\n\nWINGER 'LIVE' was just released on Frontiers Records and is available in both dvd and cd. The concert was filmed at the Galaxy Theater in Anaheim, CA in March '07 and the reviews have been fantastic.\n\n\n\nMONSTER BALLADS XMAS was just released on Razor and Tie Records. 15 rock/metal artists each contributed a tune. WINGER did a cool version of John Lennon's Happy Christmas (War Is Over). Other bands include Queensryche, Dokken, Skid Row, Twisted Sister, Danger Danger, and Firehouse.\n\n\n\nWINGER will be touring the US in Feb/Mar '08. Tour dates will be posted shortly. Hope to see ya'll there!\n\n\n\nI wish you all a Merry Christmas, Happy Chanukah, and every other holiday which occurs this time of year. See you on tour next year!!!\n\n10/5/07 - update from Rod Hey All, Look for the new Winger 'Live' dvd/cd coming out in November. It was flimed this past March at the Galaxy Theater in Anaheim, CA, and is Winger's first live recording ever! Remember 'Monster Ballads', the cd which featured ballads from all the metal bands from the good ole days? Well, here comes 'Monster Ballads Xmas' this November, featuring Christmas songs by lots of the same bands. Winger covers the John Lennon song, 'Happy Christmas (War Is Over). Also in November, Winger is touring in Japan and Australia with Ratt. It will be our first time back to Japan since the Pull tour in '93. And it will be our very first trip to Australia. My last\n\ntime in the 'land down under' was in '94 for a drum clinic tour which took me to both Australia and New Zealand. What a magnificent part of the world! The Dixie Dregs are in the process of setting up gigs for the new year. As soon as dates are confirmed they will go\n\nup on my 'In Concert' page. Jazz Is Dead is still in the mixing stages of our first stdio cd. No release date yet, but I'll keep you posted. 9/7/07 - update from Rod Hey Everybody,\n\n\n\nThe Berklee fall semester is just around the corner, and so next Monday I'll be off and running to Boston to meet this year's crop of amazing students. This semester begins my 11th year teaching at the college.\n\n\n\nWinger played a handful of gigs this summer, the most memorable being The Rocklahoma fest in Pryor, Oklahoma, a 3 day non-stop 70's/80's trip down memory lane with the likes of Skid Row, Ratt, Twisted Sister, Warrant, Dokken, Vince Neil, Poison, Firehouse, Quiet Riot, Enuff's Enuff, Queensryche and a ton of other bands. It was very cool catching up with musicians I haven't seen in years. We were told in excess of 60,000 tix were sold for the event. We're playing in Las Vegas in October and then touring with Ratt in Japan and Australia in November. Check my 'In Concert' page in the next couple of weeks for details.\n\n\n\nJazz Is Dead played a one-off at Berklee back in July. It's always a blast walking out on stage and jamming to songs you haven't played in a long time. Being on the edge of your seat as a musician stirs the creative side of things in really interesting ways. Our new cd is being mixed at the moment and should be released later this year.\n\n\n\nI played drums on Jordan Rudess' very cool new cd, 'The Road Home', which will be released September 12 on Magna Carta Records. This one's a 'cover' album, with Jordan paying homage to the bands which influenced him as an aspiring musician. Included are songs by Yes, Emerson Lake and Palmer, Gentle Giant, and Genesis. As is always the case when I work with Jordan, this was a very challenging recording! Rudess Morgenstein Project headlined CalProg in Whittier, CA back in May. When time permits, Jordan and I will try to get back to finishing up the next Rudess Morgenstein Project cd which we've been working on for the past couple of years.\n\n\n\nSee ya..................... 4/20/07 - update from Rod Life has been a whirlwind since the new year began. First, the Dixie Dregs toured out west in January. While in southern\n\nCalifornia, I raced to the NAMM show in Anaheim during the day to play with Jordan Rudess at the Roland booth. For those performances I played on Roland's V-Drums, an amazing electronic drumset which I have future plans of incorporating them into my acoustic Premier kit. From the NAMM show I had to race to another town to play with the Dregs that evening. Nothing like multiple gigs in one day! On a sad note, the Dixie Dregs tour was cut short when sudden news arrived of Steve Morse's dad falling into a coma. Steve raced back to his home in Florida to be by his dad's side, who sadly passed away later that day. Steve's and my friendship goes back many years. I knew his dad, a brilliant man who will be missed by all whose lives he touched. February 1 was the start of a 5+ week Winger tour in support of the new Winger 4 cd. Crowds were considerably larger than anyone anticipated and we all had an amazing time together. There will be some summer touring, so just check my 'In Concert' page periodically. The Rudess Morgenstein Project headlined Baja Prog '07 in Mexicali, Mexico this past March. 1300 seats were filled to capacity each of 4 nights at this amazing festival. Bands and aficionados of progressive rock music come from all over the world for this event. From there Jordan and I travelled to Frankfurt, Germany to play at the Music Messe for Roland. And then we played a concert in London, also for Roland, and once again on the V Drums. In a few weeks Jordan and I will headline CalProg '07, a prog festival in Whittier, California. Also, around this time, I'll be recording with Jordan for his new solo record which will be out later this year. And we're hoping that, time permitting, we can make more headway on the next Rudess Morgenstein Project cd. The new Jazz Is Dead cd is at the mixing stages and will be completed in the next couple of months. I have heard the rough mixes and this is by far the coolest JID recording since the band's inception. Three weeks left to the Berklee semester. it's been a crazy semester with all my touring. But I tip my hat to my students, who waited patiently until I got back to town. And I've been spending extra days making up for the days I missed earlier in the semester. I truly have some incredible drummers this year. I'm certain I will see them out there doing it Big Time in the coming years! See ya......... 1/8/07 - update from Rod Hey Everybody, Happy New Year. WInger played New Years Eve in Pittsburgh, PA....... OUTDOORS in the pouring rain to a couple thousand diehard fans! We were all soaking wet, and I mean completely drenched. All in all it was a ton of fun. Feb 1 Winger begins a 5 week US tour which will take us all around the country. We'll be mixing it up with stuff from the new cd, Winger 4, and of course, all the tunes from the good ole days. The Dixie Dregs begin touring next week out west which will take us through Colorado, Utah, California, and Arizona. While in southern CA, I'll be racing to the NAMM show to jam with Jordan Rudess at the Roland booth.\n\n\n\nAll concert info can be found on my 'In Concert' page. Immediatley following the Dregs tour I will fly directly to Boston to begin the spring '07 semester at Berklee College of Music. I always look forward to meeting a new crop of talented, eager students. 9/19/06 - update from Rod Lots going on since we last 'chatted'. The first new Winger cd in 13 years , Winger IV, is slated for release October 20 in Europe on Frontiers Records, Japan on King Records, with a US release to follow shortly thereafter on Shrapnel Records. The recording is a natural progression from 'Pull', which came out in '93. Kip produced the recording, which sounds HUGE! The band will tour Europe in October in support of the cd. Concert info can be found on my 'In Concert' page. Audio clips can be heard at www.myspace.com/kipwingermusic Also, we're setting up a winger myspace page which should be up soon... The Rudess Morgenstein Project played in Caracas, Venezuela and San Jose, Costa Rica back in May. Jordan and I had a blast doing these shows, as they were our first gigs south of the border. The energy of the fans was unbelievable! In Venezuela, we played with Angra, a fantastic band from Brazil, and we spent a good bit of time hanging with them. In Costa Rica, we were the only band on the bill, and so our show was much longer than anything we've done in the past. We did a fair amount of jamming, which inspired us to take that approach on some of the new RPM cd, which is moving along nicely. We will be playing the Baja Progfest in Mexico in March, and are talking to other south American promoters about doing shows in some other countries. Jordan is also working on his next solo cd. I will cut drum tracks for some of this recording sometime before the end of the year. The Dixie Dregs will be touring the west coast in January. Look for tour dates on the 'In Concert' page in the next few weeks. Jazz Is Dead is in the mixing stages of a new cd. Even though it will be the band's fourth release, it actually will be our very first studio recording. All the other cds were live recordings. The Berklee fall semester began last week. After a year of living the life of nomads without 'homes', due to problems with the basement area of the building we taught in, the percussion faculty are quite comfortable in our brand new, sound proofed, incredible facility. Should be a great semester. 9/16/06 - from Rod It has been quite some time since I have posted updates on my site. For those of you who may not be aware, my wife, Michele, passed away this past December. Michele was a warrior's warrior during a 22 year journey battling breast cancer. The vast majority of people in our life knew little or nothing of her condition. She chose to keep it a quiet affair so she would not have it be front and center in every aspect of her daily life. It allowed her to lead a relatively normal life and not be known as 'Michele with breast cancer'. As painfully difficult as living with cancer can be at times, our life together was nothing short of perfection. We learned to smell the roses years ago. There are no regrets, as we told each other how deeply we loved each other virtually every day of our lives. Michele was my childhood sweetheart, the love of my life, my best friend, my soul mate. I miss her more than anyone can imagine. Thank you to everyone for your e-mails, letters and phone calls which have offered me some level of comfort during this very difficult time. I wish you all happiness and good health. Rod\n\n5/2/05 - Update from Rod The east coast Dixie Dregs tour was awesome, covering 18 cities in 19 days. Travelling highlights included driving through a surprise spring blizzard with virtually NO visiability in the middle of the night after jamming in Cleveland! Ah, the exciting life of a touring musician. Progress continues on the new Jazz Is Dead cd. Luis Conte has added amazing percussion to several tracks and we're hoping to get a few more folks to play on this one. Winger is still looking into a fall tour to record a live dvd and possible\n\nstudio cd. I'm getting ready to do some recording with Marc Muller who has been playing pedal steel and guitar with Shania Twain for the last 10 years. We're also involved in co-writing songs. The Berklee spring semester comes to a close this week and, as always, I've had a great bunch of students who never cease to amaze me.\n\n1/29/05 - Update from Rod Just got home from the Dixie Dregs/Steve Morse Band west coast tour. As always, it was a lot of fun jamming with my band mates of many years. Steve Morse band drummer Van Romaine and I worked out a two-man drum solo (guess you call that a drum duo)which was really a blast to perform. Looks like we'll be doing an east coast run in mid-March, from Florida all the way up through Chicago, so check my concert calendar in a couple of weeks for tour dates. Winger is discussing the possibility of a live dvd which would involve a week or two of concerts, possibly in May or June. Stay posted for details. The Berklee College of Music spring semester has begun and, as always, I have a wonderful group of students. 9/25/04 - Update from Rod Hey Everybody,\n\nWell, believe it or not, after nearly 3 years since we first began work on it, The Jelly Jam 2 was just released. We are really beginning to sound like a band! Now we're looking at all of our schedules to see if we can do some live 'Jelly Jamming' in the next few months. I'll keep you posted. If you can't find Jelly Jam 2 in a cd shop, you can go to InsideOutMusic.com to read all about it and get purchase info. Jordan Rudess' new cd, 'Rhythm of Time', was released recently on Magna Carta Records. Like I had said a while back this recording was, without a doubt, one of the most challenging and rewarding recordings of my career. The Dixie Dregs will be gearing up for a west coast tour in January. Tour dates will be available on my concert calendar in the next several weeks. We're already 4 weeks into the 2004 fall semester at Berklee College of Music and, as always, I have a great bunch of students. This time around there seem to be several who are into many of the classic rock and fusion bands and drummers, which is totally fine by me. It's right up my alley. Hope you all have an enjoyable fall season....... 7/23/04 - Update from Rod\n\n\n\nHi Everybody,\n\n\n\nThe Rudess Morgenstein Project will be performing at the Berklee Performance Center at BerkleeCollege of Music in Boston on Thursday, August 5 at 8:15 PM. We will be playing classic RPM tunes as well as music from Jordan's soon-to-be released solo cd, 'Rhythm of Time'. Ty Tabor has completed mixing The Jelly Jam 2 and it is now in the hands of Inside Out Records. I'll keep you all posted regarding the release date. Kip Winger is putting some finishing touches on the recording I did with him and Turkish producer/guitarist Cenk Eroglu earlier this year, and getting ready to shop it for a deal. The recording with T Lavitz and Jeff Pevar was incredible. The jam band concept is one of the most rewarding experiences I've had in my 30+ years as a musician. We need to record a couple more tracks to have a full length cd, so we'll probably get together in the fall to complete it. I'm in the midst of Berklee's 5 week summer program and having a blast with my roughly 75 students. It's amazing how many talented young musicians there are out there! 4/17/04 - Update from Rod Hi Everybody, Kip is on his way to Istanbul, Turkey to finish recording and mix several tunes on his current project with Cenk Eroglu. Talk about a fresh, new killer sound, this is it!\n\n\n\nI just got back from Illinois for a week of recording with\n\nguitarist/keyboardist Brian Moritz and his band Balance. Dave LaRue (Dixie Dregs) played bass, with Joel Kaplan on keyboards and Vince Claps on vocals. With the exception of Dave and I, all these guys have been very active in the Chicago music scene for many years. The recording was engineered by Brian Mitchell, who lives a double life as a forensic pathologist! All in all, it was quite an experience. I'll update you as the recording progresses.\n\n\n\nI'm on my way to meet up with T Lavitz and Jeff Pevar in\n\nHartford, CT to record for several days on both Jeff's solo cd and some jam band oriented stuff.\n\n\n\nAs soon as I return from CT, I'll be getting together with Jordan Rudess to pick up where he and I left off with the next Rudess Morgenstein Project cd. We're looking into the possibility of playing some gigs later this year.\n\n\n\nThe release of Jordan's solo cd, 'Rhythm of Time', is August 31 on Magna Carta Records.\n\n\n\nWell, yet another Berklee school year has come to a close. I guarantee that somewhere in the future you will see some of these students realizing their musical dreams!\n\n\n\nHave a HOT summer.................... 3/19/04 - Update from Rod Hi Everybody, I just spent the last several days in Nashville recording with Kip Winger. Over the past year, Kip has been making trips to Istanbul, Turkey where he has been writing and recording with Turkish artist/guitarist/producer Cenk Eroglu. The music is an incredible blend of east-meets-west sounds and rhythms, both traditional and high-tech. Kip and Cenk hope to finish it up in the next several months. I'll keep you posted. We're talking about the possibility of recording Winger Live In Concert along with a bunch of archival/ interview footage. Jordan Rudess' solo cd, 'Rhythm of Time', is set for release in July on Magna Carta Records. What an incredibly challenging and rewarding experience it always is, working with my friend Jordan. Among the guest artists appearing on the recording are Joe Satriani, Steve Morse, Dave LaRue, Vinnie Moore and Greg Howe. Modern Drummer presents 'Drum Nation' was released in mid-January and includes drum performances by 14 drummers. Jordan Rudess played keys on my track 'Faceless Pastiche'. Other members of the cast include Steve Smith, Simon Phillips, Bill Bruford, Trilok Gurtu and Chad Wackerman, to name but a\n\nfew. I recorded a couple of tracks with Jeff Pevar on a solo recording he's working on. I met Jeff when he joined Jazz Is Dead in 2001. He is one of the most well-rounded, musical guitarists around. I recently went to see him perform with CPR, the band he has with David Crosby (of Crosby, Stills, Nash and Young fame.) Jeff is the 'P' in CPR. A highlight of the evening for me was meeting David Crosby and having HIM say all these great things about the Dixie Dregs. I felt like a million bucks! Jelly Jam 2's completion is just around the corner, I promise........ Another snow has fallen, with more expected tonight. It sure has been a\n\nLOOOOOOONG Winter. 11/09/03 - Update from Rod Jordan Rudess is in the studio working on his next solo recording for Magna Carta. We're planning on doing drum tracks before the end of the year. January 13 is the Magna Carta release date for 'Modern Drummer Presents: Drum Nation Volume 1', an all-out drummers' cd featuring quite an interesting cast of players. Each participating drummer contributed one track; Jordan Rudess plays keyboards on my tune 'Faceless Pastiche'. Additional info about the cd can be found at Magna Carta'a website. I know it sounds like a broken record but Ty Tabor is planning on mixing The Jelly Jam's next cd before the end of this year, as soon as he gets off the current King's X tour. It seems like only yesterday that the semester began but the Berklee College of Music fall semester is already entering its 10th week. I have some very fine students this year and am sure to hear about them in years to come! 7/19/03 - Update from Rod Hey Everybody,\n\nI've been meaning to post something ever since I got back from Europe last month. The clinic tour was an absolute blast! I played in 8 countries in 3 weeks and spent some time in the UK visiting Premier Percussion on a break in the middle of the clinic events. Thanks to everyone who came out, the turn-outs were fantastic, and I met so many wonderful drummers, Premier/Sabian/Vic Firth reps, music store personnel and other musicians. I'd like to thank everyone who was involved in making these clinics first class events and I look forward to seeing all of you again somewhere down the road. I'm already full steam ahead in the Berklee College of Music 5 week program and have been teaching 11 different classes in addition to many private lessons. And I can say without hesitation that there are some VERY talented young people out there! I'm sure we'll be seeing quite a few of ya'll enrolled as Berklee College students in the years to come. Ty Tabor, King's X guitarist, is putting the finishing touches on Jelly Jam 2, my project with him and John Myung, bassist with Dream Theater. Stay posted for a release date. Enjoy the rest of the summer. Talk to you in the fall. Rod 5/16/03 - Update from Rod Hi Everybody,\n\nI leave in a week for a 3 week European drum clinic tour for Premier and Sabian which will take me to some very cool places including, Spain, Austria, Denmark, Sweden, Norway, Germany, Switzerland and Iceland, with a trip to the Premier Percussion complex in Leicester, UK thrown in for good measure. The clinics will feature the new line of Premier drums which were showcased at this year's NAMM Show in Anaheim, CA back in January. The east coast Dixie Dregs tour was a lot of fun, and as we didn't hit all of the usual east coast cities, hopefully we'll be able to put another run together this year. Ty tabor is hard at work on the next Jelly Jam recording. I'll keep you posted on a release date as soon as I hear something. And, as I've said before, we really want to tour for this one. Still waiting on a release date for the Magna Carta drummers cd. I played in a very cool blues concert last weekend at the West Hampton Performing Arts Center with Frank Latorre and The King Bees. Frank, an incredible harmonica player, played the harp on Winger's 'Down incognito' on PULL back in '93. The band also featured Richie Cannata of Billy Joel fame and 3 of Frank's longtime buddies- Doug, Paul and Paul who play guitar, bass and guitar respectively. I hope to do some more playing with these guys in the future. Jordan Rudess and I played during Berklee College's Percussion week back in April and the turn out was overwhelming. Thanks for all your support. Some day, I promise, we'll get the next studio cd released. We have interested parties in Puerto Rico and Finland wanting to bring us over to jam. So we're looking into getting it together. Well, another year at Berklee has come to a close and, as always, I had a wonderful time teaching so many talented drummer/musicians. I'll be teaching the 5 Week Summer program beginning the second week in July, so if you're in the neighborhood, stop by to say hey. 2/21/03 - Update from Rod Hey everybody.\n\nThe January west coast Dixie Dregs tour was fantastic. The timing enabled us to spend some time at the NAMM Music trade show in Anaheim. It's always a blast going to the show as you meet up with so many friends and acquaintances who you don't necessarily get to see that often.\n\n\n\nThe Dixie Dregs will be hitting the road in late April for an east coast run. Check my site in the coming weeks for concert info. I recently recorded a song for an upcoming 'drummers' cd which will be coming out on Magna Carta sometime in the spring. 10-15 drummers are each contributing a tune. As I understand it, Bill Bruford, Terry Bozzio and Steve Smith have already submitted their tracks. Should be quite a recording. Ty Tabor is hoping to put the final touches on the new Jelly Jam cd March/April. So, hopefully, it won't be too long after that before it is released by Inside Out Records. Until we meet again.......... 12/2/02 - Update from Rod The Dixie Dregs will be touring in CA, January 10 through the 19th. Check the concert calendar for specific dates. Thanks to everyone who came out to see Winger on the east coast this past October. As is always the case with these guys, it was a tremendous amount of fun both musically and just hanging with Kip, Paul, Reb, and John. Now we'll just have to see where it all leads... Jordan Rudess and I picked up where we left off last summer on our second RPM studio recording. It's awesome working together again with my power duo partner. We're hoping to get it done in the next few months for a 2003 release and some touring. Ty Tabor will put the finishing touches on the next Jelly Jam recording as soon as he gets home from the King's X/ Ronnie Dio tour later this month. The first Jelly Jam cd created a nice buzz at radio and so we're all looking forward to releasing this next one. John Myung, Ty and I are determined to tour with this band. Another semester at Berklee is fast coming to a close. As usual, I have a great bunch of students who continue to keep me on my toes. Have a great holiday season and I'll see you next year.\n\nRod 8/28/02 - Update from Rod Well, it looks like summer is almost over. Man it was a hot one! The Poison, Cinderella, Winger, Faster Pussycat tour was an incredible amount of fun. Being back with the guys was truly an amazing experience. Jamming with them was a blast and I don't think I've laughed this much in years. These people are so much fun to hang with. And it looks like we'll be hanging again, if but for only a short time. We're doing a string of east coast Winger shows beginning October 1. Check the Concert Calendar for the dates. These will be full length shows covering considerably more songs than we did on the Poison tour. We're looking into the possibility of doing some combination Dixie Dregs/ Jelly Jam shows later this year. I'll keep you posted. Jordan Rudess and I have been in communicado trying to nail down a time period to finish up our next studio recording which was begun last summer. I'll keep you abreast of that one, too. The Berklee College of Music fall semester begins shortly and I'm looking forward to meeting lots of new faces as well as the 'veterans'. See you all soon......\n\n5/2/02 - Update from Rod Hey everybody. Well, as you all know by now, Winger is back together and will be touring with Poison, Cinderella, and Faster Pussycat from mid-May through July. I must admit, the adrenaline is beginning to flow as the starting date approaches. This will be the first time we've played as a band live in nearly 9 years. A few Winger Only headline shows will be happening, too. For all tour dates click here. The Jelly Jam debut cd was released in the latter part of March and Ty and I have been doing a good amount of press and radio in support of it. We're hoping to do some touring with this project as soon as our schedules permit. John Myung is currently on tour with Dream Theater, and Ty is on the road with King's X. So, all three of us have our hands full at the moment. But we're determined to make The Jelly Jam a full-fledged, LIVE jamming band. This week was the last week of classes for the spring 2002 semester at Berklee College of Music. Finals are next week, after which I race back to New York to board a plane to Nashville for a week of Winger rehearsals. I had a fantastic group of students this year who really kept me on my toes. I'm sure I'll be seeing many of them in concert with their own bands in the years to come! Have a great summer and I hope to run in to some of you along the way......... Rod\n\n4/9/02 Check out Rod's new drum tips 4/1/02 Winger is BACK!! Read about winger here Winger dates with Poison! 3/19/02 Rod's new project Jelly Jam featuring Rod, Ty Tabor and John Myung is available at stores new you! hear clips © 1998-2023 RodMorgenstein.com. Unauthorized duplication or other use prohibited.\n\nThanks.\n\nSee you on the road!\n\nRod 10-8-2020 Hey Everybody, Sadly, my mom, Helen, passed away this past Wednesday. I don’t think a more positive, ‘life is beautiful’ human being has ever graced this planet of ours. She truly was 'salt of the earth'. Along with my dad, Mel, her soulmate for 84 years, my mom lived a truly happy, content, and fulfilling life. Making it to the tender young age of 97 is a gift unto itself. Clearly, I got my musical abilities from her, as my dad was a clap-on-beats 1 and 3 kind of guy, but she was, instinctively, a backbeat girl, feeling the groove on where it’s supposed to be experienced - beats 2 and 4! This has been a trying year, having experienced so much loss. But, in the end, folks like my mom have instilled in me the belief that there is always a bright side of life to not only dwell on, but to embrace wholeheartedly. 7-13-2020 Hey Everybody,Rod here. After 45 years of amassing an enormous collection of drum sets, snare drums, cymbals, percussion, Winger clothing (from the good ole days), tour laminates, itineraries, posters and awards, drumheads, drumsticks, assorted hardware, and other mementos, I have decided to part with a tremendous amount of these items. Three of the major items I am parting with are drum sets from– The Dixie Dregs, ‘Bring ‘Em Back Alive’, live recording (from The Center Stage in Atlanta, GA in early ’92) and tour, including an appearance on The Tonight Show with Jay Leno in December 1992 The 2002 ‘Hollyweird Summer Tour’ featuring Poison, Cinderella, Winger and Faster Pussycat, plus a Winger tour that followed in the fall of ‘02 The drum set used on several Dixie Dregs tours from the late ‘90’s through 2007\n\nRod It has been an amazing trip down memory lane sorting through hundreds of possessions, each one triggering a smile, a story, or an unforgettable memory I will cherish forever. If you are interested in checking out some of these items, you can contact my friend and fellow drummer, Ed Tucker, at Studio 3T studio3t@icloud.com Or join Ed’s Facebook group: Vintage Drum Collectors & Players. Type in “Rod Mo” in the question to join the group.It’s gonna take awhile before each and every item is listed, so make sure to check in over the coming weeks to see what new things have been added.Thanks for all the great years. It has been, and continues to be, an incredible ride.Rock On!Rod 6-6-2020\n\n\n\nI was shocked and saddened this week to learn that my friend and Dixie Dregs drum tech and monitor ace, Skoots Lyndon, passed away. Skoots was the consummate band mate, always seeking perfection in everything he did. He was an extremely kind and generous human being, periodically checking in on me to see how my parents are doing and how life, in general is faring. He also happened to be one of the best storytellers who ever graced our planet. His years of touring the globe with Deep Purple, Dixie Dregs, Steve Morse Band, and numerous other acts, created a vast library of colorful stories; truly amazing stories that only a wordsmith like Skoots could impart to an audience lucky enough to be in his presence. My memory is filled with moments like these, where I would be hanging on every word, completely engrossed, often in stitches, for hours on end. RIP Skoots. Your memory will live on in the hearts of all of us who were so fortunate to have you in our live 4-26-2020 WINGER - Better Days Comin' - All-Star\n\n4-12-2020 ‘Hi, this is Mel, how can I help you?’ For years, these were the first words my dad would speak upon answering the phone. I think this phrase pretty much sums up the kind of person he was; always wanting to lend a helping hand in any way he could. My dad passed away yesterday and, almost immediately, the memories of an extraordinary life began flooding my brain. He was a professor by trade, having taught at a handful of colleges and universities in New York, including Columbia University. He would often comment that he never felt like he worked a day in his life, as his love of teaching and being among young, talented, motivated students inspired him to no end. At the age of 10, watching The Beatles on The Ed Sullivan Show along with my parents and sister, Carol, I knew then and there what I wanted to be when I grew up. From that day on, and continuing to this day, my parents have been my most ardent supporters, having attended nearly every single New York area concert I have played since 1976, be it with Winger, Dixie Dregs, Steve Morse Band, Rudess Morgenstein Project, The Jelly Jam, Jazz Is Dead, drum clinics and festivals, you name it. The last show they attended was the Dixie Dregs reunion concert at The Paramount Theater in Huntington, NY on March 15, 2018. After a recent hospital stay, an attendant came into the room with the wheelchair to escort my dad out of the building. I introduced myself to him, and he immediately reminded me that he knew who I was, having helped me a few years ago when I was being treated in the hospital’s ER for kidney stones. He also told me he was a guitarist, a major Dixie Dregs fan, and had seen the Dregs every single time we have played on Long Island since the ‘70’s. I then introduced him to my dad, to which he replied, ‘What, are you kidding, I know your dad, and I also know your mom. Every Dixie Dregs fan on Long Island knows them. They’re just as famous as the band members, because every Dregs fan who has come to your shows these past 40+ years sees your parents every single time. He then proceeded to tell me exactly where they were sitting at The Paramount Theater concert two years ago! My dad has been an inspiration to me, and many of my friends, for a lifetime. In fact, quite a few of my friends have told me that he has been a role model, playing a major part in how they try to live their lives. I am forever grateful to have had him in my life. The floodgates have opened, and the countless, beautiful memories of this amazingly special man, my dad, are everywhere I look… 1-10-20 Neil Peart was a Renaissance man. Most of us know him as the iconic drummer and lyricist of Rush. But beyond his exceptional talents in the world of music, Neil’s zest for life, thirst for knowledge, and quest for adventure led him down many divergent paths. I had the honor and pleasure of meeting Neil in 1985, when The Steve Morse Band toured with Rush as their opening act on the band’s Power Windows Tour. Most touring musicians will attest to the absolute joy and excitement of bringing their music to audiences around the globe. Most of these same musicians will also agree on the physical and emotional toll that endless touring can take on a human being. That said, a typical show day often consists of travel, sound checks, meet and greets, interviews, the performance, followed by more meet and greets. Well, as if this is not enough, a typical show day for Neil Peart on Rush’s ‘85/’86 ‘Power Windows Tour’ would usually begin in the wee hours of morning, as Neil would journey on his bicycle from the previous city (assuming said previous city was within 150 miles of the next gig). Neil would often be on his bike for hours, arriving in time for Rush’s sound check. Directly after sound check, he would have dinner, which was immediately followed by a one-hour conversational French language lesson with a local French-speaking tutor. Upon completing his French lesson, Neil would proceed to a private practice room and warm-up on a small drum kit prior to the band’s two-hour concert. After the concert, Neil would usually hang for a short time before excusing himself to go to the band’s tour bus, to work on one of his future literary creations. Sometime during this same time period, when he had some time off from touring, Neil flew to China, where he met up with a handful of bicycling enthusiasts for a 3-week journey through remote parts of the country. With pad and pen in hand (at the time, Neil felt that a camera interfered with the creative process) he would jot down highlights of the day’s experiences, which eventually culminated in one of his first literary works entitled, ‘Riding The Golden Lion’. In addition to the writing portion of this 39-page journal/book, Neil was involved in every step of the process in putting the book together, including choosing the cover art, font, page color and thickness, etc. I believe it was the first outing in what would become a passion of his, eventually authoring several critically acclaimed books. On the very last day off of The Steve Morse Band’s final leg of the Rush Power Windows Tour Neil, Alex, and Geddy took our band to an exotic restaurant for a memorable band dinner. Sitting cross-legged on pillows on the floor, in our very own private room, sans silverware, we dined on an incredible feast of delicacies using only our fingers. Alex, a wine expert and connoisseur, made sure the nectar of the Gods was flowing. So, there I am sitting next to Neil, chit-chatting while trying to think of something interesting and stimulating to say to this sophisticated, worldly, well-traveled man. Neil beat me to the punch, turning to me and posing the question, ‘So Rod, have you ever considered the effects of climate on the development of Western Civilization?’\n\nThat, in a nutshell, sums up the ever-inquisitive Neil Peart, always seeking knowledge and new experiences, never happy with the status quo. He is the textbook definition of ‘Carpe Diem’, seizing every moment of life to engage in something of importance, be it music, reading, writing, philosophizing, bicycling, motorcycling, sailing, cross-country skiing, trekking through foreign lands, climbing the highest peaks, and devoting himself to family. He is a truly inspiring human being, whose breath of humanity has touched millions around the world. I am forever grateful to have known this unique and special man. RIP Neil. 11/2/19 Hey Everybody, I am part of a very cool project, called The Road Crew, with Billy Sheehan on bass and some very talented musicians from my area. We are performing our first, and at the moment our only, concert on Long Island on December 18. Also on the bill will be Zebra guitarist/vocalist Randy Jackson. The Road Crew came about as a result of the tragic loss of a young child, who was run down in his front yard by someone who was texting while driving. This innocent, precious child, Rocco Cangemi, is the inspiration for his father, Joe Cangemi, putting The Road Crew together. Hope to see you there. 9/10/19\n\nDetroit Drummers Day featuring Rod\n\nSunday 9/15 @ The Token Lounge · Westland, Michigan 7/25/17 The Dixie Dregs' Original Lineup Will Reunite and Tour in 2018 The Dixie Dregs' Original Lineup Will Reunite and Tour in 2018 The original lineup of instrumental masters the Dixie Dregs will be hitting the road in 2018. Rod Morgenstein, Andy West, Allen Sloan, Steve Davidowski and Steve Morse—the same Dregs lineup behind 1977’s Free Fall—have officially reunited, as they announced yesterday via a very brief press release. The band’s website adds a few more details: “Hello, everyone! We are starting back at the beginning—with the band as it was in 1975 when we were touring the South and trying to get a record deal. Together we recorded our first commercially produced album, Free Fall. We are reincarnating the band and will announce 2018 tour dates soon. Welcome to the return of the Dixie Dregs!” Actually, there are already two 2018 dates on the band’s official site, and you can check them out here. Stay tuned for more details, folks. For more information, visit dixiedregs.com and follow along on Facebook. 7/20/17 - The Jelly Jam tour dates THE JELLY JAM\n\n8/11 Hartford, CT Infinity Hall\n\n8/12 New Hope, PA HAVANA\n\n8/13 Worcester, MA The Cove Music Hall\n\n8/18 Toronto, Canada The Rockpile\n\n8/19 Westland, MI The Token Lounge 11/8/16 'Rod Morgenstein of Winger, Dixie Dregs, The Jelly Jam, Rudess Morgenstein Project and Jazz Is Dead, has just been nominated in the Hall of Fame section of the 2017 Modern Drummer Magazine Readers Poll. If you would like to vote, just go to the following address\n\nThe address to vote is http://www.moderndrummer.com/modern-drummer-readers-poll-2017\n\n6/6/16 drumming interview w/Joe Bosso https://www.facebook.com/MusicAficionadoApp/posts/1126834377358421\n\n4/18/16 The Jelly Jam – featuring rock heavyweights John Myung (Dream Theater), Rod Morgenstein (Dixie Dregs, Winger) and Ty Tabor (King’s X) – release new album ‘Profit’ on May 27th. The Jelly Jam will release their epic new album Profit on 27th May 2016 via Music Theories Recordings/Mascot Label Group (Flying Colors, Gov’t Mule, Teramaze, Crippled Black Phoenix, Black Stone Cherry, Joe Bonamassa). The Jelly Jam featuring DREAM THEATER’s John Myung, WINGER’s Rod Morgenstein, and KING’S X Ty Tabor, will return in 2016 with a new album and their first ever world tour. Click here for more info Check out the Jelly Jam Channel on You Tube https://www.youtube.com/user/shallwedescend 11/28/15 - update from Rod 'Hey Everybody, please check out this promo clip of the new Jazz Is Dead cd, which was 12 years in the making. It's one of my favorite recordings and features a host of guest artists. Thanks, Rod'\n\nhttps://www.youtube.com/watch?v=K0ey99o5nT0&feature=youtu.be\n\n\n\nFor info on purchasing the cd, go to http://pevar.com/music/jazzisdead-gratefuljazz/ Hey Everybody, My drumming pal, April Samuels, is a breast cancer survivor who started an amazing foundation, Breast Cancer Can Stick It! In her own words, ‘we raise awareness and funds for a cure by orchestrating energetic, unique, music-minded events that ROCK to ultimately STICK IT to breast cancer’. On October 25, April’s foundation will be hosting a DRUMMATHON featuring Carmine and Vinnie Appice, and Matt Starr. It will, no doubt, be a day filled with a multitude of exciting drumming events. Please check out the website below for info on this important event. www.breastcancercanstickit.org/drummathon/ Thanks, Rod 6/1/13 - update from Rod I just performed at the Bonzo Bash in NYC (5/30) and Long Island (5/31) honoring\n\nwhat would have been John Bonham's 65th birthday. Over 20 drummers performed\n\nwith The Moby Dicks, an incredible Led Zeppelin cover band. It was one of those\n\nspecial moments that reminds you why you became a musician in the first place.\n\nAll these fantastic musicians gathered on one stage, paying their mutual respect\n\nfor a drummer and band that changed the world by playing their hearts out. I\n\nfelt so honored to be a part of it. 12/29/12 - update from Rod Hey Everybody, I just did a 10 Essential Drum Albums Interview with Joe Bosso for Music Radar Magazine,\n\ncheck it out here!\n\n\n\nAlso, I'll be playing with Jordan at the Korg booth at the NAMM Show in Anaheim, CA on Fri/Sat January 25/26 at 2:30pm. We're going to be doing the 23 minute version of Tarkus on Jordan's The Road Home cd! 4/22/12 - update from Rod Hey Everybody,\n\n\n\nI recently donated several autographed items, including my Sabian\n\nSignature ride cymbal, China cymbal, crash cymbal, splash cymbal, Vic Firth isolation headphones and a pair of my signature sticks to be auctioned off on e-bay May 1st to help raise money for DIRECT, a Tucson, AZ non-profit organization. This independent living center offers a variety of services to people with disabilities who want to become more self-sufficient. For info on this auction contact: Ron at 520.760.3043 or email him at troz57@msn.com 11/11 - update from Rod Hey Everybody,\n\nNovember 28 is the release date of The Jelly Jam's brand new cd, 'Shall We Descend'. You can check out the first single. 'Who's Comin'Now', at TheJellyJam.com. And you can order the cd at MolkenMusic.com Happy Thanksgiving. Rod 7/25/11 - update from Rod Hey Everybody, I will be doing a live video chat this Thursday July 28 at 4pm for my\n\nnew on-line Rock Drums course offered through Berklee Media.\n\nThis course features hours of video instruction, hundreds of audio\n\nclips and transcribed music examples, plus a boatload of very cool\n\nplay-a-long tracks.\n\nHope to see you there. Drum On.\n\nRod https://www.berkleemusic.com/openhouse-signup/?pid=3876 4/16/11 - update from Rod Hey Everybody, I have spent the past year developing an on-line course in Rock Drumming for Berklee Music, the media wing of Berklee College of Music. This 12 week course is available for college credit or non- credit and is an all-encompassing program incorporating hours of video instruction, hundreds of drumming audio examples and transcriptions, and multiple play-a-long tacks covering a vast number of rock drumming styles. As the teacher of this interactive course, I meet with students each week for a class chat, as well as give input on their weekly performance projects. I have had a blast putting this course together, drawing from nearly 40 years as a recording and touring musician. For more info check out the website below. Hope to see you in class! Rod www.berkleemusic.com/school/course? course_item_id=21848140&program=new_online_music_courses\n\n6/4/10 - update from Rod Hey Everybody,\n\n\n\nSonic Reality has released Epik Drums, a deluxe collection of drumkit and groove instruments created with legendary producer Ken Scott. Ken produced 2 Dixie Dregs records- 'What If' and 'Night of the Living Dregs', and has engineered and produced a who's who list of artists including the Beatles, David Bowie, Supertramp, and the Mahavishnu Orchestra. This package is packed with hours of drumming by me, Billy Cobham, Bob Siebenberg, Woody Woodmansey, and Terry Bozzio. Check it out at www.sonicreality.com\n\n\n\nWinger will be touring throughout the summer in support of our new cd, 'Karma', which was released in the fall of 2009. For tour dates check my 'In Concert' page. You can also get more info on the band at www.myspace.com/wingertheband and www.wingertheband.com\n\n\n\nThe Jelly Jam are up and running again, having recently cut basic tracks for Jelly Jam 3. Ty Tabor (guitarist with King's X) hopes to finish up the recording this fall. Look for its release by year's end or early 2011. We are also looking into the possibility of doing some live shows. Stay posted.\n\n\n\nFinished my 13th year of teaching at Berklee this past May. The talent just keeps getting better and better! There is a 5 minute drum lesson on this month's home page @ www.musicradar.com plus another lesson from last month.\n\n\n\n3 part interview on www.vicfirth.com\n\n\n\nC oming soon! Lessons at www.evansdrumheads.com\n\n\n\nOct/Nov: New WInger cd on Frontiers Records and Europe Tour dates to be announced soon. October '09 release from Sonic Reality--The recreation of drum sounds from classic albums recorded by producer Ken Scott and 5 legendary drummers: Rod Morgenstein (Dixie Dregs), Terry Bozzio (Missing Persons), Woody Woodmansey (David Bowie’s Spiders from Mars), Bill Cobham (Mahavishnu Orchestra) and Bob Siebenberg (Supertramp). 5/22/09 - update from Rod Hey Everybody,\n\n\n\nWinger is in the studio recording our 5th studio cd for Frontiers Records. It will be released fall '09 with touring to follow. The vibe this time around is in-your-face, good old slammin' rock 'n roll.\n\n\n\nJazz Is Dead is still in the mixing stages of the band's first studio recording. Hopefully, it will be completed and released by the end of the year or early 2010.\n\n\n\nSoon to be released from Sonic Reality is The Ken Scott Collection, a series of drum loops by 5 of the drummers Ken Scott has worked with including myself, Billy Cobham, Terry Bozzio, Woody Woodmansey, and Bob Siegerman. Ken's discography reads like a who's who of the recording industry, having been head engineer on the Beatle's White Album, and engineer/producer of such artists as David Bowie, Supertramp, Dixie Dregs and Mahavishnu Orchestra. Further info on this collection can be found at www.sonicreality.com/kenscottcollection.php\n\n\n\nI recently completed my 12th year at Berklee College of Music. The musical talent just seems to be getting better and better every year!!!\n\n\n\nHave a great summer.......... 7/1/08 - update from Rod Hey Everybody,\n\n\n\nIt's been a while........\n\n\n\nRecently, I was in California recording with legendary producer Ken Scott as part of a massive drum library project for Sonic Reality. Ken chose 6 drummers he has worked with including Terry Bozzio, Billy Cobham, Woody Woodmansey (David Bowie), Bob Seibenberg (Supertramp), and Nigel Olson (Elton John). Ken engineered and produced two classic Dixie Dregs records, 'What If' and 'Night of the Living Dregs'. His bio reads like a Who's Who of the record biz--The Beatles, Mahavishnu Orchestra, Missing Persons, David Bowie, Supertramp, Elton John, and Stanley Clarke to name a few. The drum library collection, which focuses on recreating the analog drum sounds from the 70's, will also feature a book on Ken's life and his ground-breaking engineering and recording techniques. The release date is scheduled for early 2009.\n\n\n\nJazz Is Dead guitarist, Jeff Pevar, is in the studio mixing the new Jazz Is Dead cd, finally! This recording will be, believe it or not, the first studio cd in the band's history. Look for the release in the latter part of this year or early 2009.\n\n\n\nWinger toured the US this past Feb/March, and is looking into touring South America this fall. Concert dates will be posted once they are confirmed. ALthough Winger has toured in nearly 25 countries, this will be the band's first tour in SA.\n\n\n\nRudess Morgenstein Project will play in Poland this October as part of the Percussion Festival in Opole, Poland. In addition to each of us performing a clinic, we will play several concerts. Info will be posted when the dates are officially set.\n\n\n\nI have been recording a cd with a phenomenal pianist by the name of Rob Apostle. Rob's music is an incredible blend of classical, jazz, and fusion music. Deceptively simple, this music will touch both musician and non-musician on a very deep and emotional level. No release date is set yet as it is in its early stages. I'll keep you posted as the project nears completion.\n\n\n\nMid-May completed my 11th year teaching at Berklee College of Music. What began in September 1997, filling in for a teacher who went off on a year's Sabbatical leave, has blossomed into an integral and very rewarding part of my professional music career. Also, midway through the semester I became a full professor. I wish to thank my incredible students for always continuing to inspire me.\n\n\n\nHave a COOL, wonderful summer............ 12/9/07 - update from Rod Japan and Australia were amazing! It's been way too long since WINGER played in Japan. The last time were toured there was for the PULL tour in '93. Sold out shows in Tokyo and Yokohama and awesome crowds in Osaka and Nagoya brought back so many great memories of touring in the good ole days! The trip to Australia was our first and I'm sure we'll be back, as the crowds were really enthusiastic there, too. We had a blast touring with Ratt for the 2 weeks, and got to hang out a bunch with those guys. All I can say is it was a TON OF FUN!!!\n\n\n\nWINGER 'LIVE' was just released on Frontiers Records and is available in both dvd and cd. The concert was filmed at the Galaxy Theater in Anaheim, CA in March '07 and the reviews have been fantastic.\n\n\n\nMONSTER BALLADS XMAS was just released on Razor and Tie Records. 15 rock/metal artists each contributed a tune. WINGER did a cool version of John Lennon's Happy Christmas (War Is Over). Other bands include Queensryche, Dokken, Skid Row, Twisted Sister, Danger Danger, and Firehouse.\n\n\n\nWINGER will be touring the US in Feb/Mar '08. Tour dates will be posted shortly. Hope to see ya'll there!\n\n\n\nI wish you all a Merry Christmas, Happy Chanukah, and every other holiday which occurs this time of year. See you on tour next year!!!\n\n10/5/07 - update from Rod Hey All, Look for the new Winger 'Live' dvd/cd coming out in November. It was flimed this past March at the Galaxy Theater in Anaheim, CA, and is Winger's first live recording ever! Remember 'Monster Ballads', the cd which featured ballads from all the metal bands from the good ole days? Well, here comes 'Monster Ballads Xmas' this November, featuring Christmas songs by lots of the same bands. Winger covers the John Lennon song, 'Happy Christmas (War Is Over). Also in November, Winger is touring in Japan and Australia with Ratt. It will be our first time back to Japan since the Pull tour in '93. And it will be our very first trip to Australia. My last\n\ntime in the 'land down under' was in '94 for a drum clinic tour which took me to both Australia and New Zealand. What a magnificent part of the world! The Dixie Dregs are in the process of setting up gigs for the new year. As soon as dates are confirmed they will go\n\nup on my 'In Concert' page. Jazz Is Dead is still in the mixing stages of our first stdio cd. No release date yet, but I'll keep you posted. 9/7/07 - update from Rod Hey Everybody,\n\n\n\nThe Berklee fall semester is just around the corner, and so next Monday I'll be off and running to Boston to meet this year's crop of amazing students. This semester begins my 11th year teaching at the college.\n\n\n\nWinger played a handful of gigs this summer, the most memorable being The Rocklahoma fest in Pryor, Oklahoma, a 3 day non-stop 70's/80's trip down memory lane with the likes of Skid Row, Ratt, Twisted Sister, Warrant, Dokken, Vince Neil, Poison, Firehouse, Quiet Riot, Enuff's Enuff, Queensryche and a ton of other bands. It was very cool catching up with musicians I haven't seen in years. We were told in excess of 60,000 tix were sold for the event. We're playing in Las Vegas in October and then touring with Ratt in Japan and Australia in November. Check my 'In Concert' page in the next couple of weeks for details.\n\n\n\nJazz Is Dead played a one-off at Berklee back in July. It's always a blast walking out on stage and jamming to songs you haven't played in a long time. Being on the edge of your seat as a musician stirs the creative side of things in really interesting ways. Our new cd is being mixed at the moment and should be released later this year.\n\n\n\nI played drums on Jordan Rudess' very cool new cd, 'The Road Home', which will be released September 12 on Magna Carta Records. This one's a 'cover' album, with Jordan paying homage to the bands which influenced him as an aspiring musician. Included are songs by Yes, Emerson Lake and Palmer, Gentle Giant, and Genesis. As is always the case when I work with Jordan, this was a very challenging recording! Rudess Morgenstein Project headlined CalProg in Whittier, CA back in May. When time permits, Jordan and I will try to get back to finishing up the next Rudess Morgenstein Project cd which we've been working on for the past couple of years.\n\n\n\nSee ya..................... 4/20/07 - update from Rod Life has been a whirlwind since the new year began. First, the Dixie Dregs toured out west in January. While in southern\n\nCalifornia, I raced to the NAMM show in Anaheim during the day to play with Jordan Rudess at the Roland booth. For those performances I played on Roland's V-Drums, an amazing electronic drumset which I have future plans of incorporating them into my acoustic Premier kit. From the NAMM show I had to race to another town to play with the Dregs that evening. Nothing like multiple gigs in one day! On a sad note, the Dixie Dregs tour was cut short when sudden news arrived of Steve Morse's dad falling into a coma. Steve raced back to his home in Florida to be by his dad's side, who sadly passed away later that day. Steve's and my friendship goes back many years. I knew his dad, a brilliant man who will be missed by all whose lives he touched. February 1 was the start of a 5+ week Winger tour in support of the new Winger 4 cd. Crowds were considerably larger than anyone anticipated and we all had an amazing time together. There will be some summer touring, so just check my 'In Concert' page periodically. The Rudess Morgenstein Project headlined Baja Prog '07 in Mexicali, Mexico this past March. 1300 seats were filled to capacity each of 4 nights at this amazing festival. Bands and aficionados of progressive rock music come from all over the world for this event. From there Jordan and I travelled to Frankfurt, Germany to play at the Music Messe for Roland. And then we played a concert in London, also for Roland, and once again on the V Drums. In a few weeks Jordan and I will headline CalProg '07, a prog festival in Whittier, California. Also, around this time, I'll be recording with Jordan for his new solo record which will be out later this year. And we're hoping that, time permitting, we can make more headway on the next Rudess Morgenstein Project cd. The new Jazz Is Dead cd is at the mixing stages and will be completed in the next couple of months. I have heard the rough mixes and this is by far the coolest JID recording since the band's inception. Three weeks left to the Berklee semester. it's been a crazy semester with all my touring. But I tip my hat to my students, who waited patiently until I got back to town. And I've been spending extra days making up for the days I missed earlier in the semester. I truly have some incredible drummers this year. I'm certain I will see them out there doing it Big Time in the coming years! See ya......... 1/8/07 - update from Rod Hey Everybody, Happy New Year. WInger played New Years Eve in Pittsburgh, PA....... OUTDOORS in the pouring rain to a couple thousand diehard fans! We were all soaking wet, and I mean completely drenched. All in all it was a ton of fun. Feb 1 Winger begins a 5 week US tour which will take us all around the country. We'll be mixing it up with stuff from the new cd, Winger 4, and of course, all the tunes from the good ole days. The Dixie Dregs begin touring next week out west which will take us through Colorado, Utah, California, and Arizona. While in southern CA, I'll be racing to the NAMM show to jam with Jordan Rudess at the Roland booth.\n\n\n\nAll concert info can be found on my 'In Concert' page. Immediatley following the Dregs tour I will fly directly to Boston to begin the spring '07 semester at Berklee College of Music. I always look forward to meeting a new crop of talented, eager students. 9/19/06 - update from Rod Lots going on since we last 'chatted'. The first new Winger cd in 13 years , Winger IV, is slated for release October 20 in Europe on Frontiers Records, Japan on King Records, with a US release to follow shortly thereafter on Shrapnel Records. The recording is a natural progression from 'Pull', which came out in '93. Kip produced the recording, which sounds HUGE! The band will tour Europe in October in support of the cd. Concert info can be found on my 'In Concert' page. Audio clips can be heard at www.myspace.com/kipwingermusic Also, we're setting up a winger myspace page which should be up soon... The Rudess Morgenstein Project played in Caracas, Venezuela and San Jose, Costa Rica back in May. Jordan and I had a blast doing these shows, as they were our first gigs south of the border. The energy of the fans was unbelievable! In Venezuela, we played with Angra, a fantastic band from Brazil, and we spent a good bit of time hanging with them. In Costa Rica, we were the only band on the bill, and so our show was much longer than anything we've done in the past. We did a fair amount of jamming, which inspired us to take that approach on some of the new RPM cd, which is moving along nicely. We will be playing the Baja Progfest in Mexico in March, and are talking to other south American promoters about doing shows in some other countries. Jordan is also working on his next solo cd. I will cut drum tracks for some of this recording sometime before the end of the year. The Dixie Dregs will be touring the west coast in January. Look for tour dates on the 'In Concert' page in the next few weeks. Jazz Is Dead is in the mixing stages of a new cd. Even though it will be the band's fourth release, it actually will be our very first studio recording. All the other cds were live recordings. The Berklee fall semester began last week. After a year of living the life of nomads without 'homes', due to problems with the basement area of the building we taught in, the percussion faculty are quite comfortable in our brand new, sound proofed, incredible facility. Should be a great semester. 9/16/06 - from Rod It has been quite some time since I have posted updates on my site. For those of you who may not be aware, my wife, Michele, passed away this past December. Michele was a warrior's warrior during a 22 year journey battling breast cancer. The vast majority of people in our life knew little or nothing of her condition. She chose to keep it a quiet affair so she would not have it be front and center in every aspect of her daily life. It allowed her to lead a relatively normal life and not be known as 'Michele with breast cancer'. As painfully difficult as living with cancer can be at times, our life together was nothing short of perfection. We learned to smell the roses years ago. There are no regrets, as we told each other how deeply we loved each other virtually every day of our lives. Michele was my childhood sweetheart, the love of my life, my best friend, my soul mate. I miss her more than anyone can imagine. Thank you to everyone for your e-mails, letters and phone calls which have offered me some level of comfort during this very difficult time. I wish you all happiness and good health. Rod\n\n5/2/05 - Update from Rod The east coast Dixie Dregs tour was awesome, covering 18 cities in 19 days. Travelling highlights included driving through a surprise spring blizzard with virtually NO visiability in the middle of the night after jamming in Cleveland! Ah, the exciting life of a touring musician. Progress continues on the new Jazz Is Dead cd. Luis Conte has added amazing percussion to several tracks and we're hoping to get a few more folks to play on this one. Winger is still looking into a fall tour to record a live dvd and possible\n\nstudio cd. I'm getting ready to do some recording with Marc Muller who has been playing pedal steel and guitar with Shania Twain for the last 10 years. We're also involved in co-writing songs. The Berklee spring semester comes to a close this week and, as always, I've had a great bunch of students who never cease to amaze me.\n\n1/29/05 - Update from Rod Just got home from the Dixie Dregs/Steve Morse Band west coast tour. As always, it was a lot of fun jamming with my band mates of many years. Steve Morse band drummer Van Romaine and I worked out a two-man drum solo (guess you call that a drum duo)which was really a blast to perform. Looks like we'll be doing an east coast run in mid-March, from Florida all the way up through Chicago, so check my concert calendar in a couple of weeks for tour dates. Winger is discussing the possibility of a live dvd which would involve a week or two of concerts, possibly in May or June. Stay posted for details. The Berklee College of Music spring semester has begun and, as always, I have a wonderful group of students. 9/25/04 - Update from Rod Hey Everybody,\n\nWell, believe it or not, after nearly 3 years since we first began work on it, The Jelly Jam 2 was just released. We are really beginning to sound like a band! Now we're looking at all of our schedules to see if we can do some live 'Jelly Jamming' in the next few months. I'll keep you posted. If you can't find Jelly Jam 2 in a cd shop, you can go to InsideOutMusic.com to read all about it and get purchase info. Jordan Rudess' new cd, 'Rhythm of Time', was released recently on Magna Carta Records. Like I had said a while back this recording was, without a doubt, one of the most challenging and rewarding recordings of my career. The Dixie Dregs will be gearing up for a west coast tour in January. Tour dates will be available on my concert calendar in the next several weeks. We're already 4 weeks into the 2004 fall semester at Berklee College of Music and, as always, I have a great bunch of students. This time around there seem to be several who are into many of the classic rock and fusion bands and drummers, which is totally fine by me. It's right up my alley. Hope you all have an enjoyable fall season....... 7/23/04 - Update from Rod\n\n\n\nHi Everybody,\n\n\n\nThe Rudess Morgenstein Project will be performing at the Berklee Performance Center at BerkleeCollege of Music in Boston on Thursday, August 5 at 8:15 PM. We will be playing classic RPM tunes as well as music from Jordan's soon-to-be released solo cd, 'Rhythm of Time'. Ty Tabor has completed mixing The Jelly Jam 2 and it is now in the hands of Inside Out Records. I'll keep you all posted regarding the release date. Kip Winger is putting some finishing touches on the recording I did with him and Turkish producer/guitarist Cenk Eroglu earlier this year, and getting ready to shop it for a deal. The recording with T Lavitz and Jeff Pevar was incredible. The jam band concept is one of the most rewarding experiences I've had in my 30+ years as a musician. We need to record a couple more tracks to have a full length cd, so we'll probably get together in the fall to complete it. I'm in the midst of Berklee's 5 week summer program and having a blast with my roughly 75 students. It's amazing how many talented young musicians there are out there! 4/17/04 - Update from Rod Hi Everybody, Kip is on his way to Istanbul, Turkey to finish recording and mix several tunes on his current project with Cenk Eroglu. Talk about a fresh, new killer sound, this is it!\n\n\n\nI just got back from Illinois for a week of recording with\n\nguitarist/keyboardist Brian Moritz and his band Balance. Dave LaRue (Dixie Dregs) played bass, with Joel Kaplan on keyboards and Vince Claps on vocals. With the exception of Dave and I, all these guys have been very active in the Chicago music scene for many years. The recording was engineered by Brian Mitchell, who lives a double life as a forensic pathologist! All in all, it was quite an experience. I'll update you as the recording progresses.\n\n\n\nI'm on my way to meet up with T Lavitz and Jeff Pevar in\n\nHartford, CT to record for several days on both Jeff's solo cd and some jam band oriented stuff.\n\n\n\nAs soon as I return from CT, I'll be getting together with Jordan Rudess to pick up where he and I left off with the next Rudess Morgenstein Project cd. We're looking into the possibility of playing some gigs later this year.\n\n\n\nThe release of Jordan's solo cd, 'Rhythm of Time', is August 31 on Magna Carta Records.\n\n\n\nWell, yet another Berklee school year has come to a close. I guarantee that somewhere in the future you will see some of these students realizing their musical dreams!\n\n\n\nHave a HOT summer.................... 3/19/04 - Update from Rod Hi Everybody, I just spent the last several days in Nashville recording with Kip Winger. Over the past year, Kip has been making trips to Istanbul, Turkey where he has been writing and recording with Turkish artist/guitarist/producer Cenk Eroglu. The music is an incredible blend of east-meets-west sounds and rhythms, both traditional and high-tech. Kip and Cenk hope to finish it up in the next several months. I'll keep you posted. We're talking about the possibility of recording Winger Live In Concert along with a bunch of archival/ interview footage. Jordan Rudess' solo cd, 'Rhythm of Time', is set for release in July on Magna Carta Records. What an incredibly challenging and rewarding experience it always is, working with my friend Jordan. Among the guest artists appearing on the recording are Joe Satriani, Steve Morse, Dave LaRue, Vinnie Moore and Greg Howe. Modern Drummer presents 'Drum Nation' was released in mid-January and includes drum performances by 14 drummers. Jordan Rudess played keys on my track 'Faceless Pastiche'. Other members of the cast include Steve Smith, Simon Phillips, Bill Bruford, Trilok Gurtu and Chad Wackerman, to name but a\n\nfew. I recorded a couple of tracks with Jeff Pevar on a solo recording he's working on. I met Jeff when he joined Jazz Is Dead in 2001. He is one of the most well-rounded, musical guitarists around. I recently went to see him perform with CPR, the band he has with David Crosby (of Crosby, Stills, Nash and Young fame.) Jeff is the 'P' in CPR. A highlight of the evening for me was meeting David Crosby and having HIM say all these great things about the Dixie Dregs. I felt like a million bucks! Jelly Jam 2's completion is just around the corner, I promise........ Another snow has fallen, with more expected tonight. It sure has been a\n\nLOOOOOOONG Winter. 11/09/03 - Update from Rod Jordan Rudess is in the studio working on his next solo recording for Magna Carta. We're planning on doing drum tracks before the end of the year. January 13 is the Magna Carta release date for 'Modern Drummer Presents: Drum Nation Volume 1', an all-out drummers' cd featuring quite an interesting cast of players. Each participating drummer contributed one track; Jordan Rudess plays keyboards on my tune 'Faceless Pastiche'. Additional info about the cd can be found at Magna Carta'a website. I know it sounds like a broken record but Ty Tabor is planning on mixing The Jelly Jam's next cd before the end of this year, as soon as he gets off the current King's X tour. It seems like only yesterday that the semester began but the Berklee College of Music fall semester is already entering its 10th week. I have some very fine students this year and am sure to hear about them in years to come! 7/19/03 - Update from Rod Hey Everybody,\n\nI've been meaning to post something ever since I got back from Europe last month. The clinic tour was an absolute blast! I played in 8 countries in 3 weeks and spent some time in the UK visiting Premier Percussion on a break in the middle of the clinic events. Thanks to everyone who came out, the turn-outs were fantastic, and I met so many wonderful drummers, Premier/Sabian/Vic Firth reps, music store personnel and other musicians. I'd like to thank everyone who was involved in making these clinics first class events and I look forward to seeing all of you again somewhere down the road. I'm already full steam ahead in the Berklee College of Music 5 week program and have been teaching 11 different classes in addition to many private lessons. And I can say without hesitation that there are some VERY talented young people out there! I'm sure we'll be seeing quite a few of ya'll enrolled as Berklee College students in the years to come. Ty Tabor, King's X guitarist, is putting the finishing touches on Jelly Jam 2, my project with him and John Myung, bassist with Dream Theater. Stay posted for a release date. Enjoy the rest of the summer. Talk to you in the fall. Rod 5/16/03 - Update from Rod Hi Everybody,\n\nI leave in a week for a 3 week European drum clinic tour for Premier and Sabian which will take me to some very cool places including, Spain, Austria, Denmark, Sweden, Norway, Germany, Switzerland and Iceland, with a trip to the Premier Percussion complex in Leicester, UK thrown in for good measure. The clinics will feature the new line of Premier drums which were showcased at this year's NAMM Show in Anaheim, CA back in January. The east coast Dixie Dregs tour was a lot of fun, and as we didn't hit all of the usual east coast cities, hopefully we'll be able to put another run together this year. Ty tabor is hard at work on the next Jelly Jam recording. I'll keep you posted on a release date as soon as I hear something. And, as I've said before, we really want to tour for this one. Still waiting on a release date for the Magna Carta drummers cd. I played in a very cool blues concert last weekend at the West Hampton Performing Arts Center with Frank Latorre and The King Bees. Frank, an incredible harmonica player, played the harp on Winger's 'Down incognito' on PULL back in '93. The band also featured Richie Cannata of Billy Joel fame and 3 of Frank's longtime buddies- Doug, Paul and Paul who play guitar, bass and guitar respectively. I hope to do some more playing with these guys in the future. Jordan Rudess and I played during Berklee College's Percussion week back in April and the turn out was overwhelming. Thanks for all your support. Some day, I promise, we'll get the next studio cd released. We have interested parties in Puerto Rico and Finland wanting to bring us over to jam. So we're looking into getting it together. Well, another year at Berklee has come to a close and, as always, I had a wonderful time teaching so many talented drummer/musicians. I'll be teaching the 5 Week Summer program beginning the second week in July, so if you're in the neighborhood, stop by to say hey. 2/21/03 - Update from Rod Hey everybody.\n\nThe January west coast Dixie Dregs tour was fantastic. The timing enabled us to spend some time at the NAMM Music trade show in Anaheim. It's always a blast going to the show as you meet up with so many friends and acquaintances who you don't necessarily get to see that often.\n\n\n\nThe Dixie Dregs will be hitting the road in late April for an east coast run. Check my site in the coming weeks for concert info. I recently recorded a song for an upcoming 'drummers' cd which will be coming out on Magna Carta sometime in the spring. 10-15 drummers are each contributing a tune. As I understand it, Bill Bruford, Terry Bozzio and Steve Smith have already submitted their tracks. Should be quite a recording. Ty Tabor is hoping to put the final touches on the new Jelly Jam cd March/April. So, hopefully, it won't be too long after that before it is released by Inside Out Records. Until we meet again.......... 12/2/02 - Update from Rod The Dixie Dregs will be touring in CA, January 10 through the 19th. Check the concert calendar for specific dates. Thanks to everyone who came out to see Winger on the east coast this past October. As is always the case with these guys, it was a tremendous amount of fun both musically and just hanging with Kip, Paul, Reb, and John. Now we'll just have to see where it all leads... Jordan Rudess and I picked up where we left off last summer on our second RPM studio recording. It's awesome working together again with my power duo partner. We're hoping to get it done in the next few months for a 2003 release and some touring. Ty Tabor will put the finishing touches on the next Jelly Jam recording as soon as he gets home from the King's X/ Ronnie Dio tour later this month. The first Jelly Jam cd created a nice buzz at radio and so we're all looking forward to releasing this next one. John Myung, Ty and I are determined to tour with this band. Another semester at Berklee is fast coming to a close. As usual, I have a great bunch of students who continue to keep me on my toes. Have a great holiday season and I'll see you next year.\n\nRod 8/28/02 - Update from Rod Well, it looks like summer is almost over. Man it was a hot one! The Poison, Cinderella, Winger, Faster Pussycat tour was an incredible amount of fun. Being back with the guys was truly an amazing experience. Jamming with them was a blast and I don't think I've laughed this much in years. These people are so much fun to hang with. And it looks like we'll be hanging again, if but for only a short time. We're doing a string of east coast Winger shows beginning October 1. Check the Concert Calendar for the dates. These will be full length shows covering considerably more songs than we did on the Poison tour. We're looking into the possibility of doing some combination Dixie Dregs/ Jelly Jam shows later this year. I'll keep you posted. Jordan Rudess and I have been in communicado trying to nail down a time period to finish up our next studio recording which was begun last summer. I'll keep you abreast of that one, too. The Berklee College of Music fall semester begins shortly and I'm looking forward to meeting lots of new faces as well as the 'veterans'. See you all soon......\n\n5/2/02 - Update from Rod Hey everybody. Well, as you all know by now, Winger is back together and will be touring with Poison, Cinderella, and Faster Pussycat from mid-May through July. I must admit, the adrenaline is beginning to flow as the starting date approaches. This will be the first time we've played as a band live in nearly 9 years. A few Winger Only headline shows will be happening, too. For all tour dates click here. The Jelly Jam debut cd was released in the latter part of March and Ty and I have been doing a good amount of press and radio in support of it. We're hoping to do some touring with this project as soon as our schedules permit. John Myung is currently on tour with Dream Theater, and Ty is on the road with King's X. So, all three of us have our hands full at the moment. But we're determined to make The Jelly Jam a full-fledged, LIVE jamming band. This week was the last week of classes for the spring 2002 semester at Berklee College of Music. Finals are next week, after which I race back to New York to board a plane to Nashville for a week of Winger rehearsals. I had a fantastic group of students this year who really kept me on my toes. I'm sure I'll be seeing many of them in concert with their own bands in the years to come! Have a great summer and I hope to run in to some of you along the way......... Rod\n\n4/9/02 Check out Rod's new drum tips 4/1/02 Winger is BACK!! Read about winger here Winger dates with Poison! 3/19/02 Rod's new project Jelly Jam featuring Rod, Ty Tabor and John Myung is available at stores new you! hear clips © 1998-2023 RodMorgenstein.com. Unauthorized duplication or other use prohibited. Hey Everybody, My drumming pal, April Samuels, is a breast cancer survivor who started an amazing foundation, Breast Cancer Can Stick It! In her own words, ‘we raise awareness and funds for a cure by orchestrating energetic, unique, music-minded events that ROCK to ultimately STICK IT to breast cancer’. On October 25, April’s foundation will be hosting a DRUMMATHON featuring Carmine and Vinnie Appice, "}, {"url": "https://www.discogs.com/release/15705397-Rudess-Morgenstein-Project-Rudess-Morgenstein-Project", "page_content": "Don't Look Down\n\nDrop The Puck\n\nCrossing Over\n\n5\n\nNever Again (For Nan)"}, {"url": "https://musicxplorer.com/artists/rod-morgenstein-drummer/", "page_content": "Rod Morgenstein- Drummer\n\nDixie Dregs and Grammy Nominee\n\nRod is a New York native, founding member, and drummer of the Dixie Dregs, a six-time Grammy nominee. Rod is a professor, teaching percussion at Berklee College of Music, in Boston, Massachusetts. Recently offering, Drum Set Warm-Ups , touted as the definitive text for developing and improving all aspects of drum-set playing. He is also a columnist for Modern Drummer magazine.\n\nThe beginning of the Dregs started in 1973, when he attended the University of Miami in Florida. There he met Steve Morse, Andy West, and Allen Sloan, playing under the official Studio Music and curriculum title of, Rock Ensemble II. At the university, The Dregs recorded their first album in 1975, The Great Spectacular, as a class project.\n\nThe Dregs had a rough time getting signed and were turned down and told their music was difficult to market because they were a jazz fusion band had no vocals, odd timing, and that their music combines rock, jazz, bluegrass, folk, and classical influences. The group was finally signed to Capricorn in 1977, and recorded several albums before they temporarily disbanded in 1983. Rod then joined Steve Morse’s new band and stayed for two albums before wanting a musical change to try something both new and challenging. The Dregs last reunion was a tour in 2018.\n\nWinger and Other Projects\n\nRod moved back to New York City and began auditioning for jobs, one of them turned out to be a band that Kip Winger was forming. Two months later, Rod received a call from the band, and they were off to record their self-titled, debut album, Winger, in 1988. It went double platinum. Winger followed up in 1990 with In the Heart of the Young. In 1993, they released the album, Pull, as grunge came in and changed the music scene. The band decided to take a break, but got back together in 2002, and have had sporadic reunions since, and continue to do so as time permits. Winger will be releasing a new album in 2021.\n\nRod’s other projects include the Rudess/Morgenstein Project, an instrumental progressive power-duo, featuring Rod and Dream Theater keyboardist extraordinaire, Jordan Rudess, with two albums to their credit. Rod is is involved with jam band, Jazz Is Dead, which features creative improvisations of the music by the Grateful Dead. Another project is, Platypus, whose two recordings feature: John Myung (Dream Theater), Ty Tabor (King’s X), and Derek Sherinian (Planet X). The music is a mix of instrumental and vocal tunes that blend many different styles together. An offshoot of Platypus is The Jelly Jam, a power trio featuring Rod, Ty Tabor, and John Myung. Their debut release came out in 2001, and The Jelly Jam, ‘2’ was released in 2004.\n\nInterview with Rod Morgenstein (Part 1)"}, {"url": "https://www.moderndrummer.com/2010/11/rod-morgenstein/", "page_content": "Rod Morgenstein: Cross-Genre Ripping\n\nRod Morgenstein is best known as the blazing left-handed drummer with the influential fusion band Dixie Dregs and the pop-metal band Winger. Rod’s professional career began in 1975 while he was still a student at the University of Miami, which is where a nascent Dregs—known at the time as Rock Ensemble II of the Studio Music and Jazz curriculum—honed their skills and recorded their album The Great Spectacular (released on CD in 1997). When the band temporarily disbanded in 1983, Morgenstein joined fellow Dreg Steve Morse to form the Steve Morse Band, with whom the drummer recorded two albums.\n\nIn 1986 Morgenstein moved to New York City and soon met singer/bassist Kip Winger and guitarist Reb Beach. Winger’s self-titled 1988 release went platinum in the U.S. and led to an American Music Award nomination for Best New Heavy Metal Band. Follow-up In The Heart Of The Young also went platinum. Although the group disbanded in 1993, they have since reunited on several occasions. Morgenstein also appeared on Kip Winger’s solo albums This Conversation Feels Like A Dream (1997) and Songs From The Ocean Floor (2001). Rod has also taken part in numerous prog-rock side projects and supergroups, such as the Rudess/Morgenstein Project, Platypus, and the Jelly Jam, featuring members of Dream Theater and King’s X.\n\nMorgenstein, who is a longtime columnist for Modern Drummer and a member of the 2011 MD Pro Panel, has released numerous instructional videos, CDs, and books, and is currently a professor of percussion at Berklee College of Music."}, {"url": "https://www.musicradar.com/news/drums/rudess-morgenstein-project-announce-four-us-dates-586606", "page_content": "Dream Theater keyboard master Jordan Rudess and Dixie Dregs/Winger drum icon Rod Morgenstein are getting their old gang the Rudess Morgenstein Project together again for a select number of shows in the US next month.\n\nMorgenstein tells MusicRadar that the duo have recorded a sizable amount of new material as a possible follow-up to their 1997 self-titled album. \"The only problem we have is finishing things,\" he says. \"With our schedules, it's difficult to know if and when we will ever get to it.\" He adds that \"some of it is really, really good.\"\n\nIn recent years, RMP have performed in Poland, Costa Rica, Venezueala, Mexico, Germany and the UK. After a well-received show at Boston's Berklee College Of Music this past summer, the two decided to fit in more dates before the year was up. \"We just have a great time hanging out and jamming,\" says Morgenstein. \"Whenever our schedules can line up, we're going to try to do this sort of thing.\"\n\nMorgenstein figures that setlists will include material from the original RPM studio album along with some selections from Rudess' solo discs. In addition, the two will perform the title track to Emerson, Lake & Palmer's Tarkus, which Rudess covered on his 2007 album, The Road Home.\n\n11/19 - Washington, DC - U Street (tickets)\n\n11/20 - Philadelphia, PA - World Cafe Live (tickets)\n\n11/21 - Englewood, NJ - Bergen PAC (tickets)\n\n11/22 - Bay Shore, NY - Boulton Center (tickets)"}, {"url": "https://www.metal-rules.com/2007/03/08/winger-drummer-rod-morgenstein/", "page_content": "Spread the metal:\n\nINTERVIEW AND LIVE/INTERVIEW PICS BY MARKO SYRJALA\n\nTRANSCRIPTION BY ANDY OSBORN\n\nRod Morgenstein’s professional music career began as a founding member of the groundbreaking group Dixie Dregs in the 70’s. Morgenstein’s unique and dynamic drumming style has led Rod to win many awards, such as the Best Progressive Rock Drummer award in Modern Drummer Magazine’s Reader’s Poll five years in a row. He has worked with such names as the Steve Morse Band and Jordan Rudess, but there’s no doubt that he’s best known for his work with 80’s multi-platinum hard rockers Winger. The band released three albums before they wrapped it up in late 1993. Each member then went their separate ways to pursue individual goals. Kip Winger has released several solo albums. Reb Beach has worked on many projects and is now a member of the legendary Whitesnake. Paul Taylor did some commercials and projects, and Rod himself became an Associate Professor of Percussion at Berklee College of Music in Boston. He has also been doing different projects all the time. In 2006, Winger announced that the band would be back with the new album “IV.” Winger’s reunion tour reached Finland last October, and then I had a chance to sit down with Mr. Morgenstein himself and ask about the latest news and have a look back at some good old times.\n\nTHE REUNION, NEW LINEUP, AND FUTURE OF WINGER?\n\nTo be honest, I was surprised to hear the new album from you guys after 13 years. I have to ask why just now, why this album wasn’t released right after PULL, and what caused your breakup back in the day?\n\nWell, here’s the thing: I’ve been a professional musician for thirty years. I’ve played with many bands, and the most fun group of guys to tour with is these guys. We didn’t disband because we were fighting or enemies. It’s because Nirvana came on the scene in 1991, and it was essentially over for everyone. Record sales went from the millions down. “Pull” sold, and I think 300,000 records in America which by today’s standards, it’s like wow you’re happening, but back then, you had to go gold at minimum. So, what happened was MTV had been pounding our videos from 1988 until the end of 1991.\n\nWhen we came out with “Pull,” they said they would play “Down Incognito,” which was nice, but then they said, look, the alternative is in, and it’s just time to go out to pasture. When MTV suddenly stops playing all of the videos from metal bands, it sends a message to the record labels, and the labels say maybe it’s not worth pumping all the money into this music anymore. Then, everything happens at once. All the magazines are interested in Pearl Jam and Nirvana. We said, look, we had a great run. We have other things in music that we do, so let’s just let it end on a high note and see what happens down the road. Kip Winger is one of my best friends, and I’ve worked on his solo records, and then there are this Italian label, Frontiers, which for the last few years has been telling us we’re one of their favorite bands, so when you’re ready to do a record let’s do it. So, the time was right, and we’re all happy we did it. It was a wonderful opportunity to get together again. Four years ago, we got together to do the Poison and Cinderella US tour, which was a lot of fun. We just enjoy being together, and Reb is the funniest guy I know, so you just spend half the time laughing.\n\nWhat kind of expectations do you have regarding the sales of this new album?\n\nWell, we didn’t want any illusions with this record, so we said, let’s just do the record to remind people that Winger was a vital band and had something to say. And if all of our schedules line up and we can do some touring, let’s do it to see how much of our audience is there, to see if it’s even worth keeping it alive.\n\nDo you think this reunion is permanent and that Winger will continue making more albums in the future?\n\nWe’re not trying to think that far ahead. We all hope that will happen in our hearts, but if no people show up to a show, then you know, how much can you bang your head against the wall? But I think that turnouts will be pretty respectable. We’ll see. We have no idea if it’s going to sell a few thousand or even fifty-thousand or more?\n\nWhat happened to Paul Taylor. Why he’s not a part of this reunion?\n\nYeah, he’s taking another path. He wished us all well. He was coming in and hanging out with us while we were recording. Paul’s been very successful writing music for television. He co-wrote the theme for “Sabrina, the Teenage Witch,” and he’s making an incredible living off of that, and he’s the one that wrote “Miles Away,” which was our biggest hit. He’s now living in Nashville, pursuing a songwriting career. Yeah, touring is not something he’s interested in right now.\n\nYou have two new members in the band. Let’s start with guitarist John Roth. I know he has toured with you guys before, and he also plays on some of Kip’s solo stuff?\n\nWhen Paul left the band after the second album, we auditioned not many guys, but Johnny came to us through our manager at the time, who was a partner with Bon Jovi, Skid Rod Motley Crue. So Doug was managing us for PULL, and John was involved that Doug was also with, and he told us that he knew the perfect guy. He said he’s a great guitarist, a great singer, and he can also play keyboards. He was exactly what we wanted. One minute into jamming with him, we knew we didn’t want anyone else. The record was done, and we were like, wow, we’ll be touring. So the record was just me, Kip, and Reb.\n\nThen keyboardist Cenk Eroglu, he’s originally from Turkey, right?\n\nThatïs correct.\n\nHow did he end up being in Winger?\n\nYou know originally what happened was, this guy sent an e-mail to Kip saying, “I am from Istanbul, Turkey, and you are my favorite singer, Winger is my favorite band. I have to work with you.” So, I think he sent Kip some of his music, so Kip didn’t want to just fly out to Turkey, not knowing what to expect. But, it turns out he has some fame in Turkey as a performer, but he’s also a successful producer. Kip was actually blown away by some of the music, and then he made some trips to Istanbul, and the two of them were coming up to me with this incredible music that blended eastern and western culture. There were eastern percussion ensembles along with Kip’s voice, so I put the drums down to a bunch of music. They worked so hard on it over two or three years, and in the final analysis, when they got an album’s worth of music, they felt like they didn’t quite meet their mark. So, they want to continue on that path until they hit exactly what their vision was. In the meantime, Cenk used one or two tunes for his solo record, so that’s how that whole thing came about. Cenk played on the new record. He was in Nashville putting down records. But we couldnï¿½t work out his visa issues for the tour here.\n\nI have heard the new album a couple of times now, and I would say that my first impression is that it’s an even heavier album than “Pull” was. Was that on purpose?\n\nYou know, that’s such an easy question to answer. Well, you’re a musician, right? Anyone wants to have a career in music, so in a perfect world, we don’t listen to anything, and we just write music that is 100% what we want to do. But, when you do that, most probably never get a record deal because nobody knows where to fit it or how to market it, so it’s too unique. What most musicians do when they want to have a career is listen to everything that’s happening in the music business and say, is what I feel inside of me somehow compatible with trying to use some of the elements of music that labels are signing now to enable us to get a deal? I think that’s part of how a lot of musicians end up getting record deals. A lot of musicians are into a lot of different kinds of music. My career has spanned so many different styles. I still play with Steve Morse and The Dixie Dregs making this instrumental fusion music. I play with Jordan Rudess, the keyboardist from Dream Theater. We have a duo where we do this over-the-top progressive stuff. I also play in a Jazz Is Dead band, which had Alfonso Johnson and people for many years.\n\nWe would do this jam band Grateful Dead kind of stuff. Then I would play with the bassist from Dream Theater and Ty Tabor from King’s X to do this like power-pop so, what is the music that I love? I love it all! Whether, it’s the heavy metal of Winger or the fusion of the Dregs. The fact is that the first two Winger albums sounded the same, and “Pull” was a bit heavier, which is even heavier than that. To me, it’s not that you at one time were doing something that you were not true to, and this is something that you are true to. It’s just that musicians evolve. We go through a lot of changes.\n\nSo are you saying that Winger is heavy metal?\n\nMy career started the day that I got out of college with the Dixie Dregs. Nobody ever knew how to label us because we did rock and fusion and country, and they’d say: what are you guys? We’re just music! Once you put a label on it, everybody has a perception of what it is, and they start throwing the shit at you. Well yeah, most people would say that Winger is heavy metal, but if you hear “Blue Suede Shoes.” That’s not metal. That’s pop! And it almost has some progressive edges to it, but what about this other song? So, I don’t know what to call it anymore. I just want to call it music!\n\nGOLDEN 80ï¿½s WITH BEAVIS AND BUTTHEAD…\n\nBack in the 80ï¿½s Winger was often called one of the wimpiest bands existing. Why?\n\nYeah, well, I look at those pictures now, and I just laugh. I have great memories of it all, but some of it looks really silly. People have to realize that back then when we were doing it, all those bands were very serious about it. We would go to great lengths to have clothing made and our haircuts and having it permed. It looks funny now; it’s kind of like when you watch movies of England where they’re wearing funny hats. To them, it was very serious, and so back then, we didn’t look any better. We look like a bunch of clowns! Back then, it was what everyone was doing. The audience loved it, and they were buying millions and millions of records, so something was working. I dare say that a lot of it. The guitarists from the metal bands were certainly way better than the guitarists that followed in the alternative bands—Reb Beach, Andy Timmons from Danger Danger, etc. I could just go down lists of these great guitarists.\n\nWhat did you think about the character of “Beavis and Butthead” where they wore a Winger t-shirt?\n\nIt helped nail the coffin shut for our career. I remember watching it and laughing, then suddenly, I saw this nerdy, wimpy character, and he was wearing a Winger shirt. Not only that, but his parents wore Winger shirts! We tried to determine if we did something to the show’s creator, like why he chose us. Out of all the wimpy bands: Winger, Bon Jovi, White Lion, Danger Danger. Why Winger? We were never able to figure it out. Yeah, that really hurt, but it’s also very flattering. It means you mean something when someone chooses you to poke fun at.\n\nBeau Hill produced the first two Winger albums. How was it working with him back in the day?\n\nWell, Beau and Kip were best friends when they were teenagers. Then Beau was in a band called Airborne that had a record deal, but nothing really happened. Somehow, he ended up producing Rattï¿½s first album, so he came on the map as a producer. He’s the one that kind of secured the first Winger deal, now that he was a hot producer. He went to Atlantic Records and got us a deal, so he was the logical choice to produce the records. But what happens so often in the music business is you kind of live life, play your gigs, do your records, but you don’t see eye to eye how it should be done. I wasn’t particularly crazy about some aspects of the production, but many of the records were like that. I was just listening to “Seventeen,” and there are no cymbals! And the snare is the loudest thing, and it’s even louder than the vocals.\n\nYou mentioned that he produced Ratt’s first album; I think he produced five of their albums. There are not many cymbals there, either?\n\nIt’s part of his productions. There’s no reverb, and now when you listen to it now, it’s wimpy. I mean, listen to that and then listen to “Back in Black.” For years, Kip has wanted a chance to remix those albums.\n\nPull was produced by Mike Shipley, and that album was something very different?\n\nWe know in some ways that it should have been the first Winger album. It’s not that hindsight is 20/20. It’s just that you kind of wonder: what if this came first? “Seventeen” is the song that put us on the map, and it also has the most jokes made about. The lyrics are stupid! But the music is very cool. It was just, you know, it was sex, drugs, and rock N roll back then. Many bands did songs like that, but that was the one that people made fun of.\n\nMaybe that song is the reason for the whole Beavis and Butthead thing?\n\nMaybe, but it also sold a million albums, so? “laughs.”\n\nMEETING SEPULTURA, TOURING WITH SCORPIONS, PLAYING WITH ZENO, AND ALMOST WORKING WITH BLACK SABBATH.\n\nYou have been to Finland a couple of times before. Do you have any memories of those visits? Many people still remember when Winger played in a Giants of Rock festival, and your slot was right after Sepultura.\n\n[Laugh] Yeah, we will never forget that. See, bands like Winger and Sepultura should not be on the same bill. They have a much more hardcore audience. I remember playing “Miles Away” “laughs,” and you don’t play a ballad like that for Sepultura’s crowd. They don’t mix. There are a lot of different styles in the rock genre, and we talk about that. We remember that night. The sun was shining, and it was like noon PM-midnight. It was great. It was nice meeting the Sepultura guys because they were fans of the Dixie Dregs, so it was cool for me.\n\nI remember that once you played Finland with the Scorpions?\n\nYeah, that was in 1991. You know what? Scorpions were the first band that Winger ever played with. We weren’t a band that played clubs and eventually got a deal. We were musicians that did demos, our record came out, and suddenly our first show was on tour with the Scorpions in America. That was in September or October 1988.\n\nSpeaking of Scorpions, I’m going to meet with former Scorpions bassist Francis Bucholz in a few weeks. He’s now actually playing in Uli Jon Roth’s band, and we will see them in Sweden.\n\nHe’s playing with Uli?! You’re going to see them? Could you say HI! to both of those guys for me? I used to be in a band with Uli’s brother, Zeno, so it was a real thrill for me. I auditioned for them in New York City, and Uli was there too. I played with them, and that was really cool. So, I moved over to Hannover, Germany, then went to England to do a Black Sabbath tour. But, back then, Black Sabbath was only Toni Iommi. Eric Singer was on drums and Ray Gillen on vocals. Dave Spitz played bass, and there was the keyboard guy, Geoff Nichols. So, we did a tour of the UK with them.\n\nHow was that tour?\n\nIt was good. It was terrific. Zeno was a great man. It was a comedy of errors that made that not happen. They had signed the biggest record deal in the history of music as a new band. That’s how huge it was. I think EMI England, when they signed Zeno, thought that they would be the next Queen. We would drive around London and see billboards for Guinness Beer, and the next one was Zeno’s new album. They were spending huge amounts of money on it, but it just didn’t take.\n\nYou never recorded albums with them?\n\nNo, the record was just about to come out. They had three different drummers and producers on this record. I think that’s what part of the problem was. It was just the three guys in the band, and they just kept plugging in new musicians and different producers, and they recorded all over the world and spent, I don’t know how many hundreds of thousands of dollars on that record. By the time I got there, the writing was on the wall. I thought it was a good record, but who knows what goes on behind the scenes at labels? I’m excited; the last show that Winger is doing is in Nottingham, the UK, at this thing called Fire Fest. It’s a bunch of bands and one of the bands is called Fair Warning and the bass player from Zeno, when I was in the band, is going to be there. I’m really looking forward to seeing him.\n\nHow about Black Sabbath and the album “The Seventh Star”? You almost ended up joining the band in 1985?\n\nI think that was supposed to be a Tony Iommi solo record, and Glenn Hughes was the singer. You know what, it’s funny; I met Tony and Glenn in Atlanta when they were recording that record, and that’s where I was living. I was friends with Jeff Glixman, who I recently saw again at a Kansas concert in New York City. He used to be their producer. So I was living down in Atlanta in the 80s, and when Tony was recording the album, Jeff said, “Hey, you should come in and jam with Tony because I don’t know if Eric will be able to tour with them.” So, I went in and jammed with him, but I know I did a terrible job because I hate to confess this. I didn’t know a single song by Black Sabbath.\n\nWhen I was growing up, I listened to Led Zeppelin, Jethro Tull, Jimi Hendrix, and Cream. Jethro Tull was my favorite. Back then, because I’m very different now, Black Sabbath was too raw and basic. It was much simpler, like, you hear the song, and if you play an instrument, you can figure it out if you listen to it. Jethro Tull takes a lot more work. I was more in that mode of everything having to be complicated. I have really come like I’m going backward in a lot of ways in my older age. Now, I love the more simple, all about the vibe music that’s not just about the notes. So, when I went in to jam with Tony Iommi, I didn’t know anything. Sure I may have heard Ozzy’s voice saying, “I am Iron Man,” you know? That’s all I’d ever heard. Like an idiot, I didn’t even think to listen to Sabbath records before going in. All I thought in my mind was, “Oh right; he’s a rock guitarist. I’ll just hit my drums as hard as I can and not even play fills.” So, he was jamming, and I would start playing, and I had all these tom-toms that I wasn’t even using. Then, after the fact, I listened to some records, and Bill Wards uses toms all the time. So, I was clueless, is what I’m saying. I didn’t do my homework. Maybe if I did, I would have had a shot at playing with him. I think Eric Singer was already coming in to do “Seventh Star.” Eric is a great drummer, a great drummer.\n\nHe currently does a great job with KISS and Alice Cooper.\n\nYeah, when Winger toured with KISS, it was with Eric. I was becoming very friendly with him. That was in 1990, fall of 1990. Because then we came to Europe in December and played with Scorpions until 1991.\n\nDIXIE DREGS AND JORDAN RUDESS\n\nHow did your first band Dixie Dregs originally start?\n\nI started in college. We were all music students. I also played keyboards and piano, and I wasn’t sure if I wanted to be a drummer or piano player. I was in an improvisation class playing the piano. I played with many guitar players and me like fifteen of them. And one of them really stuck out to me. He had long blonde hair, while all of the other guitarists had big fat jazz hollow-body guitars, and there was the one guy who played like a bastardized Telecaster with four pickups and a Stratocaster neck and Gibson frets, and he didn’t sound like a jazz guitarist. The teacher was always yelling at him, saying, “Morse, can’t you sound like everybody else?” And I said this guy is unbelievable. One day he came up to me, and we didn’t know each other at all. He heard that I played the drums, and he told me his drummer had just broken his arm surfing. And he asked to fill in for some rehearsals while he was gone, and I said sure. I went into the first rehearsal, and they were doing Mahavishnu Orchestra covers, which was my favorite band; that band changed my band. I’d never heard anything like that. So we’re doing these covers, and we have an electric violinist there. Steve’s songwriting, I thought I’d died and gone to heaven. Here I was playing my favorite kind of music, and about a month or two later, the other drummer came back, and we started playing as a double drum band. But he was more of a meat and potatoes drummer, so he couldn’t really play in the different time signatures. It just wasn’t his thing. Everybody felt really bad, and we didn’t know what to do. Eventually, he just said, this isn’t my thing, and he left. So, I was the guy.\n\nYou guys have stayed very close?\n\nYeah, we have. The Dregs disbanded, and then Steve started the Steve Morse band, and he asked me to be a part of it. I did that for two records, and then Kansas reformed and asked him to join them. He told me he wanted to check it out, and living in Atlanta, we were all down south. I moved to New York, which is where I’m from originally. Within a year, I met Kip and Reb when they were doing demos and getting rejected from record labels left and right: “You suck, you suck, no, no, no!. So it was just luck and timing. When I met them, I was up in the offices of a management company. Then, I was leaving, and I didn’t know anybody was still there; Kip and Reb were using some recording gear. I expressed an interest in their music, and they said, okay, we’ll put you on the list of the twenty drummers that want to audition. They called me a few days later and said, “Hey, do you want to get together and jam?” Kip had left Alice Cooper by that time. He was doing session work at that time. He played on a Bee Gee’s record and did things like that.\n\nI have understood correctly, lice wanted to change the band’s direction, and that’s why Kip left the band?\n\nI thought Kip just left on his own. They were terrific friends, Kip and Alice.\n\nHow about Jordan Rudess (Dream Theater). You guys have been doing different projects over the years. How did you meet him in the first place?\n\nWell, the Dregs were in the midst of touring in 1994, and our keyboard player wasn’t able to do the last two months of the tour, and none of us had ever heard of Jordan. Until Dream Theater came around, no one had heard of him. He was recommended to us by Jan Hammer, the guy who also made Miami Vice’s music. He’s one of my favorite Keyboard players. So, Jordan sent us one of his solo records, and we were just floored by it. When he came down, we told him that he was in without an audition. Within three days, he learned the whole set just by listening to the songs. He has perfect pitch, he was a child prodigy, and he discovered his genius when he was nine. He came down to Steve Morse’s house, and he played everything perfectly. He would also say things like, “Did you also need me to play the bass line there?” [Laughs] It was unbelievable! The first show that he played with us. We had rehearsed on Thursday, and on Friday, we played a show in Florida. In the middle of the show, the guitar, violin, and bass rigs went down. But, drums can play whether the PA is working or not. And the keyboard PA was still there. So, rather than stop, we just started jamming, and it went on for, I don’t know, five or ten minutes. Everybody’s rigs were then fixed, and we went on to the show. We talked about it afterward and decided that we had to do something together. So, we spent 1995 and 1996 doing the Rudess/Morgenstein CD, which came out at the end of 1997. Every year, he and I managed to do a handful of gigs. Just this past May, we played in Venezuela and Costa Rica. We played with a Brazilian band called Angra, a good band.\n\nThen we headlined in Costa Rica, just keyboards and drums! He is so unbelievable. No keyboard player in the world can do what he does. Almost the entire show is live. It’s not like he presses a button to play a sequence. He programs the keyboard so the sustain pedal knows not to sustain the bass and leaves only the chords. Programs in pitch bends and stuff like that. We’re in the midst of doing another record. We have a lot of it done. So he’s doing that, and he has another Dream Theater and solo record that he’s working on. So, I’ll be doing some of that with him.\n\nI heard a rumor about Dixie Dregs and Kansas going on tour together. Is that true?\n\nThat I have never heard about, the Dregs manager is also the manager of Dream Theater. Actually, I live with him because I’m a professor at Berkley in Boston. He’s been trying for the longest time to get the Dregs out there, hooking us up with bands like King Crimson or something, instead of us doing the clubsï.\n\nSo that’s not going to happen anytime soon?\n\nNo, it’s not, but that would be awesome.\n\nWell, this will be the very last question. Will you guys be recording any shows from this current Winger tour?\n\nYeah, we were hoping to film a live DVD on this tour, but we’re not good without Cenk. The photo has the five of us, and he’s an essential part of the puzzle. We need to have the keyboards on many tunes plus another vocal because he’s a powerful singer. Our agency is looking for a tour for us in the US where we would have Cenk, and then we could do the live DVD.\n\nThanks for your time Rod!\n\nFOR MORE INFO, GO TO:\n\nWWW.WINGERTHEBAND.COM\n\nWWW.RODMORGENSTEIN.COM\n\nSPECIAL THANKS TO STEFAN FROM ZINK MUSIC AND MIKKO SAUKKONEN FROM BONNIERAMIGO FOR SETTING THIS INTERVIEW UP !!\n\nMORE PICTURES FROM WINGER SHOW IN HELSINKI 2006 !!!"}]}