{"Matthew Aylmer was an Irish soldier.": [{"url": "https://www.dib.ie/index.php/biography/aylmer-matthew-a0287", "page_content": "Aylmer, Matthew (c.1650–1720), 1st Baron Aylmer of Balrath , admiral, and commander-in-chief of the fleet, was second child and second son among three sons and one daughter of Christopher Aylmer (d. 1671), 1st baronet, of Balrath, Co. Meath, and his wife Margaret, third daughter of Matthew Plunkett, 5th Lord Louth. Employed to recruit soldiers in Munster, and proving unsuccessful, he distinguished himself c.1676 when he and his brother Gerald, at their own expense, recruited and transported 160 soldiers to Holland to fight against the French. Under the patronage of the duke of Buckingham (1628–78), he entered the navy as a lieutenant (1678), was promoted captain (1679), and served in the Mediterranean.\n\nIt was probably while serving in Holland that he gained his admiration for William of Orange (qv), which inspired him to join the revolution of 1688 and become involved in intrigues and negotiations to secure the loyalty of the English fleet for William, for whom he acted as envoy. After the battles of Beachy Head (1690) and La Hogue (1693), he was promoted rear-admiral (1693) and vice-admiral (1693). As commander of the navy (1694–1702) he skilfully concluded treaties with the regencies of Tunis, Tripoli, and Algiers in 1698. The following year, for reasons not entirely clear, he was superseded as vice-admiral and retired from active service; he was made governor of Deal castle and remained a commissioner of the navy till 1702.\n\nHe entered parliament on the admiralty interest, representing first Portsmouth (1695) then Dover (1697–1713, 1715–18, 1720). A dedicated whig – described by Jonathan Swift (qv) as ‘a virulent party man, born in Ireland’ (Sedgewick, 426) – he was appointed commander-in-chief of the fleet (1709–11). With the return of the whigs to power, he was appointed admiral and commander-in-chief of the fleet (1714–18), ranger of Greenwich Park, and governor of the Royal Hospital of Greenwich, London (1714), where he founded the hospital school for sons of seamen. Serving as lord of the admiralty (1717–18) – he was succeeded on the admiralty board by his son-in-law, Sir John Norris (1671–1749) – he was appointed a rear-admiral of Great Britain (1717–20) and created baron of Balrath in 1718. He died 18 August 1720 in Queen's House, Greenwich, and is buried in Greenwich church.\n\nHe married (c.1677) Sarah Ellis (d. 1710); they had one son – Henry, 2nd baron – and three daughters. Two three-quarter-length portraits of Aylmer are in the National Maritime Museum, Greenwich: one after Sir Peter Lely, showing Aylmer as a young man, and one (c.1692–3) by Jonathan Richardson."}, {"url": "http://www.biographi.ca/en/bio/whitworth_aylmer_matthew_7E.html", "page_content": "WHITWORTH-AYLMER, MATTHEW, 5th Baron AYLMER, army officer and colonial administrator; b. 24 May 1775, the eldest of five children of Henry Aylmer, 4th Baron Aylmer, and Catherine Whitworth; m. 28 July or 4 Aug. 1801 Louisa Anne Call, daughter of Sir John Call; they had no children; d. 23 Feb. 1850 in London.\n\nMatthew Aylmer was only 10 when he succeeded his father in the ancient Irish barony of Aylmer and 12 when he entered the 49th Foot as an ensign. He became a lieutenant in 1791 and a captain in 1794. In 1798 he participated in an abortive British raid on Ostend (Belgium), was captured, and spent six months in a French prison. He won high praise from his commanding officer, Lieutenant-Colonel Isaac Brock*, for his role in the battle of Egmont-op-Zee (more properly Egmond aan Zee, Netherlands) in 1799. Two years later he rose to the rank of major in the 85th Foot, and in 1802 to lieutenant-colonel; however, he was then placed on half pay until June 1803 when he joined the Coldstream Foot Guards. On 25 July 1810 he became a colonel and an aide-de-camp to the king and on 4 June 1813 a major-general. He served as the assistant – and then from January 1812 as the deputy – adjutant general to Lord Wellington’s army and commanded a brigade in several major battles of the Peninsular War, during which he was awarded the Military Cross with one clasp. He was given a kcb on 2 Jan. 1815 and knighted on 6 June. In 1814 he had been appointed adjutant general of the British forces in Ireland, where he remained until 1823. From 1823 to 1830 he was without employment and spent much of his time wandering across Switzerland and Italy. He was promoted lieutenant-general on 27 May 1825 and that year, upon the death of his uncle, the Earl of Whitworth, he changed his family name to Whitworth-Aylmer. He was made colonel of the 56th Foot in 1827 and transferred to the 18th Foot five years later.\n\nAylmer’s enforced idleness ended when Sir James Kempt* resigned the administration of Lower Canada. In June 1830 the secretary of state for the colonies, Sir George Murray, who had also served with Wellington in the Peninsular War, offered the position to Aylmer. On 11 August Aylmer was appointed commander of the forces in North America, and on 13 October he landed at Quebec; he assumed control of the administration one week later. His commission as governor-in-chief was dated 24 Nov. 1830, but it was not formally registered at Quebec until 12 Feb. 1831. Aylmer had few obvious qualifications for his position; he had never served as a civil administrator, he had no political experience, and he came to Lower Canada, by his own admission, “a perfect stranger to all that relates to the country.” Yet Murray’s choice was based on more than friendship. Aylmer was one of the more distinguished and capable officers of his rank, he was a francophile, and, as Louis-Joseph Papineau* noted, he spoke French “with the greatest ease and elegance.” Although leaning to the conservative side in British politics, he was not a partisan, and the reformers in the Canadas, reassured by their contacts in Britain, received him as “an able and clever man conciliatory in his disposition, liberal in his principles, and cincerely [sic] anxious to do good.”\n\nRecognizing his lack of knowledge, Aylmer none the less predicted that he would soon “be out of the Awkward Squad.” He embarked on a series of tours which eventually took him to every part of Lower Canada, and he pronounced himself pleased with “the country, the people and the Climate.” He and Lady Aylmer took their viceregal responsibilities seriously, contributing generously to a variety of causes, such as an emigrant fund, the Female Orphan Asylum, and the Quebec Driving Club (one of a number of organizations of which Lady Aylmer became patroness). They sought to foster the arts and culture, and attended many community activities, from ploughing matches to annual races in Trois-Rivières where Aylmer donated a silver cup to be awarded for a horse bred within the province. A wealthy man, Aylmer entertained frequently and lavishly at the Château Saint-Louis, the governor’s residence; yet he avoided the error “into which most of our Governors have fallen . . . ,” noted the Montreal reform newspaper, the Vindicator and Canadian Advertiser, “of attempting to impress on the minds of the ‘natives’ a something transatlantically superior pertaining to themselves.” During a visit to the Indian reserve at Lac des Deux Montagnes he joined in the dancing when “obliged” to do so.\n\nAylmer wished particularly to convince French Canadians of his benevolence. Shortly after his arrival he donated money for a tablet over the spot “where lay the remains of brave Montcalm [Louis-Joseph de Montcalm*].” He disagreed vehemently with those who advocated a policy of assimilation, arguing that there were not British subjects “more loyal and true – than the People of Lower Canada” and that assimilation would weaken their loyalty and drive them into the arms of the United States. He defended the seigneurial system and sought permission to grant seigneurial lands under crown control to French Canadians who could not afford to purchase on freehold tenure. He exhibited a genuine desire to distribute government patronage with the utmost impartiality, reintegrating militia officers whom a predecessor, Lord Dalhousie [Ramsay], had dismissed for opposition to the administration, increasing the number of French Canadians on the bench, ensuring a balance between francophones and anglophones on the commission of the peace, and making 8 of his first 14 appointees to the Legislative Council French Canadians. In 1831, to prove that he was “free of all party connections,” he offered seats on the Executive Council to Patriote leaders Papineau and John Neilson. Although both refused, Aylmer successively appointed the francophone reform members of the House of Assembly Philippe Panet*, Dominique Mondelet*, and Hugues Heney. Undeniably, he did not go far enough; the Legislative and Executive councils and the high echelons of the civil service continued to be dominated by anglophones unsympathetic to the demands of the assembly. None the less, he went as far as, and at times farther than, his superiors in London wanted and, at least initially, he convinced Papineau that “he likes and desires the good of the province.”\n\nThe legislature met for the first time under Aylmer in January 1831 when, labouring under “a severe indisposition,” he delivered his speech from the throne “literally from my bed.” Throughout the session he worked diligently to remedy the grievances of the assembly, many of which, he admitted, were “well founded.” He introduced economies in the civil service, presented nearly all the executive documents requested by the assembly, protested to the British government delays in examining reserved colonial legislation, refused to bend regulations for interested parties, demanded more rigorous standards in accounting for public funds, launched an investigation of abuses in the land-grant system, and induced the judges (with the exception of Chief Justice Jonathan Sewell) not to attend the Legislative Council while the Colonial Office deliberated on a long-standing demand for their exclusion from that body. In proroguing the legislature in March, he enquired for “any stray complaint” which the assembly had neglected.\n\nAylmer’s most controversial effort to appease came after the assembly petitioned for the dismissal of Attorney General James Stuart*, an outspoken opponent of the Patriote party, at the end of the session. Under pressure from the assembly, in September Aylmer suspended Stuart pending adjudication of its charges in Britain. Reprimanded by the Colonial Office for suspending Stuart before he was given the opportunity to defend himself in the assembly, Aylmer rightly pointed out that not to have acted would have provoked “the utmost degree of ferment and agitation.” In November 1832 the Colonial Office dismissed Stuart, who unsuccessfully challenged Aylmer to a duel. He was hailed as a martyr by those among the British minority in the colony who believed that Aylmer “dare not displease Mr. Citoyen Papineau by whom . . . he is held completely under cow.” Aylmer’s decision had enhanced his reputation with the reformers, however, and particularly with Papineau, who had earlier entertained the Aylmers at his country estate in June 1831. But though “on good (I may say cordial) terms” with Papineau, Aylmer was aware that a great gulf existed between them on a number of questions.\n\nFor more than a decade the main preoccupation of the assembly had been to obtain control of the provincial revenues, including those reserved to the crown by the Quebec Revenue Act of 1774 [see Sir Francis Nathaniel Burton*]. Murray’s Whig successor at the Colonial Office, Lord Goderich, instructed Aylmer to submit a pared-down list of estimates to the assembly and to request a permanent civil list preparatory to a surrender of the crown revenues. The assembly paid little attention to Goderich’s estimates and none to his request for a civil list, although it did vote supplies for one year. Ignoring Aylmer’s advice to the contrary and influenced by his parliamentary under-secretary, Lord Howick, Goderich introduced a bill into parliament in the summer of 1831 surrendering the crown revenues unconditionally, and in September he ordered Aylmer to reconvene the legislature and again request a comparatively modest civil list. The assembly, however, refused salaries to several officials on Goderich’s list and, when Aylmer foolishly tried to coerce it by hinting that he would reserve any bill deviating from Goderich’s intentions, it refused permanent salaries to any officials. It seems unlikely that Goderich’s proposals, which were rejected by 42 to 9, would have been accepted by the assembly even had Aylmer been more astute, and the disappointed governor closed the session in late February 1832, acknowledging that his friendly relations with the leaders of the Patriote party had been sorely strained.\n\nIn 1832 deterioration of those relations accelerated after three French-speaking Canadians were shot by British troops on 21 May during a turbulent by-election in Montreal [see Daniel Tracey*]. Aylmer’s sympathies lay with the soldiers, and although he wrote to Papineau regretting the deaths, he refused to intervene in the subsequent judicial process, even when Papineau requested a military inquiry. He encouraged Solicitor General Charles Richard Ogden* to bring the case before a grand jury but later publicly praised the jury’s exoneration of the military. Thereafter Papineau pointedly declined to attend receptions at the Château.\n\nThe anger of the Patriote party was fuelled by a cholera epidemic which in 1832 killed more than 7,000 people in the colony. Aylmer had prepared for the outbreak by persuading the legislature to establish a quarantine station at Grosse Île and a board of health at Quebec and to authorize such facilities elsewhere when necessary. Although Aylmer conscientiously enforced the quarantine regulations and issued money to the boards of health and the Montreal Emigrant Society, the measures proved wholly inadequate. Moreover, by insisting that only the law officers of the crown should prosecute he hindered the work of the boards, and by encouraging flight to reduce the incidence of cholera in the cities he contributed to the spread of the disease. Yet, on balance, he did not deserve the censure of the assembly, which also criticized him for issuing funds without its approval and for failing to control the influx of immigrants. In fact, Aylmer did wish to limit immigration and proposed to raise money by a tax on immigrants. When the assembly met in November 1832, it was in an angry mood; it declared Mondelet’s seat vacant on his appointment to the Executive Council, passed a supply bill making no provision for a civil list, which the Legislative Council felt compelled to reject, and adopted an address, similar to one it had itself rejected in the previous session, demanding an elective legislative council.\n\nTo Aylmer these actions demonstrated intransigence, and he requested authorization from London to use the unappropriated funds surrendered to the legislature by Goderich’s Revenue Act of 1831. Edward George Geoffrey Smith Stanley, later Lord Stanley, who replaced Goderich at the Colonial Office in April 1833, sympathized but would not act until the assembly had been given an opportunity to reconsider. Consequently, when Aylmer reconvened the legislature in January 1834 he virtually invited a confrontation. He refused to grant the assembly contingency funds of £7,000 and reserved 11 of the 12 bills passed by the legislature, disallowing the 12th. In return the assembly refused to vote supplies and passed 92 resolutions of grievance, including one demanding the governor’s recall. Asserting that the resolutions were tantamount to a “Declaration of Independence,” Aylmer sent to Stanley a draft bill restoring to the government control over the revenues surrendered to the assembly by Goderich’s Revenue Act. Stanley was prepared to rescind Goderich’s act, and he referred the 92 resolutions to a select committee of the House of Commons, which he assumed would exonerate Aylmer. But Stanley was replaced in June 1834 by Thomas Spring-Rice, an easy-going Irish Whig, who was determined to avoid confrontation. Spring-Rice persuaded the Commons committee to attribute the conflict in Lower Canada simply to “mutual misconceptions.” After meeting with delegates from the assembly, he authorized Aylmer in September to borrow £31,000 from the military chest for unpaid salaries, assuming (erroneously) that the assembly would agree to repay the loan. Aylmer was dismayed by Spring-Rice’s actions and by the failure of the select committee to vindicate his conduct.\n\nIronically, Aylmer had led the Colonial Office to adopt a more conciliatory policy by insisting that the radicals in the assembly were losing support. During the sessions of 1833 and 1834 a rift had developed within the Patriote party, and Aylmer sought to exploit it, in particular by cultivating the hierarchy of the Roman Catholic Church, which opposed the policies of the radicals. Although a devout member of the Church of England, Aylmer was unusually tolerant in his religious views, wishing, for example, to alter the oath taken by justices of the peace so that he could appoint Jewish magistrates [see Aaron Ezekiel Hart*]. He attended mass in the Roman Catholic cathedral as well as in his own, refused to go to the services of a local Anglican priest who had protested Aylmer’s giving pecuniary aid to the Catholic Church, offered the Ursulines of Quebec refuge in the Château when a fire broke out in their convent, recommended that the Roman Catholic bishop be appointed to the Executive Council, and discouraged the Colonial Office from interfering with the Sulpician estates. In addition to cultivating the church, Aylmer deliberately chose his nominees for government posts from among the more conservative and “respectable” members of the Patriote party.\n\nAylmer’s appointments, however, had the effect of weakening the moderates in the assembly, since appointees lost their seats. In any case Aylmer was himself an inadequate instrument for multiplying vendus. Progressively disenchanted with what he considered to be the ignorance and ingratitude of French Canadians, he had begun by September 1832 to argue that “British influence in Lower Canada . . . must ere long be paramount” and that French Canadians must “finally reconcile themselves to a fate which cannot be averted.” In October he warned Sir John Colborne*, lieutenant governor of Upper Canada, that “when the king’s Subjects are spoken of as Foreigners and the Canadians as a Nation held in subjection by another Nation, it becomes the constituted Authorities to be upon their Guard.” By the spring of 1834 he was convinced that so long as the assembly was composed largely of French Canadians “the Constitution of the Province . . . will never work beneficially.” After the passage of the 92 Resolutions his primary concern was to reconcile the American-born population in the Eastern Townships and the rapidly growing Irish communities in Montreal and Quebec by appointing representatives from both groups to positions of importance. In June 1835 he strongly endorsed the application of “an association of gentlemen” from the townships for permission to purchase a large quantity of land on terms similar to those given to the British American Land Company [see Sir Alexander Tilloch Galt*], despite vehement opposition from the assembly.\n\nGradually, in fact, Aylmer had come under the influence of the old official group. In April 1834 he appointed David Chisholme, one of Dalhousie’s protégés, coroner of Trois-Rivières. When John Fletcher was unable to accept a promotion on the bench suggested as recompense for “the persecution of the House of Assembly to which he has been exposed for a series of years,” Aylmer recommended Samuel Gale*, who had acted as Dalhousie’s agent in England in 1828 and served as counsel to the officers in command during the Montreal “massacre.” This recommendation encountered strong opposition at the Colonial Office but was accepted under pressure from Aylmer on condition that the next vacancy would be given to a French Canadian.\n\nGale’s appointment alienated many moderates on both sides. Aylmer added to his unpopularity by refusing money to Montreal during a second outbreak of cholera in 1834 and by retreating to the governor’s cottage at William Henry (Sorel) during the height of the outbreak. Late that year the radicals won a sweeping victory at the polls, virtually eliminating the moderates from the assembly. Aylmer was not displeased with this result, arguing that it had “roused a feeling (hitherto dormant) in the British Population,” which might, however, “lead to very serious results, unless prudently managed.” He enthusiastically approved the formation of militant constitutional associations at Quebec and Montreal, and warned that the British minority were no longer prepared to accept domination by the assembly. He blamed the Patriote victory on “the Complacency with which the Canada Committee [of 1834] listened to sham Grievances” and predicted that the new assembly would be less reasonable than its predecessor. When the assembly met in February 1835, he made his prediction reality by refusing to issue money for the assembly’s contingencies. In return the house again refused supplies and complained that Aylmer was prejudiced against French Canadians. On 18 March Aylmer prorogued the legislature and called upon Britain to find a solution to the constitutional and financial impasse.\n\nThe solution adopted by the Colonial Office was to replace Aylmer. Spring-Rice had begun to search for a successor in the autumn of 1834 and had promised Aylmer another government if he would resign. But Aylmer wanted exoneration, and he suggested sending a parliamentary commission to examine the assembly’s charges. In April 1835 a three-man commission was appointed, but its head, Lord Gosford [Acheson], would also become Aylmer’s replacement. Aylmer bitterly resented his dismissal and was further antagonized when Gosford, who assumed control of the government on 24 Aug. 1835, dissociated himself from his predecessor. Aylmer’s mood was not improved by a terrifying return voyage, described by Lady Aylmer in Narrative of the passage of the “Pique” across the Atlantic (London, 1837). Once in England, he attempted without success to obtain approval of his conduct by refusing appointment as commander of the forces in Ireland unless he got it. However, he did coerce the government into awarding him a gcb, on 10 Sept. 1836, and on 23 Nov. 1841 he became a general, but he never obtained an English peerage, to which he felt entitled, or another administrative post. On 23 Feb. 1850 he died in his London home of an aneurysm of the heart.\n\nOn leaving the colony Aylmer had expressed regret that his “anxious endeavours to promote the general welfare of Lower Canada, should have fallen (as they have) so far short” of his initial expectations and burst into tears when the small crowd which had gathered at the wharf cheered. In truth, Aylmer is a tragic figure. He was well meaning and as competent as most of the military men sent to govern British North America following the Napoleonic Wars. But Lower Canada required a governor with political skill, and as Aylmer had noted in October 1831, “I cannot look for advice, or support here, beyond the circle of my own family composed of Soldiers like myself; & on . . . [the other] side of the Water I am totally destitute of Political Connexions.” Largely unprepared, he had found himself “called upon all at once to contend against those whose lives have been devoted to the Study of Law & Politics.” The Vindicator and Canadian Advertiser declared that Aylmer had “earned a niche in Canadian History, alongside of the Craigs [Sir James Henry Craig*] and Dalhousies, and gained for himself the execration of half-a-million people”; the Whigs blamed him for the failure of their conciliatory policy; and historians sympathetic to them, such as Helen Taft Manning, have echoed this assessment. Yet, although Aylmer was guilty of serious errors of judgement, much of the criticism of him is unfair. Many of his blunders, as historian Fernand Ouellet notes, “were more or less provoked,” and he never became as violently francophobic as Craig or Dalhousie, never lost his temper in public, never closed the doors of the Château to his opponents. He contributed to ethnic polarization in Lower Canada, but he was not responsible for it, nor could he, any more than Gosford, a civilian with considerable political experience, have prevented its development. Moreover, Aylmer was handicapped by the rapid changes of government in Britain during the early 1830s, serving under five secretaries whose views on Lower Canada differed sharply. Without “Political Connexions” in Britain, he was sacrificed to facilitate accommodation with the Lower Canadian assembly; the sacrifice, ironically, was in vain for by then the train of events leading to the rebellions of 1837–38 was probably irreversible.\n\nPhillip Buckner"}, {"url": "https://britishempire.co.uk/forces/armyunits/britishinfantry/rirwhitworthaylmer.htm", "page_content": "Matthew Aylmer was born in 1775 the eldest of 5 children of Henry Aylmer, 4th Lord Aylmer, and Catherine Whitworth. The Irish title was created in 1718, Baron of Balrath, County Meath. Aylmer never held an English title. He was a competent soldier, being praised for his conduct at Egmont-op-Zee by the CO of the 49th Foot, Isaac Brock, and receiving the Army Gold Cross after attending most of the battles in the Peninsular War. His time as Lieutenant Governor of Lower Canada was a bitter disappointment to him. He started with little experience of the job but great enthusiasm. He was determined to avoid the accusation of showing favoritism to the English and made an effort to treat French and English with equal fairness, but he was distrusted by the French, and the Legislature made life difficult for him. The Assembly passed 92 resolutions of grievance and demanded that the British government re-call him. He was ordered back to England the following year and two years later rebellion broke out. Whilst in office he supported his wife, Louisa, in her work during the Cholera epidemic of 1831-2, helping the sick and their dependants. She also took a great interest in education, visiting schools and bestowing prizes on the children. 1775 Born on 24th May\n\n1787 Inherited title of 5th Baron Aylmer\n\n1787 Ensign 49th Foot at the age of 12\n\n1791 Lieutenant\n\n1798 Taken prisoner for 6 months after abortive raid on Ostend\n\n1799 Distinguished himself at Egmont-op-Zee\n\n1800 Major 85th Foot\n\n1801 Married Louisa Anne Call, 4th Aug. No children.\n\n1802 Lieutenant-Colonel on half-pay\n\n1803 Transferred to Coldstream Guards\n\n1810 Colonel. ADC to the King up to 1812\n\n1813 Major General. Brigade commander, present at most battles of the Peninsular War\n\n1814 Adjutant General in Ireland up to 1823\n\n1815 KCB 2nd Jan, Knighted 6th June\n\n1823 Travelled in Switzerland and Italy for 7 years\n\n1825 Lieutenant General\n\n1825 Changed name to Whitworth-Aylmer on death of uncle, The Earl of Whitworth\n\n1827 Appointed Colonel of 56th Foot, 29th Oct.\n\n1830 Commander of British Forces in North America and Governor General\n\n1831 Lieutenant Governor of Lower Canada\n\n1832 Appointed Colonel of 18th Royal Irish Regiment, 23rd July.\n\n1834 Assembly of Lower Canada demand his re-call\n\n1835 Re-called to England\n\n1845 Promoted to General\n\n1850 Died in Eaton Square, Belgravia on 23rd Feb"}, {"url": "https://en.wikisource.org/wiki/Dictionary_of_National_Biography,_1885-1900/Aylmer,_Matthew", "page_content": "​AYLMER, MATTHEW, Lord Aylmer (d. 1720), admiral and commander-in-chief, was the second son of Sir Christopher Aylmer of Balrath, county Meath, and entered the navy under the protection of the Duke of Buckingham, as a lieutenant, in 1678. Early in the following year he was advanced to the rank of captain; and he appears to have served almost constantly, during the next ten years, on the coast of Algiers and in the Mediterranean. In October 1688 he was appointed captain of the Swallow in the Thames, but at once gave in his allegiance to the cause of the Revolution. In 1690 he commanded the Royal Katherine, and, in the battle off Beachy Head, was one of the seconds to Sir Ralph Delavall who commanded the blue squadron; and in 1692, still in the Royal Katherine, was one of the seconds of the commander-in-chief at Barfleur. In February 1693 he was advanced to the rank of rear-admiral, and to that of vice-admiral in the following year, when he accompanied Admiral Russell to the Mediterranean. After the peace of Ryswick he was sent, in 1698, as commander-in-chief, again into the Mediterranean, principally to confirm the treaties with the regencies of Tripoli, Tunis, and Algiers; which he happily accomplished, and returned home towards the end of the next year. In November 1699, being, it is said, dissatisfied at the appointment of Admiral Churchill to the admiralty, he retired from active service, though he continued to act as one of the commissioners of the navy till July 1702. He took no part whatever in naval affairs beyond sitting in parliament as baron or member for Dover, till after the death of Prince George, and the retirement of Churchill in November 1709, when he was appointed commander-in-chief of the fleet. In the following July, whilst cruising in the Soundings, he fell in with a French squadron and convoy, of which only one merchantman and the Superbe, of 56 guns, were captured; the rest escaped, owing, it was alleged, to the ​haziness of the weather. The want of success served the new ministry as an excuse to supersede him, which they did in January 1711. He held no further command till the accession of George I, when he was again appointed commander-in-chief, ranger of Greenwich Park, and governor of Greenwich Hospital. This office he held till his death; and during that time succeeded in establishing the hospital school for the sons of seamen, which, from small beginnings, has been gradually developed into the magnificent institution of the present day. In April 1717 he became one of the lords commissioners of the admiralty, but he resigned the appointment early the next year, when he was advanced to be rear-admiral of the United Kingdom, and at the same time raised to the peerage as Lord Aylmer of Balrath. He died 18 Aug. 1720.\n\nA portrait, half-length, presented by his descendant, the fifth Lord Aylmer, is in the Painted Hall at Greenwich.\n\n[Charnock's Biog. Nav. ii. 35; Brit. Mus. MSS. Add. 28122-4; Official Papers in the Public Record Office.]"}, {"url": "https://www.geni.com/people/Matthew-Aylmer-1st-Baron-Aylmer/6000000007243781233", "page_content": "About Matthew Aylmer, 1st Baron Aylmer\n\nhttp://en.wikipedia.org/wiki/Matthew_Aylmer,_1st_Baron_Aylmer\n\nMatthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720) was an Irish Admiral of the Royal Navy.\n\nLord Aylmer, Admiral and Commander-in-Chief, was the second son of Sir Christopher Aylmer of Balrath, County Meath, and entered the Royal Navy under the protection of the Duke of Buckingham, as a Lieutenant, in 1678. Early in the following year he was advanced to the rank of Captain, and he appears to have served almost constantly during the next ten years on the coast of Algiers and in the Mediterranean.\n\nIn October 1688 he was appointed captain of HMS Swallow in the Thames, but at once gave in his allegiance to the cause of the Revolution. In 1690 he commanded the Royal Katherine, and, in the battle off Beachy Head, was one of the seconds to Sir Ralph Delaval who commanded the blue squadron. In 1692, still in the Royal Katherine, he was one of the seconds of the Commander-in-Chief at Barfleur. In February 1693 he was advanced to the rank of Rear Admiral, and to that of Vice Admiral in 1694, when he accompanied Admiral Russell to the Mediterranean, and was also appointed a Lord of the Admiralty. After the Treaty of Ryswick he was sent, in 1698, as Commander-in-Chief, again into the Mediterranean, principally to confirm the treaties with the regencies of Tripoli, Tunis, and Algiers. He returned home towards the end of the following year.\n\nIn November 1699, being, it is said, dissatisfied at the appointment of Admiral Churchill to the Admiralty, he retired from active service, though he continued to act as one of the Commissioners of the Navy till July 1702. He took no part whatever in naval affairs beyond sitting in Parliament as Baron or Member for Dover, till after the death of Prince George, and the retirement of Churchill in November 1709, when he was appointed Commander-in-Chief of the fleet. In the following July, whilst cruising in the Soundings, he fell in with a French squadron and convoy, of which only one merchantman and the Superbe, of 56 guns, were captured. The rest escaped, owing, it was alleged, to the haziness of the weather. The want of success served the new ministry as an excuse to supersede him, which they did in January 1711.\n\nHe held no further command till the Accession of George I, when he was again appointed Commander-in-Chief, Ranger of Greenwich Park, and the second Governor of Greenwich Hospital. This office he held till his death, and during that time succeeded in establishing the hospital school for the sons of seamen, which gradually developed into a magnificent institution. In April 1717 he became one of the Lords Commissioners of the Admiralty, but he resigned the appointment early the next year, when he was promoted to Rear Admiral of the United Kingdom, and at the same time raised to the peerage of Ireland as Lord Aylmer of Balrath. He had been elected Whig M.P. for Portsmouth in 1695, and for Dover in 1697, 1713, and 1715.\n\nA portrait, half-length, presented by his descendant, the fifth Lord Aylmer, is in the National Maritime Museum at Greenwich.\n\nAdmiral of the Fleet Matthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720), of Covent Garden, Westminster, and Westcliffe, near Dover, was an Anglo-Irish Royal Navy officer and Whig politician who sat in the English and British House of Commons between 1695 and 1720.\n\nAylmer was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support; the Prince's response ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer saw action at the Battle of Bantry Bay in May 1689, at the Battle of Beachy Head in July 1690 and again at the Battle of Barfleur in May 1692 during the Nine Years' War.\n\nAylmer became Commander-in-Chief of the Navy on 12 November 1709. However, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so a few months later. Following the accession of George I and the appointment of the Townshend Ministry, Aylmer was reappointed Commander-in-Chief on 5 November 1714. He was also appointed Governor of Greenwich Hospital: in this post he founded the Royal Hospital School for the sons of seamen.\n\nEarly career\n\nAylmer was the second son of Sir Christopher Aylmer of Balrath, county Meath, and Margaret Aylmer (née Plunkett), daughter of Matthew Plunkett, 5th Baron Louth. He served briefly in the Army as Ensign of foot in the Duke of Buckingham’s regiment from 1672 and then joined the Royal Navy as a midshipman in the galley HMS Charles in October 1677 before being promoted to lieutenant in April 1678. Promoted to commander on 19 January 1679, he became commanding officer of the sloop HMS Chatham and then transferred to the command of the prize ship HMS Date Tree in Summer 1679. He transferred again to the command of the fire ship HMS Castle in the Mediterranean Fleet later in the year, to the command of the fifth-rate HMS Swann on the Coast of Ireland in July 1680 and to the command of the fourth-rate HMS Tiger in the Mediterranean Fleet in January 1682, before becoming commanding officer of the galley HMS Charles in September 1685. Aylmer was a young officer of the “courtier type” who benefited from the patronage of the Duke of Buckingham.\n\nPromoted to captain on 1 October 1688, Aylmer was given command of the fourth-rate HMS Swallow in the Thames; he was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support. Indeed, he was perhaps the chief of the cabal. Aylmer followed up the letter with a visit to the Prince's headquarters and arranged that Lieutenant George Byng and Captain Anthony Hastings should accompany him during the visit. The Prince's warm response to the captains ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer transferred to the command of the third-rate HMS Mary in December 1688 and was present at the French victory at the Battle of Bantry Bay in May 1689 at an early stage of the Nine Years' War. His brother George Aylmer was killed during the battle.\n\nAylmer transferred again, this time to the command of the second-rate HMS Royal Katherine in Spring 1690 and was present at the French victory at Battle of Beachy Head in July 1690. He transferred to the command of the third-rate HMS Monck in the North Sea in Summer 1691 and then took command of the first-rate HMS London in Spring 1692. As Second Captain to Admiral Edward Russell, he saw action again at the tactically indecisive Battle of Barfleur in May 1692. As a captain, Aylmer was quite deferential to his Spanish partners during the War. Samuel Pepys believed that Aylmer should have been hanged for his habit of dipping his colours to Spanish Admirals.\n\nSenior command\n\nPromoted to rear admiral on 8 February 1693 and to vice admiral in June 1693, Aylmer hoisted his flag in the first-rate HMS Royal Sovereign and served under Admiral Edward Russell as second-in-command of the Mediterranean Fleet. He also became Whig Member of Parliament for Portsmouth at a by-election in 1695 but had to stand down when the House of Commons declared the by-election void in January 1696. Nevertheless, he was elected Whig Member of Parliament for Dover in December 1697. The Treaty of Ryswick was signed in September 1697, bringing the Nine Years' War to an end and, after a delay in fitting out his squadron, Aylmer went out into the Mediterranean, with his flag in the second-rate HMS Boyne, to ensure the treaty was being observed in September 1698; he then retired from active service in October 1699. In around 1700 he acquired Wallett's Court Manor at Westcliffe in Kent as a property in which he would live in retirement. He also had a property at No. 12 Great Piazza in Covent Garden.\n\nFollowing the death of Prince George (Queen Anne's consort), which brought Russell back to the Admiralty, Aylmer was promoted to Admiral of the Fleet and Commander-in-Chief of the Navy on 12 November 1709. He lost his Dover seat at the 1710 British general election which produced a landslide victory for the Tory party in the wake of the prosecution of Henry Sacheverell which Aylmer had supported. In July 1710, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so in January 1711.\n\nFollowing the accession of George I in August 1714, which led to the appointment of the Townshend Ministry in September 1714, Russell was back at the Admiralty again and Aylmer was reappointed Commander-in-Chief on 5 November 1714. Alymer was also appointed Governor of Greenwich Hospital on the same date: in this post he started to fund education for the sons of seamen from entry charges to the Painted Hall, pensioners' fines and proceeds from the sale of stores. The same day he was also appointed Ranger of Greenwich Park.\n\nAlymer recovered his seat in Parliament at Dover at the 1715 British general election which saw the Whigs win an overwhelming majority in the House of Commons. He went on to join the Board of Admiralty led by the Earl of Berkeley, as Senior Naval Lord, in April 1717. He resigned his appointments as a member of the Admiralty Board and as Commander-in-Chief in March 1718 and was rewarded by being appointed Rear-Admiral of Great Britain and also being created Lord Aylmer of Balrath in the Peerage of Ireland on 1 May 1718.\n\nAylmer died at Queen's House in Greenwich on 18 August 1720 and was buried at St Alfege's Church in Greenwich.\n\nFamily\n\nIn circa 1680 Aylmer married Sarah Ellis; they had a son and two daughters.\n\nhttps://en.wikipedia.org/wiki/Matthew_Aylmer,_1st_Baron_Aylmer"}, {"url": "https://www.biographies.net/people/en/matthew_aylmer_1st_baron_aylmer", "page_content": "Who was Matthew Aylmer, 1st Baron Aylmer?\n\nMatthew Aylmer, 1st Baron Aylmer was an Irish Admiral and Commander-in-Chief of the Royal Navy.\n\nAylmer was the second son of Sir Christopher Aylmer of Balrath County Meath. In 1678 he entered the Royal Navy as a Lieutenant under the protection of George Villiers, 2nd Duke of Buckingham. Early 1679 he was promoted to the rank of Captain, and he appears to have served almost constantly during the next ten years on the coast of Algiers and in the Mediterranean.\n\nIn October 1688 he was appointed captain of HMS Swallow in the Thames, but at once gave in his allegiance to the cause of the Revolution. In 1690 he commanded the Royal Katherine, and, in the Battle of Beachy Head, was one of the seconds to Sir Ralph Delaval who commanded the blue squadron. In 1692, still in the Royal Katherine, he was one of the seconds of the Commander-in-Chief at the Battle of Barfleur. He was promoted to the rank of Rear Admiral in February 1693 and to Vice Admiral in 1694, when he accompanied Admiral Russell to the Mediterranean. He was also appointed a Lord of the Admiralty at this time."}, {"url": "https://en.geneastar.org/genealogy/aylmerm/matthew-aylmer", "page_content": "Aylmer was the second son of Sir Christopher Aylmer of Balrath County Meath. In 1678 he entered the Royal Navy as a Lieutenant under the protection of George Villiers, 2nd Duke of Buckingham. Early 1679 he was promoted to the rank of Captain, and he appears to have served almost constantly during the next ten years on the coast of Algiers and in the Mediterranean.\n\n\n\n\n\n\n\nIn October 1688 he was appointed captain of HMS Swallow in the Thames, but at once gave in his allegiance to the cause of the Revolution. In 1690 he commanded the Royal Katherine, and, in the Battle of Beachy Head, was one of the seconds to Sir Ralph Delaval who commanded the blue squadron.\n\n\n\n\n\n..."}, {"url": "https://peoplepill.com/people/matthew-aylmer-1st-baron-aylmer/", "page_content": "Admiral of the Fleet Matthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720) was an Irish Royal Navy officer. He was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support; the Prince's response ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer saw action at the Battle of Bantry Bay in May 1689, at the Battle of Beachy Head in July 1690 and again at the Battle of Barfleur in May 1692 during the Nine Years' War.\n\nAylmer became Commander-in-Chief of the Navy on 12 November 1709. However, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so a few months later. Following the accession of George I and the appointment of the Townshend Ministry, Aylmer was reappointed Commander-in-Chief on 5 November 1714. He was also appointed Governor of Greenwich Hospital: in this post he founded the Royal Hospital School for the sons of seamen.\n\n\n\n\n\nEarly career\n\nThe second-rate HMS Royal Katherine, which Aylmer commanded at the Battle of Beachy Head The second-rate HMS, which Aylmer commanded at the Battle of Beachy Head\n\nBorn the second son of Sir Christopher Aylmer and Margaret Aylmer (née Plunkett), Aylmer served briefly in the Army and then joined the Royal Navy as a midshipman in the galley HMS Charles in October 1677 before being promoted to lieutenant in April 1678. Promoted to commander on 19 January 1679, he became commanding officer of the sloop HMS Chatham and then transferred to the command of the prize ship HMS Date Tree in Summer 1679. He transferred again to the command of the fire ship HMS Castle in the Mediterranean Fleet later in the year, to the command of the fifth-rate HMS Swann on the Coast of Ireland in July 1680 and to the command of the fourth-rate HMS Tiger in the Mediterranean Fleet in January 1682, before becoming commanding officer of the galley HMS Charles in September 1685. Aylmer was a young officer of the “courtier type” who benefited from the patronage of the Duke of Buckingham.\n\nPromoted to captain on 1 October 1688, Aylmer was given command of the fourth-rate HMS Swallow in the Thames; he was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support. Indeed, he was perhaps the chief of the cabal. Aylmer followed up the letter with a visit to the Prince's headquarters and arranged that Lieutenant George Byng and Captain Anthony Hastings should accompany him during the visit. The Prince's warm response to the captains ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer transferred to the command of the third-rate HMS Mary in December 1688 and was present at the French victory at the Battle of Bantry Bay in May 1689 at an early stage of the Nine Years' War. His brother George Aylmer was killed during the battle.\n\nAylmer transferred again, this time to the command of the second-rate HMS Royal Katherine in Spring 1690 and was present at the French victory at Battle of Beachy Head in July 1690. He transferred to the command of the third-rate HMS Monck in the North Sea in Summer 1691 and then took command of the first-rate HMS London in Spring 1692. As Second Captain to Admiral Edward Russell, he saw action again at the tactically indecisive Battle of Barfleur in May 1692. As a captain, Aylmer was quite deferential to his Spanish partners during the War. Samuel Pepys believed that Aylmer should have been hanged for his habit of dipping his colours to Spanish Admirals.\n\nSenior command\n\nWallet's Court Manor at Westcliffe in Kent, Aylmer's home from around 1700 Wallet's Court Manor at Westcliffe in Kent, Aylmer's home from around 1700\n\nPromoted to rear admiral on 8 February 1693 and to vice admiral in June 1693, Aylmer hoisted his flag in the first-rate HMS Royal Sovereign and served under Admiral Edward Russell as second-in-command of the Mediterranean Fleet. He also became Whig Member of Parliament for Portsmouth at a by-election in 1695 but had to stand down when the House of Commons declared the by-election void in January 1696. Nevertheless, he was elected Whig Member of Parliament for Dover in December 1697. The Treaty of Ryswick was signed in September 1697, bringing the Nine Years' War to an end and, after a delay in fitting out his squadron, Aylmer went out into the Mediterranean, with his flag in the second-rate HMS Boyne, to ensure the treaty was being observed in September 1698; he then retired from active service in October 1699. In around 1700 he acquired Wallett's Court Manor at Westcliffe in Kent as a property in which he would live in retirement. He also had a property at No. 12 Great Piazza in Covent Garden.\n\nFollowing the death of Prince George (Queen Anne's consort), which brought Russell back to the Admiralty, Aylmer was promoted to Admiral of the Fleet and Commander-in-Chief of the Navy on 12 November 1709. He lost his Dover seat at the general election in 1710 which produced a landslide victory for the Tory party in the wake of the prosecution of Henry Sacheverell which Aylmer had supported. In July 1710, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so in January 1711.\n\nFollowing the accession of George I in August 1714, which led to the appointment of the Townshend Ministry in September 1714, Russell was back at the Admiralty again and Aylmer was reappointed Commander-in-Chief on 5 November 1714. Alymer was also appointed Governor of Greenwich Hospital on the same date: in this post he started to fund education for the sons of seamen from entry charges to the Painted Hall, pensioners' fines and proceeds from the sale of stores. The same day he was also appointed Ranger of Greenwich Park.\n\nThe Queen's House at Greenwich, where Aylmer died, viewed from the main gate The Queen's House at Greenwich, where Aylmer died, viewed from the main gate\n\nAlymer recovered his seat in Parliament at Dover at the general election in 1715 which saw the Whigs win an overwhelming majority in the House of Commons. He went on to become a Lord Commissioner of the Admiralty on the Admiralty board led by the Earl of Berkeley in April 1717. He resigned his appointments as a Lord Commissioner and as Commander-in-Chief in March 1718 and was rewarded by being appointed Rear-Admiral of Great Britain and also being created Lord Aylmer of Balrath in the Peerage of Ireland on 1 May 1718.\n\nAylmer died at Queen's House in Greenwich on 18 August 1720 and was buried at St Alfege's Church in Greenwich.\n\nFamily\n\nIn circa 1680 Aylmer married Sarah Ellis; they had a son and two daughters."}, {"url": "https://alchetron.com/Matthew-Aylmer,-1st-Baron-Aylmer", "page_content": "Admiral of the Fleet Matthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720) was an Irish Royal Navy officer. He was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support; the Prince's response ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer saw action at the Battle of Bantry Bay in May 1689, at the Battle of Beachy Head in July 1690 and again at the Battle of Barfleur in May 1692 during the Nine Years' War.\n\nAylmer became Commander-in-Chief of the Navy on 12 November 1709. However, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so a few months later. Following the accession of George I and the appointment of the Townshend Ministry, Aylmer was reappointed Commander-in-Chief on 5 November 1714. He was also appointed Governor of Greenwich Hospital: in this post he founded the Royal Hospital School for the sons of seamen.\n\nEarly career\n\nBorn the second son of Sir Christopher Aylmer and Margaret Aylmer (née Plunkett), Aylmer served briefly in the Army and then joined the Royal Navy as a midshipman in the galley HMS Charles in October 1677 before being promoted to lieutenant in April 1678. Promoted to commander on 19 January 1679, he became commanding officer of the sloop HMS Chatham and then transferred to the command of the prize ship HMS Date Tree in Summer 1679. He transferred again to the command of the fire ship HMS Castle in the Mediterranean Fleet later in the year, to the command of the fifth-rate HMS Swann on the Coast of Ireland in July 1680 and to the command of the fourth-rate HMS Tiger in the Mediterranean Fleet in January 1682, before becoming commanding officer of the galley HMS Charles in September 1685. Aylmer was a young officer of the “courtier type” who benefited from the patronage of the Duke of Buckingham.\n\nPromoted to captain on 1 October 1688, Aylmer was given command of the fourth-rate HMS Swallow in the Thames; he was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support. Indeed, he was perhaps the chief of the cabal. Aylmer followed up the letter with a visit to the Prince's headquarters and arranged that Lieutenant George Byng and Captain Anthony Hastings should accompany him during the visit. The Prince's warm response to the captains ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer transferred to the command of the third-rate HMS Mary in December 1688 and was present at the French victory at the Battle of Bantry Bay in May 1689 at an early stage of the Nine Years' War. His brother George Aylmer was killed during the battle.\n\nAylmer transferred again, this time to the command of the second-rate HMS Royal Katherine in Spring 1690 and was present at the French victory at Battle of Beachy Head in July 1690. He transferred to the command of the third-rate HMS Monck in the North Sea in Summer 1691 and then took command of the first-rate HMS London in Spring 1692. As Second Captain to Admiral Edward Russell, he saw action again at the tactically indecisive Battle of Barfleur in May 1692. As a captain, Aylmer was quite deferential to his Spanish partners during the War. Samuel Pepys believed that Aylmer should have been hanged for his habit of dipping his colours to Spanish Admirals.\n\nSenior command\n\nPromoted to rear admiral on 8 February 1693 and to vice admiral in June 1693, Aylmer hoisted his flag in the first-rate HMS Royal Sovereign and served under Admiral Edward Russell as second-in-command of the Mediterranean Fleet. He also became Whig Member of Parliament for Portsmouth at a by-election in 1695 but had to stand down when the House of Commons declared the by-election void in January 1696. Nevertheless, he was elected Whig Member of Parliament for Dover in December 1697. The Treaty of Ryswick was signed in September 1697, bringing the Nine Years' War to an end and, after a delay in fitting out his squadron, Aylmer went out into the Mediterranean, with his flag in the second-rate HMS Boyne, to ensure the treaty was being observed in September 1698; he then retired from active service in October 1699. In around 1700 he acquired Wallett's Court Manor at Westcliffe in Kent as a property in which he would live in retirement. He also had a property at No. 12 Great Piazza in Covent Garden.\n\nFollowing the death of Prince George (Queen Anne's consort), which brought Russell back to the Admiralty, Aylmer was promoted to Admiral of the Fleet and Commander-in-Chief of the Navy on 12 November 1709. He lost his Dover seat at the general election in 1710 which produced a landslide victory for the Tory party in the wake of the prosecution of Henry Sacheverell which Aylmer had supported. In July 1710, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so in January 1711.\n\nFollowing the accession of George I in August 1714, which led to the appointment of the Townshend Ministry in September 1714, Russell was back at the Admiralty again and Aylmer was reappointed Commander-in-Chief on 5 November 1714. Alymer was also appointed Governor of Greenwich Hospital on the same date: in this post he started to fund education for the sons of seamen from entry charges to the Painted Hall, pensioners' fines and proceeds from the sale of stores. The same day he was also appointed Ranger of Greenwich Park.\n\nAlymer recovered his seat in Parliament at Dover at the general election in 1715 which saw the Whigs win an overwhelming majority in the House of Commons. He went on to join the Board of Admiralty led by the Earl of Berkeley, as Senior Naval Lord, in April 1717. He resigned his appointments as a member of the Admiralty Board and as Commander-in-Chief in March 1718 and was rewarded by being appointed Rear-Admiral of Great Britain and also being created Lord Aylmer of Balrath in the Peerage of Ireland on 1 May 1718.\n\nAylmer died at Queen's House in Greenwich on 18 August 1720 and was buried at St Alfege's Church in Greenwich.\n\nFamily\n\nIn circa 1680 Aylmer married Sarah Ellis; they had a son and two daughters."}, {"url": "https://en.unionpedia.org/Matthew_Aylmer,_1st_Baron_Aylmer", "page_content": "Matthew Aylmer, 1st Baron Aylmer Admiral of the Fleet Matthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720) was an Irish Royal Navy officer. [1]\n\n90 relations: Accession day, Admiral of the Fleet (Royal Navy), Admiralty, Anne, Queen of Great Britain, Baron Aylmer, Battle of Bantry Bay, Battle of Beachy Head (1690), Battles of Barfleur and La Hougue, Board of Admiralty, British general election, 1710, British general election, 1715, Captain (Royal Navy), Cargo ship, Charles Hedges, Coast of Ireland Station, Commander, Convoy, County Meath, Covent Garden, Dover (UK Parliament constituency), Edward Russell, 1st Earl of Orford, English ship Mary (1650), Fifth-rate, Fire ship, First Parliament of Great Britain, First Sea Lord, First Townshend ministry, First-rate, Fourth-rate, France, Galley, George Aylmer, George Berkeley (died 1746), George Byng, 1st Viscount Torrington, George I of Great Britain, George Villiers, 2nd Duke of Buckingham, Glorious Revolution, Greenwich, Greenwich Hospital, London, Greenwich Park, Henry Aylmer, 2nd Baron Aylmer, Henry Furnese, Henry Sacheverell, HMS Boyne (1692), HMS London (1670), HMS Monck (1659), HMS Royal Katherine (1664), HMS Sovereign of the Seas, HMS Swallow (1653), HMS Tyger, ..., House of Commons of England, Ireland, James Berkeley, 3rd Earl of Berkeley, John Gibson (British soldier), John Jennings (Royal Navy officer), Jonathan Richardson, Kent, Lieutenant, Mediterranean Fleet, Member of parliament, Midshipman, National Maritime Museum, Nine Years' War, North Sea, Oxford–Bolingbroke ministry, Peerage of Ireland, Portsmouth (UK Parliament constituency), Prince George of Denmark, Prize (law), Queen's House, Rear admiral, Rear-Admiral of the United Kingdom, River Thames, Royal Navy, Samuel Pepys, Second-rate, Sir Christopher Aylmer, 1st Baronet, Sloop, Squadron (naval), St Alfege Church, Greenwich, Third-rate, Torbay, Tories (British political party), Treaty of Ryswick, Vice admiral, Westcliffe, Kent, Whigs (British political party), William Gifford (Royal Navy officer), William Hardres, William III of England. Expand index (40 more) » « Shrink index\n\nAn Accession Day is usually the anniversary of the date on which a monarch or executive takes office.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Accession day · See more »\n\nAdmiral of the Fleet is a five-star naval officer rank and the highest rank of the British Royal Navy.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Admiral of the Fleet (Royal Navy) · See more »\n\nThe Admiralty, originally known as the Office of the Admiralty and Marine Affairs, was the government department responsible for the command of the Royal Navy firstly in the Kingdom of England, secondly in the Kingdom of Great Britain, and from 1801 to 1964, the United Kingdom and former British Empire.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Admiralty · See more »\n\nAnne (6 February 1665 – 1 August 1714) was the Queen of England, Scotland and Ireland between 8 March 1702 and 1 May 1707.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Anne, Queen of Great Britain · See more »\n\nLord Aylmer, Baron of Balrath, in the County of Meath, is a title in the Peerage of Ireland.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Baron Aylmer · See more »\n\nThe Battle of Bantry Bay was a naval engagement fought on 11 May 1689 during the Nine Years' War.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Battle of Bantry Bay · See more »\n\nThe Battle of Beachy Head (Fr. Battle of Bévéziers) was a naval engagement fought on 10 July 1690 during the Nine Years' War.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Battle of Beachy Head (1690) · See more »\n\nThe related naval battles of Barfleur and La Hougue took place between 29 May and 4 June New Style (NS), 1692 (19–24 May in the Old Style (OS) Julian calendar then in use in England).\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Battles of Barfleur and La Hougue · See more »\n\nThe Board of Admiralty was established in 1628 when Charles I put the office of Lord High Admiral into commission.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Board of Admiralty · See more »\n\nThe 1710 British general election produced a landslide victory for the Tories in the wake of the prosecution of Henry Sacheverell and the collapse of the previous Whig government led by Godolphin and the Whig Junto.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and British general election, 1710 · See more »\n\nThe 1715 British general election returned members to serve in the House of Commons of the 5th Parliament of Great Britain to be held, after the merger of the Parliament of England and the Parliament of Scotland in 1707.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and British general election, 1715 · See more »\n\nCaptain (Capt) is a senior officer rank of the Royal Navy.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Captain (Royal Navy) · See more »\n\nA cargo ship or freighter ship is any sort of ship or vessel that carries cargo, goods, and materials from one port to another.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Cargo ship · See more »\n\nSir Charles Hedges (1649/50 – 10 June 1714), of Compton Bassett, Wiltshire, an English lawyer and politician, was a judge in Admiralty Court who later served as one of Queen Anne's Secretaries of State.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Charles Hedges · See more »\n\nThe Coast of Ireland Station was a historic command of the Royal Navy based at Queenstown (now Cobh) in Ireland.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Coast of Ireland Station · See more »\n\nCommander is a common naval and air force officer rank.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Commander · See more »\n\nA convoy is a group of vehicles, typically motor vehicles or ships, traveling together for mutual support and protection.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Convoy · See more »\n\nCounty Meath (Contae na Mí or simply an Mhí) is a county in Ireland.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and County Meath · See more »\n\nCovent Garden is a district in Greater London, on the eastern fringes of the West End, between Charing Cross Road and Drury Lane.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Covent Garden · See more »\n\nDover is a constituency represented in the House of Commons of the Parliament of the United Kingdom.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Dover (UK Parliament constituency) · See more »\n\nAdmiral of the Fleet Edward Russell, 1st Earl of Orford, PC (1653 – 26 November 1727) was a Royal Navy officer.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Edward Russell, 1st Earl of Orford · See more »\n\nSpeaker was a 50-gun third-rate frigate and the name ship of the, built for the navy of the Commonwealth of England by Christopher Pett at Woolwich Dockyard and launched in 1650.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and English ship Mary (1650) · See more »\n\nIn the rating system of the British Royal Navy used to categorise sailing warships, a fifth rate was the penultimate class of warships in a hierarchical system of six \"ratings\" based on size and firepower.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Fifth-rate · See more »\n\nA fire ship or fireship, used in the days of wooden rowed or sailing ships, was a ship filled with combustibles, deliberately set on fire and steered (or, when possible, allowed to drift) into an enemy fleet, in order to destroy ships, or to create panic and make the enemy break formation.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Fire ship · See more »\n\nThe first Parliament of the Kingdom of Great Britain was established in 1707 after the merger of the Kingdom of England and the Kingdom of Scotland.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and First Parliament of Great Britain · See more »\n\nThe First Sea Lord and Chief of Naval Staff (1SL/CNS) is the professional head of the United Kingdom's Royal Navy and the whole Naval Service.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and First Sea Lord · See more »\n\nLord Townshend was appointed Secretary of State for the Northern Department by King George I in September 1714, forming the first Townshend ministry.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and First Townshend ministry · See more »\n\nIn the rating system of the British Royal Navy used to categorise sailing warships, a first rate was the designation for the largest ships of the line, equivalent to the 'super-dreadnought' of more recent times.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and First-rate · See more »\n\nIn the rating system of the British Royal Navy used to categorise sailing warships, a fourth-rate was a ship of the line with 46 to 60 guns mounted.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Fourth-rate · See more »\n\nFrance, officially the French Republic (République française), is a sovereign state whose territory consists of metropolitan France in Western Europe, as well as several overseas regions and territories.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and France · See more »\n\nA galley is a type of ship that is propelled mainly by rowing.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Galley · See more »\n\nGeorge Aylmer was an Irish officer of the Royal Navy during the seventeenth century.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and George Aylmer · See more »\n\nThe Honourable George Berkeley (1693? – 29 October 1746) was a member of Parliament for Dover in 1720 and in the following two parliaments, and for Hedon, Yorkshire, in 1734.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and George Berkeley (died 1746) · See more »\n\nAdmiral of the Fleet George Byng, 1st Viscount Torrington, (27 January 166317 January 1733) of Southill Park in Bedfordshire, was a Royal Navy officer and statesman.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and George Byng, 1st Viscount Torrington · See more »\n\nGeorge I (George Louis; Georg Ludwig; 28 May 1660 – 11 June 1727) was King of Great Britain and Ireland from 1 August 1714 and ruler of the Duchy and Electorate of Brunswick-Lüneburg (Hanover) in the Holy Roman Empire from 1698 until his death.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and George I of Great Britain · See more »\n\nGeorge Villiers, 2nd Duke of Buckingham, 20th Baron de Ros, (30 January 1628 – 16 April 1687) was an English statesman and poet.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and George Villiers, 2nd Duke of Buckingham · See more »\n\nThe Glorious Revolution, also called the Revolution of 1688, was the overthrow of King James II of England (James VII of Scotland) by a union of English Parliamentarians with the Dutch stadtholder William III, Prince of Orange, who was James's nephew and son-in-law.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Glorious Revolution · See more »\n\nGreenwich is an area of south east London, England, located east-southeast of Charing Cross.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Greenwich · See more »\n\nGreenwich Hospital was a permanent home for retired sailors of the Royal Navy, which operated from 1692 to 1869.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Greenwich Hospital, London · See more »\n\nGreenwich Park is a former hunting park in Greenwich and one of the largest single green spaces in south-east London.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Greenwich Park · See more »\n\nHenry Aylmer, 2nd Baron Aylmer (died 26 June 1754) was a British Whig politician.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Henry Aylmer, 2nd Baron Aylmer · See more »\n\nHenry Furnese (after 1688 – 30 August 1756) was a British politician.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Henry Furnese · See more »\n\nHenry Sacheverell (8 February 1674 – 5 June 1724) was an English High Church Anglican clergyman who achieved nationwide fame in 1709 after preaching an incendiary 5 November sermon.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Henry Sacheverell · See more »\n\nHMS Boyne was an 80-gun third-rate ship of the line of the Royal Navy, launched at Deptford Dockyard on 21 May 1692.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS Boyne (1692) · See more »\n\nHMS London was a 96-gun first-rate ship of the line of the Royal Navy, built by Christopher Pett at Deptford Dockyard until his death in March 1668, and completed by Jonas Shish and launched in 1670.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS London (1670) · See more »\n\nHMS Monck was a 52-gun third rate frigate built for the navy of the Commonwealth of England at Portsmouth, and launched in 1659.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS Monck (1659) · See more »\n\nHMS Royal Katherine (HMS Ramilles after 1706) was an 84-gun second-rate ship of the line of the Royal Navy, launched in 1664 at Woolwich Dockyard.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS Royal Katherine (1664) · See more »\n\nSovereign of the Seas was a 17th-century warship of the English Navy.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS Sovereign of the Seas · See more »\n\nGainsborough was a 40-gun fourth-rate frigate of the English Navy, originally built under the 1652 programme for the navy of the Commonwealth of England by Thomas Taylor at Pitch House (Wapping), and launched in 1653.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS Swallow (1653) · See more »\n\nHMS Tyger, often spelled Tiger, was a 38-gun fourth rate frigate of the Royal Navy, built by Peter Pett II at Woolwich and launched in 1647.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and HMS Tyger · See more »\n\nThe House of Commons of England was the lower house of the Parliament of England (which incorporated Wales) from its development in the 14th century to the union of England and Scotland in 1707, when it was replaced by the House of Commons of Great Britain.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and House of Commons of England · See more »\n\nIreland (Éire; Ulster-Scots: Airlann) is an island in the North Atlantic.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Ireland · See more »\n\nVice-Admiral James Berkeley, 3rd Earl of Berkeley, (aft. 1679 – 17 August 1736) was the son of Charles Berkeley, 2nd Earl of Berkeley and the Hon.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and James Berkeley, 3rd Earl of Berkeley · See more »\n\nSir John Gibson (ca. 1637 – 24 October 1717), was the founder of the 28th (North Gloucestershire) Regiment of Foot.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and John Gibson (British soldier) · See more »\n\nSir John Jennings (1664 – 23 December 1743) was a Royal Navy officer.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and John Jennings (Royal Navy officer) · See more »\n\nJonathan Richardson (London 12 January 1667 – 28 May 1745 London) sometimes called \"the Elder\" to distinguish him from his son (Jonathan Richardson the Younger) was an English artist, collector of drawings, and writer on art, working almost entirely as a portrait-painter in London.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Jonathan Richardson · See more »\n\nKent is a county in South East England and one of the home counties.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Kent · See more »\n\nA lieutenant (abbreviated Lt, LT, Lieut and similar) is a junior commissioned officer in the armed forces, fire services, police and other organizations of many nations.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Lieutenant · See more »\n\nThe British Mediterranean Fleet also known as the Mediterranean Station was part of the Royal Navy.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Mediterranean Fleet · See more »\n\nA member of parliament (MP) is the representative of the voters to a parliament.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Member of parliament · See more »\n\nA midshipman is an officer of the junior-most rank, in the Royal Navy, United States Navy, and many Commonwealth navies.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Midshipman · See more »\n\nThe National Maritime Museum (NMM) in Greenwich, London, is the leading maritime museum of the United Kingdom and may be the largest museum of its kind in the world.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and National Maritime Museum · See more »\n\nThe Nine Years' War (1688–97) – often called the War of the Grand Alliance or the War of the League of Augsburg – was a conflict between Louis XIV of France and a European coalition of Austria, the Holy Roman Empire, the Dutch Republic, Spain, England and Savoy.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Nine Years' War · See more »\n\nThe North Sea (Mare Germanicum) is a marginal sea of the Atlantic Ocean located between Great Britain, Scandinavia, Germany, the Netherlands, Belgium, and France.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and North Sea · See more »\n\nThe Oxford–Bolingbroke ministry was the British government that existed between 1710 and 1714 in the reign of Queen Anne.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Oxford–Bolingbroke ministry · See more »\n\nThe Peerage of Ireland consists of those titles of nobility created by the English monarchs in their capacity as Lord or King of Ireland, or later by monarchs of the United Kingdom of Great Britain and Ireland.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Peerage of Ireland · See more »\n\nPortsmouth was a borough constituency based upon the borough of Portsmouth in Hampshire.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Portsmouth (UK Parliament constituency) · See more »\n\nPrince George of Denmark and Norway, Duke of Cumberland (Jørgen; 2 April 165328 October 1708), was the husband of Queen Anne, who reigned over Great Britain from 1702 to 1714.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Prince George of Denmark · See more »\n\nPrize is a term used in admiralty law to refer to equipment, vehicles, vessels, and cargo captured during armed conflict.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Prize (law) · See more »\n\nQueen's House is a former royal residence built between 1616 and 1635 in Greenwich, a few miles down-river from the then City of London and now a London Borough.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Queen's House · See more »\n\nRear admiral is a naval commissioned officer rank above that of a commodore (U.S equivalent of Commander) and captain, and below that of a vice admiral.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Rear admiral · See more »\n\nThe Rear-Admiral of the United Kingdom is a now honorary office generally held by a senior (possibly retired) Royal Navy admiral.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Rear-Admiral of the United Kingdom · See more »\n\nThe River Thames is a river that flows through southern England, most notably through London.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and River Thames · See more »\n\nThe Royal Navy (RN) is the United Kingdom's naval warfare force.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Royal Navy · See more »\n\nSamuel Pepys (23 February 1633 – 26 May 1703) was an administrator of the navy of England and Member of Parliament who is most famous for the diary he kept for a decade while still a relatively young man.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Samuel Pepys · See more »\n\nIn the rating system of the British Royal Navy used to categorise sailing warships, a second-rate was a ship of the line which by the start of the 18th century mounted 90 to 98 guns on three gun decks; earlier 17th-century second rates had fewer guns and were originally two-deckers or had only partially armed third gun decks.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Second-rate · See more »\n\nSir Christopher Aylmer, 1st Baronet (c.1620-1671) was an Irish landowner.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Sir Christopher Aylmer, 1st Baronet · See more »\n\nA sloop (from Dutch sloep, in turn from French chaloupe) is a sailing boat with a single mast and a fore-and-aft rig.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Sloop · See more »\n\nA squadron, or naval squadron, is a significant group of warships which is nonetheless considered too small to be designated a fleet.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Squadron (naval) · See more »\n\nSt Alfege Church is an Anglican church in the centre of Greenwich, part of the Royal Borough of Greenwich in London.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and St Alfege Church, Greenwich · See more »\n\nIn the rating system of the British Royal Navy, a third rate was a ship of the line which from the 1720s mounted between 64 and 80 guns, typically built with two gun decks (thus the related term two-decker).\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Third-rate · See more »\n\nTorbay is a borough in Devon, England, administered by the unitary authority of Torbay Council.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Torbay · See more »\n\nThe Tories were members of two political parties which existed sequentially in the Kingdom of England, the Kingdom of Great Britain and later the United Kingdom of Great Britain and Ireland from the 17th to the early 19th centuries.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Tories (British political party) · See more »\n\nThe Treaty or Peace of Ryswick, also known as The Peace of Rijswijk was a series of agreements signed in the Dutch city of Rijswijk between 20 September and 30 October 1697, ending the 1689-97 Nine Years War between France and the Grand Alliance of England, Spain, the Holy Roman Empire and the Dutch Republic.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Treaty of Ryswick · See more »\n\nVice admiral is a senior naval flag officer rank, equivalent to lieutenant general and air marshal.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Vice admiral · See more »\n\nWestcliffe is a village near Dover in east Kent, England.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Westcliffe, Kent · See more »\n\nThe Whigs were a political faction and then a political party in the parliaments of England, Scotland, Great Britain, Ireland and the United Kingdom.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and Whigs (British political party) · See more »\n\nCaptain Sir William Gifford (c.1649-1724) was a Royal Navy officer and Member of Parliament.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and William Gifford (Royal Navy officer) · See more »\n\nSir William Hardres, 4th Baronet (25 July 1686 – 7 July 1736) of Hardres Court, Kent was a British politician who sat in the House of Commons in two periods between 1711 and 1735.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and William Hardres · See more »\n\nWilliam III (Willem; 4 November 1650 – 8 March 1702), also widely known as William of Orange, was sovereign Prince of Orange from birth, Stadtholder of Holland, Zeeland, Utrecht, Gelderland and Overijssel in the Dutch Republic from 1672 and King of England, Ireland and Scotland from 1689 until his death in 1702.\n\nNew!!: Matthew Aylmer, 1st Baron Aylmer and William III of England · See more »\n\nRedirects here:\n\nMatthew Aylmer.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Matthew_Aylmer,_1st_Baron_Aylmer"}], "Matthew Aylmer was a colonial administrator.": [{"url": "http://www.biographi.ca/en/bio/whitworth_aylmer_matthew_7E.html", "page_content": "WHITWORTH-AYLMER, MATTHEW, 5th Baron AYLMER, army officer and colonial administrator; b. 24 May 1775, the eldest of five children of Henry Aylmer, 4th Baron Aylmer, and Catherine Whitworth; m. 28 July or 4 Aug. 1801 Louisa Anne Call, daughter of Sir John Call; they had no children; d. 23 Feb. 1850 in London.\n\nMatthew Aylmer was only 10 when he succeeded his father in the ancient Irish barony of Aylmer and 12 when he entered the 49th Foot as an ensign. He became a lieutenant in 1791 and a captain in 1794. In 1798 he participated in an abortive British raid on Ostend (Belgium), was captured, and spent six months in a French prison. He won high praise from his commanding officer, Lieutenant-Colonel Isaac Brock*, for his role in the battle of Egmont-op-Zee (more properly Egmond aan Zee, Netherlands) in 1799. Two years later he rose to the rank of major in the 85th Foot, and in 1802 to lieutenant-colonel; however, he was then placed on half pay until June 1803 when he joined the Coldstream Foot Guards. On 25 July 1810 he became a colonel and an aide-de-camp to the king and on 4 June 1813 a major-general. He served as the assistant – and then from January 1812 as the deputy – adjutant general to Lord Wellington’s army and commanded a brigade in several major battles of the Peninsular War, during which he was awarded the Military Cross with one clasp. He was given a kcb on 2 Jan. 1815 and knighted on 6 June. In 1814 he had been appointed adjutant general of the British forces in Ireland, where he remained until 1823. From 1823 to 1830 he was without employment and spent much of his time wandering across Switzerland and Italy. He was promoted lieutenant-general on 27 May 1825 and that year, upon the death of his uncle, the Earl of Whitworth, he changed his family name to Whitworth-Aylmer. He was made colonel of the 56th Foot in 1827 and transferred to the 18th Foot five years later.\n\nAylmer’s enforced idleness ended when Sir James Kempt* resigned the administration of Lower Canada. In June 1830 the secretary of state for the colonies, Sir George Murray, who had also served with Wellington in the Peninsular War, offered the position to Aylmer. On 11 August Aylmer was appointed commander of the forces in North America, and on 13 October he landed at Quebec; he assumed control of the administration one week later. His commission as governor-in-chief was dated 24 Nov. 1830, but it was not formally registered at Quebec until 12 Feb. 1831. Aylmer had few obvious qualifications for his position; he had never served as a civil administrator, he had no political experience, and he came to Lower Canada, by his own admission, “a perfect stranger to all that relates to the country.” Yet Murray’s choice was based on more than friendship. Aylmer was one of the more distinguished and capable officers of his rank, he was a francophile, and, as Louis-Joseph Papineau* noted, he spoke French “with the greatest ease and elegance.” Although leaning to the conservative side in British politics, he was not a partisan, and the reformers in the Canadas, reassured by their contacts in Britain, received him as “an able and clever man conciliatory in his disposition, liberal in his principles, and cincerely [sic] anxious to do good.”\n\nRecognizing his lack of knowledge, Aylmer none the less predicted that he would soon “be out of the Awkward Squad.” He embarked on a series of tours which eventually took him to every part of Lower Canada, and he pronounced himself pleased with “the country, the people and the Climate.” He and Lady Aylmer took their viceregal responsibilities seriously, contributing generously to a variety of causes, such as an emigrant fund, the Female Orphan Asylum, and the Quebec Driving Club (one of a number of organizations of which Lady Aylmer became patroness). They sought to foster the arts and culture, and attended many community activities, from ploughing matches to annual races in Trois-Rivières where Aylmer donated a silver cup to be awarded for a horse bred within the province. A wealthy man, Aylmer entertained frequently and lavishly at the Château Saint-Louis, the governor’s residence; yet he avoided the error “into which most of our Governors have fallen . . . ,” noted the Montreal reform newspaper, the Vindicator and Canadian Advertiser, “of attempting to impress on the minds of the ‘natives’ a something transatlantically superior pertaining to themselves.” During a visit to the Indian reserve at Lac des Deux Montagnes he joined in the dancing when “obliged” to do so.\n\nAylmer wished particularly to convince French Canadians of his benevolence. Shortly after his arrival he donated money for a tablet over the spot “where lay the remains of brave Montcalm [Louis-Joseph de Montcalm*].” He disagreed vehemently with those who advocated a policy of assimilation, arguing that there were not British subjects “more loyal and true – than the People of Lower Canada” and that assimilation would weaken their loyalty and drive them into the arms of the United States. He defended the seigneurial system and sought permission to grant seigneurial lands under crown control to French Canadians who could not afford to purchase on freehold tenure. He exhibited a genuine desire to distribute government patronage with the utmost impartiality, reintegrating militia officers whom a predecessor, Lord Dalhousie [Ramsay], had dismissed for opposition to the administration, increasing the number of French Canadians on the bench, ensuring a balance between francophones and anglophones on the commission of the peace, and making 8 of his first 14 appointees to the Legislative Council French Canadians. In 1831, to prove that he was “free of all party connections,” he offered seats on the Executive Council to Patriote leaders Papineau and John Neilson. Although both refused, Aylmer successively appointed the francophone reform members of the House of Assembly Philippe Panet*, Dominique Mondelet*, and Hugues Heney. Undeniably, he did not go far enough; the Legislative and Executive councils and the high echelons of the civil service continued to be dominated by anglophones unsympathetic to the demands of the assembly. None the less, he went as far as, and at times farther than, his superiors in London wanted and, at least initially, he convinced Papineau that “he likes and desires the good of the province.”\n\nThe legislature met for the first time under Aylmer in January 1831 when, labouring under “a severe indisposition,” he delivered his speech from the throne “literally from my bed.” Throughout the session he worked diligently to remedy the grievances of the assembly, many of which, he admitted, were “well founded.” He introduced economies in the civil service, presented nearly all the executive documents requested by the assembly, protested to the British government delays in examining reserved colonial legislation, refused to bend regulations for interested parties, demanded more rigorous standards in accounting for public funds, launched an investigation of abuses in the land-grant system, and induced the judges (with the exception of Chief Justice Jonathan Sewell) not to attend the Legislative Council while the Colonial Office deliberated on a long-standing demand for their exclusion from that body. In proroguing the legislature in March, he enquired for “any stray complaint” which the assembly had neglected.\n\nAylmer’s most controversial effort to appease came after the assembly petitioned for the dismissal of Attorney General James Stuart*, an outspoken opponent of the Patriote party, at the end of the session. Under pressure from the assembly, in September Aylmer suspended Stuart pending adjudication of its charges in Britain. Reprimanded by the Colonial Office for suspending Stuart before he was given the opportunity to defend himself in the assembly, Aylmer rightly pointed out that not to have acted would have provoked “the utmost degree of ferment and agitation.” In November 1832 the Colonial Office dismissed Stuart, who unsuccessfully challenged Aylmer to a duel. He was hailed as a martyr by those among the British minority in the colony who believed that Aylmer “dare not displease Mr. Citoyen Papineau by whom . . . he is held completely under cow.” Aylmer’s decision had enhanced his reputation with the reformers, however, and particularly with Papineau, who had earlier entertained the Aylmers at his country estate in June 1831. But though “on good (I may say cordial) terms” with Papineau, Aylmer was aware that a great gulf existed between them on a number of questions.\n\nFor more than a decade the main preoccupation of the assembly had been to obtain control of the provincial revenues, including those reserved to the crown by the Quebec Revenue Act of 1774 [see Sir Francis Nathaniel Burton*]. Murray’s Whig successor at the Colonial Office, Lord Goderich, instructed Aylmer to submit a pared-down list of estimates to the assembly and to request a permanent civil list preparatory to a surrender of the crown revenues. The assembly paid little attention to Goderich’s estimates and none to his request for a civil list, although it did vote supplies for one year. Ignoring Aylmer’s advice to the contrary and influenced by his parliamentary under-secretary, Lord Howick, Goderich introduced a bill into parliament in the summer of 1831 surrendering the crown revenues unconditionally, and in September he ordered Aylmer to reconvene the legislature and again request a comparatively modest civil list. The assembly, however, refused salaries to several officials on Goderich’s list and, when Aylmer foolishly tried to coerce it by hinting that he would reserve any bill deviating from Goderich’s intentions, it refused permanent salaries to any officials. It seems unlikely that Goderich’s proposals, which were rejected by 42 to 9, would have been accepted by the assembly even had Aylmer been more astute, and the disappointed governor closed the session in late February 1832, acknowledging that his friendly relations with the leaders of the Patriote party had been sorely strained.\n\nIn 1832 deterioration of those relations accelerated after three French-speaking Canadians were shot by British troops on 21 May during a turbulent by-election in Montreal [see Daniel Tracey*]. Aylmer’s sympathies lay with the soldiers, and although he wrote to Papineau regretting the deaths, he refused to intervene in the subsequent judicial process, even when Papineau requested a military inquiry. He encouraged Solicitor General Charles Richard Ogden* to bring the case before a grand jury but later publicly praised the jury’s exoneration of the military. Thereafter Papineau pointedly declined to attend receptions at the Château.\n\nThe anger of the Patriote party was fuelled by a cholera epidemic which in 1832 killed more than 7,000 people in the colony. Aylmer had prepared for the outbreak by persuading the legislature to establish a quarantine station at Grosse Île and a board of health at Quebec and to authorize such facilities elsewhere when necessary. Although Aylmer conscientiously enforced the quarantine regulations and issued money to the boards of health and the Montreal Emigrant Society, the measures proved wholly inadequate. Moreover, by insisting that only the law officers of the crown should prosecute he hindered the work of the boards, and by encouraging flight to reduce the incidence of cholera in the cities he contributed to the spread of the disease. Yet, on balance, he did not deserve the censure of the assembly, which also criticized him for issuing funds without its approval and for failing to control the influx of immigrants. In fact, Aylmer did wish to limit immigration and proposed to raise money by a tax on immigrants. When the assembly met in November 1832, it was in an angry mood; it declared Mondelet’s seat vacant on his appointment to the Executive Council, passed a supply bill making no provision for a civil list, which the Legislative Council felt compelled to reject, and adopted an address, similar to one it had itself rejected in the previous session, demanding an elective legislative council.\n\nTo Aylmer these actions demonstrated intransigence, and he requested authorization from London to use the unappropriated funds surrendered to the legislature by Goderich’s Revenue Act of 1831. Edward George Geoffrey Smith Stanley, later Lord Stanley, who replaced Goderich at the Colonial Office in April 1833, sympathized but would not act until the assembly had been given an opportunity to reconsider. Consequently, when Aylmer reconvened the legislature in January 1834 he virtually invited a confrontation. He refused to grant the assembly contingency funds of £7,000 and reserved 11 of the 12 bills passed by the legislature, disallowing the 12th. In return the assembly refused to vote supplies and passed 92 resolutions of grievance, including one demanding the governor’s recall. Asserting that the resolutions were tantamount to a “Declaration of Independence,” Aylmer sent to Stanley a draft bill restoring to the government control over the revenues surrendered to the assembly by Goderich’s Revenue Act. Stanley was prepared to rescind Goderich’s act, and he referred the 92 resolutions to a select committee of the House of Commons, which he assumed would exonerate Aylmer. But Stanley was replaced in June 1834 by Thomas Spring-Rice, an easy-going Irish Whig, who was determined to avoid confrontation. Spring-Rice persuaded the Commons committee to attribute the conflict in Lower Canada simply to “mutual misconceptions.” After meeting with delegates from the assembly, he authorized Aylmer in September to borrow £31,000 from the military chest for unpaid salaries, assuming (erroneously) that the assembly would agree to repay the loan. Aylmer was dismayed by Spring-Rice’s actions and by the failure of the select committee to vindicate his conduct.\n\nIronically, Aylmer had led the Colonial Office to adopt a more conciliatory policy by insisting that the radicals in the assembly were losing support. During the sessions of 1833 and 1834 a rift had developed within the Patriote party, and Aylmer sought to exploit it, in particular by cultivating the hierarchy of the Roman Catholic Church, which opposed the policies of the radicals. Although a devout member of the Church of England, Aylmer was unusually tolerant in his religious views, wishing, for example, to alter the oath taken by justices of the peace so that he could appoint Jewish magistrates [see Aaron Ezekiel Hart*]. He attended mass in the Roman Catholic cathedral as well as in his own, refused to go to the services of a local Anglican priest who had protested Aylmer’s giving pecuniary aid to the Catholic Church, offered the Ursulines of Quebec refuge in the Château when a fire broke out in their convent, recommended that the Roman Catholic bishop be appointed to the Executive Council, and discouraged the Colonial Office from interfering with the Sulpician estates. In addition to cultivating the church, Aylmer deliberately chose his nominees for government posts from among the more conservative and “respectable” members of the Patriote party.\n\nAylmer’s appointments, however, had the effect of weakening the moderates in the assembly, since appointees lost their seats. In any case Aylmer was himself an inadequate instrument for multiplying vendus. Progressively disenchanted with what he considered to be the ignorance and ingratitude of French Canadians, he had begun by September 1832 to argue that “British influence in Lower Canada . . . must ere long be paramount” and that French Canadians must “finally reconcile themselves to a fate which cannot be averted.” In October he warned Sir John Colborne*, lieutenant governor of Upper Canada, that “when the king’s Subjects are spoken of as Foreigners and the Canadians as a Nation held in subjection by another Nation, it becomes the constituted Authorities to be upon their Guard.” By the spring of 1834 he was convinced that so long as the assembly was composed largely of French Canadians “the Constitution of the Province . . . will never work beneficially.” After the passage of the 92 Resolutions his primary concern was to reconcile the American-born population in the Eastern Townships and the rapidly growing Irish communities in Montreal and Quebec by appointing representatives from both groups to positions of importance. In June 1835 he strongly endorsed the application of “an association of gentlemen” from the townships for permission to purchase a large quantity of land on terms similar to those given to the British American Land Company [see Sir Alexander Tilloch Galt*], despite vehement opposition from the assembly.\n\nGradually, in fact, Aylmer had come under the influence of the old official group. In April 1834 he appointed David Chisholme, one of Dalhousie’s protégés, coroner of Trois-Rivières. When John Fletcher was unable to accept a promotion on the bench suggested as recompense for “the persecution of the House of Assembly to which he has been exposed for a series of years,” Aylmer recommended Samuel Gale*, who had acted as Dalhousie’s agent in England in 1828 and served as counsel to the officers in command during the Montreal “massacre.” This recommendation encountered strong opposition at the Colonial Office but was accepted under pressure from Aylmer on condition that the next vacancy would be given to a French Canadian.\n\nGale’s appointment alienated many moderates on both sides. Aylmer added to his unpopularity by refusing money to Montreal during a second outbreak of cholera in 1834 and by retreating to the governor’s cottage at William Henry (Sorel) during the height of the outbreak. Late that year the radicals won a sweeping victory at the polls, virtually eliminating the moderates from the assembly. Aylmer was not displeased with this result, arguing that it had “roused a feeling (hitherto dormant) in the British Population,” which might, however, “lead to very serious results, unless prudently managed.” He enthusiastically approved the formation of militant constitutional associations at Quebec and Montreal, and warned that the British minority were no longer prepared to accept domination by the assembly. He blamed the Patriote victory on “the Complacency with which the Canada Committee [of 1834] listened to sham Grievances” and predicted that the new assembly would be less reasonable than its predecessor. When the assembly met in February 1835, he made his prediction reality by refusing to issue money for the assembly’s contingencies. In return the house again refused supplies and complained that Aylmer was prejudiced against French Canadians. On 18 March Aylmer prorogued the legislature and called upon Britain to find a solution to the constitutional and financial impasse.\n\nThe solution adopted by the Colonial Office was to replace Aylmer. Spring-Rice had begun to search for a successor in the autumn of 1834 and had promised Aylmer another government if he would resign. But Aylmer wanted exoneration, and he suggested sending a parliamentary commission to examine the assembly’s charges. In April 1835 a three-man commission was appointed, but its head, Lord Gosford [Acheson], would also become Aylmer’s replacement. Aylmer bitterly resented his dismissal and was further antagonized when Gosford, who assumed control of the government on 24 Aug. 1835, dissociated himself from his predecessor. Aylmer’s mood was not improved by a terrifying return voyage, described by Lady Aylmer in Narrative of the passage of the “Pique” across the Atlantic (London, 1837). Once in England, he attempted without success to obtain approval of his conduct by refusing appointment as commander of the forces in Ireland unless he got it. However, he did coerce the government into awarding him a gcb, on 10 Sept. 1836, and on 23 Nov. 1841 he became a general, but he never obtained an English peerage, to which he felt entitled, or another administrative post. On 23 Feb. 1850 he died in his London home of an aneurysm of the heart.\n\nOn leaving the colony Aylmer had expressed regret that his “anxious endeavours to promote the general welfare of Lower Canada, should have fallen (as they have) so far short” of his initial expectations and burst into tears when the small crowd which had gathered at the wharf cheered. In truth, Aylmer is a tragic figure. He was well meaning and as competent as most of the military men sent to govern British North America following the Napoleonic Wars. But Lower Canada required a governor with political skill, and as Aylmer had noted in October 1831, “I cannot look for advice, or support here, beyond the circle of my own family composed of Soldiers like myself; & on . . . [the other] side of the Water I am totally destitute of Political Connexions.” Largely unprepared, he had found himself “called upon all at once to contend against those whose lives have been devoted to the Study of Law & Politics.” The Vindicator and Canadian Advertiser declared that Aylmer had “earned a niche in Canadian History, alongside of the Craigs [Sir James Henry Craig*] and Dalhousies, and gained for himself the execration of half-a-million people”; the Whigs blamed him for the failure of their conciliatory policy; and historians sympathetic to them, such as Helen Taft Manning, have echoed this assessment. Yet, although Aylmer was guilty of serious errors of judgement, much of the criticism of him is unfair. Many of his blunders, as historian Fernand Ouellet notes, “were more or less provoked,” and he never became as violently francophobic as Craig or Dalhousie, never lost his temper in public, never closed the doors of the Château to his opponents. He contributed to ethnic polarization in Lower Canada, but he was not responsible for it, nor could he, any more than Gosford, a civilian with considerable political experience, have prevented its development. Moreover, Aylmer was handicapped by the rapid changes of government in Britain during the early 1830s, serving under five secretaries whose views on Lower Canada differed sharply. Without “Political Connexions” in Britain, he was sacrificed to facilitate accommodation with the Lower Canadian assembly; the sacrifice, ironically, was in vain for by then the train of events leading to the rebellions of 1837–38 was probably irreversible.\n\nPhillip Buckner"}, {"url": "https://wiki.alquds.edu/?query=Matthew_Whitworth-Aylmer,_5th_Baron_Aylmer", "page_content": "Matthew Whitworth-Aylmer, 5th Baron Aylmer, (24 May 1775 – 23 February 1850) was a British military officer and colonial administrator.\n\nNapoleonic Wars [ edit ]\n\nAylmer was gazetted ensign in 1787, lieutenant in 1791 and major in 1800, after being held in a French prison for six months in 1798. His career continued as colonel in 1810, being aide-de-camp to King George III between 1810 and 1812 and then major general in 1813. He was present at most of the battles in the Peninsular War.\n\nIn 1814, following service in the French Revolutionary Wars and the Napoleonic Wars, he was appointed adjutant general of British forces in Ireland, where he remained until 1823.\n\nNorth American administration [ edit ]\n\nAfter reaching the position of lieutenant-general in 1825, Aylmer was, in 1830, appointed commander of British military forces in North America as well as Governor General of British North America and Lieutenant Governor of Lower Canada.\n\nLord Aylmer had no previous experience as a civil administrator and no political experience. He was unable to pacify the growing demands in Lower Canada for responsible government and, in 1834, the radical Assembly of Lower Canada passed 92 resolutions of grievance including a demand that Aylmer be recalled. Lord Aylmer exacerbated ethnic tensions in Lower Canada by favouring the English over the French. The deterioration of the situation led to his recall in 1835.[1] His administration may have been a contributing factor to the Lower Canada Rebellion of 1837.\n\nReturn to England [ edit ]\n\nReturning to England, Aylmer was promoted to the rank of general in 1845, but he never obtained a British peerage (his dignity was in the Irish peerage) or another administrative post.\n\nHe died at 15 Eaton Square, Belgravia, on 23 February 1850 and was buried at West Norwood Cemetery.\n\nAylmer's sister Rose Aylmer was the inspiration behind the poem of that name by Walter Savage Landor.\n\nFamily [ edit ]\n\nLady Louisa Anne Aylmer\n\nGeneral the Right Honourable Matthew Whitworth, 5th Lord Aylmer, G.C.B., married Louisa Anne Call, daughter of Sir John Call, Bart. on 4 August 1801. When her husband was appointed in 1830 to administer the government of Canada, as Governor-General, from February 1831 to August 1835, the couple entertained at the Castle of St. Louis, Quebec. During the cholera epidemic of 1831–32, she was interested in the relief of the sufferers. Since she was interested in education, she regularly visited and bestowed prizes in the schools. She served as the patroness of the Societe d'Education sous la direction des dames lie Quebec. She died on 13 August 1862.[2]\n\nReferences [ edit ]\n\nWorks cited\n\nObituary, The Times, 26 February 1850\n\n\n\n"}, {"url": "https://peoplepill.com/people/matthew-whitworth-aylmer-5th-baron-aylmer/", "page_content": "General Matthew Whitworth-Aylmer, 5th Baron Aylmer, GCB (24 May 1775 – 23 February 1850) was a British military officer and colonial administrator.\n\nNapoleonic Wars\n\nHe was gazetted ensign in 1787, lieutenant in 1791 and major in 1800, after being held in a French prison for six months in 1798. His career continued as colonel in 1810, being aide-de-camp to the King between 1810 and 1812 and then major-general in 1813. He was present at most of the battles in the Peninsular War.\n\nIn 1814, following service in the French Revolutionary Wars and the Napoleonic Wars, he was appointed adjutant general of British forces in Ireland, where he remained until 1823.\n\nNorth American administration\n\nAfter reaching the position of lieutenant-general in 1825, he was, in 1830, appointed commander of British military forces in North America as well as Governor General of British North America and Lieutenant Governor of Lower Canada.\n\nLord Aylmer had no previous experience as a civil administrator and no political experience. He was unable to pacify the growing demands in Lower Canada for responsible government and, in 1834, the radical Assembly of Lower Canada passed 92 resolutions of grievance including a demand that Aylmer be recalled. Lord Aylmer exacerbated ethnic tensions in Lower Canada by favouring the English over the French. The deterioration of the situation led to his recall in 1835. His administration may have been a contributing factor to the Lower Canada Rebellion of 1837.\n\nReturn to England\n\nReturning to England, Aylmer was promoted to the rank of general in 1845 but he never obtained a British peerage (his dignity was in the Irish peerage), or another administrative post.\n\nHe died at 15 Eaton Square, Belgravia on 23 February 1850, and was buried at West Norwood Cemetery.\n\nAylmer's sister Rose Aylmer was the inspiration behind the poem of that name by Walter Savage Landor.\n\nFamily\n\nLady Louisa Anne Aylmer Lady Louisa Anne Aylmer\n\nGeneral the Right Honourable Matthew Whitworth, 5th Lord Aylmer, G.C.B., married Louisa Anne Call, daughter of Sir John Call, Bart. on 4 August 1801. When her husband was appointed in 1830 to administer the government of Canada, as Governor-General, from February 1831 to August 1835, the couple entertained at the Castle of St. Louis, Quebec. During the cholera epidemic of 1831-32, she was interested in the relief of the sufferers. Since she was interested in education, she regularly visited and bestowed prizes in the schools. She served as the patroness of the Societe d'Education sous la direction des dames lie Quebec. She died on 13 August 1862."}, {"url": "https://prabook.com/web/matthew.whitworth-aylmer/2058698", "page_content": "Matthew Whitworth-Aylmer\n\nadministrator military officer\n\nMarch 24, 1775 (age 74)\n\nHe was gazetted ensign in 1787, lieutenant in 1791 and major in 1800, after being held in a French prison for six months in 1798. His career continued as colonel in 1810, being aide-de-camp to the King between 1810 and 1812 and then major-general in 1813. He was present at most of the battles in the Peninsular War. In 1814, following service in the French Revolutionary Wars and the, he was appointed adjutant general of British forces in Ireland, where he remained until 1823. After reaching the position of lieutenant-general in 1825, he was, in 1830, appointed commander of British military forces in North America as well as Governor General of British North America and Lieutenant Governor of Lower Canada. Lord Aylmer had no previous experience as a civil administrator and no political experience. He was unable to pacify the growing demands in Lower Canada for responsible government and, in 1834, the radical Assembly of Lower Canada passed 92 resolutions of grievance including a demand that Aylmer be recalled. Lord Aylmer exacerbated ethnic tensions in Lower Canada by favouring the English over the French. The deterioration of the situation led to his recall in 1835. His administration may have been a contributing factor to the Lower Canada Rebellion of 1837. Returning to England, Aylmer was promoted to the rank of general in 1845 but he never obtained a British peerage (his dignity was in the Irish peerage), or another administrative post. He died at 15 Eaton Square, Belgravia on 23 February 1850, and was buried at West Norwood Cemetery. Aylmer\"s sister Rose Aylmer was the inspiration behind the poem of that name by Walter Savage Landor. General the Right Honourable Matthew Whitworth, 5th Lord Aylmer, Knight Grand Cross of the Bath, married Louisa Anne Call, daughter of Sir John Call, Baronet. on 4 August 1801. During the cholera epidemic of 1831-1832, she was interested in the relief of the sufferers. Since she was interested in education, she regularly visited and bestowed prizes in the schools. She served as the patroness of the Societe d\"Education sous la direction des dames lie Quebec. She died on 13 August 1862."}, {"url": "https://www.findagrave.com/memorial/172529447/matthew-whitworth-aylmer", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://dbpedia.org/resource/Matthew_Whitworth-Aylmer,_5th_Baron_Aylmer", "page_content": "dbo: abstract Matthew Whitworth-Aylmer, 5. baron Aylmer (Matthew Whitworth-Aylmer, 5th Baron Aylmer of Balrath, 8th Baronet Aylmer of Balrath) (24. května 1775 – 23. února 1850, Londýn, Anglie) byl britský generál z irské šlechtické rodiny. Od dětství byl jako dědic titulu barona irským peerem, vynikl v napoleonských válkách, hodnosti generála dosáhl v roce 1825. V letech 1830–1835 byl generálním guvernérem v Kanadě. (cs)\n\nMatthew Whitworth-Aylmer, 5th Baron Aylmer, GCB (24 May 1775 – 23 February 1850) was a British military officer and colonial administrator. (en)\n\nMatthew Whitworth-Aylmer, 5e baron Aylmer, né le 24 mai 1775 et mort le 23 février 1850 à Londres, est un officier et administrateur colonial britannique. Il fut gouverneur général de l'Amérique du Nord britannique entre 1830 et 1835. (fr)\n\nMatthew Whitworth-Aylmer (24 maggio 1775 – Belgravia, 23 febbraio 1850) è stato un militare inglese. (it)\n\nMatthew Whitworth (ur. 1775, zm. 1850), oficjalny tytuł 5th Baron Aylmer – gubernator generalny Brytyjskiej Kanady. Za jego rządów kolonia wkroczyła w kryzys społeczny związany ze wzrastającymi aspiracjami Kanadyjczyków do niepodległości. Gubernator poparł ultrakonserwatywne ugrupowania w obu częściach kolonii. Narodziłą się w tym czasie idea „odpowiedzialnego rządu”. Napięcie związane z sytuacją doprowadziło ostatecznie do wybuchu buntów za czasów urzędowania jego następcy. (pl)\n\nГенерал Мэтью Уитворт-Эйлмер, 5-й барон Эйлмер, GCB (24 мая 1775 года — 23 февраля 1850 года), был британским офицером и колониальным чиновником. (ru)\n\ndbp: allegiance United Kingdom (en)\n\ndbp: name The Lord Aylmer (en)\n\ndbp: years 1785 (xsd:integer)\n\n1827 (xsd:integer)\n\n1830 (xsd:integer)\n\n1832 (xsd:integer)\n\nrdfs: comment Matthew Whitworth-Aylmer, 5. baron Aylmer (Matthew Whitworth-Aylmer, 5th Baron Aylmer of Balrath, 8th Baronet Aylmer of Balrath) (24. května 1775 – 23. února 1850, Londýn, Anglie) byl britský generál z irské šlechtické rodiny. Od dětství byl jako dědic titulu barona irským peerem, vynikl v napoleonských válkách, hodnosti generála dosáhl v roce 1825. V letech 1830–1835 byl generálním guvernérem v Kanadě. (cs)\n\nMatthew Whitworth-Aylmer, 5th Baron Aylmer, GCB (24 May 1775 – 23 February 1850) was a British military officer and colonial administrator. (en)\n\nMatthew Whitworth-Aylmer, 5e baron Aylmer, né le 24 mai 1775 et mort le 23 février 1850 à Londres, est un officier et administrateur colonial britannique. Il fut gouverneur général de l'Amérique du Nord britannique entre 1830 et 1835. (fr)\n\nMatthew Whitworth-Aylmer (24 maggio 1775 – Belgravia, 23 febbraio 1850) è stato un militare inglese. (it)\n\nMatthew Whitworth (ur. 1775, zm. 1850), oficjalny tytuł 5th Baron Aylmer – gubernator generalny Brytyjskiej Kanady. Za jego rządów kolonia wkroczyła w kryzys społeczny związany ze wzrastającymi aspiracjami Kanadyjczyków do niepodległości. Gubernator poparł ultrakonserwatywne ugrupowania w obu częściach kolonii. Narodziłą się w tym czasie idea „odpowiedzialnego rządu”. Napięcie związane z sytuacją doprowadziło ostatecznie do wybuchu buntów za czasów urzędowania jego następcy. (pl)\n\nГенерал Мэтью Уитворт-Эйлмер, 5-й барон Эйлмер, GCB (24 мая 1775 года — 23 февраля 1850 года), был британским офицером и колониальным чиновником. (ru)\n\nrdfs: label Matthew Whitworth–Aylmer, 5. baron Aylmer (cs)\n\nMatthew Whitworth-Aylmer (fr)\n\nMatthew Whitworth-Aylmer, V barone Aylmer (it)\n\nMatthew Whitworth-Aylmer, 5th Baron Aylmer (en)\n\nMatthew Whitworth-Aylmer (pl)\n\nУитворт-Эйлмер, Мэтью, 5-й барон Эйлмер (ru)"}, {"url": "http://worldheritage.org/articles/Matthew_Whitworth-Aylmer,_5th_Baron_Aylmer", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://everything.explained.today/Matthew_Whitworth-Aylmer%2C_5th_Baron_Aylmer/", "page_content": "Matthew Whitworth-Aylmer, 5th Baron Aylmer explained\n\nMatthew Whitworth-Aylmer, 5th Baron Aylmer, (24 May 1775 – 23 February 1850) was a British military officer and colonial administrator.\n\nNapoleonic Wars\n\nAylmer was gazetted ensign in 1787, lieutenant in 1791 and major in 1800, after being held in a French prison for six months in 1798.His career continued as colonel in 1810, being aide-de-camp to King George III between 1810 and 1812 and then major general in 1813. He was present at most of the battles in the Peninsular War.\n\nIn 1814, following service in the French Revolutionary Wars and the Napoleonic Wars, he was appointed adjutant general of British forces in Ireland, where he remained until 1823.\n\nNorth American administration\n\nAfter reaching the position of lieutenant-general in 1825, Aylmer was, in 1830, appointed commander of British military forces in North America as well as Governor General of British North America and Lieutenant Governor of Lower Canada.\n\nLord Aylmer had no previous experience as a civil administrator and no political experience. He was unable to pacify the growing demands in Lower Canada for responsible government and, in 1834, the radical Assembly of Lower Canada passed 92 resolutions of grievance including a demand that Aylmer be recalled. Lord Aylmer exacerbated ethnic tensions in Lower Canada by favouring the English over the French. The deterioration of the situation led to his recall in 1835.[1] His administration may have been a contributing factor to the Lower Canada Rebellion of 1837.\n\nReturn to England\n\nReturning to England, Aylmer was promoted to the rank of general in 1845, but he never obtained a British peerage (his dignity was in the Irish peerage) or another administrative post.\n\nHe died at 15 Eaton Square, Belgravia, on 23 February 1850 and was buried at West Norwood Cemetery.\n\nAylmer's sister Rose Aylmer was the inspiration behind the poem of that name by Walter Savage Landor.\n\nFamily\n\nGeneral the Right Honourable Matthew Whitworth, 5th Lord Aylmer, G.C.B., married Louisa Anne Call, daughter of Sir John Call, Bart. on 4 August 1801. When her husband was appointed in 1830 to administer the government of Canada, as Governor-General, from February 1831 to August 1835, the couple entertained at the Castle of St. Louis, Quebec. During the cholera epidemic of 1831–32, she was interested in the relief of the sufferers. Since she was interested in education, she regularly visited and bestowed prizes in the schools. She served as the patroness of the Societe d'Education sous la direction des dames lie Quebec. She died on 13 August 1862.[2]\n\nReferences\n\nWorks cited\n\nObituary, The Times, 26 February 1850\n\nExternal links\n\nNotes and References"}, {"url": "https://academickids.com/encyclopedia/index.php/Matthew_Whitworth-Aylmer%2C_5th_Baron_Aylmer", "page_content": "From Academic Kids\n\nMatthew Whitworth-Aylmer, 5th Baron Aylmer (1775–1850) was a British military officer and colonial administrator. After reaching the position of colonel in the British army he was, in 1830, appointed commander of British military forces in North America as well as Governor General of British North America and Lietenant-Governor of Lower Canada.\n\nLord Aylmer had no previous experience as a civil administrator and no political experience and was unable to pacify the growing demands in Lower Canada for responsible government and, in 1834, the radical Assembly of Lower Canada passed 92 resolutions of grievance including a demand that Aylmer be recalled. Lord Aylmer exacerbated ethnic tensions in Lower Canada by favouring the English. The deterioration of the situation led to his recall in 1835. His administration may have been a contributing factor to the Patriotes Rebellion of 1837.\n\nReturning to England, Aylmer was promoted to the rank of general but he never obtained a British peerage (his dignity was in the Irish peerage), or another administrative post.\n\n\n\n"}, {"url": "https://en.unionpedia.org/i/Matthew_Whitworth-Aylmer,_5th_Baron_Aylmer", "page_content": "Matthew Whitworth-Aylmer, 5th Baron Aylmer General Matthew Whitworth-Aylmer, 5th Baron Aylmer, GCB (24 May 1775 – 23 February 1850) was a British military officer and colonial administrator. [1]\n\n43 relations: Anglo-Portuguese Army, Archibald Acheson, 2nd Earl of Gosford, Aylmer, Aylmer, Ontario, Aylmer, Quebec, Baron Aylmer, Battle of Bayonne, Battle of Garris, Battle of Orthez, Battle of the Bidassoa, Battle of the Nive, Executive Council of Lower Canada, Fassett, Quebec, George Brown (British Army officer), Henry John Caldwell, Hudson Lowe, James Kempt, Jean Desfossés, John Forster FitzGerald, John Forsyth (loyalist), John Hely-Hutchinson, 2nd Earl of Donoughmore, List of British generals and brigadiers, List of Governors General of Canada, List of seignories of Quebec, List of subjects related to the Quebec independence movement, Notre-Dame-de-Bonsecours, Quebec, Richard Airey, 1st Baron Airey, Robert Barrie, Royal Irish Regiment (1684–1922), Sir John Murray, 8th Baronet, SS Royal William, Viceregal consort of Canada, Viceregal eponyms in Canada, Walter Savage Landor, 1775, 1775 in Canada, 1833 in Canada, 1834 in Canada, 1836 in Canada, 1850, 1850 in Canada, 56th (West Essex) Regiment of Foot, 62nd (Wiltshire) Regiment of Foot.\n\nThe Anglo-Portuguese Army was the combined British and Portuguese army that participated in the Peninsular War, under the command of Arthur Wellesley.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Anglo-Portuguese Army · See more »\n\nArchibald Acheson, 2nd Earl of Gosford (1 August 1776 – 27 March 1849, Markethill), styled The Honourable Archibald Acheson from 1790 to 1806 and Lord Acheson from 1806 to 1807, was a British politician who served as Lieutenant-Governor of Lower Canada and Governor General of British North America in the 19th century.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Archibald Acheson, 2nd Earl of Gosford · See more »\n\nAylmer is a surname.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Aylmer · See more »\n\nAylmer is a town in Elgin County in southern Ontario, Canada, just north of Lake Erie, on Catfish Creek.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Aylmer, Ontario · See more »\n\nAylmer is a former city in Quebec, Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Aylmer, Quebec · See more »\n\nLord Aylmer, Baron of Balrath, in the County of Meath, is a title in the Peerage of Ireland.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Baron Aylmer · See more »\n\nThe Battle of Bayonne of 14 April 1814 was a sortie by General Thouvenot's French garrison of Bayonne during the siege of that city conducted by Allied forces under Lieutenant General John Hope.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Battle of Bayonne · See more »\n\nThe Battle of Garris (Basque Garrüze) or Battle of Saint-Palais (February 15, 1814) saw an Allied force under the direct command of General Arthur Wellesley, Marquess Wellington attack General of Division Jean Harispe's French division.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Battle of Garris · See more »\n\nThe Battle of Orthez (27 February 1814) saw the Anglo-Portuguese Army under Field Marshal Arthur Wellesley, Marquess of Wellington attack an Imperial French army led by Marshal Nicolas Soult in southern France.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Battle of Orthez · See more »\n\nIn the Battle of the Bidasoa (or the Battle of Larrun) on 7 October 1813 the Allied army of Arthur Wellesley, Marquess of Wellington wrested a foothold on French soil from Nicolas Soult's French army.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Battle of the Bidassoa · See more »\n\nThe Battles of the Nive (9–13 December 1813) were fought towards the end of the Peninsular War.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Battle of the Nive · See more »\n\nThe Executive Council of Lower Canada was an appointive body created by the Constitutional Act of 1791.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Executive Council of Lower Canada · See more »\n\nFassett is a municipality and village in the Papineau Regional County Municipality in Quebec, Canada, located on the north shore of the Ottawa River east of Montebello.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Fassett, Quebec · See more »\n\nGeneral Sir George Brown, (3 July 1790 – 27 August 1865) was a British soldier notable for commands in the Peninsular War and the Crimean War.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and George Brown (British Army officer) · See more »\n\nSir Henry John Caldwell (October 22, 1801 – October 13, 1858) was a seigneur and political figure in Lower Canada and Canada East (now Quebec.) He represented Dorchester in the Legislative Assembly of Lower Canada from 1830 to 1834.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Henry John Caldwell · See more »\n\nSir Hudson Lowe (28 July 176910 January 1844) was an Anglo-Irish soldier and colonial administrator who is best known for his time as Governor of St Helena, where he was the \"gaoler\" of the Emperor Napoléon.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Hudson Lowe · See more »\n\nGeneral Sir James Kempt, (c. 1765 – 20 December 1854) was a British Army officer, who served in the Netherlands, Egypt, Italy, the Peninsula, and British North America during the Napoleonic Wars.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and James Kempt · See more »\n\nJean Desfossés (November 1787 – April 21, 1854) was a merchant and political figure in Lower Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Jean Desfossés · See more »\n\nField Marshal Sir John Forster FitzGerald, GCB (c.1785 – 24 March 1877), was a soldier from Ireland who served as an officer in the British Army.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and John Forster FitzGerald · See more »\n\nJohn Forsyth (December 8, 1762 – December 27, 1837) was a partner in the influential commercial house of Forsyth, Richardson & Co.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and John Forsyth (loyalist) · See more »\n\nGeneral John Hely-Hutchinson, 2nd Earl of Donoughmore, GCB (15 May 1757 – 29 June 1832) was an Anglo-Irish politician, hereditary peer and soldier.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and John Hely-Hutchinson, 2nd Earl of Donoughmore · See more »\n\nThis is a list of people who held general officer rank or the rank of brigadier (together now recognized as starred officers) in the British Army, Royal Marines, British Indian Army or other military force.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and List of British generals and brigadiers · See more »\n\nThe following is a list of the governors and Governors General of Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and List of Governors General of Canada · See more »\n\nSeignories have existed in Québec from 1627 until the British conquest of New France in 1763 and continued in the British colony of the Province of Quebec (1763–1791) Then in Lower Canada (1840) and in the Province of Canada until 1854.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and List of seignories of Quebec · See more »\n\nThis is a list of subjects related to the Quebec independence movement.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and List of subjects related to the Quebec independence movement · See more »\n\nNotre-Dame-de-Bonsecours is a municipality in the Outaouais region of Quebec, Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Notre-Dame-de-Bonsecours, Quebec · See more »\n\nGeneral Richard Airey, 1st Baron Airey (April 180314 September 1881), known as Sir Richard Airey between 1855 and 1876, was a senior British Army officer of the 19th century.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Richard Airey, 1st Baron Airey · See more »\n\nSir Robert Barrie KCB, KCH (5 May 1774 – 7 June 1841) was a British officer of the Royal Navy noted for his service in the War of 1812.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Robert Barrie · See more »\n\nThe Royal Irish Regiment, until 1881 the 18th Regiment of Foot, was an infantry regiment of the line in the British Army, first raised in 1684.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Royal Irish Regiment (1684–1922) · See more »\n\nGeneral Sir John Murray, 8th Baronet, (c. 1768 – 15 October 1827) led a brigade under Arthur Wellesley, 1st Duke of Wellington in the Peninsular War.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Sir John Murray, 8th Baronet · See more »\n\nSS Royal William was a Canadian side-wheel paddle steamship that is sometimes credited with achieving the first crossing of the Atlantic Ocean to be made almost entirely under steam power, using sails only during periods of boiler maintenance, though the British-built Dutch-owned Curaçao crossed in 1827, and the sail-steam hybrid used some steam power when crossing in 1819.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and SS Royal William · See more »\n\nThe viceregal consort of Canada is the spouse of the serving governor general of Canada, assisting the viceroy with ceremonial and charitable work, accompanying him or her to official state occasions, and occasionally undertaking philanthropic work of their own.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Viceregal consort of Canada · See more »\n\nIn Canada, a number of sites and structures are named for Governors General of the country, the Canadian monarch's representative in the country.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Viceregal eponyms in Canada · See more »\n\nWalter Savage Landor (30 January 1775 – 17 September 1864) was an English writer and poet.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and Walter Savage Landor · See more »\n\nThe American Revolution begins this year, with the first military engagement being the April 19 Battles of Lexington and Concord on the day after Paul Revere's now-epic ride.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1775 · See more »\n\nEvents from the year 1775 in Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1775 in Canada · See more »\n\nEvents from the year 1833 in Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1833 in Canada · See more »\n\nEvents from the year 1834 in Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1834 in Canada · See more »\n\nEvents from the year 1836 in Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1836 in Canada · See more »\n\nNo description.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1850 · See more »\n\nEvents from the year 1850 in Canada.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 1850 in Canada · See more »\n\nThe 56th (West Essex) Regiment of Foot was an infantry regiment in the British Army, active from 1755 to 1881.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 56th (West Essex) Regiment of Foot · See more »\n\nThe 62nd (Wiltshire) Regiment of Foot was an infantry regiment of the British Army, which was raised in 1756 and saw service through the eighteenth and nineteenth centuries.\n\nNew!!: Matthew Whitworth-Aylmer, 5th Baron Aylmer and 62nd (Wiltshire) Regiment of Foot · See more »\n\nRedirects here:\n\nLord Aylmer.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Matthew_Whitworth-Aylmer,_5th_Baron_Aylmer"}]}