{"Matthew Aylmer was buried in Westminster Abbey.": [{"url": "http://historyofparliamentonline.org/volume/1690-1715/member/aylmer-matthew-1650-1720", "page_content": "Constituency DOVER DOVER\n\nFamily and Education\n\nb. c.1650, 2nd s. of Sir Christopher Aylmer, 1st Bt., of Balrath, co. Meath by Margaret, da. of Matthew Plunkett, 5th Baron Louth [I]. m. bef. 1682, Sarah (d. 1710), da. of Edward Ellis of London, 2s. (1 d.v.p.), 4da. (2 d.v.p.). cr. Baron Aylmer of Balrath [I] 1 May 1718.\n\nOffices Held\n\nEnsign of ft. Duke of Buckingham’s regt. 1672–?3, Tangier regt. 1677, lt. 1678; capt. of horse, Queen Dowager’s regt. 1686–?; lt.-col. of horse by 1690, marines 1697; ent. RN 1677, lt. 1678, capt. 1679, r.-adm. Feb. 1693, v.-adm. July 1693, adm. of fleet, 1709–1711, 1714–18, half-pay 1708–9, 1711–14; r.-adm. of Eng. 1718–d.; extra commr. Navy Board 1694–1702; ld. of Admiralty 1717–1718.\n\nCommr. Greenwich Hosp. 1695–?1703, gov. 1714–d.; keeper, Greenwich park and palace 1714–d.; gov. Deal Castle 1700–?4.\n\nFreeman, Portsmouth 1695, Dover 1697.\n\nCommr. registering seamen 1696–?1700.\n\nBiography\n\nLong-established in Ireland, the Aylmers were Old English palesmen with estates in the counties of Meath and Louth. As Catholics they suffered during the Civil Wars, when Aylmer’s grandfather was imprisoned, but were restored at least to some of their lands in 1661. Aylmer’s father, who received a baronetcy at this time, showed a loyalty to King Charles II which extended to a willingness to compromise with the Protestant establishment: he subscribed to the ‘protestation and remonstrance’ of Catholic gentry in 1661 repudiating papal authority, and both his younger sons, Matthew and George, conformed to the Established Church. As a result, Christopher came into conflict both with his own father, and then with his eldest son, Gerald, who disputed title to the family inheritance before eventually succeeding as 2nd Bt. Gerald then jeopardized the family estates by joining James II in 1689. In October 1690 Matthew Aylmer petitioned for a grant of the property his brother had forfeited, but the outcome is not known.\n\nAs the second son, Matthew embarked on a military career, as did his younger brother, George (d. 1689). He seems to have become a client of the 2nd Duke of Buckingham, in whose regiment he was commissioned. After the disbandment of the regiment, family history notes that Aylmer raised troops in Munster for the Dutch, before obtaining a commission in a Tangier regiment in 1677, and then switching to a naval career. While on active service at Tangier, he was raised to captain by Admiral Arthur Herbert†, and continued to serve until the evacuation of the garrison in 1683–4. In James II’s reign Aylmer saw service at sea against Monmouth’s rebels, before receiving promotion in the army. Given his Catholic antecedents, and his elder brother’s commitment to Rome, Aylmer’s position was fraught with possibilities and dangers; in July 1687 he received a dispensation from taking the oaths of allegiance and supremacy while acting as an army captain. However, in 1688 he showed unequivocal support for the Prince of Orange, and was a leading participant in the ‘navy plot’ against James II.\n\nAylmer’s main patron at this time appears to have been Edward Russell*. In February 1690, a report that John Hill had been appointed to the Navy Board brought a missive from Russell to Secretary Nottingham (Daniel Finch†), extolling Aylmer’s qualifications for such a post and recalling previous service to the Williamite cause. He was considered for a flag as early as August 1690, but it was as a captain that he was given command of the Mediterranean fleet in 1690–1, although he was allowed to retain his lieutenant-colonelcy in the army. In August 1691 Aylmer sought command of the West Indies squadron, but had to wait until 1693 for a flag. He may have tried to take advantage of the Smyrna fleet debacle in 1693, because Sir Ralph Delaval* wrote acidly, ‘there was not a flag at the council of war so very fond of coming into port as Mr Aylmer who I suppose doth all the good is in his nature but his hand is to every resolution of our councils of war which I hope to see him deny’. The following year saw his appointment to the Navy Board.\n\nAylmer’s first foray into electoral politics ended in a double return at the Portsmouth by-election of 1695 (after Russell himself had created the vacancy by opting to sit for Cambridgeshire). The Commons on 24 Jan. 1696 voted this a void election, and even with Russell’s backing Aylmer’s interest proved insufficient to overcome that of John Gibson, the town’s lieutenant-governor, who was returned unopposed at the second by-election. Early in 1696, the deposition of the Assassination Plotter Peter Cook suggested that the Jacobites thought they could ‘depend’ upon Aylmer, but nothing incriminating was revealed. In May 1697 he subscribed £1,000 to the contract for lending money to circulate Exchequer bills. The death of James Chadwick* left a vacancy for Dover, a borough in which the navy could exercise considerable influence. Aylmer approached the corporation in June 1697 and, despite snide references by Philip Papillon* to Aylmer’s Irishness and lack of any visible estate in the town or county, he was returned on 15 Dec., taking his seat on the 20th.\n\nIn February 1698 Aylmer was given command of the squadron destined for the Mediterranean. At this point he was ‘in town’, and presumably attending Parliament. Delays in supplying the fleet, owing to a shortage of funds, meant that he did not sail until September, which may have allowed him to consolidate his position in Dover with timely applications to the government for money to repair Dover harbour. Before leaving England he was re-elected, and was listed as a placeman in September 1698 and as a placeman on a comparative analysis of the old and new Parliaments. In an addendum to this list he was marked as absent, and the House officially excused his attendance on 7 Mar. 1699 because of his duties at sea and as envoy to various North African states.\n\nDuring Aylmer’s absence (he returned at the end of October 1699) there was a lengthy parliamentary inquiry into mismanagements at the Admiralty, one of the allegations being the delay in fitting out Aylmer’s squadron. Other, more specific, charges against him included his detention of the Centurion at Cadiz in order to force its commander, Price, to concede a large share of his profits, and Aylmer’s role as victualler of his own fleet while in the Mediterranean. Opinion divided on party lines as to his culpability. Sir Richard Cocks, 2nd Bt.*, thought Price’s charges ‘mere malice, nothing in it at all’, while James Vernon I* reported that the House had considered, in regard to victualling, that Aylmer was ‘too honest and too considerate’ to have submitted false accounts and profit thereby. However, Robert Harley’s* papers contain the draft of a resolution condemning Aylmer for corruption and breach of trust in detaining Price at Cadiz. This may well relate to the debate in the committee of the whole on 10 Mar. 1699, when Aylmer was blamed, but the matter was ‘let fall before they came to any question’.\n\nWhile Aylmer was at sea during the summer of 1699 Orford resigned his place at the Admiralty. In discussions that followed there was talk of promoting George Churchill* to a flag senior to Aylmer, no doubt as part of the Earl of Marlborough’s (John Churchill†) rapprochement with the Court. Vernon felt that Aylmer might resign over this matter, possibly ‘to give a handle for finding fault with the partialities of this commission of Admiralty, and to show the case is not much mended in that respect’, and that the appointment of Churchill would be difficult to defend on the grounds of experience and seniority. In the event, Churchill went to the Admiralty in place of Sir Robert Rich, 2nd Bt.*, while Aylmer continued at the Navy Board. An analysis of the House into ‘interests’ in early 1700 listed Aylmer as a member of the Bedford/Orford connexion. This affiliation did not help him to obtain one of the limited number of peacetime commands, although his name was linked with a squadron going to the Straits. In March 1701 he was listed among those flag officers ‘unemployed at sea’. Aylmer’s attention to constituency matters, such as his appointment on 12 Feb. 1700 to draft a bill to repair Dover harbour, ensured that he was returned at the election of January 1701; he even appears to have retained the naval interest at Dover although another Court supporter, Secretary of State Sir Charles Hedges*, was also returned. In the ensuing parliamentary session, Aylmer was listed among those thought likely to support the Court in February over the ‘Great Mortgage’.\n\nWhen Dover corporation rebuffed Hedges in the run-up to the election of December 1701, it was mostly because of Aylmer’s ‘neglect’ of their interests. In comparison, he had been more attentive, particularly over the harbour. Aylmer was also solicitous for his own interests: hence a petition he signed with three other navy commissioners on 31 Dec. 1701, for the continuance of an allowance of £80 p.a. for housing, in view of the fact that they could not be accommodated in government property. Aylmer had resided in the parish of St. Paul’s, Covent Garden, since at least as early as 1694, moving from St. Martin’s-in-the-Fields at some point after 1690, possibly coincidental with his appointment to the Navy Board in 1692. He had also purchased an estate near Dover, presumably by 1701 when he presented to an advowson at nearby East Langdon. On a list of the new Parliament, Harley classed him as a Whig. With fewer naval duties to perform, Aylmer was more active in the 1701–2 session, and was included on the drafting committee of a bill to encourage privateers. On a personal note he also assisted in the management of a private bill for the Fitzgerald and Plunkett families, with both of whom the Irish Aylmers were connected.\n\nAylmer had been appointed vice-admiral of the red in January 1702, but the death of William III saw his naval career at a standstill, following the Queen’s decision to employ George Churchill in that place, and the consequent dispute about seniority which Vernon had predicted three years before. Aylmer was also left out of a revamped Navy Board, for which the governorship of Deal and nomination to the Kentish lieutenancy and the bench were poor recompense. Re-elected for Dover in 1702, in July he petitioned the Queen for a pension, such as had been given by William III to Admirals Delaval and Killigrew (Henry*). Aylmer considered his position to be similar, in that he had been displaced from being vice-admiral of the red by Churchill and then removed from the Navy Board, whereas the official view was that Aylmer had declined to serve and had as a consequence also lost his post as a navy commissioner. Although L’Hermitage had described him in February 1702 as a Whig and a creature of Orford, Aylmer was spotted caballing in September with Lord Burlington (Hon. Charles Boyle I*), Lord Somers (Sir John*), Lord Halifax (Charles Montagu*), (Sir) Thomas Felton* (4th Bt.) and ‘Mr Hopkins [?Thomas*]’. Nothing came of these discussions between overlooked politicians, but Aylmer remained a Whig, voting on 13 Feb. 1703 to agree with the Lords’ amendments enlarging the time for taking the oaths of abjuration. Forecast as an opponent of the Tack, he did not vote for it on 28 Nov. 1704.\n\nIn January 1705 there was a rumour that Aylmer would serve at sea again the following summer, and in a conciliatory move the Treasury ordered a stay of prosecution against Aylmer and Sir Basill Dixwell, 2nd Bt.*, for failure to account for money given to them to repair Dover harbour. Returned again at the 1705 election, Aylmer was described in an analysis of the new House as a ‘High Church Courtier’, and his name appears on a list of placemen for 1705, presumably because of his governorship at Deal. On 25 Oct. 1705 he voted for the Court candidate as Speaker, and later in the session, on 18 Feb. 1706, supported the Court in the proceedings on the ‘place clause’ of the regency bill. He was more active in the Commons in this Parliament, his committee appointments again reflecting his interest in naval affairs, and in 1706 he presented a memorial to the Treasury on the desirability of the Navy Board taking over responsibility for Dover harbour.\n\nRe-elected in 1708, Aylmer was classed as a Whig on two lists of that year. He sought to capitalize on the swing towards the Whigs at this time and gain further preferment. Thus on 25 May, only a few weeks after the general election, he wrote to Marlborough to remind the Duke of a memorial delivered the previous winter, in which Aylmer had asked for the governorship of Greenwich Hospital, ‘or to be allowed a subsistence’. Since that post had been disposed of, Aylmer recounted the ‘hardships under which I suffer, and not being conscious that I have done anything can deserve so particular a mark of severeness above all other officers’. Marlborough seems to have responded favourably to this letter, which was referred to Lord Treasurer Godolphin (Sidney†), although nothing was done immediately. In December 1708 a commission was made out for Aylmer as admiral of the fleet, which was superseded the following day. This was a device to provide Aylmer with a ‘subsistence’ on half pay at a high rank. In 1709 he supported the naturalization of the Palatines. With the Earl of Pembroke (Hon. Thomas Herbert†) as Lord High Admiral, rumours began to circulate as early as March that the Admiralty would be put into a commission which would include Aylmer. The same rumours recurred in October and November, but when Orford was brought back into the Admiralty Aylmer was not one of the commissioners; instead he was given command of the fleet. This did not please everyone: Sir John Jennings* felt rather as Aylmer had done in 1702 when Churchill had been appointed, and Arthur Maynwaring* noted that ‘the officers have no real value for Mr Aylmer, nor indeed for anyone now but for Jennings’. As a consequence of his appointment Aylmer had to fight a by-election, but was returned unopposed. In the 1709–10 session he voted for the impeachment of Dr Sacheverell.\n\nReturned again at the 1710 election, Aylmer soon lost his position as admiral and commander-in-chief of the fleet. Indeed, at the committee of elections on 22 Feb. 1711, both Aylmer and Jennings were ‘severely criticized’ for interfering at the election for Weymouth by treating the corporation on board ship. However, when the report came before the House on 17 Mar. no resolution critical of Aylmer was passed. The end of the session saw Aylmer appealing to Harley for repayment of the contingency money he had spent while equipping himself for service at sea the previous year and referring again to the hardships he had undergone. In the following session Aylmer voted on 7 Dec. 1711 for the ‘No Peace without Spain’ motion, but otherwise was not very active. In the 1713 session he was not present in the Commons to vote in the divisions of 18 June over the French commerce bill because he had gone to Deal Castle with Sir John Norris* (his son-in-law) to celebrate the marriage of his younger daughter to Hugh Fortescue*.\n\nNot only was Aylmer defeated at the 1713 general election, it was even felt necessary to scotch a rumour in the following January that he was a Catholic. However, he was soon back in favour after the Hanoverian succession. In October 1714 he was reported to have been made governor of Greenwich Hospital, a post he had long coveted, which ‘is a very pretty post, and has a very pleasant house to dwell in’. November saw him reappointed admiral of the fleet, and he regained his seat in the Commons at the 1715 general election. On a comparative analysis of the 1713 and 1715 Parliaments he was listed as a Whig. Aylmer continued as admiral until he exchanged the post for the honorific title of rear-admiral of England and an Irish peerage in 1718. He died at Greenwich on 18 Aug. 1720, although his will, dated in June that year, still gave his address as Covent Garden. In it he had appointed as executor his son Henry†, an equerry to the King. Swift wrote off his compatriot as a violent partisan, but Aylmer seems to have been skilled at exploiting the situations available to him. His early naval career was marked by the smooth facility with which he moved between patrons, yet he managed to retain his seat at Dover even after the original backing of the Navy interest had been lost.\n\nRef Volumes: 1690-1715\n\nAuthor: Stuart Handley\n\nNotes"}, {"url": "https://www.geni.com/people/Matthew-Aylmer-1st-Baron-Aylmer/6000000007243781233", "page_content": "About Matthew Aylmer, 1st Baron Aylmer\n\nhttp://en.wikipedia.org/wiki/Matthew_Aylmer,_1st_Baron_Aylmer\n\nMatthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720) was an Irish Admiral of the Royal Navy.\n\nLord Aylmer, Admiral and Commander-in-Chief, was the second son of Sir Christopher Aylmer of Balrath, County Meath, and entered the Royal Navy under the protection of the Duke of Buckingham, as a Lieutenant, in 1678. Early in the following year he was advanced to the rank of Captain, and he appears to have served almost constantly during the next ten years on the coast of Algiers and in the Mediterranean.\n\nIn October 1688 he was appointed captain of HMS Swallow in the Thames, but at once gave in his allegiance to the cause of the Revolution. In 1690 he commanded the Royal Katherine, and, in the battle off Beachy Head, was one of the seconds to Sir Ralph Delaval who commanded the blue squadron. In 1692, still in the Royal Katherine, he was one of the seconds of the Commander-in-Chief at Barfleur. In February 1693 he was advanced to the rank of Rear Admiral, and to that of Vice Admiral in 1694, when he accompanied Admiral Russell to the Mediterranean, and was also appointed a Lord of the Admiralty. After the Treaty of Ryswick he was sent, in 1698, as Commander-in-Chief, again into the Mediterranean, principally to confirm the treaties with the regencies of Tripoli, Tunis, and Algiers. He returned home towards the end of the following year.\n\nIn November 1699, being, it is said, dissatisfied at the appointment of Admiral Churchill to the Admiralty, he retired from active service, though he continued to act as one of the Commissioners of the Navy till July 1702. He took no part whatever in naval affairs beyond sitting in Parliament as Baron or Member for Dover, till after the death of Prince George, and the retirement of Churchill in November 1709, when he was appointed Commander-in-Chief of the fleet. In the following July, whilst cruising in the Soundings, he fell in with a French squadron and convoy, of which only one merchantman and the Superbe, of 56 guns, were captured. The rest escaped, owing, it was alleged, to the haziness of the weather. The want of success served the new ministry as an excuse to supersede him, which they did in January 1711.\n\nHe held no further command till the Accession of George I, when he was again appointed Commander-in-Chief, Ranger of Greenwich Park, and the second Governor of Greenwich Hospital. This office he held till his death, and during that time succeeded in establishing the hospital school for the sons of seamen, which gradually developed into a magnificent institution. In April 1717 he became one of the Lords Commissioners of the Admiralty, but he resigned the appointment early the next year, when he was promoted to Rear Admiral of the United Kingdom, and at the same time raised to the peerage of Ireland as Lord Aylmer of Balrath. He had been elected Whig M.P. for Portsmouth in 1695, and for Dover in 1697, 1713, and 1715.\n\nA portrait, half-length, presented by his descendant, the fifth Lord Aylmer, is in the National Maritime Museum at Greenwich.\n\nAdmiral of the Fleet Matthew Aylmer, 1st Baron Aylmer (ca. 1650 – 18 August 1720), of Covent Garden, Westminster, and Westcliffe, near Dover, was an Anglo-Irish Royal Navy officer and Whig politician who sat in the English and British House of Commons between 1695 and 1720.\n\nAylmer was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support; the Prince's response ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer saw action at the Battle of Bantry Bay in May 1689, at the Battle of Beachy Head in July 1690 and again at the Battle of Barfleur in May 1692 during the Nine Years' War.\n\nAylmer became Commander-in-Chief of the Navy on 12 November 1709. However, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so a few months later. Following the accession of George I and the appointment of the Townshend Ministry, Aylmer was reappointed Commander-in-Chief on 5 November 1714. He was also appointed Governor of Greenwich Hospital: in this post he founded the Royal Hospital School for the sons of seamen.\n\nEarly career\n\nAylmer was the second son of Sir Christopher Aylmer of Balrath, county Meath, and Margaret Aylmer (née Plunkett), daughter of Matthew Plunkett, 5th Baron Louth. He served briefly in the Army as Ensign of foot in the Duke of Buckingham’s regiment from 1672 and then joined the Royal Navy as a midshipman in the galley HMS Charles in October 1677 before being promoted to lieutenant in April 1678. Promoted to commander on 19 January 1679, he became commanding officer of the sloop HMS Chatham and then transferred to the command of the prize ship HMS Date Tree in Summer 1679. He transferred again to the command of the fire ship HMS Castle in the Mediterranean Fleet later in the year, to the command of the fifth-rate HMS Swann on the Coast of Ireland in July 1680 and to the command of the fourth-rate HMS Tiger in the Mediterranean Fleet in January 1682, before becoming commanding officer of the galley HMS Charles in September 1685. Aylmer was a young officer of the “courtier type” who benefited from the patronage of the Duke of Buckingham.\n\nPromoted to captain on 1 October 1688, Aylmer was given command of the fourth-rate HMS Swallow in the Thames; he was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support. Indeed, he was perhaps the chief of the cabal. Aylmer followed up the letter with a visit to the Prince's headquarters and arranged that Lieutenant George Byng and Captain Anthony Hastings should accompany him during the visit. The Prince's warm response to the captains ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688.\n\nAylmer transferred to the command of the third-rate HMS Mary in December 1688 and was present at the French victory at the Battle of Bantry Bay in May 1689 at an early stage of the Nine Years' War. His brother George Aylmer was killed during the battle.\n\nAylmer transferred again, this time to the command of the second-rate HMS Royal Katherine in Spring 1690 and was present at the French victory at Battle of Beachy Head in July 1690. He transferred to the command of the third-rate HMS Monck in the North Sea in Summer 1691 and then took command of the first-rate HMS London in Spring 1692. As Second Captain to Admiral Edward Russell, he saw action again at the tactically indecisive Battle of Barfleur in May 1692. As a captain, Aylmer was quite deferential to his Spanish partners during the War. Samuel Pepys believed that Aylmer should have been hanged for his habit of dipping his colours to Spanish Admirals.\n\nSenior command\n\nPromoted to rear admiral on 8 February 1693 and to vice admiral in June 1693, Aylmer hoisted his flag in the first-rate HMS Royal Sovereign and served under Admiral Edward Russell as second-in-command of the Mediterranean Fleet. He also became Whig Member of Parliament for Portsmouth at a by-election in 1695 but had to stand down when the House of Commons declared the by-election void in January 1696. Nevertheless, he was elected Whig Member of Parliament for Dover in December 1697. The Treaty of Ryswick was signed in September 1697, bringing the Nine Years' War to an end and, after a delay in fitting out his squadron, Aylmer went out into the Mediterranean, with his flag in the second-rate HMS Boyne, to ensure the treaty was being observed in September 1698; he then retired from active service in October 1699. In around 1700 he acquired Wallett's Court Manor at Westcliffe in Kent as a property in which he would live in retirement. He also had a property at No. 12 Great Piazza in Covent Garden.\n\nFollowing the death of Prince George (Queen Anne's consort), which brought Russell back to the Admiralty, Aylmer was promoted to Admiral of the Fleet and Commander-in-Chief of the Navy on 12 November 1709. He lost his Dover seat at the 1710 British general election which produced a landslide victory for the Tory party in the wake of the prosecution of Henry Sacheverell which Aylmer had supported. In July 1710, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun Superbe: the new Harley Ministry used this failure as an excuse to remove him as Commander-in-Chief and did so in January 1711.\n\nFollowing the accession of George I in August 1714, which led to the appointment of the Townshend Ministry in September 1714, Russell was back at the Admiralty again and Aylmer was reappointed Commander-in-Chief on 5 November 1714. Alymer was also appointed Governor of Greenwich Hospital on the same date: in this post he started to fund education for the sons of seamen from entry charges to the Painted Hall, pensioners' fines and proceeds from the sale of stores. The same day he was also appointed Ranger of Greenwich Park.\n\nAlymer recovered his seat in Parliament at Dover at the 1715 British general election which saw the Whigs win an overwhelming majority in the House of Commons. He went on to join the Board of Admiralty led by the Earl of Berkeley, as Senior Naval Lord, in April 1717. He resigned his appointments as a member of the Admiralty Board and as Commander-in-Chief in March 1718 and was rewarded by being appointed Rear-Admiral of Great Britain and also being created Lord Aylmer of Balrath in the Peerage of Ireland on 1 May 1718.\n\nAylmer died at Queen's House in Greenwich on 18 August 1720 and was buried at St Alfege's Church in Greenwich.\n\nFamily\n\nIn circa 1680 Aylmer married Sarah Ellis; they had a son and two daughters.\n\nhttps://en.wikipedia.org/wiki/Matthew_Aylmer,_1st_Baron_Aylmer"}, {"url": "https://metro.co.uk/2022/09/18/who-is-buried-at-westminster-abbey-and-can-you-visit-the-historic-building-17400027/", "page_content": "Westminster Abbey has quite the history. Find out more... (Picture: Getty)\n\nWestminster Abbey is one of the most iconic landmarks in London, and its capital in the capital is only going to go up after playing host to the funeral of Queen Elizabeth II on Monday, September 19.\n\nSince the coronation of William the Conqueror in 1066, all coronations of English and British monarchs have occurred in Westminster Abbey - meaning Charles III's coronation is no doubt going to take place there too, whenever the time comes.\n\nIt’s also been host to sixteen royal weddings since 1100 – the last being that of Prince William and Kate Middleton, which saw the Abbey hit capacity with over 2000 attendees.\n\nBut if you’ve ever wanted to know more about the Abbey, from its slightly doomed history to the notable celebrities, academics and figures buried there, read on…\n\nWhere is Westminster Abbey?\n\nWestminster Abbey, the mainly Gothic abbey church, is located in the City of Westminster, Central London.\n\nThe full address is 20 Deans Yd, London SW1P 3PA.\n\nWestminster Abbey got its name from being, quite literally, the west minster. St Paul's was a minster to the right (Picture: Getty)\n\nFormally known as the Collegiate Church of Saint Peter at Westminster, the church was originally part of a Catholic Benedictine abbey, which was dissolved in 1539.\n\nIt then acted as the cathedral of the Diocese of Westminster until 1550, then as a second cathedral of the Diocese of London until 1556. The abbey was restored to the Benedictines by Mary I in 1556, then in 1559 made a royal peculiar - a church associated directly with the sovereign - by Queen Elizabeth I.\n\nWhen was Westminster Abbey built?\n\nThe origins of Westminster Abbey can be traced back to the 1040s, when King Edward (later St. Edward the Confessor) established his royal palace by the banks of the river Thames on land known as Thorney Island.\n\nNearby a small Benedictine monastery founded under the patronage of King Edgar and St Dunstan around 960A.D.\n\nThis monastery Edward chose to re-endow and improve upon, building a large stone church in honour of St Peter the Apostle. This church became known as the ‘west minster’ to distinguish it from St Paul's Cathedral – a minster to the east in the City of London.\n\nBuilding the Abbey as we know it today saw two kings die before they could complete it (Picture: Getty)\n\nDespite being pivotal in the origins of it, Edward actually died just a few days after it was consecrated on December 28, 1065.\n\nHis remains were entombed in front of the High Altar – and can be visited there to this day.\n\nThe abbey of Edward’s vision survived for two centuries until the middle of the 13th century when King Henry III decided to rebuild it in the new Gothic style of architecture.\n\nUnder the decree of the King Henry III, Westminster Abbey was redesigned to be more than a monastery and place of worship, but also a place for the coronation and burial of monarchs.\n\nThis church was consecrated on October 13, 1269,, and once again, another king died before the nave could be completed.\n\nThe older structure of Edward the Confessor stood attached to the Gothic building of Henry III for many years.\n\nTwo centuries later the western towers were finally completed in 1745, to a design by Nicholas Hawksmoor.\n\nThe Henry VII chapel at Westminster Abbey (Picture: Getty)\n\nBefore that, however, a new addition to the Abbey was built – the Lady chapel.\n\nOrdered by King Henry VII, first of the Tudor monarchs, this part of the Abbey now bears his name.\n\nWho is buried at Westminster Abbey?\n\nThere are 3,300 buried at Westminster Abbey, including 30 kings and queens. Her Majesty won’t be joining them, the Queen will be buried at King George VI’s Memorial Chapel at Windsor Castle, alongside Prince Philip.\n\nProtestant Queen Elizabeth I is buried there, along with her half-sister, the Catholic Queen Mary I.\n\nThe tomb of Elizabeth I can be viewed at Westminster Abbey(Picture:Peter Macdiarmid/Getty Images)\n\nOn the floor beside their tomb is the inscription: ‘Remember before God all those who divided at the Reformation by different convictions laid down their lives for Christ and conscience sake.’\n\nOther notable figures who are either buried at Westminster Abbey or have commemorative tombs there include:\n\nJane Austen (author of Pride and Prejudice and more, not buried here but has a memorial tablet)\n\nSir Isaac Newton (scientist who discovered gravity)\n\nNoel Coward (famous playwright)\n\nCharles Darwin (scientist known for the theory of evolution)\n\nWilliam Blake (poet)\n\nJenny Lind (musician)\n\nThe memorial tomb of William Wilberforce at Westminster Abbey(Picture: Jim Dyson/Getty Images)\n\nRobert Burns (Scottish poet)\n\nWilliam Wilberforce (politician and abolitionist)\n\nCharles Dickens (author)\n\nOlaudah Equiano (Gustavus Vassa) (writer and slave abolitionist)\n\nMartin Luther King Jr (civil rights leader)\n\nThe Bronte sisters, Charlotte, Emily and Anne (poets and novelists)\n\nBenjamin Britten (composer and musician)\n\nSir John Gielgud (actor)\n\nLaurence Olivier (actor)\n\nSir Winston Churchill (politician)\n\nSir Winston Churchill is another prominent figure who has a memorial stone at the Abbey(Picture: Peter Macdiarmid/Getty Images)\n\nHow to visit Westminster Abbey\n\nWhen not hosting something like the wedding of a future King or the funeral of the longest-reigning monarch in British history, Westminster Abbey is open to visitors.\n\nTo visit the Abbey for a tour, with a multimedia guide included, guests can pay and book a timed slot online.\n\nPrices for adults range from £22 to £25, with children under the age of five going free.\n\nPeople are also welcome to visit for free for individual prayer, when available. entry is via the Great West Door.\n\nCheck online or their social media channels before setting off for prayer, in case the Abbey is closed for an event.\n\nMORE : Queen death: Where are late members of the Royal Family buried?\n\nMORE : Why the Royal Family wear pearls in times of mourning\n\nFollow Metro across our social channels, on Facebook, Twitter and Instagram.\n\nShare your views in the comments below."}, {"url": "https://www.guidelondon.org.uk/blog/around-london/westminster-abbey-burials/", "page_content": "As well as being the major royal church of the United Kingdom, Westminster Abbey contains the tombs of many famous people who were not born into royalty. Over 3,000 people are buried at Westminster Abbey – many forgotten by history – but it remains the final resting place for celebrated Britons. Others who are not buried there are honoured with commemorative plaques. Below are some of the famous Westminster Abbey burials including well-known explorers, scientists, poets, politicians, and writers.\n\nNorth facade of Westminster Abbey in London. Photo Credit: © David Streets.\n\nThe Unknown Warrior\n\nEntering Westminster Abbey by the west door, you pass what many consider the most important grave in the church. However, no one knows the identity of the man or woman buried within the tomb of the world’s first Unknown Warrior. The idea for the grave of an unknown warrior representing all those who had sacrificed their lives for their country came to an army chaplain called David Railton, who had noticed a grave marked simply ‘an unknown British soldier’ in France during the First World War.\n\nIn November 1920, the coffin of an unknown warrior – often wrongly referred to as the Unknown Solider – was selected and reburied at the entrance to the Abbey. King George the Fifth was present and placed some French soil on the grave. The inscription on the tomb reads: ‘They buried him among the kings because he had done good towards God and towards his house.’ Every year the monarch attends a memorial service for the war dead at Westminster Abbey on the second Sunday in November.\n\nWestminster Abbey Burials: The Unknown Warrior. Photo Credit: © David Streets.\n\nDavid Livingstone\n\nThe famous Scottish explorer and missionary David Livingstone was buried in the nave of Westminster Abbey after his death in Africa in 1873. Livingstone, a devout Scottish Presbyterian, was famous for his exploration of the continent of Africa where his heart was buried. An adventurer called Henry Morton Stanley found Livingstone in Africa and introduced himself with the famous words ‘Dr. Livingstone, I presume?’\n\nBen Jonson\n\nOne of the most unusual graves in Westminster Abbey is that of Ben Jonson, a poet, playwright, and contemporary of William Shakespeare, who was buried there at his request in 1572. Perpetually short of money, Jonson was buried standing up because he could not afford more than an eighteen-inch plot or a memorial stone. One was cut for him after a passer-by paid a stonemason eighteen pence. However, the mason misspelled Jonson’s name inserting an unnecessary ‘h’ in it.\n\nScientist’s Corner at Westminster Abbey\n\nIsaac Newton, the famous scientist, mathematician, and astronomer, is buried in the nave of Westminster Abbey in 1727. A monument by Michael Rysbrack contains a representation of this great genius and reflects some of his many accomplishments. Newton was Master of the Mint, and his memorial shows coins tumbling downwards attracted by a force he was first to identify – gravity.\n\nCharles Darwin was buried near Isaac Newton in 1882, continuing Westminster Abbey’s tradition of burying and commemorating people of the same profession in the same part of the church. The grandson of the famous potter Josiah Wedgwood and the son of the eminent doctor Erasmus Darwin, Charles Darwin was originally an unpromising young man until his interest in, and knowledge of natural history provided him with a rewarding profession and the publication of his book On the Origin of the Species.\n\nStephen Hawking is another British scientist who became famous after publishing his book A Brief History of Time. At the age of twenty-one, Stephen Hawking was diagnosed with motor neurone disease and given two years to live. Instead, he survived for fifty years and became one of the world’s leading authorities on black holes. Stephen Hawking’s ashes were buried near Isaac Newton in 2018, and his gravestone has the same inscription: ‘Here lies what was mortal of Stephen Hawking.’\n\nOther prominent scientists are commemorated with memorial plaques near these graves in Scientist’s Corner, sometimes with the inscription ‘alibi sepulti’ (buried elsewhere).\n\nWestminster Abbey Burials: Scientists’ Corner. Photo Credit: © David Streets.\n\nWilliam Wilberforce\n\nMore than anyone else, William Wilberforce was responsible for the abolition of the slave trade in Britain. His tireless campaigning on behalf of abolition led to the passage of an act ending the slave trade throughout the British empire in 1807. One of those involved in the campaign was a former slave-trading sea captain John Newton, who became a priest and composed the words of the famous hymn Amazing Grace.\n\nA fine statue by Samuel Joseph stands in the north choir aisle above the grave of Wilberforce and his devoted wife, Barbara. They lie near to the grave of his friend.\n\nWilliam Pitt the Younger\n\nWilliam Pitt was the youngest Prime Minister of Great Britain, appointed to the role in 1783 at the age of only twenty-four. He took charge of the country as it was heading for war with Napoleon’s France and introduced income tax as a ‘temporary’ measure to help fund the wars. Pitt was a brilliant administrator and successful Prime Minister but remained unmarried and died in office from overwork and exhaustion in 1806.\n\nWilliam Pitt the Elder\n\nWilliam Pitt the Younger had followed his father Pitt the Elder into office as Prime Minister. The elder was a brilliant orator who had assumed a seat in the House of Lords with the title of Earl of Chatham. A statue by John Bacon on Pitt’s monument in the north aisle shows him making one of his final speeches in the Lords pleading for understanding of the wishes of the young American nation for independence.\n\nWilliam Gladstone\n\nGladstone was a titan of nineteenth-century politics holding the office of Prime Minister a record four times before his burial in the Abbey in 1898. Five years later, a statue of him was erected opposite that of Pitt in the north transept. This was the last time a statue was erected in the church, which showed its subject standing upright, later memorials normally consisting of simple plaques. Gladstone’s great rival Benjamin Disraeli, who died in 1881, and his mentor Robert Peel were also commemorated with upright statues but were not buried in Westminster Abbey.\n\nHenry Carey, Lord Hundson\n\nAs you turn away from the politicians and walk towards the royal graves of Westminster Abbey, you pass the largest monument in the church, that of Henry Carey, Lord Hundson, who died in 1596. He was the grandson of Mary Boleyn, a mistress of King Henry VIII, and sister of Henry’s second wife, Anne Boleyn. Many members of the Carey family are buried around this grave, but they are mostly forgotten by history despite the splendour of this thirty-three-foot high monument.\n\nOliver Cromwell\n\nIn contrast to Hundson’s huge grave, a small plaque in the RAF Chapel marks the site of where Oliver Cromwell was buried. This is at the back of the Henry the Seventh Chapel where the Knights of the Bath have an annual service and where the standards of senior members of the order fly above the stalls in which they sit.\n\nCromwell was the only man to rule England without a king above him after the execution of Charles the First in 1649 and the establishment of an English republic, which he referred to as the ‘commonwealth,’ reflecting an aspiration towards a form of equality in the country he ruled. Cromwell was a brilliant soldier and a strong leader, but his vision did not long survive his death in 1658. The monarchy was soon restored, and his body was ritually hung from the gallows. All that remains of Cromwell is his skull, held by Sidney Sussex College, Cambridge, where he studied.\n\nPoets’ Corner at Westminster Abbey\n\nThe last place you visit inside Westminster Abbey is usually Poet’s Corner, where great writers are commemorated or buried near the grave of the early English poet.\n\nWestminster Abbey Burials: Poets Corner. Photo Credit: © David Streets.\n\nGeoffrey Chaucer\n\nChaucer, who died in 1400, was buried in Westminster Abbey near where he lived at the end of his life. He had been a loyal servant to the crown and was the brother-in-law of the influential John of Gaunt. Although he worked as an ambassador and scientist, Chaucer is remembered today as the father of English poetry and as the author of the Canterbury Tales, in which a group of pilgrims entertain each other with stories on the way to visit the grave of the English martyr Thomas Becket in Kent.\n\nEdmund Spenser\n\nAlthough little read today except by scholars, Edmund Spenser was an influential poet during the late 1500s and the author of The Faerie Queen, which he dedicated to Queen Elizabeth I. He died in 1599, and contemporary writers such as Ben Jonson – and possibly William Shakespeare – attended his funeral and threw verses into his grave, which have never been recovered. Edmund Spenser asked to be buried near Geoffrey Chaucer and thus was born one of the famous parts of Westminster Abbey – Poets’ Corner.\n\nPoets, novelists, a composer, and an actor\n\nCharles Dickens was buried in Poets’ Corner even though he had intended his grave to be in Kent, where he had made his home and where many of his novels such as David Copperfield and Great Expectations take place. However, to comply with his wishes, only a few members of his family and close friends were present at his funeral, and his grave is marked simply with his name and dates – 1812 to 1870.\n\nCharles Dickens at Westminster Abbey. Photo Credit: © David Streets.\n\nRudyard Kipling was another famous writer buried in Westminster Abbey following public demand. He became famous through his championship of and support for the now unfashionable British Empire. A fine poet and a storyteller, Kipling’s life was blighted by the early death of two of his three children, his son Jack in the First World War and his daughter Josephine from influenza while in the USA.\n\nAlfred Lord Tennyson is buried next to Chaucer. A popular poet in the Victorian era, Tennyson is best remembered today for The Charge of the Light Brigade, Maud, and his Arthurian poetry but was probably at his finest when he expressed his grief at the early death of his Cambridge contemporary Arthur Hallam with In Memoriam.\n\nRobert Browning is buried next to his friend and fellow poet Tennyson. He will always be remembered for his love affair with another fellow poet Elizabeth Barrett. Although devoted to each other in life, they lie thousands of miles apart as Elizabeth was buried in Florence in Italy, where she died, leaving Browning a widower for many years. He brought the Italian renaissance to life with his dramatic monologues but is today probably most remembered for his story poem The Pied Piper of Hamelin.\n\nThomas Hardy is also buried next to Charles Dickens. Like Kipling, he was both a poet and a novelist, turning to poetry as his later novels Tess of the d’Urbevilles and Jude the Obscure were criticised for their pessimism. Hardy is associated with the county of Dorset, where his heart was buried and where many of his stories are set.\n\nThomas Hardy at Westminster Abbey. Photo Credit: © David Streets.\n\nMany other writers and poets are commemorated in Poets’ Corner, including William Shakespeare, the Scottish poet Robert Burns, and his contemporaries, the romantic poets William Wordsworth and Samuel Taylor Coleridge. Women writers are honoured with memorial plaques to the Bronte sisters (who are buried in Yorkshire) and George Eliot, author of Middlemarch, who was born Mary Ann Evans but felt it necessary to adopt a man’s name to be taken seriously as a writer.\n\nWilliam Blake, who drew many of the monuments in Westminster Abbey in his youth, was not buried there, but a fine bust of him by the sculptor Jacob Epstein stands on a pillar in Poets’ Corner, as does one of the American poet Henry Wadsworth Longfellow.\n\nGeorge Frederick Handel was neither a writer nor British, but he came to London from Germany and wrote many of his works here, including his Messiah, with its famous Hallelujah Chorus. Handel became an honorary Briton, and he too was buried in Poets’ Corner.\n\nLaurence Olivier, Britain’s most famous actor, has one of the most recent graves in Westminster Abbey, his ashes interred in the south aisle following his death in 1989.\n\nLondon Blue Badge Tourist Guides are all qualified to conduct tours of Westminster Abbey."}, {"url": "https://www.londonxlondon.com/westminster-abbey-burials/", "page_content": "Love This? Save and Share!\n\nGet ready to discover Westminster Abbey’s famous burials with this in-depth guide to the Abbey’s famous residents.\n\nWords by John Rogers\n\nIt’s one of London’s most famous religious landmarks – home to royal weddings and coronations, and more solemnly it has played host to funerals of the greats of British history. For many, Westminster Abbey remains their final resting place.\n\nFrom the time of Edward the Confessor, who died in 1066, to George II’s death in 1760, the vast majority of monarchs were laid to rest within the confines of the Abbey. Meanwhile, the famed Poets’ Corner in the Abbey’s South Transept grew around Geoffrey Chaucer’s grave, which was interred in 1400.\n\nWith such great names buried in appropriately magnificent and regal surroundings, here’s our guide to some of the most famous burials in Westminster Abbey.\n\nWestminster Abbey Burials: A Who’s Who of Westminster Abbey’s Most Famous Inhabitants\n\nEdward The Confessor\n\nLet’s begin with the man that kicked off the trend of being interred in Westminster Abbey. Edward the Confessor was one of Anglo-Saxon England’s last kings and started the building of Westminster Abbey during his reign between 1042 and 1066.\n\nHis death shortly before the Norman invasion came after a 24-year reign that almost matched the period he spent exiled before his coronation. Edward became the first Anglo-Saxon and only English monarch to be canonised 95 years after his death.\n\nAnne of Cleves\n\nThe fourth wife of Henry VIII, and one of the lucky few to survive her husband, to whom she was married for only six months before the annulment of the marriage. Born in Dusseldorf, Anne married Henry in 1540, passing away after outliving his other wives.\n\nAnne became known as “the King’s Beloved Sister” following the end of her marriage and, after she died in 1557, became the only of Henry’s wives to be honoured with a burial in the Abbey.\n\nMary Queen of Scots\n\nMary Queen of Scots ascended to the Scottish throne following the death of James V of Scotland in 1542 when she was only six days of age. She reigned for 25 years until she forcibly abdicated and fled to England, seeking the protection of her cousin, Elizabeth I of England.\n\nInitially imprisoned at several English castles and prisons before being convicted in 1587 of a plot to assassinate Elizabeth, she was beheaded and originally buried at Fotheringhay Castle.\n\nHer body was exhumed under the orders of King James I (James VI of Scotland) and reinterred opposite the tomb of Elizabeth in 1612.\n\nElizabeth I\n\nOn which note, Elizabeth continued the Tudor dynasty following the reign of Mary I, her half-sister, in 1558 and went on to rule until she died in 1603.\n\nThe Elizabethan age was one of culture, with the likes of Shakespeare proliferating play after play, exploration under Sir Walter Raleigh, and war with Spain led by Sir Francis Drake.\n\nAlthough she was rumoured to have had plenty of romantic dalliances, Elizabeth never married and had no children before she passed away as a self-styled ‘Virgin Queen’. She rests alongside her predecessor Mary I.\n\nSir Isaac Newton\n\nWhen it comes to people buried in Westminster Abbey, Sir Isaac Newton might just be the most famous – he was one of the most influential mathematicians and scientists of all time.\n\nHe’s most well-known for his part in developing the laws of motion, gravitational pull, planetary motion, optics, and calculus. Among his many accolades is the naming after him of the unit of force in the International System of Units.\n\nNewton became President of the Royal Society and was knighted by Queen Anne (also interred in the Abbey) in 1705 before passing away peacefully in 1727.\n\nCharles Darwin\n\nDarwin was a scientist of equal influence to Newton some 150 years later with his ground-breaking On the Origin of Species. His work contributed to the theory of scientific evolution with his idea of natural selection.\n\nHe died from heart disease in 1882 at Down House at 73. After a petition from the public and Royal Society colleagues, he was honoured with burial in Westminster Abbey.\n\nStephen Hawking\n\nContinuing on with the scientist theme, Stephen Hawking established himself as one of the 20th Century’s leading scientists, with theorems around relativity and cosmology. His book A Brief History of Time broke records, appearing on the Sunday Times bestseller list for 237 weeks.\n\nAfter being diagnosed with Motor Neurone disease in his mid-20s, Hawking passed away in 2018 with his ashes interred in the Abbey’s nave between the graves of Newton and Darwin following a service of thanksgiving. Quite fitting, we think.\n\nClement Atlee M.P.\n\nClement Atlee became Britain’s first post-World War II Prime Minister after winning the 1945 general election, shortly before the defeat of Japan in the Pacific. In fact, he was responsible for leading the first Labour majority government in British history.\n\nHis achievements include establishing the welfare state with the National Insurance Act of 1946 and the establishment of the NHS in 1948. Other accomplishments include the introduction of National Parks and the New Towns Act in 1946.\n\nHis death in 1964 led to his ashes resting in the confines of the Abbey.\n\nGeoffrey Chaucer\n\nThought of by many as the father of English literature, Geoffrey Chaucer became the first poet to be buried in Westminster Abbey.\n\nInterred in what is now “Poet’s Corner”, the final resting place for many of his successors, Chaucer’s influence remains strong in English literary circles, with The Canterbury Tales still studied in schools more than 600 years after his death.\n\nThe cause of Chaucer’s death in 1400 is unknown. Though speculation remains that he was murdered by enemies of King Richard II, for whom Chaucer worked, before being interred in the Abbey.\n\nAphra Behn\n\nConsidering the hyper-patriarchal nature of English society in the present day, never mind the 17th Century, Aphra Behn’s internment in Westminster Abbey is surprising. She was a playwright, poet, and translator during the 1600s, becoming one of the first English women to make a breakthrough into the literary world.\n\nTo add to her kick-ass personality that broke down barriers and led the way for women to come, Charles II even employed Behn as a spy.\n\nFollowing her death in 1689, her remains rest in the Abbey’s East Cloister.\n\nDr. Samuel Johnson\n\nBest known for his work in compiling The Dictionary of the English Language, first published in 1755 after nine years of painstaking research and work, Dr. Johnson was one of the most influential writers in the history of the English language.\n\nIt wasn’t until the release of the Oxford English Dictionary at the turn of the 20th Century that Johnson’s work was usurped as the primary resource for studying the English language.\n\nJohnson died in 1784 at 75 following a period of illness and has laid in rest at Westminster Abbey ever since.\n\nNeville Chamberlain M.P.\n\nHistory hasn’t been especially kind to Neville Chamberlain, who was Prime Minister of the UK for three of the most turbulent years in European history between 1937 and 1940.\n\nJudged harshly for his pursuit of the policy of appeasement of Hitler and Mussolini in the late 1930s, his attempts to avoid war were unsuccessful. Chamberlain left office on the day of the Nazi invasion of France in May 1940 to be succeeded by Winston Churchill.\n\nChamberlain died six months later from cancer before being buried in the Abbey.\n\nThe Unknown Soldier\n\nAlthough several bodies are lying under the floor way of Westminster Abbey, only one grave is off-limits to visitors’ footsteps, and that is the resting place of the Unknown Soldier.\n\nPerhaps one of the most baffling burials of all time, the identification of the remains that were gathered from the battlefields of the Western Front are unknown. They were interred on the second anniversary of the armistice in World War I on 11th November 1920.\n\nA Brief History of Westminster Abbey\n\nThe roll call of those buried at the Abbey has been a magnet for visitors for centuries – something that continues to this day, with poets, actors, politicians, scientists, and musicians joining seven centuries worth of regal inhabitants beneath the Abbey’s famous floors.\n\nAs we’ve already touched upon, Westminster Abbey was initially established during the reign of Edward the Confessor and consecrated in December 1065. Unfortunately, Edward was too ill to attend and died shortly afterward.\n\nToday’s imposing building dates primarily from between the 13th and 16th centuries as it underwent several developments and rebuilds. It has been the setting for every English Coronation since 1066 and no fewer than 16 royal weddings, most recently that of Prince William and Princess Catherine.\n\nThe Abbey’s primary function as a church remains today. A daily pattern of worship occurs in the Abbey’s exquisite surroundings, with the Very Reverend Dr. David Hoyle, Dean of Westminster, often presiding.\n\nAs well as hosting royal events, regular special services of thanksgiving and remembrance take place at the Abbey, including annual services of thanksgiving to mark victory in the Battle of Britain for members of the judiciary before the start of each legal year, and to mark Commonwealth Day.\n\nIn 2010, the recently passed Pope Benedict XVI became the first Pope to visit the Abbey.\n\nWestminster Abbey Burials: Practical Information and Map\n\nWestminster Abbey stands majestically opposite the Palace of Westminster, a short walk from St James’ Park and Westminster Underground stations.\n\nThe Abbey is open at the following times for general admission:\n\nMon: 9:30 am to 3:30 pm\n\nTue to Fri: 10 am to 3:30 pm\n\nSat: 9 am to 3 pm\n\nSun: Closed\n\nTickets prices for general admission are:\n\nAdults: £27\n\nConcessions: £24 (Adults 65+ and Students)\n\nChildren: £12 (6-17 years)\n\nChild: Free (0-5 years)\n\nWebsite\n\nWestminster Abbey Burials: Map"}, {"url": "https://londonpass.com/en-us/blog/whos-buried-in-westminster-abbey", "page_content": "Delve into some of the amazing facts about who is buried in Westminster Abbey.\n\nAlthough Westminster Abbey may be better associated with royal weddings and coronations, the country's most iconic cathedral is also the final resting place of thousands of influential people, from monarchs and consorts to poets, scientists and politicians.\n\nGet a true sense of history when you visit some of the most famous Westminster Abbey tombs. But before you go, find out who's buried in Westminster Abbey, right here. From kings to nameless soldiers, this list includes:\n\nEdward the Confessor\n\nAnne of Cleves\n\nSir Isaac Newton\n\nAnd more...\n\nEdward the Confessor\n\nEdward the Confessor was one of the last Anglo-Saxon kings of England who was responsible for the building of Westminster Abbey, during his reign from 1042 - 1066. After a turbulent childhood when England was the target of Viking raids and invasions, Edward spent 25 years in exile, until he was received as king. He was the first Anglo-Saxon and only king of England to be canonised, in 1161. From Edward the Confessor until George II, most Kings and Queens had a Westminster Abbey burial.\n\nEdward V\n\nDespite being named King of England upon his father's death, 12-year-old Edward V wasn't crowned, and only reigned for 86 days before his uncle Richard III seized the throne and sent him and his brother to the Tower of London. They would forever be remembered as \"The Princes in the Tower\" after disappearing in 1483. Their fate remains unknown but it is widely believed that they were murdered on the orders of Richard II.\n\nIn 1674, children's bones were discovered in a stairway of the Tower and King Charles II placed them in Westminster Abbey, however, it's never been proven the bones belonged to the princes.\n\nAnne of Cleves\n\nThe unfortunate 4th wife of Henry VIII, Anne of Cleves and Henry were only married for 6 months before the marriage was annulled. Originally from Dusseldorf, she was brought over for the wedding in 1540 but Henry wasn't taken with her. After the marriage was annulled, she was referred to as \"the King's Beloved Sister\" and ended up outliving all of Henry VIII's other wives, dying in 1557. She is the only wife of Henry VIII to be buried in the Abbey.\n\nElizabeth I One of the most famous people buried in Westminster Abbey, Elizabeth I was the daughter of Henry VIII and Anne Boleyn. Her reign, known as the Elizabethan era is famous for a golden age of poetry, drama and music as well as exploration and colonising the new world, with playwrights such as Shakespeare and Christopher Marlowe leading the creative charge and explorers such as Francis Drake and Walter Raleigh navigating the seas. She never married nor had children and died after 44 years on the throne in 1603. She shares her grave with half-sister Mary I.\n\nSir Isaac Newton\n\nConsidered one of the most influential scientists of all time, Sir Isaac Newton was a physicist and mathematician known for his work on the laws of motion, gravitation, classical mechanics, calculus, planetary motion, optics and more. Among other accolades, he was made President of the Royal Society and was knighted by Queen Anne in 1705 and died in his sleep in 1727.\n\nSir Charles Barry\n\nYou'd be excused for not knowing this guy - an English architect in the 19th century, Sir Charles Barry is most well known for the rebuilding of the Palace of Westminster (Houses of Parliament). You'll also see his work in Trafalgar Square and Highclere Castle, which served as the location of TV show, Downton Abbey.\n\nCharles Darwin\n\nA naturalist and geologist, Darwin is probably best known for his contribution to the science of evolution and publication of \"On the Origin of Species\" where he introduced the process of natural selection.\n\nDavid Livingstone\n\nBest known for his exploration of Africa and infamous meeting with Henry Morton Stanley that introduced the quote \"Dr. Livingstone, I presume?\", David Livingstone was an explorer, missionary and one of Victorian Britain's most prolific individuals. Coming from a working-class background, he not only discovered the sources of the River Nile but also crusaded for the abolition of slavery. He died in 1873 in Zambia, which is where his heart is buried.\n\nCharles Dickens\n\nOne of the most famous English writers with books such as \"A Christmas Carol\" ,\"David Copperfield\", \"Great Expectations\", \"Oliver Twist\" and \"A Tale of Two Cities\", Charles Dickens synonymous with the Victorian era. During his lifetime, he wrote novels, novellas, short stories, articles, lectured and campaigned for education and children's rights.\n\nDr. Samuel Johnson\n\nBest known for his \"A Dictionary of the English Language\" published in 1755 after 9 years of work, Dr. Samuel Johnson was one of the most influential writers of the 18th century. His book was viewed as the predominant British dictionary until the introduction of the \"Oxford English Dictionary\" 150 years later.\n\nGeoffrey Chaucer\n\nThat's right, the father of English literature was the first poet to be buried in Westminster Abbey, in what is now referred to as \"Poet's Corner\". Anyone who studied English literature in secondary school and beyond will be familiar with his use of Middle English in works such as \"The Book of The Duchess\", \"The Legend of Good Women\" and most famously \"The Canterbury Tales\".\n\nRudyard Kipling\n\nAnother literary icon buried in Poet's Corner is \"Jungle Books\" author Rudyard Kipling. Born in British India, Rudyard is one of the main innovators of short stories and his children's books are classics to this day with well-known titles such as \"Just So Stories for Little Children\" and \"Kim\".\n\nLaurence Olivier\n\nPerhaps one of the world's most famous actors, Laurence Olivier dominated the British stage of the mid-20th century and played over 50 cinema roles. He worked closely with Noel Coward and Ralph Richardson. He was co-director of the Old Vic theatre. He directed and starred opposite Marilyn Monroe in \" The Prince and the Showgirl\" and was married to actress Vivien Leigh for 20 years.\n\nDuring his lifetime, he received a knighthood, a life peerage and the Order of Merit as well as copious acting awards including four Academy Awards. The National Theatre's largest auditorium was named in his honour and he is commemorated every year in the Laurence Olivier Awards. A true acting legend.\n\nAphra Behn\n\nVirginia Woolf once wrote \"All women together ought to let flowers fall upon the tomb of Aphra Behn... in Westminster Abbey... it was she who earned them the right to speak their minds\". You may not have ever heard of her, but Aphra was a British playwright, poet and translator during the 17th century. She was one of the first English women to earn a living from writing and became a female role model by breaking these cultural barriers. And not only that, she was also employed by Charles II as a spy!\n\nThe Unknown Warrior\n\nThe burial of an unidentified British soldier killed during WWI is the first example of a Tomb of the Unknown Soldier. He represents the thousands of individuals who died during the war. Six bodies were exhumed from various battlefields. They were placed in unmarked coffins before one was selected for burial in Westminster Abbey. Although there are many graves on the floors of the church, this is the only one you're not allowed to walk on.\n\nThere are thousands of graves and memorials in Westminster Abbey. You could easily spend an hour or two discovering the famous names and learning their incredible stories. So, what are you waiting for?"}, {"url": "https://www.britannica.com/topic/Westminster-Abbey", "page_content": "Architectural history\n\nLegend relates that Saberht, the first Christian king of the East Saxons, founded a church on a small island in the River Thames, then known as Thorney but later called the west minster (or monastery), and that this church was miraculously consecrated by St. Peter. It is certain that about 785 ce there was a small community of monks on the island and that the monastery was enlarged and remodeled by St. Dunstan of Canterbury about 960. St. Edward the Confessor built a new church on the site, which was consecrated on December 28, 1065. It was of considerable size and cruciform in plan. In 1245 Henry III pulled down the whole of Edward’s church (except the nave) and replaced it with the present abbey church in the pointed Gothic style of the period. The design and plan were strongly influenced by contemporary French cathedral architecture.\n\nBritannica Quiz A Royal Vocabulary Quiz\n\nThe rebuilding of the Norman-style nave was begun by the late 1300s under the architect Henry Yevele and continued intermittently until Tudor times. The Early English Gothic design of Henry III’s time predominates, however, giving the whole church the appearance of having been built at one time. The chapel of Henry VII (begun c. 1503), in Perpendicular Gothic style, replaced an earlier chapel and is famed for its exquisite fan vaulting. Above the original carved stalls hang the banners of the medieval Order of the Bath.\n\nThe western towers were the last addition to the building. They are sometimes said to have been designed by Sir Christopher Wren, but they were actually built by Nicholas Hawksmoor and John James and completed about 1745. The choir stalls in the body of the church date from 1847, and the high altar and reredos were remodeled by Sir George Gilbert Scott in 1867. Scott and J.L. Pearson also restored the north transept facade in the 1880s. The abbey was heavily damaged in the bombings that ravaged London in World War II, but it was restored soon after the war."}, {"url": "https://www.westminster-abbey.org/about-the-abbey/history/royal-tombs", "page_content": "History\n\nRoyal tombs\n\nWestminster Abbey is the final resting place of 30 kings and queens starting with King Edward the Confessor whose magnificent shrine stands just behind the High Altar. Henry III, who built the church you see today, is buried near him.\n\nThe tombs of Edward I, Eleanor of Castile, Edward III, Philippa of Hainault, Richard II and Anne of Bohemia are all in St Edward the Confessor's chapel. When Henry V died in 1422 he was buried near to the Saint and above his tomb was built a chantry chapel in which Holy Communion is still celebrated every year on 25th October, St Crispin’s Day, the anniversary of his famous battle at Agincourt. His queen Katherine of Valois is buried in the chantry.\n\nFrom 1503 Henry VII lavished huge sums on a new Lady chapel, just east of Henry V's chantry. Dedicated to the Virgin Mary it is the last great masterpiece of English medieval architecture. Its spectacular fan vaulted ceiling and the King's imposing tomb, with gilt bronze effigies of him and his queen Elizabeth of York, continue to inspire awe and wonder 500 years on. James I is buried in Henry VII's vault (under the tomb) but has no monument and his queen Anne of Denmark lies nearby.\n\nIn this chapel’s north aisle the Protestant Queen Elizabeth I is buried with her half-sister the Catholic Queen Mary I in an imposing tomb. On the floor beside their tomb is the inscription:\n\n\"Remember before God all those who divided at the Reformation by different convictions laid down their lives for Christ and conscience sake.\"\n\nDue to lack of space no monuments could be erected for Charles II, Queen Anne, Queen Mary II or her husband King William III. They are all buried in a vault in the south aisle with just simple inscriptions on small stones. The tomb of Mary Queen of Scots is also in this aisle. Boy king Edward VI lies just in front of the altar. George II was the last monarch to be buried in the Abbey, in a vault under the central aisle of this chapel, with his queen Caroline.\n\nFurther reading\n\nVisit our Royalty page to see a full list of Royal tombs at Westminster Abbey\n\nWestminster Abbey: The Lady Chapel of Henry VII [for tombs in this chapel], edited by T. Tatton-Brown & R. Mortimer, 2003\n\nRoyal tombs of Medieval England by Mark Duffy, 2003"}, {"url": "https://www.westminster-abbey.org/abbey-commemorations/commemorations/matthew-prior", "page_content": "On the wall behind Shakespeare's memorial in Poets' Corner in Westminster Abbey is a large marble monument to poet and diplomat Matthew Prior which was in place by 1726. He was buried at the foot of the grave of Edmund Spenser but the actual grave is not marked. The memorial was designed by James Gibbs and executed by J.M. Rysbrack and incorporates a bust by Antoine Coysevox. The bust had been presented to Prior in his lifetime by the King of France. On the base at the ends of the sarcophagus are life size figures of Poetry and History. The Latin inscription was written by Robert Freind, as Prior had requested, and can be translated:\n\nMatthew Prior Esq. A fever, gradually creeping up on him, as he meditated upon the history of his times, broke together the thread of his life and of his labours on Sept.18th A.D.1721 in the 57th year of his age.\n\nHere lies buried Matthew Prior Esq. a great man, who, under our most gracious Majesties King William and Queen Mary acted as Secretary to the Embassy at The Hague in 1690, and then as Secretary to the parties who in 1697 concluded the Peace of Ryswick, then in the following years to the French Legation, and also in that same year 1697 in Ireland. He was also Commissioner at the trade congress of 1700 and the taxation congress of 1711. Lastly, he was despatched by Queen Anne of blessed memory to Louis XIV of France in 1711 as Legate and Plenipotentiary in the peace negotiations, (peace being now well established and likely to endure, according to the hopes of all good men and true).\n\nBut all these titles with which he was adorned were as nothing to the praise accorded him for his philanthropy, intellect and learning. The kindly Muses smiled on him at birth, this royal school embellished him in boyhood, in youth St John's College, Cambridge, provided the most excellent education; and finally in manhood, he was matured and perfected by the society of the leading men of his time.\n\nBy circumstance of birth and upbringing, therefore, he could never be torn away from the company of poets, but was frequently used to season the burden of civil affairs with pleasanter literary studies, and as he essayed all manner of poetic works with great felicity, so did this admirable craftsman have no peer in the art of elegant and witty belles-lettres. These amusements of a noble mind, which cost him no toil, were readily perused by his circle of friends. In their company, and full of pleasantries and humour, he would discourse in jests appropriately, diversely and eloquently, upon whatever circumstance might have arisen, but to no far-fetched or forced effect; every word seemd to flow naturally and luxuriantly as though from a perennial spring. He leaves his acquaintance, therefore, uncertain as to whether he were more elegant as a writer of poetry, or more delightful as a companion in conversation.\n\nHe was born in Westminster in July 1664, the son of George Prior and his wife Elizabeth. He had to leave Westminster School when his father died and work in his uncle's tavern. The Earl of Dorset was a regular there and was impressed by Matthew and paid to send him back to school where he became a King's Scholar. After university he was a tutor and wrote poetry while on his diplomatic postings and stayed with Louis XIV. He published Poems on Several Occasions. In 1715 he was arrested on a charge of treason relating to the treaty of Utrecht but was released the following year. He had several mistresses but never married. His coffin lay overnight in Jerusalem Chamber before his funeral.\n\nHis secretary Adrian Drift is buried near him.\n\nFurther reading\n\nOxford Dictionary of National Biography\n\nHistory of Parliament online"}, {"url": "https://www.westminster-abbey.org/abbey-commemorations/commemorations/william-and-aymer-de-valence", "page_content": "William de Valence, Lord of Pembroke and Wexford was a half brother of Henry III, being the son of Hugh de Lusignan, Comte de la Marche and Isabella of Angouleme, widow of King John. Valence near Lusignan in France was probably his birthplace. In 1247 William and two of his brothers, Guy and Aymer, and his sister Alice came to England at the invitation of Henry III. In addition to his French lands William acquired vast estates in England and Ireland by his marriage, on 13th August 1247, with Joan, daughter of Warin de Munchensy, Lord of Swanscombe. Warin’s first wife was a co-heir of the Marshals, Earls of Pembroke but William was never created Earl of Pembroke. He went on Crusade with Prince Edward and brought back a jewelled cross which his daughter in law Mary later bequeathed to Westminster Abbey (it no longer remains). He died at his manor in Kent on 16th May 1296.\n\nHis tomb\n\nIt is thought his tomb was originally in St Edward the Confessor's chapel near the grave of two of his children but was moved when Anne of Bohemia's tomb was put in (1394). His monument was moved to St Edmund's chapel nearby. His tomb has the only existing example in England of Limoges champlevé enamel-work on a monument. The effigy and the tomb chest are of oak on a stone base on which are carved the arms of England, Valence and Valence with Clermont-Néelle.\n\nThe effigy is still covered with decorated copper plates but decoration on the tomb chest has mostly disappeared except for five small shields (now grouped together and preserved under glass), and some enamelling between the legs of the effigy. His head rests on a cushion decorated in enamel with rosettes and his coat of arms. He is dressed in a coat of mail with an enamelled sword belt but only three of the small shields on his surcoat now remain. The large shield he carries is very fine (the arms are \"barry of ten, argent and azure with an orle of martlets gules\" ie. alternate silver and blue horizontal bars with red birds around the edge).\n\nThe Latin inscription no longer remains but it was recorded by William Camden in his guide to the Abbey published in 1600 and can be translated:\n\nAll England, thou weepest, for the royal progeny with which thou wert accustomed to bloom is dead. William, whom the humblest tomb contains, shows forth an illustrious name, Valence, a noble surname, such as he ought to claim for himself. Valiant, he prevailed, victorious by virtue and valour; and, peaceful, gave pleasure with his vigour of mind and of character; generous, capable, steadfast; eagerly prosecuting wars, competent and modest, faithful, striving for distinction. In 1300 less four years in the month of May death, with his own sword, struck him down. Thou who readest these words remember how full of fear is the way, and see how both thou and I shall die, all unknowing of the hour. O merciful Christ, let him, I pray, enter Heaven, and let him see nothing melancholy; for he excelled in all these ways.\n\nThe effigy is 1.82m in length.\n\nWilliam’s young child Margaret, buried on 24th March 1276, and son John, who died in January 1277 aged in his late twenties, were buried in one grave in the chapel of St Edward the Confessor in the Abbey but this stone is now partly covered by Henry V’s chantry. His other children were William (died 1282), Aymer, Isabel, who married John Hastings, Agnes who married three times, and Joan who married John Comyn.\n\nAymer de Valence\n\nWilliam's son Aymer was born about 1270 and was a cousin to Edward I. He was concerned in the wars with Scotland, where in 1306 he defeated King Robert I and captured his brother Nigel Bruce. By inheritance and marriage he was lord of many estates in France, England, Wales and Ireland. On the death of his mother (1307) he was given the title of Earl of Pembroke. His first wife was Beatrice, daughter of Raoul de Clermont, who died in 1320. He married secondly, on 5th July 1321, Mary de St Pol, daughter of Guy de Chatillon, Count of St Pol. He only had one son Henry (d.1322) who was illegitimate. Aymer died suddenly in France (possibly of a broken blood-vessel) on 23rd June 1324 while on an embassy to Charles IV.\n\nHis body was returned to the Abbey and buried on the north side of the High Altar where his widow erected a magnificent tomb for him. The sculptor was possibly Richard of Reading. Aymer's tomb effigy wears mail and his surcoat is painted with the variant of the Lusignan arms which his father assumed and his feet rest on a lion. The shield he carried has disappeared, as has the tomb tester, and there is no remaining inscription.\n\nThe sixteen small figures around the tomb base represent members of his family and the shields below identify them - on the south side Marie de Bretagne, Henry Earl of Lancaster, Isabelle de St Pol, William Sire of Coucy, Mahaut de St Pol, Charles de France, Marie de St Pol and Guy or Jean de Chatillon and on the north Atholl, John or Laurence Hastings, Blanche de Bretagne, Robert d'Artois, Beatrice de St Pol, Jean de Flandre, Marie de St Pol and Jean or Arthur, duke of Brittany.\n\nOn the richly carved tomb canopy Aymer is represented fully armed and galloping on his horse. The tomb was in danger of being removed to make way for General Wolfe’s monument in the 18th century as the Dean of Westminster mistakenly thought Aymer was one of the Knights Templars whom he considered to be \"a very wicked set of people\". When he found out that Aymer was not one of these he allowed the tomb to remain. The tomb was restored in the early 19th century.\n\nTomb dimensions: 10 feet (3.048m) wide and 17 feet (5.181m) high.\n\nMary Countess of Pembroke\n\nMary de St Pol, Aymer’s wife, survived him for over fifty years and is buried at Denny Abbey in Cambridgeshire, which she founded. In 1992 (even though the memorial gives an earlier year) a memorial was placed for her on a pillar in the north ambulatory opposite Aymer’s monument. The slate and stone memorial is partly gilded and was designed by Donald Buttress, the Abbey Surveyor. The centre inscription reads\n\nMARY DE ST POL COUNTESS OF PEMBROKE 1304 AD 1377.\n\nThe painted shield shows the Valence and Chatillon arms. Below on a small brass plate is the inscription:\n\nPlaced here in 1991 at the wish of Bryan Earle King 1906-1987 from St Kitts, Fellow of Pembroke College Cambridge to commemorate the Countess’ generosity to the Abbey and to the College that bears her name.\n\nHer benefactions to the Abbey included an alabaster statue of the Virgin Mary and several vestments (none of which now remain).\n\nCount Robert d'Artois was buried in old St Paul's cathedral.\n\nFurther Reading\n\nOxford Dictionary of National Biography 2004 for William and Aymer\n\n\"The Cosmatesque mosaics of Westminster Abbey, vol.2 The Royal Tombs...\" by W. Rodwell and D. Neal, 2019\n\n\"Aymer de Valence, Earl of Pembroke\" by J.R.S. Phillips, 1972\n\n\"Gothic tombs of kinship\" by Anne Morganstern, 2000"}]}