{"Laurent Koscielny was named in the PFA Team of the Year in 2012-13.": [{"url": "https://sportmob.com/en/article/975741-Top-Facts-About-Laurent-Koscielny-One-of-The-Best-Defenders", "page_content": "Laurent Koscielny plays as a centre back and he is product of Guingamp youth system. Then he quickly made his way through the ranks to the acme. Over the years he worked hard and managed to make a name for himself as one of the greatest footballers playing in the position of a defender. We will walk you through all the details about Laurent Koscielny transfer market stats.\n\nAside from the details of his career in football and his road to fame, we will fill you in with the details about\n\nLaurent Koscielny personal life.\n\nThe footballer is a married man. Laurent Koscielny wife supports him in every up and down. She gave birth to Laurent Koscielny children and together they have a great life."}, {"url": "https://lastwordonsports.com/football/2020/03/23/team-of-the-decade-arsenal/", "page_content": "Picking the Arsenal team of the decade is not a particularly easy task. Unlike the previous decade where the Gunners were used to winning trophies and participating regularly in the Champions League, this last decade saw them slip out of Europe’s elite club competition. Due to the mediocre nature of their performances, Arsenal were unable to attract and/or keep old off footballing superstars. Hence, the competition for places was not always as fierce as it should have been in some positions for a club of Arsenal’s magnitude. It has not been all doom and gloom for the Gunners though as they have picked up three FA Cups. Some of Europe’s best players have donned the famous red shirt in this decade as well. Let us take a trip down memory lane and pick Arsenal’s team of the decade.\n\nArsenal Team of the Decade\n\nManager – Arsène Wenger\n\nArsène Wenger is the obvious choice as the manager of the Arsenal team of the decade. Unai Emery was the manager for a brief period but one cannot possibly think of his reign as anything other than an utter disaster. Under Wenger, Arsenal won the FA Cup three times in four seasons. Despite fans turning on him in the last season or so, Wenger’s time at the helm is always looked back with fondness. At least, the football was mostly entertaining. The Gunners had some memorable victories in the last decade under him as well. The 2-1 victory over Barcelona in 2011 comes to mind first. Then, there was the massive 3-2 FA Cup final win over Hull City after coming back from 2-0 down. Definitely, Wenger was the best manager Arsenal have ever had.\n\nFormation – 4-2-3-1\n\nIn the last decade, most teams have played with one up front. Arsenal have done the same on most occasions as well. Hence, a 4-2-3-1 formation has been used to create the Arsenal team of the decade.\n\nGoalkeeper – Wojciech Szczęsny\n\nWojciech Szczęsny beats off competition from Łukasz Fabiański and Petr Čech to win the goalkeeper’s shirt of the Arsenal team of the decade. Szczęsny started the FA Cup final victory over Aston Villa in 2015. The Polish shot-stopper first arrived in 2006 and came through the youth academy of Arsenal. He is loved by everyone still and many did not support the decision to let him go to Juventus in 2017.\n\nSzczęsny is a Gooner through and through as well, which cannot be said about Petr Čech. Szczęsny was only 24 when he won the Premier League Golden Glove award jointly with Petr Čech. His time at Arsenal is looked back with fondness, mostly. Let’s just forget about that League Cup final against Birmingham City.\n\nBacary Sagna was a reliable option for Arsenal at right-back. He was solid at the back and quite dangerous going forward as well. The Frenchman had a happy habit of scoring against Tottenham Hotspur also.\n\nSagna was part of the starting 11 that ended Arsenal’s trophy drought in the 2014 FA Cup final. He made the PFA Team of the Year on two occasions too.\n\nHe deserves the right-back spot over Héctor Bellerín.\n\nIn the last decade, Arsenal had some shaky centre-backs playing for them. Laurent Koscielny was definitely one of them. However, the Frenchman still proved to be a world-class performer for the Gunners. He became club captain eventually and played through the pain barrier a number of times. The way he left the club was not at all pleasant. However, he deserves this spot for sure.\n\nPer Mertesacker joined Arsenal on deadline day in 2011 straight after the 8-2 defeat to Manchester United. It was a tumultuous time at Arsenal.\n\nThe BFG provided experience and calmness at the back that was much needed at the time to turn things around. Mertesacker was a key member of all three of Arsenal’s FA cup wins in the last decade. The 2017 FA Cup final against ​Chelsea was a special match for him as he was simply outstanding.\n\nThe German had not started a match for Arsenal for months before that but came back to deliver a fantastic performance against the league winners.\n\nNacho Monreal is a player loved by all the Arsenal fans. He always gave his all for the club.\n\nThe Spaniard was often deployed at centre-back and he did well in that position too.\n\nMonreal is the undisputed choice at left-back.\n\nCentre Midfielder – Aaron Ramsey\n\nAaron Ramsey was perhaps the best player of the decade for Arsenal. He scored the winning goals of the FA Cup finals in 2014 and 2017. Despite having multiple injuries during this decade, Ramsey became a club-legend at Arsenal.\n\nThe Welshman is the highest-scoring midfielder in Arsenal’s history with 64 goals in 369 appearances. Sadly, he was somehow allowed to leave for free, a common denominator of many members of the Arsenal team of the decade.\n\nCentre Midfielder – Santi Cazorla\n\nSanti Cazorla is probably the most loved player on this side. The Spaniard was a magician with the ball at his feet.\n\nHe produced a masterclass against Manchester City in 2015 which will live long in the memory of Arsenal fans.\n\nCazorla was instrumental in that memorable comeback against Hull City. His free-kick brought Arsenal back into the game. He won the Arsenal Player of the Season award in his first season as well.\n\nUnfortunately, Cazorla’s time at Arsenal ended tragically through a horrific injury.\n\nCentre Attacking Midfielder – Mesut Özil\n\nMesut Özil became Arsenal’s record signing in 2013 when he signed from Real Madrid for £42.5 million. That transfer sparked massive celebrations amongst Gooners all over the world.\n\nSince then, the German has been one of the most frustrating players at the club. On his day, Özil was simply phenomenal.\n\nHe picked up the Arsenal Player of the Season award in 2016. He has registered more assists than any other Arsenal player this decade. His place in this side is deserved without a doubt.\n\nRight Winger – Pierre-Emerick Aubameyang\n\nPierre-Emerick Aubameyang only joined Arsenal in 2018. However, his place in the team of the decade is well-deserved.\n\nThe Gabonese won the Golden Boot in his first full Premier League season. He scores goals for fun and those goals have often dragged an average Arsenal side through tough times.\n\nThe final signing of the Wenger era has become a talisman at the club and Arsenal fans hope he will stay on at the club for a few more seasons.\n\nLeft Winger – Alexis Sanchez\n\nAlexis Sanchez was superb during his time in North London. He wowed the crowd with dazzling performances regularly. The Chilean won Arsenal’s Player of the Year award twice in four years. He was quite sensational at times during his stay.\n\nHowever, by the time Sanchez left Arsenal, his relationship with the fans became quite feisty. Regardless, he deserves his spot in this side.\n\nStriker – Robin van Persie\n\nRobin van Persie scored 132 goals in 278 games for Arsenal. He was the club captain and scored 30 goals in the 2011/12 season to pick up the golden boot. The Dutch striker was at Arsenal for eight seasons.\n\nUnfortunately, like many other players in this side, van Persie also left making Arsenal fans angry. He was a magnificent player and losing him to Manchester United hurt Gooners really badly.\n\nSubstitutes\n\nŁukasz Fabianski\n\nMikel Arteta\n\nOlivier Giroud\n\nTheo Walcott\n\nHéctor Bellerín\n\nFrancis Coquelin\n\nJack Wilshere\n\nMain Photo\n\nEmbed from Getty Images"}, {"url": "https://www.sportskeeda.com/player/laurent-koscielny", "page_content": "Laurent Koscielny: A Brief Biography\n\nLaurent Koscielny is a professional footballer from France. He was born on the 10th of September, 1985 in Tulle. Koscielny is a center back who is currently the vice-captain of the English Premier League team Arsenal.\n\n\n\n\n\nBackground\n\n\n\n\n\nThe Frenchman began his career with Guingamp in 2004 which has produced players like Didier Drogba and Florent Malouda. Koscielny played as a fullback for Guingamp in most of the matches.However, he felt that center back was his forte and this made him join Tours FC to take a chance at center back.\n\n\n\n\n\nIn his debut season with Tours FC in 2007, Koscielny showed remarkable progress and played a major role in his team’s promotion to Ligue 1. He was also named in the best XI of the season.\n\n\n\n\n\nThe center back continued his good form with Lorient FC in 2009 where he was regarded as one of the best players in his position. He was developing reputation as a clever and an agile defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\n\n\n\n\nDebut\n\n\n\n\n\nLaurent Koscielny had the opportunity to represent Poland but decided to ply his trade with France. He made his first appearance for France on the 9th of February, 2011 in a friendly match against United States. Koscielny played the entire game and his side sealed a 1-0 victory. On the 4th of June, 2016, Koscielny scored his first international goal in a friendly match against Scotland.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nKoscielny had a great debut season with Arsenal. He was constantly making great tackles and preventing the opposition from penetrating their back line. In 2011, Koscielny had one of his best performances till date that saw Arsenal beat Barcelona 2-1 in the round of 16 Champions League tie.\n\n\n\n\n\nThe Frenchman was a great asset to the team as apart from acting as a defender, he had a great goal scoring ability. Till date, Koscielny has scored 24 goals for Arsenal. He is the highest scoring defender for Arsenal in the history of EPL. He is regarded as one of the most important players for Arsenal in the past seven years.\n\n\n\n\n\nKoscielny has won the FA Cup with Arsenal in 2014, 2015 and 2017. He has also won the FA Community Shield in 2014, 2015 and 2017. The center back has made a major contribution in his team’s success in the FA Cup over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nKoscielny has got more than thirty yellow cards and as many as five red cards. This has forced him out of a few crucial encounters and has affected the team’s performance. He has missed more games due to suspension and not because of injury.\n\n\n\n\n\nThe center back must work on preventing harsh tackles so as to represent Arsenal in more and more games and increase their chances of winning more trophies.\n\n\n\n\n\nThe Frenchman is yet to win the Premier League with Arsenal. Although he has won six titles at Arsenal, the coveted Premier League title has eluded him."}, {"url": "https://www.prweb.com/releases/2013/3/prweb10575152.htm", "page_content": "Digital Sports Group Laurent Koscielny is a fantastic player\n\nA central defender who joined Arsenal from Lorient in the summer of 2010. He is a cultured player who is comfortable bringing the ball out of defence and reads the game well.\n\nLaurent was thrust into action on the opening day of the 2010-11 season against Liverpool and settled in quickly at the club, featuring regularly in the line-up throughout the campaign. He continued to make progress in 2011-12, becoming a key figure at the back for the Gunners and rarely missing a match throughout the season.\n\nHead of Operations at DSG, Matthew Tait had this to say “Laurent Koscielny is a fantastic player and we have been working hard to provide the most fantastic resource that is both enjoyable to use and useful. Working with the PFA provides unique biographical information and insights that can be found nowhere else online. We are proud of our partnership with the Professional Footballers Association and the unrivalled access this provides us to the players.”\n\nDSG became the official digital partner of the Professional Footballers Association (PFA) earlier this year and have since launched a number of Player profile fan pages on social media site Facebook as well as providing official player pages on their football news site football.co.uk."}, {"url": "https://medium.com/@gentie/history-of-laurent-koscielny-5047b6fe8a03", "page_content": "History Of Laurent Koscielny gentie · Follow · Feb 13, 2018 10 min read -- Listen Share\n\nLaurent Koscielny (French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French professional footballer who plays as a centre back for English club Arsenal and the France national team. He is vice-captain of Arsenal.\n\nBorn in Tulle, Koscielny began his football career playing for a host of youth clubs before moving to Guingamp in 2003, where he quickly progressed through the youth ranks, making his professional debut the following season. After becoming frustrated at being played out of position as a right back, he joined Tours for an undisclosed fee, quickly establishing himself as the team’s star player in his desired position, ultimately aiding in the club’s promotion into Ligue 1, while also being named in the Ligue 2 Team of the Season.[3] Koscielny continued his impressive performances following a €1.7 million transfer to fellow French outfit Lorient in 2009, receiving multiple plaudits for his performances, largely cultivating a reputation as a clever, agile, ball-playing defender.[3] His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\nFollowing his arrival to England, Koscielny has widely been regarded to be one of the best players in his position, as well as one of the best in the world.[4][5] He has since established himself as a core component in the Arsenal first team, as well as contributing with a host of individual performances, including aiding in ending the club’s nine-year trophy drought, scoring a crucial equalizer en route to winning the FA Cup in 2014. He was also crucial in further club successes that followed, winning another two FA Cups and the FA Community Shield on three occasions.\n\nDespite having the ability to represent Poland, Koscielny instead decided to represent France, and first appeared up for the national team against Brazil in February 2011.[6] Koscielny has since become a regular starter for the nation in every major tournament that they have appeared in, including UEFA Euro 2012 and the 2014 FIFA World Cup, while also leading France to the final of UEFA Euro 2016. He scored his first international goal in a friendly match against Scotland in 2016,[7] and has since amassed forty-nine appearances for the national side.\n\nPrior to the beginning of the 2018 FIFA World Cup, Koscielny announced that he would be retiring from international football after the competition, and thus no longer be playing for France.\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.[citation needed]\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division’s best XI at the end of the season.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club’s number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs.[10] Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off.[11] He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.[12]\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James’ Park. Koscielny was given a straight red card in Arsenal’s 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny’s performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was “impressive” and “magnificent throughout”.[13] On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.[14]\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal’s biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal’s 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team’s fourth most important player by the fans in Arsenal’s Player of the Season poll for his performances throughout the 2011–12 season.[15]\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal.[16][17][18] His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1.[19] On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.[20]\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.[21]\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James’ Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.[22]\n\nKoscielny was voted as Arsenal’s second best player of the season.[23]\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal’s 3–1 Premier League opening day defeat at home to Aston Villa.[24] However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.[25]\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland.[26] In the team’s penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.[26]\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.[27]\n\nOn 17 May, Koscielny scored Arsenal’s equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.[28]\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal’s first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium.[29] After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks.[30] On 29 November, he returned to Arsenal’s starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns.[31] In the team’s following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.[32]\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City.[33] On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium.[34] On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1.[35] On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.[36]\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium,[37] due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea.[38][39] With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane.[40] He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running.[41] Koscielny scored his fourth of the season in a 3–3 draw with West Ham.[42]\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal’s highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday.[43] Koscielny was involved in a controversial incident at the end of Arsenal’s 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny’s arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny.[44][45][46] On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal.[47] Two days later, he made his 200th appearance for Arsenal in the Premier League on a 4–0 away victory against Swansea City.[48][49]\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.[50]\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker.\n\nKoscielny was called up to the French national team on 3 February 2011. Before his call up for France, Koscielny was also eligible to play for Poland and initially considered applying for Polish citizenship.[6] In August 2010, it was reported that he had not submitted an application and cancelled a meeting with Poland national team coach Franciszek Smuda in Warsaw on 7 August. Koscielny later declared that his priority was to play for France.[53]\n\nKoscielny was called up to the French team for the first time on 3 February 2011, for the team’s friendly versus Brazil on 9 February.[54][55] Koscielny made his first appearance for les Bleus in a friendly match against the United States on 11 November, playing the entire match in a 1–0 win.\n\nHe made his first appearance in a major tournament during UEFA Euro 2012, when he played the entire match in a 2–0 defeat to Spain in the quarter-finals but was voted Man of the Match by the French media. On 15 November 2013, he was sent off in a 2014 World Cup qualifying play-off against Ukraine.\n\nOn 13 May 2014, Koscielny was named in Didier Deschamps’ squad for the 2014 FIFA World Cup.[56] He made his FIFA World Cup debut as a substitute for the injured Mamadou Sakho in a 5–2 defeat of Switzerland in the team’s second group match.[57] He was then named in the starting line-up for the next match against Ecuador, helping the team to a clean sheet in a 0–0 draw.[58] On 4 June 2016, Koscielny scored his first international goal in a friendly match against Scotland."}, {"url": "https://talksport.com/football/1072837/laurent-koscielny-retires-bordeux-racism-accusation-arsenal/", "page_content": "Laurent Koscielny has called time on his playing career aged 36, hanging up his boots amid accusations of racism by Bordeaux's ultras - which he strongly denies.\n\nThe former Arsenal captain has been a free agent for two months after leaving Bordeaux in January, and has released a statement saying the allegations of racism have left him 'shocked'.\n\n3 The 36-year-old left the French side in January having spent two-and-a-half seasons at the club Credit: Getty\n\nIn a career that lasted nearly 18 years, Koscielny's finale ended on a slightly sour note and being frozen out of the team towards the end of his spell at Bordeaux.\n\nThe best part of his career was spent at the Emirates Stadium where he made 353 appearances that spanned nine seasons.\n\nHe also helped the club secure three FA Cups and as many Community Shields.\n\nHis departure from Arsenal also ended on a sad note after refusing to join the club on a pre-season tour to the US.\n\nNow he is refuting claims after French publication Sud Ouest reported that he and teammate Benoit Costil are being accused by the club's ultras, UB87, of a lack of leadership and of 'scandalous, sometimes racist' behaviour.\n\nA statement read: \"Following the article published in the Sud Ouest newspaper on March 22, 2022 entitled 'Girondins de Bordeaux. Costil and Koscielny, accusations of racism that shake', Laurent Koscielny was surprised, shocked but also saddened by the remarks made by one of the representatives of the Ultramarines 87 Group against him, which the press is now echoing.\n\n3 Koscielny's best season arguably came in 2015/16 where he kept 15 clean sheets in 33 league games\n\n\"Without there being any ambiguity, he strongly disputes these accusations which have seriously [damage] him and which have repercussions on his family and those around him.\n\n\"In this regard, Laurent Koscielny underlines that the investigative work of the Sud Ouest newspaper which solicited more than thirty people [according to the journalist's statements] who formally denied the alleged racist behaviour of Laurent Koscielny.\n\n\"As a reminder, if Laurent Koscielny has not been part of the professional staff of the club since the end of January 2022, he recalls that he is still an employee of the Girondins de Bordeaux.\n\n\"On this point, Laurent Koscielny intends to specify that he has decided to hang up his [boots] when he would have preferred to help the club on the [pitch].\n\n\"Aware that the club was in difficulty, he accepted the proposal made to occupy a new [role] and to release [his] salary [as] proof of the concern he has for the best interests of the club.\n\n3 Koscielny was blasted for his 'disgusting' and 'disrespectful' Bordeaux reveal video in which he took off an Arsenal shirt Credit: @girondins on Twitter\n\n\"As such, he would like to thank the club for the mark of confidence shown in him by entrusting him with this position.\n\n\"This mission is the extension of a career that has commanded the respect of all of his partners, coaches and staff that he has worked with both in the club and in the France team.\n\n\"Laurent Koscielny also shares the club's position, which recalled in its press release that 'no document aimed at supporting these allegations has been brought to the attention of the Club, which in principle intends to exercise the greatest caution'.\"\n\nKoscielny left Arsenal under a cloud in 2019 after refusing to travel with the rest of the team to the club's pre-season tour of the United States, in order to force a move to France.\n\nArsenal said in a statement at the time they were 'very disappointed' with the former captain's behaviour after 'going against our clear instructions'."}, {"url": "https://peoplepill.com/people/laurent-koscielny/", "page_content": "Laurent Koscielny ( French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French footballer who plays as a centre-back for English club Arsenal and the France national team. Koscielny is the vice-captain of Arsenal. He has been described as a clever, agile and ball-playing defender.\n\nKoscielny was born in the city of Tulle and began his football career playing for a host of amateur and youth clubs such as Brive, Tulle Corrèze and Limoges. In 2003, he moved to Guingamp, where he made his professional debut the following year. Koscielny joined Tours for an undisclosed fee to play in the third tier of the French league in 2007 and enjoyed promotion with his new side before being named in the Ligue 2 Team of the Season the following campaign. In 2009, newly promoted Ligue 1 side Lorient signed Koscielny for around €1.7 million, and his performances caught the eye of Arsenal manager Arsène Wenger, who signed him in 2010. Since then, he is regarded as one of the best players in his position in the Premier League.\n\nKoscielny was first called up to the French national team on 4 February 2011 and has since represented the country at UEFA Euro 2012, UEFA Euro 2016, and at the 2014 FIFA World Cup. Prior to his call-up for France, he was also eligible to play for Poland, as a result of his family roots.\n\nClub career\n\nEarly career\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division's best XI at the end of the season.\n\nLorient\n\nOn 16 June 2009, newly promoted Ligue 1 side FC Lorient signed Koscielny on a four-year contract for around €1.7 million. He established himself as a starter and played in his preferred centre-back position. Over one season at the club, he scored 3 goals in 35 appearances. On 7 March 2010 Koscielny tapped in his first Ligue 1 goal against Olympique Marseille at Stade Vélodrome in the 65th minute in a 1–1 draw. Koscielny became a fan favourite when he scored his second goal with a header deep in injury time against Montpellier in a 2–2 draw after a cross from Olivier Monterrubio.\n\nHe scored another against Bordeaux after 11 minutes. However, he received a red card 15 minutes later for a foul in the penalty area against his future Arsenal teammate Marouane Chamakh. Koscielny helped Lorient to finish the campaign in 7th place; its best finish in Ligue 1. An impressive season culminated in reports from French daily Ouest-France that the defender was training with the Arsenal reserves ahead of an official announcement. On 6 July 2010, Koscielny agreed personal terms with Arsenal. Arsenal's initial offer for Koscielny was believed to be in the region of £4 million, while they were then prepared to do a deal that would also involve youngster Francis Coquelin moving on loan in the opposite direction, which Lorient rejected. During the summer transfer window of 2010 reports began to emerge in late June that a deal had been reached to bring Koscielny to Arsenal for a reported sum of £8.45 million.\n\nArsenal\n\n2010–11 season\n\n\"I don't believe any French player would have refused to come and play for Arsenal. It took me four years to go from the bench of Ligue 2 to Arsenal so it is a great achievement. I have been on the crest of a wave for the last few years. But it is just the beginning; I haven't proved anything yet. Arsenal is a reference for football.\" Laurent Koscielny\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs. Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off. He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James' Park. Koscielny was given a straight red card in Arsenal's 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny's performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was \"impressive\" and \"magnificent throughout\". On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal's biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal's 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team's fourth most important player by the fans in Arsenal's Player of the Season poll for his performances throughout the 2011–12 season.\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal. His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1. On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James' Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.\n\nKoscielny was voted as Arsenal's second best player of the season.\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal's 3–1 Premier League opening day defeat at home to Aston Villa. However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland. In the team's penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.\n\nOn 17 May, Koscielny scored Arsenal's equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal's first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium. After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks. On 29 November, he returned to Arsenal's starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns. In the team's following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City. On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium. On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1. On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium, due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea. With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane. He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running. Koscielny scored his fourth of the season in a 3–3 draw with West Ham.\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal's highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday. Koscielny was involved in a controversial incident at the end of Arsenal's 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny's arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny. On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal. Two days later, he made his 200th appear for Arsenal in the Premier League on a 4–0 away victory against Swansea City.\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker."}, {"url": "https://www.bbc.co.uk/sport/football/57356719", "page_content": "Last updated on .From the section Premier League\n\nManchester United's Luke Shaw and Tottenham's Son Heung-min are in a 2020-21 PFA Premier League Team of the Year dominated by Manchester City .\n\nSix of City's Premier League-winning squad - Ederson, Joao Cancelo, John Stones, Ruben Dias, Kevin de Bruyne and Ilkay Gundogan - make the team, which is voted for by fellow players.\n\nUnited's Bruno Fernandes also makes it.\n\nTottenham's Harry Kane and Liverpool's Mohamed Salah, who scored 23 and 22 league goals respectively, are in.\n\nDespite winning the Champions League - as well as reaching the FA Cup final and finishing fourth in the Premier League - no Chelsea players are included.\n\nManchester City won the 2020-21 Premier League with a 12-point cushion\n\nThere is no room for City midfielder Phil Foden, 21, who made 50 appearances in all competitions in 2020-21, helping the club win the Premier League and Carabao Cup, and reach the Champions League final.\n\nKeeper Kasper Schmeichel, who inspired Leicester City to a first FA Cup triumph, also misses out\n\nThe PFA Team of the Year was voted for by members of the Professional Footballers' Association, the players' union.\n\nBelgium midfielder De Bruyne is the only player to retain his place from the team of 2019-20.\n\nGOALKEEPER - Ederson (Man City)\n\nEderson kept 19 clean sheets in the Premier League in 2020-21\n\nDid you know? Brazilian keeper Ederson, 27, became the first keeper to keep the most clean sheets in consecutive Premier League campaigns since former City stopper Joe Hart, who did so three years running (2010-11, 2011-12, 2012-13).\n\nDEFENDERS\n\nJoao Cancelo (Man City)\n\nJoao Cancelo joined City from Juventus for £60m in August 2019\n\nDid you know? Portugal full-back Cancelo, 27, created 1.6 chances per 90 minutes in open play in the 2020-21 Premier League season, the best return from a defender with at least 15 appearances to their name.\n\nJohn Stones (Man City)\n\nJohn Stones made 22 Premier League starts in 2020-21, scoring four goals\n\nDid you know? Manchester City conceded only 12 goals in the 1,934 minutes that England defender Stones, 27, featured in the Premier League, conceding once every 161 with him on the pitch, the best rate of any player in the squad.\n\nRuben Dias (Man City)\n\nRuben Dias joined City from Benfica in September 2020 for £65m\n\nDid you know? Manchester City conceded 0.7 goals per game in the 32 Premier League matches Portugal defender Dias, 24, played in, compared to 1.8 goals conceded per game in the six matches he missed.\n\nLuke Shaw (Man Utd)\n\nLuke Shaw, right, has been at United for seven seasons\n\nDid you know? England defender Shaw, 25, created 72 chances for Manchester United in the Premier League in 2020-21 - the second-most of any defender in the division, after Liverpool's Trent Alexander-Arnold (77).\n\nMIDFIELDERS\n\nKevin de Bruyne (Man City)\n\nKevin de Bruyne has won three Premier League titles, one FA Cup and five Leage Cups since joining City in 2015\n\nDid you know? Belgium midfielder De Bruyne, 29, registered 12 assists in just 2,001 minutes of Premier League action in 2020-21, averaging an assist every 167 minutes.\n\nIlkay Gundogan (Man City)\n\nIlkay Gundogan joined City from Borussia Dortmund in June 2016\n\nDid you know? Germany midfielder Gundogan, 30, scored 13 league goals in 2020-21, more than doubling his previous best (6 in 2018-19). His 12 non-penalty goals were the most of any midfielder in a single Premier League season since Dele Alli in 2016-17 (also 12).\n\nBruno Fernandes (Man Utd)\n\nBruno Fernandes has yet to win a trophy at United since joining from Sporting Lisbon in January 2020\n\nDid you know? Portugal's Fernandes, 26, scored 18 goals and made 12 assists in the Premier League in 2020-21 - his 30 combined goals and assists was the most by a Manchester United player in a league campaign since Robin van Persie in 2012-13.\n\nFORWARDS\n\nHarry Kane (Tottenham)\n\nHarry Kane has scored 166 goals in 245 Premier League appearances\n\nDid you know? The England captain, 27, was directly involved in 37 goals in the Premier League in 2020-21 (23 goals, 14 assists), at least seven more than any other player in the competition (Bruno Fernandes, 30).\n\nMohamed Salah (Liverpool)\n\nMohamed Salah (left) has scored 97 goals in 158 Premier League appearances\n\nDid you know? Egypt forward Salah, 28, scored 20-plus goals in a Premier League season for the third time.\n\nSon Heung-min (Tottenham)\n\nTottenham signed Son Heung-min from German club Bayer Leverkusen in 2015\n\nDid you know? South Korea forward Son, 28, netted nine goals after travelling five or more metres in possession of the ball in the Premier League in 2020-21 - the most of any player."}, {"url": "https://www.arsenal.com/news/features/btn-koscielny", "page_content": "Next up in our mini-series analysing Arsenal's top four players of the season, our statistician examines Laurent Koscielny's 2012/13 stats.\n\nArguably Arsenal's two most important goals of the past 13 months were scored by Laurent Koscielny.\n\nIn May 2012 he grabbed the winning goal against West Bromwich Albion to secure a Champions League berth on the final day of the season. One year later he was at it again, acrobatically turning home the only goal of the game in the 55th minute against Newcastle, to seal another top-four place.\n\n\"Arsenal were unbeaten in the 15 league games in which Laurent Koscielny and Per Mertesacker started in central defence\"\n\nYet despite this crucial goal at St James - one of four Koscielny claimed during the season - it was mainly for his performances at the other end of the pitch that he was voted into second place in our Player of the Year poll.\n\nIn his third season at the Club, Koscielny played 34 games, including the last 11 of the campaign, during which time Arsenal remained unbeaten, and conceded just twice from open play.\n\nHe appeared in all four competitions (25 games in the league, five in the Champions League, three in the FA Cup and one in the League Cup).\n\nHis overall playing record was W21, D9, L4 for an impressive win rate of 61.8 per cent.\n\nArsenal conceded 39 goals from the 34 matches Koscielny played, however the Frenchman was only on the pitch while 33 of those goals were scored.\n\nLaurent Koscielny 2012/13 appearances\n\nKoscielny was on the pitch for a total of 2,513 minutes (just under 42 hours), and Arsenal conceded once every 76.2 minutes on average with him in the side.\n\nHe had three different central defensive partners throughout the campaign, the most common of whom was Per Mertesacker. That duo was deployed 21 times in the season, conceding an average of 0.9 goals per game, compared to the 1.29 goals per game conceded for the six games he played alongside Thomas Vermaelen.\n\nFurthermore, Arsenal were unbeaten in the 15 league games in which Koscielny and Mertesacker started in central defence together - winning nine and drawing the other six.\n\nIn all competitions the record for that duo was P21, W12, D8, L1 - the solitary defeat coming at home to Bayern Munich in the Champions League.\n\nLaurent Koscielny game by game, 2012/13 Comp Date Opponent F/A W/D/L H/A Gls Ast Mins PL 2/9/12 Liverpool 2-0 W A 0 0 1 PL 23/9/12 Man City 1-1 D A 1 0 90 PL 29/9/12 Chelsea 1-2 L H 0 0 90 CL 3/10/12 Olympiacos 3-1 W H 0 0 90 PL 6/10/12 West Ham 3-1 W A 0 0 5 COC 30/10/12 Reading 7-5 W A 1 0 120 CL 6/11/12 Schalke 2-2 D A 0 0 90 PL 10/11/12 Fulham 3-3 D H 0 0 90 PL 17/11/12 Tottenham 5-2 W H 0 0 90 CL 21/11/12 Montpellier 2-0 W H 0 0 90 PL 24/11/12 Aston Villa 0-0 D A 0 0 90 PL 28/11/12 Everton 1-1 D A 0 0 4 PL 22/12/12 Wigan 1-0 W A 0 0 1 PL 29/12/12 Newcastle 7-3 W H 0 0 90 PL 1/1/13 Southampton 1-1 D A 0 0 90 FAC 6/1/13 Swansea 2-2 D A 0 1 90 PL 13/1/13 Man City 0-2 L H 0 0 9 PL 23/1/13 West Ham 5-1 W H 0 0 32 FAC 26/1/13 Brighton 3-2 W A 0 0 90 PL 2/2/13 Stoke 1-0 W H 0 0 90 FAC 16/2/13 Blackburn 0-1 L H 0 0 90 CL 19/2/13 B. Munich 1-3 L H 0 0 90 PL 23/2/13 Aston Villa 2-1 W H 0 0 1 CL 13/3/13 B. Munich 2-0 W A 1 0 90 PL 16/3/13 Swansea 2-0 W A 0 0 90 PL 30/3/13 Reading 4-1 W H 0 0 90 PL 6/4/13 West Brom 2-1 W A 0 0 90 PL 13/4/13 Norwich 3-1 W H 0 0 90 PL 16/4/13 Everton 0-0 D H 0 0 90 PL 20/4/13 Fulham 1-0 W A 0 1 90 PL 28/4/13 Man United 1-1 D H 0 0 90 PL 4/5/13 QPR 1-0 W A 0 0 90 PL 14/5/13 Wigan 4-1 W H 0 0 90 PL 19/5/13 Newcastle 1-0 W A 1 0 90\n\nKoscielny's central defensive partners (starts only) Player Games Goals conc* CPG Mertesacker 21 19 0.9 Vermaelen 7 9 1.29 Djourou 1 5 5 Total 29 33 1.14\n\nAs per his previous two seasons, Laurent also contributed a number of important goals, taking his overall scoring tally to double figures, at a rate of one goal every 11.9 games.\n\n\"Each of his last five goals have come away from home\"\n\nAs well as the winner against Newcastle last weekend, he scored a vital late equaliser at Manchester City back in September, an 89th-minute goal at Reading to make it 4-3 and continue the comeback from 4-0 down in the Capital One Cup, and then an 86th-minute header at Bayern Munich, which put the Gunners within one goal of the Champions League quarter-finals.Incidentally, each of his last five goals have come away from home.Koscielny contributed two assists as well, including one for fellow defender Mertesacker in the 1-0 win at Fulham in April.Defensively Koscielny's stats were also impressive, particularly the number of clearances (122 during the Premier League season, more per minute than any other Arsenal player) and his duel success rate, which, at 68.8 per cent, was the highest in the squad. He finished the season on 119 career appearances for the Gunners, bringing up the century on January 1 at Southampton. He is one of 203 players to reach 100 or more games for the Club.\n\nLaurent Koscielny Arsenal career stats 2012/13 STATS CAREER Apps Goals Assists Apps Goals Assists League 20+5 2 1 83+5 6 2 FA Cup 3 0 1 8 0 2 Europe 5 1 0 15 2 0 League Cup 1 1 0 8 2 1 Total 29+5 4 2 114+5 10 5\n\nMinutes per clearance"}, {"url": "https://www.the-sun.com/sport/football/premier-league/4982844/ex-arsenal-laurent-koscielny-retires-denies-racism-allegations-bordeaux/", "page_content": "FORMER Arsenal and Bordeaux captain Laurent Koscielny has announced his retirement from football and strongly denied \"shocking\" allegations of racism.\n\nKoscielny, 36, left the French club in January after he was frozen out.\n\n1 Koscielny has announced his retirement and also denied allegations of racism from Bordeaux's ultras Credit: GETTY\n\nAlongside team-mate Benoit Costil, the former France international was accused of a lack of leadership and \"scandalous, sometimes racist\" behaviour by Bordeaux's ultras - accusations Koscielny strongly denies.\n\nA statement read: \"Following the article published in the Sud Ouest newspaper on March 22, 2022 entitled 'Girondins de Bordeaux. Costil and Koscielny, accusations of racism that shake', Laurent Koscielny was surprised, shocked but also saddened by the remarks made by one of the representatives of the Ultramarines 87 Group against him, which the press is now echoing.\n\n\"Without there being any ambiguity, he strongly disputes these accusations which have seriously [damage] him and which have repercussions on his family and those around him.\n\n\"In this regard, Laurent Koscielny underlines that the investigative work of the Sud Ouest newspaper which solicited more than thirty people (according to the journalist's statements) who formally denied the alleged racist behaviour of Laurent Koscielny.\n\n\"As a reminder, if Laurent Koscielny has not been part of the professional staff of the club since the end of January 2022, he recalls that he is still an employee of the Girondins de Bordeaux.\n\n\"On this point, Laurent Koscielny intends to specify that he has decided to hang up his [boots] when he would have preferred to help the club on the [pitch].\n\n\"Aware that the club was in difficulty, he accepted the proposal made to occupy a new [role] and to release [his] salary [as] proof of the concern he has for the best interests of the club.\n\n\"As such, he would like to thank the club for the mark of confidence shown in him by entrusting him with this position.\n\n\"This mission is the extension of a career that has commanded the respect of all of his partners, coaches and staff that he has worked with both in the club and in the France team.\n\n\"Laurent Koscielny also shares the club's position, which recalled in its press release that 'no document aimed at supporting these allegations has been brought to the attention of the Club, which in principle intends to exercise the greatest caution.'\"\n\nKoscielny had a successful 18-year playing career.\n\nThe centre-back started in France with EA Guingamp before moving on to play for Tours and Lorient.\n\nWhilst at Lorient, Koscielny helped them to finish the campaign in 7th place and his consistent displays earned him a move to the Premier League to play for Arsenal.\n\nThe Frenchman went on to play the most games he has ever played for a single club, turning out for the Gunners on 353 occasions.\n\nBITTER ENDING\n\nKoscielny won three FA Cups during his time at the North London club and made 51 appearances for his country.\n\nHowever his nine year stint at the club ended under a cloud.\n\nHe refused to join the club's pre-season tour of the US after the club made it clear they weren't willing to sell him.\n\nEventually his hard line stance saw him get his way.\n\nBut he rubbed salt in the wounds with his announcement as a Bordeaux player seeing him star in a video in which he wore an Arsenal shirt, then took it off to show the colours of his new side underneath.\n\nGunners legend Ian Wright tweeted at the time: “This hurts. The level of disrespect. You should be ashamed for the way you’ve left the club after 9 years! Got what you wanted and still trying to have a dig. Hope it’s worth it in the long run.”"}], "Laurent Koscielny was included in the UEFA Team of the Year in 2015.": [{"url": "https://www.standard.co.uk/sport/football/arsenal-chelsea-and-tottenham-stars-among-uefa-team-of-the-year-nominees-a3401301.html", "page_content": "The Arsenal stars are joined on Uefa's shortlist by Tottenham's Toby Alderweireld, Chelsea's N'Golo Kante and West Ham's Dimitri Payet to make 12 Premier League representatives, though Spanish sides Real Madrid, Barcelona and Atletico Madrid dominate with 18 nominations from La Liga.\n\nManchester United's Zlatan Ibrahimovic and Paul Pogba make the grade, while rivals City have Kevin De Bruyne and Sergio Aguero on the list. Leicester title winner Riyad Mahrez and West Ham star Dimitri Payet are among the midfield contenders, but there is no room for Arsenal's Mesut Ozil despite a superb year for the German.\n\nArsene Wenger's are the fifth most represented club during the 15-year history of Uefa's annual award, with 10 of their 33 nominations making the cut over the years.\n\nArsenal star Mesut Ozil sports new Germany shirt 1 / 8 Arsenal star Mesut Ozil sports new Germany shirt Mesut Ozil adidas Mesut Ozil adidas Mats Hummels adidas Mats Hummels adidas Ilkay Gundogan adidas Ilkay Gundogan adidas\n\nNo players plying their trade in the Premier League during 2015 made last year's XI, but fans can change that by heading to Uefa's website and having their say in the online vote.\n\nUefa Team of the Year 2016 shortlist in full\n\nGoalkeepers: Rui Patricio (Sporting/Portugal), Keylor Navas (Real Madrid/Costa Rica), Jan Oblak (Atletico Madrid/Slovenia), Gianluigi Buffon (Juventus/Italy)\n\nDefenders: Gerard Pique (Barcelona/Spain), Joshua Kimmich (Bayern Munich/Germany), Toby Alderweireld (Tottenham/Belgium), Sergio Ramos (Real Madrid/Spain), Raphael Guerreiro (Borussia Dortmund/Portugal), Leonardo Bonucci (Juventus/Italy), Laurent Koscielny (Arsenal/France), Diego Godin (Atletico Madrid/Uruguay), Pepe (Real Madrid/Portugal), Juanfran (Atletico Madrid/Spain), Dani Carvajal (Real Madrid/Spain), Jerome Boateng (Bayern Munich/Germany)\n\nMidfielders: Dimitri Payet (West Ham United/France), Yannick Carrasco (Atletico Madrid/Belgium), Paul Pogba (Manchester United/France), Riyad Mahrez (Leicester City/Algeria), Kevin De Bruyne (Manchester City/Belgium), Joe Allen (Stoke City/Wales), Luka Modric (Real Madrid/Croatia), Aaron Ramsey (Arsenal/Wales), Toni Kroos (Real Madrid/Germany), Andres Iniesta (Barcelona/Spain), N'Golo Kante (Chelsea/France), Gregorsz Krychowiak (PSG/Poland)\n\nForwards: Lionel Messi (Barcelona/Argentina), Luis Suarez (Barcelona/Uruguay), Cristiano Ronaldo (Real Madrid/Portugal), Robert Lewandowski (Bayern Munich/Poland), Zlatan Ibrahimovic (Manchester United/Sweden), Gonzalo Higuain (Juventus/Argentina), Antoine Griezmann (Atletico Madrid/France), Pierre-Emerick Aubameyang (Borussia Dortmund/Gabon), Neymar (Barcelona/Brazil), Gareth Bale (Real Madrid/Wales), Sergio Aguero (Manchester City/Argentina), Alexis Sanchez (Arsenal/Chile)"}, {"url": "https://sportmob.com/en/article/975741-Top-Facts-About-Laurent-Koscielny-One-of-The-Best-Defenders", "page_content": "Laurent Koscielny plays as a centre back and he is product of Guingamp youth system. Then he quickly made his way through the ranks to the acme. Over the years he worked hard and managed to make a name for himself as one of the greatest footballers playing in the position of a defender. We will walk you through all the details about Laurent Koscielny transfer market stats.\n\nAside from the details of his career in football and his road to fame, we will fill you in with the details about\n\nLaurent Koscielny personal life.\n\nThe footballer is a married man. Laurent Koscielny wife supports him in every up and down. She gave birth to Laurent Koscielny children and together they have a great life."}, {"url": "https://www.sportskeeda.com/player/laurent-koscielny", "page_content": "Laurent Koscielny: A Brief Biography\n\nLaurent Koscielny is a professional footballer from France. He was born on the 10th of September, 1985 in Tulle. Koscielny is a center back who is currently the vice-captain of the English Premier League team Arsenal.\n\n\n\n\n\nBackground\n\n\n\n\n\nThe Frenchman began his career with Guingamp in 2004 which has produced players like Didier Drogba and Florent Malouda. Koscielny played as a fullback for Guingamp in most of the matches.However, he felt that center back was his forte and this made him join Tours FC to take a chance at center back.\n\n\n\n\n\nIn his debut season with Tours FC in 2007, Koscielny showed remarkable progress and played a major role in his team’s promotion to Ligue 1. He was also named in the best XI of the season.\n\n\n\n\n\nThe center back continued his good form with Lorient FC in 2009 where he was regarded as one of the best players in his position. He was developing reputation as a clever and an agile defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\n\n\n\n\nDebut\n\n\n\n\n\nLaurent Koscielny had the opportunity to represent Poland but decided to ply his trade with France. He made his first appearance for France on the 9th of February, 2011 in a friendly match against United States. Koscielny played the entire game and his side sealed a 1-0 victory. On the 4th of June, 2016, Koscielny scored his first international goal in a friendly match against Scotland.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nKoscielny had a great debut season with Arsenal. He was constantly making great tackles and preventing the opposition from penetrating their back line. In 2011, Koscielny had one of his best performances till date that saw Arsenal beat Barcelona 2-1 in the round of 16 Champions League tie.\n\n\n\n\n\nThe Frenchman was a great asset to the team as apart from acting as a defender, he had a great goal scoring ability. Till date, Koscielny has scored 24 goals for Arsenal. He is the highest scoring defender for Arsenal in the history of EPL. He is regarded as one of the most important players for Arsenal in the past seven years.\n\n\n\n\n\nKoscielny has won the FA Cup with Arsenal in 2014, 2015 and 2017. He has also won the FA Community Shield in 2014, 2015 and 2017. The center back has made a major contribution in his team’s success in the FA Cup over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nKoscielny has got more than thirty yellow cards and as many as five red cards. This has forced him out of a few crucial encounters and has affected the team’s performance. He has missed more games due to suspension and not because of injury.\n\n\n\n\n\nThe center back must work on preventing harsh tackles so as to represent Arsenal in more and more games and increase their chances of winning more trophies.\n\n\n\n\n\nThe Frenchman is yet to win the Premier League with Arsenal. Although he has won six titles at Arsenal, the coveted Premier League title has eluded him."}, {"url": "https://www.uefa.com/insideuefa/mediaservices/mediareleases/news/0253-0d80eae93244-c988542645fe-1000--uefa-com-team-of-the-year-2015-announced/", "page_content": "001 - Five Barcelona players included\n\nMore than 7.2 million votes were cast in the UEFA.com users' Team of the Year 2015 poll, with the final XI featuring five players from European champions FC Barcelona and a record tenth appearance for Cristiano Ronaldo. The Spanish league has the most representatives, with eight players selected.\n\nUEFA.com users' Team of the Year 2015\n\nManuel Neuer (FC Bayern München & Germany), David Alaba (FC Bayern München & Austria), Sergio Ramos (Real Madrid CF & Spain), Dani Alves (FC Barcelona & Brazil), Gerard Piqué (FC Barcelona & Spain), Andrés Iniesta (FC Barcelona & Spain), Paul Pogba (Juventus & France), James Rodríguez (Real Madrid CF & Colombia), Lionel Messi (FC Barcelona & Argentina), Neymar (FC Barcelona & Brazil) and Cristiano Ronaldo (Real Madrid CF & Portugal).\n\nThree players make their debuts in the 15th annual selection, picked from a shortlist of 40 chosen by UEFA.com staff writers on the basis of their performances for a European club or national side in 2015. Two of the debutants featured in the UEFA Champions League final: Paul Pogba is selected after starring in Juventus’ run to the Berlin showpiece, while Neymar scored in the final, one of his ten goals in the competition, in which he finished joint top scorer, and one of 22 goals in a stellar year that saw him win Liga, Copa del Rey and UEFA Champions League titles. The third debutant is Colombia’s James Rodríguez, who scored 17 goals for Real Madrid in 2015 despite injury.\n\nNeymar is joined in attack by club colleague Lionel Messi, who received the most votes – 448,445 – and features in the team for the seventh time. They are partnered up front by Cristiano Ronaldo, who is selected in the team for an unprecedented tenth time – and for the ninth time in a row.\n\nUsers were invited to decide on their preferred formation, with the majority opting for an attacking 4-3-3. Over 160,000 of this year's picks were made directly via the official UEFA Champions League Twitter page, while the remaining 7.1 million were made by 640,948 visitors to UEFA.com.\n\nContinuing its partnership with the International Committee of the Red Cross (ICRC), UEFA will for the ninth time set aside €100,000 to support the ICRC rehabilitation programme for landmine victims in Afghanistan. Players voted into the UEFA.com users' Team of the Year will present the donation to the ICRC at a major UEFA Champions League match within the next couple of months.\n\nFull voting results and previous UEFA.com users’ Teams of the Year can be found at en.toty.uefa.com."}, {"url": "https://www.foxsports.com.au/football/premier-league/uefa-team-of-the-year-shortlist-40man-list-announced-with-joe-allen-included-and-mesut-ozil-not/news-story/2a5110c72df9bacd23bbccd16ff3d62e", "page_content": "Arsenal's German midfielder Mesut Ozil missed out on the 40-man shortlist for UEFA Team of the Year.\n\nUEFA has announced their 40-man shortlist for the 2016 Team of the Year, but one of the stars of the Premier League has stunningly missed out. Full list here.\n\nJoe Allen, Aaron Ramsey and Paul Pogba are on the 40-man shortlist for UEFA’s Team of the Year, but Mesut Ozil misses out.\n\nStoke City midfielder Allen was one of Wales’ standout performers at Euro 2016 alongside Ramsey and Gareth Bale - who also makes the cut - and is one of 12 midfielders that could make the final selection.\n\nManchester United’s world-record signing Pogba also features in the list, unveiled by UEFA on Monday, which includes 12 Premier League players in total, while La Liga boasts the strongest representation with 18 nominees.\n\nHowever, Arsenal 28-year-old Ozil is not among the nominees, despite having contributed 19 assists in the English top flight last season and representing Germany at the European Championships in the summer.\n\nThe final team of the year will be voted by supporters, with seven-million fans expected to participate in the online vote on UEFA’s website, and Gunners fans have the most Premier League players featured in the shortlist to pick from.\n\nLaurent Koscielny and Alexis Sanchez help make Arsene Wenger’s side the best-represented Premier League team in the cut with three nominees, while Manchester United and Manchester City have two players each, with Tottenham, Chelsea, Leicester, West Ham and Stoke all having one player on the list.\n\nUEFA’S 40-MAN SHORTLIST FOR TEAM OF THE YEAR:\n\nGoalkeepers: Keylor Navas (Real Madrid), Gianluigi Buffon (Juventus), Rui Patricio (Sporting Lisbon) Jan Oblak (Atletico Madrid)\n\nDefenders: Gerard Pique (Barcelona), Joshua Kimmich (Bayern Munich) Toby Alderweireld (Tottenham), Sergio Ramos (Real Madrid), Raphael Guerreiro (Borussia Dortmund), Leonardo Bonucci (Juventus), Laurent Koscielny (Arsenal), Diego Godin (Atletico Madrid), Pepe (Real Madrid), Juanfran (Atletico Madrid), Dani Carvajal (Real Madrid), Jerome Boateng (Bayern Munich)\n\nMidfielders: Dimitri Payet (West Ham), Yannick Carrasco (Atletico Madrid), Paul Pogba (Man United), Riyad Mahrez (Leicester), Kevin De Bruyne (Man City), Joe Allen (Stoke), Luka Modric (Real Madrid), Aaron Ramsey (Arsenal), Toni Kroos (Real Madrid), Andres Iniesta (Barcelona), N’Golo Kante (Chelsea), Grzegorz Krychowiak (PSG)\n\nForwards: Lionel Messi (Barcelona), Luis Suarez (Barcelona), Cristiano Ronaldo (Real Madrid), Robert Lewandowski (Bayern Munich), Zlatan Ibrahimovic (Man United), Gonzalo Higuain (Juventus), Pierre-Emerick Aubameyang (Borussia Dortmund), Neymar (Barcelona), Gareth Bale (Real Madrid), Alexis Sanchez (Arsenal), Sergio Aguero, (Man City), Antoine Griezmann (Atletico Madrid)\n\nRead more at Sky Sport UK"}, {"url": "https://medium.com/@gentie/history-of-laurent-koscielny-5047b6fe8a03", "page_content": "History Of Laurent Koscielny gentie · Follow · Feb 13, 2018 10 min read -- Listen Share\n\nLaurent Koscielny (French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French professional footballer who plays as a centre back for English club Arsenal and the France national team. He is vice-captain of Arsenal.\n\nBorn in Tulle, Koscielny began his football career playing for a host of youth clubs before moving to Guingamp in 2003, where he quickly progressed through the youth ranks, making his professional debut the following season. After becoming frustrated at being played out of position as a right back, he joined Tours for an undisclosed fee, quickly establishing himself as the team’s star player in his desired position, ultimately aiding in the club’s promotion into Ligue 1, while also being named in the Ligue 2 Team of the Season.[3] Koscielny continued his impressive performances following a €1.7 million transfer to fellow French outfit Lorient in 2009, receiving multiple plaudits for his performances, largely cultivating a reputation as a clever, agile, ball-playing defender.[3] His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\nFollowing his arrival to England, Koscielny has widely been regarded to be one of the best players in his position, as well as one of the best in the world.[4][5] He has since established himself as a core component in the Arsenal first team, as well as contributing with a host of individual performances, including aiding in ending the club’s nine-year trophy drought, scoring a crucial equalizer en route to winning the FA Cup in 2014. He was also crucial in further club successes that followed, winning another two FA Cups and the FA Community Shield on three occasions.\n\nDespite having the ability to represent Poland, Koscielny instead decided to represent France, and first appeared up for the national team against Brazil in February 2011.[6] Koscielny has since become a regular starter for the nation in every major tournament that they have appeared in, including UEFA Euro 2012 and the 2014 FIFA World Cup, while also leading France to the final of UEFA Euro 2016. He scored his first international goal in a friendly match against Scotland in 2016,[7] and has since amassed forty-nine appearances for the national side.\n\nPrior to the beginning of the 2018 FIFA World Cup, Koscielny announced that he would be retiring from international football after the competition, and thus no longer be playing for France.\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.[citation needed]\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division’s best XI at the end of the season.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club’s number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs.[10] Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off.[11] He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.[12]\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James’ Park. Koscielny was given a straight red card in Arsenal’s 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny’s performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was “impressive” and “magnificent throughout”.[13] On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.[14]\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal’s biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal’s 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team’s fourth most important player by the fans in Arsenal’s Player of the Season poll for his performances throughout the 2011–12 season.[15]\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal.[16][17][18] His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1.[19] On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.[20]\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.[21]\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James’ Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.[22]\n\nKoscielny was voted as Arsenal’s second best player of the season.[23]\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal’s 3–1 Premier League opening day defeat at home to Aston Villa.[24] However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.[25]\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland.[26] In the team’s penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.[26]\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.[27]\n\nOn 17 May, Koscielny scored Arsenal’s equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.[28]\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal’s first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium.[29] After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks.[30] On 29 November, he returned to Arsenal’s starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns.[31] In the team’s following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.[32]\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City.[33] On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium.[34] On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1.[35] On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.[36]\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium,[37] due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea.[38][39] With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane.[40] He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running.[41] Koscielny scored his fourth of the season in a 3–3 draw with West Ham.[42]\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal’s highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday.[43] Koscielny was involved in a controversial incident at the end of Arsenal’s 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny’s arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny.[44][45][46] On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal.[47] Two days later, he made his 200th appearance for Arsenal in the Premier League on a 4–0 away victory against Swansea City.[48][49]\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.[50]\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker.\n\nKoscielny was called up to the French national team on 3 February 2011. Before his call up for France, Koscielny was also eligible to play for Poland and initially considered applying for Polish citizenship.[6] In August 2010, it was reported that he had not submitted an application and cancelled a meeting with Poland national team coach Franciszek Smuda in Warsaw on 7 August. Koscielny later declared that his priority was to play for France.[53]\n\nKoscielny was called up to the French team for the first time on 3 February 2011, for the team’s friendly versus Brazil on 9 February.[54][55] Koscielny made his first appearance for les Bleus in a friendly match against the United States on 11 November, playing the entire match in a 1–0 win.\n\nHe made his first appearance in a major tournament during UEFA Euro 2012, when he played the entire match in a 2–0 defeat to Spain in the quarter-finals but was voted Man of the Match by the French media. On 15 November 2013, he was sent off in a 2014 World Cup qualifying play-off against Ukraine.\n\nOn 13 May 2014, Koscielny was named in Didier Deschamps’ squad for the 2014 FIFA World Cup.[56] He made his FIFA World Cup debut as a substitute for the injured Mamadou Sakho in a 5–2 defeat of Switzerland in the team’s second group match.[57] He was then named in the starting line-up for the next match against Ecuador, helping the team to a clean sheet in a 0–0 draw.[58] On 4 June 2016, Koscielny scored his first international goal in a friendly match against Scotland."}, {"url": "https://www.uefa.com/uefachampionsleague/news/0265-1160b7e1bca5-2395e11c09bc-1000--men-s-team-of-the-year-stats/", "page_content": "The UEFA.com fans' Men's Team of the Year 2020 has been revealed, with almost 6 million votes cast over the course of more than a month.\n\nTeam of the Year 2020\n\n\n\nAll users who submitted a team will now be entered into a prize draw to win a VIP trip to both the men's and the women's UEFA Champions League finals. You can check out the UEFA.com fans' Women's Team of the Year 2020 here.\n\nThe UEFA.com fans' Team of the Year reflects the votes of the fans in parallel with players' achievements in 2020 and was validated based on input from a UEFA technical observer panel throughout the course of the year.\n\n\n\nManuel Neuer (Bayern)\n\nManuel Neuer: Champions League Goalkeeper of the 2019/20 Season\n\nAll-time selections: 4\n\n2020\n\nUEFA club competition: 11 appearances (5 clean sheets)\n\nDomestic: 34 (13)\n\nGermany: 4 (0)\n\nTotal: 49 (18)\n\nBack in the team for the first time since 2015, after a year in which he won a second career treble and was voted Goalkeeper of the Season for the 2019/20 UEFA Champions League.\n\nJoshua Kimmich (Bayern)\n\nAll-time selections: debut\n\n2020\n\nUEFA club competition: 9 appearances (4 clean sheets)\n\nDomestic: 28 (12)\n\nGermany: 2 (0)\n\nTotal: 39 (16)\n\nAnother mainstay of Bayern's UEFA Champions League-winning side, Kimmich makes the final XI for the first time after his fifth nomination. Named Defender of the Season in October.\n\nSergio Ramos (Real Madrid)\n\nRamos reflects on 100-goal milestone for Real Madrid\n\nAll-time selections: 9\n\n2020\n\nUEFA club competition: 4 appearances (1 clean sheets)\n\nDomestic: 34 (15)\n\nSpain: 8 (4)\n\nTotal: 46 (20)\n\nSelected in seven successive UEFA.com fans' Teams of the Year prior to his 2019 absence, Ramos is back after another Liga-winning year in which he also became Europe's most-capped men's international ever.\n\nVirgil van Dijk (Liverpool)\n\nAll-time selections: 3\n\n2020\n\nUEFA club competition: 2 appearances (0 clean sheets)\n\nDomestic: 28 (11)\n\nNetherlands: 5 (2)\n\nTotal: 35 (13)\n\nImperious throughout Liverpool's long-awaited Premier League-winning campaign, Van Dijk once again featured in the 2019/20 UEFA Champions League Squad of the Season. Included in the team for the third year running.\n\nAlphonso Davies (Bayern)\n\nAll-time selections: debut\n\n2020\n\nUEFA club competition: 8 appearances (5 clean sheets)\n\nDomestic: 28 (13)\n\nCanada: no appearances\n\nTotal: 36 (18)\n\nHad made just three UEFA Champions League outings prior to 2020 but was electric in the latter stages of Bayern's triumphant campaign. First Canadian to make the UEFA.com fans' Team of the Year.\n\nThiago Alcántara (Bayern/Liverpool)\n\nAll-time selections: debut\n\n2020\n\nUEFA club competition: 5 appearances (0 goals)\n\nDomestic: 16 (3)\n\nSpain: 2 (0)\n\nTotal: 23 (3)\n\nSecond behind De Bruyne for the Midfielder of the Season award, Thiago was Bayern's heartbeat during their sensational 2019/20 before signing for Liverpool in September. Only nominated for the first time in 2019.\n\nKevin De Bruyne (Manchester City)\n\nKevin De Bruyne: Champions League Midfielder of the 2019/20 Season\n\nAll-time selections: 3\n\n2020\n\nUEFA club competition: 5 appearances (2 goals)\n\nDomestic: 36 (9)\n\nBelgium: 4 (1)\n\nTotal: 45 (12)\n\nMidfielder of the Season for the 2019/20 UEFA Champions League, De Bruyne makes the cut for the third time in four years after another magisterial 12 months for club and country.\n\nCristiano Ronaldo (Juventus)\n\nAll-time selections: 15\n\n2020\n\nUEFA club competition: 6 appearances (6 goals)\n\nDomestic: 33 (35)\n\nPortugal: 6 (3)\n\nTotal: 45 (44)\n\nThe evergreen Ronaldo has been in every Team of the Year since 2007 – and still he goes on. Even at nearly 36, he's as prolific as ever for Juventus and Portugal.\n\nLionel Messi (Barcelona)\n\nAll-time selections: 12\n\n2020\n\nUEFA club competition: 7 appearances (4 goals)\n\nDomestic: 37 (22)\n\nArgentina: 4 (1)\n\nTotal: 48 (27)\n\nAnother year, another barrage of goals and match-winning performances. Messi has missed out on the UEFA.com fans' Team of the Year only once (2013) since his first inclusion in 2008.\n\nNeymar (Paris)\n\nAll-time selections: 2\n\n2020\n\nUEFA club competition: 10 appearances (8 goals)\n\nDomestic: 17 (11)\n\nBrazil: 2 (3)\n\nTotal: 29 (22)\n\nAdds to his sole previous appearance in 2015; won another domestic treble with Paris and inspired the French side to their first UEFA Champions League final.\n\nRobert Lewandowski (Bayern)\n\nLewandowski: Watch all of his 2019/20 goals\n\nAll-time selections: 2\n\n2020\n\nUEFA club competition: 10 appearances (8 goals)\n\nDomestic: 30 (37)\n\nPoland: 4 (2)\n\nTotal: 44 (47)\n\nUEFA Men's Player of the Year, Forward of the Season, 2019/20 UEFA Champions League top scorer, Best FIFA Men's Player of the Year – the list goes on. Lewandowski pieced together a peerless 2020."}, {"url": "https://www.bbc.co.uk/sport/football/46037946", "page_content": "Last updated on .From the section European Football\n\nLacazette's finish was the only real moment of excitement\n\nLaurent Koscielny played for the first time since May as Arsenal completed their near-perfect Europa League group stage with an easy win over Qarabag.\n\nUnai Emery's side had already qualified for the knockout round and go through as Group E winners, with five victories and one draw from their six matches.\n\nAlexandre Lacazette scored the only goal of a tame match with a slick 16th-minute winner from Mesut Ozil's pass.\n\nAfter the break, Eddie Nketiah had a headed goal ruled out for offside.\n\nAnd in the 89th-minute, 17-year-old winger Bukayo Saka missed a chance to become Arsenal's youngest goalscorer in Europe as he smashed a finish into the face of Qarabag goalkeeper Vagner.\n\nKoscielny, 33, ruptured his Achilles in last season's semi-finals defeat by Atletico Madrid.\n\nHe had very little work to do against Qarabag, who only went close when Donald Guerrier headed over, before being replaced in the 72nd minute.\n\nVictory extends Arsenal's unbeaten run into a 22nd match. It is their longest run without defeat in all competitions since a 28-game stretch that ended in November 2007.\n\nAs group winners, Arsenal will avoid the four best-placed teams teams dropping down from the Champions League in the draw for the last 32, which takes place on Monday at 12:00 GMT.\n\nThe first legs will be played on 14 February, with the return legs on 21 February. As a seeded team, Arsenal will play their second leg at home.\n\nKoscielny: I've started a new chapter\n\nCaptain Koscielny's quiet night\n\nArsenal boss Unai Emery has been fielding teams with a blend of youth, experience and first-team fringe players during this European campaign and it was more of the same on Thursday.\n\nBefore a modest crowd, there was a first senior start for Saka, in front of club captain Koscielny and alongside Mohamed Elneny and Ozil in midfield.\n\nKoscielny had already featured for Arsenal's under-23s on his road to recovery, in a 2-1 defeat by Portsmouth in the Checktrade Trophy on 4 December, when Saka scored the Gunners' goal.\n\nAgainst a team who have now lost all six of their meetings with English sides by an aggregate score of 1-18, the French defender had little work to do.\n\nAzeri champions over the past five years, Qarabag had no real attacking threat and made numerous mistakes in possession.\n\nKoscielny made one tackle and two clearances, also finishing his match with a 100% pass success rate. The minutes he played will be of more significance, especially considering the recent injury to Rob Holding.\n\nOzil labours and creates, Saka shines\n\nIt was Ozil's first appearance since 11 November, having spent five games out with a back injury. He looked uncomfortable on occasion in the first half - twice appearing to struggle back to his feet after falling in a 50-50 challenge.\n\nHe was replaced in the 83rd minute, having created the goal and three other good chances. His four key passes were more than any Arsenal player has created in a single Europa League game.\n\nLacazette was perhaps the more surprising selection - given he has played a regular and prominent role for Emery in the Premier League so far this season.\n\nHis goal, taken with five smart touches and a zipping low finish, was the game's only true moment of quality, as Arsenal soon after assumed full control of an already sedate fixture now removed of any real jeopardy.\n\nOne of very few points of interest was the impact of the side's youth players, and perhaps the brightest showing came from Saka, who came alive in the second half especially.\n\nAside from Lacazette, he was the only player among both sides to have a shot on target, and it was his excellent cross that found Nketiah for the disallowed goal.\n\nMan of the match - (Bukayo Saka)\n\nSaka had a total of three shots on target and also made one key pass\n\n'His personality is important for us'\n\nArsenal manager Unai Emery: \"We have the responsibility to give every young player chances, first to train with us and to be demanding with their performances.\n\n\"Saka played with a good performance, with a very big personality, his personality is very important for us to continue trying to go 1v1 and break lines with his quality.\n\n\"He played with a very big personality and sometimes with a very good performance. It's very important for his confidence and for us also, because we can look at this player and see quality to help us.\"\n\nGunners make it five without conceding - the stats you need to know\n\nArsenal are unbeaten in 22 games in all competitions (W17 D5 L0) last losing against Chelsea back in August - the Gunners longest unbeaten run since November 2007 (a club record 28 games).\n\nUnai Emery has lost just one of his 24 UEFA Europa League group games in charge of Valencia, Sevilla and Arsenal combined (W14 D9) and is unbeaten in the competition group stages since his Sevilla side were beaten 0-2 against Feyenoord back in November 2014 (P7 W6 D1 L0 since).\n\nArsenal have gone five Europa League games without conceding a goal since MD1 against Vorskla Poltava - excluding qualifiers, the Gunners last went on a longer run of consecutive clean sheets in European competition during the 2005/06 campaign, keeping 10 straight shut outs on their way to the Champions League final.\n\nFK Qarabag have lost all six of their meetings with English sides in all competitions, by an aggregate score of 1-18.\n\nFK Qarabag have lost seven of their last eight games in the UEFA Europa League (W1).\n\nMesut Ozil created four chances in this game for the Gunners - no Arsenal player has created more in a single Europa League game this campaign.\n\nWhat's next?\n\nArsenal next play in the Premier League away to Southampton in a 13:30 GMT kick-off on Sunday.\n\nNext up for Qarabag is an Azerbaijan Cup quarter-final first leg with Inter Baku."}, {"url": "https://peoplepill.com/people/laurent-koscielny/", "page_content": "Laurent Koscielny ( French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French footballer who plays as a centre-back for English club Arsenal and the France national team. Koscielny is the vice-captain of Arsenal. He has been described as a clever, agile and ball-playing defender.\n\nKoscielny was born in the city of Tulle and began his football career playing for a host of amateur and youth clubs such as Brive, Tulle Corrèze and Limoges. In 2003, he moved to Guingamp, where he made his professional debut the following year. Koscielny joined Tours for an undisclosed fee to play in the third tier of the French league in 2007 and enjoyed promotion with his new side before being named in the Ligue 2 Team of the Season the following campaign. In 2009, newly promoted Ligue 1 side Lorient signed Koscielny for around €1.7 million, and his performances caught the eye of Arsenal manager Arsène Wenger, who signed him in 2010. Since then, he is regarded as one of the best players in his position in the Premier League.\n\nKoscielny was first called up to the French national team on 4 February 2011 and has since represented the country at UEFA Euro 2012, UEFA Euro 2016, and at the 2014 FIFA World Cup. Prior to his call-up for France, he was also eligible to play for Poland, as a result of his family roots.\n\nClub career\n\nEarly career\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division's best XI at the end of the season.\n\nLorient\n\nOn 16 June 2009, newly promoted Ligue 1 side FC Lorient signed Koscielny on a four-year contract for around €1.7 million. He established himself as a starter and played in his preferred centre-back position. Over one season at the club, he scored 3 goals in 35 appearances. On 7 March 2010 Koscielny tapped in his first Ligue 1 goal against Olympique Marseille at Stade Vélodrome in the 65th minute in a 1–1 draw. Koscielny became a fan favourite when he scored his second goal with a header deep in injury time against Montpellier in a 2–2 draw after a cross from Olivier Monterrubio.\n\nHe scored another against Bordeaux after 11 minutes. However, he received a red card 15 minutes later for a foul in the penalty area against his future Arsenal teammate Marouane Chamakh. Koscielny helped Lorient to finish the campaign in 7th place; its best finish in Ligue 1. An impressive season culminated in reports from French daily Ouest-France that the defender was training with the Arsenal reserves ahead of an official announcement. On 6 July 2010, Koscielny agreed personal terms with Arsenal. Arsenal's initial offer for Koscielny was believed to be in the region of £4 million, while they were then prepared to do a deal that would also involve youngster Francis Coquelin moving on loan in the opposite direction, which Lorient rejected. During the summer transfer window of 2010 reports began to emerge in late June that a deal had been reached to bring Koscielny to Arsenal for a reported sum of £8.45 million.\n\nArsenal\n\n2010–11 season\n\n\"I don't believe any French player would have refused to come and play for Arsenal. It took me four years to go from the bench of Ligue 2 to Arsenal so it is a great achievement. I have been on the crest of a wave for the last few years. But it is just the beginning; I haven't proved anything yet. Arsenal is a reference for football.\" Laurent Koscielny\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs. Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off. He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James' Park. Koscielny was given a straight red card in Arsenal's 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny's performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was \"impressive\" and \"magnificent throughout\". On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal's biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal's 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team's fourth most important player by the fans in Arsenal's Player of the Season poll for his performances throughout the 2011–12 season.\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal. His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1. On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James' Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.\n\nKoscielny was voted as Arsenal's second best player of the season.\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal's 3–1 Premier League opening day defeat at home to Aston Villa. However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland. In the team's penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.\n\nOn 17 May, Koscielny scored Arsenal's equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal's first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium. After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks. On 29 November, he returned to Arsenal's starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns. In the team's following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City. On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium. On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1. On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium, due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea. With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane. He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running. Koscielny scored his fourth of the season in a 3–3 draw with West Ham.\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal's highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday. Koscielny was involved in a controversial incident at the end of Arsenal's 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny's arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny. On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal. Two days later, he made his 200th appear for Arsenal in the Premier League on a 4–0 away victory against Swansea City.\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker."}, {"url": "https://www.telegraph.co.uk/football/2019/05/21/henrikh-mkhitaryan-miss-arsenals-europa-league-final-chelsea/", "page_content": "Laurent Koscielny has said Uefa should not be holding the Europa League final in Baku given the political disputes that will prevent Henrikh Mkhitaryan from travelling with the Arsenal squad next week.\n\nArsenal confirmed on Tuesday that Mkhitaryan will not be playing in the final against Chelsea due to fears over his and the club’s security.\n\nThere are no diplomatic relations between Armenia and Azerbaijan because of a longstanding conflict over the disputed Nagorno-Karabakh region.\n\nKoscielny, the Arsenal captain, told BBC Radio 5 Live that countries with such conflicts should not be able to host European finals.\n\n“I am not very happy,” Koscielny said. “First because we need to leave one player here, because he can’t play in the final.\n\n“I think Uefa needs to know about the different problems they can have with the politics in the country. When one country has a problem with another they should not give the final to that country.\n\n“For us it is difficult because we want to have Micki with us. He is an important player for us.”"}]}