{"Laurent Koscielny began his career at Guingamp in 2004.": [{"url": "https://www.sportskeeda.com/player/laurent-koscielny", "page_content": "Laurent Koscielny: A Brief Biography\n\nLaurent Koscielny is a professional footballer from France. He was born on the 10th of September, 1985 in Tulle. Koscielny is a center back who is currently the vice-captain of the English Premier League team Arsenal.\n\n\n\n\n\nBackground\n\n\n\n\n\nThe Frenchman began his career with Guingamp in 2004 which has produced players like Didier Drogba and Florent Malouda. Koscielny played as a fullback for Guingamp in most of the matches.However, he felt that center back was his forte and this made him join Tours FC to take a chance at center back.\n\n\n\n\n\nIn his debut season with Tours FC in 2007, Koscielny showed remarkable progress and played a major role in his team’s promotion to Ligue 1. He was also named in the best XI of the season.\n\n\n\n\n\nThe center back continued his good form with Lorient FC in 2009 where he was regarded as one of the best players in his position. He was developing reputation as a clever and an agile defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\n\n\n\n\nDebut\n\n\n\n\n\nLaurent Koscielny had the opportunity to represent Poland but decided to ply his trade with France. He made his first appearance for France on the 9th of February, 2011 in a friendly match against United States. Koscielny played the entire game and his side sealed a 1-0 victory. On the 4th of June, 2016, Koscielny scored his first international goal in a friendly match against Scotland.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nKoscielny had a great debut season with Arsenal. He was constantly making great tackles and preventing the opposition from penetrating their back line. In 2011, Koscielny had one of his best performances till date that saw Arsenal beat Barcelona 2-1 in the round of 16 Champions League tie.\n\n\n\n\n\nThe Frenchman was a great asset to the team as apart from acting as a defender, he had a great goal scoring ability. Till date, Koscielny has scored 24 goals for Arsenal. He is the highest scoring defender for Arsenal in the history of EPL. He is regarded as one of the most important players for Arsenal in the past seven years.\n\n\n\n\n\nKoscielny has won the FA Cup with Arsenal in 2014, 2015 and 2017. He has also won the FA Community Shield in 2014, 2015 and 2017. The center back has made a major contribution in his team’s success in the FA Cup over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nKoscielny has got more than thirty yellow cards and as many as five red cards. This has forced him out of a few crucial encounters and has affected the team’s performance. He has missed more games due to suspension and not because of injury.\n\n\n\n\n\nThe center back must work on preventing harsh tackles so as to represent Arsenal in more and more games and increase their chances of winning more trophies.\n\n\n\n\n\nThe Frenchman is yet to win the Premier League with Arsenal. Although he has won six titles at Arsenal, the coveted Premier League title has eluded him."}, {"url": "https://playerswiki.com/laurent-koscielny", "page_content": "Laurent Koscielny is a French professional football player who currently plays as a center-back for English club Arsenal and the France national team and he is the vice-captain for Arsenal.\n\nThe 32-year-old has played for clubs like Guingamp, Tours, Lorient, and Arsenal. He currently receives an annual salary of $3 million.\n\nEarly Life\n\nLaurent Koscielny was born on 10 September 1985, in Tulle, France. His father, Bernard Koscielny, is a professional club manager. He began playing football at the age of 11 joining the youth team of Tulle Corrèze.\n\nClub Career\n\nGuingamp\n\nLaurent Koscielny began his professional football career in 2004, joining the French professional club Guingamp. He was in the club for three seasons appearing in 41 games, without scoring a goal.\n\nLorient\n\nHe further signed with the newly promoted League 1 team Lorient on 16 June 2009. His first league goal came on 7 March 2010, in a match against Olympique Marseille. His only season with the club ended up with a total of 35 appearances and 3 goals.\n\nArsenal\n\nKoscielny again made his move to the English Premier League joining Arsenal on 7 July 2010. His official club debut was on 15 September 2010, in a match against Sunderland and his first goal for Arsenal was on 11 September 2010, in a 4–1 win against Bolton Wanderers. He still plays for the club along with Ozil and Alexis Sanchez and is the vice-captain of the team.\n\nInternational Career\n\nKoscielny has represented his French national team in several tournaments. His senior international debut came on 11 November 2011, in a friendly match against the United States. He frequently appears in major tournaments as Euro Cup and World Cup. He has won 50 caps for his country scoring a single goal. He is good friend of his teammate Benzema\n\nPersonal Life\n\nFrench citizen Laurent Koscielny is a married man; he got married to his longterm loving girlfriend Claire Beaudouin. The couple started dating in 2011 and after four years of their relationship, the couple tied their knots on June 20, 2015, among their family and friends.\n\nThe couple together had their first daughter on 12 March 2011, Raina Koscielny. Their second son was born in 2015.\n\nNet Worth and Endorsements\n\nLaurent Koscielny has an estimated net worth of $12 million in 2017, including all of his properties. As of 2017, he is receiving an annual salary of $3 million from his present club Arsenal. Apart from football, he too earns massive amount from his endorsement deals with Puma. His current market value is around $25 million."}, {"url": "https://www.celeb-networth.com/laurent-koscielny", "page_content": "He scored another against Bordeaux after 11 minutes. However, he received a red card 15 minutes later for a foul in the penalty area against his future Arsenal teammate Marouane Chamakh. Koscielny helped Lorient to finish the campaign in 7th place; its best finish in Ligue 1. An impressive season culminated in reports from French daily Ouest-France that the defender was training with the Arsenal reserves ahead of an official announcement. On 6 July 2010, Koscielny agreed personal terms with Arsenal. Arsenal's initial offer for Koscielny was believed to be in the region of £4 million, while they were then prepared to do a deal that would also involve youngster Francis Coquelin moving on loan in the opposite direction, which Lorient rejected. During the summer transfer window of 2010 reports began to emerge in late June that a deal had been reached to bring Koscielny to Arsenal for a reported sum of £8.45 million.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs. Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off. He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James' Park. Koscielny was given a straight red card in Arsenal's 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season."}, {"url": "https://www.todaybirthdays.com/famous/laurent-koscielny.html", "page_content": "Deployed primarily as a centre back but occasionally as a right back, a position where he started his career, Koscielny plays for Arsenal and the French national football team. Described as an aggressive, strong, quick and ball-playing defender, he was voted as Wenger's most effective signing of 2010-11 following an impressive debut campaign. Koscielny was called up to the French national team on 4 February 2011 and represented the country at UEFA Euro 2012 and the 2014 FIFA World Cup.\n\nHis career began in 2004 with Guingamp before moving to Tours FC, Lorient and Arsenal on 7 July 2010.\n\nHe was born in Tulle, France.\n\nSoccer Player Laurent Koscielny were born on Tuesday, birthstone is Sapphire, the seaon was Summer in the Chinese year of Ox, it is 248 days until Laurent Koscielny next birthday.\n\nSeptember 10 Horoscope."}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=12309698&lang=en", "page_content": "Laurent Koscielny (born 10 September 1985) is a French former professional footballer who played as a centre back.\n\nBorn in Tulle, Koscielny began his football career playing for a host of youth clubs before moving to Guingamp in 2003, where he quickly progressed through the youth ranks, making his professional debut the following season. After becoming frustrated at being played out of position as a right back, he joined Tours for an undisclosed fee, quickly establishing himself as the team's star player in his desired position, ultimately aiding in the club's promotion into Ligue 1, while also being named in the Ligue 2 Team of the Season. Koscielny continued his impressive performances following a €1.7 million transfer to fellow French outfit Lorient in 2009, receiving multiple plaudits for his performances, largely cultivating a reputation as a clever, agile, ball-playing defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\nFollowing his arrival in England, Koscielny was regarded as one of the best players in his position in the Premier League. He had established himself as a core component in the Arsenal first team, as well as contributing with a host of individual performances, including aiding in ending the club's nine-year trophy drought, scoring a crucial equalizer en route to winning the FA Cup in 2014. He was also crucial in further club successes that followed, winning another FA Cup and the FA Community Shield twice.\n\nDespite qualifying to represent Poland, Koscielny instead decided to represent France, and first appeared up for the national team against Brazil in February 2011. Koscielny became a regular starter for the nation in every major tournament that they have appeared in, including UEFA Euro 2012 and the 2014 FIFA World Cup, while also leading France to the final of UEFA Euro 2016, which they lost to Portugal. He scored his first international goal in a friendly match against Scotland in 2016, and amassed fifty-one appearances for the national side. He retired from international football in 2018.\n\nClub career\n\nEarly career\n\nKoscielny was born in Tulle, Corrèze. He began his career at Guingamp in 2004, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division's best XI at the end of the season.\n\nLorient\n\nOn 16 June 2009, newly promoted Ligue 1 side FC Lorient signed Koscielny on a four-year contract for around €1.7 million. He established himself as a starter and played in his preferred centre-back position. Over one season at the club, he scored 3 goals in 35 appearances. On 7 March 2010 Koscielny tapped in his first Ligue 1 goal against Olympique Marseille at Stade Vélodrome in the 65th minute in a 1–1 draw. Koscielny became a fan favourite when he scored his second goal with a header deep in injury time against Montpellier in a 2–2 draw after a cross from Olivier Monterrubio.\n\nHe scored another against Bordeaux after 11 minutes. However, he received a red card 15 minutes later for a foul in the penalty area against his future Arsenal teammate Marouane Chamakh. Koscielny helped Lorient to finish the campaign in 7th place; its best finish in Ligue 1. An impressive season culminated in reports from French daily Ouest-France that the defender was training with the Arsenal reserves ahead of an official announcement. On 6 July 2010, Koscielny agreed personal terms with Arsenal. Arsenal's initial offer for Koscielny was believed to be in the region of £4 million, while they were then prepared to do a deal that would also involve youngster Francis Coquelin moving on loan in the opposite direction, which Lorient rejected. During the summer transfer window of 2010 reports began to emerge in late June that a deal had been reached to bring Koscielny to Arsenal for a reported sum of £8.45 million.\n\nArsenal\n\n2010–11 season\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs. Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off. He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James' Park. Koscielny was given a straight red card in Arsenal's 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny's performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was \"impressive\" and \"magnificent throughout\". On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.\n\n2011–12 season\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal's biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal's 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team's fourth most important player by the fans in Arsenal's Player of the Season poll for his performances throughout the 2011–12 season.\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal. His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1. On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James' Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.\n\nKoscielny was voted as Arsenal's second best player of the season.\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal's 3–1 Premier League opening day defeat at home to Aston Villa. However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland. In the team's penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.\n\nOn 17 May, Koscielny scored Arsenal's equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.\n\n2014–15 season\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal's first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium. After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks. On 29 November, he returned to Arsenal's starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns. In the team's following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City. On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium. On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1. On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium, due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea. With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane. He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running. Koscielny scored his fourth of the season in a 3–3 draw with West Ham.\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal's highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday. Koscielny was involved in a controversial incident at the end of Arsenal's 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny's arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny. On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal. Two days later, he made his 200th appearance for Arsenal in the Premier League on a 4–0 away victory against Swansea City.\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss the FA Cup final.\n\nAlthough he was absent from the FA Cup final, Koscielny lifted the trophy alongside Per Mertesacker.\n\n2017–18 season\n\nOn 3 May 2018, Koscielny suffered an Achilles injury during the UEFA Europa League semi-final second leg match against Atlético Madrid, and was ruled out for at least six months.\n\n2018–19 season\n\nFollowing the retirement of Per Mertesacker, Koscielny was made the captain of Arsenal. He made his first appearance of the season against Southampton in a 3–2 defeat. Koscielny played what proved to be his last game for Arsenal, as captain, in a 4–1 defeat to Chelsea, in the 2019 UEFA Europa League Final.\n\n2019–20 season\n\nOn 11 July 2019 it was reported that, with a year left on his contract, he refused to take part in the Arsenal pre-season tour of the United States and decided to stay in the UK in order to force a move to Bordeaux.\n\nBordeaux\n\nOn 6 August 2019, Koscielny signed for French Ligue 1 club Bordeaux, in a deal rumored to be worth £4,600,000, after nine years with Arsenal.\n\nIn January 2022, Koscielny was removed from Bordeaux's first team after he was told his €3 million salary was too high. On 31 January 2022, Bordeaux officially moved him into a non-playing role for Koscielny to \"contribute to the development of the club's international partnerships\". On 26 March 2022, Koscielny announced his retirement from football.\n\nInternational career\n\nKoscielny was called up to the French national team on 3 February 2011. Before his call up for France, Koscielny was also eligible to play for Poland and initially considered applying for Polish citizenship. In August 2010, it was reported that he had not submitted an application and cancelled a meeting with Poland national team coach Franciszek Smuda in Warsaw on 7 August. Koscielny later declared that his priority was to play for France.\n\nKoscielny was called up to the French team for the first time on 3 February 2011, for the team's friendly versus Brazil on 9 February. Koscielny, along with future Arsenal teammate Olivier Giroud, made their first appearances for les Bleus in a friendly match against the United States on 11 November, with Koscielny playing the entire match in a 1–0 win and Giroud coming on as a substitute.\n\nHe made his first appearance in a major tournament during UEFA Euro 2012, when he played the entire match in a 2–0 defeat to Spain in the quarter-finals but was voted Man of the Match by the French media. On 15 November 2013, he was sent off in a 2014 World Cup qualifying play-off against Ukraine.\n\nOn 13 May 2014, Koscielny was named in Didier Deschamps' squad for the 2014 FIFA World Cup. He made his FIFA World Cup debut as a substitute for the injured Mamadou Sakho in a 5–2 defeat of Switzerland in the team's second group match. He was then named in the starting line-up for the next match against Ecuador, helping the team to a clean sheet in a 0–0 draw.\n\nKoscielny was named in the squad for the UEFA Euro 2016 and started in all the matches of France's runners-up campaign. On 4 June 2016, he scored his first international goal in a friendly match against Scotland.\n\nPrior to the 2018 FIFA World Cup, Koscielny announced that he would retire from international football after the competition. However, he was not included in the squad after an Achilles tendon injury ruled him out of contention.\n\nPersonal life\n\nHis grandfather and his great-grandfather were Polish miners who worked in northern France. He has a brother who is 10 years older than him and played in the amateur leagues and now trains at FC Argentat. His father also played in the fourth division of French football for many clubs before becoming a manager. He is married to his long time girlfriend Claire Beaudouin.\n\nCareer statistics\n\nClub\n\nAs of match played 22 December 2021\n\nInternational\n\nScores and results list France's goal tally first, score column indicates score after each Koscielny goal.\n\nHonours\n\nArsenal\n\nFA Cup: 2013–14, 2014–15, 2016–17\n\nFA Community Shield: 2014, 2015\n\nFootball League Cup/EFL Cup runner-up: 2010–11, 2017–18\n\nUEFA Europa League runner-up: 2018–19\n\nIndividual\n\nLigue 2 Team of the Year: 2008–09\n\nUEFA Europa League Squad of the Season: 2018–19\n\nReferences"}, {"url": "https://medium.com/@gentie/history-of-laurent-koscielny-5047b6fe8a03", "page_content": "History Of Laurent Koscielny gentie · Follow · Feb 13, 2018 10 min read -- Listen Share\n\nLaurent Koscielny (French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French professional footballer who plays as a centre back for English club Arsenal and the France national team. He is vice-captain of Arsenal.\n\nBorn in Tulle, Koscielny began his football career playing for a host of youth clubs before moving to Guingamp in 2003, where he quickly progressed through the youth ranks, making his professional debut the following season. After becoming frustrated at being played out of position as a right back, he joined Tours for an undisclosed fee, quickly establishing himself as the team’s star player in his desired position, ultimately aiding in the club’s promotion into Ligue 1, while also being named in the Ligue 2 Team of the Season.[3] Koscielny continued his impressive performances following a €1.7 million transfer to fellow French outfit Lorient in 2009, receiving multiple plaudits for his performances, largely cultivating a reputation as a clever, agile, ball-playing defender.[3] His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\nFollowing his arrival to England, Koscielny has widely been regarded to be one of the best players in his position, as well as one of the best in the world.[4][5] He has since established himself as a core component in the Arsenal first team, as well as contributing with a host of individual performances, including aiding in ending the club’s nine-year trophy drought, scoring a crucial equalizer en route to winning the FA Cup in 2014. He was also crucial in further club successes that followed, winning another two FA Cups and the FA Community Shield on three occasions.\n\nDespite having the ability to represent Poland, Koscielny instead decided to represent France, and first appeared up for the national team against Brazil in February 2011.[6] Koscielny has since become a regular starter for the nation in every major tournament that they have appeared in, including UEFA Euro 2012 and the 2014 FIFA World Cup, while also leading France to the final of UEFA Euro 2016. He scored his first international goal in a friendly match against Scotland in 2016,[7] and has since amassed forty-nine appearances for the national side.\n\nPrior to the beginning of the 2018 FIFA World Cup, Koscielny announced that he would be retiring from international football after the competition, and thus no longer be playing for France.\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.[citation needed]\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division’s best XI at the end of the season.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club’s number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs.[10] Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off.[11] He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.[12]\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James’ Park. Koscielny was given a straight red card in Arsenal’s 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny’s performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was “impressive” and “magnificent throughout”.[13] On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.[14]\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal’s biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal’s 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team’s fourth most important player by the fans in Arsenal’s Player of the Season poll for his performances throughout the 2011–12 season.[15]\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal.[16][17][18] His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1.[19] On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.[20]\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.[21]\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James’ Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.[22]\n\nKoscielny was voted as Arsenal’s second best player of the season.[23]\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal’s 3–1 Premier League opening day defeat at home to Aston Villa.[24] However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.[25]\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland.[26] In the team’s penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.[26]\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.[27]\n\nOn 17 May, Koscielny scored Arsenal’s equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.[28]\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal’s first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium.[29] After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks.[30] On 29 November, he returned to Arsenal’s starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns.[31] In the team’s following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.[32]\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City.[33] On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium.[34] On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1.[35] On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.[36]\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium,[37] due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea.[38][39] With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane.[40] He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running.[41] Koscielny scored his fourth of the season in a 3–3 draw with West Ham.[42]\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal’s highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday.[43] Koscielny was involved in a controversial incident at the end of Arsenal’s 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny’s arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny.[44][45][46] On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal.[47] Two days later, he made his 200th appearance for Arsenal in the Premier League on a 4–0 away victory against Swansea City.[48][49]\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.[50]\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker.\n\nKoscielny was called up to the French national team on 3 February 2011. Before his call up for France, Koscielny was also eligible to play for Poland and initially considered applying for Polish citizenship.[6] In August 2010, it was reported that he had not submitted an application and cancelled a meeting with Poland national team coach Franciszek Smuda in Warsaw on 7 August. Koscielny later declared that his priority was to play for France.[53]\n\nKoscielny was called up to the French team for the first time on 3 February 2011, for the team’s friendly versus Brazil on 9 February.[54][55] Koscielny made his first appearance for les Bleus in a friendly match against the United States on 11 November, playing the entire match in a 1–0 win.\n\nHe made his first appearance in a major tournament during UEFA Euro 2012, when he played the entire match in a 2–0 defeat to Spain in the quarter-finals but was voted Man of the Match by the French media. On 15 November 2013, he was sent off in a 2014 World Cup qualifying play-off against Ukraine.\n\nOn 13 May 2014, Koscielny was named in Didier Deschamps’ squad for the 2014 FIFA World Cup.[56] He made his FIFA World Cup debut as a substitute for the injured Mamadou Sakho in a 5–2 defeat of Switzerland in the team’s second group match.[57] He was then named in the starting line-up for the next match against Ecuador, helping the team to a clean sheet in a 0–0 draw.[58] On 4 June 2016, Koscielny scored his first international goal in a friendly match against Scotland."}, {"url": "https://www.thefamousbirthdays.com/people/laurent-koscielny", "page_content": "About Laurent Koscielny\n\nFrench professional football center back Laurent Koscielny started his senior career with Guingamp in 2004. After three years, he joined Tours and from there, moved to Lorient in 2009. In 2010, he was signed by Arsenal, ushering him into a career in the English Premier League which would last for nine years. He returned to France in 2019, following a deal with Bordeaux of Ligue 1. As a French international, he played for the national team from 2011 to 2018.\n\nFamily Life\n\nHe is of Polish descent. He has an older brother who played amateur football. He has been married to Claire Beaudouin. They have two children.\n\nAchievements\n\nAs a member of Arsenal, he won three FA Cup and two FA Community Shield titles.\n\nTrivia\n\nDue to his heritage, he was eligible to play for Poland’s national team but he went with France instead."}, {"url": "https://www.teamtalk.com/tag/laurent-koscielny", "page_content": "Laurent Koscielny plays for Arsenal in the Premier League and has been with the Gunners since 2010.\n\nUnder this tag will be every piece of news relating to Laurent Koscielny. That includes everything from a man of the match performance to any injuries. As well as that, we will have contract news and any transfer talk about the man himself right here.\n\nKoscielny began his career with Guingamp in Ligue 2, where he spent three seasons. He then moved to Tours, with whom he got promoted from the National Ligue to Ligue 2.\n\nLorient signed the defender in 2009, before Arsenal then brought him to England for the start of the 2010-11 season. In his eight years with the Gunners, he has amassed over 300 appearances and won the FA Cup on two occasions.\n\nKoscielny made his international debut in 2011, and has gone on to play over 50 times for France."}, {"url": "https://metro.co.uk/2019/08/06/arsenal-release-brief-statement-confirming-laurent-koscielny-departure-10528423/", "page_content": "Laurent Koscielny went on strike to force through a move from Arsenal (Picture: Getty)\n\nArsenal have released a brief statement confirming club captain Laurent Koscielny is set to join Bordeaux.\n\n‘The centre back has made 353 appearances for us since signing from Lorient in 2010. He was part of our Emirates FA Cup-winning squads in 2014, 2015 and 2017,’ the statement read.\n\n‘Laurent, who started his career in the French second division at Guingamp in 2004, has played 51 matches for France and was entering the final year of his current contract with us.\n\n‘We decided to sanction his move to Bordeaux once we agreed acceptable transfer terms.\n\nLaurent Koscielny refused to take part in Arsenal’s pre-seaosn tour of America (Picture: Getty)\n\n‘We thank Laurent for his contribution to the club and wish him all the best for the future. The transfer is subject to the completion of regulatory processes.’\n\nThe 33-year-old had been desperate to return to Fracne having reportedly been unhappy at how his workload had been handled following his return from a serious Achilles injury, while he was also said to be concerned at the direction in which the club was headed.\n\nArsenal were unwilling, however, to let Koscielny leave without receiving a fee and it is believed they will now earn €5m from Bordeaux.\n\nKoscielny refused to travel with the rest of the first team squad for the recent pre-season tour of America and was subsequently forced to train with the youth team.\n\nUnai Emery offered the experienced defender and olive branch and was prepared to welcome him back into the first team fold, but the offer was rejected with the player determined to return to his homeland."}, {"url": "https://www.arsenal.com/news/koscielny-to-join-bordeaux", "page_content": "Laurent Koscielny is leaving us to join Ligue 1 side Bordeaux.\n\nThe centre back has made 353 appearances for us since signing from Lorient in 2010. He was part of our Emirates FA Cup-winning squads in 2014, 2015 and 2017.\n\n\n\nLaurent, who started his career in the French second division at Guingamp in 2004, has played 51 matches for France and was entering the final year of his current contract with us. We decided to sanction his move to Bordeaux once we agreed acceptable transfer terms.\n\n\n\nWe thank Laurent for his contribution to the club and wish him all the best for the future.\n\n\n\nThe transfer is subject to the completion of regulatory processes."}], "Laurent Koscielny spent three seasons at Guingamp.": [{"url": "https://www.mlssoccer.com/players/laurent-koscielny/", "page_content": "CURRENT CLUB: Arsenal (England)\n\nLaurent Koscielny is one of the best centerbacks in the Premier League when it comes to his passing abilities. He made his debut with the French national team in February 2011.\n\nFRENCH NATIONAL TEAM\n\nKoscielny has registered over 15 caps with Les Bleus since making his international debut in 2011.\n\nCLUB CAREER\n\nKoscielny played for Guingamp, Tours, and Lorient in France before signing with Arsenal in 2010. He has made at least 25 appearances in each of the last four Premier League seasons."}, {"url": "https://www.teamtalk.com/laurent-koscielny", "page_content": "Laurent Koscielny plays for Arsenal in the Premier League and has been with the Gunners since 2010.\n\nUnder this tag will be every piece of news relating to Laurent Koscielny. That includes everything from a man of the match performance to any injuries. As well as that, we will have contract news and any transfer talk about the man himself right here.\n\nKoscielny began his career with Guingamp in Ligue 2, where he spent three seasons. He then moved to Tours, with whom he got promoted from the National Ligue to Ligue 2.\n\nLorient signed the defender in 2009, before Arsenal then brought him to England for the start of the 2010-11 season. In his eight years with the Gunners, he has amassed over 300 appearances and won the FA Cup on two occasions.\n\nKoscielny made his international debut in 2011, and has gone on to play over 50 times for France."}, {"url": "https://sportmob.com/en/article/975741-Top-Facts-About-Laurent-Koscielny-One-of-The-Best-Defenders", "page_content": "Laurent Koscielny plays as a centre back and he is product of Guingamp youth system. Then he quickly made his way through the ranks to the acme. Over the years he worked hard and managed to make a name for himself as one of the greatest footballers playing in the position of a defender. We will walk you through all the details about Laurent Koscielny transfer market stats.\n\nAside from the details of his career in football and his road to fame, we will fill you in with the details about\n\nLaurent Koscielny personal life.\n\nThe footballer is a married man. Laurent Koscielny wife supports him in every up and down. She gave birth to Laurent Koscielny children and together they have a great life."}, {"url": "https://www.sportskeeda.com/player/laurent-koscielny", "page_content": "Laurent Koscielny: A Brief Biography\n\nLaurent Koscielny is a professional footballer from France. He was born on the 10th of September, 1985 in Tulle. Koscielny is a center back who is currently the vice-captain of the English Premier League team Arsenal.\n\n\n\n\n\nBackground\n\n\n\n\n\nThe Frenchman began his career with Guingamp in 2004 which has produced players like Didier Drogba and Florent Malouda. Koscielny played as a fullback for Guingamp in most of the matches.However, he felt that center back was his forte and this made him join Tours FC to take a chance at center back.\n\n\n\n\n\nIn his debut season with Tours FC in 2007, Koscielny showed remarkable progress and played a major role in his team’s promotion to Ligue 1. He was also named in the best XI of the season.\n\n\n\n\n\nThe center back continued his good form with Lorient FC in 2009 where he was regarded as one of the best players in his position. He was developing reputation as a clever and an agile defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\n\n\n\n\nDebut\n\n\n\n\n\nLaurent Koscielny had the opportunity to represent Poland but decided to ply his trade with France. He made his first appearance for France on the 9th of February, 2011 in a friendly match against United States. Koscielny played the entire game and his side sealed a 1-0 victory. On the 4th of June, 2016, Koscielny scored his first international goal in a friendly match against Scotland.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nKoscielny had a great debut season with Arsenal. He was constantly making great tackles and preventing the opposition from penetrating their back line. In 2011, Koscielny had one of his best performances till date that saw Arsenal beat Barcelona 2-1 in the round of 16 Champions League tie.\n\n\n\n\n\nThe Frenchman was a great asset to the team as apart from acting as a defender, he had a great goal scoring ability. Till date, Koscielny has scored 24 goals for Arsenal. He is the highest scoring defender for Arsenal in the history of EPL. He is regarded as one of the most important players for Arsenal in the past seven years.\n\n\n\n\n\nKoscielny has won the FA Cup with Arsenal in 2014, 2015 and 2017. He has also won the FA Community Shield in 2014, 2015 and 2017. The center back has made a major contribution in his team’s success in the FA Cup over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nKoscielny has got more than thirty yellow cards and as many as five red cards. This has forced him out of a few crucial encounters and has affected the team’s performance. He has missed more games due to suspension and not because of injury.\n\n\n\n\n\nThe center back must work on preventing harsh tackles so as to represent Arsenal in more and more games and increase their chances of winning more trophies.\n\n\n\n\n\nThe Frenchman is yet to win the Premier League with Arsenal. Although he has won six titles at Arsenal, the coveted Premier League title has eluded him."}, {"url": "https://frenchfootballweekly.com/2012/04/17/laurent-koscienly-arsenals-french-rock/", "page_content": "by Tom Varney\n\nIt’s been a remarkable journey for Laurent Koscielny, from the Stade de la Valleé du Cher in Tours which holds 13,500 to the brand new Emirates Stadium which is graced with four times the amount of fans week in week out. It was the July of 2010 when Arsenal announced the signing of Laurent Koscielny. A typical Arsene Wenger signing, a Frenchman at good value, a player that not many had had the pleasure of watching before and a stranger to most Arsenal fans. However to the Arsenal staff Koscielny was no stranger, Wenger had sent scouts to watch the Frenchman for at least two seasons before finally signing for the Gunners.\n\nKoscielny spent the 2007-2008 season in the Championnat National, the third tier of France with Guingamp, a club who had brought through the likes of Chelsea duo Didier Drogba and Florent Malouda. After only one season with Guingamp he joined Ligue 2 side Tours where his manager at the time, Daniel Sanchez was really impressed by him. “He reads the game well” Sanchez mentioned in a interview with The Independent. “He has a tactical quality, the quality reading of the game, but also great physical quality.”\n\nAfter establishing himself as a starter alongside Thomas Vermaelen I’m sure the majority of Arsenal fans would agree with the points Sanchez made. The Tours Coach had tipped off the Arsenal manager on his quality and Arsene’s scouts made various trips to watch him during his second season with Tours but a move to Arsenal from Ligue 2 would have possibly too much too soon for Laurent, both Sanchez and Wenger were in agreement that he needed another step before the move to the Gunners.\n\nIn the June of 2009 Koscielny made the move to Lorient, club chairman Loïc Féry revealed that Koscielny was a player that his club had been following for sometime and it’s fair to say that the step up to Ligue 1 was no problem for the quiet centre half. In his debut away to Lille his new side took all three points and then in his second game, his first game at Lorient’s Stade du Moutsoir he headed home the equalising goal as his side came back from two nil down against Montpellier.\n\nAfter 40 appearances in Ligue 1, helping Lorient to a impressive seventh place finish it was time for Koscielny to move to Arsenal, with Philippe Senderos, William Gallas, Mickael Silvestre and Sol Campbell all leaving the club he had a chance to fit straight in the side. Upon signing for The Gunners Wenger said “Koscielny is a central defender with great ability who performed extremely well last season for Lorient. We identified him as a very strong centre-half, who has made big progress very quickly. He has shown he is mentally strong, he’s a fighter and a very strong competitor. Koscielny is a great addition to our squad.”\n\nHis first season for Arsenal was one of many ups and downs. The Carling Cup final will live long in his memory, that moment where he and Wojciech Szczesny got caught up in their own box and between them they effectively handed Birmingham City the trophy on a silver platter. You can imagine how the fans reacted to his moment of indecision that proved to be a valuable lesson in the way he’s grown into a footballer this year.\n\nEven at the start of this year he was part of the terrible 8-2 loss at Old Trafford and he then scored an own goal at Ewood Park against a Blackburn side that are faced with a relegation battle. Since those mistakes he’s had a run in the team and Koscielny has been a perfect illustration of the recent Arsenal revival. It’s safe to say that he has become one of the fans favourite at the Emirates, when you’re there on a match day you see the fans with ‘Bosscielny’ and his number 6 on their backs and during that match you’ll hear that famous ‘I wanna dance with Koscielny’ taken from the Whitney Houston classic.\n\nThe Frenchman has brought a new side to the Arsenal defence this calendar year, impressive pace, reading the game well, excellent aerial ability and my favourite, that commanding way he wins the ball and carries it out of the defence. His greatest moment as an Arsenal player so far must be when he won the ball off of Lionel Messi and bought the ball out to start the attack that lead to Andrey Arshavin’s winning goal. What a night at the Emirates that turned out to be.\n\nAfter a steady start for Arsenal it seems ever since that evening against Barcelona, Koscielny has been steadily growing into one of the best defenders in the Premier League and on his day one of the best in Europe. First called up for France in February 2011 and with the Euro 2012 Championships just around the corner I feel Laurent’s competitive edge could give the French defence something different for their tournament, I for one we hope to see him in the starting line up on June 11th when Les Bleus open up against England in Donetsk."}, {"url": "https://www.independent.co.uk/sport/football/international/france-vs-iceland-late-bloomer-laurent-koscielny-blossoming-at-the-right-time-for-les-bleus-a7115781.html", "page_content": "Sign up to Miguel Delaney’s Reading the Game newsletter sent straight to your inbox for free Sign up to Miguel’s Delaney’s free weekly newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nFootball email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThey have made accordions at the Maugein factory in Tulle since 1919, but just over two years ago the company went into receivership. A century of expertise and heritage were coming to an end, as well as almost 20 jobs.\n\nThe owners needed a saviour. They could have gone to President Francois Hollande, former mayor of Tulle, but instead they went to their most famous son, making what a company official described as “appeal to his sense of local pride”.\n\nLaurent Koscielny is a proud Correzien and was quickly persuaded, and led a group of local investors who put €600,000 in, saving the factory and most of the jobs. Koscielny is now seen as a local saviour, but he never wanted the news to become public. “Ca c’est Laurent”, as one friend puts it.\n\nRecommended Read more Everything you need to know about France v Iceland\n\nBut then Koscielny is a man whose profile has still not quite caught up to his status. He has been the best centre-back in England for the last few years, with Vincent Kompany diminished by injuries. He will be playing a European Championship quarter-final tomorrow and has been one of the best defenders at this tournament too. He is two wins away from the biggest night of his life, in Paris next Sunday.\n\nWhen he returns to Arsenal next month he is favourite to be captain. And yet despite all this he remains barely known, private, discrete. He rarely gives interviews. His social media profile does not extend much further than retweeting photographs of his team-mates with captions like “CE SOIR” or “YES”. In the age of the wholly exposed celebrity footballer, his decision to guard some privacy is counter-cultural.\n\nKoscielny is different. He was not picked out young as a future star, did not attend one of France’s prestigious centres de formation, was never told in his youth that he was heading for the top. He did not play a top flight game until 23, did not make his European or international debut until 25. Having been fortunate enough to grow up out of the limelight, he has little enthusiasm to step into it now. He would rather just get home to his young family.\n\nThis is the result of following a very different path from many of his France team-mates. French football still produces talented teenagers but many of them leave France before ever playing senior football here. So it was for Antoine Griezmann and Paul Pogba, who never played a Ligue 1 match and have no intention of doing so any time soon. Kingsley Coman played three times for Paris Saint Germain before heading for Juventus.\n\nKoscielny has been one of the tournament's stand-out defenders (Getty)\n\nIf Ligue 1 looked parochial to some of these talented youngsters, it might have looked unreachable to a teenage Koscielny. He spent the first few years of his career in the French lower leagues, first at Guingamp, then at Tours, a very long way away from the Premier League, the Champions League or Euro 2016.\n\nIt certainly must have felt that way for Koscielny as a skinny teenage boy, as interested in computers as in football, growing up in Tulle in central France. He was not picked up by any major academy but played for the local non-league club Limoges. He thought about becoming a coach or a PE teacher, but spent too much time playing football and could not complete his Baccalaureate.\n\nLimoges were a small club going through a difficult time but they still entered teams into the Coupe Gambardella, France’s knock-out competition for under-19 teams. In 2003 they had a good run and reached the quarter-finals where they were beaten 3-1 by a powerful Lyon side. But the 17-year-old in defence for Limoges caught the eye of the watching scouts. Yvon Schmitt, there working for Guingamp, later recalled how he was “immediately seduced” by the teenage Koscielny, with his intuitive reading of the game and his assertive interceptions.\n\nSchmitt spoke to Koscielny’s parents Bernard and Viviane hoping to get their son to sign. But Lens wanted him too, showing the family around their brand-new La Gaillette academy, the place that produced Adel Taarabt and Raphael Varane. Koscielny felt more comfortable at Guingamp, who were then fighting to stay in Ligue 1, and signed for them.\n\nIt was only after Guingamp had been relegated that Koscielny made his senior debut for them in November 2004. This was the French second tier, not an easy place for a young defender to learn the game, and he found it tough. There were other bigger more experienced centre-backs and so Koscielny found himself playing at right-back, not a role he especially enjoyed.\n\nI wanted to be happy and to play my natural game <p>Laurent Koscielny</p>\n\nAfter four years at Guingamp the 21-year-old Koscielny decided that he had had enough. Even for a player with so little experience, he had a fully formed sense of how he wanted to play: as a centre-back for a proactive team, making the most of his reading of play. So he joined third-tier team Tours, managed by Daniel Sánchez, who wanted to build his team around him.\n\n“I wanted to be happy,” Koscielny later explained, “and to play my natural game.” Sánchez liked Koscielny and tried to iron the rashness out of his play, telling him over and over again that ‘a defender on the ground can’t do any defending.’ Koscielny inspired Tours to promotion, and in his second season he was back in Ligue 2, not as an occasional right-back but as the best centre-back in the division.\n\nChristophe Le Roux had played with Koscielny at Guingamp a few years before but by 2008 he was working for Lorient, another Breton side, as director of football. He knew Koscielny was talented and was delighted to see him finding his voice at Tours, even in front of 7,000 fans each week.\n\n“At Lorient we have traditionally been very attentive to the Ligue 2 market,” Le Roux remembers. “I knew Laurent very well, as a player and as a man. I just had to convince the manager and the club that we had to buy him, that his potential interested us.” That was easy enough to do that when, in January 2009, Lorient drew Tours in the Coupe de France. “He confirmed everything that I had said about him,” Le Roux says, “he was a true defender.”\n\nLorient were convinced and their offer of €1.5million was more than enough to persuade Tours to sell. Koscielny had a choice, with offers on the table that summer from Sochaux and Nantes. But he had flourished since deciding to move to Tours for footballistique reasons and was determined to follow the same path this time. Lorient played attractive football under manager Christian Gourcuff, so Koscielny chose them.\n\nCompared to the young player I saw at Guingamp he was a different man... <p>Christophe Le Roux</p>\n\nAdaptation was easy, and Koscielny fitted into a side that played attractive football high up the pitch. “Compared to the young player I saw at Guingamp he was a different man,” Le Roux says. “He had much more certainty in his life and in his game. He had a huge maturity to his game and never went to ground.” Koscielny excelled on debut, an away win at Lille, and scored an added-time equaliser in his second game, Montpellier at home. By the end of the season Lorient had finished seventh, the best in their history, as well as reaching the semi-finals of the Coupe de France.\n\nThere are few secrets in Ligue 1 and scouts soon knew about the player Lorient had on their hands. Gilles Grimandi, Arsenal’s man in France, was a regular at the Stade Moustoir and saw a player who could adjust to the pace of English football. Wenger had himself been tipped off by old friend Daniel Sanchez, and with the data showing how many of his individual duels Koscielny won, Wenger was convinced.\n\nArsenal had been looking for new young aggressive centre-backs, having signed Thomas Vermaelen from Ajax the previous summer. So he in June 2010 he called Lorient, a club he knew well through his friendship with Christian Gourcuff. They eventually accepted £10m. Koscielny could have gone anywhere he wanted in France that summer, with Marseille, Lyon and Paris Saint Germain all keen, but decided to come to England.\n\nIn one sense it was a giant leap to go from a mid-table French side to a team who had just finished third in the Premier League, who still had Robin van Persie and Cesc Fabregas in the side. Especially given how recently Koscielny had been playing second and third tier football in France.\n\nBut in another sense it was perfectly natural. Lorient and Arsenal are clubs built on similar football philosophies, which is why Wenger was so keen to loan them Francis Coquelin, Joel Campbell and Gilles Sunu. Koscielny has always wanted to play for possession teams, for ambitious managers, defending on the front foot rather than sitting deep and digging in. That is why he chose to play under Sánchez and Gourcuff and why he chose to leave France to play for Arsene Wenger. “He made wise choices at the right moments,” says Le Roux.\n\nKoscielny needed some time to attune his assertive style to the English tempo. He was sent off twice in his first seven Premier League games. But even by the end of his first season he was clearly the best defender at the club, and since then has only got better. Wenger sees him as his best value buy for the last 10 years.\n\nThe player himself is delighted to play for a team and manager in tune with how he sees the game. “I take more pleasure to play in a team which has the ball, rather than playing deep,” he told L’Equipe last month. “I prefer to win the ball as high up and and as quickly as possible.”\n\nThat is how Koscielny defends, and there are few better than him in Europe at playing this way. He has not won as many plaudits or as many titles as he might have that, but all that could change this week."}, {"url": "https://talksport.com/football/1072837/laurent-koscielny-retires-bordeux-racism-accusation-arsenal/", "page_content": "Laurent Koscielny has called time on his playing career aged 36, hanging up his boots amid accusations of racism by Bordeaux's ultras - which he strongly denies.\n\nThe former Arsenal captain has been a free agent for two months after leaving Bordeaux in January, and has released a statement saying the allegations of racism have left him 'shocked'.\n\n3 The 36-year-old left the French side in January having spent two-and-a-half seasons at the club Credit: Getty\n\nIn a career that lasted nearly 18 years, Koscielny's finale ended on a slightly sour note and being frozen out of the team towards the end of his spell at Bordeaux.\n\nThe best part of his career was spent at the Emirates Stadium where he made 353 appearances that spanned nine seasons.\n\nHe also helped the club secure three FA Cups and as many Community Shields.\n\nHis departure from Arsenal also ended on a sad note after refusing to join the club on a pre-season tour to the US.\n\nNow he is refuting claims after French publication Sud Ouest reported that he and teammate Benoit Costil are being accused by the club's ultras, UB87, of a lack of leadership and of 'scandalous, sometimes racist' behaviour.\n\nA statement read: \"Following the article published in the Sud Ouest newspaper on March 22, 2022 entitled 'Girondins de Bordeaux. Costil and Koscielny, accusations of racism that shake', Laurent Koscielny was surprised, shocked but also saddened by the remarks made by one of the representatives of the Ultramarines 87 Group against him, which the press is now echoing.\n\n3 Koscielny's best season arguably came in 2015/16 where he kept 15 clean sheets in 33 league games\n\n\"Without there being any ambiguity, he strongly disputes these accusations which have seriously [damage] him and which have repercussions on his family and those around him.\n\n\"In this regard, Laurent Koscielny underlines that the investigative work of the Sud Ouest newspaper which solicited more than thirty people [according to the journalist's statements] who formally denied the alleged racist behaviour of Laurent Koscielny.\n\n\"As a reminder, if Laurent Koscielny has not been part of the professional staff of the club since the end of January 2022, he recalls that he is still an employee of the Girondins de Bordeaux.\n\n\"On this point, Laurent Koscielny intends to specify that he has decided to hang up his [boots] when he would have preferred to help the club on the [pitch].\n\n\"Aware that the club was in difficulty, he accepted the proposal made to occupy a new [role] and to release [his] salary [as] proof of the concern he has for the best interests of the club.\n\n3 Koscielny was blasted for his 'disgusting' and 'disrespectful' Bordeaux reveal video in which he took off an Arsenal shirt Credit: @girondins on Twitter\n\n\"As such, he would like to thank the club for the mark of confidence shown in him by entrusting him with this position.\n\n\"This mission is the extension of a career that has commanded the respect of all of his partners, coaches and staff that he has worked with both in the club and in the France team.\n\n\"Laurent Koscielny also shares the club's position, which recalled in its press release that 'no document aimed at supporting these allegations has been brought to the attention of the Club, which in principle intends to exercise the greatest caution'.\"\n\nKoscielny left Arsenal under a cloud in 2019 after refusing to travel with the rest of the team to the club's pre-season tour of the United States, in order to force a move to France.\n\nArsenal said in a statement at the time they were 'very disappointed' with the former captain's behaviour after 'going against our clear instructions'."}, {"url": "https://metro.co.uk/2020/12/15/ex-arsenal-captain-laurent-koscielny-urged-olivier-giroud-to-leave-chelsea-13755612/", "page_content": "Olivier Giroud has been in excellent form for Chelsea in recent weeks (BPI/REX)\n\nFormer Arsenal captain Laurent Koscielny has revealed that he encouraged Olivier Giroud to leave Chelsea in the summer.\n\nThe pair played together for six seasons at Arsenal and helped the Gunners win three FA Cup trophies before Giroud left to join Chelsea in January 2018.\n\nThe 34-year-old striker was linked with a move away from Stamford Bridge having failed to secure a regular role under Frank Lampard.\n\nHowever, Giroud’s situation has now changed and the forward has been in excellent form in recent weeks with six goals in his last seven appearances.\n\nBut Koscielny, who left Arsenal under a cloud last year, admits he was keen for his former teammate to join him at Bordeaux.\n\n‘Yes, it’s true. I tried,’ Koscielny told France Football.\n\n‘Oliver didn’t come and I totally respect his choice.\n\nOlivier Giroud and Laurent Koscielny spent six seasons together at Arsenal (AFP via Getty)\n\n‘He still feels capable of playing at the highest level, in a club that plays the Champions League.\n\n‘He wants to continue to play for the France national team in the Euros and maybe even go to the 2022 World Cup. If he still feels capable of doing it, letting him enjoy it as much as possible.\n\n‘A career is short, I gave him all the arguments as to why I’m at Bordeaux, and he completely understood.\n\n‘He still wants to win and stay at the highest level.’\n\nFollow Metro Sport across our social channels, on Facebook, Twitter and Instagram.\n\nFor more stories like this, check our sport page."}, {"url": "https://www.walikali.com/laurent-koscielny/", "page_content": "Laurent Koscielny is a professional football player from France. He is a central defender who has played for various clubs throughout his career, including Arsenal and Bordeaux. In this article, we will discuss Laurent Koscielny’s wiki, career, age, wife, biography, net worth, and more.\n\nWiki\n\nLaurent Koscielny was born on September 10, 1985, in Tulle, France. He started his career at a young age playing for various local clubs. After impressing in his youth, Koscielny joined the French club Guingamp in 2003. He spent three seasons with the club, making 57 appearances and scoring two goals.\n\nCareer\n\nIn 2007, Koscielny signed for Tours FC, where he made a name for himself as a talented defender. He played for the club for two seasons, making 75 appearances and scoring six goals. In 2009, he signed for Lorient, where he continued to impress. He made 35 appearances for the club, scoring one goal.\n\nIn 2010, Koscielny signed for Arsenal, where he became a key player in the team’s defense. He made his debut for the club in August 2010 and went on to make over 300 appearances in all competitions. During his time at Arsenal, he won two FA Cups and two Community Shields. In 2019, Koscielny signed for Bordeaux, where he currently plays.\n\nAge\n\nLaurent Koscielny was born on September 10, 1985, which makes him 37 years old as of 2022.\n\nWife\n\nLaurent Koscielny is married to Claire Beaulieu. The couple got married in 2015 and has two children together.\n\nNet Worth\n\nLaurent Koscielny’s net worth is estimated to be around $15 million. His primary source of income is his professional football career.\n\nFAQs\n\nWhat position does Laurent Koscielny play?\n\nLaurent Koscielny is a central defender.\n\nWhat clubs has Laurent Koscielny played for?\n\nLaurent Koscielny has played for Guingamp, Tours FC, Lorient, Arsenal, and Bordeaux.\n\nHas Laurent Koscielny won any trophies?\n\nYes, Laurent Koscielny has won two FA Cups and two Community Shields with Arsenal.\n\nWhat is Laurent Koscielny’s net worth?\n\nLaurent Koscielny’s net worth is estimated to be around $15 million.\n\nIn conclusion, Laurent Koscielny is a highly skilled and experienced defender who has made a name for himself playing for various clubs throughout his career. His dedication and talent have earned him numerous accolades, and he continues to be a valuable asset to the teams he plays for. With his net worth growing steadily, it is clear that Laurent Koscielny is a football player worth keeping an eye on in the coming years."}, {"url": "https://www.the-sun.com/sport/football/premier-league/4982844/ex-arsenal-laurent-koscielny-retires-denies-racism-allegations-bordeaux/", "page_content": "FORMER Arsenal and Bordeaux captain Laurent Koscielny has announced his retirement from football and strongly denied \"shocking\" allegations of racism.\n\nKoscielny, 36, left the French club in January after he was frozen out.\n\n1 Koscielny has announced his retirement and also denied allegations of racism from Bordeaux's ultras Credit: GETTY\n\nAlongside team-mate Benoit Costil, the former France international was accused of a lack of leadership and \"scandalous, sometimes racist\" behaviour by Bordeaux's ultras - accusations Koscielny strongly denies.\n\nA statement read: \"Following the article published in the Sud Ouest newspaper on March 22, 2022 entitled 'Girondins de Bordeaux. Costil and Koscielny, accusations of racism that shake', Laurent Koscielny was surprised, shocked but also saddened by the remarks made by one of the representatives of the Ultramarines 87 Group against him, which the press is now echoing.\n\n\"Without there being any ambiguity, he strongly disputes these accusations which have seriously [damage] him and which have repercussions on his family and those around him.\n\n\"In this regard, Laurent Koscielny underlines that the investigative work of the Sud Ouest newspaper which solicited more than thirty people (according to the journalist's statements) who formally denied the alleged racist behaviour of Laurent Koscielny.\n\n\"As a reminder, if Laurent Koscielny has not been part of the professional staff of the club since the end of January 2022, he recalls that he is still an employee of the Girondins de Bordeaux.\n\n\"On this point, Laurent Koscielny intends to specify that he has decided to hang up his [boots] when he would have preferred to help the club on the [pitch].\n\n\"Aware that the club was in difficulty, he accepted the proposal made to occupy a new [role] and to release [his] salary [as] proof of the concern he has for the best interests of the club.\n\n\"As such, he would like to thank the club for the mark of confidence shown in him by entrusting him with this position.\n\n\"This mission is the extension of a career that has commanded the respect of all of his partners, coaches and staff that he has worked with both in the club and in the France team.\n\n\"Laurent Koscielny also shares the club's position, which recalled in its press release that 'no document aimed at supporting these allegations has been brought to the attention of the Club, which in principle intends to exercise the greatest caution.'\"\n\nKoscielny had a successful 18-year playing career.\n\nThe centre-back started in France with EA Guingamp before moving on to play for Tours and Lorient.\n\nWhilst at Lorient, Koscielny helped them to finish the campaign in 7th place and his consistent displays earned him a move to the Premier League to play for Arsenal.\n\nThe Frenchman went on to play the most games he has ever played for a single club, turning out for the Gunners on 353 occasions.\n\nBITTER ENDING\n\nKoscielny won three FA Cups during his time at the North London club and made 51 appearances for his country.\n\nHowever his nine year stint at the club ended under a cloud.\n\nHe refused to join the club's pre-season tour of the US after the club made it clear they weren't willing to sell him.\n\nEventually his hard line stance saw him get his way.\n\nBut he rubbed salt in the wounds with his announcement as a Bordeaux player seeing him star in a video in which he wore an Arsenal shirt, then took it off to show the colours of his new side underneath.\n\nGunners legend Ian Wright tweeted at the time: “This hurts. The level of disrespect. You should be ashamed for the way you’ve left the club after 9 years! Got what you wanted and still trying to have a dig. Hope it’s worth it in the long run.”"}], "Laurent Koscielny joined Tours in 2007.": [{"url": "https://www.sportskeeda.com/player/laurent-koscielny", "page_content": "Laurent Koscielny: A Brief Biography\n\nLaurent Koscielny is a professional footballer from France. He was born on the 10th of September, 1985 in Tulle. Koscielny is a center back who is currently the vice-captain of the English Premier League team Arsenal.\n\n\n\n\n\nBackground\n\n\n\n\n\nThe Frenchman began his career with Guingamp in 2004 which has produced players like Didier Drogba and Florent Malouda. Koscielny played as a fullback for Guingamp in most of the matches.However, he felt that center back was his forte and this made him join Tours FC to take a chance at center back.\n\n\n\n\n\nIn his debut season with Tours FC in 2007, Koscielny showed remarkable progress and played a major role in his team’s promotion to Ligue 1. He was also named in the best XI of the season.\n\n\n\n\n\nThe center back continued his good form with Lorient FC in 2009 where he was regarded as one of the best players in his position. He was developing reputation as a clever and an agile defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\n\n\n\n\nDebut\n\n\n\n\n\nLaurent Koscielny had the opportunity to represent Poland but decided to ply his trade with France. He made his first appearance for France on the 9th of February, 2011 in a friendly match against United States. Koscielny played the entire game and his side sealed a 1-0 victory. On the 4th of June, 2016, Koscielny scored his first international goal in a friendly match against Scotland.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nKoscielny had a great debut season with Arsenal. He was constantly making great tackles and preventing the opposition from penetrating their back line. In 2011, Koscielny had one of his best performances till date that saw Arsenal beat Barcelona 2-1 in the round of 16 Champions League tie.\n\n\n\n\n\nThe Frenchman was a great asset to the team as apart from acting as a defender, he had a great goal scoring ability. Till date, Koscielny has scored 24 goals for Arsenal. He is the highest scoring defender for Arsenal in the history of EPL. He is regarded as one of the most important players for Arsenal in the past seven years.\n\n\n\n\n\nKoscielny has won the FA Cup with Arsenal in 2014, 2015 and 2017. He has also won the FA Community Shield in 2014, 2015 and 2017. The center back has made a major contribution in his team’s success in the FA Cup over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nKoscielny has got more than thirty yellow cards and as many as five red cards. This has forced him out of a few crucial encounters and has affected the team’s performance. He has missed more games due to suspension and not because of injury.\n\n\n\n\n\nThe center back must work on preventing harsh tackles so as to represent Arsenal in more and more games and increase their chances of winning more trophies.\n\n\n\n\n\nThe Frenchman is yet to win the Premier League with Arsenal. Although he has won six titles at Arsenal, the coveted Premier League title has eluded him."}, {"url": "https://starswiki.net/laurent-koscielny/3113/", "page_content": "Considered as one of the best defenders in the world, Laurent Koscielny earned fame due to his inclusion in the club Arsenal. Although he now left it and joined Bordeaux, one the leading French club in Ligue 1 events. He was born on 10th September 1985 in Tulle, France and apart from ligue 1 and other event, he has represented France although he announced retirement from International football in 2018. Despite being able to play for Poland because of his grandparental roots, he selected France and he scored only a single goal in his entire international career.\n\nIn his earlier childhood, he commenced professional football for French football club EA Guinamp in 2008. Later in 2007-2008 season for Ligue 2 tournament, he moved to FC Tours and in 2009 he named himself into UNPF top eleven players of the league. His glorious run continued in season 2009-10 as he shifted to FC Lorient and signed four year deal in June 2009. After almost making 35 appearance out of 38 games, he got signed by Arsenal with amount of £8.45 million during Summer Transfer Window 2010. He played for Arsenal about 9 years and in August 2019, he was signed by Girondins De Bordeaux for £4.6 million.\n\nLaurent Koscielny Biography Real Name Laurent Koscielny Birth Date 10 September 1985 Age 33 Years Birth Place Tulle, France Debut February, 2011 Nationality French Profession Footballer Religion Christianity Sun sign Virgo Laurent Koscielny Height, Weight and Body Measurement Height in feet inches – 6’ 1” – in centimeters – 186 cm Weight in Kilograms – 75 kg – in Pounds – 165 lbs Chest Size 42 inches Waist Size 32 inches Biceps Size 14 inches Shoe Size 11 (US) Hair Color Black Eye Color Green Body Type Athletic Sexual Orientation Straight Qualification/Education School Not Known College Not Known Family Father Bernard Koscielny Mother Not Known Sister None Brother One Laurent Koscielny Affairs (Relationship Status) What is Laurent Koscielny marital status? (single, married, in relation or divorce) Married How many children does Laurent Koscielny have? (name) Two (Noah Koscielny (Son), Raina Koscielny (Daughter)) Is he having any relationship affair? No Is he gay? No Who is Laurent Koscielny wife? (name) Claire Koscielny Favorite Things Footballer Not Known Pet Dog Color Black Laurent Koscielny Salary Net Worth(Approx.) $ 12 million\n\nTrivia: Important Facts about Laurent Koscielny:"}, {"url": "https://www.liquisearch.com/laurent_koscielny", "page_content": "Laurent Koscielny (born 10 September 1985) is a French footballer who plays as a defender for Arsenal. He primarily plays as a centre back but he can also play as a right back, a position where he started his career. He is described as an aggressive, strong, quick and ball-playing defender.\n\nKoscielny was born in the city of Tulle and began his football career playing for a host of amateur and youth clubs such as Brive, Tulle Corrèze and Limoges. In 2001, he moved to the Brittany in northwestern France to play for professional club Guingamp.\n\nIn 2007, Koscielny joined Tours for an undisclosed fee to play in the third tier of the French league in 2007 and enjoyed promotion with his new side before being named in the Ligue 2 Team of the Season the following campaign. On 16 June 2009, newly promoted Ligue 1 side Lorient signed Koscielny on a four-year contract for around €1.7 million. He quickly established himself as a starter.\n\nHis performances caught the eye of Arsenal manager Arsène Wenger and Arsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt. Arsenal fans voted Laurent Koscielny as Arsène Wenger’s most effective signing of 2010–11 following an impressive debut campaign. Koscielny was called up to the French national team on 4 February 2011. Prior to his call up for France, Koscielny was also eligible to play for Poland, as a result of his family roots. In the 1–1 draw against Southampton on 1 January 2013, Koscielny made his hundredth appearance for Arsenal."}, {"url": "https://www.celeb-networth.com/laurent-koscielny", "page_content": "He scored another against Bordeaux after 11 minutes. However, he received a red card 15 minutes later for a foul in the penalty area against his future Arsenal teammate Marouane Chamakh. Koscielny helped Lorient to finish the campaign in 7th place; its best finish in Ligue 1. An impressive season culminated in reports from French daily Ouest-France that the defender was training with the Arsenal reserves ahead of an official announcement. On 6 July 2010, Koscielny agreed personal terms with Arsenal. Arsenal's initial offer for Koscielny was believed to be in the region of £4 million, while they were then prepared to do a deal that would also involve youngster Francis Coquelin moving on loan in the opposite direction, which Lorient rejected. During the summer transfer window of 2010 reports began to emerge in late June that a deal had been reached to bring Koscielny to Arsenal for a reported sum of £8.45 million.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs. Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off. He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James' Park. Koscielny was given a straight red card in Arsenal's 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season."}, {"url": "https://www.walikali.com/laurent-koscielny/", "page_content": "Laurent Koscielny is a professional football player from France. He is a central defender who has played for various clubs throughout his career, including Arsenal and Bordeaux. In this article, we will discuss Laurent Koscielny’s wiki, career, age, wife, biography, net worth, and more.\n\nWiki\n\nLaurent Koscielny was born on September 10, 1985, in Tulle, France. He started his career at a young age playing for various local clubs. After impressing in his youth, Koscielny joined the French club Guingamp in 2003. He spent three seasons with the club, making 57 appearances and scoring two goals.\n\nCareer\n\nIn 2007, Koscielny signed for Tours FC, where he made a name for himself as a talented defender. He played for the club for two seasons, making 75 appearances and scoring six goals. In 2009, he signed for Lorient, where he continued to impress. He made 35 appearances for the club, scoring one goal.\n\nIn 2010, Koscielny signed for Arsenal, where he became a key player in the team’s defense. He made his debut for the club in August 2010 and went on to make over 300 appearances in all competitions. During his time at Arsenal, he won two FA Cups and two Community Shields. In 2019, Koscielny signed for Bordeaux, where he currently plays.\n\nAge\n\nLaurent Koscielny was born on September 10, 1985, which makes him 37 years old as of 2022.\n\nWife\n\nLaurent Koscielny is married to Claire Beaulieu. The couple got married in 2015 and has two children together.\n\nNet Worth\n\nLaurent Koscielny’s net worth is estimated to be around $15 million. His primary source of income is his professional football career.\n\nFAQs\n\nWhat position does Laurent Koscielny play?\n\nLaurent Koscielny is a central defender.\n\nWhat clubs has Laurent Koscielny played for?\n\nLaurent Koscielny has played for Guingamp, Tours FC, Lorient, Arsenal, and Bordeaux.\n\nHas Laurent Koscielny won any trophies?\n\nYes, Laurent Koscielny has won two FA Cups and two Community Shields with Arsenal.\n\nWhat is Laurent Koscielny’s net worth?\n\nLaurent Koscielny’s net worth is estimated to be around $15 million.\n\nIn conclusion, Laurent Koscielny is a highly skilled and experienced defender who has made a name for himself playing for various clubs throughout his career. His dedication and talent have earned him numerous accolades, and he continues to be a valuable asset to the teams he plays for. With his net worth growing steadily, it is clear that Laurent Koscielny is a football player worth keeping an eye on in the coming years."}, {"url": "https://medium.com/@gentie/history-of-laurent-koscielny-5047b6fe8a03", "page_content": "History Of Laurent Koscielny gentie · Follow · Feb 13, 2018 10 min read -- Listen Share\n\nLaurent Koscielny (French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French professional footballer who plays as a centre back for English club Arsenal and the France national team. He is vice-captain of Arsenal.\n\nBorn in Tulle, Koscielny began his football career playing for a host of youth clubs before moving to Guingamp in 2003, where he quickly progressed through the youth ranks, making his professional debut the following season. After becoming frustrated at being played out of position as a right back, he joined Tours for an undisclosed fee, quickly establishing himself as the team’s star player in his desired position, ultimately aiding in the club’s promotion into Ligue 1, while also being named in the Ligue 2 Team of the Season.[3] Koscielny continued his impressive performances following a €1.7 million transfer to fellow French outfit Lorient in 2009, receiving multiple plaudits for his performances, largely cultivating a reputation as a clever, agile, ball-playing defender.[3] His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\nFollowing his arrival to England, Koscielny has widely been regarded to be one of the best players in his position, as well as one of the best in the world.[4][5] He has since established himself as a core component in the Arsenal first team, as well as contributing with a host of individual performances, including aiding in ending the club’s nine-year trophy drought, scoring a crucial equalizer en route to winning the FA Cup in 2014. He was also crucial in further club successes that followed, winning another two FA Cups and the FA Community Shield on three occasions.\n\nDespite having the ability to represent Poland, Koscielny instead decided to represent France, and first appeared up for the national team against Brazil in February 2011.[6] Koscielny has since become a regular starter for the nation in every major tournament that they have appeared in, including UEFA Euro 2012 and the 2014 FIFA World Cup, while also leading France to the final of UEFA Euro 2016. He scored his first international goal in a friendly match against Scotland in 2016,[7] and has since amassed forty-nine appearances for the national side.\n\nPrior to the beginning of the 2018 FIFA World Cup, Koscielny announced that he would be retiring from international football after the competition, and thus no longer be playing for France.\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.[citation needed]\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division’s best XI at the end of the season.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club’s number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs.[10] Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off.[11] He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.[12]\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James’ Park. Koscielny was given a straight red card in Arsenal’s 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny’s performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was “impressive” and “magnificent throughout”.[13] On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.[14]\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal’s biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal’s 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team’s fourth most important player by the fans in Arsenal’s Player of the Season poll for his performances throughout the 2011–12 season.[15]\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal.[16][17][18] His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1.[19] On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.[20]\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.[21]\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James’ Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.[22]\n\nKoscielny was voted as Arsenal’s second best player of the season.[23]\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal’s 3–1 Premier League opening day defeat at home to Aston Villa.[24] However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.[25]\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland.[26] In the team’s penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.[26]\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.[27]\n\nOn 17 May, Koscielny scored Arsenal’s equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.[28]\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal’s first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium.[29] After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks.[30] On 29 November, he returned to Arsenal’s starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns.[31] In the team’s following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.[32]\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City.[33] On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium.[34] On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1.[35] On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.[36]\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium,[37] due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea.[38][39] With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane.[40] He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running.[41] Koscielny scored his fourth of the season in a 3–3 draw with West Ham.[42]\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal’s highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday.[43] Koscielny was involved in a controversial incident at the end of Arsenal’s 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny’s arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny.[44][45][46] On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal.[47] Two days later, he made his 200th appearance for Arsenal in the Premier League on a 4–0 away victory against Swansea City.[48][49]\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.[50]\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker.\n\nKoscielny was called up to the French national team on 3 February 2011. Before his call up for France, Koscielny was also eligible to play for Poland and initially considered applying for Polish citizenship.[6] In August 2010, it was reported that he had not submitted an application and cancelled a meeting with Poland national team coach Franciszek Smuda in Warsaw on 7 August. Koscielny later declared that his priority was to play for France.[53]\n\nKoscielny was called up to the French team for the first time on 3 February 2011, for the team’s friendly versus Brazil on 9 February.[54][55] Koscielny made his first appearance for les Bleus in a friendly match against the United States on 11 November, playing the entire match in a 1–0 win.\n\nHe made his first appearance in a major tournament during UEFA Euro 2012, when he played the entire match in a 2–0 defeat to Spain in the quarter-finals but was voted Man of the Match by the French media. On 15 November 2013, he was sent off in a 2014 World Cup qualifying play-off against Ukraine.\n\nOn 13 May 2014, Koscielny was named in Didier Deschamps’ squad for the 2014 FIFA World Cup.[56] He made his FIFA World Cup debut as a substitute for the injured Mamadou Sakho in a 5–2 defeat of Switzerland in the team’s second group match.[57] He was then named in the starting line-up for the next match against Ecuador, helping the team to a clean sheet in a 0–0 draw.[58] On 4 June 2016, Koscielny scored his first international goal in a friendly match against Scotland."}, {"url": "https://www.celebsagewiki.com/laurent-koscielny", "page_content": "Age, Biography and Wiki\n\nLaurent Koscielny was born on 10 September, 1985 in Tulle, France. Discover Laurent Koscielny's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 37 years old?\n\nPopular As N/A Occupation N/A Age 37 years old Zodiac Sign Virgo Born 10 September 1985 Birthday 10 September Birthplace Tulle, France Nationality France\n\nWe recommend you to check the complete list of Famous People born on 10 September. He is a member of famous with the age 37 years old group.\n\nLaurent Koscielny Height, Weight & Measurements\n\nAt 37 years old, Laurent Koscielny height is 1.86 m and Weight 80 kg.\n\nPhysical Status Height 1.86 m Weight 80 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Laurent Koscielny's Wife?\n\nHis wife is Claire Koscielny (m. 2015)\n\nFamily Parents Not Available Wife Claire Koscielny (m. 2015) Sibling Not Available Children Not Available\n\nLaurent Koscielny Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Laurent Koscielny worth at the age of 37 years old? Laurent Koscielny’s income source is mostly from being a successful . He is from France. We have estimated Laurent Koscielny's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nLaurent Koscielny Social Network\n\nTimeline"}, {"url": "https://www.bbc.com/sport/football/48971757", "page_content": "Koscielny joined Arsenal in 2010\n\nArsenal's Laurent Koscielny is risking his legacy at the club by refusing to travel on the pre-season tour of the US, says Gunners legend Ian Wright.\n\nThe 33-year-old France defender is out of contract at the end of next season and is a reported target for French clubs Bordeaux, Rennes and Lyon.\n\nKoscielny has made 353 appearances since joining Arsenal for £10m in 2010.\n\n\"It doesn't set a good example, Arsenal need to do something quick,\" said former England striker Wright.\n\nArsenal finished fifth last season and lost the Europa League final to Chelsea in May. BBC Sport understands Arsenal's captain decided he wanted to return to his homeland in the absence of Champions League football next season.\n\nOn returning from a summer break, Koscielny informed the club of his wish to leave but Arsenal rejected the request.\n\nIn a video on his Youtube channel, external-link filmed on holiday, Wright added: \"It's the time in the season where everybody is meant to be together. We are in for a tough season, a transitional period, we need a lot of catching up.\n\n\"For our captain to refuse to go on a pre-season tour after nine years of unbelievable service, to kind of destroy your legacy a little bit in respect of refusing to play for a club that you've professed love for, is something that is baffling me.\n\n\"You're the one we chose as our captain, our leader, and now we're going into pre-season with our captain refusing to go on the tour. How do you think that looks?\n\n\"This is something I cannot get my head around. I pray to god it can be resolved sooner rather than later. Whether staying or going. I am so disappointed in your decision to do this at this time.\"\n\nHe added: \"I love you Laurent but this is a poor decision.\""}, {"url": "https://livesportworld.com/laurent-koscielny-family-injury-height/", "page_content": "Laurent Koscielny is an international French professional player. He was born on 10 September 1985 and his birthplace Tulle, France. He has played in the different club and national football team.\n\nUsually, his playing position is Centre-back. In fact, he is an important footballer of this team. His height is 6 feet 1inches. At present, he playing Arsenal national team international World ranking is 2 numbers.\n\nLaurent Koscielny club, injury and international career\n\nKoscielny is a French professional footballer of French national team who is playing as a center-back for Arsenal English club. Laurent is a vice-captain of Arsenal. He was born on 10 September in 1985 born place in Tulle French.\n\nIn 2003, Koscielny beginning his football career for a host of youth club before moving to Gingham. He is quickly progressed through the young ranks, making his professional debut the following season.\n\nHe played out of position ultimately aiding in the club promotion into Ligue. When he also being named in the Ligue 2 team of the season.\n\nHe joined Tours for an unexposed fee; he has quickly established himself as the team’s star player in his desired position. His impressive performances following a 1.7 million transfer to follow French out Lorient in 2009.\n\nHis gained and footballing potential attracted Arsenal. Finally, he is moving to the Premier League side for a fee of 8.45 million the following season. Koscielny regarded to be one of the best players in his position, as well as one of the best in the world.\n\nAs well as his achievements with the host of individual performance including aiding I ending the club nine-year trophy drought, scoring a crucial equalizer en route to winning the FIFA cup in 2014.\n\nHe was also winning another FA Cup and the FA Community Shield twice. His first appeared up for the national team against Brazil in February 2011.\n\nBefore, to the beginning of the FA World Cup in 2018, Koscielny announced that he would be retired from the international career. Aafter emulation, and thus no longer be playing for France.\n\nLaurent height, age, biography, wife, net worth, and football career\n\nLaurent Koscielny salary, profile, football career, family, wife, biography and more His Real Name Laurent Koscielny Nickname Laurent Profession Footballer Height in cm & m 186 cm and 1.86m Also height in feet inches 6 feet 1 inches Weight in kg 75 kg His Heir color Black Eye color Black Body statements Not known His date of Birth September 10, 1985 And age [showcurrentage month=\"September\" day=\"10\" year=\"1985\" template=\"9\"] Nationality France Birth Place Tulle,France Martial Football career Summery International Football debut in Club 2004 Team agent International player National team goals February 21, 1900 And national team first goal date March 27, 2018 Club career debut Guingamp 2004-2007, Tours 2007-2007,Lorient 2009-2010,Arsenal 2010. Playing Position Centre-back. Current team Ardenal Jersey Number 6 And club career goals Tours goals (6) in 67 match, Lorient goals (3) in 35 match,Arsenal goals (19) in 238 match International Football debut 2011 Lourent Koscielnywife, girlfriend, net worth, salary, family and more details His father name Not known And brother name unknown Mother name Not known Sister name Not known Marital Status Married Wife Claire Koscielny\n\nGirlfriends Claire Koscielny Highest Market Value 22, 00 Million EUR Religion name Not known Salary 5 million Euro His Children Not known Education Unknown Net worth 15 million\n\nKoscielny honors and news\n\nAnyway, if you think, any information to give mistake so comment below the post about Laurent Koscielny.\n\nFrom February 2020, all sports was off for Covid-19 but, in July 2020 started all sports successfully.\n\nIn finally, we feel that you have succeeded to get your effective information about Laurent.\n\nsame team player post you can check\n\nKevin Gameiro\n\nAdil Rami profile and more."}, {"url": "https://www.bbc.co.uk/sport/football/48948345", "page_content": "Koscielny has played 353 times for the Gunners and won the FA Cup in 2013-14 and 2014-15\n\nArsenal captain Laurent Koscielny has refused to travel on the club's pre-season tour of the US.\n\nThe 33-year-old France defender is out of contract at the end of the 2019-20 season and is a reported target for French clubs Bordeaux, Rennes and Lyon.\n\n\"We are very disappointed by Laurent's actions, which are against our clear instructions,\" said Arsenal.\n\n\"We hope to resolve this matter and will not be providing any further comment at this time.\"\n\nBordeaux have reportedly offered Koscielny a three-year deal.\n\nThe central defender joined Arsenal in the summer of 2010 for a fee of around £10m.\n\nA frustration that had been brewing for some time - analysis\n\nBBC Sport's David Ornstein\n\nTowards the end of last season, Arsenal and Koscielny were in negotiations over a contract extension - most likely for an additional year on top of his remaining 12 months.\n\nThe conversation was progressing positively but then Arsenal were beaten by Chelsea in the Europa League final, a result that has had major repercussions for the Gunners.\n\nAs well as causing significant damage to their recruitment plans and possibilities, it also changed certain situations regarding existing players and none more so than Koscielny.\n\nThe 33-year-old is understood to have become increasingly discontent since his return in December from an Achilles injury, primarily over the management of his playing schedule and the direction in which he feels the team and club are moving.\n\nWhile Koscielny was optimistic that Champions League qualification could lead to a better future for both parties - hence the contract talks - missing out exacerbated his misgivings and led him to decide the time had come to move back to France.\n\nOn returning from a summer break and with firm interest from clubs in his homeland, Koscielny informed Arsenal of his wish to leave and hoped his nine years of service and professionalism until this point would help achieve an amicable resolution.\n\nHowever, Arsenal rejected the request and made it clear that they need and expect the Frenchman to honour his contract and be a key part of their squad in the coming campaign.\n\nEmery is said to be furious with Koscielny's refusal to go to the USA\n\nGiven that head coach Unai Emery was happy with Koscielny's performance in 2018-19 and already faces other issues in central defence, the view was that he could only go if a bid landed that reflected his value and importance to Arsenal.\n\nKoscielny argues that Arsenal are reneging on an agreement that would allow him exit as a free agent during the current transfer window, something the Gunners strenuously deny.\n\nHe is also thinks Arsenal have - or will receive - an \"acceptable\" offer, but some privy to the proposal admit that \"acceptable\" is subjective and others insist there is nothing on table.\n\nWhen Koscielny told Emery in a face-to-face meeting on Wednesday morning that he would not be joining the team on their pre-season tour to the USA, the Spaniard was furious.\n\nArsenal's head of football Raul Sanllehi later sent Koscielny a message expressing bitter disappointment and warning the player that not travelling would be in breach of contract.\n\nKoscielny replied emphasising his stance and on arrival at Arsenal's London Colney training ground on Thursday morning the captain confirmed he would not be boarding the flight.\n\nHe will be required to train alongside the players who are not on the America trip - mainly youngsters - with disciplinary proceedings under way to determine his punishment.\n\nArsenal officials are fuming about the situation, which from a sporting perspective gives them a headache in central defence - an area they were already looking to strengthen this window.\n\nThey were thought to be close to completing the 30m euros signing of William Saliba from Saint-Etienne, with plans to loan the 18-year-old back to the Ligue 1 side for the entirety of next season.\n\nBut in a dramatic twist on Friday, Tottenham reignited their interest in Saliba and were pushing hard to complete the transfer from under the noses of Arsenal.\n\nMeanwhile, Rob Holding is recovering from a knee injury and there are concerns over the development and readiness of Konstantinos Mavropanos to provide a credible option.\n\nArsenal are keen to sell Shkodran Mustafi but the German is under contract until 2021 and has no desire to depart."}]}