{"Laurent Koscielny was named in the FIFPro World XI in 2016.": [{"url": "https://www.sportskeeda.com/player/laurent-koscielny", "page_content": "Laurent Koscielny: A Brief Biography\n\nLaurent Koscielny is a professional footballer from France. He was born on the 10th of September, 1985 in Tulle. Koscielny is a center back who is currently the vice-captain of the English Premier League team Arsenal.\n\n\n\n\n\nBackground\n\n\n\n\n\nThe Frenchman began his career with Guingamp in 2004 which has produced players like Didier Drogba and Florent Malouda. Koscielny played as a fullback for Guingamp in most of the matches.However, he felt that center back was his forte and this made him join Tours FC to take a chance at center back.\n\n\n\n\n\nIn his debut season with Tours FC in 2007, Koscielny showed remarkable progress and played a major role in his team’s promotion to Ligue 1. He was also named in the best XI of the season.\n\n\n\n\n\nThe center back continued his good form with Lorient FC in 2009 where he was regarded as one of the best players in his position. He was developing reputation as a clever and an agile defender. His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\n\n\n\n\nDebut\n\n\n\n\n\nLaurent Koscielny had the opportunity to represent Poland but decided to ply his trade with France. He made his first appearance for France on the 9th of February, 2011 in a friendly match against United States. Koscielny played the entire game and his side sealed a 1-0 victory. On the 4th of June, 2016, Koscielny scored his first international goal in a friendly match against Scotland.\n\n\n\n\n\nRise to Glory\n\n\n\n\n\nKoscielny had a great debut season with Arsenal. He was constantly making great tackles and preventing the opposition from penetrating their back line. In 2011, Koscielny had one of his best performances till date that saw Arsenal beat Barcelona 2-1 in the round of 16 Champions League tie.\n\n\n\n\n\nThe Frenchman was a great asset to the team as apart from acting as a defender, he had a great goal scoring ability. Till date, Koscielny has scored 24 goals for Arsenal. He is the highest scoring defender for Arsenal in the history of EPL. He is regarded as one of the most important players for Arsenal in the past seven years.\n\n\n\n\n\nKoscielny has won the FA Cup with Arsenal in 2014, 2015 and 2017. He has also won the FA Community Shield in 2014, 2015 and 2017. The center back has made a major contribution in his team’s success in the FA Cup over the years.\n\n\n\n\n\nLow Points\n\n\n\n\n\nKoscielny has got more than thirty yellow cards and as many as five red cards. This has forced him out of a few crucial encounters and has affected the team’s performance. He has missed more games due to suspension and not because of injury.\n\n\n\n\n\nThe center back must work on preventing harsh tackles so as to represent Arsenal in more and more games and increase their chances of winning more trophies.\n\n\n\n\n\nThe Frenchman is yet to win the Premier League with Arsenal. Although he has won six titles at Arsenal, the coveted Premier League title has eluded him."}, {"url": "https://sportmob.com/en/article/975741-Top-Facts-About-Laurent-Koscielny-One-of-The-Best-Defenders", "page_content": "Laurent Koscielny plays as a centre back and he is product of Guingamp youth system. Then he quickly made his way through the ranks to the acme. Over the years he worked hard and managed to make a name for himself as one of the greatest footballers playing in the position of a defender. We will walk you through all the details about Laurent Koscielny transfer market stats.\n\nAside from the details of his career in football and his road to fame, we will fill you in with the details about\n\nLaurent Koscielny personal life.\n\nThe footballer is a married man. Laurent Koscielny wife supports him in every up and down. She gave birth to Laurent Koscielny children and together they have a great life."}, {"url": "https://sites.duke.edu/wcwp/tournament-guides/european-cup-2016-guide/identity-and-the-french-national-team/notable-players-in-the-projected-french-squad-with-african-heritage/laurent-koscielny/", "page_content": "Coauthored by Jeremy Roth and David Talpalar\n\n(Courtesy of ESPN)\n\nKoscielny, a “pure” Frenchman, figures to slot in at the other center back position alongside Varane, especially given that Koscielny’s main competition for the spot, Mamadou Sakho, recently failed a UEFA drug test. At 30 years old, Koscielny is a fantastically experienced center back at the club level, although he has already been surpassed by Varane for international appearances.\n\nDespite making just 23 appearances for his country, Koscielny has played over 300 matches for the first team at club level. Since moving from France in 2010, he has plied his trade in Arsenal’s back line, sometimes slotting in at right back, but more often at center back (ESPN). He has been a central figure for the Gunners since his arrival, and Arsenal have endured great success since his arrival.\n\nKoscielny’s style of play can be considered traditional. Alongside Per Mertesacker, his powerful but slow moving center back partner at Arsenal, Koscielny has proven his fleet of foot and good tactical awareness. He is also quite useful from corner kicks in attack as well. He has even scored 15 goals in his time at Arsenal, none bigger than the one below, which not only demonstrates his offensive ability but also his clutch ability in big game situations.\n\nKoscielny equalizes for Arsenal in the FA Cup final (YouTube)\n\nHow to cite this article: “Projected France Starting XI at Euro 2016” Written by Jeremy Roth and David Talpalar (2016), European Cup 2016 Guide, Soccer Politics Blog, Duke University, http://sites.duke.edu/wcwp/tournament-guides/european-cup-2016-guide/identity-and-the-french-national-team/notable-players-in-the-projected-french-squad-with-african-heritage/laurent-koscielny/ (accessed on (date))."}, {"url": "https://www.football.london/all-about/laurent-koscielny", "page_content": "Laurent Koscielny 14:00, 26 APR 2022\n\nStory Saved\n\nYou can find this story in My Bookmarks.\n\nOr by navigating to the user icon in the top right."}, {"url": "https://medium.com/@gentie/history-of-laurent-koscielny-5047b6fe8a03", "page_content": "History Of Laurent Koscielny gentie · Follow · Feb 13, 2018 10 min read -- Listen Share\n\nLaurent Koscielny (French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French professional footballer who plays as a centre back for English club Arsenal and the France national team. He is vice-captain of Arsenal.\n\nBorn in Tulle, Koscielny began his football career playing for a host of youth clubs before moving to Guingamp in 2003, where he quickly progressed through the youth ranks, making his professional debut the following season. After becoming frustrated at being played out of position as a right back, he joined Tours for an undisclosed fee, quickly establishing himself as the team’s star player in his desired position, ultimately aiding in the club’s promotion into Ligue 1, while also being named in the Ligue 2 Team of the Season.[3] Koscielny continued his impressive performances following a €1.7 million transfer to fellow French outfit Lorient in 2009, receiving multiple plaudits for his performances, largely cultivating a reputation as a clever, agile, ball-playing defender.[3] His achievements and footballing potential attracted Arsenal, ultimately moving to the Premier League side for a fee of £8.45 million the following season.\n\nFollowing his arrival to England, Koscielny has widely been regarded to be one of the best players in his position, as well as one of the best in the world.[4][5] He has since established himself as a core component in the Arsenal first team, as well as contributing with a host of individual performances, including aiding in ending the club’s nine-year trophy drought, scoring a crucial equalizer en route to winning the FA Cup in 2014. He was also crucial in further club successes that followed, winning another two FA Cups and the FA Community Shield on three occasions.\n\nDespite having the ability to represent Poland, Koscielny instead decided to represent France, and first appeared up for the national team against Brazil in February 2011.[6] Koscielny has since become a regular starter for the nation in every major tournament that they have appeared in, including UEFA Euro 2012 and the 2014 FIFA World Cup, while also leading France to the final of UEFA Euro 2016. He scored his first international goal in a friendly match against Scotland in 2016,[7] and has since amassed forty-nine appearances for the national side.\n\nPrior to the beginning of the 2018 FIFA World Cup, Koscielny announced that he would be retiring from international football after the competition, and thus no longer be playing for France.\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.[citation needed]\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division’s best XI at the end of the season.\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club’s number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs.[10] Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off.[11] He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.[12]\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James’ Park. Koscielny was given a straight red card in Arsenal’s 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny’s performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was “impressive” and “magnificent throughout”.[13] On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.[14]\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal’s biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal’s 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team’s fourth most important player by the fans in Arsenal’s Player of the Season poll for his performances throughout the 2011–12 season.[15]\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal.[16][17][18] His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1.[19] On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.[20]\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.[21]\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James’ Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.[22]\n\nKoscielny was voted as Arsenal’s second best player of the season.[23]\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal’s 3–1 Premier League opening day defeat at home to Aston Villa.[24] However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.[25]\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland.[26] In the team’s penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.[26]\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.[27]\n\nOn 17 May, Koscielny scored Arsenal’s equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.[28]\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal’s first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium.[29] After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks.[30] On 29 November, he returned to Arsenal’s starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns.[31] In the team’s following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.[32]\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City.[33] On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium.[34] On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1.[35] On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.[36]\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium,[37] due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea.[38][39] With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane.[40] He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running.[41] Koscielny scored his fourth of the season in a 3–3 draw with West Ham.[42]\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal’s highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday.[43] Koscielny was involved in a controversial incident at the end of Arsenal’s 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny’s arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny.[44][45][46] On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal.[47] Two days later, he made his 200th appearance for Arsenal in the Premier League on a 4–0 away victory against Swansea City.[48][49]\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.[50]\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker.\n\nKoscielny was called up to the French national team on 3 February 2011. Before his call up for France, Koscielny was also eligible to play for Poland and initially considered applying for Polish citizenship.[6] In August 2010, it was reported that he had not submitted an application and cancelled a meeting with Poland national team coach Franciszek Smuda in Warsaw on 7 August. Koscielny later declared that his priority was to play for France.[53]\n\nKoscielny was called up to the French team for the first time on 3 February 2011, for the team’s friendly versus Brazil on 9 February.[54][55] Koscielny made his first appearance for les Bleus in a friendly match against the United States on 11 November, playing the entire match in a 1–0 win.\n\nHe made his first appearance in a major tournament during UEFA Euro 2012, when he played the entire match in a 2–0 defeat to Spain in the quarter-finals but was voted Man of the Match by the French media. On 15 November 2013, he was sent off in a 2014 World Cup qualifying play-off against Ukraine.\n\nOn 13 May 2014, Koscielny was named in Didier Deschamps’ squad for the 2014 FIFA World Cup.[56] He made his FIFA World Cup debut as a substitute for the injured Mamadou Sakho in a 5–2 defeat of Switzerland in the team’s second group match.[57] He was then named in the starting line-up for the next match against Ecuador, helping the team to a clean sheet in a 0–0 draw.[58] On 4 June 2016, Koscielny scored his first international goal in a friendly match against Scotland."}, {"url": "https://www.theguardian.com/football/2018/oct/14/arsenal-laurent-koscielny-calls-time-international-career", "page_content": "The Arsenal defender Laurent Koscielny has announced the end of his international career with France and criticised the World Cup-winning manager, Didier Deschamps.\n\nThe 33-year-old missed the World Cup with an achilles injury and had intended to retire from international duty after the tournament.\n\nKoscielny told Canal+: “I think that I have given everything I can for France. My injury does not change my decision. For Les Bleus it is finished.”\n\nHe announced his intention to retire from France duty in November 2017 but confirmed it on Sunday as he explained the pain of missing out on the World Cup success.\n\n“France’s World Cup victory did me a lot more psychological damage than my injury did me,” he said.\n\nKoscielny, however, was critical of Deschamps, suggesting he felt unwanted by the coach. “He called me once for my birthday in September. Otherwise, no [contact].\n\nThe Fiver: sign up and get our daily football email.\n\n“Lots of people disappointed me. Not only the coach. It feels like a hit on the back of the head. When you are in good form, you have lots of friends. When you are injured ... after a certain period of time, you are forgotten about.”\n\nKoscielny, who has 51 caps, was injured in Arsenal’s Europa League semi-final defeat against Atlético Madrid in May and is still recovering."}, {"url": "https://peoplepill.com/people/laurent-koscielny/", "page_content": "Laurent Koscielny ( French pronunciation: [loʁɑ̃ kosjɛlɲi]; born 10 September 1985) is a French footballer who plays as a centre-back for English club Arsenal and the France national team. Koscielny is the vice-captain of Arsenal. He has been described as a clever, agile and ball-playing defender.\n\nKoscielny was born in the city of Tulle and began his football career playing for a host of amateur and youth clubs such as Brive, Tulle Corrèze and Limoges. In 2003, he moved to Guingamp, where he made his professional debut the following year. Koscielny joined Tours for an undisclosed fee to play in the third tier of the French league in 2007 and enjoyed promotion with his new side before being named in the Ligue 2 Team of the Season the following campaign. In 2009, newly promoted Ligue 1 side Lorient signed Koscielny for around €1.7 million, and his performances caught the eye of Arsenal manager Arsène Wenger, who signed him in 2010. Since then, he is regarded as one of the best players in his position in the Premier League.\n\nKoscielny was first called up to the French national team on 4 February 2011 and has since represented the country at UEFA Euro 2012, UEFA Euro 2016, and at the 2014 FIFA World Cup. Prior to his call-up for France, he was also eligible to play for Poland, as a result of his family roots.\n\nClub career\n\nEarly career\n\nKoscielny was born in Tulle, Corrèze. His career began in 2004 with Guingamp, a team that had produced such talents as Didier Drogba and Florent Malouda. Three years later, Koscielny was forced to take stock and drop down to the French third tier. He made 47 appearances for Guingamp, between 2004 and 2007, mostly as a right fullback.\n\nIn 2007, Koscielny joined Tours FC, deciding that he wanted a chance at centre back. He showed remarkable improvement in aerial ability and positional awareness that limited him to just three yellow cards. During the 2008–09 season, Koscielny made 34 Ligue 2 appearances, scoring 5 goals from defence, and was named in the division's best XI at the end of the season.\n\nLorient\n\nOn 16 June 2009, newly promoted Ligue 1 side FC Lorient signed Koscielny on a four-year contract for around €1.7 million. He established himself as a starter and played in his preferred centre-back position. Over one season at the club, he scored 3 goals in 35 appearances. On 7 March 2010 Koscielny tapped in his first Ligue 1 goal against Olympique Marseille at Stade Vélodrome in the 65th minute in a 1–1 draw. Koscielny became a fan favourite when he scored his second goal with a header deep in injury time against Montpellier in a 2–2 draw after a cross from Olivier Monterrubio.\n\nHe scored another against Bordeaux after 11 minutes. However, he received a red card 15 minutes later for a foul in the penalty area against his future Arsenal teammate Marouane Chamakh. Koscielny helped Lorient to finish the campaign in 7th place; its best finish in Ligue 1. An impressive season culminated in reports from French daily Ouest-France that the defender was training with the Arsenal reserves ahead of an official announcement. On 6 July 2010, Koscielny agreed personal terms with Arsenal. Arsenal's initial offer for Koscielny was believed to be in the region of £4 million, while they were then prepared to do a deal that would also involve youngster Francis Coquelin moving on loan in the opposite direction, which Lorient rejected. During the summer transfer window of 2010 reports began to emerge in late June that a deal had been reached to bring Koscielny to Arsenal for a reported sum of £8.45 million.\n\nArsenal\n\n2010–11 season\n\n\"I don't believe any French player would have refused to come and play for Arsenal. It took me four years to go from the bench of Ligue 2 to Arsenal so it is a great achievement. I have been on the crest of a wave for the last few years. But it is just the beginning; I haven't proved anything yet. Arsenal is a reference for football.\" Laurent Koscielny\n\nArsenal confirmed the signing on 7 July 2010 and Koscielny was handed the club's number 6 shirt, previously worn by Philippe Senderos, who had moved to Fulham earlier in the summer. Wenger explained he bought Koscielny due to the fact he added height to the team and Arsenal were low on centre backs. Koscielny made his debut against Barnet in a pre-season friendly in July 2010. One month later in his competitive debut against Liverpool at Anfield, he was sent off in the 94th minute for a second bookable offence. Both of his yellow cards were shown beyond 90 minutes. The game ended in a 1–1 draw with both teams having debut players sent off. He scored his first goal for Arsenal on 11 September 2010, in a 4–1 win against Bolton Wanderers.\n\nKoscielny made his debut in European competition on 15 September 2010, when he partnered Sébastien Squillaci in a 6–0 win over Braga at the Emirates Stadium. Koscielny was praised for performances against Sunderland and made a brilliant tackle against Tottenham Hotspur to stop Aaron Lennon from scoring during their Football League Cup tie. On 27 October, he blocked a shot off the line and provided an assist to Theo Walcott against Newcastle United in the fourth round of the League Cup, where Arsenal went on to win the match 4–0 at St James' Park. Koscielny was given a straight red card in Arsenal's 0–1 loss at home against Newcastle United on 7 November 2010. This was his second sending off of the season.\n\nKoscielny playing for Arsenal on 10 September 2011 against Swansea City.\n\nOn 25 January 2011, Koscielny scored the second goal in the 3–0 win over Ipswich Town in the League Cup semi-final second leg win at the Emirates Stadium. Throughout January 2011, Koscielny and Johan Djourou were a part of a defence that did not concede a goal in the Premier League. On 1 February, he scored his third goal of the season, which proved to be the winner in a 2–1 turn around victory over Everton. Koscielny had arguably his best performance to date for Arsenal in the first leg of the Champions League round of 16 match against Barcelona. The match ended in a 2–1 home win for Arsenal. Koscielny's performances were applauded and praised in many media reports of the game. Former Arsenal defender, Martin Keown, said his performance was \"impressive\" and \"magnificent throughout\". On 27 February, in the last minute of the 2011 Football League Cup Final, Koscielny was involved in a mix-up with his goalkeeper Wojciech Szczęsny, which resulted in Birmingham City striker Obafemi Martins scoring the winning goal.\n\n2011–12 season\n\nKoscielny and Fernando Torres in a Premier League match on 21 April 2012.\n\nKoscielny started the 2011–12 season alongside Thomas Vermaelen in central defence. Koscielny was injured and taken off the pitch 10 minutes into a 2–0 home loss to Liverpool on 20 August 2011. However, he returned to the starting line-up Arsenal's biggest ever Premier League defeat, losing 8–2 to Manchester United at Old Trafford. On 17 September, Koscielny scored an own goal as Arsenal lost 4–3 to Blackburn Rovers in the Premier League. He went on to be named man of the match away at Olympique Marseille in the Champions League, where Arsenal won 1–0 at the Stade Vélodrome, keeping their first clean sheet in a Champions League away game since 18 August 2009 against Celtic, where the Gunners had won 2–0.\n\nOn 29 October, Koscielny received praise for his solid performance in Arsenal's 5–3 away win against Chelsea. He scored his first goal of the season on 2 January 2012 in a 2–1 away defeat against Fulham. He scored his first Champions League goal against A.C. Milan in a 3–0 victory in the round of 16 second leg. On 13 May 2012, he scored the winning goal in a 3–2 victory against West Bromwich Albion to ensure that Arsenal finished third in the Premier League. He was voted as the team's fourth most important player by the fans in Arsenal's Player of the Season poll for his performances throughout the 2011–12 season.\n\n2012–13 season\n\nOn 24 July 2012, Koscielny signed a new long term contract with Arsenal. His first goal of the season was a late equaliser against champions Manchester City on 23 September 2012 in a match which ended 1–1. On 30 October, he scored a header from a corner in the 88th minute against Reading in the Football League Cup, helping Arsenal come back from 4–0 down to eventually win the game 7–5.\n\nOn 13 March 2013, Koscielny scored against Bayern Munich at the Allianz Arena in the UEFA Champions League Last 16. His goal put Arsenal 2–0 ahead on the night and level at 3–3 on aggregate, but they still exited the competition on the away goals rule.\n\nOn 19 May, Koscielny scored the winning goal as Arsenal beat Newcastle United 1–0 at St James' Park in their final Premier League fixture of the season to secure a fourth-placed finish and qualification to the 2013–14 UEFA Champions League play-off round.\n\nKoscielny was voted as Arsenal's second best player of the season.\n\n2013–14 season\n\nKoscielny started the 2013–14 season by conceding a penalty and getting sent off in Arsenal's 3–1 Premier League opening day defeat at home to Aston Villa. However, his partnership with Per Mertesacker saw the Gunners achieve the joint-best defensive record in the Premier League at the halfway point of the season, as the team topped the table.\n\nOn 22 February 2014, Koscielny scored his first goal of the season in a 4–1 defeat of Sunderland. In the team's penultimate home match, Koscielny scored his second goal of the season in a 3–0 win against Newcastle United.\n\nOn 9 May 2014, Koscielny signed a new long-term contract with Arsenal.\n\nOn 17 May, Koscielny scored Arsenal's equalising goal as the team came from 2–0 down to defeat Hull City 3–2 in the 2014 FA Cup Final, winning his first piece of silverware with the club.\n\n2014–15 season\n\nKoscielny and Kieran Gibbs playing for Arsenal in a match against Chelsea on 5 October 2014\n\nOn 16 August 2014, Koscielny opened his goal-scoring account for the season, scoring Arsenal's first goal in the 2014–15 Premier League. The goal was header from a free-kick in first half stoppage time against Crystal Palace at the Emirates Stadium. After sustaining an achilles tendon injury during the October international break, Koscielny was absent from the Arsenal team for seven weeks. On 29 November, he returned to Arsenal's starting line-up alongside Per Mertesacker in central defence, as the Gunners kept a clean sheet in a 1–0 victory against West Bromwich Albion at The Hawthorns. In the team's following fixture at home to Southampton, Koscielny helped Arsenal to record a second consecutive clean sheet and 1–0 win.\n\nOn 11 January 2015, Koscielny scored the first goal in a 3–0 win over Stoke City. On 18 January, he started in central defence as Arsenal shut out defending champions Manchester City to win 2–0 at the City of Manchester Stadium. On 10 February, he scored the opening goal as Arsenal defeated Leicester City 2–1. On 30 May 2015, Koscielny was selected to start in the 2015 FA Cup Final, playing the full 90 minutes in a 4–0 defeat of Aston Villa at Wembley Stadium.\n\n2015–16 season\n\nKoscielny started every game in the first month of the season, excluding a 0–0 draw with rivals Liverpool at Emirates Stadium, due to an injury. Koscielny played a vital part as Arsenal won 5 games out of six in October to go second in the Premier League, with Koscielny scoring in successive Premier League wins against Everton and Swansea. With manager Arsene Wenger opting to play Gabriel Paulista ahead of vice-captain Per Mertesacker, Koscielny began appearing as captain in February, due to injuries to other captains Santi Cazorla & Mikel Arteta. This ended after a 3–2 defeat to Manchester United, when Koscielny missed four games through injury, including a North London derby at White Hart Lane. He returned in a 3–1 away defeat to Barcelona in the Champions League, as Arsenal exited the competition at the round of 16 for the sixth season running. Koscielny scored his fourth of the season in a 3–3 draw with West Ham.\n\n2016–17 season\n\nKoscielny started his first game of the season in a goalless draw against Leicester City. On 10 September, he was given the role of captain and scored a fine overhead kick to equalize for the Gunners in a game which they then won 2–1 against Southampton making him Arsenal's highest goal scoring defender in EPL history, with the landmark achieved on his 31st birthday. Koscielny was involved in a controversial incident at the end of Arsenal's 1–0 win over Burnley, in which Koscielny and Alex Oxlade-Chamberlain were involved in a goal which appeared to be scored from an offside position after hitting Koscielny's arm. Neither the perceived deliberate handball or offside offenses were deemed to be infringements and the goal was later correctly credited to Koscielny. On 12 January 2017, Koscielny, alongside teammates Francis Coquelin and Olivier Giroud signed a new long-term contract with Arsenal. Two days later, he made his 200th appear for Arsenal in the Premier League on a 4–0 away victory against Swansea City.\n\nOn the last day of the 2016–17 season he received red card for a tackle on Enner Valencia of Everton. Arsenal lost an appeal and Koscielny was banned for three games, meaning he would miss FA Cup final.\n\nAlthough he was absent from the FA Cup final and the Community Shield, Koscielny lifted both trophies alongside Per Mertesacker."}, {"url": "https://fbref.com/en/players/f5efb153/Laurent-Koscielny", "page_content": "About FBref.com\n\nFBref.com launched (June 13, 2018) with domestic league coverage for England, France, Germany, Italy, Spain, and United States. Since then we have been steadily expanding our coverage to include domestic leagues from over 40 countries as well as domestic cup, super cup and youth leagues from top European countries. We have also added coverage for major international cups such as the UEFA Champions League and Copa Libertadores.\n\nFBref is the most complete sources for women's football data on the internet. This includes the entire history of the FIFA Women's World Cup as well as recent domestic league seasons from nine countries, including advanced stats like xG for most of those nine.\n\nIn collaboration with Opta, we are including advanced analytical data such as xG, xA, progressive passing, duels and more for over twenty competitions. For more information on the expected goals model and which competitions have advanced data, see our xG explainer.\n\nView Additional Information"}, {"url": "https://www.skysports.com/football/news/11095/11095789/fifpro-world-xi-cristiano-ronaldo-lionel-messi-and-neymar-included", "page_content": "Real Madrid and Barcelona players dominate the 2016/17 FIFA FIFPro World XI, with no Premier League representation in the team.\n\nA record number of 26,622 players from 71 countries voted for the team, picking a goalkeeper, four defenders, three midfielders and three forwards.\n\nParis St-Germain's Neymar, Juventus goalkeeper Gianluigi Buffon and AC Milan's Leonardo Bonucci are the only players in this year's team who did not make the XI last year.\n\nIn front of Buffon, the back four is made up of Real Madrid pair Sergio Ramos and Marcelo along with Bonucci and Dani Alves - both of whom left Juventus in the summer to join AC Milan and PSG respectively.\n\nThe midfield is all La Liga, with Luka Modric and Toni Kroos from Real Madrid included alongside Barcelona's Andres Iniesta.\n\nImage: Here's a look at how the FIFPro World XI would line-up\n\nThere are no surprises in the front three, with Lionel Messi and Cristiano Ronaldo joined by Neymar, who became the most expensive player in the world when he joined PSG from Barcelona in the summer.\n\nReal Madrid boss Zinedine Zidane was named the 2017 Best FIFA Men's Coach of the Year.\n\nThe Frenchman received the award after guiding Real to the La Liga title and the Champions League last season.\n\nAlso in the running for the award were Antonio Conte, who won the Premier League in his first season at Chelsea, and his Juventus successor Massimiliano Allegri, who has won three consecutive league and cup doubles in Italy.\n\nSarina Wiegman was named women's coach of the year after leading the Netherlands to their first major women's title at the European Championship in August."}, {"url": "https://www.celebsagewiki.com/laurent-koscielny", "page_content": "Age, Biography and Wiki\n\nLaurent Koscielny was born on 10 September, 1985 in Tulle, France. Discover Laurent Koscielny's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 37 years old?\n\nPopular As N/A Occupation N/A Age 37 years old Zodiac Sign Virgo Born 10 September 1985 Birthday 10 September Birthplace Tulle, France Nationality France\n\nWe recommend you to check the complete list of Famous People born on 10 September. He is a member of famous with the age 37 years old group.\n\nLaurent Koscielny Height, Weight & Measurements\n\nAt 37 years old, Laurent Koscielny height is 1.86 m and Weight 80 kg.\n\nPhysical Status Height 1.86 m Weight 80 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Laurent Koscielny's Wife?\n\nHis wife is Claire Koscielny (m. 2015)\n\nFamily Parents Not Available Wife Claire Koscielny (m. 2015) Sibling Not Available Children Not Available\n\nLaurent Koscielny Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Laurent Koscielny worth at the age of 37 years old? Laurent Koscielny’s income source is mostly from being a successful . He is from France. We have estimated Laurent Koscielny's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nLaurent Koscielny Social Network\n\nTimeline"}]}