{"Bridget Moynahan appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons.": [{"url": "https://www.empireonline.com/people/bridget-moynahan/", "page_content": "Birthday: 28 Apr 1971\n\nKathryn Bridget Moynahan (born April 28, 1971 height 5' 9½\" (1,77 m)), best known as Bridget Moynahan, is an American model and actress. After graduating from Longmeadow High School in 1989, Moynahan pursued a career in modeling. She was signed by a modeling agency, which led her to appear in department store catalogs and the covers of widely known magazines. After doing television commercials, she began taking acting lessons, in order to change occupations.\n\nMoynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she would later have a recurring role as the character Natasha. The following year, she made her feature film debut in Coyote Ugly. She was then cast in a supporting role in Serendipity (2001). Moynahan has appeared in an eclectic range of films, including the action film The Sum of All Fears (2002), spy thriller The Recruit (2003), the science-fiction movie I, Robot (2004), and the political thriller Lord of War (2005).\n\nAway from film, Moynahan starred in the ABC television series Six Degrees, which premiered in September 2006. The show, however, was not successful, as it was canceled after one season. Since then, she has returned to film, starring in low-budget features. Moynahan completed work in Elizabeth Allen's Ramona and Beezus, which was released in July 2010. Returning to television, Moynahan stars in the CBS drama Blue Bloods."}, {"url": "https://factmandu.com/bridget-moynahan", "page_content": "Who is Bridget Moynahan?\n\nKathryn Bridget Moynahan is an American actress and model. She is known for her role in the police drama Blue Bloods. She appeared in department store catalogs and magazines, and after doing television commercials, she began taking acting lessons. She made her television debut in a guest appearance in the comedy series Sex and the City where she had a recurring role as Natasha.\n\nWhat is Bridget Moynahan Famous for?\n\nBridget Moynahan is an American actress and model. She appeared in magazines like Vogue and Elle. She also appeared on the covers of many big magazines like Vogue Paris, Glamour, and Elle. She appeared in many successful movies such as Unkown, Lord of War, I, Robot, and many more. She made her television debut as Natasha Naginsky in HBO's Sex and the City. She got her drama in Coyote Ugly in 2000. She is working on the CBS television drama Blue Bloods.\n\nWhere did Bridget Moynahan grow up?\n\nBridget Moynahan was born on April 18, 1971, in Binghamton, New York. She holds American nationality and belongs to Caucasian-White ethnicity. Her birth sign is Taurus and her religion is Christianity. She spent her childhood days in Longmeadow, Massachusetts. In 1989, she completed her graduation from Longmeadow High School. After completing graduation, she started modeling and did several commercials. She attended the University of Massachusetts Amherst.\n\nWho are Bridget Moynahan's Family?\n\nBridget Moynahan was born to a father named Edward Bradley Moynahan and a mother named Mary Bridget. Her father was a scientist and former administrator at the Univesity of Massachusetts Amherst and her mother was a school teacher. She has two brothers named Sean and Andy.\n\nWhat is Bridget Moynahan Doing Today?\n\nBridget Moynahan has starred as an assistant district attorney in the CBS drama Blue Bloods since September 2010, which is currently 2019 in its ninth season. She appeared in John Wick: Chapter 3-Parabellum as Helen Wick and Crown Vic as Tracy Peters in 2019.\n\nWhat is Bridget Moynahan Body Features?\n\nBridget Moynahan height is 1.77 m and body weight of 62 kg. Her body measurement is 34-29-37. Her bra size is 33B. She has Hazel eye color and Dark Brown hair color.\n\nIs Bridget Moynahan Married?\n\nBridget Moynahan is a married woman. She started dating with Scott Rosenberg who is a screenwriter. The couple stayed together for almost 3 years. In 2004, she dated Tom Brady who is NFL quarterback players. In 2006, the couple separated. Later, she came to know that she was pregnant with his child in 2007. She gave birth to her son named John Edward Thomas Moynahan on August 22, 2007. In 2010, she dated Joseph McGinty is a director and they broke up after some time. She married Andre Frankel who is an American businessman on October 17, 2015. The ceremony took place in the Hamptons.\n\nHow much is Bridget Moynahan's Net Worth?\n\nBridget Moynahan estimated net worth of $25 million USD as of 2018 but her salary has not been revealed yet."}, {"url": "https://www.moviefone.com/celebrity/bridget-moynahan/2015690/main/", "page_content": "Kathryn Bridget Moynahan (born April 28, 1971 height 5' 9½\" (1,77 m)), best known as Bridget Moynahan, is an American model and actress. After graduating from Longmeadow High School in 1989, Moynahan pursued a career in modeling. She was signed by a modeling agency, which led her to appear in department store catalogs and the covers of widely known magazines.\n\nAfter doing television commercials, she began taking acting lessons, in order to change occupations. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she would later have a recurring role as the character Natasha. The following year, she made her feature film debut in Coyote Ugly. She was then cast in a supporting role in Serendipity (2001).\n\nMoynahan has appeared in an eclectic range of films, including the action film The Sum of All Fears (2002), spy thriller The Recruit (2003), the science-fiction movie I, Robot (2004), and the political thriller Lord of War (2005). Away from film, Moynahan starred in the ABC television series Six Degrees, which premiered in September 2006. The show, however, was not successful, as it was canceled after one season.\n\nSince then, she has returned to film, starring in low-budget features. Moynahan completed work in Elizabeth Allen's Ramona and Beezus, which was released in July 2010. Returning to television, Moynahan stars in the CBS drama Blue Bloods. In her personal life, Moynahan was in a three-year relationship with screenwriter Scott Rosenberg. She was then in a high-profile relationship with NFL quarterback Tom Brady from 2004 to 2006.\n\nIn August 2007, she gave birth to Brady's son, John Edward Thomas."}, {"url": "https://www.scripts.com/actor/bridget_moynahan", "page_content": "Bridget Moynahan\n\nKathryn Bridget Moynahan (born April 28, 1971) is an American actress and model. Moynahan is known for her role in the police drama Blue Bloods. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling. She appeared in department-store catalogs and magazines, and after doing television commercials, she began taking acting lessons. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she later had a recurring role as Natasha. She made her feature film debut in Coyote Ugly (2000). She was cast in a supporting role in Serendipity (2001). Moynahan was also featured in films The Sum of All Fears (2002), The Recruit (2003), I, Robot (2004), Lord of War (2005), Grey Matters (2006), Prey (2007), Noise (2007), Ramona and Beezus (2010), John Wick (2014), The Journey Home (2014), and John Wick: Chapter 2 (2017). She starred in the ABC television series Six Degrees, which premiered in September 2006, but was taken off the schedule after just eight episodes aired. Moynahan has starred as an assistant district attorney in the CBS drama Blue Bloods since September 2010, which is currently (2020) in its 10th season.\n\nUpdate this biography »\n\nComplete biography of Bridget Moynahan »"}, {"url": "http://www.whomet.com/bridget-moynahan-232343", "page_content": "Thomas Edward Patrick Brady Jr. (born August 3, 1977) is an American football quarterback for the Tampa Bay Buccaneers of the National Football League (NFL). He spent his first 20 seasons with the New England Patriots organization, with which he was a central contributor to the franchise's dynasty from 2001 to 2019. Brady is widely regarded as the greatest quarterback of all time.\n\nAfter playing college football at Michigan, Brady was selected 199th overall by the Patriots in the sixth round of the 2000 NFL Draft, later earning him a reputation as the NFL's biggest draft steal. He became the starting quarterback during his second season, which saw the Patriots win their first Super Bowl title in Super Bowl XXXVI. As the team's primary starter for 18 seasons, Brady led the Patriots to 17 division titles (including 11 consecutive from 2009 to 2019), 13 AFC Championship Games (including eight consecutive from 2011 to 2018), nine Super Bowl appearances, and six Super Bowl titles, all NFL records for a player and franchise. He joined the Buccaneers in 2020 and has led them to three playoff appearances, two division titles, and won Super Bowl LV, extending his individual records to ten Super Bowl appearances and seven victories.\n\nBrady holds nearly every major quarterback record, including most career passing yards, completions, touchdown passes, and games started. Never having a losing season, he is the NFL leader in career quarterback wins, quarterback regular season wins, quarterback playoff wins, and Super Bowl Most Valuable Player (MVP) Awards, as well as being the only Super Bowl MVP for two different franchises. Additional accolades held by Brady include the most Pro Bowl selections and the first unanimous NFL MVP. The only quarterback to win a Super Bowl in three separate decades, Brady is also noted for the longevity of his success. He is the oldest NFL MVP at age 40, the oldest Super Bowl MVP at age 43, and the oldest quarterback selected to the Pro Bowl at age 44. Brady is the only NFL quarterback named to two all-decade teams (2000s and 2010s) and was unanimously named to the 100th Anniversary All-Time Team in 2019."}, {"url": "https://www.geni.com/people/Bridget-Moynahan/6000000009199004080", "page_content": "About Bridget Moynahan\n\nShe is an American model and actress. After graduating from Longmeadow High School in 1989, Moynahan pursued a career in modeling. She was signed by a modeling agency, which led her to appear in everything from department store catalogs to gracing the covers of widely known magazines. After doing television commercials, she began taking acting lessons, in order to change occupations.\n\nMoynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she would later have a recurring role as the character Natasha. The following year, she made her feature film debut in Coyote Ugly. She was then cast in a supporting role in Serendipity (2001). Moynahan has appeared in an eclectic range of films, including the action film The Sum of All Fears (2002), spy thriller The Recruit (2003), the science-fiction movie I, Robot (2004), and the political thriller Lord of War (2005).\n\nAway from film, Moynahan starred in the ABC television series Six Degrees, which premiered in September 2006. The show, however, was not successful, as it was canceled after one season. Since then, she has returned to film, starring in low-budget features. Moynahan has completed work in Elizabeth Allen's Ramona and Beezus scheduled for release in August 2010. Returning to television, Moynahan will star in the CBS drama Blue Bloods.\n\nIn her personal life, Moynahan was in a three-year relationship with screenwriter Scott Rosenberg. She was then in a high-profile relationship with NFL quarterback Tom Brady from 2004 to 2006. In February 2007, it was announced that Moynahan was pregnant with Brady's child. On August 22, 2007, she gave birth to a son, John Edward Thomas.\n\nMoynahan was born in Binghamton, New York, the daughter of Irish American parents Mary Bridget (née Moriarty), a former school teacher, and Edward Bradley Moynahan, a scientist and former administrator at the University of Massachusetts at Amherst. She has two brothers, Andy and Sean. When she was seven, her parents moved to Longmeadow, Massachusetts. Moynahan attended Longmeadow High School, where she was active with school athletics, where she captained the girls' soccer, basketball and lacrosse teams. In 1989, she graduated from Longmeadow High School. She admits that during her childhood, she grew up as a tomboy.\n\nMoynahan was in a three-year relationship with screenwriter Scott Rosenberg. Moynahan dated NFL quarterback Tom Brady from 2004 until December 14, 2006. On February 18, 2007, Moynahan's representative confirmed to People that she was more than three months pregnant and that Brady was the father. On August 22, 2007, she gave birth to a baby boy, John Edward Thomas Moynahan, at Saint John's Health Center in Santa Monica. In a July 2008 interview in Harper's Bazaar, Moynahan discussed her willingness to raise her son (nicknamed \"Jack\") as a single mother. Despite media reports that Moynahan and Brady have an acrimonious relationship, it was revealed that the two have maintained \"a civil relationship\" since the birth of their son.\n\nMoynahan resides in Pacific Palisades, California. In November 2009, it was announced that Moynahan had signed a deal with Garnier to appear in television and print advertising promoting their Nutrisse hair products.\n\nWikipedia: http://en.wikipedia.org/wiki/Bridget_Moynahan\n\nIMDb: http://www.imdb.com/name/nm0005256/\n\nFashion Model Directory: http://www.fashionmodeldirectory.com/models/bridget_moynahan/"}, {"url": "https://www.briansmoviestars.com/movie-stars/bridget-moynihan/", "page_content": "Kathryn Bridget Moynahan (born April 28, 1970[1]), known as Bridget Moynahan, is an American model and actress. Moynahan graduated from Longmeadow High School in 1989 and began pursuing a career in modeling. She appeared in department store catalogs and magazines, and, after doing television commercials, she began taking acting lessons. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she would later have a recurring role as the character Natasha.\n\nShe made her feature film debut in Coyote Ugly. She was then cast in a supporting role in Serendipity (2001). Moynahan was also featured in the action film The Sum of All Fears (2002), spy thriller The Recruit (2003), the science-fiction movie I, Robot (2004), and the political thriller Lord of War (2005). She starred in the ABC television series Six Degrees, which premiered in September 2006 but was canceled after one season. Moynahan completed work in Elizabeth Allen’s Ramona and Beezus, which was released in July 2010, and has starred in the CBS drama Blue Bloods since September 2010.\n\nFilm\n\nThey Said…\n\nMelissa Camire: Only seen Moynihan in Coyote Ugly and my god was she hot!\n\nElfrieda Carroll: Plays the same character all the time from what I’ve seen.\n\nAlvean Jones (tv Presenter): Good looking woman, but not sure if I’ve seen her films)"}, {"url": "https://www.upi.com/topic/Bridget_Moynahan/", "page_content": "Wiki\n\nKathryn Bridget Moynahan (born April 28, 1971), best known as Bridget Moynahan, is an American model and actress. After graduating from Longmeadow High School in 1989, Moynahan pursued a career in modeling. She was signed by a modeling agency, which led her to appear in department store catalogs and the covers of widely known magazines. After doing television commercials, she began taking acting lessons, in order to change occupations.\n\nMoynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she would later have a recurring role as the character Natasha. The following year, she made her feature film debut in Coyote Ugly. She was then cast in a supporting role in Serendipity (2001). Moynahan has appeared in an eclectic range of films, including the action film The Sum of All Fears (2002), spy thriller The Recruit (2003), the science-fiction movie I, Robot (2004), and the political thriller Lord of War (2005).\n\nAway from film, Moynahan starred in the ABC television series Six Degrees, which premiered in September 2006. The show, however, was not successful, as it was canceled after one season. Since then, she has returned to film, starring in low-budget features. Moynahan completed work in Elizabeth Allen's Ramona and Beezus, which was released in July 2010. Returning to television, Moynahan stars in the CBS drama Blue Bloods."}, {"url": "https://www.hobbydb.com/marketplaces/hobbydb/subjects/bridget-moynahan-actor", "page_content": "Bridget Moynahan (born Kathryn Bridget Moynahan) is an actress and model. She graduated from Longmeadow High School in Massachusetts in 1989, and began pursuing a career in modeling. She appeared in department-store catalogs and magazines, and after doing television commercials, she began taking acting lessons. Moynahan made her television debut in a guest appearance in the comedy series Sex and the City in 1999, where she later had a recurring role as Natasha.\n\nShe made her feature film debut in Coyote Ugly (2000). She was cast in a supporting role in Serendipity (2001). Moynahan was also featured in the action film The Sum of All Fears (2002), spy thriller The Recruit (2003), the science-fiction movie I, Robot (2004), and the political thriller Lord of War (2005).\n\nSubject ID: 35964"}, {"url": "https://oneworldinformation.com/bridget-moynahan/", "page_content": "Bridget Moynahan Biography\n\nBridget Moynahan is an American actress and model who is best known for her role as Erin Reagan in the police drama Blue Bloods. Following her education, she graduated from Longmeadow High School in Massachusetts in 1989 and began pursuing a career in modeling. In high school, she was captain of the girl’s soccer, basketball, and lacrosse teams.\n\nAfter graduating from high school, she pursued a modeling career admitting she has never read fashion magazines. She appeared in department-store catalogs and magazines. After doing television commercials, she began taking acting lessons. Most notably, she began her television debut in a guest appearance in the comedy series Sex and the City in 1999. She later had a recurring role in the series as Natasha.\n\nMoynahan moved to New York City at the age of 18, and, a year later, began appearing in magazines such as Vogue and Elle. Her cover highlights include Vogue Paris, Elle, and Glamour. During that time, she began doing soap and shampoo commercials which were in addition to taking acting and art classes. Moynahan studied acting at the Carmichael Patten Studio in New York, and in 1999, made her TV debut.\n\nMoynahan made her feature-film debut in Coyote Ugly (2000). She was also cast in Serendipity and was also featured in films The Sum of All Fears, The Recruit, I, Robert, Lord of War, Prey, Noise, and John Wick: Chapter 2. In addition, she starred in the ABC television series Six Degrees, which premiered in September 2006. She is currently starring as an assistant district attorney in the CBS drama Blue Bloods since September 2010.\n\nBridget Moynahan Age\n\nHow old is Moynahan? Moynahan is 52 years old as of 2023. She was born on April 28, 1971, in Binghamton, New York, United States. In addition, she celebrates her birthday on April 28 every year and her zodiac sign is Taurus.\n\nBridget Moynahan’s Height\n\nMoynahan stands at an average height of 5 feet 10 inches and weighs 57 kg equivalent to 126 lbs.\n\nBridget Moynahan Family\n\nMoynahan is the proud daughter of Mary Bridget (mother) and Edward Bradley Moynahan (father). Her mother is an Irish American while her father is a former administrator at the University of Massachusetts Amherst. In addition, she has an older brother, Andy, and a younger brother, Sean. Andy works as a computer programmer while Sean is a potter.\n\nBridget Moynahan Husband | Son\n\nMoynahan was married to Scott Rosenberg in 2001 but separated in 2003. Later on, in 2004 she got married to Tom Brady but separated in 2006. On August 22, 2007, she gave birth to her son, John Edward Thomas. Most notably, she is currently married to Andrew Frankel. They got married on October 17, 2015, in the Hamptons. Frank is a businessman and has three sons from a previous relationship.\n\nBridget Moynahan Net Worth\n\nMoynahan has an estimated net worth of $30 Million. Her income is attributed to her successful career as a journalist."}]}