{"Bridget Moynahan appeared in films such as Coyote Ugly (2000), Serendipity (2001), The Sum of All Fears (2002), I, Robot (2004), Lord of War (2005), and Gray Matters (2007).": [{"url": "https://www.imdb.com/list/ls020536477/", "page_content": "Action (5) Thriller (4) Drama (3) Comedy (2) Crime (2) Romance (2) Sci-Fi (2) Adventure (1) Music (1) Mystery (1) War (1)\n\nFeature Film (8)\n\n\n\nIMDb user rating (average) 1 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 2.0 2.1 2.2 2.3 2.4 2.5 2.6 2.7 2.8 2.9 3.0 3.1 3.2 3.3 3.4 3.5 3.6 3.7 3.8 3.9 4.0 4.1 4.2 4.3 4.4 4.5 4.6 4.7 4.8 4.9 5.0 5.1 5.2 5.3 5.4 5.5 5.6 5.7 5.8 5.9 6.0 6.1 6.2 6.3 6.4 6.5 6.6 6.7 6.8 6.9 7.0 7.1 7.2 7.3 7.4 7.5 7.6 7.7 7.8 7.9 8.0 8.1 8.2 8.3 8.4 8.5 8.6 8.7 8.8 8.9 9.0 9.1 9.2 9.3 9.4 9.5 9.6 9.7 9.8 9.9 10 to 10 9.9 9.8 9.7 9.6 9.5 9.4 9.3 9.2 9.1 9.0 8.9 8.8 8.7 8.6 8.5 8.4 8.3 8.2 8.1 8.0 7.9 7.8 7.7 7.6 7.5 7.4 7.3 7.2 7.1 7.0 6.9 6.8 6.7 6.6 6.5 6.4 6.3 6.2 6.1 6.0 5.9 5.8 5.7 5.6 5.5 5.4 5.3 5.2 5.1 5.0 4.9 4.8 4.7 4.6 4.5 4.4 4.3 4.2 4.1 4.0 3.9 3.8 3.7 3.6 3.5 3.4 3.3 3.2 3.1 3.0 2.9 2.8 2.7 2.6 2.5 2.4 2.3 2.2 2.1 2.0 1.9 1.8 1.7 1.6 1.5 1.4 1.3 1.2 1.1 1 Number of votes to »\n\nIn Favorite Theaters\n\nIn Theaters Near You\n\nReset"}, {"url": "https://www.looper.com/810856/why-rachel-from-coyote-ugly-looks-so-familiar/", "page_content": "Cookies help us deliver our Services. By using our Services, you agree to our use of cookies. Learn More\n\nWhy Rachel From Coyote Ugly Looks So Familiar\n\nThe 2000 film \"Coyote Ugly\" has become one of the most notable cult classics of the early aughts. David McNally's movie follows a young aspiring singer-songwriter named Violet (Piper Perabo) as she comes to New York City with aspirations of launching a musical career, only to find herself working as a bartender at a raucous hangout spot known as Coyote Ugly. The film was a box office hit when it debuted in theaters and gave a big boost to the careers of actors such as Perabo and Maria Bello.\n\nAmong the roster of all-women bartenders at the Coyote Ugly is confident, take-no-prisoners Rachel. There's no doubt that she probably looks familiar to a large portion of the film's audience. That is because the character is portrayed by model and actor Bridget Moynahan, who has more than a few well-known film and television credits to her name. Here are some of the biggest and best performances that audiences may recognize her from."}, {"url": "https://healthyceleb.com/bridget-moynahan/", "page_content": "Bridget Moynahan Quick Info Height 5 ft 9½ in Weight 57 kg Date of Birth April 28, 1971 Zodiac Sign Taurus Eye Color Hazel\n\nBridget Moynahan is an American actress and model who is best known for portraying roles such as Erin Reagan in Blue Bloods, Rachel in Coyote Ugly, Halley Buchanan in Serendipity, Dr. Susan Calvin in I, Robot, and Helen Wick in John Wick. She has also appeared in a variety of other TV shows and films such as Row Your Boat, Whipped, The Sum of All Fears, Lord of War, Gray Matters, Unknown, Battle: Los Angeles, Crown Vic, S*x and the City, Eli Stone, Six Degrees, and many more.\n\nBorn Name\n\nKathryn Bridget Moynahan\n\nNick Name\n\nBridget Moynahan\n\nSun Sign\n\nTaurus\n\nBorn Place\n\nBinghamton, New York, United States\n\nResidence\n\nPacific Palisades, California, U.S.\n\nNationality\n\nEducation\n\nWhen Moynahan was 7, she went to Longmeadow High School in Massachusetts from where she completed her graduation in 1989.\n\nBridget also went to the University of Massachusetts Amherst.\n\nOccupation\n\nActress, Model, author\n\nFamily\n\nFather – Edward Bradley Moynahan (Scientist & former administrator at the University of Massachusetts Amherst)\n\nEdward Bradley Moynahan (Scientist & former administrator at the University of Massachusetts Amherst) Mother – Mary Bridget (née Moriarty) (Former School Teacher)\n\nMary Bridget (née Moriarty) (Former School Teacher) Siblings – Sean Moynahan (Younger Brother), Andy Moynahan (Older Brother)\n\nManager\n\nShe is represented by these agencies (as an actress) –\n\nBrillstein Entertainment Partners\n\nInnovative Artists L.A.\n\nAs a model, she was signed with Ford Modeling Agency.\n\nBuild\n\nSlim\n\nHeight\n\n5 ft 9½ in or 177 cm\n\nWeight\n\n57 kg or 126 lbs\n\nBoyfriend / Spouse\n\nBridget Moynahan dated –\n\nTom Brady (2004-2006) – Moynahan started dating American footballer Tom Brady in 2004. But, the two broke up in December 2006. The couple had a boy named John Edward Thomas Moynahan (b. August 2007). McG (2010) – Moynahan briefly dated film director and producer, McG (also called Joseph McGinty Nichol) in September 2010. Andrew Frankel (2013-Present) – Moynahan commenced dating businessman Andrew Frankel in 2013. After dating for 2 years, the duo tied the knot on October 17, 2015 at The Hamptons.\n\nRace / Ethnicity\n\nWhite\n\nShe belongs to an Irish American family.\n\nHair Color\n\nDark Brown\n\nEye Color\n\nHazel\n\nSexual Orientation\n\nStraight\n\nDistinctive Features\n\nSlender body\n\nFlat Stomach\n\nMeasurements\n\n35-24-35 in or 89-61-89 cm\n\nDress Size\n\n2 (US) or 34 (EU)\n\nBra Size\n\n34A\n\nShoe Size\n\n10 (US)\n\nBrand Endorsements\n\nMoynahan has served as the brand ambassador of NYDJ, a denim line in 2014.\n\nBridget also became the face of Garnier’s skincare line in 2009.\n\nIn 2005, she was seen in TV and radio commercials about Comcast.\n\nReligion\n\nRoman Catholicism\n\nBest Known For\n\nAs an actress, Moynahan is best known for her roles in the movies I, Robot (2004) as Susan Calvin, and Lord of War (2005) as Ava Fontaine, and as Erin Reagan in the CBS police procedural drama series Blue Bloods.\n\nFirst Film\n\nMoynahan played the role of an apartment owner in her debut drama film Row Your Boat in 1999.\n\nFirst TV Show\n\nFrom 1999 to 2000, Moynahan played Natasha Naginsky in her debut show, the HBO romantic comedy series Sex and the City in 7 episodes.\n\nPersonal Trainer\n\nMoynahan says that she is extremely passionate about having a healthy lifestyle which is why she indulges in going to the gym regularly.\n\nSince her childhood, Moynahan has been into sports. She was the captain of her basketball team and also played soccer and lacrosse.\n\nShe also believes in taking naps as it is extremely important for the body.\n\nFor her diet, she eats a lot of vegetables, proteins and a low fat diet. She also says that the worst health habit would be indulging in coffee.\n\nBridget Moynahan Favorite Things\n\nFood – Swedish Meatballs\n\nSwedish Meatballs Book – This is Where I Leave You (By Jonathan Tropper)\n\n– This is Where I Leave You (By Jonathan Tropper) Beverage – Vodka\n\nSource – IMDb\n\nBridget Moynahan Facts"}, {"url": "https://www.rottentomatoes.com/celebrity/bridget_moynahan", "page_content": "Highest Rated: 89% John Wick: Chapter 2 (2017)\n\nLowest Rated: 8% Gray Matters (2006)\n\nBirthday: Apr 28, 1971\n\nBirthplace: Binghamton, New York, USA\n\nA statuesque brunette of Irish descent, Bridget Moynahan first turned heads as Mr. Big's fresh-faced wife Natasha on \"Sex and the City\" (HBO, 1998-2004), before landing roles in some of Hollywood's biggest blockbusters. Unfortunately, when she was unexpectedly cast in the real-life role of jilted girlfriend of NFL heartthrob Tom Brady, Moynahan found her professional résumé overshadowed by cheap tabloid gossip. A natural beauty, she began her career as a model, appearing in a number of fashion magazines before making the transition to acting. Following her debut on \"Sex and the City\" Moynahan found herself dancing on a bar in \"Coyote Ugly\" (2000), before moving on to a series of high-profile but unchallenging roles - usually as the girlfriend/fiancée/wife of the film's lead - in vehicles like \"Serendipity\" (2001), \"The Sum of All Fears\" (2002) and \"Lord of War\" (2005). With the news that football hero Brady had left her for supermodel Gisele Bundchen, followed by the revelation that the now single actress was pregnant with Brady's child, Moynahan found herself struggling to maintain a private life and a professional career in the midst of media firestorm. Although the press continued to feed on the scandal whenever the opportunity arose, Moynahan gradually began to refocus on her work again, with respectable turns in films like \"Ramona and Beezus\" (2010), as a cast member on the police procedural \"Blue Bloods\" (CBS, 2010- ), and a starring role in the apocalyptic science fiction action adventure \"Battle: Los Angeles\" (2011). Despite the efforts of some to pigeonhole her as \"just another pretty face\" or \"the jilted girlfriend,\" Moynahan continually challenged herself as she moved forward in both her personal and professional life."}, {"url": "https://outsider.com/entertainment/blue-bloods-star-bridget-moynahan-breakout-role-came-movie-featuring-ncis-star/", "page_content": "Before consistently playing an assistant district attorney on CBS’ “Blue Bloods” since 2010, Bridget Moynahan was dancing on slick, beer-coated countertops in an iconic film.\n\nMoynahan had her feature film debut in the cult classic film “Coyote Ugly” in 2000. She played a character named Rachel in the film. Rachel is one of three women that work at an iconic and trendy bar called “Coyote Ugly.”\n\nBridget Moynahan in ‘Coyote Ugly’\n\nThe girls dance and work the crowd, earning money and unforgettable nights. Violet Sanford, played by Piper Perabo, shows up one day. She’s in New York City trying to live out her dreams of being a singer-songwriter. She has terrible stage fright, however, the bars and the women that run it are a huge factor in helping her reach for those dreams.\n\nSimilar to “Blue Bloods,” Moynahan played a strong and empowered woman in “Coyote Ugly.” Viewers are introduced to Rachel by the bar manager, Lil. She says, “That’s Rachel, you can learn a lot from her.” To which Violet says, “She just cut some guy’s ponytail off.”\n\nLil says, “Yeah, the court ordered her to take anger-management classes after she pummeled a customer for grabbin’ her ass. He pressed charges, I gave her a raise.”\n\nIt doesn’t get more iconic than that.\n\nhttps://www.youtube.com/watch?v=FVYNNYyXdJE Video can’t be loaded because JavaScript is disabled: Bar Coyote Ugly (https://www.youtube.com/watch?v=FVYNNYyXdJE)\n\nIt was also where two future TV crime show stars would unite. Maria Bello also had a role in “Coyote Ugly.” She plays the bar manager that hired Rachel and is the boss of the other women. Fans may recognize her now as Special Agent Jacqueline “Jack” Sloane on “NCIS” from 2017 to 2021. She also had several film roles including “Lights Out,” “The Cooler,” “Payback,” and “Grown Ups.”\n\nThe two women are quite the dynamic duo in the film.\n\nBridget Moynahan sat down for an interview on “Live with Kelly and Ryan” to talk about the 20-year anniversary of the movie in 2020. She told the hilarious story of her 13-year-old son watching the movie for the first time during the pandemic.\n\n“He’s like closing his eyes when I’m on the bar … he’s like, ‘Mom, you were really wild when you were younger.'”\n\nMoynahan Talks ‘Coyote Ugly’\n\nAlthough it’s been about 21 years since her role in “Coyote Ugly,” it remains one of Bridget Moynahan’s most recognizable roles.\n\nOn “Blue Bloods” her character is typically dressed in business attire. That means a lot of blazers and some fancy blouses.\n\nIn “Coyote Ugly,” it was all about that now questionable 2000s fashion. The fashion in the film is something she will always remember, possibly even regret.\n\n“I feel a little bit bad about that film because I think we were responsible for just every woman wearing really low-slung pants that maybe don’t naturally fit well on people. So I think we started a movement that maybe we should reconsider,” Moynahan said in 2014 to HuffPost.\n\nAt the time, low-rise jeans were on the rise. Now, these kinds of jeans have left the room and were replaced by a higher-rise fit. It’s something Moynahan surely is thankful for every day.\n\nShe joked that if there was ever a sequel, everyone needs to wear “high-waisted leather pants instead.” Maybe a sequel would create another pants revolution.\n\nIf you’re missing the days of bar counter dancing and low-waisted jeans, there are several bars throughout the country and the world. Locations include several in Texas, the original in New York, Las Vegas, Tennessee, and others. There’s even a clothing store that sells a variety of different products.\n\nLuckily, there’s no low-rise pants for sale."}, {"url": "https://www.thelist.com/278212/the-coyote-ugly-cast-is-all-still-crazy-gorgeous-now/", "page_content": "In Coyote Ugly, Tyra Banks plays a rather minor role as a bartender who leaves to pursue a college degree in law. But in real life, Banks continued to focus on her modeling and her TV career. According to her Biography profile, Banks appeared on the cover of GQ in 1996, making her the first African American female to do so. She won several awards as her super modeling career took off during this time period. As if these accomplishments weren't enough, Banks also pursued acting, starring in several films and ultimately became the host of the hit TV show America's Next Top Model, though there's been some controversy surrounding her actions on the show, according to CNN. She'd go on to host America's Got Talent, as well.\n\nBanks later became the host of Dancing With the Stars, and she's had her share of embarrassing moments there as well. She discussed one of these moments with Us Weekly, referring to her many outfit changes on the show and one in particular that didn't go so smoothly. Banks said, \"Then we forgot to put my fancy shoes on for the second [half of the show]. I had to run [and] put the fancy shoes on. It was a hot mess. And then I walk out and it's just, you have no idea. ... it's crazy!\"\n\nDespite this, Banks is still gorgeous and is rocking her roles in the public eye."}, {"url": "https://outsider.com/entertainment/blue-bloods-bridget-moynahan-celebrates-coyote-ugly-21-anniversary-with-throwback-photo/", "page_content": "“Blue Bloods” star Bridget Moynahan is celebrating one of her earliest roles this week. That role, of course, was as the bartender and dancer Rachel in the hit 2000 film “Coyote Ugly.”\n\nMoynahan took to social media this week to remind fans of the film’s upcoming 21st anniversary. It is this film that got the future “Blue Bloods” star’s career off and running.\n\nOn Instagram on Thursday, July 29, she posted a photo from the film with two of her costars. She also added the caption: “‘Coyote Ugly’ turns 21 on Wednesday! Did you see it in the theater? … #coyoteugly #tbt #throwbackthursday #throwback #rachelrocks #bada**.”\n\nMoynahan also tagged her costars and others behind the making of the film in the post. They are Piper Perabo, Izabella Miko, Tyra Banks, Maria Bello, Leann Rimes, Adam Garcia, songwriter Diane Warren, and famous producer Jerry Bruckheimer.\n\nOne of her “Coyote Ugly” costars responded to Bridget Moynahan’s Instagram post celebrating the film’s anniversary.\n\n“That’s actually insane! That’s a whole adult person legally allowed to drink,” Cammie actress Izabella Miko also shared on Instagram.\n\nAlso, more than 7,100 Instagram users had liked the anniversary post by the “Blue Bloods” less than one day after it appeared online. One of those likes came from her “Blue Bloods” costar, Abigail Hawk.\n\nThere are a few things you might not know about “Coyote Ugly.” For example, Bridget Moynahan’s height led the film’s set designers to raise the bar above the counter. They feared she would hurt herself while dancing on the bar if they didn’t. Tyra Banks was actually injured on the set. She reportedly tore her lateral meniscus while dancing.\n\nA very popular country music star provided the singing voice for Piper Perabo’s character, Violet. That star was none other than LeAnn Rimes.\n\nBridget Moynahan, ‘Blue Bloods’ Cast Filming Show’s 12th Season\n\nFlash forward 10 years after “Coyote Ugly” and you will find Bridget Moynahan beginning her tenure as attorney Erin Reagan on the hit CBS show “Blue Bloods.”\n\nFlash forward another 11 years to July 2021 and you will find Moynahan and the rest of the “Blue Bloods” cast working hard on the show’s 12th season. The cast and crew went back to work filming earlier this month. Since that time, members of the cast have shared photos from the set.\n\nFor example, Donnie Wahlberg, who plays Detective Danny Reagan, one of Erin’s brothers, shared an image captured by ET Canada from the set. Wahlberg posted the photo to his Instagram account. The image shows the actor and his costar, Marisa Ramirez. She plays Danny’s partner, Detective Maria Baez.\n\nBridget Moynahan has also shared a photo from the production. In her Instagram post, she appears with costar Steve Schirripa. He plays Detective Anthony Abetemarco. They are all smiles and appear to be having a great time.\n\nThe 12th season of “Blue Bloods” will debut on CBS on Oct. 1."}, {"url": "https://people.com/movies/coyote-ugly-where-are-they-now/", "page_content": "01 of 09 The Cast of 'Coyote Ugly' Patrick Demarchelier/Touchstone/Kobal/Shutterstock Over two decades ago, Piper Perabo, Tyra Banks, Maria Bello, Bridget Moynahan and Izabella Miko came dancing onto screens as the drink-slinging, fast-moving ladies of the musical comedy Coyote Ugly. Here's what Perabo and the rest of the cast are up to now.\n\n02 of 09 Piper Perabo as Violet Sanford Everett Collection; Alberto E. Rodriguez/Getty Perabo burst onto the scene as the film's star, wannabe singer Violet Sanford, who moves from New Jersey to New York City to pursue her dreams — and ends up joining the Coyote Ugly crew. After the movie hit theaters, Perabo found steady film work before scoring her role on Covert Affairs, which earned her a Golden Globe nomination. In 2014, she wed director-producer Stephen Kay. In 2021, she joined the cast of Paramount Network's Yellowstone.\n\n03 of 09 Tyra Banks as Zoe Everett Collection; Amy Sussman/Getty Already a major mover in the modeling world when Coyote Ugly came out, Banks made her mark in the film as bartender Zoe. In a 2018 interview with PEOPLE, she shared she's \"dying\" to do a sequel. \"I want to produce it — I just need to get the rights from Mr. Jerry Bruckheimer or work with him.\" Since 2020, Banks has been the host of Dancing with the Stars.\n\n04 of 09 Maria Bello as Lil Everett Collection; Amanda Edwards/WireImage As the bar's tough but fair owner, Bello's Lil gave Violet her chance, then took it away and gave her another opportunity. Best known for her work on ER, Bello has also appeared in films such as A History of Violence (2005), Grown Ups (2010) and Lights Out (2016) and on the series Goliath and NCIS. The actress got engaged to chef Dominique Crenn in December 2019, and she shares a son with her screenwriter ex-boyfriend, Dan McDermott.\n\n05 of 09 Izabella Miko as Cammie Everett Collection; Jeffrey Mayer/WireImage Coyote Ugly was the Polish actress' first Hollywood role, opening doors to parts in music videos and films like Save the Last Dance 2 (2006) and Step Up All In (2014). She also appeared on the TV series NCIS: Hawai'i in 2022.\n\n07 of 09 John Goodman as Bill Sanford Everett Collection; Theo Wargo/Getty A big name on both the big and small screen by 2000, Goodman starred as Violet's loving but over-protective father, who discouraged her new career path after seeing a racy photo of her in the newspaper (though he later changed his tune). Goodman's career hasn't slowed down, with roles on myriad TV shows and movies, including Argo (2012), Flight (2012) and 10 Cloverfield Lane (2016). In 2018, he began starring on the ABC series The Conners. He's been married to Annabeth Hartzog since 1989, and they share one daughter.\n\n08 of 09 Adam Garcia as Kevin O'Donnell Everett Collection; Eamonn M. McCormack/Getty Images The film's casting director actually asked Garcia to fly to Los Angeles for an audition after catching him in the Saturday Night Fever musical on London's West End. Playing Violet's boyfriend, Kevin, opened many doors for the Aussie actor, who got his own dance moment on the Coyote Ugly bar and has since appeared in films like Death on the Nile (2022). He's been married to Nathalia Chubin since 2015 and has two children."}, {"url": "https://www.huffpost.com/entry/bridget-moynahan-coyote-ugly_n_5107338", "page_content": "When \"Coyote Ugly\" premiered in 2000, it quickly became a box office success. But the movie was also responsible for launching a fashion trend that the film's star Bridget Moynahan regrets.\n\n\"I feel a little bit bad about that film because I think we were responsible for just every woman wearing really low-slung pants that maybe don't naturally fit well on people,\" she explained to host Ricky Camilleri on HuffPost Live. \"So I think we started a movement that maybe we should reconsider.\"\n\nAdvertisement\n\nAt the time \"Coyote Ugly\" was released, low-rise jeans were just gaining popularity. After seeing Moynahan and the movie's other actresses, including Piper Perabo, Maria Bello and Tyra Banks, dance throughout the film wearing low-cut pants, many fans embraced the fashion trend, which would quickly become ubiquitous in the 2000s.\n\nThe movie's popularity also helped the bar, which has locations around the world, promote its clothing store, which sells t-shirts, sweatshirts, gloves and underwear -- but no low-rise jeans."}, {"url": "https://www.celebritynetworth.com/richest-celebrities/actors/bridget-moynahan-net-worth/", "page_content": "Info Category: Richest Celebrities › Actors Net Worth: $25 Million Date of Birth: Apr 28, 1970 (53 years old) Place of Birth: Binghamton Gender: Female Height: 5 ft 9 in (1.77 m) Profession: Model, Actor Nationality: United States of America 💰 Compare Bridget Moynahan's Net Worth\n\nWhat is Bridget Moynahan's Net Worth and Salary?\n\nBridget Moynahan is an American actress and model who has a net worth of $25 million. Bridget Moynahan is known for appearing on magazine covers and starring in films and television shows, such as \"Sex and the City\" (1999–2000), \"Serendipity\" (2001), and \"I, Robot\" (2004). Bridget played Helen Wick in 2014's \"John Wick\" and its 2017 sequel, and has starred as ADA Erin Reagan on the CBS series \"Blue Bloods\" since 2010. As of this writing, Bridget has appeared in more than 220 episodes of the series, and for the first several seasons she earned $60,000 per episode. She reportedly makes around $100,000 per episode now, which translates to around $3 million per season. In 2017, Moynahan and Wendy Howard Goldberg released \"The Blue Bloods Cookbook: 120 Recipes That Will Bring Your Family to the Table.\"\n\nEarly Life\n\nBridget Moynahan was born Kathryn Bridget Moynahan on April 28, 1971, in Binghamton, New York. Her mother, Mary, was a school teacher, and her father, Bradley, was a scientist who formerly served as an administrator at the University of Massachusetts Amherst. Bridget grew up with brothers Sean and Andy in Binghamton and Longmeadow, Massachusetts, and she was the captain of the girls' basketball, soccer, and lacrosse teams at Longmeadow High School. Moynahan graduated in 1989 and attended the University of Massachusetts Amherst while pursuing a modeling career. She was signed by a modeling agency after accompanying a friend to an audition in Springfield, Massachusetts.\n\nCareer\n\nBridget began modeling for Springfield department store catalogs, and after moving to New York at age 18, she graced the covers of magazines such as \"Elle,\" \"Vogue,\" and \"Glamour.\" She started doing commercials for shampoo and soap brands and took acting classes at the Caymichael Patten Studio. Moynahan made her acting debut in 1999, appearing in the independent film \"Row Your Boat\" and beginning a seven-episode stint as Natasha Naginsky on HBO's \"Sex and the City.\" In 2000, Bridget appeared in four films: \"Coyote Ugly\" (which grossed $113.9 million at the box office), \"Whipped,\" \"In the Weeds,\" and \"Trifling with Fate.\" She co-starred with John Cusack in 2001's \"Serendipity\" and with Morgan Freeman and Ben Affleck in the 2002 spy thriller \"The Sum of All Fears.\" Moynahan played a CIA trainee in 2003's \"The Recruit,\" then co-starred with Will Smith in 2004's \"I, Robot,\" a massive hit with a worldwide gross of $347.2 million.\n\nIn 2005, Bridget appeared in the Nicolas Cage crime drama \"Lord of War,\" and she starred on the ABC drama \"Six Degrees\" from 2006 to 2007. Around this time, she also appeared in the films \"Gray Matters\" (2006), \"Unknown\" (2006), \"Prey\" (2007), and \"Noise\" (2007). Moynahan guest-starred on ABC's \"Eli Stone\" in 2008, and in 2009, she starred in the television film \"Bunker Hill\" and signed a deal to appear in TV and print ads for Garnier. In 2010, she played Dorothy Quimby in the film \"Ramona and Beezus,\" which is based on the popular children's book series by Beverly Cleary. That year, Bridget also began co-starring with Tom Selleck and Donnie Wahlberg on the police procedural \"Blue Bloods.\" She played a veterinarian trying to survive an alien invasion in 2011's \"Battle: Los Angeles,\" which was panned by critics but earned $211.8 million at the box office. Moynahan then appeared in the films \"Small Time\" (2014), \"Midnight Sun\" (2014), and \"Crown Vic\" (2019), and she portrayed John Wick's late wife in 2014's \"John Wick\" and 2017's \"John Wick: Chapter 2.\"\n\nPersonal Life\n\nBridget was in a relationship with screenwriter Scott Rosenberg in the early 2000s, and after they split in 2003, she began dating NFL quarterback Tom Brady in 2004. They ended their relationship in late 2006, and in February 2007, Bridget's representative revealed that Moynahan was pregnant with Brady's child. Their son, John Edward Thomas Moynahan, was born on August 22, 2007. In 2010, Bridget dated director McG, and she married businessman Andrew Frankel on October 17, 2015; Moynahan is stepmother to Frankel's three sons from a previous marriage.\n\nReal Estate\n\nIn 2014, Moynahan paid $4.63 million for a 2,793 square foot apartment in the Tribeca neighborhood of New York City. The home includes three bedrooms, 2.5 bathrooms, arched windows, and walnut flooring."}]}