{"George Hubbard Clapp was a major benefactor of the University of Pennsylvania and donated money for the construction of the George H. Clapp Laboratory, the Clapp Hall dormitory, and the Clapp Memorial Library.": [{"url": "https://nnp.wustl.edu/library/PersonDetail/440", "page_content": "George Hubbard Clapp\n\nBiography\n\nBorn in Allegheny, Pennsylvania.Graduate of Western University of Pennsylvania, now University of Pittsburgh. He would become Clapp president of the board of trustees of the University of Pittsburgh and prior to his death he was the oldest living graduate. He was one of the founders and president of Aluminum Company of America. Second cousin of John Henry Clapp.\n\nClapp had an extensive collection of conch shells that were donated to the Carnegie Museum. His collection of large cents included all the varieties called \"collectible\" by Sheldon. He exhibited uncirculated large cents at the 1935 ANA convention. His second set of large cents was donated to the Carnegie Institute. An extensive exhibit was prepared when the ANA convention was held in Pittsburgh. In 1937 he donated his first quality set of 1452 large cents to the American Numismatic Society in New York. He died in Pittsburgh.\n\nAuthor of The United States Cents of the Years 1798-1799 in 1931. One hundred twenty-six cloth bound copies and nine leather bound presentation copies were issued. Author of The United States Cents 1804-1814 as part of the Coin Collector Series in 1941. Author with Howard Newcomb of The United States Cents of the Years 1795-1796, 1797, and 1800 in 1947.\n\nobit: NUM 62 June 1949 page 361; NYT 4/1/49\n\nSource credit: Pete Smith, American Numismatic Biographies"}, {"url": "https://www.wikiwand.com/en/Clapp_Hall", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Clapp Hall?\n\nSummarize this article for a 10 years old"}, {"url": "https://en-academic.com/dic.nsf/enwiki/6423690", "page_content": "George Hubbard Clapp (1858-1949) was an American pioneer in the aluminium industry and also a numismatist .\n\nHe was born on December 14 in Allegheny City, Pennsylvania , now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh , in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt , he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a compamy in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon . The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminium process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests suplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River . He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather started him shell collecting. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh . In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology , today's Carnegie Mellon University and a member of the American Chemical Society .\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania . Clapp Hall , an academic building on the Pitt campus, is named in his honor.\n\nReferences\n\n* cite book | author=Alberts, Robert C. | title=Pitt: The Story of the University of Pittsburgh 1787-1987 | location=Pittsburgh | publisher= University of Pittsburgh Press | year=1987 | id=ISBN 0-8229-1150-7\n\n* cite journal | title=Pennsylvania Western | location=Pittsburgh | publisher=Western University of Pennsylvania | year=1886 | volume=5 | issue=5 | pages=129 | url=http://digital.library.pitt.edu/cgi-bin/t/text/pageviewer-idx?c=pittpennwest;cc=pittpennwest;g=documentingpitt;xc=1;xg=1;q1=george%20hubbard%20clapp;rgn=full%20text;idno=e36717v05n05;didno=e36717v05n05;view=image;seq=30;page=root;size=s;frm=frameset;"}, {"url": "https://prabook.com/web/george.clapp/2302796", "page_content": "George Clapp\n\nZoologist\n\nDecember 14, 1858 (age 90) Allegheny City, Pennsylvania , United States\n\nClapp took an engineering position at Park Brothers\" Black Diamond Steel Works. There, along with Captain Alfred East. Hunt, he established the Pittsburgh Testing Laboratory\"s chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew West. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company\"s working capital. As Clapp\"s wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie. Beginning in 1907 until his death, Clapp was president of Pitt\"s Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor. Clappia Walker, 1909 Planogyra clappi (Pilsbry, 1898)."}, {"url": "https://wiki2.org/en/Clapp_Hall", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nUnited States historic place\n\nGeorge Hubbard Clapp Hall is a contributing property to the Schenley Farms National Historic District[1][2] on the campus of the University of Pittsburgh in the Oakland section of Pittsburgh, Pennsylvania. The six-story Gothic Revival structure, designed by Trautwein & Howard,[2] was completed in 1956 and serves as the primary facility of the University of Pittsburgh Department of Biological Sciences. It contains laboratories, classrooms, a greenhouse, and an amphitheater-style lecture hall with 404 seats.[3][4]\n\nYouTube Encyclopedic\n\n1 / 5 Views: 13 541 917 729 20 370 1 842 1 583\n\nClap It Out - Learn Syllables | Songs For Kids | Dance Along | GoNoodle\n\nCelebrate the Opening of Wellesley's Science Complex\n\nUniversity of Pittsburgh | Pitt | 8K Campus Drone Tour\n\nUniversity of Pittsburgh 4K Tour + Writing the Application Essays\n\nLibraries as Spaces for Teaching, Learning and Research: The Learning Commons Model Transcription\n\nArchitecture\n\nThe Ruskin Street side of Clapp Hall\n\nClapp Hall was designed by Trautwein & Howard, a successor to architectural firm of Charles Klauder who designed the university's gothic Cathedral of Learning, Stephen Foster Memorial, and Heinz Memorial Chapel.[2]\n\nClapp Hall's exterior and interior spaces have been described as a mix of Collegiate Gothic and Art Deco.[2] The building features a diagonally-positioned entrance that creates a direct axis with the Cathedral of Learning which is framed in Clapp Hall's stone portal entryway. The building is clad in textured Indiana limestone to match the stone used on the Cathedral of Learning. The building's use of aluminum windows has been suggested to be a quiet homage to the work of aluminum magnate George Hubbard Clapp, the building's namesake.[2] The lobby of Clapp Hall is streamlined Art Deco in character, with terrazzo flooring and stainless steel doors, and is thus more stylistically modern than its exterior which is meant to reflect the Cathedral of Learning. It has been suggested that the lobby reveals a struggle in the design process to find a balance between the traditional gothic and more contemporary design elements.[5]\n\nHistory\n\nGeorge Hubbard Clapp\n\nOriginal plans slated Clapp Hall to be built adjacent to the Cathedral of Learning facing the Masonic Temple, on the south side of Fifth Avenue, between the Cathedral and Heinz Memorial Chapel. Concerns over adding more buildings to the Cathedral of Learning lawn and impinging on the lawn's rare open space prompted a change to its current site across Fifth Avenue and effectively ended above-ground development of the Cathedral lawn space.[6]\n\nThe 3-acre (12,000 m2) plot of land that Clapp Hall was constructed on was purchased for $675,000 ($6.8 million today) as a gift for the university by the A.W. Mellon Educational and Charitable Trust.[7] Ground was broken for Clapp Hall in 1954[8] and the building was completed in 1956. The six-story building cost $2.5 million ($24.9 million today) and it was initially used only for freshman chemistry, although other sciences soon moved into the building.[9] it is conjoined with Langley and Crawford Halls, which were added in later stages, and forms the three-building Clapp/Langley/Crawford Complex. The triangular courtyard at the southwest entry to Clapp Hall, facing the Cathedral of Learning, was modified in 2004 to accommodate trees and benches.[2]\n\nThe building is named for George Hubbard Clapp (1858–1949), an alumnus (class of 1877) and president of Pitt's board of trustees for more than 40 years. Clapp was one of five responsible for the first commercial production of aluminum and was a founder of the Aluminum Company of America.[10]\n\nUse\n\nThe six-story structure contains laboratories, classrooms, and an amphitheater-style lecture hall with 404 seats.[3] A greenhouse, used mostly for teaching, is located on the fourth floor of Clapp Hall.[4] Clapp Hall originally housed Pitt's Departments of Physics, Chemistry, Biology, Metallurgy, and Chemical Engineering.[3] Today the Department of Biological Sciences occupies the building.\n\nReferences\n\nAlberts, Robert C. (1987). Pitt: The Story of the University of Pittsburgh 1787-1987. Pittsburgh: University of Pittsburgh Press. ISBN 0-8229-1150-7 ."}, {"url": "https://peoplepill.com/people/george-hubbard-clapp/", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nTaxa named in honour"}, {"url": "https://alchetron.com/Clapp-Hall", "page_content": "George Hubbard Clapp Hall is a contributing property to the Schenley Farms National Historic District[2][3] on the campus of the University of Pittsburgh in the Oakland section of Pittsburgh, Pennsylvania. The six-story Gothic Revival structure, designed by Trautwein & Howard, was completed in 1956 and serves as the primary facility of the University of Pittsburgh Department of Biological Sciences. It contains laboratories, classrooms, a greenhouse, and an amphitheater-style lecture hall with 404 seats.\n\nArchitecture\n\nClapp Hall was designed by Trautwein & Howard, a successor to architectural firm of Charles Klauder who designed the university's gothic Cathedral of Learning, Stephen Foster Memorial, and Heinz Memorial Chapel.\n\nClapp Hall's exterior and interior spaces have been described as a mix of Collegiate Gothic and Art Deco. The building features a diagonally-positioned entrance that creates a direct axis with the Cathedral of Learning which is framed in Clapp Hall's stone portal entryway. The building is clad in textured Indiana limestone to match the stone used on the Cathedral of Learning. The building’s use of aluminum windows has been suggested to be a quiet homage to the work of aluminum magnate George Hubbard Clapp, the building's namesake. The lobby of Clapp Hall is streamlined Art Deco in character, with terrazzo flooring and stainless steel doors, and is thus more stylistically modern than its exterior which is meant to reflect the Cathedral of Learning. It has been suggested that the lobby reveals a struggle in the design process to find a balance between the traditional gothic and more contemporary design elements.\n\nHistory\n\nOriginal plans slated Clapp Hall to be built adjacent to the Cathedral of Learning facing the Masonic Temple, on the south side of Fifth Avenue, between the Cathedral and Heinz Memorial Chapel. Concerns over adding more buildings to the Cathedral of Learning lawn and impinging on the lawn's rare open space prompted a change to its current site across Fifth Avenue and effectively ended above-ground development of the Cathedral lawn space.\n\nThe 3-acre (12,000 m2) plot of land that Clapp Hall was constructed on was purchased for $675,000 ($6.0 million today) as a gift for the university by the A.W. Mellon Educational and Charitable Trust. Ground was broken for Clapp Hall in 1954 and the building was completed in 1956. The six-story building cost $2.5 million ($22.0 million today) and it was initially used only for freshman chemistry, although other sciences soon moved into the building. it is conjoined with Langley and Crawford Halls, which were added in later stages, and forms the three-building Clapp/Langley/Crawford Complex. The triangular courtyard at the southwest entry to Clapp Hall, facing the Cathedral of Learning, was modified in 2004 to accommodate trees and benches.\n\nThe building is named for George Hubbard Clapp (1858–1949), an alumnus (class of 1877) and president of Pitt's Board of Trustees for more than 40 years. Clapp was one of five responsible for the first commercial production of aluminum and was a founder of the Aluminum Company of America.\n\nUse\n\nThe six-story structure contains laboratories, classrooms, and an amphitheater-style lecture hall with 404 seats. A greenhouse, used mostly for teaching, is located on the four floor of Clapp Hall. Clapp Hall originally housed Pitt's Departments of Physics, Chemistry, Biology, Metallurgy, and Chemical Engineering.[4] Today the Department of Biological Sciences occupies the building."}, {"url": "https://www.tour.pitt.edu/tour/clapp-langley-and-crawford-halls", "page_content": "The Clapp/Langley/Crawford complex comprises three interconnected buildings and the Life Science Annex. Together, they house Pitt’s Departments of Biological Sciences and Neuroscience.\n\nClapp Hall, named for aluminum executive George Hubbard Clapp, is a six-story structure that is the primary home of the biological sciences department.\n\nLangley Hall also houses biological sciences facilities, as well as the 77,000-volume Langley Library, which is the biology, neuroscience, psychology, and life sciences unit of Pitt’s University Library System. The building was named after Samuel P. Langley, a 19th-century Pitt astronomy professor who pioneered heavier-than-air flight and later served as a Smithsonian Institution Secretary. His Aerodrome No. 6, one of only two surviving Langley aircraft, hangs from the ceiling of Wesley W. Posvar Hall.\n\nCrawford, dedicated in 1969 and the last of the three buildings to be constructed, is home to the neuroscience department. It was named after Stanton C. Crawford, Pitt’s 13th chancellor.\n\nThe Life Science Annex, an expansion of the complex that includes labs and neuroscience research programs among other facilities, opened in October 2007."}, {"url": "http://dictionary.sensagent.com/George_Hubbard_Clapp/en-en/", "page_content": "From Wikipedia\n\nGeorge Hubbard Clapp\n\nGeorge Hubbard Clapp (1858-1949) was an American pioneer in the aluminium industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a compamy in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminium process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests suplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather started him shell collecting. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nReferences\n\n\n\n"}, {"url": "https://en-academic.com/dic.nsf/enwiki/6436175", "page_content": "George Hubbard Clapp Hall is a contributing property to the Schenley Farms National Historic District[3][4] on the campus of the University of Pittsburgh in the Oakland section of Pittsburgh, Pennsylvania. The six-story Gothic Revival structure, designed by Trautwein & Howard,[2] was completed in 1956 and serves as the primary facility of the University of Pittsburgh Department of Biological Sciences. It contains laboratories, classrooms, a greenhouse, and an amphitheater-style lecture hall with 404 seats.[3][4]\n\nArchitecture\n\nClapp Hall was designed by Trautwein & Howard, a successor to architectural firm of Charles Klauder who designed the university's gothic Cathedral of Learning, Stephen Foster Memorial, and Heinz Memorial Chapel.[2]\n\nClapp Hall's exterior and interior spaces have been described as a mix of Collegiate Gothic and Art Deco.[2] The building features a diagonally-positioned entrance that creates a direct axis with the Cathedral of Learning which is framed in Clapp Hall's stone portal entryway. The building is clad in textured Indiana limestone to match the stone used on the Cathedral of Learning. The building’s use of aluminum windows has been suggested to be a quiet homage to the work of aluminum magnate George Hubbard Clapp, the building's namesake.[2] The lobby of Clapp Hall is streamlined Art Deco in character, with terrazzo flooring and stainless steel doors, and is thus more stylistically modern than its exterior which is meant to reflect the Cathedral of Learning. It has been suggested that the lobby reveals a struggle in the design process to find a balance between the traditional gothic and more contemporary design elements.[5]\n\nHistory\n\nOriginal plans slated Clapp Hall to be built adjacent to the Cathedral of Learning facing the Masonic Temple, on the south side of Fifth Avenue, between the Cathedral and Heinz Memorial Chapel. Concerns over adding more buildings to the Cathedral of Learning lawn and impinging on the lawn's rare open space prompted a change to its current site across Fifth Avenue and effectively ended above-ground development of the Cathedral lawn space.[6]\n\nThe 3-acre (12,000 m2) plot of land that Clapp Hall was constructed on was purchased for $675,000 as a gift for the university by the A.W. Mellon Educational and Charitable Trust.[7] Ground was broken for Clapp Hall in 1954[8] and the building was completed in 1956. The six-story building cost $2.5 million and it was initially used only for freshman chemistry, although other sciences soon moved into the building.[9] it is conjoined with Langley and Crawford Halls, which were added in later stages, and forms the three-building Clapp/Langley/Crawford Complex. The triangular courtyard at the southwest entry to Clapp Hall, facing the Cathedral of Learning, was modified in 2004 to accommodate trees and benches.[2]\n\nThe building is named for George Hubbard Clapp (1858–1949), an alumnus (class of 1877) and president of Pitt's Board of Trustees for more than 40 years. Clapp was one of five responsible for the first commercial production of aluminum and was a founder of the Aluminum Company of America.[5]\n\nUse\n\nThe six-story structure contains laboratories, classrooms, and an amphitheater-style lecture hall with 404 seats.[3] A greenhouse, used mostly for teaching, is located on the four floor of Clapp Hall.[4] Clapp Hall originally housed Pitt's Departments of Physics, Chemistry, Biology, Metallurgy, and Chemical Engineering.[6] Today the Department of Biological Sciences occupies the building.\n\nReferences"}]}