{"George Hubbard Clapp was born in Philadelphia, Pennsylvania.": [{"url": "https://nnp.wustl.edu/library/PersonDetail/440", "page_content": "George Hubbard Clapp\n\nBiography\n\nBorn in Allegheny, Pennsylvania.Graduate of Western University of Pennsylvania, now University of Pittsburgh. He would become Clapp president of the board of trustees of the University of Pittsburgh and prior to his death he was the oldest living graduate. He was one of the founders and president of Aluminum Company of America. Second cousin of John Henry Clapp.\n\nClapp had an extensive collection of conch shells that were donated to the Carnegie Museum. His collection of large cents included all the varieties called \"collectible\" by Sheldon. He exhibited uncirculated large cents at the 1935 ANA convention. His second set of large cents was donated to the Carnegie Institute. An extensive exhibit was prepared when the ANA convention was held in Pittsburgh. In 1937 he donated his first quality set of 1452 large cents to the American Numismatic Society in New York. He died in Pittsburgh.\n\nAuthor of The United States Cents of the Years 1798-1799 in 1931. One hundred twenty-six cloth bound copies and nine leather bound presentation copies were issued. Author of The United States Cents 1804-1814 as part of the Coin Collector Series in 1941. Author with Howard Newcomb of The United States Cents of the Years 1795-1796, 1797, and 1800 in 1947.\n\nobit: NUM 62 June 1949 page 361; NYT 4/1/49\n\nSource credit: Pete Smith, American Numismatic Biographies"}, {"url": "https://nnp.library.wustl.edu/concern/people/Person440?locale=en", "page_content": "Born in Allegheny, Pennsylvania.Graduate of Western University of Pennsylvania, now University of Pittsburgh. He would become president of the board of trustees of the University of Pittsburgh and prior to his death he was the oldest living graduate. He was one of the founders and president of Aluminum Company of America. Second cousin of John Henry Clapp.\n\nClapp had an extensive collection of conch shells that were donated to the Carnegie Museum. His collection of large cents included all the varieties called \"collectible\" by Sheldon. He exhibited uncirculated large cents at the 1935 ANA convention. His second set of large cents was donated to the Carnegie Institute. An extensive exhibit was prepared when the ANA convention was held in Pittsburgh. In 1937 he donated his first quality set of 1452 large cents to the American Numismatic Society in New York. He died in Pittsburgh.\n\nAuthor of The United States Cents of the Years 1798-1799 in 1931. One hundred twenty-six cloth bound copies and nine leather bound presentation copies were issued. Author of The United States Cents 1804-1814 as part of the Coin Collector Series in 1941. Author with Howard Newcomb of The United States Cents of the Years 1795-1796, 1797, and 1800 in 1947.\n\nobit: NUM 62 June 1949 page 361; NYT 4/1/49"}, {"url": "https://peoplepill.com/people/george-hubbard-clapp/", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nTaxa named in honour"}, {"url": "https://popularbio.com/george-hubbard-clapp/", "page_content": "Updated On April 30, 2023\n\nGeorge Hubbard Clapp estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is George Hubbard Clapp in 2019-2020? Scroll below and check more details information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nGeorge Hubbard Clapp was born in Allegheny, Pennsylvania on December 14, 1858.\n\nOn Popular Bio, George Hubbard Clapp is one of the successful Biologist. George has ranked on the list of those famous people who were born on December 14, 1858. George Hubbard Clapp is one of the Richest Biologist who was born in United States. George Hubbard Clapp also has a position among the list of Most popular Biologist.\n\nShort Profile First Name George Last Name Clapp Profession Biologist Died 90 years (age at death) Birth Sign Sagittarius Birth Date December 14, 1858 Birth Place Allegheny, Pennsylvania Country United States\n\nGeorge Hubbard Clapp Net Worth\n\nGeorge Hubbard Clapp estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is George Hubbard Clapp in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Biologist George Hubbard Clapp’s net worth is $1-5 Million before died. George Hubbard Clapp earned the money being a professional Biologist. George Hubbard Clapp is from United States.\n\nGeorge Hubbard Clapp’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 Under Review Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Biologist (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nGeorge Hubbard Clapp has been died on 90 years (age at death). George Hubbard Clapp’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is George Hubbard Clapp Dating?\n\nGeorge Hubbard Clapp keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at George Hubbard Clapp past relationships, ex-girlfriends and previous hookups. George Hubbard Clapp prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About George Hubbard Clapp"}, {"url": "https://www.findagrave.com/memorial/121821273/george-hubbard-clapp", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://coinappraiser.com/rare-coin-knowledge-center/the-clapps-of-numismatics/", "page_content": "Introduction\n\nBy chance, probably, the surname of Clapp has been one of the most prominent in numismatics. There are also some Clapps who appear in the annals of our hobby here and there, but of which we know relatively little. In this category of obscurity we have the Clapp of Clapp, Fuller & Browne’s Bank Note Reporter and Counterfeit Detecter, a “detecter” of questionable bank notes, who seems to have been located in Buffalo, New York. We also mention the unknown D.C. Clapp, who in the 1890s sold coins to the well-known John M. Clapp.\n\nJohn M. Clapp\n\nJohn Martin Clapp was born in Mercer, Pennsylvania, in 1835, one of six children of Rev. Ralph and Sally (Hubbard) Clapp. Apparently, spreading The Word among the flock did not pay all of Rev. Ralph’s bills, for he was also the proprietor of a general store in President Township, in Pennsylvania, where young John M. helped with duties, no doubt seeing many large copper cents in daily trade, and whatever else came across the counter. The family was also involved in the building of the President blast furnace in 1854-1855, located about a mile from where Hemlock Creek joined the Allegheny River. During this era, central Pennsylvania was dotted with such furnaces, typically tall structures made of limestone, which were used for the smelting of iron ore. Some still stand today and are interesting to view. (Here in our own New Hampshire, there is but one remaining, the Franconia Iron Furnace.) In 1860, John M. Clapp purchased much of his father’s property. In the meantime, in 1858, Col. Drake had discovered oil in Titusville, setting of a great speculative flurry.\n\nIn 1862, Clapp recruited a company for the Army and went into service as a captain in Col. Chapman Biddle’s 121st Pennsylvania Volunteers. In August 1863 he was discharged under a certificate of disability, and returned home. In 1865 he took Anna M. Pearson, of New Castle, Pennsylvania, as his wife. The union produced four children, the most important of whom (for purposes of this article) was John H., born on April 16, 1880.\n\nIn the 1860s, John M. Clapp was in the right place at the right time. By poking around here and there on his thousands of acres in President Township, he found a lot of oil, leading to a fortune, and more. In time he also became involved in the flour milling and trading business. By the 1890s he had addresses in Tidioute and Knox, Pennsylvania, and in Washington, D.C., where in the latter place he was involved with banking. In Lakewood, New York, the family had a summer home.\n\nSomewhere, somehow he became a coin collector, and by the late 1880s was quite serious about it. Circa 1893, perhaps inspired by Augustus G. Heaton’s Treatise on Mint Marks published that year, he began ordering coins directly from the branch mints, perhaps the only numismatist of the mid-1890s to order half eagles, eagles, and double eagles in this manner, although a fellow Washingtonian, Charles Deetz, may have done this (of Deetz we know relatively little, except that he was an early collector of high denomination mintmarked coins, an elite niche in the hobby).\n\nClapp bought widely, had a sharp eye for quality, and was a bidder in most of the important auction sales of the 1890s and early 1900s, until his passing on October 24, 1906, at his summer home. His rare coin collection, containing most of the great American rarities plus many mintmarks (a specialty that was still up-and-coming), passed to his son, John H. Clapp.\n\nJohn H., born on April 16, 1880, graduated from Princeton in 1902, that university having its own numismatic tradition by that time (T. Harrison Garrett and his three sons all went there). He made Washington his residence, where he engaged in law and banking, increasing the family fortune in the meanwhile. On October 1, 1908, he was elected as a governor of the American Numismatic Association, but neither he nor his father were flag-wavers at the Association, and there is not much of a record of their accomplishments.\n\nAlthough John H. added to his inherited collection of United States coins, he sought his own specialty, and that was the vast and largely numismatically explored area of Central and South American gold coins. He bought with care, and was ready with check in hand in the 1930s when many important pieces from the Waldo C. Newcomer Collection became available. Clapp, who never married and who resided at The Ontario in Washington, died on June 29, 1940. His estate collection was later purchased by Louis E. Eliasberg in 1942, through Stack’s, for the incredible price of $100,000 (exceeding by far the total realization of B. Max Mehl’s Dunham Collection sale, June 1941, the capstone of Mehl’s career).\n\nIn 1982 and again in 1996 and 1997 I had the pleasure of cataloguing much of the Eliasberg Collection (which included many of the Clapp family coins) for auction, an unforgettable experience.\n\nGeorge H. Clapp\n\nGeorge Hubbard Clapp, also a Pennsylvanian, was born on December 14, 1858, in the year of the great “oil rush” in that state. He was bitten by the coin bug at an early age. On June 4, 1878, he was a founder of the Western Pennsylvania Numismatic Society. As years went on he added to his cabinet, and also did a few other things, such as founding and becoming president of the Aluminum Company of America (Alcoa).\n\nSometime along the way he became enamored of early copper cents of the 1793-1814 years, perhaps before the early 1920s, but certainly by the time of a transaction he had with his brother Charles, a stockbroker. Charles was also an active numismatist and an important buyer at auctions. He had the opportunity to buy the Ellsworth cabinet of copper cents intact, and did. Ellsworth, who formed one of the largest collections in American numismatic history, is not particularly well known today, for, similar to Waldo C. Newcomer, his holdings were sold privately and no catalogue was ever published. The main part of the Ellsworth Collection was sold on March 7, 1923, through art dealers Knoedler & Co., to New York dealer Wayte Raymond, for $100,000, a sum even more impressive then than the same amount would be in 1942 in the above-noted transfer of another collection. Ellsworth was a member of the board of governors of the World’s Columbian Exposition, 1892-1893, and was on hand at the Philadelphia Mint in 1892 when the first commemorative Columbian Exposition half dollars were struck.\n\nHowever, in 1923, apparently soon after tucking away the Ellsworth cents, Charles Clapp had severe financial difficulties and sold his coin collection to brother George. After this time the copper-cent affliction attacked George in its most virulent form. His passion for cents extended to the careful study of varieties (such the 64-page monograph, The United States Cents of the Years 1798-1799, published in 1931), leading to his publication of several works on the series.\n\nIn 1937 he announced he would eventually donate the coins to the American Numismatic Society, which he did years later in 1946-1947. As to his collecting methods we know little, except that some owners of cents were reluctant to sell to him, perhaps fearful that they would be forever impounded in a museum. Whatever the obstacles and challenges may have been, he was able to acquire 324 of the 327 die varieties of 1793-1814 cents then known to exist. Likely, Clapp’s study of coins and his enthusiastic acquisition of them served as the inspiration for Dr. William H. Sheldon to take from and improve various specialized studies to create Early American Cents, 1949, complete with “Sheldon numbers” for cents and that marvelous Sheldon Grading System, 1 to 70, that some of us love dearly even today.\n\nSomehow, after Clapp’s death, certain of his prizes landed in the personal collection of Dr. Sheldon, prompting the Society to cry, “Foul!” when they learned of what was whispered by some to have been outright theft. It seems that Sheldon stored his collection at the Society, and a few of the Clapp cents developed wings or legs and moved from the Clapp collection to his. Or, there may be another explanation. The whole matter has been kept under wraps, more or less, but a number of Clapp’s cents, sold from the Sheldon Collection into the general marketplace, have been repatriated. In the meantime, the idol of Sheldon is now considered to have clay feet.\n\nThe Clapp home was in Sewickley, Pennsylvania, a town which even today reflects the grandeur of generations ago when it was home to the mansion-ensconced members of the Pittsburgh business and social community. On August 27, 1935, members of the American Numismatic Association, in convention in Pittsburgh, were invited to stop by for a visit to the Clapp home, “a magnificent one,” to be followed by dinner at the local country club.\n\nGeorge H. Clapp died on March 31, 1949. His obituary in The Numismatist included this:\n\nClapp, who was one of Pittsburgh’s most prominent industrialists and citizens, was especially well known in the field of early coppers, which specialty he began by obtaining permission from the keeper of a toll bridge to examine coins in his till for anything unusual. The collection of large cents which he built comes about as near to perfection as is ever permitted to human endeavor. Not only did he achieve completeness in scope, but to this were added the superlatives in quality and condition. His willingness to share the pleasure he had found as is characteristic, and was expressed by him at the time his large cents were deeded to the American Numismatic Society in order that, in that museum, they might be where ‘anyone may consult them;’ they are now among the society’s “crown jewels.”\n\nJames Ford Clapp, Jr. and III\n\nThere were numismatic Clapps outside of Pennsylvania, and among them were James Ford Clapp, Jr., and his son, James F. III, of Cambridge, Massachusetts.\n\nJames Jr. is prominent in the annals of the hobby for his accomplishments in the 1940s and 1950s, when he was a leading light in the Boston area. In 1953 the American Numismatic Association came up with the idea of creating a reference or primer on coin collecting, and Clapp was named to the Text Book Committee. Similar to quite a few related ANA book-creation projects, this one died before it was born. However, Clapp did many other things, and in August 1960 was general chairman of the ANA Convention held at the Copley Plaza Hotel in Boston. This was the very first convention in the “new market” that arose in that year, and, accordingly, was the most dynamic up to that time.\n\nHis numismatic successor was his son, James Ford Clapp III, who collected coins for a half century and who served as president of the Boston Numismatic Society and the New England Numismatic Association. In 1989 he picked up stakes and headed west. He died in Tempe, Arizona, on January 22, 1998. The last time I saw James III was one rainy night in Cambridge years ago, when we had both left an event at Harvard and were walking down Mt. Auburn Street. We discussed coins of ancient Greece, of which Ford knew much and I knew only a little."}, {"url": "https://prabook.com/web/george.clapp/2302796", "page_content": "George Clapp\n\nZoologist\n\nDecember 14, 1858 (age 90) Allegheny City, Pennsylvania , United States\n\nClapp took an engineering position at Park Brothers\" Black Diamond Steel Works. There, along with Captain Alfred East. Hunt, he established the Pittsburgh Testing Laboratory\"s chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew West. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company\"s working capital. As Clapp\"s wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie. Beginning in 1907 until his death, Clapp was president of Pitt\"s Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor. Clappia Walker, 1909 Planogyra clappi (Pilsbry, 1898)."}, {"url": "https://www.wikitree.com/wiki/Klapp-40", "page_content": "George Valentine Klapp aka Clapp aka\n\n24 May 1702 in Istha, Hesse, Heiliges Römisches Reich Bornin\n\nAncestors\n\nDescendants\n\n12 Oct 1773 at age 71 in Guilford, North Carolina Diedin\n\nThis page has been accessed 2,774 times.\n\nBiography\n\nGeorge Jorg Valentine Klapp age 23 and his wife Anna Barbara Stiess, age 21, and their daughter Maria Elizabeth, age 1\n\nKlapp ( Clapp) Family who emigrate as Protestants from the Palatine (Pfalz) area of Germany and who laned 27 September 1727 in Philadelphia, Pennsylvania 14 family members were on the James Goodwill, with David Crockett as ship's Master which sailed out of Rotterdam\n\nThe Clapp name was variously spelled Klap, Klop, Klapp, and later, Clapp.\n\nThere were two main groups of Clapp immigrants to America, the English Clapps of New England, and the German Clapps mentioned here, and they have no relationship to each other.\n\nJohn Ludwig Clapp and his brother, George Valentine Clapp, sailed from Rotterdam on the ship James Goodwill in the year 1727 and landed in Philadelphia, Pennsylvania, September 27, 1727. George signed the passenger list as \"Jorg Klap\" and John's name appears as \"Ludowick Clap\" or \"Ludowigh Clap\".[1] Neither is shown with any family, but, a Joseph Clap is shown on the same ship with a family of 14. George and John settled initially in Pennsylvania before moving to North Carolina. George's son John Phillip Clapp was born in Oley, Berks county, Pennsylvania.\n\nClick HERE for information on the Palatinate region of Germany.\n\nWilliam A. Brobst wrote the following about Palatinate emigration:\n\n\"The religious Thirty Years War, with its bloodshed, murder, robbery, and pillage, raged on from 1619 to 1648, and was disastrous to the Palatinate. Although the war \"ended\" in 1648, the repressive effects lasted for a century.... By the time the early 1700s had come along, the Palatine Germans had had enough of poverty, sickness, starvation, freezing, and being caught in the middle between the warring French and German troops. The Palatines had enough. They looked westward. They packed up, floated down the Rhine to Rotterdam, and headed for America.\"[2]\n\nTo find out more about German immigration to America, click HERE.\n\nMany Palatinate Germans went to North Carolina.\n\n\"In the east Guilford [county] were: the Albrights, the Clapps, the Cobbs, the Cobles, the Fousts, the Holts, the Keims, the Linebergers, the Sharps, the Shoffners, the Straders, the Summers, the Reitsells, the Whitsells, the Whitsetts, and the Wyricks [3]\n\n\"The Germans, who settled east of the Scotch-Irish [in Guilford county], had come from the Palatine, driven by the scourge of war from what was once their happy home. Up the Rhine from Cologne the Thirty Years' War had left terrible devastation. Thousands of these people came to America upon William Penn's invitation.\"[4]\n\nIt is an historic fact that many families from what is now present-day Germany immigrated to the British colonies in the early eighteenth century; their Protestant faith was almost as important as their nationality. The British government looked favorably on the prospect of immigration from other countries in Northern Europe as long as they were of the Protestant and not Catholic faith. An exception would have to be Maryland, which was colonized by many British Catholics. William Penn was receptive to allowing Germans to settle in Pennsylvania. [5]\n\nThe Palatine German immigrant families that moved to North Carolina were an insular, cautious group, that married only within their German family communities, and avoided politics, in the early years. In view of what these people had endured in the seventeenth and eighteenth centuries, it is no wonder they had this cautious approach in their new land. In contrast, the Quakers and Presbyterians of Guilford county were active in politics.\n\n\n\n\n\nChurch\n\nThe Clapp family was instrumental in the establishment of the Brick Church. Here are pictures of the restored Brick Church and its interior, and also HERE with some of the remaining gravestones.\n\nWelker has this to say about the Clapp church:\n\n\"Guilford Charge\n\n\"The immigrants to this region, now making parts of Alamance, Guilford and Randolph Counties, came in wagons by the emigrant route of those days from Philadelphia, through Pennsylvania, Maryland, and Virginia, bringing their household furniture and farming tools – accompanied by young men coming to seek their fortunes in this new country. These came mostly from the counties of Berks, Lancaster, and Schuylkill and a few from Maryland from 1745 to 1760 perhaps. This was then Orange and Rowan, and these German settlements were made on the waters of the Haw River and its tributaries, Alamance, Reedy Fork, Beaver Creek, Stinking Quarter, Sandy Creek, etc. These were the Albrights, Clapps, Fauts, Holts, Sharps (Scherbs), Laws, Graves (Greff), Summers, Cobbs (Kaubs), Cobles, Swings {Schwenks), Cortners (Gaertners), Ingolds, Browers, Keims, Staleys, Mays, Alnicks (Emigs), Smiths, Stacks, Neases, Ingles, Leinbergers, Straders, Wyricks, Anthonys, Schaeffers (Shepherds), Weitzells, Trollingers, Longs, Weys, Shaffners, Fogelmans, Sthars, Brauns, Reitzells, with others.\n\n\"Their first place of worship was in a log cabin near where Laws Church now stands, on the old road from Hillsborough to Salisbury, now in southwest corner of Guilford County. It was a Union Reformed and Lutheran Church. This union was brought to an end by the divergent sentiments growing out of the sentiments and feelings that culminated in the Regulation movement and the rebellion of the Colonies. Rev. Samuel Suther, who had recently come from the County of Mecklenburg, an advanced patriot, was the Reformed pastor, and under his inspired guidance the Albrights, Goertners, Clapps, Fausts, Scheaffers, Ingolds, Schwencks and Leinbergers, who were of the Reformed stock, at once moved to a school house near where the Brick Church now stands, and there, undisturbed by factional differences, erected an altar where to serve God. Suther was pastor until the close of the war, and was the animating spirit of the community. Soon this small log house gave way to a larger and more comfortable place to worship, whose corner Stones a few years since could still be seen. In these years Clapp and Christian Faust were Elders, and Ingold and Leinberger deacons, and even in these dark years the Church grew and was prosperous. [6]\n\nIn 1828, the pulpit service was heard in the English language for the first time. For the welfare of the church this was none too soon. In 1841, Rev. G. William Walker took charge. It is a large congregation, mostly posed of the descendants of those early emigrants from Pennsylvania. In the grave yard hard by the church rest in unmarked graves Tobias Clapp and Peter Goertner, who were in the Regulation battle; and there also sleeps Capt. Wm. Albright, Barney Clapp, and Matthew Schwenck and others, who were soldiers in the War of Revolution, and the passerby who stops to read may find other humble graves of noble men, and that of George Goertner (Cortner), who was the civil leader of the community of Germans.\n\nLacey says:\n\n\"The church which the Scherrers (Sherer, Shearer) attended, and which the Goodners must have also, was the Frieden Church, located some two miles north of the present village of Gibsonville, in the eastern part of present Guilford County. It is now a Lutheran Church and has been for many years. but in its early days it was also used by the German Reformed people. This church was organized in 1745. although there were some German settlements in the neighborhood as early as 1740. The early records of the church were lost. In 1771 it was re-organized and a second church building was erected. To this church went Jacob Daniel Scherrer and his family. and Jacob Daniel lies buried in the churchyard. with a marker put on his grave by his grandson, Rev. Simeon Scherer.\n\n\"This part of the county is a beautiful rolling countryside. In this area lived the Wyricks (Wiricks). Tickles, Summers. Tades. Smiths. Goodners and others. It is pleasing to think. and logical to suppose. that in this church Conrad Goodner and Elizabeth Scherer met and were married in the year 1782. Here also marriages of the other Goodners may have been consummated. The old log building has long since disappeared. and a new modern church now stands across the road from the churchyard, the whole kept in a very good condition.\n\n\"Frieden means peace in German, and in naming their church Frieden Church. or Friedens Church, we have a good idea of what was in the minds of those early Germans. It was sometimes called \"Shoemaker's Church\", and it received that name by the following incident. A man by the name of Shoemaker was living within a few hundred yards of the church during the American Revolution. He was a Tory. He passed over the battle ground at Guilford Court House just after the battle. when General Greene had fallen back, and finding the British in possession, was going home. As he passed along a wounded soldier asked him for a drink of water but he refused to give it. A squad of soldiers followed him, took him from his house, made him stand on the door step at the north door, and there shot him to death.”\n\n\"The earliest settlers around Greensboro. North Carolina, were English and Welsh Quakers, German Calvinists & Lutherans, and Ulster Scot Presbyterians. They were small freeholders. The city of Greensboro occupies part of the original grant of 1749 from John Carteret, Earl of Granville, to the Nottingham Company for settlement of a colony of Ulster Scot Presbyterians on the waters of North Buffalo and Reedy Creek. To the east on Stinking Quarter Creek, a German colony settled at the same time. Guilford County was also known as Unity Parish, and was formed in 1770 but the act did not become effective until April 1st, 1771.[7]\n\nThe Battle of Clapp's Mill\n\nGeorge's brother John owned a mill. During the Revolutionary War there was a battle at Clapp's Mill. Here is a link to the Battle of Clapp's Mill. Here is a more detailed description of the Battle.\n\nVitals\n\nBorn\n\nDate: May 24, 1702[8]\n\nDeath\n\nDate: Oct. 12, 1773 Place: Guilford, North Carolina Age 71 years, 4 months, 18 days[9]\n\nBurial\n\nBurial: Date: 1773 Place: Brick Church, Guilford County, North Carolina Valentine \"lies hard by the Eastern middle of the Church wall\"[10]\n\nSources\n\nGeorge Valentine \"Jorg\" Clapp signature 27 September, 1727\n\nPennsylvania German Pioneers, vol.1, pages 10 & 12 James Goodwill Passengers The Clapp memorial: record of the Clapp family in America\n\nSource: S-130 Title: The Brobst Chronicles, A History of the Early Brobst/Probst Families in Pennsylvania\" Author: William A. Brobst Publication: Accessed online at the website for The National Brobst Family Historical Registry: [1]\n\nTitle: Source: S-131 Title: The History of Guilford County, North Carolina Author: Sallie Walker Stockard Publication: Gaut-Ogden Company, printers, 1902 - Guilford County, North Carolina Repository: Google Books Available without charge at Google Books\n\nTitle: The History of Guilford County, North Carolina Author: Sallie Walker Stockard Publication: Gaut-Ogden Company, printers, 1902 - Guilford County, North Carolina Repository: Google Books Available without charge at Google Books Source: S-132 Title: The Olive Tree Genealogy Website: www.olivetreegenealogy.com\n\nTitle: The Olive Tree Genealogy Website: www.olivetreegenealogy.com Source: S-133 Title: \"Albion's Seed: Four Bristish Folkways in America\" Author: David Hackett Fischer Publication: Oxford University Press, New York, 1989\n\nTitle: \"Albion's Seed: Four Bristish Folkways in America\" Author: David Hackett Fischer Publication: Oxford University Press, New York, 1989 Source: S-134 Website: StoppingPoints.com\n\nWebsite: StoppingPoints.com Source: S-135 Title: History of Brick Church and The Clapp Family Copyright ©1925 by William Thornton Whitsett, Ph.D., Harrison Printing Company, Greensboro, N.C. page 7.\n\nTitle: Copyright ©1925 by William Thornton Whitsett, Ph.D., Harrison Printing Company, Greensboro, N.C. page 7. Source: S-136 Title: History of the German Reformed Church in North Carolina Author: George William Welker\n\nTitle: History of the German Reformed Church in North Carolina Author: George William Welker Source: S-137 Title: The Goodner Family, a Genealogical History Author: Hubert Wesley Lacey Publication: Author, Dayton, OH, 1960 Repository: #REPO-01 Call Number: 929.273 G623\n\nTitle: The Goodner Family, a Genealogical History Author: Hubert Wesley Lacey Publication: Author, Dayton, OH, 1960 Repository: #REPO-01 Call Number: 929.273 G623 Source: S-138 Title: Brick Church Records Compiler: translated from the original German by Rev. D.I. Offman, Publication: Typed by Calvin Hinshaw from a carbon copy of Rev. D. I. Offman’s translation, 1959. Available without charge at Rootsweb\n\nTitle: Brick Church Records Compiler: translated from the original German by Rev. D.I. Offman, Publication: Typed by Calvin Hinshaw from a carbon copy of Rev. D. I. Offman’s translation, 1959. Available without charge at Rootsweb Source: S-1300436665 Title: Ancestry Family Trees Publication: Online publication - Provo, UT, USA: Ancestry.com. Original data: Family Tree files submitted by Ancestry members. Repository: #R-1552298038\n\nOther Links and References\n\nHistory of Brick Church and The Clapp Family Copyright ©1925 by William Thornton Whitsett, Ph.D., Harrison Printing Company, Greensboro, N.C. page 7.\n\nOld Brick Church\n\nBattle of Clapp's Mill Marker\n\nBattle of Clapp's Mill\n\nTHE BRICK REFORMED CHURCH OF GUILFORD COUNTY, NORTH CAROLINA\n\nNorth Carolina Historical Markers\n\nPhiladelphia Wagon Road\n\nFriedens Lutheran Church\n\nAncestors of William Lee CLAPP\n\nSteve Clapp's Genealogy, Descendants of Thomas Clapp\n\nJames and Chambers Genealogy\n\nIngle Genealogy\n\nDescendants of Thomas Clapp\n\n\n\nThe German and Swiss settlements of Colonial Pennsylvania - Google Books\n\nClapp Ancestry\n\nClapp Genealogy\n\nGenealogy records (1935-1972) of Ethel Perry Moore, 1902-1975.\n\nCorrespondence with Rosemarie Langley.\n\nLetters written by Nina Olsen to Ethel Perry Moore.\n\nBRICK CHURCH RECORDS transcribed from the original records by Rev. D. I. Offman\n\nAcknowledgments\n\nThank you to Fran Mason, Norman Perry, Grant Meadors, and to all who contributed to this profile.\n\nClick on the Changes page for the details of contributions and edits.\n\nSource: S-415175341 Repository: #R-949372876 Ancestry Family Trees Publication: Online publication - Provo, UT, USA: Ancestry.com. Original data: Family Tree files submitted by Ancestry members. Ancestry Family Tree http://trees.ancestry.com/pt/AMTCitationRedir.aspx?tid=59093506&pid=376\n\nRepository: #R-949372876 Ancestry Family Trees Publication: Online publication - Provo, UT, USA: Ancestry.com. Original data: Family Tree files submitted by Ancestry members. Ancestry Family Tree http://trees.ancestry.com/pt/AMTCitationRedir.aspx?tid=59093506&pid=376 Repository: R-949372876 Ancestry.com"}, {"url": "https://alchetron.com/George-Hubbard-Clapp", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor."}, {"url": "https://wiki2.org/en/George_Hubbard_Clapp", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nGeorge Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, now known as Carnegie Mellon University, and was a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949, at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nTaxa named in honour\n\nReferences"}], "George Hubbard Clapp attended the University of Pennsylvania.": [{"url": "https://nnp.wustl.edu/library/PersonDetail/440", "page_content": "George Hubbard Clapp\n\nBiography\n\nBorn in Allegheny, Pennsylvania.Graduate of Western University of Pennsylvania, now University of Pittsburgh. He would become Clapp president of the board of trustees of the University of Pittsburgh and prior to his death he was the oldest living graduate. He was one of the founders and president of Aluminum Company of America. Second cousin of John Henry Clapp.\n\nClapp had an extensive collection of conch shells that were donated to the Carnegie Museum. His collection of large cents included all the varieties called \"collectible\" by Sheldon. He exhibited uncirculated large cents at the 1935 ANA convention. His second set of large cents was donated to the Carnegie Institute. An extensive exhibit was prepared when the ANA convention was held in Pittsburgh. In 1937 he donated his first quality set of 1452 large cents to the American Numismatic Society in New York. He died in Pittsburgh.\n\nAuthor of The United States Cents of the Years 1798-1799 in 1931. One hundred twenty-six cloth bound copies and nine leather bound presentation copies were issued. Author of The United States Cents 1804-1814 as part of the Coin Collector Series in 1941. Author with Howard Newcomb of The United States Cents of the Years 1795-1796, 1797, and 1800 in 1947.\n\nobit: NUM 62 June 1949 page 361; NYT 4/1/49\n\nSource credit: Pete Smith, American Numismatic Biographies"}, {"url": "https://prabook.com/web/george.clapp/2302796", "page_content": "George Clapp\n\nZoologist\n\nDecember 14, 1858 (age 90) Allegheny City, Pennsylvania , United States\n\nClapp took an engineering position at Park Brothers\" Black Diamond Steel Works. There, along with Captain Alfred East. Hunt, he established the Pittsburgh Testing Laboratory\"s chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew West. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company\"s working capital. As Clapp\"s wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie. Beginning in 1907 until his death, Clapp was president of Pitt\"s Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor. Clappia Walker, 1909 Planogyra clappi (Pilsbry, 1898)."}, {"url": "https://wiki2.org/en/George_Hubbard_Clapp", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nGeorge Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, now known as Carnegie Mellon University, and was a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949, at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nTaxa named in honour\n\nReferences"}, {"url": "https://peoplepill.com/people/george-hubbard-clapp/", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nTaxa named in honour"}, {"url": "https://alchetron.com/George-Hubbard-Clapp", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor."}, {"url": "https://www.findagrave.com/memorial/121821273/george-hubbard-clapp", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://en-academic.com/dic.nsf/enwiki/6436175", "page_content": "George Hubbard Clapp Hall is a contributing property to the Schenley Farms National Historic District[3][4] on the campus of the University of Pittsburgh in the Oakland section of Pittsburgh, Pennsylvania. The six-story Gothic Revival structure, designed by Trautwein & Howard,[2] was completed in 1956 and serves as the primary facility of the University of Pittsburgh Department of Biological Sciences. It contains laboratories, classrooms, a greenhouse, and an amphitheater-style lecture hall with 404 seats.[3][4]\n\nArchitecture\n\nClapp Hall was designed by Trautwein & Howard, a successor to architectural firm of Charles Klauder who designed the university's gothic Cathedral of Learning, Stephen Foster Memorial, and Heinz Memorial Chapel.[2]\n\nClapp Hall's exterior and interior spaces have been described as a mix of Collegiate Gothic and Art Deco.[2] The building features a diagonally-positioned entrance that creates a direct axis with the Cathedral of Learning which is framed in Clapp Hall's stone portal entryway. The building is clad in textured Indiana limestone to match the stone used on the Cathedral of Learning. The building’s use of aluminum windows has been suggested to be a quiet homage to the work of aluminum magnate George Hubbard Clapp, the building's namesake.[2] The lobby of Clapp Hall is streamlined Art Deco in character, with terrazzo flooring and stainless steel doors, and is thus more stylistically modern than its exterior which is meant to reflect the Cathedral of Learning. It has been suggested that the lobby reveals a struggle in the design process to find a balance between the traditional gothic and more contemporary design elements.[5]\n\nHistory\n\nOriginal plans slated Clapp Hall to be built adjacent to the Cathedral of Learning facing the Masonic Temple, on the south side of Fifth Avenue, between the Cathedral and Heinz Memorial Chapel. Concerns over adding more buildings to the Cathedral of Learning lawn and impinging on the lawn's rare open space prompted a change to its current site across Fifth Avenue and effectively ended above-ground development of the Cathedral lawn space.[6]\n\nThe 3-acre (12,000 m2) plot of land that Clapp Hall was constructed on was purchased for $675,000 as a gift for the university by the A.W. Mellon Educational and Charitable Trust.[7] Ground was broken for Clapp Hall in 1954[8] and the building was completed in 1956. The six-story building cost $2.5 million and it was initially used only for freshman chemistry, although other sciences soon moved into the building.[9] it is conjoined with Langley and Crawford Halls, which were added in later stages, and forms the three-building Clapp/Langley/Crawford Complex. The triangular courtyard at the southwest entry to Clapp Hall, facing the Cathedral of Learning, was modified in 2004 to accommodate trees and benches.[2]\n\nThe building is named for George Hubbard Clapp (1858–1949), an alumnus (class of 1877) and president of Pitt's Board of Trustees for more than 40 years. Clapp was one of five responsible for the first commercial production of aluminum and was a founder of the Aluminum Company of America.[5]\n\nUse\n\nThe six-story structure contains laboratories, classrooms, and an amphitheater-style lecture hall with 404 seats.[3] A greenhouse, used mostly for teaching, is located on the four floor of Clapp Hall.[4] Clapp Hall originally housed Pitt's Departments of Physics, Chemistry, Biology, Metallurgy, and Chemical Engineering.[6] Today the Department of Biological Sciences occupies the building.\n\nReferences"}, {"url": "https://alchetron.com/Clapp-Hall", "page_content": "George Hubbard Clapp Hall is a contributing property to the Schenley Farms National Historic District[2][3] on the campus of the University of Pittsburgh in the Oakland section of Pittsburgh, Pennsylvania. The six-story Gothic Revival structure, designed by Trautwein & Howard, was completed in 1956 and serves as the primary facility of the University of Pittsburgh Department of Biological Sciences. It contains laboratories, classrooms, a greenhouse, and an amphitheater-style lecture hall with 404 seats.\n\nArchitecture\n\nClapp Hall was designed by Trautwein & Howard, a successor to architectural firm of Charles Klauder who designed the university's gothic Cathedral of Learning, Stephen Foster Memorial, and Heinz Memorial Chapel.\n\nClapp Hall's exterior and interior spaces have been described as a mix of Collegiate Gothic and Art Deco. The building features a diagonally-positioned entrance that creates a direct axis with the Cathedral of Learning which is framed in Clapp Hall's stone portal entryway. The building is clad in textured Indiana limestone to match the stone used on the Cathedral of Learning. The building’s use of aluminum windows has been suggested to be a quiet homage to the work of aluminum magnate George Hubbard Clapp, the building's namesake. The lobby of Clapp Hall is streamlined Art Deco in character, with terrazzo flooring and stainless steel doors, and is thus more stylistically modern than its exterior which is meant to reflect the Cathedral of Learning. It has been suggested that the lobby reveals a struggle in the design process to find a balance between the traditional gothic and more contemporary design elements.\n\nHistory\n\nOriginal plans slated Clapp Hall to be built adjacent to the Cathedral of Learning facing the Masonic Temple, on the south side of Fifth Avenue, between the Cathedral and Heinz Memorial Chapel. Concerns over adding more buildings to the Cathedral of Learning lawn and impinging on the lawn's rare open space prompted a change to its current site across Fifth Avenue and effectively ended above-ground development of the Cathedral lawn space.\n\nThe 3-acre (12,000 m2) plot of land that Clapp Hall was constructed on was purchased for $675,000 ($6.0 million today) as a gift for the university by the A.W. Mellon Educational and Charitable Trust. Ground was broken for Clapp Hall in 1954 and the building was completed in 1956. The six-story building cost $2.5 million ($22.0 million today) and it was initially used only for freshman chemistry, although other sciences soon moved into the building. it is conjoined with Langley and Crawford Halls, which were added in later stages, and forms the three-building Clapp/Langley/Crawford Complex. The triangular courtyard at the southwest entry to Clapp Hall, facing the Cathedral of Learning, was modified in 2004 to accommodate trees and benches.\n\nThe building is named for George Hubbard Clapp (1858–1949), an alumnus (class of 1877) and president of Pitt's Board of Trustees for more than 40 years. Clapp was one of five responsible for the first commercial production of aluminum and was a founder of the Aluminum Company of America.\n\nUse\n\nThe six-story structure contains laboratories, classrooms, and an amphitheater-style lecture hall with 404 seats. A greenhouse, used mostly for teaching, is located on the four floor of Clapp Hall. Clapp Hall originally housed Pitt's Departments of Physics, Chemistry, Biology, Metallurgy, and Chemical Engineering.[4] Today the Department of Biological Sciences occupies the building."}]}