{"George Hubbard Clapp also donated to the Philadelphia Museum of Art, the Philadelphia Orchestra, and the Pennsylvania Academy of the Fine Arts.": [{"url": "https://nnp.wustl.edu/library/PersonDetail/440", "page_content": "George Hubbard Clapp\n\nBiography\n\nBorn in Allegheny, Pennsylvania.Graduate of Western University of Pennsylvania, now University of Pittsburgh. He would become Clapp president of the board of trustees of the University of Pittsburgh and prior to his death he was the oldest living graduate. He was one of the founders and president of Aluminum Company of America. Second cousin of John Henry Clapp.\n\nClapp had an extensive collection of conch shells that were donated to the Carnegie Museum. His collection of large cents included all the varieties called \"collectible\" by Sheldon. He exhibited uncirculated large cents at the 1935 ANA convention. His second set of large cents was donated to the Carnegie Institute. An extensive exhibit was prepared when the ANA convention was held in Pittsburgh. In 1937 he donated his first quality set of 1452 large cents to the American Numismatic Society in New York. He died in Pittsburgh.\n\nAuthor of The United States Cents of the Years 1798-1799 in 1931. One hundred twenty-six cloth bound copies and nine leather bound presentation copies were issued. Author of The United States Cents 1804-1814 as part of the Coin Collector Series in 1941. Author with Howard Newcomb of The United States Cents of the Years 1795-1796, 1797, and 1800 in 1947.\n\nobit: NUM 62 June 1949 page 361; NYT 4/1/49\n\nSource credit: Pete Smith, American Numismatic Biographies"}, {"url": "https://www.uag.pitt.edu/exhibitions/the-curious-drawings-of-doctor-clapp", "page_content": "What do old Italian drawings have to do with shells, rocks, coins and other curiosities from across the globe? This diverse spectrum of objects were all donated to museums by George Hubbard Clapp (1858-1949), an aluminum industry pioneer whose collecting across art and science made him something of a modern-day Renaissance man.\n\nThis exhibition focuses on a collection of drawings that Clapp donated to the University in 1941. Dating from the fifteenth to eighteenth centuries, Pitt students have conducted in-depth research that sheds new light on these mysterious drawings. The Curious Drawings of Doctor Clapp provides a rare opportunity to inspect early modern drawings in Pittsburgh and provides a fascinating glimpse into the history of collecting.\n\nCurated by the students of HAA1030 (Spring 2019) and HAA1020 (Fall 2019).\n\nSupported by The Fine Foundation"}, {"url": "https://philadelphiaencyclopedia.org/essays/philadelphia-museum-of-art/", "page_content": "Essay\n\nThe Philadelphia Museum of Art—originally known as the Pennsylvania Museum and School of Industrial Art—developed from collections exhibited in 1876 at the Centennial Exhibition in Fairmount Park. Modeled on the South Kensington Museum in London, the new institution sought through both collections and classes to teach design so that goods produced in Philadelphia would be more competitive with those made in Europe. By the 1920s, however, the museum shifted its emphasis toward cultivating elite taste as it constructed a monumental new building, acquired landmark collections, and courted wealthy patrons. With 90 percent of its collection acquired from donors but also a longstanding, if declining, financial relationship with Philadelphia’s city government and the Fairmount Park Commission, the museum negotiated a tension familiar to most art museums between the aesthetic values of high-society collectors and a charitable mission to enhance public life through art.\n\nThe Pennsylvania Museum and School of Industrial Art was founded in 1876 and opened to the public in Fairmount Park’s Memorial Hall in 1877, but members of the Fairmount Park Commission had discussed the idea even earlier. The Centennial brought the museum idea to fruition as members of the semiautonomous Park Commission, other city officials, and appointees to the federally authorized Centennial Commission worked together to stage the Exhibition. A combination of the Park Commission, the City, and museum trustees continued to make decisions—and to complicate decision-making—about the institution throughout its history.\n\nThe Museum and School of Industrial Art arrived at a moment of change both in American history and in the history of museums. The Centennial Exhibition, while celebrating the history of American independence, also promoted the country and the city of Philadelphia as progressive, post-Civil War societies at the forefront of modernity and the Industrial Revolution. However, when Americans compared themselves to their European counterparts in science, industry, or art, they often feared they were lacking. During this period, elites generally designed museums as sites for the middle and upper classes to cultivate or prove their good taste. At the Museum and School of Industrial Art, however, the decorative objects retained from the Centennial were also a teaching collection viewed by working people—factory laborers, artisans, and industrial designers—who might be inspired to make and consume better, more beautiful industrial goods.\n\nMuch like the Academy of Natural Sciences (founded in 1812) and the University of Pennsylvania Museum of Archaeology and Anthropology (founded in 1877), the Museum and School of Industrial Art organized its collections scientifically and systematically. Large glass cases in Memorial Hall displayed arrays of artifacts according to function and material, progressing through time. However, over the next few decades, the collections began to change. The 1893 bequest of Anna H. Wilstach (1822-92) to the Fairmount Park Commission and to the museum began the institution’s move toward fine art. The paintings she donated were valuable, but the $500,000 discretionary fund she left for purchases had even more dramatic impact. Over time, the bequest led to nearly one thousand acquisitions including innovative masterpieces by Paul Cézanne (1839-1906) and Henry Ossawa Tanner (1859-1937), an African American.\n\nProminent Philadelphia Donors\n\nOther valuable collections of Western art followed in the early twentieth century, including those of William L. Elkins (1832-1903), an oil and transportation magnate, and his son George W. Elkins (1858-1919); John Howard McFadden (1850–1921), a wealthy cotton merchant; and John G. Johnson (1841-1917), a lawyer for corporations like Standard Oil, Baldwin Locomotive, and United States Steel. These men—some of them also powerful Fairmount Park commissioners with vested interests in the museum already— officially bequeathed their collections to the city and the Park Commission, but the museum then cared for and exhibited them. All the donors were prominent Philadelphians and very wealthy, but also philanthropic and civic-minded. Johnson, whose collection of European Renaissance art was the biggest prize out of any acquired at this time, said in his will: “I have lived my life in this City. I want the collection to have its home here.”\n\nElkins and McFadden made their bequests contingent on the creation of a new building to house them, and further donations of collections made more space in a grander setting, closer to City Hall, a priority. By 1917, the museum trustees and staff finalized plans to leave Memorial Hall for a new building on the almost-completed parkway extending from City Hall to Fairmount Park. Horace Trumbauer (1868-1938), Paul Cret (1876-1945), and the firm of Zantzinger, Borie, and Medary designed the building collaboratively with labor by numerous others including perspective drawings by Julian Abele (1881-1950), a rare opportunity for an African American architect at that time.\n\nIn 1928, the eclectic Greek Revival building opened at a cost to the city of $12 million. Because the building sat on city land, the Fairmount Park Commission managed it with city funds. When seeking financial donations, some of the museum’s leadership emphasized the new building as a matter of civic pride for all citizens. Yet for museum president Eli Kirk Price (1860-1933), such a monumental building also served to “encourage men who already have bought pictures to give them to the museum.” In the spirit of both cutting costs and encouraging Price’s donors, the building was strategically constructed as a massive shell into which the museum could gradually build galleries for new collections. Those empty galleries could promise donors that their collections would not go into storage, but they also became a promise that the city would not just support public space in its parks, but also elite taste in its museums.\n\nA New Organizational Scheme\n\nStarting in 1925, director Fiske Kimball (1888-1955) oversaw the building of galleries and the donation and purchase of new collections, but he also implemented a new organizational scheme for the works displayed in the new building. The new exhibits were not a systematic array, but a history of art. The second floor used masterworks to show the evolution of European art from the Middle Ages to the modern era. Kimball also innovated in embedding period rooms that further illuminated this chronology. While other museums staged rooms to represent specific times and places, Kimball began importing whole architectural elements to create context for furnishings and art. Combined with his floor-wide history of art, the museum became a “walk through time” both within and across galleries. By the mid-1930s, Asian galleries in the South Wing housed art from India, China, Japan, and Iran but offered little explanation as to how they fit into the grand narrative and inevitable march of Western progress portrayed elsewhere in the museum.\n\nThe first floor, meanwhile, presented “study collections.” In the South Wing, these more in-depth exhibits included displays of decorative arts that followed in the tradition of the original Pennsylvania Museum and School of Industrial Art. The works in the North Wing focused on specific eras and areas of Western art, but tellingly, maps for visitors labeled the galleries by collector with subject matter indicated in secondary text. Thus, while the South Wing’s curation reflected the institution’s original educational intention, the arrangement of the North Wing, much like the architecture of the museum, catered to wealthy donors. The new building contained these study collections, but it did not house the school. Although the two were still officially connected, by 1938 the institutions became the Philadelphia Museum of Art (PMA) located on the Parkway and the Philadelphia Museum School of Industrial Art located on South Broad Street.\n\nDespite the museum’s dwindling relationship to the school, other kinds of outreach extended to the public. Under Kimball the museum founded a Division of Education in 1929 and in 1931 opened a short-lived branch at Sixty-Ninth Street Terminal in conjunction with the Carnegie Foundation and a developer in West Philadelphia. Long-lasting affiliations that began in the 1920s included two Fairmount Park historic houses (Cedar Grove and Mount Pleasant) and the Rodin Museum on the Parkway. In 1944, the museum established another enduring relationship by agreeing to administer the Fleisher Art Memorial at Eighth and Catharine Streets. Fleisher’s free classes, unlike those at the School of Industrial Art, taught art as recreation not profession.\n\nProgress Even During the Depression\n\nAlthough not immune to the impact of the Great Depression, the PMA completed dozens of galleries throughout the 1930s to house acquisitions such as the Edmond Foulc Collection of Medieval and Renaissance Art. Much of this construction occurred with help from New Deal programs like the Works Progress Administration. The museum also gained artworks, especially African American prints, from the Public Works of Art Project. While the PMA’s finances suffered in the 1930s, it continued to spend, and some raised questions about whether art was a worthy cause when so many people were out of work and hungry. Among those raising these questions in the early 1930s were Mayor Harry A. Mackey (1869-1938) who, with City Council, controlled much of the museum’s budget. Cartoonists at The Philadelphia Record echoed those concerns when the museum bought Cézanne’s The Bathers for $110,000 in 1937.\n\nDuring the Kimball era, the museum made huge acquisitions including an intact French Medieval cloister, but the emphasis on recreating the past concerned some who felt the museum was falling behind by not collecting more innovative modern art. The museum acquired some modern works—like The Bathers and the photography collection of Alfred Stieglitz (1864-1946)—in the 1940s. It was later, in the 1950s, that the Walter and Louise Arensberg Collection—including many works by Marcel Duchamp (1887-1968)—and the A. E. Gallatin Collection (also known as The Museum of Living Art) established the PMA as a major repository of modern and contemporary art.\n\nThe Arensberg and Gallatin collections, donated from outside Philadelphia, demonstrated the growing reputation of the PMA and the work it contained. The Arensbergs, for example, selected the PMA because they believed their collection would be most valued and do the most good in Philadelphia. Some Philadelphia collectors, however, spurned the museum. Joseph Widener (1871-1943)—a Philadelphian who was heir to his father’s transportation fortune and had longstanding, multigenerational connections to the city and the museum—slighted Philadelphia and in 1942 opted to enshrine himself and his collection at the National Gallery of Art in Washington, D.C. With the opposite motivation, yet similar result, in 1922 Albert Barnes (1872-1951) created his own educational foundation so his collection might be used to combat the elitism of the art world in general and Kimball’s PMA in particular.\n\nThe First Admission Fee, 35 cents\n\nIn 1962, the museum which was previously free began to charge an admission fee of 35 cents, but during that decade it also expanded its education programs for adults and schoolchildren, and in 1970 it created a Department of Urban Outreach (DUO). If the admission fee made the museum less accessible, programs like DUO’s murals and other public works made it more so.\n\nThroughout the 1970s, the museum responded to other trends in the museum world as well. It added visitor-centered amenities like a restaurant and air conditioning. It also began hosting more blockbuster shows featuring recognizable artists like Duchamp and Vincent Van Gogh (1853-90). However, the PMA was more often an early adopter than an innovator. Although the museum’s founding as a school for industrial designers once set it apart from institutions like the Metropolitan Museum of Art in New York, by 1964 the school officially separated from the museum, eventually becoming known as the University of the Arts.\n\nThe d’Harnoncourt Era\n\nIn 1982, Anne d’Harnoncourt (1943-2008), a Duchamp scholar and longtime modern art curator at the museum, became director. She continued to build the modern and contemporary collections with major acquisitions by artists such as Cy Twombly (1928-2011) and Bruce Nauman (b. 1941). She also acquired the Muriel and Philip Berman Collection of prints and drawings by old masters and presided over a 1989 legal victory that allowed the Johnson collection to be integrated into the collections at large. This led to reorganizing the European art galleries in an even more monumental narrative of Western masterpieces that better realized Kimball’s vision of exhibiting the paintings as a walk through time and a march of progress. While more spectacular according to many standards because of the quality of the work, the exhibits changed little about the standard narrative of art history. In contrast, the African American Collections Committee, created in 2001 for the museum’s 125th anniversary, made the collections more inclusive by purchasing works that filled gaps where other donors failed to collect.\n\nIn many ways, d’Harnoncourt continued in the tradition of Kimball as she expanded the reputation of the PMA and Philadelphia as an elite center of art collecting and exhibition. The $68 million joint effort with the Pennsylvania Academy of the Fine Arts in 2007 to purchase Thomas Eakins’ (1844-1916) The Gross Clinic when Thomas Jefferson University wanted to sell it epitomized a dedication to fine art and the city at a time when the city was perpetually on the verge of bankruptcy and investing less and less in its cultural institutions. Yet the Gross Clinic campaign to keep the iconic painting in Philadelphia also showed commitment to an art world steeped equally in money and taste as in public service and inclusive civic pride. Likewise, the addition of the Perelman Building on Pennsylvania Avenue primarily provided more space for existing collections, although it also held the promise of being a more flexible and more community-oriented space than the museum’s main temple on the hill.\n\nPlans for an expansion designed by Frank Gehry (b. 1929) began during d’Harnoncourt’s tenure, then commenced construction in 2017 under the directorship of Timothy Rub (b. 1952). It continued projects undertaken since the 1970s to make the museum more welcoming to visitors, especially those with cars, and easier to navigate both inside and out. At the same time, digital initiatives and educational outreach promised to expand the reach of the museum in ways that paralleled earlier efforts to create audio guides for the galleries, develop curriculum for schools, and provide distance programs through teleconferencing and telephones.\n\nThe Iconic Museum Steps\n\nThe museum, a home to 240,000 priceless objects and an ongoing recipient of funding from the city which owned its building, always identified itself as a civic institution for Philadelphians. This extended to the museum’s most visible public space, the iconic seventy-two steps leading up to the museum’s Parkway-facing entrance. With a spectacular view of City Hall down the Benjamin Franklin Parkway, the steps became a must-see attraction for tourists, the lead-in on sports broadcasts and other televised events, and shorthand for the city in popular media. However, this was as much because of Rocky Balboa’s training montage in the Oscar-winning film Rocky (1976) as it was because of John Johnson or Fiske Kimball. Instead of creating literal common ground between elite, private benefactors and a broader public, a debate emerged over where the statue of Rocky donated by actor and star of the movie Sylvester Stallone (b. 1946) should stand. Many at the museum argued that it was a movie prop, not properly art, and the statue spent years at the Spectrum arena in South Philadelphia before being placed not at the top of the steps but at the bottom in 2006. This was revealing of how the museum negotiated the interests of different audiences who sometimes struggled to find common ground in fine art, especially when the icons of one class could be pushed to the side to legitimate those of the other.\n\nDespite the snub of Rocky, the PMA embraced more accessible, community-driven interpretations of its collections and the broader role of the art museum. A cheeky ad campaign from 2017 featured nonchalant visitor commentary—Botticelli’s Portrait of a Young Man was captioned, “I think he’s throwing some serious shade”—that sanctioned laughter at the obscurity of high cultural taste. Even more progressively, the “Philadelphia Assembled” exhibit, also in 2017, combined art and civic engagement. As an example of the museum’s efforts to become more politically relevant to a changing society, the exhibit gave space—albeit only at the Perelman Building—to individuals and organizations to create stories of resistance and community building, challenging the cultural hierarchies of the past and sharing authority with a more inclusive community.\n\nThe Philadelphia Museum of Art in most ways fit the paradigm of the encyclopedic art museum as it had existed in Europe and North America since the nineteenth century. It had unique origins in education and industrial design, but it quickly fell into the patterns of similar institutions that showcased monumental narratives of Western art. Over time it became more inclusive with programs to sponsor public art and to acquire and exhibit more art by women and people of color, although funding, purchases, and outreach programs to under-served communities could only begin to address the history of an institution whose world-renowned collection reflected the hierarchical tastes of elite donors and curators. By the twenty-first century, exhibition and program strategies sought to mobilize the museum and its collections in multiple and sometimes surprising ways, despite the heritage they most visibly embodied.\n\nMabel Rosenheck is a writer and historian in Philadelphia. She received her Ph.D. in media and cultural studies from Northwestern University and works at the Wagner Free Institute of Science, Temple University, and elsewhere.\n\nCopyright 2019, Rutgers University"}, {"url": "https://www.britannica.com/topic/Philadelphia-Museum-of-Art", "page_content": "Philadelphia Museum of Art (PMA), formerly (1876–1938) Pennsylvania Museum and School of Industrial Art, art museum of international renown located in Fairmount Park in Philadelphia. Its collection of approximately 240,000 objects spans all of art history and is particularly strong in American, European (medieval to the present), and Asian art. Also included under the auspices of the Philadelphia Museum of Art (PMA) are the city’s Rodin Museum and the historic houses Mount Pleasant, an 18th-century Georgian home, and Cedar Grove, an early 20th-century residence.\n\nThe Philadelphia Museum of Art emerged from the 1876 International Exhibition of Arts, Manufactures and Products of the Soil and Mine, also called the Centennial Exhibition, a world’s fair held in Fairmount Park in commemoration of the founding of the United States of America. The fine arts gallery of the Centennial Exhibition was held in Memorial Hall, which was constructed for the fair. Memorial Hall remained open as a museum of art following the fair, and the Pennsylvania Museum and School of Industrial Art (as it was called until 1938) was chartered in February 1876. The museum opened to the public in May 1877, and classes began in December of that year.\n\nThe institution’s first curatorial departments were established in 1893: textiles, lace and embroidery, numismatics, and pottery. With the ever-increasing flow of visitors, the museum soon grew out of Memorial Hall. Although a new building was proposed in 1894, plans were not finalized until 1917, and the building opened its doors to the public only in 1928. Its interior was not completed until nearly three decades later.\n\nThe museum pioneered many practices that endure in art museums today. In 1903 it became the first museum to issue a museum bulletin, a quarterly publication (though it became less frequent in time) of professional and scholarly interest. That year the museum also formed the Bureau of Identification, a department that evaluated works of art for authenticity, medium, maker, and other identifying information. Private owners and museums around the country turned to the bureau for expert opinions. The museum began its notable Indian art collection in 1919 with a major gift of sculptural architectural elements from a temple hall that originated in Madurai, in Tamil Nadu. The temple hall was reconstructed and continued to have a dedicated gallery in the museum into the 21st century.\n\nIn 1925 architect and architectural historian Fiske Kimball was appointed director of the museum, a position he held for 30 years. Under his direction the collection moved into its building on the Benjamin Franklin Parkway in 1928. One of Kimball’s major contributions to the new museum’s collections was its highly authentic period rooms, interiors reconstructed to appear as they did in their original context. Other contributions by Kimball included the chronological installation of the museum’s works of art and the establishment of the education department in 1929.\n\nIn 1938 the museum officially changed its name to the Philadelphia Museum of Art. The school was separated from the museum in 1964 and eventually became the University of the Arts. By that time the museum was administering the Rodin Museum, Mount Pleasant, and Cedar Grove as well as other historic houses, such as Lemon Hill and Letitia Street House, all located in Fairmount Park. At the end of the decade, the museum opened its first on-site conservation laboratory. Despite nationwide economic hardship during the 1930s, the museum made a number of significant acquisitions to the collection, including 48 photographs by Frederick Evans, Augustus Saint-Gaudens’s sculpture Diana (1892–93), and Paul Cézanne’s The Large Bathers (1900–06).\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nFinally, in 1956 the museum’s collection was relocated in its entirety from Memorial Hall to the building that had opened in 1928. The museum’s building became world famous when its grand front steps appeared in the film Rocky (1976) as part of a training scene for the fictional boxer Rocky Balboa, played by Sylvester Stallone. The museum’s steps themselves then became one of Philadelphia’s major tourist destinations.\n\nIn 2000 the museum further expanded, converting the former headquarters of the Fidelity Mutual Life Insurance Company—an Art Deco building located across the parkway—into the Ruth and Raymond G. Perelman Building, which contains galleries for costumes and textiles, contemporary art and design, and prints and drawings as well as a library (open to the public) and study centres. In 2009 the museum expanded to include the Anne d’Harnoncourt Sculpture Garden, which was dedicated to the memory of the director and chief executive of the PMA who had died suddenly in 2008. In 2021 the first part of a renovation and expansion of the main building was completed. Designed by architect Frank Gehry, the reconstruction included a refurbished entrance, an atrium for performances and events, and additional gallery space.\n\nAmong the many highlights of the PMA collection are Drawing Room from Lansdowne House, designed by Robert Adam (c. 1765–66), Thomas Eakins’s Portrait of Dr. Samuel D. Gross (The Gross Clinic) (1875), Vincent van Gogh’s Sunflowers (1888 or 1889), Edgar Degas’s After the Bath (Woman Drying Herself) (c. 1896), Claude Monet’s The Japanese Footbridge and the Water Lily Pool, Giverny (1899), Marcel Duchamp’s Nude Descending a Staircase, No. 2 (1912), Grace Kelly’s wedding dress (1956), and Paul Strand’s photographs (acquired in 2010). In the 21st century the PMA was considered the foremost repository for the study of Eakins, Duchamp, and Strand."}, {"url": "https://www.utimes.pitt.edu/news/art-gallery-exhibits", "page_content": "Two new exhibitions will be showcased at the University Art Gallery for the fall semester: “The Curious Drawings of Doctor Clapp” and “Metal from Clay: Pittsburgh’s Aluminum Stories.”\n\nBoth exhibitions are set to open with a reception from 5 to 7 p.m. Oct. 24 in the Frick Fine Arts Building and run until Dec. 6, according to a news release. They will both be free of charge.\n\nThe Clapp exhibition, which is curated by undergraduate Museum Studies students, will include a more than 300 drawings from a notebook George Hubbard Clapp donated to Pitt in 1941. Some drawings are sketches, while others copy classic Renaissance art, the release said. This is the first time these drawings have been displayed in 30 years.\n\n“As always, we are thrilled to invite the public to see the exceptional work of our Museum Studies student researchers and curators on display,” said Sylvia Rhor, art gallery director. “ ‘The Curious Drawings of Doctor Clapp’ bridges the gap between art and natural history, offering a fascinating glimpse into the enigmatic world of a renowned collector and important figure in university and local history.”\n\nIt also will include rare objects from Clapp’s collection, which are on loan from the Carnegie Museum of Natural History.\n\nThe “Aluminum Stories” exhibit will showcase history found in aluminum in objects from other Pittsburgh collections, according to the release. These objects include early production aluminum on Smallman Street, a new art installation from sculptor Atticus Adams and more.\n\nThe exhibit will feature objects on loan from the Carnegie Museums of Art and Natural History, the Heinz History Center, Rivers of Steel and more.\n\n“Pittsburgh’s designation as the ‘steel city’ is entirely too restrictive,” said Alex Taylor, academic curator and assistant professor in the Department of History of Art and Architecture. “The city’s leading cultural institutions have all been shaped by the history of aluminum, and we are grateful to have drawn on their rich collections for this display.”\n\nThe University Art Gallery is open 10 a.m. to 4 p.m. Mondays through Fridays and until 7 p.m. Thursdays."}, {"url": "https://peoplepill.com/people/george-hubbard-clapp/", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor.\n\nTaxa named in honour"}, {"url": "https://www.nytimes.com/2021/05/30/arts/design/philadelphia-museum-gehry-renovation.html", "page_content": "PHILADELPHIA — You know what’s chicer than spending a ton on a landmark building? Spending a ton and barely showing it.\n\nWhen other museums and cultural institutions have turned to Frank Gehry, the Canadian Angeleno and 92-year-old grandmaster of torquing titanium, he has summoned up buildings both inventive and ostentatious: curves of metal at the Guggenheim Bilbao or Disney Hall in Los Angeles, or billowing sails of glass at the Fondation Louis Vuitton in Paris. But here in Philadelphia, where he was tasked to reimagine one of the country’s oldest and most significant museums, he has left the stainless steel and the kinematics software at home.\n\nFifteen whole years after the Philadelphia Museum of Art engaged Gehry for an expansion and renovation of its Beaux-Arts home at the top of the Benjamin Franklin Parkway, the first part of the work is complete — and discreet. His Core Project, as the museum calls it, has cleared out and reshaped the underground guts of its Greek Revival home to produce 20,000 additional square feet of galleries, along with a refreshed entrance and an atrium with potential for performances and gatherings in post-pandemic days. It’s cost $233 million so far, and this is just part one; next will come additional new galleries underground, and a window puncturing the eastern staircase (you know, the one from “Rocky”)."}, {"url": "https://www.coinworld.com/news/us-coins/eac-convention-highlight-visit-to-clapp-collection-of-large-cent-duplicates", "page_content": "This 1853 Coronet cent shows the result of a lack of attention to preservation.\n\nThis variety of 1794 Liberty Cap cent, here in About Uncirculated condition, is called the “Apple Cheek” variety for obvious reasons.\n\nThis 1793 Flowing, Hair, Chain, AMERI. cent in Extremely Fine condition is from the first production at the U.S. Mint in Philadelphia.\n\nRenowned numismatist George H. Clapp donated his primary collection of more than 1,500 United States large cents to the American Numismatic Society in New York city in the 1940s with more than 500 duplicate coins sent to the Carnegie Museums of Pittsburgh around the same time.\n\nOne of the highlights for attendees at the Early American Coppers 2020 convention April 30 to May 3 will be a visit to the Carnegie Museums of Pittsburgh and the George H. Clapp Collection of U.S. large cent duplicates.\n\nClapp was an 1877 engineering graduate of Western University of Pennsylvania, now known as the University of Pittsburgh. He is recognized as one of the pioneers of the processes for manufacturing aluminum.\n\nCopper attraction\n\nClapp also developed an affinity circa 1923 for copper in the form of U.S. copper cents , primarily 1793 to 1814. Clapp had become involved in numismatics at an early age and was a founding member of the Western Pennsylvania Numismatic Society.\n\nClapp’s brother, Charles, a stockbroker, had an extensive collection of large cents, the foundation of which was the James W. Ellsworth Collection. (Ellsworth was a member of the board of governors of the World’s Columbia Exposition 1892 to 1893.)\n\nWhen Charles fell on financial hard times, he sold his cent collection to his brother, who extensively added to the collection.\n\nGeorge Clapp’s pursuits included numismatic scholarship in the form of research on early U.S. large cent varieties, resulting in, among other publications, his 1931 monograph, The United States Cents of the Years 1798–1799.\n\nAccording to American Numismatic Society Collections Manager Dr. Elena Stolyarik, “In 1937, George Clapp signed a deed of gift, donating 1,350 large cents (1793-1857) to the ANS but retaining possession of the collection until he finished the book he was working on. As reported in our database, [when] the collection was delivered to the ANS in 1946, it had increased to 1,523 large cents.”\n\nCirca 1946 to 1947, Clapp also donated some 500 duplicates to the Carnegie Museums of Pittsburgh.\n\nDr. William H. Sheldon used Clapp’s research and his coins donated to the ANS as the foundation of his 1949 reference with Dorothy Paschal, Early American Cents, re-titled Penny Whimsy in later editions.\n\nA number of the coins Clapp had donated to the ANS wound up, oddly, decades later, in private collector hands, having been stolen by Sheldon, who swapped out inferior coins of his own for the Clapp coins.\n\nThe ANS ultimately filed a civil suit seeking the return of the stolen coins from those collectors with whom the stolen Clapp coins resided. Many of the stolen Clapp coins were eventually repatriated to the ANS holdings.\n\nCarnegie connection\n\nAmong the duplicate large cents donated to the Carnegie Museums of Pittsburgh, according to Early American Coppers President William Eckberg, is the 1793 Flowing Hair, Chain, AMERI. cent, Sheldon 1.\n\nAdditional pieces include a 1794 Liberty Cap, Apple Cheek cent, S-24; 1795 Liberty Cap, Jefferson Head cent, S-80, considered by researchers to be a privately struck piece but still collected as part of the early cent series; 1802 Draped Bust cent, S-232; 1810 Classic Head cent, S-282; and 1819 Coronet cent, Newcomb 11, as attributed by Howard Newcomb in United States Copper Cents 1816–1857.\n\nEckberg says some of the Clapp duplicate large cents show evidence of neglect, and lack of conservation.\n\nConnect with Coin World:\n\nSign up for our free eNewsletter\n\nAccess our Dealer Directory\n\nLike us on Facebook\n\nFollow us on Twitter"}, {"url": "https://prabook.com/web/george.clapp/2302796", "page_content": "George Clapp\n\nZoologist\n\nDecember 14, 1858 (age 90) Allegheny City, Pennsylvania , United States\n\nClapp took an engineering position at Park Brothers\" Black Diamond Steel Works. There, along with Captain Alfred East. Hunt, he established the Pittsburgh Testing Laboratory\"s chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew West. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company\"s working capital. As Clapp\"s wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie. Beginning in 1907 until his death, Clapp was president of Pitt\"s Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor. Clappia Walker, 1909 Planogyra clappi (Pilsbry, 1898)."}, {"url": "https://alchetron.com/George-Hubbard-Clapp", "page_content": "George Hubbard Clapp (1858–1949) was an American pioneer in the aluminum industry and also a numismatist.\n\nHe was born on December 14 in Allegheny City, Pennsylvania, now a part of Pittsburgh, the son of Delia Dennig Hubbard and DeWitt Clinton Clapp, an iron company executive. He graduated from the Western University of Pennsylvania, today's University of Pittsburgh, in 1877. He married Anne Love in 1882 and the couple had two children.\n\nClapp took an engineering position at Park Brothers' Black Diamond Steel Works. There, along with Captain Alfred E. Hunt, he established the Pittsburgh Testing Laboratory's chemistry department. Hunt formed a company in 1888 to exploit the Charles Martin Hall patents for making aluminum by electrolysis. Clapp was treasurer and secretary of the fledgling company. He resigned as treasurer in 1892 and was replaced by Andrew W. Mellon. The company became later known as the Aluminium Company of America. While Hall is generally credited with the invention the aluminum process, Clapp raised the initial venture capital to make the process commercially viable. The Mellon interests supplied the company's working capital.\n\nAs Clapp's wealth grew, he pursued his avocational interests in conchology and numismatics. He had begun collecting coins as a boy in the 1870s by sifting through the coins of a toll bridge across the Allegheny River. He later became a founder of the Western Pennsylvania Numismatic Society. His grandfather encouraged him to start collecting shells. Over the years he assembled more than 100,000 mollusk shells, which he later donated to the Carnegie Museums of Pittsburgh. In the 1930s he donated his coin collections to both the American Numismatic Society and the Carnegie.\n\nBeginning in 1907 until his death, Clapp was president of Pitt's Board of Trustees. He was a driving force in moving the school from its North Side location to the Oakland district. He also was a trustee of the Carnegie Institute of Technology, today's Carnegie Mellon University and a member of the American Chemical Society.\n\nHe died at age 90 on March 31, 1949 at his home in Sewickley, Pennsylvania. Clapp Hall, an academic building on the Pitt campus, is named in his honor."}]}