{"Merle Oberon appeared in a variety of films, including Wuthering Heights in 1939, which earned her an Academy Award nomination for Best Actress.": [{"url": "https://www.britannica.com/biography/Merle-Oberon", "page_content": "Merle Oberon, (born February 19, 1911, Bombay [now Mumbai], India—died November 23, 1979, Los Angeles, California, U.S.), British and American film actress who appeared in more than 30 motion pictures. Her most notable portrayal was that of the beautiful Cathy, who tormented and rejected Heathcliff (Laurence Olivier) in the 1939 classic Wuthering Heights.\n\nThe daughter of an Indian mother and a British army officer, Arthur Thompson, stationed in India, she was christened Estelle Merle. Moving to England, she played bit parts on stage and in films until she was discovered by the producer Alexander Korda, whose protégée and wife she became. Early in her career she created a fictional autobiography, claiming to have been born in Tasmania of Irish, French, and Dutch descent and christened Estelle Merle O’Brien Thompson.\n\nBritannica Quiz Pop Culture Quiz\n\nWorking in both England and Hollywood, she achieved stardom as a hauntingly beautiful dark-eyed woman of grace and spirit. She first starred as Anne Boleyn in The Private Life of Henry VIII (1933), opposite Charles Laughton. She played opposite Douglas Fairbanks, Sr., in The Private Life of Don Juan (1934), Leslie Howard in The Scarlet Pimpernel (1934), and Maurice Chevalier in Folies Bergère (1935). She was cast as George Sand in the movie A Song to Remember (1945) and Napoleon’s Josephine in Désirée (1954). Her last screen appearances were in Hotel (1967) and Interval (1973)."}, {"url": "https://www.theguardian.com/film/2023/mar/06/merle-oberon-oscars-best-actress", "page_content": "Magazine writers didn’t know what to make of Merle Oberon when she took Hollywood by storm in the 1930s. One writer described her as “bizarre, bewildering, and different”, while others marveled at her “delicate” oval face, “eloquent” emerald eyes, “bright red lips” and “alabaster” skin.\n\nThough her 1936 best actress Oscar nomination for the coming-of-age drama The Dark Angel affirmed her place in a league with Katharine Hepburn and the eventual winner, Bette Davis, the glamor paragons of the day, it was only later that the world discovered Oberon was a south Asian woman passing for white.\n\nGiven the way Everything Everywhere All at Once has dominated this awards season, it seems increasingly likely that Michelle Yeoh will take home this year’s best actress prize. But when Yeoh’s name was announced among the best actress nominees for this year’s Academy Awards in late January, the Hollywood Reporter was at pains to call the veteran actor “the first person who identifies as Asian to ever be nominated for the award”.\n\nLaurence Olivier and Merle Oberon in Wuthering Heights. Photograph: United Artists/Allstar\n\nCritics condemned the declaration as too politically correct, even as it captured the complex tie that binds these women, each a product of her time. Where the 60-year-old Yeoh is a butt-kicking film pioneer on the brink of smashing a cultural ceiling for playing a role originally written for Jackie Chan, Oberon carefully hid her true identity to evade certain racial persecution and took that secret to her grave. It wasn’t until decades after her death in 1979 at age 68 that the world learned her truth. That, not Oberon’s eye-opening work in The Dark Angel, is what should rightly be hailed as her signature performance.\n\n“When you think about the story of racial representation,” says Shilpa Davé, an assistant professor of media studies at the University of Virginia, “Merle Oberon is a really important part. She brings a global aspect to it, the shades of brown.”\n\nBorn Estelle Merle O’Brien Thompson in what was then the British Indian city of Bombay, Oberon was determined to make the most of her innately fairer complexion. It became her ticket to a bigger world, the shroud that helped disguise the fact that she was the product of rape. Her birth father was the Anglo-Irish foreman of a tea plantation. Her mother, believed to have been of Sri Lankan and Māori ancestry, was just 14 when she gave birth in 1911. After centuries of intermixing, babies born from biracial relationships had evolved into a quiet shame – shunned by Britons and Indians alike.\n\nThe family nicknamed Oberon “Queenie”, as her birth coincided with Queen Mary and King George’s visit to India. In an attempt to soften Oberon’s lot in life, her grandmother raised her as her own and convinced her that her teenage mother was actually her half sister. But that wasn’t enough to shield Oberon from the relentless taunts over her mixed heritage. At the age of three, after a cross-country move to Calcutta, she won a scholarship to one of the city’s best all-girls private schools, only for classmates to drive her out with their overt racism. Films and the nightlife scene became her escape, and playing pretend key to her survival.\n\nMerle Oberon and Leslie Howard in The Scarlet Pimpernel. Photograph: Allstar Picture Library Ltd/Alamy\n\nIn adolescence, Oberon began honing a posh accent and lightening her skin with bleach creams loaded with ammoniated mercury – a dangerous poison that had more of a weakening effect on Oberon’s many male suitors. Those who didn’t dump her outright after discovering her race helped sponsor her moves from India to France and England, where she worked for a time as a club hostess under the name Queenie O’Brien. When she became romantically involved with the Hungarian-born British director Alexander Korda, Oberon’s acting career clicked into high gear.\n\nA bit part as Anne Boleyn in the 1933 blockbuster The Private Life of Henry VIII announced her breakout. A mad scramble to come up with a cover story for the actor credited as “Merle Oberon” ensued. She told people she had been born in Tasmania “because it was so far from the US and Europe and generally considered to be ‘British’ to its core”, wrote Marée Delofski, director of the 2002 documentary The Trouble with Merle. (In her lifetime, Oberon visited Australia twice.) Oberon claimed her birth records had been destroyed in a fire. (Her half-brother, Harry, would discover them in Bombay, now Mumbai, after her death.) As for her much darker-skinned mother – her biological grandmother – Oberon presented her as a maid.\n\nSuch was the cost of making it in show business at a time when the US government was keen to crack down on indecency. Rather than leave it up to lawmakers, Hollywood seized on the opportunity to police itself, adopting a set of rules known as the Hays Code – which, among many other things, frowned upon interracial romance. With representational casting essentially made illegal, studios embraced yellow and blackface. And when Oberon’s early work with Korda, whom she eventually married, led to a successful career under Samuel Goldwyn, it became in everyone’s best interest to keep her identity a mystery. “Think about it,” says Davé. “She was part of this cadre of actors and actresses that were loaned out to make all these movies. She was dependent on Goldwyn and Korda for her livelihood. I can see why she had to hide in that way. She had no power.”\n\nNot even the 1936 best actress nomination brought Oberon any extra clout. For a start, the Oscars were barely a decade old and not yet the gold standard award. For another, the media was even tougher on female actors than they are now and held Oberon up for extra scrutiny.\n\nOberon gets a tip as she leaves for Royal Ascot, in a 1950 photo in London. Photograph: Norman Vigars/Getty Images\n\nOne critic derided Oberon’s performance in the 1934 action film The Scarlet Pimpernel, citing a “tendency to strongly orientalize her appearance by means of facial makeup and the slant of black brows”. When a 1934 Los Angeles Times story used the term “Euro-Asian” to describe her, Oberon dismissed it as a coincidence. In an ad campaign for Max Factor, the cosmetics brand bragged about how its makeup turned her from “slightly unreal and exotic” to a “beautiful, charming girl”.\n\nIt’s ironic that she would be Oscar nominated for The Dark Angel, a film about a first world war love affair that is complicated when the male protagonist suffers a battle injury that costs him his eyesight. Strangely, it was Oberon’s only nomination, even as Hepburn and Davis became Oscar perennials and Oberon kept working into the early 70s. She starred opposite Laurence Olivier in 1939’s Wuthering Heights and as herself in 1966’s The Oscar, which is about the awards.\n\nStill, she soldiered on in spite of the damage she’d caused to her skin from so much bleach cream and a car accident that left her disfigured and forced Korda to abandon production of the epic I, Claudius. To keep the cracks in Oberon’s white facade from surfacing on screen, the cinematographer Lucien Ballard developed a special camera light for her to obscure her facial scars. This was after “Lady Korda” had divorced her knighted director husband to marry Ballard.\n\nOn her downslope, Oberon reveled in her grand dame status, regaling magazine reporters with her true Hollywood stories, when she wasn’t making the odd cameo on the game show What’s My Line? or presenting a special achievement award to the Poseidon Adventure at the 1973 Oscars. Even then Charlton Heston called her “a lady whose beauty is not only a legend, but a reality”.\n\nBut even as times changed and Hollywood’s aversion toward race mixing on screen began to relax, Oberon remained committed to her lie and quickly tightened up when it unraveled. When her nephew Michael Korda, then editor-in-chief at Simon and Schuster, tried to write a biography on Oberon, he says, she threatened to sue him and cut him out of her will if he used real details. So he turned it into the roman-à-clef Queenie, which became an ABC miniseries.\n\nAccording to the Australian historian Cassandra Pybus, a visit to Hobart in 1978 turned awkward for Oberon when officials couldn’t find proof that she had been born in Tasmania. After confirming as much, Oberon ducked reporters and skipped a ceremony at a theater named in her honor before quietly returning home.\n\nA year later, she died in Malibu from a stroke."}, {"url": "https://www.nytimes.com/1979/11/24/archives/merle-oberon-68-star-of-films-including-wuthering-heights-liked.html", "page_content": "When the film opened in 1939, Frank S. Nugent of The New York Times, wrote:\n\n“So Mr. Olivier has played Heathcliff, and Miss Oberon, as Cathy, has matched the brilliance of his characterization with hers. She has perfectly caught the restless, changeling spirit of the Brontë heroine who knew she was not meant for heaven and broke her heart and Heathcliff's in the synthetic paradise of her marriage with gentle Edgar Linton.”\n\nAlso in the movie were David Niven as Linton and Geraldine Fitzgerald.\n\nLiked ‘Healthy’ Things\n\nMiss Oberon's career was a record of persistence, ingenuity, hard work and good luck, and she retained her smooth, youthful looks better than many another film star of her generation. “Luckily, I like all the things that are healthy,” she once said, “like exercise, rest, sensible food, no alcoholic drinks, unless a sip of wine, and no cigarettes.”\n\nMiss Oberon was born Estelle Merle 0'Brien Thompson on Feb. 19, 1911, on the island of Tasmania, near Australia, the daughter of a British Army major who died just before her birth. She grew up in Bombay and Calcutta, studying French and Hindustani along with the traditional subjects, and danced at the Calcutta Amateur Theatrical Society.\n\nWhen she was 16, an uncle, also a British officer, took her for a visit to London, where she enrolled in dancing school and decided to stay. She took a job as a dance hostess at the Café de Paris even though she considered it much beneath her, the product of the highly snobbish British Army presence in India. But the job came with free dinners, and that became the deciding factor.\n\nEven then, Miss Oberon, known as Queenie Thompson, was noted for her beauty. Her first screen test nevertheless ended in disaster, but she soon found herself playing bit parts after a second one turned out better."}, {"url": "https://www.imdb.com/list/ls091390027/", "page_content": "104 min | Drama, Romance\n\nFour friends reminisce in old age. Each of the men had been in love with the main character, Lydia. The interweaving stories reveal the reason why she never married any of them and, indeed, never married at all.\n\nDirector: Julien Duvivier | Stars: Merle Oberon, Joseph Cotten, Edna May Oliver, Alan Marshal\n\nVotes: 839"}, {"url": "https://www.tcm.com/tcmdb/person/143928%7C111010/Merle-Oberon", "page_content": "Biography\n\nThe exotic and glamorous Merle Oberon ranked among the most striking performers during the early years of sound cinema in Britain. Beginning with her first notable turn in \"The Private Life of Henry VIII\" (1933), Oberon's popularity grew via additional hits like \"The Scarlet Pimpernel\" (1934), and her Academy Award-nominated performance in \"The Dark Angel\" (1936) established her as a star in America as well. Well cast as sophisticated, upper-class women, her look and deportment worked nicely in both period costume outings and contemporary drama. However, in what could have been a career-ending disaster, Oberon's face was damaged in a car accident during the making of \"I, Claudius\" (1937). Careful lighting and make-up helped to hide the imperfections and it was not long before she appeared in her most famous role as heroine Cathy in \"Wuthering Heights\" (1939). American films made up the lion's share of the actress' schedule during the 1940s, but aside from occasional artistic triumphs like \"The Lodger\" (1944), they were fairly unremarkable and caused Oberon's popularity to diminish. Her career proceeded by fits and starts from the late '40s onward and never entirely recovered, despite laudable work from her in quality productions like \"Berlin Express\" (1948) and Désirée (1954). Oberon did not have the range of the finest actresses from that period, but she could be very effective in the right part and consistently dazzled the eye as one of Golden Age Hollywood's great beauties.\n\nMerle Oberon was born Estelle Marie Thompson on Feb. 19, 1911, but the story of her origins ranked among the most convoluted and uncertain for a Golden Age performer of her stature. When Oberon's star was on the rise, she claimed be a native of Tasmania, who just grew up in India. However, she was actually born in Mumbai to Constance Selby, a Eurasian girl who was only 15 years old at the time, and British engineer Arthur Thompson. Selby's mother, Charlotte, raised Oberon and pretended to be her birth mother in later years, when in actuality, she was the child's grandmother. As a result of this deception, facts about Oberon's childhood were difficult to ascertain, though it was known that those early years were marked by poverty and racial prejudice stemming from her mixed heritage. At some point, Oberon was known under the name Queenie Thompson and began to act on stage as part of a Calcutta drama society. An actor who had a romantic interest in her suggested that she move to France, where he promised to recommend Oberon to director Rex Ingram, who ended up giving the teenager a small part in his film, \"The Three Passions\" (1929). Oberon - accompanied by her grandmother, whom she passed off as a maid - then travelled to England and was featured in several other movies over the next few years, but her roles were mostly unremarkable and uncredited.\n\nThat anonymity finally changed when she caught the eye of producer-director Alexander Korda, who put Oberon under contract with his new company and cast her in his historical biopic \"The Private Life of Henry VIII\" (1933). In the picture, she played the murderous monarch's second wife, Ann Boleyn, and while the part was secondary in nature (understandably, given Boleyn's fate), her unique and highly photogenic beauty left an impression. A comparatively modest venture in terms of its production, \"The Private Life of Henry VIII\" was nonetheless a very important undertaking in the early days of British sound films and its success prompted Korda to launch a series of similar historical dramas. \"The Private Life of Don Juan\" (1934) placed Oberon opposite Douglas Fairbanks as an aging version of the famous libertine, while in \"The Scarlet Pimpernel\" (1934), Oberon displayed fine chemistry with Leslie Howard and made the most of a somewhat limiting role as heroine Lady Blakeney. Their connection extended off-screen and prompted Howard to have an affair with Oberon, cheating on his wife of almost 20 years.\n\nOn the basis of these successes, Oberon was invited overseas to make her first American movie, the musical comedy \"Folies Bergère\" (1935) and her strong performance as the romantic interest of Fredric March and Herbert Marshall in \"The Dark Angel\" (1936) earned Oberon a Best Actress Academy Award nomination. However, her follow-up project was a far less happy experience. During the shooting of \"I, Claudius\" (1937), Oberon was involved in a car accident from which she sustained some facial scars. Not enough footage had been shot for the film to be completed, so a decision had to be made about whether to continue. Star Charles Laughton, who felt that he had been unable to do justice to the title character, was reportedly the primary factor in the decision to close the production down and leave it unfinished. Surgeons were unable to correct the damage Oberon sustained, but careful lighting and make-up application sufficiently masked the flaws and she soon returned to the screen in her first Technicolor production, \"The Divorce of Lady X\" (1938).\n\nOberon returned to England for her most famous screen assignment as Cathy Earnshaw in William Wyler's lush adaptation of Emily Brontë's \"Wuthering Heights\" (1939) - the most beloved film adaptation of the tragic novel. But while the finished film went over very well with critics and the public, the production was a less than happy experience. Co-star Laurence Olivier's relationship with the actress on-set was soured by his disappointment over Oberon being chosen for the part instead of his off-screen paramour, Vivien Leigh. The pettiness and pointless bad behavior that ensued from Olivier, fortunately, did not come across in the leads' performances and they display wonderful romantic chemistry, making \"Wuthering Heights\" the penultimate romantic tragedy.\n\nOberon married Korda in 1939 and she soon concentrated her efforts on the American market in solid but somewhat unremarkable features like \"'Til We Meet Again\" (1940), \"That Uncertain Feeling\" (1941), and \"Affectionately Yours\" (1941). She was one of more than 80 stars to make up the once-in-a-lifetime cast of \"Forever and a Day\" (1943), a historical drama created to raise money for the British war effort, and Oberon's distinctive beauty was showcased to excellent effect as an actress menaced by a Jack the Ripper-style killer in \"The Lodger\" (1944), a stylish and thrilling remake of Alfred Hitchcock's 1927 silent thriller. Although cameramen had effectively compensated for Oberon's scars in previous films, cinematographer Lucien Ballard and his expert lighting placement - which included a light actually attached to the camera, later known as an \"Obie\" - made her face look especially luminous. The pair fell in love during production and married the next year, following Oberon's divorce from mentor Korda.\n\nHowever, Oberon's new relationship coincided with a gradual fading in her popularity, which was not helped by middling fare like the melodramatic Chopin biopic \"A Song to Remember\" (1945) and the soapy misfire \"Night Song\" (1947), though the well-realized film noir thriller \"Berlin Express\" (1948) ranked among the best movies she made in the U.S. Her marriage to Ballard ended in 1949 and Oberon tried to revitalize her career by heading to France for the little seen farce \"Pardon My French\" (1951). She remained there for the comedy \"Dans la vie tout s'arrange\" (\"In Life Everything Works\") (1952) before heading to England for \"Affair in Monte Carlo\" (1952) and Spain for the light-hearted fantasy \"Todo es posible en Granada\" (\"Everything is Possible in Granada\") (1954). None of those pictures did much to raise her profile, but Oberon managed a notable return to Hollywood with a moving supporting turn as Empress Josephine in Désirée (1954).\n\n\"Deep in My Heart\" (1954), Stanley Donen's colorful MGM musical about the life of composer Sigmund Romberg, cast her as his lovelorn collaborator, Dorothy Donnelly, and Oberon received top billing in the film noir outing \"The Price of Fear\" (1956), where she played a hit-and-run killer seeking to avoid the law by framing unsuspecting dupe Lex Barker. However, offers again became scarce and she accepted an unusual outing as host of \"Assignment Foreign Legion\" (CBS, 1956-57), a British dramatic television series featuring guest players like Christopher Lee, Lionel Jeffries, and Anton Diffring. During that time, she wed her third husband, Bruno Pagliai, and the couple had two children. Pagliai was her first mate to not be associated with the motion picture business and it ended up being the actress' longest-lasting relationship.\n\nIn 1960, Oberon received a star on the Hollywood Walk of Fame for her film work, but she remained away from movie screens until \"Of Love and Desire\" (1963), a mediocre drama shot in various locations in Mexico, including Oberon's own extravagant home. Her next credit was something of a surprise to fans. \"The Epic That Never Was\" (BBC, 1965) covered the making of \"I, Claudius\" and the factors that caused it to be shut down. Some of the surviving footage was showcased (with the general consensus that Laughton's interpretation of the role was actually more than sufficient), along with new interviews featuring Oberon, director Josef Von Sternberg and other personnel involved with the picture. She was also part of the all-star cast that checked into \"Hotel\" (1967), an unexceptional adaptation of Arthur Hailey's best seller.\n\nAfter an absence of six years, Oberon had her final film appearance in the drama \"Interval\" (1973), an American/Mexican co-production that she also produced. The story of an aging, but still lovely woman who falls for a young artist (Robert Wolders), the thoroughly minor, little-seen production turned out to be somewhat prophetic as Oberon proceeded to divorce Pagliai and wed Wolders, then almost 25 years her junior. Oberon settled into retirement thereafter and in 1978, she and Wolders journeyed to Tasmania for what was described as a welcome home reception. However, while attending a function held in her honor, Oberon denied having been born in the country. A year later, she died of a stroke on Nov. 23, 1979. In 1985, Oberon's nephew, author Michael Korda, published Queenie, a novel based loosely on the actress' life, which was followed by a like-named ABC miniseries in 1987. With Mia Sara in the title role, and veterans like Kirk Douglas (as a character based on Alexander Korda) and Martin Balsam in support, the production benefitted from location shooting in India, England and Sri Lanka and was generally deemed to be trashy, but sufficiently diverting. It certainly made clear the lengths to which Oberon was forced to hide her biracial ethnicity in order to become a Hollywood movie star.\n\nBy John Charles"}, {"url": "https://famousdb.net/merle-oberon/", "page_content": "Introduction\n\nMerle Oberon was a British actress who made a significant impact in Hollywood during the 1930s and 1940s. She was known for her beauty, elegance, and talent, which made her one of the most sought after actresses of her time. However, there is more to her life than just her acting career. In this blog post, we will explore the life and legacy of Merle Oberon, from her parents to her children and iconic movies.\n\nEarly Life and Parents\n\nMerle Oberon was born in Bombay, India, on February 19, 1911. Her parents were Arthur Terrence O’Brien Thompson, a British army officer, and Charlotte Selby, a Eurasian woman. Her parents’ relationship was scandalous at the time, as interracial marriages were not accepted in society. As a result, Oberon’s mother pretended to be her daughter’s older sister, and Oberon was raised to believe that her mother was her sister.\n\nOberon’s childhood was not easy, as she faced discrimination and racism because of her mixed-race heritage. However, her parents’ influence on her life was significant, as they encouraged her to pursue her dreams and become an actress. Her mother, in particular, was a strong influence on her, and Oberon later dedicated her autobiography to her.\n\nAccident and Early Career\n\nIn 1929, Oberon was involved in a car accident that left her with facial scars. She underwent plastic surgery to repair the damage, and the surgery was so successful that it left no visible scars. This event had a significant impact on her life, as it gave her a newfound confidence and led her to pursue a career in acting.\n\nOberon’s first acting role was in the British film “The Private Life of Henry VIII” in 1933. Her performance was well-received, and it led to more acting opportunities. She then moved to Hollywood in 1934 and signed a contract with Samuel Goldwyn. Her first Hollywood film was “The Dark Angel” in 1935, which earned her an Academy Award nomination for Best Actress.\n\nIconic Movies\n\nOberon’s career in Hollywood spanned over two decades, and she appeared in numerous films, including “Wuthering Heights” (1939), “The Scarlet Pimpernel” (1934), and “The Lodger” (1944). She was known for her beauty, elegance, and talent, which made her one of the most sought after actresses of her time.\n\nOne of her most iconic roles was in the film “The Divorce of Lady X” (1938), where she played opposite Laurence Olivier. The film was a critical and commercial success, and it solidified Oberon’s status as a Hollywood star.\n\nPersonal Life and Children\n\nOberon was married twice in her life. Her first marriage was to director Alexander Korda in 1939, but the marriage ended in divorce in 1945. She then married Italian industrialist Bruno Pagliai in 1957, and they remained married until her death in 1979.\n\nOberon had one child, a son named Francesca Pagliai, who was born in 1951. Francesca was the result of an affair between Oberon and actor Robert Wolders. Oberon kept her pregnancy a secret, and Francesca was raised by Pagliai as his own son.\n\nConclusion\n\nMerle Oberon’s life and legacy are a testament to her talent, beauty, and resilience. She overcame discrimination and racism to become one of the most sought after actresses of her time. Her legacy lives on through her iconic movies and her influence on future generations of actresses. She will always be remembered as a Hollywood icon and a trailblazer for women of color in the entertainment industry.\n\nFAQ"}, {"url": "https://www.filmcomment.com/blog/hiding-in-plain-sight-merle-oberon-mayukh-sen/", "page_content": "This article appeared in the June 17 edition of The Film Comment Letter, our free weekly newsletter featuring original film criticism and writing. Sign up for the Letter here.\n\nMerle Oberon in Night in Paradise (Arthur Lubin, 1946)\n\nIn May 1935, a new star shone on Hollywood’s horizon. Raven-haired and tan-complexioned, her eyes a striking shape, she looked unlike most leading ladies the industry had seen up until then. To the now-defunct film publication Screen & Radio Weekly, these traits made her “bizarre, bewildering, and different,” as if she were a foreign object who did not quite belong on American screens. Though she’d cut her teeth in British cinema, as the article noted, she had spent her early life in India. Her stage name was Merle Oberon.\n\n“Here they tell fabulous stories about her, one of the most often repeated being that she is Eurasian with a part-Hindu mother,” the piece continued. This rumor conflicted with the claim that Oberon sustained throughout her life: that she was born in Tasmania, Australia, and that her birth records had perished in a fire.\n\nBut the paper’s speculation wasn’t far from the truth, revealed only after Oberon’s death in 1979. In reality, she had been born into poverty in what is now Mumbai to a 12-year-old mother of Sri Lankan, Māori, and white ancestry, whom Oberon grew up believing was her sister; the identity of her biological father remains unclear. Raised by her grandmother (whom she thought was her mother) in what is today Kolkata, she had an interest in acting early in life and performed with the city’s Amateur Dramatic Society. A boyfriend offered to introduce her to the director Rex Ingram, so, while still in her teens, she pooled enough money to travel to France to meet the filmmaker. Ingram found Oberon’s appearance so entrancing that he cast her as an extra in a film of his, The Three Passions (1928). From there, she went to Britain, where her career took off. As she pursued fame abroad, though, Oberon deliberately concealed two truths about herself: she grew up poor, and she was (at least in part) Brown.\n\nThese were taboos in the era during which Oberon labored against impossible odds to become one of Old Hollywood’s brightest stars. Once in America, she would star in Sidney Franklin’s wartime romance The Dark Angel (1935), which earned her an Academy Award nomination for Best Actress in a Leading Role. Though the public had no clue about her mixed-race parentage back then (stories in gossip mills were pure conjecture), she is, to date, the only actress of known Asian descent to be nominated in that category in the 20th century, an embarrassing indictment of the Academy’s institutional blind spots.\n\nFor all its historical significance, though, Oberon’s sterling performance in The Dark Angel is rarely mentioned by critics today, along with her art more generally. Consider how casually the critic David Thomson wrote her off as a “renowned beauty with a graven face and the legend of mixed blood” who was nevertheless “often a dull actress” in his canonical The New Biographical Dictionary of Film. There’s been far more interest in Oberon’s off-screen torment. She inspired the character of Margo Taft (Jennifer Beals), an actress in the studio era who tries to suppress her biracial identity, on Amazon’s 2016-17 series The Last Tycoon; she was the subject of an episode of the You Must Remember This podcast in February of last year. The segment detailed painful stories of how Oberon bleached her skin, passed off her dark-skinned grandmother as her maid, and nearly sued a family member who sought to divulge her ancestry in a book. The ongoing fascination with Oberon’s inner turmoil is understandable in the present-day media landscape, where the history of racial discrimination in entertainment has begun to command greater scrutiny. Yet, as with many actors of color, it has eclipsed her actual work.\n\nOberon’s talents come across in an early appearance as the doomed Anne Boleyn in her future husband Alexander Korda’s The Private Life of Henry VIII (1933). The role is tiny—she disappears just after the 15-minute mark, executed for treason—yet she makes a distinct impression as a woman who dutifully accepts her terrible fate. Oberon teems with nervous energy; when she jokes that people will call her “Anne who lost her head,” the line is rattled off in a way that is both sardonic and haunting. The tension that Oberon brought to this and other roles may read as a lack of spontaneity to some, but that studied quality did not translate to discomfort before the camera; rather, Oberon’s agitated demeanor made the predicaments of her women seem compelling in their immediacy.\n\nThe director Harold Young would give this attribute more room to shine in The Scarlet Pimpernel (1934), where she is enchanting as an aristocratic woman during the French Revolution, unaware that her husband is leading a double life. Oberon projects regality, and Young gives her arresting close-ups that allow the actress to bring her character’s emotional dilemmas—namely her frustration at her husband’s seeming inattentiveness—to the surface. Though The Scarlet Pimpernel has the trappings of an adventure movie, it is Oberon who gives the film its soul.\n\nIn Britain, Oberon usually essayed roles of women with an aura of mystique. Such performances caught the eye of producer Samuel Goldwyn, who brought her to America and in short order cast her in The Dark Angel. The film would offer a change of pace: Oberon reportedly tired of the “exotic” label the press appended to her back in Britain, and grew determined to play more of an everywoman. Set in World War I–era Britain, Franklin’s film hinges on a love triangle involving Oberon’s Kitty Vane and her two male childhood friends. The Dark Angel tends to get classified as a melodrama, yet Oberon plays the film’s most potentially histrionic scenes with control. In a scene right before the film’s finale, she learns that the man she loves (Fredric March) didn’t die in the war as she believed. She’s thrilled that he’s alive, a fact that she mutters to herself repeatedly. The revelation could provoke a theatrical response, but Oberon speaks in a register that’s barely above a whisper, pulling the viewer close in this moment rather than playing to the gallery. It is an intelligent—and effective—actorly gesture.\n\nIn the years that followed, Oberon would give a moving performance in William Wyler’s These Three (1936) as a schoolteacher mired in scandal, and it was indeed Wyler who gave her her finest showcase as Cathy in Wuthering Heights (1939). Detractors might find her performance too stern to express Cathy’s “wild, uncontrollable passion for Heathcliff,” as the film’s narrator puts it. Pauline Kael, for example, described her as “chill and dainty” in the role. But Oberon creates a rich portrait of repressed longing. Cathy has high-society aspirations that clash with her love for Heathcliff (Laurence Olivier), a character termed “gypsy scum” in the film. (References to Heathcliff’s skin tone draw out the contrast with Cathy’s porcelain skin, indicating how successfully Oberon had “whitened” her public image by that point.) Her feelings for him fluctuate at the snap of a finger, shifting between affection and disgust. Oberon is stellar in wordless scenes—her first, for example, when Cathy must stomach her boorish brother’s disparaging comments about Heathcliff—as the actress’s coolly detached mien conveys the heroine’s struggle to hide her devotion.\n\nBut Oberon makes unexpected choices with dialogue too. In one pivotal scene, when Cathy realizes the depth of her bond with her forbidden lover, she proclaims, “I am Heathcliff!” The sequence may seem to call for a thunderous declaration (it is even accompanied by a strike of lightning), but Oberon resists the temptation for overstatement, her delivery touching in its directness.\n\nFew roles after that would task Oberon with such emotional demands. In the later decades of her life, she still acted, though less often. She succumbed to a stroke in Malibu when she was 68, taking the secrets of her birth and blood to her grave. Biographers Charles Higham and Roy Moseley, authors of the 1983 book Princess Merle, eventually located her birth records, finally unraveling her life’s enigmas.\n\nThe challenges that performers of color faced in Old Hollywood are finally coming to light, as we discover the prevalence of mixed-race actors who passed as white: Frankenstein (1931) star Boris Karloff was of Anglo-Indian heritage; Broadway legend Carol Channing would only disclose her paternal Black heritage in her 2002 autobiography; Fredi Washington of Imitation of Life (1934) found herself accused of passing even though she proudly owned her Blackness.\n\nOberon’s achievements in such a racist milieu are remarkable. It is easy to pity her as a tragic figure haunted by shame, silencing parts of herself to survive an inhospitable era in Hollywood. But maybe it’s possible to also celebrate her as a pioneer of the screen, one who left a lasting impact on an industry within which her success did not allow her a life true to her identity.\n\nIt was the strength of Oberon’s work before the camera, combined with the singularity of her beauty, that first captured the film establishment’s attention, after all—not her parentage, not her upbringing, not her trauma. “Merle Oberon in private life is delightful, but Merle Oberon of the screen is magnificent,” that early Screen & Radio Weekly article concluded. “She must be kept that way.”\n\nMayukh Sen is the author of Taste Makers: Seven Immigrant Women Who Revolutionized Food in America, out from W. W. Norton & Company in November. He has won a James Beard Award for his food writing and teaches food journalism at New York University.\n\n"}, {"url": "https://kids.britannica.com/students/article/Merle-Oberon/624059", "page_content": "(1911–79). British and American film actress Merle Oberon appeared in more than 30 motion pictures. Her most notable portrayal was that of the beautiful Cathy, who tormented and rejected Heathcliff (played by Laurence Olivier ) in the 1939 classic Wuthering Heights .\n\nIn the early 20th century prejudice and discrimination against non-white or mixed-race people was common in the Western world. This was particularly true in Hollywood , where white actors were often cast in Asian roles. In addition, Asian people were often stereotyped as villains or as inferior to white people. In order to get work as an actress, Oberon kept her Asian heritage hidden. She claimed to have been born on the Australian island of Tasmania, a former British colony. She said that she went to live with godparents in India after her father, a British army officer, died.\n\nOberon was born Estelle Merle O’Brien Thompson on February 19, 1911, in Bombay (now Mumbai), India. Her father was a British railway engineer working in India. Her mother was partly of Sinhalese (from what is now Sri Lanka ) and partly of Māori descent. Her mother was young when she gave birth to Oberon, and Oberon was raised by her grandmother. The family led Oberon to believe that her grandmother was her mother and her biological mother was her sister. Oberon’s father died when she was young, and the rest of the family moved to Calcutta (now Kolkata) in 1917. There in 1920 Oberon became involved with the Calcutta Amateur Theatrical Society. In 1928 she moved to London, England, to pursue acting. Her grandmother, who had darker skin, went with her as her maid.\n\nActing Career\n\nIn London, Oberon worked as a hostess in a nightclub. She also began accepting small, largely uncredited parts in both silent and talking movies. The director and producer Alexander Korda suggested that she use the stage name Merle Oberon. He gave Oberon her big break when he cast her in the role of Anne Boleyn in The Private Life of Henry VIII (1933). In the film she starred opposite Charles Laughton and earned praise for her portrayal of the second wife of England’s King Henry VIII. In 1934 Oberon played opposite popular actors Douglas Fairbanks, Sr., in The Private Life of Don Juan and Leslie Howard in The Scarlet Pimpernel.\n\nOberon then moved to the United States to begin an acting career in Hollywood. She first costarred with Maurice Chevalier in the musical comedy Folies Bergère de Paris (1935). That same year she costarred with Fredric March in the drama The Dark Angel. Oberon portrayed a woman who believes the man she loves was killed during World War I. She was nominated for an Academy Award in 1936 for best actress for that role. She thus became the first actor of Asian descent to be nominated for an Oscar. However, that record was not revealed until after her death in 1979, when her true heritage was discovered.\n\nIn 1937 Oberon was in an automobile accident that left her with scars on her face. However, with makeup and special lighting, she was able to continue her career in movies. She worked steadily through the late 1940s. Besides Wuthering Heights, her movies of note from that time include A Song to Remember (1945), in which Oberon portrayed French writer George Sand.\n\nOberon’s career then began to slow down. Her later films include the romantic comedy Pardon My French (1951), the historical drama Désirée (1954), and the crime drama The Price of Fear (1956). Her last screen appearances were in the dramas Hotel (1967) and Interval (1973). Oberon died on November 23, 1979, in Los Angeles, California."}, {"url": "https://thewire.in/film/merle-oberon-a-hollywood-star-from-india-who-wanted-her-roots-forgotten", "page_content": "This article was originally published by BBC and is republished here with permission.\n\nMerle Oberon, a Hollywood star of the black and white era, is a forgotten icon in India, the country of her birth.\n\nBest-known for playing the lead in the classic Wuthering Heights, Oberon was an Anglo-Indian born in Bombay in 1911. But as a star in Hollywood’s Golden Age, she kept her background a secret – passing herself off as white – throughout her life.\n\nMayukh Sen, a US-based writer and academic, first stumbled across her name in 2009 when he found out that Oberon was the first actor of South Asian origin to be nominated for an Oscar.\n\nHis fascination grew as he saw her films and dug deeper into her past. “As a queer person, I empathise with this feeling that you must hide a part of your identity to survive in a hostile society that isn’t really ready to accept who you are,” he says. Sen is now working on a biography to tell Oberon’s story from a South Asian perspective.\n\nShe was born Estelle Merle O’Brien Thompson in Bombay (now Mumbai) in 1911. Her mother was part-Sinhalese and part-Maori while her father was British.\n\nThe family moved to Calcutta (now Kolkata) in 1917 after Oberon’s father died in 1914. She got her start in acting through the Calcutta Amateur Theatrical Society in the 1920.\n\nAlso read: Indian Cinema: A Story of Flawed Means and Perfect Endings\n\nIn 1925, after watching her first film, a silent movie, The Dark Angel, Oberon was inspired by its star, Vilma Bánky, to become an actress, according to Sen. She left for France in 1928 after an army colonel introduced her to director Rex Ingram who gave her bit parts in his films.\n\nOberon’s mother Charlotte Selby, who had darker skin, followed her as her maid.\n\nA 2014 documentary called The Trouble with Merle later found that Selby was, in fact, Oberon’s grandmother. Selby’s daughter Constance had Oberon as a teenager but the two were reportedly raised together as sisters for some years.\n\nOberon’s first big break came from Sir Alexander Korda – a filmmaker she would later marry – who cast her as Anne Boleyn in The Private Life of Henry VIII (1933).\n\nPublicists for Korda reportedly had to invent a background story to explain her race.\n\n“Tasmania was chosen as her new birthplace because it was so far from the US and Europe and was generally considered to be ‘British’ to its core,” Marée Delofski, director of The Trouble with Merle, wrote in her notes on the documentary.\n\nOberon was passed off as an upper-class girl from Hobart who moved to India after her father died in a hunting accident, Delofski said.\n\nOberon, however, soon became an intrinsic part of local lore in Tasmania and, for the rest of her career, Australian media followed her closely with pride and curiosity. She even acknowledged Tasmania as her hometown but rarely mentioned Calcutta.\n\nBut Calcutta remembered her. “In the 1920s and 1930s, there were passing mentions of her in the memoirs of a lot of Englishmen,” journalist Sunanda K. Datta Ray says.\n\n“People claimed she was born in the city, that she was an operator at the switchboard of the telephone exchange and that she won a contest at Firpo’s restaurant.”\n\nAs she bagged more Hollywood films, Oberon moved to the US and in 1935 was nominated for an Oscar for her role in The Dark Angel.\n\nBut it was her performance in 1939’s Wuthering Heights, opposite acting legend Laurence Olivier, that cemented her place in the industry.\n\nAlso read: ‘Bridgerton’ Brings the Regency Novel Back Into Fashion – But Did It Ever Go Away?\n\nShe was reportedly picked over Vivien Leigh, another India-born actress, because the team behind the film felt she was a bigger name, Sen says.\n\nA New York Times review of the film said Oberon had “perfectly caught the restless, changeling spirit of the Brontë heroine”.\n\nThe late 1930s catapulted Oberon to the so-called big league, Sen says. Her inner circle included figures like music composer Cole Porter and playwright Noël Coward.\n\nKorda and veteran producer Samuel Goldwyn helped Oberon assimilate, taming traits like her accent that would have given away her South Asian origins, Sen says.\n\nBut Oberon’s secret weighed on her – even though her light-skinned complexion made it easier for her to pass off as white on screen.\n\n“She still often felt the need to silence frequent murmurs that she was mixed race. Film journalists of her era would note her tanner complexion,” Sen says.\n\nSome accounts claim Oberon’s skin was damaged by skin-whitening or bleaching treatments.\n\nAfter Oberon was injured and her face scarred in a car crash in 1937, cinematographer Lucien Ballard famously developed a technique that lit her in a way that would obscure her blemishes. (Oberon divorced Korda and married Ballard in 1945.)\n\n“Some sources have suggested that the technique was also a way to ‘whiten’ Merle’s face before the camera,” Sen says.\n\nOberon’s nephew Michael Korda, who published a family memoir called Charmed Lives in 1979, said he obscured details of her background after she threatened to sue him for including her real name and birthplace.\n\n“I had assumed that enough water had passed under the bridge, but she still minded very much indeed about her past,” he said in an interview.\n\nThe charade became harder to maintain. In 1965, Oberon cancelled public appearances and cut short a trip to Australia after finding the local journalists to be curious about her background. Reports say she was distraught during her last visit to Tasmania in 1978 as questions around her identity continued to swirl.\n\nBut she never admitted the truth in public. She died in 1979, of a stroke.\n\nIn 1983, her Anglo-Indian heritage was revealed in a biography, Princess Merle: The Romantic Life of Merle Oberon. The authors found her birth record in Bombay, her baptismal certificate, and letters and photographs her Indian relatives had.\n\nThrough his book, Sen hopes to be able to convey the enormous pressures Oberon faced as a South Asian woman “navigating an industry that wasn’t designed to accommodate her and producing such moving work while fighting those battles”.\n\n“Dealing with those struggles couldn’t have been easy. It feels more productive to extend grace and empathy to her than to judge.”"}, {"url": "https://www.insider.com/merle-oberon-oscar-history-south-asian-heritage-oscars-2023-3", "page_content": "Oberon was born in Mumbai, India, in 1911 to a British father and a mother who was of Sinhalese and Maori origin, who herself was born in present-day Sri Lanka.\n\nSilver Screen Collection/Getty Images\n\nAt the age of 17, Oberon left Calcutta, India, for England to act in films. Her grandmother, who was darker-skinned, traveled with Oberon under the guise of being her maid.\n\nSource: BBC"}]}