{"Merle Oberon travelled to the United States to make films for Samuel Goldwyn after her success in The Scarlet Pimpernel in 1934.": [{"url": "https://www.tcm.com/tcmdb/title/72278/the-dark-angel", "page_content": "A romantic drama from producer Samuel Goldwyn,(1935) begins with three childhood friends - Kitty Vane (Merle Oberon), and cousins Alan Trent (Fredric March) and Gerald Shannon (Herbert Marshall). Even as a child, Kitty loves Alan, and as the three grow up and remain close, the love between Kitty and Alan deepens. The two men go off to fight in World War I, and while home on leave Alan proposes to Kitty. Later, he is apparently killed in battle. In fact, Alan is not dead, but blinded. After the war he returns to England, changes his name and starts a new life because he doesn't want to be a burden on Kitty. Meanwhile, Gerald consoles Kitty and she agrees to marry him. Inevitably, the once-inseparable trio's paths will cross again.was the second film version of Guy Bolton's play. In 1925, Goldwyn had made the first one starring his new Hungarian discovery, Vilma Banky, and teamed her with his British leading man, Ronald Colman.had been a huge hit and launched Banky and Colman as a romantic screen team. Ten years later, Banky was a casualty of the talkies, Colman had moved on, and Goldwyn's latest European discovery, the Russian Anna Sten, had been a flop with the public. Goldwyn needed a hit, so he decided to remakeand began looking around for another European actress to turn into a star. He had his eye on the beautiful British blonde Madeleine Carroll, but so did a lot of other producers. Then Goldwyn got a look at the exotic beauty Merle Oberon, and he knew he had found his star.The Bombay-born Oberon was reputed to be of Anglo-Indian parentage, though she claimed to be a native of Tasmania. She had made her way to England, and after playing bit roles in British films, came to the attention of producer Alexander Korda, who signed her to a contract. She began an affair with the married Leslie Howard when they appeared together in(1934), and they both went to Hollywood in early 1935. The 1925 version ofhad been one of Oberon's favorite films as a young girl, and when she heard that Goldwyn was re-making the film, she lobbied hard for the role of Kitty, and for Leslie Howard as Alan. Goldwyn liked that idea, but Korda was getting offers for Oberon's services from several Hollywood producers. Oberon bombarded Korda with telegrams, letting him know that she wanted to do, and Goldwyn and Korda finally reached an agreement that would allow her to make two films a year for Goldwyn while she was under contract to Korda. By then Oberon's affair with Howard had ended, so Goldwyn cast Fredric March as Alan, to the dismay of Anglophile director Sidney Franklin, who had his heart set on Howard and felt that Oberon didn't have the acting ability to play Kitty. He was not the only one who was disappointed. Members of Goldwyn's staff felt that Oberon was \"too exotic and sexy\" for the role, which required a \"virginal quality.\" Yet Goldwyn insisted that Oberon's exoticism could be muted by dressing her simply and toning down her glamour with lighter makeup and softer hairstyles. His instinct proved correct, and Oberon looked sweet and sincere in the film. Her heartfelt performance inearned Oberon her first and only Academy Award nomination.British-born Herbert Marshall was a solid choice for the role of Gerald, although at 44 he was 21 years older than Oberon and too old for the young man he played. (critic Andre Sennwald took note of the age disparity: \"You may be mildly astonished to find that the child actors of the early part of the picture, all approximately the same age, grow up into such varying stages of adulthood as the middle-aged Mr. Marshall and the youthful Miss Oberon. It must have been the war.\") Marshall had personally experienced the horrors of war - he lost a leg in combat in World War I. He had 20 years of experience on the London stage before he made his first film in 1929.Goldwyn hired another Hollywood newcomer, playwright Lillian Hellman, who had been working as a script reader, to work on the screenplay for. Hellman thought the story was \"an old silly,\" but liked the \"easy money and easy hours.\" She grew fond of Goldwyn, later telling his biographer A. Scott Berg, \"I think our days together worked well because I was a difficult young woman who didn't care as much about money as the people around me and so, by accident, I took a right step within the first couple of months of working for Mr. Goldwyn.\" Her next project for Goldwyn would be(1936), the film version of her controversial play,. She would write several other films for Goldwyn, including the film version of her play,(1941).Even the critics who agreed with Hellman's assessment of the story were won over by. The' Andre Sennwald called it \"A happy adventure in sentimental romance. Lillian Hellman and Mordaunt Shairp have written a highly literate screen adaptation of Guy Bolton's play, skirting all the more obvious opportunities for tear-jerking and overemphasis, and telling the story with feeling and admirable good taste. The photoplay is in the handsome Goldwyn tradition of visual excellence....Both Mr. March and Mr. Marshall contribute their best performances in months, and Miss Oberon, abandoning the Javanese slant of the eyes for the occasion, plays with skill and feeling.\"magazine called it \"A literate and tastefully arranged version of the celebrated sob-cinema.\" And theadded, \"The film makes a systematic and often very skillful appeal to those untrustworthy emotions which may suddenly cause the most hardened intellects to dissolve before the most obvious sentimentality.\"was a huge success, and inspired Goldwyn to remake two more of his earlier hits, the silent(1925) and the early talkie(1930).Director: Sidney FranklinProducer: Samuel GoldwynScreenplay: Lillian Hellman, Mordaunt Shairp, based on the play by Guy BoltonCinematography: Gregg TolandEditor: Sherman ToddCostume Design: Omar KiamArt Direction: Richard DayMusic: Alfred NewmanCast: Fredric March (Alan Trent), Merle Oberon (Kitty Vane), Herbert Marshall (Gerald Shannon), Janet Beecher (Mrs. Shannon), John Halliday (Sir George Barton), Henrietta Crosman (Granny Vane), Frieda Inescort (Ann West), Claud Allister (Lawrence Bidley).BW-107m. Closed Captioning.by Margarita Landazuri\n\nThe Dark Angel\n\nA romantic drama from producer Samuel Goldwyn, The Dark Angel (1935) begins with three childhood friends - Kitty Vane (Merle Oberon), and cousins Alan Trent (Fredric March) and Gerald Shannon (Herbert Marshall). Even as a child, Kitty loves Alan, and as the three grow up and remain close, the love between Kitty and Alan deepens. The two men go off to fight in World War I, and while home on leave Alan proposes to Kitty. Later, he is apparently killed in battle. In fact, Alan is not dead, but blinded. After the war he returns to England, changes his name and starts a new life because he doesn't want to be a burden on Kitty. Meanwhile, Gerald consoles Kitty and she agrees to marry him. Inevitably, the once-inseparable trio's paths will cross again. The Dark Angel was the second film version of Guy Bolton's play. In 1925, Goldwyn had made the first one starring his new Hungarian discovery, Vilma Banky, and teamed her with his British leading man, Ronald Colman. The Dark Angel had been a huge hit and launched Banky and Colman as a romantic screen team. Ten years later, Banky was a casualty of the talkies, Colman had moved on, and Goldwyn's latest European discovery, the Russian Anna Sten, had been a flop with the public. Goldwyn needed a hit, so he decided to remake The Dark Angel and began looking around for another European actress to turn into a star. He had his eye on the beautiful British blonde Madeleine Carroll, but so did a lot of other producers. Then Goldwyn got a look at the exotic beauty Merle Oberon, and he knew he had found his star. The Bombay-born Oberon was reputed to be of Anglo-Indian parentage, though she claimed to be a native of Tasmania. She had made her way to England, and after playing bit roles in British films, came to the attention of producer Alexander Korda, who signed her to a contract. She began an affair with the married Leslie Howard when they appeared together in The Scarlet Pimpernel (1934), and they both went to Hollywood in early 1935. The 1925 version of The Dark Angel had been one of Oberon's favorite films as a young girl, and when she heard that Goldwyn was re-making the film, she lobbied hard for the role of Kitty, and for Leslie Howard as Alan. Goldwyn liked that idea, but Korda was getting offers for Oberon's services from several Hollywood producers. Oberon bombarded Korda with telegrams, letting him know that she wanted to do The Dark Angel, and Goldwyn and Korda finally reached an agreement that would allow her to make two films a year for Goldwyn while she was under contract to Korda. By then Oberon's affair with Howard had ended, so Goldwyn cast Fredric March as Alan, to the dismay of Anglophile director Sidney Franklin, who had his heart set on Howard and felt that Oberon didn't have the acting ability to play Kitty. He was not the only one who was disappointed. Members of Goldwyn's staff felt that Oberon was \"too exotic and sexy\" for the role, which required a \"virginal quality.\" Yet Goldwyn insisted that Oberon's exoticism could be muted by dressing her simply and toning down her glamour with lighter makeup and softer hairstyles. His instinct proved correct, and Oberon looked sweet and sincere in the film. Her heartfelt performance in The Dark Angel earned Oberon her first and only Academy Award nomination. British-born Herbert Marshall was a solid choice for the role of Gerald, although at 44 he was 21 years older than Oberon and too old for the young man he played. (New York Times critic Andre Sennwald took note of the age disparity: \"You may be mildly astonished to find that the child actors of the early part of the picture, all approximately the same age, grow up into such varying stages of adulthood as the middle-aged Mr. Marshall and the youthful Miss Oberon. It must have been the war.\") Marshall had personally experienced the horrors of war - he lost a leg in combat in World War I. He had 20 years of experience on the London stage before he made his first film in 1929. Goldwyn hired another Hollywood newcomer, playwright Lillian Hellman, who had been working as a script reader, to work on the screenplay for The Dark Angel. Hellman thought the story was \"an old silly,\" but liked the \"easy money and easy hours.\" She grew fond of Goldwyn, later telling his biographer A. Scott Berg, \"I think our days together worked well because I was a difficult young woman who didn't care as much about money as the people around me and so, by accident, I took a right step within the first couple of months of working for Mr. Goldwyn.\" Her next project for Goldwyn would be These Three (1936), the film version of her controversial play, The Children's Hour. She would write several other films for Goldwyn, including the film version of her play, The Little Foxes (1941). Even the critics who agreed with Hellman's assessment of the story were won over by The Dark Angel. The New York Times' Andre Sennwald called it \"A happy adventure in sentimental romance. Lillian Hellman and Mordaunt Shairp have written a highly literate screen adaptation of Guy Bolton's play, skirting all the more obvious opportunities for tear-jerking and overemphasis, and telling the story with feeling and admirable good taste. The photoplay is in the handsome Goldwyn tradition of visual excellence....Both Mr. March and Mr. Marshall contribute their best performances in months, and Miss Oberon, abandoning the Javanese slant of the eyes for the occasion, plays with skill and feeling.\" Time magazine called it \"A literate and tastefully arranged version of the celebrated sob-cinema.\" And the Times of London added, \"The film makes a systematic and often very skillful appeal to those untrustworthy emotions which may suddenly cause the most hardened intellects to dissolve before the most obvious sentimentality.\" The Dark Angel was a huge success, and inspired Goldwyn to remake two more of his earlier hits, the silent Stella Dallas (1925) and the early talkie Raffles (1930). Director: Sidney Franklin Producer: Samuel Goldwyn Screenplay: Lillian Hellman, Mordaunt Shairp, based on the play by Guy Bolton Cinematography: Gregg Toland Editor: Sherman Todd Costume Design: Omar Kiam Art Direction: Richard Day Music: Alfred Newman Cast: Fredric March (Alan Trent), Merle Oberon (Kitty Vane), Herbert Marshall (Gerald Shannon), Janet Beecher (Mrs. Shannon), John Halliday (Sir George Barton), Henrietta Crosman (Granny Vane), Frieda Inescort (Ann West), Claud Allister (Lawrence Bidley). BW-107m. Closed Captioning. by Margarita Landazuri"}, {"url": "https://www.tcm.com/tcmdb/title/92794/these-three", "page_content": "Merle Oberon teamed up with two other Samuel Goldwyn stars, Joel McCrea and Miriam Hopkins, along with first-time Goldwyn director William Wyler to make the first film to demonstrate the legendary \"Goldwyn Touch,\", in 1936. Although fans of, the play on which it was based, may be amazed at the sanitizing of the legendary Broadway hit, the film version is in many ways more true to the spirit of the original than its more faithful 1961 remake.The idea forhad been suggested to fledgling playwright Lillian Hellman by her longtime companion, Dashiell Hammett. While reading an anthology of true-crime stories,, he came across an account of two Scottish school teachers whose lives had been ruined by the false accusation of lesbianism levied by one of their students. Hellman turned the story into her first hit play, though when it opened on Broadway she didn't know if she would be feted or arrested. At the time, any mention of homosexuality on stage was illegal in New York State. The play was such a success and so widely praised by critics that the authorities overlooked its subject matter (the law would rarely be enforced until it was repealed in the '60s).But the Production Code Administration's ban on homosexuality as a film topic was much stronger than any mere law. So strong, in fact, that independent producer Sam Goldwyn was the only filmmaker to bid for the rights. According to legend, when he was warned that he couldn't film the play because it was about lesbians, he replied, \"That's okay; we'll turn them into Armenians.\" In truth, he was convinced to purchase the screen rights when Hellman argued that the play was really about the power of a lie. She even accepted his offer to write the screenplay, changing the lie about the two school teachers being secret lovers into a rumor that one had spent the night with the other's fiancΘ. Even so, the Production Code Administration forbade Goldman to use the original title or even publicize his purchase of the film rights. Hellman titled her screenplay, and it wasn't until after shooting was completed that the story department came up with the titleGoldwyn knew that he needed a director with a subtle touch to make the film work. He was studying Frances Dee's work in(1935) when he realized he was more interested in the film's direction than her performance. So he contacted director William Wyler and offered him the film and a long-term contract. Wyler had started his career directing low-budget westerns at his second cousin Carl Laemmle's studio, Universal, but left in search of bigger projects. That was just what Goldwyn was offering him, though Wyler cautiously asked for a three-year contract rather than the five-year deal the producer had offered, just in case things didn't work out.At first, Wyler had cause for concern. Goldwyn had already cast the leads inwith Oberon, Hopkins and McCrea. Of the three, Hopkins was the only really strong actor, and she had a reputation for temperament. Oberon -- though a recent Oscar® nominee for her first Goldwyn film,(1935) -- was considered more of a great beauty than a great actress. And McCrea was a lightweight leading man. Wyler tried to convince Goldwyn to cast Leslie Howard in the male lead, but the producer was determined to build up his stable of contract stars. Unfortunately, Goldwyn later told the leading man that Wyler didn't want him, which caused problems on the set.With his leads already cast for him, Wyler put most of his energies into finding the perfect child actress to play Mary, the student whose lies trigger the film's crises. He wanted the opposite of Shirley Temple, the most popular child star of the time, and found it in Bonita Granville, whose intense, complex performance brought her an Oscar® nomination for Best Supporting Actress. During filming, Oberon feared that Wyler was throwing the film to her and even convinced McCrea to complain to the producer, but Goldwyn simply shouted, \"I'm having more trouble with you stars than Mussolini is with Utopia!\"This didn't mean that Goldwyn was giving Wyler a free hand. They fought on the set constantly, though the director usually got his way. Wyler shot Hopkins' big confession scene, in which she admits to being in love with McCrea, from behind the actress, showing Oberon's reaction to her speech. Goldwyn objected. After screening the film with Wyler and Goldwyn's nine-year-old son, Sam, Goldwyn shrieked at the director for an hour, claiming that the audience wouldn't understand the scene if they couldn't see Hopkins' face. Finally, Wyler asked Sam if he understood what the scene was about. The child explained it perfectly, to which Goldwyn replied, \"Since when are we making pictures for nine-year-olds?\" But the scene stayed as Wyler had shot it, and the critics loved it.brought Goldwyn the best reviews of his career. Though he had had hits before, he had never enjoyed such a critical success. Novelist Graham Greene, who reviewed films for England's the, wrote \"I have seldom been so moved by any fictional film....After ten minutes or so of the usual screen sentiment, quaintness and exaggeration, one began to watch the incredulous pleasure of nothing less than life.\" With this film, critics began talking about \"The Goldwyn Touch,\" which his PR department described as \"something that manifests itself gradually in a picture; the characters are consistent; the workmanship is honest; there are no tricks and short cuts; the intelligence of the audience is never insulted.\" (in A. Scott Berg,). But though the producer tried to take credit for this quality himself, most historians now feel \"The Goldwyn Touch\" was largely a result of Wyler's perfectionism and taste.Ironically, when Wyler directed a faithful screen version ofin 1961, after the Production Code had been amended to allow homosexuality as a screen subject, the film fell flat. One problem was Hellman's limited participation in the film. Although she and Wyler had maintained a close friendship since working on, scheduling conflicts had prevented her from doing more than a few quick re-writes. More important, however, was the director's failure to adjust to changing times. By the '60s, the child's accusations that her female teachers were secret lovers just didn't seem as scandalous as they had in the '30s. The lie had lost its power over time, and, despite the censors' blue pencil, remained much more convincing in the originalProducer: Sam GoldwynDirector: William WylerScreenplay: Lillian Hellman. Based on her playCinematography: Gregg TolandArt Direction: Richard DayMusic: Alfred NewmanCast: Miriam Hopkins (Martha Dobie), Merle Oberon (Karen Wright), Joel McCrea (Dr. Joseph Cardin), Catherine Doucet (Mrs. Lily Mortar), Alma Kruger (Mrs. Tilford), Bonita Granville, (Mary Tilford), Marcia Mae Jones (Rosalie Wells), Margaret Hamilton (Agatha), Walter Brennan (Taxi Driver).BW-93m.by Frank Miller\n\nThese Three\n\nMerle Oberon teamed up with two other Samuel Goldwyn stars, Joel McCrea and Miriam Hopkins, along with first-time Goldwyn director William Wyler to make the first film to demonstrate the legendary \"Goldwyn Touch,\" These Three, in 1936. Although fans of The Children's Hour, the play on which it was based, may be amazed at the sanitizing of the legendary Broadway hit, the film version is in many ways more true to the spirit of the original than its more faithful 1961 remake. The idea for The Children's Hour had been suggested to fledgling playwright Lillian Hellman by her longtime companion, Dashiell Hammett. While reading an anthology of true-crime stories, Bad Companions, he came across an account of two Scottish school teachers whose lives had been ruined by the false accusation of lesbianism levied by one of their students. Hellman turned the story into her first hit play, though when it opened on Broadway she didn't know if she would be feted or arrested. At the time, any mention of homosexuality on stage was illegal in New York State. The play was such a success and so widely praised by critics that the authorities overlooked its subject matter (the law would rarely be enforced until it was repealed in the '60s). But the Production Code Administration's ban on homosexuality as a film topic was much stronger than any mere law. So strong, in fact, that independent producer Sam Goldwyn was the only filmmaker to bid for the rights. According to legend, when he was warned that he couldn't film the play because it was about lesbians, he replied, \"That's okay; we'll turn them into Armenians.\" In truth, he was convinced to purchase the screen rights when Hellman argued that the play was really about the power of a lie. She even accepted his offer to write the screenplay, changing the lie about the two school teachers being secret lovers into a rumor that one had spent the night with the other's fiancΘ. Even so, the Production Code Administration forbade Goldman to use the original title or even publicize his purchase of the film rights. Hellman titled her screenplay The Lie, and it wasn't until after shooting was completed that the story department came up with the title These Three. Goldwyn knew that he needed a director with a subtle touch to make the film work. He was studying Frances Dee's work in The Gay Deception (1935) when he realized he was more interested in the film's direction than her performance. So he contacted director William Wyler and offered him the film and a long-term contract. Wyler had started his career directing low-budget westerns at his second cousin Carl Laemmle's studio, Universal, but left in search of bigger projects. That was just what Goldwyn was offering him, though Wyler cautiously asked for a three-year contract rather than the five-year deal the producer had offered, just in case things didn't work out. At first, Wyler had cause for concern. Goldwyn had already cast the leads in These Three with Oberon, Hopkins and McCrea. Of the three, Hopkins was the only really strong actor, and she had a reputation for temperament. Oberon -- though a recent Oscar® nominee for her first Goldwyn film, The Dark Angel (1935) -- was considered more of a great beauty than a great actress. And McCrea was a lightweight leading man. Wyler tried to convince Goldwyn to cast Leslie Howard in the male lead, but the producer was determined to build up his stable of contract stars. Unfortunately, Goldwyn later told the leading man that Wyler didn't want him, which caused problems on the set. With his leads already cast for him, Wyler put most of his energies into finding the perfect child actress to play Mary, the student whose lies trigger the film's crises. He wanted the opposite of Shirley Temple, the most popular child star of the time, and found it in Bonita Granville, whose intense, complex performance brought her an Oscar® nomination for Best Supporting Actress. During filming, Oberon feared that Wyler was throwing the film to her and even convinced McCrea to complain to the producer, but Goldwyn simply shouted, \"I'm having more trouble with you stars than Mussolini is with Utopia!\" This didn't mean that Goldwyn was giving Wyler a free hand. They fought on the set constantly, though the director usually got his way. Wyler shot Hopkins' big confession scene, in which she admits to being in love with McCrea, from behind the actress, showing Oberon's reaction to her speech. Goldwyn objected. After screening the film with Wyler and Goldwyn's nine-year-old son, Sam, Goldwyn shrieked at the director for an hour, claiming that the audience wouldn't understand the scene if they couldn't see Hopkins' face. Finally, Wyler asked Sam if he understood what the scene was about. The child explained it perfectly, to which Goldwyn replied, \"Since when are we making pictures for nine-year-olds?\" But the scene stayed as Wyler had shot it, and the critics loved it. These Three brought Goldwyn the best reviews of his career. Though he had had hits before, he had never enjoyed such a critical success. Novelist Graham Greene, who reviewed films for England's the Spectator, wrote \"I have seldom been so moved by any fictional film....After ten minutes or so of the usual screen sentiment, quaintness and exaggeration, one began to watch the incredulous pleasure of nothing less than life.\" With this film, critics began talking about \"The Goldwyn Touch,\" which his PR department described as \"something that manifests itself gradually in a picture; the characters are consistent; the workmanship is honest; there are no tricks and short cuts; the intelligence of the audience is never insulted.\" (in A. Scott Berg, Goldwyn: A Biography). But though the producer tried to take credit for this quality himself, most historians now feel \"The Goldwyn Touch\" was largely a result of Wyler's perfectionism and taste. Ironically, when Wyler directed a faithful screen version of The Children's Hour in 1961, after the Production Code had been amended to allow homosexuality as a screen subject, the film fell flat. One problem was Hellman's limited participation in the film. Although she and Wyler had maintained a close friendship since working on These Three, scheduling conflicts had prevented her from doing more than a few quick re-writes. More important, however, was the director's failure to adjust to changing times. By the '60s, the child's accusations that her female teachers were secret lovers just didn't seem as scandalous as they had in the '30s. The lie had lost its power over time, and, despite the censors' blue pencil, remained much more convincing in the original These Three. Producer: Sam Goldwyn Director: William Wyler Screenplay: Lillian Hellman. Based on her play The Children's Hour Cinematography: Gregg Toland Art Direction: Richard Day Music: Alfred Newman Cast: Miriam Hopkins (Martha Dobie), Merle Oberon (Karen Wright), Joel McCrea (Dr. Joseph Cardin), Catherine Doucet (Mrs. Lily Mortar), Alma Kruger (Mrs. Tilford), Bonita Granville, (Mary Tilford), Marcia Mae Jones (Rosalie Wells), Margaret Hamilton (Agatha), Walter Brennan (Taxi Driver). BW-93m. by Frank Miller"}, {"url": "https://www.britannica.com/biography/Merle-Oberon", "page_content": "Merle Oberon, (born February 19, 1911, Bombay [now Mumbai], India—died November 23, 1979, Los Angeles, California, U.S.), British and American film actress who appeared in more than 30 motion pictures. Her most notable portrayal was that of the beautiful Cathy, who tormented and rejected Heathcliff (Laurence Olivier) in the 1939 classic Wuthering Heights.\n\nThe daughter of an Indian mother and a British army officer, Arthur Thompson, stationed in India, she was christened Estelle Merle. Moving to England, she played bit parts on stage and in films until she was discovered by the producer Alexander Korda, whose protégée and wife she became. Early in her career she created a fictional autobiography, claiming to have been born in Tasmania of Irish, French, and Dutch descent and christened Estelle Merle O’Brien Thompson.\n\nBritannica Quiz Pop Culture Quiz\n\nWorking in both England and Hollywood, she achieved stardom as a hauntingly beautiful dark-eyed woman of grace and spirit. She first starred as Anne Boleyn in The Private Life of Henry VIII (1933), opposite Charles Laughton. She played opposite Douglas Fairbanks, Sr., in The Private Life of Don Juan (1934), Leslie Howard in The Scarlet Pimpernel (1934), and Maurice Chevalier in Folies Bergère (1935). She was cast as George Sand in the movie A Song to Remember (1945) and Napoleon’s Josephine in Désirée (1954). Her last screen appearances were in Hotel (1967) and Interval (1973)."}, {"url": "https://ew.com/awards/oscars/merle-oberon-tragic-history-first-asian-woman-oscar-nominated-best-actress/", "page_content": "The tragic history of the first Asian woman nominated for Best Actress, over 85 years before Michelle Yeoh\n\nWhen Michelle Yeoh was nominated for the Best Actress Oscar for Everything Everywhere All at Once, the overdue honor came with an appalling statistic: Yeoh is the first Asian woman to be nominated in the category in over 85 years.\n\nThe first was a person who did not acknowledge her own heritage, but instead passed for white, biracial actress Merle Oberon, nominated for the 1935 drama The Dark Angel.\n\n\"Merle was in a very different Hollywood,\" says Halley Bondy, who researched and guest-narrated the You Must Remember This podcast episode Passing for White: Merle Oberon. \"Merle was in a Hollywood where you had to be white in order to be accepted, in order to win awards, in order to get prestigious roles. Michelle's nomination, aside from the fact that it took forever, is so refreshing to see. We're in a new Hollywood, where Asian cinema is celebrated, and Asian actresses are celebrated. People don't have to hide anymore.\"\n\nMerle Oberon (1911-1979), British actress, poses with a bouquet of flowers, with flowers in her hair, in a studio portrait, circa 1940. (Photo by Silver Screen Collection/Getty Images); SANTA MONICA, CALIFORNIA - MARCH 04: Michelle Yeoh attends the 2023 Film Independent Spirit Awards on March 04, 2023 in Santa Monica, California. (Photo by Araya Doheny/Getty Images) Credit: Silver Screen Collection/Getty; Araya Doheny/Getty\n\nThe contrast is even more stark when you consider the radically different roles for which Yeoh and Oberon were nominated. While Yeoh has earned her nod for a project that centers on and celebrates her identity as a Chinese woman, Oberon got hers for The Dark Angel, a film in which she plays a member of the British aristocracy, Kitty Vane, who is caught in a love triangle with two close friends, the dashing Alan Trent (Fredric March) and the kindly Gerald Shannon (Herbert Marshall). There's no trace of her Asian background or even the exoticism that frequently played a role in her image as a movie star. She's the image of British propriety, clipped accent and all.\n\nIn real life, her identity was as much a performance as the one that earned her an Oscar nomination. Though she claimed she was from Tasmania, Australia, throughout her career, Oberon was born in India to a Sri Lankan mother and Anglo-Irish father. Her family line also included Māori ancestry. Further complicating matters, Charlotte, the woman Oberon called her mother, was actually her grandmother. Oberon was, in fact, the child of her then 12-year-old half-sister, Constance.\n\nOberon seemed to have some sense of the pitfalls of her blurry identity from a young age, growing up in poverty and bullied at school for her mixed ethnicity. \"She started [passing] as a teenager,\" says Bondy. \"She would do posh British accents and she would try to emulate the British colonizers. But she didn't belong either in either world. She didn't really belong with the elite, and she didn't belong in a traditional Indian country.\"\n\n1943: Leading lady Merle Oberon (1911 - 1979) as she appears in the film 'First Comes Courage', a war drama directed by Dorothy Arzner. (Photo by Hulton Archive/Getty Images) Credit: Hulton Archive/Getty\n\nOberon moved to Britain when she was 17, and it was film producer (and her eventual husband), Alexander Korda, who helped complete her transformation into a white-passing actress. Born Estelle Merle O'Brien Thompson and using the nickname \"Queenie,\" she was rechristened Merle Oberon by Korda, who cast her in as Anne Boleyn in 1933's The Private Life of Henry VIII.\n\nFrom there, Korda and Hollywood producer Samuel Goldwyn, who purchased shares of Oberon's contract from Korda, continued to mold her into a star. This included the use of a skin bleaching product that contained high levels of poisonous ammoniated mercury. \"They made her last name Oberon to make it seem obscure and vague,\" says Bondy. \"She was unplaceable. Korda helped construct that identity and that look. I don't know if he applied the makeup. I don't know if he was the one who was like, 'You need to look more white.' But I have to assume that since he had so much control over her early film career, he probably played a huge role in that.\"\n\nOberon herself was obsessed with maintaining the illusion of whiteness, even having a portrait of her late \"mother,\" Charlotte, painted with lighter-colored skin. Before Charlotte's death, when traveling together, Oberon passed the older woman off as her maid to avoid anyone questioning her origins.\n\nIt wasn't abnormal for movie stars to undergo physical transformations at the behest of studios, and often, it was done with the aim of obscuring their origins (Rita Hayworth famously endured electrolysis to raise her hairline and reduce the visibility of her Spanish heritage). But Oberon went to further extremes, lying about her place of birth and lightening her skin color.\n\nFredric March looking into the eyes of Merle Oberon in a scene from the film 'The Dark Angel', 1935. (Photo by United Artists/Getty Images) Credit: United Artists/Getty\n\n\"She was billed as exotic, and that was something that they leaned into in constructing her image,\" adds Bondy. \"Exotic was acceptable, but to pinpoint her as half-Māori and Sri Lankan would've been too much. They all liked the image of her being vague — 'Oh, she's from Tasmania,' which nobody knows anything about. She had to live her whole life that way. She never really did have that triumphant moment of coming out and being proud. That was what the studios did. They doctored you into whatever they wanted. If you had talent and presence, they could make you white.\"\n\nThere were Asian actors open about their race during that time, most notably Anna May Wong. But their opportunities in mainstream Hollywood were limited — and they were even denied roles that aligned with their race in favor of white actors in yellowface. Oberon's beauty allowed her to perpetuate the lie that enabled her to flourish in a more explicitly racist film industry than today's.\n\n\"She was very convincing and opportunistic,\" explains Bondy. \"She'd been that way her whole life. She learned grit and how to get things from men from her mother. So she had a chance of passing, and the chance of winning white American hearts.\" Had she embraced her identity, Bondy adds, Oberon never would've been hired by Samuel Goldwyn, much less been nominated for an Oscar.\n\nFredric March holding Merle Oberon by the window in a scene from the film 'The Dark Angel', 1935. (Photo by United Artists/Getty Images) Credit: United Artists/Getty\n\nBondy claims that The Dark Angel is the film in which Oberon looks the whitest, and certainly, if you compare images of her from earlier projects, there is a noticeable difference.\n\nArguably, Oberon gives her greatest performance as Cathy opposite Laurence Olivier's Heathcliff in the 1939 adaptation of Emily Bronte's Wuthering Heights. But by that time, Hollywood had grown suspicious of her. Rumors swirled that she'd been a high-class prostitute, and because her British accent slipped regularly, many began to wonder about her origins.\n\n\"Wuthering Heights was one of the biggest movies of the year, with a huge budget and nominated for all kinds of awards,\" says Bondy. \"Merle was not nominated that year. Given how Hollywood operated and who got nominated for these awards, there was no earthly reason why she wouldn't get nominated. So you have to think that she wasn't entirely welcome into the Hollywood elite.\"\n\nBy this time, Oberon had also suffered serious damage to her face, both the result of a 1937 car accident and the long-term impact of the bleaching creams and makeups, which resulted in pitting and indentation. The damage was extensive enough that cinematographer Lucien Ballard designed a special light to obscure the blemishes and scars and lend her a luminous glamor. To this day, the light is referred to as an \"Obie,\" in reference to her last name.\n\nTHE OSCAR, Merle Oberon, 1966 Credit: Everett\n\nAs she aged, Oberon maintained a complicated relationship with her identity. Her final film grappled with the issue: Interval, released in 1973 and produced by Oberon herself, gave her a role as a woman who didn't know the truth of her own origins and tried to outrun them.\n\nA few years later in 1978, Oberon was invited to Hobart, Tasmania, her long-purported birthplace, for a mayoral reception and the naming of a theater in her honor. Oberon traveled there for the tribute, but at the reception, she denied she'd been born in Tasmania and refused to attend any other planned events on her itinerary.\n\n\"I think that she was just starting to reckon with everything,\" says Bondy of that ill-fated trip. \"We'll never know if she truly ever reckoned with it. But she grew up not just having to conform, but probably believing on some level that she was inferior. She was deeply uncomfortable with [who she was]. Because when you're beaten over the head with racism nonstop, you probably internalize it to some degree.\"\n\nThe truth of Oberon's origins was never disclosed in her lifetime, and she died in 1979 at the age of 68 still maintaining that she was white. It wasn't until the publication of a biography in 1983, Princess Merle: The Romantic Life of Merle Oberon, that the truth was revealed to the public when the authors located her birth records in India, where she was born in 1911.\n\nAlan Trent (Fredric March) and Kitty Vane (Merle Oberon) embracing in The Dark Angel. (Photo by �� John Springer Collection/CORBIS/Corbis via Getty Images) Credit: John Springer Collection/CORBIS/Corbis/Getty\n\nWhere does that leave Oberon's legacy today? Since Michelle Yeoh was first announced as an Oscar nominee, Oberon's name has recirculated with the designation as the first Asian to compete for Best Actress, a record many have disputed because of her obfuscation of her identity.\n\nYeoh herself has been careful to credit the women and pioneers on whose shoulders she now stands. Should that include Merle Oberon?\n\n\"Absolutely, she belongs in that pantheon,\" says Bondy. \"She was a real pioneer even though nobody really knew that at the time. And she probably didn't think about it at the time because her race was shameful [to her].\"\n\nBut what would Oberon make of her place in the history books, and the fact that it took almost 90 years for another Asian woman, this one vociferously proud of her identity and the ways it has shaped her on-screen presence, to get an Oscar nomination?\n\n\"I think she would be stunned to learn that her origin is actually an asset,\" speculates Bondy. \"She would have a lot to wrestle with, because she was very disconnected from reality. She would need a lot of therapy. But I think that she would ultimately be very proud and embrace it, because she loved the spotlight.\""}, {"url": "https://vintagenewsdaily.com/50-gorgeous-photos-of-british-actress-merle-oberon-in-the-1930s-and-40s/", "page_content": "0 SHARES Share Tweet\n\nThis post was originally published on this site\n\nBorn 1911 as Estelle Merle O’Brien Thompson in Bombay, British India, British actress Merle Oberon began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933).\n\nAfter her success in The Scarlet Pimpernel (1934), Oberon travelled to the United States to make films for Samuel Goldwyn. She was nominated for an Academy Award for Best Actress for her performance in The Dark Angel (1935).\n\nA traffic collision in 1937 caused facial injuries that could have ended her career, but Oberon recovered and remained active in film and television until 1973.\n\nOberon retired after Interval (1973) and moved to Malibu, California, where she died in 1979 at the age of 68 after suffering a stroke. She has a star on the Hollywood Walk of Fame (at 6250 Hollywood Boulevard) for her contributions to Motion Pictures.\n\nTake a look at these gorgeous photos to see the beauty of young Merle Oberon in the 1930s and ’40s.\n\nSee more »"}, {"url": "https://www.tcm.com/tcmdb/person/73184%7C138284/Samuel-Goldwyn/", "page_content": "Biography\n\nA pioneer in the American independent film industry, Samuel Goldwyn emerged from the founding of both Paramount Pictures and Metro-Goldwyn-Mayer to establish his own company, Samuel Goldwyn Pictures, which produced such memorable movies as \"Wuthering Heights\" (1939), \"The Little Foxes\" (1941), \"The Secret Life of Walter Mitty\" (1946) and the Oscar-winning \"The Best Years of Our Lives\" (1946). A Polish immigrant who pulled himself out of poverty through skilled salesmanship and the occasional use of blunt negotiating force, Goldwyn's emphasis was bringing the best in movie entertainment to audiences, instead of feeding them average material en masse. The result was a dedication to quality and talent that made him a major figure in mid-20th-century Hollywood, and a groundbreaker for a generation of independent producers that followed in his wake.\n\nNamed either Shmuel or Schmuel Gelbfisz in Warsaw, Poland on an unspecified date in July of 1879, he was the first of six children by his parents, a used furniture dealer and his wife. At the age of 16, he left his family and crossed Europe on foot, eventually making his way to Birmingham, England, where relatives gave him an Anglicized name, Samuel Goldfish, in order to help him assimilate into an English-language culture. In 1898, he acquired enough money to make the voyage across the Atlantic to America, arriving first in Nova Scotia before settling in Gloversville, NY in January 1899. There, the 19-year-old found work as a floor sweeper at a glove factory. Goldwyn soon discovered that he had a talent for sales and marketing, and within three years' time, he was the top garment salesman in Gloverville. Eventually, he became a partner in the company and moved its base of operations to Manhattan, where he married Blanche Lasky, sister of vaudeville performer Jesse L. Lasky.\n\nIn 1913, he convinced Lasky and a Broadway stage actor and director named Cecil B. DeMille to join forces and start their own motion picture company. The Jesse L. Lasky Feature Play Company's first project was an adaptation of the play \"The Squaw Man\" (1914), which was notable as both the beginning of DeMille's directorial career and the first feature film shot in Hollywood a small town within Los Angeles. That same year, a film exhibition company called Paramount contracted the Lasky Company to provide feature films for distribution. Another distributor, Adolph Zukor's Famous Players Film Company, was brought into the fold and eventually merged with the Lasky Company to form The Famous Players-Lasky Company in 1916. Zukor became president of both Paramount and Famous Players-Lasky, with Goldwyn taking the vice-presidential seat. Clashes between the two future moguls led to Goldwyn abandoning his role at the company, though he retained stock and his chair on the board of directors. The dissolution of his marriage to Blanche Lasky also distanced him from the Lasky Company, which eventually foundered in 1933.\n\nGoldwyn then established a new company, the Goldwyn Pictures Corporation, with Broadway producers Edgar and Archibald Selwyn, and took the company's moniker for his own surname. The company boasted one of the most lavish production facilities in Hollywood, and its logo, Leo the Lion, became one of the most identifiable trademarks in the world, but it proved only moderately successful. By 1922, Goldwyn had been forced out of the company by the Selwyns, who then merged with Marcus Loew's Metro Pictures and Louis B Mayer Productions to form what would become Metro-Goldwyn-Mayer. His only association with the company was the shared name, which the Selwyns retained.\n\nThe back-to-back ousters underscored the fundamental reasons why Goldwyn would find greater success as an independent than within the studio system. He had a volatile temper, would pursue legal action against opponents long after it was feasible to do so, and could be astonishingly cheap and petty in his financial dealings with his artists. He was also hampered by his limited English skills and education, which produced a string of curious turns of phrase that became known as \"Goldwynisms.\" Among the more famous was \"Gentlemen, include me out;\" \"Give me a smart idiot over a stupid genius any day\" and \"An oral contract isn't worth the paper it's printed on.\" Such idiosyncrasies were better suited for a man in charge of his own company, rather than a team member, and Goldwyn followed that lead shortly after being ousted by the Selwyns.\n\nGoldwyn formed Samuel Goldwyn Productions in 1923, and opened its studio and offices on the Pickford-Fairbanks Studios Lot in West Hollywood. The company's philosophy flew directly in the face of accepted industry wisdom: he would make just one picture at a time, rather than churn them out in assembly-line fashion, and he would devote as much money and energy as possible to the production by bringing in the best talent in front of and behind the camera. A casual list of talent that worked with Goldwyn over the course of his four-decade career as a producer includes some of the most enduring names in film history, including actors Laurence Olivier, Gary Cooper, Eddie Cantor, Will Rogers and Danny Kaye; directors like William Wyler, John Ford, King Vidor, Howard Hawks and Otto Preminger; and writers like George S. Kaufman, Ben Hecht, Billy Wilder and I.A.L. Diamond, Lillian Hellman, Dorothy Parker, Thornton Wilder, Nunnally Johnson and Edna Ferber.\n\nGoldwyn Pictures began to blossom with the advent of talking pictures. 1929's \"Bulldog Drummond\" began the company's string of successes, and by 1931, he had received the first of numerous Best Picture Oscar nominations for Ford's \"Arrowsmith\" (1931). His emphasis on high-quality entertainment over box office trends allowed him to tackle all genres, from the broad musical comedies of Eddie Cantor like \"The Kid from Spain\" (1932) and \"Roman Scandals\" (1933) to dramas like \"These Three\" (1936), a bowdlerized version of Hellman's \"The Children's Hour\" with all references to lesbianism removed, or \"Dodsworth\" (1936), based on the Sinclair Lewis novel. Hard-hitting social dramas like \"Dead End\" (1937) followed literary adaptations like \"Wuthering Heights\" (1939) with Olivier and Merle Oberon, and \"The Little Foxes\" (1941), with Bette Davis, all of which earned Best Picture Oscar nods. But there were also countless musicals on the production slate, and biographical films, like the much loved \"Pride of the Yankees\" (1941), with Gary Cooper as Lou Gehrig. In the mid-'40s, Goldwyn found great success with a string of comedies featuring Danny Kaye, including \"Wonder Man\" (1945), \"The Kid from Brooklyn\" (1946) and \"The Secret Life of Walter Mitty\" (1946).\n\nThe apex of Goldwyn's career was \"The Best Years of Our Lives\" (1946), a moving drama about three veterans struggling to adjust to civilian life. The film won eight Academy Awards, including Best Picture, Best Director (William Wyler), Best Actor (Frederic March) and Best Supporting Actor, as well as an honorary award for non-professional Harold Russell, a real-life veteran who had lost both hands during training. Goldwyn himself was given the Irving G. Thalberg Memorial Award at the same ceremony, which marked both the highest achievement of his film career, as well as the launch of a slow, inexorable decline that would precede his retirement in just over a decade.\n\nGoldwyn's stellar track record became to tarnish in the late '40s and early 1950s. For every hit, like \"The Bishop's Wife\" (1947), with Cary Grant and Loretta Young, or his film version of \"Guys and Dolls\" (1955) with Frank Sinatra and Marlon Brando, there were costly failures, like \"The Elusive Pimpernel\" (1950). His brand of all-American dramas were also turning passé; audiences who had flocked to melodramas like \"The Best Years of Our Lives\" in the past were less than enthusiastic about \"Our Very Own\" (1950) and \"I Want You\" (1951) with Susan Hayward. The coup de grace for Goldwyn was the film version of George and Ira Gershwin's \"Porgy and Bess\" (1959), which suffered from numerous production setbacks, not the least of which was a fire that destroyed its sets. Despite a cast that included Sidney Poitier, Dorothy Dandridge and Sammy Davis, Jr., the film was a costly flop and a critical failure. To make matters worse, it earned the ire of the Gershwin estate, which withdrew it from circulation in the late 1960s. Soon afterwards, Goldwyn retired from the film business, bringing an end to the most successful independent film career in motion picture history.\n\nIn the years that followed, Goldwyn's roster enjoyed numerous and lucrative theatrical and television screenings. His status as one of the industry's most talented producers earned him the Jean Hersholt Humanitarian Award in 1957 and the Presidential Medal of Freedom in 1971. Three years later, Goldwyn died of natural causes at what most sources credited as the age of 94. His son, Samuel Goldwyn, Jr., from his second marriage to actress Frances Howard, carried on in his father's tradition by launching The Samuel Goldwyn Company, which distributed and produced independent features and preserved the rights to his father's films, and later became Samuel Goldwyn Films. Goldwyn's grandchildren also took up the trade, including actor-director Tony Goldwyn and John Goldwyn, who brought the family name full circle by becoming President of Motion Pictures at Paramount in 1991."}, {"url": "https://www.altfg.com/film/wuthering-heights/", "page_content": "Wuthering Heights: ‘Hollywood’s Greatest Year’ continues with Samuel Goldwyn’s favorite among his films\n\nThe 1939 Best Picture Oscar nominee Wuthering Heights – directed by William Wyler, and starring Merle Oberon and Laurence Olivier as Emily Brontë’s pathological lovers Cathy Earnshaw and Heathcliff – will be the next presentation in the Academy of Motion Picture Arts and Sciences’ series “Hollywood’s Greatest Year: The Best Picture Nominees of 1939.”\n\nThe Wuthering Heights screening will take place on Monday, June 8, ’09, at 7:30 p.m. at the Academy’s Samuel Goldwyn Theater in Beverly Hills.\n\nStarting at 7 p.m., the feature will be preceded by the fourth chapter of the 1939 serial Buck Rogers, starring Buster Crabbe and Constance Moore, and the animated short The Pointer, toplining Mickey Mouse and Pluto.\n\nExpurgated Emily Brontë\n\nAccording to Samuel Goldwyn biographer A. Scott Berg, Wuthering Heights was the independent producer’s favorite among his films. Deservedly so. Although one could easily find several things to carp about in this Hollywood adaptation of Emily Brontë’s 1847 Gothic novel, the positive elements far outweigh the negative ones.\n\nUnderstandably, a large chunk of the novel had to be excised; else the film would have had to run about four hours. As a result, Charles MacArthur and Ben Hecht’s screenplay dwells only on the passionate, obsessive, doomed romance between the brooding Heathcliff and the willful Cathy, who love one another but end up married to others.\n\nIf at times the novel’s Gothic feel has been replaced by Hollywood hokum (the initial sequence showing the future lovers as kids is particularly saccharine), William Wyler, with the assistance of cinematographer Gregg Toland and production designer James Basevi, for the most part manages to convey the dark intensity of Emily Brontë’s vision. And that was no easy task.\n\nIn fact, Wuthering Heights is far superior to the (otherwise great-looking) 1943 movie adaptation of Charlotte Brontë’s own Gothic romance, Jane Eyre, directed by Robert Stevenson, and starring a capable Joan Fontaine and an absurd Orson Welles.\n\nOverbearing Laurence Olivier\n\nOn the downside, William Wyler failed to tone down the stage-trained Laurence Olivier, then making his Hollywood comeback following his professional debacle six years earlier. That’s when MGM sent Olivier packing back to England after Greta Garbo demanded that John Gilbert be her Queen Christina co-star.\n\nOlivier had been making movies in his native country for quite some time (in addition to a brief Hollywood stint in the early 1930s), so it’s hard to understand why he felt the need to ham it up so much as Heathcliff. His final monologue, for instance, is so over the top that he almost manages to ruin the film’s otherwise touching epilogue, ghosts walking up to heaven and all.\n\nAnother shameless British ham, Robert Newton, had been suggested to play Heathcliff, but Goldwyn found him too ugly. Douglas Fairbanks Jr. was another option, but Goldwyn found him too weak. Olivier sure looked the part; it’s just too bad he felt the need to (over)act it out as well.\n\n‘Wuthering Heights’: Cathy (Merle Oberon) and Heathcliff (Laurence Olivier) in the former’s memorable – for different reasons – death scene. ‘Wuthering Heights’: Cathy (Merle Oberon) and Heathcliff (Laurence Olivier) in the former’s memorable – for different reasons – death scene.\n\nMerle Oberon in top form\n\nOn the positive side, top-billed Merle Oberon (in a role intended for Sylvia Sidney)* delivers what may well be the most effective performance of her career, while Geraldine Fitzgerald – as Heathcliff’s wife Isabella Linton – and Flora Robson provide solid support.\n\nDavid Niven (as Isabella’s brother and Cathy’s husband, Edgar Linton), Donald Crisp, Hugh Williams, Leo G. Carroll, and Cecil Kellaway were among the other Wuthering Heights cast members.\n\n* According to various sources, Sylvia Sidney and Charles Boyer (!) were originally considered for the roles of Cathy Earnshaw and Heathcliff when independent producer Walter Wanger acquired the property. Sidney ended up playing Cathy in a 1941 presentation of Wuthering Heights on the radio show Philip Morris Playhouse.\n\nAfter Wanger sold the property to Samuel Goldwyn, William Wyler suggested Bette Davis, whom he had directed in Jezebel and with whom he had been having an affair, to play Cathy. Oberon, however, was under contract to Goldwyn (and to Alexander Korda) at the time.\n\nWould-be Cathy Vivien Leigh\n\nGeraldine Fitzgerald’s miserably unhappy Isabella had been initially offered to Laurence Olivier’s lover (and future wife) Vivien Leigh, who refused it for she wanted to play Cathy and only Cathy.\n\nIt was while accompanying Olivier in Hollywood that Leigh was introduced by his agent, Myron Selznick, to the agent’s brother, independent producer David O. Selznick, who eventually hired her to play an even more important film role than that of Emily Brontë’s heroine.\n\nNew York Film Critics’ unexpected Best Film\n\nWuthering Heights turned out to be the New York Film Critics Circle’s curious pick for the Best Film of 1939 – as they couldn’t decide between Frank Capra’s Mr. Smith Goes to Washington and producer Selznick and director Victor Fleming’s Gone with the Wind. (Don’t ask.)\n\nSamuel Goldwyn’s United Artists release also went on to win an Academy Award for Best Black-and-White Cinematography.\n\nIn addition to its Best Picture nod, Wuthering Heights was also up for Oscars in the following categories:\n\nBest Actor (Laurence Olivier).\n\nBest Supporting Actress (Geraldine Fitzgerald).\n\nBest Director (William Wyler).\n\nBest Art Direction (James Basevi).\n\nBest Original Score (Alfred Newman).\n\nBest Screenplay (Charles MacArthur and Ben Hecht).\n\nMerle Oberon, no matter how outstanding, went nominationless.\n\nProposed title changes\n\nAlso worth noting, in his Samuel Goldwyn biography A. Scott Berg explains that Wuthering Heights almost had its name “bettered” after the producer’s marketing people complained that the title of Emily Brontë’s novel didn’t have an appealing sound to it.\n\nGoldwyn ordered his story department to come up with something else, but he was eventually convinced that to call Wuthering Heights “The Wild Heart” (the U.S. title of a 1950/1952 Jennifer Jones movie) or “Bring Me the World” would be tantamount to having David O. Selznick “change David Copperfield to ‘A Little Boy in England’ or Little Women to ‘Katy Wins Her Man.'”\n\n‘Wuthering Heights’ screening\n\nTickets for Wuthering Heights are $5 for the general public and $3 for Academy members and students with a valid ID.\n\nThe Academy’s Samuel Goldwyn Theater is located at 8949 Wilshire Boulevard in Beverly Hills. For more information, call (310) 247-3600 or visit www.oscars.org.\n\nSamuel Goldwyn Jr. and ‘Wuthering Heights’ poster: Samuel Goldwyn produced the 1939 romance classic starring Merle Oberon as Cathy and Laurence Olivier as Heathcliff. Samuel Goldwyn Jr. and ‘Wuthering Heights’ poster: Samuel Goldwyn produced the 1939 romance classic starring Merle Oberon as Cathy and Laurence Olivier as Heathcliff.\n\nSamuel Goldwyn Jr.\n\nJune 15 update: In the image above, Samuel Goldwyn Jr., son of independent producer Samuel Goldwyn, poses next to a Wuthering Heights poster prior to the Academy of Motion Picture Arts and Sciences’ screening of the Goldwyn-produced, William Wyler-directed 1939 Best Picture Oscar nominee. Merle Oberon starred as Cathy Earnshaw, Laurence Oliver as Heathcliff, David Niven as Edgar Linton, and Geraldine Fitzgerald as Isabella Linton.\n\nThe screening took place on Monday, June 9, at the Academy’s (at least that particular evening) aptly named Samuel Goldwyn Theater in Beverly Hills.\n\nWuthering Heights will also be screened in New York City.\n\nImages of Laurence Olivier as Heathcliff and Merle Oberon as Cathy in Wuthering Heights: Courtesy of the Margaret Herrick Library.\n\nSamuel Goldwyn Jr. photo: Greg Harbaugh / © A.M.P.A.S."}, {"url": "https://bodysize.org/en/merle-oberon/", "page_content": "Merle Oberon (born Estelle Merle O'Brien Thompson, 19 February 1911 – 23 November 1979) was an Anglo-Indian actress. She began her film career in British films as Anne Boleyn in The Private Life of Henry VIII (1933). After her success in The Scarlet Pimpernel (1934), she travelled to the United States to make films for Samuel Goldwyn. She was nominated for an Academy Award for Best Actress for her performance in The Dark Angel (1935). A traffic collision in 1937 caused facial injuries that could have ended her career, but she recovered and remained active in film and television until 1973.\n\nEstelle Merle O'Brien Thompson was born in Bombay (now known as Mumbai), British India on 19 February 1911. Merle was given \"Queenie\" as a nickname, in honour of Queen Mary, who visited India along with King George V in 1911.\n\nBorn to a 12-year-old mother, for most of her lifetime Oberon concealed the truth about her parentage. For many years she claimed that she had been born in Tasmania, Australia, and that her birth records had been destroyed in a fire. Some sources have claimed that Merle's parents were Arthur Terrence O'Brien Thompson, a British mechanical engineer from Darlington, who worked in Indian Railways, and Charlotte Selby, a Eurasian from Ceylon who was also of Māori heritage. However, Charlotte's 12-year-old daughter Constance was actually Merle's biological mother. Charlotte had given birth to Constance at the age of 14, the result of a relationship with Henry Alfred Selby, an Irish foreman of a tea plantation. Charlotte raised Merle as her own child and as Constance's sister. Charlotte's partner, Arthur Thompson, was listed as the father in Merle's birth certificate, with the forename misspelled as \"Arther\". Constance eventually married and had four other children, Edna, Douglas, Harry and Stanislaus (Stan) with her husband Alexander Soares. All the siblings reportedly believed Merle to be their aunt (the sister of their mother Constance), when in fact she was their half-sister. Edna and Douglas moved at an early age to the UK and Harry later in life moved to Toronto, Canada, and retained Constance's maiden name, Selby. Stanislaus was the only child to keep his father's last name of Soares; he has resided in Surrey, British Columbia, Canada."}, {"url": "https://www.filmcomment.com/blog/hiding-in-plain-sight-merle-oberon-mayukh-sen/", "page_content": "This article appeared in the June 17 edition of The Film Comment Letter, our free weekly newsletter featuring original film criticism and writing. Sign up for the Letter here.\n\nMerle Oberon in Night in Paradise (Arthur Lubin, 1946)\n\nIn May 1935, a new star shone on Hollywood’s horizon. Raven-haired and tan-complexioned, her eyes a striking shape, she looked unlike most leading ladies the industry had seen up until then. To the now-defunct film publication Screen & Radio Weekly, these traits made her “bizarre, bewildering, and different,” as if she were a foreign object who did not quite belong on American screens. Though she’d cut her teeth in British cinema, as the article noted, she had spent her early life in India. Her stage name was Merle Oberon.\n\n“Here they tell fabulous stories about her, one of the most often repeated being that she is Eurasian with a part-Hindu mother,” the piece continued. This rumor conflicted with the claim that Oberon sustained throughout her life: that she was born in Tasmania, Australia, and that her birth records had perished in a fire.\n\nBut the paper’s speculation wasn’t far from the truth, revealed only after Oberon’s death in 1979. In reality, she had been born into poverty in what is now Mumbai to a 12-year-old mother of Sri Lankan, Māori, and white ancestry, whom Oberon grew up believing was her sister; the identity of her biological father remains unclear. Raised by her grandmother (whom she thought was her mother) in what is today Kolkata, she had an interest in acting early in life and performed with the city’s Amateur Dramatic Society. A boyfriend offered to introduce her to the director Rex Ingram, so, while still in her teens, she pooled enough money to travel to France to meet the filmmaker. Ingram found Oberon’s appearance so entrancing that he cast her as an extra in a film of his, The Three Passions (1928). From there, she went to Britain, where her career took off. As she pursued fame abroad, though, Oberon deliberately concealed two truths about herself: she grew up poor, and she was (at least in part) Brown.\n\nThese were taboos in the era during which Oberon labored against impossible odds to become one of Old Hollywood’s brightest stars. Once in America, she would star in Sidney Franklin’s wartime romance The Dark Angel (1935), which earned her an Academy Award nomination for Best Actress in a Leading Role. Though the public had no clue about her mixed-race parentage back then (stories in gossip mills were pure conjecture), she is, to date, the only actress of known Asian descent to be nominated in that category in the 20th century, an embarrassing indictment of the Academy’s institutional blind spots.\n\nFor all its historical significance, though, Oberon’s sterling performance in The Dark Angel is rarely mentioned by critics today, along with her art more generally. Consider how casually the critic David Thomson wrote her off as a “renowned beauty with a graven face and the legend of mixed blood” who was nevertheless “often a dull actress” in his canonical The New Biographical Dictionary of Film. There’s been far more interest in Oberon’s off-screen torment. She inspired the character of Margo Taft (Jennifer Beals), an actress in the studio era who tries to suppress her biracial identity, on Amazon’s 2016-17 series The Last Tycoon; she was the subject of an episode of the You Must Remember This podcast in February of last year. The segment detailed painful stories of how Oberon bleached her skin, passed off her dark-skinned grandmother as her maid, and nearly sued a family member who sought to divulge her ancestry in a book. The ongoing fascination with Oberon’s inner turmoil is understandable in the present-day media landscape, where the history of racial discrimination in entertainment has begun to command greater scrutiny. Yet, as with many actors of color, it has eclipsed her actual work.\n\nOberon’s talents come across in an early appearance as the doomed Anne Boleyn in her future husband Alexander Korda’s The Private Life of Henry VIII (1933). The role is tiny—she disappears just after the 15-minute mark, executed for treason—yet she makes a distinct impression as a woman who dutifully accepts her terrible fate. Oberon teems with nervous energy; when she jokes that people will call her “Anne who lost her head,” the line is rattled off in a way that is both sardonic and haunting. The tension that Oberon brought to this and other roles may read as a lack of spontaneity to some, but that studied quality did not translate to discomfort before the camera; rather, Oberon’s agitated demeanor made the predicaments of her women seem compelling in their immediacy.\n\nThe director Harold Young would give this attribute more room to shine in The Scarlet Pimpernel (1934), where she is enchanting as an aristocratic woman during the French Revolution, unaware that her husband is leading a double life. Oberon projects regality, and Young gives her arresting close-ups that allow the actress to bring her character’s emotional dilemmas—namely her frustration at her husband’s seeming inattentiveness—to the surface. Though The Scarlet Pimpernel has the trappings of an adventure movie, it is Oberon who gives the film its soul.\n\nIn Britain, Oberon usually essayed roles of women with an aura of mystique. Such performances caught the eye of producer Samuel Goldwyn, who brought her to America and in short order cast her in The Dark Angel. The film would offer a change of pace: Oberon reportedly tired of the “exotic” label the press appended to her back in Britain, and grew determined to play more of an everywoman. Set in World War I–era Britain, Franklin’s film hinges on a love triangle involving Oberon’s Kitty Vane and her two male childhood friends. The Dark Angel tends to get classified as a melodrama, yet Oberon plays the film’s most potentially histrionic scenes with control. In a scene right before the film’s finale, she learns that the man she loves (Fredric March) didn’t die in the war as she believed. She’s thrilled that he’s alive, a fact that she mutters to herself repeatedly. The revelation could provoke a theatrical response, but Oberon speaks in a register that’s barely above a whisper, pulling the viewer close in this moment rather than playing to the gallery. It is an intelligent—and effective—actorly gesture.\n\nIn the years that followed, Oberon would give a moving performance in William Wyler’s These Three (1936) as a schoolteacher mired in scandal, and it was indeed Wyler who gave her her finest showcase as Cathy in Wuthering Heights (1939). Detractors might find her performance too stern to express Cathy’s “wild, uncontrollable passion for Heathcliff,” as the film’s narrator puts it. Pauline Kael, for example, described her as “chill and dainty” in the role. But Oberon creates a rich portrait of repressed longing. Cathy has high-society aspirations that clash with her love for Heathcliff (Laurence Olivier), a character termed “gypsy scum” in the film. (References to Heathcliff’s skin tone draw out the contrast with Cathy’s porcelain skin, indicating how successfully Oberon had “whitened” her public image by that point.) Her feelings for him fluctuate at the snap of a finger, shifting between affection and disgust. Oberon is stellar in wordless scenes—her first, for example, when Cathy must stomach her boorish brother’s disparaging comments about Heathcliff—as the actress’s coolly detached mien conveys the heroine’s struggle to hide her devotion.\n\nBut Oberon makes unexpected choices with dialogue too. In one pivotal scene, when Cathy realizes the depth of her bond with her forbidden lover, she proclaims, “I am Heathcliff!” The sequence may seem to call for a thunderous declaration (it is even accompanied by a strike of lightning), but Oberon resists the temptation for overstatement, her delivery touching in its directness.\n\nFew roles after that would task Oberon with such emotional demands. In the later decades of her life, she still acted, though less often. She succumbed to a stroke in Malibu when she was 68, taking the secrets of her birth and blood to her grave. Biographers Charles Higham and Roy Moseley, authors of the 1983 book Princess Merle, eventually located her birth records, finally unraveling her life’s enigmas.\n\nThe challenges that performers of color faced in Old Hollywood are finally coming to light, as we discover the prevalence of mixed-race actors who passed as white: Frankenstein (1931) star Boris Karloff was of Anglo-Indian heritage; Broadway legend Carol Channing would only disclose her paternal Black heritage in her 2002 autobiography; Fredi Washington of Imitation of Life (1934) found herself accused of passing even though she proudly owned her Blackness.\n\nOberon’s achievements in such a racist milieu are remarkable. It is easy to pity her as a tragic figure haunted by shame, silencing parts of herself to survive an inhospitable era in Hollywood. But maybe it’s possible to also celebrate her as a pioneer of the screen, one who left a lasting impact on an industry within which her success did not allow her a life true to her identity.\n\nIt was the strength of Oberon’s work before the camera, combined with the singularity of her beauty, that first captured the film establishment’s attention, after all—not her parentage, not her upbringing, not her trauma. “Merle Oberon in private life is delightful, but Merle Oberon of the screen is magnificent,” that early Screen & Radio Weekly article concluded. “She must be kept that way.”\n\nMayukh Sen is the author of Taste Makers: Seven Immigrant Women Who Revolutionized Food in America, out from W. W. Norton & Company in November. He has won a James Beard Award for his food writing and teaches food journalism at New York University.\n\n"}, {"url": "https://www.encyclopedia.com/people/literature-and-arts/film-and-television-biographies/merle-oberon", "page_content": "OBERON, Merle\n\nBorn: Estelle Merle O'Brien Thompson in Bombay, India, 19 February 1911 (birthplace, date, and name vary in different sources). Education: Attended La Martinère College, Calcutta. Family: Married 1) the director Alexander Korda, 1939 (divorced 1945); 2) the camera-man Lucien Ballard (divorced); 3) Bruno Pagliai, 1957 (divorced), two adopted children: Bruno, Jr. and Francesca; 4) Robert Wolders, 1978. Career: Dance hostess at Cafe de Paris in London; 1930—film debut in Alf's Button; 1932—contract with London Film Productions; 1933—lead in film The Private Life of Henry VIII; followed by films for United Artists produced by Samuel Goldwyn, notably Wuthering Heights, 1939; 1957—host for TV series Assignment Foreign Legion; 1973—producer and co-editor of film Interval. Died: Of stroke in Los Angeles, 23 November 1979.\n\nFilms as Actress:\n\n(as Estelle Thompson)\n\n1930 Alf's Button (Kellino) 1931 Never Trouble Trouble (Lane); Fascination (Mander) 1932 Service for Ladies (Reserved for Ladies) (Korda); For the Love of Mike (Banks); Ebb Tide (Rosson); Aren't We All (Lachman); Wedding Rehearsal (Korda) (as Miss Hutchinson); Men of Tomorrow (Sagan) (as Ysobel d'Aunay)\n\n(as Merle Oberon)\n\n1933 The Private Life of Henry VIII (Korda) (as Anne Boleyn) 1934 The Battle (Hara-Kiri; Thunder in the East) (Farkas) (as Marquise Yorisaka); The Broken Melody (Vagabond Violinist) (Vorhaus) (as Germaine); The Private Life of Don Juan (Korda) (as Antonia) 1935 The Scarlet Pimpernel (Young) (as Marguerite Blakeney); Beloved Enemy (Potter) (as Helen Drummond); Folies Bergeres (Del Ruth) (as Baroness Genevieve Cassini); The Dark Angel (Franklin) (as Kitty Vane) 1936 These Three (Wyler) (as Karen Wright) 1937 Over the Moon (Freeland, Howard) (as June Benson) 1938 The Divorce of Lady X (Whelan) (as Leslie Steel); The Cowboy and the Lady (Potter) (as Mary Smith) 1939 Wuthering Heights (Wyler) (as Cathy Linton); The Lion Has Wings (Powell and Hurst) (as Mrs. Richardson) 1940 'Til We Meet Again (Goulding) (as Joan Ames) 1941 That Uncertain Feeling (Lubitsch) (as Jill Baker); Affectionately Yours (Bacon) (as Sue Mayberry); Lydia (Duvivier) (title role) 1943 Forever and a Day (Goulding and others) (as Marjorie); Stage Door Canteen (Borzage) (as herself); First Comes Courage (Arzner) (as Nicole Larsen) 1944 The Lodger (Brahm) (as Kitty); Dark Waters (de Toth) (as Leslie Calvin)\n\n1945 A Song to Remember (Charles Vidor) (as George Sand); This Love of Ours (Dieterle) (as Karin) 1946 A Night in Paradise (Lubin) (as Delerai); Temptation (Pichel) (as Ruby) 1947 Night Song (Cromwell) (as Cathy) 1948 Berlin Express (Tourneur) (as Lucienne) 1951 Pardon My French (Vorhaus) (as Elizabeth Rockwell) 1952 Twenty-Four Hours in a Woman's Life (Affair in Monte Carlo) (Saville) (as Linda Venning) 1954 Todo es posible en Granada (de Heredia) (as Margaret Fobson); Desirée (Koster) (as Empress Josephine); Deep in My Heart (Donen) (as Dorothy Donnelly) 1956 The Price of Fear (Biberman) (as Jessica Warren) 1963 Of Love and Desire (Rush) (as Katherine Beckman) 1966 The Oscar (Rouse) (as herself) 1967 Hotel (Quine) (as The Duchess)\n\nFilm as Producer:\n\n1973 Interval (Daniel Mann) (+ ro as Serena Moore)\n\nPublications\n\nBy OBERON: articles—\n\n\"Merle Oberon Is Not a Hindu,\" interview with J. Calendo in Inter/ View (New York), July 1973.\n\nInterview (made in 1977) in Films in Review (New York), February 1982, see also the issue for June-July 1982.\n\nOn OBERON: books—\n\nParish, James Robert, and Don E. Stanke, The Glamour Girls, New Rochelle, New York, 1975.\n\nHigham, Charles, and Roy Moseley, Princess Merle: The Romantic Life of Merle Oberon, New York, 1983.\n\nOn OBERON: articles—\n\nCurrent Biography 1941, New York, 1941.\n\nObituary in New York Times, 24 November 1979.\n\nObituary in Cinema Papers (Fitzroy), February-March 1980.\n\nBerg, A. Scott, \"Merle Oberon: Bel-Air Estate of the Best Actress Nominee for The Dark Angel,\" in Architectural Digest (Los Angeles), April 1990.\n\nFilm Dope (Nottingham), July 1992.\n\nOn OBERON: film—\n\nQueenie, television mini-series directed by Larry Peerce, 1987.\n\n* * *\n\nMerle Oberon represents a classical case of the woman whose sheer beauty secured her the kind of attention that eventually brought her into films. Raised in India, she did not come to London until she was 17; she then progressed from cafe hostess (name Queenie O'Brien) to film extra. This in turn led to minor roles in undistinguished British films during 1930–32 (name Estelle Thompson), until she finally caught the eye of the Hungarian-British producer, Alexander Korda.\n\nKorda gave her the opportunity, personal patronage, and training which was to establish her as a beautiful star (name Merle Oberon) and acceptable actress. She was later to become his wife. Her first role of importance was as Anne Boleyn in Korda's film, The Private Life of Henry VIII, where her dark beauty and svelte grooming made a marked, if short-lived, impression among the King's succession of wives. Her appearance and panache won her many star roles in both London and Hollywood productions, including those in Korda's The Private Life of Don Juan, The Scarlet Pimpernel, and The Dark Angel.\n\nHer career seemed threatened when she was in a severe car accident during the shooting of I, Claudius, in which she was to have played Messalina opposite Charles Laughton. (Korda made her accident his reason for closing down this troubled production.) After successful facial surgery, however, she was able to return to the screen, and starred from 1938 through to the 1960s in a range of films, largely American. The more notable, perhaps, are The Divorce of Lady X, Wuthering Heights (with Laurence Olivier), Ernst Lubitsch's That Uncertain Feeling, René Clair's Forever and a Day, and as George Sand in the Chopin biographical film A Song to Remember. Daniel Mann directed her last film, Interval, which she produced herself and co-edited, about an older woman who finds happiness with a younger man, played by Robert Wolders. He went on to become her husband in real life.\n\n—Roger Manvell"}]}