{"Merle Oberon received critical acclaim for her performances in The Bishop's Wife in 1947 and I Want to Live! in 1958.": [{"url": "https://www.britannica.com/biography/Merle-Oberon", "page_content": "Merle Oberon, (born February 19, 1911, Bombay [now Mumbai], India—died November 23, 1979, Los Angeles, California, U.S.), British and American film actress who appeared in more than 30 motion pictures. Her most notable portrayal was that of the beautiful Cathy, who tormented and rejected Heathcliff (Laurence Olivier) in the 1939 classic Wuthering Heights.\n\nThe daughter of an Indian mother and a British army officer, Arthur Thompson, stationed in India, she was christened Estelle Merle. Moving to England, she played bit parts on stage and in films until she was discovered by the producer Alexander Korda, whose protégée and wife she became. Early in her career she created a fictional autobiography, claiming to have been born in Tasmania of Irish, French, and Dutch descent and christened Estelle Merle O’Brien Thompson.\n\nBritannica Quiz Hollywood Films in the 1930s Quiz\n\nWorking in both England and Hollywood, she achieved stardom as a hauntingly beautiful dark-eyed woman of grace and spirit. She first starred as Anne Boleyn in The Private Life of Henry VIII (1933), opposite Charles Laughton. She played opposite Douglas Fairbanks, Sr., in The Private Life of Don Juan (1934), Leslie Howard in The Scarlet Pimpernel (1934), and Maurice Chevalier in Folies Bergère (1935). She was cast as George Sand in the movie A Song to Remember (1945) and Napoleon’s Josephine in Désirée (1954). Her last screen appearances were in Hotel (1967) and Interval (1973)."}, {"url": "https://www.tcm.com/tcmdb/title/68818/the-bishops-wife/", "page_content": "1947 was, by all accounts, Samuel Goldwyn's peak year. Although the legendary producer had by this period amassed an array of impressive hits (and interesting misses), the jewel in his crown had been the Oscar-winning Best Picture of 1946,. The worldwide acclaim and mega-box office receipts ofenhanced Goldwyn's already considerable reputation in Hollywood but how do you top what many critics were calling the \"finest motion picture ever made\"?Taking his cue from one of RKO's biggest hits of 1945,(Leo McCarey's smash sequel to 1944's), he decided he would make a picture that was heartwarming and inspirational with a background Christmas setting. For his source material, Goldwyn optioned, a popular novel by Robert Nathan whose other fantasy romance,, would eclipseas both a literary work, and, as a 1948 Selznick movie. The fact that another RKO film, Frank Capra's, containing a similar earthbound angel storyline, flopped miserably the same year as, fell upon deaf ears.In an odd move, the producer next hired writer Robert Sherwood, who had done such a splendid job on, to pen the script; Goldwyn figured Sherwood could do no wrong. Sherwood, whose take on the reality of post-war America was dead-on, was not equipped to handle the lighthearted whimsical narrative concerning a heavenly being sent to mend a shaky mortal marriage. It was the second of many mistakes. William A. Seiter, a fine comedy director who had guided everyone from Laurel and Hardy (, 1933) and the Marx Brothers (, 1938) to Fred Astaire and Ginger Rogers (, 1935), was set to direct after William Wyler turned the picture down.Next came the casting. Loretta Young (whom Goldwyn would constantly refer to as \"Laurette Taylor,\" a famous actress who had recently died) and Cary Grant would be paired as the troubled couple with David Niven, ending his contract with the producer, slated as the angel, Dudley. From day one, Grant voiced his problems with the script, and stipulated re-writes. Soon, he realized that he had the wrong part: he should be the angel with Niven relegated to the title character's husband.Shortly after this casting change went into effect, Grant had new doubts about his decision and wondered if perhaps he should have stuck with his original role. But Goldwyn had other problems to contend with according to co-star David Niven in his biography,: \"The day before shooting was to start, Goldwyn decided that the interiors of the Bishop's house were not ecclesiastical enough and ordered several sets to be torn down, redesigned and rebuilt. For three weeks, while this was going on, production was halted, then, two days after the cameras finally had a chance to turn, Goldwyn decided that Seiter's hand was a little too heavy on the tiller: he was removed, paid his full salary and after a week, Goldwyn hired Henry Koster to start again from scratch - with another two weeks of rehearsal. All this must have cost Goldwyn several hundred thousand dollars....\"Almost before Koster could cry his first \"Action!,\" problems arose between Grant and Young - due primarily to Grant's notorious perfectionism. Off screen, the star was going through a rash of personal problems underlined by the near-death of his close friend Howard Hughes, who was hospitalized in critical condition after a plane crash. But on the set, Grant's obsessive attention to small details often irritated Young, who could be quite headstrong in her own working methods.According to Joe Morella and Edward Z. Epstein in the biography,, \"Loretta and Cary were shooting a scene when Grant stopped abruptly, declaring, \"If it's supposed to be cold outside, and the house is nice and warm inside, why isn't there any frost on the windows?\" This was the kind of detail that was rarely overlooked at the Goldwyn studio, and everything stopped until the proper frost effect was accomplished by the propmen.\" It was just one of many incidents that encouraged Young to assert her own ego during production. The fact that the two leads had gotten along famously when they co-starred in(1934) was apparently long forgotten when it came time to photograph them both in profile - from the same side - for a romantic scene. \"Neither actor had ever objected to being shot in profile,\" wrote Charles Higham and Roy Moseley in. \"But now Cary said he looked better from his left side, and Loretta said that she also looked better from that side. In despair, Koster said, \"How can I direct what is, in essence, a love scene if both of you are looking the same way?\" Eventually, Koster worked out the blocking for the scene that pleased both actors but the completed scene angered Goldwyn who later confronted Grant and Young and warned them, \"From now on, both of you guys get only half your salary if I can only use half your faces.\"Usually, Grant and Young would have turned to their co-star David Niven for comfort. The renowned wit and raconteur was a great pal of Cary's since the mid-1930s when he officially joined the Hollywood colony of expatriate British actors living there; furthermore, he and Loretta were good friends, having worked together four times previously. But the usually cheerful Niven was going through his own private hell. Prior to production on, the actor's beloved wife Primmie suffered a fatal head injury; it occurred during a party game of \"sardines\" at Tyrone Power's house. She thought she was running into a closet, but instead took a long fall down the cellar stairs and died of complications days later.Meanwhile, Goldwyn focused his energies on improving the script. With key sequences in crucial need of tweaking, Sam sent out an A.P.B. for the writing/directing/producing team of Billy Wilder and Charles Brackett. During a frantic Friday meeting and rough-cut screening, Goldwyn offered the formidable scribes $25,000 for doctoring three crucial scenes on the proviso that they be ready for the cameras by Monday. The duo agreed and worked round the clock, handing in the newly scripted scenes with no time to spare. However, Wilder and Brackett had a proviso of their own: Since the 25 grand would ultimately cause them more trouble than it was worth (due to the strict California tax laws), Wilder told Goldwyn, 'Sam, about that $25,000 you were going to pay us for those three scenes. We've decided we don't need the money.' 'Funny,' replied Sam, 'I had just come to the same conclusion myself.'Surprisingly, despite all the problems encountered during filming,emerged unscathed to excellent reviews. While not coming close to rivaling Goldwyn's, the comedy-fantasy took in more than respectable grosses, and has since become a perennial Yuletide classic. Goldwyn himself was shocked at how well the picture turned out. He even went as far as to predict that Loretta Young would win the Best Actress Oscar for 1947! Of her performance, Young later said, \"I thought of the wife as a frustrated little thing, rather lonely and rather thwarted....This was the hardest part I'd ever played.\"In all,picked up five Academy nominations, including Best Picture and Best Director, as well as Best Sound Recording, Best Editing and Best Scoring of a Dramatic or Comedy Picture. But Goldwyn would only take home one statuette - for Best Sound. As for his prediction, it proved to be an ironic example of \"Don't wish so hard for something, you just might get it.\" Loretta Young did indeed win the Best Actress Oscar that year - for, produced through RKO by David O. Selznick!Producer: Samuel GoldwynDirector: Henry KosterScreenplay: Leonardo Bercovici, Robert E. Sherwood, Charles Brackett, Billy Wilder; based on the novel by Robert NathanArt Direction: Perry Ferguson, Charles Henderson, George JenkinsCinematography: Gregg TolandEditing: Monica CollingwoodMusic: Hugo W. FriedhoferCast: Cary Grant (Dudley), Loretta Young (Julia Brougham), David Niven (Henry Brougham), Monty Woolley (Prof. Wutheridge), James Gleason (Sylvester), Gladys Cooper (Mrs. Hamilton).BW-110m. Closed captioning.by Mel Neuhaus\n\nThe Bishop's Wife - The Bishop's Wife\n\n1947 was, by all accounts, Samuel Goldwyn's peak year. Although the legendary producer had by this period amassed an array of impressive hits (and interesting misses), the jewel in his crown had been the Oscar-winning Best Picture of 1946, The Best Years of Our Lives. The worldwide acclaim and mega-box office receipts of Best Years enhanced Goldwyn's already considerable reputation in Hollywood but how do you top what many critics were calling the \"finest motion picture ever made\"? Taking his cue from one of RKO's biggest hits of 1945, The Bells of St. Mary's (Leo McCarey's smash sequel to 1944's Going My Way), he decided he would make a picture that was heartwarming and inspirational with a background Christmas setting. For his source material, Goldwyn optioned The Bishop's Wife, a popular novel by Robert Nathan whose other fantasy romance, Portrait of Jennie, would eclipse Bishop as both a literary work, and, as a 1948 Selznick movie. The fact that another RKO film, Frank Capra's It's a Wonderful Life, containing a similar earthbound angel storyline, flopped miserably the same year as Best Years, fell upon deaf ears. In an odd move, the producer next hired writer Robert Sherwood, who had done such a splendid job on Best Years, to pen the script; Goldwyn figured Sherwood could do no wrong. Sherwood, whose take on the reality of post-war America was dead-on, was not equipped to handle the lighthearted whimsical narrative concerning a heavenly being sent to mend a shaky mortal marriage. It was the second of many mistakes. William A. Seiter, a fine comedy director who had guided everyone from Laurel and Hardy (Sons of the Desert, 1933) and the Marx Brothers (Room Service, 1938) to Fred Astaire and Ginger Rogers (Roberta, 1935), was set to direct after William Wyler turned the picture down. Next came the casting. Loretta Young (whom Goldwyn would constantly refer to as \"Laurette Taylor,\" a famous actress who had recently died) and Cary Grant would be paired as the troubled couple with David Niven, ending his contract with the producer, slated as the angel, Dudley. From day one, Grant voiced his problems with the script, and stipulated re-writes. Soon, he realized that he had the wrong part: he should be the angel with Niven relegated to the title character's husband. Shortly after this casting change went into effect, Grant had new doubts about his decision and wondered if perhaps he should have stuck with his original role. But Goldwyn had other problems to contend with according to co-star David Niven in his biography, Bring on the Empty Horses: \"The day before shooting was to start, Goldwyn decided that the interiors of the Bishop's house were not ecclesiastical enough and ordered several sets to be torn down, redesigned and rebuilt. For three weeks, while this was going on, production was halted, then, two days after the cameras finally had a chance to turn, Goldwyn decided that Seiter's hand was a little too heavy on the tiller: he was removed, paid his full salary and after a week, Goldwyn hired Henry Koster to start again from scratch - with another two weeks of rehearsal. All this must have cost Goldwyn several hundred thousand dollars....\" Almost before Koster could cry his first \"Action!,\" problems arose between Grant and Young - due primarily to Grant's notorious perfectionism. Off screen, the star was going through a rash of personal problems underlined by the near-death of his close friend Howard Hughes, who was hospitalized in critical condition after a plane crash. But on the set, Grant's obsessive attention to small details often irritated Young, who could be quite headstrong in her own working methods. According to Joe Morella and Edward Z. Epstein in the biography, Loretta Young: An Extraordinary Life, \"Loretta and Cary were shooting a scene when Grant stopped abruptly, declaring, \"If it's supposed to be cold outside, and the house is nice and warm inside, why isn't there any frost on the windows?\" This was the kind of detail that was rarely overlooked at the Goldwyn studio, and everything stopped until the proper frost effect was accomplished by the propmen.\" It was just one of many incidents that encouraged Young to assert her own ego during production. The fact that the two leads had gotten along famously when they co-starred in Born to be Bad (1934) was apparently long forgotten when it came time to photograph them both in profile - from the same side - for a romantic scene. \"Neither actor had ever objected to being shot in profile,\" wrote Charles Higham and Roy Moseley in Cary Grant: The Lonely Heart. \"But now Cary said he looked better from his left side, and Loretta said that she also looked better from that side. In despair, Koster said, \"How can I direct what is, in essence, a love scene if both of you are looking the same way?\" Eventually, Koster worked out the blocking for the scene that pleased both actors but the completed scene angered Goldwyn who later confronted Grant and Young and warned them, \"From now on, both of you guys get only half your salary if I can only use half your faces.\" Usually, Grant and Young would have turned to their co-star David Niven for comfort. The renowned wit and raconteur was a great pal of Cary's since the mid-1930s when he officially joined the Hollywood colony of expatriate British actors living there; furthermore, he and Loretta were good friends, having worked together four times previously. But the usually cheerful Niven was going through his own private hell. Prior to production on The Bishop's Wife, the actor's beloved wife Primmie suffered a fatal head injury; it occurred during a party game of \"sardines\" at Tyrone Power's house. She thought she was running into a closet, but instead took a long fall down the cellar stairs and died of complications days later. Meanwhile, Goldwyn focused his energies on improving the script. With key sequences in crucial need of tweaking, Sam sent out an A.P.B. for the writing/directing/producing team of Billy Wilder and Charles Brackett. During a frantic Friday meeting and rough-cut screening, Goldwyn offered the formidable scribes $25,000 for doctoring three crucial scenes on the proviso that they be ready for the cameras by Monday. The duo agreed and worked round the clock, handing in the newly scripted scenes with no time to spare. However, Wilder and Brackett had a proviso of their own: Since the 25 grand would ultimately cause them more trouble than it was worth (due to the strict California tax laws), Wilder told Goldwyn, 'Sam, about that $25,000 you were going to pay us for those three scenes. We've decided we don't need the money.' 'Funny,' replied Sam, 'I had just come to the same conclusion myself.' Surprisingly, despite all the problems encountered during filming, The Bishop's Wife emerged unscathed to excellent reviews. While not coming close to rivaling Goldwyn's The Best Years of Our Lives, the comedy-fantasy took in more than respectable grosses, and has since become a perennial Yuletide classic. Goldwyn himself was shocked at how well the picture turned out. He even went as far as to predict that Loretta Young would win the Best Actress Oscar for 1947! Of her performance, Young later said, \"I thought of the wife as a frustrated little thing, rather lonely and rather thwarted....This was the hardest part I'd ever played.\" In all, The Bishop's Wife picked up five Academy nominations, including Best Picture and Best Director, as well as Best Sound Recording, Best Editing and Best Scoring of a Dramatic or Comedy Picture. But Goldwyn would only take home one statuette - for Best Sound. As for his prediction, it proved to be an ironic example of \"Don't wish so hard for something, you just might get it.\" Loretta Young did indeed win the Best Actress Oscar that year - for The Farmer's Daughter, produced through RKO by David O. Selznick! Producer: Samuel Goldwyn Director: Henry Koster Screenplay: Leonardo Bercovici, Robert E. Sherwood, Charles Brackett, Billy Wilder; based on the novel by Robert Nathan Art Direction: Perry Ferguson, Charles Henderson, George Jenkins Cinematography: Gregg Toland Editing: Monica Collingwood Music: Hugo W. Friedhofer Cast: Cary Grant (Dudley), Loretta Young (Julia Brougham), David Niven (Henry Brougham), Monty Woolley (Prof. Wutheridge), James Gleason (Sylvester), Gladys Cooper (Mrs. Hamilton). BW-110m. Closed captioning. by Mel Neuhaus"}, {"url": "https://www.imdb.com/title/tt0039190/reviews", "page_content": "10 /10\n\nWarning: Spoilers\n\nStarting about 1946 the tradition of doing specialized films about Christmas really began to occur in Hollywood. There had been the 1938 version of Dickens' \"A Christmas Carol\" with Reginald Owen as Scrooge, \"Christmas In Connecticut\" in 1944, and a major sequence in \"Meet Me In St. Louis\" in 1944, but no whole real trend with a Christmas holiday framework. Then came (within one year) Frank Capra's \"It's A Wonderful Life\", \"Miracle On 34th Street, and this film, \"The Bishop's Wife\". Given that \"It's A Wonderful Life\" was a financial failure it is odd that the other films were soon coming out - as though Capra's failure was a stimulus to major studios to look at a potential market anyway.\n\n\n\n\"The Bishop's Wife\" follows the same supernatural framework of \"Miracle On 34th Street\". There the issue was if Kris Kringle (Edmund Gwenn) is actually Santa Claus. Even if the film's plot truly makes him \"legally\" Santa by a fluke in postal delivery and a sanity hearing, we really can't tell if Kris is the master of Christmas gift giving. The appearance of his cane in a deserted house that a little girl hopes for suggests he is, but earlier he looked troubled by the thought of getting the child such a gift. He does get an x-ray machine for a doctor friend, but it is got by a joint gift from Macy's and Gimbles.\n\n\n\nHere we know the supernatural figure is what he is supposed to be. Dudley (Cary Grant) is the visitor to Earth - an angel who is went when a person begs for help from the Almighty. He has been sent when Bishop Henry Brougham (David Niven) prays for assistance from God when he is facing the collapse of a project of building an Episcopal Cathedral. It seems that the main source of the money is from the wealthy Mrs. Hamilton (Gladys Cooper) and the lady is quite insistent on getting everything her way on the project. When Henry balks Mrs. Hamilton (who was instrumental in getting him his Bishopric) is willing to reconsider her financing the project. Henry finds his project has disrupted his relationship with his wife Julia (Loretta Young) as his attempts to be with her keep getting undone by committee meetings. He also has little time for lower class members of his bishopric (including his old friend Professor Wutheridge (Monty Wooley)). So when he does pray for help, there are several areas where help is needed.\n\n\n\nDudley was one of Grant's best liked roles where his romantic personality was minimized - he does go out several times with Julia, but their visits together while pleasant and joyful are relatively staid (the most exciting being skating at a public rink). He is well restrained but the occasional looks he gives to Young show that he likes her more than an immortal holy angel is supposed to. He does not fail to do what his mission is - not only assisting Niven on his duties as a bishop, but assisting Niven in reminding him of his wonderful wife and child (Debbie - Karolyn Grimes), and rekindling the spirit of Wooley in writing his masterly new history of the Roman Empire. He even finds time to put Cooper to rights - making her realize she should not feel so guilty about her real feelings about an unloved husband as to dedicate all kinds of monuments to his memory.\n\n\n\nThe whole film is a charmer, and it is an odd thing that producer Sam Goldwyn had so much difficulty in achieving the final result, hiring and firing directors and actors, and getting script rewrites from Billy Wilder and Charles Brackett. But it shows how sometimes the interference of a Hollywood producer worked wonders. Somehow the original film (with Niven as Dudley and Grant as the Bishop) would have been hard to swallow - maybe Grant as the Bishop would have been interesting (it would have been curious to see him as a stuffy type, and the scene with the varnished chair would have been the type of slapstick that Grant would have been at home with). Niven played a non-angel would-be marriage destroyer in \"The Little Hut\" with Stewart Granger, and proved to be no competition to Granger for Deborah Kerr. Granger was not Grant, but he could be suave like Grant. I can't see him half-way competitive to Grant either.\n\n\n\nGladys Cooper's dowager is reminiscent of her elderly Mrs. Vale in \"Now Voyager\", but her secret makes her terribly sympathetic. Wooley is quite sharp too, somewhat suspicious of Grant from the start, but perfectly willing to accept Niven's odd information about Grant's origins. Young is long suffering as a loyal, loving wife who realizes that her husband has gotten lost in his activities for glorifying his God. Also Jimmy Gleason has a nice supporting bit as Sylvester, the taxi driver who rediscovers the joys of ice skating.\n\n\n\nA wonderful seasonal film, it is always welcomed back at Christmas time - reminding us that one does not have to build vast monuments to dead loved ones or to God to celebrate Christmas, but just to recognize what is needed to share joy and love with as many people as possible."}, {"url": "https://www.bestmoviesbyfarr.com/articles/behind-the-scenes-the-bishops-wife/2020/12", "page_content": "For a truly memorable holiday movie night, it’s hard to beat 1947’s “The Bishop’s Wife,” starring Cary Grant, Loretta Young and and David Niven.\n\n\n\n\n\nIt’s a striking coincidence that our top three classic Christmas pictures- this film, “Miracle on 34th Street,” and most famously “It’s A Wonderful Life,” were all made and released within a year of each other. In addition, they all received Best Picture nominations at the Oscars, though none won the prize.\n\n\n\n\n\nPerhaps it came down to pent-up demand. After all, when the war was on Christmas movies might have seemed frivolous, what with our whole civilization at stake and so many American sons overseas and in danger. Back in 1942, it was enough to release “Holiday Inn,” a film celebrating all holidays, where Bing Crosby first introduced an Irving Berlin song called “White Christmas” that made countless GIs stuck in freezing trenches long for hearth and home. It became the best-selling single (45 rpm record) in history.\n\n\n\n\n\nToday, “The Bishop’s Wife” is the least well-known and celebrated of these three Christmas classics made just after the war, but that’s no reason to avoid it. Of the three, it is the lightest confection, which is no criticism. Both “Life” and (to a lesser extent) “Miracle” expose some dark corners in the human soul, while “Wife” plays more like romantic comedy, floating on a fanciful Christmas story about a suave, handsome angel (Grant) sent to earth to help a young Bishop (Niven) regain a sense of what’s most important in life.\n\n\n\n\n\n\n\n\n\nBishop Henry Brougham, Niven’s character, is obsessed with building a huge cathedral, which involves kowtowing to the bitter elderly widow underwriting the project, beautifully played by English actress Gladys Cooper. Since the angel (named Dudley) comes in the pleasing form of Cary Grant, it’s only natural that he engages with the Bishop’s neglected wife Julia to help her harried, pre-occupied husband finally see the light. That may sound somewhat profane, but the affection that builds between Dudley and Julia never feels tawdry. We know that he is, after all, an angel.\n\n\n\n\n\nThe film’s backstory is rich: first, independent producer Sam Goldwyn hit a rough patch at the beginning of shooting. Originally he had assigned director William Seiter to the project, and cast Grant as the Bishop and Niven as the angel. Fresh off her triumph in the prior year’s smash “The Best Years of Our Lives,” Teresa Wright was on hand in the role of Julia.\n\n\n\n\n\nSeveral weeks in, Goldwyn was looking at the initial footage and realizing the film was not gelling. Something was fundamentally off. He finally made the difficult decision to cut his losses and start over. He replaced Seiter with Henry Koster, who, in consultation with Goldwyn, finally resolved that Grant and Niven should switch parts.\n\n\n\n\n\nCary in particular hesitated before agreeing to this change. He was the biggest star in the cast, and felt he should play what is technically the title role. Eventually, he was persuaded that Dudley the angel was in fact the key part, and that he was best suited for it. Meanwhile, Teresa Wright had discovered she was pregnant, and had to drop out. Goldwyn promptly borrowed Loretta Young from RKO.\n\n\n\n\n\nThe film holds up today thanks both to Pulitzer Prize-winner Robert E. Sherwood’s clever, literate script and the strength of the cast. First and foremost, here is Cary Grant, at 43 in his absolute prime. As Dudley, he subtly transforms his dazzling countenance into something divine, and we are all in awe of someone (or something) not of this earth. If you want to see real star power, watch him in this.\n\n\n\n\n\nOpposite him, a luminous Loretta Young projects the warmth and purity of a Bishop’s wife, not a stretch as she was herself a highly devout Catholic, collecting quarters from cast and crew members who swore on the set. David Niven nails a part that forced this immensely charming actor to play a bit of prig for most of the film. Still, the actor’s warm, expressive eyes convince us that underneath it all, he’s a good man who has temporarily lost his way.\n\n\n\n\n\n\n\n\n\nThe supporting cast is equally stellar: beyond the aforementioned Dame Gladys as rigid dowager Mrs. Hamilton, Monty Woolley injects a note of pathos as Professor Wutheridge, the Bishop’s forgotten old friend who may never finish the history of ancient Rome he’s labored over for decades. (Today, Woolley is best remembered for originating the role of radio personality Sheridan Whiteside in “The Man Who Came to Dinner”, on both stage and screen). Next, we have character actor James Gleason as a goodhearted cabbie named Sylvester, and the “Bride of Frankenstein,” Elsa Lanchester, in a sunnier turn as Matilda, the Bishop’s housemaid.\n\n\n\n\n\nFinally, another coincidence: child actor Karolyn Grimes, best remembered as George Bailey’s adorable daughter Zuzu in “Wonderful Life,” was back just months later to portray the Bishop’s equally adorable daughter, Debby. Another juvenile player, Robert J. Anderson, who was the young George Bailey in the earlier film, also appears again here.\n\n\n\n\n\nOn its release, “The Bishop’s Wife” received respectful reviews, but did not score immediately with the public. The film’s title may have been partially responsible, as reportedly many fans assumed it was a “religious picture.” Sam Goldwyn lost money on the film, largely as a result of having to start production twice.\n\n\n\n\n\nStill he was always proud of the finished product, and it’s easy to see why. Younger viewers may be more familiar with the 1996 remake “The Preacher’s Wife,” starring Denzel Washington and Whitney Houston. That film has its moments, but as with so many remakes, it never fully recaptures the magic of the original.\n\n\n\n\n\nNow we’ve all seen “It’s a Wonderful Life,” and doubtless we will see it again. It is indeed “wonderful,” as advertised, and it’s hard not to love Clarence, the angel in that film, immortalized by the cuddly Henry Travers.\n\n\n\n\n\nBut this holiday season, I submit it’s high time you met another angel. His name is Dudley.\n\n\n\n\n\n\n\nMore:\n\nHow \"It's a Wonderful Life\" Went From Box-Office Flop to Christmas Classic\n\n8 Top Christmas Movies from Around the World\n\nThe Three Best Christmas Movies Ever"}, {"url": "https://www.kozaksclassiccinema.com/the-bishops-wife-1947/", "page_content": "The Bishop’s Wife (1947). 109 minutes. Directed by Henry Koster. Starring Cary Grant (as Dudley), Loretta Young (as Julia Brougham), David Niven (as Bishop Henry Brougham), Monty Woolley (as Professor Wutheridge), James Gleason (as Sylvester), Gladys Cooper (as Agnes Hamilton), Elsa Lanchester (as Matilda), Karolyn Grimes (as Debby), and Sara Haden (as Mildred Cassaway). Featuring The Robert Mitchell Boys Choir. Cinematography by Gregg Toland.\n\nThe Bishop’s Wife is a Production Code-era holiday film about a love triangle between an Anglican church official, his wife, and another man. This in itself would be potentially juicy material for a film of any era, but what makes The Bishop’s Wife veer towards the bizarre is that the other man making sexual advances towards the bishop’s wife is in this case an angel, sent down from heaven to assist the bishop as he navigates his way through a building project that is making his wife miserable and resentful. As a Christmas story with an at times miracle-working angel, the film can plausibly claim to offer displays of divine magic and religious virtue (it is light on other theological content); and in some ways its theme of heavenly intervention piggy-backs on the wholesome premise of one of the most well-known entries in the Christmas angel genre, It’s a Wonderful Life (1946), which was released only the year before. But because of the nature of much of the angel’s behavior on earth in The Bishop’s Wife (specifically, the way he subtly romances the titular character), it is challenging to affix any of the sturdy morality of other holiday movies such as It’s a Wonderful Life to the story we see. The fact that its remake, The Preacher’s Wife (1996), is more heavily infused with child- and family-friendly elements serves as a strong indicator of how out of place the 1947 Bishop’s Wife is in the modern-day world of Christmas films. The Bishop’s Wife will thus prove challenging to anyone seeking out the usual Hollywood holiday fare, but for audiences that are open to its oddball tale of supernatural intervention gone wrong, it can impressively demonstrate how a Code-era film could be certified by internal Hollywood censors and still remain fairly edgy.\n\nThe film opens in wintertime as Bishop Henry Brougham struggles to balance his private life with his work life. As a bishop, he is tasked with raising money for a new cathedral, but his wife Julia is dissatisfied with the project and his role in fundraising. They quarrel and are frustrated. Alone in prayer, Henry asks for guidance, and the angel Dudley is summoned to his house, his true identity known only to Henry. Dudley, posing as Henry’s assistant, pledges to help him solve his problems.\n\nIt soon becomes clear, however, that Dudley is set on dissolving Henry’s building project, and in that he is successful. At the same time, Dudley takes it upon himself to spend more time with the neglected Julia, ostensibly to buck up her spirits by accompanying her on trips to hear a boys’ choir, skate on a pond, and shop downtown; but his feelings for her grow and become romantic in nature, and Henry fumes with jealousy. Finally, Dudley begins to tell Julia exactly how he feels about her, but she is horrified and cuts him off. Quickly coming to his senses, he informs Henry (who is by now willing to fight Dudley for his wife’s heart) that he is departing and will erase everyone’s memories of him in order to ensure peace and contentment. Having forgotten about Dudley, the couple reunites, happier than ever. The film concludes on Christmas Eve with Henry addressing his community about their future as Dudley looks on approvingly from a distance.\n\nThe Bishop’s Wife’s irreverence would veer more obviously towards deviance were it not for notable miraculous and ethical displays made throughout the film on the part of the angel Dudley. Through special effects, the movie gently reminds us of its otherworldliness and of the fact that Dudley is a divine messenger who is vested with special powers, even though we never see him arrayed in anything other than a suit and tie. Dudley demonstrates heavenly oversight through his charmed interaction with inanimate objects: index cards that Dudley tosses into the air in the office magically sort themselves and fall into their ordered places in boxes; his snowball glides through the air to strike its far-off target as if guided by an unseen hand; a bottle of sherry pours out unceasingly in his presence and is never depleted; a typewriter types by itself while Dudley dictates a speech into it; and finally, a Christmas tree decorates itself with ornaments, lights, and tinsel trim upon his command.\n\nAlthough much of what Dudley uses his angelic powers to achieve is playful and witty, elsewhere his supernatural displays are fairly mundane, leading us to believe that his magic is not merely about amusing himself, impressing other characters, or demonstrating his authority to the audience. He intervenes and saves people’s lives in traffic repeatedly, and the people strolling through the downtown take their rescues in stride, barely aware of his intercession. His presence in these scenes, in spite of sporadic and intermittent magic, seems quietly and sweetly banal.\n\nThat is to say, it is possible to locate divine goodness in Dudley, both in his obvious power to rule over inanimate objects and in his empathetic connections with human beings. He is a natural at being human, and by the end of the film it is clear that he feels many of the things that humans do, including romantic love. In particular, he is an insightful reader of the human soul who understands human wants and needs, and he is especially skilled at reading women. We see Dudley watching women downtown as they window shop at Christmastime, and in a moment that strangely serves as a faint echo to the Odessa steps sequence in Battleship Potemkin (1925), he even dramatically rescues a meandering baby carriage when the absent-minded mother who should be watching it is distracted by store displays.\n\nNotably, when the bishop confesses to his friend Professor Wutheridge that Dudley is an angel, the professor is not in the least surprised. So just as Dudley accepts people, absent-mindedness and all, people accept Dudley. We can see how he could potentially be the right messenger for this community. And it should be mentioned, the fact that in human form he looks and sounds like Cary Grant surely does not hurt.\n\nYet in spite of the presence of the film’s direct and palatable messenger from God in nearly every scene and the comfort of both the small and large miracles he brings, The Bishop’s Wife feels oddly unstable, as if it is in danger of tipping over. That is because Henry and Julia’s marriage is in deep trouble, with or without the cathedral project, and with or without Dudley; for while it is true that the couple does not appear to be equipped to think of a solution to the building problem together, it is also not clear that they can solve much of anything else in their relationship. They do not communicate well with each other, with the result that they are often frustrated and moody. In addition, Julia feels let down and abandoned by Henry, in spite of the regular time they spend together. For example, although the couple is served a multi-course meal every evening, which they eat late but still together, nevertheless Julia struggles because Henry is not ready for dinner at a consistent hour, and her cook must delay serving the table while the main course over-roasts. It is less that she desires time with Henry and more that she desires Henry on her own terms, according to her own schedule. She also wants her husband to participate in her extracurricular fantasies, regardless of the consequence to his work. Julia is frustrated because Henry will not take her to a romantic restaurant for lunch; she desires to skate with abandon at the ice pond, to be encouraged to buy a frilly hat.\n\nPerhaps most concerning, then, is the fact that Henry and Julia do not appear to have anything approaching similar values, and that is a problem that could be insurmountable for them. Julia resides in a world where it is possible to take time regularly in the middle of the day to enjoy an elaborate French meal, be wooed on skates, and go shopping on a whim, whereas Henry’s time is defined by heavy responsibilities to make improvements on church assets and expand his religious community. Henry is asking for a short-term sacrifice to benefit the public that she is unwilling to give. It does not make her particularly appealing, but in the end the film renders him incapable of offering the sacrifice as well.\n\nAs it is, the end result of Dudley’s intervention is to make their unsatisfying relationship and its context only minimally satisfying. While some aspect of Henry and Julia’s attraction to each other is magically restored in the final scenes, and we might feel pleased that their relationship has not been utterly destroyed (either because of their behavior or Dudley’s), the film awkwardly insists that Henry divest from the cathedral project and deprive the church of the opportunity for growth and expansion in order to restore joy to his marriage. But this seems awfully short-sighted. If the solution really does have to be that he gives up fundraising for this project in order to save his marriage, why is it never suggested that someone else could take up the project instead? The movie actually cuts off funding for the building altogether, obliterating the possibility that someone might jump in and salvage the plans. It seems so unnecessary, as if The Bishop’s Wife is forcing Henry to repent rather than Dudley and Julia, the participants in the extramarital romance. The Code may have insisted that Dudley and Julia end their relationship clearly and without explicit breach of her marriage, and that the Brougham family be preserved, but it weirdly reserves its punishing morality for the bishop himself. That is just one reason that its ethical universe appears to be warped; the heaven that has orchestrated Dudley’s visit seems to have largely tuned out of the story that follows his arrival (at least until its conclusion).\n\nDudley’s mission to fix the building problem places the preservation of marriage, rather than the church, at the center of the story. But at the same time, Dudley’s mission as it veers off course becomes the opposite of a wholesome project to realign a husband and wife. That is because while Dudley is sent to help the bishop, he instead helps himself to the bishop’s wife and creates a love triangle, unsettling the household through romantic turmoil that no amount of fantastic, miraculous displays such as self-decorating trees and magical, flying snowballs can fully correct. Dudley becomes, in as Code-friendly a way as it is possible to make him, a supernatural seducer whose line of sight is transposed from the bishop to his wife, and whose initially holy intentions are rendered irrevocably socially inappropriate.\n\nI freely acknowledge that The Bishop’s Wife’s suggestive content is far from smoldering, and although it is naughty in suggesting that Julia gets swept away by a good-looking angel, forgetting her husband momentarily in the process, it does not resemble erotic Code-era films such as The Postman Always Rings Twice (1946). Yet it still locates romantic fantasy and moments of intimacy in Dudley and Julia’s relationship. Take, for example, Dudley’s lunch with Julia at Michel’s (her favorite restaurant), which he undertakes ostensibly in his capacity as Henry’s assistant and helper. The lunch is both a friendly and upstanding meal in public—a favor he is doing for Henry—and something more, involving charm and flirtation. In the restaurant, Julia and the angel are seated at a cozy booth, and he speaks in French to the waiter as he orders for them both, which causes her to swoon. The lunch is thus more than a special favor. It is a kind of extramarital delight that both Dudley and Julia clearly enjoy. Although he does eventually invite some of Henry’s parishioners who are dining nearby over to the table to join them—out of concern that they might misunderstand what is taking place—this tactful act only serves to reinforce our sense of his special concern for Julia while also underscoring that his lunchtime rendezvous with her (and the extent to which he and she are enjoying it) does in fact have every appearance of being not wholly above board.\n\nDudley’s involvement with Julia becomes more obvious later on—specifically via one of the film’s recurring motifs: the image of Julia window shopping and fixating on an embellished bonnet in a haberdasher’s window (she is in turn being viewed by Dudley as she looks on, in an echo of the party scene in which Cary Grant observes Ingrid Bergman in Notorious [1946]). Whereas the lunch scene more closely approximates a formal date, the scene where Julia finally enters the haberdasher’s shop with Dudley resembles a shopping trip with a close friend. But by standing in the place of the shopping companion, Dudley achieves a special level of intimacy with Julia—beyond friendship—as he encourages her to try on the hat she so admires, and dissuades another customer from taking it home. As an advocate for Julia’s personal fantasies, Dudley demonstrates that he sees more deeply into her private desires than her husband does, and the power of this moment is monumental in its ability to pull Julia up out of her personal misery. (It is hard to imagine Henry stepping over the shop’s threshold and taking a similar interest in women’s accessories.) Dudley, as a supportive teammate, also demonstrates his commitment to infusing her life with pleasure and joy by working with her as a collaborator. The angel emerges not just as a dreamy romantic figure but also as an intimate partner.\n\nAdmittedly, it is not at all clear what Dudley’s plan is: how is he as an angel going to successfully run off with Julia? It is hard to believe that long-term, this romance that crosses spiritual planes would flourish under the supervision of Dudley’s all-knowing boss. Equally perplexing, after Dudley has finally begun to explicitly proposition Julia in front of the Christmas tree and she rebuffs him, he confesses to Henry in the next room that he has encountered a vague “danger signal” and knows he has to leave. But does the danger signal mean that he has endangered the family, or is he in danger from Henry, who makes it clear in the same scene that he is ready to fight for his wife—or is he in danger from God? The movie leaves the issue unresolved, but it is clear that while in virtually any other story we might expect as a given that heavenly figures are sources of impeccable moral authority, here Dudley’s danger signal indicates instead that he is recognizably (to Henry, to us, and finally to himself) corrupted. We might wonder if the angel feels remorse, or if heaven is collectively blushing because it dispatched him, but there is no accompanying expression of regret from above for having sent him down and set him loose on a path of transgression.\n\nAt least he can pull back and vanish in time to save the couple’s marriage, but it is clear that he has done damage to both Julia and Henry. Only by eradicating any memories of himself is he able to reunite them, making the best of Julia’s newfound sense that she is appreciated (without the guilt of having dallied with Dudley) and Henry’s awakening to the need for him to nourish his marriage (without the anger he feels towards Dudley and the knowledge that his wife has acted inappropriately). The movie that we have watched, therefore, in a sense does not exist, as its events are not remembered by anyone whom we see during its two-hour running time.\n\nIf Christmas for many people is about memorable traditions, The Bishop’s Wife has revoked the idea of memory from the holiday it depicts. It presents us instead with something of a contradiction: to its characters, the story we see is an influential and memorable non-memory that shapes their lives and saves their marriage despite the events of the film being, in the end, unknown to them. It therefore correlates with the paradoxical nature of the Christmas miracle (the virgin who gives birth, the god who becomes human). In a peculiar way, the conclusion infuses the movie with this rhetoric, which we know shares something in common with the motifs of the central Christian story, even though the characters are unaware of it, and even while elsewhere the movie (although Christmas-centric) is light on theological details. This final twist is not enough to make The Bishop’s Wife feel more profoundly religious or to rescue it from its flaws. But it does make for an intriguing (although admittedly, somewhat bewildering) cap to a twisted story about heaven and humans and the way they intersect. The fact that the intersection we see is covered in snow and tinsel, packed full of ice skating and singing boy choristers, studded with twinkling shop lights, and marked with borderline adultery just makes it more wonderfully weird."}, {"url": "https://letterboxd.com/film/the-bishops-wife/", "page_content": "Part of Buddy the Elf, What's Your Favorite Color?\n\n“I was praying for a cathedral.” “No, Henry. You were praying for guidance.”\n\nCary Grant is perfect.\n\nNo, no, I don’t mean “perfect”; I mean truly perfect. He is tall, dark, and handsome. He is witty and charming and urbane. He is impeccably dressed and groomed. He is intelligent and sophisticated, but in a relaxed, comfortable manner. He is, in every way, the platonic ideal of...well, everything.\n\nCasting him as an angel seems almost too obvious, a preordained recipe for success. But Grant was not always to play Dudley in The Bishop’s Wife, Samuel Goldwyn’s entry in the 1947 holiday movie season. Accounts vary somewhat, but what is known is that…"}, {"url": "https://aurorasginjoint.com/2014/12/06/the-bishops-wife-1947/", "page_content": "The golden moments in the stream of life rush past us and we see nothing but sand; the angels come to visit us, and we only know them when they are gone. ~George Elliot\n\n◊\n\nWe know he is a force for good from the moment we see him. The streets are buzzing with the excitement of Christmas. Children crowd the sidewalks watching toy displays in store windows as snow gracefully decorates the pavement. The man stands still behind the children enjoying their joy and wonder. He then notices a blind man trying to cross a busy intersection. With ease he walks over, gently grabs the blind man’s elbow and guides him across the street. As he does so cars come to a halt. There’s something special about this man.\n\nAfter saving a baby from a near-catastrophe just moments later, the man walks down the street to where the noise has ceased. There he sees a woman who’s stopped to admire a hat on display in the window of a boutique. The man’s gaze follows her as she crosses the street to choose a Christmas tree for her family. The woman’s name is Julia. She’s the Bishop’s wife. The Bishop is the one who asked for guidance, the reason this good man has come to this place.\n\nIt’s not uncommon that Christmas or holiday movies ask us to believe in miracles or to see that they feature immortal beings sent from somewhere high above. Santa Claus, ghosts, elves, talking reindeer and angels are but a few of those chosen to deliver messages during the time of year we seem to need them most. In countless of those stories we are asked to suspend disbelief and most of us do so willingly. That’s particularly true when the movie delivers its message in as charming a manner as does Henry Koster’s THE BISHOP’S WIFE.\n\nNow, I must warn you to proceed with caution. No one’s supposed to know what part Cary Grant plays in this until they see the picture.\n\nThematically there is nothing particularly unique about THE BISHOP’S WIFE – a troubled man has lost his way and needs to be reminded of what really matters. In the case of THE BISHOP’S WIFE the forlorn man is Bishop Henry Brougham who’s been commissioned to build a new cathedral and is failing at the task. The Bishop prays for guidance and an angle appears, an angel named Dudley who looks like Cary Grant. Dudley makes his true identity known only to Bishop Brougham who thinks the answer to his prayer is the realization of a building, which he has been so caught up with that he has lost sight of his family, of love, of promises and of personal obligations.\n\nDudley’s mission, if you will, is to get Bishop Brougham back on the right path, the righteous path by way of reminding him it’s what he has right in front of him that is valuable. I guess it’s what we all need reminders of now and again. The Bishop asks for a great miracle, why not build the cathedral and his problems would be solved? But that’s not the kind of miracle Dudley performs. Rather than use his supernatural powers to build great halls of worship Dudley enchants the disenfranchised, brings joy in simple pleasures and reignites passion in those who’ve lost love and purpose. In the long run Dudley helps the Bishop by changing the lives of those around him. His special gifts reintroduce people to joy and warmth and cooperation and longing so that each sees his/her own path more clearly – all serve as lessons for the Bishop, but there are also many small miracles as side benefits.\n\nThere’s Mrs. Hamilton, one of the rich widows on the cathedral committee who promises to donate substantial funds, but only if the Bishop bends to her will. Mrs. Hamilton’s heart is irrevocably changed by Dudley with a reminder of true love.\n\nProfessor Wutheridge is an old man, a friend of the Broughams, an author and historian who has lost his words. For him Dudley allows renewed energy and passion for living in addition to an unending stream of brandy.\n\nNext is a cab driver named Sylvester, one of my favorite characters in the movie. Sylvester is a kind and generous soul, the salt-of-the-Earth type who has gained great insight through his daily routines, “The main trouble is there are too many people who don’t know where they’re going and they want to get there too fast!” It’s an afternoon of impromptu ice skating with Dudley and Julia that restores Sylvester’s faith in human nature.\n\nThen there’s Julia, the Bishop’s wife. Julia suffers while her husband loses his way to himself and to her. Julia receives special attention from Dudley. He reminds her she is worthy of romancing and owning beautiful things and she, in turn, reminds the angel of his humanity.\n\nDudley is portrayed by a beguiling Cary Grant. Mr. Grant demonstrates his considerable talent by adding several degrees of warmth and charm to his impressive frame in this portrayal of an angel. You may want to visit the recent ABCs of Cary Grant post dedicated in a much more expansive manner to explaining why he remains the standard of the silver screen.\n\nThe performances in THE BISHOP’S WIFE are all affecting across-the-board, however. Loretta Young is sublime as the Bishop’s wife and makes a perfect match for both Grant and David Niven who plays the bitter and distant bishop to perfection. And Monty Woolley is as memorable as always, his impressive voice and eccentric manner make his portrayal of the old intellect a highlight.\n\nPerhaps the greatest miracle of all with regards to this movie is the movie itself. Despite its high caliber stars and talented supporting cast (list below) THE BISHOP’S WIFE manages to be soft, lovely, humble and magical. This is a movie with just the right amount of sentimental, which guarantees to leave you – as the wise Sylvester says – “with pockets bulging with the coins of self-satisfaction.”\n\nThe terrific cast:\n\nDudley . . . . . Cary Grant\n\nJulia Brougham . . . . . Loretta Young\n\nHenry Brougham . . . . . David Niven\n\nProfessor Wutheridge . . . . . Monty Woolley\n\nSylvester . . . . . James Gleason\n\nMrs. Hamilton . . . . . Gladys Cooper\n\nMatilda . . . . . Elsa Lanchester\n\nMildred Cassaway . . . . . Sara Haden\n\nDebby Brougham . . . . . Karolyn Grimes\n\nMaggenti . . . . . Tito Vuolo\n\nMr. Miller . . . . . Regis Toomey\n\nMrs. Duffy . . . . . Sara Edwards\n\nMiss Trumbull . . . . . Margaret McWade\n\nMrs. Ward . . . . . Ann O’Neal\n\nBefore you go take a look at the non-trailer trailer for THE BISHOP’S WIFE, which is one of my favorites featuring the film’s three stars on the lot at Samuel Goldwyn Studios.\n\nAnd I leave you wish wishes that you and yours may have many magical, peaceful and lovely moments throughout the year.\n\nAurora"}, {"url": "https://www.altfg.com/film/merle-oberon/", "page_content": ": ‘Exotic’ and mysterious star of British and American cinema was a victim of the ‘ Merle Oberon : ‘Exotic’ and mysterious star of British and American cinema was a victim of the ‘ Marion Davies Syndrome.’\n\nMerle Oberon movies: ‘Exotic’ and underrated actress with mysterious past is Star of the Month\n\nMerle Oberon is Turner Classic Movies’ Star of the Month of March 2016. The good news: The elegant, exquisite, and vastly underrated actress, whose early life and ancestry have been a matter of conjecture for decades, makes any movie worth a look.\n\nNever a top box office draw in the United States, Oberon was an important international star all the same, having worked with many of the top actors and filmmakers of the first half of the 20th century.\n\nNow for the bad news: There are no TCM premieres in the offing despite the fact that a number of Oberon’s films can be tough to find, especially in good condition. These include Men of Tomorrow (in which she has a small role), Thunder in the East, Temptation, Night in Paradise, Pardon My French, the Spanish-made Todo es posible en Granada, and her final effort, Interval.\n\nBelow is a brief overview of Merle Oberon’s life and career, with an emphasis on some of the movies to be presented on TCM.\n\nThat uncertain ancestry\n\nOne curious thing about Merle Oberon is that the off-screen stories about her are no less intriguing than those she acted out on screen.\n\nThroughout her life, Oberon – perhaps following mentor, lover, and later husband Alexander Korda’s advice – claimed to have been born on the Australian island state of Tasmania. Her records were supposed to have been destroyed in a fire.\n\nIn truth, as found in records from the British Raj made available online via the ancestry website findmypast.co.uk, she was born Estelle Merle Thompson on Feb. 19, 1911,[1] in Bombay (now Mumbai). Her father was railway worker Arthur Thompson (not an army officer as Oberon had always claimed), from the northeastern English town of Darlington; her mother was named Constance Selby.\n\nThings get murky from here on.\n\nConstance Selby is supposed to have been either the 12- or the 15-year-old daughter of Charlotte Selby – Thompson’s 26-year-old girlfriend from Ceylon (now Sri Lanka) and of “Eurasian/Maori” background. Estelle Merle, nicknamed Queenie, was raised by Charlotte Selby as if she were her daughter; the girl believed that Constance was her older sister.\n\nHigh-priced sex worker?\n\nIf that weren’t all, in A. Scott Berg’s 1989 Samuel Goldwyn biography, an unidentified man claims that Merle Oberon used to be a high-priced sex worker – apparently while still a teenager, as she began landing sizable film roles in British films at age 21 in 1932.\n\nMy suggestion: Everything is possible, but take this high-priced sex worker story with a boulder of salt. This is in no way a moral judgment on Oberon or how she conducted her life; instead, I just find it hard to believe someone who unceremoniously names the celebrity he (purportedly) paid for sex – as we all know, sex workers still have a tough time finding acceptance and respect – while ensuring that the privacy of his own person would be maintained.\n\nOberon, of course, had been dead – and unable to tell anyone her version of the story – for nearly a decade before Berg’s book was published.\n\nNow, fast-forward to the post-1933 Estelle Merle Thompson, by then reborn, with a different name, as an international movie star.\n\nMerle Oberon movies: Alexander Korda discovery went on to become a long-lasting international star. Merle Oberon movies: Alexander Korda discovery went on to become a long-lasting international star.\n\n‘Marion Davies Syndrome’\n\nMerle Oberon is one of those actresses who have unjustly suffered – and continue to suffer – from what I call the Marion Davies Syndrome.\n\nAs I explained a few years ago in a post about Jennifer Jones, I believe that many (most?) film critics and so-called “historians” have dismissed actresses such as Davies, Jones, Norma Shearer, Joan Bennett, and Norma Talmadge because they had powerful backers.\n\nAdmittedly, Davies’ two-decade film career was indeed a direct result of her relationship with publishing magnate William Randolph Hearst, while Jennifer Jones became an Oscar-winning star (The Song of Bernadette, 1943) thanks to the efforts of Gone with the Wind producer and independent mogul David O. Selznick.\n\nNorma Shearer had MGM’s second-in-command Irving G. Thalberg. Joan Bennett had top producer Walter Wanger. And, in case film “scholars” have ever heard of her, 1920s superstar Norma Talmadge was boosted by independent mogul Joseph M. Schenck.\n\nThe possibility that Marion Davies and Jennifer Jones might have become even bigger stars had their Svengalis been less controlling and more discerning, or that Norma Shearer and Norma Talmadge might have reached superstardom heights even without Thalberg or Schenck is ignored by those who refuse to accept the fact that a person can have both an influential patron and talent – in addition to, of course, luck, ambition, and/or professional acumen.\n\nWalter Wanger may have been the one to insist that his future wife keep her dark locks acquired during the making of the 1938 adventure comedy Trade Winds, but from then on, former blonde ingenue Joan Bennett was the one giving her all under the direction of Fritz Lang, Jean Renoir, Max Ophüls, and others.\n\nStarmaker Alexander Korda\n\nAs for Merle Oberon, her dedicated patron was Alexander Korda, a Hungarian émigré (rich people’s immigrant status must be spelled out in French) who happened to be one of the most important figures in the first two decades of British sound cinema.\n\nWith a guy like that backing her up, so the thinking goes, how could Oberon have failed to become a movie star?\n\nWell, just ask Maria Corda, whose international film stardom didn’t go very far despite husband Korda’s widespread connections in Europe and Hollywood.\n\nNow, I’m not saying that Alexander Korda wasn’t a key element in the development and evolution of Merle Oberon’s career. But even if Korda did everything behind the camera to catapult his lover and protégée (and wife from 1939–1945) to film stardom, ultimately it was Oberon’s presence in front of the camera that made her secure that position for nearly two decades.\n\nMerle Oberon, Merle Oberon, Greer Garson and Rosalind Russell : 12 Best Actress Oscar nominations among them.\n\nOnly one Oscar nomination despite wide range of roles & performances\n\nIn all fairness, Merle Oberon – like every other performer, no matter how prestigious – had her thespian ups and downs.\n\nSometimes she was weak, e.g., Ernst Lubitsch’s That Uncertain Feeling (1941), telegraphing her (off) comic timing by means of pouts and glares. Sometimes she was good, e.g., William Wyler’s These Three (1936), conveying her small-town teacher’s emotional travails without resorting to tricks or gimmicks despite fierce competition in the acting department from co-star Miriam Hopkins.\n\nSometimes Oberon was outstanding, e.g., Wyler’s Wuthering Heights (1939), losing herself inside Emily Brontë’s love-struck Cathy to create one of the most indelible performances of the 1930s. And sometimes she was fascinating, e.g., Charles Vidor’s A Song to Remember (1945), in which, as George Sand, she steals the movie from co-stars Cornel Wilde and Paul Muni merely by looking more manly than they do.\n\nIn fact, Merle Oberon – in pants, rococo gowns, or modern dress – was always fantastic to look at, whether…\n\nPining for Leslie Howard in the aftermath of the French Revolution in Harold Young’s enjoyable The Scarlet Pimpernel (1934).\n\nSuffering as a noblewoman in love with Irish rebel Brian Aherne in H.C. Potter’s effective romantic/political drama Beloved Enemy (1936).\n\nDancing onstage as a (potential) Jack the Ripper victim in John Brahm’s atmospheric The Lodger (1944).\n\nOr, as Anne Boleyn, about ready to have her head chopped off in Alexander Korda’s enormously successful The Private Life of Henry VIII (1933) – the first British production to receive a Best Picture Academy Award nomination.\n\nSomewhat surprisingly, during her four-decade film career Merle Oberon received only one Academy Award nomination: in the Best Actress category for her work in Sidney Franklin’s great-looking (cinematography by Gregg Toland) but slow-moving 1935 period melodrama The Dark Angel (1935), an expensive Samuel Goldwyn production co-starring Fredric March and Herbert Marshall. (For the record, the winner that year was Bette Davis for Alfred E. Green’s Dangerous.)\n\nOver the Moon: An eye on the American market\n\nOn March 18, TCM’s Merle Oberon movie schedule consists of six movies released in the first half of the 1940s: Over the Moon, Lydia, ‘Til We Meet Again, That Uncertain Feeling, First Comes Courage, and A Song to Remember.\n\nOver the Moon (1940) is a British effort directed by North Dakotan filmmaker Thornton Freeland, he of the Eddie Cantor comedy Whoopee! and the Ginger Rogers-Fred Astaire musical Flying Down to Rio (which, incidentally, actually starred Dolores del Rio and Gene Raymond). Freeland began making movies in the U.K. in the mid-1930s, and would remain on the other side of the Atlantic for the remainder of his career.\n\nMerle Oberon, by then already a Hollywood star, has the lead role in Over the Moon: a pretty country girl. A pre-Hollywood Rex Harrison is her country doctor love interest, while a gigantic windfall – an inheritance so humongous that it makes our heroine one of the richest women in the United Kingdom – just about wrecks the country couple’s relationship.\n\nMerle Oberon in ‘Lydia’: Hollywood has been using French cinema as inspiration for decades. Merle Oberon in ‘Lydia’: Hollywood has been using French cinema as inspiration for decades.\n\nForward to the past: ‘Lydia’ & ‘Til We Meet Again’\n\nThese days, it has become fashionable to bitch about Hollywood studio heads and filmmakers having lost their imagination, as they proceed to remake and reboot and readapt what has been done before. Needless to say, we all know that back in The Golden Age of the Hollywood studios, these things didn’t happen, did they?\n\nWarner Bros.’ ‘Til We Meet Again (1940) is the less well-received remake of the studio’s own One Way Passage (1932), a Tay Garnett-directed romance classic from an Oscar-winning Robert Lord story. In the original, Kay Francis starred as a doomed socialite and William Powell as a doomed criminal who meet and fall in love aboard an ocean liner.\n\nIn ‘Til We Meet Again, Merle Oberon – replacing Marlene Dietrich and a recalcitrant Miriam Hopkins (the latter at odds with both Jack Warner and Samuel Goldwyn) – has the old Kay Francis role. George Brent is her fellow star-crossed lover, while con man Frank McHugh reprises his One Way Passage comedy relief role. Edmund Goulding, who could be a solid actors’ director (e.g., Joan Crawford in Grand Hotel, Miriam Hopkins in The Old Maid), handled the proceedings.\n\nAs further evidence of Golden Age originality, Merle Oberon stars as a woman attempting to revive the passion of youth in Lydia (1941), the Hollywood reboot of Julien Duvivier’s 1937 classic Dance of Life / Un carnet de bal, which was based on a story by Ladislaus Bus-Fekete. Produced by Oberon’s then husband, Alexander Korda, and directed by Duvivier, Lydia also features Alan Marshall, Joseph Cotten, and George Reeves as three of the men in the title character’s past. The great-looking production reportedly had a not inconsiderable $1 million budget.\n\nMarie Bell starred in the generally better-regarded 1937 version, which has several elements in common with Leonard Merrick’s novel Conrad in Search of His Youth, pleasantly filmed as Conrad in Quest of His Youth by William C. de Mille in 1920, with Thomas Meighan as the titular character.\n\nMerle Oberon in That Uncertain Feeling, with Merle Oberon in That Uncertain Feeling, with Melvyn Douglas : Lubitsch Touch goes awry.\n\nThat Uncertain Feeling: ‘Inhibitionistic’ pianist\n\nBased on Victorien Sardou and Émile de Najac’s 1880 play Divorçons! (“Let’s Get a Divorce!”), That Uncertain Feeling (1941) is an uncertain Ernst Lubitsch comedy in which the director’s famous light Touch feels a tad heavier than usual. That’s quite a (puzzling) disappointment, considering that the screenplay is credited to a couple of quality Hollywood scribes: Donald Ogden Stewart (Dinner at Eight, Love Affair) and Walter Reisch (one of Lubitsch’s collaborators on Ninotchka).\n\nIn That Uncertain Feeling, Merle Oberon plays Melvyn Douglas’ insomniac, hiccuping wife, who discovers – or thinks she does – that she and her husband may not have been made for each other after all. That realization is the result of psychoanalysis sessions with, of all people, Alan Mowbray.\n\nA woefully miscast Burgess Meredith – best remembered these days as Sylvester Stallone’s trainer in the Rocky movies – plays another one of Dr. Mowbray’s patients: an artistically inhibitionistic pianist. Curiously, that would have been an ideal role for someone like … Melvyn Douglas (who had previously collaborated with Lubitsch on Angel and Ninotchka).\n\nMeredith, in fact, is a key problem in That Uncertain Feeling, which goes to show how casting is crucial for a movie’s success. And in all honesty, Oberon doesn’t fare that much better.\n\nFor the Golden Age reboot record, Ernst Lubitsch had previously filmed this farce back in 1925 – as (the now lost) Kiss Me Again. Marie Prevost and Monte Blue were the two leads.\n\nFirst Comes Courage: Anglo-Indian Norwegian resistance fighter\n\nFirst Comes Courage (1943) is notable as the last film handled by Dorothy Arzner (1897–1979), the only woman director working in Hollywood during the studio era. Also worth noting, Arzner remains the only known lesbian filmmaker to have succeeded in finding steady work in the American film industry, directing top talent (Esther Ralston, Clara Bow, Ruth Chatterton, Fredric March, Sylvia Sidney, Katharine Hepburn, Joan Crawford, Claudette Colbert, Clive Brook) in important studio releases (The Wild Party, Sarah and Son, Merrily We Go to Hell, Christopher Strong, The Bride Wore Red).\n\nLike most other Dorothy Arzner movies, First Comes Courage revolves around its female protagonist. Set in Nazi-occupied Norway, the film stars Merle Oberon as Norwegian underground agent Nicole Larsen who, despised by the local population, has an affair with a Nazi officer (Carl Esmond) so she can learn the enemy’s secrets. Brian Aherne is the British agent out to kill the high-ranking Nazi.\n\nSurely, the politically correct crowd won’t be offended by the olive-skinned, sloe-eyed, Bombay-born Oberon’s unethnical casting – even though had it been the other way around, they would just as surely have had a serious problem with what’s now referred to as “whitewashing.”\n\nEither way, that would have been a waste of outrage, for the part-British, part-Indian (and/or part-Sri Lankan) Oberon could easily pass for just about any ethnicity. Besides, only the mentally ill would be offended by such a minor detail in a story replete with absurdities – “shoddy romantic hokum,” in the words of the New York Times’ Theodore Strauss.\n\nMerle Oberon in A Song to Remember: George Sand in ‘male drag’ in this major box office hit. Merle Oberon in A Song to Remember: George Sand in ‘male drag’ in this major box office hit.\n\nAndrogynous Merle Oberon in A Song to Remember\n\nBut the “hokum” found in First Comes Courage feels like something out of Vittorio De Sica’s neo-realist Bicycle Thieves when compared to what you get to witness – in lush color (courtesy of Tony Gaudio and Allen M. Davey) – in Charles Vidor’s A Song to Remember (1945).\n\nEmbraced by audiences, Columbia Pictures’ 100 percent phony biopic of Frédéric Chopin starred an absurdly miscast (and Oscar nominated) Cornel Wilde as the Polish composer who sacrifices it all for his Fatherland. At his cutesiest, Paul Muni was equally miscast as Chopin’s mentor, Józef Elsner.\n\nFrom the first scene to the last, the cliché-ridden A Song to Remember is as appalling and as intriguing as a train wreck, but Merle Oberon, parading around in men’s attire, acquits herself shockingly well as George Sand – even though she looked nothing like the quite plain and quite androgynous Sand, née Amantine-Lucile-Aurore Dupin in Paris.\n\nDespite Oberon’s effectiveness in the role, it would be nice to have access to alternate universes where they show versions of this tale starring Greta Garbo and Marlene Dietrich as Sand; both actresses had at some time or other been considered for the role. (And Frank Capra had been slated to direct the project back in 1938.)\n\nA huge financial success, A Song to Remember was possibly the biggest box office hit of Oberon’s career. Think of it as the Straight Outta Compton of 1945.\n\nMerle Oberon: Actress as Empress – in this particular case, Joséphine de Beauharnais – in the big-budget historical drama Désirée. Merle Oberon: Actress as Empress – in this particular case, Joséphine de Beauharnais – in the big-budget historical drama Désirée.\n\nMerle Oberon as Empress Josephine in Désirée: First supporting role in two decades\n\nTurner Classic Movies’ Merle Oberon month comes to an end on March 25. The scheduled titles are: Désirée, Deep in My Heart, Hotel, Affectionately Yours, Berlin Express, and Night Song.\n\nOberon’s presence alone would suffice to make them all worth a look, but these films have other qualities to recommend them as well.\n\nDirected by Henry Koster, best remembered for his wildly popular Deanna Durbin musicals (e.g., Three Smart Girls, One Hundred Men and a Girl) and for the 1947 Academy Award-nominated fantasy comedy The Bishop’s Wife, the historical drama Désirée (1954) is a sumptuous production that, thanks to its big-name cast, became a major box office hit upon its release.\n\nYet Marlon Brando is laughably miscast as Napoleon Bonaparte, while the talented Jean Simmons is little more than a pretty face in the title role: the Corsican Conqueror’s one-time fiancée Désirée Clary, later Queen of Sweden and Norway – and, in real life, more of a Flora Robson type. But hey, that’s Hollywood; and audiences (then or now) surely couldn’t care less about facts or reality.\n\nIn a supporting role – her first non-lead since the early 1930s – Merle Oberon plays the Empress Joséphine de Beauharnais. And what a luminous screen presence.\n\nBesides Oberon, the real stars in Désirée are its production values: color cinematography by Milton Krasner; art direction/set decoration by Lyle Wheeler, Leland Fuller, Walter M. Scott, and Paul S. Fox; costume design by René Hubert and Charles LeMaire.\n\nAll-star box office hit Deep in My Heart\n\nReleased the same year as Désirée, Stanley Donen’s Deep in My Heart (1954) a solid box office performer, earning Metro-Goldwyn-Mayer $3.98 million in worldwide rentals (or approx. $76 million in 2016; it’s sizable budget, however, made it a money-loser).[2] But in terms of prestige, the all-star musical is hardly considered a Donen effort on a par with On the Town (1949, co-directed by Gene Kelly), Singin’ in the Rain (1952), or the 1954 Best Picture Oscar nominee Seven Brides for Seven Brothers.\n\nA lavish production about operetta composer Sigmund Romberg (played by José Ferrer), Deep in My Heart features Merle Oberon as Dorothy Donnelly, a Broadway star (Candida, Madame X) who collaborated with Romberg on the libretto for The Student Prince.\n\nOne of the musical’s highlights is Ann Miller singing and dancing not just a storm but a furious hurricane while performing Romberg, Oscar Hammerstein II, and Otto A. Harbach’s “It” from the 1926 operetta The Desert Song.\n\nMerle Oberon: Actress downgraded from empress in Désirée to duchess in Hotel. Merle Oberon: Actress downgraded from empress in Désirée to duchess in Hotel.\n\nHotel: Downgraded to duchess in Grand Hotel reboot of sorts\n\nBased on Arthur Hailey’s bestseller and set in a struggling New Orleans establishment, Richard Quine’s Hotel (1967) features a stellar cast that includes Rod Taylor, Catherine Spaak, Richard Conte, Michael Rennie, Kevin McCarthy, and Best Supporting Actor Oscar winners Melvyn Douglas (Hud, 1963; and later Being There, 1979) and Karl Malden (A Streetcar Named Desire, 1951).\n\nThirteen years after Désirée, Merle Oberon found herself downgraded from empress to duchess – a bejeweled, immaculately coiffed and attired one who has been involved (with husband Michael Rennie) in a hit-and-run road accident.\n\nAlthough this Grand Hotel reboot of sorts has its admirers, it failed to achieve the popularity and prestige of its Edmund Goulding-directed predecessor, one of Greta Garbo’s (and Joan Crawford’s) biggest hits and the winner of the 1931-32 Best Picture Academy Award. (An out-and-out remake was released in 1945, Robert Z. Leonard’s Week-End at the Waldorf.)\n\nThree years after Hotel, which turned out to be Merle Oberon’s final appearance in a major motion picture, the Hollywood/Arthur Hailey combo would hit the big time with George Seaton’s all-star near-disaster drama Airport.\n\nMerle Oberon in ‘Berlin Express’ with 1943 Best Actor Oscar winner Merle Oberon in ‘Berlin Express’ with 1943 Best Actor Oscar winner Paul Lukas (‘Watch on the Rhine’).\n\nMore Merle Oberon films\n\nCostarring Dennis Morgan and Rita Hayworth, Lloyd Bacon’s Affectionately Yours (1941) would probably have been a funnier light comedy had it been directed by Ernst Lubitsch, while Jacques Tourneur’s serious-minded spy thriller Berlin Express (1948) unfortunately doesn’t quite live up to expectations (Tourneur, Oberon, Robert Ryan, Paul Lukas).\n\nJohn Cromwell’s romantic melodrama Night Song (1947) – with shades of Magnificent Obsession – stars Merle Oberon as a socialite who pretends to be both blind and poor in order to gain the love and confidence of an embittered piano player (Dana Andrews), left blind after a car accident.\n\nReleased by RKO at a time of turmoil – Howard Hughes took over the studio that year – Night Song lost a reported $1.04 million (approx. $10.4 million in 2016).[3]\n\nLucien Ballard\n\nAlthough neither Berlin Express nor Night Song did anything to enhance Merle Oberon’s standing as either star or actress, both movies – along with three other titles – have a special place in her Hollywood career. They were shot by Lucien Ballard, Oberon’s husband from 1945–1949 and now best remembered for his collaborations with Sam Peckinpah (e.g., Ride the High Country, The Wild Bunch, Junior Bonner).\n\nThe couple were married the year after Ballard photographed Oberon in The Lodger. Their other two joint efforts were William Dieterle’s melodrama This Love of Ours (1945) and Irving Pichel’s period thriller Temptation (1946).\n\nFinal curtain call: ‘Interval’\n\nMerle Oberon’s final film appearance was in the little-seen, independently made Mexican-American co-production Interval (1973), a May-December romantic drama produced by Oberon herself, directed by veteran Daniel Mann (Come Back Little Sheba, The Rose Tattoo), and written by Gavin Lambert (The Roman Spring of Mrs. Stone, Inside Daisy Clover).\n\nOberon’s love interest was played by Dutch-born (sometime) actor Robert Wolders (Beau Geste, Tobruk), 25 years her junior and described at the time as a “protégé of Noël Coward.”\n\nAccording to a July 1973 report, prior to Interval she claimed to have turned down “50 scripts,” explaining, “I’d rather be a forgotten actress than become a freak on film.” She then added, “I considered myself passé – someone the world had passed by.”\n\nThat view changed somewhat when Hollywood powerhouse attorney Greg Bautzer sent her the Interval screenplay with a “must-read” note attached to it.\n\nBruno Pagliai\n\nDuring the making of Interval, Merle Oberon was in the process of divorcing Italian-born Mexican steel industrialist Bruno Pagliai. Their 16-year union came to an end the year the film was (briefly) released. Her take on the matter was the following:\n\nEverything I did made news and that, you see, wasn’t really allowed. That’s No. 1. Besides Pagliai was as busy as all high-powered, highly creative, goal-oriented husbands. There was little time for us to be together. At breakfast I’d ask if he thought I should star in a picture or decorate a house. He’d pick the latter, of course. It would keep me busy for a while. Then the same question would pop up again when boredom set in with a vengeance.\n\nIn the same interview, Oberon declared, “I don’t like to live alone. I like to be looked after by a man. I’m very feminine that way. And I’m always drawn to the qualities of kindness, tenderness and intelligence.”\n\nTwo years later, she married her tall, dark, and young Interval leading man.\n\nShah of Iran & Merle Oberon Acapulco connection\n\nIn spring 1979, Merle Oberon became world news after the deposed Shah of Iran, Mohammad Reza Pahlavi, found temporary refuge in Mexico following intervention from former U.S. secretary of state Henry Kissinger, who had close ties with the Iranian despot.\n\nOne of the wealthiest men on the planet and a moving target for Islamic revolutionaries, the shah had two “magnificent mansions” in Acapulco, one of which had been built for the Wuthering Heights and A Song to Remember actress during her marriage to Bruno Pagliai.\n\nAs explained in the Chicago Tribune, four years prior to the shah and Empress Farah’s arrival in Mexico – with 6½ tons of luggage “including much gold and silver” – his sister[4] had bought Pagliai and Oberon’s $2.5 million (approx. $11 million in 2016), three-bedroom Acapulco house, described as having been “made of giant glass bubbles for viewing Acapulco Bay.” Oberon herself called it a “choice ruby.”\n\nAs money was hardly an issue, the shah was spending $2 million to revamp the house.\n\nThe other Acapulco abode belonging to Pahlavi was a $3 million property above and next to the Oberon home, which, during the course of three years, had been “built into the side of a mountain.”\n\nAs it turned out, the shah ended up not staying at Oberon’s old place, renting instead a mansion in Cuernavaca during his Mexican sojourn.\n\nThe End\n\nIn late fall 1979, Merle Oberon was world news once again after suffering a massive stroke at her Malibu home. She died at age 68 on Nov. 23.\n\nFollowing Oberon’s death, Robert Wolders took up with another veteran Hollywood actress, Roman Holiday Oscar winner Audrey Hepburn. The couple would remain together until Hepburn’s death in 1993.\n\nWolders would later have his name linked to Henry Fonda’s widow, Shirlee Fonda, and to An American in Paris and Lili actress Leslie Caron. He turns 80 on Sept. 28, ’16.\n\nAlexander Korda died at age 62 on Jan. 23, 1956, in London. Lucien Ballard died at age 84 on Oct. 1, 1988. Bruno Pagliai died in 1983 in Mexico City.\n\n‘Straight Outta Bombay’\n\nNow, what’s the story behind Merle Oberon’s self-proclaimed Chinese-Tasmanian mother?\n\nHow much of Queenie, a novel by Alexander Korda’s nephew Michael Korda (also a 1987 miniseries starring Mia Sara), is based on fact?\n\nHow accurate is the biography Merle a.k.a. Princess Merle, co-written by the notoriously unreliable Charles Higham?\n\nConsidering the lives she led both on and off screen and how much of the information about her background and private affairs remains obscure, conflicting, and/or embellished or downright false, Merle Oberon would be a great subject for a scholarly, non-sensationalistic biography.\n\nSo, forget about an N.W.A./Dr. Dre/Ice Cube movie sequel. What we need is Straight Outta Bombay – an Oberon biopic faithful to the facts. And with Chopin music, to boot.\n\nMore Merle Oberon articles\n\nBelow are a couple of other Merle Oberon articles found at Alt Film Guide.\n\n‘Merle Oberon: From Mystery Past & Hollywood Stardom to Shah of Iran Connection’ notes\n\n[1] In decades past, the lack of hard documentation about Merle Oberon’s early years may have helped her to become increasingly younger with the passing of time. In some old sources, the ever youthful-looking actress’ birth date is listed as 1918.\n\nAdditionally, numerous sources list her birth name as Estelle Merle O’Brien Thompson.\n\nDeep in My Heart box office\n\n[2] Deep in My Heart box office figure according to online sources referencing the Eddie Mannix Ledger, found at the Academy of Motion Picture Arts and Sciences’ Margaret Herrick Library.\n\nThe 2016 approximation – to more accurately reflect the film’s popularity/ticket sales – was calculated according to the (however iffy) National Association of Theater Owners’ annual reporting on U.S. film ticket price averages.\n\nRentals refer to a film’s box office gross minus the exhibitors’ share. It’s unclear whether the Deep in My Heart figure includes only the domestic market.\n\n[3] Based on the U.S. Department of Labor’s inflation calculator.\n\n[4] According to a brief UPI report, in early 1979 the shah himself bought Merle Oberon’s Acapulco house for an undisclosed sum from her by then former husband Bruno Pagliai.\n\nHowever, the aforementioned July 1973 article (likely UPI or AP) states that Pagliai actually gave the Acapulco house to his soon-to-be ex-wife. “You know divorce doesn’t mean you stop loving the other person – and vice versa,” Oberon remarked at the time.\n\nInformation about Miriam Hopkins and ‘Til We Meet Again via Allan Ellenberger’s in-the-works Hopkins biography.\n\nMerle Oberon quotes related to Interval, Bruno Pagliai, and the Acapulco house via The Salina [Kansas] Journal.\n\nMelvyn Douglas and Merle Oberon That Uncertain Feeling image: United Artists.\n\nImage of A Song to Remember with Merle Oberon as George Sand: Columbia Pictures, via Doctor Macro.\n\nMerle Oberon Lydia image: United Artists.\n\nImage of Merle Oberon as Empress Josephine in Désirée: 20th Century Fox.\n\nPaul Lukas and Merle Oberon Berlin Express image: RKO, via notrecinema.com.\n\nMerle Oberon Hotel image: Warner Bros."}, {"url": "https://www.nytimes.com/1979/11/24/archives/merle-oberon-68-star-of-films-including-wuthering-heights-liked.html", "page_content": "When the film opened in 1939, Frank S. Nugent of The New York Times, wrote:\n\n“So Mr. Olivier has played Heathcliff, and Miss Oberon, as Cathy, has matched the brilliance of his characterization with hers. She has perfectly caught the restless, changeling spirit of the Brontë heroine who knew she was not meant for heaven and broke her heart and Heathcliff's in the synthetic paradise of her marriage with gentle Edgar Linton.”\n\nAlso in the movie were David Niven as Linton and Geraldine Fitzgerald.\n\nLiked ‘Healthy’ Things\n\nMiss Oberon's career was a record of persistence, ingenuity, hard work and good luck, and she retained her smooth, youthful looks better than many another film star of her generation. “Luckily, I like all the things that are healthy,” she once said, “like exercise, rest, sensible food, no alcoholic drinks, unless a sip of wine, and no cigarettes.”\n\nMiss Oberon was born Estelle Merle 0'Brien Thompson on Feb. 19, 1911, on the island of Tasmania, near Australia, the daughter of a British Army major who died just before her birth. She grew up in Bombay and Calcutta, studying French and Hindustani along with the traditional subjects, and danced at the Calcutta Amateur Theatrical Society.\n\nWhen she was 16, an uncle, also a British officer, took her for a visit to London, where she enrolled in dancing school and decided to stay. She took a job as a dance hostess at the Café de Paris even though she considered it much beneath her, the product of the highly snobbish British Army presence in India. But the job came with free dinners, and that became the deciding factor.\n\nEven then, Miss Oberon, known as Queenie Thompson, was noted for her beauty. Her first screen test nevertheless ended in disaster, but she soon found herself playing bit parts after a second one turned out better."}, {"url": "https://archive.org/details/the-bishops-wife-1947-christmas-classic", "page_content": "Plot : A debonair angel comes to Earth to help an Episcopalian bishop and his wife in their quest to raise money for the new church.\n\nStoryline : An Episcopal Bishop, Henry Brougham, has been working for months on the plans for an elaborate new cathedral which he hopes will be paid for primarily by a wealthy, stubborn widow. He is losing sight of his family and of why he became a churchman in the first place. Enter Dudley, an angel sent to help him. Dudley does help everyone he meets, but not necessarily in the way they would have preferred. With the exception of Henry, everyone loves him, but Henry begins to believe that Dudley is there to replace him, both at work and in his family's affections, as Christmas approaches. --IMDb (by John Vogel)\n\n\n\n\n\nIMDb User Review:\n\n\n\nA Masterpiece ( Feb. 05, 2007 by leboeufs ):\n\nThis is an incredibly wonderful movie which ranks right up there with Casablanca in my eyes and has been sorely under-appreciated by the usually astute IMDb voters. This is Cary Grant's best performance. He is impeccable as an angel who falls in love with an earthling but continues to perform his duties anyway. He gets it all right. Cary Grant is an angel. He was originally cast as the Bishop but demanded to be given the role of the angel instead.\n\n\n\n\n\nThis movie is a joy to watch as it shows the power of transformation and the power of the human spirit. I particularly appreciated how Cary demonstrates the humanity of people at all levels of society from the top to the bottom. This is truly a movie for the ages.\n\n\n\n\n\nMore reviews of this movie : https://www.imdb.com/title/tt0039190/reviews?ref_=tt_urv\n\n\n\n\n\n\n\n**The non-profit streaming of the commercial free, quality films I have uploaded to archive.org, are for educational purposes only. I have uploaded each movie for posterity, with the hope that all present and future generations will learn from and enjoy them, as much as I have. I own zero rights to this film nor any other I have uploaded, and have no wish to infringe on existing copyright laws. DEF gp ddh**\n\n"}]}