{"Merle Oberon's later years were marred by personal problems and illness.": [{"url": "https://www.britannica.com/biography/Merle-Oberon", "page_content": "Merle Oberon, (born February 19, 1911, Bombay [now Mumbai], India—died November 23, 1979, Los Angeles, California, U.S.), British and American film actress who appeared in more than 30 motion pictures. Her most notable portrayal was that of the beautiful Cathy, who tormented and rejected Heathcliff (Laurence Olivier) in the 1939 classic Wuthering Heights.\n\nThe daughter of an Indian mother and a British army officer, Arthur Thompson, stationed in India, she was christened Estelle Merle. Moving to England, she played bit parts on stage and in films until she was discovered by the producer Alexander Korda, whose protégée and wife she became. Early in her career she created a fictional autobiography, claiming to have been born in Tasmania of Irish, French, and Dutch descent and christened Estelle Merle O’Brien Thompson.\n\nBritannica Quiz Hollywood Films in the 1930s Quiz\n\nWorking in both England and Hollywood, she achieved stardom as a hauntingly beautiful dark-eyed woman of grace and spirit. She first starred as Anne Boleyn in The Private Life of Henry VIII (1933), opposite Charles Laughton. She played opposite Douglas Fairbanks, Sr., in The Private Life of Don Juan (1934), Leslie Howard in The Scarlet Pimpernel (1934), and Maurice Chevalier in Folies Bergère (1935). She was cast as George Sand in the movie A Song to Remember (1945) and Napoleon’s Josephine in Désirée (1954). Her last screen appearances were in Hotel (1967) and Interval (1973)."}, {"url": "https://www.nfsa.gov.au/latest/merle-oberon-lost-tasmanian", "page_content": "Numerous portraits in the NFSA’s Taussig film stills collection capture the early career of glamorous Hollywood star, Merle Oberon (19 February 1911 – 23 November 1979). Ever mysterious, stunningly beautiful and with an air of the exotic, that quality of mystery carried over from her film persona to the question of her origins.\n\nhttps://www.nfsa.gov.au/sites/default/files/02-2018/760686.jpg Merle Oberon as Anne Boleyn inThe Private Life of Henry VIII, 1933. From the Taussig film stills collection. NFSA title: 760686\n\nThe Private Life of Merle Oberon\n\nMerle Oberon was a star of British and Hollywood films in the 1930s and 40s. She rose to fame with roles opposite Charles Laughton in The Private Life of Henry VIII (Alexander Korda, UK, 1933), Douglas Fairbanks in The Private Life of Don Juan (Alexander Korda, UK, 1934) and Laurence Olivier in Wuthering Heights (William Wyler, USA, 1939).\n\nShe also received an Academy Award nomination for Best Actress for The Dark Angel (Sidney Franklin, USA, 1935).\n\nThroughout her early press tours, Oberon attributed her success to her humble Tasmanian birthplace and touted her Australian origins with pride. In a 1934 interview with Coralee Clarke Rees in The West Australian (‘Australian-born Film Star's Rise to Fame’), Oberon further detailed her biographical connections.\n\nShe said, ‘I was born in Tasmania but left there when I was a child ... Since my films have been circulated, several people in odd parts of Australia have bobbed up to claim me as a relation … I don’t know very much about them because my family quarrelled with them some time ago.'\n\nOberon adamantly repeated various tales of her Australian beginnings until her death in 1979. It was only later that Oberon’s Australian heritage was exposed as studio publicity fiction."}, {"url": "https://www.vanityfair.com/hollywood/2017/07/last-tycoon-jennifer-beals-merle-oberon", "page_content": "If you know your Old Hollywood history, several characters in Amazon’s new series The Last Tycoon—based on F. Scott Fitzgerald’s unfinished novel—will look familiar. Matt Bomer plays a wunderkind producer based on MGM production head Irving Thalberg. Kelsey Grammer plays his boss, a figure inspired by Louis B. Mayer. But the most fascinating character may be Margo Taft, an actress played by Jennifer Beals who’s concealing an explosive secret. The character is based on Merle Oberon, a golden-age movie star who was known for her great beauty—and the similar secret she took with her to the grave.\n\nThe raven-haired, brown-eyed stunner, probably best known for playing Cathy opposite Laurence Olivier’s Heathcliff in the 1939 classic Wuthering Heights, spent her life hiding her biracial identity, “passing” for white. Like Oberon, Margo likely fears that the truth about her heritage will torpedo her career during a time when racial prejudice was rampant, and silver-screen faces were lily-white, save for a black servant or two.\n\nOberon’s career took off after a move to London at age 17, when English director Alexander Korda cast her in a small but pivotal role as Anne Boleyn in The Private Life of Henry VIII in 1933. The film’s success led to leading-lady status, and films including The Scarlet Pimpernel, The Dark Angel—for which she was Oscar-nominated—That Uncertain Feeling, and A Song to Remember.\n\nBut it was Oberon’s personal story that was worthy of a Hollywood script. The actress, known more for her striking looks—often described as “exotic”—than her acting abilities, claimed she was born in Tasmania (like her contemporary Errol Flynn). She said that after her British Army officer father died, she was raised by her aristocratic Indian godparents. It’s believed Korda, who became the first of Oberon’s four husbands, concocted the fake origin story.\n\nNicknamed “Queenie” in honor of King George V and Queen Mary’s 1911 visit to India the year she was born in the city now known as Mumbai, Estelle Merle O’Brien Thompson’s true provenance wasn’t revealed until four years after her death in 1979. The biography Merle: A Biography of Merle Oberon exposed what seems to have been known by those in her inner circle: Oberon was Anglo-Indian. Her mother—or the woman believed to be her mother (more about that later)—came from what’s now Sri Lanka, and was part Māori; her father, Arthur Thompson, was a British mechanical engineer. Ironically, the regal actress—she became “Lady Korda” when her first husband was knighted in 1942—had an impoverished childhood in India.\n\nIn 1985, her nephew Michael Korda, then editor in chief of Simon & Schuster, penned the roman à clef Queenie about his aunt, and told The Los Angeles Times that her Eurasian ancestry “was an open secret” within his family. He also said that when he wrote a 1979 family memoir, Oberon threatened to sue him for including her real name and birthplace, so he had to obscure them.\n\nIn The Last Tycoon, which premieres July 28, Beals’s Margo negotiates her own deals and rides roughshod over directors, demanding they show her their genitals before she’ll shoot a frame of film. She also has a secret: she’s passing for white—with her black mother by her side, masquerading as her maid—much as Oberon’s mother, Charlotte Selby, did when the actress lived in England.\n\nWhile Beals knew Margo was based on Oberon, she says her goal for her character, who wears “layers of masks,” was to make her distinct. Yet her interpretation of the fiercely independent actress may also offer insight into Oberon’s own mindset. “Margo is willing to suppress so much in order to get as far as she can,” says Beals. Oberon was just as tenacious: after a 1937 car accident damaged one side of her face, she hid her scars with makeup and good lighting. Then, on the set of the 1944 filmThe Lodger, cinematographer Lucien Ballard mounted a light on the side of a camera, which diffused her flaws. The “Obie,” as the device became known, went into wide use—and Oberon left Korda to marry Ballard in 1945."}, {"url": "https://factsverse.com/how-merle-oberon-hid-her-facial-scars-after-the-tragic-accident/", "page_content": "Merle Oberon a Golden Age actress best known for her roles in such 1930s classics as Wuthering Heights, The Scarlet Pimpernel, and The Private Life of Henry VIII. While Merle was an acclaimed actress during her time, she took many secrets with her to her grave. One of these secrets was her Indian heritage, which she hid from the public to avoid racial discrimination. Another one of these secrets the fact that Merle’s face was scarred as a result of a tragic car accident midway through her career. Join Facts Verse as we take a look at how Merle Oberon hid her facial scars after the tragic accident.\n\nMerle Oberon Had a Dark Secret\n\nMerle Oberon a Golden Age actress that, for a time, considered one of the most beautiful actresses in all of Hollywood. However, there were several secrets that Merle was hiding from the general public that may have swayed this public opinion. Merle was born in 1911, and the circumstances of her birth remained largely unknown throughout most of the actress’s life. The real life story of the actress not revealed to the public until several years after her death. The two biggest secrets that Merle kept from the public during her lifetime were her Indian heritage. And the fact that she had numerous scars on her face from a tragic accident that occurred halfway through her career.\n\nIn her career, one of Merle’s most prominent roles that of the character of Catchy in the 1939 Hollywood adaptation of Wuthering Heights. This one of numerous film roles that saw the Indian actress successfully pass as white in the eyes of both the entertainment industry and the audience. There was a good reason that Merle hid her Indian heritage, and it wasn’t because she was ashamed of it. The actress simply aware that there’s no room in Hollywood at the time for anyone with a non-white background.\n\nIt wasn’t all that hard for Merle Oberon to pass as white. Specifically in the days when there wasn’t any color on the screen. The actress did look white. But those who knew about her Indian heritage would able to notice some of the actress’s more distinct features. Merle’s mother had been Indian, while her father had been British. The race of her mother wasn’t the only secret about Merle’s birth that was hid from the public over the course of the actress’s life. Join Facts Verse as we take a look at how Merle Oberon hid her facial scars after the tragic accident.\n\nMerle Became an Actress as a Teenager\n\nMerle set her sights on performing during her teenage years, and moved to London at the age of only 17. It was there that she found by a British director by the name of Alexander Korda, who would go on to cast Merle in her first big film. Not only that, but Alexander would also go on to become Merle’s first husband. The film that Alexander cast Merle in The Private Life of Henry VIII, which released in 1933. The film proved a success, and showed that Merle Oberon had potential as Hollywood’s newest leading lady.\n\nFollowing her appearance in The Private Life of Henry VIII, Merle could seen in such features as The Scarlet Pimpernel and The Dark Angel. The latter picture saw Merle receive a much-deserved Academy Award nomination. Which was the only nomination that she received over the course of her lifetime. Another notable pictures that Merle appeared in over the course of her early career included A Song to Remember and That Uncertain Feeling.\n\nIt has been said that director Alexander Korda’s the one who helped Merle Oberon concoct the story that would hide her true racial heritage from the public. The story went that she was born in Tasmania to British parents who passed away. Leaving her to be raised by wealthy Indian godparents. This story proved palatable amongst the actress’s fans, and few ever questioned the truth of it. However, the Indian heritage of her mother wasn’t the only thing about Merle’s origin that the public wasn’t aware of. In fact, there was something about her birth that Merle herself wasn’t aware of throughout most of her life. And that was the true identity of her mother.\n\nBesides Merle’s Indian heritage, the other fact about Merle’s birth that obscured from the public throughout the actress’s life was the fact that her mother was only 12 years old when she was born. It’s also uncertain whether or not the man that Merle believed was her father was actually her father, though he could’ve been. The woman who listed on Merle’s birth certificate was actually the actress’s grandmother, who was 26 years old at the time of Merle’s birth.\n\nThis means that Merle’s grandmother had her mother when she herself was only 14 years old. Proving that women in this family liked to have kid at a pretty young age! Merle wouldn’t find out about the true identity of her mother until later in her life. If you’re enjoying this video so far, be sure to hit the like button to show your support! Join Facts Verse as we take a look at how Merle Oberon hid her facial scars after the tragic accident. Also, subscribe to the channel if you’d like to be among the first to know when more Facts Verse videos are on their way!\n\nMerle Scared of the Truth\n\nMerle Oberon grew up believing that her mother was her sister, and that a man who perhaps a random stranger had been her father. The man that Merle believed was her father died when Merle was still young. Which left her and her supposed aunt and mother to fend for themselves as an impoverished and broken family unit in India. When Merle was born, her family felt that the future actress’s mother was too young. And they didn’t want to garner any controversy. This is why they chose to list Merle’s grandmother as the mother on the young girl’s birth certificate. It wouldn’t be until way later in Merle’s life that the actress learned the truth.\n\nMerle’s true mother went on to have more kids after she was born, and it was one of these kids that later spilled the beans to Merle the truth about her birth. These kids grew up thinking that Merle was their aunt. And they were shocked to learn that she was actually their sister. Merle was similarly shocked to learn the truth. And likely remained in denial about it until her death. Those the truth was revealed to Merle by her stepsibling. Merle refused to see said stepsibling and kept them at a distance for the rest of her life. It’s unclear if Merle was unwilling to learn the truth about her birth, or if she just didn’t care after a lifetime of keeping so much about her personal life a secret.\n\nMerle Oberon’s first hit films were all British. Though the actress went on to receive greater fame when she came overseas and made a name for herself in Hollywood proper. Merle came to Hollywood at the age of 24. And she subsequently given a contract with producer Samuel Goldwyn. Samuel Goldwyn cast the actress in the film The Dark Angel, which netted her the aforementioned Academy Award nomination. The actress had certainly come a long way to get where she was. And her obscured heritage made her the first Indian actress to be nominated for an Academy Award. After the aforementioned death of the man that she believed her father, Merle lived a life of poverty and hardship before finally striking it big as a Hollywood star. Join Facts Verse as we take a look at how Merle Oberon hid her facial scars after the tragic accident.\n\nAlexander Korda Was the First of Merle’s Husbands\n\nDespite Merle not being born into the nicest situation. The young girl tried her hardest in school and was able to receive a nice scholarship to a private academy. This ended up being a fairly miserable experience for Merle. However, as the kids at the school bullied Merle about both her mixed heritage and her dead father. Merle eventually decided to drop out and be homeschooled by the woman she still believed to be her mother. But who actually her grandmother. Merle got into acting thanks to a British man by the name of Ben Finney. Ben was originally Merle’s boyfriend, though he broke up with her once he realized that her mom was Indian. Still, the two remained friends, and it was through Ben’s connection that Merle first started getting work as an actress. Once Merle got in touch with the aforementioned Alexander Korda, the rest was history!\n\nAlexander Korda was the first of four spouses that Merle had over the course of her lifetime. The two married from 1939 to 1945, though they had an on-and-off-again relationship for many years prior to finally tying the knot. Following her divorce from Alexander, Merle married a cinematographer by the name of Lucien Ballard. Lucien Ballard helped Merle hide yet another secret that she kept from the public over the course of her lifetime. This secret was that the actress’s face scared during a tragic car accident.\n\nAfter Merle’s face scarred in a tragic car accident during the mid-1930s, the actress thought she was never going to work again. However, cinematographer Lucien Ballard ended up inventing a special light just for Merle that made her scars barely visible to the camera. Merle so impressed by Lucien’s work that she divorced her first husband and married him instead. However, Merle and Lucien’s marriage was even shorter than the actress’s first one. After tying the knot in 1945, the two divorced in 1949.\n\nMerle then married two more times before her 1979 death. Merle’s third husband was an Italian businessman by the name of Bruno Pagliai that she attempted to start an adopted family with. This marriage lasted from 1957 to 1973, making it the longest marriage of Merle’s life. Join Facts Verse as we take a look at how Merle Oberon hid her facial scars after the tragic accident.\n\nMerle’s final husband actor Robert Wolders, and they married from 1975 until Merle’s death from a stroke in 1979. Following Merle’s death, Robert went on to marry Audrey Hepburn. Besides her four husbands, Merle was also romantically linked to John Wayne during her lifetime.\n\nMerle Oberon considered one of the most beautiful actresses of Hollywood’s Golden Age. But the actress’s fame came at the cost of her own identity. Now it’s time to hear from you: did you know that Golden Age actress Merle Oberon had an affair with John Wayne. And that she hid her Indian heritage from the public? As always, like this video to show your support, and subscribe and hit the notification bell if you’d like to be among the first to know when more Facts Verse videos are on their way!"}, {"url": "https://www.factinate.com/people/facts-merle-oberon/", "page_content": "Heartbreak. Struggle. Love affairs. And a dark secret that she tried to hide until the day she died. In her time on Earth, starlet Merle Oberon lived a thousand lives. Her devastating beauty propelled her to stardom, but the scandalous circumstances of her birth haunted her throughout her life. It was only after her death that her truth was finally exposed.\n\nThe striking beauty never let anyone else tell her what to do—so find your best light for these 42 facts about Merle Oberon.\n\nMerle Oberon Facts\n\n1. Murky Origins\n\nAdvertisement\n\nMerle Oberon’s affairs and relationships might have set Hollywood a titter during her adult life, but the starlet was quite literally born into scandal as well. While Oberon’s birth certificate lists Arthur Terrence O’Brien Thompson and Charlotte Selby as her parents, in reality, the truth was so much stranger and darker.\n\n2. Great on Paper…\n\nMerle Oberon was born Estelle Merle O’Brien Thompson in 1911 in Bombay, British India—what we know today as Mumbai, India. Oberon’s father, Arthur Thompson, was a British mechanical engineer who worked for Indian Railways. Oberon’s mother, Charlotte Selby, was from Ceylon—now known as Sri Lanka—and was of mixed ancestry, including some Maori roots.\n\n3. Seeing Double\n\nOberon’s birth certificate hid a twisted secret—Charlotte Selby, the woman listed as her mother, was actually her grandmother. Charlotte’s 12-year-old daughter Constance was Oberon’s real mother, and the starlet’s real father is unknown to this day. In order to avoid prevent public embarrassment, Charlotte put her own name on the birth certificate. Oberon was raised to believe that she was Constance’s sister.\n\n4. Corrupted Youth\n\nHow did Charlotte Selby pass a baby off as her own when she already had a 12-year-old daughter? Even though you might think that Charlotte would have been to old to pull off the lie, you’d be wrong. Charlotte herself had been an incredibly young mother, giving birth to Constance at just 14 years of age. When Oberon was born, Charlotte became a secret grandmother at only 26. Yikes.\n\nAdvertisement\n\n5. The Road to Hollywood\n\nAfter appearing in a number of British films, Merle Oberon became Hollywood royalty nearly overnight thanks to a contract with legendary producer Samuel Goldwyn. She was just 24 when she appeared in the hit film The Dark Angel. Not only did Dark Angel launch Oberon’s career, it also sky-rocketed her into cinema history. She netted an Oscar nomination for Best Actress.\n\n6. Cries & Whispers\n\nYoung Merle was just three years old when the man she thought was her father, Arthur Thompson, died during WWI. He perished on the Western Front at the Battle of the Somme—but he didn’t die in combat. Instead, pneumonia took his life in 1914.\n\n7. So Much To Mourn\n\nThompson’s death left Charlotte, Constance, and Merle alone and impoverished in Bombay—until 1917, when it finally looked like their lives were turning around. They moved to Calcutta where Oberon received a scholarship to attend one of the finest private schools in the city. It should’ve been a step toward a better life, but it was the beginning of a nightmare.\n\n8. Kids Can Be So Cruel\n\nOberon was relentlessly bullied at La Martiniere Calcutta School for Girls. They targeted her home life—she had no father anymore, and her single mother was poor and a woman of color. Kids always seem to know what will cut the deepest.\n\n9. Breaking Point\n\nThese early years should’ve been some of the happiest of Oberon’s life, but the bullying became so bad that she couldn’t bear to attend the private school any longer. Oberon dropped out of school and begin home-schooling with her mother. Despite these setbacks, this difficult time had one enormous silver lining: This was when Oberon fell in love with performing.\n\nSign up to our newsletter. History’s most fascinating stories and darkest secrets, delivered to your inbox daily. Making distraction rewarding since 2017.\n\n10. The Little Queen\n\nAs a girl and into her teen years, Oberon went by the nickname “Queenie.” She was given it at birth, since her arrival on this planet coincided with Queen Mary’s and King George V’s 1911 visit to India.\n\nAdvertisement\n\n11. Mixed Bag\n\nWhen Oberon was just 18 years old, she met a former actor named Colonel Ben Finney at a local restaurant and began dating him—but he would soon deal her a savage betrayal. When Finney went to visit Oberon’s home and meet her mother for the first time, he broke up with her. The reason? Oberon’s mother was a woman of color.\n\n12. I’ve Got Friends in High Places\n\nDespite this heinous rejection, Oberon stayed in contact with Finney. Turns out that this was definitely a good move for the aspiring actress. Finney knew the Irish director Rex Ingram, who was working out of a French film studio at the time. Finney suggested that Oberon go to France to meet the director and jumpstart her film career. It was a gamble, but it paid off in a big way.\n\n13. Baby Steps\n\nOberon and her mother packed their bags and headed to France. They expected to immediately meet Ingram, only for him to avoid them. Thankfully, he came around, hiring Oberon as an extra in a party scene for the film The Three Passions. However, it was hardly the overnight success of a young actress’ dreams. Between 1928 and 1932, all Oberon’s parts in films were uncredited.\n\n14. Mythmaking\n\nLater in life, Oberon looked back on this time and remarked that she only began acting because she couldn’t “dance or sing or write or paint.” In her own opinion, Oberon only had one thing to rely on: her extraordinarily beautiful face. Considering that she had moved to France specifically to meet a producer, this might have been an embellishment on her part.\n\n15. Total Package\n\nWhen Oberon met director and producer Alexander Korda, he gave her the world. Not only did the pair fall in love, but he cast her as Anne Boleyn in his 1932 film The Private Life of Henry VIII. Oberon co-starred with Hollywood heavyweights like Charles Laughton in the role of Henry VIII and Elsa Lanchester—the Bride of Frankenstein herself—as Anne of Cleves.\n\n16. High and Low\n\nMargo Taft, a character in F. Scott Fitzgerald’s unfinished final novel The Last Tycoon, was reportedly based on Oberon. That’s the high. As for the low? Her ex-husband’s son, Michael Korda, also wrote a roman à clef about her titled Queenie, which was made into a miniseries in 1987. It was criticized for being trashy and for its racial insensitivity.\n\nAdvertisement\n\n17. Mixing Business With Pleasure\n\nOberon maintained a working and (on-and-off) romantic relationship with Hollywood big wig Alexander Korda for years. While she had a contract with Korda, her success made her an in-demand property. In a strategic move, Korda sold some of the “shares” of her name to Samuel Goldwyn, the legendary Hollywood studio executive.\n\n18. Birth of the Dark Angel\n\nIt was Goldwyn who put Merle Oberon in the film The Dark Angel in 1935, about two male friends for vie for the heart of one woman. For this film, Oberon would get her sole Oscar nomination in the revered Best Actress category.\n\n19. All Work and No Play…\n\nWhile in Hollywood, Oberon fell desperately in love with actor David Niven, with the two even becoming engaged. Overjoyed, Oberon announced that the pair were going to wed, but sadly, Niven would end up leaving her with a broken heart. After numerous affairs, Niven refused to change his ways and walk down the aisle. The couple parted.\n\n20. The Greats\n\nAside from her role as Anne Boleyn, Oberon portrayed a number of famous historical figures on film, including Empress Josephine, the woman who broke Napoleon’s heart, and the writer and cross-dressing playwright George Sand.\n\n21. When It Comes Crashing Down\n\nOberon was supposed to work with both Korda and Charles Laughton again in 1937’s I, Claudius, where she’d appear as Claudius’s wife Messalina, but the project was abruptly abandoned for an incredibly dark reason. After a terrible car accident, Oberon was far too injured, and some would say disfigured, to film anything.\n\n22. Trauma Bonding\n\nWhile I, Claudius may have been canceled, Oberon and film exec Alexander Korda weren’t. The couple finally cemented their on-and-off relationship by tying the knot in 1939.\n\nAdvertisement\n\n23. A Friend in Need\n\nWho could Oberon turn to in this trying time? Her beloved husband, of course. Korda paid for his wife to go to New York City and receive first-rate cosmetic procedures that would help fix her damaged skin. They helped—and stage makeup was able to do the rest—but sadly, nothing could ever heal Oberon’s scarred face completely.\n\n24. Everyone Heals Differently\n\nOberon’s own experiences with disfigurement were, in a strange way, part of what led her to find love. In 1941, while she was still married to Korda, Oberon struck up a relationship with young Richard Hillary, a RAF fighter pilot. During his valiant actions at the Battle of Britain, Hillary sustained terrible burns that disfigured his face and deformed his hands into claws. Tragically, he died at just 23 years old.\n\n25. Giddy Up, Cowboy\n\nOberon’s affair with Hillary wasn’t her only infidelity. She also had an on-again off-again relationship with none other than John Wayne, classic Western star, between 1938 and 1947.\n\n26. Rags to Riches\n\nBefore Grace Kelly ever became a princess, Oberon fulfilled an unbelievable rags-to-riches dream. In 1942, her husband Alexander Korda was knighted thanks to his part in the war effort. This honor transformed Merle Oberon, Hollywood star, into “Lady Korda,” esteemed aristocrat—but not even a fancy title could tie a lady like Merle down.\n\n27. Find Your Light\n\nWho’s an actor’s best friend—other than their makeup artist? Whoever’s in charge of her lighting, of course. In 1944, cinematographer Lucien Ballard put together a small light that could be mounted on his camera specifically for Oberon. It provided an effect that washed away any blemishes or scars. Now known as a catch light, it was originally nicknamed the “Obie light” after, of course, Oberon.\n\n28. The Next Big Thing\n\nLucien Ballard sounds like a pretty devoted cinematographer, huh? Well, there may have been another reason for his intense involvement in inventing the famed Obie light. In 1945, Oberon divorced her longtime partner Korda and married her beloved cinematographer Lucien Ballard. Sadly, they were doomed to a sad end. The use of the light outlasted their relationship—they divorced in 1949.\n\n29. More Than a Mother\n\nIn 1937, Oberon lost her “mother,” Charlotte Selby, who (as we know) was actually her grandmother. By this time, Oberon was in the dark secret of her parentage (more on that below), but that doesn’t mean that she didn’t mourn the loss. In an utterly heartbreaking gesture, Oberon had portraits painted of Charlotte. She hung them in each of her homes.\n\n30. Hidden Heritage\n\nDue to how young her mother was when she was born, and her Indian heritage, Merle Oberon spent most of her life obscuring the circumstances of her birth. It was only later in her life that all her lies began to unravel.\n\n31. Milestones\n\nWhile Oberon hid the fact that she was born in India—likely due to the rampant racism in Hollywood at the time—it actually means that she has two unique distinctions. Not only was she first woman of Asian descent to be nominated for the Best Actress Oscar, she was the first Asian nominated for any Academy Award.\n\n32. So Happy Together\n\nAfter her first two (relatively) short marriages to Korda and Ballard, Oberon finally found love and built a family with Italian businessman Bruno Pagliai. They moved to Cuernavaca, Mexico, about 90 minutes south of Mexico City, and adopted two children. The starlet continued to make films during these years, but at a much slower rate.\n\n33. The Tasmanian Liar\n\nThe story that Oberon generally told about her birth was that she was born and raised in Tasmania, Australia. If pressed for details, she would demur by claiming that her birth records had been destroyed. As the years wore on, more and more people began to question her cover story—including the press, and even some members of her own family.\n\n34. Caught in a Lie Part I\n\nOberon visited Australia in 1965, and despite all her Hollywood training, she didn’t exactly react in the most inconspicuous manner. When the press asked questions about her early life in Australia, Oberon would become nervous. Whether it was feigned or not, she became sick before her planned visit to Hobart, Tasmania, and flew back to Mexico immediately.\n\n35. Caught in a Lie Part II\n\nIn 1978, Oberon actually did visit Hobart, and a ceremony was planned to honor their native daughter—and it couldn’t have been more of a disaster. First, the mayor found out that she wasn’t actually Australian, but it was too late to cancel the gala. He was ready to cover for her—but then Oberon’s bizarre behavior caused the whole thing to unravel.\n\n36. Web of Lies\n\nWhen she got to the party, Oberon began to deny that she’d been born in Tasmania at all. Instead, she made up a convoluted story about spending some years on the island after her father fell ill. Once again, perhaps realizing that she was in a tailspin of deception, Oberon panicked, said that she was sick, and left. The press hounded her, but she refused to answer any more questions.\n\n37. Hollywood Boy Toy\n\nDid we mention it was hard to tie Oberon down? After 15 years of marriage to Pagliai, she left him for a handsome Dutch actor that she met while making her final film, Interval. The relationship raised some eyebrows—the actor, Robert Wolders, was 25 years younger than Oberon. Later in life, he was Audrey Hepburn’s longtime partner.\n\n38. Latest Love, Last Love\n\nOberon married Wolders in 1975 and stayed with him until her death in 1979. She died of a stroke at 68 years old.\n\n39. Some Scars Heal, Others Don’t\n\nWhile Oberon sustained serious injuries from the 1937 car crash, she was able to return to the screen the next year—but soon enough, her worst nightmare would come true. In 1940, she found herself scarred from a combined “cosmetic poisoning” and an allergic reaction to a prescription drug. For a woman who told the press that her face launched her career, it must have been devastating.\n\n40. Let Sleeping Dogs Lie\n\nOberon’s mixed Indian background had long been a badly-kept secret in Hollywood, but in the final years of Oberon’s life, one of her family members worked to expose the truth about her parentage. After Oberon’s birth, her biological mother, Constance, went on to marry and have four legitimate children. All were told that Oberon was their aunt, despite the fact that she was actually their half-sister. For one of the kids, that answer wasn’t good enough.\n\n41. Skeletons in the Closet\n\nIt was one of these half-siblings, Harry Selby, who found Oberon’s real birth certificate in Bombay. It contained a jaw-dropping revelation: Oberon wasn’t his aunt. She was his half-sister. After this discovery, Oberon dealt her own brother a heartbreaking betrayal. She refused to see him. He must have understood her wishes, because he didn’t discuss the truth of her parentage until 2002, when he participated in a documentary about Oberon.\n\n42. Breaking Out and Breaking Up\n\nMerle Oberon appeared in multiple films in 1934, and landed the lead role in an adaptation of The Scarlet Pimpernel—but behind the scenes, she hid a dark secret. While making the film, she had an affair with her co-star, the handsome British actor (and, depending on who you ask, secret agent) Leslie Howard.\n\nSources: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10"}, {"url": "https://news.amomama.com/204299-screen-goddess-merle-oberon-spent-her-en.html", "page_content": "Getty images\n\nScreen goddess Merle Oberon's exotic beauty seduced Hollywood but hid a secret she feared would ruin her future.\n\nAdvertisement\n\nActress Merle Oberon spent her entire life hiding away her biracial heritage in fear that discrimination would end her movie career. The stunning alabaster-skinned beauty was half Indian, a heritage she hid from the world at all costs.\n\nOberon went on to become one of the greatest movie stars of the era, and an Academy Award-nominated actress, but do so she rewrote her past and spurned all contact with her family, her identity, and her past.\n\nMerle Oberon in RKO's 1948 movie, \"Night Song\" | Source: Getty Images\n\nAdvertisement\n\nTHE BIRTH OF A STAR\n\nA more unlikely beginning could hardly be imagined for the girl who would one day be one of the world's most feted beauties. Her mother Constance was just 12 years old, her father unknown.\n\nMerle, born Estelle Merle O'Brien Thompson, was raised by her grandmother Charlotte, who was a Eurasian from Ceylon, and part Maori. In order to avoid scandal, Charlotte claimed Merle was her own child, sister to her mother Constance.\n\nYears later, one of her half-brothers, who had moved to Canada sought her out in Los Angeles and tried to establish a connection\n\nAdvertisement\n\nMerle Oberon publicity photo circa 1943 | Source: Wikimedia\n\nTHE LIFE-LONG LIE\n\nTo understand the reason Merle would cling to her lies about her heritage, it is perhaps necessary to understand the world into which she was born in 1910. British Indian society was ruled by the English class system, intolerant of people of mixed race.\n\nAdvertisement\n\nWealthy native Indians were accepted in the British segment of society if well-born enough -- as in the case of Indian Royalty -- but the biracial product of relationships between men and women of different races were an affront and a threat.\n\nMerle Oberon publicity photo circa 1936 | Source: Wikimedia\n\nAdvertisement\n\nIn British India, white men outnumbered white women vastly, and biracial children were seen as a betrayal of morality, the mingling of British blood with inferior races due to illicit relations, or worse, the result of love affairs.\n\nThat some British men preferred a woman of another race was even more unthinkable. Merle's first taste of the bitter brew of her ancestry came early on in her life. In 1917, the family moved to Calcutta, and Merle was admitted to La Martiniere Calcutta for Girls.\n\nAdvertisement\n\nLa Martiniere Calcutta for Girls was one of the most prestigious private schools in the country, and though Merle was light-skinned, her ancestry was known, and she was taunted and tormented by her colleagues.\n\nHer already-notable porcelain beauty did not help endear her to her less well-favored though infinitely \"better-born\" colleagues or their mothers. Charlotte eventually withdrew Merle from the school and she completed her education at home.\n\nAdvertisement\n\nA PASSION FOR CINEMA\n\nHowever, she did acquire the perfect diction and the elegant upper-class English accent that would open so many doors in the world of British theater and cinema. The cinema offered Merle a brief escape into a more gracious and fascinating world.\n\nSitting in the dark, watching the mesmerizing flickering images of Rudolf Valentino on the screen, it was easy to believe anything was possible -- anything. The star-struck Merle joined the Calcutta Amateur Dramatic Society and trod the boards for the first time.\n\nAdvertisement\n\nA LOVE DENIED\n\nIn 1929, Merle met a former actor and Colonel in the British Army, Ben Finney. Finney was enamored, and it looked like the romance might lead to a serious commitment, until he visited her home. There he met Constance, whom he thought was Merle's sister.\n\nAt the sight of Constance's dark skin, Finney realized that Merle was of mixed race, and he immediately ended the relationship. Finney did do his former beloved a good turn: he wrote her a letter of introduction to Rex Ingram of Victorine Studios.\n\nPoster for \"Desirée\" with Marlon Brando, Jean Simmons and Merle Oberon 1954 | Source: WIkimedia\n\nAdvertisement\n\nCharlotte and Merle left for France to meet Ingram, and on the way, Estelle Merle O'Brien Thompson vanished without a trace. Merle Oberon, born and bred in suitably exotic Tasmania, of impeccable breeding and stunning beauty, disembarked in England. She later said:\n\n\"I was born in Tasmania but left there when I was a child (...) several people in odd parts of Australia have bobbed up to claim me as a relation.\"\n\nAdvertisement\n\nYears later, Merle would fend off would-be long-lost relatives from Australia, whom she knew for a fact were not her family by vaguely alluding to some suitably dramatic family feud. She said:\n\n\"I was born in Tasmania but left there when I was a child (...) several people in odd parts of Australia have bobbed up to claim me as a relation [but] my family quarreled with them some time ago.\"\n\nLaurence Olivier and Merle Oberon in \"Wuthering Heights\" in 1939 | Source: Wikimedia\n\nAdvertisement\n\nMERLE TRIUMPHANT\n\nMerle got her break in 1933 when director Alexander Korda cast her in the small but memorable part of the seductive Anne Boleyn in \"The Private Life of Henry VIII.\" From then on, her rise was meteoric.\n\nIn 1934, Korda cast her again as his leading lady in \"The Private Life of Don Juan\" opposite screen icon, Douglas Fairbanks -- and married her. In 1935, she received an Academy Award nomination for \"The Dark Angel.\"\n\nCharles Laughton and Elsa Lanchester in \"The Private Life of Henry VIII\" directed by Alexander Korda | Source: Wikimedia\n\nAdvertisement\n\nIn 1939, she won the defining role of her career as the tormented Kathy in \"Wuthering Heights opposite the already legendary Shakespearan actor Laurence Olivier. But instead of reassuring her, her success only increased Merle's fear of discovery.\n\nPerhaps she imagined a chorus of disgust, or on the faces of her lovers the same rejection Finney had visited on her on discovering her background. Even though Charlotte had been her constant companion until her death in 1937, Merle cut off all contact with her family.\n\nPoster for \"The Dark Angel\" 1935 | Source: Wikimedia\n\nAdvertisement\n\nLIVING IN FEAR\n\nMerle never saw Constancem her birth-mother again. Years later, one of her half-brothers, Henry Selby, who had moved to Canada, sought her out in Los Angeles and tried to establish a connection, but Merle rejected him unequivocally.\n\nEstelle Merle O'Brien Thompson was dead, and no-one would be permitted to resurrect her and until the very end of her life, as Merle Oberon, she hid and denied her true self."}, {"url": "https://thewire.in/film/merle-oberon-a-hollywood-star-from-india-who-wanted-her-roots-forgotten", "page_content": "This article was originally published by BBC and is republished here with permission.\n\nMerle Oberon, a Hollywood star of the black and white era, is a forgotten icon in India, the country of her birth.\n\nBest-known for playing the lead in the classic Wuthering Heights, Oberon was an Anglo-Indian born in Bombay in 1911. But as a star in Hollywood’s Golden Age, she kept her background a secret – passing herself off as white – throughout her life.\n\nMayukh Sen, a US-based writer and academic, first stumbled across her name in 2009 when he found out that Oberon was the first actor of South Asian origin to be nominated for an Oscar.\n\nHis fascination grew as he saw her films and dug deeper into her past. “As a queer person, I empathise with this feeling that you must hide a part of your identity to survive in a hostile society that isn’t really ready to accept who you are,” he says. Sen is now working on a biography to tell Oberon’s story from a South Asian perspective.\n\nShe was born Estelle Merle O’Brien Thompson in Bombay (now Mumbai) in 1911. Her mother was part-Sinhalese and part-Maori while her father was British.\n\nThe family moved to Calcutta (now Kolkata) in 1917 after Oberon’s father died in 1914. She got her start in acting through the Calcutta Amateur Theatrical Society in the 1920.\n\nAlso read: Indian Cinema: A Story of Flawed Means and Perfect Endings\n\nIn 1925, after watching her first film, a silent movie, The Dark Angel, Oberon was inspired by its star, Vilma Bánky, to become an actress, according to Sen. She left for France in 1928 after an army colonel introduced her to director Rex Ingram who gave her bit parts in his films.\n\nOberon’s mother Charlotte Selby, who had darker skin, followed her as her maid.\n\nA 2014 documentary called The Trouble with Merle later found that Selby was, in fact, Oberon’s grandmother. Selby’s daughter Constance had Oberon as a teenager but the two were reportedly raised together as sisters for some years.\n\nOberon’s first big break came from Sir Alexander Korda – a filmmaker she would later marry – who cast her as Anne Boleyn in The Private Life of Henry VIII (1933).\n\nPublicists for Korda reportedly had to invent a background story to explain her race.\n\n“Tasmania was chosen as her new birthplace because it was so far from the US and Europe and was generally considered to be ‘British’ to its core,” Marée Delofski, director of The Trouble with Merle, wrote in her notes on the documentary.\n\nOberon was passed off as an upper-class girl from Hobart who moved to India after her father died in a hunting accident, Delofski said.\n\nOberon, however, soon became an intrinsic part of local lore in Tasmania and, for the rest of her career, Australian media followed her closely with pride and curiosity. She even acknowledged Tasmania as her hometown but rarely mentioned Calcutta.\n\nBut Calcutta remembered her. “In the 1920s and 1930s, there were passing mentions of her in the memoirs of a lot of Englishmen,” journalist Sunanda K. Datta Ray says.\n\n“People claimed she was born in the city, that she was an operator at the switchboard of the telephone exchange and that she won a contest at Firpo’s restaurant.”\n\nAs she bagged more Hollywood films, Oberon moved to the US and in 1935 was nominated for an Oscar for her role in The Dark Angel.\n\nBut it was her performance in 1939’s Wuthering Heights, opposite acting legend Laurence Olivier, that cemented her place in the industry.\n\nAlso read: ‘Bridgerton’ Brings the Regency Novel Back Into Fashion – But Did It Ever Go Away?\n\nShe was reportedly picked over Vivien Leigh, another India-born actress, because the team behind the film felt she was a bigger name, Sen says.\n\nA New York Times review of the film said Oberon had “perfectly caught the restless, changeling spirit of the Brontë heroine”.\n\nThe late 1930s catapulted Oberon to the so-called big league, Sen says. Her inner circle included figures like music composer Cole Porter and playwright Noël Coward.\n\nKorda and veteran producer Samuel Goldwyn helped Oberon assimilate, taming traits like her accent that would have given away her South Asian origins, Sen says.\n\nBut Oberon’s secret weighed on her – even though her light-skinned complexion made it easier for her to pass off as white on screen.\n\n“She still often felt the need to silence frequent murmurs that she was mixed race. Film journalists of her era would note her tanner complexion,” Sen says.\n\nSome accounts claim Oberon’s skin was damaged by skin-whitening or bleaching treatments.\n\nAfter Oberon was injured and her face scarred in a car crash in 1937, cinematographer Lucien Ballard famously developed a technique that lit her in a way that would obscure her blemishes. (Oberon divorced Korda and married Ballard in 1945.)\n\n“Some sources have suggested that the technique was also a way to ‘whiten’ Merle’s face before the camera,” Sen says.\n\nOberon’s nephew Michael Korda, who published a family memoir called Charmed Lives in 1979, said he obscured details of her background after she threatened to sue him for including her real name and birthplace.\n\n“I had assumed that enough water had passed under the bridge, but she still minded very much indeed about her past,” he said in an interview.\n\nThe charade became harder to maintain. In 1965, Oberon cancelled public appearances and cut short a trip to Australia after finding the local journalists to be curious about her background. Reports say she was distraught during her last visit to Tasmania in 1978 as questions around her identity continued to swirl.\n\nBut she never admitted the truth in public. She died in 1979, of a stroke.\n\nIn 1983, her Anglo-Indian heritage was revealed in a biography, Princess Merle: The Romantic Life of Merle Oberon. The authors found her birth record in Bombay, her baptismal certificate, and letters and photographs her Indian relatives had.\n\nThrough his book, Sen hopes to be able to convey the enormous pressures Oberon faced as a South Asian woman “navigating an industry that wasn’t designed to accommodate her and producing such moving work while fighting those battles”.\n\n“Dealing with those struggles couldn’t have been easy. It feels more productive to extend grace and empathy to her than to judge.”"}, {"url": "https://www.mic.com/articles/168949/the-surprising-story-of-merle-oberon-the-only-indian-actress-to-be-nominated-for-an-oscar", "page_content": "When the omniscient narrator read Dev Patel's name during the 89th annual Academy Awards nominations announcement in January, the actor extended an incredible record. He became just the 13th Asian actor ever nominated for an Oscar, and the third of Indian descent.\n\nThe second was Ben Kingsley, the British actor of Gujarati Indian lineage on his father's side. The first, however, was the only Indian actress ever nominated for an Oscar: Merle Oberon. But had Hollywood had its way, as it did most of her life, we likely never would have known she was Indian at all.\n\nAP\n\nOberon was born Estelle Merle O'Brien Thompson in 1911. For most of her life, she claimed she was born in Australia — but in fact, she was born in Mumbai. Her mother was Constance Selby, a 15-year-old girl from Ceylon (now known as Sri Lanka), but because Constance was so young, her mother Charlotte Selby raised Oberon as her own.\n\nShe moved to England in 1928, and quickly caught the attention of Hungarian director Alexander Korda. Korda cast her as Anne Boleyn in his 1933 film The Private Life of Henry VIII, crediting her under the name Merle Oberon. The role would become her breakout, boosting her professional and personal life. Films like The Scarlet Pimpernel, I, Claudius and Wuthering Heights filled her filmography; she earned her Oscar nomination for 1935's The Dark Angel. Simultaneously, Oberon embarked on a marriage with Korda, which would end in 1945. She married thrice more before passing away in 1979. Her last film was 1973's Interval.\n\nWhile working, Oberon reportedly refused to appear on camera without makeup — now understood to be about masking her darker complexion. She died without revealing the truth of her identity. It wasn't until the publication of her 1983 biography, written by Charles Higham, that her ancestry came to light.\n\nAP\n\nWhy did Oberon and Korda go to such lengths to mask her identity? The answer is simple: Hollywood at the time wouldn't have allowed it.\n\nIn 2002, the Australian Broadcast Company aired a documentary titled The Trouble With Merle. The documentary was an exploration of Oberon's identity as it relates to her celebrity. In the director's notes, helmer Marée Delofski wrote that her heritage wouldn't have found a home on film:\n\nIn the movies at that time, a woman of mixed race was not acceptable. The racism of the period made it very explicit: Merle's Anglo-Indian background was a major obstacle to her becoming a star. Tasmania was chosen as her new birthplace because it was so far from the USA and Europe and was generally considered to be \"British\" to its core. So Estelle Thompson from Bombay became Merle Oberon, a white upper class Hobart girl who moves to India from Tasmania after her distinguished father dies in a hunting accident.\n\nOberon was hardly the only actress working in that era to blur racial lines. John Gavin, born John Anthony Golenor Pablos, consistently played white characters before he became President Ronald Reagan's ambassador to Mexico later in life. Raquel Welch was Bolivian, and refused to change her name to something more palatable for white audiences. Light-skinned black actress Fredi Washington actually used makeup to look darker-skinned on film.\n\nBut Oberon is perhaps the most famous example of disguised ancestry in Hollywood. How much she knew is up for debate; Delofski has questions about how much was her work and how much Hollywood (and Korda) designed for her.\n\n\"Maybe Merle didn't even know who her mother was,\" the director said. \"The studio reconstructed her history and she had to live that life story and keep living that life story.\"\n\nAP\n\nHollywood has changed in the intervening years, though some vestiges of that stigma remain. Sisters Meg and Jennifer Tilly go by their mother's maiden name rather than their Chinese father's. In other ways, the world has opened: For example, actors like Hailee Steinfeld and Darren Criss speak openly about their part-Filipino heritage.\n\nOberon, on the other hand, remains a fascinating figure in Oscar history. She carries a unique distinction that she herself never confirmed in life: that she is the only Indian actress ever nominated for an Oscar. While inclusion remains a massive issue for the film and TV industries, it's growing increasingly hopeful that she'll be joined in the record books by another Indian actress (Quantico's Priyanka Chopra, perhaps?) very soon.\n\nSunday night in London, Patel became the first actor of Indian descent to win a BAFTA — the British equivalent of an Oscar — for his work in Lion. Decades after Oberon's career peak, actors of Indian descent like Patel, Chopra and more are cracking through the very barriers that kept Oberon's identity concealed. It's a slow process, but a historic one."}, {"url": "https://www.nytimes.com/1979/11/24/archives/merle-oberon-68-star-of-films-including-wuthering-heights-liked.html", "page_content": "When the film opened in 1939, Frank S. Nugent of The New York Times, wrote:\n\n“So Mr. Olivier has played Heathcliff, and Miss Oberon, as Cathy, has matched the brilliance of his characterization with hers. She has perfectly caught the restless, changeling spirit of the Brontë heroine who knew she was not meant for heaven and broke her heart and Heathcliff's in the synthetic paradise of her marriage with gentle Edgar Linton.”\n\nAlso in the movie were David Niven as Linton and Geraldine Fitzgerald.\n\nLiked ‘Healthy’ Things\n\nMiss Oberon's career was a record of persistence, ingenuity, hard work and good luck, and she retained her smooth, youthful looks better than many another film star of her generation. “Luckily, I like all the things that are healthy,” she once said, “like exercise, rest, sensible food, no alcoholic drinks, unless a sip of wine, and no cigarettes.”\n\nMiss Oberon was born Estelle Merle 0'Brien Thompson on Feb. 19, 1911, on the island of Tasmania, near Australia, the daughter of a British Army major who died just before her birth. She grew up in Bombay and Calcutta, studying French and Hindustani along with the traditional subjects, and danced at the Calcutta Amateur Theatrical Society.\n\nWhen she was 16, an uncle, also a British officer, took her for a visit to London, where she enrolled in dancing school and decided to stay. She took a job as a dance hostess at the Café de Paris even though she considered it much beneath her, the product of the highly snobbish British Army presence in India. But the job came with free dinners, and that became the deciding factor.\n\nEven then, Miss Oberon, known as Queenie Thompson, was noted for her beauty. Her first screen test nevertheless ended in disaster, but she soon found herself playing bit parts after a second one turned out better."}, {"url": "https://www.bypantheavine.com/post/the-mysteries-of-merle-oberon", "page_content": "\n\n\n\nMerle Oberon\n\n\n\n\n\nMerle Oberon is considered a true great from an era of stars who fill Hollywood’s Pantheon. A unique beauty and Academy award nominee, she was one of the most celebrated actresses of her time. The biggest role of her life was, however, little seen. And that’s just how she wanted it.\n\n\n\n\n\nFearing discrimination, she was forced to conceal her ethnicity from the world and it wasn’t until after her death that the truth was revealed.\n\nBorn in 1911 as Estelle Merle O’Brien Thompson in Bombay, British India, she was raised the daughter of Arthur O'Brien Thompson, a British engineer, and his wife Charlotte Selby, who was of Sri Lankan and Maori heritage. In reality, they were her grandparents. Estelle’s biological mother was Constance Thompson, whom she grew up believing was her older sister. This peculiar domestic set-up was an attempt by the family to save Estelle from disgrace owing to the fact Constance was only 12 when she fell pregnant. The identity of the child’s father is unknown to this day. It is unclear if Oberon ever found out the truth about her parents; it would have added a layer of complexity to the racial arrangements she would have to make in her life.\n\n\n\n\n\nIn 1914 Arthur Thompson left his family to join the British Army. He would die of pneumonia two years and half a world away later on the Western Front. Those were years of hardship for the Thompson family, who were living in shabby apartments. Bombay then was pretty much as it is now. Hectic with heat and crowds, the city has an oppressive air, and it was perhaps harsher still for the Thompsons, whose future of possibilities in having an Englishman as head of the household had been extinguished. Things looked to have changed for the better when in 1917 Estelle won a scholarship to attend a prestigious private school in Calcutta. The family moved the length of India and set up in more comfortable lodgings. Comfortable was not, however, Estelle’s time at school. Though light-skinned compared to Charlotte, her mixed-race heritage was known and she became the subject of terrible abuse. The bullying was so intolerable that she was forced to stop attending lessons, eventually finishing her studies by being tutored at home.\n\n\n\n\n\nIt was as a direct result of this episode that Estelle first considered concealing her identity.\n\n\n\n\n\nImage: Wikimedia Commons\n\nWith her schooling over, she began to feel restless, sensing that her ethnicity would forever constrain her life chances. The glint of something different, the light leading to a new path, was movies; perhaps initially not in a starring role, but the prospect she saw in them of transformation. If nothing else, her education had given her perfect diction, which, when combined with an upper-class English accent and the beauty that by now was quite evident, gave her a way into the Calcutta Amateur Dramatics Society. She later said that she’d joined in the hope it would help ‘pave her way to the movies.’\n\n\n\n\n\nIt was there she met Ben Finney, a former actor and Colonel in the British Army, and whom she began seeing. The relationship lasted until Finney one day caught a glimpse of Charlotte Thompson. He abruptly dumped Estelle, having realised she was not white, only passing for. To ease his guilt, Finney promised that if she ever visited France, he would make the necessary introductions to Rex Ingram, the head of a French film studio in Nice. What seemed like conscience-greasing hyperbole in fact had merit, as Finney had become acquainted with Ingram via his old flame Barbara Lamarr, the American film star. Feeling that this promise may be as short-lived as his romantic interest in her, Estelle and Charlotte packed their belongings and set off for Nice. On their arrival, they found the ever-chivalrous Finney was not there to meet them, although he did keep his bargain and put in a good word for her at the studio. Rex Ingham liked Estelle’s looks, which set her apart from the blonde and blue-eyed types he was more used to working with. He immediately hired her as an extra.\n\n‘I couldn't dance or sing or write or paint. The only possible opening seemed to be in some line in which I could use my face. This was, in fact, no better than a hundred other faces, but it did possess a fortunately photogenic quality’\n\n– Merle Oberon\n\n\n\n\n\nShe played minor roles for a while and at the age of 17 decided the best way to forward her career was to move to London. Once there, and to make ends meet, she found work as a hostess at the Café de Paris, on Piccadilly, but continued to take what scraps the film industry threw at her. One day, while queuing for tea at the Paramount studio canteen, Estelle caught the attention of the famous producer Alexander Korda. He cast her in the small but very focal role of Anne Boleyn in his 1933 film The Private Life of Henry VIII.\n\n\n\n\n\nImage: Wikimedia Commons\n\n‘They’re trying to make me the first Glamour Girl of England. I suppose it is because my face is odd, and my eyes slant. I don’t look like any of the other movie stars over there, and they feel that if they worked on me hard enough, perhaps I would be the type’\n\n– Merle Oberon\n\n\n\n\n\nFearing Estelle’s mixed heritage might become an obstacle to her movie career, Korda decided to re-form her. He dropped the O’Brien for the more aristocratic Oberon. Next was the creation of a fictional biography that said she was born in Tasmania to upper class British parents. No new identity could be complete without the material destruction of the old. Her records were made to disappear, with the official line being that they had gone up in flames.\n\n\n\n\n\n‘It's easier for me to be something which I am not than it is to act myself’\n\n– Merle Oberon\n\nBy now, Oberon herself was anxious to keep her race a secret, so desperate that at one point she had Charlotte pose as her maid. Even after death in 1937, Charlotte Selby Thompson was destined, in a sense, to carry on playing the maid: in the portraits Estelle commissioned of her, the artist was instructed to lighten her skin colour.\n\n\n\n\n\nImage: Wikimedia Commons\n\nThe role of Anne Boleyn would be Oberon’s breakout and the film’s success paved the way to leading-lady status. Her career benefited from her growing professional and personal relationship with Korda, and she was so much in demand that he sold shares of her contract to the American producer Samuel Goldwyn, of Goldwyn Mayer. Hollywood hits such as the Scarlet Pimpernel and Wuthering Heights followed, with Oberon commuting between London and California. Her performance in the 1935 film The Dark Angel earned her an Academy Award nomination for Best Actress.\n\nIt was the first time a biracial actress had been recognised in segregated Hollywood, though of course it did little for people of colour as no one other than Oberon and those close to her knew the truth.\n\n\n\n\n\nMerle Oberon Max Factor Make-up Advertisement\n\nOberon had always refused to appear on camera without make-up, which was used to mask her natural complexion. She was set to star in another Korda film, 1937’s I, Claudius, where she was due to play the role of Messalina, but she was injured in a car crash and filming abandoned. The accident left her with facial injuries severe enough that they might have ended her career, but these too were masked away with make-up.\n\n\n\n\n\nKorda and Oberon were married in 1939 and as an engagement present he gave her a spectacular Cartier necklace. It was an incredible and very distinctive piece, with 29 teardrop-shaped emeralds linked by platinum and covered in single-cut diamonds. The Indian emeralds must have held a special, if tortuously conflicted, significance. They were a connection to a distant past that was less racially piercing, but she was all too aware it was a place from which she could never have flourished. It was as though Estelle O’Brien and Merle Oberon had been born conjoined twins and in order for one to survive, truly survive, the other had to die. It must have seemed at the time that it was an obvious choice. Estelle had to be killed. But was a touch of humanity lost along with that soul? Oberon would continue to wear the necklace throughout her life.\n\n\n\n\n\nMerle Oberon's Cartier Emerald Necklace\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn 1940 Oberon suffered further damage to her face, now thought to have been as a result of using chemicals to further lighten her complexion. It was reported at the time as being ‘cosmetic poisoning’. Korda arranged for her to see the best skin specialist in New York, where she underwent several dermabrasion procedures. The results were only partially successful and she was left with noticeable pitting and indentations in her skin. The cinematographer Lucien Ballard devised a special light to eliminate all her flaws, at least on film, by the use of a compact spotlight he called the Obie. Mounted on the side of the camera, it lit the subject head-on, reducing unflattering lines and shadows, and removed signs of scarring. Obie went into general use and is still around today. Oberon left Korda to marry Ballard in 1945. She was to marry twice more.\n\n\n\n\n\nBy the end of her life Oberon had amassed a major jewellery collection, with a number of impressive pieces. Today her favourite emerald necklace is one of Cartier’s most photographed pieces.\n\n\n\n\n\nMerle Oberon died in 1979 after suffering a stroke. She did her best to maintain her fictional background until the very end, though an increasingly sceptical press were asking difficult questions of her early life. Her Tasmanian origins were comprehensively debunked after her death.\n\n\n\n\n\nShe once said:\n\n\n\n\n\n‘Without security it is difficult for a woman to look or feel beautiful’\n\n\n\n\n\nThe price she paid for that security was a life complex in identity issues, of scars, real and emotional, of masks, painted and psychological; a story worthy of a Hollywood script.\n\n\n\n\n\nThe Art of Glamour , the style and beauty secrets of Hollywood's golden age"}]}