{"Mayhew Foster was involved in the founding of several schools.": [{"url": "https://usa.chinadaily.com.cn/world/2011-01/31/content_11970208.htm", "page_content": "Pilot recalls captured Nazi leader Updated: 2011-01-31 07:54 By Matt Volz (China Daily)\n\nIn this May 9, 1945 photo provided by Brigadier General Mayhew Foster, captured Nazi leader Hermann Goering (second from right) stands on the tiny airstrip outside Kitzbuhel, Austria, before being transported back to Germany for interrogation. Provided by Mayhew Foster / Associated Press\n\nMISSOULA, Montana - Captain Mayhew Foster had an extraordinary mission: Fly captured Nazi leader Hermann Goering to the 7th Army's headquarters for interrogation.\n\nThen he took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe - all 136 kg of him - and knew he needed a bigger plane.\n\nIt was May 9, 1945, the day after World War II ended in Europe. Goering, Foster and a group of officers from the Army's 36th Infantry Division gathered on a tiny airstrip outside Kitzbuhel, Austria, to transport the highly-prized war prisoner back to Germany in an unarmed, two-man reconnaissance plane.\n\n\"They wanted to get him back where he could be debriefed. There was a strong rumor that in a mountainside in the Alps right down there in Bavaria there was a concentration of (German) military,\" Foster said. \"He just acted as though it was a nice, friendly trip.\"\n\nMayhew Foster, now 99 and living in a Missoula nursing home, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders. Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honor for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career.\n\nGoering, 52, had surrendered to the US Army's 36th Infantry Division the day before. He had fallen out of favor with Hitler and hadn't played an active role at the end of the war, though he remained Reichsmarschall of Nazi Germany.\n\nBefore his capture, Goering wrote a letter to General Dwight D. Eisenhower, Supreme Allied Commander in Europe, offering to work with Eisenhower on the conditions of the German army's surrender, according to an account of Goering's capture by Brigadier General Robert Stack kept by the 36th Infantry Division Association.\n\nAfter receiving the letter, Stack and a group of soldiers drove from the division's base near Kitzbuhel across the border into Germany and intercepted a convoy that included Goering, his wife, daughter, sister-in-law, household servants and military aides, according to the account.\n\nGoering agreed to surrender unconditionally but asked that his family be cared for, and the Nazi leader was delivered to Foster for transport the next day.\n\nFoster, who was 33 at the time, said he didn't fear getting shot down carrying such precious cargo alone in an unescorted, unarmed plane. He didn't worry about Goering taking advantage of the lack of a guard to wrest control of the aircraft.\n\nThe main problem, he said, was getting the two of them off the ground - the nimble, lightweight Piper L4 that Foster piloted in his artillery spotting missions wouldn't support both him and Goering. But the division only had the small airstrip that was fine for Foster's aircraft, but was problematic for taking off and landing larger planes.\n\nThey'd have to upgrade to the one L5 in the division's inventory, a slightly larger aircraft Foster hadn't flown in years.\n\nGoering stood on the tiny airstrip in a plain, gray uniform that was unadorned but for a pistol at his hip and a medal around his neck. Still wearing the pistol, he stepped toward the plane. A Goering aide emerged from the group that had gathered and relieved Goering of the weapon.\n\nThe Nazi leader settled into the back seat and tried to fasten his seat belt. It wouldn't stretch across his belly. He held the strap in his hand, looked at Foster and said, \"Das goot!\" - that's good.\n\nA photograph of that moment shows Foster in the cockpit and Goering seated directly behind him, his elbow jauntily propped on the plane's fuselage.\n\nThe two men spent the 55-minute flight from Kitzbuhel to Augsburg, Germany, conversing in a mix of German and English. Foster said Goering avoided any talk of Hitler or the war but appeared to relish pointing out the sites below them.\n\n\"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour and he was showing me where he grew up,\" Foster said. \"I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nHe described Goering as sharp, friendly and witty, even cracking a joke when Foster asked him when Germany began manufacturing jets.\n\n\"Too late,\" Goering replied, according to Foster.\n\nAt the time, Foster was somewhat less generous in describing the man. In a letter to his wife, Virginia Lou Foster, written soon after the mission, Foster told her that the Nazi leader was \"effeminate\" and \"gave me the creeps\".\n\n\"Several times I had the impulse to turn the plane over and see if I could shake him out but he was wedged in like a champagne cork,\" Foster wrote.\n\nAfter landing, Foster asked his passenger to sign a blank flight report. The prisoner scrawled \"Hermann Goering Reichsmarschall\" across the paper, which Foster folded and put in his pocket.\n\nIt's a document that he still has, one of Foster's most prized possessions alongside a collection of photographs of Goering, Hitler and other snapshots from the days of the Third Reich.\n\nThere was just a single jeep at the airstrip to meet the arriving flight carrying the world's most famous war prisoner. Foster rode with Goering to the gates of the 7th Army Headquarters and formally turned him over to the intelligence officer without ceremony.\n\nIt turned out, Foster learned later, those rumors of German troops hiding in the Bavarian Alps were untrue. Goering stood trial at Nuremberg, and the next year he was found guilty of war crimes.\n\nGoering was sentenced to hang, but he committed suicide instead by swallowing a cyanide capsule.\n\nSixty-five years later, Foster is trim, sharp and carries himself as a former military officer.\n\nHe still reflects on his rare insight into the Nazi leadership, and he recognizes that the experience had shifted his perceptions of the enemy. It allowed him to see the human side of those he had only known as caricatures.\n\n\"I could see that he was like one of our officers if he'd been picked up,\" Foster said. \"I wouldn't say it changed my view of the war but it showed me that there are ...\" He broke off.\n\n\"Well, I questioned all that we knew about these vicious people,\" he said.\n\nAssociated Press"}, {"url": "https://www.education.ox.ac.uk/people/ken-mayhew/", "page_content": "Ken Mayhew is Emeritus Professor of Education and Economic Performance and Emeritus Fellow of Pembroke College, Oxford.\n\nHe is an Extraordinary Professor at Maastricht University, a Director of the Centre for Tutorial Teaching and has recently finished a term as a member of the Department for Education’s Skills and Productivity Board. He was the founding Director of SKOPE, a multi-disciplinary centre on Skills, Knowledge and Organisational Performance, based in the Oxford Department of Education.\n\nKen is also currently a member of the ESRC’s College of Peer Reviewers; the Expert Group for CEDEFOP’s European Training and Learning Survey; the Expert Working Group for Cedefop’s Second European Skills and Jobs Survey; Bright Blue’s Commission on the Welfare System after the COVID 19 Pandemic. He is an editor of Oxford Economic Papers\n\nKen obtained a First in Modern History at Worcester College, Oxford and took a Masters in Economics at LSE. After graduate school he joined Her Majesty’s Treasury before moving to Oxford. In 1989 and 1990 he was Economic Director at the UK National Economic Development Office, and has worked as a consultant for many private and public sector organisations at home and abroad. In the UK these include the Department of Education and Skills, the Department of Trade and Industry, DEFRA, the Skills Funding Agency, the CIPD and the Confederation of British Industry. Abroad they include the EU, the Polish, Belgian and Omani Governments, SIK (Sweden) and Group Training Australia. He was on the Academic Advisory Board of the National Skills Taskforce and Chair of an expert group advising the OECD on the background questionnaire for PIAAC. His major research interests are in labour economics, human resource management and the economics of education and training. He has published widely in these areas.\n\nKen Mayhew would welcome informal contacts from prospective students interested in the following topics:\n\n• The economics of education\n\n• Transitions from the education system to the labour market\n\n• Work-based training and learning\n\n• Education and social mobility\n\n• The labour market\n\nResearch\n\nKen’s current research is mainly in six areas: transitions from education into the labour market; the economics of work-based training; the economics of higher education; low paid work in the UK and Europe; the labour market as a social model; inequality with special emphasis on regional inequality.\n\nFeatured publications\n\nOxford Handbook of Skills and Training, Oxford University Press, 2017 (with J. Buchanan, D. Finegold and C. Warhurst)\n\n“Educating for a cooperative society –building human and social capital: the role of government” in G. Redding, A. Drew and S. Crump (eds), The Oxford Handbook of Higher Education Systems and University Management, 2019\n\n“Inequality”, Oxford Review of Economic Policy, 2019 (with S. Wills)\n\nHolmes, C, Mayhew, K (2016) “The economics of higher education”, OXFORD REVIEW OF ECONOMIC POLICY. 32(4) 475-496.\n\nMayhew, K, Holmes, C (2015) Over-qualification and skills mismatch in the graduate labour market. London: CIPD.\n\nMayhew, K (2015) “UK labour market policy then and now”, Oxford Review of Economic Policy.\n\n“BREXIT and higher education” (2022) Oxford Review of Economic Policy\n\n“What accounts for changes in the chances of being NEET in the UK?” (2021) Journal of Education and Work (with C. Holmes and E. Murphy)\n\nHigher education and the labour market” (2020) Oxford Review of Education (with H. Lauder)\n\nBooks\n\nOxford Handbook of Skills and Training, Oxford University Press, paperback edition 2018 (with J. Buchanan, D. Finegold and C. Warhurst)\n\nOxford Handbook of Skills and Training, Oxford University Press, 2017 (with J. Buchanan, D. Finegold and C. Warhurst)\n\nAppelbaum, E, Bosch, G, Gautié, J, Mason, G, Mayhew, K, Salverda, W, Schmitt, J, Westergaard-Nielsen, N (2010) Introduction and overview.\n\nLLoyd, C, Mason, G, Mayhew, K (2008) Low-Wage Work in the United Kingdom. Russell Sage Foundation.\n\nGrip, AD, Loo, JV, Mayhew, K (2002) The Economics of Skills Obsolescence Theoretical Innovations and Empirical Applications. Jai.\n\nMayhew, K, Fenn, P, McGuire, A (1994) Providing Health Care. Oxford: OUP.\n\nMayhew, K, Layard, R, Owen, G (1994) Britain’s Training Deficit. Avebury Publishing.\n\nBowen, A, Mayhew, K (1991) Reducing Regional Inequalities.\n\nFenn, P, McGuire, A, Mayhew, K (1991) Providing Health Care. Oxford: OUP.\n\nBowen, A, Mayhew, K (1990) Improving Incentives for the Low-Paid. Springer.\n\nMayhew, K (1983) Trade Unions and the Labour Market. Blackwell Pub.\n\nRobinson, DJS, Mayhew, K (1983) Pay policies for the future.\n\nBook chapters\n\n“NEETS in England”, in M. Levels, C. Brzinsky-Fay, C. Holmes and J. Jongbloed (eds), The Dynamics of Marginalised Youth, Routledge, 2022 (with C. Holmes, L. Wright, E. Murphy, E. Keep and S. Maguire)\n\n“Derek Robinson” in R. Cord (ed), The Palgrave Companion to Oxford Economics, Palgrave, 2021\n\n“What, if anything, can we learn from Germany, Switzerland, Austria, the Netherlands and Denmark?”, in D. Goodhart (ed.), The Training We Need Now, Policy Exchange, 2020\n\n“Educating for a cooperative society –building human and social capital: the role of government” in G. Redding, A. Drew and S. Crump (eds), The Oxford Handbook of Higher Education Systems and University Management, 2019\n\n“The economic and social benefits of skills” in Oxford Handbook of Skills and Training, 2017 (with I Grugulis and C. Holmes)\n\n“Skills and training: the landscape” in Oxford Handbook of Skills and Training, 2017 (with J. Buchanan, D. Finegold and C. Warhurst)\n\nMayhew, K, Wickham-Jones, M (2014) “The UK’s Social Model from New Deal to Economic Crisis”, In: J-E Dolvik, A Martin (eds.) European Social Models from Crisis to Crisis: Employment and Inequality in an Era of Monetary Integration.Oxford: OUP.\n\nHolmes, C, Mayhew, K (2014) “The winners and losers in the ‘hourglass’ labour market”, In: Understanding Employer Engagement in Education: Theories and Evidence. 92-113\n\nDOI: http://doi.org/10.4324/9781315779966\n\nDOI: http://doi.org/10.4324/9781315779966 Mayhew, K (2010) “Comment on Anderson and Ruhs”, In: B Anderson, M Ruhs (eds.) Who Needs Migrant Workers: Labour Shortages, Immigration and Public Policy.\n\nGautié, J, Westergaard-Nielsen, N, Schmitt, J, Mayhew, K (2010) “The impact of institutions on the supply side of the low-wage labor market”, In: Low-Wage Work in the Wealthy World. 147-182\n\nBosch, G, Mayhew, K, Gautié, J (2010) “Industrial relations, legal regulations, and wage setting”, In: Low-Wage Work in the Wealthy World. 91-146\n\nMayhew, K, Keep, E (2009) “Knowledge, skills and competitiveness”, In: F Rauner, R Maclean (eds.) Handbook of TVET Research.\n\nMayhew, K, Mason, G, Osborne, M, Stevens, P (2008) “Low pay, labour market institutions and job quality”, In: C Lloyd, G Mason, K Mayhew (eds.) Low Wage Work in the UK. New York: Russell Sage.\n\nMayhew, K, Mason, G (2008) “Low paid work in the UK: an overview”, In: C Lloyd, G Mason, K Mayhew (eds.) Low Wage Work in the UK. New York: Russell Sage.\n\nMayhew, K, Deer, C (2007) “The changing nature and context of higher education in the UK”, In: T Butler, M Dane (eds.) Reflections on Change.\n\nMayhew, K (2005) How to improve the human capital of older workers. Paris: OECD.\n\nMayhew, K, de Grip, A, van Loo, J (2002) “The economics of skills obsolescence”, In: A de Grip, J van Loo, K Mayhew (eds.) The Economics of Skills Obsolescence: Theoretical Innovations and Empirical Applications. Jai.\n\nMayhew, K (2002) “The high skills vision”, In: A Jolly (ed.) Skills and Training Directory. Kogan Page.\n\nMayhew, K (2002) “Higher education – size matters”, In: G Hayward, S James (eds.) Growing Higher Education: Expansion or Hyperinflation.\n\nMayhew, K, Holtham, G, Ingram, P (1998) “The long term unemployed – what more can be done?”, In:J McCormick, C Oppenheim (eds.) Welfare in Working Order. London: IPPR.\n\nKeep, EJ, Mayhew, K (1998) “Vocational Education and Training and Economic Performance”, In: T Buxton, P Chapman, J Temple (eds.) Britain’s Economic Performance. 2nd edition. London: Routledge. 367-395\n\nKeep, EJ, Mayhew, K (1998) “Training and Development”, In: S Fox (ed.) The European business environment UK. London: Thomson Business Press. 219-241\n\nKeep, EJ, Mayhew, K (1996) “UK Training Policy – Assumptions and Reality”, In: A Booth, DJ Snower (eds.) Acquiring Skills Market Failures, Their Symptoms and Policy Responses. Cambridge: Cambridge University Press. 303-334\n\nMayhew, K, Ingram, P, Guest, D (1996) “How do we think about pay?”, In: H Murlis (ed.) Pay at the Crossroads. London: IPD.\n\nKeep, EJ, Mayhew, K (1996) “Training for the Unemployed”, In: P Meadows (ed.) Work out – or Work in? Contributions to the debate on the future of work. York: Joseph Rowntree Foundation. 140-155\n\nKeep, EJ, Mayhew, K (1995) “The Economic Demand for Higher Education, and Investing in People – Two Aspects of Sustainable Development in British Higher Education”, In: F Coffield (ed.) Higher Education in a Learning Society. Durham: Durham University School of Education. 81-110\n\nKeep, EJ, Mayhew, K (1995) Training Policy for Competitiveness – Time for a Fresh Perspective? London: Policy Studies Institute. 110-145\n\nMayhew, K, Layard, R, Owen, G (1994) “Why we need a Training Reform Act”, In: K Mayhew, R Layard, G Owen (eds.) Britain’s Training Deficit. Avebury.\n\nKeep, EJ, Mayhew, K (1994) “The Changing Structure of Training Provision”, In: T Buxton, P Chapman, P Temple (eds.) Britain’s Economic Performance. London: Routledge.\n\nMayhew, K, Anderton, R (1994) “A comparative analysis of the UK labour market”, In: R Barrell (ed.) The UK Labour Market: Comparative Aspects and Institutional Developments. Cambridge University Press.\n\nMayhew, K (1994) “Pay policies in the private sector: an international overview”, In: M Lavender (ed.) International Pay Policies. London: Public Finance Foundation.\n\nKeep, EJ, Mayhew, K (1993) “Training and the Labour Market”, In: C Trinder, P Jackson (eds.) The Public Services Yearbook 1993. London: Chapman and Hall. 169-190\n\nMayhew, K (1992) “Incomes policy”, In: New Palgrave Dictionary of Money and Finance. Palgrave.\n\nMayhew, K (1991) “Pay policies in the private sector: an international overview”, In: J Hawkins (ed.) International Pay Policies. London: Public Finance Foundation.\n\nMayhew, K, McGuire, A, Fenn, P (1991) “The economics of health care”, In: K Mayhew, A McGuire, P Fenn (eds.) Providing Health Care. Oxford: OUP.\n\nMayhew, K, Bowen, A (1991) “Regional economic disparities: some public policy issues”, In: K Mayhew, A Bowen (eds.) Reducing Regional Inequalities.\n\nMayhew, K (1991) “Training: the way ahead”, In: Employment Institute (ed.) Improving Britain’s Industrial Performance. Employment Institute.\n\nMayhew, K (1991) “Regional issues in economics: setting the scene”, In: K Mayhew, A Bowen (eds.) Reducing Regional Inequalities.\n\nKeep, EJ (1990) “Training for the Low Paid”, In: A Bowen, K Mayhew (eds.) Improving Incentives for the Low-Paid. London: Macmillan/NEDO. 139-180\n\nMayhew, K, Ray, A (1990) “White collar pay and employment”, In: M Gregory, A Thompson (eds.) A Portrait of Pay. OUP.\n\nMayhew, K, Bowen, A (1990) “Incentives for the low paid: issues for public policy”, In: K Mayhew, A Bowen (eds.) Improving Incentives for the Low Paid.\n\nMayhew, K, Bowen, A, Brewer, D (1990) “Incentives for the low paid: setting the scene”, In: K Mayhew, A Bowen (eds.) Improving Incentives for the Low Paid.\n\nMayhew, K, Turnbull, P (1989) “Models of union behaviour”, In: R Perlman, R Drago (eds.) Microeconomic Issues in the Labour Market. Harvester.\n\nMayhew, K (1986) “Economists and immigration”, In: A Dummett (ed.) Towards a Just Immigration Policy.\n\nMayhew, K (1986) “Employee behaviour”, In: D Morris (ed.) The Economic System in the UK. OUP.\n\nMayhew, K, Addison, J (1983) “Discrimination in the labour market”, In: G Bain (ed.) Industrial relations in Britain. Blackwell.\n\nMayhew, K (1983) “Traditional incomes policies”, In: D Robinson, K Mayhew (eds.) Pay Policies for the Future.\n\nMayhew, K, Greenhalgh, C (1981) “Labour supply in Great Britain: theory and evidence”, In: Z Hornstein, J Grice (eds.) The Economics of the Labour Market. HMSO.\n\nMayhew, K (1981) “Incomes policy and the private sector”, In: R Elliott, L Fallick (eds.) Incomes Policy, Inflation and Relative Pay. George Allen and Unwin.\n\nMayhew, K (1981) “The institutional context of incomes policy”, In: R Chater, A Dean, R Elliott (eds.) Incomes Policies. OUP.\n\nKeep, EJ, Mayhew, K “Education and Training”, In: C Trinder, P Jackson (eds.) Public Services Yearbook 1994. London: Chapman and Hall. 237-254\n\nConference papers\n\nMayhew, K (2010)“The Future of Low Paid Work in Europe and the US”, Beyond skill: Institutions, organisations and human capability. 58-78.\n\nDOI: http://doi.org/10.1057/9780230291270_4\n\nJournal articles\n\nReports\n\nAlternative Pathways into the Labour Market, CIPD, 2016 (with Craig Holmes)\n\nWilde, S, James, SF, Mayhew, K (2015) Training Managers: Benefits from and barriers to WorldSkills UK participation. Oxford: Oxford University Consulting.\n\nMayhew, K, Holmes, C (2015) Over-qualification and skills mismatch in the graduate labour market. London: CIPD.\n\nJames Relly, SF, Holmes, C, Mayhew, K (2015) Learning environments to develop vocational excellence. http://vocationalexcellence.education.ox.ac.uk/wordpress/wp-content/uploads/2016/03/Project-2-Phase-2-Final-Report-Learning-environments-to-develop-vocational-excellence.pdf:\n\nChankseliani, M, James Relly, S, Mayhew, K (2015) WorldSkills competitors and entrepreneurship: A Report to the Skills Funding Agency.\n\nChankseliani, M, James Relly, Susan, Mayhew, Ken (2015) “Benefits of Developing Vocational Excellence. A Report to the National Apprenticeship Service of Project 3 (Phase II) of the DUVE suite of projects”, In: Benefits of Developing Vocational Excellence. A Report to the National Apprenticeship Service of Project 3 (Phase II) of the DUVE suite of projects.\n\nJames Relly, SF, Allen, J, Mayhew, K (2015) Further education college participation in worldSkills and other competitions. http://vocationalexcellence.education.ox.ac.uk/wordpress/wp-content/uploads/2015/06/Project-4-Further-education-college-participation-in-WorldSkills-and-other-skills-competitions.pdf:\n\nJames Relly, SF, Rodriguez Leal, T, Mayhew, K (2014) Interim Evaluation Report on the Skills Competition CPD Programme. Oxford: Oxford University Consulting.\n\nJames Relly, SF, Rodriguez Leal, T, Mayhew, K (2014) Final Evaluation Report on the Skills Competition CPD Programme. Oxford: Oxford University Consulting.\n\nJames, SF, Mayhew, K, Laczik, A, Mordarska, M (2013) Report on Apprenticeships, Employer Engagement and Vocational Formation in England. Oxford: Oxford University Consulting.\n\nJames, SF, Mayhew, K, Chankseliani, M, Laczik, A (2013) “Benefits of Developing Vocational Excellence. A Report to the National Apprenticeship Service. Oxford: SKOPE”, In: Benefits of Developing Vocational Excellence A Report to the National Apprenticeship Service of Project 3 of the DUVE suite of projects.\n\nJames, S, Holmes, C, Mayhew, K (2013) “Learning Environments to Develop vocational Excellence. Oxford: SKOPE”, In: A Report to the National Apprenticeship Service of Project 2 of the DUVE suite of projects. Oxford: SKOPE.\n\nMayhew, K, Holmes, C (2012) Is the UK labour market polarising. London: Resolution Foundation.\n\nHolmes, C, Mayhew, K, Keep, EJ (2012) “Ten Big Questions for Higher Education”, In: SKOPE Issues Paper. Cardiff: Cardiff University, SKOPE.\n\nKeep, EJ, Mayhew, K (2011) “Future Directions for Skills Policy”, In: SKOPE submission to the Labour Party Policy Review on skills (mimeo). Universities of Oxford and Cardiff, SKOPE.\n\nMayhew, K, Green, F, Stasz, C (2005) Defining a strategy for the direct assessment of adult skills. Copenhagen:Danish Technological Institute.\n\nKeep, EJ, Mayhew, K (2004) Can Employers Be Persuaded That Training Pays? Glasgow: Future Skills Scotland/ScottishEnterprise.\n\nMayhew, K, Wilson, R, Hogarth, T, Keep, E (2003) Tackling the low skills equilibrium. London: Department of Trade and Industry.\n\nMayhew, K, Green, F, Molloy, E (2003) Employer Perspectives on Skill. London: Department for Education and Skills.\n\nMayhew, K, Keep, E, Bosworth, D (2003) Tackling the low skills equilibrium: a review of the issues. Department of Trade and Industry.\n\nKeep, EJ, Mayhew, K, Corney, M (2002) Review of the evidence on the rate of return to employers of investment in training and employer training measures. Department of Trade and Industry.\n\nKeep, EJ, Mayhew, K (2001) “Globalisation, Models of Competitive Advantage and Skills”, In: SKOPE Research Paper. Coventry: University of Warwick, SKOPE.\n\nKeep, EJ, Mayhew, K (2000) “The Leisure Sector”, In: National Skills Task Force Research Project Report. Sheffield: DfEE.\n\nMayhew, K, Felstead, A, Green, F (1997) Getting the measure of training. Leeds: Centre for Industrial Policy and Performance, Leeds University.\n\nMayhew, K, Holtham, G (1996) Tackling long term unemployment. London: Institute for Public Policy Research.\n\nKeep, EJ, Mayhew, K (1994) “UK Training Policy – Assumptions and Reality”, In: Background briefing paper for TUC national conference ‘Looking Forward to Full Employment’. London: TUC.\n\nKeep, EJ, Mayhew, K (1994) Scoping paper for the Institute of Personnel Management ‘What Makes Training Pay?’ Project. London: IPM.\n\nKeep, EJ, Mayhew, K (1993) Submission on training and skills utilisation to the House of Commons Select Committee on Trade and Industry’s inquiry into the competitiveness of British manufacturing’, June, 1993. (subsequently published in Evidence to the House of Commons Select Committee on Trade and Industry, Trade and Industry Committee 2nd Report ‘Competitiveness of UK Manufacturing Industry’, Vol 2, Memoranda of Evidence. London: HMSO.\n\nLayard, R, Mayhew, K, Owen, G (1993) The Training Reform Act of 1994.\n\nDOI: http://doi.org/10.1108/01437729310033296\n\nDOI: http://doi.org/10.1108/01437729310033296 Mayhew, K, St John, B (1989) Subcontracting in Britain. London: Confederation of British Industry.\n\nMayhew, K, Rosewell, B (1981) Manpower problems and changes in the labour market. Bradford: MCB Publications.\n\nMayhew, K, Rosewell, B (1980) Employment and Unemployment Issues in the 1970s.\n\nDOI: http://doi.org/10.1108/eb001235\n\nDOI: http://doi.org/10.1108/eb001235 Mayhew, K, Lall, S (1973) The income and balance of payments effects of private foreign investment in manufacturing: case studies of Colombia and Malaysia. UNCTAD.\n\nOther"}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://spartacus-educational.com/Jmayhew.htm", "page_content": "Henry Mayhew\n\nHenry Mayhew, the son of Joshua Mayhew, a London lawyer, and Mary Ann Fenn, was born on 25th November 1812. After being educated at Westminster School, he worked with his father for three years. However, it was a stormy relationship. According to his biographer, Deborah Vlock: \"One of seventeen children and the fourth of seven sons, Mayhew failed to live up to his father's expectations; a prominent solicitor and a rigid patriarch, Joshua Mayhew apprenticed each of his sons to the law, and each, except one, eventually pursued other interests. Almost all of them, including Henry, were disinherited as a result (after his father's death, Henry received a legacy of £1 per week). Henry was particularly ill-suited to legal study, and nearly caused Joshua's arrest by neglecting to file some important documents.\"\n\nIn 1831 Mayhew decided to become a writer. For the next eight years worked for the journal, Figaro in London. Mayhew also wrote a well-received play, The Wandering Minstrel (1834). He also co-wrote But However (1838).\n\n\n\nIn 1841 Mayhew joined with Mark Lemon, a fellow journalist and playwright, to start a a new journal, Punch Magazine. The two men were initially joint-editors and recruited a group of talented writers and illustrators to join the venture, including Douglas Jerrold, Shirley Brooks, Angus Reach, John Leech and Richard Doyle. In the early years the magazine sold about 6,000 copies a week. However, sales of 10,000 were needed to cover the costs of the venture.\n\nIn December 1842 it was decided to sell the magazine to Bradbury & Evans. Mark Lemon was reappointed as editor and Henry Mayhew was given the role of \"suggester-in-chief\". Mayhew wrote his last article for Punch Magazine in February, 1845. Mayhew now launched Iron Times, a railway magazine that lost him so much money that in 1846 he ended up in the Court of Bankruptcy.\n\nThe summer of 1849 saw a serious outbreak of cholera. Within three months, an estimated 13,000 people in London died from the disease. On 24th September, Mayhew wrote an article on the impact of cholera on the working-class district of Bermondsey. Soon afterwards Mayhew suggested to the editor, John Douglas Cook, that the newspaper should carry out an investigation into the condition of the labouring classes in England and Wales. Cook agreed and recruited Angus Reach, Charles Mackay and Shirley Brooks to help Mayhew collect the material.\n\nThe first article appeared on 18th October 1849. Mayhew concentrated on London and the rest of the team were assigned other parts of England and Wales to investigate. An article appeared every day for the rest of the year and for most of 1850. Mayhew wrote two of these a week and the rest were written by Reach, Brooks, Mackay and some unnamed provincial journalists.\n\nThe articles in the Morning Chronicle received a lot of attention. The Economist attacked the publication of such material that it believed was \"unthinkingly increasing the enormous funds already profusely destined to charitable purposes, adding to the number of virtual paupers, and encouraging a reliance on public sympathy for help instead on self-exertion.\"\n\nDouglas Jerrold wrote to a friend in February, 1850: \"Do you read the Morning Chronicle? Do you devour those marvellous revelations of the inferno of misery, of wretchedness, that is smouldering under our feet? We live in a mockery of Christianity that, with the thought of its hypocrisy, makes me sick. We know nothing of this terrible life that is about us - us, in our smug respectability. To read of the sufferings of one class, and the avarice, the tyranny, the pocket cannibalism of the other, makes one almost wonder that the world should go on. And when we see the spires of pleasant churches pointing to Heaven, and are told - paying thousands to Bishops for the glad intelligence - that we are Christians!. The cant of this country is enough to poison the atmosphere.\"\n\nChristian Socialists, such as Charles Kingsley, Thomas Hughes and F. D. Maurice praised Mayhew and the Morning Chronicle. Radicals also approved and newspapers such as the Northern Star and the Red Republican published substantial extracts from these reports. Octavia Hill was one of those who read Mayhew's work and was inspired into action. It is also claimed that the articles influenced the writings of Charles Dickens.\n\nHenry Mayhew's collected articles on poverty were eventually published as London Labour and London Poor (1851). Mayhew's investigation into the plight of the poor revealed the impact that unemployment, starvation and disease was having on the working class. Deborah Vlock has argued: \"It remains a seminal study of London street life in the middle of the century, and has been often reprinted. It is required reading for anyone interested in the minutest details of Victorian lower-class life, such as what kinds of foods were sold on the streets, how financial transactions with street-sellers were conducted, and how vendors ‘cried’ their wares.\"\n\n\n\nHenry Mayhew\n\nIn a talk he gave to a group of tailors Mayhew attempted to defend the moral behaviour of the working-classes: \"It is easy enough to be moral after a good dinner beside a snug coal fire, and with our hearts well warmed with fine old port. It is easy enough for those that can enjoy these things daily to pay their poor-rates, rent their pew, and love their neighbours as themselves: but place the self-same \"highly respectable\" people on a raft without sup or bite on the high seas, and they would toss up who should eat their fellows. Morality on £5,000 a year in Belgrave Square is a very different thing to morality on slop-wages in Bethnal Green.\"\n\nIn 1856 Mayhew started a new series of articles for the Morning Chronicle entitled The Great World of London. The articles appeared monthly and those dealing with crime and punishment were collected together and published as a book called The Criminal Prisons of London (1862). Another book based on newspaper articles he had written was published as London Characters (1874).\n\nMayhew wrote books on a wide variety of different subjects including novels, The Good Genius (1847) and Whom to Marry (1848), and historical work such as German Life and Manners in Saxony (1864) and The Boyhood of Martin Luther (1865).\n\nHenry Mayhew died on 25th July, 1887, and was buried at Kensal Green."}, {"url": "https://victorianweb.org/history/mayhew.html", "page_content": "Journalist and writer. He was a lawyer's son and a pupil at Westminster, one of the great public schools. According to one story he went to sea for a time as a boy. Back in London he worked for three years in his father's office until he was fired for negligence. In 1841 he co-founded Punch with Mark Lemon, but lost control the following year. His railway magazine, The Iron Times, bankrupted him. As a result he was disinherited. He struggled to make a living for the rest of life. He was a playwright (of farces), comic novelist, author of children's books, German travel books, and a biographer. He married Jane Jerrold, the daughter of Douglas Jerrold, the writer. They had two children.\n\nIn 1849 he wrote an article about an outbreak of cholera. It led to a series of articles in the Morning Chronicle which were collected in three volumes in 1851 under the title London Labour and the London Poor. They covered an astonishing array of people scraping a living not only on the streets of London, but in the sewers, on the foreshore, on the river and docks: patterers and chaunters (see \"Rhyming Slang\"), mudlarks, toshers (scavengers in the sewers), Punch and Judy men, pure finders (they collected dog droppings for tanneries), rat catchers, dog-nappers and swindlers. Eighty articles in all. A fourth volume, on beggars, thieves, and prostitutes, came out in 1861.\n\nMayhew was a portly bald-headed Public School man yet he was able to extract secrets from professionally secretive people. London Labour influenced the Christian Socialists and, it is said, Dickens.\n\nAnother outbreak of cholera, in Soho this time, in 1854 led to the discovery that the disease is water borne. Helped by the local vicar, Dr John Snow showed that the epicentre of the outbreak was the communal water pump in Broad (now Broadwick) Street. The pump — or a replica of it — is still there, and so is a costermongers' street market around the corner in Berwick Street.\n\nReferences\n\nHotten, John Camden, A Dictionary of Modern Slang, Cant and Vulgar Words. 2nd Edition, 1860\n\nMayhew, Henry. London Labour and the London Poor. Vol 1, 1851\n\n\n\nVictorian\n\nWeb\n\n\n\nPolitical\n\nHistory\n\n\n\nEconomics"}, {"url": "https://kids.britannica.com/students/article/Richard-Mayhew/312399", "page_content": "(born 1924). American landscape painter Richard Mayhew produced impressionistic works in both muted and vivid colors. He was praised for concentrating on landscapes when the genre was unpopular. The Hudson River school (which celebrated the natural beauty of the American landscape), the Barbizon school (which championed naturalism), and impressionists such as Claude Monet all influenced Mayhew’s work.\n\nMayhew was born on April 3, 1924, in Amityville, New York, to parents of Native American and African American descent. He moved to New York, New York, in the mid-1940s. After serving in the U.S. Marines during World War II, Mayhew worked as a medical illustrator. He also began taking classes at the Brooklyn Museum of Art and the Pratt Institute, which are both located in Brooklyn, New York. During this time Mayhew supplemented his income by illustrating children’s books and by performing in jazz groups. His first solo exhibition was in 1955 at the Brooklyn Museum of Art. These early works were praised for his use of color and light.\n\nIn the late 1950s and early ’60s, Mayhew received several grants, which allowed him to study in Europe. He returned to the United States in 1962, at which time he met frequently with a group of African American artists in New York. They discussed the problem of artists and the civil rights movement in the 1960s. The group, which was known as Spiral, included such artists as Romare Bearden, Hale Woodruff, Charles Alston, and Norman Lewis. Some members of the group believed it was necessary for African American artists to create protest paintings as evidence of their solidarity with the rest of the black community. Although Mayhew’s paintings were not political in tone, he used his landscapes to express feelings, often of a renewal brought forth after surviving racial oppression. During this time Mayhew also began to experiment with paint color, applying opaque paint on top of colored paint so that the base layer showed through.\n\nFrom the early 1960s through the mid-’70s Mayhew taught at various schools, including the Brooklyn Museum of Art for five years. In 1977 he became a professor of visual arts at Pennsylvania State University. Mayhew retired from teaching in 1991 but continued to paint into the 21st century. His later works incorporate vivid colors and often focus on a lone tree. Mayhew’s work was exhibited widely and was in the collections of numerous American museums and universities."}, {"url": "https://ripper.london/victorian-london/henry-mayhew/", "page_content": "MAYHEW, HENRY (1812–1887), English author and journalist, son of a London solicitor, was born in 1812. He was sent to Westminster school, but ran away to sea. He sailed to India, and on his return studied law for a short time under his father. He began his journalistic career by founding, with Gilbert à Beckett, in 1831, a weekly paper, Figaro in London. This was followed in 1832 by a short-lived paper called The Thief; and he produced one or two successful farces. His brothers Horace (1816–1872) and Augustus Septimus (1826–1875) were also journalists, and with them Henry occasionally collaborated, notably with the younger in The Greatest Plague of Life (1847) and in Acting Charades (1850). In 1841 Henry Mayhew was one of the leading spirits in the foundation of Punch, of which he was for the first two years joint-editor with Mark Lemon. He afterwards wrote on all kinds of subjects, and published a number of volumes of no permanent reputation—humorous stories, travel and practical handbooks. He is credited with being the first to “write up” the poverty side of London life from a philanthropic point of view; with the collaboration of John Binny and others he published London Labour and London Poor (1851; completed 1864) and other works on social and economic questions. He died in London, on the 25th of July 1887. Horace Mayhew was for some years sub-editor of Punch, and was the author of several humorous publications and plays. The books of Horace and Augustus Mayhew owe their survival chiefly to Cruikshank’s illustrations.\n\nIn the World of London, indeed, we find almost every geographic species of the human family. If Arabia has its nomadic tribes, the British Metropolis has its vagrant hordes as well. If the Carib Islands have their savages, the English Capital has types almost as brutal and uncivilized as they. If India has its Thugs, London has its garotte men. Henry Mayhew, The Criminal Prisons of London (1862), p. 5\n\nHenry Mayhew was born on 25 November 1812 in London, one of seventeen children of Joshua Mayhew. He was educated at Westminster School before running away from his studies to sea. He then served with the East India Company as a midshipman on a ship bound for Calcutta. He returned after several years, in 1829, becoming a trainee lawyer in Wales. He left this and became a freelance journalist. He contributed to The Thief, a readers’ digest, followed quickly by editing a weekly journal – Figaro in London. Mayhew reputedly fled his creditors and holed up at The Erwood Inn, a small public house in the village of Erwood, south of Builth Wells in Wales.\n\nIn 1835 Mayhew found himself in a state of debt and, along with a fellow writer, escaped to Paris to avoid his creditors. He spent his time writing and in the company of other writers including William Thackeray and Douglas Jerrold. Mayhew spent over ten years in Paris returning to England in the 1850s whereby he was involved in several literary adventures, mostly the writing of plays. Two of his plays – But, However and the Wandering Minstrel – were successful, whilst his early work Figaro in London was less successful.\n\nOn 17 July 1841 Mayhew cofounded Punch magazine. At its founding the magazine was jointly edited by Mayhew and Mark Lemon. The two men hired a group of writers and illustrators, including Douglas Jerrold, Angus Reach, John Leech, Richard Doyle and Shirley Brooks. Initially it was subtitled The London Charivari, this being a reference to a satirical humour magazine published in France under the title Le Charivari (a work read often whilst Mayhew was in Paris).\n\nPunch was an unexpected success, selling about 6,000 copies a week in the early years. However, sales of as many as 10,000 issues a week were required to cover all costs of the magazine. In December 1842, the magazine was sold to Bradbury and Evans; Mayhew resigned as joint editor, and he continued at the magazine as “suggestor in chief” with Mark Lemon re-appointed as editor. Mayhew eventually severed his connection with the magazine, writing his last article in February 1845. His brother Horace stayed on the board of Punch until his own death.\n\nThe Punch years gave Mayhew the opportunity to meet talented illustrators who he later employed to work from daguerreotypes on London Labour and the London Poor. Following Punch magazine, Mayhew launched Iron Times, a railway magazine. However this venture lost Mayhew so much money that he was forced to appear in a Court of Bankruptcy in 1846.\n\nIn 1842 Mayhew contributed to the pioneering Illustrated London News. By this time Mayhew had become reasonably secure financially, had settled his debts and married Jane Jerrold (d. 1880), the daughter of his friend Douglas Jerrold.\n\nLondon Labour and the London Poor is today the work for which Myhew is best known. Originally appearing as a series of articles, the material was initially collected into three volumes in 1851; the 1861 edition included a fourth volume, co-written with Bracebridge Hemyng, John Binny and Andrew Halliday, on the lives of prostitutes, thieves and beggars. This Extra Volume took a more general and statistical approach to its subject than Volumes 1 to 3.\n\nMayhew wrote in volume one: “I shall consider the whole of the metropolitan poor under three separate phases, according as they will work, they can’t work, and they won’t work”. He interviewed everyone – beggars, street-entertainers (such as Punch and Judy men), market traders, prostitutes, labourers, sweatshop workers, even down to the “mudlarks” who searched the stinking mud on the banks of the River Thames for wood, metal, rope and coal from passing ships, and the “pure-finders” who gathered dog faeces to sell to tanners. He described their clothes, how and where they lived, their entertainments and customs, and made detailed estimates of the numbers and incomes of those practising each trade. The books show how marginal and precarious many people’s lives were, in what, at that time, was the richest city in the world.\n\nLater works included The Criminal Prisons of London (1862), The Boyhood of Martin Luther (1863), German Life and Manners as Seen in Saxony at the Present Day (1865), and London Characters (1881)\n\nHe died on 25 July 1887."}, {"url": "https://www.howold.co/person/thomas-mayhew/biography", "page_content": "Thomas Mayhew Biography\n\nThis article is about the early Puritan settler in M*achusetts. For the English cabinetmaker, see Ince and Mayhew.\n\nGovernor Thomas Mayhew, the Elder (March 31, 1593 – March 25, 1682) established the first European settlement on Martha's Vineyard, Nantucket and adjacent islands in 1642. He is one of the editors of the Bay Psalm Book, the first book published in the Thirteen Colonies. His *istant Peter Foulger was the grandfather of Benjamin Franklin.\n\nBiography\n\nMarker for Thomas Mayhew homestead in Watertown, M*achusetts\n\nThomas Mayhew was born in Tisbury, in the county of Wiltshire in England. He married Anna (also called Hanna and Abigail) Parkhurst, born about 1600, in Hampshire, England, daughter of Matthew Parkhurst. In 1621 they had a son, Thomas, the Younger, baptised in Hanna's home town of Southampton. Two years later they had another child, Robert Mayhew, baptized in Tisbury.\n\nThe family left England in 1631/2 during the Great Migration of Puritans that brought 20,000 settlers to M*achusetts in thirteen years. Through the agency of Matthew Cradock of London, Mayhew had been appointed to manage properties in Medford, M*achusetts, and to engage in trade and shipbuilding. In or about 1633, Mayhew's wife Anna died, and about 1634 he returned to England for a business meeting with Cradock. While in England, he married Jane Gallion (1602–1666), and brought her back to New England with him. Their daughter Hannah was born in 1635, and three more daughters, Mary (1639), Martha (1642), and Bethiah, followed. Martha is the 7th great grandmother to the world-famous singer and songwriter Taylor Swift.\n\nIn 1641, Thomas secured Martha's Vineyard, Nantucket, the Elizabeth Islands, and other islands as a proprietary colony from Sir Ferdinando Gorges and the Earl of Stirling. This enabled him to transfer his business operations there. With the help of his son Thomas, a settlement was established and farming and whaling enterprises were begun.\n\nThe Mayhews had great success in regard to Indian policy. Because of the fair treatment of the Indians there, the colony was protected from the bloodshed that occurred elsewhere, in King Philip's War. In 1646, the General Court of M*achusetts directed the religious leaders of the colony to select two among them to serve as missionaries to the natives. So great was the interest aroused by this venture that a society was formed in England also to support the missionaries. Unfortunately a m*ive conflict broke out, called King Philip's War (1675–76), which resulted in many deaths of both the settlers and the natives. However, three prominent names appear. They are: John Eliot (known as the Apostle to the Indians); Thomas Mayhew (who was already ministering to the natives); and, three generations later, Eleazar Wheelock, who established \"Doctor Wheelock's Academy for the promotion of Christianity and civility among the savage Indians of this continent\" (now known as Dartmouth College).\n\nIn 1657, the younger Thomas Mayhew was drowned when a ship he was travelling in was lost at sea on a voyage to England. Mayhew's three grandsons Matthew Mayhew (born 1648), Thomas (born 1650), John (born 1652), and other members of his family *isted him in running his business and government.\n\nTranscription of Watertown marker: \"HERE BY THE ANCIENT FORDTHE LANDING AND THE WEIRWAS THE HOMESTALL OFTHOMAS MAYHEW:A LEADER IN WATERTOWN AFFAIRSFROM 1635 TO 1645.AFTERWARDS WITH HIS SON,THE REV. THOMAS MAYHEW,HE LABORED AMONG THE INDIANSAT MARTHA'S VINEYARD.\"\n\nColonizing Dukes County\n\nIn 1641, while engaged in business ventures in the vicinity of Boston, Mayhew succeeded in acquiring the rights to the islands that now cons*ute Dukes County and Nantucket County: Martha's Vineyard, Nantucket, and the Elizabeth Islands. He bought the County for 40 pounds and two beaver skin hats from William Alexander, the 2nd Earl of Stirling. To resolve a conflicting ownership claim, he also paid off Sir Ferdinando Gorges, thereby acquiring a clear *le.\n\nMayhew established himself as governor of Martha's Vineyard in 1642 and sent his son, Thomas the Younger, with about forty families to settle there. He himself followed four years later. Together he and the younger Thomas established Martha's Vineyard's first settlement and called it Great Harbor, now Edgartown.\n\nRelations with the natives\n\nMayhew and his fellow settlers found a large and economically stable native population of about 3,000 living in permanent villages, led by four sachems (chiefs). Relations between the first settlers and their Wampanoag neighbors were peaceful and courteous. Under the leadership of his son, a minister, they ins*uted a policy of respect and fair dealing with the Wampanoag natives that was unequaled anywhere. One of the first of Mayhew's orders was that no land was to be taken from the native islanders, the Wampanoags, without their consent or without fair payment. From this time forward, the colonial settlers and Wampanoag lived without the bloodshed that marked the history of European colonies elsewhere in the New World.\n\nFrom the beginning, Mayhew had worked to preserve the original political ins*utions of the native population. Religion and government were distinct matters, he told the chiefs. When one of your subjects becomes a Christian, he is still under your jurisdiction. Wampanoag land was guarded against further encroachment by white settlers. So successful were these policies that during the bloody battles of King Philip's War, in 1675-1676, the Vineyard's native population never stirred, although they outnumbered the settlers on the island by twenty to one.\n\nSpreading religion\n\nBy 1660 there were about 85 white people living peaceably among the natives, earning their living by farming and fishing. The Mayhew family, which from that time forth became an integral part of island history, wanted to share its religion with the natives, but the Wampanoags were not too interested, having their own spiritual faith. However, once it was clear that, though Mayhew was the governor, the sachems remained in charge of their people, some became curious about the white man's God. When a native named Hiacoomes expressed an interest, Mayhew invited him into his home and instructed him in English and Christianity. Hiacoomes, in return, taught Mayhew the native language. As soon as Mayhew could converse with the natives, he would some days \"walk 20 miles through uncut forests to preach the Gospel...in wigwam or open field\".\n\nThere is a stained gl* window in the baptismal font in the National Cathedral in Washington D.C. depicting Rev. Thomas Mayhew Jr. baptizing a native.\n\nChange was in the air though, for the world outside this small island was unsettled. There were more visitors from off island and some stayed, challenging the Mayhew government, while Baptists and Methodists arrived to make converts from the established Congregational Church.\n\nFrom colony to aristocracy\n\nThrough a maze of conflicting land grants, changing political allegiances, and settler unrest, Mayhew, who styled himself \"Governour Mayhew\", began to rule his island with an iron hand. The most serious threat to his control came in 1665 when Martha's Vineyard was included in the lands placed under the king's brother, the Duke of York. After much delay, a settlement, worked out in 1671, confirmed the Mayhew patent and named Mayhew \"Governour and Chiefe Magistrate\" for life. At the same time, a patent was issued erecting the Manor of Tisbury in the southwestern part of the island. The Governor and his grandson Matthew were made \"joint Lords of the Manor of Tisbury\", and the inhabitants became manorial tenants subject to the feudal jurisdiction of the Mayhews. This full-fledged feudal manor appears to have been the only such ins*ution actually established in New England.\n\nThe attempt of the Mayhews to create a hereditary aristocracy on the Vineyard met with increasing opposition as more and more colonists arrived. When the Dutch temporarily recaptured New York in 1673, open rebellion broke out and this lasted until the colonial government regained control over New York and restored the authority of the Mayhews on the island. The old patriarch died in 1682, at the age of eight-nine. Nine years later the political rule of his family ended when Martha's Vineyard was annexed by M*achusetts after the Glorious Revolution in England, but the manorial land tenure remained. Although some of the Mayhews clung to the \"pleasant fiction\" of their manorial rights almost until the American Revolution and received token quit rents as late as 1732, feudalism on Martha's Vineyard died the same slow, lingering but certain death it did elsewhere in the colonies.\n\nMissionary work\n\nKenneth Scott Latourette has concluded that the Missionary Mayhews of Martha's Vineyard represent what is probably the longest and most persistent missionary endeavor in the annals of all Christendom. The elder Thomas Mayhew, known for his missionary work, was not concerned for Indian souls when he settled on his island; he sought only to improve his social and economic position. His son, Thomas Mayhew the Younger, is credited with the launching an Indian mission. Like his father, he had emigrated from England. Somewhere, he received a liberal education, apparently from private tutors, and after moving to the Vineyard to begin the white settlement there he became pastor of the small Anglican church as well as acting governor in his father's absence. He soon discovered that he could not refuse the challenge he found among the three thousand Pokanaukets, a branch of the mainland Narragansetts, who far outnumbered the whites, so an effective settlement required friendly relations with the Indians. But Thomas the Younger appears to have been motivated largely by spiritual concern, while his father and other members of the family enjoyed the practical results of the Indian mission. The son gradually abandoned most of his secular tasks and spent the remainder of his life among the natives. Progress was slow at first, but by the end of 1652 there were 283 converts, a school for Indian children, and two Indian meetings each Sabbath. The Praying Indians of Martha's Vineyard who said grace before meals became a topic of conversation on both sides of the Atlantic. Thomas Mayhew the Younger carried on his missionary work with little heed for his personal fortunes. As the elder Mayhew put it, his son had followed this work \"when 'twas bare with him for food and rayment, and when indeede there was nothing in sight any waies but Gods promises.\" The situation was improved somewhat by the formation in 1649 of a London missionary society, usually called the New England Company, which in a few years began to provide substantial aid for the Mayhews and other missionaries.\n\nIn the fall of 1657, Thomas Mayhew the Younger sailed for England on a trip combining an appeal for missionary funds with personal business. After leaving Boston Harbor, the ship was never seen again. The death of his only son at the age of thirty-six was a heavy blow to Mayhew and greatly increased the burdens he carried in old age. He made repeated efforts to find a replacement to continue his son's ministry to the Indians, but no minister who knew the language or was willing to learn could be induced to settle permanently on the island, so at the age of sixty Mayhew, who had started as a merchant, then turned landed proprietor, became a missionary in his son's place. For the next twenty-five years he traveled on foot as far as twenty miles to preach once a week at the Indian *embly or to visit the native camps.\n\nDeath\n\nWhen the venerable Governor Mayhew became ill one Sunday evening in 1682, he calmly informed his friends and relatives that \"his Sickness would now be to Death, and he was well contented therewith, being full of Days, and satisfied with Life\". His great-grandson, Experience Mayhew, a son of John, was only eight at the time, but he clearly remembered being led to the bedside to receive from the dying man a blessing \"in the Name of the Lord\". Matthew Mayhew, the eldest grandson, succeeded his military and civil duties. Rev. John Mayhew, the youngest grandson and grandfather of Jonathan Mayhew, continued his missionary work to the Indians. Thomas, another grandson, became a Judge of M*achusetts.\n\nHis descendant Jonathan Mayhew was a prominent 18th-century Boston clergyman who coined the phrase \"No taxation without representation.\"\n\nDescendants\n\nMatthew Mayhew (1648–1710), Martha's Vineyard colonist, politician and missionary\n\nExperience Mayhew (1673–1758), Martha's Vineyard colonist and missionary\n\nJoseph Mayhew (1709/10–1782), Martha's Vineyard colonist, politician, and missionary\n\nJonathan Mayhew (1720–1766), Congregationalist minister and Patriot\n\nJonathan Mayhew Wainwright I (1792–1854), Episcopal Bishop of New York\n\nCharles Tupper (1821–1915), 6th Prime Minister of Canada\n\nJonathan Mayhew Wainwright II (1821–1863) U.S. Navy officer during the American Civil War\n\nElla Edes (1832–1916) American writer, newspaper correspondent, and Catholic activist\n\nJonathan M. Wainwright (1883–1953), U.S. Army general during World War II\n\nRufus Wilmot Griswold (1815-1857), American anthologist, editor, poet and critic\n\nNathan W. Mayhew (1935-2017) - Newspaper pressman\n\nStephanie W. Knuth (ne Mayhew) (1963-2020) - U.S. Army Veteran\n\nJennifer E. Correa (ne Mayhew) (1964) - U.S. Airforce Veteran, Real Estate *le Agent, Small business owner\n\nJosephine L. Doyle (ne Mayhew) (1965) - Public servant (retired) - County Planning Division\n\nNathan M. Mayhew (1971) - Commercial transportation driver\n\nTaylor Swift (*1989), singer-songwriter, pop star\n\nReferences\n\nCharles Edward Banks, The History of Martha's Vineyard (three-volumes, 1911)\n\n(three-volumes, 1911) Charles W. Akers, Called Unto Liberty, A Life of Jonathan Mayhew (1964)\n\n(1964) Christopher Burns, Island Wilderness; Imagining the Early Years of Martha's Vineyard\n\nEdward Winslow, Glorious Progress of the Gospel Amongst the Indians in New England (1649)\n\nExternal links\n\nSteve's Genealogy Site\n\nIndian Converts Collection\n\nPrimary sources"}, {"url": "https://link.springer.com/article/10.1007/s10560-019-00640-9", "page_content": "Teachers, foster parents, and former foster youth described the educational barriers and supports that foster youth encounter. We analyzed participants’ responses with an ecological lens (Bronfenbrenner, 1986) to determine the (a) Challenges and Supports in the Youth-School Relationship (Microsystem) and (b) Challenges and Supports in the Foster Home-School Relationship (Mesosystem). Challenges in the Youth-School Relationship included differential treatment, teacher misunderstanding, and school is not a priority. Challenges in the Foster Parent–School Relationship included complexity of accommodations, strained relationships with teachers, and lack of school–home partnership.\n\nChallenges in the Youth-School Relationship (Microsystem)\n\nMost teachers (n = 18; 82%), foster parents (n = 14; 82%), and former foster youth (n = 8; 67%) shared the opinion that foster youth’s strained relationships with their schools creates a barrier to their academic success. This disconnect between foster youth and schools occurs for several reasons, according to participants. Specifically, they described the following challenges to foster youth’s ability to form strong relationships with schools, which in turn impeded their academic success: differential treatment (lower academic expectations, pity), misunderstanding/lack of trauma-sensitive approach, and need to prioritize other life circumstances ahead of education.\n\nDifferential Treatment: Lower Expectations\n\nFoster parents, teachers, and former foster youth shared the perception that teachers often appear to have low(er) expectations for foster youth’s abilities and performance in school. Foster parents explained that they wished that their children were treated with the same expectations as children living with their biological parents; they wanted their children to be inspired to be their best, rather than being allowed to float through the system to graduation. Jerome, a foster father, expressed:\n\nJohnny needs to read at the fourth-grade level, by the fourth grade. Not just pass him on… And in a lot of ways, the schools have failed to realize that, particularly when it comes to foster children because the expectations are very low when it comes to foster kids.\n\nHe went on to say that rather than to express sympathy or pity to foster children, teachers should, “… build them up, make them feel like they can conquer the world.”\n\nOn a similar note, teachers expressed frustration with co-workers and administration who pressure them to promote students, regardless of whether they have grasped the material. This reveals how teachers faced pressure from broader systems which in turn likely affected the quality of education that foster youth received. Ken, a vocational high school teacher, exclaimed, “It’s ‘sweep ‘em under the rug, make sure they graduate, so our graduate numbers are up,’ you know, and— ‘The hell with the kid and the rest of their life!’” Ken and others described a school environment where it felt that the school’s reputation and graduation rates were prioritized over ensuring that students in foster care learn the material necessary for success, which has long-term impacts on foster youth’s outcomes.\n\nDifferential Treatment: Pity\n\nMost former foster youth also expressed feeling that teachers treated them differently from other students, specifically with pity, which led to a non-existent or at least more distant relationship with their educators than their peers who were not in foster care. Lauren, a former foster youth, explained that the pity she experienced from her teachers because she was in foster care contributed to her lack of trust in them. She said, “That shit [pity] makes it [school] worse so I wouldn’t even like—I don’t—I don’t trust teachers.” Two youth noted that they felt embarrassed when teachers would treat them like a “charity case” by bringing them second-hand clothing.\n\nIn contrast, Layla, a former foster youth, described being recognized at her high school graduation by teachers for her achievements in school and how it impacted her in a positive way. She described the event:\n\nThe teachers select three students and I was one of them… they just talked about some of my obstacles and how I overcame them. They gave me a flower. That made me feel happy that out of so many kids, I was one of the ones that got picked to be talked about.\n\nLayla’s narrative demonstrates how foster youth can feel more connected to their schools when teachers recognize their efforts, despite their struggles, rather than express pity.\n\nTeacher Misunderstanding: Lack of Trauma-Sensitive Approach\n\nTeachers’ misinterpretation of behavior was also described as a strain on the relationship between students in foster care and the schools they attended. Foster parents perceived teachers as being ill-equipped to handle their foster children’s behaviors, cognitive delays, and traumatic histories. For example, Shannon, a foster mother, stated:\n\nThat special ed [sic] teacher, I’m not impressed with. I find her to be very cold. I find her to be very punitive to him. She’s always giving him lunch suspensions. I’m like, ‘You can’t punish him for things he truly cannot control. If it’s something that we’ve seen that he can control, then maybe there should be a consequence. Most of the stuff he’s dealing with now he truly cannot control; truly.’\n\nShannon expresses frustration with what she perceives as an unfair and misplaced (mis)attribution of her foster son’s behavior as purposeful and calculated, rather than reflecting a difficult early life history, which undermined her confidence and faith in this teacher to be a supportive force in his education.\n\nSome foster parents explained that they took a proactive approach and gave teachers “a heads up” about tips on how to effectively handle their children’s disruptive behavior or how to prevent the behavior altogether, before their children were entering the classroom for the first time. For example, foster parents described informing teachers about the language they used at home to discuss consequences and expectations so that the student understands what is and is not appropriate at school. Susan, a foster parent, explained that she spoke with her child’s teachers about coping strategies she has taught her child to use at school, “One of the tools is, if you find yourself getting out of control, remove yourself from the situation. Go for a walk, find a quiet space, ask if you can leave.” Other foster parents were open with teachers about their child’s abuse or neglect history to help the teacher recognize signs of distress that may appear to be stemming from disrespect.\n\nLike foster parents, former foster youth explained that because they felt that their teachers misunderstood their problematic behaviors and interpreted through the lens of disobedience or malice, it was a struggle to form connections with them. Some described feeling that they were categorized as a “problem kid,” “bad kid,” and even “garbage” because teachers and administrators tried to “put them in a box” based on their foster care status. Others reflected on times when teachers reached out to learn more about their situation. Dennis reported, “They [teachers] saw that I was kind of down and they took me aside in the hallway and asked what’s wrong and stuff like that. Cause my life’s kind of difficult. It’s a weird situation.” Thus, youth voiced the importance for teachers to consider that a student in foster care may have an underlying trauma history that impacts their ability to function appropriately at school, rather than taking a perspective that the student is acting purely out of choice or malcontent. What these students need to succeed at school, according to youth, is an approach that is sensitive to their histories.\n\nSchool Is Not (and Cannot Be) Top Priority\n\nAn additional challenge to foster youth’s academic success was their difficulty of prioritizing school in general. Foster parents, teachers, and the youth themselves noted that although they had the desire to do well in school, their life circumstances (e.g., need for a stable home and family) prevented them from being able to focus on schoolwork. Anna, a high school psychology teacher, explained:\n\nEducation is not the biggest concern for those students. It’s their welfare, their safety…if you look at Maslow’s Hierarchy, they don’t care about anything until they feel loved. Until they have their needs taken care of, until they feel safe and they feel loved. And then, education will become something that they’re concerned about.\n\nFoster parents agreed that youth in foster care often struggle with schoolwork, not because of lack of effort, but because they have “bigger fish to fry” (e.g., their history of trauma and separation from their biological families). Madeline, a foster parent, empathically stated, “If you have all of these other things on your mind, how can you be expected to care about your spelling test?” Former foster youth also recognized that their mental health and family stressors negatively impacted their school performance. Angelina explained how her mood and motivation were affected by being removed from her biological family home and placed into foster care: “I knew I wasn’t happy. I didn’t want to go to school; I didn’t want to do anything. It was just that and I wasn’t motivated at all. It stopped me from doing the things I wanted to do.” Thus, foster youth find it difficult and sometimes impossible to prioritize school when they face other more important obstacles that stem from perceived lack of safety and instability at home.\n\nChallenges in the Foster Parent–School Relationship (Mesosystem)\n\nIn addition to exploring the challenges that arise in relationships between foster youth and their schools, it is also important to address the impact of the relationship between foster parents and schools on foster youths’ academic experiences. Teachers (n = 19; 86%) and foster parents (n = 16; 89%) described a disconnect (i.e., a lack of mutual understanding, a lack of communication, and a lack of agreement) in the relationship between foster parents and schools as a potentially negative influence on a foster child’s school performance. These participants explained that (a) obtaining special education accommodations for foster youth was complicated for foster parents; and (b) school–foster home communication was strained.\n\nComplexity of Accommodations\n\nMost foster parents of children with special needs expressed frustration with the complexity of the special education process, which is sometimes exacerbated for foster parents because the children may have already had a plan in place before they entered their foster home. For instance, Connie explained:\n\nWhen you first become a foster parent, you have no idea. You have no idea…At first, you go in there and you sit in the meetings and you’re very meek and you think that the school is doing the best that they can for the kid. You accept whatever they say. You sign the IEP [Individualized Education Plan] and you go on.\n\nShe echoed many foster parents’ concerns that they are intimidated by the special education process and although they want to do what is best for their children, they put their trust in the school and often do not question their decisions regarding accommodations. Other foster parents, like Francis, took advantage of the opportunity to have a DCF educational advocate (i.e., a representative from DCF with specialization in the education system) accompany her to IEP meetings because, according to her, “…you have to be a lawyer to figure it all out. [Laughs]. I need somebody. I’m not stupid by any means, but this is out of my league.” However, schools are not always receptive to foster parents bringing their “team” to meetings, which creates an additional barrier for foster parents. As Francis went on to describe:\n\nI’ll be there [IEP meeting] with the advocate. I’m also bringing two DCF workers. When I told the school, she emailed me back and she said, ‘This is not a personal thing for you to invite your friends to come along.’ I thought, Oh my gosh. I didn’t even bother to argue with her.\n\nAnother parent described that when she told the school she was going to be accompanied by her foster child’s attorney at the IEP meeting, the school delayed the meeting because they “wanted their attorney there too.” These foster parents sometimes perceive the special education process as intimidating, confusing, and frustrating, which affects their child’s ability to obtain appropriate services.\n\nFoster Parents: Strained Relationships with Teachers\n\nIn addition to the difficulties with formal special education meetings and accommodations, foster parents described strained relationships with teachers as problematic for foster youth’s school experiences. Their perspective was that teachers often did not consider them “real” parents who “knew the ins and outs” of their foster children. In turn, this sometimes meant that teachers were not adequately communicating with foster parents about their children’s performance in school, according to some foster parents. Further, the perception that teachers did not respect foster parents led to uncomfortable confrontations and disagreements between foster parents and teachers regarding how best to educate the children. Elaine, a foster parent, explained that she went to great lengths to communicate her child’s special needs with the school and that his history of trauma was important to consider when managing his behavior. However, on a rough day, she said:\n\nMy kid went into flight, fight, or fright and they didn’t know what to do with him… I’m reminding them that my son can never be put in one of those [isolated time out room] because of the trauma that he’s been put through, that that will just turn a bad situation worse. That’s not going to calm him down. So, this particular day, they put him there. He’s in the time out space, he’s screaming.\n\nElaine’s experience is one that other foster parents shared; they explained that their suggestions for how teachers can handle their traumatized children in the classroom were unheard and disregarded, even though they felt they were specific about what might trigger their child (e.g., isolation, physical contact), gave schools empirical data, and provided suggestions from medical professionals and therapists. Similar to former foster youth, foster parents voiced that they would like to be treated equally to biological parents with regard to all aspects of their children’s educational experiences. That is, foster parents would like schools to provide the same level of respect and communication to them as they do for other parents to ensure that children in care receive the same educational experiences as their peers.\n\nTeachers: Lack of Home–School Partnership\n\nSome teachers, on the other hand, explained that they had also felt unheard and disrespected by foster parents. Some described their efforts to work as a team with foster parents to improve their child’s behavior and/or academic performance at school but noted that they were met with uninvested or absent foster parents. For example, some said they rarely “get a call back” from foster parents, though they believe that the child would improve if the foster parents were more involved with the education system. Lisa put it simply, “If the communication isn’t there between the foster parents and the school, if that communication breaks down in any way, the kid can end up lost.” In addition, Maria, a teacher, expressed that it seemed like attending IEP meetings was not “part of the job description” for foster parents, insomuch as she had never seen a foster parent at a meeting. Other teachers pondered whether people become foster parents for the “extra income,” hypothesizing that they do not feel responsible for educating the children in their care.\n\nSome teachers described an almost adversarial relationship with foster parents, which made collaboration with them next-to-impossible. For instance, Nina, a high school teacher, described a foster mother who did not seem to want to work with students who were struggling, and instead requested that DCF remove them from her home if there were problems at school. Nina explained:\n\nEvery time I talked to the foster parent, she was like, ‘She [foster daughter] needs to leave; she needs to go.’ She didn’t really talk to her. I felt like I was setting the kid up to get the kid kicked out of there…It was like, ‘I’ll give you a house, but if you need more than that, then you need to go.’ She did really well with the high school kids that just needed a house and could take care of themselves. It makes it hard because you don’t want to cause a kid being thrown out. She had been in like 16 homes over the few years.\n\nNina hesitated to call the foster parent to address school issues because she did not want to jeopardize the student’s stability at home. Thus, the school–foster home disconnect, according to some teachers in this study, is exacerbated when foster parents do not return school calls, miss important school meetings, and put all of the responsibility of educating foster youth on the teachers, which contributes to the academic barriers faced by students in foster care."}, {"url": "https://www.britannica.com/biography/Henry-Mayhew", "page_content": "Henry Mayhew, (born 1812, London, England—died July 25, 1887, London), English journalist and sociologist, a founder of the magazine Punch (1841), who was a vivid and voluminous writer best known for London Labour and the London Poor, 4 vol. (1851–62). His evocation of the sights and sounds of London in this work influenced Charles Dickens and other writers.\n\nMayhew, the son of a solicitor, ran away to sea at age 12 and made a voyage to India. Upon his return he studied law with his father but soon turned to journalism. He helped to found the periodicals Figaro in London (1831) and The Thief (1832) before organizing the highly successful Punch, of which he was coeditor (with Mark Lemon) for two years. He also wrote plays, farces, fairy tales, and novels, some in collaboration with his brother Augustus Septimus Mayhew (1826–75). Short of money in his later years, he produced much hackwork and died in obscurity.\n\nMayhew had a genius for lively and sensitive reportage of people, including social outcasts and nomads, and of contrasting ways of life; and he was able to combine his observation with penetrating economic and social analysis, some of it with a Marxist flavour. London Labour and the London Poor was based on letters he wrote to the London Morning Chronicle in 1849–50, at the end of a stormy decade in British social history. Responding to the newspaper’s desire for “trustworthy information” on the great social problems of the day, Mayhew prepared three volumes that were published in 1851; the fourth volume, The Criminal Prisons of London, was written in collaboration with John Binny and did not appear until 1862. A revised complete edition was published in 1864."}], "Mayhew Foster was a strong advocate of education.": [{"url": "http://subsites.chinadaily.com.cn/npc/2021-12/09/c_688379.htm", "page_content": "Young People Should Practice the Core Socialist Values*\n\n\n\n\n\nMay 4, 2014\n\n\n\n\n\nDear students, teachers and friends,\n\nToday, as we celebrate China's Youth Day1 I'm glad to be here with you, honoring the 95th anniversary of the May 4th Movement2. First of all, I'd like to extend, on behalf of the Party Central Committee, my festival greetings to the teachers, staff and students at Peking University and young people of all ethnic groups across the country. Also, I want to express my deepest respects to those who work in the fields of education and youth work throughout the country!\n\nThis is my fifth visit to Peking University since I started to serve on the Party Central Committee, and each time I am here I find something new that impresses me. My feelings soar whenever I walk on this campus full of vigor and vitality, and I can't help but sigh: The current generation of college students is just adorable, trustworthy and reliable, and you are bound to have a bright future.\n\nThe May 4th Movement gave founding to the May 4th spirit of patriotism, progress, democracy and science, kicking off the New Democratic Revolution in China, promoting the dissemination of Marxism in the country and laying the groundwork for the founding of the CPC.\n\nSince the May 4th Movement, under the leadership of the Party, generations of highly motivated young men and women have written inspiring chapters in the struggles to save the country and rejuvenate the Chinese nation, with the motto \"Devoting my youth to creating a family of youth, a country of youth, a nation of youth, a mankind of youth, a planet of youth and a universe of youth.\"3\n\nPeking University was the base of the New Culture Movement4 as well as a cradle of the May 4th Movement, witnessing this glorious period in modern history. For a long time, teachers and students here have shared a common destiny with the country and the people, and advanced with the times and society, making remarkable contributions to our country's revolution, construction and reform in all respects.\n\nThe Two Centenary Goals were put forward at the 18th CPC National Congress. As I have said before, we have never been so close as now to reaching the goal of the great renewal of the Chinese nation, and we are more confident and more capable than ever of fulfiling this goal.\n\nNevertheless, \"A thing is yet to be done until it is done,\"5 as an old saying goes. The closer we approach the goal the more we should redouble our efforts. We can afford no slackening. More importantly, we should encourage more young people to join the great cause of making the dream come true.\n\nThe river of time flows nonstop day and night, and things change as the seasons change. Every generation of young people is offered the opportunities of the era for drawing a picture of life and creating history. Young people, the most sensitive weatherglass of an era, are entrusted with the responsibilities of the times and share the glory of their days.\n\nToday, we are here to honor the May 4th Movement. The best way for us to have the May 4th spirit display widely is to join the team of builders, pioneers and dedicators, and together with the people of all ethnic groups shoulder our historic responsibilities with firm beliefs, high morality, a wealth of knowledge and competent skills.\n\nStudents and teachers,\n\nUniversity is a place not just for academic studies but for seeking truth. Today, I'd like to take this opportunity to share with you my insights into the core socialist values.\n\nI was inspired by the spirit of the May 4th Movement, which embodies the values the Chinese people and nation have pursued in modern history. Today, we should still adhere to and carry out these core values, highlighted by patriotism, progress, democracy and science. Young people, as well as everyone else in the country, should uphold and carry out these core values.\n\nLooking at human history and social development, we find that the most lasting and profound power for a nation and country is the core values acknowledged by all. Core values carry the spiritual aspiration of a nation and country, and represent the standard for judging right and wrong.\n\nAn ancient proverb goes, \"The way to great learning is to manifest bright virtue and to treat the people as one's own family, thereby arriving at supreme goodness.\"6 Core values are in fact individual virtues, as well as public, social and national virtues. A country cannot prosper without virtues, nor can anyone succeed without virtues. Without shared core values, a nation and country will be at a loss to know what is right and what is wrong, and its people will have no code of conduct to follow, the result being that the nation and country can never progress. It has commonly occurred in our history, and still happens across the globe.\n\nChina is a big country with 1.3 billion people and 56 ethnic groups. Upon the recognition of the values with the \"greatest common denominator\" by the people of all ethnic groups, they work with one heart and one mind to strive in unity. This concerns our nation's future and destiny, as well as our people's happiness and well-being.\n\nEvery era has its spirit, and likewise its values. In ancient China our ancestors developed core values highlighted by \"propriety, righteousness, honesty and a sense of shame – the four anchors of our moral foundation, and a question of life and death for the country.\"7 This was our ancestors' understanding of their core values.\n\nWhat are the core values for our people and country today? This is both a theoretical and a practical question. We should eventually agree upon this after sorting out opinions and understandings from all walks of life. The core socialist values that we should cultivate and practice are prosperity, democracy, civility, harmony, freedom, equality, justice, the rule of law, patriotism, dedication, integrity and friendship.\n\nThe values of prosperity, democracy, civility and harmony are for the country; those of freedom, equality, justice and the rule of law for the society; and those of patriotism, dedication, integrity and friendship for citizens. They explain what sort of country and society we are striving for, and what kind of citizens we are cultivating.\n\nSince ancient times the Chinese people have developed their country through studying the nature of things to acquire knowledge, correcting thoughts with sincerity, cultivating the moral self, managing the family, governing the state and safeguarding peace under Heaven. As we see it today, the principles of \"studying the nature of things, correcting thoughts with sincerity and cultivating the moral self\" are for individuals; the principle of \"managing the family\" is for the society; and those of \"governing the state and safeguarding peace under Heaven\" are for the country.\n\nWhat we put forward for the core socialist values is a combination of requirements for the country, society and citizens, which represent the nature of socialism, carry forward the fine traditional Chinese culture, draw on the best of world civilization and reflect the spirit of the times.\n\nProsperity, democracy, civility, harmony, freedom, equality, justice, the rule of law, patriotism, dedication, integrity and friendship are all ideas that inherit the essence of the outstanding traditional Chinese culture, embody the ideals and faith formed by modern Chinese people through unremitting and painstaking efforts, and reflect the wishes and vision of every Chinese citizen.\n\nWe should foster the core socialist values throughout society. The people should join hands and work persistently to make China richer and stronger, more democratic, more harmonious and more beautiful, so that our country can be confident enough to stand proudly among all other nations.\n\nSince the Opium War of the 1840s the Chinese people have long cherished a dream of realizing a great national rejuvenation and building China into a strong, democratic and harmonious modern socialist country – the highest and most fundamental interests of the nation. And that's what our 1.3 billion people are striving for.\n\nChina used to be a world economic power. However, it missed its chance in the wake of the Industrial Revolution and the consequent dramatic changes, and thus was left behind and suffered humiliation under foreign invasion. Things got worse especially after the Opium War, when the nation was plagued by poverty and weakness, allowing others to trample upon and manipulate us. We must not let this tragic history repeat itself.\n\nThe construction of a strong, democratic and harmonious modern socialist country is our goal and responsibility – for the nation, for our forefathers and for our future generations. Therefore, we should maintain our willpower, intensify our faith, and walk unswervingly along the road towards our destination.\n\nChina has stood up. It will never again tolerate being bullied by any nation. Yet it will never follow in the footsteps of the big powers, which seek hegemony once they grow strong. Our country is following a path of peaceful development.\n\nWhy are we so confident? Because we have developed and become stronger. China has won worldwide respect with its century-long efforts. Its prestige keeps rising, and its influence keeps expanding. Today's China forms a sharp contrast to China in the 19th century when the country was humiliated, its sovereignty was infringed upon, and its people were bullied by foreigners.\n\nChinese civilization has formed a unique value system over several millennia. The brilliant traditional Chinese culture is the essence of the nation and has deep roots in the Chinese people's mentality, influencing their way of thinking and behavior unconsciously.\n\nToday, we advocate and carry forward the core socialist values through absorbing the rich nourishment of Chinese culture, so as to invigorate its vitality and broaden its influence.\n\nHere are some quotations from ancient classics that I'd like to share with you today:\n\n\"The people are the foundation of a state,\"8\n\n\"The harmony of Nature and man,\"9\n\n\"Harmony without uniformity,\"10\n\n\"As Heaven changes through movement, a gentleman makes unremitting efforts to perfect himself,\"11\n\n\"When the Great Way prevailed, a public spirit ruled all under Heaven,\"12\n\n\"Everyone is responsible for his country's rise or fall,\"13\n\n\"Govern the country with virtue and educate the people with culture,\"\n\n\"A gentleman has a good knowledge of righteousness,\"14\n\n\"A gentleman is broad-minded,\"15\n\n\"A gentleman takes morality as his bedrock,\"16\n\n\"Be true in word and resolute in deed,\"17\n\n\"If a man does not keep his word, what is he good for?\"18\n\n\"A man of high moral quality will never feel lonely,\"19\n\n\"The benevolent man loves others,\"20\n\n\"Do things for the good of others,\"21\n\n\"Don't do unto others what you don't want others to do unto you,\"22\n\n\"Care for each other and help one another,\"23\n\n\"Respect others' elders as one respects one's own, and care for others' children as one cares for one's own,\"24\n\n\"Help the poor and assist those in difficulty,\"\n\n\"Care less about quantity and more about quality.\"25\n\nThese thoughts and ideas all displayed and still demonstrate distinctive national features, and have the indelible values of the times. We have updated them in keeping abreast of the times, while carrying them forward in an unbroken line.\n\nAs Chinese, we should always keep our own unique inner-world spirit, uphold values that we practice every day without noticing. The core socialist values we advocate today represent the inheritance and upgrading of outstanding traditional Chinese culture.\n\nValues appear and develop in the process of human beings getting to know and shape nature and society. Core values vary in different nations and countries due to different natural conditions and courses of development. The core values of a nation and country are closely related to its history and culture, as well as to what its people are striving for and to the present issues it needs to resolve.\n\nThere are no two leaves exactly alike on earth. A nation, or people of a country, must know who they are, where they came from and where they are heading. Keep on going when you have made your choice.\n\nOn December 26 last year, I said at the meeting commemorating the 120th birthday of Mao Zedong:\n\nBoasting a vast land of 9.6 million sq km, a rich cultural heritage and a strong bond among the 1.3 billion Chinese people, we are resolved to go our own way. We have a big stage to display our advantages on, a long and rich history to draw benefit from, and a powerful impetus to push us ahead. We Chinese people – every single one of us – should draw confidence from this.\n\nWe should modestly learn from the best of other civilizations, but never forget our own origin. We must not blindly copy the development models of other countries nor accept their dictation.\n\nWhat I mean here is that we should enhance our confidence in the path we have chosen, in the theories we have devised and in the system we have established to reach our goal of development and make the Chinese Dream come true. \"In the face of all blows, not bending low, it still stands fast. Whether from east, west, south or north the wind doth blast.\"26 Our confidence is supported by our core values.\n\nWhy am I talking about the core socialist values with you young people? Because your value orientation will decide the values of the whole of society in the years to come. Besides, young people are at the time of life when they form and establish their values. It is therefore very important to offer some guidance. That reminds me of something that happens in our daily life. When we button up our coat, we may inadvertently put the first button in the wrong button hole, and that will result in all the other buttons being put in the wrong holes. That's why we say that young people should \"button right\" in the early days of their life. \"A deep well is dug starting with a shallow pit.\"27 Every young person should learn about the core socialist values starting right now, take them as his basic rules and disseminate them throughout society.\n\nWhen young people adopt the core socialist values they should emphasize the following points:\n\nFirst, work diligently to acquire true knowledge. Knowledge is an important cornerstone for the cultivation of the core values. The great philosophers of ancient Greece believed that knowledge was a virtue. Our ancestors also asserted, \"One cannot enhance one's ability and wisdom if one does not work hard; neither can one succeed without ambition.\"28\n\nA person enjoys only once the youthful days at college, so you should cherish them. To acquire knowledge, one has to study diligently, intensively and persistently. Lu Xun29 once said, \"Who said I'm a genius? I spent all my time working when others were sipping coffee.\"30 In college days, \"Young we were, schoolmates, at life's full flowering.\"31 One can totally throw oneself into seeking knowledge without any distractions, learning from teachers, exchanging views with classmates and rummaging through piles of books. So there is no reason not to study hard. Work hard, acquire more knowledge and turn what you have learned into your own views and ideas. I hope that you will not only concentrate on book knowledge but also care about the people, the country and the world, and assume your responsibility for society.\n\nSecond, cultivate morality and virtue, and pay attention to them in practice. \"Virtue is the root.\"32 Mr Cai Yuanpei33 believed, \"He who is strong physically and talented but has no virtue will end up on the side of vice.\"34 Virtues are fundamental for both individuals and society. What is most important is to cultivate morality. This explains why we select those who are both talented and morally cultivated for our work, with morality as priority. One can be placed in the right position only if one recognizes virtue, follows social ethics and restricts personal desires.\n\nWhen talking about cultivating morality, one needs to have high ambitions as well as pragmatic plans. To devote oneself to one's country and serve one's people, this is the great virtue with which one is able to accomplish the great cause. In the meantime, one needs to start to do small things well and be self-disciplined even in small matters. \"Learning from fine things that may appear and correcting any mistakes that may occur,\"35 one needs to cultivate public and personal virtues, learn to work, to be thrifty, to be grateful, to help others, to be modest, to be tolerant, to examine oneself and to exercise self-restraint.\n\nThird, learn to tell right from wrong and make correct decisions. As our ancestors believed, \"Reading without thinking makes one muddled; thinking without reading makes one flighty.\"36 Knowing what is right or wrong, what is the correct direction and what is the proper way to follow, one is bound to reap the reward of one's work.\n\nFacing a complex and fast-changing world, an information era with the surge of various schools of thought, a multifaceted society of genuine and false ideas, and the pressure associated with one's academic pursuit, relationships and employment, you may feel somewhat confused, hesitant or frustrated. This is a normal experience everybody will go through. The key is to learn to think about and analyze situations before making decisions in order to arrive at correct decisions. You should be sturdy, confident and self-reliant. You must form a correct world outlook, view of life and values, then you will see – crystal-clear – the true nature of society and have a better understanding of your life's experience, and be able to tell what is right and what is wrong, what is primary and what is secondary, what is true and what is false, what is good and what is evil, and what is beautiful and what is ugly before making judgments and decisions. As a Tang verse goes, \"Gold glitters only after countless washings and sievings.\"37\n\nFourth, be honest and sincere; do solid work and be an upright person. The correct way needs to be pursued in practice, while morality requires no empty talk. One should be more pragmatic. Knowledge and action should go hand in hand, and the core values should be turned into moral pursuits as well as a drive to make people engage in conscious action. The Book of Rites38 says, \"Learn extensively, inquire earnestly, think profoundly, discriminate clearly and practice sincerely.\"39\n\nSome people believe that \"sages are mediocre people who work hard, while mediocre people are sages who refuse to work hard.\" With more opportunities, young people should make their steps steady, lay a solid foundation and make unremitting efforts. It is no good for study or running a business if one works intermittently, or chops and changes. \"Difficult things are done starting from easy ones; a great undertaking begins with minor work.\"40\n\nNo matter what you opt to do, success always favors hard workers. Young people should take a difficult environment as a challenge or test. \"Little strokes fell great oaks.\" Success awaits those who work doggedly and unyieldingly, and those who are never daunted by repeated setbacks.\n\nThe cultivation of the core values can't be done overnight. It requires efforts from the easy to the difficult, from close-up to faraway until it becomes a faith and idea that we follow conscientiously. When things are smooth, you may be confident; when there are frustrations, you may have doubts and waver. In all circumstances we should always uphold the core socialist values which have been formed and developed here in our country, make contributions to the great cause in the modern era and fulfill our lifetime expectations.\n\nStudents and teachers,\n\nThe Party Central Committee has decided to build world-class colleges and universities – a strategic policy that we should follow without hesitation. To make them world-class, they must feature Chinese characteristics. It won't do to copy others mechanically, because we always believe that \"the more national the more international.\"\n\nIn this world there is only one Harvard University, University of Oxford, Stanford University, Massachusetts Institute of Technology and University of Cambridge; likewise, there is only one Peking University, Tsinghua University, Zhejiang University, Fudan University and Nanjing University in China. We should draw on the world's best experience in running institutions of higher learning, follow the rules of education, and establish more excellent colleges and universities on Chinese soil.\n\nLu Xun asserted, \"Peking University is always innovative and plays a pioneering role in reforming movements, leading China along an upward path towards a better future.\"41\n\nThe decision on advancing the reform in an all-round way was made at the Third Plenary Session of the 18th CPC Central Committee, defining the demands for the further reform of higher education in China. What we must do now is to turn this blueprint into reality.\n\nInstitutions of higher learning should take the lead in educational reform throughout the country, centering on the fundamental tasks of building virtues and morality, and moving faster in establishing an educational system and mechanism that is full of vigor and vitality, efficient, more open and favoring educational development in a balanced and coordinated way. I do hope that Peking University can realize its long-cherished dream as soon as possible of advancing into the ranks of world-class universities through painstaking efforts, reform and innovation.\n\nTeachers are entrusted with the noblest mission in this world. Mr Mei Yiqi42 opined that the key to the success of a university lies in having a lot of highly accomplished gurus rather than imposing buildings.43 What he meant by \"highly-accomplished gurus,\" as I see it, are people most knowledgeable in their academic fields and who are also virtuous. Always bearing in mind their responsibilities, teachers should be ready to serve as human ladders, inspiring the souls of the students whom they are teaching with the help of their personal charisma and scholarly attainments.\n\nParty committees and governments at all levels should pay closer attention to colleges and universities, show more concern for the students and erect a platform for them to dream upon and make their dreams come true. We should accelerate the reform in an all-round way, create a fair and just social environment, promote social mobility and inspire the vigor and creativity of young people. We should improve the system of employment and business startups so as to assist graduates at the beginning of their life-long careers. Leading officials at all levels should keep in communication with the students, make friends with them and listen to what they have to say.\n\nToday, the majority of college students are around the age of 20; and they will be under the age of 30 by 2020, when we complete the building of a moderately prosperous society in all respects. They will be around 60 by the mid-21st century, when we basically realize our country's modernization. That is to say, you will participate in the cause of reaching the Two Centenary Goals along with myriads of other young people.\n\nI believe that life is meaningless for anyone without faith, without dreams, without concerted endeavors and without contributions. I hope that you can create your own wonderful life while making the Chinese Dream come true since you have never been given a platform as spacious as this or as promising as this.\n\nI believe that young Chinese people today are more than capable of undertaking the historic mission entrusted to them by the Party and the people, and will go on to write a brilliant chapter worthy of our times in their efforts to take advantage of their youthful vigor, explore life and contribute to society!\n\n\n\n\n\n* Speech at the seminar with teachers and students of Peking University.\n\nNotes\n\n1 The year 1939 saw the nomination of China's Youth Day on May 4th by the Northwestern Youth Association of National Salvation in the Shaanxi-Gansu-Ningxia Border Region to carry forward and foster the glorious revolutionary tradition of the Chinese young people since the May 4th Movement in 1919. In December 1949 the Government Administration Council – the predecessor of China's State Council – of the Central People's Government officially named it China's Youth Day.\n\n2 The May 4th Movement, which started in Beijing on May 4, 1919, was a patriotic movement of the Chinese people against imperialism and feudalism. Soon after the end of World War I, victorious nations, including Britain, the United States, France, Japan, and Italy held the Paris Peace Conference, awarding Germany's rights in Shandong Province to Japan. China was one of the victorious nations, but the Chinese Beiyang (Warlord) Government was about to sign the treaty. On the afternoon of May 4, 1919, over 3,000 students of Peking University and other schools protested against the treaty and the compromise of the Beiyang Government, provoking a quick response throughout the country. By June 3 the movement turned out to be a patriotic movement against imperialism and feudalism, with participants from the working class, urban petite-bourgeoisie and national bourgeoisie. It also sparked off the New Culture Movement against feudal Chinese culture. Bolstered by the founding of the journal Youth (later known as New Youth) in 1915, the New Culture Movement called for Mr Science and Mr Democracy by replacing old moral standards and old literature with the new. The May 4th Movement marked the end of the Old Democratic Revolution and the start of the New Democratic Revolution in China, thereby opening a brand-new chapter of revolution in Chinese history.\n\n3 Li Dazhao: Youth. Li Dazhao (1889-1927) was a pioneer in acquiring and disseminating Marxism and one of the founders of the CPC.\n\n4 See note 2.\n\n5 Strategies of the States (Zhan Guo Ce), a collection of stories of political strategists of the Warring States Period (475-221 BC).\n\n6 The Great Learning (Da Xue).\n\n7 Guan Zi.\n\n8 The Book of History (Shang Shu).\n\n9 An ancient Chinese philosophical viewpoint, from the Idea of God's Will of the Western Zhou Dynasty (1046-771 BC), which believed that Heaven and Man were closely related.\n\n10 The Analects of Confucius (Lun Yu).\n\n11 The Book of Changes (Yi Jing), also known as the I Ching, one of the Confucian classics. The book was used as a work for the divination of natural and social changes through the calculation of the Eight Trigrams representing Heaven, Earth, Thunder, Wind, Water, Fire, Mountain and Lake, believing that the interactions of the yin and yang give birth to everything in the universe and advocating simple yet dialectical viewpoints, such as \"Changes derive from the mutual acceleration of the hard and soft.\"\n\n12 The Book of Rites (Li Ji).\n\n13 Gu Yanwu: Records of Daily Knowledge (Ri Zhi Lu). Gu Yanwu (1613-1682) was a thinker and historian in the late Ming (1368-1644) and early Qing (1644-1911) dynasties.\n\n14 The Analects of Confucius (Lun Yu).\n\n15 Ibid.\n\n16 Ibid.\n\n17 Ibid.\n\n18 Ibid.\n\n19 Ibid.\n\n20 The Mencius (Meng Zi), one of the Confucian classics compiled by Mencius and his disciples. The book is a collection of anecdotes and conversations of the Confucian thinker and philosopher Mencius during the Warring States Period (475-221 BC). It is one of the \"Four Classics of Confucianism,\" the other three being The Great Learning, The Doctrine of the Mean and The Analects of Confucius.\n\n21 Ibid.\n\n22 The Analects of Confucius (Lun Yu).\n\n23 The Mencius (Meng Zi).\n\n24 Ibid.\n\n25 The Analects of Confucius (Lun Yu) is one of the Confucian classics. Written by the disciples of Confucius, it records the words and deeds of Confucius, and also comprises dialogues between Confucius and his disciples. The Analects of Confucius (Lun Yu), The Great Learning (Da Xue), The Doctrine of the Mean (Zhong Yong) and The Mencius (Meng Zi) are collectively known as the \"Four Classics of Confucianism.\"\n\n26 Zheng Xie: Bamboos amid Rocks. Zheng Xie (1693-1765), also known as Zheng Banqiao, was a calligrapher and writer in the Qing Dynasty (1644-1911).\n\n27 Liu Zhou: Liu Zi. Liu Zhou (514-565) was a man of letters of the State of Northern Qi during the Northern and Southern Dynasties (386-589).\n\n28 Zhuge Liang: Advice to My Son. Zhuge Liang (181-234), also known as Kong Ming, was a legendary prime minister and statesman of the Shu Kingdom during the Three Kingdoms Period (220-280).\n\n29 Lu Xun (1881-1936) was a litterateur, thinker and revolutionary as well as one of the founders of modern Chinese literature.\n\n30 \"Postscripts of Selected Works of Lu Xun,\" Selected Works of Lu Xun, Vol. 20, Chinese ed., People's Literature Publishing House, Beijing, 1973, p. 663.\n\n31 Mao Zedong: \"Changsha,\" Mao Zedong Poems, Eng. ed., Foreign Languages Press, Beijing, 1998, p. 5.\n\n32 The Great Learning (Da Xue).\n\n33 Cai Yuanpei (1868-1940) was a democratic revolutionary, educator and scientist. He served as president of Peking University from 1916 to 1927.\n\n34 Cai Yuanpei: \"Speech at the Patriotic Girls School,\" Complete Works of Cai Yuanpei, Vol. 3, Chinese ed., Zhonghua Book Company, Beijing, 1984, p. 8.\n\n35 The Book of Changes (Yi Jing).\n\n36 The Analects of Confucius (Lun Yu).\n\n37 Liu Yuxi: Nine Poems (Jiu Shou). Liu Yuxi (772-842) was a man of letters and philosopher of the Tang Dynasty (618-907).\n\n38 The Book of Rites (Li Ji), one of the Confucian classics, is an important work for the study of ancient China's social forms, laws and regulations, and traditional Confucian canon, covering the realms of society, politics, moral principles, philosophy and religion.\n\n39 The Doctrine of the Mean (Zhong Yong), one of the Confucian classics, used to be a part of The Book of Rites. Published as an independent book during the Song Dynasty (960-1279), it became one of the \"Four Classics of Confucianism,\" the other three being The Great Learning, The Analects of Confucius and The Mencius.\n\n40 Lao Zi or Dao De Jing. This is an important philosophical work from ancient China, which proposed the thought of the \"Tao\" and advocated the ideas of \"governing by doing nothing\" and \"going along with Nature.\"\n\n41 Lu Xun: \"Peking University in My Eyes,\" Complete Works of Lu Xun, Vol. 3, Chinese ed., People's Literature Publishing House, Beijing, 1973, p. 155.\n\n42 Mei Yiqi (1889-1962) served as the president of Tsinghua University from 1931 to 1948.\n\n43 This is an idea for running schools initiated by Mei Yiqi in his inaugural speech on accepting the presidency of Tsinghua University on December 2, 1931.\n\n\n\n\n\n(Not to be republished for any commercial or other purposes.)\n\n\n\n"}, {"url": "https://alchetron.com/Mayhew-Foster", "page_content": "Mayhew Y. \"Bo\" Foster (October 9, 1911 – March 21, 2011) was an American soldier who flew captured Nazi war criminal Hermann Göring from Austria to Germany for interrogation by the 7th Army. For his actions in World War II, Foster was awarded both the Silver Star and the Légion d'Honneur.\n\nAt the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). According to China Daily, in a letter to his wife, Virginia, written at the time, Foster describes his first impression of Göring as \"effeminate [and] gave me the creeps . . . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\"\n\nFoster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favour as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nFoster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he'd been picked up. I wouldn't say it changed my view of the war, but it showed me that there are [He did not finish the statement.] . . . Well, I questioned all that we knew about these vicious people.\"\n\nGöring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities.\n\nBy October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971.\n\nA native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. He and his wife, Virginia Lou Foster (February 15, 1916 – May 7, 1993) were married in 1940. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007).\n\nFoster received the Silver Star for his wartime service in southern France in 1944. It was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States' decisive role in the liberation of our country during World War II.\"\n\nFoster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana. Survivors included son-in-law Roy E. Korkalo of Livingston, grandson Chris Korkalo, and a sister, Priscilla F. Howell."}, {"url": "https://timesofmalta.com/articles/view/mayhew-foster.348092", "page_content": "As a 33-year-old pilot at the end of World War II, then Capt. Mayhew ‘Bo’ Foster had an extraordinary mission, flying captured Nazi leader Hermann Goering from the Austrian Alps back to the 7th Army’s headquarters in Germany for interrogation.\n\nCapt. Foster took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe, all 300-plus pounds of him, and knew he needed a bigger plane.\n\nCapt. Foster, now 99, and living in a nursing home in Missoula, Montana, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders.\n\nMr Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honour for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career."}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://www.encyclopedia.com/history/news-wires-white-papers-and-books/mayhew-jonathan-1720-1766", "page_content": "Jonathan Mayhew (1720-1766)\n\nSources\n\nCongregational revolutionary\n\nEarly Training. Jonathan Mayhew was born on the small island of Martha’s Vineyard, off the Massachusetts coast, on 8 October 1720. His father, Experience Mayhew, was the missionary to the Indians there, a post the Mayhew family had filled since 1641. The Vineyard mission was one of the few successful English ventures to Christianize Native Americans, and during Jonathan’s youth the Chilmark congregation, as it was called, was a peaceful church, although its numbers were declining as the Indian population decreased. Experience nurtured his converts faithfully, defending them against spurious land claims and the rigors of orthodox Calvinism, which he came to see as too harsh a system of religion for Indians and whites alike. He struggled to obtain adequate funds to support his work. Jonathan’s elder brother Nathan was marked to attend college and follow in his father’s footsteps as a missionary, but his early death left Jonathan to assume this family duty.\n\nReason. Mayhew kept his father’s liberal religious ideas with him as he attended Harvard College, graduating in 1744. There he embraced the rationalist Congregationalism that was a hallmark of the training Harvard offered at that time. Particularly important was the teaching of Professor Edward Wigglesworth, a leading spokesman for rational religion and against the emotionalism of the revivals of the 1730s and 1740s. In 1742 Mayhew briefly turned to revivalism after hearing the great evangelical preacher George Whitefield, but he soon rejected that kind of religion as “low, confused, puerile, conceited, ill-natur’d, [and] enthusiastik,” as he wrote to his father. In 1747 Mayhew became the minister of Boston’s West Congregational Church, where he worked for the rest of his life. From this pulpit Mayhew preached a rational religion that evolved into something quite different from its Puritan roots. Mayhew became an outspoken advocate of free rational inquiry into religious truth and argued that humans had the natural ability to come closer to God through that inquiry. He was a true Enlightenment figure, thinking of the practice of Christianity as a kind of science and even reading the radical French philosophers Voltaire and Jean-Jacques Rousseau. Mayhew ended by rejecting the orthodox beliefs in the three persons of God and in the predestination of a select few for salvation in favor of a faith in a universally benevolent God who loved all humans.\n\nControversies. Mayhew frequently came into conflict with others over religion, politics, and even social matters. An early sign was his lateness in marrying, unusual for a young minister with a good position. Instead of settling down, Mayhew enjoyed an active social life of dining out, hunting, and fishing, although he did not attend theatrical performances, which he considered immoral. His congregation’s criticism of this lifestyle ended when he married nine years after assuming his pulpit, but more serious opposition came from theological and political figures. Mayhew’s rational religion took him into public debates with John Cleaveland, a leading revivalist, and Samuel Hopkins, one of Jonathan Edwards’s students and a major figure in the New Divinity movement. Mayhew’s temper often got the better of him in these controversies, which fostered more bad feeling than mutual understanding. As early as 1754 Mayhew began another long conflict. This time his opponent was the Society for the Propagation of the Gospel, the leading sponsor of Indian missions in colonial America. He criticized the society for using its resources in parts of New England that needed no missionaries and so failing to bring Native Americans to Christ, reflecting on the difficulties of his own family’s experiences with that task.\n\nPolitics. Criticism of Anglican missions brought Mayhew to a deeper skepticism about relations between England and America, coincided with the first political tensions between the two. Mayhew spoke out against rumors that the Anglican Church was preparing to send a bishop to America to better support its efforts there. Mayhew saw this effort as a significant threat to American religious liberty as it had existed in New England since the days of the Puritan founders. He recalled for his listeners and readers the sacrifices of English Puritans during their own revolution of the 1640s, as they opposed the tyranny of King Charles I and his bishops and struggled to worship God in accordance with their consciences. He argued that the English Puritans were right to oppose their king because he was unjust. This was a much more positive view of the English revolution than Americans had heard up to this period. Over time Mayhew expanded his thoughts to criticize the current English monarchy and its representatives in New England. Mayhew was never fully allied with American political leaders such as Samuel Adams and John Hancock, and he opposed the mobs who demonstrated against the Stamp Act. Yet Mayhew’s thoughts about religious freedom supported their emerging notions of political liberty. He preached his most famous sermon, “The Snare Broken,” in celebration of the repeal of the Stamp Act. In it he criticized mob violence but also spoke against England’s exploitation of America, setting the tone for the revolutionary era. He failed to see that emerge, however, having a stroke soon after this success and dying on 9 July 1766.\n\nCharles W. Akers, Called Unto Liberty: A Life of Jonathan Mayhew, 1720–1766 (Cambridge, Mass.: Harvard University Press, 1964);\n\nJohn Corrigan, The Hidden Balance: Religion and the Social Theories of Charles Chauncy and Jonathan Mayhew (New York: Oxford University Press, 1987)."}, {"url": "https://dictionary.cambridge.org/example/english/strong-advocate", "page_content": "collocation in English\n\nThese words are often used together. Click on the links below to explore the meanings. Or, see other collocations with advocate\n\na lawyer who speaks for or defends someone in a court ...\n\npowerful; having or using great force ...\n\n(Definition of strong and advocate from the Cambridge English Dictionary © Cambridge University Press)\n\nThese examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors.\n\nFrom our point of view, a description of this complex algorithm in less than 30 lines is very valuable, and is a strong advocate for using high-level languages. From the Cambridge English Corpus\n\nI am a strong advocate of decoupling direct payments, which has proved beneficial in helping farmers to adapt better to market conditions. From Europarl Parallel Corpus - English\n\nI have always been a strong advocate of voting by post. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nIt is obvious from its contents that it is written by a strong advocate of proportional representation. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nHe is notoriously a strong advocate of that form of attack, and his distinguished record entitles him to the utmost respect. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI was a strong advocate from the word go, and such provision was always in the policy. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI am a strong advocate of the speedy redistribution of constituencies. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nIn any happy moment of that kind he will find me a strong advocate of such principles. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI was surprised to find that he was a strong advocate of comprehensive schools in the area. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI am a very strong advocate of farmers co-operating with one another although there are any number of practical difficulties to be overcome. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nHe has told us he is a strong advocate of amalgamation. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI have consistently been a strong advocate of manufacturing industry. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nThe professor is a strong advocate of reducing the amount of lead in petrol. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI have hitherto, during the past two years, been a strong advocate of the claims of agriculture in respect of labour. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nHe is a strong advocate of full benefits being give to young people in their teens. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nHe is clearly a strong advocate of his constituents' best interests. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI was a very strong advocate of the clawback system in 1965 and 1966. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nAs always, he was a strong advocate for his constituents. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nI am a strong advocate of getting down towards a balanced budget and of low inflation. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nIn the past six years, he has been a strong advocate not only on waste issues but on general environment matters. Hansard archive Example from the Hansard archive. Contains Parliamentary information licensed under the Open Parliament Licence v3.0 From the\n\nThese examples are from corpora and from sources on the web. Any opinions in the examples do not represent the opinion of the Cambridge Dictionary editors or of Cambridge University Press or its licensors."}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/a+strong+advocate.html", "page_content": "en a strong advocate of the eradication [...] of torture and other cruel and inhumane treatment, according high priority to its prevention. daccess-ods.un.org daccess-ods.un.org Costa Rica had behe eradication 加坚决支持 消除酷刑和其他残忍和不人道待遇，对防范这种行为 高度重视。 daccess-ods.un.org daccess-ods.un.org 哥斯达黎消除酷刑和其他残忍和不人道待遇，对防范这种行为 高度重视。\n\nas a strong advocate for the promotion [...] and protection of the rights of indigenous peoples, she expressed regret [...] that the reference in paragraph 33 to the United Nations Declaration on the Rights of Indigenous Peoples was not yet strong enough. daccess-ods.un.org daccess-ods.un.org However,the promotion 的积极倡导者，她表 示遗憾的是，第 33 段在提 到《联合国土著人民权利宣言》时还不够有力。 daccess-ods.un.org daccess-ods.un.org 不过，作为促进和保护土著人民 权利示遗憾的是，第 33 段在提 到《联合国土著人民权利宣言》时还不够有力。\n\nam a strong advocate of environmental protection, I will naturally oppose the motion because once fuel duties are lowered and fuel prices drop, more [...] [...] people will use cars or take taxis. legco.gov.hk legco.gov.hk President, many people think that since Invironmental protection, I will naturally oppose the motion because once fuel duties are lowered and fuel prices drop, more legco.gov.hk legco.gov.hk 主席，很多人都說我這麼支持環保，必然會反對這項議案，因為一旦削 減油稅，油價便會變得便宜，乘車的人便會多了，又會多了人乘搭的士。\n\ns a strong advocate of the United [...] Nations Declaration on the Rights of Indigenous Peoples, it had not been able to accept [...] the last-minute amendment whereby the reference to that instrument had been weakened. daccess-ods.un.org daccess-ods.un.org he United 的积极倡导者，它未 能接受最后一 刻提出的修正案，对该文书的引述因而受到削弱。 daccess-ods.un.org daccess-ods.un.org 作为《联合国土著 人民权利宣言》能接受最后一 刻提出的修正案，对该文书的引述因而受到削弱。\n\nas a strong advocate of universal acceptance of the Additional Protocol in conjunction with a comprehensive safeguards agreement, which together [...] [...] comprised an efficient mechanism for deterring proliferation and verifying compliance. daccess-ods.un.org daccess-ods.un.org His country wniversal acceptance of the Additional Protocol in conjunction with a comprehensive safeguards agreement, which together daccess-ods.un.org daccess-ods.un.org 捷克共和国强烈支持普遍接受构成防止核扩 散和核查遵守情况的有效机制的《附加议定书》以 及全面保障监督协定。\n\nSince resolution 1325 (2000) was adopted, the [...] Special Adviser to the [...] Secretary-General has been a strong advocate for its implementation [...] both within the United Nations [...] system and in national and international forums. daccess-ods.un.org daccess-ods.un.org Secretary-General has beits implementation 直强烈倡导在联合国 系统内和在国家和国际论坛执行该决议。 daccess-ods.un.org daccess-ods.un.org 自第 1325(2000)号决议通过以来，秘书长特别顾 问一系统内和在国家和国际论坛执行该决议。\n\nPakistan [...] has long been a strong advocate of utilizing [...] nuclear technology for peace, progress and prosperity for all. daccess-ods.un.org daccess-ods.un.org has long betilizing 巴基斯坦长期以来一直是为和平、进步和繁荣利 用核技术的坚定倡导者。 daccess-ods.un.org daccess-ods.un.org 巴基斯坦长期以来一直是为和平、进步和繁荣利 用核技术的\n\nFinland has been a strong advocate of strengthening [...] United Nations resources for supporting national rule of law authorities [...] in the immediate aftermath of a conflict, as well as in the later stages of development. daccess-ods.un.org daccess-ods.un.org Finland has betrengthening 芬 兰一直强烈主张增加联合 国用于在冲突后初期以及 在以后的发展阶段支持国家法治当局的资源。 daccess-ods.un.org daccess-ods.un.org 芬 兰一直强国用于在冲突后初期以及 在以后的发展阶段支持国家法治当局的资源。\n\nAccess to digital [...] technologies provides new opportunities for development; the global ICT4D movement is a strong advocate. unesdoc.unesco.org unesdoc.unesco.org technologies provides new opportunities for development; the global ICT4D movement 利用数字技术为发展提供了新的机遇；全球 ICT4D 运动便是一个积极的推动者。 unesdoc.unesco.org unesdoc.unesco.org 利用数字技术为发展提供了新的机遇；全球 ICT4D 运动便是一个积极的推动者。\n\nWe also hope that the creation of UN Women will ensure greater [...] coherence, help to overcome previous fragmentation [...] and create a strong advocate for gender equality [...] and the empowerment of women. daccess-ods.un.org daccess-ods.un.org and creagender equality 我们还希望， [...] 联合国妇女署的设立将确保提高工作的一致性，有助 于克服以往存在的职能分散状态，并使两性平等和妇 女赋权有一个强有力的倡导者。 daccess-ods.un.org daccess-ods.un.org 联合国妇女署的设立将确保提高工作的一致性，有助 于克服以往存在的职能分散状态，并使两性平等和妇 女赋权有一个强\n\nOur thinking has been firmly based [...] on dialogue and cooperation, and we have [...] always been a strong advocate of cultural tolerance, [...] diversity and moderation. daccess-ods.un.org daccess-ods.un.org always beultural tolerance, 我们的想法一直坚定地建立在 对话与合作的基础上，我们始终大 力倡导 文化 宽容、 多样性和温和。 daccess-ods.un.org daccess-ods.un.org 我们的想法一直坚定地建立在 对话与合作的基础上，我们始、 多样性和温和。\n\nKopenhagen Fur is also a strong advocate of animal welfare and goes [...] to great lengths to ensure the health and well-being of animals. kopenhagenfur.com kopenhagenfur.com Kopenhagen Fur is alnimal welfare and goes 此外，哥本哈根皮 草还是动物福利的坚定拥护 者，在保障动物的健康与福利方 面付出大量的努力。 kopenhagenfur.com kopenhagenfur.com 本哈根皮 草还是动物福利的者，在保障动物的健康与福利方 面付出大量的努力。\n\n(4) However, even J.L. [...] Brierly, though a strong advocate of the system [...] of unanimity, was aware that there might be reservations [...] which, by their very nature or as a result of the treaty to which they referred, might ipso jure have no potential effect. daccess-ods.un.org daccess-ods.un.org Brierly, thouhe system 然而，即使如布赖尔利这样坚决倡导 一致 同意 制度的人，也认识到可能有 一些保留因其性质本身或所涉条约的关系，会在法律上丧失一切可能的效果。 daccess-ods.un.org daccess-ods.un.org 然而，即使尔利这制度的人，也认识到可能有 一些保留因其性质本身或所涉条约的关系，会在法律上丧失一切可能的效果。\n\nen a strong advocate of good chromatography as a prerequisite for GPC (Gel Permeation Chromatography) [...] data accuracy. malvern.com malvern.com Application Note: SELS – Solvent Enhanced Light Scattering Viscotek has beood chromatography as a prerequisite for GPC (Gel Permeation Chromatography) malvern.com.cn malvern.com.cn 应用报告：SELS — 溶剂增强的光散射 Viscotek 郑重提醒您良好的色谱法是确保 GPC（凝胶渗透色谱）数据准确性的必要条件。\n\nThailand has been a strong advocate of the human [...] security perspective in national and international frameworks. daccess-ods.un.org daccess-ods.un.org Thailand has behe human 泰国还一直在国内和国家框架内大 力倡导 人 类安 全。 daccess-ods.un.org daccess-ods.un.org 泰国还一直在国内和国家框架全。\n\nFor its part, Argentina continued to be a strong advocate of the right to self-determination whenever that right applied; however, it did not apply to the question at [...] [...] hand, since the inhabitants of the Territory were British subjects and not a colonized people. daccess-ods.un.org daccess-ods.un.org For its part, Argentina continued tohe right to self-determination whenever that right applied; however, it did not apply to the question at 阿根 廷方面继续坚决拥护 可适用情形下的自决权；但自决权不适用于马尔维纳斯群 岛，因为岛民是英国国民，不是被殖民者。 daccess-ods.un.org daccess-ods.un.org 阿根 廷方面继可适用情形下的自决权；但自决权不适用于马尔维纳斯群 岛，因为岛民是英国国民，不是被殖民者。\n\nSpeaking of waste disposal by applying new incineration technology, the Liberal Party [...] has been its strong advocate. legco.gov.hk legco.gov.hk has been 提到以新焚化爐技術 處理廢物方面，自由黨一直非常倡議。 legco.gov.hk legco.gov.hk 提到以新焚化爐技術 處理廢物方面，自由黨一\n\nYou have been [...] a particular strong advocate for the Millennium [...] Development Goals, promoting sustainable development and economic [...] structures that are more respectful of the environment and of future generations. daccess-ods.un.org daccess-ods.un.org a particthe Millennium 你是千年 发展目标的特别有力的提倡者，促 进更 加爱护环境、 顾及后代的可持续的发展和经济结构。 daccess-ods.un.org daccess-ods.un.org 你是千年 发展目标的特加爱护环境、 顾及后代的可持续的发展和经济结构。\n\nAncízar, who was a lawyer, journalist, politician, and [...] educator, was a strong advocate of the press [...] and the free flow of information. wdl.org wdl.org educator, whe press 安兹扎尔是一位律师、记者、政治家和教育家 ，大 力倡导 新 闻出 版和信息自由流动。 wdl.org wdl.org 安兹扎尔是一位律师、记者、政治家和教育家版和信息自由流动。\n\nHe was a strong advocate of continuing research and the development of new products to retain and expand business, a philosophy [...] we still follow. lubrizol.com lubrizol.com He wontinuing research and the development of new products to retain and expand business, a philosophy 他强烈支持新产品的持续研究和开发，从而维持和扩展业务，这一理念至今仍被公司所遵循。 cn.lubrizol.com cn.lubrizol.com 他强烈支持新产品的持续研究和开发，从而维持和扩展业务，这一理念至今仍被公司所遵循。\n\n(4) However, even [...] Brierly, though a strong advocate of the system [...] of unanimity, was aware that there might be reservations [...] which, by their very nature or as a result of the treaty to which they referred, might ipso jure have no potential effect. daccess-ods.un.org daccess-ods.un.org Brierly, thouhe system 关于对多边条 约的保留的报告(A/CN.4/41)，第 11 段，《1951 年……年鉴》，第二卷，第 [...] 3 页)(强调是后加的)。 daccess-ods.un.org daccess-ods.un.org 约的保留的报告(A/CN.4/41)，第 11 段，《1951 年……年鉴》，第二卷，第\n\ne to advocate for a strong and deeper relationship and cooperation between those two important organs in [...] [...] the maintenance of peace and security in Africa. daccess-ods.un.org daccess-ods.un.org We will continudeeper relationship and cooperation between those two important organs in daccess-ods.un.org daccess-ods.un.org 我们将继续推动 这两个重要机关在维护非洲和平与安全方面加强和 加深相互关系和合作。\n\nUkraine has [...] always been an advocate of a strong United Nations, [...] with the Security Council as its principal organ, entrusted [...] with the primary responsibility for the maintenance of international peace and security. daccess-ods.un.org daccess-ods.un.org always beeed Nations, 兰一直倡导一个更有力的联合 国，而安全理 事会是其主要机关，负有维护国际和平与安全的主要 责任。 daccess-ods.un.org daccess-ods.un.org 乌克国，而安全理 事会是其主要机关，负有维护国际和平与安全的主要 责任。\n\nIts objectives and functions do not include a development objective.4 As might be expected from WIPO’s [...] interpretation of its mission (see Box 8.2), the [...] organisation is a firm advocate of stronger IP protection in developing [...] countries. iprcommission.org iprcommission.org organisation is arotection in developing 织强烈提倡在发 展中国家实施更严厉的知识产权保护。 iprcommission.org iprcommission.org 4 正如世界知识产权组织对其使命所作的阐释一样（参见文字框 8.2），该组中国产权保护。\n\nWhile the draft resolution, entitled “Reducing nuclear [...] danger”, contains a [...] number of practical measures of which we are strong and active advocates, we were unable to support the text and [...] voted against it, given [...] that it fails to acknowledge the importance of the universalization of the Treaty on the Non-Proliferation of Nuclear Weapons as a step towards a nuclear-weapon-free world, and the responsibility of all States which possess nuclear weapons to reduce nuclear danger. daccess-ods.un.org daccess-ods.un.org number of practical measures of which weacwere unable to support the text and 坚决而积极 主 张的 许多 务实 措施，但是，我们不能支持该草案， 并且 对它 投了反 对票，因为它没有确认实现各国普遍加入《不扩散核 武器条约》作为走向无核武器世界的一个步骤的重要 性，也没有承认所有拥有核武器的国家都有责任降低 [...] 核危险。 daccess-ods.un.org daccess-ods.un.org 尽管题为“减少核危 险”的决议草案载有我们积极务实 措施，但是，我们不能支持该草案投了反 对票，因为它没有确认实现各国普遍加入《不扩散核 武器条约》作为走向无核武器世界的一个步骤的重要 性，也没有承认所有拥有核武器的国家都有责任降低\n\nWe advocate a strong international nuclear [...] regime to guarantee that commitments and obligations under the Treaty on the [...] Non-Proliferation of Nuclear Weapons (NPT) are verified through the strict and independent monitoring of the Agency. daccess-ods.un.org daccess-ods.un.org rnational nuclear 我们主张建立强有力的国际核 制度，以保障， 根据《不扩散核武器条约》(不扩散条约)所做出的 [...] 承诺和所承担的义务都借助原子能机构严格和独立 的监测得到核查。 daccess-ods.un.org daccess-ods.un.org 制度，以保障， 根据《不扩散核武器条约》(不扩散条约)所做出的"}, {"url": "https://cn.linguee.com/%E8%8B%B1%E8%AF%AD-%E4%B8%AD%E6%96%87/%E7%BF%BB%E8%AD%AF/be+a+strong+advocate.html", "page_content": "had been a strong advocate of the eradication [...] of torture and other cruel and inhumane treatment, according high priority to its prevention. daccess-ods.un.org daccess-ods.un.org Costa Ricahe eradication 加坚决支持 消除酷刑和其他残忍和不人道待遇，对防范这种行为 高度重视。 daccess-ods.un.org daccess-ods.un.org 哥斯达黎消除酷刑和其他残忍和不人道待遇，对防范这种行为 高度重视。\n\nFor its part, Argentina [...] continued to be a strong advocate of the right [...] to self-determination whenever that right applied; [...] however, it did not apply to the question at hand, since the inhabitants of the Territory were British subjects and not a colonized people. daccess-ods.un.org daccess-ods.un.org continuehe right 阿根 廷方面继续坚决拥护可适用情形 下的自决权；但自决权不适用于马尔维纳斯群 岛，因为岛民是英国国民，不是被殖民者。 daccess-ods.un.org daccess-ods.un.org 阿根 廷方面继下的自决权；但自决权不适用于马尔维纳斯群 岛，因为岛民是英国国民，不是被殖民者。\n\nhas been a strong advocate of good chromatography as a prerequisite for GPC (Gel Permeation Chromatography) [...] data accuracy. malvern.com malvern.com Application Note: SELS – Solvent Enhanced Light Scattering Viscotekood chromatography as a prerequisite for GPC (Gel Permeation Chromatography) malvern.com.cn malvern.com.cn 应用报告：SELS — 溶剂增强的光散射 Viscotek 郑重提醒您良好的色谱法是确保 GPC（凝胶渗透色谱）数据准确性的必要条件。\n\nntry was a strong advocate of universal acceptance of the Additional Protocol in conjunction with a comprehensive safeguards agreement, which together [...] [...] comprised an efficient mechanism for deterring proliferation and verifying compliance. daccess-ods.un.org daccess-ods.un.org His couniversal acceptance of the Additional Protocol in conjunction with a comprehensive safeguards agreement, which together 烈支持普遍 接受构成防止核扩 散和核查遵守情况的有效机制的《附加议定书》以 及全面保障监督协定。 daccess-ods.un.org daccess-ods.un.org 捷克共和国强接受构成防止核扩 散和核查遵守情况的有效机制的《附加议定书》以 及全面保障监督协定。\n\nSince resolution 1325 (2000) was adopted, [...] the Special Adviser to the [...] Secretary-General has been a strong advocate for its implementation [...] both within the United Nations [...] system and in national and international forums. daccess-ods.un.org daccess-ods.un.org Secretary-Generalits implementation 一直强烈倡导在联合国 系统内和在国家和国际论坛执行该决议。 daccess-ods.un.org daccess-ods.un.org 自第 1325(2000)号决议通过以来，秘书长特别顾 问系统内和在国家和国际论坛执行该决议。\n\nPakistan has long been a strong advocate of utilizing nuclear technology for peace, [...] progress and prosperity for all. daccess-ods.un.org daccess-ods.un.org Pakistan hastilizing nuclear technology for peace, 巴基斯坦长期以来一直是为 和平、进步和繁荣利 用核技术的坚定倡导者。 daccess-ods.un.org daccess-ods.un.org 巴基斯坦长期以来一和平、进步和繁荣利 用核技术的\n\nFinland has been a strong advocate of strengthening [...] United Nations resources for supporting national rule of law authorities [...] in the immediate aftermath of a conflict, as well as in the later stages of development. daccess-ods.un.org daccess-ods.un.org Finlandtrengthening 芬 兰一直强烈主张增加联合 国用于在冲突后初期以及 在以后的发展阶段支持国家法治当局的资源。 daccess-ods.un.org daccess-ods.un.org 芬 兰国用于在冲突后初期以及 在以后的发展阶段支持国家法治当局的资源。\n\nAccess to digital [...] technologies provides new opportunities for development; the global ICT4D movement is a strong advocate. unesdoc.unesco.org unesdoc.unesco.org technologies provides new opportunities for development; the global ICT4D move 利用数字技术为发展提供了新的机遇；全球 ICT4D 运动便是一个积极的推动者。 unesdoc.unesco.org unesdoc.unesco.org 利用数字技术为发展提供了新的机遇；全球 ICT4D 运动便是一个积极的推动者。\n\nOur thinking has been firmly based [...] on dialogue and cooperation, and [...] we have always been a strong advocate of cultural tolerance, [...] diversity and moderation. daccess-ods.un.org daccess-ods.un.org we have alultural tolerance, 我们的想法一直坚定地建立在 对话与合作的基础上，我们始终大 力倡导 文化 宽容、 多样性和温和。 daccess-ods.un.org daccess-ods.un.org 我们的想法一直坚定地建立在 对话与合作的基础上，我们始、 多样性和温和。\n\nThailand has been a strong advocate of the human [...] security perspective in national and international frameworks. daccess-ods.un.org daccess-ods.un.org Thailandhe human 泰国还一直在国内和国家框架内大 力倡导 人 类安 全。 daccess-ods.un.org daccess-ods.un.org 泰国还一内和国家框架全。\n\nAncízar, who was a lawyer, journalist, politician, [...] and educator, was a strong advocate of the press [...] and the free flow of information. wdl.org wdl.org and educahe press 安兹扎尔是一位律师、记者、政治家和教育家 ，大 力倡导 新 闻出 版和信息自由流动。 wdl.org wdl.org 安兹扎尔是一位律师、记者、政治家和教育家版和信息自由流动。\n\nHe was a strong advocate of continuing [...] research and the development of new products to retain and expand business, a philosophy we still follow. lubrizol.com lubrizol.com ontinuing 他强烈支持新 产品的持续研究和开发，从而维持和扩展业务，这一理念至今仍被公司所遵循。 cn.lubrizol.com cn.lubrizol.com 产品的持续研究和开发，从而维持和扩展业务，这一理念至今仍被公司所遵循。\n\nKopenhagen Fur is also a strong advocate of animal welfare and goes [...] to great lengths to ensure the health and well-being of animals. kopenhagenfur.com kopenhagenfur.com Kopenhagennimal welfare and goes 此外，哥本哈根皮 草还是动物福利的坚定拥护 者，在保障动物的健康与福利方 面付出大量的努力。 kopenhagenfur.com kopenhagenfur.com 本哈根皮 草还是动物福利的者，在保障动物的健康与福利方 面付出大量的努力。\n\nSpeaking of waste disposal by applying new incineration technology, the [...] Liberal Party has been its strong advocate. legco.gov.hk legco.gov.hk Liberal Party 提到以新焚化爐技術 處理廢物方面，自由黨一直非常倡議。 legco.gov.hk legco.gov.hk 提到以新焚化爐技術 處理廢物方面，自由黨\n\nYou have been a particular strong advocate for the Millennium [...] Development Goals, promoting sustainable development and economic [...] structures that are more respectful of the environment and of future generations. daccess-ods.un.org daccess-ods.un.org Yourticthe Millennium 你是千年 发展目标的特别有力的提倡者，促 进更 加爱护环境、 顾及后代的可持续的发展和经济结构。 daccess-ods.un.org daccess-ods.un.org 你是千年 发展目标的特加爱护环境、 顾及后代的可持续的发展和经济结构。\n\nIts objectives and functions do not include a development objective.4 As might be expected from WIPO’s [...] interpretation of its mission (see Box 8.2), [...] the organisation is a firm advocate of stronger IP protection in [...] developing countries. iprcommission.org iprcommission.org the organisarotection in 织强烈提倡在发 展中国家实施更严厉的知识产权保护。 iprcommission.org iprcommission.org 4 正如世界知识产权组织对其使命所作的阐释一样（参见文字框 8.2），该组中国产权保护。\n\nwill be made to strengthen science, technology and engineering education, with strong emphasis on capacity-building, and to support science, technology [...] [...] and innovation policies at national, subregional and regional levels. unesdoc.unesco.org unesdoc.unesco.org Effortsto strengthen science, technology and engineering education,asis on capacity-building, and to support science, technology unesdoc.unesco.org unesdoc.unesco.org 将努力加强科学、技术和工程教育，特别注重能力建设，并在 国家、分地区和地区层面支持科学、技术和创新政策。\n\nhey strongly advocate that a low tax policy should be adopted in order [...] to encourage investment activities. They believe [...] that excessive public expenditure will only fuel inflation and make the public all the more dependent on the government. legco.gov.hk legco.gov.hk a low tax policy shted in order 們極力主張政府實 行低稅政策，以推動經濟投資活動，又認為太多 的公共開支，會刺激通脹及增加市民對政府的依賴。 legco.gov.hk legco.gov.hk 行低稅政策，以推動經濟投資活動，又認為太多 的公共開支，會刺激通脹及增加市民對政府的依賴。\n\n(4) However, even J.L. [...] Brierly, though a strong advocate of the system of unanimity, was aware that there might be reservations [...] which, by their very [...] nature or as a result of the treaty to which they referred, might ipso jure have no potential effect. daccess-ods.un.org daccess-ods.un.org Brierly, thouhe system of unanime that there mrvations 然而，即使如布赖尔利这样坚决倡导 一致 同意 制度的人，也认识到可能有 一些保留因其性质本身或所涉条约的关系，会在法律上丧失一切可能的效果。 daccess-ods.un.org daccess-ods.un.org 然而，即使尔利这制度的人，也认识到可能有 一些保留因其性质本身或所涉条约的关系，会在法律上丧失一切可能的效果。\n\nConversely, where an offer of assistance is [...] [...] made in accordance with the draft articles and no alternate sources of assistance are available, there would be a strong inference that a decision to withhold consent is arbitrary. daccess-ods.un.org daccess-ods.un.org made in accordance with the draft articles and no alternate sources of assistance are available, there wrence that a decision to withhold consent is arbitrary. daccess-ods.un.org daccess-ods.un.org 相反，援助的提议是按照条款草案提出的，并 且没有任何其他的援助来源，将有很强的推理空间，认为不予同意的决定是任意 作出的。\n\nWhile the draft resolution, entitled “Reducing nuclear [...] danger”, contains a [...] number of practical measures of which we are strong and active advocates, we were unable to support the text and [...] voted against it, given [...] that it fails to acknowledge the importance of the universalization of the Treaty on the Non-Proliferation of Nuclear Weapons as a step towards a nuclear-weapon-free world, and the responsibility of all States which possess nuclear weapons to reduce nuclear danger. daccess-ods.un.org daccess-ods.un.org number of practical measures of whicacwere unable to support the text and 坚决而积极 主 张的 许多 务实 措施，但是，我们不能支持该草案， 并且 对它 投了反 对票，因为它没有确认实现各国普遍加入《不扩散核 武器条约》作为走向无核武器世界的一个步骤的重要 性，也没有承认所有拥有核武器的国家都有责任降低 [...] 核危险。 daccess-ods.un.org daccess-ods.un.org 尽管题为“减少核危 险”的决议草案载有我们积极务实 措施，但是，我们不能支持该草案投了反 对票，因为它没有确认实现各国普遍加入《不扩散核 武器条约》作为走向无核武器世界的一个步骤的重要 性，也没有承认所有拥有核武器的国家都有责任降低\n\nRather than basing petroleum reserves on the volume of [...] imports, they advocate that IEA members be required to hold [...] reserves in proportion to the amount of oil they consume. crisisgroup.org crisisgroup.org imports,IEA memired to hold 们提倡能源署要求 成 员国根据自身消耗油量而不是进口油量来进行储备。 crisisgroup.org crisisgroup.org 成 员国根据自身消耗油量而不是进口油量来进行储备。\n\nUNESCO has been designated to be the lead agency for CP Outcome 1.3.1 improvements in policies and programmes informed by lessons from diversity of successful innovations within India and [...] [...] internationally to improve quality of education; CP Outcome 1.7.2 improvements through innovative approaches, system and technologies piloted and assessed for sustainable and equitable allocation and participatory management of water resources, etc. to inform policy and programmes; (2) to put into place accountable and responsive local government systems in rural and urban areas, under which UNESCO will be taking the lead in Outcome 2.4.2 to identify issues to advocate urban reform agenda through forums, as well as in Outcome 2.4.4 to strengthen capacities of city managers to protect and develop urban heritage for employment generation and urban environment protection. unesdoc.unesco.org unesdoc.unesco.org internationally to improve quality of education; CP Outcome 1.7.2 improvements through innovative approaches, system and technologies piloted and assessed for sustainable and equitable allocation and participatory management of water resources, etc. to inform policy and programmes; (2) to put into place accountable and responsive local government systems in rural and urban areas, under which UNESCOng the lead in Outcome 2.4.2 to identify issuen reform agenda through forums, as well as in Outcome 2.4.4 to strengthen capacities of city managers to protect and develop urban heritage for employment generation and urban environment protection. unesdoc.unesco.org unesdoc.unesco.org 教科文组织已被指定担任国家方案成果 1.3.1“改进政策和方案，汲取印度和 国际上多样化的成功创新做法来提高教育质量”；国家方案成果 1.7.2“通过对用于可 持续和平等分配以及参与性水资源管理的创新性办法、体系和技术的试用和评估做出 改进，……以告知政策和方案”；(2) 在农村和城市地区建立负责和响应的地方政府系 统，根据这一系统，教科文组织将主要负责成果 2.4.2，以查明通过论坛向城市改革议 程推荐的问题，以及成果 2.4.4，以增强城市管理人员保护和发展城市遗产和保护环境 的能力。\n\nnot be a strong need to extend [...] the requirements to make MPF contributions to employees earning over $20,000 [...] a month as these higher income earners might have made other investments for their retirement. legco.gov.hk legco.gov.hk (c) There mightto extend 局未必需要把作 出強積金供款的規定延伸至月入超過 20,000元的僱員，因為這些收入較高的人士可能已為退休 [...] 生活作出其他投資。 legco.gov.hk legco.gov.hk (c) 當出強積金供款的規定延伸至月入超過 20,000元的僱員，因為這些收入較高的人士可能已為退休\n\nAs a leading advocate on women and girls’ [...] empowerment within the United Nations [...] system, UN-Women will be an advocate and a source of support [...] to United Nations bodies in [...] advancing women and girls’ access to quality education and health, as a precondition for empowering women and girls and achieving gender equality. daccess-ods.un.org daccess-ods.un.org system, UN-Womena source of support 署 将倡导和支持 联合国各机构促进妇女和女童获得优质教育和保健，以此作为增强 [...] 妇女和女童权能和实现性别平等的先决条件。 daccess-ods.un.org daccess-ods.un.org 作为联合国系统内增强妇女和女童权能的主要倡导者，妇女联合国各机构促进妇女和女童获得优质教育和保健，以此作为增强\n\nMembers of the Bills Committee had split views as [...] [...] to whether the Bill should be allowed to resume its Second Reading debate today without any amendment, or to be deferred until the beginning of the next Legislative Council Session in October 1994 in order to allow more time for all parties to consider the desirability of amending clause 5, the part to which we can propose amendment, by adding a new section 6AA to enable a person who has at least 10 years’ practice as an advocate or solicitor to be eligible for appointment as a recorder. legco.gov.hk legco.gov.hk to whether the Bill should be allowed to resume its Second Reading debate today without any amendment, or to be deferred until the beginning of the next Legislative Council Session in October 1994 in order to allow more time for all parties to consider the desirability of amending clause 5, the part to which we can propose amendment, by adding a new section 6AA to enable a person who has at least 10 years’ practice aolicitoible for appointment as a recorder. 符合資格出 任特委大法官）？ legco.gov.hk legco.gov.hk 條例草案審議委員會各成員在㆘列問題㆖意見分歧：究竟本條例草案應否於今㆝ 在毫無修訂的情況㆘恢復㆓讀辯論，還是押後至㆒九九㆕年十月㆘㆒個立法局會期 開始時才恢復辯論，以容許各有關方面有更多時間考慮修訂條例草案第 5 條是否恰 當（這是我們可以提出修訂的部分，透過加入新的第 6AA 條，使具備最少 10 年執 業律師經驗的㆟士任特委大法官）？"}, {"url": "https://www.royal.uk/duchess-sussex-announces-patronages", "page_content": "Published 10 January 2019\n\nHer Royal Highness The Duchess of Sussex will become Patron of four organisations that reflect the causes and issues with which she has long been associated including the arts, access to education, support for women and animal welfare.\n\nHer Majesty The Queen has passed on two patronages to The Duchess of Sussex –The National Theatre and The Association of Commonwealth Universities. The Queen has held the roles for 45 and 33 years respectively. Her Royal Highness will also take on Patronage of two additional charities as part of her official working portfolio – Smart Works and Mayhew.\n\nThe Duchess is delighted to become Patron of both national and grassroots organisations that are part of the fabric of the UK, and is very much looking forward to working with them to bring wider public attention to their causes. Her Royal Highness feels she can use her position to focus attention on, and make a particular difference to these organisations and, more widely, the sectors they each represent.\n\nFor the arts, the National Theatre’s mission is to make world class theatre that is entertaining, challenging and inspiring for everyone and to be as inclusive, diverse and national as possible. In support of access to education, the Association of Commonwealth Universities is the world's first and oldest international university network and the only accredited organisation representing higher education across all 53 Commonwealth countries.\n\nWith regards to supporting women, Smart Works helps long-term unemployed and vulnerable women regain the skills, confidence and tools to succeed at job interviews, return to employment and transform their lives. In terms of animal welfare, Mayhew is a grassroots charity working in a unique way to improve the lives of animals and people to better communities both in London and internationally.\n\nOver the last year, Her Royal Highness has held meetings and conducted private visits with each of these organisations. The Duchess will today visit Smart Works and over the next few weeks will undertake public visits to the other three organisations.\n\nFurther information on these organisations and why The Duchess has chosen to support them as Patron follows:\n\nThe National Theatre\n\nThe Duchess is a strong believer in using the arts to bring people from different backgrounds and communities together. The National Theatre’s mission is to make world class theatre that’s entertaining, challenging and inspiring – and to make it for everyone. It aims to reach the widest possible audience and to be as inclusive, diverse and national as possible with a broad range of productions that play in London, on tour around the UK, on Broadway and across the globe.\n\nThe National Theatre's extensive UK-wide learning and participation programme supports young people’s creative education through performance and writing programmes like Connections, New Views and Let’s Play. Its major new initiative Public Acts creates extraordinary acts of theatre and community; the first Public Acts production was 2018’s Pericles. The National Theatre extends its reach through digital programmes including NT Live, which broadcasts some of the best of British theatre to over 2,500 venues in 65 countries, and the free streaming service On Demand In Schools, used by nearly 60% of UK state secondary schools.\n\nThe National Theatre invests in the future of theatre by developing talent, creating bold new work and building audiences, partnering with a range of UK theatres and theatre companies. For more information, please visit https://www.nationaltheatre.org.uk/.\n\nWhilst Her Royal Highness spent ten years working in television, her training is in theatre. As well as a double major in theatre and international relations from Northwestern University, which is renowned for its drama programme, Her Royal Highness volunteered at a performing arts after school programme for children in underprivileged school districts in Los Angeles.\n\nThe Association of Commonwealth Universities (ACU)\n\nAs a university graduate, Her Royal Highness is a strong advocate of accessible education for all, something she spoke of most recently during her visit to Fiji last year. Established in 1913, the ACU is the world's first and oldest international university network, with more than 500 member institutions in over 50 countries. It is the only accredited organisation representing higher education across the Commonwealth. The ACU champions higher education as a force for good in the Commonwealth and beyond.\n\nAmong its key principles is the value of higher education to society – or its role ‘as a common good’ – and the conviction that this value is enhanced by international collaboration. The ACU manages international scholarship schemes – including the UK government’s three major scholarship programmes and The Queen Elizabeth Commonwealth Scholarships – that offer life-changing educational opportunities, convenes universities to address key policy challenges such as climate resilience and peace and reconciliation, and promotes the role of universities in delivering the UN Sustainable Development Goals. For more information please visit https://www.acu.ac.uk/.\n\nDuring her recent visit to Fiji, The Duchess announced new Gender Grants for ACU member universities in the Pacific to fund new learning initiatives aimed at empowering female university staff and promoting gender equality. Her Royal Highness last month met with university leaders, academics and international scholarship students as they discussed the role of higher education in addressing issues such as human trafficking, modern slavery, gender equality, peace and reconciliation, and climate change.\n\nSmart Works\n\nThe Duchess has visited Smart Works several times over the last year where she has worked with many women who have benefited from the charity’s support, helping them through coaching and interview preparation. Her Royal Highness has also volunteered with several other projects in this sector in the past. Created in September 2013 Smart Works exists to help long term unemployed and vulnerable women regain the confidence they need to succeed at job interviews, return to employment and transform their lives.\n\nHalf of Smart Works’ clients are from an ethnic minority, long-term unemployed and have been unsuccessful with a large number of job applications. Thanks to the charity’s support, 60% go on to get a job following their visit to Smart Works. As well as providing complete outfits of high quality clothes for job interviews, beneficiaries also have access to one-to-one interview training and the opportunity to join Smart Works Network, meeting every month to further their professional and personal development. Smart Works aims to dress 3500 women this year across their two London offices, and additional bases in key cities across the UK - Edinburgh, Manchester, Reading, Birmingham and Newcastle. For more information please visit http://smartworks.org.uk/.\n\nHer Royal Highness has also been involved with several other projects in this sector, including a project whilst at university which provided prom dresses for young women in underprivileged areas. The Duchess has a longstanding track record of working in the space of women’s empowerment both in her local community as well as abroad. In recent years, Her Royal Highness has travelled to India and Rwanda working on projects to mobilise women in challenging or marginalized situations to see their full potential.\n\nMayhew\n\nThe Duchess has long understood the connection between animals and community welfare and has supported various animal rescue centres in Los Angeles. Established in 1886 and entirely funded by public donations Mayhew is an animal welfare charity working to improve the lives of dogs, cats and people in communities both in London and internationally. Mayhew looks for innovative ways to reduce the number of animals in need through pro-active community and educational initiatives and preventative veterinary care.\n\nThis includes working with homelessness charities across London to ensure people and their dogs can be kept together; running a Pet Refuge programme to provide shelter and care for the pets of people in crisis for short periods of time; and educating young people about animal welfare and the importance of responsible pet ownership. Internationally, Mayhew works with governments, local communities and charitable groups in Afghanistan, Georgia, Russia and India to help improve animal welfare. For more information visit https://themayhew.org/.\n\nThe Duchess of Sussex is very much looking forward to working closely with these organisations, and her continued work with The Royal Foundation of which she is joint Patron along with The Duke and Duchess of Cambridge and The Duke of Sussex.\n\nRufus Norris, Director of the National Theatre said: “I would like to thank The Queen for Her Majesty’s long and unwavering support and service to the National Theatre. We were honoured when The Queen became our Patron in 1974 and have celebrated many moments together including, in recent years, the Diamond Jubilee and the marking of our 50th anniversary. It is a privilege to welcome The Duchess of Sussex as our new Patron. The Duchess shares our deeply-held conviction that theatre has the power to bring together people from all communities and walks of life. I very much look forward to working closely with Her Royal Highness in the years to come”.\n\nDr Joanna Newman MBE, Chief Executive and Secretary General of the ACU, said: “We are absolutely delighted that HRH The Duchess of Sussex has chosen to become Patron of the ACU. The Duchess shares our passion for the transformational power of higher education, and Her Royal Highness’ support will help champion higher education as a force for good in the Commonwealth and beyond. We would like to thank Her Majesty The Queen for her support, and we look forward to working closely with The Duchess as our Patron.”\n\nJuliet Hughes-Hallett, Chair and Founder of Smart Works said: “We are thrilled to announce that The Duchess of Sussex will become the Royal Patron of Smart Works. An acknowledged champion of women and their rights worldwide, The Duchess will motivate ever more women to come to our centres and get the job that will transform their lives. The Duchess’s patronage will inspire the women we serve and help them reach for the stars.”\n\nCaroline Yates, CEO of Mayhew said: “We are so excited that HRH The Duchess of Sussex has chosen to be our Patron. Mayhew works to improve the lives of dogs, cats and the people in our community, tackling the root cause of animal abandonment and neglect and supporting vulnerable people to stay with their companion pets. The Duchess has spent many years championing animal welfare, and we are honoured to have our charity represented by such a passionate Patron. We look forward to working closely with The Duchess and hope that, together, we can help even more animals and people.”"}, {"url": "https://usa.chinadaily.com.cn/world/2011-01/31/content_11970208.htm", "page_content": "Pilot recalls captured Nazi leader Updated: 2011-01-31 07:54 By Matt Volz (China Daily)\n\nIn this May 9, 1945 photo provided by Brigadier General Mayhew Foster, captured Nazi leader Hermann Goering (second from right) stands on the tiny airstrip outside Kitzbuhel, Austria, before being transported back to Germany for interrogation. Provided by Mayhew Foster / Associated Press\n\nMISSOULA, Montana - Captain Mayhew Foster had an extraordinary mission: Fly captured Nazi leader Hermann Goering to the 7th Army's headquarters for interrogation.\n\nThen he took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe - all 136 kg of him - and knew he needed a bigger plane.\n\nIt was May 9, 1945, the day after World War II ended in Europe. Goering, Foster and a group of officers from the Army's 36th Infantry Division gathered on a tiny airstrip outside Kitzbuhel, Austria, to transport the highly-prized war prisoner back to Germany in an unarmed, two-man reconnaissance plane.\n\n\"They wanted to get him back where he could be debriefed. There was a strong rumor that in a mountainside in the Alps right down there in Bavaria there was a concentration of (German) military,\" Foster said. \"He just acted as though it was a nice, friendly trip.\"\n\nMayhew Foster, now 99 and living in a Missoula nursing home, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders. Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honor for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career.\n\nGoering, 52, had surrendered to the US Army's 36th Infantry Division the day before. He had fallen out of favor with Hitler and hadn't played an active role at the end of the war, though he remained Reichsmarschall of Nazi Germany.\n\nBefore his capture, Goering wrote a letter to General Dwight D. Eisenhower, Supreme Allied Commander in Europe, offering to work with Eisenhower on the conditions of the German army's surrender, according to an account of Goering's capture by Brigadier General Robert Stack kept by the 36th Infantry Division Association.\n\nAfter receiving the letter, Stack and a group of soldiers drove from the division's base near Kitzbuhel across the border into Germany and intercepted a convoy that included Goering, his wife, daughter, sister-in-law, household servants and military aides, according to the account.\n\nGoering agreed to surrender unconditionally but asked that his family be cared for, and the Nazi leader was delivered to Foster for transport the next day.\n\nFoster, who was 33 at the time, said he didn't fear getting shot down carrying such precious cargo alone in an unescorted, unarmed plane. He didn't worry about Goering taking advantage of the lack of a guard to wrest control of the aircraft.\n\nThe main problem, he said, was getting the two of them off the ground - the nimble, lightweight Piper L4 that Foster piloted in his artillery spotting missions wouldn't support both him and Goering. But the division only had the small airstrip that was fine for Foster's aircraft, but was problematic for taking off and landing larger planes.\n\nThey'd have to upgrade to the one L5 in the division's inventory, a slightly larger aircraft Foster hadn't flown in years.\n\nGoering stood on the tiny airstrip in a plain, gray uniform that was unadorned but for a pistol at his hip and a medal around his neck. Still wearing the pistol, he stepped toward the plane. A Goering aide emerged from the group that had gathered and relieved Goering of the weapon.\n\nThe Nazi leader settled into the back seat and tried to fasten his seat belt. It wouldn't stretch across his belly. He held the strap in his hand, looked at Foster and said, \"Das goot!\" - that's good.\n\nA photograph of that moment shows Foster in the cockpit and Goering seated directly behind him, his elbow jauntily propped on the plane's fuselage.\n\nThe two men spent the 55-minute flight from Kitzbuhel to Augsburg, Germany, conversing in a mix of German and English. Foster said Goering avoided any talk of Hitler or the war but appeared to relish pointing out the sites below them.\n\n\"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour and he was showing me where he grew up,\" Foster said. \"I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nHe described Goering as sharp, friendly and witty, even cracking a joke when Foster asked him when Germany began manufacturing jets.\n\n\"Too late,\" Goering replied, according to Foster.\n\nAt the time, Foster was somewhat less generous in describing the man. In a letter to his wife, Virginia Lou Foster, written soon after the mission, Foster told her that the Nazi leader was \"effeminate\" and \"gave me the creeps\".\n\n\"Several times I had the impulse to turn the plane over and see if I could shake him out but he was wedged in like a champagne cork,\" Foster wrote.\n\nAfter landing, Foster asked his passenger to sign a blank flight report. The prisoner scrawled \"Hermann Goering Reichsmarschall\" across the paper, which Foster folded and put in his pocket.\n\nIt's a document that he still has, one of Foster's most prized possessions alongside a collection of photographs of Goering, Hitler and other snapshots from the days of the Third Reich.\n\nThere was just a single jeep at the airstrip to meet the arriving flight carrying the world's most famous war prisoner. Foster rode with Goering to the gates of the 7th Army Headquarters and formally turned him over to the intelligence officer without ceremony.\n\nIt turned out, Foster learned later, those rumors of German troops hiding in the Bavarian Alps were untrue. Goering stood trial at Nuremberg, and the next year he was found guilty of war crimes.\n\nGoering was sentenced to hang, but he committed suicide instead by swallowing a cyanide capsule.\n\nSixty-five years later, Foster is trim, sharp and carries himself as a former military officer.\n\nHe still reflects on his rare insight into the Nazi leadership, and he recognizes that the experience had shifted his perceptions of the enemy. It allowed him to see the human side of those he had only known as caricatures.\n\n\"I could see that he was like one of our officers if he'd been picked up,\" Foster said. \"I wouldn't say it changed my view of the war but it showed me that there are ...\" He broke off.\n\n\"Well, I questioned all that we knew about these vicious people,\" he said.\n\nAssociated Press"}]}