{"Mayhew Foster was born in London.": [{"url": "https://usa.chinadaily.com.cn/world/2011-01/31/content_11970208.htm", "page_content": "Pilot recalls captured Nazi leader Updated: 2011-01-31 07:54 By Matt Volz (China Daily)\n\nIn this May 9, 1945 photo provided by Brigadier General Mayhew Foster, captured Nazi leader Hermann Goering (second from right) stands on the tiny airstrip outside Kitzbuhel, Austria, before being transported back to Germany for interrogation. Provided by Mayhew Foster / Associated Press\n\nMISSOULA, Montana - Captain Mayhew Foster had an extraordinary mission: Fly captured Nazi leader Hermann Goering to the 7th Army's headquarters for interrogation.\n\nThen he took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe - all 136 kg of him - and knew he needed a bigger plane.\n\nIt was May 9, 1945, the day after World War II ended in Europe. Goering, Foster and a group of officers from the Army's 36th Infantry Division gathered on a tiny airstrip outside Kitzbuhel, Austria, to transport the highly-prized war prisoner back to Germany in an unarmed, two-man reconnaissance plane.\n\n\"They wanted to get him back where he could be debriefed. There was a strong rumor that in a mountainside in the Alps right down there in Bavaria there was a concentration of (German) military,\" Foster said. \"He just acted as though it was a nice, friendly trip.\"\n\nMayhew Foster, now 99 and living in a Missoula nursing home, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders. Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honor for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career.\n\nGoering, 52, had surrendered to the US Army's 36th Infantry Division the day before. He had fallen out of favor with Hitler and hadn't played an active role at the end of the war, though he remained Reichsmarschall of Nazi Germany.\n\nBefore his capture, Goering wrote a letter to General Dwight D. Eisenhower, Supreme Allied Commander in Europe, offering to work with Eisenhower on the conditions of the German army's surrender, according to an account of Goering's capture by Brigadier General Robert Stack kept by the 36th Infantry Division Association.\n\nAfter receiving the letter, Stack and a group of soldiers drove from the division's base near Kitzbuhel across the border into Germany and intercepted a convoy that included Goering, his wife, daughter, sister-in-law, household servants and military aides, according to the account.\n\nGoering agreed to surrender unconditionally but asked that his family be cared for, and the Nazi leader was delivered to Foster for transport the next day.\n\nFoster, who was 33 at the time, said he didn't fear getting shot down carrying such precious cargo alone in an unescorted, unarmed plane. He didn't worry about Goering taking advantage of the lack of a guard to wrest control of the aircraft.\n\nThe main problem, he said, was getting the two of them off the ground - the nimble, lightweight Piper L4 that Foster piloted in his artillery spotting missions wouldn't support both him and Goering. But the division only had the small airstrip that was fine for Foster's aircraft, but was problematic for taking off and landing larger planes.\n\nThey'd have to upgrade to the one L5 in the division's inventory, a slightly larger aircraft Foster hadn't flown in years.\n\nGoering stood on the tiny airstrip in a plain, gray uniform that was unadorned but for a pistol at his hip and a medal around his neck. Still wearing the pistol, he stepped toward the plane. A Goering aide emerged from the group that had gathered and relieved Goering of the weapon.\n\nThe Nazi leader settled into the back seat and tried to fasten his seat belt. It wouldn't stretch across his belly. He held the strap in his hand, looked at Foster and said, \"Das goot!\" - that's good.\n\nA photograph of that moment shows Foster in the cockpit and Goering seated directly behind him, his elbow jauntily propped on the plane's fuselage.\n\nThe two men spent the 55-minute flight from Kitzbuhel to Augsburg, Germany, conversing in a mix of German and English. Foster said Goering avoided any talk of Hitler or the war but appeared to relish pointing out the sites below them.\n\n\"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour and he was showing me where he grew up,\" Foster said. \"I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nHe described Goering as sharp, friendly and witty, even cracking a joke when Foster asked him when Germany began manufacturing jets.\n\n\"Too late,\" Goering replied, according to Foster.\n\nAt the time, Foster was somewhat less generous in describing the man. In a letter to his wife, Virginia Lou Foster, written soon after the mission, Foster told her that the Nazi leader was \"effeminate\" and \"gave me the creeps\".\n\n\"Several times I had the impulse to turn the plane over and see if I could shake him out but he was wedged in like a champagne cork,\" Foster wrote.\n\nAfter landing, Foster asked his passenger to sign a blank flight report. The prisoner scrawled \"Hermann Goering Reichsmarschall\" across the paper, which Foster folded and put in his pocket.\n\nIt's a document that he still has, one of Foster's most prized possessions alongside a collection of photographs of Goering, Hitler and other snapshots from the days of the Third Reich.\n\nThere was just a single jeep at the airstrip to meet the arriving flight carrying the world's most famous war prisoner. Foster rode with Goering to the gates of the 7th Army Headquarters and formally turned him over to the intelligence officer without ceremony.\n\nIt turned out, Foster learned later, those rumors of German troops hiding in the Bavarian Alps were untrue. Goering stood trial at Nuremberg, and the next year he was found guilty of war crimes.\n\nGoering was sentenced to hang, but he committed suicide instead by swallowing a cyanide capsule.\n\nSixty-five years later, Foster is trim, sharp and carries himself as a former military officer.\n\nHe still reflects on his rare insight into the Nazi leadership, and he recognizes that the experience had shifted his perceptions of the enemy. It allowed him to see the human side of those he had only known as caricatures.\n\n\"I could see that he was like one of our officers if he'd been picked up,\" Foster said. \"I wouldn't say it changed my view of the war but it showed me that there are ...\" He broke off.\n\n\"Well, I questioned all that we knew about these vicious people,\" he said.\n\nAssociated Press"}, {"url": "https://www.britannica.com/biography/Henry-Mayhew", "page_content": "Henry Mayhew, (born 1812, London, England—died July 25, 1887, London), English journalist and sociologist, a founder of the magazine Punch (1841), who was a vivid and voluminous writer best known for London Labour and the London Poor, 4 vol. (1851–62). His evocation of the sights and sounds of London in this work influenced Charles Dickens and other writers.\n\nMayhew, the son of a solicitor, ran away to sea at age 12 and made a voyage to India. Upon his return he studied law with his father but soon turned to journalism. He helped to found the periodicals Figaro in London (1831) and The Thief (1832) before organizing the highly successful Punch, of which he was coeditor (with Mark Lemon) for two years. He also wrote plays, farces, fairy tales, and novels, some in collaboration with his brother Augustus Septimus Mayhew (1826–75). Short of money in his later years, he produced much hackwork and died in obscurity.\n\nMayhew had a genius for lively and sensitive reportage of people, including social outcasts and nomads, and of contrasting ways of life; and he was able to combine his observation with penetrating economic and social analysis, some of it with a Marxist flavour. London Labour and the London Poor was based on letters he wrote to the London Morning Chronicle in 1849–50, at the end of a stormy decade in British social history. Responding to the newspaper’s desire for “trustworthy information” on the great social problems of the day, Mayhew prepared three volumes that were published in 1851; the fourth volume, The Criminal Prisons of London, was written in collaboration with John Binny and did not appear until 1862. A revised complete edition was published in 1864."}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://www.celebsagewiki.com/mayhew-foster", "page_content": "Age, Biography and Wiki\n\nMayhew Foster (Bo) was born on 9 October, 1911 in Richmond, Virginia. Discover Mayhew Foster's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 100 years old?\n\nPopular As Bo Occupation N/A Age 100 years old Zodiac Sign Libra Born 9 October 1911 Birthday 9 October Birthplace Richmond, Virginia Date of death (2011-03-21) Died Place N/A Nationality Virginia\n\nWe recommend you to check the complete list of Famous People born on 9 October. He is a member of famous with the age 100 years old group.\n\nMayhew Foster Height, Weight & Measurements\n\nAt 100 years old, Mayhew Foster height not available right now. We will update Mayhew Foster's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nMayhew Foster Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Mayhew Foster worth at the age of 100 years old? Mayhew Foster’s income source is mostly from being a successful . He is from Virginia. We have estimated Mayhew Foster's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nMayhew Foster Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://ripper.london/victorian-london/henry-mayhew/", "page_content": "MAYHEW, HENRY (1812–1887), English author and journalist, son of a London solicitor, was born in 1812. He was sent to Westminster school, but ran away to sea. He sailed to India, and on his return studied law for a short time under his father. He began his journalistic career by founding, with Gilbert à Beckett, in 1831, a weekly paper, Figaro in London. This was followed in 1832 by a short-lived paper called The Thief; and he produced one or two successful farces. His brothers Horace (1816–1872) and Augustus Septimus (1826–1875) were also journalists, and with them Henry occasionally collaborated, notably with the younger in The Greatest Plague of Life (1847) and in Acting Charades (1850). In 1841 Henry Mayhew was one of the leading spirits in the foundation of Punch, of which he was for the first two years joint-editor with Mark Lemon. He afterwards wrote on all kinds of subjects, and published a number of volumes of no permanent reputation—humorous stories, travel and practical handbooks. He is credited with being the first to “write up” the poverty side of London life from a philanthropic point of view; with the collaboration of John Binny and others he published London Labour and London Poor (1851; completed 1864) and other works on social and economic questions. He died in London, on the 25th of July 1887. Horace Mayhew was for some years sub-editor of Punch, and was the author of several humorous publications and plays. The books of Horace and Augustus Mayhew owe their survival chiefly to Cruikshank’s illustrations.\n\nIn the World of London, indeed, we find almost every geographic species of the human family. If Arabia has its nomadic tribes, the British Metropolis has its vagrant hordes as well. If the Carib Islands have their savages, the English Capital has types almost as brutal and uncivilized as they. If India has its Thugs, London has its garotte men. Henry Mayhew, The Criminal Prisons of London (1862), p. 5\n\nHenry Mayhew was born on 25 November 1812 in London, one of seventeen children of Joshua Mayhew. He was educated at Westminster School before running away from his studies to sea. He then served with the East India Company as a midshipman on a ship bound for Calcutta. He returned after several years, in 1829, becoming a trainee lawyer in Wales. He left this and became a freelance journalist. He contributed to The Thief, a readers’ digest, followed quickly by editing a weekly journal – Figaro in London. Mayhew reputedly fled his creditors and holed up at The Erwood Inn, a small public house in the village of Erwood, south of Builth Wells in Wales.\n\nIn 1835 Mayhew found himself in a state of debt and, along with a fellow writer, escaped to Paris to avoid his creditors. He spent his time writing and in the company of other writers including William Thackeray and Douglas Jerrold. Mayhew spent over ten years in Paris returning to England in the 1850s whereby he was involved in several literary adventures, mostly the writing of plays. Two of his plays – But, However and the Wandering Minstrel – were successful, whilst his early work Figaro in London was less successful.\n\nOn 17 July 1841 Mayhew cofounded Punch magazine. At its founding the magazine was jointly edited by Mayhew and Mark Lemon. The two men hired a group of writers and illustrators, including Douglas Jerrold, Angus Reach, John Leech, Richard Doyle and Shirley Brooks. Initially it was subtitled The London Charivari, this being a reference to a satirical humour magazine published in France under the title Le Charivari (a work read often whilst Mayhew was in Paris).\n\nPunch was an unexpected success, selling about 6,000 copies a week in the early years. However, sales of as many as 10,000 issues a week were required to cover all costs of the magazine. In December 1842, the magazine was sold to Bradbury and Evans; Mayhew resigned as joint editor, and he continued at the magazine as “suggestor in chief” with Mark Lemon re-appointed as editor. Mayhew eventually severed his connection with the magazine, writing his last article in February 1845. His brother Horace stayed on the board of Punch until his own death.\n\nThe Punch years gave Mayhew the opportunity to meet talented illustrators who he later employed to work from daguerreotypes on London Labour and the London Poor. Following Punch magazine, Mayhew launched Iron Times, a railway magazine. However this venture lost Mayhew so much money that he was forced to appear in a Court of Bankruptcy in 1846.\n\nIn 1842 Mayhew contributed to the pioneering Illustrated London News. By this time Mayhew had become reasonably secure financially, had settled his debts and married Jane Jerrold (d. 1880), the daughter of his friend Douglas Jerrold.\n\nLondon Labour and the London Poor is today the work for which Myhew is best known. Originally appearing as a series of articles, the material was initially collected into three volumes in 1851; the 1861 edition included a fourth volume, co-written with Bracebridge Hemyng, John Binny and Andrew Halliday, on the lives of prostitutes, thieves and beggars. This Extra Volume took a more general and statistical approach to its subject than Volumes 1 to 3.\n\nMayhew wrote in volume one: “I shall consider the whole of the metropolitan poor under three separate phases, according as they will work, they can’t work, and they won’t work”. He interviewed everyone – beggars, street-entertainers (such as Punch and Judy men), market traders, prostitutes, labourers, sweatshop workers, even down to the “mudlarks” who searched the stinking mud on the banks of the River Thames for wood, metal, rope and coal from passing ships, and the “pure-finders” who gathered dog faeces to sell to tanners. He described their clothes, how and where they lived, their entertainments and customs, and made detailed estimates of the numbers and incomes of those practising each trade. The books show how marginal and precarious many people’s lives were, in what, at that time, was the richest city in the world.\n\nLater works included The Criminal Prisons of London (1862), The Boyhood of Martin Luther (1863), German Life and Manners as Seen in Saxony at the Present Day (1865), and London Characters (1881)\n\nHe died on 25 July 1887."}, {"url": "https://popularbio.com/mayhew-foster/", "page_content": "Updated On April 30, 2023\n\nMayhew Foster estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Mayhew Foster in 2019-2020? Scroll below and check more details information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nMayhew Foster was born in Richmond, Virginia on October 9, 1911.\n\nOn Popular Bio, Mayhew Foster is one of the successful Military. Mayhew has ranked on the list of those famous people who were born on October 9, 1911. Mayhew Foster is one of the Richest Military who was born in United States. Mayhew Foster also has a position among the list of Most popular Military.\n\nShort Profile First Name Mayhew Last Name Foster Profession Military Died 99 years (age at death) Birth Sign Libra Birth Date October 9, 1911 Birth Place Richmond, Virginia Country United States\n\nMayhew Foster Net Worth\n\nMayhew Foster estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Mayhew Foster in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Military Mayhew Foster’s net worth is $1-5 Million before died. Mayhew Foster earned the money being a professional Military. Mayhew Foster is from United States.\n\nMayhew Foster’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 Under Review Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Military (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nMayhew Foster has been died on 99 years (age at death). Mayhew Foster’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Mayhew Foster Dating?\n\nMayhew Foster keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Mayhew Foster past relationships, ex-girlfriends and previous hookups. Mayhew Foster prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Mayhew Foster"}, {"url": "https://themayhew.org/remembering-foster/", "page_content": "David and Helen from North London adopted Foster from The Mayhew in 2009 when he was nine and a half years old. David’s touching tribute to his best friend shows us just how much love an older dog has to give.\n\n“Why you buy old dog? He soon dead.” It was the first thing that our postie said when we introduced her to Foster, and something that we joked about many times after, as we pondered just what a great decision it had been to adopt him, whilst he continued to outlive her pessimism, grinning all the while.\n\nFoster was our first dog together – made possible by both of us working from home more often. But, having realised we could finally have a dog – where to start?\n\nOur friend Ellie opened our eyes to rescue dogs – enthusing about how they could be just as lovely as any dog, but more rewarding. Then, when my friend Mark said to me: “I would love a puppy…but an old dog would love a new home”, the decision was made. We would rehome an oldie.\n\nAnd there was Foster, on The Mayhew website, sporting an excellent “CV”. Helen said it “couldn’t hurt” if we went to meet him. The result was love at first sight. He was a truly gorgeous hound, given up due to his owners’ relationship breakdown. The Mayhew had tried to help them by fostering him for a few months, but six months later were told that no-one would be coming to collect him.\n\nHe turned out to be an even better dog than we could have ever dreamed. He travelled well, could be left on his own for a while, was good with adults and kids, obedient and loving…in short he was, as Helen’s sister Gail put it: “Everything a good dog should be”.\n\nYou never know the whole of their backstory but he’d obviously lived a fairly comfortable first-half of his life, arriving at The Mayhew as a chunky package. We suspect the name “Foster” came from a pub life as he could never walk past an open pub door, and could “work the room” for treats like a true pro.\n\nBut while he still did get to visit the odd pub or two, there was plenty more to be seen in between. He travelled the country with us from Scotland to the south coast; climbing the mountains and zooming through the woods; barking at the sea then sharing an ice cream…always making us laugh, always making every day together that bit better.\n\nMany people overlook older dogs but I would say never discount an oldie. Despite being nine and a half years old when we adopted him, Foster just didn’t seem to want to slow down – one of his many nicknames became “Iggy Pups”, due to his endless Lust for Life.\n\nAs the years passed, he would be ready at the front door, every single day, come rain or shine. And even though in time he couldn’t win the race to the ball, it never stopped him wanting to be in the middle of it all, even if only for a big woof and a grin.\n\nInevitably though, despite his incredible will, eventually his body could no longer keep up, and with massive sadness we had to let him go, aged 17. That “soon dead” dog had outlived many of his younger friends, and had given us seven fantastic years.\n\nIf you’re thinking about adopting a golden oldie like Foster, take a look at our animals in need of a loving forever home."}, {"url": "https://themayhew.org/foster-carers-needed/", "page_content": "As we enter kitten season, at Mayhew we’re already starting to see a rise in the number of pregnant cats and newly born kittens in need of our help. Our Animal Welfare Officers are responding daily to cases of stray cats and kittens in London, whilst our Cattery team are busy taking care of them when they come through our doors. We know from previous years that it’s only going to get busier, and we need your help to give these kittens the best start at life. Could you be a Mayhew foster carer? Why are foster carers so important? Our hard-working Cattery team can provide a safe and caring place for mums and their litters, but they rely on fantastic foster carers to provide a special home environment away from our busy cattery. Being able to place kittens with a foster carer to allow them to grow up in a calming home is vital for their emotional and behavioural development. It ensures that they’re able to thrive as a pet cat in a home environment.\n\n“Having a foster home for kittens means they're exposed to normal household sounds and activities during the critical socialisation period which they may not experience in a shelter environment - despite our best efforts.” Georgina Costi Cat Welfare Coordinator\n\nWe need you! We’re urgently looking for more foster carers who would be willing to take on a pregnant cat and/or kittens. We’d also like to find new foster carers who have experience with temperamental (or sassy!) adult cats. Keep reading to hear from one of our current foster carers, and find out more about how you can sign up.\n\nNicola’s story: Nicola has been a foster carer for Mayhew since August 2021 – and she’s amazing! Her most recent foster cats were two nursing mums with their nine kittens. Naturally, Nicola was a little nervous about taking so many cats in one go, as the most she had previously taken was five. But, she needn’t have worried, as she gave them the most wonderful home and they settled in very quickly. Nicola told us that “Looking after nine cats, as well as working, can be a little tiring!! I’ll be very sad to see them go as they’ve brought me so much joy but my job as foster carer is almost over. My wish is for each of them to find loving and forever homes so they can bring joy to others. ” Nicola’s story is rare – we don’t normally have two nursing mums together. But, when we found ourselves in this unusual situation, we were so incredibly thankful to have Nicola on hand to support. All of them have since found their loving forever homes.\n\n“The support that I get from Mayhew is amazing. The staff at the charity are always on the end of the phone if ever I need some help.” Nicola Mayhew Foster Carer"}, {"url": "https://www.nytimes.com/2019/05/02/obituaries/peter-mayhew-chewbacca-dead.html", "page_content": "Peter Mayhew, the British-born actor best known for portraying the gentle giant Chewbacca in the “Star Wars” movie franchise, died on Tuesday at his home in North Texas. He was 74.\n\nHis family confirmed the death in a statement on Thursday but did not specify where he died. In recent years he had lived in Boyd, in Wise County. A representative for Mr. Mayhew said he died after having a heart attack.\n\nMr. Mayhew, who was 7-foot-3, climbed into a shaggy costume to play Chewbacca, the menacing-seeming yet cuddly Wookiee who is Han Solo’s sidekick and co-pilot aboard the spaceship Millennium Falcon.\n\nHe appeared in all three films of the original “Star Wars” trilogy, as well as in the prequel “Revenge of the Sith” in 2005 and the sequel “The Force Awakens” in 2015."}, {"url": "https://library.norwood.vic.edu.au/c.php?g=944311&p=6839746", "page_content": "Source: Wikimedia Commons\n\nThe move to the cities from the countryside during the Industrial Revolution brought with it a change in the level and types of crimes being committed. This change in crime also brought with it significant changes in how crimes were policed and punished. Read through the resources below to learn more about crime and punishment during the Industrial Revolution.\n\nNovels such as Oliver Twist have made Victorian child-thieves familiar to us, but to what extent did juvenile crime actually exist in the 19th century? Drawing on contemporary accounts and printed ephemera, Dr. Matthew White uncovers the facts behind the fiction.\n\nVictorian citizens were worried about the rising crime rate. Liza Picard considers how this concern brought about changes in the way people were caught, arrested and imprisoned.\n\nThis worksheet provides a good basic summary of some of the most important information about crime and punishment during the Industrial Revolution, including key figures in reform, the main crimes, punishments and methods of law enforcement.\n\nCrime and punishment in Georgian England (British Library, 2009, October 14)\n\nFrom gruesome, public executions to Georgian Britain’s adoration of the ‘heroic’ highwayman, Matthew White investigates attitudes to crime and punishment in Georgian Britain."}], "Mayhew Foster's parent was a Quaker merchant.": [{"url": "https://snaccooperative.org/view/19400093", "page_content": "Henry Drinker, a prominent Quaker merchant in Philadelphia, was the son of Henry and Mary Gottier Drinker. He married Ann Swett in 1754 and then, after her death, married Elizabeth Sandwith in 1761. Drinker is perhaps best known for his exile with other Quaker pacifists to Winchester, Virginia, during 1777-1778. He was a Clerk of the Meeting for Sufferings, Treasurer of Philadelphia Yearly Meeting, and an Elder.\n\nFrom the description of Correspondence, 1791-1801. (Swarthmore College). WorldCat record id: 30712253\n\nQuaker merchant of Philadelphia.\n\nFrom the description of Land patent : Luzerne Co., Pa., 1796 Oct. 27. (Bryn Mawr College). WorldCat record id: 28900990\n\nHenry Drinker was a merchant, land developer, and ironmaster of Philadelphia. He was a member of the Society of Friends.\n\nFrom the description of Papers, 1747-1867. (Historical Society of Pennsylvania). WorldCat record id: 122488990\n\nHenry Drinker, son of Henry and Mary (Gottier) Drinker, m. 1761 Elizabeth Sandwith, dau. of Wm. and Sarah (Jervis) Sandwith. Partner in James and Drinker, Phila. shipping firm; ironmaster; land developer. Clerk, Phila. Monthly Meeting. Sept. 1777 refusal to formerly declare loyalty to new government led to arrest and forced exile to Winchester, Va.; returned April 1778.\n\nFrom the description of Correspondence, 1777-1778. (Haverford College Library). WorldCat record id: 25002395\n\nHenry Drinker, a prominent Quaker merchant of Philadelphia, was the son of Henry and Mary Gottier Drinker. He married first in 1757 Ann Swett, and after Ann's death, Elizabeth Sandwith in 1761. Drinker was Clerk of Philadelphia Yearly Meeting's Meeting for Sufferings, Treasurer of the Yearly Meeting, and Elder. He is perhaps best known for his exile with other Quaker pacifists to Winchester, Virginia in 1777-78.\n\nFrom the description of Balderston Manuscripts, 1735-1822. (Swarthmore College). WorldCat record id: 19090412\n\nHenry Drinker was a Philadelphia merchant and Quaker. Drinker was the partner of Abel James in the firm of James and Drinker which traded extensively with London, Dublin, and other American cities. The partnership appears to have dissolved in 1786 although both partners remained involved in the operation of the Atsion Iron Works and the Union Saw Mill in New Jersey, and speculated jointly and separately in lands in Pennsylvania, New Jersey, and New York.\n\nFrom the description of Business papers, 1756-1869. (Historical Society of Pennsylvania). WorldCat record id: 122541111\n\nHenry Drinker was a Quaker merchant in Philadelphia.\n\nFrom the description of Diary, 1759-1919 (inclusive), 1759,1879-1912 (bulk). (Historical Society of Pennsylvania). WorldCat record id: 122441721"}, {"url": "http://www.documentingdissent.org.uk/lancaster-quakers-and-the-transatlantic-slave-trade/", "page_content": "There is very little surviving evidence about how early Lancaster Quakers viewed slavery and the transatlantic slave trade, even though these were the most compelling human rights issues of the eighteenth and nineteenth centuries. While Quakers in London took a public stand against the making and owning of slaves, Lancaster Quakers apparently did not record their dissent for others to see. The issue may have been a source of disagreement among Lancaster Quakers as some were involved in businesses that profited from the enslavement of Africans.\n\nQuaker Stance on Slavery\n\nSince the beginning of their organisation, Quaker Friends have believed that all persons are equal in God’s eyes. This led many early Quakers to denounce slavery and to fight for its abolition at a time when many Britons refused to see dark-skinned people as anything like light-skinned ones. In 1676, the founder of Quakerism, George Fox, reminded Friends of the human dignity of African slaves after he visited Barbados and saw the plight of the slave labourers there. He wrote:\n\n‘…if you were in the same condition as the Blacks are…now I say, if this should be the condition of you and yours, you would think it hard measure, yea, and very great Bondage and Cruelty. And therefore consider seriously of this, and do you for and to them, as you would willingly have them or any other to do unto you…were you in the like slavish condition’ [1]."}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://www.howold.co/person/thomas-mayhew/biography", "page_content": "Thomas Mayhew Biography\n\nThis article is about the early Puritan settler in M*achusetts. For the English cabinetmaker, see Ince and Mayhew.\n\nGovernor Thomas Mayhew, the Elder (March 31, 1593 – March 25, 1682) established the first European settlement on Martha's Vineyard, Nantucket and adjacent islands in 1642. He is one of the editors of the Bay Psalm Book, the first book published in the Thirteen Colonies. His *istant Peter Foulger was the grandfather of Benjamin Franklin.\n\nBiography\n\nMarker for Thomas Mayhew homestead in Watertown, M*achusetts\n\nThomas Mayhew was born in Tisbury, in the county of Wiltshire in England. He married Anna (also called Hanna and Abigail) Parkhurst, born about 1600, in Hampshire, England, daughter of Matthew Parkhurst. In 1621 they had a son, Thomas, the Younger, baptised in Hanna's home town of Southampton. Two years later they had another child, Robert Mayhew, baptized in Tisbury.\n\nThe family left England in 1631/2 during the Great Migration of Puritans that brought 20,000 settlers to M*achusetts in thirteen years. Through the agency of Matthew Cradock of London, Mayhew had been appointed to manage properties in Medford, M*achusetts, and to engage in trade and shipbuilding. In or about 1633, Mayhew's wife Anna died, and about 1634 he returned to England for a business meeting with Cradock. While in England, he married Jane Gallion (1602–1666), and brought her back to New England with him. Their daughter Hannah was born in 1635, and three more daughters, Mary (1639), Martha (1642), and Bethiah, followed. Martha is the 7th great grandmother to the world-famous singer and songwriter Taylor Swift.\n\nIn 1641, Thomas secured Martha's Vineyard, Nantucket, the Elizabeth Islands, and other islands as a proprietary colony from Sir Ferdinando Gorges and the Earl of Stirling. This enabled him to transfer his business operations there. With the help of his son Thomas, a settlement was established and farming and whaling enterprises were begun.\n\nThe Mayhews had great success in regard to Indian policy. Because of the fair treatment of the Indians there, the colony was protected from the bloodshed that occurred elsewhere, in King Philip's War. In 1646, the General Court of M*achusetts directed the religious leaders of the colony to select two among them to serve as missionaries to the natives. So great was the interest aroused by this venture that a society was formed in England also to support the missionaries. Unfortunately a m*ive conflict broke out, called King Philip's War (1675–76), which resulted in many deaths of both the settlers and the natives. However, three prominent names appear. They are: John Eliot (known as the Apostle to the Indians); Thomas Mayhew (who was already ministering to the natives); and, three generations later, Eleazar Wheelock, who established \"Doctor Wheelock's Academy for the promotion of Christianity and civility among the savage Indians of this continent\" (now known as Dartmouth College).\n\nIn 1657, the younger Thomas Mayhew was drowned when a ship he was travelling in was lost at sea on a voyage to England. Mayhew's three grandsons Matthew Mayhew (born 1648), Thomas (born 1650), John (born 1652), and other members of his family *isted him in running his business and government.\n\nTranscription of Watertown marker: \"HERE BY THE ANCIENT FORDTHE LANDING AND THE WEIRWAS THE HOMESTALL OFTHOMAS MAYHEW:A LEADER IN WATERTOWN AFFAIRSFROM 1635 TO 1645.AFTERWARDS WITH HIS SON,THE REV. THOMAS MAYHEW,HE LABORED AMONG THE INDIANSAT MARTHA'S VINEYARD.\"\n\nColonizing Dukes County\n\nIn 1641, while engaged in business ventures in the vicinity of Boston, Mayhew succeeded in acquiring the rights to the islands that now cons*ute Dukes County and Nantucket County: Martha's Vineyard, Nantucket, and the Elizabeth Islands. He bought the County for 40 pounds and two beaver skin hats from William Alexander, the 2nd Earl of Stirling. To resolve a conflicting ownership claim, he also paid off Sir Ferdinando Gorges, thereby acquiring a clear *le.\n\nMayhew established himself as governor of Martha's Vineyard in 1642 and sent his son, Thomas the Younger, with about forty families to settle there. He himself followed four years later. Together he and the younger Thomas established Martha's Vineyard's first settlement and called it Great Harbor, now Edgartown.\n\nRelations with the natives\n\nMayhew and his fellow settlers found a large and economically stable native population of about 3,000 living in permanent villages, led by four sachems (chiefs). Relations between the first settlers and their Wampanoag neighbors were peaceful and courteous. Under the leadership of his son, a minister, they ins*uted a policy of respect and fair dealing with the Wampanoag natives that was unequaled anywhere. One of the first of Mayhew's orders was that no land was to be taken from the native islanders, the Wampanoags, without their consent or without fair payment. From this time forward, the colonial settlers and Wampanoag lived without the bloodshed that marked the history of European colonies elsewhere in the New World.\n\nFrom the beginning, Mayhew had worked to preserve the original political ins*utions of the native population. Religion and government were distinct matters, he told the chiefs. When one of your subjects becomes a Christian, he is still under your jurisdiction. Wampanoag land was guarded against further encroachment by white settlers. So successful were these policies that during the bloody battles of King Philip's War, in 1675-1676, the Vineyard's native population never stirred, although they outnumbered the settlers on the island by twenty to one.\n\nSpreading religion\n\nBy 1660 there were about 85 white people living peaceably among the natives, earning their living by farming and fishing. The Mayhew family, which from that time forth became an integral part of island history, wanted to share its religion with the natives, but the Wampanoags were not too interested, having their own spiritual faith. However, once it was clear that, though Mayhew was the governor, the sachems remained in charge of their people, some became curious about the white man's God. When a native named Hiacoomes expressed an interest, Mayhew invited him into his home and instructed him in English and Christianity. Hiacoomes, in return, taught Mayhew the native language. As soon as Mayhew could converse with the natives, he would some days \"walk 20 miles through uncut forests to preach the Gospel...in wigwam or open field\".\n\nThere is a stained gl* window in the baptismal font in the National Cathedral in Washington D.C. depicting Rev. Thomas Mayhew Jr. baptizing a native.\n\nChange was in the air though, for the world outside this small island was unsettled. There were more visitors from off island and some stayed, challenging the Mayhew government, while Baptists and Methodists arrived to make converts from the established Congregational Church.\n\nFrom colony to aristocracy\n\nThrough a maze of conflicting land grants, changing political allegiances, and settler unrest, Mayhew, who styled himself \"Governour Mayhew\", began to rule his island with an iron hand. The most serious threat to his control came in 1665 when Martha's Vineyard was included in the lands placed under the king's brother, the Duke of York. After much delay, a settlement, worked out in 1671, confirmed the Mayhew patent and named Mayhew \"Governour and Chiefe Magistrate\" for life. At the same time, a patent was issued erecting the Manor of Tisbury in the southwestern part of the island. The Governor and his grandson Matthew were made \"joint Lords of the Manor of Tisbury\", and the inhabitants became manorial tenants subject to the feudal jurisdiction of the Mayhews. This full-fledged feudal manor appears to have been the only such ins*ution actually established in New England.\n\nThe attempt of the Mayhews to create a hereditary aristocracy on the Vineyard met with increasing opposition as more and more colonists arrived. When the Dutch temporarily recaptured New York in 1673, open rebellion broke out and this lasted until the colonial government regained control over New York and restored the authority of the Mayhews on the island. The old patriarch died in 1682, at the age of eight-nine. Nine years later the political rule of his family ended when Martha's Vineyard was annexed by M*achusetts after the Glorious Revolution in England, but the manorial land tenure remained. Although some of the Mayhews clung to the \"pleasant fiction\" of their manorial rights almost until the American Revolution and received token quit rents as late as 1732, feudalism on Martha's Vineyard died the same slow, lingering but certain death it did elsewhere in the colonies.\n\nMissionary work\n\nKenneth Scott Latourette has concluded that the Missionary Mayhews of Martha's Vineyard represent what is probably the longest and most persistent missionary endeavor in the annals of all Christendom. The elder Thomas Mayhew, known for his missionary work, was not concerned for Indian souls when he settled on his island; he sought only to improve his social and economic position. His son, Thomas Mayhew the Younger, is credited with the launching an Indian mission. Like his father, he had emigrated from England. Somewhere, he received a liberal education, apparently from private tutors, and after moving to the Vineyard to begin the white settlement there he became pastor of the small Anglican church as well as acting governor in his father's absence. He soon discovered that he could not refuse the challenge he found among the three thousand Pokanaukets, a branch of the mainland Narragansetts, who far outnumbered the whites, so an effective settlement required friendly relations with the Indians. But Thomas the Younger appears to have been motivated largely by spiritual concern, while his father and other members of the family enjoyed the practical results of the Indian mission. The son gradually abandoned most of his secular tasks and spent the remainder of his life among the natives. Progress was slow at first, but by the end of 1652 there were 283 converts, a school for Indian children, and two Indian meetings each Sabbath. The Praying Indians of Martha's Vineyard who said grace before meals became a topic of conversation on both sides of the Atlantic. Thomas Mayhew the Younger carried on his missionary work with little heed for his personal fortunes. As the elder Mayhew put it, his son had followed this work \"when 'twas bare with him for food and rayment, and when indeede there was nothing in sight any waies but Gods promises.\" The situation was improved somewhat by the formation in 1649 of a London missionary society, usually called the New England Company, which in a few years began to provide substantial aid for the Mayhews and other missionaries.\n\nIn the fall of 1657, Thomas Mayhew the Younger sailed for England on a trip combining an appeal for missionary funds with personal business. After leaving Boston Harbor, the ship was never seen again. The death of his only son at the age of thirty-six was a heavy blow to Mayhew and greatly increased the burdens he carried in old age. He made repeated efforts to find a replacement to continue his son's ministry to the Indians, but no minister who knew the language or was willing to learn could be induced to settle permanently on the island, so at the age of sixty Mayhew, who had started as a merchant, then turned landed proprietor, became a missionary in his son's place. For the next twenty-five years he traveled on foot as far as twenty miles to preach once a week at the Indian *embly or to visit the native camps.\n\nDeath\n\nWhen the venerable Governor Mayhew became ill one Sunday evening in 1682, he calmly informed his friends and relatives that \"his Sickness would now be to Death, and he was well contented therewith, being full of Days, and satisfied with Life\". His great-grandson, Experience Mayhew, a son of John, was only eight at the time, but he clearly remembered being led to the bedside to receive from the dying man a blessing \"in the Name of the Lord\". Matthew Mayhew, the eldest grandson, succeeded his military and civil duties. Rev. John Mayhew, the youngest grandson and grandfather of Jonathan Mayhew, continued his missionary work to the Indians. Thomas, another grandson, became a Judge of M*achusetts.\n\nHis descendant Jonathan Mayhew was a prominent 18th-century Boston clergyman who coined the phrase \"No taxation without representation.\"\n\nDescendants\n\nMatthew Mayhew (1648–1710), Martha's Vineyard colonist, politician and missionary\n\nExperience Mayhew (1673–1758), Martha's Vineyard colonist and missionary\n\nJoseph Mayhew (1709/10–1782), Martha's Vineyard colonist, politician, and missionary\n\nJonathan Mayhew (1720–1766), Congregationalist minister and Patriot\n\nJonathan Mayhew Wainwright I (1792–1854), Episcopal Bishop of New York\n\nCharles Tupper (1821–1915), 6th Prime Minister of Canada\n\nJonathan Mayhew Wainwright II (1821–1863) U.S. Navy officer during the American Civil War\n\nElla Edes (1832–1916) American writer, newspaper correspondent, and Catholic activist\n\nJonathan M. Wainwright (1883–1953), U.S. Army general during World War II\n\nRufus Wilmot Griswold (1815-1857), American anthologist, editor, poet and critic\n\nNathan W. Mayhew (1935-2017) - Newspaper pressman\n\nStephanie W. Knuth (ne Mayhew) (1963-2020) - U.S. Army Veteran\n\nJennifer E. Correa (ne Mayhew) (1964) - U.S. Airforce Veteran, Real Estate *le Agent, Small business owner\n\nJosephine L. Doyle (ne Mayhew) (1965) - Public servant (retired) - County Planning Division\n\nNathan M. Mayhew (1971) - Commercial transportation driver\n\nTaylor Swift (*1989), singer-songwriter, pop star\n\nReferences\n\nCharles Edward Banks, The History of Martha's Vineyard (three-volumes, 1911)\n\n(three-volumes, 1911) Charles W. Akers, Called Unto Liberty, A Life of Jonathan Mayhew (1964)\n\n(1964) Christopher Burns, Island Wilderness; Imagining the Early Years of Martha's Vineyard\n\nEdward Winslow, Glorious Progress of the Gospel Amongst the Indians in New England (1649)\n\nExternal links\n\nSteve's Genealogy Site\n\nIndian Converts Collection\n\nPrimary sources"}, {"url": "https://usa.chinadaily.com.cn/world/2011-01/31/content_11970208.htm", "page_content": "Pilot recalls captured Nazi leader Updated: 2011-01-31 07:54 By Matt Volz (China Daily)\n\nIn this May 9, 1945 photo provided by Brigadier General Mayhew Foster, captured Nazi leader Hermann Goering (second from right) stands on the tiny airstrip outside Kitzbuhel, Austria, before being transported back to Germany for interrogation. Provided by Mayhew Foster / Associated Press\n\nMISSOULA, Montana - Captain Mayhew Foster had an extraordinary mission: Fly captured Nazi leader Hermann Goering to the 7th Army's headquarters for interrogation.\n\nThen he took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe - all 136 kg of him - and knew he needed a bigger plane.\n\nIt was May 9, 1945, the day after World War II ended in Europe. Goering, Foster and a group of officers from the Army's 36th Infantry Division gathered on a tiny airstrip outside Kitzbuhel, Austria, to transport the highly-prized war prisoner back to Germany in an unarmed, two-man reconnaissance plane.\n\n\"They wanted to get him back where he could be debriefed. There was a strong rumor that in a mountainside in the Alps right down there in Bavaria there was a concentration of (German) military,\" Foster said. \"He just acted as though it was a nice, friendly trip.\"\n\nMayhew Foster, now 99 and living in a Missoula nursing home, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders. Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honor for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career.\n\nGoering, 52, had surrendered to the US Army's 36th Infantry Division the day before. He had fallen out of favor with Hitler and hadn't played an active role at the end of the war, though he remained Reichsmarschall of Nazi Germany.\n\nBefore his capture, Goering wrote a letter to General Dwight D. Eisenhower, Supreme Allied Commander in Europe, offering to work with Eisenhower on the conditions of the German army's surrender, according to an account of Goering's capture by Brigadier General Robert Stack kept by the 36th Infantry Division Association.\n\nAfter receiving the letter, Stack and a group of soldiers drove from the division's base near Kitzbuhel across the border into Germany and intercepted a convoy that included Goering, his wife, daughter, sister-in-law, household servants and military aides, according to the account.\n\nGoering agreed to surrender unconditionally but asked that his family be cared for, and the Nazi leader was delivered to Foster for transport the next day.\n\nFoster, who was 33 at the time, said he didn't fear getting shot down carrying such precious cargo alone in an unescorted, unarmed plane. He didn't worry about Goering taking advantage of the lack of a guard to wrest control of the aircraft.\n\nThe main problem, he said, was getting the two of them off the ground - the nimble, lightweight Piper L4 that Foster piloted in his artillery spotting missions wouldn't support both him and Goering. But the division only had the small airstrip that was fine for Foster's aircraft, but was problematic for taking off and landing larger planes.\n\nThey'd have to upgrade to the one L5 in the division's inventory, a slightly larger aircraft Foster hadn't flown in years.\n\nGoering stood on the tiny airstrip in a plain, gray uniform that was unadorned but for a pistol at his hip and a medal around his neck. Still wearing the pistol, he stepped toward the plane. A Goering aide emerged from the group that had gathered and relieved Goering of the weapon.\n\nThe Nazi leader settled into the back seat and tried to fasten his seat belt. It wouldn't stretch across his belly. He held the strap in his hand, looked at Foster and said, \"Das goot!\" - that's good.\n\nA photograph of that moment shows Foster in the cockpit and Goering seated directly behind him, his elbow jauntily propped on the plane's fuselage.\n\nThe two men spent the 55-minute flight from Kitzbuhel to Augsburg, Germany, conversing in a mix of German and English. Foster said Goering avoided any talk of Hitler or the war but appeared to relish pointing out the sites below them.\n\n\"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour and he was showing me where he grew up,\" Foster said. \"I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nHe described Goering as sharp, friendly and witty, even cracking a joke when Foster asked him when Germany began manufacturing jets.\n\n\"Too late,\" Goering replied, according to Foster.\n\nAt the time, Foster was somewhat less generous in describing the man. In a letter to his wife, Virginia Lou Foster, written soon after the mission, Foster told her that the Nazi leader was \"effeminate\" and \"gave me the creeps\".\n\n\"Several times I had the impulse to turn the plane over and see if I could shake him out but he was wedged in like a champagne cork,\" Foster wrote.\n\nAfter landing, Foster asked his passenger to sign a blank flight report. The prisoner scrawled \"Hermann Goering Reichsmarschall\" across the paper, which Foster folded and put in his pocket.\n\nIt's a document that he still has, one of Foster's most prized possessions alongside a collection of photographs of Goering, Hitler and other snapshots from the days of the Third Reich.\n\nThere was just a single jeep at the airstrip to meet the arriving flight carrying the world's most famous war prisoner. Foster rode with Goering to the gates of the 7th Army Headquarters and formally turned him over to the intelligence officer without ceremony.\n\nIt turned out, Foster learned later, those rumors of German troops hiding in the Bavarian Alps were untrue. Goering stood trial at Nuremberg, and the next year he was found guilty of war crimes.\n\nGoering was sentenced to hang, but he committed suicide instead by swallowing a cyanide capsule.\n\nSixty-five years later, Foster is trim, sharp and carries himself as a former military officer.\n\nHe still reflects on his rare insight into the Nazi leadership, and he recognizes that the experience had shifted his perceptions of the enemy. It allowed him to see the human side of those he had only known as caricatures.\n\n\"I could see that he was like one of our officers if he'd been picked up,\" Foster said. \"I wouldn't say it changed my view of the war but it showed me that there are ...\" He broke off.\n\n\"Well, I questioned all that we knew about these vicious people,\" he said.\n\nAssociated Press"}, {"url": "https://www.wikiwand.com/en/Dodshon_Foster", "page_content": "Dodshon Foster (1 September 1730[1] - 2 January 1793[2]) was a merchant who profited from the slave trade. He was involved in the shipping of over 700 slaves during his career.[3] His commercial success was assisted by his connection through marriage to the Birket family of merchants; he married Elizabeth, the daughter of Myles Birket.[4]\n\nPortrait of Dodshon Foster by William Tate\n\nFoster was the son of a Quaker merchant from Durham. Foster moved to Lancaster and entered into the slave trade in 1752 at the age of 21. His ship was named the Barlborough, and it made several slaving voyages between 1752 and 1758. He served as one of the Lancaster Port Commissioners between 1755 and 1758.[4]"}, {"url": "https://homepages.rpi.edu/~holmes/Hobbies/Genealogy2/ps02/ps02_234.htm", "page_content": "Name Thomas Mayhew Birth 31 Mar 1593, Tisbury, England Death 25 Mar 1682, Edgartown, Dukes, Massachusetts Burial Martha's Vineyard Father Matthew Mayhew (~1562-1613) Mother Alice Barter (1540-<1614)\n\nMisc. Notes\n\nThomas Mayhew Sr, known even to this day on Martha's Vineyard as \"The Governor\", immigrated to Massachusettes in 1631/2 as an agent for a London merchant. He quickly entered into prominance in the political and business life of the 'boom' years of Puritan immigration, the 1630's. In the 1640's he acquired the title to Martha's Vineyard and followed an advance settlement of that island by his son by several years. There he established a minor 'fiefdom' of his own, ruling the\n\nisland with singular authority and nepotism. Following the death of his son Thomas in 1657, he continued the missionary work to the Indians begun by Thomas, establishing the basis for 5 generations of missionary work to the natives. He also entrenched his political authority on the Island when the lands of Martha's Vineyard were transferred to the Duke of York in 1663 by petitioning the Duke and once again being granted sole authority on the island. Surviving, at the age of 81, a rebellion against his autocratic rule by over half the population of the island in 1673, he left firmly established family control of Martha's Vineyard to his grandson, Matthew Mayhew.\n\n\n\n\n\n\n\nBanks, History of Martha's Vineyard, Vol 1\n\n\n\nOf the childhood, education, and early business training of Thomas\n\nMayhew of Tisbury, nothing defininte is known. It is presumed that he\n\nlived in Tisbury during his youth, and was educated in the parish\n\nschool under the care of his parents. When his father died, he was\n\ntwenty-one. We know that he became a merchant, but not where he\n\nserved his apprenticeship. Daniel Gookin, who knew him personally,\n\nsays he was \"a merchant bred in England, as I take it at Southampton.\"\n\nThis seaport town was, in that period, one of the most important\n\ncommercial centers in England, ranking with Bristol as secondary to\n\nthe great port of London. Among the great merchants of London, Mr.\n\nMatthew Cradock was an early adventurer in American Colonial\n\nenterprize and was among the first to support the companies engaged in\n\nthe colonization of New England. In the course of business it is to\n\nbe supposed Mayhew became known to Cradock and thus laid the\n\nfoundation for their later business relations.\n\nAt the accession of Charles the First in 1625, Thomas Mayhew was\n\nthirty-two years old and had probably been in business for himself for\n\nabout a dozen years, since his father's death. Before 1618 he had\n\nmarried a woman whose name has come down by tradition as Abigail\n\nParkus. Tradition further names her as a member of the Parkhurst\n\nfamily of which George Parkhurst of Watertown, Mass., was the first\n\nNew England representative in 1643. George was the son of John\n\nParkhurst of Ipswich, England, a clothier, and his sisters, Deborah\n\nand Elizabeth, came to this country with him, and were later residents\n\nof the Vineyard, the former as wife of John Smith and the latter of\n\nJoseph Merry. So far no documentary or recorded confirmation of this\n\ntradition has been found, although considerable effort has been spent\n\ntrying to determine the likely place of the wedding.\n\nThe couple had only one known child, who would later become the\n\nRev. Thomas Mayhew, missionary to the Indians. No other children are\n\nknown, or when or where the mother died.\n\nIn 1628, the records of the Massachusetts Bay Company contain a\n\nreference to trade with Thomas Mayhew as follows:\n\n\n\nMarch 16, 1628 Bespoke of Mr. Maio at 10 1/2 p yrd for beds &\n\nboulsters 20 bed tikes, Scotch Tikeing 3/4 broad & 2 1-16 long & 1 1/2\n\nyrds wide: 11 yrds each bed and boulster. (Mass Col. Records, I)\n\n\n\nIn two years Mayhew determined to follow to New England the \"beds &\n\nboulsters\" he had sold for the emigrants to the colony. In 1631,\n\nMatthew Cradock hired Mayhew to go to Massachusetts to act as his\n\nagent, making his headquarters at Medford, where he had built a\n\n\"greate stone house.\" Whether Mayhew's wife came with him or had died\n\nbefore 1631 is not known, but he presumably brought his young son with\n\nhim when he emigrated. The first mention of him in the colonial\n\nrecords is when he appears as chairman of a committee appointed by the\n\nCourt to settle the boundary between Charleston and Newton in March,\n\n1631/2. As this record is the report of the committee, it must have\n\nbeen appointed at an earlier date in the previous year, so he would\n\nhave arrived sometime in 1631.\n\nFor the next three years he attended to his employer's business and\n\nwas admitted a freeman by the General Court on May 14, 1634. At this\n\nperiod, he began the erection of a mill for his principal and the\n\nfollowing letter concerning it is here printed:\n\n\n\nMeadeford the 22th of\n\nthe fouerth Moneth June 1634\n\nSir:--- I doe hereby request your worshipp to deliver this bearer\n\nthat hempe you spake of, for caulkinge the pynnase: and I doe\n\nfarther intreate you to lend Mr. Cradock the hellpe of your teeme,\n\na day or two, to hellpe carry the timber for building the mill at\n\nWatertowne. I have sent unto Mr. (Richard) Doomer. I hope he will\n\nafford me his hellpe: that with the hellpe of our owne wee may doe it\n\nin two daies. The reason I desire to have it donne with such\n\nexpedition is for that the cattell must be watched whillst they are\n\nabout it, in reguard they will be from home & soe doubtless otherwise\n\nwould stray, or at least runn home: I will at any time, if your\n\nworshipp have occasion in the like kind, fulfill your desire: the time\n\nwee intend to goe about it is the second or third day of the next\n\nweeke. Thus ceaseing farther to trouble you at present, salutinge you\n\nwith all due respect, committing you to the Lords protection, I rest\n\nYour\n\nworshipps to command\n\nTHOMAS\n\nMAYHEW\n\nTo the worshipfull John Wynthropp (Ma. Hist. Col., 4, VII, 30.)\n\n\n\nProbably in 1634 he married a second time, but whether he found\n\nhis new wife in New England or returned home to England for her is not\n\nknown. Savage, who is usually quite accurate, states that the\n\nmarriage occurred in London, but on what authority is not known.\n\n(Genealogical Dictionary, III, 337. None of the published London\n\nparish registers have a record of this marriage.) His new wife was\n\nMrs. Jane (Gallion?) Paine, widow of Mr. Thomas Paine, a London\n\nmerchant. In London Banks found references to a Gallion family, to\n\nwhich she may have belonged. She brought into the household two\n\nchildren from her former marriage. Thomas Paine had left considerable\n\nestates in England for his children Thomas, Jr. and Jane, both minors.\n\nJane was the older of the two and was probably about five or six at\n\nthe time, Thomas Mayhew, Jr., was about fifteen at the time. In later\n\nyears, these two were to marry.\n\nTheir first child, Hannah was born in Medford in 1635. In this\n\nyear, also, he bought a one-half interest in the mill built by his\n\nmaster, Cradock, and himself. The purchase price was 200 pounds, for\n\nwhich Mayhew gave a bond and a mortgage for 400 pounds with conditions\n\nthat if the price was paid the bond should be void. He turned his\n\nefforts to milling which, according to a man who knew him, \"in those\n\ntimes made him a great profit.\"\n\nLate in 1636, his second daughter was born, and was named Bethiah.\n\nHe was made representative to the General Court this year (a\n\nlegislature for the Massachusetts colony), and was returned every year\n\nuntil he removed to Martha's Vineyard in 1644-45. During the years he\n\nserved as representative, his name appears on many important\n\ncommittees. During these years he was acting as miller, a merchant\n\nand politician, but apparently none of these jobs was very\n\nremunerative, and he was not a very good business man.\n\nAbout this time, Matthew Craddock, Mayhew's principal was becoming\n\ndissatisfied with Mayhew's handling of his investments in New England.\n\nIn his anger, he wrote a letter to Gov. John Winthrop pouring fourth\n\nhis grievances.\n\n\n\nWorthei Sir,-- The greyffe I have beene putt to by the most\n\nvyle bad dealings of Thomas Mayhew hath & doeth so much\n\ndisquiet my mynd, as I thank God never aney thing did in the\n\nlike manner.\n\nThe Lord in mercy ffreey me from this, I absolutely fforbad\n\nchardging moneys from thence or buying aney goods there. I\n\nthanke God my occasions requyred it not but I have had great\n\nreturnes made mee from thence by means of goods I sent thither by\n\nthe direction of Thomas Mayhew ffor above 5000 L in the last 2\n\nyeeres & geeving to much credditt to his insynnuating practices\n\n& the good opynion I by the reports & advize of maney &\n\nmore especially of your selfe, did apprehend of him, but ffarr\n\nbeyond all expectacion & contrary to my express order he hath\n\ncharged me with dyvers somes & geeven bills in my name\n\nwhich he never had order from me to doe, & that not for small\n\nsomes, whereof some partyculers are specefyed in the inclosed\n\nwhich I pray you deliver my servant Jno. Jolliff: & good sir lett me\n\nintreate your self & those in authority there to make some\n\ncourse that thomas Mayhew may be answerable ffor that\n\nestate of myne which my sayd servant can showe you hath come to\n\nhis hands. this conveyance is uncerten & therefore I shalbee breiffer\n\nthen I would or my necessety requyres but by Mr. Peirse, God\n\nwilling, I shall Inlardge, but I know you may by this seey &\n\naprehend my case. Bills come dayley almost pressented to me,\n\nyou & all men that shall seey it I ame perswaded will hardley thinke\n\nit could be possible that a man pretending sincerity in his\n\nactions could deale so viley as he hath & doeth deale by me.\n\nThis buisyness is not to be delayed, if he can justify his\n\nactions it were to bee wished but not possible.\n\nLett me crave your favour & the courts so ffarr as you\n\nshall seey my cause honest & just,, & boothe the court & your\n\nself & the whole plantacion shall be ever oblige me to be\n\nYours ever to my\n\npower\n\nMATHEWE CRADOCK\n\nLondon 13 January 1636\n\n\n\nFrom all the circumstances, according to Banks, it does not appear\n\nthat Mayhew had been guilty of any breach of trust, and no action was\n\ntaken on Craddock's hysterical letter so we may conclude that the crux\n\nof the complaint was poor business judgment at the most. Craddock's\n\nnew agent, John Jolliffe, arrived in New England in late 1636 or 1637,\n\nand terminated Mayhew's employment. Therefore, in 1637, Mayhew and\n\nhis family left Medford, and moved to Watertown. There he had\n\ninvestments of his own, and for the next seven or eight years he was\n\nactively identified with that town. He was chosen selectman in 1637\n\nand was also elected as Deputy to the General Court to represent his\n\nnew home in the Colonial Assembly.\n\nIn 1638 he was again chosen selectman and re-elected as Deputy to\n\nthe General Court. At the same session he was appointed a\n\ncommissioner, which office was a local magistrate or justice of the\n\npeace for trying small causes, the first official of that kind\n\naccredited to Watertown. Another daughter was born to him, probably\n\nearly in the year, who was named Martha. In 1639 he was reelected to\n\nall of his offices, and his fourth daughter, Mary was born. He also\n\npurchase the other half of the mill from Cradock's new agent,\n\nNicholas Davidson, and mortgaged it back to Cradock with six shares of\n\nthe \"Wear,\" for L240. The investment must have been a losing one, for\n\nin less than a year, on April 28, 1640, he sold the entire property to\n\nDeputy Governor Thomas Dudley for L400, subject to the mortgage to\n\nCradock. Dudley paid the money to Cradock, but apparently Mayhew never\n\npaid the first 400 pound mortgage to How, because at How's death in\n\n1644, this bond of Mayhew was one of the assets of the estate. This\n\nis a hint of the financial troubles which led him to take a risk on\n\nMartha's Vineyard.\n\nAlthough he was reelectd as selectman and as a Deputy to the\n\nGeneral Court in 1640 and 1641, there are occasional references to\n\nfinancial disputes between Mayhew and other businessmen. He wrote the\n\nfollowing letter describing his difficulties in obtaining money in the\n\ncountry:\n\n\n\n11th of the 3d 1640\n\nRight Worshipful.\n\n\n\nI am to pay my owne rate, & some 5 li. for other men, that I owe it\n\nunto & allthough that I have had bills due from the Countrey, one\n\nyeare and 7 moneths since, for 70 & od pounds, I must now have my\n\ngoods sold, except I pay out this money: which seeing I have money to\n\nreceive from the countrey methinks it is verry hard measure. I\n\ncannott see equitie in it. I may safely say that if I had had my\n\nmoney as was then fully intended, being then 100 li. it had donne me\n\nmore good, in name & state, then now wilbe made whole with double the\n\nmoney; but if there be noe remedy but my goods must be straynbed and\n\nsolld, I desire your worshipps advice per this bearer which is the\n\nConstable, what course is to be taken in putting it of. I thinke he\n\ncomes unto you for counsell in that behallfe: thus with my due\n\nrespecte, in some hast, I rest\n\nYour worshipps to\n\ncommand\n\n\n\nTHO: MAYHEW\n\nTo the Right Worshipfull John Winthropp, Governour.\n\n\n\nMoney is verry hard to gett upon any termes. I know not the man\n\nthat can furnish me with it. I could not gett the 100 li. of Mr.\n\nGibbins. I gott 30 li. putt off inconveniently: & when I was sick &\n\nin necessitie I could not gett any of the Treasurer. I delight not to\n\ncompleyne.\n\n\n\n\n\nApparently the toll bridge that he had constructed was also a\n\nloss, for it was absorbed by the towns in December, 1641. He was\n\ngiven 150 acres of land on the south side of the Charles River,\n\nperhaps in payment.\n\n\n\nOn the English Origins of the Mayhew name:\n\nIn Rev. Canon Mayo, vicar of Long Burton, Dorset's Genealogical\n\nAccount of the Mayo and Elton Families (London, 1882) there is the\n\nfollowing account of the Mayhew name:\n\nAs an English family name it is most frequently met with in the\n\nSouth and West of this island, and few parish registers in the\n\nCounties of Hereford, Gloucester,Wilts and Dorset can be opened\n\nwithout presenting us with examples. It is spelt in many ways,\n\nvarying from the extended form of Mayhowe to that of Mao, and often,\n\nas it will frequently appear, clipped down and reduced to May to the\n\nloss of its concluding syllable. One lesson is taught by the\n\ndiversity and variety, viz.: -- the identity of Mayhew and Mayo, and\n\nfrom this consideration a ray of light is thrown upon the derivation\n\nof the name. An early occurrence of the name, and in its extended\n\nform is found in Glover's Roll of Arms, supposed by Sir Harris\n\nNicholas to date from Between 1245 and 1250. Herbert le Fitz Mayhewe\n\nis there mentioned as bearing \"party d'azure & de goulz one trois\n\nleonseaux rampant d'or,\" and Woodward in his History of Wales, page\n\n415, narrates that account to the old copy of S. Davids Annals. The\n\nWelsh slew Sir Herbert Fitz-Mahu apparently in 1246, near the castle\n\nof Morgan Cam. The same Roll of Arms gives the clue to the origin of\n\nthe name as a Christian name; in the case of Mahewe de Lovayne, Mayhew\n\nde Columbers and Maheu de Redmain. There can be little doubt that it\n\nis here a softenform of Matthew. Bardsley in his \"English Surnames\"\n\nmentioned two other instances, Adam fil. Maheu, and Mayhew de\n\nBasingbourne, from the Parliamentqary Writs. Shakespeare in King\n\n\"Lear\" Act III, scene 4 says:\n\n\"The Prince of Darkness is a Gentleman\n\nModo he's called Mahu.\"\n\n\n\nIn the Records of the Commissioners for the United Colonies, there\n\nappeared a letter, now in the Connecticut Archives, (Conn. Col.\n\nRecords, 1678-1689. pp. 504-506) written by Governor Mayhew, sealed\n\nwith arms which, upon examination, proved to be the arms, with a\n\nmullet for difference, fo the Mayhew family of Dinton, Wiltshire, a\n\ncounty family of considerable distinction. These facts, taken in\n\nconnection with the bestowal by Mayhew of the names of Tisbury and\n\nChilmark on two adjoining towns on Martha's Vineyard, and the fact\n\nthat Tisbury and Chilmark are adjoining parishes in Wiltshire, and\n\nseparated by a few miles only from Dinton, made it quite evident that\n\nthis locality was the one which should reveal his family connection.\n\nThe parish registers of Tisbury are extant from the year 1563 and\n\ninclude the marriage of his parents, Mathew Maow and Ales Barter on\n\nOcto. 2, 1587 and his own baptism on April 1, 1593 (Thomas, Son of\n\nMathew Maho). The entry of the baptism of Thomas, son of Mathew Maho,\n\nApril 1st, 1593, probably within a few days of his birth, is not\n\nabsoutely conclusive evidence of identity with our Thomas, but taken\n\nin connection with the facts relating to the reappearance on Martha's\n\nViuneyard of the names of Tisbury Manor (which is situtated in the\n\naprish of Tisbury, England) and Chilmark the adjoining hamlet, and the\n\nname of Matthew, which for succeeding generations appeared in the\n\nMartha's Vineyard family, it becomes one of those cases where an\n\naffirmative conclusion is clearly inferential.\n\n\n\nSavage says: First at Watertown. Born early in 1591, came in the\n\nGriffin, 1633, if we might so infer from the fact of his taking his\n\noath as freeman May 14, 1634 when Gov. Haynes and Bov. Brenton,\n\nbesides Cotton, Hooker and Stone, passengers in that ship were\n\nadmitted. But that inference would be wrong, for in Colonial Records\n\nI. 95 is a report signed by him and two other gentleman for setting\n\nout the bounds between\n\nWatertown and the new town on March 6, 1632, and in July 1633, he was\n\nappointed administrator of of Ralph Glover, while Cotton and fellow\n\npassengers did not arrive before September next, so that he must have\n\nbeen here in 1631, and he served as a merchant at Southampton, England\n\nas Bond relates, and here as representative 1636-44 except 42, was\n\nactive in trade, first at Medford, afterwards at W. but was induced to\n\nremove to the Vineyard about 1647, where he was proprietor's Governor\n\nand preacher to\n\nthe Indians above 33 years. Died 1681, six days only before being 90\n\nyears old. It is indistinct pronouncement by tradition that first\n\nwife who died in England had been Martha Parkhurst and second was\n\nprobably brought with him, Grace, widow of Thomas Paine of London, and\n\nby her he had Hannah, Bethia and Mary. It is not known that he had\n\nany sons but Thomas who he, as brother of the former wife brot. from\n\nEngland but some\n\nuncertainty is felt as to the relation of father and I do not concur\n\nwith Bond, 857, in making Jane the last wife of Thomas the elder, but\n\nthink her widow of the son, nor do I believe that it was the son who\n\nwas, in 1647, chosen by Thomas Paine, then 15 years old, as, with his\n\nwife Grace, guardians for him.\n\n\n\n\n\nThomas was baptised 01-Apr-1593 in Tisbury, England; came to Medford, Mass. in 1635; was a prominent member of the\n\nAncient and Honorable Artillery Co.; was a missionary to the Native Americans (Indians). {-See \"The Genealogical\n\nAdvertizer,\" Vol. 4 (1901), p. 1.} He owned Martha's Vineyard, Nantucket and Elizabeth islands and was Governor of\n\nMartha's Vineyard. He settled Edgartown, 1658-81. He lived to age 90. His son, the Rev. John Mayhew, was first\n\nmissionary on Martha's Vineyard, 1642-57; he died at sea en route to England at age 37 and his father, the Governor,\n\nsucceeded him as missionary pastor. Cf. \"Old Nantucket the Faraway Island,\" William O. Stevens; \"History of Tilton\n\nFamily in America,\" F.T.Tilton, pp. 152-3; \"Hist. of Martha's Vineyard...,\" Charles Edward Banks (Dukes County, MA,\n\nHistorical Society, 1966, 3 vols.) In England Thomas was a merchant apprentice of Richard Macey of Northampton before\n\nemigrating in 1631. He moved from Watertown to Martha's Vineyard, living there permanently from 1674. See \"Thomas\n\nMayhew, 1592-1682\" published by Duke's County Historical Society, Edgartown, MA, 1936 for his seal, will, etc."}, {"url": "https://thepiercefamilyhistorian.com/nantucket-island-and-our-quaker-ancestors", "page_content": "As discussed in my last post of our Quaker Ancestors…researching them has been made simple by the wonderful records that were kept, and stretching far back in our history we will find much written of their lives and travels. Following our lineage from the early days in the America’s can sometimes be confusing due to the many uses of like names and the tangling of our ancestors as they traveled together and intermarriage amongst each other. One will find that our lines cross over and over again down through the years.When trying to decipher the DNA matches you will find it difficult to find that common match due to the criss-cross in the lines. Our history from Nantucket Island and our Quaker Ancestors is proof of this for sure.\n\nNANTUCKET ISLAND\n\nIn 1659 it is recorded of Thomas Mayhew that the land in Nantucket was sold to nine men namely\n\nTristen Coffin, Thomas Macy, Christopher Ilussey, Richard Swain, Thomas Bernard, Peter Coffin, Stephen Greeleaf, John Swain, and William Pike.\n\nStill suffering persecution in Massachuttes Thomas Macy and Tristen Coffin, set out to find a place of peace among them. They purchased the land from William Mayhew for 30 pounds and two Beaver Hats, one for William, and one for his wife. Seeing the promise of their plans William Mayhew chose to become a partner in the land also, and bought in his share. By the deed recorded it is observed that a share of the island was retained by Thomas Mayhew and in this way he became one of the proprietors who are said in all histories of the place to have founded the settlement.\n\nAmong these men I will discuss in detail those of our direct ancestors in the next few post, though for years the families of these mentioned intermarried and we will find that . we are descended in one way or another by the 16 earliest settlers of the Nantucket area. Just as in researching those Quaker ancestors that migrated to the Sugar Grove, Virginia area it seems we have relations to almost all in the area. You will find that within the migration areas (Gilford, N Carolina, Kentucky, Indiana, Missouri, Iowa and on westward) there are so many times intermingled relationships. Down through the years and a crossed the United States they traveled in families and groups together and married within these groups.\n\nPay close attention to the names mentioned within the posts, as they will come to play amongst each other.\n\nUntil the nineteenth century when more new people begin to come to the island, the very close-knit community was almost all related in one way or another. It is hard to separate the relationships among the early settlers as they each come together at some point.\n\nAmong these were men of varied experience and marked executive ability. Men who embraced every opportunity for the advancement of the settlement, and the establishment of an interesting society upon the island.\n\nTHOMAS MACY\n\n(EIGHT GREAT GRANDFATHER)\n\nIn the Parish of Chilmark, near the town of Salisbury, Wiltshire, England, Thomas Macy resided before his removal for America around 1635. We do not know the name of the ship that brought him to America but he arrived here no later than 1639. He was among the original settlers of the Salisbury, Massachusetts area and is in “The first or Original list of Englishmen of Salisbury” book of records.\n\nIt has been recorded that Thomas was “a merchant, a juryman, a preacher and one of the select men of the town. ”\n\nSeveral people were prosecuted for violating the law of 1637 which prohibited entertaining Quakers. Among these was Thomas Macy, who was fined thirty shilling, and ordered an apology, and it was ordered he be admonished by the governor. It was recorded that he had sheltered Edward Warton, William Robinson, a merchant of London, and Marmaduke Stephenson, of Yorkshire, England. Of those the last two named were hanged in Boston the 27th of October in 1659.\n\nHis letter to the Court went like this:\n\n“On a rainy morning there came to my house Edward Warton and three men more, the said Wharton spoke to me saying that they were traveling eastward and desired me to direct them in the way to Hampton, and asked me how far it was to Casco Bay, I never saw any of the men afore, except Wharton neither did I require their names, or who they were, but by their carriage I thought they might be Quakers and told them so, and therefore desired them to pass on their way, saying to them I might possibly give offense in entertaining them, and as soon as the violence of the rain ceased (for it rained very hard) they went away and I never saw them since. The time they stayed in the house was about three quarters of an hour, but I can safely affirm that it was not and hour.”\n\n“They spake not many words in the time, neither was I at leisure to talk with them, for I came home wet to the skin, immediately afore they come to the house and I found my wife sick in bed. If this satisfy not the honored Court I shall be subject to their sentence. ”\n\n“I have not willingly offended. I am ready to serve and obey you in the Lord.”\n\nThos. Macy\n\nThomas Macy was a Baptist, and on the Sabbath frequently exhorted (Exhort is a 15th-century coinage. It derives from the Latin verb hortari, meaning “to incite,” and it often implies the ardent urging or admonishing of an orator or preacher.) the people which was also in violation of the Massachusetts Law which prohibited all but the regularly ordained from service.\n\nTradition says that immediately after his sentence, Thomas Macy, left for Nantucket.\n\nThe Macy Genealogy relates that in 1659, Thomas embarked at Salisbury in a small boat with his wife and children and such household goods as he could conveniently carry, and in company with Isaac Coleman and Edward Starbuck, and set sail for Nantucket. ( James Coffin, son of Tristram is said to have accompanied him also).\n\nThomas basically, had had it with the authority over him, and could no longer submit to the ” tyranny of the clergy and those in authority.”\n\nHaving satisfied the requirement of the law, and paid his fine, he undoubtedly felt he could lead a more peaceful and independent life in Nantucket, and voluntarily exiled to the Island.\n\nBEFORE HIS REMOVAL\n\nBefore his removal to Nantucket Thomas was commissioner, and representative to the General Court of Salisbury, and the citizens of that testified of their sympathy with him by electing his friend and defender, Robert Pike as his successor.\n\nApparently, according to records he returned to Salisbury and again at a later date removed to Nantucket which is evident from old records, in which it is found that on October 1, 1675, he was commission chief magistrate of the town.\n\nThomas was the first recorder appointed on the island, and a portion of the first Book of Records in the office at Nantucket was mostly written by him.\n\nHe died April 19, 1682, at the age of 74. His wife, Sarah Hopcott, who had accompanied him from Chilmark, survived for nearly a quarter of a century after.\n\nThanks for stopping by. If you have enjoyed this bit of history or are related in anyway please leave a comment in the box below.\n\nHappy Hunting\n\nThe Pierce Family Historian"}, {"url": "http://www.chester.pa-roots.com/quaker_research/quaker_arrivals_at_philadelphia.htm", "page_content": "QUAKER ARRIVALS AT PHILADELPHIA 1682-1750 , by Albert Cook Myers, published in 1902.. In the name of brevity (and my typing fingers), I'm omitting information that, while interesting, is non-essential, so if you get a chance to view the actual book, please do so.....lots of interesting tid-bits.\n\n\n\nABBREVIATIONS USED\n\nmo = month (to translate Quaker dates to non-Quaker dates, read elsewhere on site)\n\nmm = monthly meeting (for full understanding of how the Quakers worshiped, please read the Quaker info elsewhere on this site)\n\nm =meeting\n\nIf there are 2 dates given, the first is the date on the certificate composed by the mm the person was leaving and the second is the date the certificate was received by the Phila. mm (Philadelphia monthly meeting) or, at times the second date is simply when the person 'appears' in Philadelphia records, and not when the cert is actually received. The date of receipt of the certificate in Philadelphia will always be noted as received.\n\nneph = nephew\n\nfam = family\n\ns = son\n\ndau=daughter\n\ndecd = deceased\n\ncert = certificate\n\nch = children\n\nfam = family\n\nunm = unmarried\n\nEng = England\n\nIre = Ireland\n\nw = wife\n\nCERTIFICATES OF REMOVAL\n\nRalph Fretwell, from Six Weeks Meeting, in Barbadoes Island, West Indies \"intending shortly to leave this Island\" dated 12 mo 11, 1683 John Jones, Plantation Meeting, Island of Barbadoes, to Pennsylvania, 5 Mo 15, 1683\n\nDavid Brentnall, Breach Meeting, Derbyshire, England 8 MO 10, 1681. Certificate addressed to 'ffriends at London or to whom it may concern.\"\n\nHenry Lewis, Lewis Daid and William Howell, from General Meeting at Redstone, Pembrokeshire, South Wales, 6Mo 6, 1682...cert accepted by Phil. MM\n\nRobert Adams, Barton MM (Engtland) 2 MO 3, 1682\n\nJames Atkinson, Drogheda Meeting Ireland 8 mo 23, 1681\n\nSamuel Allen, MM at Butcomb, Somersetshire, England 12 MO 24, 1681\n\nJane Blanchard, MM at Ringwood, Hampshire, England, 11 MO 11 1682-3\n\nSamuel Miles, mm \"in the Parish of Llainhangel yr hely gen\", Radnorshire, Wales 5 Mo 27, 1683.\n\nWilliam Frampton, Half Year's meeting, Oyster Bay, Long Island 4 Mo, 20 1684\n\nElizabeth Annis, MM at Devonshsire House, London, England 5 Mo, 5, 1682\n\nAlexander Beardsley, no date or place for cert, but received by the Phil. MM....signers are Thomas Hackett, Wm Pardoe, Tho Reeves, John Knight, Job Waring, Richard Parker, John Golbourn, Wm Sankey, John Knight\n\nElizaberth Walters, no place given, dated 7n mo 13, 1683...signers were Peter Walter, Peter Walter, Jr, Christopher Holder Jr, Richard Hill\n\nWilliam Salway, MM at Taunton England 6 Mo 13, 1683\n\nJames Miles, mm \"in the parish of Llainhangell Helygen\", Radnorshire Wales 5 Mo 27, 1683\n\nJohn and Richard Bunce, mm at \"ffarington\" England 1 mo 30, 1682\n\nThomas Bowman, meeting at Wansworth, county Surrey, England 2 mo 4, 1682\n\nEverard Boulton, mm at Rosse, Herefordshire, England 5 Mo 18, 1682\n\nJohn Evans and David Kinsey, Bristol, England, 6Mo 26, 1682\n\nThomas Ellis, Quarterly Meeting Dolyserre, Wales, 5 mo 27, 1683\n\nBenjamin Chambers, mm in City of Rochester, County Kent, England 5 mo 18, 1682\n\nPhilip England, Men's Meeting, Dublin, Ireland 3 Mo 21, 1683\n\nAlexander Beardsley, John Price and SeeMerry Adams, Worcester, England 3 MO 14, 1683\n\nEnoch Flower and Jospeh Bushwell, mm at Brinkworth, England 3 MO 21, 1683\n\nJohn Gardner and Will: Harmer, MM at Purton, Wiltshire, 4 Mo5, 1682. George Harmer appears among the signers.\n\nFrancis Fincher, Worcester England 3 mo 14, 1683\n\nJohn Goodson, mm at Peel, in London 6mo 30, 1682\n\nJohn Hart, mm at Witney, Oxfordshire 2mo 10, 1682\n\nJohn Harper, mm at Barton, England 2mo 3, 1682\n\nJohn Day and Edward Jefferson, Ashwell Meeting, England 3mo, 12 1683\n\nGiles Knight, mm at Naylsworth, England 3 mo 12, 1682\n\nJohn Kilcop, mm at Devonshire House, London, England 5mo, 12, 1682\n\nJohn and Joseph Low, Men's Meeting Bellyhagan, Parish of Kilmore, Ireland 5mo,31, 1682\n\nCharles Lee, Men's Meeting at Clithroe, Lancfashire, England 2 mo 30, 1682\n\nJohn Mason, mm at Farrington, county of Berks, England 2mo 27, 1682\n\nArchibald Michael, Men's meeting at Richard Byoes; House, near Lisburn, County Antrim, Ireland, 6 mo 2, 1682\n\nElizabeth Newman, Men's Meeting at Farrington, England 1mo 30, 1682 *( not an error...Men's meeting)\n\nDavid Ogen, London, England 11 mo 21, 1681-2\n\nEvan Oliver and David James, Bristol England, 6mo 26, 1682\n\nJohn Parsons and Tho. Kerell, (certificate does not give place) 7mo 4, 1681. Signers are John Anderson, John Parsons and fflorence Parsons, his father and mother, Wm Tyler, Joan Tyler\n\nJames Sessions, mm at Witney England, 4mo 10, 1682\n\nHannah Sessions, from Witney 2mo, 10, 1682\n\nThomas Yong, mm at Sangah, Yorkshire, England 3 mo 5, 1682\n\nHenry Waddy,his arrivall at Upland was the 2nd day of ye 6th mo, 1682\"..place not given\n\nRichard Worrall, mm at Oare, England 5 mo 21, 1682\n\nRichard Wall, mm ''held at ye house of Edward Edwards of Stock Orchard, in ye county of Glocester'', England 4 mo 26, 1682\n\nJohn Worrall, meeting at Ore, Berkshire, England 5mo, 16, 1682\n\nThomas Holme, meeting at Waterford City, Ireland 11mo 29, 1681\n\nRichard Worrall, mm at Ore, Berkshire, England 1mo 17, 1682\n\nWillliam Brinton, January 14, 1683 subscribed by Thomas Brindley, John Clay, John Green, Josiah Stanney\n\nGeorge Pyerce (Pierce), mm at Frenshay, county Glocester, England 5 mo7, 1684 (another certificate from Thornbury meeting, received 9mo, 4, 1684\n\nJohn Bowter, Dudley mm, England 3mo 21, 1684 - received 9mo 13, 1684\n\nJohn Taylor and Daniel Osborn, Kineton meeting, Wiltshire, England 5 mo 13, 1684\n\nJohn Bant and Nicholas Prime, place not named 7mo 2, 1683 signed \" Will Bant and Tho Bant ffather of ye said John, Thomas Lower, Tho. Salthouse, ffrancis ffox \" received 9mo 4, 1684\n\nJohn Taylor, Aldrington county Wilts, England reveived 9m mo 4, 1684 signed by Charles Gore,esqr, Thomas Gore, esqr, Isaac Osborn, Samson ffower\n\nWilliam Garret, John Smith, Robert Cliffe and Samuel Lewis, meeting at Harby, county Leicester, England,dated 6mo 6, 1684 received 9mo 4, 1684\n\nHugh Dunborow and Joseph Hembey (Hembray), Somerset Ilchester, England 6 mo 5, 1684 received 9mo 4, 1684\n\nDaniel Medlicott, mm at Salop, England 3 mo 16, 1683. At Phil 9mo, 4, 1684\n\nSamuel Carpenter, mm at BridgeTown, island of Barbadoes, 6 mo 23, 1683\n\nHannah Hardyman, Haverford West Meeting, England 6mo 2, 1683, signers were Abraham Hardiman and Jane Hardiman, mother of Hannah. at Phil 9 mo 4, 1684\n\nRobert Turner and family, Men's meeting City of Dublin dated 5mo, 3, 1683 (''a widdow man'')\n\nElizabeth Simms, Kensington \"ye 2d 5 mo, 1685\" signed by Sarah Hersent, Guielma Penn, Rose Miller\n\nMichael and Elizabeth Hammond, Men's Meeting in London England 6mo 25, 1686. Received 10mo 31, 1686\n\nMary Bullocke, no date or place of origin. Among signers were John, William, Anne and Grace Bullocke, Thomas Callowhill\n\nWilliam Bradford and his wife Elizabeth, Devonshire House, London, England 6mo 12, 1685. Among signers was Elizabeth Bradford. Received 11mo 4, 1685\n\nHannah Smith, dau of Robt Smith deceased some years since from Worcester City, England 6 mo 4, 1685\n\nWilliam Fisher, mm of Ross, Hereford Co, England 6mo 6, 1684. William and Samuel Fisher among signers\n\nJames Chick, carpenter, unmarried, a member by convincement from Callumpton, County Devon, England 10 mo 24, 1683\n\nSamuel Richardson, wife and family from mm at Spanish Town, Island of Jamaica 3mo 10, 1687\n\nFrancis Gamble, mm at 'ye house of Thomas Richards', Barbadoes. his wife is deceased 6mo 26, 1687\n\nElizabeth Carter, single woman who comes as a minister from Spring meeting, Barbadoes 5mo 7, 1686\n\nThomas Godfrey, Ashford, Kent Co, Husbandman and family; Thomas Bridge, Ashford a single man; Thomas Heanaker of Woodchurch, son in law to ye said Tho Godfrey: all in one certificate from Meresham meeting, England 7mo 9, 1686. Among signers are Thomas Brett of Mersham, and Thomas Brett of Bonnington\n\nFrancis Cooke, unamarried Little Hallum, Darby, England MM at Breach House, Darby, England 5mo 13, 1682\n\nMary Brett, widow of John Brett of Mershan, and son Daniel, from mm at Mershan, Kent, England 7mo 8, 1687. Among signers were Thomas, Mary and Elizabeth Brett\n\nAlexander Beardsley, wife and family. date and place not mentioned. signers,Edward Bourne, Thomas Reeves, John Golbourn, Richard Parker, Wm Pardoe, Joseph Allibon, Wm Sankey, Edwawrd stanton, James Taylor, Thomas Hackett, John Hunt, Thomas Mince and John Knight\n\nJames Marshall, wife Rachel and family, and Wm Hudson, unmarried, all of York City, England. cert. from mm in York. no date...Wm. Hudson among signers.\n\nJan Williams Bookenhoven, cooper who lately lived at Haarlem and now with his wife and children intending for Pensilvania. mm in Amsterdam, Holland 5mo 3, 1684\n\nSarah Watts, 11mo 27, 1686 from Radnor mm, PA\n\nEdward Turner, 14, 1686-7 from Concord mm, PA. To mary Catharine Carter at Phil 12mo 25, 1686-7.\n\nGeorge Smedley, unmarried 4mo 15, 1687 Darby mm, PA. at Phil, 3mo 27, 1687. married Sarah Gooden.\n\nSeemerrie Adams, in order to marry Mary Britt, widow, of Phil. 8mo 5, 1687 from Falls mm, Bucks Co, PA. At Phil. 7mo, 30, 1687\n\nFrancis Cooke, unmarried of Blackbird Creek, New Castle co, 4mo 19, 1687, from Duck Creek. At Phil 3mo 27, 1687\n\nWilliam Bethell, unmarried of Amboyperth, NJ, Bricklayer 7mo 14, 1687, from mm at Amboy Perth, to marry Eleanor Claypoole at Phil 10mo 30, 1687\n\nJoshua Tittery, to marry Cicely Wooley 1mo 26, 1688, Abington mm, PA at Phil 12mo 24, 1687\n\nJohn McComb, unmarried 6mo 19, 1688, from William Stockdale. at Phil 5 mo 26, 1688\n\nWilliam Salway, to marry Sarah Pennock, dau of Christopher, of Phila. 6mo 22, 1688 from Abington mm\n\nJohn Barnes, tailor, in order to marry Mary Arnell 7mo 24, 1688 from Abington mm, Pa\n\nThomas Carle, to marry Catharine Brintnall 8mo 3, 1688, from Falls mm, Pa\n\nWilliam Rodney, unmarried, 10mo 18, 1688 from Sarah Edmondson and William Pavatt, of Talbot co, Md. declared intentions of marriage with Mary Hollyman at Phil 9mo 30, 1688\n\nJames Stanfield, son of Francis and Grace, to marry Mary Hutchinson, dau of George, of Burlinton 12mo 3, 1689-90 from Chester mm, Pa at Phil 3mo 30, 1690\n\nWilliam Say, sawyer, of Burlington to marry Mary, dau of Widow Guest 8mo 5, 1690, from Burlington mm, NJ. at Phil 8mo 31, 1690\n\nThomas Turner, on a religious visit, 7mo 24, 1697, from Quarterly mtg of Coxall, Essex, England received 5mo 28, 1704\n\nJohn Lyndham, Ann Arundel Co, Md, came to a monthly meeting held at ye house of Wm Richardson at West River 20th 9mo, 1691\n\nMargaret Lineham, mm at West River, Md 11mo 15, 1691\n\nRalph Jackson, mm held at West River, Md 5mo 1, 1692. received 5mo 29, 1692\n\nGeorge Gray, widower \"ancient inhabitant of this island\" (Barbadoes) 1mo24 1691-2 received 5mo 29, 1692\n\nEvan Morris, wife Gainor and 2 children Quarterly meeting at Tyddyn y Garreg county Merioneth, Wales 5mo 8 1690\n\nThomas Griffith, unmarried of Westchester, England cert, from Chester, England 6mo 9, 1686\n\nBarbara Prachin, \"relict of Hillarius Brachin\", Mariana VanBuylaert relict of Jno VanBuylaert, Abigail Matern dau of John George Matern, schoolmaster, These women (mother, daughter and grandaughter) cert. from Two Weeks'Meeting in London England 12 mo 4, 1693-4\n\nPenticost Teag, and his wife he of 'ye trade or occupation of ffishert\" mm at Marazion, Cornwall England 1mo 5, 1693-4 endorsed at Fallmouth 1 mo 7, 1693-4. received 1mo 27, 1684\n\nJoseph White, wife and children cert from New Salem, 5mo 30, 1684\n\nRebecca Richardson, young woman cert 2 mo 4 (1681 place not named signers; Mary Stott, Ann Whitehead, Grace Bathurst, Mary Plumsted, Mary Ellson, Mary Morden, ffra; Polsted, Pris; Hart, Margt. Meakins, Marabell ffarmbrow\n\nStephen Coleman, and wife Half Year's Meeting, Chester Kent co, Md 2mo 12, 1697\n\nRichard Hoskins, minister, wife and family Quarterly Meeting at Barbadoes 7mo 24, 1696\n\nNathaniel Harding, skinner from London, wife and family mm at Devonshire House, London, England 10mo 11, 1695\n\nElizabeth Webb, minister Gloucester, England on a religious visit to America Quarterly meeting Tetburn county Gloucester, England 6mo 31, 1697. Richard Webb was a signer\n\nMary Rogers minister wife of Joseph Rogers, East Markham, Nottingham Co Quarterly meeting in Mansfeild, England 7mo 27 (year not given)\n\nRichard Warder, wife and family, mm at Arunell, England 4mo 7, 1698\n\nJohn Busby, weaver, Milton, Parish Shipton Meeting at Milton2mo 4, 1682\n\nEvan Powell, weaver and wife Gwen of Nantmell, Radnorship, Wales 3mo 20, 1698\n\nEdward Moore, widower \"Lanbudaen\", Radnorshire, Wales and his family and neighbor, Thomas Powell 8mo 20, 1698\n\n8mo 20, 1698 John Askew, unmarried, mm at Hunger Hill, upperside of Bucks co, England 1mo 1, 1695\n\nJohn Rye, unmarried son of Thomas Rye, mm Horsleydowne, Southwark, England 6mo 3, 1698\n\nLumly Williams, unmarried, meeting at Radnorshire, Wales, 3mo 20, 1698\n\nRichard Low, unmarried \"late of blackfryers in London Shooemaker\" mm at Gloucester city, England 2mo 30 1699. among signers are Thomas Mannington and Wm Mannington\n\nWilliam Wilson and son John Wilson and his family, mm at Woodhall, Calbec, Co of Cumberland , England 9mo 16, 1699\n\nVincent Caldwell, unmarried mm Moniash , England. 1mo 24, 1699\n\nWilliam Penn, from Two Days' Meeting London England, 6mo 11 1699 another certificate, from meeting in City of Bristol, England 5mo 31, 1699, another from mm Horsham, England 5mo 12, 1699\n\nSarah Clemens, minister cert, to make a religious visit mm at Devonshire House London, England 1mo 11, 1699\n\nThomas Wilson and family mm at Lancaster, England 1mo 11, 1699\n\nThomas Pearson,wife Grace and children Marsden Meeting, Lancashire, England 12mo 16, 1699\n\nThomas Loynsdall (Lansdale) and wife, mm at Lancaster 1mo 11, 1698-9\n\nJonathan Dinnis, (\"troubled with consumption, to PA for his health) leaving behind his wife and children. Plantation Meeting, Barbadoes, 7mo 22, 1699\n\nJohn Warder, unmarried, mm Horsleydowne, Southwark, England 10mo 29, 1699\n\nThomas Bye and son, mm at Horsleydown, Southwark, England 10mo 24, 1699\n\nSolomon Warder and Mary Howel, First Day Meeting on Newport, Isle of Wight, 6mo 20, 1699. they declared their intentions of marriage 6mo 2, 1699 received 10 m0 29, 1699\n\nThomas Parson, Coufold, co of Sussex, single man, mm Horsham, Sussex, England 5mo 12, 1699. Names of Hugh and Isaac Parsons among signers. received 10mo 29, 1699\n\nRandolph Janney, son of Wm. Janney of Hanford, Cheshire, England mm at Morley, Cheshire, England 6mo 2, 1699. Name of Deborah Janney among signers. received 10mo 29, 1699\n\nJames Streater and family New Alsford - mm in Alton, Hampshire, England 6mo 4, 1699. received 10mo 29, 1699\n\nTimothy Hudson, young single man, son of William Hudson, mm at York, England 11mo 6, 1698-9 received 11 mo 26, 1699\n\nJoseph Austill, lately of Ore, son William Austill and grandson of Dorothy Austill, decesaed, from Meetings of Ore and Newberry, England 11mo, 17, 1698-9, received 11mo26, 1699\n\nWilliam Smith (the elder) wife and family, mm at Glastenbury, Somersetshire, England 6mo 14 1699 England\n\nSamuel Sidon, meeting at Breach,Derbyshire, England 7mo 22, 1699\n\nThomas Storey, mm at Hamersmith, Middlesex, England 5mo 26, 1699. received 11mo 26, 1699\n\nAbraham Scott, of Bartholomew ye great Mercer son of Thomas Scott, deceased, mm Peale, St. John Street, London, England 5mo 26, 1699. received 11 mo 26, 1699\n\nJames Barton, unmarried baker, son of James Barton, farmer in Staford County, Two Weeks' meeting Devonshsire House, London 2mo 10, 1699, received 11mo 26, 1699\n\nJonathan Dickinson mm Spanish Town, Jamaica, 1mo 12, 1699\n\nJohn Linton wife Rebecca, late of Wigton mm at Long Newton, England 6mo 25, 1699\n\nMary Doe, unmarried, late servant to John Field, mm at Brewers Hall, London, England 5mo 17, 1699\n\nJoan Hall, unmarried, mm Moniash, Derbyshire England 11mo 4, 1699. signed by Sarah Hall\n\nRobert Heaton, to marry Grace Pearson, 2mo 4, 1700, from Middletown mm, Bucks Co, Pa 1mo 29, 1700\n\nThomas England, unmarried 3mo 27, 1700 from Chester mm, Pa 3mo 31, 1700\n\nSamuel Hood, son of John Hood to marry ? Hudson, of Phila. 12mo 5, 1700 from Derby mm, Pa\n\nThomas Taylor, to marry Rachel Minshall of Phila 8mo 28, 1700 from Chester mm, PA received 9mo 29, 1700\n\nJoseph Hood, son of John Hood, to marry Sarah Brown of Phila 12mo 5, 1700 from Darby mm, Pa received 12mo 28, 1700\n\nHenry Willis, from Flushing, 3mo 26, 1700\n\nRichard Hill, Jr., mariner, unmarried, Two Weeks' Meeting, London, England 6mo 14, 1699. cert. addressed to mm at West River, Md or elsewhere\n\nJohn Hurford, Teverton, Devon, England and family...als \"yt John Hurford jur, his son and July an Holcfomb his own wife's daughter\" meeting at Columpton 2mo 24, 1700\n\nRichard Parker, Bristol, England received 2mo 25, 1701\n\nJohn Webb and family, city of Gloucester, England, Quarterly m of Co Gloucester, Nailsworth 6mo 27, 1700. received 11mo 31, 1700\n\nMary Lawson, unmarried, mm upon Pardsay Crag 6mo 27, 1700, received 11mo 31, 1700\n\nWilliam Abbott and dau, Bandon mm, Ireland, received 2mo 25, 1701\n\nHannah Emerson, unmarried, Cockermough, Cumberland, England m 11mo 17, 1697. received 11mo 31, 1700\n\nNicholas Fairlamb, Stockton, Durham Co, England m/ 6mo 13, 1700, received 9mo 29, 1700\n\nJohn Gibbins jr, Bethel, Chester co, Pa Concord mm 9mo 9, 1700. to marry Sarah Howard, of Phil.,John and Margery Gibbins give consent to marriage\n\nTobias Dimock, unmarried, Town of Newport, RI, 10mo 12, 1699. received 7mo 27, 1700\n\nJohn Lea and family, City of Gloucester, England, Quarterly m at Naylsworth, Gloucester Co 6mo 27, 1700, received 11 mo 31, 1700\n\nHugh Cordry and family, Rattclife mm near London England, 10mo 27, 1699\n\nDeborah Cordry with husband Hugh Ratclif, England, 10mo 27, 1700\n\nJoseph Antrobus unmarried son of Benj. Antrobus of London, Two Weeks' m in London 3mo 6, 1700\n\nJohn Walker unmarried, from mm in Md 3mo 30, 1700. received 9mo 29, 1700\n\nWilliam and Rosamond Till son and daughter of John Till; of Whitegreave. (same voyage wth them and allsoe to Ann Delworth...(in care of Wm and Rosamond), Robert Heath and his wife who Come along ye same voyage with them), Stafford mm, England 2mo 11, 1700. among signers is John Till, their father\n\nGeorge Archers mm from county of Somerset, England..in Phila mm 7mo 27, 1700\n\nBenjamin Davis unmarried, mm at ffrench hay, Gloucester Co, England,3mo 6, 1695. received 9mo 29, 1700\n\nRachel Minshall, Preparative m at Frandly, Cheshire, England, 1mo 3, 1697\n\nThomas Chalkly, wife Martha mm at Horsleydowne, Southwark, England 6mo 28, 1700. among signers were George Chalkly sr and George Chalkly, jr\n\nAnna Watson, unmarried, Quarterly m at the Bull and Mouth, London, England 8mo 6, 1701\n\nJohn Estaugh, minister, Dunmore, Essex Co. Quarterrly m at Cogshall, Essex Co, England, 7mo 28, 1700 received 1mo 27, 1702\n\nChristopher Blackburne, mm Richmond, held at Leburn, York Co, England 12mo 13, 1701. at Phila m m 4mo 26, 1702\n\nJames Steel, Chichester, Sussex co house carpenter with wife and family Steyning, Sussex mm 5mo 6, 1702. among signers; Henry Steell and John Hammond (father of James' wife)\n\nLevin Herberdink, Dublin twp mm (Abington, Phil Co) \"att ye house of Richard Worrell \" 12mo 22, 1702-4 (dwelt for many years in Germantownship)\n\nWilliam Robinson, unmarried, Rounton, mm at Thrisk, Yorkshire, England,10mo 8, 1702, received 2mo 30, 1703, signers; Jo.,Samuel, Tho., NIch. Robinson\n\nJoseph Parker, young lad, mother Elizabeth Parker, of Bartholomew Close, London, England wishes a cert. for her son, aged 14.. going to uncle Robert Heath in PA from Peel mm, London 12 mo 25, 1701 received 2mo 30, 1703\n\nBenjamin Chandlee, unmarried son of Wm Chandlee, Kilmore, Kildare Co, Ireland from Edenderry mm, King's Co, Ireland 11mo 28 (no year) signers Wm Chandlee Jr and Nath. Chandlee\n\nMargaret Bye &2 daus Horsleydown m, England, received 4mo 27, 1701\n\nJohn Pickott (Piggott), unamrried, West River, Md mm, 11mo 29, 1702-3, marriage to Alice Renier, auth. 8mo, 27, 1704\n\nElizabeth Green, unmarried Dublin, Ireland mm 11mo 26, 1702. Received 4mo 25, 1703\n\nRobert Finley, unmarried Two Weeks' m at Bull and Mouth, London, England 1mo 22, 1702-3 received 6mo 27, 1703 (had been 'captive in Barbary 19 years before redeemed by friends)\n\nRachel Cumberlidge London, England, 4mo 26, 1702\n\nSamuel Held (Heald) & wife Mary, mm at MOrley, Chester Co, England, 10mo 3, 1702,Joan Held, a signer. Received 5mo 30, 1703\n\nThomas Iredell, unmarried, mm at Pardsay Cragg, Cumberland, England received 8mo 29, 1703\n\nRichard Robinson, unmarried leather dresser (captive in Barbary 4 years, then redeemed by friends) from Two Weeks' m, Bull and Mough, London England 1mom 22, 1702-3 received 9mo 26, 1703\n\nRichard Webb, City of Gloucester, England & family Quarterly m at Naylsworth, Gloucester co, England 6mo 27, 1700, received 12 mo 28, 1700\n\nPeter Stretch wife and family, mm Leek, Staffordshire, England 10mo 3, 1702, received 6mo 27, 1703\n\nMargery Keith, unmarried, Bridgetown mm, Barbadoes 3mo 28, 1702 brother John Beek, 8mo 29, 1702\n\nJoan Clifton, Newtown mm, West NJ 4mo 8, 1704 received 5mo 28, 1704\n\nMichael Faucett, unmarried mm at Providence (Chester mm) Chester, PA, 9mo 27, 1704, John Fawsitt a signer,at Phil 9mo 24, 1704\n\nChristopher Topham, unmarried, Coldban, Cornham Parish, York Co, England - shoemaker. Richmond mm, Leyborn York Co, 6mo 13, 1703, received 10mo 29, 1704\n\nThomas Coleman, unmarried, mm at Horsleydown, Southwark, England 1mo 8, 1703-4..received 11mo 26, 1704\n\nWilliam Petty, wife Jane and family (some not Friends) Norwich, England to NJ from mm at Burlington NJ, 7mo 4, 1704 received 8mo 27, 1704\n\nAnn Veere, spinster Westminster mm, Savoy, London, 12mo 3, 1702.\n\nKatharine Hallingham, unmarried, Newtown ,West Jersey mm, 2mo, 3, 1702\n\nThomas Coleman, Horslydown mm, Southwark, England received 11mo ,1704\n\nAbigail Hood, widow with children 7mo 6, 1704 Darby, Pa mm at Phil 12mo 23, 1704\n\nDavid Williams, widower to marry Mary Malsby, 11mo 11, 1704 from Haverford mm, Pa at Phil 10mo 29, 1704\n\nAnn Chopman, Wrightstown, to make a visit to Long Island and R.I. from Middletown mm, Bucks Co, PA 1-1704-5\n\nMary Newcome, minister from Lockington co, Leicester (religious visit) received 1mo 28, 1706\n\nSamuel Lewis, Haverford mm, Pa to marry Grissell Kite, 11mo 2, 1705 at Phil 8mo 28, 1709\n\nAbraham Scott, unmarried Two Weeks' m, London, England 11mo 12 1701, received 3mo 26, 1705\n\nThomas Lyford, unmarried Two Weeks' M at Bull and MOuth, London England received 4mo 29, 1705\n\nJohn Widowfield, young man Thirske mm, Yorkshire England received 4mo 29, 1705\n\nElizabeth & Elinor Arnold, unmarried, Wexford Ireland 12mo 5, 1704, received 4mo 29, 1705\n\nWilliam Harrison, Clifts mm, Md 4mo 15, 1705, received 5mo 27, 1705\n\nMary Wilson, unmarried dau of John Wilson, Greenridge, Coldbeck , Cumberland England. from Dublin mm Ireland received 11mo 25, 1705\n\nThomas Story, minister London mm + one Two Weeks m, London (clear to marry) received 11mo 26, 1699\n\nNaomi Berry, unmarried mm at house of Sara Stevens, Choptank Md ...at Phil 4mo 28, 1706. Married George Gray\n\nPaul Woollfe, Dublin mm 12 24, 1706-7 received 12mo-31-1706-7\n\nMargaret Thorpe, Rahway NJ mm 11mo 17, 1706-7 received 11mo 31, 1706\n\nJoseph Brown, (late of Cohasey) with wife Salem NJ mm received 3mo 31, 1706\n\nJacob Minshall, son Thomas Minshall, to marry Sarah Owen, dau Griffith Owen from Chester mm, Pa 10mo, 30, 1706 received 11mo 31, 1706-7\n\nElizabeth Palmer, unmarried Bridgetown, Barbadoes 12mo 27, 1706 received 11mo 31, 1706-7\n\nJohn Tanner, Lurgan m, Ireland 5mo 25, 1707 married Mary Rea\n\nEbenezer Large, Falls mm, Bucks Co, Pa 6mo 6, 1707\n\nThomas Brian (Bryant), Burlington mm, NJ to marry Susanna Hearn in;Phila 6mo 29, 1707\n\nIsaac Minshall, son Thomas and Margaret to marry Rebecca Owen, dau Griffith Owen from Chester mm, Pa 7mo 29, 1707 at Phila. 7mo, 26, 1707\n\nRobert Chamberlaine, unmarried, Horsleydown England mm 2mo 3, 1706, received 1mo 28, 1707\n\nEdward Skull, unmarried Corke Ireland mm 1mo 9, 1706. received 3 mo 30, 1707\n\nGuian Stephens, unmarried Loughgaul, Co Armagh, Ireland from Bellyhagan mm, Ireland 7mo 5, 1700 received 2mo 25, 1701\n\nGeorge Calvert, Carlisle, England mm 11mo 19, 1704 received 12mo 22, 1707-8\n\nWilliam Masson, Quarterly m Stafford, England 2mo 3, 1705,received 12mo 27, 1707-8\n\nDavid Britnall, jr, unmarried, Chester,mm, PA 12mo 23, 1707-8 received 12mo 27, 1707-8\n\nMary Mathews, unmarried Dolobran, Wales mm 11mo 27, 1707, received 9mo 26, 1708\n\nJoan Humphrys, unmarried Hammersmith Co, Middlesex mm, England 12 mo 5, 1707,received 8mo 29, 1708\n\nMary Camp, w of John Camm, Cork, Ireland m 6mo 23, 1708 received 10mo 31, 1708\n\nElizabeth Jacob,w of Caleb Jacob Cork m 6mo 23, 1708 received 9mo 26, 1708\n\nJohn Peel, unmarried son of Luke Peel, Loughgall Ireland, Ballyhagan, Providence of Ulster, Ireland m 8mo 17, 1708 received 11mo 28, 1708\n\nJoseph Griffith (Griffin),Newark (Kennett) New Castle, Del 4mo 7 1707 received 11mo 28, 1708\n\nSarah Armitt, deceased parents Leek, England m 11mo 21 1702-3 received 11mo 21 1702-3\n\nWilliam Green, unmarried servant Ballycane, Wicklow Co, Ire...6mo 8, 1708 rec 9mo 26, 1708\n\nSusanna Packer, single City of Bristol Bristol m 7mo 13, 1708 received 4mo 24, 1709\n\nLydia Painter, dauof Ann Pusey Chester mm, Pa 8mo 27 1707 received 2mo 29, 1708\n\nGeorge Parker & family Burlington NJ mm 4mo 6, 1709 received 6mo 26, 1709\n\nEsther Parker, Burlington NJmm 6mo 1, 1709 received 6mo 26, 1709\n\nSamuel Combe, Cooper Bristol mm received 2mo 28, 1710\n\nFrancis Chanders, dau Edward & Francis Godwinn, to marry Robert Bonell at Phila 8mo 31, 1707\n\nJohn Sharp, unmarried mm held at home of Thomas Shakle 11mo 8 1707 received 11mo 30 1707\n\nThomas Croxton, unmarried Chester Pa mm 1mo 29, 1708 received 5mo 30, 1708\n\nTrustrum Allen, religious visit from mm Shrewsbury, East Jersey 3mo 3, 1708\n\nSamuel Marriott, unmarried Burlington NJ mm 10mo 6, 1708 received 11mo 28, 1708\n\nJohn Maule, unmarried Lynn, New England mm 6mo 12, 1708 received 11mo 28, 1708\n\nCaleb Jacob, knife cutler Cork, Ireland mm 6mo 23, 1708 received 9mo 26, 1708\n\nJohn Camm, wife+2 children & servants Cork, Ireland mm 6mo 23, 1708 received 9mo 26, 1708\n\nJonathan Coppock, to marry Jane Owen, dau of Griffith Owen from Chester mm, Pa 10mo 27, 1708 received 11mo 28, 1708\n\nJohn Hart, unmarried, Cecil Md mm 1mo 12 1708 at Phila 10mo 28, 1708\n\nRichard Moore, umanrried West River, Md mm 3mo 13, 1708 at Phila 10mo 31, 1709\n\nJoseph Bond,(son of James & Ann Bond of Wrose, near Bradford), wife and child, Brighouse mm York Co, England 6mo 8 1709 received 11mo 26, 1710\n\nChristopher Toppen, Richmond mm, Leyburn, Yorkshire, England 12mo 13, 1707-8 cleared for marriage received 10mo 29, 1704\n\nJames Logan, single, Bristol England m 12mo 9, 1701\n\nNathan Shenton, grocer & family Quarterly m Crosby, Leicestershire, England 4mo 2, 1709 received 8mo 27, 1710. (died soon after arrival leaving 5 children aged 16yrs to 10mo)\n\nHannah Shenton, unmarried Sutton m, Leicester Co, England 2mo 21, 1710\n\nJohn Harper, unmarried Quarterly m at Herring Creek 6mo 2, 1710 received 8mo 27, 1710\n\nChristian Robison, (husband name omited) Abington Pa mm 6mo 26, 1709\n\nJohn Large, to marry Sarah Corker, Falls MM, Bucks Co pa 7mo 7 1709 received 7mo 30 1709\n\nEdward Cadwalader, to marry Rebecca Moore Haverford PA mm received 8mo 28, 1709\n\nSamuel Lewis, to marry Hannah Stretch, Middletown, Bucks Co Pa mm at Phila 8mo 28, 1709 Willoughby Warder jr, Falls mm Bucks Co, PA to marry Sarah Boyer at Phila 12mo 24, 1709-10 Gilbert Falconer, unmarried Cecil, Md mm 9mo 9 1709 received 10mo 30, 1709 Robert Baker, son of Joseph to marry Susanna Packer, dau of Robert received 10mo 30, 1709 James Crawford, unmarried Duck Creek mm 10mo 19 1709 received 11mo 27, 1709 William Lingard, wife Mary Horsleydown, Southwark England m 12mo 1, 1709-19 received 5mo 28 1710 James Langley, unmarried of Rumsey, Southton Co son of Wm Langley, decd Southamton England mm 4mo 14, 1710 received 8mo 27 1710 Thomas Ferris, unmarried (servant of Tho Chalkley) Milverton, Somersett Co England mm 12mo 20, 1709-10 received 7mo 29, 1710 Francis Ferris jr, unmarried (servant to Tho. Chalkley) Milverton mm 12mo 1709-10 signed by Francis Richard Ferris received 7mo 29, 1710 William Dunn, unmarried Lastmaker, son of Tho Dunn Bristol m, England rec 6mo 31, 1713 Owen Roberts & wife Ann Haverford mm 12mo 9, 1709-10 James Steel, unmarried Duck Creek, New Castle Co, Del mm 4mo 18, 1711 Phillip Fauscet, unmarried Briggflats mm hear Selbergh, Yorkshire England 12mo 27, 1710 received 7mo 28 1711 Samuel Hillary, unmarried son of Henry Hilliary of Wexford, Co Wexford, Ireland m 4mo 29, 1711 received 9mo 30, 1711 Samuel Taylor, Abington Pa mm 3mo 28 1711 to marry Elizabeth Robinson at Phila 3mo 1711 Jacob Simcock, Chester mmPA 4mo 25 1711 to marry Sarah Waln dau of Nicholas received9mo 29 1711 Charles Brockden, Middletown mm Bucks Co PA 12mo 7 1711 received 12mo 29 1711 Francis Jones, & family Redstone, Wales mm 6mo 19, 1711 (came there from Pembrodshire, Ireland 3 years previously) received 12mo 29, 1711 Samuel Jones, &wife Haverford West mm (there 2 years, before that in Ireland) received 1711 Peter Wishard, Abington mm Pa 1709 to marry dau of Thomas Betson at Phil 12mo 1700 Thomas Brodgate, son of John Broadgate, Enfield (father a tailor) to marry Christiann Armstrong, relict of Wm Armstrong cert from Tattenham mm 5mo 26 1710 received 10mo 29 1710 Sarah Massey, wife Samuel Massey and dau of Thomas Wight, of Cork Cork Ireland m 7mo18 1710 received 3mo 25 1711 Jane Marriot, wife Isaac Marriot dau of Richard & Jane Marsh Gulershedge, Midlesex Co, England mm 2mo 6 1712 at Phila 1715 request cert to 'return back to Native Country 7mo 28 1716 \"to see her ancient mother\" Joseph Taylor, unmarried son of John Taylor (of Birtchall, near Cork) Leek, Stafordshire, England mm 3mo 3, 1711 received 12mo 29, 1711 Enion Williams, unmarried Choptank mm (m held at Sarah Steevens on Divideing Creek) 2mo 27, 1712 received 11mo 25 1711 John Knight, unmarried son of Thomas Knight (Bandon, Cork Co Ireland) Cork mm 8mo 22, 1711 received 1mo 28 1712 Thomas Bond, unm husbandman London, Eng m 11mo 14 1711 received 3mo 1712 James Lowns, wife & ch. Middletown mm 1mo 31 1712 received 3mo 30 1712 Mark Carleton & fam Mountmellick, Ire mm 4mo 3, 1711 received 8mo 25, 1711 Thomas Barnes, from Brigflats, Yorkshire Eng received 7mo 28, 1711 Aaron Goforth, wife + son Aaron, daus Sarah & Elizabeth HorsleyDown, Southwark, Eng mm 7mo 12 1711 received 4mo 27 1712 children unm Eleanor Davis, unm Sadbury, Gloucestershire Eng mm 12mo 4, 1711 (sister of Elizabeth Howe ll, wife of Reece Howell, of New Town Cheshire, PA)\n\nll, wife of Reece Howell, of New Town Cheshire, PA) James Morris, unm Dublin Ire m 1nmo-7 1711-12 received 5mo 25 1712\n\nPeter Osborne, of Wolverhampton w Judith & ch Rugely, Staffordshire mm 7mo 11 1711 (also mentioned Thomas Nichols, w Mary & ch) received 6mo 29 1712\n\nJohn Carpenter, Wolverhampton, Eng Stafford mm 11mo 7 1711 received 7mo 26 1712\n\nHenry Thompson, Brig House mm Yorkshire, Eng received 7mo 28 1711\n\nWilliam Harvey, maltster Worcester Eng Worcester mm 12mo 8, 1712 received 7mo 28 1711\n\nThomas Speakman, unm Reading mm Berkshire, Eng received 9mo 29, 1712\n\nJames Watson, unm Newcastle Eng mm 1mo 10 1711 received 10mo 26 1712 (formerly belonged to the Sunderland m for 8 years)\n\nJames Hadwin, Kendall mm Westmoreland Eng 4mo 6 1712 received 11mo 30 1712\n\nThomas Cannon, &w Lavington mm, WiltsCo, Eng 4mo 13 1712 received 9mo 29, 1712\n\nJoshua Baker, Waterford Ire m 2mo 13 1712 received 1mo 27 1718\n\nJames Hurd, unm (coming on business) Limington, Somersettshire Eng received 9mo 29 1712\n\nRichard Whitten, Avington mm Pa to marry Elizabeth Jyliff received 11mo 30, 1712\n\nJoseph Low, Newton, Gloucester co mm NJ to marry Elizabeth Taylor at Phila 2mo 25 1713\n\nJohn Shiers, Marsden Lancashsire \" having children \" Eng 2m21 1715 received 6mo 30 1717 (when he is about to return to Eng)\n\nMary Pace, Worcester Eng mm 1mo 6 1715-6 Cert is endorsed :To Mary Pace att Richard Kenerdy at Leverpool By Chester Bagg.\"\n\nWilliam Moore, unm Waterford Ire mm 2mo 13 1712 received 1mo 27 1718\n\nRichard Parks, shoemaker & 2 ch Preparative m Liverpool Lancashire Eng. son of Richard Parks, Swarthmore m in this country; has been widower several years received 2mo 25 1713\n\nRobert Lodge, w and 1 ch Swathmore mm Furness Lancashire Eng received 3mo 29 1713\n\nElizabeth Wartenby, w Edward Whartenby (late of Duckworth intends to travel with her husband to Pa) DevonshireHouse mm London Eng 11mo 7 1712 received 3mo 29 1713\n\nSarah Lee, minister dau William & Mary Lee decd. Two Weeks m London Eng 8mo 20 1712 received 3mo 29 1713\n\nAnn Smith dau John Smith, brazier Wellinborrow m, Northamptonshire Eng received 8mo 1712\n\nRichard Lewis, minister & w , & sons Thomas & James Quarterly m Dolobran, Montgomeryshire Wales 2mo 28 1712 received 5mo 31 1713\n\nJohn Chambers sons John & Wm unm York mm Eng 1mo 6 1712-13 Received 5mo 31 1713\n\nRachel Merrick, unm Frandly mm Cheshire Eng 1mo 31 1713\n\nAbigail Hetherington, unm 1mo 17 1711-12 from m in Dublin, Ire\n\nJohn & David Davies unm sons Richard & Ann Davies of Rhieddallt, parish of Ruabon Denby County Wales 1mo 20, 1712-3 from Namptwich mm Cheshire Eng received 5mo 31 1713\n\nJohn Owen, unm son of Griffith Owen (returns to PA) Hartshaw mm Lancashire Eng received 5mo 1713\n\nRichard Townsend, w Ann Abington mm Pa 5mo 26 1713 received 5mo 31 1713\n\nRichard Sunby, Billater Lane London, son Richard Sunby of Horton Rudly, Yorkshsire, decd tailor Two Weeks m in London Eng 5mo 13 1713 received 11mo 29, 1713\n\nMordecai Moore, to be in Phila during the winter West River Md mm received10mo 25 1713\n\nRobert Hind, w Mary Horsly Down, Southwark Eng mm; 11mo 1712 received 4mo 26 1713\n\nJoseph Cooper, s of Joseph Cooper of Cooper's Point Gloucester co NJ mm 6mo 10 1713 to marry Mary Hudson dau Wm Hudson of Phila at Phila 5moo 31 1713\n\nMartha Zealy, (with bro in PA) Nailsworth mm Gloucester Eng 1mo 9 1712\n\nJohn Wright w Patience & 4 ch Hartshaw mm Lancashire Eng 1mo 1713 received 5mo 1714\n\nWm Clare, w & ch minister Northwich Chester Co Eng Newton mm Cheshire Eng 1mo 2 1713-4 received 5mo 30 1714 (members of Frandley m)\n\nElizabeth Holliday, unm Nailsworth Gloucester co England Painsiorcdk (sp) mm 2mo 8, 1714\n\nMary Dane, unm Nailsworth Gloucester co Eng Tedbury, Glou co mm 12mo 10 1713-4\n\nWm Clifton, w Horslydown mm Southwark Eng 10mo 31 1712 received 4mo 26 1713\n\nJoseph Buckley unm s of Joseph Buckley linen draper decd Two Weeks m London Eng received 1mo 26 1714\n\nJohn Lancaster, unm Mountmellick Ire 4mo 3 1711 received 1mmo 1714 (parents deceased)\n\nHugh Clifton, Wellingborrow Northamptonshire co Eng s of Sherington Buckinghamshire Arthingborrow mm Northamptonshire signed Hugh & Mary Clifton rec, 6mo 1713\n\nMercy Pearce, dau Richard Pearce Aldersgate Parish London decd. Two Weeks m London Eng 6mo 10 1713 received 11mo 29 1713\n\nSamson Cory & w Wootten Vuderedg Gloucester Co Eng Naylsworth mm received 5mo 1714\n\nAbigail Antill, unm Nailsworth mm Cloucester Eng 1 mo 1713 signed by James Antill\n\nJohn Nailer, Radnor pa mm to mary Marry Greenhope 10m 1713 received 7mo 25 1713\n\nBenj. Brian, Burlington mm NJ cert to marry at Phila 5mo 31 1714\n\nJames Logan, Two Weeks Devonshire House London Eng clear to m received 8mo 29 1714\n\nIsaac Barton, unm cutler from Clonmell Six weeks m Killcomonbegg Ire received 8mo 29 1714\n\nDorothy Bumstide, Two Weeks m London Eng 10mo 28 1713 (relative of Dorothy Bunstede)\n\nFrancis Erott, unm rec 11mo 1714 (Wm Erott signed the cert - mother decd)\n\nJoanna Meade, unm late of Collumstock County Down Eng Spirland mm 11mo 1712\n\nAnn chalkley, relict of Robert Chalkley of Spittle Filds Stepney Parish (weaver) Two Weeks m in London 2mo 18 1715\n\nMary Fowler, unm Horslydown mm England 12mo 8 1714\n\nKatharine Martin, dau-in-law Sarah Martin Two Weeks m Bull and Mouth London Eng 1mo 1714\n\nJacob Shoemaker,w Margaret ch Thomas, Jacob & Susanna 12mo 1714-6 received 1mo 1715\n\nWilliam Cumill,Morley, Co York Eng Briggs House mm at Leeds Eng 4mo 14 1714\n\nJonathan Cogshall,ok for marriage to Martha Kite Haverford mm at Phila 7mo 30 1715\n\nJoseph Knight, for mariage to Abigail Antill Abington mm PA at Phila 8mo 28 1715\n\nAlice Goforth, dau Aaron Goforth Horsleydown Southwark Eng 1mo 23 1714-5\n\nGeorge Shiers, unm Brigghouse mm Yorkshire Eng 1mo 1714 received 12mo 24 1715\n\nHugh Parsons, w Jane Bath mm Somersetshire Eng at Phila mm 4mo 29 1716 (certificate produced in the name of Henry Parsons Joseph Buckley, unm returned to Phila Two Weeks m Devonshire House London Eng rec 1716 William Bissell, unm & his 4 ch Dudley co Worcester England Storbridge mm received 6mo 1715 Martha Griffitts, (to join husband) Womans m Cork Ire 6mo 6 1709 John Head, Mildenhall mm Suffolk Co Eng 4mo 21 1717 received 8mo 25 1717 Christopher Penrose, s Robert & Mary unm Two Weeks m Dublin Ire received 8mo 25 1717 Thomas Barger, w & fam Clonmell mmTipperary Co Ire 1mo 1716-7 received 8mo 25 1717 Edward Jones, unm Radnor mm Pa 10mo 12 1717 at Phila 10mo 27 1717 Richard Hough, to marry Deborah Gunly Falls mm Bucks C PA received 7mo 27 1717 John Head, Mildenhall mm Suffolk co Eng 4mo 21 1717 received 8mo 25 1717 Joseph Gray,s of George Gray to marry Mary Hastings Abington mm PA at Phil 7mo 27 1717 Edward Owen, s of Griffith unm Hartshaw mm Lancashire Eng received 11mo 31 1717 Wm Gromett, Wrangle mm Lancashire Eng 1mo 1717 received 2mo 25 1718 Benj. Dickinson, s of Roger and Deborah of Whitby York Co Eng Staintondale mm Scarborough, Eng received 3mo 1718 James Whitton,to marry Katharine Bedwort mm Salem Co NJ at Phila 3mo 30 1718 George Shoemaker, Rebecca Abington mm PA 6mo 1715 received 4mo 1716 Ann Nicholsonn, relict of Michael (carpenter, decd) Savoy mm London 1mo 1715-6 ( of the Parish of Martins in the Fields) John Carver of Byberry to marry Isabell Welden of Phil MM Abington mm received 8mo 1716 Samuel Lewis, s of Israel unm Bridgetown mm Barbadoes West Indies to marry Elizabeth Morris dau Anthony Morris of Phila received 8mo 26 1716 Thomas Griffitts, unm s George Cork Ireland mm received 1mo 29 1717 (also a cert from Kingston, Jamaica m 8mo 1716 Wm Tidmarsh,Chester mm PA 12mo 25 1716 received 8mo 26 1716 Richard Harrison jr, unm West River mm MD 9mo 16 1716 received 3mo 31 1717 Elizabeth Culpin, unm (her master Wm Collard cheesmonger) Two Weeks m, London 7mo 1711 also cert West River Md mm 9mo 1716 Sophia Silverts, Abington mm PA 2mo 1717 (late from Germantown) Walter Long, unm Whitechurch Dorset Co Topham England mm 5mo 1695 (to return to America) Deborah Gumley & ch (widow of John) Duck Creek mm at Phila 7mo 1717 (married Richard Hough at Phila in 1717) Willilam Hinton, unm Nailsworth Eng in Phila 4mo 27 1718 Joseph Wood & fam Mountroth Particular m Ire from Mountmellick m, Ire parchment and glue maker received 4mo 27 1718 Richard Martin, unm Holme mm Kirkbride Cumberland Eng rec 4mo 1718 signed by James & Lancelot Martin Humphrey Norris,unm glazier Bristol England 12m 17, 1717 received 4mo 27 1718 Ebinezer Robison jr, unm brazier Two Weeks m, London Eng2mo 28 1718 received 6mo 1718 Sarah Lloyd, widow Thomas Two Weeks m London England 12mo 17 1717 Peter Lloyd, unm s Thomas merchant (late of London) Bristol m Eng 1mo 3 1717-18 Richard SMith, New Garden mm Chester co Pa mo 11 1818 (he came from RI) William Taylor, saddletree maker Clonmell Co Tipperary Ire m received 5mo 25 1718 Thomas Skelton, unm Carlisle Cumberland Eng m 1mo 24 1716 received 5mo 25 1718 Ann Pyle, widow Concord mm Pa 10mo 1 1718 Elizabeth Tomlinson, unm (lived Southurack MM for 6 yrs) Two Weeks meeting London Eng 1718 James Lloyd, w Ann Dudley mm Eng formerly Bewdley m, Worcester Eng received 3mo 30 1719 Hugh Clifton, unm Abington mm Pa 1mo 30 1717-18 received 3mo 30 1719 Daniel Flexney, unm s Daniel of Burford Witney mm 6mo 11 1718 received 7mo 26 1718 John Wilson, unm about to return to Pa from Hartshow mm Lancashire Eng 12mo 7 1718 Thomas Linsley(Lindley) unm smith Dublin Ire m 11mo 1718 received 7mo 24 1719 Edwawrd Brooks, to marry Elizabeth Snead Abington mm Pa 10mo 1719 at Phila 9mo 1719 Jane Ireland w Nicholas Darby mm Pa 10mo 2 1719 received 9mo 1720 Elizabeth Whartnaby, minister on religious visit Nantucket mm 5mo 27 1719 Hester Kingsley, unm returning to PA from Portsmouth RI mm 6mo 25 1719 Mary Rakestraw, Newton NJ mm 5mo 11 1720 received 7mo 30 1720 Sarah Fisher, Burlington NJ 7mo 1721 received 9mo 24 1721 Elizabeth Teogue, returning from a religious visit traveling with Margaret Pain Quarterly mm Newport RI 1721 Thomas Whitehead, unm s Henry (both Breadstreet London) Two Weeksm London Eng 1719 received 2mo 1720 Hannah Albinson, widow, Abington mm Pa 2mo 25 1720 John Browne & w Barking mm Essex Co Eng 5mo 4 1718 received 3mo27 1720 Burlington mm NJ 3mo 2 1720 Joseph Elgar & w Margaret Folkstone Co Kent Eng 2mo 12 1720 received 7mo 30 1720 (cert. signed by John Elgar Sr, Margaret Elgar and Mary Elgar Samuel Overton Jr, unm (trade voyage to America) Coventry mm Warwick Co Eng 8mo 7 1719 signed by Samuel Overton sr & Mary Overton Elizabeth Large, Falls mm Bucks co Pa 6mo 7 1720 received 6mo 26 1720 William Dunn, unm Burlington mm NJ (cert addressed to Friends City of Bristol] Land\" received 9mo 25 1720 Thomas Pennington, to marry dau James Steel Abington mm PA received 4mo 30 1721 John Lawson, professed minister of Nailsworth, England] (was at Philadelphia 9mo 24 1721 but not bringing a certificate of removal, he is not received a member of the Phil. mm) Mary Ellis, Chesterfield mm, Burlington co NJ 12mo 2 1720 John Reeves, Scarborough mm Whitby York Co Eng 1mo 1 1719-20 Mary Tompkins, relict of John decd + her son John Two Weeks m London Eng 6mo 15 1720 Thomas Denham, unm Bristol Eng mm received 6mo 25 1721 Amy LIberty, unm Market street mm Hartford Co England (also a letter from George Chalkley jr of Edmonton ,her kindsman) she married Joshua Lawrence at Philadelphia 1722 John Stamper, young man Pardshaw Cragg mm Cumberland Eng received 4mo 28 1723 Samuel Boulton w & fam Abington mm PA 2mo 30 1721 received 3mo 25 1722 Thomas Oliver, unm Dolobran Wales mm 12mo 25 1723 received 4mo 26 1724 Joseph (husbandman), Joshua, Ann & Rachel Richardson...siblings all unm Richmond mm Chantrey York co Eng 12mo 70 1723-4 received 4mo 26 1724 Edward Horne, w Elizabeth (a minister) Quarterly m Horsham, Sussex Co Eng 10mo 10 1723 received 5mo 31 1724 Ralph Hoy, unm (an Irishman) Richmond mm Chantrey York Co Eng received 12mo 25 1725 George & Elizabeth Deeble +ch of Richard Deeble of Cork, decd. Cork m Ire rec 6mo 31 1722 9 (2 of the children were George and Elizabeth who went with a younger sister) Mary Miller,(widow of James +s James Carlisle mm Cumberland Eng received 9mo 27 1724 Wm Sanders, unm Two Weeks m London Eng (returning to Philadelphia) 5mo 29 1720 Griffith Owen, Two Weeks m London England 12 mo 22 1724 (returning to Philadelphia) Esther Tomlinson, unm Darby mm. PA 11mo 3 1721 Joseph England, sr to marry Elizabeth Brown Duck Creek Del mm received 11mo 26 1721 Sarah Griscom,Newton mm JN 12mo 12 1721-2 received 8mo 25 1723 Samuel Ogden,w Hesther Chester mm PA received 1mo 30 1722 Mary Oldman, Darby mm PA 1mo 1 1722 received 1mo 30 1722 Hannah Coffin, Newton mm NJ 1mo 12 1721-2 received 1mo 30 1722 Isaac Marriot, w Jane Hendon mm Middlesex Eng 1mo 7 1722 John Smith, unm Salem mm 1mo 26 1722 at Philadelphia 12 mo 23 1721 Wm Garrett, Darby mm PA 5mo 4 1722 5mo 27 1722 Mary Preston, Wm & Jane Merion mm PA received 6mo 31 1722 Francis Burd, unm Chester mm PA 11mo 28 1722-3 Martha MacDonnell, Chester mm PA 3mo 27 1723 received 3 mo 31 1723 Mary Cooper, widow Falls Bucks Co mm PA 4mo 5 1723 received 6mo 39 1723 Hannah Alberson, Haddonfield mm NJ (earlier from Byberry mm PA) at Phila 3mo 31 1723 Ann Roberts,Susanna Morris on religious visit from Nansemond VA 6mo 13 1723 Ann Clifton,unm Dublin Ire mm 2mo 1724 (returning to Phila from a visit to Ireland) John Benson, w Mary +fam Frandley mm Cheshire Eng 9mo 26 1725 Ann Farmer, dau John and Mary Saffron Walden mm Essex co Eng received 7mo 24 1725 Lettice Swift, unm (servant for several years of John Fream) Endfield mm Middlesex co Eng received 3mo 27 1726 Rebecca Gray, d of Thomas Ratclife mm London Eng 2mo 1 1725 received 3mo 27 1726 Lloyd Zachary, unm Two Weeks m London Eng 5mo 1725 returning to Philadelphia) Mary Gray,widow Abington mm PA received 9mo 29 1723 Sarah Worthington, w of Daniel Haverford mm PA 1723-4 received 2 mo29 1726 Daniel Evans, w Emin (a minister) Abington mm PA 2mo 1724 received 3mo 29 1724 Edward Beakes, unm Chesterfield mm Burlington Co NJ 4mo 1724 at Phila 1724 Elizabeth Large, widow Chesterfield mm NJ 4mo 4 1724 at Philadelphia 3mo 29 1724 Mary Roberts, Radnor mm PA 7mo 10 1724 Hannah Brintnall, Burlington mm NJ 1mo 1 1724 received 6mo 27 1725 Ann Tatnell, widow + son Quarterly m Leicester Eng 1mo 26 1735 Thomas Chalkley, traveling minister Bridgetown mm Barbadoes 3mo 15 1729 William Callender jr, unm (on business) Heathcot's Bay mm Barbadoes 3mo 21 1729 Hannah Esther Woolman, dau John decd (of Burlington) Burlington mm NJ 5mo 7 1729 Geo Francks &w Elizabeth Abbington mm PA 5mo 28 1729 (she brought her cert from Eng) Wm Litgreaves &w, Bull and Mough mm London Eng 5mo 1729 received 6mo 1729 Lettice Hatton, unm Dublin mm Ire 5mo 1729(7 years a servant) father dead received 2mo 1730 John Low, unm serv to R. Greer & s John Lurgon mm Antrim Ire (before that Grange m Charlemount Armagh Co, Ire Ann Goodbody, Dublin m Ire 5mo 29 1729 received 10mo 26 1729 Ann Cunningham &niece Ann, unm (Ann 16 yoa and to be apprentice or servant to Thomas Millhouse & w. Also Elizabeth and Mary Cunningham, young sisters of niece Ann go with her) Dublin m Irelang 5mo 29 1729 received 10mo 26 1729 Mary Boyes, d Jacob & Lucy Turner (married to John Boyes Lurgon Ire 1720) Lurgon m Ireland 5mo 30 1729 Jane, Ann, Elizabeth, Sarah, John, Jacob Thoas & Saml. Turner signed cert) Anthony Morris, unm nep Wm Morris returning to PA Heathcotts Bay Barbadoes 6mo 1729 Wm Williams, Gwynedd mm PA 8mo 1729 to marry Hannah Carver at Phila 1729 Rose Bethel, widow John Darby mm PA 10mo 3 172 received 10mo 26 1729 Joseph England, Duck Creek mm Del 11mo 19 1729 to marry Sarah Gates, w Josiah (coming to live with husband) Poole mm Eng 11mo 1729 received 1733 Saml Emly, returning Two Weeks' m London Eng 1mo 16 1729 Wm Sandwith, unm Dublin m Ire 1729-30 & cert Coledine m Ire 1729 (where he has served his apprenticeship - \"now taken to seafaring\") received 8mo 27 1727 Ann Dudley, unm Bristol m Eng 11mo 19 1729 received 2mo 24 1739 Dinah Bushly, unm Dublin m Ire 3mo 6 1729 received 4mo 26 1730 Eunice Conolly unm (with mother, relatives & friends) Dublin m Ire received 1mo 27 1730 Mary Bones, unm (of Coverleys field Stephey) Two Weeks' m London Eng received 1mo 1730 Hannah Hudson, unm Dublin m Ire 4mo 2 1730 (went to Pa about a year ago) Rachel Hearon, unm Newcastle mm Eng 4mo 1723 has written from PA for a cert received 1730 John Sparrow, unm s of Anthony of near Sudbury Eng Two Weeks m Devonshirse HOuse, London Eng 6mo 17 1730 received 10mo 25 1730 Nathaniel Jenkins &w cordwainer Bristol m Eng 12mo 1730-1 received 5mo 30 1731 Wm Nicholson, unm neph of Joseph decd (aunt alive) Dublin m Ire received 7mo 29 1723 John Hillborne, Wrightstown mm Bucks Co PA to marry Rachel Strickland dau Miles received 7mo 29 1732 John Oxley coming on business Quarterly m Barbadoes 2mo 1730 received 7mo 1730 Emme Evans, 3 certs - Perquimans mm NC - Nansemond mm VA 1730- Curles mm Henrico Co Va received 11mo 29 1738 Mary Jervis, Burlington mm JN 9mo 9 1730 received 5mo 30 1738 Alice Paxson, Abington mm PA 10mo 28 1730 received 2mo 30 1731 John Dillwyn to return to Phila Horsleydown Southwark Eng 11mo 6 1730 Isaabel Daniel, unm Salem mm NJ; 11mo 26 1730-1 received 12mo 26 1730 Ann Evans, Chester mm PA 11mo 25 1730-1 received 11mo 29 1730 Hannah Baldwin, unm Chester mm PA 11mo 25 1730-1 Mary Shute, dau Thomas of Melksham Eng tallowchandler 1mo 6 1731 Armiejer & Thomas Trotter unm Chuckertuck mm Va received 5mo 30 1730-1 Charles Norris, (returning) Bridgetown mm Barbadoes 1mo 1730-1 received 3mo 1731 Stephen Payton, Dudley mm Worcester co Eng 5mo 1731 (trading voyage) received1731 John Stanes, unm Two weeks meeting Devonshire London Eng (now in PA) He was \"too unadvisedly involved n a law suit and the disadvantage sustained thereby we suppose was the occasion of his removal\". received 5mo 30 1731 John Kinsey & w Woodbridge mm 11mo 21 1730 Benjamin Lay, minister &w Sarah, Colchester mm 12mo 1731 received 5mo 1732 Lawrence Growden, unm Bristol mm England 12mo 14 1731 Samuel Floyd, unm Barbadoes m (comes to Pa to trade) received 6mo 25 1732 Edward Walbank &w, Bull and Mouth m at the Chamber in Grace Church Street London Eng (came to London ca 1715) Received 1732 Samuel Sanson, unm Two Weeks m Devonshire House London Eng received 11mo 1732 Edward Walbank & w, Bull and Mouth, Chamber in Grace St London Eng 1732 (they came to live in this city [London] about the year 1715 received 6mo 25 Thomas Penn, unm Two Weeks m London Eng 3mo 1732 received 6mo 1732 (s of WM Penn) Elizabeth Hawkins, unm Dublin mm Ire 2mo 6 1731 received 5mo 30 1731 Sarah Smith,unm Dublin m Ireland 11mo25 1731 received 4mo 30 1732 Benj. Tomlinson, w Mary Horsleydown mm England received 1733(been in PA for 4 years) Ruth Steer jr, unm Six weeks m Lisburn North Ire 3mo 23 1734 signed by Ruth Sr Isaac, Catharine, Mary & Richard Steere received 2mo 26 1735 Thomas Chalkley, \"commander of the Barbadoes Pacquet\", intending to return to Philadelphia Dublin mm Ir 5mo 1734 John Miller, + s & dau staymaker Westminister mm at the Savoy London Eng. 8mo 4 1732 John Richardson, unm (previously lived for some time in PA before returning to his 'native country' received 12 mo 22 1733-4 Giles Brimble, unm \"now in Phila\" Bristol m 7mo 24 1788 received 8mo 25 1734 Paulus Kripner, no m named on cert received Phila 7mo 27 1734 (had been in several countries) Joseph Saunders, unm neph of Richard Two Weeks m Bull & Mouth London Eng 12ni 12 1732 \"lately gone on shipboard, intended for Pensilvania\" received 4mo 28 1734 Patrick Ogillsby, Westbury mm Long Island 6mo 1734 received 9mo 29 1784 Ann Penly, dau John & Mary decd Cirencester mm Gloucester Co received 4mo 1735 Rachel Allen, unm servant- to join b Joseph and s Ann Unthank in Phil. Scarborough York Co mm Eng 2mo 1 1735 received 8mo 31 1735 Thomas Williams w Mary (ch in Phila...son Thomas decd there, leaving widow and several ch) Austle m 9mo 19 1735 Stephen Payton, on trading voyage lives Dudley Eng Stonesbridge mm Worcester Co Eng 12mo 16 1735 received 9mo 26 1731 Isaiah McNiece, widower (to live with children in PA) Copte Hill m Cavan Co Ire received 1736< David Clarke, unm s of John and Mary, decd of Nailsworth Paynswick mm Gloucester Co 1735 received 7mo 24 1736 John Paterson, living in Pa now wishes a cert to marry Dublin mm Ire received 8mo 1736 Dr Samuel Chew w Mary now in Phila Cliffs mm Western Shore MD receuved 5ni 30 1736 Samuel Walker, unm Richmond mm Yorkshire Eng 4mo 1735 received 10mo 31 1736 Robert Strettle, w + ch Amos, Francis and Ann (all unm) Horslydown mm Eng 11mo 25 1736 received 4mo 24 1737 John Glenny, unm Henly upon Thomas mm Oxon Co Eng (formerly from \"North Brittaine\") 3mo 4 1736 received 7mo 24 1736 John Bushell, unm Bridgetown mm Barbadoes 3mo 12 1737 received 4mo 24 1737 Leonard Snowden, unm (schoolteacher) Scarborough mm Staintondale Yorkshire Eng 12mo 1 1736-7 received 6mo 26 1737 Lewis Weston, unm b of Daniel Two Weeks m Bull & Mouth London Eng received 5mo 29 1737 William Bennett, unm late of Collum Stork Devon Co now in PA 5mo 25 1736 John Luke, unm s of Jacob Bridgetown mm Barbadoes 8m 1738 received 11mo 26 1738 James Hill w Margaret Oliver Hill Preparative m Balanderry Ire (lately removed to settle at Willingstown New Castle Co 5mo 21 1728 received 10mo 29 1738\n\nw Margaret Oliver Hill Preparative m Balanderry Ire (lately removed to settle at Willingstown New Castle Co 5mo 21 1728 received 10mo 29 1738 Benjamin Callender, unm (for trade) Bridgetown mm Barbadoes received 2mo 28 1738\n\nElizabeth Deane, unm Bellnacree m Antrim Co Ire 2mo 10 1736 received 6mo 28 1736\n\nWilliam Callender, Heathcot's Bay mm Barbadoes (returning to PA) received 4mo 29 1733\n\nJohn Armitt, (returning) Two Weeks Mtg Devonshire House London= Eng 3mo 17 1736\n\nMartha Walker +dau Rebecca Richmond mm Yorkshire England 1mo 3 1737-8 received 1738\n\nSarah Wilcocks, w of Issachar Mountrat m Ire 1mo 27 1737 received 11mo 27 1737 (now in PA with said husband - 'marry'd by priest')\n\nJoseph Marshal, unm Mansfield Mansfield m Eng 5mo 1737 ( s of Ralph & Mary?)\n\nElizabeth Mifflin, lately married Boston mm Mass received 10mo 30 1737\n\nMary Sharp ( to join husb James in Phila) Dublin mm Ire 1mo 28 1738\n\nPaul Chanders &fam (already in Pa) Hartshaw mm Lancashire Eng 7mo 19 1738\n\nBenj Callender, unm on trading voyage Bridgetown mm Barbadoes 3mo 17 1739\n\nThomas Rooke, unm granson to George of Dublin Dublin mm 1mo 12 1739-40\n\nJoseph Saunders, unm returning to PA 1mo 8 1735-6 received 4mo 28 1734\n\nRachel Spence, unm servant at Manchester Warrington mm Lanc. Eng received 12mo 1738-9\n\nJane Shalley (\"hath acquainted us of her husbands intention to move here and the rest of his family to PA\") Boston mm Mass 6mo 1729 received 7mo 29 1729\n\nHugh Canady, & fam (w decd) Men's m Charlemount Ire 2mo 3 1741\n\nJohn Ambler, unm Joseph of Selby Eng (both shopkeepers, s qualified as a \"Scholar to practice keeping a School for the Languages & for Writeing and Accompts\") Shelby mm Yorkshire received 10mo 26 1740\n\nJoseph Saul, unm Wheelmaker Pardshaw Hall mm Cumberland Eng received 3mo 22 1741\n\nJames Moore, widower Waterford m Ire 1mo 1740-1 received 5mo 31 1741\n\nIsaac Whitelock, Brighouse mm Leeds Eng (to return to PA) 12mo 1740-1 received 5mo 1741\n\nJoseph Deane, unm s of Alexander (having been in Pa before) received 7mo 21 1741\n\nJoseph Stiles, s of Benj & Lucy (m decd) of Newbury Berks Co Eng (he chose a \"seafaring life\") cert signed by Henry Stiles received 10mo 25 1741\n\nJohn Robins, unm (in Pa) Two Weeks m London Eng 3mo 25 1741 received 9mo 27 1741\n\nJoseph Garnett, unm Dublin m Ireland at Phil 10mo 1742 (he is reported to have returned to Dublin)\n\nElizabeth Johnson, unm(bro Ralph Loftus in PA) Sunderland mm Durham Co Eng received 8mo 1742\n\nJohn Oxley, voyage to Pa for his health 2mo 7 1743\n\nThomas Robinson, unm Dublin m Ireland 2mo 1 1738 at Phila 6mo 31 1739\n\nJohn Bringhurst jr (returning to native land) Bridgetown mm Barbadoes 2mo 11 1738\n\nSamuel Shoemaker, returning from London Eng 5mo 29 1745\n\nGeorge Mifflin returning from London Eng 5mo 29 1745\n\nJoel Neave, unm Two Weeks m London Eng 7mo 27 1742 received 11mo 28 1742\n\nJesse Bourne, unm glover s of London, also a glover trade voyage Two Weeks m London Eng received 4mo 24 1743\n\nJohn Body, unm Swinnithwait mm Richmond Yorkshire Eng 6mo 1743 received 12mo 1743\n\nJohn Shaw w & fam Maidenhead mm Berks co Eng 6mo 6 1745\n\nFrancis Nash, unm Leominister mm 5mo 10 1746 received 10mo 26 1746\n\nSamuel Bryan, unm returning to PA from London Eng received 8mo 29 1742\n\nWm Dickenson, unm Pontefroct mm Lanehead Yorkshire Eng 6mo 14 1746 signed by Elihu Dickenson, Clerk, Samuel Dickenson and Elizabeth Dickenson\n\nWm Griffitts, unm Swanzey mm 5mo 19 1746 receuved 10mo 26 1746\n\nJoshua Crosby, & neph Thomas (both unm) Jamaica Feb 1746 at Phila 6mo 29 1746\n\nJohn Haydock, unm s of Robert (now in PA but from Eng) Flushing mm Long Islan at Phil 1747\n\nJohn Langford Redwood s of Abraham Newport RI mm received 9mo 1747 (father places him in Philadelphia for a few years)\n\nMehitable Redwood father Abraham sends her for her improvement RI mm received 8mo 1747\n\nDavid Dean, unm Antrim m Ire 2mo 1747 received 10mo 25 1747\n\nDr Robert Willan, unm (to keep Friend's School) Scarborough m Staintondale Yorkshire Eng received 6mo 26 1748\n\nJohn Williamson, unm Blacksmith & farrier Pardshaw mm England 3mo 1748 received 1748\n\nBenj Bagnell jr &w Ann (both in Phila) Boston mm Mass received 12mo 24 1748\n\nMartha Petel Lynn mm Mass 10mo 1745 received 1mo 1748 (Moved from Lynn 6 years ago)\n\nRebecca Wardell, (moved from Boston with her husband) Salem mm New England received 7mo 21 1745\n\nRobert Strettell, unm Dublin m Ire 1mo 18 1745-6 signed by Thomas Strettell Jr\n\nSophia Hume, widow returning to SC Devonshire House mm London Eng received 5mo 29 1748\n\nJohn Luke (voyage to recover health) Bridgetown mm Barbadoes received 10mo 29 1749\n\nJames Pemberton, returning from London Eng 5mo 24 1749\n\nCharles Norris, about to return Grace Church St m London Eng 7mo 18 1749\n\nJoseph Parker, unm Grace Church St m London Eng 7mo 30 1749 received 1mo 29 1745\n\nJohn Davis, Grace Church st m London Eng 8mo 1749 received 1mo 29 1749\n\nPatience Richardson unm Dublin Ire 6mo 28 1750 received 12mo 27 1751\n\nSarah Hide d Edmund & Sarah Two Weeks m London Eng 6mo 1748 received 4mo 30 1749\n\nJohn Davis, unm Horsleydown mm Sourhwark Eng 12mo 1748 received 3mo 26 1749\n\nElizabeath Gridly, serv of Thomas & Elizabeth Gray of Godmanchester - moving to her \"Uncle Samuel Gridley \" Ives mm Hentingdon Co Eng 6mo 1 1749\n\nJames Wagstaff member of Peel mm, now in PA b of Thomas Wagstaff Two Weeks m London 1mo 19 1749 cert signed by William, Thomas and John Wagstaffe\n\nSarah Knubley (Knably) dau of John decd sent to WM & Jane Hinton as \"your brothers dau\" Beckfoot Foull Wath Particular m, Abby HolmCumberland Co Eng received 2mo 1745 Mary Glading, d of Richard and Ann removed herself as servant to Gervas Burgess in PA Hertford mm Eng 1mo 5 1749 received 7mo 28 1750\n\nWilliam Nicholls Horseleydoen mm Southwark Eng 12mo 8 1748\n\nWm Shipley jr w & ch John, Jacob and Susanna (unm) Cooledine mm Wexford Ire 2mo 1750 received 6mo 31 1750\n\nThomas Davis, Dacer Westmoreland Eng 12mo 5 1750 received 5mo26 1751\n\nAugustine Meller Spightstown mm Barbadoes 12mo 28 1750\n\nJohn Nevitt (on trip with brother & to return home) Moat m Ire 2mo 1751\n\nJohn Tagart w Mary Lurgan m Ire 5mo 11 1750\n\nRebecca Richardson, widow of Zachary & dau Elizabeth Clark (to return to PA) Horsleydown mm Southwark Eng 8mo 6 1746\n\nMary Erwin, to be with husband John Dublin m Ire 4mo 1739 received 12mo 31 1756\n\nElizabeth Little, unm (servant in Dublin) Dublin m Ire 1mo 12 1750\n\nJohn Willson, schoolmaster unm Ackworth mm Eng received 10mo 28 1750 \"now usher of Friends School in this City (Phila)\"\n\nJosph Mickle, on business Dubliln mm Ire 4mo 1750 received 2mo 26 1751\n\nJohn Wyley on business Dublin m Ire 4mo 1750 received 2mo 26 1751\n\nDavid Beavirge, Edinburgh mm 11mo 31 1750-1 received 5mo 26 1751 (with consent of parents)"}, {"url": "https://www.friendsjournal.org/philadelphia-quaker-businesses/", "page_content": "\n\nW hen my granddad on my father’s side, William Elkinton Evans, passed away in December 2008, he left a letter addressed to each and all of his grandchildren; the letter had been transcribed by our grandmother, Lucretia Wood Evans. In it he said that we might someday learn the history of our family’s businesses and the work that they did, grounded in Quaker spirit with benefits to employees and consumers alike.\n\nMy original research on Quaker businesses was done for a class on Quaker social witness taught by Bridget Moix at Haverford College, with the hope of coming to a better understanding of my family history. The excerpts that follow look at two Philadelphia-based business people whose work philosophies I still see in my family and, I believe, can still be carried by Quakers and others into the workplace today. The first of those is Joseph Elkinton (1794–1868), and the second is Thomas Pim Cope (1768–1854).\n\nJoseph Elkinton founded the Philadelphia Quartz Company. A passage from Robert Lawrence Smith’s A Quaker Book of Wisdom explains how this company’s business practices made them a model for Quaker business:\n\nIn the 1920s, in an effort to emphasize equality, the directors decided that all employees—from the lowest level to the president—were to be referred to by their initials. And all employees, including the president (known to his employees as T.W.E.), began receiving the same annual bonuses. The company’s board of directors established a fund to benefit widows or widowers of employees, and their Labor Reserve Fund provided pensions when people retired, years before Social Security came along.\n\nMentioning profit sharing and the company-wide salutation “Respected Friend,” the passage also explains the practices of a chemical company that had been founded by Elkington in 1831 as a soap and candle shop.\n\nIt is important to acknowledge the role that Quakerism played in the life path that led Elkinton to begin the original business. The Philadelphia Quartz Company would not have existed for around 200 years had Elkinton not left a silversmith apprenticeship, and the presumed comfortable life that career would have brought, to pursue something more in line with his values.\n\nWilliam Bacon Evans’s Dictionary of Quaker Biography speaks of Elkinton’s experience as a young man. When he was 22, Joseph decided to abandon the silversmithing career because as Evans says, “Joseph found that calling unsuited for him as a Quaker.”\n\nIt seems likely that the job did not seem to sit easy with him in regard to the Quaker value of simplicity. In 1816, he went to establish a school on a Native American reserve. While the endeavor was not necessarily successful and certainly has politically contentious elements that we recognize today (see Paula Palmer’s “Quaker Indian Boarding Schools” in the October 2016 Friends Journal), it is clear that his faith had influenced him strongly enough to forgo a comfortable career in order to teach and live among a community perceived as needy.\n\nYears later, upon his return home to Philadelphia, he started his candle and soap making business. It was a venture providing a basic need and improved quality of life through simple means. A pamphlet released on the company’s 150th anniversary describes how he was “moved to engage in a simpler and more basic trade because of his deep-seated spiritual and religious conviction.” The anniversary pamphlet is named A Proper Concern, inspired by the phrase found in a letter from Joseph Elkinton to his son Joseph Scotton Elkinton. This brings us to our first major philosophical point. In this letter, Elkinton told his son:\n\nThy account of the business is very satisfactory and I may say to thee my son I have entire confidence in thy intention to do the best thou canst, and have no doubt thou wilt be able to get along to thy own satisfaction and mine also, as thou continues to dwell under a proper concern for the best things.\n\nThe last phrase illuminates the way that business was conducted. In what I would claim as the spirit of continuing revelation—the idea that the most effective expression of our values must be rediscovered with new, ever-evolving circumstances—the business was to be held under an attentive eye with a mission to pursue the best things. If the oceans of light and darkness are constantly flowing and shifting, then the ways to exist in and contribute to the ocean of light are as well.\n\nD uring this same era, Thomas Pim Cope was working to turn Philadelphia into a bustling port city. He also held a great concern for the improvement of the quality of life of all those who lived there. In the introduction to his published journal, Philadelphia Merchant: The Diary of Thomas P. Cope, 1800–1851, he explains:\n\nHe had always assumed, as had the prominent Philadelphians he had admired in his youth, that it was his obligation, as well as his pleasure, to devote himself, and at least some of his wealth, to the well-being of his adopted city.\n\nAmong those prominent Philadelphians were numerous Quakers including a clerk of Philadelphia Yearly Meeting, John Field, who Cope speaks fondly of as he recounts his early career. Cope’s journal entry from December 25, 1846, when he was 78 years old, recalls the beginnings of his business career. Like Joseph Elkinton, he faced a career-determining moment early in his life. As his first venture, he began doing business with his uncle Thomas Mendenhall, “literally without one cent of capital.” His uncle engaged in a “wild scheme of speculation in scrip of the First Bank of the United States” and pressured Cope to engage in speculation as well. He declined, saying he was not “willing to hazard my own character and the property of others who had trusted us in such a lottery.” When he found out his uncle had proceeded with the speculation using the name of the firm that they were partners in, he sought legal help from his future father-in-law, John Drinker, and the clerk of Philadelphia Yearly Meeting, John Field.\n\nThis was just the first in a lifetime of business decisions made on the thoughtful basis of maintaining integrity. A profile done on Cope in Hunt’s Merchants’ Magazine and Commercial Review in April 1849 revealed his character: “he could not justify to himself any undertaking which, built on the confidence of his contemporaries, should so abuse that faith as to make the chance of his own prosperity the means of injuring his friends.” To risk the suffering of others for the sake of personal gain was unacceptable.\n\nCope made sure to maintain a good portion of involvement in merchant affairs. His concern lay in determining how he could be of best use to others. He recognized the large interdependence among those within his financial sphere of influence. Many times he was offered, encouraged, and sometimes pressured to abandon his trade networks for positions in the government. This excerpt from an obituary offers a glimpse at his rationale for refusing the positions:\n\nHe had a reputation, a position, made as a merchant, which promised him even larger opportunities for usefulness while it had engagements and obligations which he could not neglect or sacrifice.\n\nAs evidenced in his journal, Cope spent considerable time weighing the options each time he was offered a new position. In November 1807, when considering a position in state legislature, he poses a query unto himself:\n\nIf the principles of Quakerism rest in the immutable basis of truth & justice, as I trust they do, why not disseminate them? Why not carry them into the public councils of the country?\n\nHe was facing a concern from Philadelphia Yearly Meeting, which did not approve of its members serving in the public sphere, and he had to weigh his options: “On the one hand, I am much urged to serve, while on the other, if I give my consent I shall not be supported by some Friends who express great respect for me.” Ultimately, he determined that he would be of most use if he continued to conduct his work as a private citizen influencing public affairs, with the exception of short stints on the Philadelphia city council and in the Pennsylvania legislature. As his obituary resolves, “Though he remained out of congress, he did better service in executing enlarged plans of commerce, productive of public as well as private good.”\n\nHis most known venture was the line of packet ships, the first fleet of ships to make regular trips between Philadelphia and Liverpool. These businesses were so vital for the prosperity of the city that he could not in good conscience let go of the management of such affairs in order to accept positions of honor.\n\nQuaker social witness requires reflection on whether we choose something because it will afford greater recognition or because it will allow us to be of better use to others. Cope embodied the virtuous choice “by declining all honors which must withdraw him from an immediate supervision of an extensive mercantile establishment, upon which so much more than his own direct interests depended.”\n\nThere are two adjectives that find their way into the conversation about a person’s purpose: “useful” and “worthy.” To be useful and to lead a worthy life are intentions that have driven my family in their career choices. To be of the most use is vital to living a worthy life. In his letter, my granddad stated that he hoped that we would each “lead a worthy life.” Accordingly there is an emphasis placed on education as the means by which someone is able to produce their most useful ends.\n\nW hile I am still unclear of the direction my own life and career, I have faith that these principles can guide me. I want to create spaces of collaboration, free of violence, which produce shared prosperity. It is a constant dialogue between deciding what work most urgently needs to be done, what work I would enjoy, and what work I would be most useful doing. Do I study law to systematically defend human rights? Do I go into business that intentionally seeks to direct wealth to capable humans who have been marginalized? Do I try to do whatever makes me the most money so that I can redirect that wealth toward worthy causes? Do I travel the world to develop policies that shift our world toward clean energy or effective, peaceful global governance? There are pros and cons to each choice.\n\nThere are contentious life-altering decisions to be made, akin to the family’s decision in 2005 to relinquish ownership of PQ Corporation, successor to the Philadelphia Quartz Company. Our family now faces a learning process to figure out how to use resources in a socially responsible manner without the framework of the familiar business model. It’s a challenge that many Quaker family business owners increasingly face.\n\nThe grandmother who transcribed the letter, Lucretia Wood Evans, was distinguished in Quaker service herself, working with American Friends Service Committee following World War II. She envisions the progression of the family as she speaks of her four children:\n\nThey, today and together with their spouses are living their own lives in worthy ways, serving others in need, and nurturing and educating their own growing children—our eight grandchildren!—in preparation for living worthy lives of their own.\n\nSo from Thomas Pim Cope and Joseph Elkinton to my grandparents, and present in my family now, the principle of living a worthy life continues through the generations. Creative, useful ways are sought to express the best of Quaker faith, whether through business, medicine, art, service, education, direct action, or other means, a responsibility is bestowed upon our generation to act with intentional care and concern. As the end of my grandparents’ 1967 Christmas letter read, “All too often we fall short of this goal for peaceful living in our own lives, but we shall keep striving toward it.” Our lives can seek out the still, small voice and attend with proper concern to being of great use. It seems that should be deemed a worthy life."}], "Mayhew Foster was educated at the Quaker school in Tottenham.": [{"url": "https://tottenhamquakers.org.uk/history/", "page_content": "Quakers and education\n\nQuakers in general, and Tottenham Quakers in particular, had a long interest in education. When George Fox visited Tottenham in 1689 he held Meetings in a school for women at High Cross, run by Bridge Austell.\n\nWhen negotiations were in progress for the possible building of the first meeting house, the presence of two well-established Quaker schools was presented as additional reason for the Meeting to continue. These schools belonged to Richard Claridge and Alice Hays and were situated in Old Ship Yard at High Cross.\n\nJosiah Forster (1693-1763)\n\nJosiah Forster came to settle in Tottenham in 1751 with his second wife Jane and their eight children. Their last child, Priscilla, was born in Tottenham. Josiah had taught at the Friends’ school at Clerkenwell and run his own school in Coventry and later Birmingham\n\nIn 1751, Josiah bought a large mansion on the north side of Tottenham Green, Reynardson House. This served as the family home and as the school he opened in 1752, Forster’s School (a boarding school for boys). This began the long connection of the Forster family with Tottenham.\n\nReynardson House was a spacious, brick-built house standing in grounds of about thirty acres. It was originally built in 1590 and was home to Albert Reynardson, Mayor of London.\n\nForster’s School quickly became well established and Quakers from all over the country sent their children here. The school room was held in what had originally been the ballroom (about 20 by 30 feet).\n\nJosiah died of consumption in 1763.\n\nJane Forster’s School for Boys\n\nFor some time before Josiah Forster’s death his wife Jane ran the school. Their son William (1747-1824) later took over the school until shortly after his marriage to Elizabeth Howard in 1781. The school was then run by Thomas Coar, a Yorkshireman who came to Tottenham in 1779.\n\nThomas Coar lived in the Old House (Coar’s House; later known as Eaton House) on Tottenham Green (the site of the old Town Hall, now used as the Citizens’ Advice Bureau. It is likely that Thomas moved the school to his own house.\n\nUnder Thomas Coar, the school flourished, continuing to uphold the fine reputation it had first gained under Josiah Forster.\n\nThomas married Priscilla Forster (Josiah Forster’s daughter) in 1784 and so became even more closely involved with the Forster family.\n\nUpon his retirement (around 1826) Thomas gave up the school to his nephew, Josiah (grandson of the school’s founder). Josiah was already running his own school in Southgate and he moved this school to Tottenham, teaching there until his retirement in 1826. At this point the school was closed.\n\nEagle House\n\nAnother private Quaker school in Tottenham opened in the early nineteenth century. It was a preparatory school for boys aged five to ten. This was run by Deborah Forster (daughter of Josiah Forster who founded Forster’s school). Thomas Coar’s daughters, Frances and Priscilla, both taught at the school. It is unclear whether the school was held on the premises of Coar’s school or in Eagle House.\n\nEagle House stood on the Green between Old House and Grove House. There were twenty boarders and some day pupils. The day pupils were not the sons of Friends, but attended Tottenham Church.\n\nFrances and Priscilla were described as “kind, calm and considerate; Frances had little sense of humour but was sensible and Priscilla made hasty judgments”. Both were strict disciplinarians, but punishments were mild, the severest being to sit still and silent for half-an-hour at playtime. The boys engaged in plenty of outdoor activities; they played ball games, flew kites, tended small gardens and walked across the fields to Bruce Castle and Mount Pleasant. As a treat the boys went “down Tottenham to buy skipping ropes and small coloured cakes from the shops”.\n\n(Theodore Compton 1893 Recollections of Tottenham Friends and the Forster Family)\n\nGrove House School\n\nIn 1828 Grove House School was founded by Thomas Binns, who served as the first headmaster. It replaced Forster’s School, which had closed two years earlier. Provision was made to teach French, German, Latin, Writing and Drawing. The boys were all from Quaker families or had Quaker relatives.\n\nThe school stood on the south side of Tottenham Green. It eventually closed in 1879. In 1897 the site was purchased by Tottenham Council and became the Tottenham Polytechnic (now College of North East London).\n\nOn the closure of Grove House School, activity was transferred to a new Quaker school in Reading, Leighton Park School, which is still running today.\n\nAdult schools\n\nThe Quaker concern for education went beyond simply setting up schools for their own children. From the early days Quakers set up adult schools, often at their meeting houses, to provide a basic education for poor people. As far back as the 1780s Quakers were setting up adult classes to teach people to read, initially using the Bible as the text to work with. The initial development of individual adult schools round the country soon grew into a distinct movement.\n\nThrough close involvement with those they were teaching, Friends gained a deeper insight into the conditions many people were living in.\n\nAn adult school was running at Tottenham Meeting at least as far back as 1890.\n\nLancasterian School\n\nIn 1812 a Lancasterian school for boys was established in Tottenham. It was originally on the High Road, just south of White Hart Lane, but moved in 1813 to Church Road. Three years later a similar school for girls was opened on the corner of Reform Row and the High Road.\n\nFrom the beginning, several Tottenham Friends, men and women, were actively involved in the management of these schools. They are also featured in the list of subscribers, including members of the Forster, Janson, Howard and Stacey families.\n\nIn a single large room over 100 boys were taught on the basis of Joseph Lancaster’s ‘improved plan’. Each boy paid 1p per week. Joseph Lancaster, a Quaker, published an account of his educational work in 1803: Improvements in education as it respects the industrial classes of the community.\n\nJoseph Lancaster had found that at his ‘Lancasterian School’ in Southwark one ‘teacher’ could teach say five boys one item of knowledge in reading, writing or arithmetic. These five boys would teach another five. These would teach five more. In this way education could be provided very economically."}, {"url": "https://tottenham-summerhillroad.com/schools_of_tottenham.htm", "page_content": "Tottenham has enjoyed a long history of schooling and during the 18th and 19th century there were many well-known and respected Quaker schools that drew pupils from around the world. These included Grove House, Eagle House and the school of Josiah Forster that were all established in the vicinity of Tottenham Green. In 1827 Thomas Wright Hill purchased Bruce Castle House and opened the most distinguished of Tottenham\u0092s schools. The first headmaster was his son Rowland Hill who was later to become famous for his work on postal reform and the introduction of postage stamps.\n\n\n\nThese were largely private schools and, apart from the Tottenham Grammar School that had been endowed by the Duchess of Somerset in the late 17th century, there were very few schools that provided education for the working classes. It was not until William Forster introduced his Education act in 1872 that parishes or boroughs were required to establish school boards to provide adequate schooling for the growing number of children requiring education. In the latter part of the 19th century this saw the building of many of the schools that went on to serve Tottenham throughout the 20th century and indeed many of them still survive to this day.\n\n\n\nPictured below are some of the early private schools followed by many schools that older residents of Tottenham both past and present will recognise."}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://www.quakersintheworld.org/quakers-in-action/324", "page_content": "Luke Howard\n\n1772 – 1864\n\nBorn into the Quaker family of Robert and Elizabeth Howard in London, he was educated at the Quaker school in Burford, Oxfordshire. The headmaster Thomas Huntley was severe with those pupils that he felt were not learning quickly enough and would beat them. Luke said that consequently he learnt more Latin than he could forget, but not much mathematics and science. This may be the reason that he was tentative in putting forward science-based ideas. Nevertheless from an early age he showed a talent for observation.\n\nWhen he left school he served a seven year apprenticeship in pharmacy. He tried to set up an independent business which failed. In 1798 he went into partnership with fellow Quaker and pharmacist William Allen who owned the Plough Court Pharmacy in Lombard Street, London. Howard was made responsible for the laboratory in Plaistow, Essex. After seven years the partnership was dissolved and he moved the laboratory to Stratford, London. The business thrived and supplied chemicals to industry and also pharmaceuticals to the retail trade. He was responsible for supplying ether to Quaker John Dalton, famous for his pioneering development work on modern atomic theory and research on colour blindness.\n\nIn 1796 Howard married Mariabella daughter of Quakers John and Mary Eliot. They had eight children. She wrote a number of books including ‘Hints on the improvement of day schools’. The family lived first at Plaistow, moving to Tottenham in 1812, and spent time at their country home near Ackworth, Yorkshire. Their sons Robert Howard and John Eliot Howard took over the family firm in 1830.\n\nAlthough he studied both botany and geology Howard’s main interest was in meteorology. Both Howard and Allen were members of the Askesian Society, a philosophical group that met fortnightly. During the Askesian’s Society’s 1802-3 session Howard presented a paper on the classification of clouds which was later published as ‘On the modification of clouds, and on the principles of their production, suspension and destruction’. Lamarck had produced a classification system in 1802 but Howard’s was preferred and forms the basis of the international classification used today.\n\nUsing the Latin terminology stratus, cumulus, cirrus, and nimbus, Howard defined three groups: simple modifications (cirrus, cumulus, stratus); intermediate modifications (cirro-cumulus, cirro-stratus); and compound modifications (cumulo-stratus, cumulo-cirro-stratus vel nimbus). Although his knowledge of the mode of formation of clouds was rudimentary his system showed his keen observational powers. Howard also wrote the first book on English urban climatology entitled ‘The Climate of London’ that introduced new thinking on atmospheric electricity and the cause of rain. He also investigated the possibility of lunar influence on weather.\n\nThe German poet Goethe saw a translation of Howard’s 1803 paper on clouds and responded with a lyrical poem ‘Howard's Ehrengedächtnis’. He remained fascinated by Howard and obtained through his friend, Johann Huttner, an autobiography of Howard. It is said that he also influenced the English artists John Constable and J.M.W. Turner\n\nHoward was elected a Fellow of the Royal Society in 1821.\n\nHe was a deeply religious person and produced tracts upholding the Quaker way of life. He became a minister in 1815. He was also involved with campaigns to improve society. He and William Allen were involved in the anti-slavery movement. Howard later joined the campaign to raise support for the relief of distress in Germany following the fighting across Europe and the defeat of Napoleon at Leipzig. Howard became joint secretary (with Robert Humphrey Marten) of the organizing London committee and by 1814 £300,000 had been raised. In recognition of this he and Marten were awarded gold rings and Meissen vases by the kings of Prussia and Saxony, and received the freedom of the city of Magdeburg.\n\nIn 1835 Isaac Crewdson, an influential member of Hardshaw East Quaker Meeting,in Manchester published ‘A Beacon to the Society of Friends’. In it he argued strongly that many Quakers placed too much emphasis on following the inner light and too little on the authority of the Bible. This challenge to Quaker thinking caused considerable controversy amongst English Quakers. In 1836 Howard resigned his membership of the Religious Society of Friends and joined Crewdson in the Plymouth Brethren."}, {"url": "https://www.quakersintheworld.org/quakers-in-action/391/Edward-Burnett-Tylor", "page_content": "Edward Burnett Tylor\n\n1832-1917\n\nEdward Burnett Tylor was an English anthropologist. He helped to establish anthropology as a recognised scientific discipline and is considered the father of cultural anthropology. He classified cultures as either savage, barbarian or civilised. Unlike some contemporaries, who tried to establish a hierarchy of races (with white Caucasians at the top), Burnett upheld the Quaker belief in the equality of all humankind and considered these to be stages of development that all societies must go through.\n\nTylor was born in London in 1832, the son of a family of well-to-do Quakers who owned a brass foundry. He was educated at the Quaker School, Grove House, in Tottenham but left at the age of 16 after the death of his parents and never gained a university degree.\n\nFor several years, he managed the family business, but after he developed signs of tuberculosis, he was advised by doctors to travel in a warm climate and left England in 1855. His travels took him to Cuba, where a chance encounter in 1856 with fellow Quaker and ethnologist Henry Christy changed the direction of his life.\n\nChristy was interested in studying early human civilisation and wanted to go to Mexico to study the remains of the ancient Toltec civilisation. The two travelled together, and their experiences in Mexico were later described by Tylor in his book Anahuac, published in 1861.\n\nThroughout his travels in Mexico, Tylor tried to travel simply (usually on horseback) and see things as far as possible through the eyes of local and indigenous people. He recorded where those people were exploited, and noted in his book how their ill-treatment could only add to the feeling of hatred that has been growing up for these so many years among the brown Indians against the whites and the half-cast Mexicans.\n\nOn his return to England, he married fellow Quaker, Anna Fox. Their main home was in Wellington, in Somerset. Throughout their life together Anna would often attend his lectures. They had no children.\n\nTylor continued to study customs and beliefs of tribal communities, both contemporary and prehistoric. He published Researches into the Early History of Mankind and the Development of Civilization in 1865, and his most influential work, Primitive Culture in 1871. His last book was Anthropology, an Introduction to the Study of Man and Civilization, published in 1881.\n\nThrough this period he was developing his theory of social evolution, and his classification of all cultures as either savage, barbarian or civilised. Unlike many of his contemporaries, Tylor considered these to be stages of development that all societies go through. He wrote:\n\nThey succeed each other in series substantially uniform over the globe, independent of what seem the comparatively superficial differences of race and language, but shaped by similar human nature acting through successively changed conditions.\n\nHe defined culture as a complex whole encompassing knowledge, belief, art, morals, law, custom, and any other capabilities and habits acquired by societies. Crucially, Tylor believed there to be no inherent difference in terms of intelligence or potential for development between, say, those in a hunter-gatherer society and those in an advanced industrial one. In the late 19th C there was still considerable controversy over whether all humankind belonged a single species (monogenism) or to separate species (polygenism). Tylor, basing his work on empirical evidence, was a powerful advocate for monogenism.\n\nTylor used the term animism to describe a belief in a soul that inhabits all things. He regarded animism as the first phase of development of all religions. He also coined the idea of ‘survivals’ – earlier beliefs that persist despite being outmoded or scientifically disproved. By the end of his life, he had become an agnostic and a religious sceptic, but the values he had gained as a Quaker, particularly a belief in the equality of all humankind, still permeated his work.\n\nTylor was elected a Fellow of the Royal Society in 1871, and given an Honorary Doctorate by the University of Oxford in 1875. In 1883, he was appointed Keeper of Oxford’s University Museum, and in 1884 became the first Reader in Anthropology, and the first professor of Anthropology in 1896. He continued to teach until 1909 and was knighted in 1912.\n\nTylor’s work was strongly influential on the next generation of British anthropologists."}, {"url": "https://www.stokenewingtonquakers.org.uk/a-brief-history-of-stoke-newington-quakers/", "page_content": "Did you know that Clissold House was built for Quakers? That William Allen, anti-slavery campaigner and chemist, lived in Church Street? That Nahneebahweequay, an Ojibway from Canada, stayed with Stoke Newington Quakers when she came to petition Queen Victoria about land rights? That Joseph Beck, one of the people who saved Clissold Park, was a Quaker?\n\nIn the early 19th century many of the city Quakers came to live in Stoke Newington, and they built a meeting house in 1827 in Park Street (now Yoakley Road).\n\nThe migration of City of London Quakers continued and Stoke Newington became the largest concentration of Quakers in London. By 1900, when membership was starting to go down, there were still 221 living within a mile of the meeting house.\n\nDuring the 20th century, and especially after the second world war, the meeting declined. Quakers moved further out to the suburbs, and the large meeting house was demolished, replaced by a new building in 1959. But the membership was not enough to continue the meeting, and the building was sold in 1966.\n\nOutreach Stall, 2000Now, there are more Quakers in the area again, and a new meeting for worship was established in 2000.\n\nEARLY HISTORY\n\nQuakers in Stoke Newington Part 1: to the mid-nineteenth century\n\nby Peter Daniels\n\nGeorge Fox and the first Quakers\n\nThe Quakers, or Society of Friends, arose from the new ideas around in England of the 1640s.\n\nGeorge Fox George Fox\n\nIn 1647 George Fox began preaching around Leicestershire, motivated by a sense of direct communication with the Light, or Holy Spirit, described later in his Journal: “Now was I come up in spirit through the flaming sword into the paradise of God. All things were new, and all the creation gave another smell unto me than before, beyond what words can utter.” [Nickalls ed., The Journal of George Fox, p.27]\n\nHe and his companions called themselves “Children of Light”, but they ran into trouble with the authorities, and found a new name: “This was Justice Bennet of Derby that first called us Quakers because we bid them tremble at the word of God, and this was in the year 1650.” [Nickalls ed. p.58] In 1652 he found “a great people to be gathered” around Westmorland and Furness, where people called “Seekers” were much in sympathy. Margaret Fell, wife of judge Thomas Fell, gave particular support at her home, Swarthmoor Hall, where a base was established for an organisation.\n\nIn 1654 the “Valiant Sixty” were sent around the country to spread the word. Francis Howgill and Edward Burrough were delegated to London where they spoke and published constantly, attracting metropolitan attention and developing London’s eventual position as organisational centre of Quakerism.\n\nSeveral regular Quaker meetings were set up in London itself, but especially after the Restoration in 1660 they were subject to disruption by the authorities, and many Friends passed through Newgate prison, or died there, like Edward Burrough. When George Fox was in London he often found refuge from interruption to write in outlying places, including the home of the widow Mary Stott in Dalston, from where a number of his epistles are dated. [Penney ed. Short Journal note, p.305] Women like Mary Stott played an important part from the beginning, and spoke prominently at Quaker meetings. In 1668 Fox set up a girls’ school at Shacklewell to be run by Mary Stott, “to Instruct younge lasses & maydens in whatsever thinges was civill & useful in ye creation”. [Penney ed. Journal vol.2 p.119.] By 1677, and the Shacklewell school was run by Jane Bullock. A loan of fifty pounds was arranged for her to develop the school, as it appears to have been short of pupils [Six Weeks Meeting minutes vol.1 p.112 (1677) George Fox visits Jane Bullock in Shacklewell in 1683, though the school is not mentioned [Penney ed. Short Journal p.89]. Mary still lived in Dalston at the time, but by the end of 1684 had moved to Bethnal Green [Penney ed. Short Journal note, p. 305]\n\nThe first Stoke Newington Quaker meeting\n\nIn 1698, it was proposed to hold a meeting for worship once a month in Stoke Newington. Local meetings for worship were under the care of a monthly meeting for business: Stoke Newington came in the territory of the Peel Monthly Meeting, based at the Peel meeting house in St John’s Lane, Clerkenwell (named after the sign of a baker’s “peel”, the shovel for handling loaves in an oven). The body responsible for London Quaker property, the Six Weeks Meeting, approved this, initially with the option left open whether to take two rooms or a barn; it was decided to hold a meeting for worship fortnightly, alternating with another meeting being established in Tottenham. [Six Weeks Meeting vol.3 p.330 (25 8mo. 1698), p.344 (6 10mo. 1698)]\n\nThe two rooms taken for the “Newington” meeting were at the premises of Robert Walburton, a gardener. [Beck, William, and Ball, T. Frederick, The London Friends’ Meetings: showing the rise of the Society of Friends in London, F. Bowyer Kitto, 1869 p.211-12, quoting the registration at Middlesex Sessions as a place of worship] In a posthumous pamphlet, William Beck, a Stoke Newington man, calls this “a rambling old structure” on the site of the Clarence Tavern (now the Daniel Defoe pub) [Beck, William, A description of Church Street, Stoke Newington, with unsigned introduction dated 1927, Clapham: Edgar Publishing, n.d., p.12] A drawing of the building dated 1825 appears in a book held at Hackney Archives about Mary Lister’s invalid asylum that was initially housed there [Isabella Prideaux Moline, A Short History of the Home Hospital for Women (Invalid Asylum) , 1916]. It seems unlikely that the look of the building changed much during the intervening eighteenth century.\n\nDaniel Defoe and the Quakers\n\nThese premises were directly opposite the house where Daniel Defoe lived from 1714. Defoe was not a Quaker, but was sympathetic. William Penn made efforts on Defoe’s behalf when in 1702 he was tried for seditious libel, and sentenced to be pilloried three times and imprisoned for a year. Penn was not successful: he had been able to found Pennsylvania because Charles II owed his father money, but he had less influence by the reign of Queen Anne. [Penn, William, general eds Richard S. Dunn and Mary Maples Dunn, The Papers of William Penn (5 vols.); vol.4 ed. Craig Horle et al. , University of Pennsylvania Press, 1987, p.228] Defoe returned the favour to the Quakers, defending them against anti-Quaker pamphleteer Francis Bugg. [Cadbury, Henry J., “Defoe, Bugg and the Quakers”, in Journal of Friends Historical Society vol.42 p.70-72] He also used the character of a Quaker for anonymous pamphlets such as A Friendly Rebuke to one Parson Benjamin (i.e. Bishop Benjamin Hoadley) published in 1719 as “By One of the People called Quakers”.\n\nA secret wedding\n\nIt took the Society of Friends much trouble to establish the legality of Quaker marriages without a priest, where the couple declare their union during worship (“We marry none; it is the Lord’s work”) [George Fox, A collection of… epistles, 1698, epistle 264; quoted in Quaker faith and practice 16.01]. Much Quaker administrative business of the time is connected with marriages, and the circulation of information about their approval, or otherwise. In 1704 a Quaker couple, Thomas Taylor and Rebecca Clifton, lacking the approval of the Society, came to quiet rural Stoke Newington with a few associates, and before the meeting for worship had assembled “did then & there pretend to take each other in marriage”. Devonshire House meeting in Bishopsgate, where they were members, disowned them for “their disorderly works of darkness”. [Devonshire House Monthly Meeting Adjourned Minutes vol.2 (13 10mo. 1704)] Their disownment was circulated around the London meetings, [Six Weeks Meeting vol.5 p.10 (20 12mo. 1704) and p.14 (3 2mo. 1705)] and appears in the Peel Monthly Meeting’s “Book of Condemnations”. [Peel Condemnations Book (vol.1) entry no.24]\n\nDecline and rise\n\nThe need for a worshipping group to catch people’s weekly habits is demonstrated by the difficulty arising when the Enfield Monthly Meeting, responsible for Tottenham, decided in 1716 to hold that meeting every week instead of alternating fortnightly with Stoke Newington (at first “for this Winter only, for a Tryall”) [Enfield Monthly Meeting (vol.2), 29 6mo. 1716]. Regular worshippers, apparently living especially around Stamford Hill between the two, would inevitably prefer not needing to remember which week to travel north and which south. Stoke Newington’s congregation declined and in 1728 Six Weeks Meeting considered it “of little or no service”, [Six Weeks Meeting vol.8 p.157 (4 1mo. 1728)] but the meeting, or at least Peel Monthly Meeting, thought otherwise. In 1733 the premises were taken over for the parish workhouse, though this did not affect the Quakers’ tenancy. A Peel minute of 1734 insists that “the continuance of a meeting at Newington may be of service” [Six Weeks Meeting vol.8 p.290 (22 8mo. 1734)], and it was kept up until 1741. [Peel Monthly Meeting vol.8 (29 2mo. 1741)]\n\nQuakers were more and more in evidence in the Stoke Newington area, as the successful business folk of Gracechurch Street meeting in the City found it a congenial and Gracechurch Street meeting convenient place to live. The painting in Friends House Library of Gracechurch Street meeting around 1770 may be the first accurately-observed representation of Quaker worship, and many of these worshippers would be Stoke Newington residents. [illustrate?] Samuel Hoare, who lived in Paradise Row, has been identified as the left-hand figure on the men’s side-bench: it was his son Jonathan who had Clissold House built. His wife and three daughters are said to be on the opposite side benches; one of the daughters is Grizzell, who married William Allen (see later) [The Biographical Catalogue: being an account of the lives of Friends and others whose portraits are in the London Friends Institute, Friends Institute, 1888, p.351-2; for more about the Hoares see also David Mander’s book Look Back, Look Forward: an illustrated history of Stoke Newington: Sutton Publishing and the London Borough of Hackney, 1997]\n\nEventually because so many Gracechurch Street Quakers were living in the area, it was from this meeting that the beginnings of a new Stoke Newington meeting emerged, rather than Peel. Most of the Gracechurch Street records were destroyed when that meeting house burned down in 1821, but minutes passing through the Quaker administrative system reveal some of the developments. Six Weeks Meeting approved their arrangement of a public event in 1801, with Sarah Lynes Grubb speaking. [Six Weeks Meeting vol.8 p.13 (3 10mo. 1801)] She was a formidable Gracechurch Street Friend whose preaching was evidently much admired, though probably more among Quakers than “the world’s people”. Elizabeth Fry wrote in her diary “S. Lines brought in her account to the monthly meeting of her late visit, and asked to go out again. This appeared almost too much for my weak intellect to comprehend; at least it appeared as if she never could rest.” [Elizabeth Fry diary MS Vol S 260 (10 ii 1802)] Mary Martin, a pupil at Susanna Corder’s school, recalled a visit by her: “She was like some weird prophetess, very forbidding and gaunt, who even eschewed a white lining to her Friends’ bonnet.” [Beatrice Marshall, Emma Marshall, Seeley & Co, 1900, p.13] Although the meeting had officially closed in 1741, by end of the century the old premises were again associated with Quakers, with the founding of Mary Lister’s Invalid Asylum mentioned earlier: this was a place for domestic servants to receive rest and medical care when not ill enough to need a hospital. A Bible class or prayer meeting was held there organised by Edward Harris [picture in Hackney Archives,; HAD ref], and mander refers to this as a Quaker meeting [Mander p.58]. It was not a meeting for worship recognised as such in the Society’s system, although informally it would have maintained an identifiably Quaker activity in the area. The local Quakers of this time have been usefully described in a study of their reading habits by Jane Desforges [Desforges, Jane, “‘Satisfaction and Improvement’: a study of reading in a small Quaker community 1770-1820”, in Publishing History vol.49 (2001) p.5-47]\n\nWilliam Allen\n\nSix Weeks Meeting’s authorisation for the public meeting with Sarah Lynes Grubb notes that a copy of the minute is to be sent to William Allen, so he was probably responsible for organising it. William William AllenAllen (1770-1843) was born in Spitalfields. He became a successful chemist at Plough Court near Lombard Street, and for many years was a public lecturer in chemistry at the Royal Institution. He was active in a wide range of philanthropic projects: campaigning against slavery, visiting Newgate Prison with Elizabeth Fry, travelling in continental Europe to gain increased liberties for oppressed Greeks and persecuted Waldenses, and he was one of the founders of the British & Foreign School Society. [further background on William Allen can be found in Nicolle, Margaret, William Allen: Quaker Friend of Lindfield 1770-1843, Lindfield, Sussex: the author, 2001]\n\nAllen was also interested in agricultural improvements, and developed allotments in Lordship Road. This was evidently a smaller version of his extensive project at Lindfield in Sussex, to improve the condition of agricultural labourers with allotments and education. Christine Majolier (later Alsop) who grew up in his household, describes the anti-slavery MP William Wilberforce visiting the project in 1823: “On the day of his visit we walked to the cottages in the Lordship Road, where William Allen was conducting his agricultural experiments. I had the honour of walking with the great man, who, however, took little notice of me, but hummed a tune most of the way, except when he wished to say something to William Allen; upon which he would leave me, say what he had to say, and then almost mechanically offer me his arm, and go on singing his hymn. At the cottages he was weighed in the scale, and though many have had the opportunity of recording the talents of Wilberforce, few have been able to tell his weight, and this, insignificant as it is, may give some idea of his person, and confirm the saying, that the mind is the standard of the man. He weighed, including the 5 lbs for the iron stays which he wore, 76 lbs. [Memorials of Christine Majolier Alsop, compiled by Martha Braithwaite, Samuel Harris & Co, 1881, pp.66-67] Incidentally, Wilberforce (not a Quaker) had other local associations; he requested to be buried in Stoke Newington with his sister and daughter, but Parliament voted to bury him in Westminster Abbey. [DNB] Sophia de Morgan, a non-Quaker neighbour who attended Allen’s lectures, wrote: “He was a good observer and classifier, but stopped at facts and phenomena. In philanthropy the same ready perception and hastiness of inference were apparent. His exceeding benevolence and strong impulse to help the suffering led him occasionally into exaggeration of the evils he opposed; but all good causes need pioneers who overdo their work at first.” [Quoted in A.J. Shirren, The Chronicles of Fleetwood House, self-published 1951, p.164].\n\nHe married his first wife, Mary Hamilton, at Tottenham meeting house in 1796: she died following the birth of a daughter, Mary, eleven months after their marriage. In 1806 he married Charlotte Hanbury, and divided his time between Plough Court and the house in Stoke Newington that had been Charlotte’s, and which became his usual residence. Charlotte died in 1816 while they were visiting Geneva. In 1823 his only daughter Mary died in childbirth, like her mother.\n\nIn 1827, in his 57th year, William Allen married the widow Grizzell Birkbeck, who was 69. Their close friendship had developed since the blow of Mary’s death, when Grizzell’s personal support had become very important to William. Despite this genuine companionship, the marriage provoked comment not only among Quakers but around London generally, because of her age and wealth, and the house in desirable Paradise Row that became their home. Robert Cruikshank, 1789-1856 (whose brother George is better known) lived in Knightsbridge, but was aware enough of this unQuakerly fuss on the other side of London to publish a series of satirical cartoons about it. Several are in Friends House Library, including different versions of ‘Sweet William and Grizzell: or Newington Nunnery in an Uproar’. [illustrate]\n\nSweet William and GrizzellIt is hard to know whether most of the Quakers depicted are generic caricatures or individuals. However, “Newington Nunnery” is definitely the girls’ school at Fleetwood House run by Susanna Corder, who is identifiable from a later photograph. She is depicted fainting and being attended to by pupils including Grizzell Birkbeck’s nieces, whose inheritance would be affected by the marriage. The implication seems to be that Susanna herself had hopes of William’s hand.\n\nAs well as this satirical series, there was at least one other cartoon (artist not identified) which defends William and Grizzell, with a theme from Aesop of “Willie the Lion” derided by asses in Quaker hats.\n\nSusanna Corder’s school\n\nSusanna Corder, 1787-1864, had a clear vocation as a teacher. After the death of her mother whom she had nursed at home in Essex, at the age of 30 she found a post at Suir Island School at Clonmel in Ireland, and learned much from the educational methods there. In 1820 William Allen met her on a visit to Ireland, and when a Quaker girls’ school was proposed for Stoke Newington in 1824, it seems that she was already intended to run it.\n\nThe first prospectus proposed “an Establishment in our religious society on a plan in degree differing from any hitherto adopted, wherein the children of Friends should not only be liberally instructed in the Elements of useful knowledge, but in which particular attention should be paid to the state of mind of each individual child”. [quoted in Shirren, Fleetwood House p.159] The school occupied Fleetwood House (where the Fire Station is now), which had extensive grounds suitable for the pupils to walk in, later incorporated into Abney Park Cemetery. It started with twelve pupils, but more than doubled in three years. Subjects included Astronomy, Physics, and Chemistry, which were taught by William Allen; the languages available included Latin, Greek, German and Italian as well as French. [Shirren, Fleetwood House p.160] Susanna Corder was well known for her order and decorum, and views on dress by then somewhat old-fashioned even in the Society. [“Dictionary of Quaker Biography”, unpublished files in Friends House Library]\n\nA pioneering bus\n\nSusanna’s resourcefulness included transport arrangements. When the school started in 1824, the meeting for worship was still at Gracechurch Street, and the girls had to walk to the City. A vehicle was ordered to take 25 pupils facing on bench seats: this was a new idea, as vehicles of this kind were only just being used as passenger omnibuses in Paris, developed by George Shillibeer who had worked for the coach company Hatchetts in Long Acre (the coach-building centre of London). In 1827 Joseph Pease, a Quaker visitor, wrote a verse letter to his cousin in which he describes “Newington Nunnery” and refers to this bus:\n\nThe straight path of Truth the dear Girls keep their feet in\n\nAnd ah! it would do your heart good Cousin Anne\n\nTo see them arriving at G[racechurc]h Street Meeting\n\nAll snugly packed up, 25 in a van.\n\n[Pease, Joseph “Yearly Meeting epistle from Friend Joseph in London to his cousin Anne in the country”, London 5 mo. 1827 MS box 10 (13) 2; quoted in Shirren p.163]\n\nWe also have an account of the bus from Louisa Stewart, who recalled that half the pupils would walk ahead to meeting, the others catch up in the bus, and they would change over half way [Stewart, Louisa Hooper, ed. Evelyn Roberts, Louisa: memories of a Quaker childhood, Friends Home Service Committee, 1970, p.35]. When the new Stoke Newington meeting house opened in 1828, the bus was no longer needed, and she tells how the girls watched it being repainted in the yard with the title “Omnibus” and “Paddington to the Bank” on the sides. This was the route that George Shillibeer started running on his return to London in 1829, the first true London bus when the only rival services were stagecoaches, unsuited to local journeys. A full size replica of his vehicle is in the London Transport Museum. [information from scrapbooks on bus history at the Museum’s library, and Moore, Henry Charles, Omnibuses and cabs: their origin and history, Chapman & Hall, 1902]\n\nAn inspired pupil\n\nLouisa Hooper Stewart, 1818-1918, was from a City Quaker family that moved south to Kennington Louisa Stewartrather than Stoke Newington. She was educated in Croydon at first, but the school was much inferior to Susanna Corder’s, which her older sister Emily attended. There was a delay in sending her there for family reasons until she was thirteen in about 1831, when the bus had already become redundant, so her reminiscences about it are second hand from Emily. Louisa’s memories were recorded by her granddaughter soon before she died aged 99. This may account for some confusion about the purchaser of the bus—she calls him a rival of Shillibeer, but from the date and the detail of the bus destination it seems clear that this was Shillibeer himself. We have to be cautious about her testimony, which includes the assertion that the whole idea of the vehicle with benches inside was Susanna’s, but maybe it was, if she ordered it from Long Acre before Shillibeer left for Paris.\n\nLouisa was only at the school for a year, but the Corder education made a tremendous impression, and stimulated her active mind. In 1855 she married John Stewart, owner of the Edinburgh Review. She became keenly interested in women’s suffrage: in 1869 she published The Missing Law; or, Woman’s Birthright [Stewart, Mrs J., The Missing Law; or, Woman’s Birthright; W. Tweedie, 1869]. After her husband’s death she opened a girls’ school at Cronks Hill, Reigate, on the lines of Susanna Corder’s, with weekly visits from professors of London University for Classics and Science [Louisa p.54]. In 1874 she moved back to Stoke Newington with her daughter, organising the Women Friends’ Total Abstinence Union and starting what an obituary calls “a most successful Coffee Cart work in that district” [The late Mrs Stewart, of Winchmore Hill: an appreciation; no publisher, no date, Friends House Library Box 229]. She also formed a school in a caravan for the children of travelling showmen. This was an interest developed from an early age: her reminiscences include an episode from schooldays in Croydon where she went to discover what really went on at the fairground, thought very shocking for a Quaker girl [Louisa p.33-34]. Her granddaughter describes taking tea with the Fat Lady on a visit to the fair where “Louisa was always welcome”, when it came to the Agricultural Hall in Islington [Louisa p.52].\n\nDesigning a meeting house\n\nGracechurch St meeting house burned down in 1821. It was rebuilt, but not surprisingly Stoke Newington Friends began proposals for their own building. Early DesignThe architect was William Alderson, who later designed the Hanwell Lunatic Asylum. Some of the drawings survive in Friends House Library, including one early idea for it with a frontage of curved colonnades and a carriage sweep. [Six Weeks Meeting and Gracechurch St Monthly Meeting Joint Committee box; illustrate] This may have been dropped as too ostentatious, although the site would scarcely have accommodated it as well as the burial ground behind the building. Another projected design is in Hackney Archives, with a detailed plan which is nothing like what was built; but more odd is the figure on the portico roof which looks like a triumphal statue, though it may be a poorly-scaled person, showing use of it as a balcony. [HAD P.5549]\n\nThere are also drawings in Friends House for a meeting house bench or “form”, one of the most typical features of a Quaker meeting house. [SWM&GSt Joint Ctee box; illustrate?] Some like this are still in use in Quaker meetings, although the tendency now to add cushions would have been thought unnecessary luxury in 1828. On a page of rough calculations, the cost of the meeting house building works come to £2,086 12s 0 ½d, being £1,805 12s 0 ½d for building works, plus £281 for stove and furniture; there is an additional £90 8s 0d for the architect and surveyor. Besides this, the purchase of the site in Park Street (now Yoakley Road) was £480, and some further land to extend the burial ground was bought in 1849 for £400. The building included a large meeting room 44 feet by 36 with a gallery, and a side room to be used for the Women’s Monthly Meeting. This was later extended as classrooms and a kitchen. [Plan, drawings and photographs by Hubert Lidbetter in Friends House]\n\nThe meeting house opened in 1828. The first meeting of the Meeting House Building Committee in 1830 was “to consider some means for remedying the echo” (temporary calico curtains were to be tried). The acoustic aspect of Quaker architecture is easy to forget when the major part of the worship is silent: the difficulty is that unlike chapels centred on a pulpit, Quaker meeting houses must accommodate spoken ministry from any part of the room, and it must be audible.\n\nOn the northern side were built the Yoakley almshouses. Michael Yoakley, 1631-1708, was a sea-captain from Thanet who shipped goods to America for William Penn. During his life he founded almshouses “for aged poor women” in Spitalfields and Margate, and as his widow died childless his endowed charity inherited the whole estate. In 1834 the trustees had spare money available and bought the land next to the meeting house for ten almshouses and a committee room. [Marsh, Robert H., ‘Michael Yoakley’s Charity,’ Journal of Friends Historical Society vol.14 (1917), p.146-156]\n\n[I’ve a feeling Yoakley Road must have been renamed in 1934 as a centenary gesture – right year, I think, I presume HAD have file on street names]\n\nStoke Newington Quaker meeting became established as the largest of London’s meetings, attended by Friends who were prominent and active in the society, and more generally in society. A future article will take the story from the high Victorians to the present day.\n\nNote on dates\n\nIt is essential to remember that Quakers refused to use pagan names for months, so before the calendar change of 1752, March is the “first month” (usually abbreviated “1mo.”), but the new year began on 25th March. For simplicity minutes are cited here with the original dating. For the full implications see the Friends House Library guide “Quaker Dating” (available at www.quaker.org.uk/library/guides)\n\nNote on editions of Fox’s journal\n\nFox, George, ed. John L. Nickalls, The Journal of George Fox: a revised edition, Cambridge: Cambridge University Press, 1952 (corr. ed. London Yearly Meeting of the Religious Society of Friends, 1975). This is the standard ‘reading edition’ based on early printed versions, but Norman Penney’s edition of 1911 taken from the manuscript includes details not otherwise published (and shows up embellishments of the posthumous editors). The Short and Itinerary Journal are briefer manuscript drafts, also with additional detail. Penney’s notes are valuable secondary sources in themselves.\n\nThis page is an abridged version of Daniels, Peter 2002 Quakers in Stoke Newington. Part 1: to the mid-nineteenth century in Hackney History, Vol. 8"}, {"url": "https://www.quaker.org.uk/children-and-young-people/quakers-in-education", "page_content": "There are several organisations, including Quaker Recognised Bodies, that promote Quakerism in education and schools.\n\nQuaker Values in Education (QVinE)\n\nThis group promotes integrity, peace, simplicity and equality in education. It does this through publications, conferences and networking.\n\nFind out more on the QVinE website.\n\nFriends School Council (FSC)\n\nFriends Schools Council promotes Quaker primary and secondary education. It also encourages the expression of Quaker faith in action and the interpretation of Quaker vision. It does this within Friends Schools and state schools with Quaker Governing bodies. Some of these schools offer specialist provision. The Council works closely with Quakers on the wider remit of promoting Quaker values in education. Find out more on the FSC website.\n\nFriends Schools\n\nThere are several schools in the United Kingdom that are referred to as 'Friends Schools'. Some are independent and fee paying. Bursaries may be available for Quakers. Some are marked as SEND (Special Educational Needs and Disabilities) schools.\n\nAckworth School website\n\nBootham School website\n\nBreckenbrough School (SEND) website\n\nChaigley School (SEND) website\n\nLeighton Park School website\n\nThe Mount School website\n\nSibford School website\n\nSidcot School website\n\nSt. Andrews School (SEND) website\n\nWilliam Penn School website"}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F198063", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://link.springer.com/chapter/10.1057/9780230618367_5", "page_content": "A straw poll about Quakers taken in a university cafeteria is likely to bring a variety of responses. Replies are likely to be prefaced with some form of qualification that admits a lack of detailed knowledge but some impressions tend to come up time and again, something about pacifism, social responsibility, and the invariable joke about porridge. There will be a mixture of impressions about beliefs and behavior in society, and dietary habits, a plainness of appearance, and, more deeply, a seriousness and thoughtfulness in lifestyle. (The official Web site, Quakers in Britain, however, makes it clear that Quakers are not as serious as they sometimes appear, that most do not wear black all the time and some do not even eat porridge every day.) However, even among university coffee-drinkers who have a built-in propensity to critique, the sincerity of this very small religious group is rarely, if ever, questioned. However, to understand the position and role of Quaker schools in England, it is necessary to have an awareness of the reality of Quakerism today. (Interestingly, while recently there are perhaps signs of membership growth, Burnet (2007) has written about what he terms the failure of Quakerism in Scotland).\n\nKeywords\n\nHead Teacher\n\nIndependent School\n\nPractice Volume\n\nQuaker Study\n\nReligious Society\n\nThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, {"url": "https://timesofmalta.com/articles/view/mayhew-foster.348092", "page_content": "As a 33-year-old pilot at the end of World War II, then Capt. Mayhew ‘Bo’ Foster had an extraordinary mission, flying captured Nazi leader Hermann Goering from the Austrian Alps back to the 7th Army’s headquarters in Germany for interrogation.\n\nCapt. Foster took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe, all 300-plus pounds of him, and knew he needed a bigger plane.\n\nCapt. Foster, now 99, and living in a nursing home in Missoula, Montana, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders.\n\nMr Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honour for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career."}]}