{"Mayhew Foster was a strong advocate of the abolition of slavery.": [{"url": "https://www.oxfordbibliographies.com/abstract/document/obo-9780199730414/obo-9780199730414-0001.xml", "page_content": "Abolition of Slavery by Michael Guasco, Matthew Wyman-McCarthy LAST REVIEWED: 12 April 2019\n\nLAST MODIFIED: 23 June 2021\n\nDOI: 10.1093/obo/9780199730414-0001\n\nIntroduction The abolition of slavery in the Atlantic world occurred during the 19th century, but its origins are generally recognized to be the intellectual ferment of the 18th-century Enlightenment, the political turmoil of the Age of Revolution, and the economic transformations associated with the development of modern industrial capitalism. Although antislavery ideas circulated much more widely beginning in the 1760s, the first sustained effort to do something about slavery began in the 1780s, particularly with the British campaign to end the slave trade. The revolution in Saint Domingue added a new sense of urgency to the issue in France, Great Britain, and the United States (as did each of the increasingly troubling slave rebellions that erupted elsewhere in the region during this era), but it was not until the first decade of the 19th century that the British and US governments abolished the trade and made efforts to suppress it throughout the Atlantic world. Slowly thereafter, slavery would be outlawed in many of the newly independent Latin American nations, throughout the British Empire in 1833, and in the French colonies in 1848. Not until the 1860s would slavery come to a halt in the United States, followed by Cuba and Brazil in the 1880s. Scholars have demonstrated that there were many reasons for the abolition of slavery, including the heroic efforts of enslaved people and radical abolitionists alike. As important as moral outrage and popular pressure were to the effort, however, abolition was also facilitated by changing economic and political circumstances. The language of liberty that pervaded the revolutionary Atlantic world inevitably destabilized the ideological foundation of the Atlantic slave system. At the same time, new agricultural and technological innovations made it possible for European elites to imagine viable, and profitable, alternatives to the plantation complex that had been constructed during the preceding centuries. Much has been written about the end of slavery, but scholars are nonetheless still trying to figure out how the component parts of transatlantic abolitionism fit together into a seamless whole.\n\nback to top"}, {"url": "https://www.britannica.com/topic/American-Anti-Slavery-Society", "page_content": "American Anti-Slavery Society, (1833–70), promoter, with its state and local auxiliaries, of the cause of immediate abolition of slavery in the United States.\n\nAs the main activist arm of the Abolition Movement (see abolitionism), the society was founded in 1833 under the leadership of William Lloyd Garrison. By 1840 its auxiliary societies numbered 2,000, with a total membership ranging from 150,000 to 200,000. The societies sponsored meetings, adopted resolutions, signed antislavery petitions to be sent to Congress, published journals and enlisted subscriptions, printed and distributed propaganda in vast quantities, and sent out agents and lecturers (70 in 1836 alone) to carry the antislavery message to Northern audiences.\n\nBritannica Quiz Fast Facts About Abolitionism Quiz\n\nParticipants in the societies were drawn mainly from religious circles (e.g., Theodore Dwight Weld) and philanthropic backgrounds (e.g., businessmen Arthur and Lewis Tappan and lawyer Wendell Phillips), as well as from the free black community, with six blacks serving on the first Board of Managers. The society’s public meetings were most effective when featuring the eloquent testimony of former slaves like Frederick Douglass or William Wells Brown. The society’s antislavery activities frequently met with violent public opposition, with mobs invading meetings, attacking speakers, and burning presses.\n\nIn 1839 the national organization split over basic differences of approach: Garrison and his followers were more radical than other members; they denounced the U.S. Constitution as supportive of slavery and insisted on sharing organizational responsibility with women. The less radical wing, led by the Tappan brothers, formed the American and Foreign Anti-Slavery Society, which advocated moral suasion and political action and led directly to the birth of the Liberty Party in 1840. Because of this cleavage in national leadership, the bulk of the activity in the 1840s and ’50s was carried on by state and local societies. The antislavery issue entered the mainstream of American politics through the Free-Soil Party (1848–54) and subsequently the Republican Party (founded in 1854). The American Anti-Slavery Society was formally dissolved in 1870, after the Civil War and Emancipation."}, {"url": "https://www.britannica.com/topic/Slavery-Abolition-Act", "page_content": "Slavery Abolition Act , (1833), in British history, act of Parliament that abolished slavery in most British colonies, freeing more than 800,000 enslaved Africans in the Caribbean and South Africa as well as a small number in Canada . It received Royal Assent on August 28, 1833, and took effect on August 1, 1834.\n\nSeveral factors led to the Act’s passage. Britain’s economy was in flux at the time, and, as a new system of international commerce emerged, its slaveholding Caribbean colonies—which were largely focused on sugar production—could no longer compete with larger plantation economies such as those of Cuba and Brazil . Merchants began to demand an end to the monopolies on the British market held by the Caribbean colonies and pushed instead for free trade . The persistent struggles of enslaved Africans and a growing fear of slave uprisings among plantation owners were another major factor.\n\nLegal challenges to slavery in British North America\n\nBritish abolitionists had actively opposed the transatlantic trade in African people since the 1770s. (Several abolitionist petitions organized in 1833 alone collectively garnered the support of 1.3 million signatories.) Such antislavery views spread to Upper Canada (later Canada West), influencing the passage there of the 1793 Act to Limit Slavery, the first such legislation in the British colonies.\n\nIn the eastern colonies of Lower Canada (what is now Québec), Nova Scotia, and New Brunswick, however, abolitionist attempts had been unsuccessful. In 1793, for instance, Pierre-Louis Panet introduced a bill to the National Assembly to abolish enslavement in Lower Canada, but the bill languished over several sessions and never came to a vote.\n\nInstead, individual legal challenges first raised in the late 1700s undermined the institution of enslavement in these areas. One important case arose in February 1798, when an enslaved woman named Charlotte was arrested in Montréal and refused to return to her mistress. She was brought before James Monk, a justice of the King’s Bench with abolitionist sympathies, who released her on a technicality. According to British law, enslaved persons could be detained only in houses of corrections, not common jails, and no houses of correction existed in Montréal. Charlotte and another enslaved woman named Judith were accordingly freed that winter. Monk stated in his ruling that he would apply this interpretation of the law to subsequent cases. Another significant 1798 case came before the courts in Annapolis Royal, Nova Scotia, when a local military officer, Frederick William Hecht, sought to establish his title to an enslaved woman named Rachel Bross. After a lengthy trial, the jury rejected Hecht’s claim, ruling instead that Bross was a free servant.\n\nRulings in such cases did not always favour emancipation, however. Only two years after the trials of Charlotte and Bross, an enslaved woman named Nancy petitioned for her freedom in the New Brunswick courts. Fourteen years earlier, Nancy had run away with her son and three others, but they were caught and returned to her owner, a farmer and loyalist settler named Caleb Jones. The challenge filed by her attorneys was that slavery was a socially accepted custom but was not officially recognized in New Brunswick. The judges’ decision was split, and Nancy remained enslaved."}, {"url": "https://www.history.com/topics/black-history/abolitionist-movement", "page_content": "The abolitionist movement was an organized effort to end the practice of slavery in the United States. The first leaders of the campaign, which took place from about 1830 to 1870, mimicked some of the same tactics British abolitionists had used to end slavery in Great Britain in the 1830s. Though it started as a movement with religious underpinnings, abolitionism became a controversial political issue that divided much of the country. Supporters and critics often engaged in heated debates and violent— even deadly—confrontations. The divisiveness and animosity fueled by the movement, along with other factors, led to the Civil War and ultimately the end of slavery in America.\n\nWhat Is an Abolitionist?\n\nAn abolitionist, as the name implies, is a person who sought to abolish slavery during the 19th century. More specifically, these individuals sought the immediate and full emancipation of all enslaved people.\n\nMost early abolitionists were white, religious Americans, but some of the most prominent leaders of the movement were also Black men and women who had escaped from bondage.\n\nThe abolitionists saw slavery as an abomination and an affliction on the United States, making it their goal to eradicate slave ownership. They sent petitions to Congress, ran for political office and inundated people of the South with anti-slavery literature.\n\nThese staunch activists wanted to abolish slavery completely, which differed from the ideas of other groups like the Free Soil Party, which opposed the expansion of slavery into U.S. territories and newly formed states such as Kansas.\n\nDid you know? Female abolitionists Elizabeth Cady Stanton and Lucretia Mott went on to become prominent figures in the women's rights movement.\n\nHow Did Abolitionism Start?\n\nOpposition to slavery wasn’t a new concept when abolitionism started. Since the inception of the Atlantic slave trade, which began in the 16th century, critics voiced their disapproval of the system.\n\nIn an early effort to stop slavery, the American Colonization Society, founded in 1816, proposed the idea of freeing slaves and sending them back to Africa. This solution was thought to be a compromise between antislavery activists and slavery supporters.\n\nBy 1860, nearly 12,000 African Americans had returned to Africa.\n\nMissouri Compromise\n\nThe Missouri Compromise of 1820, which allowed Missouri to become a slave state, further provoked anti-slave sentiment in the North.\n\nThe abolitionist movement began as a more organized, radical and immediate effort to end slavery than earlier campaigns. It officially emerged around 1830.\n\nHistorians believe ideas set forth during the religious movement known as the Second Great Awakening inspired abolitionists to rise up against slavery. This Protestant revival encouraged the concept of adopting renewed morals, which centered around the idea that all men are created equal in the eyes of God.\n\nAbolitionism started in states like New York and Massachusetts and quickly spread to other Northern states.\n\nLaws Inflame Tensions\n\nIn 1850, Congress passed the controversial Fugitive Slave Act, which required all escaped enslaved people to be returned to their owners and American citizens to cooperate with the captures.\n\nSeven years later, the Supreme Court ruled in the Dred Scott decision that Black people—free or enslaved—didn’t have legal citizenship rights. Owners of enslaved people were also granted the right to take their enslaved workers to Western territories. These legal actions and court decisions sparked outrage among abolitionists.\n\nFamous Abolitionists\n\nMany Americans, including free and formerly enslaved people, worked tirelessly to support the abolitionist movement. Some of the most famous abolitionists included:\n\nRift Widens Between North and South\n\nAs it gained momentum, the abolitionist movement caused increasing friction between states in the North and the slave-owning South. Critics of abolition argued that it contradicted the U.S. Constitution, which left the option of slavery up to individual states.\n\nAbolitionism was illegal in the South, and President Andrew Jackson banned the U.S. Postal Service from delivering any publications that supported the movement.\n\nIn 1833, a white student at Lane Theological Seminary named Amos Dresser was publicly whipped in Nashville, Tennessee, for possessing abolitionist literature while traveling through the city.\n\nElijah Lovejoy\n\nIn 1837, a pro-slavery mob attacked a warehouse in Alton, Illinois, in an attempt to destroy abolitionist press materials. During the raid, they shot and killed newspaper editor and abolitionist Elijah Lovejoy.\n\nAfter the Kansas-Nebraska Act of 1854 was passed, both pro- and anti-slavery groups inhabited the Kansas Territory. In 1856, a pro-slavery group attacked the town of Lawrence, which was founded by abolitionists from Massachusetts. In retaliation, abolitionist John Brown organized a raid that killed five pro-slavery settlers.\n\nThen, in 1859, Brown led 21 men to capture the U.S. arsenal at Harpers Ferry, Virginia. He and his followers were seized by a group of Marines and convicted of treason. Brown was hanged for the crime.\n\nThe Civil War and Its Aftermath\n\nPresident Abraham Lincoln opposed slavery but was cautious about fully supporting the more radical ideas of the abolitionists. As the power struggle between the North and the South reached its peak, the Civil War broke out in 1861.\n\nAs the bloody war waged on, Lincoln issued his Emancipation Proclamation of 1863, calling for the freeing of enslaved people in areas of the rebellion. And in 1865, the Constitution was ratified to include the Thirteenth Amendment, which officially abolished all forms of slavery in the United States.\n\nAbolitionist Movement Ends\n\nThough the abolitionist movement seemed to dissolve after the addition of the Thirteenth Amendment, many historians argue that the effort didn’t completely cease until the 1870 passage of the Fifteenth Amendment, which extended voting rights to Black men. Meanwhile, the Fourteenth Amendment, ratified in 1868, granted citizenship to all persons \"born or naturalized in the United States,\" including former enslaved people.\n\nWhen slavery officially ended, many prominent abolitionists turned their focus to women’s rights issues. Historians believe that the experiences and lessons learned during the abolitionist movement paved the way for leaders who were eventually successful in the women’s suffrage movements.\n\nAbolitionist ideals and traditions also served as a model for the National Association for the Advancement of Colored People (NAACP), which was formed in 1909.\n\nHISTORY Vault: Black History Watch acclaimed Black History documentaries on HISTORY Vault. WATCH NOW\n\nSources\n\nAbolition and the Abolitionists. National Geographic.\n\nEarly abolition. Khan Academy.\n\nAbolitionist Sentiment Grows. UShistory.org."}, {"url": "https://courses.lumenlearning.com/wm-ushistory1/chapter/southern-pro-slavery-arguments/", "page_content": "Learning Objectives Identify the main proslavery arguments in the years prior to the Civil War\n\nDefending Slavery\n\nWith the rise of democracy during the Jacksonian era in the 1830s, enslavers worried about the power of the majority. If political power went to a majority that was hostile to slavery, the South—and the honor of White southerners—would be imperiled. White southerners keen on preserving the institution of slavery bristled at what they perceived to be northern attempts to deprive them of their livelihood. Powerful southerners like South Carolinian John C. Calhoun highlighted laws like the Tariff of 1828 as evidence of the North’s desire to destroy the southern economy and, by extension, its culture. Such a tariff, he and others concluded, would disproportionately harm the South, which relied heavily on imports, and benefit the North, which would receive protections for its manufacturing centers. The tariff appeared to open the door for other federal initiatives, including the abolition of slavery. Because of this perceived threat to southern society, Calhoun argued that states could nullify federal laws. This belief illustrated the importance of the states’ rights argument to the southern states. It also showed enslavers’ willingness to unite against the federal government when they believed it acted unjustly against their interests.\n\nAs the nation expanded in the 1830s and 1840s, the writings of abolitionists—a small but vocal group of northerners committed to ending slavery—reached a larger national audience. White southerners responded by putting forth arguments in defense of slavery, their way of life, and their honor. Calhoun became a leading political theorist defending slavery and the rights of the South, which he saw as containing an increasingly embattled minority. He advanced the idea of a concurrent majority, a majority of a separate region (that would otherwise be in the minority of the nation) with the power to veto or disallow legislation put forward by a hostile majority.\n\nCalhoun’s idea of the concurrent majority found full expression in his 1850 essay “Disquisition on Government.” In this treatise, he wrote about government as a necessary means to ensure the preservation of society, since society existed to “preserve and protect our race.” If government grew hostile to society, then a concurrent majority had to take action, including forming a new government. “Disquisition on Government” advanced a profoundly anti-democratic argument. It illustrates southern leaders’ intense suspicion of democratic majorities and their ability to effect legislation that would challenge southern interests.\n\nCalhoun’s Defense of Slavery In this 1837 speech, John C. Calhoun, then a U.S. senator, vigorously defended the institution of slavery and stated the essence of this new intellectual defense of the institution: Southerners must stop apologizing for slavery and reject the idea that it was a necessary evil. Instead, Calhoun insisted, slavery was a “positive good.” He went further, making legal arguments about the Constitution protecting states’ rights to preserve slavery. Calhoun then offered a moral defense of slavery by claiming it to be a more humane method of organizing labor than the conditions wage laborers faced in industrial cities in Europe and the northern United States. A large portion of the Northern States believed slavery to be a sin, and would consider it as an obligation of conscience to abolish it if they should feel themselves in any degree responsible for its continuance. . . . I then predicted that it would commence as it has with this fanatical portion of society, and that they would begin their operations on the ignorant, the weak, the young, and the thoughtless –and gradually extend upwards till they would become strong enough to obtain political control . . . . . . By the necessary course of events, if left to themselves, we must become, finally, two people. It is impossible under the deadly hatred which must spring up between the two great nations, if the present causes are permitted to operate unchecked, that we should continue under the same political system. The conflicting elements would burst the Union asunder, powerful as are the links which hold it together. Abolition and the Union cannot coexist. As the friend of the Union I openly proclaim it–and the sooner it is known the better. . . . We of the South will not, cannot, surrender our institutions. To maintain the existing relations between the two races, inhabiting that section of the Union, is indispensable to the peace and happiness of both. It cannot be subverted without drenching the country in blood . . . . . . Be it good or bad, [slavery] has grown up with our society and institutions, and is so interwoven with them that to destroy it would be to destroy us as a people. But let me not be understood as admitting, even by implication, that the existing relations between the two races in the slaveholding States is an evil:–far otherwise; I hold it to be a good, as it has thus far proved itself to be to both, and will continue to prove so if not disturbed by the fell spirit of abolition. I appeal to facts. Never before has the Black race of Central Africa, from the dawn of history to the present day, attained a condition so civilized and so improved, not only physically, but morally and intellectually. In the meantime, the White or European race, has not degenerated. It has kept pace with its brethren in other sections of the Union where slavery does not exist. It is odious to make comparison; but I appeal to all sides whether the South is not equal in virtue, intelligence, patriotism, courage, disinterestedness, and all the high qualities which adorn our nature. . . . . . . I hold that in the present state of civilization, where two races of different origin, and distinguished by color, and other physical differences, as well as intellectual, are brought together, the relation now existing in the slaveholding States between the two, is, instead of an evil, a good—a positive good. . . I hold then, that there never has yet existed a wealthy and civilized society in which one portion of the community did not, in point of fact, live on the labor of the other. . . . I might well challenge a comparison between them and the more direct, simple, and patriarchal mode by which the labor of the African race is, among us, commanded by the European. I may say with truth, that in few countries so much is left to the share of the laborer, and so little exacted from him, or where there is more kind attention paid to him in sickness or infirmities of age. Compare his condition with the tenants of the poor houses in the more civilized portions of Europe—look at the sick, and the old and infirm slave, on one hand, in the midst of his family and friends, under the kind superintending care of his master and mistress, and compare it with the forlorn and wretched condition of the pauper in the poorhouse. . . . There is and always has been in an advanced stage of wealth and civilization, a conflict between labor and capital. The condition of society in the South exempts us from the disorders and dangers resulting from this conflict; and which explains why it is that the political condition of the slaveholding States has been so much more stable and quiet than that of the North. In what ways does Calhoun use legal arguments to defend the idea that Congress cannot interfere in the institution of slavery?\n\nHow does Calhoun go beyond the traditional legal defenses of slavery and attempt to convince the audience that slavery is, indeed, good for all involved? You can visit this site to read John C. Calhoun’s “Disquisition on Government.” Why do you think he proposed the creation of a concurrent majority?\n\nLink to Learning Watch this video from Heimler’s History channel to learn more about some of the main pro-slavery arguments, including the social hierarchy argument, the civilization argument, the economic argument, the racial argument, and the biblical argument.\n\nWhite southerners reacted strongly to abolitionists’ attacks on slavery. In making their defense of slavery, they critiqued wage labor in the North. They argued that the Industrial Revolution had brought about a new type of slavery—wage slavery—and that this form of “slavery” was far worse than the slave labor used on southern plantations. Defenders of the institution also lashed out directly at abolitionists such as William Lloyd Garrison for daring to call into question their way of life. Indeed, Virginians cited Garrison as the instigator of Nat Turner’s 1831 rebellion.\n\nThe Virginian George Fitzhugh contributed to the defense of slavery with his book Sociology for the South, or the Failure of Free Society (1854). Fitzhugh argued that laissez-faire capitalism, as celebrated by Adam Smith, benefited only the quick-witted and intelligent, leaving the ignorant at a huge disadvantage. Enslavers, he argued, took care of the ignorant—in Fitzhugh’s argument, the enslaved persons of the South. Southerners provided enslaved persons with care from birth to death, he asserted; this offered a stark contrast to the wage slavery of the North, where workers were at the mercy of economic forces beyond their control. Fitzhugh’s ideas exemplified southern notions of paternalism.\n\nGeorge Fitzhugh’s Defense of Slavery George Fitzhugh, a southern writer of social treatises, was a staunch supporter of slavery, not as a necessary evil but as what he argued was a necessary good, a way to take care of enslaved persons and keep them from being a burden on society. He published Sociology for the South, or the Failure of Free Society in 1854, in which he laid out what he believed to be the benefits of slavery to both the enslaved persons and society as a whole. According to Fitzhugh: [I]t is clear the Athenian democracy would not suit a negro nation, nor will the government of mere law suffice for the individual negro. He is but a grown up child and must be governed as a child . . . The master occupies towards him the place of parent or guardian. . . . The negro is improvident; will not lay up in summer for the wants of winter; will not accumulate in youth for the exigencies of age. He would become an insufferable burden to society. Society has the right to prevent this, and can only do so by subjecting him to domestic slavery. In the last place, the negro race is inferior to the white race, and living in their midst, they would be far outstripped or outwitted in the chase of free competition. . . . Our negroes are not only better off as to physical comfort than free laborers, but their moral condition is better. What arguments does Fitzhugh use to promote slavery? What basic premise underlies his ideas? Can you think of a modern parallel to Fitzhugh’s argument?\n\nThe North also produced defenders of slavery, including Louis Agassiz, a Harvard professor of zoology and geology. Agassiz helped to popularize polygenism, the idea that different human races came from separate origins. According to this formulation, no single human family origin existed, and Black people made up a race wholly separate from the White race. Agassiz’s notion gained widespread popularity in the 1850s with the 1854 publication of George Gliddon and Josiah Nott’s Types of Mankind and other books. The theory of polygenism codified racism, giving the notion of Black inferiority the lofty mantle of science. One popular advocate of the idea posited that Black people occupied a place in evolution between the Greeks and chimpanzees.\n\nTry It\n\n"}, {"url": "https://www.bbc.co.uk/teach/class-clips-video/abolitionism-and-why-it-was-opposed-by-british-slave-owners/zhdvrj6", "page_content": "DAVID OLUSOGA: 'These are Britain's forgotten slave owners.'\n\nDAVID OLUSOGA: 'In 1807, one of the most momentous events in modern British history took place. The slave trade, the trafficking of human beings from Africa across the Atlantic, was finally abolished. The man who led this campaign was William Wilberforce.'\n\nDAVID OLUSOGA: These are the stained glass windows in Wilberforce's church in Clapham. And what they depict are the lives of the saints. Not the Biblical saints, but the saints of abolition. And Wilberforce is standing there with what you presume is the 1807 act, the act he spent most of his life fighting to push through parliament. This church is rightly proud of the fact that William Wilberforce and the other abolitionists prayed and worshipped in these pews. But what's been forgotten is that sitting just a few metres away listening to the same hymns, the same sermons, was another influential and prominent member of the congregation. George Hibbert.\n\nDAVID OLUSOGA: 'George Hibbert was a slave owner. He had fought against Wilberforce and defended the slave trade. He may have lost that battle, but the fight was far from over. There were still hundreds of thousands of enslaved people, across the British Empire. The bigger battle over the future of slavery was looming.'\n\nDAVID OLUSOGA: The coming battle was to be fought in parliament but also in the churches. It was a battle of ideas, but it was also a struggle for British public opinion. For the slaves 5,000 miles away in the Caribbean it all too often became a violent struggle of uprisings followed by brutal repressions. But to make sense of why it was that the slave owners were so determined to fight on, you have to understand just what it was that they were trying to defend.\n\nDAVID OLUSOGA: 'This is a sugar plantation in Guyana. In the 18th and 19th Centuries, like today, the rich fertile soil found here enabled vast quantities of very high quality sugar to be cultivated. This made Guyana the most profitable of Britain's Caribbean posessions, and made thousands of British men and women very rich.'\n\nDAVID OLUSOGA: Among the investors who were pouring their money into Guyana in the early 19th Century were a family of Scottish traders. They bought plantations, including this place, which they would really struggle to recognise today. This is the modern incarnation of the Wales plantation which was the property of John Gladstone. Now he was the father of William Ewart Gladstone, who went on to become prime minister. This place made Gladstone a fortune. But what he worried about was what all the plantation owners here in Guyana worried about, labour. And they were convinced that the only way to maintain their secure supply of man-power was by defending slavery, no matter where opposition to it came from.\n\nDAVID OLUSOGA: 'By the 1820s, John Gladstone and other slave owners were facing strong opposition from abolitionists back home in Britain. At the heart of the battle was the new science of statistics. These are slave registers, enormous ledgers which contain the names of all the slaves working in the Caribbean. They were first compiled in 1817, and recalculated every three years.'\n\nDAVID OLUSOGA: This is the slave register for Demerara in Guyana, for all the plantations that run alongside the Demerara river. And here is the entry for the Wales plantation. And this register gives the whole number of slaves attached to the plantation Wales on the 31st of May, 1820. And it gives that number as 364. Now three years earlier, the previous registration, the census of slaves, had taken place at the Wales plantation, and at that time there had been 396 slaves living on the plantation. And as the register says, that means that 53 have died, because only 16 have been bought. So in three years on the Wales plantation there's been a mortality rate of thirteen percent. And mortality rates like that aren't unique to this plantation. Many of the plantations in this book have similar, or higher, mortality rates. And what that tells you, what that proves, is that even in the 1820s, even after the end of the slave trade, slavery was still a system that consumed the lives of human beings at an appalling rate.\n\nDAVID OLUSOGA: 'For those opposed to slavery, this was the evidence they needed to fuel their campaign against the brutal inhumanity of the slave system itself. In January 1823 a group of abolitionists, including William Wilberforce, set up the world's first anti-slavery society. Their goal, the end of slavery itself.'"}, {"url": "https://usa.chinadaily.com.cn/world/2011-01/31/content_11970208.htm", "page_content": "Pilot recalls captured Nazi leader Updated: 2011-01-31 07:54 By Matt Volz (China Daily)\n\nIn this May 9, 1945 photo provided by Brigadier General Mayhew Foster, captured Nazi leader Hermann Goering (second from right) stands on the tiny airstrip outside Kitzbuhel, Austria, before being transported back to Germany for interrogation. Provided by Mayhew Foster / Associated Press\n\nMISSOULA, Montana - Captain Mayhew Foster had an extraordinary mission: Fly captured Nazi leader Hermann Goering to the 7th Army's headquarters for interrogation.\n\nThen he took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe - all 136 kg of him - and knew he needed a bigger plane.\n\nIt was May 9, 1945, the day after World War II ended in Europe. Goering, Foster and a group of officers from the Army's 36th Infantry Division gathered on a tiny airstrip outside Kitzbuhel, Austria, to transport the highly-prized war prisoner back to Germany in an unarmed, two-man reconnaissance plane.\n\n\"They wanted to get him back where he could be debriefed. There was a strong rumor that in a mountainside in the Alps right down there in Bavaria there was a concentration of (German) military,\" Foster said. \"He just acted as though it was a nice, friendly trip.\"\n\nMayhew Foster, now 99 and living in a Missoula nursing home, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders. Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honor for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career.\n\nGoering, 52, had surrendered to the US Army's 36th Infantry Division the day before. He had fallen out of favor with Hitler and hadn't played an active role at the end of the war, though he remained Reichsmarschall of Nazi Germany.\n\nBefore his capture, Goering wrote a letter to General Dwight D. Eisenhower, Supreme Allied Commander in Europe, offering to work with Eisenhower on the conditions of the German army's surrender, according to an account of Goering's capture by Brigadier General Robert Stack kept by the 36th Infantry Division Association.\n\nAfter receiving the letter, Stack and a group of soldiers drove from the division's base near Kitzbuhel across the border into Germany and intercepted a convoy that included Goering, his wife, daughter, sister-in-law, household servants and military aides, according to the account.\n\nGoering agreed to surrender unconditionally but asked that his family be cared for, and the Nazi leader was delivered to Foster for transport the next day.\n\nFoster, who was 33 at the time, said he didn't fear getting shot down carrying such precious cargo alone in an unescorted, unarmed plane. He didn't worry about Goering taking advantage of the lack of a guard to wrest control of the aircraft.\n\nThe main problem, he said, was getting the two of them off the ground - the nimble, lightweight Piper L4 that Foster piloted in his artillery spotting missions wouldn't support both him and Goering. But the division only had the small airstrip that was fine for Foster's aircraft, but was problematic for taking off and landing larger planes.\n\nThey'd have to upgrade to the one L5 in the division's inventory, a slightly larger aircraft Foster hadn't flown in years.\n\nGoering stood on the tiny airstrip in a plain, gray uniform that was unadorned but for a pistol at his hip and a medal around his neck. Still wearing the pistol, he stepped toward the plane. A Goering aide emerged from the group that had gathered and relieved Goering of the weapon.\n\nThe Nazi leader settled into the back seat and tried to fasten his seat belt. It wouldn't stretch across his belly. He held the strap in his hand, looked at Foster and said, \"Das goot!\" - that's good.\n\nA photograph of that moment shows Foster in the cockpit and Goering seated directly behind him, his elbow jauntily propped on the plane's fuselage.\n\nThe two men spent the 55-minute flight from Kitzbuhel to Augsburg, Germany, conversing in a mix of German and English. Foster said Goering avoided any talk of Hitler or the war but appeared to relish pointing out the sites below them.\n\n\"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour and he was showing me where he grew up,\" Foster said. \"I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nHe described Goering as sharp, friendly and witty, even cracking a joke when Foster asked him when Germany began manufacturing jets.\n\n\"Too late,\" Goering replied, according to Foster.\n\nAt the time, Foster was somewhat less generous in describing the man. In a letter to his wife, Virginia Lou Foster, written soon after the mission, Foster told her that the Nazi leader was \"effeminate\" and \"gave me the creeps\".\n\n\"Several times I had the impulse to turn the plane over and see if I could shake him out but he was wedged in like a champagne cork,\" Foster wrote.\n\nAfter landing, Foster asked his passenger to sign a blank flight report. The prisoner scrawled \"Hermann Goering Reichsmarschall\" across the paper, which Foster folded and put in his pocket.\n\nIt's a document that he still has, one of Foster's most prized possessions alongside a collection of photographs of Goering, Hitler and other snapshots from the days of the Third Reich.\n\nThere was just a single jeep at the airstrip to meet the arriving flight carrying the world's most famous war prisoner. Foster rode with Goering to the gates of the 7th Army Headquarters and formally turned him over to the intelligence officer without ceremony.\n\nIt turned out, Foster learned later, those rumors of German troops hiding in the Bavarian Alps were untrue. Goering stood trial at Nuremberg, and the next year he was found guilty of war crimes.\n\nGoering was sentenced to hang, but he committed suicide instead by swallowing a cyanide capsule.\n\nSixty-five years later, Foster is trim, sharp and carries himself as a former military officer.\n\nHe still reflects on his rare insight into the Nazi leadership, and he recognizes that the experience had shifted his perceptions of the enemy. It allowed him to see the human side of those he had only known as caricatures.\n\n\"I could see that he was like one of our officers if he'd been picked up,\" Foster said. \"I wouldn't say it changed my view of the war but it showed me that there are ...\" He broke off.\n\n\"Well, I questioned all that we knew about these vicious people,\" he said.\n\nAssociated Press"}, {"url": "https://blogs.kent.ac.uk/ageofrevolution/age-of-revolution-objects/josiah-wedgwoods-medallion/", "page_content": "by Annie Sharples\n\nJosiah Wedgwood was an English potter and business man who is credited with the industrialisation of the production of pottery as well as inventing modern marketing. Wedgwood was born in 1730 and was a Unitarian and prominent abolitionist, becoming a key member of the Society for the Abolition of the Slave Trade. His main contribution to the abolitionist cause was producing the first anti-slavery medallion in 1787, depicting a kneeling slave in chains, with the phrase “Am I Not a Man and a Brother”. These medallions were mass produced and distributed and became widely worn and acknowledged, bringing public attention to the abolitionist movement. Wedgwood and the Society for the Abolition of the Slave Trade was so revolutionary in the context of eighteenth-century society, as slavery was widely accepted and relied upon, particularly economically, as much of wealthy British society was built using the profit from the slave trade. Thus, opposing slavery was opposing many wealthy and powerful members and groups of society.\n\nMany of these medallions can be seen in museums and in use; this particular one belongs to the New Room in Bristol, which was founded in 1739 by John Wesley, making it the oldest Methodist building in the world. Wesley was the founder of Methodism and, like Wedgwood, was committed to the abolitionist cause and preached against slavery as well as writing a pamphlet titled ‘Thoughts Upon Slavery’, published in 1774 and widely circulated and read, in which he stated ‘I strike at the root of this complicated villany; I absolutely deny all slave-holding to be consistent with any degree of natural justice’.[1] Wesley was a very influential figure in the fight against slavery, and his last piece of writing was a letter to William Wilberforce from his deathbed urging him to continue his work for abolition and assuring him that God was with him. Wedgwood admired Wesley and is said to have presented him with a special teapot, that was then subsequently mass produced. In the nineteenth-century Wedgwood’s pottery company also produced much of the Wesleyana, which is a collection of carved and moulded effigies celebrating the life and work of John Wesley, made from a variety of materials but the majority being ceramic.[2]\n\nThe medallion was actually designed by William Hackwood, who worked closely with Wedgwood, and it became the most famous image of a black person in all of eighteenth-century art.[3] The image and phrase became well known and a well-used and recognised symbol of allegiance to the abolitionist cause. Many people found original and creative ways to don these medallions. Thomas Clarkson, a leading abolitionist, describes in his 1808 memoirs that men ‘inlaid in gold on the lid of their snuffboxes. Of the ladies several wore them in bracelets, and others had them fitted up in an ornamental manner as pins for the hair. At length, the taste for wearing them became general; and thus fashion, which usually confines itself to worthless things, was seen for once in the honourable office of promoting the cause of justice, humanity, and freedom’.[4]It is unknown as to how many medallions were made and distributed as well as how many variants of it there were, though it is clear that a great number were produced.[5] The medallion is still used today as a symbol and is often reproduced and used when commemorating the Abolition Act of 1807. Thomas Clarkson credited Wedgwood’s medallions with being instrumental in ‘turning the attention of our countrymen to the case of the injured Africans, and of procuring a warm interest in their favour.’[6]\n\nIt was not only visual material, like Wedgwood’s medallion, that stirred abolitionist sentiment into fashionable society. Poetry was often a very popular and effective in communicating the abolitionist cause; poets including Hannah More, who was born in Bristol and lived there at the same time as Wesley did and both John and Charles Wesley were friendly with Hannah’s sister Mary.[7] More’s poem Slavery was published in 1788 and she was involved in a prominent group of abolitionists, including Wilberforce, and was known for encouraging women to join the anti-slavery movement. Another well-known abolitionist poet was William Cowper, whose 1788 poem The Negroes Complaint became famous and was often quoted during the civil rights movement in the United States centuries later by Martin Luther King Jr. Singing was also very popular amongst slaves, as a way of communicating with one another as well as expressing feeling. Songs were often passed down through generations.\n\nThe image of the kneeling slave, despite Wedgwood clearly advocating abolition, could potentially be problematic. Depicting the slave kneeling accurately demonstrates the huge imbalance of power, as it puts the slave in the weaker position; the slave is shown to be humbly asking for compassion, posing no threat. However, presenting the slave in this manner, as passive and weak, it ignores the resistance and revolutions that were initiated by enslaved communities, wiping important stories from history. One example of an influential slave rebellion is the Andry’s Rebellion, also known as the German Coast Uprising, which took place in January of 1811 in the Territory of Louisiana. This is the largest slave revolt in the history of the United States, and between 200 and 500 slaves marched on the German Coast in the direction of New Orleans. Furthermore, Wedgwood’s medallion does not portray the atrocious brutality of slavery and the horrific mental and physical anguish slaves suffered. All of this puts the focus on the slave begging for freedom, rather than the atrocities committed by the slave owners and slave traders. On one hand, it should be the enslaved people that are the focus of abolitionism, as they were greatly wronged and are so often written out of history by those with more power. Yet, on the other hand, the inhumane barbaric treatment towards slaves by slave owners and traders must not be allowed to be forgotten. In an article on the history.ac.uk website, the author argues that ‘To depict the enslaved African as begging for their freedom, pleading for the kindness and generosity of others so that they might be set free from bondage, is considered at best to be unhelpful and at worst continuing the very prejudice and discrimination which enslavement installed.’[8] The article goes on to argue that this image ‘ensures that its audience does not bear witness to the experiences of the enslaved but to the work of those who campaigned for an ending of the Atlantic slave trade. As a symbol, though the body of the enslaved is depicted, the actual corporeal experience of the enslaved is absent; the pain and horror of enslavement is not evidenced by the image.’[9] Mary Guyatt states that the slave’s confused depiction was a reflection of the conflicting demands the medallion had to meet, namely, the need to communicate its subject speedily and positively, whilst simultaneously gaining the viewer’s sympathy and arousing his or her admiration’.[10] These issues highlight the continuing need for this topic to be discussed widely and thoughtfully, yet despite this, Wedgwood’s medallion was a greatly significant contribution to the abolition cause.\n\nWedgwood’s medallion can be described as revolutionary as it is clearly promoting the abolition movement and widely spread an image of a black slave at a time when the black community was viewed as extremely inferior, and this view was generally accepted. As well as the medallion itself being revolutionary, the way in which it was used made it even more so, as it became an important symbol of revolution against slavery. Furthermore, the words “Am I Not a Man and a Brother?” challenges the reader by suggesting that slaves should be regarded as fellow men, going further still with claiming to be a brother. By phrasing it as a question, the medallion challenges the reader, thus those who wore the medallion were challenging others to think. Guyatt argues that the slave in the image ‘shares characteristics with his audience in that he is clearly a Westernized figure: as well as speaking their language, the words he utters are themselves strangely reminiscent of the language of scripture’.[11] This highlights the immorality of slavery, both by claiming that all men are brothers as well as using religious language.\n\nOthers have used Wedgwood’s original medallion, such as the American writer Elizabeth Margaret Chandler, who was the first female American writer to make the abolition of slavery her primary theme. Chandler produced a very famous image, based on Wedgwood’s 1787 medallion, depicting a female slave kneeling and in chains with the words “Am I Not a Daughter and a Sister?” Much more recently, Ken King produced another anti-slavery medallion in 2010, again based on Wedgwood’s original design, but instead depicting a contemporary woman wearing ripped clothes with her head in her knees. On the other side of King’s medallion is a quote from the book of Proverbs, chapter 31, “speak up for those who cannot speak for themselves, for the rights of all who are destitute. Speak up and judge fairly; defend the rights of the poor and needy.” King’s medallion focuses on sex slaves, tackling modern human trafficking and showing that despite slavery being illegal in the United Kingdom since 1807 and in the United States since 1865, it is still a huge issue.\n\nOverall, this medallion is not only hugely significant and impressive in itself, but also in the way that is was so widely distributed and used as a symbol for abolition. It also resulted in an image of a black slave becoming incredibly famous at a time when black people were seen and treated as inferior. Despite the issues that the image of the kneeling slave begging for freedom poses, that of ignoring the awful mental and physical pain and torture slaves suffered as well as not recognising the important resistance that enslaved people instigated, the medallion was a symbol of revolution and remains in use today when remembering the atrocities of slavery and the work of abolitionists as well as in the fight against modern slavery and human trafficking.\n\n[1] Wesley, John, Thoughts Upon Slavery, (R. Haws: University of California, 1774), p. 17.\n\n[2] New Room museum\n\n[3] New Room museum and David Dabydeen, ‘The Black Figure in 18th-Century Art’, BBC website, [http://www.bbc.co.uk/history/british/abolition/africans_in_art_gallery_02.shtml].\n\n[4] Thomas Clarkson, 1808 memoirs, from David Dabydeen, ‘The Black Figure in 18th-Century Art’, BBC website, [http://www.bbc.co.uk/history/british/abolition/africans_in_art_gallery_02.shtml].\n\n[5] Mary Guyatt, ‘The Wedgwood Slave Medallion: Values in Eighteenth-Century Design’ in Journal of Design History, Vol. 13, No. 2 (Oxford: Oxford University Press, 2000), pp. 93-105, p. 96.\n\n[6] Thomas Clarkson, The History of the Abolition of the Slave Trade, (Jazzybee Verlag: Altenmunster), p. 144.\n\n[7] Smith, Mark K., ‘Hannah More: Sunday schools, education and youth work’, in The Encyclopaedia of Informal Education, (2002). [http://infed.org/mobi/hannah-more-sunday-schools-education-and-youth-work/]\n\n[8]https://www.history.ac.uk/1807commemorated/discussion/supplicant_slave.html\n\n[9]https://www.history.ac.uk/1807commemorated/discussion/supplicant_slave.html\n\n[10] Guyatt, p. 101.\n\n[11] Guyatt, p. 99."}, {"url": "https://curiosity.lib.harvard.edu/slavery-abolition-emancipation-and-freedom/feature/abolitionists-1780-1865", "page_content": "Abolitionists, 1780-1865\n\nLauren Anderson, Harvard College Class of 2021, Social Studies\n\nOn March 16, 1827, the Black abolitionists Reverend Samuel E. Cornish and John Brown Russwurm set out on a task: “to plead our own cause.” This phrase became the opening statement of Freedom’s Journal, an abolitionist newspaper owned by the two publishers. Freedom’s Journal provided an outlet for Black authors to insert their voices into a print and literary community largely occupied by White voices, among them editor of the United States first abolitionist newspaper The Emancipator, Elihu Embree and prominent anti-slavery activist William Lloyd Garrison.\n\nAs the first Black-owned abolitionist newspaper, Freedom’s Journal and its authors signaled the entrance of Black voices and political ideas into American civic discourse. Inserting their calls for abolition into a growing print news industry, the authors of Freedom’s Journal, alongside other Black abolitionists, thinkers, writers, creatives, and artists, fashioned their collective voices into a public, a group that “sets its boundaries and its organization by its own discourse” to achieve some political end, as noted by literary critic and social theorist Michael Warner. Through narrating and illustrating their cause for abolition, Black writers and artists asserted themselves into a public body, one whose entrance into civic life permanently marked American political culture.\n\nThis essay highlights the literary and artistic movements pioneered by Black abolitionists from 1780 until the Civil War’s end in 1865. Until the 1960s and 1970s, much scholarly work on abolition retold this history from the perspective of those not directly affected by slavery’s ills. Building on a recent scholarly consensus towards examining the ideas, lives, and work of Black abolitionists, this essay recounts how Black leaders throughout the late eighteenth century and early nineteenth century used print news, visual art, and music to establish their own political culture. Incorporating newly digitized primary sources from Slavery, Abolition, Emancipation, and Freedom, this essay encourages scholars, students, and the public alike to consider how Black leaders shaped abolition into a political and social cause of their own.\n\nBlack Voices in News and Print\n\nFour years before William Lloyd Garrison published the first edition of his seminal newspaper, The Liberator, Black authors had already looked to print media as a means of achieving emancipation. While abolitionists like Garrison played a considerable role in galvanizing support for emancipation among White audiences, to decenter the importance of Black authors and artists in the struggle for abolition is to narrate an incomplete story of antebellum America.\n\nBlack newspapers enabled the free expression of Black community leaders, political thinkers, and artists, forging a site in which Blacks simultaneously argued their cause for abolition while showcasing literary talents. In addition to providing a home for political discourse, Freedom’s Journal showcased poetry written by cultural titans like Phillis Wheatley alongside religious sermons and transcriptions of public orations.\n\nFreedom’s Journal ceased publication in 1829, coinciding with Cornish and Russwurm’s ideological split over colonization, an idea popular throughout the abolition movement that sought the return of free Blacks to Africa. Although no longer an active publication, the newspaper’s influence continued through the Black writers it had cultivated. In the same year, David Walker, a former writer and subscription sales agent for Freedom’s Journal, published his seminal An Appeal to the Colored Citizens of the World in Boston, Massachusetts. Walker’s Appeal was a fiery attack on slavery and a radical call for immediate abolition. Printed as a pamphlet, the Appeal was widely circulated throughout the United States, prompting unfavorable reactions in southern states. For example, North Carolina’s state legislature levied harsh punishments to anyone who circulated the “seditious” pamphlet, while South Carolina’s governor asked his Massachusetts counterpart to jail Walker.\n\nMultiple Editions of Walker's Appeal David Walker's landmark pamphlet was published in three editions, including a posthumous 1830 publication. Slavery, Abolition, Emancipation, and Freedom includes three different copies, some of which include the responses of Walker's contemporary readers in the margins.\n\nThe text of Walker's Appeal models the body of the United States Constitution and invokes political ideals found in the Declaration of Independence, forging a critique of America’s limited democracy. The pamphlet begins with a preamble, while the body is structured in four articles. Such a rhetorical design facilitates Walker’s examination of the American legal protections Blacks were excluded from. His critique of American democratic principles is further grounded in the eighteenth- and nineteenth-century laws that prevented Black people from literacy, effectively prohibiting their participation in a political society established from written texts and constitutions. Walker asks that all “coloured men, women, and children… procure a copy of this Appeal and read it,” rebelling against nineteenth-century slave codes. While he critiques the prohibition of Black literacy, Walker simultaneously creates space for Blacks to enter into a culture of texts, discourse, and civic dialogue.\n\nIn the years preceding the Civil War, print remained key in cultivating a Black public that advocated emancipation of its own people. From 1847 to 1851, Frederick Douglass published The North Star, an anti-slavery magazine that promoted the “moral and intellectual advancement of colored people.” In 1859 brothers and abolitionists Thomas Hamilton and Robert Hamilton founded The Anglo-African Magazine. The brothers spent their childhood surrounded by abolitionist discourse; their father, William Hamilton, was an orator who both praised and criticized the placating tactics of White abolitionist newspapers like The Liberator.\n\nThe Anglo-African Magazine took a bolder approach in its call for abolition in the United States and the liberation of Blacks across the world. The magazine was radical. Its motto proclaimed that “Man must be free; if not within the law, why then, above the law.” The magazine’s content matched its powerful ambition. The Anglo-African Magazine reported on slave revolts led by enslaved people in the United States and abroad, forging a narrative in favor of transnational Black liberation. The magazine also used religious language, mirroring the growth of Black theology throughout the nineteenth century. References to God and Christianity are recurrent, crafting a moral imperative for rebellion against slavery.\n\nPrint Image and Fine Art: A Vision for Emancipation\n\nImages accompanied several texts circulated in both White and Black owned abolitionist publications. Photography became a tool of political rhetoric, one with the potential to shape and challenge Americans attitudes on abolition. Between 1780 and 1865, White abolitionists used photographs and reproducible print images to illustrate their cause and generate sympathy for the plight of enslaved people. Images used by White abolitionists highlighted slavery’s brutality by depicting its violence. A widely circulated example is the “Kneeling Slave,'' first printed in 1837. The print features an enslaved person on their knees, looking upward and pleading to the presumably White reader, “am I not a man and a brother?” Although calling for abolition, the enslaved person is undermined; they are not shown as a full human, but as a subjugated person.\n\nImages that depict the violence faced by enslaved people were also used by White abolitionists. The image “Whipped Peter” was widely circulated in an 1863 edition of the White abolitionist newspaper Harper’s Weekly by White abolitionists to show slavery’s inhumanity. The photograph captures the back of an enslaved man, scarred by whippings. Although intended to bolster the abolitionist’s cause, “Whipped Peter’s” circulation continues to show an enslaved person as someone in need of salvation, not someone with the agency to realize their own emancipation.\n\nBlack abolitionists, in contrast, used photography to control their stories and images. This strategy is epitomized by Frederick Douglass’ daguerreotypes. In his lifetime, Douglass sat for more than one hundred and sixty daguerreotype portraits, citing photography’s ability to reclaim identity. The daguerreotype, Douglass believed, would provide Black people the opportunity to forge their civic identities and control their perception by Whites; he envisioned a country in which “photography, painting, poetry, and music” could facilitate emancipation. This belief is reflected in his portraits. In one example, Douglas sits upright and is dressed in a suit. Looking directly at the viewer, he asserts his position as someone poised to engage in civic dialogue and discourse. His portrait is a powerful contrast to White abolitionists' depiction of the Blacks as a subjugated object in need of help. Douglass does not show himself as a victim, but rather as a refined, dignified, and autonomous man.\n\nBlack abolitionists' visual call for emancipation was not limited to mass circulated and reproducible images. In the fine arts, Black artists inserted their vision for abolition. Edmonia Lewis, one of the first professional Black sculptors, portrayed contemporary abolitionists using the styles and techniques of academic culture. Within the Houghton’s SAEF collection are newly digitized texts on Lewis’ life and work, including this short biography titled How Edmonia Lewis Became an Artist.\n\nLewis produced medallion portraits of well-known White abolitionists including William Lloyd Garrison, Charles Sumner, and Wendell Phillips. At the height of the Civil War, Lewis sculpted a bust of Colonel Robert Shaw, a white officer who commanded the 54th Massachusetts Infantry composed of Black soldiers, memorializing him in America’s cultural lexicon. Her 1867 sculpture, \"Forever Free,\" celebrates the Emancipation Proclamation and the end of the Civil War. A newly freed man stands upright, liberated, while a freedwoman crouches on her knees adjacent to him. Although the woman still kneels, a trope found throughout White abolitionist images, art historians like Kirsten P. Buick have provided an alternative interpretation, instead arguing that the kneeling woman represents the new possibility of marriage and family life for freed Blacks that was denied under slavery.\n\nMusic and Abolition\n\nJust as visual art allowed Black abolitionists to assert their own image and presence, music was a significant actor in the abolitionist movement. Since the beginning of the transatlantic slave trade, song had been used to communicate across the disparate languages and cultures enslaved Africans originated from. Throughout enslavement, lyrics were used by enslaved people to subvert the authority of masters, forming a hidden transcript intelligible to only the enslaved. This can be seen in the transcriptions of Gullah-Geechee music made by Thomas Wentworth Higginson during the Civil War, and in Slave Songs of the United States, the first published book of African American spirituals. By the mid nineteenth century, music became an agent of abolition.\n\nDon't You Hear the Trumpet Roar? Thomas Wentworth Higginson would eventually publish his transcriptions of Gullah-Geechee spirituals in his book Army Life in a Black Regiment. Though interpreted through Higginson's perspective, these songs show the freedom-oriented theology of enslaved and formerly enslaved Black people."}, {"url": "https://www.britannica.com/topic/abolitionism-European-and-American-social-movement", "page_content": "abolitionism , also called abolition movement , (c. 1783–1888), in western Europe and the Americas , the movement chiefly responsible for creating the emotional climate necessary for ending the transatlantic slave trade and chattel slavery . The intensification of slavery as a system, which followed Portuguese trafficking of enslaved Africans beginning in the 15th century, was driven by the European colonies in North America , South America , and the West Indies , where the plantation economy generated an immense demand for low-cost labour. Between the 16th and 19th centuries an estimated total of 12 million enslaved Africans were forcibly transported to the Americas. The brutality of slavery, made increasingly visible by the scale of its practice, sparked a reaction that insisted on its abolition altogether.\n\nOrigin of the abolition movement\n\nThe abolition movement began with criticism by rationalist thinkers of the Enlightenment of slavery’s violation of the “rights of man.” Quaker and other, evangelical religious groups condemned it for its un-Christian qualities. By the late 18th century moral disapproval of slavery was widespread, and antislavery reformers won a number of deceptively easy victories during this period. In Britain, Granville Sharp secured a legal decision in 1772 that West Indian planters could not hold slaves in Britain, because slavery was contrary to English law. In the United States, all the states north of Maryland abolished slavery between 1777 and 1804. But antislavery sentiments had little effect on the centres of slavery themselves: the massive plantations of the Deep South, the West Indies, and South America. Turning their attention to these areas, British and American abolitionists began working in the late 18th century to prohibit the importation of enslaved Africans into the British colonies and the United States. Under the leadership of William Wilberforce and Thomas Clarkson, these forces succeeded in getting the slave trade to the British colonies abolished in 1807. The United States prohibited the importation of slaves that same year, though widespread smuggling continued until about 1862.\n\nAntislavery forces then concentrated on winning the emancipation of those populations already in slavery. They were triumphant when slavery was abolished in the British West Indies by 1838 and in French possessions 10 years later."}], "Mayhew Foster was a leader in the campaign to abolish the slave trade.": [{"url": "https://www.bl.uk/learning/histcitizen/campaignforabolition/abolitionbackground/biogs/greatcampaigners.html", "page_content": "A great many individuals, as well as groups, were involved in the campaign to abolish the slave trade. The campaigners were men and women from all walks of life, from MPs to artists and writers. Freed slaves, able to offer eye witness accounts of the suffering experienced during the ' middle passage' and in the British colonies, also took part in the campaign. Below is a short list detailing the biographies of some of the campaigners discussed in this resource.\n\nThomas Clarkson (1760 - 1846)\n\n\n\n\n\nThomas Clarkson was one of the most prominent eighteenth century anti-slavery campaigners. Described by one contemporary as a 'moral steam-engine', he was an Anglican clergyman who had had a passionate interest in the abolition of the slave trade since his time at Cambridge University. As a student he wrote a prize winning essay on slavery, which was later published and brought him into contact with other anti-slavery campaigners like Granville Sharp.\n\nIn 1787, he helped form the first Abolitionist Committee. He was a crucial person to the anti-slavery campaign because of his tireless energy, his hatred of injustice and his persuasiveness in getting witnesses on board. However, more conservative campaigners like William Wilberforce thought Clarkson was a hot head.\n\nHe travelled hundreds of miles to interview people involved in the slave trade. He talked to ships' captains and crew, doctors, ex-seamen, merchants and traders for evidence. This was sometimes at great personal risk but he was able to persuade some of them to be witnesses. He also collected equipment found on slave ships.\n\nHe wrote 'The History, Rise, Progress and Accomplishment of the Abolition of the African Slave Trade by the British Parliament' in 1808 chronicling what he saw as his role in the campaign.\n\nWilliam Cowper (1731 - 1800)\n\n\n\n\n\n\n\nWilliam Cowper, the poet, wrote a number of anti-slavery poems. He was friends with the anti-slavery campaigner John Newton who asked him to write in support of the Abolitionist campaign. Cowper wrote a poem called 'The Negro's Complaint' (1788) which rapidly became very famous. He also wrote several other less well known poems on slavery in the 1780s, many of which attacked the idea that slavery was economically viable.\n\nOlaudah Equiano (1745 - 1797)\n\n\n\n\n\n\n\nEquiano was one of the most prominent black campaigners in the anti-slavery campaign. He was an ex-slave who, by the 1780s, lived as a free man in London. He is mostly remembered for his 1789 autobiography. It tells of his kidnap in Nigeria, his being sold into slavery, his journey to the West Indies, his life as a slave and his struggle to buy his freedom. Between 1789 and 1794, there were nine editions of the book and it was translated into many languages. Although not the first account of slavery from an African point of view, his book became the most popular and widely read.\n\nAlexander Falconbridge (died 1792)\n\nAlexander Falconbridge was a ship's surgeon from Bristol and a friend of John Newton. He experienced life aboard ship during four crossings of the Atlantic before quitting the slave trade on principle. The abolitionist campaigner Thomas Clarkson realised he would make an excellent witness and Falconbridge was interviewed by Richard Philips, a member of the Abolitionist Committee who used his information to publish a detailed, gritty, memorable account of conditions on board a slave ship. His book was published in 1788 and was widely read. He also gave evidence at a parliamentary hearing.\n\nElizabeth Heyrick (1769 - 1831)\n\n\n\n\n\n\n\nElizabeth Heyrick was one of the most prominent female campaigners against slavery in the 1820s and 1830s. She was a Quaker from Leicester with progressive political views, who devoted her life to social reform. She helped set up a Ladies Association in Birmingham and organised a sugar boycott in Leicester. She had very radical views, favouring the immediate emancipation of slaves while the Anti-Slavery Society preferred gradual emancipation.\n\nToussaint Louverture (c.1743 - 1803)\n\n\n\n\n\n\n\nAs one of the leaders of the Haitian revolution, Louverture is considered one of the fathers of the Haitian nation. Born around 1743, he was legally freed in 1777 and died in 1803. His name is also spelt Toussaint L'ouverture.\n\nJohn Newton (1725 - 1807)\n\n\n\n\n\n\n\nJohn Newton was a former slave trader who converted to evangelical Christianity after his miraculous escape from an Atlantic storm in 1748. He later became a clergyman and, in 1764, he was ordained as a priest. In his later years, he chose to campaign against the slave trade. He wrote a journal of his life on board a slave ship and also an anti-slavery pamphlet. He is particularly famous for the hymn 'Amazing Grace' which tells the story of his redemption through religion.\n\nMary Prince\n\n\n\n\n\n\n\nMary Prince was a slave, born in Bermuda, but brought to Britain by her owners. Once in Britain, she tried unsuccessfully to gain her freedom and decided to go public with her experiences of being a slave. Her story was narrated to the author Susannah Strickland and was published in 1831. Her account particularly appealed to female anti-slavery campaigners as it highlighted the effect slavery had on domestic life.\n\nGranville Sharp (1735 - 1813)\n\n\n\n\n\n\n\nAs chairman of the Committee to Abolish the Slave Trade, Sharp was the oldest and most experienced of the members. He had spoken out against slavery long before it was a popular cause. He worked closely with Wilberforce and Clarkson and personally lobbied the Prime Minister, William Pitt and the Leader of the Opposition, Charles Fox.\n\nHe came from a wealthy and deeply religious Yorkshire family. He was an extraordinarily active pamphleteer on slavery as well as a whole range of other topics. He also developed a reputation for taking up in court the cases of fugitive slaves who had been brought to London from the West Indies and wanted their freedom. He won a historic ruling in the James Somerset case of 1771, which forbade owners with black servants in Britain from deporting them back to slavery in the West Indies.\n\nWilliam Wilberforce (1759 - 1833)\n\n\n\n\n\n\n\nWilliam Wilberforce was the main figurehead in Parliament for the Abolitionist campaign. He was born in Kingston-upon-Hull into a wealthy family of wool merchants and represented the town as MP. He was recruited by Thomas Clarkson, who recognised that, in order to get Parliament to change the law, the anti-slavery cause needed a brilliant advocate inside Parliament itself. Wilberforce was very well suited for this role. He was a great orator, wealthy, well connected, known for his integrity and was particularly keen to improve society, especially from 1785 after his conversion to evangelical Christianity.\n\nHe made his first speech in Parliament against slavery in 1789 and made a great impression. However, a mixture of external events (including the slave rebellion in Haiti in 1791 which hardened public attitudes) and poor tactics prevented his abolition bill being passed in the House of Commons in 1791. A similar bill proposed in April 1792 was passed by MPs only after it was amended and conceded to a 'gradual' abolition of the slave trade.\n\nDuring the period of 1792-1805 when England was at war with France, support for the abolitionist campaign collapsed. Wilberforce, therefore, pursued other issues of reform but retained his belief that one day slavery would be abolished. In 1807, after a long, emotional debate, the Abolition Act was finally passed."}, {"url": "https://www.bbc.co.uk/bitesize/topics/z2qj6sg/articles/zn7rbqt", "page_content": "Narrator: In the 18th century, the movement to end the slave trade emerged. In Britain a powerful abolition movement inspired by activists and politicians from around the world began to bring about change.\n\nOlaudah Equiano: I was enslaved for many years in the West Indies and America. I bought my freedom in 1766 and settled in Britain. I became friends with many of the British abolitionists such as Granville Sharp and Thomas Clarkson. They encouraged me to write my autobiography and I travelled the country giving talks about my experiences and telling people first-hand about the horrors of slavery.\n\nToussaint Louverture: In Saint-Domingue I led the fight for our freedom from French oppression and enslavement, but also for the recognition that we were equal to the Europeans. Our struggle inspired others around the world that they too could be free from the slave trade and colonial control.\n\nLord Grenville: It was a long battle. There were hundreds of petitions to Parliament led by William Wilberforce and his allies. People from all over the country had signed over 500 petitions. In 1807 I was the prime minister when Parliament finally passed the Slave Trade Act, which abolished the buying and selling of human beings.\n\nMary Prince: But this was not the end of the struggle. While it was illegal to buy and sell people, the brutal practice of slavery continued in plantations across the Caribbean. I was the first Black woman to publish my experiences and it helped push towards the Emancipation Act of 1833, which abolished slavery in most parts of the British Empire. But although people were legally free, the law required formerly enslaved people to keep working on the plantations but they were now called apprentices. They were often treated as harshly as before.\n\nNarrator: These are just a few of the people who helped abolish slavery and there are many others who played important roles."}, {"url": "https://www.bl.uk/learning/histcitizen/campaignforabolition/summary/abolitioncampaign.html", "page_content": "This page provides a summary of the campaign for the abolition of the trans-Atlantic slave trade by breaking it into seven stages or 'steps to success'. These stages are a useful tool for analysing the tactics and also the success of the campaign. Underneath each 'step to success' is information about the campaign as well as links to historical source material. This summary page can also be downloaded as a grid in PDF format.\n\nPeople in Africa were being captured and traded by Europeans and taken to the Americas to be bought by plantation owners. Evidence to support this can be found in the following historical sources:\n\nWhat was the goal of the campaign?\n\nAbolishing the slave trade prevented people from Africa being captured, sold and used as slaves by European traders and American plantation owners.\n\nHow did the campaigners become experts on the issue?\n\nBy collecting personal accounts from former slaves and former slave traders as well as gathering information about the trade itself, abolitionists were able to support their point of view.\n\nWas there a resource pool? Who were their allies?\n\nJosiah Wedgewood, the potter, joined the campaign and designed a medallion for Abolitionist campaigners to wear. William Cowper, the author, also wrote a poem. Both were able to raise the profile of the campaign.\n\nWho were their opponents and what stood in their way?\n\nSome individuals and groups wished for the slave trade to continue. Often, they had an economic interest in slavery - some owned plantations, others profited from the trade of goods, such as sugar, grown on them. Material published by these individuals and groups reveals an alternative point of view.\n\nHow did they plan for success?\n\nThe first meeting of the Committee for the Abolition of the Slave Trade met on 22nd May 1787. The twelve members of the Committee realised that formal organisation was needed to raise the profile of the campaign. William Wilberforce, an MP, was recruited by the Committee to be the campaign's advocate in Parliament.\n\nWhat campaign tactics and media did they use to get their message across?\n\nSupporters of the Abolition campaign were numerous. They included politicians as well as writers and artists. This meant that the message of the campaign was communicated in a variety of different forms."}, {"url": "https://www.rmg.co.uk/stories/topics/how-did-slave-trade-end-britain", "page_content": "Thomas Clarkson, William Wilberforce, and the end of the slave trade in Britain\n\nDetail from a cotton handkerchief created in the 19th century (ZBA2476)\n\nClarkson and Wilberforce were two of the most prominent abolitionists, playing a vital role in the ultimate success of the campaign.\n\nClarkson was a tireless campaigner and lobbyist. He made an in-depth study of the horrors of the trade and published his findings. Clarkson toured Britain and Europe to spread the abolitionist word and inspire action. As a result, the abolition campaign grew into a popular mass movement.\n\nWilliam Wilberforce was the key figure supporting the cause within Parliament. In 1806-07, with the abolition campaign gaining further momentum, he had a breakthrough.\n\nLegislation was finally passed in both the Commons and the Lords which brought an end to Britain’s involvement in the trade. The bill received royal assent in March and the trade was made illegal from 1 May 1807. It was now against the law for any British ship or British subject to trade in enslaved people.\n\nAlthough the abolitionists had won the end of Britain’s involvement in the trade, plantation slavery still existed in British colonies. The abolition of slavery now became the main focus of the campaign though this was a long and difficult struggle. Full emancipation was not achieved until 1838 and none of the ex-slaves received compensation."}, {"url": "https://www.history.com/this-day-in-history/congress-abolishes-the-african-slave-trade", "page_content": "The U.S. Congress passes an act to “prohibit the importation of slaves into any port or place within the jurisdiction of the United States…from any foreign kingdom, place, or country.”\n\nThe first shipload of African captives to the British colonies in North America arrived at Jamestown, Virginia, in August 1619, but for most of the 17th century, European indentured servants were far more numerous in the North American British colonies than were enslaved Africans. However, after 1680, the flow of indentured servants sharply declined, leading to an explosion in the African slave trade. By the middle of the 18th century, slavery could be found in all 13 colonies and was at the core of the Southern colonies’ agricultural economy. By the time of the American Revolution, the English importers alone had brought some three million captive Africans to the Americas.\n\nWATCH: The Middle Passage on HISTORY Vault\n\nAfter the war, as enslaved labor was not as crucial an element of the Northern economy, most Northern states passed legislation to abolish slavery. However, in the South, the invention of the cotton gin in 1793 made cotton a major industry and sharply increased the need for enslaved labor. Tension arose between the North and the South as the slave or free status of new states was debated. In January 1807, with a self-sustaining population of over four million enslaved people in the South, some Southern congressmen joined with the North in voting to abolish the African slave trade, an act that became effective January 1, 1808. The widespread trade of enslaved people within the South was not prohibited, however, and children of enslaved people automatically became enslaved themselves, thus ensuring a self-sustaining population in the South.\n\nGreat Britain also banned the African slave trade in 1807, but the trade of African captives to Brazil and Cuba continued until the 1860s. By 1865, some 12 million Africans had been shipped across the Atlantic Ocean to the Americas, and more than one million of these individuals had died from mistreatment during the voyage. In addition, an unknown number of Africans died in wars and forced marches directly resulting from the Western Hemisphere’s demand for enslaved people.\n\nREAD MORE: The Atlantic Slave Trade Continued Illegally in America Until the Civil War"}, {"url": "https://historydaily.org/slave-trade-act-british-parliament-finally-abolishes-slavery-1807", "page_content": "Sugar plantation in the British colony of Antigua, 1823. (British Library/Wikimedia Commons)\n\nThe long battle to stop the transatlantic slave trade came to a head on March 25, 1807 with an act of parliament to abolish British slave trade. The journey to the Slave Trade Act of 1807 was fraught with tensions on every side of the argument, but when it finally became policy, it changed the face of England forever.\n\n\n\nBitter Sugar\n\nSugar was the single largest driving force behind the British slave trade. As a part of the Trade Triangle, slavers transported their victims to New World plantations where they cultivated and grew sugar cane, a crop that comprised one-third of the country's economy. That meant a lot of British businesses, such as the Bank of London and Lloyd's Insurance, lobbied adamantly to keep the Triangle up and running even though arguments against the slave trade were brought to the House of Lords as early as the 1600s. When Britain went to war with the North American colonies, who held their precious sugar cane plantations and where a growing movement to end the slave trade was percolating, it started to look as if the decision might be out of their hands."}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "http://www.chinadaily.com.cn/cndy/2011-01/31/content_11943016.htm", "page_content": "Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site.\n\n0108263 License for publishing multimedia online\n\n\n\nRegistration Number: 130349 Registration Number: 130349"}, {"url": "https://www.theguardian.com/world/2021/jan/03/christianitys-long-history-in-fighting-for-social-justice", "page_content": "While the great religious traditions do not support any single political dogma, throughout history they have been at the forefront of the some of the great struggles for liberty (The Guardian view on liberal Christians: is this their moment?, 1 January). The campaign to abolish the slave trade featured a number of Christians, and was led by William Wilberforce. He proposed anti-slavery motions in parliament for 18 years, culminating in the 1807 act to abolish the trade. Furthermore, some of the welfare reforms in early 20th-century Britain were inspired by Christians, such as Canon Samuel Barnett and his wife, Henrietta.\n\nIn the US, the civil rights movement was led by a Baptist minister, Martin Luther King, while Archbishop Romero was a totemic figure in campaigning against breaches of human rights in the civil war in El Salvador. The church also played a prominent role in opposing apartheid in South Africa. On the international stage, churches and Jewish groups were the main supporters of the campaign to institute the 1948 genocide convention. These examples show that religious groups have a strong record of supporting campaigns for justice and freedom, and defending those facing persecution.\n\nZaki Cooper\n\nTrustee, Council of Christians and Jews\n\nFounded by Manchester Unitarians in the early 19th century, the creation of the Guardian newspaper was partly the product of liberal Christian conscience. Your otherwise excellent editorial on the opportunities for progressive Christianity focused rather heavily on the Roman Catholic and Orthodox churches.\n\nAcross the denominational spectrum, liberal and radical Christians are keen to nurture a narrative and practice of fraternity to challenge the brutal individualism that has torn the fabric of society since the beginning of the 1980s. It is seen in practical support for food banks; the way churches make their premises available for social support groups; and the unseen work done by clergy and people of faith to support the mental health of countless people in our communities.\n\nWhen so many political promises of individual prosperity are increasingly exposed as cakeism and illusion, we should not be surprised if people return to deeper patterns of meaning and solidarity.\n\nRev Matthew Smith\n\nMinister, Framlingham and Bury St Edmunds Unitarians"}, {"url": "https://www.bbc.co.uk/bitesize/guides/z3rj7ty/revision/6", "page_content": "Society for the Abolition of the Slave Trade, 1787\n\nThe Society for the Abolition of the Slave Trade was formed in London on 22 May 1787. This was the first non-denominational committee, where different religious groups came together to strengthen their purpose.\n\nNine of the committee were Quaker and three were Anglican (Church of England). Two of the Anglicans, Granville Sharp and Thomas Clarkson, were nominated as President and Secretary.\n\nThomas Clarkson\n\nThomas Clarkson visited ports such as Bristol and Liverpool to collect evidence from over 20,000 sailors who worked on the slave trade. He obtained witnesses for the Parliamentary investigations and collected a range of objects associated with slavery - handcuffs, whips and branding irons - to use as evidence.\n\nPerhaps his most significant contribution was the tours he made across Britain. Clarkson also successfully recruited the MP William Wilberforce to be the campaign’s Parliamentary spokesmen. This provided the Society with an inside man who could get the campaign going.\n\nGranville Sharp\n\nGranville Sharp was a deeply religious man and founding member of the Society. His main contribution to the abolition movement was his ability to use the law in the struggle against the slave trade.\n\nOlaudah Equiano\n\nOlaudah Equiano attended many public meetings as part of the Society for the Abolition of the Slave Trade. He gave first-hand accounts on his life as an enslaved person. He published one of the few eyewitness accounts from someone who had been enslaved, 'The Interesting Life of Olaudah Equiano'.\n\nJohn Newton\n\nJohn Newton's sermons became famous and many supporters came to his church in London to hear his speeches. He shared public meetings and lecture tours with Clarkson and Equiano and wrote several books about his experiences in the slave trade.\n\nJosiah Wedgwood\n\nJosiah Wedgwood was another of the founding members of the Society. He made his fortune from Wedgwood pottery and used his factory to make a range of fashionable items to promote the aims of the Society."}]}