{"Mayhew Foster was a leader in the campaign for the relief of the poor.": [{"url": "https://timesofmalta.com/articles/view/mayhew-foster.348092", "page_content": "As a 33-year-old pilot at the end of World War II, then Capt. Mayhew ‘Bo’ Foster had an extraordinary mission, flying captured Nazi leader Hermann Goering from the Austrian Alps back to the 7th Army’s headquarters in Germany for interrogation.\n\nCapt. Foster took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe, all 300-plus pounds of him, and knew he needed a bigger plane.\n\nCapt. Foster, now 99, and living in a nursing home in Missoula, Montana, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders.\n\nMr Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honour for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career."}, {"url": "https://www.tester.senate.gov/newsroom/press-releases/pr-1378/", "page_content": "(FORT BELKNAP, Mont.) – U.S. Senator Jon Tester today released the following statement after learning of the passing of Brigadier General Mayhew “Bo” Foster. Gen. Foster, 99, a recipient of the Silver Star for valor, also earned the French Legion of Honor medal for his World War II service.\n\n“Montana and America will always be blessed because of people like General Foster. Sharla and I join all Montanans in praying for the general and his family, and always remembering him as a hero. General Foster dedicated his entire life to defending our freedom, and his service and bravery will never be forgotten.”\n\nIn 1945, Gen. Foster transported Nazi leader Hermann Goering from Austria to Germany where Goering was convicted of war crimes and crimes against humanity at the Nuremberg Trials.\n\nGen. Foster also served on the Western Montana State Veterans’ Cemetery Committee. In 2007, Tester worked with the committee to get the VA to break the bureaucratic logjam and approve plans for the Missoula cemetery.\n\nTester is a member of the Senate Veterans’ Affairs Committee.\n\n"}, {"url": "https://usa.chinadaily.com.cn/world/2011-01/31/content_11970208.htm", "page_content": "Pilot recalls captured Nazi leader Updated: 2011-01-31 07:54 By Matt Volz (China Daily)\n\nIn this May 9, 1945 photo provided by Brigadier General Mayhew Foster, captured Nazi leader Hermann Goering (second from right) stands on the tiny airstrip outside Kitzbuhel, Austria, before being transported back to Germany for interrogation. Provided by Mayhew Foster / Associated Press\n\nMISSOULA, Montana - Captain Mayhew Foster had an extraordinary mission: Fly captured Nazi leader Hermann Goering to the 7th Army's headquarters for interrogation.\n\nThen he took one look at the one-time heir to Adolf Hitler and commander of the fearsome Luftwaffe - all 136 kg of him - and knew he needed a bigger plane.\n\nIt was May 9, 1945, the day after World War II ended in Europe. Goering, Foster and a group of officers from the Army's 36th Infantry Division gathered on a tiny airstrip outside Kitzbuhel, Austria, to transport the highly-prized war prisoner back to Germany in an unarmed, two-man reconnaissance plane.\n\n\"They wanted to get him back where he could be debriefed. There was a strong rumor that in a mountainside in the Alps right down there in Bavaria there was a concentration of (German) military,\" Foster said. \"He just acted as though it was a nice, friendly trip.\"\n\nMayhew Foster, now 99 and living in a Missoula nursing home, recently recounted his rare one-on-one encounter with one of the most wanted Nazi leaders. Foster went on to become brigadier general of the Montana National Guard and was awarded the French Legion of Honor for his World War II service, but it was this mission that stood out as the highlight of an illustrious military career.\n\nGoering, 52, had surrendered to the US Army's 36th Infantry Division the day before. He had fallen out of favor with Hitler and hadn't played an active role at the end of the war, though he remained Reichsmarschall of Nazi Germany.\n\nBefore his capture, Goering wrote a letter to General Dwight D. Eisenhower, Supreme Allied Commander in Europe, offering to work with Eisenhower on the conditions of the German army's surrender, according to an account of Goering's capture by Brigadier General Robert Stack kept by the 36th Infantry Division Association.\n\nAfter receiving the letter, Stack and a group of soldiers drove from the division's base near Kitzbuhel across the border into Germany and intercepted a convoy that included Goering, his wife, daughter, sister-in-law, household servants and military aides, according to the account.\n\nGoering agreed to surrender unconditionally but asked that his family be cared for, and the Nazi leader was delivered to Foster for transport the next day.\n\nFoster, who was 33 at the time, said he didn't fear getting shot down carrying such precious cargo alone in an unescorted, unarmed plane. He didn't worry about Goering taking advantage of the lack of a guard to wrest control of the aircraft.\n\nThe main problem, he said, was getting the two of them off the ground - the nimble, lightweight Piper L4 that Foster piloted in his artillery spotting missions wouldn't support both him and Goering. But the division only had the small airstrip that was fine for Foster's aircraft, but was problematic for taking off and landing larger planes.\n\nThey'd have to upgrade to the one L5 in the division's inventory, a slightly larger aircraft Foster hadn't flown in years.\n\nGoering stood on the tiny airstrip in a plain, gray uniform that was unadorned but for a pistol at his hip and a medal around his neck. Still wearing the pistol, he stepped toward the plane. A Goering aide emerged from the group that had gathered and relieved Goering of the weapon.\n\nThe Nazi leader settled into the back seat and tried to fasten his seat belt. It wouldn't stretch across his belly. He held the strap in his hand, looked at Foster and said, \"Das goot!\" - that's good.\n\nA photograph of that moment shows Foster in the cockpit and Goering seated directly behind him, his elbow jauntily propped on the plane's fuselage.\n\nThe two men spent the 55-minute flight from Kitzbuhel to Augsburg, Germany, conversing in a mix of German and English. Foster said Goering avoided any talk of Hitler or the war but appeared to relish pointing out the sites below them.\n\n\"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour and he was showing me where he grew up,\" Foster said. \"I had a .45 in a shoulder holster, but he couldn't reach that. But neither could I, because I had two hands controlling the plane.\"\n\nHe described Goering as sharp, friendly and witty, even cracking a joke when Foster asked him when Germany began manufacturing jets.\n\n\"Too late,\" Goering replied, according to Foster.\n\nAt the time, Foster was somewhat less generous in describing the man. In a letter to his wife, Virginia Lou Foster, written soon after the mission, Foster told her that the Nazi leader was \"effeminate\" and \"gave me the creeps\".\n\n\"Several times I had the impulse to turn the plane over and see if I could shake him out but he was wedged in like a champagne cork,\" Foster wrote.\n\nAfter landing, Foster asked his passenger to sign a blank flight report. The prisoner scrawled \"Hermann Goering Reichsmarschall\" across the paper, which Foster folded and put in his pocket.\n\nIt's a document that he still has, one of Foster's most prized possessions alongside a collection of photographs of Goering, Hitler and other snapshots from the days of the Third Reich.\n\nThere was just a single jeep at the airstrip to meet the arriving flight carrying the world's most famous war prisoner. Foster rode with Goering to the gates of the 7th Army Headquarters and formally turned him over to the intelligence officer without ceremony.\n\nIt turned out, Foster learned later, those rumors of German troops hiding in the Bavarian Alps were untrue. Goering stood trial at Nuremberg, and the next year he was found guilty of war crimes.\n\nGoering was sentenced to hang, but he committed suicide instead by swallowing a cyanide capsule.\n\nSixty-five years later, Foster is trim, sharp and carries himself as a former military officer.\n\nHe still reflects on his rare insight into the Nazi leadership, and he recognizes that the experience had shifted his perceptions of the enemy. It allowed him to see the human side of those he had only known as caricatures.\n\n\"I could see that he was like one of our officers if he'd been picked up,\" Foster said. \"I wouldn't say it changed my view of the war but it showed me that there are ...\" He broke off.\n\n\"Well, I questioned all that we knew about these vicious people,\" he said.\n\nAssociated Press"}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://www.cambridge.org/core/books/poor-relief-in-england-13501600/F8D8DE618CBC1317803F5F2EF12B7BEA", "page_content": "References\n\nWiltshire County Records: Minutes of Proceedings in Sessions, 1563 and 1574 to 1592\n\nWiltshire County Records: Minutes of Proceedings in Sessions, 1563 and 1574 to 1592 Johnson , H. C. Wiltshire Archaeological and Natural History Society Devizes 1949\n\nWiltshire County Records: Minutes of Proceedings in Sessions, 1563 and 1574 to 1592 Johnson , H. C. Wiltshire Archaeological and Natural History Society Devizes 1949\n\nVisitations in the Diocese of Lincoln, 1517–1531\n\nVisitations in the Diocese of Lincoln, 1517–1531 Hamilton Thompson , A. Lincoln Record Society 1940\n\nVisitations in the Diocese of Lincoln, 1517–1531 Hamilton Thompson , A. Lincoln Record Society 1940\n\nVisitation Articles and Injunctions of the Period of the Reformation\n\nVisitation Articles and Injunctions of the Period of the Reformation Frere , W. H. Kennedy , W. M. London 1910 Frere , W. H.\n\nVisitation Articles and Injunctions of the Period of the Reformation Frere , W. H. Kennedy , W. M. London 1910 Frere , W. H.\n\nThe Obedyence of a Christian Man\n\nTyndale , William. The Obedyence of a Christian Man Antwerp 1528\n\nTyndale , William. The Obedyence of a Christian Man Antwerp 1528\n\nTudor Parish Documents of the Diocese of York\n\nTudor Parish Documents of the Diocese of York Purvis , J. S. Cambridge 1948\n\nTudor Parish Documents of the Diocese of York Purvis , J. S. Cambridge 1948\n\nTranscripts of Sussex Wills . . . to the year 1560\n\nTranscripts of Sussex Wills . . . to the year 1560 Rice , R. G. Sussex Record Society 1935\n\nTranscripts of Sussex Wills . . . to the year 1560 Rice , R. G. Sussex Record Society 1935\n\nThe Third Book of Remembrance of Southampton\n\nThe Third Book of Remembrance of Southampton Merson , A. L. Southampton Records Series 1952\n\nThe Third Book of Remembrance of Southampton Merson , A. L. Southampton Records Series 1952\n\nTerumber’s Chantry at Trowbridge” Jones , W. H. Wiltshire Archaeological and Natural History Magazine 10 1867 240\n\nTerumber’s Chantry at Trowbridge” Jones , W. H. Wiltshire Archaeological and Natural History Magazine 10 1867 240\n\nA Supplication of the Poore Commons\n\nA Supplication of the Poore Commons Meadows Cowper , J. Early English Text Society 1871\n\nA Supplication of the Poore Commons Meadows Cowper , J. Early English Text Society 1871\n\nTransactions of the Essex Archaeological Society\n\nThe Statutes of Saffron Walden Almshouses”\n\nSteer , Francis W. The Statutes of Saffron Walden Almshouses” Transactions of the Essex Archaeological Society 25 1958 160\n\nSteer , Francis W. The Statutes of Saffron Walden Almshouses” Transactions of the Essex Archaeological Society 25 1958 160\n\nThe Statutes, and Ordinances, for the Government of the Alms-Houses, in Woodbridge . . . Founded by Thomas Seckford\n\nThe Statutes, and Ordinances, for the Government of the Alms-Houses, in Woodbridge . . . Founded by Thomas Seckford Loder , Robert Woodbridge 1792\n\nThe Statutes, and Ordinances, for the Government of the Alms-Houses, in Woodbridge . . . Founded by Thomas Seckford Loder , Robert Woodbridge 1792\n\nStatutes of the Realm\n\nStatutes of the Realm London 1810\n\nStatutes of the Realm London 1810\n\nThe State, Civil and Ecclesiastical, of the County of Lancaster, about the year 1590 Chetham Miscellanies Chetham Society 1875\n\nThe State, Civil and Ecclesiastical, of the County of Lancaster, about the year 1590 Chetham Miscellanies Chetham Society 1875\n\nA Selection from the Prescot Court Leet and Other Records, 1447–1600\n\nA Selection from the Prescot Court Leet and Other Records, 1447–1600 Bailey , F. A. The Record Society of Lancashire and Cheshire 1937\n\nA Selection from the Prescot Court Leet and Other Records, 1447–1600 Bailey , F. A. The Record Society of Lancashire and Cheshire 1937\n\nSelected Rentals and Accounts of Medieval Hull, 1293–1528\n\nSelected Rentals and Accounts of Medieval Hull, 1293–1528 Horrux , Rosemary Yorkshire Archaeological Society Record Series 1983\n\nSelected Rentals and Accounts of Medieval Hull, 1293–1528 Horrux , Rosemary Yorkshire Archaeological Society Record Series 1983\n\nThe Sermons of Edwin Sandys\n\nSandys , Edwin. The Sermons of Edwin Sandys Ayre , John Parker Society 1842\n\nSandys , Edwin. The Sermons of Edwin Sandys Ayre , John Parker Society 1842\n\nRites of Durham, being a Description . . . of all the Ancient Monuments, Rites, and Customs [of] the Monastical Church of Durham before the Suppression\n\nRites of Durham, being a Description . . . of all the Ancient Monuments, Rites, and Customs [of] the Monastical Church of Durham before the Suppression Fowler , J. T. Surtees Society 1903\n\nRites of Durham, being a Description . . . of all the Ancient Monuments, Rites, and Customs [of] the Monastical Church of Durham before the Suppression Fowler , J. T. Surtees Society 1903\n\nReports of the Charity Commissioners for England and Wales\n\nReports of the Charity Commissioners for England and Wales Parliamentary Papers London 1819\n\nReports of the Charity Commissioners for England and Wales Parliamentary Papers London 1819\n\nThe Register of the Guild of Corpus Christi in the City of York\n\nThe Register of the Guild of Corpus Christi in the City of York Surtees Society 1872\n\nThe Register of the Guild of Corpus Christi in the City of York Surtees Society 1872\n\nRecords of Maidstone, being selections from documents in the possession of the Corporation\n\nRecords of Maidstone, being selections from documents in the possession of the Corporation Martin , K. S. Maidstone 1926\n\nRecords of Maidstone, being selections from documents in the possession of the Corporation Martin , K. S. Maidstone 1926\n\nThe Records of the City of Norwich\n\nThe Records of the City of Norwich Hudson , William Tingey , J. C. Norwich 1910\n\nThe Records of the City of Norwich Hudson , William Tingey , J. C. Norwich 1910\n\nRecords of the Borough of Nottingham\n\nRecords of the Borough of Nottingham London 1885\n\nRecords of the Borough of Nottingham London 1885\n\nRecords of the Borough of Leicester\n\nRecords of the Borough of Leicester Bateson , Mary Cambridge 1905\n\nRecords of the Borough of Leicester Bateson , Mary Cambridge 1905\n\nRecords of the Borough of Crossgate, Durham, 1312–1531\n\nRecords of the Borough of Crossgate, Durham, 1312–1531 Britnell , Richard Surtees Society 2008\n\nRecords of the Borough of Crossgate, Durham, 1312–1531 Britnell , Richard Surtees Society 2008\n\nProceedings in the Parliaments of Elizabeth I\n\nProceedings in the Parliaments of Elizabeth I Hartley , T. E. Leicester 1981\n\nProceedings in the Parliaments of Elizabeth I Hartley , T. E. Leicester 1981\n\nThe Pre-Reformation Records of All Saints’ Church, Bristol: Wills, The Halleway Chantry Records and Deeds\n\nThe Pre-Reformation Records of All Saints’ Church, Bristol: Wills, The Halleway Chantry Records and Deeds Burgess , Clive Bristol Record Society 2004\n\nThe Pre-Reformation Records of All Saints’ Church, Bristol: Wills, The Halleway Chantry Records and Deeds Burgess , Clive Bristol Record Society 2004\n\nThe Papers of Nathaniel Bacon of Stiffkey\n\nThe Papers of Nathaniel Bacon of Stiffkey Hassell Smith , A. Baker , G. M. Norfolk Record Society 1990\n\nThe Papers of Nathaniel Bacon of Stiffkey Hassell Smith , A. Baker , G. M. Norfolk Record Society 1990\n\nThe Ordinances of Bristol, 1506–1598\n\nThe Ordinances of Bristol, 1506–1598 Stanford , Maureen Bristol Record Society 1990\n\nThe Ordinances of Bristol, 1506–1598 Stanford , Maureen Bristol Record Society 1990\n\nThe Norwich Census of the Poor, 1570\n\nThe Norwich Census of the Poor, 1570 Pound , John F. Norfolk Record Society 1971\n\nThe Norwich Census of the Poor, 1570 Pound , John F. Norfolk Record Society 1971\n\nNicholas Eyffeler of Warwick, Glazier: Executors’ Accounts and Other Documents Farr , M. W. Miscellany I Dugdale Society Publications 1977\n\nNicholas Eyffeler of Warwick, Glazier: Executors’ Accounts and Other Documents Farr , M. W. Miscellany I Dugdale Society Publications 1977\n\nMinutes and Accounts of the Corporation of Stratford-upon-Avon and Other Records\n\nMinutes and Accounts of the Corporation of Stratford-upon-Avon and Other Records Savage , Richard Dugdale Society Publications 1921 Savage , Richard Fripp , E. I. Savage , Richard Fripp , E. I. Fox , Levi\n\nMinutes and Accounts of the Corporation of Stratford-upon-Avon and Other Records Savage , Richard Dugdale Society Publications 1921 Savage , Richard Fripp , E. I. Savage , Richard Fripp , E. I. Fox , Levi\n\nThe London Surveys of Ralph Treswell\n\nThe London Surveys of Ralph Treswell Schofield , John London Topographical Society 1987\n\nThe London Surveys of Ralph Treswell Schofield , John London Topographical Society 1987\n\nLondon and Middlesex Chantry Certificates, 1548 Kitching , C. J. London Record Society 1980\n\nLondon and Middlesex Chantry Certificates, 1548 Kitching , C. J. London Record Society 1980\n\nLiverpool Town Books: Proceedings of Assemblies, Common Councils, Portmoot Courts, etc., 1550–1862\n\nLiverpool Town Books: Proceedings of Assemblies, Common Councils, Portmoot Courts, etc., 1550–1862 Twemlow , Jesse A. Liverpool 1935\n\nLiverpool Town Books: Proceedings of Assemblies, Common Councils, Portmoot Courts, etc., 1550–1862 Twemlow , Jesse A. Liverpool 1935\n\nList and Index Society Calendar of Patent Rolls, 39 Elizabeth London 2008\n\nList and Index Society Calendar of Patent Rolls, 39 Elizabeth London 2008\n\nList and Index Society Calendar of Patent Rolls, 33 Elizabeth I London 2005\n\nList and Index Society Calendar of Patent Rolls, 33 Elizabeth I London 2005\n\nList and Index Society Calendar of Patent Rolls, 32 Elizabeth I. Pt. 1 London 2004\n\nList and Index Society Calendar of Patent Rolls, 32 Elizabeth I. Pt. 1 London 2004\n\nLife, Love and Death in North-East Lancashire, 1510 to 1537: A Translation of the Act Book of the Ecclesiastical Court of Whalley\n\nLife, Love and Death in North-East Lancashire, 1510 to 1537: A Translation of the Act Book of the Ecclesiastical Court of Whalley Lynch , Margaret Remains Historical and Literary . . . of Lancaster and Chester, Chetham Society 2006\n\nLife, Love and Death in North-East Lancashire, 1510 to 1537: A Translation of the Act Book of the Ecclesiastical Court of Whalley Lynch , Margaret Remains Historical and Literary . . . of Lancaster and Chester, Chetham Society 2006\n\n“A Sermon Preached . . . before the Kinges Maiestie.”\n\nLever , Thomas. “A Sermon Preached . . . before the Kinges Maiestie.” Arber , Edward London 1870\n\nLever , Thomas. “A Sermon Preached . . . before the Kinges Maiestie.” Arber , Edward London 1870\n\nThe Vision of Piers Plowman [B-Text]\n\nLangland , William. The Vision of Piers Plowman [B-Text] Schmidt , A. V. C. London 1978\n\nLangland , William. The Vision of Piers Plowman [B-Text] Schmidt , A. V. C. London 1978\n\nThe Duties of Constables, Borsholders, Tithingmen, and such other low Ministers of the Peace\n\nLambarde , William. The Duties of Constables, Borsholders, Tithingmen, and such other low Ministers of the Peace London 1584\n\nLambarde , William. The Duties of Constables, Borsholders, Tithingmen, and such other low Ministers of the Peace London 1584\n\nKentish Visitations of Archbishop William Warham and His Deputies, 1511–1512\n\nKentish Visitations of Archbishop William Warham and His Deputies, 1511–1512 Wood-Legh , K. L. Kent Archaeological Society 1984\n\nKentish Visitations of Archbishop William Warham and His Deputies, 1511–1512 Wood-Legh , K. L. Kent Archaeological Society 1984\n\nThe Injunctions and Other Ecclesiastical Proceedings of Richard Barnes, Bishop of Durham, from 1575 to 1587\n\nThe Injunctions and Other Ecclesiastical Proceedings of Richard Barnes, Bishop of Durham, from 1575 to 1587 Surtees Society 1850\n\nThe Injunctions and Other Ecclesiastical Proceedings of Richard Barnes, Bishop of Durham, from 1575 to 1587 Surtees Society 1850\n\nThe Household Papers of Henry Percy, Ninth Earl of Northumberland (1564–1632)\n\nThe Household Papers of Henry Percy, Ninth Earl of Northumberland (1564–1632) Batho , G. R. Camden Society 1962\n\nThe Household Papers of Henry Percy, Ninth Earl of Northumberland (1564–1632) Batho , G. R. Camden Society 1962\n\nHousehold Accounts from Medieval England Woolgar , C. M. Oxford 1993\n\nHousehold Accounts from Medieval England Woolgar , C. M. Oxford 1993\n\nA Pamphlet of the Offices, and Duties of Every Particular Sworne Officer, of the City of Excester\n\nHooker , John. A Pamphlet of the Offices, and Duties of Every Particular Sworne Officer, of the City of Excester London 1584\n\nHooker , John. A Pamphlet of the Offices, and Duties of Every Particular Sworne Officer, of the City of Excester London 1584\n\nReport on the Manuscripts of Lord Middleton, Preserved at Wollaton Hall, Nottinghamshire\n\nHistorical Manuscripts Commission Report on the Manuscripts of Lord Middleton, Preserved at Wollaton Hall, Nottinghamshire London 1911\n\nHistorical Manuscripts Commission Report on the Manuscripts of Lord Middleton, Preserved at Wollaton Hall, Nottinghamshire London 1911\n\nReport on the Manuscripts of Lord de L’Isle and Dudley\n\nHistorical Manuscripts Commission Report on the Manuscripts of Lord de L’Isle and Dudley London 1925\n\nHistorical Manuscripts Commission Report on the Manuscripts of Lord de L’Isle and Dudley London 1925\n\nReport on the Manuscripts of the Corporation of Beverley\n\nHistorical Manuscripts Commission Report on the Manuscripts of the Corporation of Beverley London 1900\n\nHistorical Manuscripts Commission Report on the Manuscripts of the Corporation of Beverley London 1900\n\nCalendar of the Manuscripts of the . . . Marquis of Salisbury\n\nHistorical Manuscripts Commission Calendar of the Manuscripts of the . . . Marquis of Salisbury London 1895\n\nHistorical Manuscripts Commission Calendar of the Manuscripts of the . . . Marquis of Salisbury London 1895\n\nCalendar of the Manuscripts of the Dean and Chapter of Wells\n\nHistorical Manuscripts Commission Calendar of the Manuscripts of the Dean and Chapter of Wells London 1907\n\nHistorical Manuscripts Commission Calendar of the Manuscripts of the Dean and Chapter of Wells London 1907\n\nThe Hellard Almshouses and Other Stevenage Charities, 1482–2005\n\nThe Hellard Almshouses and Other Stevenage Charities, 1482–2005 Ashby , Margaret Hertfordshire Record Publications 2005\n\nThe Hellard Almshouses and Other Stevenage Charities, 1482–2005 Ashby , Margaret Hertfordshire Record Publications 2005\n\nThe Description of England\n\nHarrison , William. The Description of England Edelen , Georges Ithaca, New York 1968\n\nHarrison , William. The Description of England Edelen , Georges Ithaca, New York 1968\n\nA Caveat or Warning for Common Cursitors, Vulgarly Called Vagabonds\n\nHarman , Thomas. A Caveat or Warning for Common Cursitors, Vulgarly Called Vagabonds Judges , A. V. London 1930\n\nHarman , Thomas. A Caveat or Warning for Common Cursitors, Vulgarly Called Vagabonds Judges , A. V. London 1930\n\nA Chronicle at Large and Mere History of the Affayres of England\n\nGrafton , Richard. A Chronicle at Large and Mere History of the Affayres of England London 1569\n\nGrafton , Richard. A Chronicle at Large and Mere History of the Affayres of England London 1569\n\nThe Gild of St. Mary, Lichfield\n\nThe Gild of St. Mary, Lichfield Furnivall , F. J. Early English Text Society London 1920\n\nThe Gild of St. Mary, Lichfield Furnivall , F. J. Early English Text Society London 1920\n\nA Supplicacyon for the Beggers\n\nFish , Simon. A Supplicacyon for the Beggers Furnivall , Frederick J. Early English Text Society 1871\n\nFish , Simon. A Supplicacyon for the Beggers Furnivall , Frederick J. Early English Text Society 1871\n\nThe First Ledger Book of High Wycombe\n\nThe First Ledger Book of High Wycombe Greaves , R. W. Buckinghamshire Record Society 1956\n\nThe First Ledger Book of High Wycombe Greaves , R. W. Buckinghamshire Record Society 1956\n\nThe Fifteenth Century Cartulary of St. Nicholas’ Hospital, Salisbury\n\nThe Fifteenth Century Cartulary of St. Nicholas’ Hospital, Salisbury Wordsworth , Christopher Wiltshire Record Society 1902\n\nThe Fifteenth Century Cartulary of St. Nicholas’ Hospital, Salisbury Wordsworth , Christopher Wiltshire Record Society 1902\n\nAn Ease for Overseers of the Poore\n\nAn Ease for Overseers of the Poore [London] 1601\n\nAn Ease for Overseers of the Poore [London] 1601\n\nTransactions of the Shropshire Archaeological Society\n\nThe Earliest Book of the Drapers’ Company, Shrewsbury”\n\nThe Earliest Book of the Drapers’ Company, Shrewsbury” Transactions of the Shropshire Archaeological Society 36 1913 135\n\nThe Earliest Book of the Drapers’ Company, Shrewsbury” Transactions of the Shropshire Archaeological Society 36 1913 135\n\nDocumentary Annals of the Reformed Church of England\n\nDocumentary Annals of the Reformed Church of England Cardwell , Edward Oxford 1844\n\nDocumentary Annals of the Reformed Church of England Cardwell , Edward Oxford 1844\n\nCratfield: A Transcript of the Accounts of the Parish\n\nCratfield: A Transcript of the Accounts of the Parish Holland , William London 1895\n\nCratfield: A Transcript of the Accounts of the Parish Holland , William London 1895\n\nThe Coventry Leet Book or Mayor’s Register. Part 3\n\nThe Coventry Leet Book or Mayor’s Register. Part 3 Harris , Mary D. Early English Text Society 1909\n\nThe Coventry Leet Book or Mayor’s Register. Part 3 Harris , Mary D. Early English Text Society 1909\n\nThe Courts of the Archdeaconry of Buckingham, 1483–1523\n\nThe Courts of the Archdeaconry of Buckingham, 1483–1523 Elvey , E. M. Buckinghamshire Record Society 1975\n\nThe Courts of the Archdeaconry of Buckingham, 1483–1523 Elvey , E. M. Buckinghamshire Record Society 1975\n\nCourt Leet Records [of Southampton] Hearnshaw , F. J. C. Hearnshaw , D. M. Southampton Record Society Publications 1905\n\nCourt Leet Records [of Southampton] Hearnshaw , F. J. C. Hearnshaw , D. M. Southampton Record Society Publications 1905\n\nA Copy of the Ordinances, Statutes and Rules for the Order and Government of the Hospital in the Town of Warwick called “The Hospital of Robert Earl of Leicester in Warwick.”\n\nA Copy of the Ordinances, Statutes and Rules for the Order and Government of the Hospital in the Town of Warwick called “The Hospital of Robert Earl of Leicester in Warwick.” Warwick 1840\n\nA Copy of the Ordinances, Statutes and Rules for the Order and Government of the Hospital in the Town of Warwick called “The Hospital of Robert Earl of Leicester in Warwick.” Warwick 1840\n\nThe Hye Way to the Spyttell Hous\n\nCopland , Robert. The Hye Way to the Spyttell Hous Judges , A. V. London 1930\n\nCopland , Robert. The Hye Way to the Spyttell Hous Judges , A. V. London 1930\n\nCollections for An History of Sandwich in Kent\n\nCollections for An History of Sandwich in Kent Boys , William Canterbury 1792\n\nCollections for An History of Sandwich in Kent Boys , William Canterbury 1792\n\nChapter Acts of the Cathedral Church of St. Mary of Lincoln, A.D. 1520–1536\n\nChapter Acts of the Cathedral Church of St. Mary of Lincoln, A.D. 1520–1536 Cole , R. E. G. Publications of the Lincoln Record Society 1915\n\nChapter Acts of the Cathedral Church of St. Mary of Lincoln, A.D. 1520–1536 Cole , R. E. G. Publications of the Lincoln Record Society 1915\n\nThe Certificates of the Commissioners appointed to Survey the Chantries, Guilds, Hospitals, etc. in the County of York\n\nThe Certificates of the Commissioners appointed to Survey the Chantries, Guilds, Hospitals, etc. in the County of York Page , W. Surtees Society 1894\n\nThe Certificates of the Commissioners appointed to Survey the Chantries, Guilds, Hospitals, etc. in the County of York Page , W. Surtees Society 1894\n\nA Catalogue of the Manuscripts in the Cottonian Library deposited in the British Museum\n\nA Catalogue of the Manuscripts in the Cottonian Library deposited in the British Museum London 1802\n\nA Catalogue of the Manuscripts in the Cottonian Library deposited in the British Museum London 1802\n\nCartulary of St. Mark’s Hospital, Bristol Ross , C. D. Bristol Record Society 1959\n\nCartulary of St. Mark’s Hospital, Bristol Ross , C. D. Bristol Record Society 1959\n\nThe Cartulary of God’s House, Southampton\n\nThe Cartulary of God’s House, Southampton Kaye , J. M. Southamptonshire Record Society 1976\n\nThe Cartulary of God’s House, Southampton Kaye , J. M. Southamptonshire Record Society 1976\n\nCalendar of the Patent Rolls (1452–1582)\n\nCalendar of the Patent Rolls (1452–1582) 25 vols London 1911\n\nCalendar of the Patent Rolls (1452–1582) 25 vols London 1911\n\nCalendar of State Papers, Domestic Series, of the Reign of Edward VI, 1547–1553\n\nCalendar of State Papers, Domestic Series, of the Reign of Edward VI, 1547–1553 Knighton , C. S. London 1992\n\nCalendar of State Papers, Domestic Series, of the Reign of Edward VI, 1547–1553 Knighton , C. S. London 1992\n\nCalendar of Letters and Papers, Foreign and Domestic, of the Reign of Henry VIII\n\nCalendar of Letters and Papers, Foreign and Domestic, of the Reign of Henry VIII London 1864\n\nCalendar of Letters and Papers, Foreign and Domestic, of the Reign of Henry VIII London 1864\n\nCalendar of Charters and Other Documents belonging to the Hospital of William Wyggeston at Leicester\n\nCalendar of Charters and Other Documents belonging to the Hospital of William Wyggeston at Leicester Hamilton Thompson , A. Leicester 1933\n\nCalendar of Charters and Other Documents belonging to the Hospital of William Wyggeston at Leicester Hamilton Thompson , A. Leicester 1933\n\nOrders for the Town and Borough of Morpeth, 1523”\n\nBoyle , J. R. Orders for the Town and Borough of Morpeth, 1523” Archaeologia Aeliana 13 1889 209\n\nBoyle , J. R. Orders for the Town and Borough of Morpeth, 1523” Archaeologia Aeliana 13 1889 209\n\nBooks of Examinations and Depositions [of Southampton], 1570–1594\n\nBooks of Examinations and Depositions [of Southampton], 1570–1594 Hamilton , Gertrude H. Aubrey , E. R. Southampton Record Society Publications 1914\n\nBooks of Examinations and Depositions [of Southampton], 1570–1594 Hamilton , Gertrude H. Aubrey , E. R. Southampton Record Society Publications 1914\n\nThe Book of John Fisher, Town Clerk and Deputy Recorder of Warwick (1580–1588)\n\nThe Book of John Fisher, Town Clerk and Deputy Recorder of Warwick (1580–1588) Kemp , Thomas Warwick 1900\n\nThe Book of John Fisher, Town Clerk and Deputy Recorder of Warwick (1580–1588) Kemp , Thomas Warwick 1900\n\nThe Boke of Justices of Peas, the charge with all the processe of the cessions\n\nThe Boke of Justices of Peas, the charge with all the processe of the cessions London 1506\n\nThe Boke of Justices of Peas, the charge with all the processe of the cessions London 1506\n\nThe Boke for a Justyce of Peace neverso wel and dylygently set forth\n\nThe Boke for a Justyce of Peace neverso wel and dylygently set forth London 1538\n\nThe Boke for a Justyce of Peace neverso wel and dylygently set forth London 1538\n\nThe Early Works of Thomas Becon . . . Published by Him in the Reign of King Henry VIII\n\nBecon , Thomas. “The Pathway unto Prayer” and “A Pleasant New Nosegay.” The Early Works of Thomas Becon . . . Published by Him in the Reign of King Henry VIII Ayre , John Parker Society 1843\n\nBecon , Thomas. “The Pathway unto Prayer” and “A Pleasant New Nosegay.” The Early Works of Thomas Becon . . . Published by Him in the Reign of King Henry VIII Ayre , John Parker Society 1843\n\nThe Fraternity of Vagabonds\n\nAwdeley , John. The Fraternity of Vagabonds Judges , A. V. London 1930\n\nAwdeley , John. The Fraternity of Vagabonds Judges , A. V. London 1930\n\nAncient Statutes of Heytesbury Almshouse” Jackson , Canon Wiltshire Archaeological and Natural History Magazine 11 1869 289\n\nAncient Statutes of Heytesbury Almshouse” Jackson , Canon Wiltshire Archaeological and Natural History Magazine 11 1869 289\n\nActs of the Privy Council of England, 1542–1604\n\nActs of the Privy Council of England, 1542–1604 Dasent , J. R. London 1890\n\nActs of the Privy Council of England, 1542–1604 Dasent , J. R. London 1890\n\nThe Acts of the Dean and Chapter of the Cathedral Church of Chichester, 1545–1642\n\nThe Acts of the Dean and Chapter of the Cathedral Church of Chichester, 1545–1642 Peckham , W. D. Sussex Record Society 1959\n\nThe Acts of the Dean and Chapter of the Cathedral Church of Chichester, 1545–1642 Peckham , W. D. Sussex Record Society 1959\n\nAccounts of the Roberts Family of Boarzell, Sussex, c. 1568–1582\n\nAccounts of the Roberts Family of Boarzell, Sussex, c. 1568–1582 Tittler , Robert Sussex Record Society 1977\n\nAccounts of the Roberts Family of Boarzell, Sussex, c. 1568–1582 Tittler , Robert Sussex Record Society 1977\n\nThe Accounts of the Chamberlains of the City of Bath, 1568–1602\n\nThe Accounts of the Chamberlains of the City of Bath, 1568–1602 Wardle , F. D. Somerset Record Society 1923\n\nThe Accounts of the Chamberlains of the City of Bath, 1568–1602 Wardle , F. D. Somerset Record Society 1923\n\nSecondary Studies\n\nAdair , Richard. Courtship, Illegitimacy and Marriage in Early Modern England Manchester 1996\n\nAers , David. and Problems in the Perception of Poverty: A Culture in Transition” Leeds Studies in English 14 1983 5\n\nAndrews , Sue Springall , Tony Hadleigh and the Alabaster Family Self-published 2005\n\nArcher , Ian W. The Arts and Acts of Memorialization in Early Modern London Imagining Early Modern London Merritt , J. F. Cambridge 2001\n\nArcher , Ian W. The Charity of Early Modern Londoners” Transactions of the Royal Historical Society 12 2002 223\n\nArcher , Ian W. The Charity of London Widows in the Later Sixteenth and Early Seventeenth Centuries Local Identities in Late Medieval and Early Modern England Jones , Norman L. Woolf , Daniel Basingstoke 2007\n\nArcher , Ian W. Hospitals in Sixteenth- and Seventeenth-Century England Europäisches Spitalwesen. Institutionelle Fürsorge in Mittelalter und Früher Neuzeit Scheutz , Martin Sommerlechner , Andrea Weigl , Herwig Weiss , Alfred Stefan Munich 2008\n\nArcher , Ian W. The Pursuit of Stability: Social Relations in Elizabethan London Cambridge 1991\n\nAtherton , Ian McGrath , Eileen Tomkins , Alannah ‘Pressed Down by Want and Afflicted with Poverty, Wounded and Maimed in War or Worn Down with Age?’ Cathedral Almsmen in England 1538–1914 Medicine, Charity and Mutual Aid: The Consumption of Health and Welfare in Britain, c. 1550–1950 Borsay , Anne Shapely , Peter Aldershot 2007\n\nAult , Warren O. By-Laws of Gleaning and the Problems of Harvest” Economic History Review 14 1961 210\n\nAult , Warren O. Manor Court and Parish Church in Fifteenth-Century England: A Study of Village By-Laws” Speculum 42 1967 53\n\nAult , Warren O. The Village Church and the Village Community in Mediaeval England” Speculum 45 1970 197\n\nAydelotte , Frank. Elizabethan Rogues and Vagabonds. Orig. publ 1913 London\n\nBailey , Brian. Almshouses London 1988\n\nBainbridge , Virginia R. Gilds in the Medieval Countryside Woodbridge 1996\n\nBarron , Caroline M. London in the Later Middle Ages Oxford 2004\n\nBarron , Caroline M. The Parish Fraternities of Medieval London The Church in Pre-Reformation Society Barron , Caroline M. Harper-Bill , C. Woodbridge 1985\n\nBeier , A. L. Masterless Men: The Vagrancy Problem in England, 1560–1640 London 1985\n\nBeier , A. L. On the Boundaries of New and Old Historicisms: Thomas Harman and the Literature of Roguery” English Literary Renaissance 33 2003 181\n\nBeier , A. L. The Problem of the Poor in Tudor and Early Stuart England London 1983\n\nBeier , A. L. The Social Problems of an Elizabethan Country Town Country Towns in Pre-Industrial England Clark , Peter Leicester 1981\n\nBeier , A. L. Vagrants and the Social Order in Elizabethan England” Past and Present 64 1974 3\n\nBelfield , Gervase. Cardinal Beaufort’s Almshouse of Noble Poverty at St Cross, Winchester” Proceedings of the Hampshire Field Club and Archaeological Society 38 1982 103\n\nBen-Amos , Ilana Krausman. The Culture of Giving: Informal Support and Gift-Exchange in Early Modern England Cambridge 2008\n\nBen-Amos , Ilana Krausman. Gifts and Favors: Informal Support in Early Modern England” Journal of Modern History 72 2000 295\n\nBennett , Judith M. Conviviality and Charity in Medieval and Early Modern England” Past and Present 134 1992 19\n\nBewes , Wyndham Anstis. Church Briefs London 1896\n\nBittle , William G. Lane , R. T. Inflation and Philanthropy in England: A Re-Assessment of W. K. Jordan’s Data” Economic History Review 29 1976 203\n\nBlanchard , Ian. Population Change, Enclosure, and the Early Tudor Economy” Economic History Review 23 1970 427\n\nBosworth , G. F. History of Walthamstow Charities, 1487–1920 Walthamstow Antiquarian Society Publications 1920\n\nBotelho , Lynn A. Old Age and the English Poor Law, 1500–1700 Woodbridge 2004\n\nBrigden , Susan. Religion and Social Obligation in Early Sixteenth-Century London” Past and Present 103 1984 67\n\nBritnell , Richard. English Agricultural Output and Prices, 1350–1450: National Trends and Regional Divergences Agriculture and Rural Society after the Black Death Dodds , Ben Britnell , Richard Hatfield 2008\n\nBroad , John. Housing the Rural Poor in Southern England, 1650–1850” Agricultural History Review 48 2000 151\n\nBroadberry , Stephen Campbell , Bruce M. S. van Leeuwen , Bas 2010 www2.warwick.ac.uk/fac/soc/economics/staff/academic/broadberry/wp/medievalpopulation7.pdf\n\nBrown , Andrew D. Popular Piety in Late Medieval England Oxford 1995\n\nBrown , W. Newman. The Receipt of Poor Relief and Family Situation Land, Kinship and Life-Cycle Smith , Richard M. Cambridge 1984\n\nBurgess , Clive. The Benefactions of Mortality: The Lay Response in the Late Medieval Urban Parish Studies in Clergy and Ministry in Medieval England Smith , David M. Borthwick Studies in History York 1991\n\nBurgess , Clive. The Broader Church? A Rejoinder to ‘Looking Beyond’” English Historical Review 119 2004 100\n\nBurgess , Clive. London Parishioners in Times of Change: St Andrew Hubbard, Eastcheap, . 1450–1570” Journal of Ecclesiastical History 53 2002 38\n\nBurgess , Clive. Pre-Reformation Churchwardens’ Accounts and Parish Government: Lessons from London and Bristol” English Historical Review 117 2002 306\n\nBurgess , Clive. A Service for the Dead: The Form and Function of the Anniversary in Late Medieval Bristol” Transactions of the Bristol and Gloucestershire Archaeological Society 105 1987 183\n\nBurgess , Clive. Time and Place: The Late Medieval English Parish in Perspective The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nBurgess , Clive Kümin , Beat Penitential Bequests and Parish Regimes in Late Medieval England” Journal of Ecclesiastical History 44 1993 610\n\nCampbell , Bruce M. S. Four Famines and a Pestilence: Harvest, Price, and Wage Variations in England, 13th to 19th Centuries Agrarhistoria på Många Sätt; 28 studier om manniskan och jorden. Festskrift till Janken Myrdal [Agrarian History Many Ways] Liljewall , Britt Flygare , I. A. Lange , U. Ljunggren , L. Söderberg , J. Stockholm 2009\n\nCampbell , Bruce M. S. Grain Yields on English Demesnes after the Black Death Town and Countryside in the Age of the Black Death: Essays in Honour of John Hatcher Bailey , Mark Rigby , S. H. Turnhout\n\nCampbell , Bruce M. S. Physical Shocks, Biological Hazards, and Human Impacts: The Crisis of the Fourteenth Century Revisited Le interazioni fra economia e ambiente biologico nell’Europe preindustriale. Secc. XIII-XVIII [Economic and Biological Interactions in Pre-Industrial Europe from the 13th to the 18th Centuries] Cavaciocchi , Simonetta Prato 2010\n\nCannan , Edwin. The History of Local Rates in England London 1912\n\nCarlin , Martha. Medieval English Hospitals The Hospital in History Granshaw , Lindsay Porter , Roy London 1989\n\nCarter , John Smith , Jacqueline Give and Take: Scenes from the History of Christ’s Hospital, Abingdon, 1553–1900 Privately published Abingdon 1981\n\nCavallo , Sandra. The Motivations of Benefactors: An Overview of Approaches to the Study of Charity.” Medicine and Charity before the Welfare State Barry , Jonathan Jones , C. London 1991\n\nCavill , P. R. The Problem of Labour and the Parliament of 1495.” The Fifteenth Century V: Of Mice and Men Clark , Linda Woodbridge 2005\n\nCharlesworth , Lorie. Welfare’s Forgotten Past: A Socio-Legal History of the Poor Law Abingdon 2010\n\nClark , Elaine. Charitable Bequests, Deathbed Land Sales, and the Manor Court in Later Medieval England.” Medieval Society and the Manor Court Razi , Zvi Smith , Richard Oxford 1996\n\nClark , Elaine. City Orphans and Custody Laws in Medieval England” American Journal of Legal History 34 1990 168\n\nClark , Elaine. The Custody of Children in English Manor Courts” Law and History Review 3 1985 333\n\nClark , Elaine. Institutional and Legal Responses to Begging in Medieval England” Social Science History 26 2002 447\n\nClark , Elaine. Mothers at Risk of Poverty in the Medieval English Countryside.” Poor Women and Children in the European Past Henderson , John Wall , Richard London 1994\n\nClark , Elaine. Social Welfare and Mutual Aid in the Medieval Countryside” Journal of British Studies 33 1994 381\n\nClark , Elaine. Some Aspects of Social Security in Medieval England” Journal of Family History 7 1982 307\n\nClarke , Basil. Norfolk Licenses to Beg” Norfolk Archaeology 35 1972 327\n\nClay , Rotha M. The Mediaeval Hospitals of England London 1909\n\nCollinson , Patrick. Puritanism and the Poor.” Pragmatic Utopias Horrox , Rosemary Jones , Sarah Rees Cambridge 2001\n\nCooper , C. M. Annals of Cambridge Cambridge 1842\n\nCox , J. Charles Harvey , Alfred English Church Furniture New York 1907\n\nCraig , John S. Co-operation and Initiatives: Elizabethan Churchwardens and the Parish Accounts of Mildenhall” Social History 18 1993 357\n\nCraig , John S. Reformers, Conflict, and Revisionism: The Reformation in Sixteenth-Century Hadleigh” The Historical Journal 42 1999 1\n\nCrassons , Kate. The Claims of Poverty: Literature, Culture, and Ideology in Late Medieval England Notre Dame Indiana 2010\n\nCrowe , Ken. Charity and the Economy of the Poor in an Essex Parish: Canewdon in the Early Modern Period” Essex Archaeology and History 33 2002 310\n\nCruickshank , C. G. Elizabeth’s Army Oxford 1966\n\nCullum , Patricia H. ‘And Hir Name Was Charite’: Charitable Giving by and for Women in Late Medieval Yorkshire.” Women in Medieval English Society Goldberg , P. J. P. Stroud 1997\n\nCullum , Patricia H. 1991\n\nCullum , Patricia H. ‘For Pore People Harberles’: What was the Function of the Maisonsdieu? Trade, Devotion and Governance Clayton , Dorothy J. Davies , R. G. McNiven , Peter Stroud 1994\n\nCullum , Patricia H.\n\nCullum , Patricia H. Leperhouses and Borough Status in the Thirteenth Century.” Thirteenth Century England III Coss , P. R. Lloyd , S. D. Woodbridge 1991\n\nCullum , Patricia H. Medieval Colleges and Charity.” The Late Medieval English College and Its Context Burgess , Clive Heale , Martin York 2008\n\nCullum , Patricia H. Poverty and Charity in Early Fourteenth-Century England.” England in the Fourteenth Century Rogers , Nicholas Stamford 1993\n\nCullum , Patricia H. Goldberg , P. J. P. Charitable Provision in Late Medieval York: ‘To the Praise of God and the Use of the Poor.’ Northern History 29 1993 24\n\nDavies , C. S. L. Slavery and Protector Somerset; the Vagrancy Act of 1547” Economic History Review 19 1966 533\n\nDavies , Matthew. The Tailors of London: Corporate Charity in the Late Medieval Town.” Crown, Government and People in the Fifteenth Century Archer , Rowena E. Stroud 1995\n\nDeverell , John. St. John’s Hospital and Other Charities in Winchester London 1879\n\nDyer , Christopher. An Age of Transition? Economy and Society in England in the Later Middle Ages Oxford 2005\n\nDyer , Christopher. Deserted Medieval Villages in the West Midlands” Economic History Review 2nd ser 35 1982 19\n\nDyer , Christopher. Did the Peasants Really Starve in Medieval England? Food and Eating in Medieval Europe Carlin , Martha Rosenthal , J. T. London 1998\n\nDyer , Christopher. The English Medieval Village Community and Its Decline” Journal of British Studies 33 1994 407\n\nDyer , Christopher. The Political Life of the Fifteenth-Century English Village.” Political Culture in Late Medieval Britain Clark , Linda Carpenter , Christine Woodbridge 2004\n\nDyer , Christopher. Standards of Living in the Later Middle Ages Cambridge 1989\n\nDyer , Christopher. Taxation and Communities in Late Medieval England.” Progress and Problems in Medieval England Britnell , Richard Hatcher , John Cambridge 1996\n\nElton , Geoffrey R. An Early Tudor Poor Law” Economic History Review 2nd ser 6 1953 55\n\nEmmison , F. G. The Care of the Poor in Elizabethan Essex” Essex Review 62 1953 7\n\nEvans , Vivienne. Dunstable with the Priory, 1100–1550 Dunstable 1994\n\nFideler , Paul A. Introduction: Impressions of a Century of Historiography.” In “Symposium on the Study of the Early Modern Poor and Poverty Relief Albion 32 2000 381\n\nFideler , Paul A. Poverty, Policy and Providence: The Tudors and the Poor Political Thought and the Tudor Commonwealth Fideler , Paul A. Mayer , T. F. London 1992\n\nFideler , Paul A. Social Welfare in Pre-Industrial England: The Old Poor Law Tradition Basingstoke 2006\n\nFleming , P. W. Charity, Faith, and the Gentry of Kent, 1422–1529 Property and Politics Pollard , Anthony J. Gloucester 1984\n\nFrench , Katherine L. The Good Women of the Parish Philadelphia 2008\n\nFrench , Katherine L. Parochial Fund-Raising in Late Medieval Somerset The Parish in English Life, 1400–1600 French , Katherine L. Gibbs , G. G. Kümin , B. A. Manchester 1997\n\nFrench , Katherine L. The People of the Parish Philadelphia 2001\n\nFrench , Katherine L. Women Churchwardens in Late Medieval England The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nFrohnsdorff , Mike. 1997\n\nFumerton , Patricia. Making Vagrancy (In)Visible: The Economics of Disguise in Early Modern Rogue Pamphlets” English Literary Renaissance 33 2003 211\n\nFumerton , Patricia. Unsettled: The Culture of Mobility and the Working Poor in Early Modern England Chicago 2006\n\nGibson , James M. The Walthamstow Charities Chichester 2000\n\nGilchrist , Roberta. Gender and Material Culture: The Archaeology of Religious Women London 1994\n\nGiven-Wilson , Chris. Service, Serfdom and English Labour Legislation, 1350–1500 Concepts and Patterns of Service in the Later Middle Ages Curry , Anne Matthew , Elizabeth Woodbridge 2000\n\nGodfrey , Walter H. The English Almshouse London 1955\n\nGood , Michael. A Compendium of Pevsner’s Buildings of England on Compact Disc Oxford 1995\n\nGoodall , John A. A. God’s House at Ewelme Aldershot 2001\n\nGoose , Nigel. The English Almshouse and the Mixed Economy of Welfare: Medieval to Modern” The Local Historian 40 2010 3\n\nGoose , Nigel. The Rise and Decline of Philanthropy in Early Modern Colchester” Social History 31 2006 469\n\nGould , J. D. Bittle and Lane on Charity: An Uncharitable Comment” Economic History Review 31 1978 121\n\nGransden , Antonia. Letter of Recommendation from John Whethamstede for a Poor Pilgrim, 1453/4” English Historical Review 106 1991 932\n\nGroom , Matthew. Piety and Locality: Studies in Urban and Rural Religion in Surrey, . 1450–. 1550 University of London Ph.D 2001\n\nHadwin , J. F. Deflating Philanthropy” Economic History Review 31 1978 105\n\nHaines , R. M. Bishop Carpenter’s Injunctions to the Diocese of Worcester in 1451” Bulletin of the Institute of Historical Research 40 1967 203\n\nHampson , E. M. The Treatment of Poverty in Cambridgeshire, 1597–1834 Cambridge 1934\n\nHanawalt , Barbara A. Keepers of the Lights: Late Medieval Parish Gilds” Journal of Medieval and Renaissance Studies 14 1984 21\n\nHanawalt , Barbara A. Reading the Lives of the Illiterate: London’s Poor” Speculum 80 2005 1067\n\nHanawalt , Barbara A. McRee , Ben R. The Guilds of in Late Medieval England” Continuity and Change 7 1992 163\n\nHarris , Barbara J. The Fabric of Piety: Aristocratic Women and Care of the Dead, 1450–1550” Journal of British Studies 48 2009 308\n\nHarris , Mark. ‘Inky Blots and Rotten Parchment Bonds’: London, Charity Briefs and the Guildhall Library” Bulletin of the Institute of Historical Research 66 1993 98\n\nHarrison , Christopher.\n\nHarvey , Barbara. Living and Dying in England, 1100–1540 Oxford 1993\n\nHatcher , John. The Great Slump of the Mid-Fifteenth Century Progress and Problems in Medieval England Britnell , Richard Hatcher , John Cambridge 1996\n\nHatcher , John. Mortality in the Fifteenth Century: Some New Evidence” Economic History Review 39 1986 19\n\nHatcher , John. Understanding the Population History of England, 1450–1750” Past and Present 180 2003 83\n\nHatcher , John Piper , A. J. Stone , David Monastic Mortality: Durham Priory, 1395–1529” Economic History Review 59 2006 667\n\nHeal , Felicity. The Archbishops of Canterbury and the Practice of Hospitality” Journal of Ecclesiastical History 33 1982 544\n\nHeal , Felicity. Concepts of Generosity in Early Modern England Luxury and Austerity Hill , Jacqueline Lennon , Colm Dublin 1999\n\nHeal , Felicity. Hospitality in Early Modern England Oxford 1990\n\nHeale , Martin R. V. Monastic-Parochial Churches in Late Medieval England The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nHeath , Peter. Urban Piety in the Later Middle Ages: The Evidence of Hull Wills The Church, Politics and Patronage in the Fifteenth Century Dobson , Barrie Gloucester 1984\n\nHewitt , H. J. The Organization of War under Edward III Manchester 1966\n\nHickman , David. From Catholic to Protestant: The Changing Meaning of Testamentary Religious Provisions in Elizabethan London England’s Long Reformation, 1500–1800 Tyacke , Nicholas London 2003\n\nHicks , Michael. St Katherine’s Hospital, Heytesbury” Wiltshire Archaeological and Natural History Magazine 78 1984 62\n\nHill , Christopher. Puritans and the Poor” Past and Present 2 1952 32\n\nHill , Christopher. Society and Puritanism London 1964\n\nHindle , Steve. Dearth, Fasting and Alms: The Campaign for General Hospitality in Late Elizabethan England” Past and Present 172 2001 44\n\nHindle , Steve. Dependency, Shame, and Belonging: Badging the Deserving Poor, . 1550–1750” Cultural and Social History 1 2004 6\n\nHindle , Steve. ‘Good, Godly and Charitable Uses’: Endowed Charity and the Relief of Poverty in Rural England, . 1550–1750 Institutional Culture in Early Modern Society Goldgar , Anne Frost , R. I. Leiden 2004\n\nHindle , Steve. On the Parish? The Micro-Politics of Poor Relief in Rural England, c. 1550–1750 Oxford 2004\n\nHindle , Steve. Technologies of Identification under the Old Poor Law” The Local Historian 36 2006 220\n\nHitchcock , Tim. Down and Out in Eighteenth-Century London London 2004\n\nHitchcock , Tim King , Peter Sharpe , Pamela Chronicling Poverty: The Voices and Strategies of the English Poor, 1640–1840 Basingstoke 1997\n\nHobbes , Stephen. Payments to Itinerant Travellers Seeking Alms in Hartland, 1612–1706” The Devon Historian 78 2009 21\n\nHolloway , William. The History and Antiquities of the Ancient Town and Port of Rye London 1848\n\nHopewell , Peter. Saint Cross: England’s Oldest Almshouse Chichester 1995\n\nHopkirk , Mary. The Administration of Poor Relief, 1604–1834” Essex Review 58 1949 113\n\nHorden , Peregrine. A Discipline of Relevance: The Historiography of the Later Medieval Hospital” Social History of Medicine 1 1988 359\n\nHorden , Peregrine. Small Beer? The Parish and the Poor and Sick in Later Medieval England The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nHoulbrooke , Ralph. Church Courts and the People during the English Reformation, 1520–1570 Oxford 1979\n\nHowson , Brian. Houses of Noble Poverty Sunbury-on-Thames 1993\n\nHudson , Geoffrey L. Disabled Veterans and the State in Early Modern England Disabled Veterans in History Gerber , David A. Ann Arbor, Mich. 2000\n\nHunt , William. The Puritan Moment Cambridge, Mass. 1983\n\nImray , Jean. The Charity of Richard Whittington London 1968\n\nInnes , Joanna. The ‘Mixed Economy of Welfare’ in Early Modern England: Assessments of the Options from Hale to Malthus (. 1683–1803) Charity, Self-Interest and Welfare in the English Past Daunton , Martin London 1996\n\nInnes , Joanna. Prisons for the Poor: English Bridewells, 1555–1800 Labour, Law, and Crime: An Historical Perspective Snyder , Francis Hay , Douglas London 1987\n\nJones , Gareth. History of the Law of Charity, 1532–1827 Cambridge 1969\n\nJordan , W. K. 1480\n\nJordan , W. K. The Charities of London, 1480–1660 London 1960\n\nJordan , W. K. The Charities of Rural England, 1480–1660 London 1961\n\nJordan , W. K. 1480\n\nJordan , W. K. Edward VI: The Young King Cambridge, Mass. 1968\n\nJordan , W. K. The Forming of the Charitable Institutions of the West of England Philadelphia 1960\n\nJordan , W. K. Philanthropy in England, 1480–1660 London 1959\n\nJordan , W. K. 1961\n\nJordan , W. K. The Social Institutions of Lancashire Chetham Society 1962\n\nKitching , C. J. Fire Disasters and Fire Relief in Sixteenth-Century England: The Nantwich Fire of 1583” Bulletin of the Institute of Historical Research 54 1981 171\n\nKnowles , David. The Religious Orders in England Cambridge 1948\n\nKnowles , David Hadcock , R. N. Medieval Religious Houses, England and Wales London 1971\n\nKreider , Alan. English Chantries: The Road to Dissolution Cambridge, Mass. 1979\n\nKümin , Beat. Late Medieval Churchwardens’ Accounts and Parish Government: Looking beyond London and Bristol” English Historical Review 119 2004 87\n\nKümin , Beat. Parish Finance and the Early Tudor Clergy The Reformation of the Parishes Pettegree , Andrew Manchester 1993\n\nKümin , Beat. The Secular Legacy of the Late Medieval English Parish The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nKümin , Beat. The Shaping of a Community: The Rise and Reformation of the English Parish, c. 1400–1560 Aldershot 1996\n\nLehmberg , Stanford E. The Reformation of Cathedrals Princeton New Jersey 1988\n\nLeonard , E. M. The Early History of English Poor Relief Cambridge 1900\n\nLepine , David. ‘And Alle Oure Paresshens’: Secular Cathedrals and Parish Churches in Late Medieval England The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nLitzenberger , Caroline. Local Responses to Changes in Religious Policy Based on Evidence from Gloucestershire Wills (1540–1580)” Continuity and Change 8 1993 417\n\nMacfarlane , Alan. Witchcraft in Tudor and Stuart England London 1970\n\nMacKinnon , Dolly. Charitable Bodies: Clothing as Charity in Early-Modern Rural England Practices of Gender in Late Medieval and Early Modern Europe Cassidy-Welch , Megan Sherlock , Peter Turnhout 2008\n\nMcIntosh , Marjorie Keniston. Autonomy and Community: The Royal Manor of Havering, 1200–1500 Cambridge 1986\n\nMcIntosh , Marjorie Keniston.\n\nMcIntosh , Marjorie Keniston. A Community Transformed Cambridge 1991\n\nMcIntosh , Marjorie Keniston. Controlling Misbehavior in England, 1370–1600 Cambridge 1998\n\nMcIntosh , Marjorie Keniston. The Diversity of Social Capital in English Communities, 1300–1640 (with a Glance at Modern Nigeria)” Journal of Interdisciplinary History 29 1999 459 Cambridge\n\nMcIntosh , Marjorie Keniston. Local Change and Community Control in England, 1465–1500” Huntington Library Quarterly 49 1986 219\n\nMcIntosh , Marjorie Keniston. Local Responses to the Poor in Late Medieval and Tudor England” Continuity and Change 3 1988 209\n\nMcIntosh , Marjorie Keniston. 1350\n\nMcIntosh , Marjorie Keniston. Networks of Care in Elizabethan English Towns The Locus of Care Horden , Peregrine Smith , Richard London 1998\n\nMcIntosh , Marjorie Keniston. Poverty, Charity, and Coercion in Elizabethan England” Journal of Interdisciplinary History 35 2005 457\n\nMcIntosh , Marjorie Keniston. Working Women in English Society, 1300–1620 Cambridge 2005\n\nMcRee , Ben R. Charity and Gild Solidarity in Late Medieval England” Journal of British Studies 32 1993 195\n\nMeade , Dorothy M. The Hospital of Saint Giles at Kepier, near Durham, 1112–1545” Transactions of the Architectural and Archaeological Society of Durham and Northumberland 1 1968 45\n\nMollat , Michel. Les Pauvres au Moyen Age Paris 1978\n\nNew , Elizabeth. Signs of Community or Marks of the Exclusive? Parish and Guild Seals in Later Medieval England The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nNichols , John. The Progresses and Public Processions of Queen Elizabeth London 1823\n\nO’Donoghue , Edward G. The Story of Bethlehem Hospital London 1914\n\nOrme , Nicholas. Indulgences in the Diocese of Exeter, 1100–1536” Reports and Transactions of the Devonshire Association for the Advancement of Science 120 1988 15\n\nOrme , Nicholas. A Medieval Almshouse for the Clergy: Clyst Gabriel Hospital near Exeter” Journal of Ecclesiastical History 39 1988 1\n\nOrme , Nicholas. The Other Parish Churches: Chapels in Late-Medieval England The Parish in Late Medieval England Burgess , Clive Duffy , Eamon Donington 2006\n\nOrme , Nicholas Webster , Margaret The English Hospital, 1070–1570 New Haven, Conn. 1995\n\nOttaway , Susannah R. The Decline of Life: Old Age in Eighteenth-Century England Cambridge 2004\n\nOwst , G. R. Preaching in Medieval England Cambridge 1926\n\nPage , Frances M. The Customary Poor-Law of Three Cambridgeshire Manors” Cambridge Historical Journal 3 1930 125\n\nPatriquin , Larry. Agrarian Capitalism and Poor Relief in England, . 1500–1790 The Capitalist State and Its Economy Zarembka , Paul Research in Political Economy 2005\n\nPeckham , W. D. St. Mary’s Hospital, Chichester” Sussex Notes and Queries 8 1941 207\n\nPelling , Margaret. Healing the Sick Poor: Social Policy and Disability in Norwich, 1550–1640 The Common Lot: Sickness, Medical Occupations and the Urban Poor in Early Modern England London 1998\n\nPelling , Margaret. Old Age, Poverty, and Disability in Early Modern Norwich The Common Lot, 134–54 London 1998\n\nPeters , Christine. Patterns of Piety Cambridge 2003\n\nPevsner , Nikolaus. The Buildings of England London 1951\n\nPhillips , Elaine M. 2001\n\nPing , Lilian G. Raising Funds for ‘Good Causes’ during the Reformation” Hibbert Journal 35 1936 53\n\nPost , J. B. Manorial Amercements and Peasant Poverty” Economic History Review 28 1975 304\n\nPound , John. Poverty and Vagrancy in Tudor England London 1971\n\nPrescott , Elizabeth. The English Medieval Hospital, 1050–1640 Broughton Gifford 1992\n\nRawcliffe , Carole. Dives Redeemed? The Guild Almshouses of Later Medieval England The Fifteenth Century VII Clark , Linda Woodbridge 2008\n\nRawcliffe , Carole. The Earthly and Spiritual Topography of Suburban Hospitals Town and Country in the Middle Ages Giles , Kate Dyer , Christopher Leeds 2005\n\nRawcliffe , Carole. The Hospitals of Medieval Norwich Norwich 1995\n\nRawcliffe , Carole. Leprosy in Medieval England Woodbridge 2006\n\nRawcliffe , Carole. Medicine for the Soul: The Medieval English Hospital and the Quest for Spiritual Health Religion, Health and Suffering Hinnells , John R. Porter , Roy London 1999\n\nRawcliffe , Carole. A Word from Our Sponsor: Advertising the Patron in the Medieval Hospital The Impact of Hospitals, 300–2000 Henderson , John Horden , Peregrine Pastore , Alessandro Oxford 2007\n\nReeve , Edward H. L. Stondon Massey Colchester 1900\n\nResl , Brigitte. Hospitals in Medieval England Europäisches Spitalwesen. Institutionelle Fürsorge in Mittelalter und Früher Neuzeit Scheutz , Martin Sommerlechner , Andrea Weigl , Herwig Weiss , Alfred Stefan Munich 2008\n\nRexroth , Frank. Deviance and Power in Late Medieval London German 1999\n\nRichmond , Colin. Victorian Values in Fifteenth-Century England: The Ewelme Almshouse Statutes Pragmatic Utopias Horrox , Rosemary Jones , Sarah Rees Cambridge 2001\n\nRigby , Stephen H. Urban Population in Late Medieval England: The Evidence of the Lay Subsidies” Economic History Review 63 2010 393\n\nRobison , William B. The Bawdy Master of St. Thomas’s Hospital” Historical Research 83 2010 565\n\nRowe , Joy. The Medieval Hospitals of Bury St. Edmunds” Medical History 2 1958 253\n\nRubin , Miri. Charity and Community in Medieval Cambridge Cambridge 1987\n\nRubin , Miri. Development and Change in English Hospitals, 1100–1500 The Hospital in History Grandshaw , Lindsay Porter , Roy London 1989\n\nRubin , Miri. Imagining Medieval Hospitals: Considerations on the Cultural Meaning of Institutional Change Medicine and Charity before the Welfare State Barry , Jonathan Jones , Colin London 1991\n\nRushton , Neil S. Monastic Charitable Provision in Tudor England” Continuity and Change 16 2001 9\n\nSavine , Alexander. English Monasteries on the Eve of the Dissolution Oxford 1909\n\nSchen , Claire S. Charity and Lay Piety in Reformation London, 1500–1620 Aldershot 2002\n\nSchen , Claire S. Constructing the Poor in Early Seventeenth-Century London” Albion 32 2000 450\n\nShepard , Alexandra. Poverty, Labour and the Language of Social Description in Early Modern England” Past and Present 201 2008 51\n\nShepherd , Geoffrey. Poverty in Piers Plowman Social Relations and Ideas: Essays in Honour of R. H. Hilton Aston , T. H. Coss , P. R. Dyer , Christopher Thirsk , Joan Cambridge 1983\n\nSlack , Paul. The English Poor Law, 1531–1782 Basingstoke 1990\n\nSlack , Paul. From Reformation to Improvement: Public Welfare in Early Modern England Oxford 1999\n\nSlack , Paul. Hospitals, Workhouses and the Relief of the Poor in Early Modern London Health Care and Poor Relief in Protestant Europe, 1500–1700 Grell , Ole Peter Cunningham , Andrew London 1997\n\nSlack , Paul. Poverty and Policy in Tudor and Stuart England London 1988\n\nSlack , Paul. Social Policy and the Constraints of Government, 1547–58 The Mid-Tudor Polity, c. 1540–1560 Tittler , Robert Loach , J. London 1980\n\nSlack , Paul. Vagrants and Vagrancy in England, 1598–1664” Economic History Review 27 1974 360\n\nSmith , Richard M. Charity, Self-Interest and Welfare: Reflections from Demographic and Family History Charity, Self-Interest, and Welfare in the English Past Daunton , Martin London 1996\n\nSmith , Richard M. The Manorial Court and the Elderly Tenant in Late Medieval England Life, Death, and the Elderly Pelling , Margaret Smith , R. M. London 1991\n\nSmith , Richard M. Putting Benedictine Monks in Context: Mortality in England, 1350–1540 Town and Countryside in the Age of the Black Death: Essays in Honour of John Hatcher Bailey , Mark Rigby , S. H. Turnhout\n\nSnape , Robert H. English Monastic Finances in the Later Middle Ages Cambridge 1926\n\nSnell , Keith D. M. Parish and Belonging: Community, Identity and Welfare in England and Wales, 1700–1950 Cambridge 2006\n\nSnell , Keith D. M. ‘So Long as the World Shall Endure’: The Five Hundred Year History of Bond’s and Ford’s Hospitals Coventry 1991\n\nSomerscales , M. I. Lazar Houses in Cornwall” Journal of the Royal Institution of Cornwall 5 1965 61\n\nStone , Lawrence. The Family, Sex and Marriage in England, 1500–1800 London 1977\n\nSutton , Anne F. The Hospital of St Thomas of Acre of London The Late Medieval English College and Its Context Burgess , Clive Heale , Martin York 2008\n\nSwanson , R. N. Indulgences in Late Medieval England Cambridge 2007\n\nSwanson , R. N. Tales to Tug at Purse-Strings: Publicizing Indulgences in Pre-Reformation England Freedom of Movement in the Middle Ages Horden , Peregrine Donington 2007\n\nSweetinburgh , Sheila. Clothing the Naked in Late Medieval East Kent Clothing Culture, 1350–1650 Richardson , Catherine Aldershot 2004\n\nSweetinburgh , Sheila. The Poor, Hospitals and Charity in Sixteenth-Century Canterbury Pieties in Transition: Religious Practices and Experiences, c. 1400–1640 Lutton , Robert Salter , Elisabeth Aldershot 2007\n\nSweetinburgh , Sheila. The Role of the Hospital in Medieval England Dublin 2004\n\nTanner , Norman P. The Church in Late Medieval Norwich, 1370–1532 Toronto 1984\n\nThirsk , Joan The Agrarian History of England and Wales Cambridge 1967\n\nThomas , Keith. Religion and the Decline of Magic New York 1971\n\nThomson , J. A. F. Piety and Charity in Late Medieval London” Journal of Ecclesiastical History 16 1965 178\n\nTierney , Brian. Medieval Poor Law Berkeley, Calif. 1959\n\nTittler , Robert. The Reformation and the Towns in England Oxford 1998\n\nTobriner , Alice. Almshouses in Sixteenth-Century England: Housing for the Poor Elderly” Journal of Religion and Aging 1 1985 13\n\nTodd , Margo. Christian Humanism and the Puritan Social Order Cambridge 1987\n\nUnderdown , David. Fire from Heaven New Haven, Conn. 1992\n\nVan der Slice , Austin Elizabethan Houses of Correction” Journal of Criminal Law and Criminology 27 1936 45\n\nVickers , Michael. An Elizabethan Contact with Greece” Journal of Ecclesiastical History 24 1973 51\n\nThe Victoria History of the County of Cambridge London 1953\n\nThe Victoria History of the County of Northampton London 1906\n\nWales , Tim. Poverty, Poor Relief and the Life Cycle Land, Kinship and Life-Cycle Smith , Richard M. Cambridge 1984\n\nWard , Jennifer C. The Reformation in Colchester, 1528–1558” Essex Archaeology and History 15 1983 84\n\nWare , Sedley L. The Elizabethan Parish in Its Ecclesiastical and Financial Aspects Baltimore 1908\n\nWarnicke , Retha M. William Lambarde, Elizabethan Antiquary Chichester 1973\n\nWatson , Sethina. City as Charter: Charity and the Lordship of English Towns, 1170–1250 Cities, Texts and Social Networks, 400–1500 Goodson , Caroline Lester , Anne E. Symes , Carol Farnham 2010\n\nWatson , Sethina. The Origins of the English Hospital” Transactions of the Royal Historical Society 16 2006 75\n\nWear , Andrew. Caring for the Sick Poor in St Bartholomew’s Exchange, 1580–1679” Medical History 11 1991 41\n\nWebb , Sidney Webb , Beatrice English Poor Law History, Part I: The Old Poor Law London 1963\n\nWhite , William. Excavations at St Mary Spital: Burial of the ‘Sick Poore’ of Medieval London The Medieval Hospital and Medical Practice Bowers , Barbara S. Aldershot 2007\n\nWillen , Diane. Women in the Public Sphere in Early Modern England” Sixteenth Century Journal 19 1988 559\n\nWillson , A. N. A History of Collyer’s School London 1965\n\nWithington , Phil. The Politics of Commonwealth Cambridge 2005\n\nWoodbridge , Linda. Jest Books, the Literature of Roguery, and the Vagrant Poor in Renaissance England” English Literary Renaissance 33 2003 201\n\nWooding , Lucy E. C. Charity, Community and Reformation Propaganda” Reformation 11 2006 131\n\nWright , H. P. The Story of the “Domus Dei” of Stamford London 1890\n\nWrightson , Keith Levine , David Poverty and Piety in an English Village 1979 Oxford\n\nWrigley , E. A. Davies , R. S. Oeppen , J. Schofield , R. English Population History from Family Reconstitution, 1580–1837 Cambridge 1997"}, {"url": "https://www.britannica.com/biography/Henry-Mayhew", "page_content": "Henry Mayhew, (born 1812, London, England—died July 25, 1887, London), English journalist and sociologist, a founder of the magazine Punch (1841), who was a vivid and voluminous writer best known for London Labour and the London Poor, 4 vol. (1851–62). His evocation of the sights and sounds of London in this work influenced Charles Dickens and other writers.\n\nMayhew, the son of a solicitor, ran away to sea at age 12 and made a voyage to India. Upon his return he studied law with his father but soon turned to journalism. He helped to found the periodicals Figaro in London (1831) and The Thief (1832) before organizing the highly successful Punch, of which he was coeditor (with Mark Lemon) for two years. He also wrote plays, farces, fairy tales, and novels, some in collaboration with his brother Augustus Septimus Mayhew (1826–75). Short of money in his later years, he produced much hackwork and died in obscurity.\n\nMayhew had a genius for lively and sensitive reportage of people, including social outcasts and nomads, and of contrasting ways of life; and he was able to combine his observation with penetrating economic and social analysis, some of it with a Marxist flavour. London Labour and the London Poor was based on letters he wrote to the London Morning Chronicle in 1849–50, at the end of a stormy decade in British social history. Responding to the newspaper’s desire for “trustworthy information” on the great social problems of the day, Mayhew prepared three volumes that were published in 1851; the fourth volume, The Criminal Prisons of London, was written in collaboration with John Binny and did not appear until 1862. A revised complete edition was published in 1864."}, {"url": "https://www.chinadaily.com.cn/a/202102/24/WS6035f8fba31024ad0baaac6a.html", "page_content": "Farmers pick tea leaves at a tea garden in Baisha Li autonomous county in South China's Hainan province, Feb 7, 2021. [Photo/Xinhua]\n\nBEIJING -- Eliminating poverty, improving people's livelihoods, and realizing common prosperity are the essential requirements of socialism.\n\nSince the 18th Communist Party of China (CPC) National Congress, the CPC Central Committee, with Comrade Xi Jinping at the core, has placed poverty alleviation in a prominent position, put forward new thoughts and ideas, and made new decisions and arrangements to advance China's poverty relief campaign.\n\nHere is a look at China's efforts to fight poverty.\n\n-- December 2012\n\nDuring his visit to impoverished villages in North China's Fuping county, President Xi Jinping said the most arduous and heavy task facing China in completing the building of a moderately prosperous society is in the rural areas, especially the poverty-stricken regions.\n\n-- March 2013\n\nWhile joining deputies in panel discussions at the annual session of the National People's Congress, Xi said poverty alleviation should not be like \"killing fleas with a hand-grenade\" or resort to indiscriminate measures. The poor population should be accurately identified, assisted and managed.\n\n-- November 2013\n\nDuring an inspection tour in Central China's Hunan province, Xi visited Shibadong, a Miao minority village labeled \"poor\" at the time, where he put forward the concept of \"targeted poverty alleviation.\" The term refers to measures that include a system to keep track of every household and individual in poverty to verify that their treatment is having the desired effect.\n\n-- April 2014\n\nThe State Council Leading Group Office of Poverty Alleviation and Development issued a work plan on the registration of the poor population, mobilizing millions of grassroots cadres across the country to carry out poverty identification. During the process, 128,000 villages, 29.32 million households, and 89.62 million people were identified as poor, according to national standards and procedures on poverty reduction. A database was established for every single impoverished person.\n\n-- October 2014\n\nChina observed the first National Poverty Relief Day on Oct 17.\n\n-- January 2015\n\nXi said no single ethnic minority group should be left behind in the country's building of a moderately prosperous society in all respects.\n\n-- February 2015\n\nDuring a meeting with Party chiefs of 24 counties and cities from Shaanxi and Gansu provinces and Ningxia Hui autonomous region, Xi said a well-off society is incomplete if people in old revolutionary base areas cannot shake off poverty.\n\n-- October 2015\n\nXi delivered a keynote speech at the opening ceremony of the 2015 Global Poverty Reduction and Development Forum, saying that China has lifted more than 600 million people out of poverty in the past 30 years, and China was the first developing country to meet the Millennium Development Goals (MDGs) target of reducing the population living in poverty by half ahead of the 2015 deadline.\n\nWhile striving to reduce poverty at home, China has also actively supported the cause in other developing countries. Over the past 60 years, China has provided 166 countries and international organizations with nearly 400 billion yuan in assistance.\n\n-- November 2015\n\nXi led a conference on poverty alleviation and development. The conference, attended by senior leaders of the CPC Central Committee and the central government, and major provincial-level officials, was the first such high-level meeting ever held at the time. Officials made a \"soldiers' pledge\" to the central leadership.\n\n-- February 2016\n\nDuring a trip to Shenshan village, a poverty-stricken village in the city of Jinggangshan, in Jiangxi province, Xi met with villagers and the village party chief to learn about the progress that had been made in poverty relief through \"precision\" measures.\n\n\"Not a single family living in poverty is to be left behind on our path to combating poverty,\" Xi told the Shenshan villagers.\n\n-- July 2016\n\nXi urged developed regions in the east to help their partner regions in the west better fight poverty at a national conference on poverty alleviation through east-west cooperation in Yinchuan, capital city of China's Ningxia Hui autonomous region.\n\n-- August 2016\n\nDuring an inspection tour to Qinghai province, Xi said relocation is an effective way to relieve poverty, and stressed the importance of listening to what the villagers want and letting them participate in planning their new villages.\n\nXi said that the building of new villages should be integrated with measures to promote production and employment, improve basic public services and protect ethnic, regional and cultural features and styles.\n\n-- End of 2016\n\nThe Shibadong Village, the birthplace of \"targeted poverty alleviation,\" dropped its \"poverty-stricken\" label in 2016.\n\n-- February 2017\n\nJinggangshan, the heartland of the early revolutionary activities of the CPC, announced that it had been officially taken off the list of impoverished areas.\n\n-- October 2017\n\nThe 2017 Global Poverty Reduction and Development Forum kicked off in Beijing. UN Secretary General Antonio Guterres sent a letter of congratulation to the meeting commending China's poverty-reduction strategy. He said that China had lifted hundreds of millions of people out of poverty and China's poverty-alleviation experience could provide useful lessons for other developing countries.\n\n-- February 2018\n\nThe number of rural people living in poverty had dropped from 98.99 million at the end of 2012 to 30.46 million at the end of 2017, and 68.53 million people had been lifted out of poverty in the past five years, a reduction of about 70 percent.\n\n-- End of 2018\n\nThe Dulong ethnic minority group in China's Yunnan province announced that it had been officially taken off the list of impoverished areas in 2018. When answering a letter from the Dulong people, Xi said that \"poverty eradication is only the first step, better days are yet to come.\"\n\n-- May 2019\n\nYan'an, a former revolutionary base of the CPC, was officially taken off the list of impoverished areas.\n\n-- June 2019\n\nHuang Wenxiu, who led the poverty-alleviation efforts in a village in Guangxi Zhuang autonomous region, died in a rain-induced flash flood on June 17, 2019, at the age of 30.\n\nOver the past eight years, over 1,500 poverty-alleviation cadres in the country had died in the battle against poverty.\n\n-- March 2020\n\nA symposium on securing a decisive victory in poverty alleviation was held in Beijing, the largest of its kind since the 18th CPC National Congress.\n\n-- March 2020\n\nThe country's poverty-alleviation tasks were near completion, as the number of impoverished people fell to 5.51 million at the end of 2019, and the poverty headcount ratio was down to 0.6 percent from 10.2 percent during the period.\n\nOf all the 832 nation-level poverty-stricken counties, only 52 remained to be removed from the poverty list.\n\n-- May 2020\n\nThe registered poor households of the village of Atulieer atop a cliff in Liangshan Yi autonomous prefecture, in China's Sichuan orovince, moved to a newly built community.\n\nSince 2016, more than 600 billion yuan had been invested in building new homes for 9.6 million people struggling in extreme poverty.\n\n-- May 2020\n\nThe Huanjiang Maonan autonomous county in Guangxi Zhuang autonomous region was removed from the country's impoverished county list.\n\nIn an instruction on poverty elimination among the ethnic group, Xi called on the Maonan people to take poverty elimination as a new starting point for a better life, and continue with efforts to make their lives more prosperous.\n\n-- October 2020\n\nChina's Tibet autonomous region accomplished the historical feat of eradicating absolute poverty. By the end of 2019, Tibet had lifted 628,000 people out of poverty and removed 74 county-level areas from the poverty list.\n\n-- October 2020\n\nXi urged continuous efforts to win a complete victory in the battle against poverty as China marked the seventh National Poverty Relief Day, saying that 2020 was the decisive year for completing the building of a moderately prosperous society in all respects and eradicating poverty nationwide.\n\n-- November 2020\n\nChina's Xinjiang Uygur autonomous region, with over 25 million people of various ethnic groups, bid farewell to absolute poverty, with the last 10 impoverished counties managing to end absolute poverty.\n\n-- November 2020\n\nXihaigu, once one of the world's most uninhabitable places due to harsh environment, achieved a historic feat in eliminating absolute poverty, with the last poor county in the region removed from the country's list of poverty-stricken counties.\n\n-- November 2020\n\nChina announced that it had removed the remaining 52 impoverished counties from the poverty list, marking the removal of all 832 on the list, a globally significant milestone in poverty reduction for the world's most populous country.\n\n-- December 2020\n\nIn a letter of congratulations to the International Forum on Sharing Poverty Reduction Experience held in Beijing, Xi said that the cause of poverty reduction is facing severe challenges as the COVID-19 pandemic rages across the world, and China is willing to work with all countries to promote international poverty reduction and build a community with a shared future for humanity.\n\n-- December 2020\n\nWhile delivering a televised New Year speech to ring in 2021, Xi said China had secured a great historic achievement for fully building a moderately prosperous society in all respects and a decisive victory in poverty eradication.\n\nIn 2020, after eight years of efforts, all of China's nearly 100 million impoverished rural residents living below the current poverty line had shaken off poverty."}, {"url": "https://www.themilitant.com/1995/5935/5935_16.html", "page_content": "Vol.59/No.35 September 25, 1995\n\nEvent Honors Life Of SWP Leader Mayhew\n\n\n\nBY MIKE TABER\n\n\n\nNEWARK, New Jersey - Howard Mayhew, a veteran leader of the Socialist Workers Party, had an unshakable confidence in the capacity of working people to change society. For over half a century, from the l930s to the l990s, he was a builder of the Socialist Workers Party and of union, antiracist, and antiwar struggles.\n\nSeventy people attended an August 20 meeting here to celebrate the life and political contributions of this fighter, who died earlier this year at age 86.\n\nSWP leader Elizabeth Stone described how Mayhew's experiences in the l930s depression - \"when literally millions of workers around the world were joining in revolutionary and trade union struggles\" - won him to a life- long commitment to building a revolutionary party.\n\n\"Howard knew that in times of economic crisis, workers will organize and fight,\" Stone said. \"He also knew that for these struggles to be effective, revolutionary leadership is necessary.\"\n\nMayhew began to learn this when he first came into contact with socialists in l936 and joined the Socialist Party. Debate in the party focused on Spain, where powerful revolutionary workers' struggles were being crushed by fascists due to misleadership by anarchist, social democratic, and Stalinist forces.\n\nBreak from Socialist Party\n\nStone described how Mayhew was one of many younger members who joined the left wing of the Socialist Party and put forward revolutionary positions on Spain and other issues. In l938, after these forces were expelled from the Socialist Party by conservative party leaders, they helped form the Socialist Workers Party.\n\nShortly after joining the SWP Mayhew faced another decision, Stone pointed out. While working at a newspaper in Chicago he found himself in the middle of an American Newspaper Guild organizing drive. Joining the drive meant putting a job he had held for 10 years at risk, in depression conditions when he had a family to support. Howard threw himself into the battle, Stone said, soon becoming head of an emergency committee to respond to company attacks. He wrote years later that this decision to join the fight was \"a fork in the road... that marked the time when I became a revolutionist.\"\n\nDuring and following World War II, Mayhew worked at a General Motors locomotive plant in McCook, Illinois, organized by the United Auto Workers union. He helped lead workers at the plant in the nationwide GM strike of l945, which was the biggest strike of the massive post-World War II strike wave.\n\nStone noted that, like all revolutionaries, Mayhew wanted to be part of big workers' struggles and victories. But, as it turned out, his biggest political contributions were during the l950s and l960s when the workers movement was in retreat in the United States.\n\nHelped build antiracist struggles\n\nStone explained that as a leader of the Chicago SWP in those years, and as part of a national team of leaders, he helped keep the party going as a fighting, out-turned workers' organization involved in the struggles that were advancing at the time, most importantly antiracist fights.\n\nA high point was the election campaign of Black community activist Rev. Joseph King, which Mayhew helped organize in l958. It was a socialist campaign organized jointly by the SWP; the Washington Park Forum, a predominantly Black organization strongly influenced by the Communist Party; and others. The campaign helped win some members and supporters of the Communist Party, which had been especially strong in the Black community in Chicago, away from the Communist Party's support to capitalist politicians in the Democratic Party.\n\n\"The campaign advocated labor as well as Black political action,\" Stone explained, reading from an interview with Rev. King in the Militant where he proclaimed, \"The unions should help build a party to fight for the emancipation of the human race. The capitalists can't do that. In the meantime, we're campaigning for Negro representation in the Second District, which has never had a Negro congressman.\"\n\nBraiding of generations\n\nJoel Britton, a member of the SWP Political Committee who joined the party in Chicago in l962, spoke of Mayhew's leadership capacities in the \"braiding of generations so essential to building a combat party of the working class vanguard,\" a genuine communist party.\n\n\"Howard probably directly worked with, and served on branch executive committees with, more young members who went on to serve on the SWP's Political Committee than any other leader of his political generation,\" Britton said.\n\nBritton noted that SWP founder James P. Cannon had stated that national leaders of the party must have \"prestige\" not only \"in the party, but as the party tasks develop, they must have it outside.\"\n\n\"Howard Mayhew was an example of such a party member,\" Britton said, explaining that his prestige was earned in union battles, the fight for civil liberties, antiracist, and other struggles, and as a candidate for public office for the party. \"This prestige came from serious involvement, activity, and leadership.\"\n\nBritton pointed out how in the early l950s, in the midst of the postwar prosperity and anticommunist witch-hunt, Mayhew quit his job, with nearly ten years' seniority, to participate in the party's leadership school for six months.\n\nIn l954, at the age of 46, he was elected by convention delegates to be an alternate member of the SWP's National Committee. He was elected a regular member at the following convention in l957.\n\nBritton reviewed some of his experiences as a new member of the party in Chicago, noting the serious nature of branch discussions and Mayhew's role in driving through a transition of leadership from older to younger generations.\n\nAt the party's l963 national convention, Mayhew set an example for other veteran leaders by accepting nomination for the newly established advisory membership on the party's National Committee.\n\nAfter a half-decade of central leadership responsibility helping to organize the party's expanded printshop in New York, Mayhew again set an example in l971 by declining nomination to the advisory committee. This action, Britton noted, helped lay the basis for ending the advisory committee a few years later when the transition in leadership was completed.\n\nLater, Mayhew was active in the party's Albany branch. Larry Lane, SWP candidate for governor of New York in l994, spoke of how Mayhew's political experience and judgment helped the Albany branch's participation in massive protests in l981 when the South African rugby team came to Albany.\n\nRay Parsons, SWP candidate for mayor of Chicago earlier this year, spoke of meeting Mayhew in the early l980s as an l8-year-old recruit to the Young Socialist Alliance in Albany. Howard \"embodied in flesh and blood the party's continuity,\" he said. Parsons described how Mayhew campaigned for socialism into the early l990s, selling the Militant and Pathfinder books, and opposing U.S. aggression against Nicaragua, Libya, and Iraq.\n\nYoung Socialists member Janine Dukes, a volunteer in the party's printshop and participant in the recent Cuba Lives festival, gave a fund pitch in honor of Mayhew for the Capital Fund to help maintain the long-term printing and publishing of Marxist literature. A total of $757 was donated.\n\nA display of photographs, articles, and other materials chronicling Mayhew's political activity was featured. A number of these items were contributed by Astrid Mayhew, Howard's wife, who attended the meeting."}, {"url": "https://ilcuk.org.uk/mayhew-review/", "page_content": "Our report The Mayhew Review: Future Proofing Retirement Living – Easing the care and housing crises, published today and supported by ARCO, finds that the Government must build 50,000 new homes for older people each year to tackle the UK’s housing and social care crisis.\n\nProfessor Les Mayhew’s research shows that with the number of over-65s set to race past 17 million by 2040, the Government should initiate an accelerated programme of constructing older people’s housing with up to 50,000 new units a year, on top of the meagre 7,000 currently built annually. This means that one in four of new homes should be targeted at older people.\n\nAchieving this growth would help older people stay healthy for longer and reduce the burden on the NHS and care homes. Each new home would free up housing and surplus bedrooms for younger families and first-time buyers, making housing more affordable. And new developments could play a major part in revitalising declining high streets.\n\nThe ability of older people’s housing to foster social connection is especially important given that as many as 6.2 million older people are set to live alone by 2040 – half of them aged 80 and over – exacerbating the loneliness epidemic and stretching social services to breaking point.\n\nProfessor Les Mayhew, whose commission this year drew on evidence and input from over forty experts, highlights the concrete steps the Government needs to take to reach the levels of older people’s housing required:\n\nLaunching the Older People’s Housing Taskforce immediately\n\nReforming planning rules to make it easier to build housing suitable for later life\n\nPutting older people’s housing on a level playing field with all other developments\n\nCutting Stamp Duty so it is the same for last-time buyers as first-time buyers\n\nRamping up the financial advice available for older people looking to move\n\nThe Government committed to expanding housing-with-care for older people in a string of white papers at the end of 2021 and start of 2022, including on levelling up and social care, but is yet to act upon these commitments."}, {"url": "https://www.peoplesworld.org/article/william-z-foster-pioneer-fighter-for-black-equality-in-organized-labor/", "page_content": "William Z. Foster, center, with Paul Robeson and New York Councilman Benjamin J. Davis. | CPUSA Archives\n\nEditor’s Note : Feb. 25, 2021, marks the 140th anniversary of the birth of William Z. Foster. One of the most well-known figures of early 20th century labor history, Foster spearheaded the drive to organize the packinghouse industry during World War I and led the Great Steel Strike of 1919. He later joined the Communist Party and rose to leadership in its ranks. As the party’s presidential candidate alongside Black leader James W. Ford in 1932, Foster tallied over 100,000 votes. He was also a pioneer in the fight against racism in organized labor and to integrate trade unions, which for so long persisted in downgrading or ignoring the struggles of Black workers. In this article, biographer Arthur Zipser discusses Foster’s role in the fight to bring full equality for Black workers in the U.S. labor movement. It is excerpted from his 1981 book, Working Class Giant: The Life of William Z. Foster, from International Publishers.\n\nIt can hardly be said that Bill Foster was born into the struggle for racial equality. The sordid Philadelphia slum in which he grew up was the turf of a youth gang called The Bulldogs, most of whom, like Foster, were of Irish-American nationality. They showed scant hospitality to “aliens” who wandered into their territory. In the case of Black people, the ban was total. Those who ventured there could expect a rough reception.\n\nFoster left the old neighborhood when he was about 20 years old and began a search for work which soon took him to Florida, where he found work in a sawmill. Six Black workers and eight whites lived in segregated misery in this lumber camp. Here Foster first witnessed an episode of racist terrorism. The noisy approach of nightriders alerted the Black workers. They fled into the woods where they remained all night. The leader of the gang noticed Foster’s Northern mode of speech and assured him menacingly that “if a Yankee minds his own business he is almost as good as a dog.”\n\nMost American Federation of Labor unions excluded Blacks from membership in those days, and the Socialist Party, to which Bill Foster belonged, was permeated with white chauvinism. Foster left the SP in 1909 and joined the Industrial Workers of the World. The IWW was distinguished from most other labor organizations of the period by its anti-capitalism, its industrial unionism, and its willingness to accept as members the young, the unskilled, the female, and the non-white.\n\nFoster soon broke with the IWW because of its dual-union policy which isolated the militant left from the mainstream in the AFL. He became a member of the Railway Carmen’s union (AFL) in Chicago, built a cadre of activists around himself, and before long played a leading role in Chicago’s labor movement.\n\nIn July 1917, Foster conceived a plan to bring the huge open-shop meatpacking industry into the union fold. Using the key Chicago area as a base, he rapidly achieved a federation of 12 local unions having craft jurisdiction and formed a Stockyards Labor Council. The first meeting of the council decided to place primary stress on signing up the unskilled majority of Chicago’s 60,000 packinghouse workers.\n\nMost Black workers were barred from the craft locals and from the skilled trades, but the unskilled and semi-skilled were now made welcome in the rapidly growing locals of the Butcher Workmen. Chicago soon had the largest African-American trade union membership of any U.S. city.\n\nThe harshly oppressed packinghouse workers were being sweated to produce food for the Allies of World War I. Foster’s bold organizing tactics evoked a sensational response. In packing centers across the country, tens of thousands flooded into the federated unions.\n\nIn less than a year, Foster and his group of militants brought unionism to an entire mass-production industry—and in a single great drive, 25,000 Black workers became union members. In 1919, when “race riots” occurred in Chicago, the Stockyards Labor Council adopted a resolution to expel any member who refused to accept Black workers on a basis of equality.\n\nWilliam Z. Foster’s next move was to organize the giant open-shop fortress of steel. His efforts brought 365,000 workers into the AFL and out on strike across the country in 1919. Black workers had always been barred from the craft unions, which were now federated in the steel strike committee. This fact helped the steel trust to break the strike. Writing a postmortem in 1920, Foster showed how this racist exclusion policy played into the hands of the steel bosses.\n\nFoster joined the Communist Party in 1921, about two years after its founding. In 1922, the CP made a partial break with a position it had carried over from its left-wing Socialist forebears. The left had traditionally viewed the question of African-American rights as only an aspect of the general working-class question. But now it was recognized that Black people had special demands as a people. In 1928, and over the years since the Communists developed an advanced position which takes into account the national group aspect of the Black liberation question.\n\nFoster was founder of the Trade Union Educational League (TUEL), which in 1924 demanded that “Negroes must be given the same social, political, and industrial rights as whites, including the right to work in all trades, equal wages, and admission into all unions….” This stand put the TUEL far ahead of all other labor organizations in the struggle for the rights of African Americans.\n\nFoster was the Communist candidate for president in 1928 and carried his campaign deep into the South. There, Art Shields, veteran political reporter, heard him “lashing disfranchisement, lynchings, and peonage in a hall in Atlanta while racist cops stood at the door.” Foster again ran for president in 1932. This time his running mate for vice president was James W. Ford, a Black leader. This introduced a new symbol of Black-white unity into the sphere of political campaigning.\n\nIn the early 1930s, the Trade Union Unity League, successor to the TUEL, carried on struggles which paved the way for the great advances of the Congress of Industrial Organizations. These struggles included a bitter coal strike in Harlan, Kentucky. Historian Theodore Draper (not a friendly critic), reviewing the stubborn insistence of Foster’s forces that Black and white should eat together in the same soup kitchens, said, “It is fair to say that only the Communists in that period…would have taken such a firm stand on this issue.”\n\nOn his 80th birthday, Feb. 25, 1961, William Z. Foster was a patient in a sanatorium on the outskirts of Moscow. His severe health problems called for a level of care that was available to him only as an honored guest of the Soviet Union. In this way, the last half-year of his life was eased by maximum attention and by a friendly and protective atmosphere.\n\nOn his last birthday, a surprise party banished, insofar as possible, the woes of illness, and Bill Foster was delighted to have a distinguished list of visitors to wish him well. Premier Nikita Khrushchev was there and so were Frol Koslov and other Soviet leaders. The Russian Civil War hero Semyon Budyonny and the writer Boris Polevoi were among the visitors.\n\nPerhaps most pleasing of all to Bill Foster was the presence of his dear friend Paul Robeson. Twenty years before, at Madison Square Garden, on the occasion of Bill’s 60th birthday, Paul had honored him singing Marc Blitzstein’s “The Purest Kind of a Guy,” a song which might have been written with Bill Foster in mind—and probably was.\n\nThe presence of the great baritone on the occasion of Foster’s birthday might have stood as a symbol of the struggle for unity of Black and white to which both men had contributed mightily in the course of their lifetimes."}], "Mayhew Foster was instrumental in the founding of the London Dispensary.": [{"url": "https://www.victorianweb.org/authors/mayhew/index.html", "page_content": "A clever and earnest-minded writer gets a commission from the Morning Chronicle newspaper, and reports upon the state of our poor in London; he goes amongst labouring people and poor of all kinds — and brings back what? A picture of human life so wonderful, so awful, so piteous and pathetic, so exciting and terrible, that readers of romances own they never read anything like to it; and that the griefs, struggles, strange adventures here depicted exceed anything that any of us could imagine. Yes; and these wonders and terrors have been lying by your door and mine ever since we had a door of our own. We had but to go a hundred yards off and see for ourselves, but we never did. — Thackeray, writing in Punch, 9 March 1850, p.93.\n\nIntroductory Materials\n\nLiterature\n\nExcerpts from Mayhew's Work\n\nGeneral Cultural and Economic Contexts\n\nOther Related Material\n\nBibliography\n\nHumpherys, Anne. Travels into the Poor Man's Country: The Work of Henry Mayhew. Athens: University of Georgia Press, 1977.\n\n_____. Henry Mayhew. Boston: Twayne, 1984.\n\nLouttit, Chris. \"The Novelistic Afterlife of Henry Mayhew.\" Philological Quarterly. 85/3-4 (Summer-Fall 2006): 315-42.\n\nMayhew, Henry. London Labour and the London Poor. Ed. Robert Douglas-Fairhurst. Oxford: Oxford University Press, 2010.\n\nTaithe, Bertrand. The Essential Mayhew: Representing and Communicating the Poor. London: Rivers Oram Press, 1996.\n\nThackeray, W. M. \"Waiting at the Station\" Punch. 9 March 1850: 92-93 (reprinted later in Thackeray's Miscellanies, 1856). Internet Archive. Collection Americana. Web. 23 December 2016.\n\nWhite, Jerry. London in the Nineteenth Century: \"A Human Awful Wonder of God.\" London: Cape, 2007.\n\n\n\nVictorian\n\nWeb\n\n\n\nAuthors"}, {"url": "https://victorianweb.org/history/work/abanerjee1.html", "page_content": "[Unless otherwise stated, all quotations are from the book under review, and all illustrations are taken from Mayhew's London: Being Selections from London Labour and the London Poor (Spring Books, n.d.), available at the Internet Archive. Click on the thumbnails for larger images.]\n\nCover of the book under review, showing a scavenger — maybe a \"rag-picker\" or a \"bone-grubber.\"\n\nOne of the well-known ironies of Victorian life and letters is that while England became increasingly rich and prosperous with the growth of industrialisation and its extensive empire, large sections of its population lived in abject poverty and destitution. Political theorists and social scientists like Engels in his Condition of the Working Class in England in 1844 addressed themselves to this glaring injustice. But their work was mainly of a theoretical and abstract nature. English novelists and journalists, however, gave a more poignant account of the lives of the poor, with a call for humanitarian action that touched the heart.\n\nHenry Mayhew, engraved from a daguerreotype by the London photographer Richard Beard. (This was the frontispiece to the first volume of the book, in 1861; it is also the frontispiece to Mayhew's London.)\n\nPre-eminent among the journalists was Henry Mayhew (1812-1887). In his useful introduction to this new selection of Mayhew’s most famous work, London Labour and the London Poor, Robert Douglas-Fairhurst gives a comprehensive account of his life. The son of a successful solicitor, Mayhew refused to follow his father’s profession and ran away to India, where he worked in the East India Company for a few years. After that he first went to France and then returned to England. He tried his hand at law in Wales, but soon gave it up and became a journalist, founding and editing a popular journal, Figaro (based on the French Le Figaro which he had encountered during his stay in France). He also turned to the stage and wrote, or co-wrote, unmemorable plays like The Wandering Minstrel and But However — he produced a couple of novels, too. But he felt that journalism was more his forte, and started writing for various journals. His most remarkable journalistic enterprise was the founding of Punch which he co-edited with Mark Lemon and Stirling Coyne. But he left it after only a year, surviving on miscellaneous writings again. There were false starts in his personal life as well: he married the journalist Douglas Jerrold’s daughter Jane in 1844, but this marriage broke up, largely because of his lavish housekeeping. This, together with the failure of the railway journal Iron Times, which he had recently started, led to his bankruptcy.\n\nHis breakthrough came in September 1849 when the Morning Chronicle, a liberal newspaper that chronicled ordinary life (and had previously published Dickens’s Sketches by Boz) asked him to write on the outbreak of cholera in Bermondsey. Thousands of people had died of the disease within months and Mayhew vividly painted the unhygienic living conditions of the poor which had caused the outbreak. His article, \"A Visit to the Cholera Districts of Bermondsey\" 1949, was a great success, and the editors of the journal announced a new series of articles which would give \"a full and detailed description of the moral, intellectual and material, and physical condition of the industrial poor throughout England\" (xx). Mayhew was appointed its Metropolitan Correspondent in October 1849, and he was asked to cover the different parts of the London metropolis. He wrote two or three \"reports\" a week for the next year. In 1850, the Chronicle closed down for various reasons. But by then Mayhew had established his own office in London and published the first number of London Labour and the London Poor. Two \"reports\" a week appeared in this series from December 1850 until February 1852, when it abruptly came to a close. Mayhew continued to write on this subject of the poor in London, and on various other themes. In 1861, he decided to collect all his relevant articles, including the ones he had written for the Morning Chronicle, and published London Labour and the London Poor as a single work in three volumes (a fourth volume, mainly written by others, came out later).\n\nDouglas-Fairhurst's one-volume selected edition, which includes a useful scholarly apparatus, manages to show the range and variety of Mayhew’s original enterprise. The introduction is followed by a Select (but ample) bibliography, and a detailed chronology in which Mayhew’s life is set in the context of the major historical and cultural events of the times. Douglas-Fairhurst’s annotations are equally thorough, explaining much that would be lost on modern readers, whether because of out-dated slang, or because of topical references. He has also kept the flavour of the original edition by including facsimiles of the title page and Preface of the first volume of 1861, and some of the \"numerous illustrations from photographs\" originally published at the beginning of each number. The 1861-62 volumes provided him with his basic text.\n\nLeft to right: (a) A Cab Driver, such as those that Mayhew had \"at his call\" (p.529). (b) A Baked Potato Seller working in the Haymarket (p. 69). (c) A Bird's- Nest Seller (p. 231). (d) A (young) Street-Seller of Grease-Removing Composition (p. 166).\n\nThe bottom of the barrel. Left to right: (a) The London Sweep (p.332). (b) The London Dustman (p.331). (c) The Boy Crossing-Sweepers (p.430). (d) A Mudlark (p. 264).\n\nThanks to the Bermondsey paper, Mayhew knew how to go about this new project. But he was able to accomplish much more for the Morning Chronicle. This was well-endowed (its proprietors included the Duke of Newcastle and the wealthy Beresford Hope), and it provided him with ample resources and assistants to cover the enormous world of the poor and deprived in the Victorian London. In his Personal Recollections (1900), Sutherland Edwards recalled that for his work for the paper, Mayhew was \"largely paid and, greater joy of all, had an army of assistant writers, stenographers, and hansom cabmen at his call\" (60). In addition, as Mayhew himself acknowledged, he received substantial help from Henry Wood and Richard Knight, \"gentlemen who have been engaged with me from nearly the commencement of my enquiries, and to whose hearty co-operation both myself and the public are indebted for a large increase of knowledge\" (Preface 4). It was a collaborative enterprise, then.\n\nMayhew and his collaborators went round the deprived areas (he excluded the factory workers and miners) and actually spoke to the people of various professions and callings about their, life, working conditions and income. They covered a staggeringly large area of society in which most people lived from hand to mouth. Apart from street-sellers of various kinds of edibles like fruits and vegetable, Meat-Dealers, Sweet Piemen and sellers of Ices and Ice-Creams, Mayhew also gave accounts of the sellers of such manufactured articles as Nutmeg-Graters, Dog-Collars, Dolls and Poison for Rats. As for his descriptions of \"Street-Folks\" like Buyers of Waste and Refuse, Bone-Grubbers and Rag Gatherers, Cigar-End Finders and Beggars of various kinds, the Bodily Afflicted, those Subject to Fits, and Petty Trading Beggars, these scraped the very bottom of the social barrel. At this level there also were petty criminals like Pick-Pockets and Shop-Lifters, Swindlers, House-Breakers and Burglars and Thieves. All in all, it was hectic and clamorous life that Mayhew encountered and he felt that \"until it is seen and heard, we have no sense of the scramble that is going on throughout London for a living\" (16 ). His gift was to render it all so well in his articles that the reader gains a vivid picture of what is being described, and becomes emotionally involved with the people concerned.\n\nThe London Costermonger, bringing in his produce.\n\nWhen Mayhew came to arrange his articles in book form, he divided them into distinct sections, like those mentioned above. Street Exhibitors, for example, includes the Strong Man, Knife-Swallower and Clown. A brief consideration of Mayhew’s several articles under the heading \"Costermongers\" will provide a fair sample of his method, scope, variety and achievement. \"Costermonger\" was a term that was widely applied to the sellers of all kinds of things from a barrow, fruits, vegetables, fish and several other items of domestic use. Mayhew starts by giving a vivid account of a Saturday night market scene where the costermongers plied their trade in \"the pavement and roads [that were] crowded with purchasers and street-sellers\" (14).There \"are hundreds of stalls, and every stall has its one or two lights; either it is illuminated by the intense white light of the new self-generating gas-lamp, or else it is brightened up by the red smoky flame of the old-fashioned grease lamp.\" Its \"pavement and the road are crowded with purchasers and street-sellers. The housewife in her thick shawl, with the market-basket in her arm walks slowly on stopping now to look at the stall of caps and now to cheapen [bid for] a bunch of greens\"(14). The buyers and sellers of various kinds are all part of the chaotic scene.\n\nThe Old Vic, Waterloo Road, London SE1, today: it was designed in the early 19c. as a \"house of melodrama.\"\n\nBefore going on to describe their \"professional\" life and activities later in the book, Mayhew paints a picture of the costermongers' (whom he soon began to call 'costers') general amusements and pastimes. They play cards. Their cards are \"generally dirty, and sometimes almost illegible, from long handling and spilled beer\" (17). They usually play for beer but sometimes they play for bets which excite the on-lookers. Their other amusements are skittles, boxing, and \"Two-penny-hops\" (i.e., explains Douglas-Fairhurst, the admission charges for \"dancing rooms\"). Their favourite sports are rat-killing and dog-fighting. They admire the pugilist because they regard fighting \"to be a necessary part of boy' education\" (23). They also go to the theatre and the \"Penny concerts.\" Their visits are \"almost entirely confined to the galleries of the theatres on the Surrey-side,\" 21). The more prosperous among them go there almost three times a week. Mayhew meets one such avid theatre-goer who tells him that he likes love and murder best and has special feelings for \"deep tragedies.\" But he feels that some tragedies go on for too long. He cannot make 'either end nor side' (i.e. head or tail) of Hamlet, and would like it to be \"confined to the ghost scenes, and the funeral, and the killing off at the last\" (21). Mayhew devotes a separate section to his visit to the Coburg theatre, which was built in 1818. In 1833 it was renamed the Royal Victorian, after the then Princess Victoria, and is now popularly known as the Old Vic. He sees a huge crowd of costers starting to line up by the afternoon, much before the start of play. They are mostly boys and young men between twelve and twenty-three years of age. but young girls too \"are very plentiful, only one-third of whom now take babies, owing to the new regulation of charging half-price for infants\" (25). They scuffle, shout, sing and there is merriment all around. In fact there is such a din that the music played by the theatre orchestra is almost eclipsed: \"Altogether the gallery audience do not seem to be of a gentle nature. One poor lad shouted out in a crying tone that, 'he could not see,' and instantly a dozen voices demanded 'that he should be thrown over.'\" The costermongeres go to the play-house, not so much to enjoy a play as to enjoy the atmosphere of the theatre. They do not allow intervals between scenes, and if there is a slight delay they will shout, \"referring to the curtain — 'Pull up that there winder blind!' or they will call to the orchestra, saying, 'Now then catgut-scrapers! Let's have a ha'purth of liveliness'\" (27). The costers liked comic songs and dances best, and often they themselves would burst out into their own songs and choruses. Sometimes the actors took advantage of this, and on the night of Mayhew’s visit to the theatre, he found under one of the song titles printed in the bill, \"assisted by the most numerous and effective chorus in the metropolis —' meaning the whole of the gallery\" (28).\n\nThe Long-Song Seller (one of those in the superior \"Fine Arts\" bracket).\n\nThis lively, cheerful picture showed only one side of the costermongers' lives. According to Mayhew, their literacy level was very low. They were basically ignorant and uneducated. For instance, he gives an account of a costermonger who was about thirty years of age. The man was in poor circumstances now, but he boasted that in his better days he had served a better class of customers. One of his customers, he claimed, was the Prince of Naples. He had never met him nor did he know where Naples was: \"it may be in France for anything I know may [sic] Naples, or in Ireland.\" He did not know who the Pope was: \"I don’t know what the Pope is. Is he any trade? It's nothing to me, when he's no customer of mine.\" He had little knowledge of his own religion either: \"I never was in a church. O, yes, I've heard of God; he made heaven and earth; I never heard of his making the sea\" (29-30). Some \"costers\" did consider themselves better educated. In a later article, Mayhew describes one such man who was a street-seller of \"Stationery, Literature, and the Fine Arts.\" He and his kind prided themselves on their special abilities because they \"constitute principally the class of street-orators, known in these days as 'patterers,' and formerly termed 'mountebanks,' — people who, in the words of Strutt [Joseph Strutt, author of Sports and Pastimes of the People of England], strive to 'help off their wares by pompous speeches, in which little regard is paid either to truth or propriety'\" (74-75). One of these street-folk who told penny fortunes told Mayhew, \"People don’t pay us for what we gives 'em, but only to hear us talk. We live like yourself, sir, by the hexercise of our hintellects — we by talking, you by writing.\" Apparently, he was one of the ten people among them who was \"just able to read\" (28). On the whole, however, the educational level of the costermongers was abysmal. It prompted Mayhew to great indignation. That \"a class numbering 30,000 should be permitted to remain in a state of brutish ignorance is a national disgrace\" (30), he protested.\n\nWhen Mayhew came to collect his articles in book form, he realized that it was unprecedented in several ways. In his Preface he explains that he is giving the \"history of a people, from the lips of the people themselves — giving a literal description of their labour, their earnings, their trials and their sufferings, in their own 'unvarnished' language.\" He points out that he also portrays \"the condition of their homes and their families by personal observation of their places, and direct communion with the individuals\" (3). He ends with the hope that his portrayal of the London poor \"may teach those who are beyond temptation to look with charity on the frailties of their less fortunate brethren — and cause those who are in 'high places,' and those of whom much is expected, to bestir themselves to improve the condition of the class of people whose misery, ignorance and vice, amidst all the immense wealth and great knowledge of 'the first city in the world,' is, to say the very least, a national disgrace to us\" (5).\n\nHeadstone of William and Catherine Booth in Abney Park Cemetery, Stamford Hill, London N16.\n\nHow far he succeeded may perhaps be gauged from Douglas-Fairhurst’s Chronology. 1865, for instance, the year in which London Labour & The London Poor had its second printing, was also the year in which William Booth founded his Christian Mission (later called the Salvation Army) in Whitechapel, and this was followed in the next year by Dr Barnardo’s founding of a home for destitute children in the East End. Of course, Mayhew was one of a small army of humanitarian Victorians who pushed forward the cause of the poorest members of society — in his case, as he says, by revealing their lives largely through their own words.\n\nRelated Material\n\nBibliography\n\nMayhew, Henry. London Labour and the London Poor. Ed. Robert Douglas-Fairhurst. Oxford: Oxford University Press, 2010. 472 + li pp. �12.99. ISBN 978-0-19-956608-2.\n\n\n\nVictorian\n\nWeb\n\n\n\nSocial\n\nHistory\n\n\n\nEconomics\n\n\n\nWork\n\n\n\nBook\n\nReviews\n\n\n\nHenry\n\nMayhew"}, {"url": "https://www.gutenberg.org/files/63415/63415-h/63415-h.htm", "page_content": "The Project Gutenberg EBook of London Labour and the London Poor, Vol. 4, by Henry Mayhew This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you'll have to check the laws of the country where you are located before using this ebook. Title: London Labour and the London Poor, Vol. 4 Author: Henry Mayhew Release Date: October 9, 2020 [EBook #63415] Language: English Character set encoding: UTF-8 *** START OF THIS PROJECT GUTENBERG EBOOK LONDON LABOUR, LONDON POOR, VOL 4 *** Produced by Henry Flower, the booksmiths at eBookForge and the Online Distributed Proofreading Team at http://www.pgdp.net\n\n[ii]\n\n[iii]\n\nLONDON LABOUR\n\nAND THE LONDON POOR\n\nA Cyclopædia of the Condition and Earnings\n\nOF\n\nTHOSE THAT WILL WORK\n\nTHOSE THAT CANNOT WORK, AND\n\nTHOSE THAT WILL NOT WORK\n\nBY\n\nHENRY MAYHEW\n\nTHOSE THAT WILL NOT WORK\n\nCOMPRISING\n\nPROSTITUTES · THIEVES · SWINDLERS · BEGGARS\n\nBY SEVERAL CONTRIBUTORS\n\nWith an Introductory Essay on the Agencies at Present in Operation in the Metropolis for the Suppression of Vice and Crime\n\nby\n\nTHE REV. WILLIAM TUCKNISS, B.A.\n\nCHAPLAIN TO THE SOCIETY FOR THE RESCUE OF YOUNG WOMEN AND CHILDREN\n\nWITH ILLUSTRATIONS\n\nVOLUME FOUR\n\n[iv]\n\nFirst edition 1851 (Volume One only and parts of Volumes Two and Three) Enlarged edition (Four volumes) 1861-62 New impression 1865\n\nIt would be a work of supererogation to extol the utility of such a publication as “London Labour and the London Poor,” so apparent must be its value to all classes of society. It stands alone as a photograph of life as actually spent by the lower classes of the Metropolis. That one half of the world does not know how the other half lives is an axiom of antiquity, but the truthful revelations and descriptions of the London street folk, workers and non-workers, and the means by which they exist, will go a great way to enlighten the educated classes respecting matters which have hitherto been involved in mystery and uncertainty.\n\nThe class of individuals treated of in this volume are the Non-Workers, or in other words, the Dangerous Classes of the Metropolis; and every endeavour has been made to obtain correct information, not only through the assistance of the police authorities, but by an expenditure of much time and research among the unfortunates themselves. Their favourite haunts, and the localities in London wherein they chiefly congregate, as well as their modes of existence, are accurately described; in addition to which have been inserted very many deeply interesting autobiographies, faithfully transcribed from their own lips, which go far to unveil the intricate schemes of villany and crime that abound in the Metropolis, and prove how much more rational and effective are preventive measures than such as are merely correctional.\n\nEvery phase of vice has been investigated and treated of, in order that all possible information that can prove interesting to the moralist, the philanthropist, and the statist, as well as to the general public, might be afforded. In a word the veil has been raised, and the skeleton exposed to the view of the public.\n\nIn order to inspire hope and confidence in those who would shudder and lose heart in the perusal of such a record of crime and misery, the volume is prefaced by a comprehensive account of the agencies in operation within the Metropolis for the suppression of crime and vice, in which is detailed the aim and scope of the numerous religious and philanthropic associations now actively following the footsteps of that Divine Saviour, Whose chief mission was to the poor and guilty.\n\nThese brave workers now abound in all the dark places of the Metropolis, and the fruits of their labours, particularly in the case of youthful criminals, are becoming, through the blessing of Providence, abundantly apparent.\n\nA vast amount of statistical information, compiled from authentic records, is contained in the body of the work, and in the Appendix, and a few illustrations are introduced, graphically showing the extremes of vice and crime.\n\nThe publishers have to thank Sir Richard Mayne and the authorities at Scotland Yard, as well as the Secretaries of the various charitable societies, for much valuable information and assistance.\n\nStationers’ Hall Court;\n\nDecember, 1861.\n\n\n\nTHE AGENCIES AT PRESENT IN OPERATION WITHIN THE METROPOLIS, FOR THE SUPPRESSION OF VICE AND CRIME. By the Rev. William Tuckniss, B.A. PAGE Universal Desire for Investigation xi Mere Palliatives insufficient to Check the Growth of Crime xi Decrease of Crime doubtful xii General Desire to Alleviate Misery xiii Guthrie on Great Cities xiv Social Position of London xv Agencies at Work in London xvii Their Number and Income xvii Curative Agencies xviii British and Foreign Bible Society xix Society for Promoting Christian Knowledge xix Institution for Reading the Word of God in the Open Air xix Theatre Services xix London City Mission, xx Church of England Scripture Readers’ Society xxii Religious Tract Society xxiii Pure Literature Society xxiii Preventive Agencies xxiv National Temperance Society xxiv United Kingdom Alliance xxiv Free Drinking Fountain Association xxv Ragged School Union xxv Society for Improving the Condition of the Labouring Classes xxv Female Servants’ Home Society xxvi Female Aid Society xxvii Training Institutions for Servants xxvii Field Lane Night Refuges xxvii Dudley Stuart Night Refuge xxvii Houseless Poor Asylum xxviii House of Charity xxviii Foundling Hospital xxviii Society for the Suppression of Mendicity xxviii Association for Promoting the Relief of Destitution xxviii Association for the Aid and Benefit of Dressmakers and Milliners xxix Young Women’s Christian Association and West-end Home xxix Society for Promoting the Employment of Women xxx Metropolitan Early Closing Association, &c. xxx Repressive and Punitive Agencies xxx Society for the Suppression of Vice xxxi The Associate Institution xxxi Society for Promoting the Observance of the Lord’s Day xxxiv Society for the Prevention of Cruelty to Animals xxxiv Reformative Agencies xxxiv Reformatory and Refuge Union xxxiv Reformative Agencies for Fallen Women xxxv Magdalen Hospital xxxvi London by Moonlight Mission xxxvii Society for the Rescue of Young Women and Children xxxvii London Female Preventive and Reformatory Institution xxxvii Concluding Remarks xxxviii INTRODUCTION AND CLASSIFICATION. By Henry Mayhew 1 Workers and Non-workers 2 Classification of ditto 11 Those who will Work 12 Enrichers 13 Auxiliaries 16 Benefactors 19 Servitors 20 Those who cannot Work 22 Those who are provided for 22 Those who are unprovided for 22 Those who will not Work 23 Vagrants or Tramps 23 Professional Beggars 23 Cheats and their Dependants 24 Thieves and their Dependants 25 Prostitutes and their Dependants 27 Those that need not Work 27 Those who derive their Income from Rent 27 Those who derive their Income from Dividends 27 Those who derive their Income from Yearly Stipends 27 Those who derive their Income from obsolete or nominal Offices 27 Those who derive their Income from Trades in which they do not appear 27 Those who derive their Income by favour from others 27 Those who derive their support from the head of the family 27 THE NON-WORKERS. By Henry Mayhew 28 [viii] PROSTITUTES. THE PROSTITUTE CLASS GENERALLY. By Henry Mayhew and Bracebridge Hemyng 35 Prostitution in Ancient States 37 The Jews, &c. 39 Ancient Egypt 43 Ancient Greece 45 Ancient Rome 49 The Anglo-Saxons 34 Prostitution among the Barbarous Nations 58 African Nations 58 Australia 67 New Zealand 71 Islands of the Pacific 76 North American Indians 84 South American Indians 90 Cities of South America 93 West Indies 94 Java 96 Sumatra 99 Borneo 103 Prostitution among the Semi-civilized Nations 104 Celebes 107 Persia 108 The Affghans 111 Kashmir 115 India 117 Ceylon 125 China 129 Japan 136 The ultra-Gangetic Nations 139 Egypt 141 Northern Africa 149 Arabia, Syria, and Asia Minor 151 Turkey 155 Circassia 158 The Tartar Races 160 Prostitution among the Mixed Northern Nations 163 Russia 165 Siberia 167 Iceland and Greenland 172 Lapland and Sweden 174 Norway 177 Denmark 179 Prostitution in Civilized States 181 Spain 191 Amsterdam 195 Belgium 195 Hamburg 196 Prussia—Germany 198 Berlin 198 Austria 200 Modern Rome 201 Turin 203 Berne 204 Paris 205 PROSTITUTION IN LONDON. By Bracebridge Hemyng 210 General Remarks 210 Seclusives, or those that Live in Private Houses and Apartments 215 The Haymarket 217 Degree of Education among Prostitutes 218 Board Lodgers 220 Autobiographies 220 Those who Live in low Lodging Houses 223 Swindling Sall 223 Lushing Loo 224 Sailors’ Women 226 Visit to Ratcliff Highway 228 Visit to Bluegate Fields, &c. 231 Soldiers’ Women 233 Visit to Knightsbridge 235 Thieves’ Women 236 Visit to Drury Lane, &c. 236 Park Women 242 Examples 242 The Dependants of Prostitutes 246 Bawds 246 Followers of Dress Lodgers 247 Keepers of Accommodation Houses 249 Procuresses, Pimps, and Panders 250 Fancy Men 252 Bullies 253 Clandestine Prostitutes Female Operatives 255 Maid Servants 257 Ladies of Intrigue and Houses of Assignation 258 Cohabitant Prostitutes 259 Narrative of a Gay Woman 260 Criminal Returns 263 Traffic in Foreign Women 269 THIEVES AND SWINDLERS.— By John Binny. Introduction 273 Sneaks, or Common Thieves 277 Juvenile Thieves 277 Stealing from Street Stalls 277 Stealing from the Till 278 Stealing from the Doors and Windows of Shops 279 Stealing from Children 281 Child Stripping 281 [ix] 282 Stealing Linen, &c. 283 Robberies from Carts 284 Stealing Lead from House-tops, Copper from Kitchens, &c. 285 Robberies by false Keys 286 Robberies by Lodgers 288 Robberies by Servants 289 Area and Lobby Sneaks 290 Stealing by Lifting Windows, &c. 292 Attic or Garret Thieves 293 A Visit to the Rookery of St. Giles 294 Narrative of a London Sneak 301 Pickpockets and Shoplifters 303 Common Pickpockets 306 Omnibus Pickpockets 309 Railway Pickpockets 310 A Visit to the Thieves’ Dens in Spitalfields 311 Narrative of a Pickpocket 316 Horse and Dog Stealers 325 Horse Stealing 325 Dog Stealing 325 Highway Robbers 326 A Ramble among the Thieves’ Dens in the Borough 330 Housebreakers and Burglars 334 Narrative of a Burglar 345 Narrative of another Burglar 349 Prostitute Thieves 355 Prostitutes of the Haymarket 356 Common Street Walkers 360 Hired Prostitutes 361 Park Women 362 Soldiers’ Women 363 Sailors’ Women 365 Felonies on the River Thames 366 Mudlarks 366 Sweeping Boys 367 Sellers of Small Wares 367 Labourers on board Ship 367 Dredgermen or Fishermen 368 Smuggling 368 Felonies by Lightermen 368 The River Pirates 369 Narrative of a Mudlark 370 Receivers of Stolen Property 373 Dolly Shops 373 Pawnbrokers, &c. 374 Narrative of a Returned Convict 376 Coining 377 Coiners 378 Forgers 380 Cheats 383 Embezzlers 383 Magsmen or Sharpers 385 Swindlers 388 BEGGARS.— By Andrew Halliday. Introduction 393 Origin and History of the Poor Laws 394 Statistics of the Poor Laws 397 Report of the Poor Law Board 397 Street Beggars in 1816 398 Mendicant Pensioners 399 Mendicity Society 399 Examples of Applications 401 Begging Letter Writers 403 Decayed Gentlemen 404 Broken-down Tradesmen 405 Distressed Scholar 405 The Kaggs’ Family 406 Advertising Begging Letter Writers 410 Ashamed Beggars 412 The Swell Beggar 413 Clean Family Beggars 413 Naval and Military Beggars 415 Turnpike Sailor 415 Street Campaigners 417 Foreign Beggars 419 The French Beggar 419 Destitute Poles 420 Hindoo Beggars 423 Negro Beggars 425 Disaster Beggars 427 A Shipwrecked Mariner 428 Blown-up Miners 429 Burnt-out Tradesmen 429 Lucifer Droppers 431 Bodily Afflicted Beggars 431 Seventy years a Beggar 432 Having swollen Legs 433 Cripples 433 A Blind Beggar 433 Beggars subject to Fits 434 Being in a Decline 435 Shallow Coves 435 Famished Beggars 436 The Choking Dodge 437 The Offal Eater 437 Petty Trading Beggars 438 An Author’s Wife 440 Dependants of Beggars 441 Referees 445 Distressed Operative Beggars 446 Starved-out Manufacturers 446 Unemployed Agriculturists 446 Frozen-out Gardeners 446 Hand-loom Weavers, &c. 447\n\nMaps and Tables Illustrating the Criminal Statistics of each of the Counties of England and Wales in 1851. PAGE Map showing the Density of the Population 451 Table of ditto 452 Map showing the Intensity of Criminality 455 Table of ditto 456 Map showing the Intensity of Ignorance 459 Table of ditto 460 Table of Ignorance among Criminals 462 Table of Degrees of Criminality 464 Comparative Educational Tables 465 Map showing the Number of Illegitimate Children 467 Table of ditto 468 Map showing the Number of Early Marriages 471 Table of ditto 472 Map showing the Number of Females 475 Table of ditto 476 Map showing Commitals for Rape 477 Table of ditto 479 Map showing Committals for Assault with Intent to Ravish and Carnally Abuse 481 Table of ditto 482 Map showing Commitals for Disorderly Houses 485 Table of ditto 486 Map showing Concealment of Births 489 Table of ditto 490 Map showing attempts at Miscarriage 493 Table of ditto 494 Map showing Assaults with Intent 497 Table of ditto 498 Map showing Committals for Bigamy 499 Table of ditto 500 Map showing Committals for Abduction 501 Table of ditto 502 Map showing the Criminality of Females 503 Table of ditto 504\n\nLIST OF ILLUSTRATIONS.\n\nA Midnight Meeting—Rev. Baptist Noel speaking Frontispiece Greek Dancing Girl—Hetaira—Age of Socrates Page 45 Roman Brothel—Imperial Era 47 Women of the Bosjes Race 59 Girls of Nubia—Making Pottery 65 Woman of the Sacs, or “Sau-kies,” Tribe of American Indians 85 Dyak Women—Borneo 103 Chinese Woman—Prostitute 129 Scene in the Gardens of ‘Closerie des Lilas’—Paris 213 A Night House—Kate Hamilton’s 217 The New Cut—Evening 223 The Haymarket—Midnight 261 Boys Exercising at Tothill Fields’ Prison 301 Cell, with Prisoner at Crank Labour in the Surrey House of Correction 345 Friends Visiting Prisoners 377 Liberation of Prisoners from Coldbath Fields’ House of Correction 387\n\n[xi] INTRODUCTION.\n\nTHE AGENCIES AT PRESENT IN OPERATION WITHIN THE METROPOLIS FOR THE SUPPRESSION OF VICE AND CRIME.\n\nOne of the most remarkable and distinctive features of the present age is the universal desire for analytical investigations. Almost every branch of social economy is treated with a precision, and pursued with an accuracy, that pertains to an exact science. Demonstration has been reduced to a mathematical certainty; figures and statistics everywhere abound, and supply data for further research.\n\nToo often, however, it happens that the solution of the social problem, or the collation of facts tending to throw light upon the moral and religious condition of our country, forms the goal, and not the starting point of our labours.\n\nHaving accomplished a diligent, and often a laborious, search, and succeeded in eliminating truth from a mass of contradictory evidence, men are generally satisfied with the mere pleasure derived from success. Their knowledge, the hard pursuit of which has called forth immense energy and perseverance, and entrenched largely on their time and capital, is no longer the means to an end, but the end itself. Having gathered a few pebbles from the exhaustless arcana of social philosophy, they complacently enjoy their newly-found treasures, without a thought of the practical uses to which they may be applied.\n\nOther men are found who enter into their labours, and use the materials thus collected as the basis of further philanthropic investigations.\n\nWhile thus perpetually rising higher in the scale of intelligence, and arriving at closer approximations to truth, men too often neglect to turn their discoveries to any utilitarian or practical purpose, and rest content with merely theoretical results.\n\nThus it is that while an inductive philosophy is built up from a series of statistics and particulars, very little is being done to reduce this knowledge to practice. The science of investigation is admirable as far as it goes, and the pursuit of truth is at all times an object worthy of human ambition; but it must become the pioneer to tangible results, or its utility will by no means be apparent; and indeed it becomes a question, in an active state of existence, how far knowledge, which is final in its character and valuable merely for its own sake, is calculated to reward the efforts expended on its acquisition. It is true that the old philosophers held a contemplative life to be the highest development of human happiness, but their dreamy and fluctuating views are hardly likely to carry weight in an age of bustling activity; and it is equally certain that the bare, quiescent contemplation of evil in all its endless ramifications and hideous consequences, apart from all remedial efforts, is not likely to prove satisfactory to the philanthropist, nor consolatory to the Christian.\n\nIt is only so far as knowledge opens up to us the path of usefulness, and directs us how and where to plant our energies for the benefit of the human race, that it becomes really valuable. If, however, knowledge be power, and if the discovery of an evil be half-way towards its cure, then have we a right to expect that our humanitarian and other appliances for the alleviation of misery and the prevention of crime, should at least keep pace with modern developments of social science.[xii] Hitherto men have been content to declaim against these evils, wherever they existed, without suggesting any feasible remedies.\n\nFor a length of time our philanthropic schemes have partaken too much of the character of mere surface appliances, directed to the amelioration of existing evils, but in no way likely to effect their extirpation. We have been dealing with effects rather than with first causes, and in our zeal to absorb, divert, or diminish the former, the latter have generally escaped detection. When too late, we have discovered that mere palliatives will not suffice, and that they are powerless to resist the steady growth of crime in all its subtle developments. For, as well might we attempt to exhaust the perennial flow of a spring by the application of sponges, as prescribe external alleviations for our social disorders.\n\nOur homes, penitentiaries, and industrial reformatories will continue to do their work of mercy upon an infinitesimal scale, and will snatch solitary individuals from impending destruction; but in the meantime the reproductive process goes on, and fresh victims are hurried upon the stage of suffering and of guilt, from numberless unforeseen and unsuspected channels, thus causing a continuous succession of want, profligacy, and wretchedness.\n\nWe have affected surprise, that, notwithstanding all our benevolent exertions, and the completeness and efficiency of our reclaiming systems, the great tide of our social impurities continues to roll on with increasing velocity. Happily, however, for future generations, there is a manifest tendency in the present age to correct these fatal mistakes, and to return to first principles.\n\nThe science of anatomy is not confined to hospitals and dissecting-rooms, nor restricted in its application to the human frame. Social science conferences, and other associations are laying bare the deeply-imbedded roots of our national evils, and are preparing the way for their extirpation. Men are getting tired of planting flowers and training creepers to hide their social upases, and are beginning to discover that it is both sounder policy and truer economy to uproot a noxious weed than to pluck off its poisonous berries.\n\nWe have flattered ourselves that education and civilization, with all their humanizing and elevating influences, would gradually permeate all ranks of society; and that the leaven of Christianity would ultimately subdue the power of evil, and convert our outer world into an Elysium of purity and unselfishness. The results, however, of past years have hardly answered these sanguine expectations; and our present experience goes far to prove, that while there has undoubtedly been progress for good, there has been a corresponding progress for evil; for although the criminal statistics of some localities exhibit a sensible diminution in certain forms of vice, we must not forget that an increase of education and a growing intelligence bring with them superior facilities for the successful perpetration and concealment of crime.\n\nAll the latest developments of science and skill being pressed into the service of the modern criminal, his evasion of justice must often be regarded less as the result of caution, or of a fortuitous combination of favourable circumstances, than of his knowledge of chemical properties and physical laws. So far indeed from our being able to augur favourably from the infrequency of convictions, the fearful tragedies which are occasionally brought to the surface of society, coupled in many instances with a surprising fertility of resource and ingenuity of method, are indicative of an under current of crime—the depth and foulness of which defy all computation. We may add further, that the immense difficulty of obtaining direct evidence in cases of criminal prosecution, and the onus probandi that the law, not unfairly, throws upon the accusers, are sufficient to hush up any cases of mere suspicion; so that at present we possess no adequate data by which to gauge the real dimensions of crime, or to judge respecting its insidious growth and power. It is not, however, so much with crime in the abstract, as with the most prolific sources of[xiii] vice that the philanthropist has to deal; and it is a highly suggestive and encouraging fact that, in these days, men are concerned in investigating the various causes of crime, and in exposing its reflex influence upon society. Just in proportion as they adhere to this course, which is distinguished alike by prudence and sagacity, will they become instrumental in effecting a radical reformation of existing evils, and in restoring society to a more healthy and vigorous condition. “What we want in all such cases is no false rhetoric and no violent outbursts of passion, but clear statements of that vivid truth which contains the intrinsic elements of reformation amongst mankind. The true philanthropist is the man whose judgment is on a par with his feelings, and who recognizes the fact that there is some particle of meaning in every particle of suffering around us.\n\n“Some of this wretchedness is remediable, the result of actual causes which may be altered, though much is beyond human control. In an age like this, however we may toil to overtake the urgent need of our own time, the difficulty is, at the same time, calmly and deliberately to satisfy the fresh wants which may daily arise—keeping pace with them. With the heavy defalcations from past years weighing upon them, our statesmen and economists are often bewildered at the magnitude of their engagements; while the best and wisest amongst us are crushed and appalled by the new and giant evils which are continually being brought to light. Earnest thought, however, is the true incentive to action,”[1] and we would thankfully recognize as one visible result of the increasing attention given to matters of public interest, a growing disposition on the part of all who are qualified by position and authority, to grapple manfully with the various phases of wretchedness and crime now contributing their influence upon our social condition.\n\nNowhere are these hopeful indications more manifest than in this giant metropolis, where the various conditions of ordinary life seem to be intensified by their direct contact with good and evil; and where Christianity appears to be struggling to maintain its independent and aggressive character, amid much that is calculated to retard its progress and check its influence.\n\nIt is here, within the crowded areas and noisome purlieus of this greatest of great cities, that we may gather lessons of life to be gained nowhere else—and of which those can form a very inadequate conception, who dwell only in an atmosphere of honied flowers and rural pleasures.\n\nIt is here especially that the sorrows and sufferings of humanity have evoked an active and pervasive spirit of benevolence, which has infected all ranks and penetrated every class of society; so that the high born and the educated, the gentle and the refined, vie with each other in a restless energy to alleviate human misery and to assuage some of the groans of creation. This disposition to relieve distress in every shape, and to mitigate the ills of a common brotherhood, proclaims at once its divine origin, and is, in fact, the nearest assimilation to the character of Him who “went about doing good.”\n\nThe germ of this heaven-born principle has survived the fall; and though its highest development is one of the distinguishing marks of the true Christian, its existence is discernible in all who have not sinned away the last faint outlines of the Divine image.\n\nSome philosophers, indeed, would persuade us that there is no such thing in existence as a principle of pure, unmixed benevolence; that every exercise of charity is simply another mode of self-gratification, and every generous impulse a mere exhibition of selfishness.\n\nUndoubtedly there is a “luxury in doing good,” and the ability to contribute to the happiness of others is one of the purest sources of human gratification; but we question whether an act, resulting from mere self-love, is capable of yielding any solid satisfaction to the agent; and we therefore hold the existence of[xiv] genuine benevolence, believing that it is a principle innate in the human breast, and requiring only to be developed and consecrated by religious influence to become one of the most powerful levers for the evangelization of the world.\n\nUnhappily there are too many who have schooled themselves to the practice of inhumanity, and closed up the springs of spontaneous sympathy, thus depriving the heart of its rightful heritage, and restricting the sphere of its operations to self. Those who thus sever themselves from all external influences are left at length in undisturbed possession of a little world of their own creation. No longer linked to their fellow-men in the bonds of true fellowship, their orbit of activity becomes narrower, until at length every avenue to the heart is hermetically sealed, except such as minister to self-gratification and indulgence. The man who has thus estranged himself from the rest of creation, and become isolated from all the ties of a common humanity, is indeed an object of unqualified pity, because he has destroyed one of the purest springs of happiness.\n\nHe who, on the other hand, is most fully alive to the claims of universal brotherhood, and whose heart is most\n\n“At leisure from itself, To soothe and sympathize,”\n\nis the highest type of man, and the best representative of his race. This spirit of brotherhood if recognised by the world, would “hush the thunder of battle, and wipe away the tears of nations. It would sweep earth’s wildernesses of moral blight, causing them to blossom as the rose.”\n\nThose persons who accustom themselves to speak of London as a mere seething caldron of crime, or as a very charnel-house of impurity, without any redeeming character or hopeful element, are surely as wide of the mark as they who under-rate its vast resources for crime, or take a superficial view of its predominant vices.\n\nIt would, perhaps, be a curious and not unprofitable subject of inquiry how far the metropolis contributes its influence for good or evil upon the provinces, and to what extent the country is capable of reciprocating this influence. Probably, allowance being made for the difference of population, the law of giving and receiving is pretty evenly adjusted. Those forms of vice which seem to be more indigenous to our great cities are steadily imported into the country, while on the other hand, the hamlet and the village transmit to the town those particular vices in which they appear to be constitutionally most prolific.\n\nIt is in the crowded city, however, that the seeds of good or evil are brought to the highest state of maturity, and virtue and vice most rapidly developed, under the forcing influences that everywhere abound.\n\n“Great cities,” says Dr. Guthrie, “many have found to be great curses. It had been well for many an honest lad and unsuspecting country girl, that hopes of higher wages and opportunities of fortune—that the gay attire and polished tongue, and gilded story of some old acquaintance—had never turned their steps cityward, nor turned them from the rude simplicity, but safety of their rustic home. Many a foot that once lightly pressed the heather or brushed the dewy grass, has wearily trodden in darkness, and guilt, and remorse, on these city pavements. Happy had it been for many that they had never exchanged the starry skies for the lamps of the town, nor had left their lonely glens, or quiet hamlets, or solitary shores, for the throng and roar of our streets. Well for them that they had heard no roar but the rivers, whose winter flood it had been safer to breast; no roar but oceans, whose stormiest waves it had been safer to ride, than encounter the flood of city temptations, which has wrecked their virtue and swept them into ruin.\n\n“Yet I bless God for cities. The world had not been what it is without them.[xv] The disciples were commanded to ‘begin at Jerusalem,’ and Paul threw himself into the cities of the ancient world, as offering the most commanding positions of influence. Cities have been as lamps of light along the pathway of humanity and religion. Within them science has given birth to her noblest discoveries. Behind their walls freedom has fought her noblest battles. They have stood on the surface of the earth like great breakwaters, rolling back or turning aside the swelling tide of oppression. Cities, indeed, have been the cradles of human liberty. They have been the radiating, active centres of almost all church and state reformation. The highest humanity has been developed in cities. Somehow or other, amid their crowding and confinement, the human mind finds its fullest freest expansion. Unlike the dwarfed and dusty plants which stand in our city gardens, languishing like exiles for the purer air and freer sunshine, that kiss their fellows far away in flowery fields and green woodland, on sunny banks and breezy hills, man reaches his highest condition amid the social influences of the crowded city. His intellect receives its brightest polish, where gold and silver lose theirs, tarnished by the scorching smoke and foul vapours of city air. The mental powers acquire their full robustness, where the cheek loses its ruddy hue, and the limbs their elastic step, and pale thought sits on manly brows, and as aërolites—those shooting stars which, like a good man on his path in life, leave a train of glory behind them on the dusky sky—are supposed to catch fire by the rapidity of their motion, as they rush through the higher regions of our atmosphere, so the mind of man fires, burns, shines, acquires its most dazzling brilliancy, by the very rapidity of action into which it is thrown amid the bustle and excitements of city life. And if, just as in those countries where tropical suns, and the same skies, ripen the sweetest fruit and the deadliest poisons—you find in the city the most daring and active wickedness, you find there also, boldly confronting it, the most active, diligent, warm-hearted, self-denying and devoted Christians.”[2]\n\nLondon then may be considered as the grand central focus of operations, at once the emporium of crime and the palladium of Christianity. It is, in fact the great arena of conflict between the powers of darkness and the ministry of heaven. Here, within the area of our metropolis, the real struggle is maintained between the two antagonistic principles of good and evil. It is here that they join issue in the most deadly proximity, and struggle for the vantage-ground.\n\nHere legions of crime and legions of vices unite and form an almost impenetrable phalanx, while the strong man armed enjoys his goods in peace—no, not in peace, for here too the banner of the cross is most firmly planted, and Christianity wins its freshest laurels. Here is the stronghold, the occupation of which by the everlasting gospel, has given vigour, support, and consistency to the religion of the world. Here is concentrated that fervent and apostolic piety that has made itself felt to the remotest corner of the earth; and here is the nucleus of missionary enterprise, and the radiating centre of active benevolence.\n\n“The Christian power that has moved a sluggish world on, the Christian benevolence and energy that have changed the face of society, the Christian zeal that has gone forth, burning to win nations and kingdoms for Jesus,” have received their birth or development in London.\n\nSince, then, this busy mart of the world, in which the most opposite and dissimilar wares are exhibited, is made up of such composite materials and conflicting elements, it is only fair that while estimating its capabilities for crime, and endeavouring to plumb its depths of depravity, ignorance, and suffering, we should, when possible, faithfully depict their opposites, and take cognizance of such instrumentalities as present the best antidotes and alleviations.\n\nIt is questionable, indeed, how far the cause of religion and morality would be[xvi] promoted by a ghastly array of facts, representing the dimensions of crime in all its naked deformity, or by any exhibition, however truthful, of vice and wretchedness under their most repulsive aspects, and without any cheering reference to corrective and remedial agencies. The effect produced upon the mind, in such a case, would be, in the generality of instances, blank despair; and the only influence thus excited would partake strongly of that morbid sympathy and unhealthy excitement, awakened by delineations of fictitious distress.\n\nTo unravel the dark catalogue of London profligacy, and present to the eye of the reader the wearisome expanse of guilt and suffering, unrelieved by any indications of improvement, would be like exhibiting the convulsive death-agony of a drowning man without the friendly succour of a rope, or like conjuring up the horrors of a shipwreck without the mental relief afforded by a life-boat.\n\nWe need the day star of hope to guide us through the impenetrable gloom of moral darkness. The olive branch of mercy and the rainbow of promise are as needful tokens of social and religious improvement, as of abated judgments and returning favour.\n\nAfter being required to give attention to figures and statistics representing crime in the aggregate, the mental eye requires alleviation from the gross darkness it has encountered, and looks impatiently for some streak of light in the moral horizon, indicative of approaching day. To view London crime and misery, without their encouraging counterparts, would be like groping our way through the blackness of midnight, unrelieved by the faintest glimmer of light.\n\nJust, however, as stars shine brightest in the darkest nights, so may we discover some element of hope under the most appalling exhibitions of human depravity, which thus serve as a background to portray in bolder relief, and by force of contrast, the redeeming qualities of Christianity.\n\nAs a work of absorbing interest and utility to the British philanthropist, Mr. Mayhew’s wonderful book, “London Labour and London Poor,” stands probably unrivalled. The mass of evidence and detail, accumulated after the most careful and indefatigable research, and the personal interest which is sustained throughout, by the relation of facts and occurrences, gleaned from the author’s own private observation, or in which he took an active share, render his work both invaluable to the legislator and acceptable to the general reader.\n\nWhile, however, the former will refer to it as a book of reference, the latter would probably rise from its perusal, with a sickening apprehension of London depravity, and unless fortified by a previous knowledge of counteracting agencies would probably form a too lugubrious and desponding view of its social aspects. As any such impression, derived from ex-parte statements, would be highly detrimental to the cause of truth and religious progress, and might contribute to the relaxation of individual effort, the publishers have naturally hesitated to allow one of the most startling and vivid records of crime to go forth to the world, without directing attention to the most approved and popular agencies, for the correction of such abuses, as have been faithfully delineated in the course of the work.\n\nThe following brief summary of charitable and religious organizations, having for their object the repression of crime and the diffusion of vital Christianity, is intended therefore to form a supplement, or prefatory essay, to the fourth and concluding volume of London Labour and London Poor.\n\nIt would be impossible, within the narrow limits that have been assigned to this essay, to do more than touch in a cursory and incidental manner upon some of the principal agencies now at work within the metropolis, for the suppression of vice and crime; the object being not so much to exhibit the results which have rewarded such instrumentalities, great and incalculable as they are, as to indicate the best channels of usefulness, towards which public attention should be constantly directed; not to foster pride and self-complacency by tracing the progress we have[xvii] already made, in the race of Christian philanthropy, but rather to show how we may, by rendering efficient support to existing organizations, advance still further towards the goal, and rise to higher degrees of service in that ministry of love, which aims at nothing less than the regeneration of society, and the restoration of its unhappy prodigals to a condition of present and eternal peace.\n\nWhat we want is not so much the elaboration of new schemes and the introduction of untried agencies, as a more unanimous and hearty co-operation in sustaining such as are at present in existence, many of which though fully deserving of a large measure of confidence and support, are grown effete solely from want of funds to maintain them in efficiency.\n\nIt has been truthfully remarked that there is hardly a woe or a misery to which men are liable, whether resulting from accidental causes or from personal culpability, which has not been assuaged or mitigated by benevolent exertions. Experience indeed would go far to prove that there are everywhere around us two mighty conflicting elements at work, each having no other object than to pull down and destroy the other. Every vice has its corresponding virtue, every form of evil its counteracting influence for good, every Mount Ebal, its Gerizim; the one being designed to act as an antidote or corrective to the other, and to restore the type of heaven which the other has defaced. The highest glory of our land—a glory far removed from territorial acquisitions and national aggrandisement, and that which makes it pre-eminently the admiration and envy of all other countries—are its benevolent and charitable endowments. There is not another nation in the world, where eleemosynary institutions have obtained such a permanent hold upon the sympathies of all classes of society, nor where such vast sums are realized by voluntary and private contributions.\n\n“Palatial buildings, hospitals, reformatories, asylums, penitentiaries, homes and refuges, there are, for the sick, the maimed, the blind, the crippled, the aged, the infirm, the deaf, the dumb, the hungry, the naked, the fallen and the destitute; and it is to the support of such institutions, and the works which they carry on, that the nobles of the land, and our prosperous merchants devote a large proportion of their wealth.” No less than 530 charitable societies exist in London alone, and nearly £2,000,000 of money is annually spent by them, while probably the amount of alms bestowed altogether is not less than £3,500,000.[3]\n\nHow far these resources, vast and extended as they really are, are capable of satisfying present demands, may be best inferred from the state of our criminal population, which is still to be counted by tens of thousands, even while our prisons, refuges, and reformatories are filled to overflowing.\n\n“In spite,” says the author just quoted, “of our prison discipline, our classification system, our silent system, and our separate system, all these efforts that we make, and perhaps boast that we make, to turn back the law-breaker to honest paths, nearly 30,000 criminals are each year sent to prison, who only know the higher classes as objects of plunder, and the maintenances of law and order as things; if possible to be destroyed, and if not avoided.” £170,000 are annually expended in London for the reformation of such offenders, and every modern appliance that mercy or ingenuity can devise is brought to bear upon our prison system, with what results may be clearly ascertained by the large and increasing number of re-commitments—which form a proportion of something like 30 per cent. on such as have been previously incarcerated; while these, be it remembered, represent only the number of those who render themselves amenable to justice by detection; there being no means of ascertaining how many continue their avocations with impunity.\n\nResults like these are sufficiently disheartening to the philanthropist, and em[xviii]barrassing to the statesman, and serve to show that however necessary it may be to devise methods for criminal reformation, it is even more incumbent upon us, and far more remunerative in the end, to carry out the principles of prevention.\n\nThe various agencies, at work in London, for the suppression of vice and crime, may be treated under the following heads, which will serve to indicate their relative value and proportionate influence; and though, in their popular sense, many of the words used, may appear to be only convertible terms, it is intended, for the sake of perspicuity and arrangement, to assign to each a distinctive and separate meaning.\n\nThus the word curative is used, not in its loose, remedial sense, as applying to expedients calculated to produce a diminution of crime, but must be understood as tending to the entire and absolute change of the human will, and the renovation of a corrupt nature—such a thorough change, in fact, as is implied in the word cure.\n\nAgencies for the suppression of vice and crime. 1. Curative (radical). 2. Preventive (obstructive). 3. Repressive and punitive (compulsory). 4. Reformative (remedial).\n\n1. Curative Agencies.\n\nUnder this head religion naturally occupies the foremost place; since, by its restraining influence and converting power, it presents the only true antidote, and the only safe barrier to the existence or progress of crime; all other specifics, however valuable, being liable to the imputation of failure, and their influence being either more or less efficacious, according to the various phases of moral disease exhibited by different mental and physical constitutions.\n\nWhile applying political expedients for the cure of such disorders, it must ever be borne in mind, that the origin of all evil is to be found in the corruption of the human heart, and in its entire alienation from God; and it is only so far as these intrinsic defects can be remedied, that any permanent influence will be produced. That power, therefore, which seizes upon the citadel of the heart, controlling its affections, regulating its principles of action, and subduing its vicious propensities or illicit motions, is the only sovereign remedy for crime. In its natural state the heart may be compared to a fountain discharging only turbid and bitter waters; but while various agencies are employed to sweeten, disguise, or check this poisoned current, religion is the only influence which purifies the fountain head, and dries up the noxious springs, by placing a wholesome check upon the first motive principles of action—the thoughts.\n\nThe truth of these remarks is even more strikingly exemplified in the sudden and complete transformations of character, effected by the all-mighty influence of religion. The moral demoniac finds no difficulty in bursting the chains and fetters, in which society has attempted to bind him. He is never changed, only curbed, pacified, or restrained by such artificial modes of treatment. The wound may be cauterised, cicatrised, or mollified, but the poison, if left in the system, is sure to rankle and exhibit itself afresh. Religion, however, casts out the unclean spirit, restores human nature to its right mind, and asserts the supremacy of reason over that of passion and caprice.\n\nNext in value and importance to religion itself, are those subordinate instrumentalities calculated to exhibit or extend its influence, and which bear the same relation to it as the means do to the end. Such are the various agencies, in that divinely-appointed machinery for the regeneration of mankind, the universal spread of “truth and justice, religion and piety” throughout the world, and for the formation and support of the spiritual Church of Christ.\n\nThe most powerful and efficacious of all levers for the social, moral, and spiritual[xix] elevation of mankind is the Word of God. Into whatever quarters of the habitable globe the sacred volume is diffused, there is a corresponding spread of civilisation, and a sensible improvement in the scale of humanity; and those countries are most socially, morally, and politically debased, in which its circulation is debarred or restricted.\n\nHere it is only right to mention those societies which are directly concerned in diffusing the Scriptures.\n\nThe British and Foreign Bible Society is one of the most honoured and influential channels for promoting the circulation of the Word of God, “without note or comment.” It dates its origin from 1804, and since this period it has, either directly or indirectly, been instrumental in translating the Scriptures into 160 different languages or dialects, including 190 separate versions. Connected with this Society, there are in the United Kingdom 3728 auxiliary branches or associations.\n\nThe number of issues from London alone, during the last financial year, amount to 594,651 copies of the Old Testament, and 544,901 copies of the New Testament. The grants made during the same time amounted to £58,551 17s. 7d. The total receipts of the Society derived from subscriptions, and from the sale of publications, amounted last year to £206,778 12s. 6d.\n\nNext to the Bible Society, the Society for Promoting Christian Knowledge is most directly concerned in the propagation of the Scriptures. It was founded in 1698. During the past year 157,358 Bibles, and 78,234 New Testaments have been issued, besides prayer-books, tracts, and other publications. In addition to the dissemination of religious works, its objects include the extension of the Episcopate in the colonies, by contributing to the erection of new sees, and the support of colleges and educational institutions. The receipts for the past year amounted to £31,697 19s. 7d. besides £81,516 6s. 8d. received for the sale of publications.\n\nIn addition to these larger instrumentalities for the circulation of the Scriptures, it has been reserved for modern zeal and piety to discover a “missing link” in the operations hitherto in use, and this void has been admirably supplied by the “Bible women” of the nineteenth century. The appointment of these female colporteurs has been attended with the most beneficial and encouraging results, for not only has the sale of Bibles been facilitated among classes almost inaccessible to such influences, but opportunities have been afforded of permanently benefiting some of the most wretched and morally debased of our population. The introductions, gained by means of this traffic, have been turned to the best account, and a kindly influence has been established over the families thus visited, which has been often attended with the most favourable results.\n\n“The lowest strata of society are thus reached by an agency which takes the Bible as the starting point of its labours, and makes IT the basis of all the social and religious improvements which are subsequently attempted. Small in its beginnings, the work, by its proved adaptation and results, has greatly enlarged its dimensions, enlisting the sympathy and liberality of the Christian public; and in almost all the metropolitan districts affording scope for the agency, the Bible women are to be found prosecuting their arduous labours, with immense advantage to the poor. At the present time there are 152 of these agents employed. During the past year the Bible women in London disposed of many thousand copies of the Scriptures amongst classes, which, to a very great extent, were beyond the reach of the ordinary means used to effect this work; and this circulation was attained not by the easy method of gift, but by sale, the very poorest of the population being willing, when brought under kind and persuasive influence, to pay for the Bible or Testament by small weekly instalments.”\n\nAnother kindred agency of recent appointment is the “Institution for reading aloud the Word of God in the open air,” in connection with which are the “Bible[xx] Carriages,” or locomotive depôts, now employed for extending the sale of the Scriptures in various parts of London, and which have succeeded in drawing a large number of purchasers, attracted, no doubt, by the novelty and singularity of the means adopted.\n\nWhile enumerating the religious agencies concerned in the repression of crime in London, allusion need only be made incidentally to such as necessarily spring out of an organized, ecclesiastical, or parochial machinery consisting of clergy, churches, chapels, schools, &c., and to the various societies and associations designed to extend and give support to this machinery; the object of this essay being rather to draw public attention to such auxiliary and supplemental organisations, as are less generally known, or are of more recent origin.\n\nOne of the most remarkable movements of modern times in connection with preaching, has been the establishment of Theatre services, which owe their existence to the present Earl of Shaftesbury. So irregular and unconstitutional a proceeding provoked, as might naturally have been expected, a large amount of censure and unfriendly criticism. Ecclesiastical dignities were at first somewhat scandalized by such an innovation of church discipline, and evidently regarded the movement as one calling rather for reluctant toleration, than as being entitled to episcopal sanction—a feeling which was probably largely shared by the more sober and orthodox portion of the community.\n\nThere appeared to be, at first sight, it must be confessed, a singular incongruity, if not an absolute impropriety, in converting the stage of a playhouse into a temple for the provisional celebration of divine worship, and using an edifice habitually consecrated to amusement, for the alternate promulgation of sacred verities and pantomimic representations. Apart, however, from the repulsive features of the proceeding arising from local associations, and from the periodical juxtaposition of objects the most hostile and dissimilar, there appeared to be no graver objection to the arrangement. The end was here, at least, supposed not only to justify, but even to sanctify the means, and the defence of this mal-appropriation was not unfairly said to consist in the inadequacy of church accommodation, and in the cheap facilities thus afforded, for bringing under the occasional ministry of the word of life, classes, who from long habits of neglect, prejudice, and an utter disrelish of religious ordinances, had become isolated from the ordinary channels of instruction and improvement. The movement having now had a fair trial, and the results being found to answer the expectations of the originators, it may be regarded as no longer a hazardous experiment, but as a part of the recognised machinery employed for the evangelisation of the masses.\n\nThese special services for the working classes are now regularly conducted in the various theatres and buildings temporarily appropriated to divine worship. The attendance has been uniformly good, and that of a class who habitually absent themselves from religious ordinances, and could not therefore be reached by any of the usual instrumentalities. Considering the unpromising materials of which these singular congregations are composed, and the unfavourable antecedents of most of the audience, it is something to be able to state that on such occasions they are, for the most part, orderly and well conducted, while the continued good attendance at these services marks the appreciation in which they are held. During the Sabbath, then, at least, a wonderful outward transformation is effected in the pursuits and general demeanor of the frequenters, who meet together, week after week, to hear the Gospel message expounded in the very edifice, which during the previous six days has resounded with their oaths, ribaldries, and licentious language. Is there not room for at least a charitable hope, that when the heralds of salvation carry their proclamations into the very heart of the enemy’s territory, and aggressively plant the banner of the cross, where only the cloven foot is wont to be seen, some victories will be achieved over the world, the flesh, and the devil,[xxi] and that some who usually meet to scoff and jeer, will return home savingly impressed with what they have heard?\n\nIn strict conformity with the objects contemplated by this arrangement, and arising out of the same temporary necessity, is The Open-Air Mission, which was established in 1853 “for the purpose of stirring up the Church of Christ, especially the lay elements, to go out into the streets and lanes of the city, the towns and villages of the provinces, the great gatherings that periodically occur at races, fairs, executions, &c.; to go into lodging-houses, workhouses, and hospitals, and in fact wherever persons are to be met with and spoken to about sin and salvation.” Since the formation of the Society, open-air preaching has become as it were a standing institution, and is recognized as an indispensable agency in working densely-populated districts. Ministers and laymen are to be found on every hand using this divinely-appointed and apostolic agency to “bring in the poor, the maimed, the halt, and the blind,” and God has eminently blessed their labours.\n\nFrom May 1st, 1860, to March 31st, 1861, the London City Missionaries conducted 4,489 outdoor meetings, at which the average attendance was 103, and the gross attendance 465,070. Numerous associations have been formed in connection with this Society for Open-Air Preaching, in various parts of London, and during the summer, eighteen stations are occupied for this purpose by the students at the Church Missionary College, under the direction of the Islington Church Home Mission. A course of Sunday afternoon services is also regularly held by the appointment of the rector in Covent Garden Market, which are generally well attended and appear admirably calculated to benefit the classes whose welfare is designed. The Bishop of London and other dignities of the Church have been the preachers on such occasions, and have thus lent their countenance to the proceeding.\n\nIn reference to all such agencies as open-air services, prayer meetings, tract distributions, Bible readings, &c., it may be safely asserted, that never in the entire history of the Church was there a period, when such extraordinary efforts have been made to evangelise the poor and the criminal population of London; or when a similar activity has been displayed in ministering to the social and spiritual wants of the community.\n\nOne of the oldest and most privileged institutions within the metropolis, for bringing the influences of religion to bear upon the dense masses of our population is the London City Mission. It was founded in 1835, and its growth has steadily progressed up to the present date. The object of the mission is to “extend the knowledge of the Gospel, among the inhabitants of London and its vicinity (especially the poor), without any reference to denominational distinctions, or the peculiarities of Church government. To effect this object, missionaries of approved character and qualifications are employed, whose duty it is to visit from house to house in the respective districts assigned to them, to read the Scriptures, engage in religious conversation, and urge those who are living in the neglect of religion to observe the Sabbath and attend public worship. They are also required to see that all persons possess the Scriptures, to distribute approved religious tracts, and to aid in obtaining Scriptural education for the children of the poor. By the approval of the committee they also hold meetings for reading and expounding the Scriptures and prayer, and adopt such other means as are deemed necessary for the accomplishment of the mission.”\n\nThe London City Mission maintains a staff of 389 missionaries, who are employed in the various London and suburban districts; and thus the entire city is more or less compassed by this effective machinery, and brought under the saving influences of the Gospel. The very silent and unobtrusive character of the work thus effected, precludes anything like an accurate estimate of results, or a showy parade of success.\n\n[xxii]\n\nIt works secretly, quietly, and savingly, in districts too vast to admit of pastoral supervision, and in neighbourhoods too outwardly unattractive and unpropitious, to win the attention of any who are not animated with a devoted love of souls. The influence which is thus exerted in a social and religious point of view is inestimable, and the benefits conferred by this mission, are of an order that would be best understood and appreciated by the community, if they were for a time to be suddenly withdrawn.\n\nIn addition to the regular visitation of the poor, the missionaries are employed in conducting religious services in some of the “worst spots that can be found in the metropolis, and the audiences have been, in such cases, ordinarily the most vicious and debased classes of the population.”\n\nSix missionaries are appointed, whose exclusive duty it is to visit the various public-houses and coffee-shops in London, and to converse with the habitués on subjects of vital importance. There are also three missionaries to the London cabmen, a class greatly needing their religious offices, and by their occupation almost excluded from any social or elevating influences.\n\nThe following summary of missionary work, and its results for 1861, is sufficiently encouraging, as pointing in some instances, at least, to a sensible diminution of crime, and as being suggestive of a vast amount of good effected by this pervasive evangelistic machinery.\n\nNumber of Missionaries employed 381 Visits paid 1,815,332 Of which to the sick and dying 237,599 Scriptures distributed 11,458 Religious Tracts given away 2,721,73 Books lent 54,00 In-door Meetings and Bible Classes held 41,777 Gross attendance at ditto 1,467,006 Out-door Services held 4,489 Gross attendance at ditto 465,070 Readings of Scripture in visitation 584,166 Communicants 1,535 Families induced to commence family prayer 681 Drunkards reclaimed 1,230 Unmarried couples induced to marry 361 Fallen females rescued or reclaimed 681 Shops closed on the Sabbath 212 Children sent to school 10,158 Adults who died having been visited by the Missionary only 1,796\n\nThe income of the London City Mission, during the past year, amounted to 35,018l. 6s. 10d.; 5,763l. 15s. 7d. having been contributed by country associations.\n\nNext to the London City Mission, the Church of England Scripture Readers’ Society is one of the most extensive and important channels for disseminating a religious influence among the masses by means of a parochial lay agency.\n\nIt is the special duty of the Scripture readers to visit from house to house; to read the Scriptures to all with whom they come in contact; to grapple with vice and crime where they abound; and to shrink from no effort to arrest their career.\n\n“To overtake and overlook the growing multitudes which crowd our large and densely-peopled parishes,” was a work universally admitted to be beyond the present limits of clerical effort; and this desideratum has been supplied, at least to some extent, by the appointment of a lay agency, acting under the direction and control of the parochial clergy. By this means “cases are brought to light and doors opened to the pastoral visit, which were either closed against it or not discovered before; and an amount of information concerning the religious condition of the parish is obtained, such as the minister, single-handed, or with the aid[xxiii] of a curate, never had before.” The following results, which are reported as having attended the labours of a single Scripture reader, during a period of fourteen years, will serve as an illustration of the nature of those services rendered by this instrumentality:—\n\nVisits paid to the poor 23,986 Infants and adults baptized on his recommendation 3,510 Children and adults persuaded to attend school 2,411 Persons led to attend church for the first time 307 Persons confirmed during visitation 429 Communicants obtained by ditto 269 Persons living in sin induced to marry 48\n\nOne hundred and twenty-five grants are now made by the Society for the maintenance of Scripture readers in eighty-seven parishes and districts in the metropolis, embracing a population of upwards of a million.\n\nThe Society’s income for the past year amounted to 9,850l. 2s. 10d.\n\nSecond only in importance to personal evangelistic effort is the influence of a Religious Press. Public opinion being often fluctuating, and its general estimates of morality being, to a considerable extent, formed by the current literature of the age, it is essential that this mighty and controlling power should be exerted on the side of religion and virtue.\n\nWorks of a high moral tone, inculcating correct principles and instilling lessons of practical piety, conduce, therefore, in the highest degree, to a wholesome state of society, and to the preservation of public morals.\n\nThe two great emporiums of religious literature, most directly concerned in producing these results, are the Religious Tract Society and the Society for the Promotion of Christian Knowledge. The latter has already been referred to, as one of the main channels for the diffusion of the Scriptures.\n\nNone of the works issued by the Religious Tract Society can compete in point of interest or usefulness with those widely-circulated and deservedly-popular serials the Leisure Hour, the Sunday at Home, and the Cottager, a periodical lately published, and admirably adapted for the homes of the working classes.\n\nThe publications issued by the Society during the past year amounted to 41,883,921; half of which number were English tracts and handbills; 537,729 were foreign tracts; and 13,194,155 fall under the head of periodicals.\n\nThe entire number of both English and foreign publications issued by the Society, since its foundation in 1799, amount to 912,000,000.\n\nGrants of books and tracts are annually made by the Society for schools and village libraries, prisons, workhouses, and hospitals, for the use of soldiers, sailors, emigrants, and for circulation at fairs and races, by city missionaries and colporteurs.\n\nThe total number of such grants during the past year amounted to 5,762,241; and were of the value of £6,116 14s. 4d.\n\nThe entire receipts of the Society from all sources for the past year amounted to £103,127 16s. 11d.; the benevolent contributions being £9,642 9s. 2d.\n\nOther channels for the supply and extension of religious literature are the Weekly Tract Society, the English Monthly Tract Society, and the Book Society, which latter aims especially at promoting religious knowledge among the poor.\n\nAs a supplemental agency for the collection and dissemination of a wholesome literature, the Pure Literature Society, established 1854, is deserving of especial commendatory notice.\n\nThe following is a list of the periodicals recommended by the Society; and the circulation of which it seeks to facilitate:—\n\nFor Adults:—Leisure Hour, British Workman, Good Words, Old Jonathan, Youth’s Magazine, Appeal, Bible-Class Magazine, Christian Treasury, Church[xxiv]man’s Penny Magazine, Evening Hour, Family Treasury, Family Paper, Friendly Visitor, Mother’s Friend, Servant’s Magazine, Sunday at Home, The Cottager, Tract Magazine.\n\nFor Children:—Young England, Band of Hope Review, Child’s Own Magazine, Child’s Companion, Child’s Paper, Children’s Friend, Children’s Paper, Our Children’s Magazine, Sabbath School Messenger, Sunday Scholar’s Companion.\n\nUpwards of 140,000 periodicals are sent out annually by the Society in monthly parcels.\n\nThe Society’s income during the past year amounted to £2,783 12s. 2d.\n\n2. Preventive Agencies.\n\nUnder this division are not included those measures which have for their object the forcible suppression of crime, which will be considered under a separate head, nor yet such as are calculated to extinguish those criminal propensities, which are ever lying dormant in the human heart, for these, as has been already shown, can only be effectually subdued, or eradicated by the influences of religion. By preventive agencies are rather to be understood, those instrumentalities best adapted to effect the removal of peculiar forms of temptation, or to abridge the power of special producing causes of vice; whatever means, in fact, are efficacious in removing hindrances to the development of virtue, and in fostering principles of morality. Human nature, owing to the force of adverse circumstances, being often placed at a disadvantage, it is the peculiar province of preventive agencies to give it a fair chance of escape, by extricating it from its perilous position, and surrounding it with virtuous influences and humanizing appliances. Under this head, moreover, are included all such measures as conduce to the social and moral improvement of the community, either by presenting an indirect barrier to the progress of crime, or by the employment of counteracting agencies.\n\nIn this connexion the Temperance Associations are deserving of especial prominence. Drunkenness being the most fruitful source of all crime, and the primary cause of want and wretchedness, it follows that whatever instrumentalities are capable of arresting its progress, or curtailing its influence, are in every way worthy the consideration of the philanthropist and the statesman. The utility of temperance societies has often been called in question; but it must be admitted, that as an instrumental agency for the suppression of drunkenness, and consequently for the diminution of crime, the influence of such associations is unlimited. Whether or not the entire-abstinence system is based on philosophical arguments, or is deducible from Scripture teaching, is little to the point, provided the fruits it has yielded are unquestionably salutary in their effects upon society, and conducive to the present and eternal happiness of millions of individuals, who, but for this timely interference would have continued in their mad career of dissipation, without the power to break off the thraldom, or to dispel the infatuation in which they were held.\n\nThe National Temperance Society, formed in 1842, is now in active operation, and seeks by means of meetings, lectures, and publications, to disseminate its principles, and to draw attention to the objects it is endeavouring to promote.\n\nThe United Kingdom Alliance, for the legislative suppression of the liquor traffic, is a step in advance of the ordinary temperance movement, and aims at nothing short of the entire extinction of a commerce in intoxicating drinks. This body has already secured a large number of influential adherents, and appears to be rapidly gaining ground. A monster meeting has lately been held in Manchester in furtherance of the Society’s proximate aims, which are to introduce a permissive Bill into Parliament, to delegate to local authorities the power to prohibit such traffic within their respective neighbourhoods.\n\n[xxv]\n\nThe passing of this Act will in effect resolve the question of abolition or toleration into one of public opinion; and districts, if so inclined, will possess the power of deciding whether or no the sale of intoxicating drinks shall be carried on within their own parochial boundaries.\n\nAs a counteracting agency to the beer-shop and the gin-palace, The Metropolitan Free Drinking Fountain Association, formed two years ago, is deserving of special notice. It has for its objects the erection and maintenance of drinking fountains in the various crowded thoroughfares of the metropolis, thus humanely furnishing the means of alleviating that feverish thirst, which during the hot season impels so many to an excessive use of intoxicating drinks.\n\nThe Ragged Schools hold a prominent place among the indirectly preventive agencies for the suppression of crime in the metropolis; for since ignorance is generally the parent of vice, any means of securing the benefits of education to those who are hopelessly deprived of it, must operate in favour of the well-being of society.\n\nThe Ragged School Union has been formed with a view to develope and give consistency to this movement, which it does by collecting and diffusing information respecting schools now in existence, and by pecuniary grants towards their foundation and support.\n\nThe number of buildings now in existence in London, appropriated to these educational purposes, is 176. The day-schools are 151 in number, and are attended by 17,230 scholars. The evening-schools number 215, and the scholars 9,840; Sunday-schools 207, and scholars 25,260. The number of scholars placed in situations last year amounted to 1,800.\n\nPenny Banks, Clothing Clubs, Reading Rooms, Mother’s Meetings, and Shoe-Black Brigades have been established in connexion with this movement, and contribute their influence to the general well-being of those attending the schools, as well as to that of society at large.\n\nIn connexion with the Union are 16 refuges for the homeless and destitute, accommodating 700 inmates.\n\nThe receipts of the Union amounted last year to £5,739 7s. 8d.; and probably no money was ever laid out at better interest, than that contributed by the benevolent public towards the rescue and moral training of these embryo criminals. Difficult as the principle of Government intervention no doubt is, that would be a wise, politic, humane, and economical course which should sever this Gordian knot, by constituting the State the lawful guardian of such as are deprived of all that is understood by the terms home influence, and moral training.\n\nAnother agency contributing largely to the prevention of crime is the Society for Improving the Condition of the Labouring Classes, not so much, however, in the transformations and improvement of buildings effected under its own immediate control, which are rather designed to serve as models to those desirous of carrying out these principles of reform, as by drawing public attention to one of the most interesting and painful subjects that can occupy the mind of the philanthropist, viz., the inadequate provision of decent, and proper house accommodation for the industrial classes, which is now universally admitted to be productive of the worst social disorders.\n\nThe important provisions of the Common Lodging-Houses Act, passed in 1851, under the auspices of Lord Shaftesbury, and the system of registration thus enforced, have also been attended with great benefits, and have conduced not a little to the promotion of social and sanatory reform, by bringing legal enactments to bear upon the disorders, indecencies, and impurities of low and crowded lodging-houses.\n\nThere is no class of preventive agencies in the metropolis, which on every principle of justice and humanity have stronger claims on the sympathy of the[xxvi] benevolent than such as interpose their friendly shelter and kind offices, to rescue those who are suddenly reduced to positions of great extremity and temptation. It is doubtless an act of mercy to rescue a drowning man, and such charitable deeds are performed by those who labour for the reformation of the criminal; but it is a higher act of charity, and a wiser and more Christian course to prevent his falling into the stream; experience, however, proves that it is easier to enlist sympathy on behalf of one who is already being swept away by the current of crime, than to rescue one who is bordering on destruction, and perhaps bravely battling with temptation. This is perhaps only natural; our perception of danger in the one case is far greater than in the other, and our commiseration is awakened at sight of the death agony of the drowning wretch, but is hardly stirred on behalf of him who walks on the slippery brink.[4]\n\nIt is unhappily a fact too well authenticated to need further demonstration, that owing perhaps to sudden reverses of fortune, to the removal of natural protectors, or to the force of some overwhelming temptation, many persons are unwillingly, and almost unavoidably, pressed into the ranks of crime, who but for the extremity in which they were placed, would have continued to walk erect in the path of honour and virtue. Let none then who move in the calm sunlight of prosperity, presume to judge those who stumble in the dark night of trial.\n\n“The path of a man, even of a man on the highway to heaven, is never one of perfect safety. There are many dangerous passes in the journey of life. The very next turn, for anything we know, may bring us on one. Turn that projecting point, which hides the path before you, and you are suddenly in circumstances which demand that reason be strong, and conscience be tender, and hope be bright, and faith be vigorous.”\n\nHappily there are persons whose qualities of head and heart have enabled them by precautionary measures to provide against the weakness of human nature, and to offer assistance to those who are placed in such critical positions.\n\nThere is no class more essential to the well-being and comfort of society, and none, it is to be feared, more exposed to dangers and temptations, than domestic servants. It is calculated that in London alone there are upwards of one hundred thousand females engaged in domestic service, and that ten thousand of these are continually in a transition state, and therefore out of employment. When it is borne in mind that vast numbers of these young women have migrated, at an early age, from various parts of the country in search of a livelihood, that many of them are orphans and friendless, or at least wholly destitute of friends and resources in London, that they are moreover inexperienced, unsuspecting, and ignorant of the snares and temptations that surround them, it cannot be a matter of surprise that the reports of all the London penitentiaries should bear witness to the fact, that a large majority of the fallen women who are received into these institutions came originally from the ranks of domestic service. It would be superfluous to attempt to prove the value of associations formed to counteract these evils, by offering advice, shelter, and protection to servants who are out of situations or seeking employment. One of the oldest and best organizations of this kind is the Female Servants’ Home Society,[5] which has now been in active operation four-and-twenty years. Its objects are to provide a safe home for respectable female servants when[xxvii] out of place, or for those seeking situations. The Homes, four in number, are under the control of experienced and pious matrons, who establish a kind and motherly influence over the inmates, and are indefatigable in endeavouring to promote their welfare. The Homes are regularly visited by Christian ladies, and a service is conducted every week by the chaplain. A registry, free to the servants, is attached to each Home, where for a trifling fee of half-a-crown, or by an annual subscription of one guinea, every facility is afforded to employers of procuring efficient and trustworthy servants.\n\nSince the formation of the Society, upwards of 7,000 servants have been received into the Homes, and 37,000 have availed themselves of the registry provided, while in numberless instances young and friendless girls have been rescued from positions of extreme and imminent danger.\n\nA kindred institution to the above is The Female Aid Society, established in 1836. Its objects, which are threefold, are thus defined:—\n\n1st. “It provides a home for female servants, where they may reside with comfort, respectability, and economy, while seeking for situations;” and in connexion with which is a register for the convenience of servants and employers.\n\n2nd. “It receives into a home, for purposes of protection and instruction, young girls to be trained for service and other employments, who, from circumstances of poverty, orphanage, or sinful conduct in those who should preserve them from evil, are exposed to great temptations, and are in want of a home where there is proper guardianship and example.”\n\n3rd. “A home and rescue is offered to women who, weary of sin, are desirous of leaving a life of awful depravity and misery;” and no depth of past degradation, provided there is any sign of amendment, presents a barrier to their reception, shelter being freely offered to the very outcast among the outcasts, to inmates of refractory wards, of workhouses, and to women freshly discharged from prison. Since the formation of the Society 4,116 servants have been admitted into the Home, and 7,622 placed in service; 2,008 young women have enjoyed the protection of the Friendless’ Home, and 2,205 have been received as penitents. Want of funds, however, has obliged the Society to curtail its operations.\n\nThe Girls’ Laundry and Training Institution for Young Servants is an industrial home, affording shelter, protection, and instruction in household duties to forty young girls, who are thus carefully trained and prepared for domestic service.\n\nOther institutions for the accommodation, temporary relief, and permanent benefit of servants are, The National Guardian Institution, The Marylebone Philanthropic Servants’ Institution and Pension Society, The Provisional Protection Society, The General Domestic Servants’ Benevolent Institution, and The Servants’ Provident and Benevolent Society.\n\nAmong the London preventive agencies must be classed the various homes, refuges, and asylums for the relief of the utterly destitute and friendless of good character, and which severally offer food, shelter, and protection to those needing their assistance.\n\nThe Field Lane Night Refuges provide accommodation nightly for 200 men and women; and by this instrumentality many are rescued from death and crime, and are enabled to regain their positions in life, or to maintain themselves in respectability. During the past year 31,747 lodgings were afforded to persons of both sexes. Many of those thus assisted were poor needlewomen, who, during an inclement winter, had been, together with their families, turned into the street, having been stript of everything for rent.\n\nThe Dudley Stuart Night Refuge, founded by Lord Dudley Stuart in 1852, provides for the reception of the utterly destitute during the winter months. Accommodation is offered to 95 persons in two warm, spacious, and well-ventilated apartments. The relief afforded consists of a night’s lodging, bread night and[xxviii] morning, and medical attendance, if required. This charity has, since its foundation, alleviated a vast amount of suffering. It admits those against whom every other door is closed, and requires no recommendation beyond the utter destitution of the applicants. Upwards of 8,000 men, women, and children were admitted and relieved during last winter.\n\nThe Houseless Poor Asylum is the oldest night-refuge in London, and was opened to “afford nightly shelter and sustenance to the absolutely destitute working classes, who are suddenly thrown out of employment during the inclement winter months.” Accommodation is provided for 700; and since the opening of the Asylum 1,449,047 nights’ lodgings and 3,515,951 rations of bread have been supplied.\n\nThe House of Charity provides for the reception of distressed persons of good character, who, from various accidental causes, require a temporary home, protection, and food. Nearly 3000 persons of both sexes have been thus accommodated for an average period of a month or five weeks.\n\nThe Foundling Hospital, first opened in 1741, for the reception of illegitimate children, has undergone considerable changes and improvements, and now shelters, maintains, and educates 460 children, who, at the age of fifteen, are apprenticed or otherwise provided for, and are thus humanely rescued from the early and contaminating influence of vicious associations. No child is eligible for this charity unless there is satisfactory proof of the mother’s previous good character and present necessity, of desertion by the father, and that the reception of the child will, in all probability, be the means of replacing the mother in the course of virtue, and the way of an honest livelihood.\n\nThe Society for the Suppression of Mendicity was instituted in 1818, “for the purpose of checking the practice of public mendicity, with all its baneful and demoralizing consequences; by putting the laws in force against imposters who adopt it as a trade, and by affording prompt and effectual assistance to those whom sudden calamity or unaffected distress may cast in want and misery upon the public attention.”\n\nA just discrimination between cases of real and fictitious distress, and a judicious adaptation of relief to deserving cases, is a necessary, but very difficult, part of true benevolence. The frauds which are successfully practised by systematic sharpers upon a charitable, but over-credulous public, and the existence of an immense amount of genuine and unrelieved suffering, are sufficient proofs of the value and importance of any agency designed to counteract these abuses, and to accord a just measure of benevolence.\n\nBy means of printed tickets supplied to subscribers, beggars can be directed to the Society’s offices, where their cases are fully investigated, and treated according to desert, a sure provision being thus made against imposture.\n\nSince the formation of the Society 51,016 registered cases have been disposed of, and food, money, and clothing dispensed to deserving applicants, while employment has been provided for such as were found able to work.\n\nThe Association for Promoting the Relief of Destitution in the Metropolis is likewise a safe channel for the exercise of public benevolence. It is carried on under the direction of the bishop and clergy, and the efforts of the Association are directed to the origination and support of local undertakings, thus forming a connection and a centre of union between the various parochial visiting societies.\n\nThe present condition of that large class of female workers in London, comprehended under the terms milliners and dressmakers, is one of the saddest reproaches upon a country whose benevolent objects are so numerous, and so extensive, and one of the severest comments upon the heartlessness and artificialism of that society, which takes no cognizance of those who are most largely concerned in[xxix] administering to its necessities. The miseries of this shamefully under-paid and cruelly over-worked class of white slaves have been too often eloquently animadverted upon, to need any further denunciations of the system, under which they are hopelessly and unfeelingly condemned to labour.\n\nThe impossibility of supporting life on the wretched pittance accorded to their labours, is the oft-heard, and the unanswerably extenuating plea for their recourse to criminal avocations.\n\nWhile, however, the State shrinks from the task of ameliorating their condition by any legislative interference, it is satisfactory to know that public benevolence in this wide field is not wholly unrepresented.\n\nThe Association for the Aid and Benefit of Dressmakers and Milliners is a noble breakwater against the inroads of oppression, and a valuable counteracting agency to the force of temptation.\n\nIts objects, briefly stated, are to obtain some remission of labour and other concessions from employers, and to afford pecuniary and medical assistance in cases of temporary distress or illness. A registry and provident fund are provided in connexion with the association.\n\nActuated by the same humane intention, although different in object, is the Needlewomen’s Institution, established in 1850, “with the twofold view of affording those who had suffered under the oppression of middle men and slop-sellers, the opportunity of maintaining themselves, by supplying them with regular employment at remunerative prices, in airy work-rooms, and if desired, lodging at a moderate charge.”\n\nAnother institution of very recent origin directed to the religious and social improvement of the same unhappy class, is the Young Women’s Christian Association and West London Home, for young women engaged in houses of business. Its objects are twofold, 1st, “to supply a place where young women so employed, can profitably spend their Sundays and week-day evenings,” thus counteracting the evil influence of badly conducted houses of business; and 2nd, “the home is intended to provide a residence for young people coming from the country to seek employment, and for those who are changing their situations, or who from over-work and failing health require rest for a time.” The rooms of the Association are open every evening from seven until ten o’clock, when educational and religious classes are held for the benefit of those attending.\n\nThus, “where occasional spasms of sympathy, the well-merited castigations of the press, and the voice of popular opinion had unitedly failed to shake the throne of the god of Mammon, erected on skeletons, and cemented with the blood of women and children, it was reserved for a Christian lady to strike out a plan which has already been productive of an immensity of good, and has commended itself to the approval of all who are labouring to promote the welfare of this oppressed and neglected class. The better to appreciate the importance of this noble and truly womanly enterprise, only let the solemn and fearful fact be borne in mind, that in London alone 1,000 poor girls are yearly crushed out of life from over-toil and grinding oppression, while 15,000 are living in a state of semi-starvation. Ah! who can wonder that our streets swarm with the fallen and the lost, when SIN OR STARVE is the dire alternative! Who cannot track the via doloroso between the 15,000 starving and the thrice that number living by sin as a trade!\n\n“Here, then, is an Institution that meets the wants of the case. It not only catches them before they go over the precipice, and lovingly shelters them from the fierce blasts of temptation, beating remorselessly on many a young and shrinking heart, but ensures them a ‘Home,’ where soul and body alike may find rest and peace.”[6]\n\n[xxx]\n\nThe Society for Promoting the Employment of Women has lately been called into existence, by the emergencies of the present age, the object of which is to develop and extend the hitherto restricted field of female labour, by the establishment of industrial schools and workshops, where girls may be taught those trades and occupations which are at present exclusively monopolised by men. Those “educated in this school will be capable of becoming clerks, cashiers, railway-ticket sellers, printers,” &c.\n\nThese and similar measures which tend to open up resources to women in search of a livelihood, will have the happiest effect in diverting numbers into paths of honest industry, who now labour under strong temptations to abandon themselves to a life of criminal ease and self-indulgence.\n\nThe remaining agencies indirectly tending to the prevention of crime, are the Metropolitan Early Closing Association, for abridging the hours of business, so as to afford to assistants time for recreation, and for physical, intellectual, and moral improvement; the Metropolitan Evening Classes for Young Men, for furnishing the means of instruction and self-improvement; and the Young Men’s Christian Association, for promoting the spiritual and mental improvement of young men, “by means of devotional meetings, classes for Biblical instruction, and for literary improvement, the delivery of lectures, the diffusion of Christian literature, and a library for reference and circulation.” This last instrumentality has been widely blessed, and its beneficial influence is now extended, by means of branch associations, to most of the provincial towns.\n\n3. Repressive and Punitive Agencies.\n\nThe various instrumentalities falling under this head appear deserving of separate consideration, and cannot therefore be appropriately included under either of the previous divisions, being neither curative in their character, nor preventive to any appreciable extent. They evidently presuppose the existence of crime, and merely seek to diminish its influence, or curtail its power by the application of legal provisions and compulsory measures, intended on the one hand to indemnify society against the infraction of its rights, and on the other to intimidate or restrain the criminal offender. The absolute reformation of the viciously disposed can hardly be expected to result from the use of such means, and belongs properly to another class of agencies. It may indeed be achieved by punitive measures, but in this case reformation of character is rather a startling accident than an essential property of the system pursued. Experience has abundantly established the utility of legal provisions as a “terror to evil doers;” but the statistics of our police-courts will by no means warrant the assumption that penal measures have per se been successful in reclaiming the offender. It is not intended, however, while speaking of repressive and punitive agencies, to include in this category the strictly legal efforts employed by the State to deter and correct the criminal who renders himself amenable to justice. This subject will be found fully and distinctly treated by Mr. Mayhew, in a work now in the press, entitled “Prisons of London, and Scenes of Prison Life.”\n\nThe inquiry pursued in the course of this Essay is not designed to comprehend such constitutional measures as are employed by either Church or State, for the suppression of vice and crime; but rather to draw from their obscurity, and to give prominence to those resources and expedients which society itself adopts, for the defence and preservation of its own interests.\n\n[xxxi]\n\nThe Society for the Suppression of Vice, which was established in 1802, has for its objects the repression of attempts “to spread infidelity and blasphemy by means of public lectures, and printed publications.” The operations of the Society have also been directed to the suppression of disorderly houses, the punishment of fortune-tellers, and other important objects. “It is represented that by means of this Society many convictions have taken place, and persons have been sentenced to imprisonment for selling obscene publications and prints,” while their works have been either seized or destroyed. With such admirable intentions and useful objects, to commend it to benevolent support, and with the entire voice of public opinion in its favour, the only wonder is that this Society does not carry on its operations with greater publicity, vigilance, and efficiency. Unhappily the loathsome traffic in Holywell Street literature is still carried on with bold and unblushing effrontery, and its existence, although greatly diminished in the country, is too notorious and too patent, in certain portions of the metropolis, to need any extraordinary efforts to promote exposure and punishment.\n\nThe demoralizing influence of low theatres, and the licentious corruptions of the Coal Hole, and Posés Plastiques, might surely afford scope for vigorous prosecutions under the Society’s auspices; and yet these dens, in which the vilest passions of mankind are stimulated, and every sentiment of religion, virtue, and decency grossly outraged, or publicly caricatured, are allowed to emit their virulent poison upon all ranks of society without the slightest let or hindrance! Only let a man smitten by the plague or with any other infectious disease, obtrude himself by unnecessary contact upon the public, and his right to free agency would be summarily disposed of, by speedy incarceration within the walls of a hospital; but provided only the disorder be a moral one—and therefore far more to be dreaded, in its pestiferous influence and baneful effects upon society—it is forsooth to be tolerated as a necessary evil! Proh tempora et mores!\n\nThe Associate Institution, formed in 1844, has been in active operation fifteen years, and has been instrumental in effecting a large amount of good, by improving and enforcing the laws for the protection of women. It has maintained a strenuous crusade against houses of ill-fame, and has since its establishment conducted upwards of 300 prosecutions, in most of which it has been successful in bringing condign punishment upon the heads of those, who have committed criminal assaults upon women and children, or who have decoyed them away for immoral purposes.\n\nImportant as these results have been, a larger amount of good has probably been achieved by means of lectures and meetings held in various parts of the country by Mr. J. Harding, the Society’s travelling secretary, whose faithful and stirring appeals and bold denunciations of vice have contributed not a little to the spread of sounder and more wholesome views on social questions, and to the removal of that ignorance of profligate wiles and artifices, which, in so many cases, proves fatal to the unsuspecting and unwary.\n\nTwo Bills prepared by this Association, one for the protection of female children between 12 and 13 years of age, and the other to simplify and facilitate the prosecution of persons charged with keeping houses of ill fame, were this year submitted to parliament, but unhappily without success, having been lost either on technical grounds, or for want of support. It is refreshing to turn from the supineness of statesmen to the energy and decision manifested by private associations in resisting the encroachments of vice. The East London Association, composed of a committee partly clerical and partly lay, and including most of the influential parochial clergy in the district, was instituted four years ago for the purpose of checking “that class of public offences, which consists in acts of indecency, profaneness, drunkenness, and prostitution.”\n\nIts modes of action are as follows:—\n\n[xxxii]\n\n1. To create and foster public opinion in reprobation of the above-named acts. 2. To bring such public opinion to bear upon all exercising social influence, with a view to discountenance the perpetrators and abettors thereof. 3. To secure the efficient application by the Police of the laws and regulations for the suppression of the class of public offences above named; and to obtain, if necessary, the institution of legal proceedings. 4. To procure the alteration of the law, wheresoever needful to the object contemplated, and especially to the obtaining further restrictions in granting Licenses for Music and Dancing to houses where intoxicating liquors are sold. 5. To find Houses of Refuge and means of restoration for the victims of seduction by honest employment, emigration, &c.\n\nIt is satisfactory to state that already, and with the very limited funds placed at the disposal of this Association, no fewer than “seventy-five houses in some of the worst streets in the east of London, hitherto devoted to the vilest purposes, have been cleared of their inmates; one of these houses having had thirty rooms, which were occupied by prostitutes; that more than one house ostensibly open for public accommodation, but really for ensnaring females for prostitution, has been closed; and that in one instance of peculiar atrocity, the owner of the house has been convicted and punished. Handbills have also been issued, containing extracts from the Police Acts, to show the power of remedy for offences against public decency, such as swearing, the use of improper language, and the exhibition of improper conduct in the streets.”\n\nSuch are the objects and results of this Association, and such the praiseworthy example set to other London districts, which if vigorously followed would result, at least, in the repression of vice, and in a marked diminution of crime.\n\n“It is chiefly from the reserve which, rather by implication than by compact, has so long been preserved in those influential quarters where the power to correct and guide public opinion is maintained, that the crying social evil of our day has attained such dimensions, and exhibited itself in such dangerous and revolting forms as we have referred to. Preachers, moralists, and public writers have been deterred by the difficulty and delicacy of the subject from their obvious duty of protecting the social interests, and a sluggish legislature, ever inert in introducing such measures as are calculated to foster and conserve the public virtue, has thus lacked the external pressure which might have aroused it to vigilance and forethought in the discharge of its duties. Recently, however, there have been clear indications that a distrust of the old plan is spreading. With manifest reluctance, but not without interest, has public attention fastened itself on a subject in which not merely the happiness of individuals, and the peace of families, but the national prosperity and the concerns of social life, are felt to be bound up. Inquiries as to the best mode of doing something to stem the tide of immorality which is coursing onwards are made in quarters where indifference, if not acquiescence, was formerly manifested. Public opinion is ever slowly formed, but is seldom wrong at the last in detecting the true source of generic evils, and in applying to them the best remedies. Example, also, is as contagious on the side of virtue as of vice; and where an initiative step, taken by another, appeals to our intuitive sense of right and duty, it is seldom that the courageous right-doer has to wait long for the expression of sympathy and the proffer of aid.\n\n“It is only recently that the great sin of our land has received a measure of the attention it has long and loudly called for.\n\n“First in one quarter, and then in another, has the subject been discussed with tolerable delicacy, and with an approximate fidelity.\n\n“The discussion has done good. Men have thought about the subject, have been led to measure the fearful dimensions of this evil, to observe"}, {"url": "https://spitalfieldslife.com/2018/03/21/henry-mayhew-the-london-vagabond/", "page_content": "Henry Mayhew, The London Vagabond\n\nChris Anderson introduces his new biography of Henry Mayhew, The London Vagabond\n\nWhen Henry Mayhew died in 1887, one newspaper noted ‘The chief impression created in the public mind was one of surprise that he should still be alive.’ Yet nearly forty years earlier, his London Labour & the London Poor had gripped the country, confronting it with the voices of those who had been overlooked. His masterwork began as a series of ‘Letters’ commissioned by The Morning Chronicle and, from 1849 onwards, these grew into a panoramic survey of London’s poorest workers, a long exposure snapshot of mid-nineteenth century life.\n\nThe Spitalfields silk weavers were the first group of the working poor Mayhew reported on. Descended from Huguenot refugees, their livelihood was undermined by free trade after the abolition of import tariffs on French silk. Their experience was common among many highly-skilled London workers, as their quality of life deteriorated from the early years of the century, eroded by technological and social change. Late at night, in a narrow Shoreditch street, Mayhew mounted the stairs to a top floor room and visited an old weaver, sick in bed. The weaver lived and worked in a shared top floor room, cobwebbed with sagging clothes lines, where three looms jostled among several beds. The old man asked his daughter, Tilly, to pull up a chair for Mayhew, then began his tale.\n\n“Yes, I was comfortable in ’24. I kept a good little house and I thought, as my young ones growed up – why I thought as I should be comfortable in my old age, and ‘stead of that, I’ve got no wages. I could live by my labour then, but now, why it’s wretched in the extreme. Then I’d a nice little garden and some nice tulips for my hobby, when my work was done. … As for animal food, why it’s a stranger to us. Once a week, may be, we gets a taste of it, but that’s a hard struggle, and many a family don’t have it once a month … Tilly, just turn up that shell now and let the gentlemen see what beautiful fabrics we’re in the habit of producing – and then he shall say whether we ought to be in the filthy state we are. Just show the light, Tilly! That’s for ladies to wear and adorn them. And make them handsome’”\n\n(It was an exquisite piece of maroon coloured velvet. That, amidst all the squalor of the place, seemed marvellously beautiful, and it was a wonder to see it unsoiled amid all the filth that surrounded it).\n\nMayhew formed a close bond with the Spitalfields silk weavers. Yet The Morning Chronicle fired him after a year – for asking for more work, they said – for speaking up for the workers, Mayhew said. He revived the Letters as his own weekly serial, entitled London Labour & the London Poor. Increasingly, he focused on street folk, costers and other itinerant traders, yet he continued to support the silk weavers cause, even after London Labour ended abruptly in court over unpaid printer’s bills.\n\nOn Tuesday 4th May 1852 at the school room, St John’s St, Brick Lane, The Trade Society for the Protection of Native Industry convened a mass meeting to ‘adopt resolutions condemnatory of the present unregulated and stimulated system of competition, which is reducing the working classes of this country to the continental level’. Mayhew came on stage to loud cheering. He told how he had commenced his ‘inquiries into the state of the working classes, being at the time an inveterate Free-trader’ with The Morning Chronicle, but his research among the poor had converted him to protectionism.\n\nMayhew returned to Spitalfields for a very different occasion four years later, as part of his second major series, The Great World of London. On the evening of 8th April 1856, he summoned a gathering of professional villains, the ‘Swell Mobsmen’ at the White Lion Tavern, Fashion St. Entry was by ticket only, signed by Mayhew and stating the police were barred. A hundred crooks gathered in the well-lit, comfortable room where a ‘free and easy’ atmosphere prevailed.\n\n“A stranger would have had no suspicion that the men there assembled were at war with society. They one and all appeared well fed, well clad, and at ease with themselves. In the course of the evening several showily-dressed youths, who were evidently the ‘aristocracy’ of the class, walked into the room. These were mainly habited as clerks or young men in offices, some wearing gold guard chains, others with pistol keys dangling from their waistcoat pockets, and having diamond pins in their cravats. They were, however, all ‘mobsmen,’ as they are called – men who in some instances, we are assured, are gaining their £10 or even £20 a week by light-fingered operations. Indeed, several present were pointed out as ‘tip-top sawyers,’ ‘moving in the best society and doing a heavy business’. Beside those there were a few notorious ‘cracksmen’ (house-breakers) and one or two ‘fences’ (receivers of stolen goods), who were said to be worth their weight in gold.”\n\nMayhew proposed a society to help these people to go straight. In the event, most of the Swell Mobsmen seemed appreciative but unpersuaded.\n\n“A few candidly stated ‘they didn’t seem to care’ about reforming themselves, but they would gladly assist any of their body who was desirous of so doing.”\n\nA unique exploration of working Londoners, London Labour & the London Poor influenced an entire generation of writers, Charles Dickens among them. A pioneering work of social science, criminology and oral history, it was a century ahead of its time, yet within a few years of Mayhew’s death the work was all but forgotten, along with its author.\n\nOnly when the great metropolis that Mayhew loved lay in ruins after the Blitz did London Labour & the London Poor resurface. By the late sixties, all four volumes were available once more, riding the wave of a Victorian revival. ‘It is a book’, wrote W. H. Auden in 1968, ‘in which one can browse for a lifetime without exhausting its treasures.’ Yet a veil remained over Mayhew and, by the seventies, as academics fought over the meaning of his legacy, the historian E. P. Thompson observed:\n\n“He was the subject of no biography and there is something like a conspiracy of silence about him in some of the reminiscences and biographies of his contemporaries … Mayhew remains a puzzling character and some final clue seems to be missing.”\n\nBy the eighties, when London Labour & the London Poor had become established as a fixture on the reading list for courses on literature, history, criminology, culture studies and more, the Penguin edition could still open with, ‘It is strange that not more is known about the life of Henry Mayhew.’ Today, Mayhew crops up on the National Curriculum, feted as a philanthropist. His work inspires novels and films exploring the lost world of Victorian London. Terry Pratchet dedicated his final novel, Dodger, to Mayhew. Even so, his life has remained shrouded – until now.\n\nBorn into a wealthy family, Mayhew’s public school years were cut short and he was shipped off to Calcutta as a midshipman. Taken on at his father’s law firm upon his return, he left when – absentmindedly – he got his father arrested. Then he became a journalist and dramatist in eighteen-thirties London, neither considered respectable occupations, crowning the decade by founding Punch. It became the most successful magazine of the century and should have set him up for life.\n\nInstead, his path led to bankruptcy and prison. He spent years in exile in Guernsey and Germany. In between, he became famous for his revelations about the poor and brought out London Labour & the London Poor in 1851. He was a respected children’s author, a popular comic novelist, a criminologist who gave evidence to Parliamentary Select committees and a war correspondent. He wrote for the stage, tried to enter politics, the darling of both radicals and conservatives for attacking the liberal mantra of Free Trade. He was known as a philosopher and as a scientist, who revered his friend Michael Faraday, and sought to bring electric lighting to London decades before it arrived.\n\nMental illness haunted him though, his periodic peaks alternating with deep troughs. He mixed with Charles Dickens, William Makepeace Thackeray and stood at the centre of the burgeoning literary world, met with government ministers to advocate social reforms, and mingled with costers, dockers and the underworld too, keeping an open house for thieves and paroled prisoners. His closeness to some of them backfired in blackmail and death threats. His wife, Jane Jerrold, who dealt with the bailiffs for him and secretly co-wrote much of his work, left him when their children had grown up and insisted on being buried under her maiden name. Forgotten, Henry Mayhew spent his last decades moving from one Bloomsbury bedsit to another, plotting new schemes and new books, even until the very last.\n\nThe Oyster Stall. “I’ve been twenty years and more, perhaps twenty-four, selling shellfish in the streets. I was a boot closer when I was young, but I had an attack of rheumatic fever, and lost the use of my hands for my trade. The streets hadn’t any great name, as far as I knew, then, but as I couldn’t work, it was just a choice between street selling and starving, so I didn’t prefer the last. It was reckoned degrading to go into the streets – but I couldn’t help that. I was astonished at my success when I first began, I made three pounds the first week I knew my trade. I was giddy and extravagant. I don’t clear three shillings a day now, I average fifteen shillings a week the year through. People can’t spend money in shellfish when they haven’t got any.”\n\nThe Irish Street-Seller. “I was brought over here, sir, when I was a girl, but my father and mother died two or three years after. I was in service, I saved a little money and got married. My husband’s a labourer, he’s out of worruk now, and I’m forced to thry and sill a few oranges to keep a bit of life in us, and my husband minds the children. Bad as I do, I can do a penny or tuppence a day better profit than him, poor man! For he’s tall and big, and people thinks, if he goes round with a few oranges, it’s just from idleniss.”\n\nThe Groundsel Man. “I sell chickweed and grunsell, and turfs for larks. That’s all I sell, unless it’s a few nettles that’s ordered. I believe they’re for tea, sir. I gets the chickweed at Chalk Farm. I pay nothing for it. I gets it out of the public fields. Every morning about seven I goes for it. I’ve been at business about eighteen year. I’m out till about five in the evening. I never stop to eat. I am walking ten hours every day – wet and dry. My leg and foot and all is quite dead. I goes with a stick.”\n\nThe Baked Potato Man. “Such a day as this, sir, when the fog’s like a cloud come down, people looks very shy at my taties. They’ve been more suspicious since the taty rot. I sell mostly to mechanics, I was a grocer’s porter myself before I was a baked taty. Gentlemen does grumble though, and they’ve said, “Is that all for tuppence?” Some customers is very pleasant with me, and says I’m a blessing. They’re women that’s not reckoned the best in the world, but they pays me. I’ve trusted them sometimes, and I am paid mostly. Money goes one can’t tell how, and ‘specially if you drinks a drop as I do sometimes. Foggy weather drives me to it, I’m so worritted – that is, now and then, you’ll mind, sir.”\n\nThe London Coffee Stall. “I was a mason’s labourer, a smith’s labourer, a plasterer’s labourer, or a bricklayer’s labourer. I was for six months without any employment. I did not know which way to keep my wife and child. Many said they wouldn’t do such a thing as keep a coffee stall, but I said I’d do anything to get a bit of bread honestly. Years ago, when I as a boy, I used to go out selling water-cresses, and apples, and oranges, and radishes with a barrow. I went to the tinman and paid him ten shillings and sixpence (the last of my savings, after I’d been four or five months out of work) for a can. I heard that an old man, who had been in the habit of standing at the entrance of one of the markets, had fell ill. So, what do I do, I goes and pops onto his pitch, and there I’ve done better than ever I did before.”\n\nCoster Boy & Girl Tossing the Pieman. To toss the pieman was a favourite pastime with costermonger’s boys. If the pieman won the toss, he received a penny without giving a pie, if he lost he handed it over for nothing. “I’ve taken as much as two shillings and sixpence at tossing, which I shouldn’t have done otherwise. Very few people buy without tossing, and boys in particular. Gentlemen ‘out on the spree’ at the late public houses will frequently toss when they don’t want the pies, and when they win they will amuse themselves by throwing the pies at one another, or at me. Sometimes I have taken as much as half a crown and the people of whom I had the money has never eaten a pie.”\n\nThe Street- Seller of Nutmeg Graters. “Persons looks at me a good bit when I go into a strange place. I do feel it very much, that I haven’t the power to get my living or to do a thing for myself, but I never begged for nothing. I never thought those whom God had given the power to help themselves ought to help me. My trade is to sell brooms and brushes, and all kinds of cutlery and tinware. I learnt it myself. I was never brought up to nothing, because I couldn’t use my hands. Mother was a cook in a nobleman’s family when I was born. They say I was a love child. My mother used to allow so much a year for my schooling, and I can read and write pretty well. With a couple of pounds, I’d get a stock, and go into the country with a barrow, and buy old metal, and exchange tinware for old clothes, and with that, I’m almost sure I could make a decent living.”\n\nThe Crockery & Glass Wares Street-Seller. “A good tea service we generally give for a left-off suit of clothes, hat and boots. We give a sugar basin for an old coat, and a rummer for a pair of old Wellington boots. For a glass milk jug, I should expect a waistcoat and trowsers, and they must be tidy ones too. There is always a market for old boots, when there is not for old clothes. I can sell a pair of old boots going along the streets if I carry them in my hand. Old beaver hats and waistcoats are worth little or nothing. Old silk hats, however, there’s a tidy market for. There is one man who stands in Devonshire St, Bishopsgate waiting to buy the hats of us as we go into the market, and who purchases at least thirty a week. If I go out with a fifteen shilling basket of crockery, maybe after a tidy day’s work I shall come home with a shilling in my pocket and a bundle of old clothes, consisting of two or three old shirts, a coat or two, a suit of left-off livery, a woman’s gown maybe or a pair of old stays, a couple of pairs of Wellingtons, and waistcoat or so.”\n\nThe Blind Bootlace Seller. “At five years old, while my mother was still alive, I caught the small pox. I only wish vaccination had been in vogue then as it is now or I shouldn’t have lost my eyes. I didn’t lose both my eyeballs till about twenty years after that, though my sight was gone for all but the shadow of daylight and bright colours. I could tell the daylight and I could see the light of the moon but never the shape of it. I never could see a star. I got to think that a roving life was a fine pleasant one. I didn’t think the country was half so big and you couldn’t credit the pleasure I got in going about it. I grew pleaseder and pleaseder with the life. You see, I never had no pleasure, and it seemed to me like a whole new world, to be able to get victuals without doing anything. On my way to Romford, I met a blind man who took me in partnership with him, and larnt me my business complete – and that’s just about two or three and twenty year ago.”\n\nThe Street Rhubarb & Spice Seller. “I am one native of Mogadore in Morocco. I am an Arab. I left my countree when I was sixteen or eighteen years of age, I forget, sir. Dere everything sheap, not what dey are here in England. Like good many, I was young and foolish – like all dee rest of young people, I like to see foreign countries. The people were Mahomedans in Mogadore, but we were Jews, just like here, you see. In my countree the governemen treat de Jews very badly, take all deir money. I get here, I tink, in 1811 when de tree shilling pieces first come out. I go to de play house, I see never such tings as I see here before I come. When I was a little shild, I hear talk in Mogadore of de people of my country sell de rhubarb in de streets of London, and make plenty money by it. All de rhubarb sellers was Jews. Now dey all gone dead, and dere only four of us now in England. Two of us live in Mary Axe, anoder live in, what dey call dat – Spitalfield, and de oder in Petticoat Lane. De one wat live in Spitalfield is an old man, I dare say going on for seventy, and I am little better than seventy-three.”\n\nThe Street-Seller of Walking Sticks. “I’ve sold to all sorts of people, sir. I once had some very pretty sticks, very cheap, only tuppence a piece, and I sold a good many to boys. They bought them, I suppose, to look like men and daren’t carry them home, for once I saw a boy I’d sold a stick to, break it and throw it away just before he knocked at the door of a respectable house one Sunday evening. There’s only one stick man on the streets, as far as I know – and if there was another, I should be sure to know.”\n\nThe Street Comb Seller. “I used to mind my mother’s stall. She sold sweet snuff. I never had a father. Mother’s been dead these – well, I don’t know how long but it’s a long time. I’ve lived by myself ever since and kept myself and I have half a room with another young woman who lives by making little boxes. She’s no better off nor me. It’s my bed and the other sticks is her’n. We ‘gree well enough. No, I’ve never heard anything improper from young men. Boys has sometimes said when I’ve been selling sweets, “Don’t look so hard at ’em, or they’ll turn sour.” I never minded such nonsense. I has very few amusements. I goes once or twice a month, or so, to the gallery at the Victoria Theatre, for I live near. It’s beautiful there, O, it’s really grand. I don’t know what they call what’s played because I can’t read the bills. I’m a going to leave the streets. I have an aunt, a laundress, she taught me laundressing and I’m a good ironer. I’m not likely to get married and I don’t want to.”\n\nThe Grease-Removing Composition Sellers. “Here you have a composition to remove stains from silks, muslins, bombazeens, cords or tabarets of any kind or colour. It will never injure or fade the finest silk or satin, but restore it to its original colour. For grease on silks, rub the composition on dry, let it remain five minutes, then take a clothes brush and brush it off, and it will be found to have removed the stains. For grease in woollen cloths, spread the composition on the place with a piece of woollen cloth and cold water, when dry rub it off and it will remove the grease or stain. For pitch or tar, use hot water instead of cold, as that prevents the nap coming off the cloth. Here it is. Squares of grease removing composition, never known to fail, only a penny each.”\n\nThe Street Seller of Birds’ Nests. “I am a seller of birds’-nesties, snakes, slow-worms, adders, “effets” – lizards is their common name – hedgehogs (for killing black beetles), frogs (for the French – they eats ’em), and snails (for birds) – that’s all I sell in the Summertime. In the Winter, I get all kinds of of wild flowers and roots, primroses, buttercups and daisies, and snowdrops, and “backing” off trees (“backing,” it’s called, because it’s used to put at the back of nosegays, it’s got off yew trees, and is the green yew fern). The birds’ nests I get from a penny to threepence a piece for. I never have young birds, I can never sell ’em, you see the young things generally die of cramp before you can get rid of them. I gets most of my eggs from Witham and Chelmsford in Essex. I know more about them parts than anybody else, being used to go after moss for Mr Butler, of the herb shop in Covent Garden. I go out bird nesting three times a week. I’m away a day and two nights. I start between one or two in the morning and walk all night. Oftentimes, I wouldn’t take ’em if it wasn’t for the want of the victuals, it seems such a pity to disturb ’em after they made their little bits of places. Bats I never take myself – I can’t get over ’em. If I has an order of bats, I buys ’em off boys.”\n\nThe Street-Seller of Dogs. “There’s one advantage in my trade, we always has to do with the principals. There’s never a lady would let her favouritist maid choose her dog for her. Many of ’em, I know dotes on a nice spaniel. Yes, and I’ve known gentleman buy dogs for their misses. I might be sent on with them and if it was a two guinea dog or so, I was told never to give a hint of the price to the servant or anybody. I know why. It’s easy for a gentleman that wants to please a lady, and not to lay out any great matter of tin, to say that what had really cost him two guineas, cost him twenty.”\n\nImages courtesy Bishopsgate Institute"}, {"url": "https://prabook.com/web/mayhew.foster/2062361", "page_content": "Mayhew Foster\n\nlieutenant Soldier\n\nOctober 9, 1911 (age 99) Richmond, Virginia, United States of America\n\nForeign his actions in World World War II, Foster was awarded both the Silver Star and the Légion d\"Honneur. At the end of the war, Göring surrendered to the Allied Powers in the Bavarian Alps. On May 9, 1945, Foster transported Göring back to Germany on a 55-minute flight in an unescorted, unarmed L-5, a larger plane than the L4 he normally piloted, because Göring weighed more than 300 pounds (140 kg). . Several times I had the impulse to turn the plane over and see if I could shake him out, but he was wedged in like a champagne cork.\" Foster said that Göring, who spoke some English, avoided any talk of Adolf Hitler, with whom Göring - as the commander of the Luftwaffe - had fallen out of favor as the total German defeat neared. \"He acted as though he was going on a sightseeing tour, or really as though I was going on a sightseeing tour, and he was showing me where he grew up. I had a.45 in a shoulder holster, but he couldn\"t reach that. But neither could I, because I had two hands controlling the plane.\" Foster further recalled Göring as having been sharp, friendly, and witty, having joked when Foster asked him when Germany began manufacturing jets. \"Too late,\" Göring was said to have answered. Foster continued: \"I could see that he was like one of our officers if he\"d been picked up. I wouldn\"t say it changed my view of the war, but it showed me that there are.. Well, I questioned all that we knew about these vicious people.\" Göring was convicted of war crimes and committed suicide in October 1946 by taking a cyanide capsule before he could be hanged by the Nuremberg authorities. By October 1945, Foster was back in the United States, having flown seventy reconnaissance combat missions during his wartime service. He returned to his adopted home state of Montana, where he was appointed lieutenant colonel in the Montana Army National Guard. He was thereafter promoted to brigadier general, a rank that he held from 1963 until 1971. A native of Richmond, Virginia, Foster graduated in 1937 with a degree in English from Yale University in New Haven, Connecticut. The couple had one daughter, Susan Carol Foster Korkalo (1944–2007). Foster received the Silver Star for his wartime service in southern France in 1944. lieutenant was not until 2009 that he received the French Legion of Honor, when Pierre Vimont, the French Ambassador to the United States, released a letter hailing Foster for his \"personal, precious contribution to the United States\" decisive role in the liberation of our country during World World War World War II\" Foster died at the age of ninety-nine in a nursing home in Missoula, Montana. His last city of residence was Livingston in Park County, Montana."}, {"url": "https://ripper.london/victorian-london/henry-mayhew/", "page_content": "MAYHEW, HENRY (1812–1887), English author and journalist, son of a London solicitor, was born in 1812. He was sent to Westminster school, but ran away to sea. He sailed to India, and on his return studied law for a short time under his father. He began his journalistic career by founding, with Gilbert à Beckett, in 1831, a weekly paper, Figaro in London. This was followed in 1832 by a short-lived paper called The Thief; and he produced one or two successful farces. His brothers Horace (1816–1872) and Augustus Septimus (1826–1875) were also journalists, and with them Henry occasionally collaborated, notably with the younger in The Greatest Plague of Life (1847) and in Acting Charades (1850). In 1841 Henry Mayhew was one of the leading spirits in the foundation of Punch, of which he was for the first two years joint-editor with Mark Lemon. He afterwards wrote on all kinds of subjects, and published a number of volumes of no permanent reputation—humorous stories, travel and practical handbooks. He is credited with being the first to “write up” the poverty side of London life from a philanthropic point of view; with the collaboration of John Binny and others he published London Labour and London Poor (1851; completed 1864) and other works on social and economic questions. He died in London, on the 25th of July 1887. Horace Mayhew was for some years sub-editor of Punch, and was the author of several humorous publications and plays. The books of Horace and Augustus Mayhew owe their survival chiefly to Cruikshank’s illustrations.\n\nIn the World of London, indeed, we find almost every geographic species of the human family. If Arabia has its nomadic tribes, the British Metropolis has its vagrant hordes as well. If the Carib Islands have their savages, the English Capital has types almost as brutal and uncivilized as they. If India has its Thugs, London has its garotte men. Henry Mayhew, The Criminal Prisons of London (1862), p. 5\n\nHenry Mayhew was born on 25 November 1812 in London, one of seventeen children of Joshua Mayhew. He was educated at Westminster School before running away from his studies to sea. He then served with the East India Company as a midshipman on a ship bound for Calcutta. He returned after several years, in 1829, becoming a trainee lawyer in Wales. He left this and became a freelance journalist. He contributed to The Thief, a readers’ digest, followed quickly by editing a weekly journal – Figaro in London. Mayhew reputedly fled his creditors and holed up at The Erwood Inn, a small public house in the village of Erwood, south of Builth Wells in Wales.\n\nIn 1835 Mayhew found himself in a state of debt and, along with a fellow writer, escaped to Paris to avoid his creditors. He spent his time writing and in the company of other writers including William Thackeray and Douglas Jerrold. Mayhew spent over ten years in Paris returning to England in the 1850s whereby he was involved in several literary adventures, mostly the writing of plays. Two of his plays – But, However and the Wandering Minstrel – were successful, whilst his early work Figaro in London was less successful.\n\nOn 17 July 1841 Mayhew cofounded Punch magazine. At its founding the magazine was jointly edited by Mayhew and Mark Lemon. The two men hired a group of writers and illustrators, including Douglas Jerrold, Angus Reach, John Leech, Richard Doyle and Shirley Brooks. Initially it was subtitled The London Charivari, this being a reference to a satirical humour magazine published in France under the title Le Charivari (a work read often whilst Mayhew was in Paris).\n\nPunch was an unexpected success, selling about 6,000 copies a week in the early years. However, sales of as many as 10,000 issues a week were required to cover all costs of the magazine. In December 1842, the magazine was sold to Bradbury and Evans; Mayhew resigned as joint editor, and he continued at the magazine as “suggestor in chief” with Mark Lemon re-appointed as editor. Mayhew eventually severed his connection with the magazine, writing his last article in February 1845. His brother Horace stayed on the board of Punch until his own death.\n\nThe Punch years gave Mayhew the opportunity to meet talented illustrators who he later employed to work from daguerreotypes on London Labour and the London Poor. Following Punch magazine, Mayhew launched Iron Times, a railway magazine. However this venture lost Mayhew so much money that he was forced to appear in a Court of Bankruptcy in 1846.\n\nIn 1842 Mayhew contributed to the pioneering Illustrated London News. By this time Mayhew had become reasonably secure financially, had settled his debts and married Jane Jerrold (d. 1880), the daughter of his friend Douglas Jerrold.\n\nLondon Labour and the London Poor is today the work for which Myhew is best known. Originally appearing as a series of articles, the material was initially collected into three volumes in 1851; the 1861 edition included a fourth volume, co-written with Bracebridge Hemyng, John Binny and Andrew Halliday, on the lives of prostitutes, thieves and beggars. This Extra Volume took a more general and statistical approach to its subject than Volumes 1 to 3.\n\nMayhew wrote in volume one: “I shall consider the whole of the metropolitan poor under three separate phases, according as they will work, they can’t work, and they won’t work”. He interviewed everyone – beggars, street-entertainers (such as Punch and Judy men), market traders, prostitutes, labourers, sweatshop workers, even down to the “mudlarks” who searched the stinking mud on the banks of the River Thames for wood, metal, rope and coal from passing ships, and the “pure-finders” who gathered dog faeces to sell to tanners. He described their clothes, how and where they lived, their entertainments and customs, and made detailed estimates of the numbers and incomes of those practising each trade. The books show how marginal and precarious many people’s lives were, in what, at that time, was the richest city in the world.\n\nLater works included The Criminal Prisons of London (1862), The Boyhood of Martin Luther (1863), German Life and Manners as Seen in Saxony at the Present Day (1865), and London Characters (1881)\n\nHe died on 25 July 1887."}, {"url": "https://surveyoflondon.org/map/feature/16/detail/", "page_content": "Conservation and Restoration 1997\n\nContributed by cliveraymond on Feb. 19, 2018\n\nIn 1997 I was working on a self-employed basis with a conservation company which was a sub-contractor on the project. We were responsible for all the exterior work to the former Eastern Dispensary, but to get to our scaffold we had to climb out of a window on the first floor, and therefore we had a good view of the original decoration within the dispensary dating from the 1940’s when it was an entertainment centre for the armed forces and others. Having previously studied History of Medicine at the Wellcome Institute, I was particularly concerned when alterations were carried out to the building during the restoration. These would result in a different aspect to the building from what the patients would have known when the dispensary was in use. We were told that the exterior alterations would reflect the nineteenth century engraving in \"The Illustrated London News\". However, nobody could say whether this design, which predated the building's construction, was fully realized.\n\nDuring restoration in the late 1990s, the heavy cornice was added to the exterior. Careful examination failed to show any archaeological evidence of there having been a cornice. If it fell off, or was taken down during the war, there were no signs of this. Quoin stones were supplied on pallets and affixed to all available corners on the upper storey. Also, mouldings were supplied as per the upper left window in the 1967 photo, and fixed around all the remaining unadorned windows on that level. In effect, details that existed on the original private residence which was the core of the building were repeated all around.\n\nTo begin with, my work consisted in the mechanical cleaning off of deep deposits of black sulphation prior to an overall Joss clean. Sulphation was very deep and solid in the scrolls around the windows and the scallop shell above the side door. We had to we had to cart the bags of powder up the inside and out of the window. After cleaning, my job was to repair cracked and missing cement render, including building up of missing letters/ numerals at the top of the building.\n\nI remember one particular day when a passing off-duty building safety inspector looked in and was so horrified by the health and safety issues with work inside the building that he closed it down. We were all turned to for a general clean-up and hazard removal, while some people were sent away to get safety boots.\n\nA few years later, I went in to the building after its conversion into a pub and recommended to the staff in charge that some sort of story board was needed. Otherwise the significance of the building would be totally lost on people who came in from outside East London. Needless to say, the layout of the interior was greatly altered to create the pub."}, {"url": "https://www.britannica.com/biography/Henry-Mayhew", "page_content": "Henry Mayhew, (born 1812, London, England—died July 25, 1887, London), English journalist and sociologist, a founder of the magazine Punch (1841), who was a vivid and voluminous writer best known for London Labour and the London Poor, 4 vol. (1851–62). His evocation of the sights and sounds of London in this work influenced Charles Dickens and other writers.\n\nMayhew, the son of a solicitor, ran away to sea at age 12 and made a voyage to India. Upon his return he studied law with his father but soon turned to journalism. He helped to found the periodicals Figaro in London (1831) and The Thief (1832) before organizing the highly successful Punch, of which he was coeditor (with Mark Lemon) for two years. He also wrote plays, farces, fairy tales, and novels, some in collaboration with his brother Augustus Septimus Mayhew (1826–75). Short of money in his later years, he produced much hackwork and died in obscurity.\n\nMayhew had a genius for lively and sensitive reportage of people, including social outcasts and nomads, and of contrasting ways of life; and he was able to combine his observation with penetrating economic and social analysis, some of it with a Marxist flavour. London Labour and the London Poor was based on letters he wrote to the London Morning Chronicle in 1849–50, at the end of a stormy decade in British social history. Responding to the newspaper’s desire for “trustworthy information” on the great social problems of the day, Mayhew prepared three volumes that were published in 1851; the fourth volume, The Criminal Prisons of London, was written in collaboration with John Binny and did not appear until 1862. A revised complete edition was published in 1864."}]}