{"Hephaestion died of illness in 324 BC.": [{"url": "https://warwick.ac.uk/fac/arts/classics/warwickclassicsnetwork/stoa/anchist/gcse/alexander/teachersguide", "page_content": "Introduction and the developments of the Macedonia state and army under Philip (Suggested timing: 1 ½–2 hours) · Background to the rise of Macedon and familiarity with the geography of the areas covered in the depth study, most of which should be fairly familiar from the Persian period study. · Introduction to key (textual) ancient source authors: Arrian, Plutarch and Diodorus Siculus. · Alexander’s success built on the firm foundations laid down by Philip. Philip trained and organised a new army, at the same time ensuring the men swore loyalty to him rather than Macedonia. Philip made the traditional formation deeper so that his phalanx could exert greater force against an enemy. This required him to develop a longer spear; his men were from then on supplied with a five metre long lance known as a sarissa. · Philip abolished the monarchies of some of the northern tribal states and instead these former ruling elites joined the traditional Macedonian noble families as part of the Companions of the King. The sons of the tribal leaders were invited to Philip’s court to form a class of royal pages. They also acted as hostages ensuring the loyalty of their fathers. · Philip partook in a succession of politically strategic marriages. The marriages aimed to secure his borders by establishing better relations with Macedonia’s neighbours. For example, he married Olympias, the daughter of the king of the Epirus. · Philip’s developments in the Macedonia army · The weapons and armour of the Macedonia army · Philip’s methods for securing the Macedonia state\n\nAlexander’s birth and youth, and important events up to 336 BC (Suggested timing: 2 ½–3 hours) · Plutarch details episodes and stories that were connected to Alexander’s birth and youth. As Alexander became a heroic figure, legends quickly took hold of the historical record. o Plutarch outlines the stories told about Alexander’s conception and birth. The stories are a mix of contextualised folktale and propaganda, designed to imply the pre-determined nature of Alexander’s ascent to greatness. o The evidence concerning Alexander’s youth was selected to portray him as a boy marked out for success as well as to characterise him more generally. · In 338 Philip moved into central Greece looking to fight a decisive battle against Thebes and Athens. He was seeking to emerge as the most powerful man in Greece. The battle took place at Chaeronea. · Philip married a Macedonian called Cleopatra – a niece of Attalus. At the wedding Alexander fell out with his father in an argument incited by Attalus. Alexander and Olympias left Macedonia, although Philip recalled Alexander the following year. · In 337 Philip established a council of Greek states known as the League of Corinth. Philip was elected its leader or hegemon. As hegemon, Philip was handed the responsibility of invading Persia in the name of Greece. In reality, he handed this responsibility to himself as it is far from clear that the Greek city-states shared his enthusiasm for avenging Xerxes’ invasion. · In spring 336 Parmenio and Attalus were sent to Asia in charge of an advance party. Plutarch, The Life of Alexander 2–3 and 6–9 · The nature of the evidence on Alexander’s birth and youth · Alexander’s character as revealed at key moments prior to becoming king · Greeks views of Philip and Macedonia · Philip’s policy towards the Greek city-states · The significance of Philip marrying Cleopatra · The reason for Philip and Alexander’s falling out in 338/337 · Alexander’s relationship with Philip · The character and influence of Olympias\n\nThe murder of Philip October 336 BC (Suggested timing: 1 ½–2 hours) · Cleopatra Eurydice may have given birth to a son to compliment the daughter she had already had with Philip. Alexander and Olympias’ position was possibly now in even greater danger. · Philip and Olympias’ daughter (who was also called Cleopatra) married Alexander of Epirus. Alexander of Epirus was both Olympias’ brother and King of Epirus. This union would have weakened Olympias’ position further in that she was no longer Philip’s main link with the neighbouring state of Epirus. · The wedding celebrations were attended by a significant number of Greeks as well as Macedonians. Olympias was not present. · The day after the wedding ceremony Philip was murdered. The situation of the assassin Pausanias does not seem enough of a motive on its own. He was angry with Philip for not punishing Attalus, yet he could, as a bodyguard, have more easily murdered Philip elsewhere. Olympias (and Alexander) could have influenced Pausanias, although Alexander later claimed the Persians had bribed the murderer. Diodorus, Library of History 16.91–94 · The reasons for Philip to marry his daughter to her uncle · The reasons for Philip’s murder\n\nAlexander consolidating his position and the initial reasons for the expedition against Persia (Suggested timing: 1 hour) · On the murder of his father, Alexander launched a purge of possible rivals for the throne. Attalus was executed on Alexander’s instructions and with Parmenio’s help. · Alexander travelled to Corinth where, like his father, he was appointed hegemon of Greece. The position carried the authority to wage war on Persia on behalf of the League of Corinth. · Alexander then turned his attention towards Greece where Thebes and Athens were in rebellion. Theban exiles had returned to their city to foment rebellion. Alexander captured Thebes and massacred many of its inhabitants. · Alexander invaded Persia for a host of interconnected reasons that should be analysed and attributed due weight. · Darius III, the new king of Persia, was in a weak position. He was not from the principal royal line and had gained power after a series of coups. · The ways Alexander secured power · The reasons for Alexander’s Persian expedition\n\nAlexander in Asia-Minor (Suggested timing: 4–4 ½ hours) · Antipaer was left in charge of Greece by Alexander. · In 334 Alexander crossed the Hellespont with his army and made a detour to Troy. Alexander was said to have laid a wreath on the tomb of Achilles and taken sacred weapons dating from the time of the Trojan War. Arrian, The Campaigns of Alexander 1.11–12 · The significance of Alexander’s visit to Troy · Alexander’s relationship with his companions (Hephaestion)\n\nBattle at the River Granicus (May 334 BC) · An army led by the Persian satraps of Asia-Minor and Memnon was waiting for Alexander at the River Granicus. Alexander fought bravely during the battle, leading a Companion Cavalry charge at Mithridates (Darius’ son-in-law). At this point Cleitus saved his life. Alexander showed particular contempt for the Greek mercenaries opposing him: his army was instructed to show them no mercy and those who survived were classed as traitors and enslaved to the mines of Macedon. Alexander sent Persian armour back to Athens to show the Athenians what he had achieved. Arrian, The Campaigns of Alexander 1.13–16 · The use of cavalry, the phalanx and other troops · The nature and aims of Arrian · The nature of the evidence regarding the Battle of Granicus\n\n· After the Battle at the River Granicus, the city of Sardis surrendered to Alexander. Alexander also takes control of Ephesus and Miletus. · Unable to match the Persians at sea, Alexander’s fleet was becoming a financial liability: it was disbanded. · Alexander moved down the coast and besieged Halicarnassus. · Alexander sent the younger men in his army home for the winter to be with their wives. He and Parmenio split the rest of the army to better deal with other pockets of resistance.\n\nAlexander at Gordium · Alexander’s forces reconvened at Gordium in the spring of 333. The cutting of the Gordian knot was symbolic: Alexander was signalling his greater vision for the expedition. Cutting the knot was also important for propaganda reasons: it encouraged the soldiers by making them believe they were destined to take over Asia as the prophecy foretold. Arrian, The Campaigns of Alexander 2.3 · What does Arrian’s account of the legend of the Gordium knot reveal about the nature of ancient historical writing? · Alexander’s character\n\nThe Battle of Issus (November 333 BC) · At the Battle of Issus Alexander faced a much larger Persian army across a river. The steep banks of the River Issus provided a dangerous obstacle for Alexander’s phalanx. However, Alexander led a strong cavalry charge that forced Darius to flee. Darius got away but Alexander captured his family. Alexander sarcophagus Mosaic from the House of the Faun in Pompeii · The tactics used in the main battles\n\nAlexander in Phoenicia and Egypt (Suggested timing: 1 ½–2 hours) · Parmenio was sent with a detachment to Damascus where he took possession of vast amounts of Darius’ wealth. · Darius, having suffered a significant defeat, offered to make peace as Alexander marched down the Phoenician coast. Alexander replied demanding to be recognised as King of Asia. · Alexander was determined that all cities should submit to him. The Phoenician cities had to be forced to submit as the Persians could not be allowed to possess bases for their fleet and thus continue controlling the seas and trade routes. Alexander had disbanded his fleet while at Halicarnassus (for financial reasons) and so an active Persian fleet may have disrupted his plans.\n\nSiege of Tyre (January–July 332 BC) · Chief among the Phoenician cities was Tyre. Situated on an island half a mile out to sea, the Babylonians, among others, had previously tried and failed to take the city. Alexander convinced his men that his ancestor Heracles had visited him in a dream and demanded that he worship in the Temple of Heracles in Tyre. More prosaically, he was determined to prevent the Persians from using the Phoenician ports to shift the war over to Greece where their allies the Spartans were fomenting unrest. Arrian, The Campaigns of Alexander 2.24 · the main events of the siege of Tyre · Alexander’s character and leadership as revealed by his actions during the final capture of Tyre\n\n· The Tyrians taunted the Macedonians from their walls saying Alexander would never capture the city. Attempts at negotiation failed when the Tyrians threw some of Alexander’s men from the city wall. Alexander built a mole across the sea in order to use his siege engines against the city’s walls. The Tyrians shot arrows at his men from both their walls and their triremes. The Tyrians then burnt his mole using a fire ship. Increasingly determined, Alexander built a wider mole. Alexander had forecast that, due to his recent victory at Issus, other Phoenician cities would switch allegiance. This hope was realised when the newly conquered Sidon willingly sent ships to pin the Tyrians in their harbours. The Tyrians could no longer sally out to attack the new mole and neither could they import supplies into the city. Yet even then Tyre’s landside walls proved too strong. Alexander used his new fleet to sail round to a weaker part of the wall. He put his siege engines on rafts anchored to the seabed. In desperation the Tyrians sent divers to cut the anchor ropes and threw hot sand on Alexander’s men from their walls. Alexander replaced the anchor ropes with metal chains. After the failure of a desperate Tyrian naval attack, Alexander’s siege engines smashed a gap in the wall and a detachment of shield-bearers was ordered to exploit it. After their leader was killed, Alexander and his Companions took over the attack. 8,000 Tyrians were massacred.\n\nAlexander in Egypt · Instead of heading into the Persian heartland, Alexander moved into Egypt. While his men were founding Alexandria, Alexander travelled hundreds of miles into the desert to the oracle that was located at the oasis that is now modern-day Siwa. · The importance of foundation cities · Alexander’s beliefs\n\nThe Battle of Gaugamela (Suggested timing: 2 ½–3 hours) Battle of Gaugamela (October 331 BC) · Darius had amassed a large army; Alexander realised his smaller army could easily be outflanked and attacked on its weak sides and rear. Therefore Alexander stationed infantry in the midst of his cavalry to strengthen his flanks. The infantry would surprise Darius’ cavalry. The soldiers on each side of the phalanx could also move back like flaps to prevent being outflanked. Alexander’s plan was to move right so that Darius would initiate action to prevent the battle moving off the ground he had prepared for his chariots. It was hoped that Darius would advance his cavalry on the left in an attempt to outflank Alexander’s right and stop the Macedonians moving further to the right. Alexander hoped that this would create a gap in the Persian line through which he could lead a Companion Cavalry charge at Darius. The Persians had too many men to attempt anything else – Alexander therefore had to win the battle in a decisive move against Darius. The plan generally worked as envisaged and Darius was forced to flee the battle. The ancient sources say Parmenio was struggling to hold the left-flank and had to ask for assistance. The implication is that this request prevented Alexander from capturing Darius and gaining a full victory. Plutarch, The Life of Alexander 31–33 Arrian, The Campaigns of Alexander 3.9–15 Babylonian Astronomical Diary tablet mentioning Gaugamela · Reasons for Alexander’s victory · The use of cavalry, the phalanx and other troops · What does Plutarch’s account of the battle reveal about his priorities as a writer? · The nature of the evidence for the Battle of Gaugamela\n\n· After the battle Alexander’s army moved to Babylon where the soldiers were allowed to rest and recuperate; many Babylonians welcomed Alexander as the Egyptians had done. · Antipater, who had been left in charge of Macedon, beat King Agis of Sparta in a battle at Megalopolis. Agis had sought to destroy Macedon’s pre-eminent position in Greece and had been liaising with the Persians.\n\nThe Battle of the Persian Gates and Alexander’s visit to Persepolis (Suggested timing: 1 ½ –2 hours) Battle of the Persian Gates (January 330 BC) · Alexander moved on to the Persian capital at Persepolis after fighting his way through the mountain pass known as the Persian Gates. Meanwhile Parmenio was charged with leading the other half of the army on a more circuitous, less mountainous, route to Persepolis. Arrian, The Campaigns of Alexander 3.18 · the events of the Persian Gates · Alexander’s character as revealed by the events at Persepolis · The reasons for the burning of the Palace at Persepolis · The nature of the sources regarding Alexander’s visit to Persepolis\n\nAlexander in Persepolis · Arrian says that Alexander set fire to the palace to avenge Xerxes’ destruction of Athens 150 years earlier however Plutarch gives another story where Thais, Ptolemy’s mistress, encourages Alexander to burn down the palace. · At this juncture Alexander changed the terms of service of his Greek soldiers in a move that perhaps signalled that he felt the revenge mission had finally been completed. Arrian, The Campaigns of Alexander 3.18.10–3.18.12 Plutarch, The Life of Alexander 38\n\nThe pursuits of Darius and Bessus (Suggested timing: 1 ½–2 hour) · Alexander marched to Ecbatana and left Parmenio there with a lot of the Persian treasure. · Alexander chased Darius down. Darius was eventually betrayed by his own men and held captive. In July 330 BC he was killed when Alexander’s troops attacked the camp where Darius was being held. Alexander gave Darius a state funeral at Persepolis. · Bessus proclaimed himself Great King – Artaxerxes V. Alexander would not stand for this and needed to avenge the death of Darius. Many of Alexander’s men, no doubt, thought that the death of Darius would mean the end of the fighting and a return to Macedonia. · The impact of Darius’ death on the nature of Alexander’s campaign · Alexander’s character\n\nAlexander’s adoption of Persian customs · Immediately after the death of Darius, Alexander started to adopt some aspects of Persian dress. · The first complaints about Alexander’s behaviour were voiced soon after. Silver tetradrachm minted by Ptolemy I Silver tetradrachm minted by Lysimachus · Reasons for Alexander’s adoption of Persian customs\n\nThe conspiracy of/against Philotas (October 330 BC) · Philotas boasted to his mistress that Alexander’s victories were really due to him and his father Parmenio. · Some pages asked Philotas, Parmenio’s son, to arrange an audience with Alexander for them. Philotas twice turned down their request. As their information was important the pages therefore found another way of speaking to the King. It transpired that other pages were plotting against the King’s life. The plotters were dealt with but Alexander was furious that he had not been warned earlier. There was a suspicion, if no actual proof, that Philotas may have been involved. Alexander executed Philotas, sealed the camp to prevent information leaking out, and then sent an urgent message to Ecbatana instructing that Parmenio be killed in case the old general led a rebellion in an act of revenge. · Alexander split Philotas’ sole command of the Companion Cavalry in two: between Cleitus and Hephaestion. · Alexander’s relationship with his companions and his army (Phitotas and Parmenio)\n\nPursuit of Bessus · In the spring of 329, Alexander crossed the Hindu Kush into Bactria in pursuit of Bessus. The crossing was a feat of determination, stubbornness and organisation given that Alexander was leading such a large force. · In the summer of 329, Bessus was captured and mutilated, the customary Persian punishment for those who committed treason.\n\nAlexander in Bactria and Sogdiana. The murder of Cleitus and the opposition of Callisthenes (Suggested timing: 2 ½–3 hours) The death of Cleitus (328 BC) · Alexander’s enemies now employed guerrilla warfare tactics against him; his army was forced to split up to hunt out the different groups of fighters who attacked them. Not all the Macedonian leaders enjoyed success in the battles that followed and one night a singer began to mock those who had suffered defeat. Alexander encouraged the singer to continue despite Macedonian protests. Everybody was drunk and worn out after the fighting. An argument began in which Alexander stabbed Cleitus to death and then immediately regretted it. Plutarch, The Life of Alexander 50–51 Arrian, The Campaigns of Alexander 4.8–4.9.8 · The reasons for Cleitus’ argument with Alexander · Alexander’s character and his relationship with his men\n\n· In the spring of 327 Alexander sent men with climbing experience to storm a stronghold known as the Sogdian Rock. The Sogdians were said to have claimed their position unassailable, which, if Arrian is to be believed, fired Alexander’s determination to capture it even more.\n\n· Alexander then married a noble girl called Roxane who had been taken prisoner on the Sogdian Rock. It was, despite Arrian’s views to the contrary, most likely a politically inspired union in that her father, Oxyartes, was a leading tribal chief in Sogdiana.\n\nCallisthenes’ opposition and removal in the Pages’ Conspiracy · Callisthenes argued with Alexander over the issue of whether Greeks and Macedonians should perform obeisance (proskynesis) before the King. It seems that Alexander was encouraged to organise a stage-managed event in which the ritual would be trialled; we don’t hear of it being demanded again. It may have been in this context that the Greek Callisthenes spoke out powerfully against Alexander’s growing preference for the custom. Callisthenes is portrayed as having put forward a powerful case suggesting that in freedom lays strength, and that some honours were only fit for gods and not men. The subtext of Callisthenes’ argument was that previous kings had failed to benefit from receiving proskynesis: free peoples had defeated all of them. · Callisthenes was soon dead. He was either executed or died in prison after being accused of involvement in another plot against Alexander – the so-called ‘Pages’ Conspiracy.’ It is unlikely he was involved but the episode could possibly be interpreted as an example of Alexander’s vindictiveness and paranoia. The plot to murder Alexander in his sleep had been triggered when he overreacted to the actions of a page. The plot failed and its existence was revealed the next day. The pages were tortured until all the conspirators were unmasked. Callisthenes was their teacher and Alexander, having already argued with the Greek historian, appeared keen to implicate him in the affair. Arrian, The Campaigns of Alexander 4.9.9–4.12 · The reasons for Callisthenes’ opposition to Alexander · The degree of disapproval at Alexander’s adoption of Persian customs\n\nAlexander in India (Suggested timing: 2 hours) The siege of the Aornos Rock (April 326 BC) · Alexander took up the challenge of capturing the Aornus Rock. Alexander’s vigorous assault on this high mountain stronghold was perhaps motivated by a story that even Heracles had failed to take it. Ptolemy, making use of local guides, was tasked with leading an advanced force to secure a position from which to attack the main Indian stronghold. Ptolemy completed this difficult mission and Alexander was able to lead the main army up the mountain to join him. After laying siege to the mountaintop, Alexander ordered a ravine to be bridged so that his war engines could be brought within range of the Indian defences. The rock was captured after an intense assault followed by the false promise of a peace treaty. Many of those who had resisted Alexander were either massacred or fell to their deaths attempting to escape. Arrian, The Campaigns of Alexander 4.28–30 Silver tetradrachm minted by Ptolemy I · the methods Alexander used to capture the Aornus Rock\n\nThe campaign against Porus · One Indian leader who offered significant resistance was Porus. Alexander admired how Porus had fought until all hope was lost and so the Indian was allowed to retain his kingdom – but only as a satrap – in return for his loyalty and help in subduing other pockets of resistance. · Bucephalas died after the battle and in response Alexander founded a city in the name of his most trusted horse. Populated by a mix of local people and soldiers no longer fit for battle, the culture in each foundation was said to have been Greco-Macedonian in nature. Most of the foundations were garrison towns designed to leave a permanent military presence in areas where it was felt that rebellions might surface in the future. The inhabitants, often veterans and others loyal to Alexander, were meant to be a socialising force. · Alexander’s character · The nature and role of Alexander’s foundation cities · the Indus Valley campaign and what it reveals about Alexander’s abilities and character\n\nMutiny at the River Hyphasis (Summer 326 BC) · The Macedonians received reports that they were still a long way from the Great Ocean and that they would have to fight armies with thousands of elephants to get there. This news, along, no doubt, with the rain, mud, snakes, insects and proliferation of illness within the camp, eventually resulted in a mutiny at the River Hyphasis. Alexander couldn’t change the men’s minds; to save face he declared the omens were bad and ordered the army turn back. · the Indus Valley campaign and what it reveals about Alexander’s aims, and relationships with his men\n\nThe difficulties encountered on the return to Babylon. The mass marriages at Susa (Suggested timing: 1 ½–2 hours) The march through the Gedrosian Desert · Alexander made the decision to march through the Gedrosian Desert, thousands of soldiers and camp followers died. Alexander’s veterans survived because, led by Craterus, they took a different route avoiding the desert. Arrian, The Campaigns of Alexander 7.4.1–7.4.3 · Why might Alexander have decided to march through the Gedrosian Desert? · Alexander’s relationship with his army and satraps\n\n· Emerging from the desert, Alexander found his empire to be in a state of unrest; there had been rumours that he had died in the east. Alexander acted decisively, punishing the offending satraps to restore order. A further purge of satraps took place once Alexander reached Susa.\n\nThe mass marriages at Susa · Alexander held a mass marriage ceremony for his Companions at Susa. Alexander married into two lines of the Persian royal clan. Arrian, The Campaigns of Alexander 7.4.4–7.4.7 · The reasons behind the mass marriages at Susa\n\nThe mutiny at Opis · At Opis Alexander faced another mutiny when he attempted to decommission his veteran soldiers who were no longer fit to serve. His soldiers, including those he was decommissioning, were angered that they were to be replaced by the Epigonoi — 30,000 young Persians who had been trained and armed in the Macedonian manner. · Alexander’s relationship with his army\n\n· His army newly reinforced by the Epigonoi, Alexander was now less reliant on his veterans than he had been at the Hyphasis. He executed thirteen men he considered to be the ringleaders of the mutiny and threatened to send all the Macedonian rebels in his army home without pay. The Macedonians pleaded with Alexander and he let them off while promising to view them all as his kinsmen. · 10,000 veterans, including those who had married their oriental partners were discharged and ordered back to Macedonia. Their offspring by the oriental women were required to be left behind.\n\n· In Macedon, Olympias and Antipater were at loggerheads. When Alexander sent the 10,000 veterans back to Macedon, Antipater was sent a request to bring out fresh Macedonia troops, potentially as a way to prevent his dispute with Olympias from turning nasty.\n\nHephaestion and Alexander’s deaths (Suggested timing: 2 ½ hours) Death of Hephaestion (324 BC) · Alexander travelled to Ecbatana where Hephaestion died following a short illness. As Alexander’s favourite, Hephaestion had become increasingly unpopular. Alexander was naturally very upset given the closeness of his relationship with Hephaestion. He sent messengers to Siwa to see whether Hephaestion should be worshipped as a god. The oracle refused his request and so Alexander had to content himself with declaring Hephaestion a hero to whom sacrifices should be directed. Arrian, The Campaigns of Alexander 7.14 · The impact of Hephaestion’s death on Alexander · Alexander’s character and his relationship with his men\n\nDeath of Alexander (323 BC) · Alexander returned to Babylon but did not immediately enter the city because of troubling oracles. Alexander suspected the Chaldaeans had dreamt up the oracles to further their own interests, yet he remained wary and held off entering the city. · Alexander spent the remainder of the spring planning an expedition against the Arabians. Despite this apparent burst of activity, the sources continue to paint Alexander as paranoid, overly superstitious and too harsh. · After a period of illness, during which he continued to drink heavily, Alexander died. Whether he died from an accumulation of natural causes, or was the victim of a conspiracy, has long been a subject of debate. Prime candidates for conspiracy theorists are Antipater and his family. Plutarch, The Life of Alexander 73–77 Arrian, The Campaigns of Alexander 7.24–26 · The state of Alexander’s relationship with his companions (Antipater [74] and his sons) · Alexander’s state of mind during this period · The cause and nature of Alexander’s death"}, {"url": "https://www.geni.com/people/Hephaestion/6000000011739086951", "page_content": "About Hephaestion\n\nHephaestion (Greek: Ἡφαιστίων Hephaistion; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"... by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship lasted throughout their lives, and was compared, by others as well as themselves, to that of Achilles and Patroclus.\n\nhttps://en.wikipedia.org/wiki/Hephaestion\n\nHephaestion and Alexander\n\nAlexander had the reputation for being handsome and stood out among his peers by being clean shaven. Many portraits and sculptures were made in his lifetime, so we can be fairly convinced of his appearance. He was a prodigious athlete and loved strenuous exercise. He loved to show off by jumping off and back onto a chariot moving at full speed. Alexander was rather short and stocky, with one blue and one brown eye. His male lover Hephaestion was taller and even more handsome, so much so that the Persian queen bowed to Hephaestion instead of Alexander when she was presented to them. Alexander said to the mortified queen \"Never mind, Hephaestion is also Alexander\".\n\nAt the time Alexander lived, it was common for Greek men to have wives as well as lovers of either gender; wives were merely for procreation. Alexander, who had become King of Macedonia at the age of twenty when his father was assassinated, did not marry and produce an heir before he set out from Macedonia to conquer the Persians. He was not known to show much interest in women. Even at the height of his power, historians recount that he used his harem “sparingly.” However, Alexander loved his boyhood friend, Hephaestion. Both brilliant adolescents, they were tutored by Aristotle by arrangement with Alexander’s father. Aristotle instilled in the lads a great desire for knowledge and a love for philosophy. Thus Alexander became an avid reader. Hephaestion started off as a regular cavalry soldier and rose through the ranks on merit, carrying out important military and administrative assignments. Later, Alexander also took as a lover a male courtier from the conquered Persian court, scandalous not because the courtier was male, but because he was Persian, since most Greeks thought that all other people were barbarians.\n\nHephaestion and Alexander wanted their children to be cousins, so Hephaestion married the sister of Alexander’s new wife, who was the daughter of the defeated Persian emperor Darius III (a purely political marriage).\n\nGreece enjoyed a period of peace and prosperity during Alexander's campaign in Asia. Alexander sent back vast sums from his conquests, which helped stimulate the economy and increased trade between the new areas of his empire.\n\nHowever, soon after Hephaestion and Alexander conquered Asia, Hephaestion died suddenly of typhus. Alexander's grief was boundless and devastating. He ordered an official observance of public mourning for his lover. It was recorded that for two days Alexander neither ate nor drank, cut his hair short and ordered that the horses in his army should have their manes cropped, as well. Alexander resolved that his lover should begin his life in the Unseen World with unstinted wealth, and the precious things he ordered stacked upon Hephaestion’s funeral pile represented a sum of nearly two million and a half pounds sterling. Alexander declared publically that his relationship with Hephaestion was like that of Achilles to Patroclus, male lovers and bothers-at-arms mentioned in the Iliad – Hephaestion and Alexander had been inspired by them in their youthful studies with Aristotle. Alexander asked the Oracles of Egypt if Hephaestion was a god, because in those days a person could become a god through achievements. Alexander was told that Hephaestion was indeed a hero, albeit a lesser type of god. Alexander, who had no doubt about his own divinity, then knew that he would meet his beloved again in the Blessed Realm, where gods and heroes lived in eternity.\n\nWithin eight months of Hephaestion's death, Alexander died in Babylon, twelve days after contracting a fever. Historians propose that his death was the result of poisoned wine or contaminated water. In any event, he had yet to realize a series of campaigns that would have begun with an invasion of Arabia and the eventual conquering of the entire Mediterranean basin and all of Africa. It was his desire to conquer the entirety of the known world. He was 32 years old at the time of his death, and never defeated in battle.\n\nAlexander's lasting legacy was not his reign, but the cultural diffusion his conquests afforded. His establishment of Greek colonies (among them Kandahar in Afghanistan) and culture in the conquered lands resulted in a new Hellenistic culture, which was still evident in the traditions of the Byzantine Empire until the mid 15th century. Alexander became the measure against which generals, even to this day, compare themselves, and military academies throughout the world still teach his tactical exploits.\n\nhttps://gayinfluence.blogspot.com/search/label/Alexander%20the%20Great"}, {"url": "https://thesecondachilles.com/2013/11/15/hephaestions-remains/", "page_content": "16.11.14: Read my update to this post here\n\nAlexander the Great’s final resting place is a matter of enduring mystery. As is well known, Ptolemy stole his body in 322/1 BC while it was being taken back to Macedon for burial. He interred it in Memphis and it remained there until either he or his son, Ptolemy II Philadelphus, relocated it to Alexandria. The body was lost sometime between the early third and fifth century AD.\n\nUnless, or until, Alexander’s body is recovered interest in its fate will continue. Given that, I wonder why there is very little interest in what happened to the mortal remains of his best friend, and probable lover, Hephaestion.\n\nBefore going any further, I must confess that up until now I have been one of those who was not interested. In fact, I don’t think the question ever even occurred to me. The only reason I am writing this post now is is because a few weeks ago someone found their way to The Second Achilles by asking their search engine, ‘where did alexander the great put hepheastians remains body?’. If it was you who wrote that – thank you for inspiring this post.\n\nThe short answer to the question of what happened to Hephaestion’s remains is that we don’t know.\n\nBefore we speculate, let’s look briefly at what we do know. We know, for example, that Hephaestion died in Ekbatana in October 324 BC. Arrian tells us that Alexander had a funeral pyre built in Babylon for his friend at the cost of 10,000 talents – a staggering sum of money. After holding Funeral Games in Ekbatana Arrian says that Alexander rode south to Babylon with the funeral cortege. He gives no details about the funeral itself. Or even if it took place. As a result he is also silent about what happened to the remains.\n\nFor his part, Plutarch also gives the cost of Hephaestion’s funeral (and tomb) as being 10,000 talents. He adds that Alexander intended for the\n\n… ingenuity and originality of the design to surpass the expense[;] he was especially anxious to employ Stasicrates, as this artist was famous for his innovations, which combined an exceptional degree of magnificence, audacity and ostentation.\n\nWe can certainly take from this that Hephaestion’s funeral would not have taken place in 324. What about in the first half of 323? i.e., before Alexander’s own death in June.\n\nWell, Diodorus, who agrees with Arrian and Plutarch that Hephaestion’s body was taken to Babylon, says that\n\n… Alexander threw himself into preparations for the burial… He showed such zeal about the funeral that it not only surpassed all those previously celebrated on earth but also left no possibility for anything greater in later ages.\n\n(Diodorus VIII. 17. 114)\n\nSo, as far Diodorus is concerned is the funeral did take place. In his biography of Alexander, however, Robin Lane-Fox suggests two things i. that the pyre might actually have been a monument (the Greek word ‘pyra’ can refer to one or the other) and ii. what Diodorus presents as a fact may just have been a ‘rumour’. He notes that ‘no trace of this monument [pyra] has been found’.\n\nOne major source is left to us: Curtius. Unfortunately, he seems to ignore Hephaestion’s death altogether, referring to it only in passing after Alexander’s own demise*.\n\nAnd as far as I am aware, that’s it. Thats the limit of our knowledge regarding the fate of Hephaestion’s body. He died. His body was taken to Babylon. Was he buried? Or cremated? We don’t know, and to be honest I don’t think we have enough information to make an educated guess on the matter.\n\nThat needn’t stop us from making an uneducated guess, of course, so here goes. My feeling is that Hephaestion’s funeral didn’t take place – at least, not in the fashion that Alexander wanted. Eight months was not enough time to prepare for it. I imagine that after Alexander’s death, his body would have been quietly cremated according to the usual Greek practice and the ashes deposited somewhere in Babylon.\n\nHad anything untoward or unexpected happened to his remains I believe someone would have written about it. In the febrile atmosphere of the diadochi period it would have suited someone to accuse anyone who had mistreated his body or ashes of doing so. Those are my thoughts; what do you think?\n\nIn the early third century BC, a Babylonian king (I believe Antiochus I Soter but do let me know if I am wrong), transported nearly all of Babylon’s population to Seleucia. Only a few people remained behind. By the middle of the second century BC the city was finished as a going concern. All that was left to happen was for her surviving buildings to crumble and fall.\n\nIt would be nice to think that somewhere under the site of Babylon, Hephaestion’s remains lie undisturbed; nestled, perhaps, in a golden coffin or urn. This is just a dream, though. Just as Alexander’s gold coffin was later appropriated to give a Ptolemaic king more money, the same would have happened to Hephaestion’s. No, I imagine he had a normal coffin/urn and wherever it rested, it did so in obscurity – people’s memories are short and the Seleucids had no reason to promote his cult – until the decay of the city brought about – or simply concluded – the remains’ own decay.\n\n* In his notes to the Loeb Diodorus, Jeffrey Henderson says that Curtius probably did give an account of the funeral but that it was most likely lost from his manuscript"}, {"url": "https://pantheon.world/profile/person/Hephaestion/", "page_content": "Hephaestion\n\nHephaestion (Ancient Greek: Ἡφαιστίων Hephaistíon; c. 356 BC – October 324 BC), son of Amyntor, was an ancient Macedonian nobleman and a general in the army of Alexander the Great . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Hephaestion has received more than 1,867,432 page views. His biography is available in 37 different languages on Wikipedia (up from 35 in 2019) . Hephaestion is the 95th most popular military personnel (down from 92nd in 2019), the 82nd most popular biography from Greece (down from 78th in 2019) and the 8th most popular Greek Military Personnel.\n\nHephaestion is most famous for being Alexander the Great's closest friend and confidant."}, {"url": "https://acearchive.org/324-bc", "page_content": "In the year 324 BC, the world was a different place. The Roman calendar, still in its pre-Julian form, marked the passage of time in a way that seems foreign to us today. Yet, despite the differences in the way we measure time, there are certain universal truths that transcend centuries.\n\nIn this year, the world was marked by the dictatorship of Cursor. Like a ship navigating through rough seas, the people of this time were at the mercy of their leader, hoping to reach a safe harbor despite the storms that raged around them. The name \"Cursor\" evokes a sense of movement, of forward momentum, but also of uncertainty. For those living under his rule, life must have felt like a journey into the unknown, with only their wits and courage to guide them.\n\nThis was a time of great change, both for Rome and for the wider world. Empires rose and fell, alliances were forged and broken, and the fate of nations hung in the balance. In the face of such uncertainty, it is no wonder that people turned to their leaders for guidance and protection. But as we know all too well, power can be a double-edged sword. The very leaders we look to for strength and stability can also be the source of our downfall.\n\nThe year 324 BC reminds us that history is not just a collection of dry facts and figures, but a living, breathing tapestry of human experience. We can learn much from the struggles and triumphs of those who came before us, and in doing so, gain a deeper understanding of ourselves and our place in the world. So let us look back on this year with a sense of wonder and awe, and let us be grateful for the lessons it can teach us.\n\nEvents\n\nThe year 324 BC was a time of significant events that shaped the course of history. From the Macedonian Empire to Greece, this year saw an array of political and military developments that played a significant role in shaping the world.\n\nIn the Macedonian Empire, Alexander the Great returned to Susa, Persia, after his conquest of India, and severely punished officials he deemed to have failed in their duties, replacing over a third of his satraps and executing six defaulting governors. Three generals in Media, including Cleander, the brother of Coenus, were arrested, tried, and executed for extortion. Alexander continued his policy of integrating the Macedonians and Persians by marrying Darius III's daughters, Barsine and Drypteis, and offering generous dowries to 10,000 of his soldiers who had taken Persian wives. However, this policy was not popular among the Macedonians, and it stirred resentment in the army.\n\nAlexander spent the summer and autumn at the Median capital, Ecbatana, where his best friend, Hephaestion, died. Alexander's extravagant mourning for his closest friend led to criticism among his officials. Later that winter, he carried out a punitive expedition against the Cossaeans in the hills of Luristan, demonstrating his military might and his determination to maintain control.\n\nIn Greece, Alexander's treasurer, Harpalus, fled from Susa to Athens, fearing arrest. Upon arrival, he was imprisoned by the Athenians, who also seized the considerable wealth he had collected from the spoils of Alexander's conquest of Asia. The money was entrusted to a committee led by Demosthenes, who was later found guilty of misappropriating some of the funds and imprisoned. Although his sentence was soon repealed, he went into exile. This scandal led to the rise of Dinarchus, a professional speech writer in Athens, who wrote the prosecution speeches against Demosthenes, Demades, Aristogiton, Philocles, and other politicians accused of misappropriating some of the money. Hypereides, who had supported Demosthenes in his struggle against the Macedonians, withdrew his support after the Harpalus affair, and became the head of the patriotic party in Athens.\n\nFinally, Greek colonists founded the city of Akra Leuka (modern Alicante, Spain) on the Mediterranean coast of the Iberian Peninsula, a move that would shape the development of the region for centuries to come.\n\nOverall, the events of 324 BC were a mixed bag of triumphs and tragedies, bringing both progress and setbacks. Alexander's determination to integrate the Macedonians and Persians led to resentment among his army, while his extravagant mourning for Hephaestion sparked criticism among his officials. Meanwhile, the scandal surrounding Harpalus led to the rise of Dinarchus and the downfall of Demosthenes. However, the founding of Akra Leuka was a significant moment in the history of the Iberian Peninsula, foreshadowing the region's future development.\n\nBirths\n\nDeaths\n\nThe year 324 BC saw the passing of one of the most significant figures in the life of Alexander the Great - Hephaestion, son of Amyntor. Hephaestion was more than just a Macedonian general, soldier, and aristocrat, he was a trusted friend and possibly even a lover of Alexander. His death was a devastating blow to Alexander and is said to have affected him greatly.\n\nHephaestion's rise to prominence was intertwined with that of Alexander, and the two were inseparable. He was a key figure in the Macedonian empire, and his contributions to Alexander's military campaigns were significant. However, it was not just his military prowess that earned him Alexander's trust, but also his loyalty and devotion.\n\nThe exact nature of their relationship has been a topic of debate among historians, with some suggesting that they were lovers. Whatever the case may be, it is clear that their bond was deep and that Alexander was devastated by his friend's passing.\n\nHephaestion's death came during the autumn of 324 BC, while Alexander was at the Median capital, Ecbatana. The exact cause of his death is not known, but some accounts suggest that he may have died of illness or alcohol poisoning. Alexander was inconsolable at the news of his friend's passing, and he indulged in extravagant mourning, which included cutting off his hair and ordering a period of public mourning.\n\nThe death of Hephaestion had a profound impact on Alexander, and some accounts suggest that it may have contributed to his own declining health and eventual death. It is said that Alexander's grief was so great that he lost his passion for conquest and that his own health began to decline as a result.\n\nIn conclusion, Hephaestion's death was a significant event in the year 324 BC and in the life of Alexander the Great. He was a trusted friend and advisor, and his passing had a profound impact on Alexander. It is a reminder that even in the midst of great conquests and achievements, the loss of a loved one can have a profound effect on our lives."}, {"url": "https://deadorkicking.com/hephaestion-dead-or-alive/", "page_content": "Hephaestion Death Fact Check\n\nHephaestion is alive and kicking.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nIs Hephaestion's father, Amyntor, dead or alive? Amyntor's information is not available now.\n\nHephaestion - Biography\n\nHephaestion (Greek: , alternative spelling: \"Hephaistion\"; c. 356 BC – 324 BC), son of Amyntor, was a Macedonian nobleman and a general in the army of Alexander the Great. He was \"... by far the dearest of all the king's friends; he had been brought up with Alexander and shared all his secrets.\" This friendship lasted their whole lives, and was compared, by others as well as themselves, to that of Achilles and Patroclus."}, {"url": "https://web.ics.purdue.edu/~rauhn/Hist303/death_alexander.htm", "page_content": "Alexander’s Last Days\n\nHarsh punishment of various Persian satraps – execution, investigations, demands for their appearances at Babylon . Hephaestion’s death 324 BC.\n\nPersian Marriages:\n\nAlexander = 2 daughters of Darius III and Artaxerxes III\n\nHephaestion = 2 daughters of the same\n\nCraterus = cousin and niece of Darius III\n\nPerdiccas = daughter of satrap of Media\n\nNearchus, Ptolemy, Eumenes = members of family of Artabazus\n\nSeleucus – Apama, daughter of Spitamenes\n\nRoxane – Alexander 4 – Philip Arrhideus\n\n90 marriages in all, but no real fusion of Macedonian and Persian aristocracies. Few Persians were recorded in the companion cavalry. Predominantly Aegean satraps used in the empire, the number actually rose in the last years of Alexander’s reign. Marriages with Persian princesses were symbols of continuity with Persian realm, Yet only Apama would play any significant role following Alexander’s death.\n\nAlexander now dressed more and more like Persian king. He reinstituted the royal bodyguard, the melophoroi. With the arrival of the 30,000 Epigonoi, in Macedonian arms, from the northeastern satrapies, he now had the army to replace his tired Macedonian forces. Of the 50,000 forces that left Ecbatana on the march to India in 330 BC only 1 in 4 made it back to Babylon . Numerous reinforcements had arrived during the march, however. Resentment of the Macedonian veterans reached high level of anxiety.\n\nIn 324 BC he offered to pay off the debts of all his troops, but to do so he needed their names recorded in the camp register. The veterans assumed the worst motive to this but relented. Some 10000 to 20000 talents of veterans’ debts were wiped clean. He then ordered the discharge of all unfit Macedonians. His intention was to send them back to Macedonia , laden with wealth as an advertisement for recruitment. However, they feared that with his new army they were being eliminated. Mutiny at Opis - 324 BC. “Let Alexander continue his campaigns with his father, Ammon!” This time Alexander held firm and began assigning Macedonian military titles to Persian troops. The veterans realized they were in potential danger and capitulated. Alexander hosted a banquet of reconciliation between Persian and Macedonian troops. Some 9000 were invited and preference was shown to the Macedonians. Alexander probably hoped that the Macedonians and Persians could learn to coexist. Iranians definitely became dominant in the army but Aegean nobles in the officer staff. In all some 10000 foot and 1500 horse were discharged, each received 1 talent bonus plus full pay. Craterus was to lead them back to Macedonia where he would replace Antipater as regent. Antipater was summoned to Babylon to account for his feuding with Olympias during Alexander’s absence. Ironically, following Alexander’s death the Macedonian veterans would immediately reenlist in the wars of succession, before leaving the Near East .\n\nApocryphal plans: circumnavigating the Arabian peninsula (plans were actually under way, directed by Nearchus); march to Carthage and then possibly on to Rome .\n\nIn May 323 Alexander fell ill to “pneumonia”. Possibly the result of his war wounds.\n\nNumerous omens predicted Alexander’s death, however, and rumors of conspiracies abounded including one that Cassander, son of Antipater, was bringing the water of the River Styx , the only way to poison a god. On June 20, 323 BC, Alexander perished, surrounded by all his satraps, who pressed him in his last few moments to state which of them was to succeed him as king. His last words, allegedly, were “the fittest…”\n\nAlexander demonstrated unusual abilities in his career:\n\n<![if !supportLists]>1. <![endif]>innovations and improvisation with combined force of phalanx and cavalry\n\n<![if !supportLists]>2. <![endif]>siege warfare, tenacity and determination, and adaptation of new tactics in the East\n\n<![if !supportLists]>3. <![endif]>incorporation of the Persian administrative system with Macedonian military control; use of client kings in remote regions\n\n<![if !supportLists]>4. <![endif]>fusion of the Macedonian and Persian armies\n\n<![if !supportLists]>5. <![endif]>his personal leadership, sharing the soldiers’ toils and dangers\n\n<![if !supportLists]>6. <![endif]>relentless total war, yet, after Granicus he allowed Greek mercenaries to live and treated adversaries with courtesy if not friendship\n\n<![if !supportLists]>7. <![endif]>opened and expanded the trade routes between the Mediterranean, India, and China\n\nWars of Succession - First Wave of Alliances\n\nAntipater, Cassander, Craterus (keeper of royal treasury and guardian of Arrhideus), Antigonus,, Lysimachus v.s. Olympias, Perdiccas (keeper of Alexander’s ring), Eumenes of Cardia\n\nLamian war 322-1, end to Greek independence; Bactrian mutiny 323\n\nAntipater organizes empire, then dies 319, makes Polyperchon regent.\n\nConflicts continued - Cassander (Antipater’s son) and Antigonus v.s Polyperchon, then regent, and Olympias who seized Roxane and Alexander IV; O. executed Philip Arrhideus, she was defeated by Cassander at Pydna in 316; he later killed Roxane and Alexander the IV."}, {"url": "https://www.historyextra.com/period/ancient-greece/facts-alexander-great-life-death/", "page_content": "In this comprehensive guide to Alexander the Great, Spencer Day presents 17 moments that explain why Alexander was such force to be reckoned with, Jeremy Pound reveals Alexander's early life and considers his role as an empire builder, Professor Paul Cartledge considers his personality and semi-mythic status, plus Jennifer Macaire shares six surprising facts about his life and legend.\n\nWho is Alexander the Great?\n\nAlexander III of Macedon, known to most as Alexander the Great, inherited his kingdom (in modern-day Greece) at the age of 20, following the assassination of his father, Philip II, in 336 BC.\n\nAfter suppressing his enemies on home soil, Alexander moved quickly to reassert Macedonian power in Greece and to conquer the Persian empire, achieving victories across the Persian territories of Asia Minor, Syria and Egypt without suffering a single defeat.\n\nThe next eight years of campaigning saw him create an empire that stretched across three continents and covered around two million square miles – south into Egypt and as far east as the Indian Punjab.\n\nHe was undefeated in battle and is widely considered one of history’s most successful military commanders – but died in his prime at Babylon in June 323 BC, just before his 33rd birthday.\n\nAlternate history: what if Alexander the Great had lived longer? Professor Paul Cartledge considers whether an older Alexander the Great could have formed an even bigger empire or grown even more impressive reputation...\n\nAlexander the Great: the big questions answered\n\nPaul Cartledege, AG Leventis Professor of Greek Culture Emeritus at the University of Cambridge, gives us his take on Alexander the Great...\n\nWhat made Alexander the Great such a brilliant military leader?\n\nHe combined immense personal charisma and bravery (he often led his troops from the front). Plus he had a priceless ability to identify the key moment in a battle and act decisively to ensure he won that moment.\n\nWhere does Alexander the Great stand in the pantheon of great commanders?\n\nUp there in Division 1, with Napoleon and Genghis Khan. He won the four key battles of his great campaign: at Granicus, Issus, Gaugamela and, for me the most impressive, Hydaspes. While Darius III of Persia commanded a motley crew of multi-ethnic forces, at Hydaspes Raja Porus led largely Indian ethnic forces fighting on their own terrain for their own terrain. And, of course, they had elephants!\n\nWhat was Alexander the Great’s greatest failing as a leader?\n\nOne criticism is that he didn’t invest enough time and energy in the peaceful administration of his diverse empire. One symptom is that, at his death in 323 BC, he had three wives but no male heir yet born. In addition, he was too impetuous, too prone to believe alleged conspiracies against his life and too trusting in subordinates who let him down.\n\nWas Alexander the Great gay?\n\nAs he had sex with both males and females, he was what we’d call bisexual. He married three times and sired at least two sons, one legitimate (born to his first wife, Roxana, after his death). Possibly his closest and warmest personal relationship was with a man – his near-contemporary Hephaestion, a noble Macedonian who, like him, was taught by Aristotle.\n\nMore like this\n\nA brief history of sex and sexuality in Ancient Greece Paul Chrystal explores the many layers of sex and sexuality in various Greek societies – from prostitution to pillow talk...\n\nWhat motivated Alexander the Great to undertake his extraordinary campaign in the east?\n\nIt probably never occurred to him not to carry on where his father had been forced to leave off. Probably, too, his Greek-style education and his love of Homer’s writings gave him the notion of trying to emulate his boyhood hero, Achilles (the mythical Trojan War was, after all, a battle between Greeks and Orientals).\n\nDid Alexander the Great truly believe he was a god?\n\nWithout doubt he believed he was descended literally from more than one god, and he almost certainly demanded to be worshipped by his subjects as if he were himself a living god. Was he a megalomaniac? Yes, inevitably. No one but a megalomaniac could possibly have conceived, let alone pulled off, his greatest feats.\n\nAlexander the Great: his life in 17 moments Understand why Alexander the Great casts such as shadow in history with writer Spencer Day's highlights of his life... 20/21 July 356 BC | Alexander the Great is born He is born in the Macedonian capital of Pella. His father is the king of Macedon, Philip II, and his mother is the politically ambitious Olympias of Epirus. 343 BC | Alexander begins his education with Aristotle Alexander travels to the Temple of the Nymphs in Mieza to be educated by the celebrated Greek philosopher Aristotle. There he develops a fascination with the exploits of mythical Greek heroes such as Achilles. October 336 BC | Alexander becomes king of Macedon Philip II is assassinated by his bodyguard while attending wedding celebrations in Aegae. Alexander – who has since come under suspicion for ordering the killing – becomes king of Macedon in his father’s stead. May 334 BC | Alexander crosses the Hellespont With an army about 50,000 strong, Alexander crosses the Hellespont to Asia Minor. His goal: to seize Persia and become the master of Asia. May 334 BC | Alexander visits Troy Alexander journeys to the town made famous by Homer’s epic poem the Iliad, to pay his respects to some of the heroes he believes are buried there, among them Achilles. May 334 BC | The battle of the Granicus The Persian king, Darius III, sends an army to confront the Macedonians on the banks of the Granicus river. Alexander secures victory following an audacious cavalry charge into the heart of the enemy – which he leads himself. 5 November 333 BC | The battle of Issus Darius attacks Alexander near Issus. The Persian army fares no better than at Granicus – a whirlwind Greek cavalry assault proves decisive and Darius flees the battlefield. 332 BC | Divine intervention at Siwa Oasis After leading a party of men in a perilous journey across the Saharan desert, Alexander visits the oracle at the Siwa Oasis, where he asks her if he is the son of the god Amon. He later suggests that she answered in the affirmative. July 332 BC | The storming of Tyre In a masterclass of ingenuity and resolve, Alexander storms Tyre following a seven-month siege, which had seen his men build a half-mile-long causeway out to the island. He then oversees the slaughter of 8,000 of the city’s inhabitants. 331 BC | The founding of Alexandria Alexander founds Alexandria on Egypt’s north coast. The city goes on to become one of the Mediterranean’s most important ports. Today nearly five million people call it home 1 October 331 BC | The battle of Gaugamela Darius brings an enormous army to the field near Gaugamela in modern Iraq. What follows is the decisive battle in Alexander’s conquest of Persia. Though Alexander’s army is perhaps less than half the size of its Persian foe, the Macedonian troops’ superior training and resolve – not to mention their commander’s peerless tactical agility – prevails once more. Darius flees the battlefield again. But this time there is no reprieve: soon after, he is slaughtered by his own men. 330 BC | The looting of Persepolis The Macedonian army descends on the Persian capital of Persepolis and, in an orgy of drink-fuelled violence, loots the city and burns its great palace to the ground 327 BC | The siege of Aornos In another masterclass of improvisation, Alexander seizes Aornos, a seemingly impregnable stronghold blocking his entry into India. Alexander’s solution is to seize the hill opposite and drive the enemy out of their encampment with his catapults May 326 BC | The battle of the Hydaspes The powerful Indian raja Porus confronts the Macedonians on the banks of the river Hydaspes. In an incredibly hard-fought battle, Alexander’s phalanx gets the better of an Indian army that includes 200 elephants. Hydaspes is the last great battle of Alexander’s campaign in the east – but it is also the bloodiest, pushing the Macedonian army to breaking point 326 BC | Alexander's men mutiny Drenched by Indian monsoon rains and traumatised by the carnage at Hydaspes, Alexander’s men decide they have had enough and mutiny. Eight years and 17,000 miles into his epic journey east, Alexander is forced to accept that his remarkable campaign of conquest is over 324 BC | The second mutiny Troops mutiny again at Opis (roughly modern Baghdad): faced with insurrection, Alexander cashiers 10,000 of his mainly Macedonian troops and stages a huge banquet of reconciliation. 323 BC | Alexander the Great dies Alexander passes at Babylon: his cause of death is unclear; some theories suggest that he was assassinated by poison.\n\nAlexander the Great's Empire\n\nHow did a young king from Macedon inspire his modest army to conquer a domain that spanned the ancient world? Writer Jeremy Pound reveals the secrets behind the man – and his downfall\n\nWhen, on 1 October 331 BC, Alexander III of Macedon faced the massed Persian forces of Darius III at Gaugamela, the outcome should have been a foregone conclusion. Comprising 34,000 infantry and 7,000 cavalry, Alexander’s Greek army was by no means small – but Darius commanded a mighty cavalry numbering 34,000 and, it is reckoned, more than 200,000 infantry. What’s more, the hot and dusty plain – in what is now northern Iraq – was home turf for the Persians. Alexander’s men, in contrast, had been on the march for over three years and were over a thousand miles from home.\n\nIn fact, the battle was indeed a rout – but not in the expected way. It was the Persians who were crushed, not the numerically inferior Greeks. We will never know the exact figures, but it’s believed that around 50,000 Persians were killed in the battle, compared with just 1,000 or so Greeks. With his vast forces in disarray, Darius fled. He survived – for now – but his reign was effectively finished, as was the once-great Persian empire, which had stretched from Libya in the west to the Indus Valley in the east. The way now lay open for Alexander to press on eastwards and establish his own empire. At just 25, he was the most powerful man in the world – the Great, indeed.\n\nBrilliant military tactician, savvy politician, courageous and accomplished fighter – in terms of leadership skills, Alexander had the lot. Nor did it hurt to be the son of a king who had already set in motion the most significant shift in power in Greek history.\n\nPeloponnesian War: Athens fights Sparta Read about another major shift in power – the 5th century BC Peloponnesian War between the Delian and Peloponnesian Leagues. Here's why the war began, who won and how, and why it prompted a reshaping of the Hellenic world...\n\nAlexander the Great's early life and reign\n\nAlexander was born in July 356 BC to King Philip II of Macedon – by all accounts a thoroughly unpleasant man, but also a mightily effective leader. In the space of just a few years, Philip transformed his state from a small, peripheral kingdom in northern Greece into an unstoppable war machine. In 339 BC, he won a crushing victory over Athens and its allies at Chaeronea, ensuring that Macedon effectively ruled all Greece.\n\nAlexander won his spurs fighting alongside his father, earning plaudits for his bravery at Chaeronea, but would himself soon have the opportunity to rule. Suspiciously soon, in fact – it’s been suggested by some historians that Alexander might have been behind the assassination of Philip II in 336 BC, killed by one of his own bodyguards at a family wedding.\n\nBy fair means or foul, at the age of 20, Alexander III became ruler of Greece – and the ruthlessness he displayed in cementing that position bore all the hallmarks of his father. He put down unrest in the north of his kingdom with brutal speed and, when Thebes rashly declared independence from Macedonia, his reprisal was savage: the city was burnt to the ground, its people either slaughtered or sold into slavery.\n\nBut Alexander was not merely ruthless. He was also bright enough to know that brute force alone would not keep the diverse collection of states under his power in check. If his study of history had taught him anything – and, with the philosopher and scientist Aristotle as his teacher, he would certainly have been well schooled – it would have been that nothing unites states and their people more than having a reviled common enemy. In 490 BC and 480 BC, the Greeks, who had been fighting among themselves, had joined forces to repel invasions by the Persians under Darius I and Xerxes I.\n\nNow, a century and a half later, Alexander saw an opportunity to turn the tables, and planned a united Greek invasion of Persia.\n\nThe expedition that began in spring 334 BC, when Alexander’s forces set off from the Greek mainland, would change the course of history. It was not just his military victories against the odds that defy belief, but also his achievements in overcoming daunting geographical obstacles – from vast African deserts to the precipitous mountain trails of the Hindu Kush in the western Himalaya – in a journey that would eventually cover about 20,000 miles over the course of 11 years.\n\nThe initial impetus and rallying call for the expedition may have been that long-held grudge against the Persians, but Alexander also had an ulterior motive: he was determined to reach the end of the Earth and the great ocean that he believed lay beyond. Certainly, no one could accuse him of a lack of ambition.\n\nAlexander the Great Before the Tomb of Achilles. Found in the collection of Louvre, Paris. (Photo by Fine Art Images/Heritage Images/Getty Images)\n\nEarly conquests\n\nAlexander’s all-conquering tour began when he crossed into Asia Minor (Anatolia, today part of Turkey) before heading down the eastern Mediterranean coast through Syria into Egypt, looping back towards the Red Sea then continuing eastward through Assyria – where he triumphed at Gaugamela – Mesopotamia, Persia and Bactria, and through the Hindu Kush to the Indus River. If those ancient names seem unfamiliar, look in a modern atlas and tally the list of countries his army traversed to get an idea of the enormity of the achievement: Turkey, Syria, Lebanon, Israel, Egypt, Iraq, Iran, Afghanistan, Pakistan, Tajikistan, India.\n\nAlexander’s forces triumphed in a succession of major battles, not all of them as quick and decisive as Gaugamela. The crucial Mediterranean port city of Tyre (now in Lebanon) was conquered only after a siege that lasted seven months. Cities galore were founded en route, from Alexandria in Egypt (today, the country’s second biggest city) to Alexandria Eschate (‘Alexandria the Farthest’) in Tajikistan and Alexandria Bucephalus, named for the Macedonian’s beloved horse, in what’s now the Pakistani Punjab.\n\nThe Seven Wonders of the Ancient World: what happened to them? As the pinnacle of antiquity’s ability in engineering, architecture and artistic beauty, the seven wonders of the ancient world still cast their shadow over human endeavour today. And one of them was in Alexandria...\n\nNot everyone met Alexander’s army with stern resistance. Many welcomed their conqueror with open arms and, often, lavish gifts. All, however, soon became part of an empire of unprecedented scope – covering over two million square miles, it linked East with West for the first time in history. Enclaves of Greek culture persist in remote areas of the Middle East and the Indian subcontinent even today, legacies of the Macedonian’s exploits over two millennia ago. No figure from ancient history continues to loom so large in the literature and culture of so many different peoples – in many he is deified, in many others he is utterly reviled.\n\nBut how did he do it? How did Alexander inspire and maintain allegiance and endurance in his troops as he led them on an expedition that, at times, must have seemed not just ambitious but downright deluded?\n\nProviding the military brains behind unlikely victories such as that at Gaugamela helped – everyone likes to be on the side of a winner, particularly one who is seemingly invincible. Nor was Alexander the sort of general to monitor success from afar. Various sources depict him fighting courageously on the frontline.\n\nAlexander knew all about the effectiveness of what today is dubbed ‘shock and awe’. The shock was simple enough – if you crossed him, he was merciless. Alexander’s path across Asia was a bloody one, strewn with the bodies not just of enemies but also of former friends whom he came to mistrust, and even the likes of doctors and priests whom he believed had let him down. The awe, meanwhile, came from creating an aura of one directed from above, encouraging the belief that his rise towards global domination was preordained. To that end, he employed tactics designed to convince all around him of his credentials.\n\nThe Greeks were a suspicious and religious bunch, so Alexander made a point of consulting oracles – which would inevitably confirm that his actions enjoyed divine approval; he even undertook a perilous eight-day trek across the desert to the oracle at Siwa in Egypt. And Alexander’s propagandist Callisthenes was invariably there to elaborate, enhance and disseminate the news far and wide. Much of the success of the Alexander ‘myth’ is down to the handiwork of Callisthenes – an exceptional spin doctor – from the famous account of loosening the Gordian Knot to the touching tales of Alexander’s bond with Bucephalus. Many people were led to believe that Alexander was, indeed, a god.\n\nEnd of the road\n\nEventually, though, even the most successful conqueror meets his nemesis. Alexander’s came in the form of the River Ganges. By 326 BC, long years on the road and battle losses – not to mention tropical diseases and venomous snakes – had taken their toll on his troops. Faced with the prospect of crossing a threemile- wide torrent, only to face more of the same tribulations on the other side, Alexander’s army refused. The great adventure was over.\n\nThe return journey from the subcontinent was not pretty. The weary Greeks saw their numbers depleted first by flash floods and then, cruelly, a horrendous drought. As for their leader, his once razor-sharp mind became increasingly erratic. He drank more: 24-hour binges became a familiar part of his routine – followed, of course, by a couple of days of hangover. Unsurprisingly, plots against him began to simmer.\n\nIn autumn 324 BC, Alexander’s closest companion (and, some claim, lover) Hephaestion died – possibly of typhus fever or typhoid exacerbated by heavy alcohol consumption. Devastated, Alexander declined rapidly. He reached Babylon in spring 323 BC, and in June took to his sick bed. His condition worsened and within days he was dead, aged just 32. Was it a fever that killed him, or had his liver simply given up? Perhaps he was poisoned?\n\nHe was, after all, not short of enemies. Alexander the Great never made it home to Macedon. But then he never intended to. As the greatest military leader in ancient history, he left a monumental legacy: his vast Asian empire.\n\nAlexander the Great: personality and godliness\n\nHistorian Paul Cartledge looks into the personality of the 4th-century BC military genius to discover what drove him to create a huge empire covering three continents...\n\nAlexander the Great had no low opinion of himself. That’s not surprising given that the 4th-century BC ruler had conquered most of the known world before he had even reached the age of 30. Nevertheless, he appears to have been aware of the value of self-promotion, so besides his armies of soldiers he employed a small army of writers and artists to project the image of himself that he wanted to disseminate to the world at large.\n\nHardly anything of those original writings survives today, unfortunately – though we do have the works of ancient Greek and Roman historians and biographers such as Curtius Rufus, Arrian and Plutarch who themselves had access to the lost texts by Ptolemy, Aristoboulus, Nearchus and others. On the other hand, large numbers of portrait coins and medallions and sculptures do survive intact, some contemporary or near-contemporary, so that we have a very good idea of the impression Alexander wished to create for his many hundreds of thousands of subjects scattered from what is today Greece (including Macedonia) in the west, as far east as what is now Afghanistan and Pakistan.\n\nOne thing is very striking about all these various images. They all aim to elevate Alexander not only above the common herd of ordinary men, but above the status of the merely mortal altogether: to the status of a semi divine hero or even a god. Scholars argue as to whether Alexander sent down a formal decree from Babylon (in Iraq), one of his several capitals, actually ordering his subjects to worship him as a god.\n\nBut there is no question but that he was indeed worshipped as a living god, by Greeks as well as by Orientals, and there is every likelihood that Alexander wanted to be so worshipped. This was not unprecedented, because Alexander’s father Philip had already been granted divine worship as a living god. And anything Philip could do, Alexander could do better; it’s arguable that rivalry with his father was one of the biggest psychological motivating forces in all Alexander’s major projects, and one of the most powerful influences on his personality.\n\nWho influenced Alexander the Great?\n\nPhilip II was, according to one contemporary historian, the most remarkable man Europe had produced. He raised his kingdom of Macedon from a small player on the Greek scene to the major protagonist and arbiter of the Greek world. A man of violent temper and ferocious ambition, Philip fell out with Alexander’s mother Olympias (a Greek princess) quite early on. Alexander perhaps therefore became something of a mummy’s boy – not in the sense that he was ever a timid, coddled wimp, but in the sense that his powerfully ambitious mother saw Alexander as a key weapon in her struggle with Philip, and the instrument whereby she could become not just another of Philip’s seven wives, but queen mother, mother of the heir apparent and eventually mother of the Macedonian king.\n\nAlexander, who admired Philip but also envied his achievements, was probably happy to go along with her – perhaps even to the extent of conniving with her at Philip’s public assassination at Aegae in 336. However, Alexander did once quip that the highly-strung Olympias made him pay a high rent for the nine months she had housed him in her womb.\n\nApart from his parents, there were two great influences on his life from boyhood. One was the great Thessalian stallion Bucephalas, whom Alexander himself tamed and from whom he was pretty much inseparable from at least his early teens until the death of the great horse, aged about 30, in Pakistan in 326. So moved was Alexander by his loss that he actually named one of his new city foundations after him, in the Indus valley.\n\nThe other was Alexander’s boyhood comrade Hephaestion. He came from an elite Macedonian family, and was among the close group of comrades who had the privilege of being taught with Alexander by the philosopher Aristotle at Mieza, to the west of the Macedonian capital of Pella. Hephaestion was a bit older, and a bit taller, than Alexander, and it is probable that at some stage their relationship was more than platonic.\n\nUNSPECIFIED - CIRCA 1754: The Deer Hunt': Alexander the Great (left) and Hephestion (Hephaestion), Alexander's boyhood friend, hunting deer. Mosaic from the royal palace at Pella 4th century BC. (Photo by Universal History Archive/Getty Images)\n\nYet for Alexander sexual gratification was apparently not that important. “Sex and sleep” he is said to have remarked, “are the only two things that remind me I’m mortal”. Or, as his best surviving historian Arrian (a Greek from Asia Minor writing in the second century AD) put it, warfare and military exploits gave Alexander the sort of thrill that others derived from sexual conquest. Not that Alexander was a monk; he is said to have had sex even with a mythical Amazon queen, and to have fathered a child with his beautiful Sogdian bride Roxane (from what is today Uzbekistan). He allegedly had affairs with the Persian wife of a dangerous Greek opponent fighting on the Persian side, and a liaison with a Persian eunuch.\n\nWhat’s striking is that his preferred sexual partners were mainly Oriental rather than Greek or Macedonian. Philip is said to have fought his wars by marriages, that is by concluding diplomatic marriage alliances as a way to secure a victory, or as an alternative to fighting in order to decide the issue of territorial control. Alexander preferred to settle disputes by fighting, on the whole. However, even he took three wives, the other two besides Roxane both being Persian princesses.\n\nAlexander the Great away from the battlefield\n\nWhen Alexander was not fighting, there was nothing he loved to do more, for relaxation, than hunt. Big game hunting, that is – wild boar and lions; not child’s play quarries like hares or doves. In Macedon there were two tests of manhood: killing a wild boar and killing a man in battle. Alexander had passed both of those by the time he was sixteen, besides hunting the wild mountain lions and sharp-eyed lynxes that still abounded in the western Macedonian upland country. Bucephalas served Alexander no less faithfully as his hunting mount than as his number one warhorse. When the going got tough on campaign (as it did in Iran, Afghanistan and central Asia after he had defeated Great King Darius III of Persia and taken his crown) a reward for any success was a day’s hunting in a game park. In one of these hunting sprees near modern Samarkand, no fewer than 4,000 animals were allegedly slaughtered. It is the same dedicated hunter’s mentality that made Alexander ruthless in pursuit of all his goals.\n\nHistorians have argued since antiquity over what might have been Alexander’s ultimate goal, had he not died prematurely (and probably of a malarial or typhoid fever rather than by an assassin’s poison-bearing hand) at Babylon in 323 aged just 32. One theory takes us back to our starting point, to his self-projection as more than merely mortal. Certainly, he was religious, even superstitious, a trait he seems to have inherited or at any rate could easily have learned from his mother.\n\nHow did Alexander the Great die? Aslo, where is Alexander the Great buried, and has his tomb actually been found? Professor Paul Cartledge gives his view...\n\nHe relied especially heavily on the guidance of his personal diviner, Aristander, a Greek from Telmissus in what is now southwestern Turkey. Aristander’s interpretation of portents such as the behaviour of birds could mean life or death for Alexander’s supposed friends no less than his sworn enemies. Consultation of oracular shrines was a fixed part of Alexander’s routine. Apollo’s seat at Delphi in central Greece was hardly out of his way in 336, and the priestess there was made to prophesy that he would be invincible.\n\nBut the trip to the oasis of Siwa in Egypt’s western desert in 332, a dangerous journey over several hundred waterless and dust ridden kilometres, was a different proposition. Alexander gravely announced that the oracle’s presiding deity Ammon, whom the Greeks often identified with their Zeus, had promised him his heart’s desire. But what that was has to be inferred from his subsequent behaviour. It was something to do with the truth about his origins; the oracle seems to have confirmed Alexander in his belief that he had been born the son of a god, rather than a mortal.\n\nNot all his closest companions were as enamoured as he was of the notion that Philip was just Alexander’s “so-called father”. Nor did they all follow Hephaestion’s lead in paying to Alexander the kind of public adoration that they thought was appropriate only for a true Olympian divinity. Persians too had not been in the habit of recognising their Great King as a living god but had seen him rather as the vicar on earth of the great god of light Ahura Mazda. Some of Alexander’s Oriental subjects, on the other hand, such as the Egyptians, would have thought less of him as their king if he had not been the recipient of divine worship. So, as well as being one of the major drivers of his personality, Alexander’s intimations of godhead could easily have been one of the major causes of dissension at the heart of his mixed Greek-Oriental court.\n\nPosterity has generally been more kind to Alexander, variously venerating or indeed worshipping him as a saint as well as a wonder-working holy man and military hero. Within the sphere of recent critical scholarship, however, a distinct note of hostility can be detected, influenced perhaps by contemporary experience of bloodshed in regions such as Afghanistan and Iraq that Alexander himself once traversed. Those scholars who see Alexander as little but a natural-born killer might bear in mind the words of the American poet Robert Lowell, in his poem The Death of Alexander: \"No one was like him. Terrible were his crimes – but if you wish to blackguard the Great King, think how mean, obscure, and dull you are, your labors lowly and your merits less...\"\n\n6 things you (probably) didn’t know about Alexander the Great\n\nAuthor Jennifer Macaire shares six surprising facts about the Macedonian conqueror...\n\n\n\nAlexander played polo\n\nLegend has it that when Alexander the Great was about to invade Persia in 334 BC, the Persian king Darius III sent him a polo mallet and ball. It’s thought that this gesture was either inviting the Macedonian to a game, or he was suggesting that Alexander should “stick to games and avoid war”. Whatever the intention, Alexander is said to have replied: “I am the stick and the ball is the Earth” – before going on to conquer Persia.\n\nPolo, one of the oldest sports in the world, likely originated somewhere in Central Asia. Mounted nomads played a version of polo that was part sport, part training for war, with as many as 100 men on a side. If its origins are obscure, there is ample evidence of the game’s regal place in the history of Asia: the game followed the nomads’ migration to Persia sometime between 600 BC and 100 AD and the Persians adopted polo as their national sport, where it was played by nobles and soldiers alike.\n\nSome stories say Alexander the Great spent time with the Persian royal family when he was young, accompanying his father on diplomatic missions. Alexander most likely saw polo games on his many forays into Persia, and perhaps even played the “sport of kings”.\n\nHe may have gone underwater in a diving bell\n\nA 14th-century illustration showing Alexander the Great in a diving bell lowered from a small boat. (Photo by Hulton Archive/Getty Images)\n\nAlmost immediately after his death in 323 BC, legends began to spread about Alexander the Great’s exploits and life which, over the centuries, became increasingly fantastic as well as allegorical. Collectively, this tradition is called the Alexander Romance and the stories feature such episodes as Alexander ascending through the air to paradise; journeying to the bottom of the sea in a glass bubble; and voyaging through the “Land of Darkness” in search of the “Fountain of Youth”.\n\nWriting attributed to the Greek philosopher Aristotle references a diving bell, describing a cauldron forced straight down into water, thus keeping the air within it. In fact, it’s possible that Alexander the Great saw, or was perhaps even in, a glass diving bell. There are stories about him visiting the bottom of the ocean in a glass ball during his famous siege of Tyre (Lebanon), where it is said Alexander used divers to remove underwater obstacles from the harbour, and that the divers used crude glass diving bells. These may very well be just legends, but it is conceivable that Alexander, who was curious to learn about everything, had a go in a glass diving bell himself.\n\nWe almost certainly know what he looked like\n\nThe Azara herm is a Roman copy of a bust of Alexander the Great that was almost certainly made by the Greek sculptor Lysippus. According to the Greek writer Plutarch, Alexander made Lysippus his ‘official’ portrait artist during his reign. Thanks to its original inscription, this figure can be definitely identified as Alexander the Great, son of Philip II of Macedon.\n\nThe Azara herm, a Roman copy of a bust of Alexander the Great, thought to be by the Greek sculptor Lysippus. (Photo by: PHAS/UIG via Getty Images)\n\nSince the Azara herm is a Roman copy made centuries after Alexander’s death, it is likely not as precise as the original. The bust was unearthed in 1779 during an excavation at Tivoli, Italy, organised by Joseph Nicolas Azara (1730–1804), the Spanish ambassador to the Holy See (and, later, to France). Azara presented the sculpture to Napoleon Bonaparteas a diplomatic gift. Today it resides in the Louvre museum in Paris.\n\nFor a time, this was the only known portrait of Alexander the Great, and it is generally regarded as the surviving portrait that looks the most like him.\n\nMuch of Plutarch's famous writings about Alexander the Great can be considered fiction\n\nThe Greek writer Plutarch wrote Parallel Lives, his series of biographies of famous Greeks and Romans, in pairs: his famous biography of Alexander is paired with Julius Caesar.\n\nHowever, Plutarch’s reliability as a biographer is questionable. He lived 400 years after Alexander the Great and contemporary writings were scarce. Plutarch was also Greek and the Greeks saw Alexander as an “upstart barbarian”: firstly, because of historic snobbery (anyone non-Greek was considered a “barbarian”); and secondly, because the Greeks still resented the Macedonians who, under Alexander’s father, had conquered Greece through battles and diplomacy.\n\nPlutarch begins his biography by saying he’s not writing “history”, but rather “a life story”, because, he goes on to explain, it’s better to get to know a person from his character and his jokes than from endless battles fought and won. He pretends to glorify Alexander beyond reason, writing: “On his father’s side, he was descended from Hercules”. However, since Alexander himself had claimed the title of “son of Zeus”, Plutarch was definitely trying to take him down a peg.\n\nNevertheless, Plutarch’s biography does include some fascinating titbits of information, such as his claim that the battle of Gaugamela (the decisive battle Alexander the Great fought against Persia in 331 BC) was fought during an eclipse. He also describes how Alexander the Great spent the night before the battle in his tent with his diviner, Aristander, performing certain mysterious ceremonies and sacrificing to the god Fear.\n\nAlexander's the Great's favourite military tactic was the phalanx\n\nA relief depicting a Macedonian phalanx, Thessaloniki, Greece. (Photo by DeAgostini/Getty Images)\n\nThe phalanx – a rectangular mass military formation made up of closely ranked troops – was a formidable fighting machine. The spears used by soldiers in a phalanx were long – sometimes as long as five metres – and made of sharpened wood or metal-tipped wood. The tactic was perfected by Alexander’s father, Philip, who first learned of it after observing Greek armies.\n\nAccording to the Greek historian Arrian’s Anabasis written in the second century AD: “Alexander drew up his army in such a way that the depth of the phalanx was 120 men; and […] he ordered them to preserve silence, in order to receive the word of command quickly.”\n\nMacedonian author Polyaenus (in Stratagemata, also in the second century AD) says that Alexander spitefully made his men who had not fought bravely enough in battle wear the so-called hemithorakion – a half armour system that only covered the front part of the body. This punitive experiment made sure that the soldiers wouldn’t turn their backs on the enemy.\n\nHowever, in reality the soldiers in a phalanx would actually not require much armour – coordinated, fast movement was what made the phalanx so effective. Polyaenus describes the Macedonian infantrymen of the phalanx as being armed with helmets (kranos); light shields (pelte); greaves (knemides) and a long pike (sarissa) – notice that armour is conspicuously missing from this list.\n\nBut while Alexander the Great led one of the most successful armies of all time, surprisingly little is understood about the main type of body armour that both he and many of his men wore – the linothorax – as there are no surviving examples. The linothorax was a type of body armour created by laminating together layers of linen. It wrapped around the torso and tied over the shoulder with two flaps. The most famous image of this kind of body armour is the Alexander Mosaic: a celebrated ancient mosaic which was found in the largest house in Pompeii – the House of the Faun – and depicts Alexander the Great’s defeat of the Persian king Darius.\n\nAlexander the Great at the battle of Issus. He can be seen on the left of the mosaic from the House of Faun, with his opponent, Pesian king Darius III, on the right (Photo by: Werner Forman/Universal Images Group via Getty Images)\n\nWhen his friend Hephaestion, Alexander held a hugely expensive funeral\n\nHephaestion was a member of Alexander’s personal bodyguard and a general in his army. He was also Alexander’s best friend, right-hand man, and some say his lover as well. When he died suddenly in Ecbatana from unknown causes, Alexander wrote to the Oracle at Siwa in Egypt and asked if Hephaestion should be honoured as a god or a hero. The Oracle replied that he should be honoured as a hero, and so Alexander went all out for a mausoleum/funeral pyre designed to impress.\n\nThe Library of History, compiled by Diodorus Siculus, includes several accounts of the funeral pyre, of which there were seven levels – each level more lavishly decorated than the last.\n\nPerched upon the bottom layer of 240 golden prows of ships and held up by palm tree trunks, Siculus says, there were: “Torches fifteen cubits high with golden wreaths about their handles. At their flaming ends perched eagles with outspread wings looking downward, while about their bases were serpents looking up at the eagles, […] a multitude of wild animals being pursued by hunters, […] a centauromachy rendered in gold, while the fifth [level] showed lions and bulls alternating, also in gold. The next higher level was covered with Macedonian and Persian arms, testifying to the prowess of the one people and to the defeats of the other. On top of all stood Sirens, hollowed out and able to conceal within them persons who sang a lament in mourning for the dead. The total height of the pyre was more than one hundred and thirty cubits.”\n\nA cubit is an ancient measurement of length based on the distance from the elbow to the tip of the longest finger, so it varies. But the pyre, as described here, could have been more than 50 metres high. Alexander the Great plundered the treasuries of all his cities to pay for the monument – it has been estimated to have cost the modern equivalent of two billion dollars.\n\nAlexander the Great had made his seat of government in Babylon, the capital of Babylonia (the alluvial plain between the Euphrates and Tigris), and he wanted to hold the funeral ceremony within the walls of the city. However, the monument was so huge that Alexander had to break down one of the city’s walls to get it inside. He then set the monument on fire, cremating the general’s body along with the magnificent pyre.\n\nWhat is Alexander the Great's legacy?\n\nSpencer Day examines how Alexander left his mark on the lands he conquered...\n\nAccording to Plutarch, Alexander the Great founded 70 towns and cities, including at least 16 that he modestly named Alexandria.\n\nFor centuries, historians and military strategists alike have extolled Alexander’s genius as a soldier, and rightly so. But, for all that, perhaps his greatest impact on human history derives not from his brilliance as a commander but as a supreme cultural ambassador.\n\nAlexander didn’t simply wipe cities from the face of the Earth, before moving on to the next target – not all the time anyway. Instead, he left colonies of fellow Macedonians to administer conquered population centres, and they went about disseminating Greek methods of expression and thinking.\n\nAs a result, peoples from modern-day Turkey through Asia Minor all the way to India played Greek sports, watched Greek theatre, mimicked Greek art and adopted Greek scientific practices. In many cases, they continued to do so for centuries.\n\nThe cities of Ai Khanum in what is now Afghanistan and Philoteris in Egypt may have been separated by some 3,000 miles but they both boasted Greek gymnasiums. Ai Khanum was also home to an Acropolis, a theatre and library – a direct consequence of Alexander’s extraordinary conquests.\n\nAlexander’s incursion into India was brief and bloody, but its impact on the subcontinent’s culture was significant. It inspired the anthropomorphic representation of the Buddha in Indian sculpture and the appearance of Greek mythological figures, including Herakles, in Buddhist literature. It may even lie behind Indian astrologers’ adoption of the signs of the zodiac.\n\nIt seems that Alexander’s cultural impact may even have spread beyond the borders of his massive empire, perhaps seeping into China. The theorem of Pythagoras reached the Chinese within decades of Alexander’s death, and it’s thought that the Terracotta Army may have been influenced by Greek models.\n\nBut perhaps Alexander’s most enduring cultural legacy was the fact that, for a thousand years, Greek became the ‘lingua franca’ of the near east. As a result, when the Christian New Testament was first recorded, it was written down in Greek, the very language that Alexander had himself spoken hundreds of years earlier.\n\nAdvertisement\n\nThis article is curated from content first published by HistoryExtra, BBC History Revealed and BBC History Magazine\n\n"}, {"url": "https://thesecondachilles.com/2014/08/26/hephaestions-funeral/", "page_content": "Daily Diodorus\n\nVol. VIII. Book XVII Ch. 114, 115 (Loeb Classical Library)\n\nRead the other posts in this series here\n\nThe Headlines\n\nHephaestion’s Funeral Pyre Built\n\nCost Borne By Cities and Officials Alike\n\nAmmon: Hephaestion Should Be Worshipped\n\nThe Story\n\nChapter 114\n\nAlexander waited until he had finished dealing with the embassies before beginning the preparations for Hephaestion’s funeral. When he did, he ‘threw himself’ into the work with ‘such zeal’ that the funeral ‘not only surpassed all those previously celebrated on earth but also left no possibility for anything greater in later ages’.\n\nThe reason for Alexander’s effort was that he ‘had loved Hephaestion most’ of all his Friends. Diodorus notes that Craterus ‘had a rival claim’ to Alexander’s love and recounts how a companion had once said to the king that he loved Craterus no less than he did Hephaestion. To which, Alexander replied ‘that Craterus was king-loving, but Hephaestion was Alexander-loving’.\n\nDiodorus also recalls how, upon their first meeting after the Battle of Issus, Sisygambis, Darius III’s mother, mistook Hephaestion for Alexander and was ‘distressed’ after being told her mistake. The king, however, put her at ease, “Never mind, mother.” he said, “For actually he too is Alexander.”\n\n‘Hephaestion enjoyed so much power and freedom of speech’ as a result of his friendship with Alexander that he was not only able to weather Olympias’ biting tongue but put her in her place when writing back to her. “Stop quarrelling with us and do not be angry or menacing. If you persist, we shall not be much disturbed. You know that Alexander means more to us than anything.”\n\nHephaestion’s funeral had to be paid for. To ensure that it was, Alexander ordered every city in the region (Babylonia?) to contribute a sum according to their ability. He also proclaimed that the sacred fire in every Asian city should be quenched until the funeral was over.\n\nAccording to Persian custom, the sacred flame was only ever put out when the king himself died. Alexander’s order, therefore, was treated by Persians as a bad omen – a foretelling of his death. Diodorus notes that there were other signs that Alexander was near his end, which we will come to in chapter 116.\n\nChapter 115\n\nDiodorus tells how each of Alexander’s ‘generals and Friends [sought] to meet the king’s desires’ and make images of Hephaestion ‘in ivory and gold’ and other valuable materials. The Footnotes say that these ‘were probably medallions or small images to be worn in wreaths’.\n\nIn order to make Hephaestion’s funeral pyre, Alexander tore down one of Babylon’s walls ‘to a distance of ten furlongs’. He then levelled the space created using baked tiles. The pyre was ‘square in shape’, and ‘a furlong in length’ on every side.\n\nAlexander ‘divided up the area [of the pyre] into thirty compartments’. I assume this means the pyre comprised of thirty sections otherwise am not sure what he means. The roof of each section of the pyre was held up by palm tree trunks.\n\nOnce the pyre had been built, Alexander ‘decorated all the exterior walls’. Here is Diodorus’ description of them.\n\nGround (First) Level\n\n‘[G]olden prows of quinqueremes… two hundred and forty in all’ were placed here. Statues of ‘kneeling archers, four cubits in height’ were placed on the ships’ catheads, while ‘[a]rmed male figures five cubits high’ were positioned on the deck. Red felt banners filled the space between them.\n\nSecond Level\n\nTorches, fifteen cubits tall ‘with golden wreaths about their handles’ were placed here. On top of the torches were ‘eagles with outstretched wings looking downward’ – presumably at the snakes at the base of the torch, which were looking up.\n\nThird Level\n\nA carving of a ‘multitude of wild animals being pursued by hunters’.\n\nFourth Level\n\nA centauromachy, ‘rendered in gold’.\n\nFifth Level\n\nStatues of lions and bulls ‘alternating [and] also in gold’.\n\nSixth Level\n\nThis ‘was covered with Macedonian and Persian arms, testifying to the prowess of the one people and to the defeats of the other’.\n\nDiodorus states that on ‘top of all stood sirens, hollowed out and able to conceal within them persons who sang a lament in mourning for the dead’. I assume – hope – that these people were not on the pyre!\n\nThe pyre must have been huge. Diodorus says it was over 130 cubits in height – 191 feet according to this calculator. And what about the cost? Again, huge – in excess of 12,000 talents. Alexander had no trouble in paying for it, though, for as well as the special tax on the cities, ‘[a]ll of the generals… soldiers… envoys and even the natives rivalled one another in contributing to the magnificence of the funeral’.\n\nWhen all was done, Alexander issued a decree that Hephaestion should be sacrificed to ‘as god coadjutor’. Around the time he made this decree one of his Friends, a man named Philip, returned (from Siwah?) with a message – ‘a response’ – from Ammon: ‘Hephaestion should be worshipped as a god’. Pleased with this news, Alexander made the first sacrifice. Afterwards, he ‘entertained everybody handsomely’. The good times were here again, though they would not last.\n\nComments\n\nIs it significant that Alexander concluded his diplomatic work before beginning the preparations for Hephaestion’s funeral? I can’t decide if it was a form of displacement activity or an example of Alexander being a good ruler. Actually, now that I think about it, I expect he had no choice – he had to wait for the ships and statues to be built.\n\nAlexander’s response to Sisygambis recalls the quotation attributed to Aristotle (by, according to Wikipedia, Diogenes Laëtius) that “A single soul dwelling in two bodies”.\n\nNB: Diodorus covers Alexander’s meeting with Sisygambis in Chapter 37. If you would like to read my post on it, you can do so here.\n\nHephaestion’s use of the royal ‘we’ in his letter to Olympias is fascinating, but what does it mean? For all I know, that was how Macedonians in the fourth century B.C. wrote. If so, it would mean nothing. But if they didn’t, Hephaestion’s choice of words would say an awful lot about his character.\n\nA negative reading would be that his friendship with Alexander had made him proud and arrogant. A positive one would say it shows how intimate Hephaestion was with Alexander. They were not only one body but one voice, too.\n\nAccording to the CLIO History Journal, catheads are ‘large timbers projecting on either side of the prow, which also served as guards for the leading oars’.\n\nAccording to Ancient History,'”Centauromachy” refers to the battle between the Centaurs and Lapiths of the Peneus Valley, in Thessaly.’ Wikipedia adds that this tale typifies ‘the struggle between civilization and barbarism’.\n\nDiodorus makes no reference to Alexander actually asking Ammon whether or not he may worship Hephaestion as a god, though we know – from Arrian – that that is what happened.\n\nAmmon’s message is recorded differently by Plutarch and Arrian. According to the Footnotes, they confirmed that the god recommended that Hephaestion be ‘honoured as a hero’. Arrian adds that this was after Ammon refused ‘to allow [Hephaestion] divine worship’.\n\nIt’s interesting that Diodorus (main source: Cleitarchus who spoke to Macedonian soldiers) confirms that Ammon gave permission for Hephaestion to be ‘worshipped as a god’ (Possibly silly question: is this the same as him actually being deified?) while Arrian (main source: Ptolemy, Hephaestion’s fellow officer, and Aristobulos: a junior officer in Alexander’s army) says that Ammon refused to let this happen.\n\nWhy the discrepancy? I’m tempted to say that Ptolemy and/or Aristobulos, for whatever reason, did not want people to get too big a view of Hephaestion.\n\nUnfortunately, we are missing the portion of Curtius’ History of Alexander which covers the period of Hephaestion’s funeral. So, what does Plutarch say? First of all, he used Ptolemy, Aristobulos and Cleitarchus. Plutarch would have been aware, therefore, of the divergent traditions. In his Life of Alexander, he states that Ammon commanded Alexander ‘to honour Hephaestion and sacrifice to him as a hero’ (Penguin Classics 2011 para 72). No mention of god-worship. Should we privilege Plutarch’s account as he would have had no/less reason to suppress the truth in the way that Ptolemy and Aristobulos might have done?\n\nSpeaking of the truth, who’s to say that the Macedonian soldiers that Cleitarchus spoke to were speaking it?\n\nThis picture comes from and is the (C) of Andrew Chugg at alexanderstomb.com\n\nAlexander’s Agony Column\n\ni. O My King\n\nI am having difficulty accepting Hephaestion as a god, what should I do?\n\nYours,\n\nShy\n\nDear Shy\n\nDie.\n\nYours,\n\nAlexander\n\nii. O My King\n\nI was hoping you would help me. This is an agony column after all.\n\nYours,\n\nShy\n\nDear Shy\n\nIf I ever find out who you are I will cause you a great deal of agony.\n\nYours,\n\nAlexander\n\niii. O My King\n\nUnderstood. Am worshipping now.\n\nYours,\n\nEnlightened"}, {"url": "https://manchesterhistorian.com/2021/alexander-the-great-lgbt-icon-by-alexandra-birch/", "page_content": "This article will feature in Issue 38: Language and Culture\n\nAlexander III of Macedon (356 BC – 323 BC) is immortalised as one of history’s greatest generals for having never lost a battle and establishing a massive empire from the Balkans to the Indus River. His impact on history is immense: Alexander introduced the Persian idea of absolute monarchy to the Greco-Roman world, forever changing global governance. For such an influential figure, it should come as no surprise that historians have been interested in his personal life, notably his sex lif\n\nModern terminology that describes sexual identity is not appropriate for a historical figure when such ideas did not exist. To avoid anachronism, one must consider how the Greeks of the 300s BC viewed sex. Homosexual relations were ordinary amongst the upper classes, especially in the form of pederasty. Sexual orientation was not the defining factor in sex, rather the role that each participant played: the dominant, higher-class, older partner took an active role, and the younger, lower-class partner took a passive one. Nonetheless, homosexual men of the same class experienced social stigma as the passive role was more effeminate. As Macedonian king, Alexander could partake in sexual relations with anyone, so long as he maintained the dominant role.\n\nOne must examine the sparse remaining evidence about Alexander’s life to understand his sexuality. In his early years, he showed little interest in sexual relationships. Quintus Curtis stated that Alexander’s parents purchased a courtesan fearing that the young prince was γύννις, meaning ‘womanish’. As the two did not engage in sex ancient authors praised Alexander’s self-control whereas modern advocates, like James Davidson, use it as conformation of homosexuality. However, it is more reasonable to assume that teenage Alexander had not experienced sexual attraction yet.\n\nThe most contested individual for the title of Alexander’s lover is Hephaestion. Whilst never explicitly stated as Alexander’s lover – always referred to as his epithet Φιλαλέξανδρος (friend of Alexander) – several modern historians interpret the relationship as amorous, rather than platonic. Hephaestion secured high-ranking positions in the army and, in Troy, the two made sacrifices at the shrines of Achilles and Patroclus: two other likely lovers that suffered history’s homosexual erasure. Moreover, Alexander was mocked for abandoning imperial administration due to lusting after handsome Hephaestion’s thighs. These interactions strongly suggest the two were not merely friends.\n\nAfter Hephaestion’s sudden death in 324 BC, the grief-stricken Alexander mourned over the body and refused to depart until dragged away by his companions. The king ordered that the whole empire be plunged into a state of mourning; all music was banned and the statue of Asclepios, god of medicine, was demolished. Since mortals were supposed to respect the gods, Alexander’s subjects were deeply offended. This mark of poor governance demonstrated Alexander’s hysteria after the death of the one he loved the most.\n\nAlexander did engage in heterosexual relations and fathered at least one son. He married at least twice, first to Roxana in 327 BC and later to Stateira in 324 BC. Sources describe how Alexander instantly fell in love with Roxana’s beauty and wit, immediately desiring marriage.\n\nIn 324 BC, Alexander organised the Susa weddings – a mass wedding of Macedonian and Persian nobles to symbolically combine both cultures and consolidate Macedonian rule in the region. Alexander and Hephaestion married Stateira and Drypetis, Darius III’s daughters. Advocates for Alexander’s homosexuality argue that he yearned for children with his lover, Hephaestion, and utilised the Persian princesses as surrogates given that the men’s offspring would be cousins. Adversaries counterpoint that the marriage was merely a political gesture applauding Hephaestion for his services. It is unclear whether the Susa weddings are a political ceremony or a secret gay lovers’ union.\n\nThe idea of an LGBT or gay icon was created in the 20th century and is a person revered by the LGBT community for being a champion of LGBT rights and/or being a notorious LGBT person themselves.\n\nEmploying a broad definition, Alexander could be considered an LGBT icon for being a remarkable person that likely engaged in homosexual relationships. Yet, if all necessary modern criteria are applied, this may not be the case; Alexander did not further acceptance of homosexual relations between social classes. Furthermore, an LGBT icon should be a role model. By 21st century standards, Alexander was a war criminal who broke the Geneva Convention several times, including civilian murder, torture, and unnecessary civic destruction (although these military decisions were mild compared to his contemporaries). Nevertheless, our modern morality should not be imposed on Alexander as ethics change over time. It is destructive to view history through this moralistic lens because it is not an objective analysis and the mindset of the people of the past cannot be understood.\n\nSince the sexual revolution over half a century ago, Alexander’s sexual identity has been reclaimed by liberal Western communities as a gay hero. Whether he deserves this title or not, it is already bestowed upon him.\n\nUsing contemporary terminology, it is reasonable to assume that Alexander was bisexual. Historical evidence suggests that he experienced lust, and potentially love, towards both men and women. Is this enough to honour him with the title ‘LGBT Icon’? Though by our modern standards Alexander would be a tyrant, in the context of his time, he is an icon, and thus, if he is analysed relatively, Alexander thoroughly deserves our homage. This leaves us with the question, almost 2500 years later, would Alexander want to be our LGBT icon?\n\nBy Alexandra Birch"}]}