{"Hephaestion was the first to scale the walls of Tyre in 332 BC.": [{"url": "https://warwick.ac.uk/fac/arts/classics/warwickclassicsnetwork/stoa/anchist/gcse/alexander/teachersguide", "page_content": "Introduction and the developments of the Macedonia state and army under Philip (Suggested timing: 1 ½–2 hours) · Background to the rise of Macedon and familiarity with the geography of the areas covered in the depth study, most of which should be fairly familiar from the Persian period study. · Introduction to key (textual) ancient source authors: Arrian, Plutarch and Diodorus Siculus. · Alexander’s success built on the firm foundations laid down by Philip. Philip trained and organised a new army, at the same time ensuring the men swore loyalty to him rather than Macedonia. Philip made the traditional formation deeper so that his phalanx could exert greater force against an enemy. This required him to develop a longer spear; his men were from then on supplied with a five metre long lance known as a sarissa. · Philip abolished the monarchies of some of the northern tribal states and instead these former ruling elites joined the traditional Macedonian noble families as part of the Companions of the King. The sons of the tribal leaders were invited to Philip’s court to form a class of royal pages. They also acted as hostages ensuring the loyalty of their fathers. · Philip partook in a succession of politically strategic marriages. The marriages aimed to secure his borders by establishing better relations with Macedonia’s neighbours. For example, he married Olympias, the daughter of the king of the Epirus. · Philip’s developments in the Macedonia army · The weapons and armour of the Macedonia army · Philip’s methods for securing the Macedonia state\n\nAlexander’s birth and youth, and important events up to 336 BC (Suggested timing: 2 ½–3 hours) · Plutarch details episodes and stories that were connected to Alexander’s birth and youth. As Alexander became a heroic figure, legends quickly took hold of the historical record. o Plutarch outlines the stories told about Alexander’s conception and birth. The stories are a mix of contextualised folktale and propaganda, designed to imply the pre-determined nature of Alexander’s ascent to greatness. o The evidence concerning Alexander’s youth was selected to portray him as a boy marked out for success as well as to characterise him more generally. · In 338 Philip moved into central Greece looking to fight a decisive battle against Thebes and Athens. He was seeking to emerge as the most powerful man in Greece. The battle took place at Chaeronea. · Philip married a Macedonian called Cleopatra – a niece of Attalus. At the wedding Alexander fell out with his father in an argument incited by Attalus. Alexander and Olympias left Macedonia, although Philip recalled Alexander the following year. · In 337 Philip established a council of Greek states known as the League of Corinth. Philip was elected its leader or hegemon. As hegemon, Philip was handed the responsibility of invading Persia in the name of Greece. In reality, he handed this responsibility to himself as it is far from clear that the Greek city-states shared his enthusiasm for avenging Xerxes’ invasion. · In spring 336 Parmenio and Attalus were sent to Asia in charge of an advance party. Plutarch, The Life of Alexander 2–3 and 6–9 · The nature of the evidence on Alexander’s birth and youth · Alexander’s character as revealed at key moments prior to becoming king · Greeks views of Philip and Macedonia · Philip’s policy towards the Greek city-states · The significance of Philip marrying Cleopatra · The reason for Philip and Alexander’s falling out in 338/337 · Alexander’s relationship with Philip · The character and influence of Olympias\n\nThe murder of Philip October 336 BC (Suggested timing: 1 ½–2 hours) · Cleopatra Eurydice may have given birth to a son to compliment the daughter she had already had with Philip. Alexander and Olympias’ position was possibly now in even greater danger. · Philip and Olympias’ daughter (who was also called Cleopatra) married Alexander of Epirus. Alexander of Epirus was both Olympias’ brother and King of Epirus. This union would have weakened Olympias’ position further in that she was no longer Philip’s main link with the neighbouring state of Epirus. · The wedding celebrations were attended by a significant number of Greeks as well as Macedonians. Olympias was not present. · The day after the wedding ceremony Philip was murdered. The situation of the assassin Pausanias does not seem enough of a motive on its own. He was angry with Philip for not punishing Attalus, yet he could, as a bodyguard, have more easily murdered Philip elsewhere. Olympias (and Alexander) could have influenced Pausanias, although Alexander later claimed the Persians had bribed the murderer. Diodorus, Library of History 16.91–94 · The reasons for Philip to marry his daughter to her uncle · The reasons for Philip’s murder\n\nAlexander consolidating his position and the initial reasons for the expedition against Persia (Suggested timing: 1 hour) · On the murder of his father, Alexander launched a purge of possible rivals for the throne. Attalus was executed on Alexander’s instructions and with Parmenio’s help. · Alexander travelled to Corinth where, like his father, he was appointed hegemon of Greece. The position carried the authority to wage war on Persia on behalf of the League of Corinth. · Alexander then turned his attention towards Greece where Thebes and Athens were in rebellion. Theban exiles had returned to their city to foment rebellion. Alexander captured Thebes and massacred many of its inhabitants. · Alexander invaded Persia for a host of interconnected reasons that should be analysed and attributed due weight. · Darius III, the new king of Persia, was in a weak position. He was not from the principal royal line and had gained power after a series of coups. · The ways Alexander secured power · The reasons for Alexander’s Persian expedition\n\nAlexander in Asia-Minor (Suggested timing: 4–4 ½ hours) · Antipaer was left in charge of Greece by Alexander. · In 334 Alexander crossed the Hellespont with his army and made a detour to Troy. Alexander was said to have laid a wreath on the tomb of Achilles and taken sacred weapons dating from the time of the Trojan War. Arrian, The Campaigns of Alexander 1.11–12 · The significance of Alexander’s visit to Troy · Alexander’s relationship with his companions (Hephaestion)\n\nBattle at the River Granicus (May 334 BC) · An army led by the Persian satraps of Asia-Minor and Memnon was waiting for Alexander at the River Granicus. Alexander fought bravely during the battle, leading a Companion Cavalry charge at Mithridates (Darius’ son-in-law). At this point Cleitus saved his life. Alexander showed particular contempt for the Greek mercenaries opposing him: his army was instructed to show them no mercy and those who survived were classed as traitors and enslaved to the mines of Macedon. Alexander sent Persian armour back to Athens to show the Athenians what he had achieved. Arrian, The Campaigns of Alexander 1.13–16 · The use of cavalry, the phalanx and other troops · The nature and aims of Arrian · The nature of the evidence regarding the Battle of Granicus\n\n· After the Battle at the River Granicus, the city of Sardis surrendered to Alexander. Alexander also takes control of Ephesus and Miletus. · Unable to match the Persians at sea, Alexander’s fleet was becoming a financial liability: it was disbanded. · Alexander moved down the coast and besieged Halicarnassus. · Alexander sent the younger men in his army home for the winter to be with their wives. He and Parmenio split the rest of the army to better deal with other pockets of resistance.\n\nAlexander at Gordium · Alexander’s forces reconvened at Gordium in the spring of 333. The cutting of the Gordian knot was symbolic: Alexander was signalling his greater vision for the expedition. Cutting the knot was also important for propaganda reasons: it encouraged the soldiers by making them believe they were destined to take over Asia as the prophecy foretold. Arrian, The Campaigns of Alexander 2.3 · What does Arrian’s account of the legend of the Gordium knot reveal about the nature of ancient historical writing? · Alexander’s character\n\nThe Battle of Issus (November 333 BC) · At the Battle of Issus Alexander faced a much larger Persian army across a river. The steep banks of the River Issus provided a dangerous obstacle for Alexander’s phalanx. However, Alexander led a strong cavalry charge that forced Darius to flee. Darius got away but Alexander captured his family. Alexander sarcophagus Mosaic from the House of the Faun in Pompeii · The tactics used in the main battles\n\nAlexander in Phoenicia and Egypt (Suggested timing: 1 ½–2 hours) · Parmenio was sent with a detachment to Damascus where he took possession of vast amounts of Darius’ wealth. · Darius, having suffered a significant defeat, offered to make peace as Alexander marched down the Phoenician coast. Alexander replied demanding to be recognised as King of Asia. · Alexander was determined that all cities should submit to him. The Phoenician cities had to be forced to submit as the Persians could not be allowed to possess bases for their fleet and thus continue controlling the seas and trade routes. Alexander had disbanded his fleet while at Halicarnassus (for financial reasons) and so an active Persian fleet may have disrupted his plans.\n\nSiege of Tyre (January–July 332 BC) · Chief among the Phoenician cities was Tyre. Situated on an island half a mile out to sea, the Babylonians, among others, had previously tried and failed to take the city. Alexander convinced his men that his ancestor Heracles had visited him in a dream and demanded that he worship in the Temple of Heracles in Tyre. More prosaically, he was determined to prevent the Persians from using the Phoenician ports to shift the war over to Greece where their allies the Spartans were fomenting unrest. Arrian, The Campaigns of Alexander 2.24 · the main events of the siege of Tyre · Alexander’s character and leadership as revealed by his actions during the final capture of Tyre\n\n· The Tyrians taunted the Macedonians from their walls saying Alexander would never capture the city. Attempts at negotiation failed when the Tyrians threw some of Alexander’s men from the city wall. Alexander built a mole across the sea in order to use his siege engines against the city’s walls. The Tyrians shot arrows at his men from both their walls and their triremes. The Tyrians then burnt his mole using a fire ship. Increasingly determined, Alexander built a wider mole. Alexander had forecast that, due to his recent victory at Issus, other Phoenician cities would switch allegiance. This hope was realised when the newly conquered Sidon willingly sent ships to pin the Tyrians in their harbours. The Tyrians could no longer sally out to attack the new mole and neither could they import supplies into the city. Yet even then Tyre’s landside walls proved too strong. Alexander used his new fleet to sail round to a weaker part of the wall. He put his siege engines on rafts anchored to the seabed. In desperation the Tyrians sent divers to cut the anchor ropes and threw hot sand on Alexander’s men from their walls. Alexander replaced the anchor ropes with metal chains. After the failure of a desperate Tyrian naval attack, Alexander’s siege engines smashed a gap in the wall and a detachment of shield-bearers was ordered to exploit it. After their leader was killed, Alexander and his Companions took over the attack. 8,000 Tyrians were massacred.\n\nAlexander in Egypt · Instead of heading into the Persian heartland, Alexander moved into Egypt. While his men were founding Alexandria, Alexander travelled hundreds of miles into the desert to the oracle that was located at the oasis that is now modern-day Siwa. · The importance of foundation cities · Alexander’s beliefs\n\nThe Battle of Gaugamela (Suggested timing: 2 ½–3 hours) Battle of Gaugamela (October 331 BC) · Darius had amassed a large army; Alexander realised his smaller army could easily be outflanked and attacked on its weak sides and rear. Therefore Alexander stationed infantry in the midst of his cavalry to strengthen his flanks. The infantry would surprise Darius’ cavalry. The soldiers on each side of the phalanx could also move back like flaps to prevent being outflanked. Alexander’s plan was to move right so that Darius would initiate action to prevent the battle moving off the ground he had prepared for his chariots. It was hoped that Darius would advance his cavalry on the left in an attempt to outflank Alexander’s right and stop the Macedonians moving further to the right. Alexander hoped that this would create a gap in the Persian line through which he could lead a Companion Cavalry charge at Darius. The Persians had too many men to attempt anything else – Alexander therefore had to win the battle in a decisive move against Darius. The plan generally worked as envisaged and Darius was forced to flee the battle. The ancient sources say Parmenio was struggling to hold the left-flank and had to ask for assistance. The implication is that this request prevented Alexander from capturing Darius and gaining a full victory. Plutarch, The Life of Alexander 31–33 Arrian, The Campaigns of Alexander 3.9–15 Babylonian Astronomical Diary tablet mentioning Gaugamela · Reasons for Alexander’s victory · The use of cavalry, the phalanx and other troops · What does Plutarch’s account of the battle reveal about his priorities as a writer? · The nature of the evidence for the Battle of Gaugamela\n\n· After the battle Alexander’s army moved to Babylon where the soldiers were allowed to rest and recuperate; many Babylonians welcomed Alexander as the Egyptians had done. · Antipater, who had been left in charge of Macedon, beat King Agis of Sparta in a battle at Megalopolis. Agis had sought to destroy Macedon’s pre-eminent position in Greece and had been liaising with the Persians.\n\nThe Battle of the Persian Gates and Alexander’s visit to Persepolis (Suggested timing: 1 ½ –2 hours) Battle of the Persian Gates (January 330 BC) · Alexander moved on to the Persian capital at Persepolis after fighting his way through the mountain pass known as the Persian Gates. Meanwhile Parmenio was charged with leading the other half of the army on a more circuitous, less mountainous, route to Persepolis. Arrian, The Campaigns of Alexander 3.18 · the events of the Persian Gates · Alexander’s character as revealed by the events at Persepolis · The reasons for the burning of the Palace at Persepolis · The nature of the sources regarding Alexander’s visit to Persepolis\n\nAlexander in Persepolis · Arrian says that Alexander set fire to the palace to avenge Xerxes’ destruction of Athens 150 years earlier however Plutarch gives another story where Thais, Ptolemy’s mistress, encourages Alexander to burn down the palace. · At this juncture Alexander changed the terms of service of his Greek soldiers in a move that perhaps signalled that he felt the revenge mission had finally been completed. Arrian, The Campaigns of Alexander 3.18.10–3.18.12 Plutarch, The Life of Alexander 38\n\nThe pursuits of Darius and Bessus (Suggested timing: 1 ½–2 hour) · Alexander marched to Ecbatana and left Parmenio there with a lot of the Persian treasure. · Alexander chased Darius down. Darius was eventually betrayed by his own men and held captive. In July 330 BC he was killed when Alexander’s troops attacked the camp where Darius was being held. Alexander gave Darius a state funeral at Persepolis. · Bessus proclaimed himself Great King – Artaxerxes V. Alexander would not stand for this and needed to avenge the death of Darius. Many of Alexander’s men, no doubt, thought that the death of Darius would mean the end of the fighting and a return to Macedonia. · The impact of Darius’ death on the nature of Alexander’s campaign · Alexander’s character\n\nAlexander’s adoption of Persian customs · Immediately after the death of Darius, Alexander started to adopt some aspects of Persian dress. · The first complaints about Alexander’s behaviour were voiced soon after. Silver tetradrachm minted by Ptolemy I Silver tetradrachm minted by Lysimachus · Reasons for Alexander’s adoption of Persian customs\n\nThe conspiracy of/against Philotas (October 330 BC) · Philotas boasted to his mistress that Alexander’s victories were really due to him and his father Parmenio. · Some pages asked Philotas, Parmenio’s son, to arrange an audience with Alexander for them. Philotas twice turned down their request. As their information was important the pages therefore found another way of speaking to the King. It transpired that other pages were plotting against the King’s life. The plotters were dealt with but Alexander was furious that he had not been warned earlier. There was a suspicion, if no actual proof, that Philotas may have been involved. Alexander executed Philotas, sealed the camp to prevent information leaking out, and then sent an urgent message to Ecbatana instructing that Parmenio be killed in case the old general led a rebellion in an act of revenge. · Alexander split Philotas’ sole command of the Companion Cavalry in two: between Cleitus and Hephaestion. · Alexander’s relationship with his companions and his army (Phitotas and Parmenio)\n\nPursuit of Bessus · In the spring of 329, Alexander crossed the Hindu Kush into Bactria in pursuit of Bessus. The crossing was a feat of determination, stubbornness and organisation given that Alexander was leading such a large force. · In the summer of 329, Bessus was captured and mutilated, the customary Persian punishment for those who committed treason.\n\nAlexander in Bactria and Sogdiana. The murder of Cleitus and the opposition of Callisthenes (Suggested timing: 2 ½–3 hours) The death of Cleitus (328 BC) · Alexander’s enemies now employed guerrilla warfare tactics against him; his army was forced to split up to hunt out the different groups of fighters who attacked them. Not all the Macedonian leaders enjoyed success in the battles that followed and one night a singer began to mock those who had suffered defeat. Alexander encouraged the singer to continue despite Macedonian protests. Everybody was drunk and worn out after the fighting. An argument began in which Alexander stabbed Cleitus to death and then immediately regretted it. Plutarch, The Life of Alexander 50–51 Arrian, The Campaigns of Alexander 4.8–4.9.8 · The reasons for Cleitus’ argument with Alexander · Alexander’s character and his relationship with his men\n\n· In the spring of 327 Alexander sent men with climbing experience to storm a stronghold known as the Sogdian Rock. The Sogdians were said to have claimed their position unassailable, which, if Arrian is to be believed, fired Alexander’s determination to capture it even more.\n\n· Alexander then married a noble girl called Roxane who had been taken prisoner on the Sogdian Rock. It was, despite Arrian’s views to the contrary, most likely a politically inspired union in that her father, Oxyartes, was a leading tribal chief in Sogdiana.\n\nCallisthenes’ opposition and removal in the Pages’ Conspiracy · Callisthenes argued with Alexander over the issue of whether Greeks and Macedonians should perform obeisance (proskynesis) before the King. It seems that Alexander was encouraged to organise a stage-managed event in which the ritual would be trialled; we don’t hear of it being demanded again. It may have been in this context that the Greek Callisthenes spoke out powerfully against Alexander’s growing preference for the custom. Callisthenes is portrayed as having put forward a powerful case suggesting that in freedom lays strength, and that some honours were only fit for gods and not men. The subtext of Callisthenes’ argument was that previous kings had failed to benefit from receiving proskynesis: free peoples had defeated all of them. · Callisthenes was soon dead. He was either executed or died in prison after being accused of involvement in another plot against Alexander – the so-called ‘Pages’ Conspiracy.’ It is unlikely he was involved but the episode could possibly be interpreted as an example of Alexander’s vindictiveness and paranoia. The plot to murder Alexander in his sleep had been triggered when he overreacted to the actions of a page. The plot failed and its existence was revealed the next day. The pages were tortured until all the conspirators were unmasked. Callisthenes was their teacher and Alexander, having already argued with the Greek historian, appeared keen to implicate him in the affair. Arrian, The Campaigns of Alexander 4.9.9–4.12 · The reasons for Callisthenes’ opposition to Alexander · The degree of disapproval at Alexander’s adoption of Persian customs\n\nAlexander in India (Suggested timing: 2 hours) The siege of the Aornos Rock (April 326 BC) · Alexander took up the challenge of capturing the Aornus Rock. Alexander’s vigorous assault on this high mountain stronghold was perhaps motivated by a story that even Heracles had failed to take it. Ptolemy, making use of local guides, was tasked with leading an advanced force to secure a position from which to attack the main Indian stronghold. Ptolemy completed this difficult mission and Alexander was able to lead the main army up the mountain to join him. After laying siege to the mountaintop, Alexander ordered a ravine to be bridged so that his war engines could be brought within range of the Indian defences. The rock was captured after an intense assault followed by the false promise of a peace treaty. Many of those who had resisted Alexander were either massacred or fell to their deaths attempting to escape. Arrian, The Campaigns of Alexander 4.28–30 Silver tetradrachm minted by Ptolemy I · the methods Alexander used to capture the Aornus Rock\n\nThe campaign against Porus · One Indian leader who offered significant resistance was Porus. Alexander admired how Porus had fought until all hope was lost and so the Indian was allowed to retain his kingdom – but only as a satrap – in return for his loyalty and help in subduing other pockets of resistance. · Bucephalas died after the battle and in response Alexander founded a city in the name of his most trusted horse. Populated by a mix of local people and soldiers no longer fit for battle, the culture in each foundation was said to have been Greco-Macedonian in nature. Most of the foundations were garrison towns designed to leave a permanent military presence in areas where it was felt that rebellions might surface in the future. The inhabitants, often veterans and others loyal to Alexander, were meant to be a socialising force. · Alexander’s character · The nature and role of Alexander’s foundation cities · the Indus Valley campaign and what it reveals about Alexander’s abilities and character\n\nMutiny at the River Hyphasis (Summer 326 BC) · The Macedonians received reports that they were still a long way from the Great Ocean and that they would have to fight armies with thousands of elephants to get there. This news, along, no doubt, with the rain, mud, snakes, insects and proliferation of illness within the camp, eventually resulted in a mutiny at the River Hyphasis. Alexander couldn’t change the men’s minds; to save face he declared the omens were bad and ordered the army turn back. · the Indus Valley campaign and what it reveals about Alexander’s aims, and relationships with his men\n\nThe difficulties encountered on the return to Babylon. The mass marriages at Susa (Suggested timing: 1 ½–2 hours) The march through the Gedrosian Desert · Alexander made the decision to march through the Gedrosian Desert, thousands of soldiers and camp followers died. Alexander’s veterans survived because, led by Craterus, they took a different route avoiding the desert. Arrian, The Campaigns of Alexander 7.4.1–7.4.3 · Why might Alexander have decided to march through the Gedrosian Desert? · Alexander’s relationship with his army and satraps\n\n· Emerging from the desert, Alexander found his empire to be in a state of unrest; there had been rumours that he had died in the east. Alexander acted decisively, punishing the offending satraps to restore order. A further purge of satraps took place once Alexander reached Susa.\n\nThe mass marriages at Susa · Alexander held a mass marriage ceremony for his Companions at Susa. Alexander married into two lines of the Persian royal clan. Arrian, The Campaigns of Alexander 7.4.4–7.4.7 · The reasons behind the mass marriages at Susa\n\nThe mutiny at Opis · At Opis Alexander faced another mutiny when he attempted to decommission his veteran soldiers who were no longer fit to serve. His soldiers, including those he was decommissioning, were angered that they were to be replaced by the Epigonoi — 30,000 young Persians who had been trained and armed in the Macedonian manner. · Alexander’s relationship with his army\n\n· His army newly reinforced by the Epigonoi, Alexander was now less reliant on his veterans than he had been at the Hyphasis. He executed thirteen men he considered to be the ringleaders of the mutiny and threatened to send all the Macedonian rebels in his army home without pay. The Macedonians pleaded with Alexander and he let them off while promising to view them all as his kinsmen. · 10,000 veterans, including those who had married their oriental partners were discharged and ordered back to Macedonia. Their offspring by the oriental women were required to be left behind.\n\n· In Macedon, Olympias and Antipater were at loggerheads. When Alexander sent the 10,000 veterans back to Macedon, Antipater was sent a request to bring out fresh Macedonia troops, potentially as a way to prevent his dispute with Olympias from turning nasty.\n\nHephaestion and Alexander’s deaths (Suggested timing: 2 ½ hours) Death of Hephaestion (324 BC) · Alexander travelled to Ecbatana where Hephaestion died following a short illness. As Alexander’s favourite, Hephaestion had become increasingly unpopular. Alexander was naturally very upset given the closeness of his relationship with Hephaestion. He sent messengers to Siwa to see whether Hephaestion should be worshipped as a god. The oracle refused his request and so Alexander had to content himself with declaring Hephaestion a hero to whom sacrifices should be directed. Arrian, The Campaigns of Alexander 7.14 · The impact of Hephaestion’s death on Alexander · Alexander’s character and his relationship with his men\n\nDeath of Alexander (323 BC) · Alexander returned to Babylon but did not immediately enter the city because of troubling oracles. Alexander suspected the Chaldaeans had dreamt up the oracles to further their own interests, yet he remained wary and held off entering the city. · Alexander spent the remainder of the spring planning an expedition against the Arabians. Despite this apparent burst of activity, the sources continue to paint Alexander as paranoid, overly superstitious and too harsh. · After a period of illness, during which he continued to drink heavily, Alexander died. Whether he died from an accumulation of natural causes, or was the victim of a conspiracy, has long been a subject of debate. Prime candidates for conspiracy theorists are Antipater and his family. Plutarch, The Life of Alexander 73–77 Arrian, The Campaigns of Alexander 7.24–26 · The state of Alexander’s relationship with his companions (Antipater [74] and his sons) · Alexander’s state of mind during this period · The cause and nature of Alexander’s death"}, {"url": "https://www.britannica.com/place/Tyre", "page_content": "Tyre, modern Arabic Ṣūr, French Tyr or Sour, Latin Tyrus, Hebrew Zor or Tsor, town on the Mediterranean coast of southern Lebanon, located 12 miles (19 km) north of the modern border with Israel and 25 miles (40 km) south of Sidon (modern Ṣaydā). It was a major Phoenician seaport from about 2000 bce through the Roman period.\n\nTyre, built on an island and on the neighbouring mainland, was probably originally founded as a colony of Sidon. Mentioned in Egyptian records of the 14th century bce as being subject to Egypt, Tyre became independent when Egyptian influence in Phoenicia declined. It later surpassed Sidon as a trade centre, developing commercial relations with all parts of the Mediterranean world. In the 9th century bce colonists from Tyre founded the North African city of Carthage, which later became Rome’s principal rival in the West. The town is frequently mentioned in the Bible (Old and New Testaments) as having had close ties with Israel. Hiram, king of Tyre (reigned 969–936), furnished building materials for Solomon’s Temple in Jerusalem (10th century), and the notorious Jezebel, wife of King Ahab, was the daughter of Ethbaal, “king of Tyre and Sidon.” In the 10th and 9th centuries Tyre probably enjoyed some primacy over the other cities of Phoenicia and was ruled by kings whose power was limited by a merchant oligarchy.\n\nFor much of the 8th and 7th centuries bce the town was subject to Assyria, and in 585–573 it successfully withstood a prolonged siege by the Babylonian king Nebuchadrezzar II. Between 538 and 332 it was ruled by the Achaemenian kings of Persia. In this period it lost its hegemony in Phoenicia but continued to flourish. Probably the best-known episode in the history of Tyre was its resistance to the army of the Macedonian conqueror Alexander the Great, who took it after a seven-month siege in 332. He completely destroyed the mainland portion of the town and used its rubble to build an immense causeway (some 2,600 feet [800 metres] long and 600–900 feet [180–270 metres] wide) to gain access to the island section. After the town’s capture, 10,000 inhabitants were put to death, and 30,000 were sold into slavery. Alexander’s causeway, which was never removed, converted the island into a peninsula.\n\nTyre was subsequently under the influence of Ptolemaic Egypt and in 200 became part of the Hellenistic Seleucid kingdom. It came under Roman rule in 64 bce and was renowned in Roman times for its textiles and for a purple dye extracted from sea snails of the genus Murex (the dye was said to be worth more than its weight in gold, and purple cloth became a symbol of wealth and of royalty). By the 2nd century ce it had a sizable Christian community, and the Christian scholar Origen was buried there (c. 254). Tyre was under Muslim rule from 638 to 1124, when it fell to the Crusaders, and until the 13th century it was a principal town of the kingdom of Jerusalem. The Holy Roman emperor Frederick I Barbarossa, who died on the Third Crusade, was buried in its 12th-century cathedral. Captured and destroyed by the Muslim Mamlūks in 1291, the town never recovered its former importance.\n\nExcavations have uncovered remains of the Greco-Roman, Crusader, Arab, and Byzantine civilizations, but most of the remains of the Phoenician period lie beneath the present town. Areas of archaeological note include the ruins of a Crusader church, a street with a 2nd-century mosaic pavement and a double colonnade of white green-veined marble, Roman baths, the ruins of a Roman-Byzantine necropolis, and the largest Roman hippodrome ever discovered. Built in the 2nd century, the hippodrome hosted chariot races with a capacity of 20,000 spectators.\n\nIn 1984 UNESCO designated the historic town a World Heritage site. In the late 20th century the ruins were damaged by bombardment, most notably in 1982 and 1996 during Israeli offensives in southern Lebanon. The site is threatened by urban growth, looting, and the decay of stone because of airborne pollution. In 1998 UNESCO created a special fund for the preservation and archaeological excavation of the ancient treasures of Tyre.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThe economy of the town was upset by the unrest of the late 20th century. Fishing remains a major source of income. Pop. (2003 est.) 117,100."}, {"url": "https://www.worldhistory.org/article/107/alexanders-siege-of-tyre-332-bce/", "page_content": "After defeating Darius III at the battle of Issus in November 333 BCE, Alexander marched his army (about 35,000-40,000 strong) into Phoenicia, where he received the capitulation of Byblus and Sidon. Tyrian envoys met with Alexander whilst he was on the march, declaring their intent to honour his wishes.\n\nCauses of the Siege\n\nAlexander's request was simple: he wished to sacrifice to Heracles in Tyre. (The Phoenician god Melqart was roughly the equivalent of the Greek Heracles.) The Tyrian's recognised this as a Macedonian ploy to occupy the city and refused, saying instead that Alexander was welcome to sacrifice to Heracles in old Tyre, which was built upon the mainland. Old Tyre held no strategic importance - it was undefended and the Tyrian navy was stationed in the harbours of new Tyre.\n\nRemove Ads Advertisement\n\nThe Tyrian refusal to capitulate to Alexander's wishes was tantamount to a declaration of war. But, despite the youthful Alexander's growing reputation, the Tyrians had every reason to be confident. In addition to a powerful navy and mercenary army, their city lay roughly half a mile (0.8 km) offshore, and, according to the account of the historian Arrian, the walls facing the landward side towered to an impressive 150 ft (46m) in height. Whether they actually stood that high is doubtful and open to debate, but even so, the defences of Tyre were formidable and had withstood a number of mighty sieges in the past. The Tyrians began their preparations and evacuated most of the women and children to their colony at Carthage, leaving behind perhaps 40,000 people. Carthage also promised to send more ships and soldiers.\n\nAlexander was aware of Tyre's supposed impregnability and convened a council of war, explaining to his generals the vital importance of securing all Phoenician cities before advancing on Egypt. Tyre was a stronghold for the Persian fleet and could not be left behind to threaten Alexander's rear. In a last-ditch attempt to prevent a long and exhaustive siege, he despatched heralds to Tyre demanding their surrender, but the Macedonian's were executed and their bodies hurled into the sea.\n\nRemove Ads Advertisement\n\nSiege of Tyre The Department of History, United States Military Academy (Public Domain)\n\nOpening moves of the siege\n\nNegotiations having failed, Alexander began his operations in January 332 BCE. After occupying old Tyre, he began to construct a causeway (or mole) across the channel toward the walls of Tyre, using rocks, timbers, and rubble taken from the buildings of the old city. Initially, work progressed well: the water near the mainland was shallow and the bottom muddy, but, as the causeway lengthened, the Macedonians and Greeks began to run into trouble. The seafloor shelved sharply near the city, to a depth of 18 ft (5.5m). Work slowed to snail-pace, and the work gangs found themselves increasingly harassed by missile fire from the city walls.\n\nAlexander constructed two siege towers from timber covered with rawhide & positioned them at the end of a causeway he had built.\n\nAlexander constructed two siege towers from timber covered with rawhide and positioned them at the end of the causeway. Artillery engines at the top of these towers were able to return fire at the walls, and the work gangs erected timber palisades as an added measure of protection. Work proceeded, and Alexander spent much of his time on the mole, dispensing small gifts of money to his sweating labourers and leading by personal example.\n\nLove History? Sign up for our free weekly email newsletter!\n\nThe Tyrians then initiated their first major defensive action of the siege. They took an old horse transport ship and filled it to the gunwales with combustible material: chaff, torches, pitch and sulphur. They slung double yardarms from the mast, and to these hooked cauldrons filled with a volatile inflammable oil. The stern of the ship was ballasted to lift the bows clear of the water, and two galleys towed her in towards the end of the mole, driving her and themselves aground.\n\nThe crews lit the materials aboard the fireship and all managed to swim to safety. The tip of the mole became an inferno as the ship burnt, igniting the two towers. A host of Tyrians in small boats rowed out from the city and landed on various points of the causeway, engaging the besiegers as they frantically attempted to douse the flames. Siege engines were burnt and the palisades along the edge of the mole destroyed.\n\nAlexander musters his fleet\n\nThe attack was a great success for the Tyrians, but they had reckoned without the resolve of Alexander, who now ordered the causeway to be widened and more towers built. Realising that naval superiority was the key to taking Tyre, he temporarily left the siege and set off for Sidon to fetch his own ships. In addition, he also received vessels from Byblus, Aradus, Rhodes, Lycia, Cilicia and Macedon. The Kings of Cyprus sent another 120 ships to Sidon. In all, Alexander now had roughly 220 ships.\n\nRemove Ads Advertisement\n\nWhilst awaiting the arrival of the various naval contingents he spent 10 days inland, engaging in minor operations in Arabian territory. Upon his return to Sidon, he was pleased to note the arrival of Cleander, whom he had sent to Greece to recruit soldiers, with 4,000 mercenaries.\n\nWasting no further time, Alexander sailed for Tyre. His flagship was on the right of the fleet, and when within clear view of Tyre the fleet halted and held station, allowing the full impact of their appearance to dawn on the observers on the city walls. The Tyrians were taken by surprise: they had no idea until that moment that Alexander's fleet had swollen in size. They were now vastly outnumbered, and the promised help from Carthage had failed to materialise.\n\nAlexander as Ammon-Zeus Mark Cartwright (CC BY-NC-SA)\n\nAgainst such odds, a naval engagment was out of the question, and all the Tyrians could do was blockade the entrances to their two harbours. They floated a boom across the mouth of the southern, or Egyptian harbour, and moored Triremes in line across the entrance of the northern (Sidon) harbour.\n\nRemove Ads Advertisement\n\nAlexander tested the strength of these countermeasures with an assault on the Sidon harbour, in which 3 Tyrian galleys were rammed head-on and sunk, but he did not launch an all-out naval attack. Instead, he ordered his Cyprian contingent to blockade the northern harbour, and the Phoenician ships maintained a vigil at the southern end of the island. Siege engines were mounted on the mole, and on anchored ships, and commenced a sustained bombardment of the defences.\n\nAlexander was unable to get his ships close to the city itself because the Tyrians had hurled massive rocks into the sea beneath the walls. The siege now entered what was possibly its most laborious and dangerous phase.\n\nAlexander's ships lassoed some of the boulders and towed them away from the walls. In response, the Tyrians clad some of their galleys in armour plating and sallied out to cut the anchor cables of the besieging ships. Alexander armoured some of his own vessels and used them as a screen in front of his siege ships, but Tyrian divers continued to cut the cables of anchored ships. Alexander finally solved the problem by replacing rope cables with chains. More boulders were lassoed from the causeway and hoisted clear with cranes.\n\nRemove Ads Advertisement\n\nThroughout all of these operations, both sides engaged in a long and bitter artillery duel, and the Tyrians poured cauldrons of red-hot sand over the walls onto the besieging ships. Carried by the wind, it set vessels alight and penetrated clothing and armour, reducing men to charred, blistered agony. Although effective, such methods could hardly have endeared the defenders to the besiegers.\n\nRealising their imminent danger, the Tyrians spread sails across the mouth of the northern harbour, and, thus concealed, prepared a sortie. Thirteen galleys were manned with the finest oarsmen and marines the defenders could muster, and in the heat of the mediterranean afternoon they silently rowed out of the harbour in a single line. Most of the Cyprian ships blockading the Sidon harbour were undermanned and the Tyrians achieved total surprise, pressing home a ferocious assault to the accompaniment of roared warcries. Two Cyprian ships were sunk and many more scattered.\n\nGreek Hoplites [Artist's Impression] The Creative Assembly (Copyright)\n\nAlexander boarded a ship and personally led the counterattack with 5 Triremes and whatever Quinquiremes were ready for battle. Sailing around the island, he fell on the Tyrian flotilla, who immediately broke off their engagement and fled for the northern harbour. An unspecified number of Tyrian ships were damaged in the confused action which followed, with two galleys being captured at the mouth of the harbour. Most of the Tyrians managed to swim ashore to the safety of the city.\n\nThe Final Assault\n\nAlexander now brought his ships directly beneath the walls and began to pound them with battering rams. Greek forces at the northern end of the island attempted to make a breach but failed. A small breach was made in the southern defences but a Macedonian attack across causeways resulted only in casualties and failure.\n\nAlexander waited for three days before resuming his assault. Whilst diversionary attacks occupied the defenders attention, two ships with bridging equipment approached the southern breach. Alexander himself was in command of this force, which consisted mostly of elite hypaspists and pezhaitoroi. The Macedonians managed to force their way onto the wall: Admetus, commander of the Hypaspists, was the first man onto the battlements and was killed by a spear as he exhorted his men onward. Neverthless the assault was a success, and soon the Macedonians were pouring down into the city itself, killing and looting. After this initial breach was forced, Alexanders command was swollen as more and more Greeks and Macedonians succeeded in entering the city from various points, including the harbours.\n\nThe surviving Tyrians fell back to the Agenorium, an old fortress in the northern sector of the city, but only managed to hold out for a brief period before they were slaughtered. The besiegers blood was up, and, after a long and bitter siege, they were not inclined to be merciful. For months they had endured grinding labour, been tormented by artillery and archery, and witnessed the slaughter of their captured comrades on the city walls. Six thousand Tyrians were slaughtered when the city was taken, and another 2,000 crucified on the beach. A further 30,000 were sold into slavery. Amongst those spared were the King and his family, and a number of Carthaginian pilgrims who took sanctuary in the Temple of Melqart. Macedonian losses amounted to 400 slain.\n\nWith the siege finally over (it had started in January and ended in July), Alexander made his sacrifice to Heracles, and held a torch race and triumphal procession through the streets of the city. With Tyre subjugated, Alexander could turn his attention to subduing Gaza and Egypt."}, {"url": "https://www.classicist.org/articles/classical-comments-the-hephaisteion-and-its-adaptations/", "page_content": "The Hephaisteion and its Adaptations\n\nBy Calder Loth October 2, 2011\n\nClassical Comments by Calder Loth\n\n\n\nSenior Architectural Historian for the Virginia Department of Historic Resources and a member of the Institute of Classical Architecture & Art’s Advisory Council\n\nFigure 1: The Hephaisteion as found and drawn by Stuart and Revett, Antiquities of Athens, Vol. 3, Chap. 1, Plate 1.\n\nThe Hephaisteion, the best preserved of all Greek temples, stands proudly in the Agora, the civic center and market place of ancient Athens. Completed by 415 B.C., the temple was dedicated Hephaestus, the Greek god of fire and metalworking. (His Roman equivalent is Vulcan). Because several of the temple’s metopes have sculptures representing the achievements of Theseus, including his slaying the Minotaur, it was long believed that the building was originally dedicated to Theseus. Thus, the temple is often referred to as the Theseion, particularly in 18th and 19th-century literature. However, scholars have since correctly identified it as the Hephaisteion, and it will be referred to as such below. The temple was made famous by James Stuart and Nicholas Revett, who recorded it thoroughly during their expedition to Greece in 1751-55.[i] However, their plans, elevations, sections, and details of the temple were not published until 1795 when the third volume of their renowned Antiquities of Athens was issued. (Figure 2) These captivating images have inspired numerous interpretations of the temple throughout Europe and America, all employing the temple’s signature element: its bold hexastyle Doric portico. The eleven examples illustrated here are just a handful of the many versions. The variety of building types is an indication of the adaptability of the form. They range from a garden folly to residences, churches, a synagogue, a school, a library, and a masonic memorial.\n\nFigure 2: The Hephaisteion, restored elevation, Antiquities of Athens, Vol. III, Chap. 1, Plate III.\n\nA characteristic of the Hephaisteion that few people appreciate is its diminutive size. Its column shafts are only seventeen feet high. The portico is barely forty-two feet wide. (The Parthenon portico is 101 feet wide.) However, the Hephaisteion was given visual prominence by its placement at the edge of a steep bank so that it conveys monumentality when viewed from the Agora below. (Figure 3) Most of the modern interpretations of the Hephaisteion are a larger scale. Moreover, Stuart and Revett failed to note some of the temple’s refinements. For instance, they did not detect the subtle entasis of the columns and illustrated them with tapering sides. The entasis was a later discovery. As a result, some of the interpretations of the Hephaisteion’s portico have tapered columns while others show entasis.\n\nFigure 3: The Hephaisteion as seen from the Agora (Loth)\n\nJames Stuart provided his own version of the Hephaisteion with his garden temple for the park at Hagley, considered the earliest example of Greek Revival architecture in Britain, if not anywhere. (Figure 4) Built 1758-59, the temple was one of Stuart’s first commissions following his return from Greece in 1755. Lord Lyttelton, who commissioned the structure, wrote that Stuart was going to embellish one of Hagley’s hills with “a true Attick building, a Portico of six pillars, which will make a fine Object to my new House, and command a most beautiful View of the Country.”[ii] The temple is primarily a façade, an eye-catcher in the landscape. Because Stuart’s Hephaisteion drawings were not published until 1795, seven years after his death in 1788, only two versions of this ancient temple, both by Stuart, were built in Britain prior to publication.[iii]\n\nFigure 4: Hagley garden temple, Hagley Park, Worcestershire, U.K. (Country Life)\n\nAmong the boldest of Hephaisteion-inspired works, and one of the first to be built following the publication of Volume III of Antiquities of Athens, is Grange Park in Hampshire, designed by William Wilkins and built in 1804-09. (Figure 5) The present composition is actually a wrapping of an existing house with a monumental Greek Revival case rendered in Roman cement. Its huge Doric portico is considerably larger than its ancient precedent. It suggests the peripteral temple form by projecting two bays rather than being prostyle (a single row of columns). Instead of sculpted metopes, Wilkins employed wreathes based on those shown in Stuart and Revett’s restoration drawing of the frieze of the Choragic Monument of Thrasyllus. Wilkins’ more famous work, the National Gallery on London’s Trafalgar Square, appears feeble compared to Grange Park.\n\nFigure 5: Grange Park, Hampshire, U.K. (Loth)\n\nProbably the most literal interpretation of the Hephaisteion is the Theseustempel in Vienna’s Volksgarten, designed by Pietro von Nobile and completed in 1823. (Figure 6) The building closely replicates the diminutive proportions of the Hephaisteion but its sides extend for only ten columns rather than the thirteen of the original. Believing at the time that the Athenian temple was built to honor Theseus, its form was chosen because the Vienna structure was to house Antonio Canova’s famous sculpture of Theseus slaying the Minotaur. The sculpture was removed from the building in 1890 and is now displayed on the stair landing in the nearby Kunsthistorisches Museum.\n\nFigure 6: Theseustempel, Vienna, Austria (Loth)\n\nSome of the finest Greek Revival buildings in Britain are found in Scotland where the Antiquities of Athens was the primary source of inspiration. With its several conspicuous Grecian-style structures, Edinburgh became known as the ‘Athens of the North.’ Glasgow is replete with Grecian landmarks by Alexander ‘Greek’ Thompson. It is not unusual, however, to find sophisticated Grecian-style works even in a small city such as Elgin. Its town center is dominated by the bold Doric portico of the 1827 St. Giles’s Church, designed by Archibald Simpson of Aberdeen. (Figure 7) Simpson mixed elements from Antiquities of Athens in his scheme. While the hexastyle portico is clearly based on the Hephaisteion, the frieze wreaths are taken from the Thrasyllus monument, and the cupola is copied from Stuart and Revett’s engravings of the Choragic Monument of Lysicrates.\n\nFigure 7: St. Giles’s Church, Elgin, Scotland (Loth)\n\nNew England architect Ammi B. Young established his reputation as an accomplished designer with his Vermont State House, built 1833-38. Having learned the classical language under the tutelage of Asher Benjamin, author of several pattern books promoting Grecian forms, Young made the state house a monument of the Greek Revival style. Its dominant element was a massive Hephaisteion portico with columns of Barre granite. The Vermont State House burned in 1857, but the portico and sections of the walls survived, and were incorporated into a new, expanded state house designed by Thomas Silloway and completed in 1859. (Figure 8) Silloway replaced Young’s low saucer dome with a taller, Renaissance-style dome. Young’s design for the Boston Custom House (completed 1849) also had Hephaisteion-type porticos and a low saucer dome. Its dome was removed when the skyscraper-type tower was imposed on the building in 1915.[iv]\n\nFigure 8: Vermont State House, Montpelier, Vermont (yesvy.blogspot.com)\n\nOne of America’s foremost promoters of the Greek Revival style was Nicholas Biddle, a prominent Philadelphia statesman and president of the Bank of the United States. Biddle was also a scholar of classical Greek literature and had traveled in Greece as a young man where he saw the ancient temples firsthand. Through his 1811 marriage to Jane Craig, he became the proprietor Andalusia, his wife’s family estate on the Delaware River, north of Philadelphia. With his interest in Greek architecture, Biddle commissioned Thomas U. Walter to expand the original Andalusia house, part of which was designed by Benjamin Henry Latrobe and built in 1806. The resulting river front became one of the country’s purest evocations of the Hephaisteion, with sturdy Doric columns clasping the front portion of the mansion. (Figure 9) Walter had learned the Greek architectural vocabulary from William Strickland, who under Biddle’s patronage had designed the Second Bank of the United States, the octastyle porticoes of which are based on the Parthenon.\n\nFigure 9: Andalusia, Bensalem, Pennsylvania (Loth)\n\nBy the 1840s, the Greek Revival style had become de rigueur in Charleston. Thus, it didn’t occur to the members of the Beth Elohim Synagogue to question the pagan symbolism of the Hephaisteion when it was presented as the model for the new building to replace the original structure lost to fire. Various architects submitted designs for a new synagogue, including Charles Reichardt, a native of Germany who had studied under Karl Friedrich Schinkel, and had introduced high-style Grecian architecture to Charleston. It is uncertain whether Reichardt’s submission was selected, nonetheless, the winning design for a Greek Doric temple was sent to Cyrus Warner in New York to be made into working drawings. (Figure 10) Completed in 1842, the building’s hexastyle portico closely echoes the Hephaisteion’s although the columns are set on a podium rather than a stereobate (a surrounding platform of three steps).\n\nFigure 10: Temple Beth Elohim, Charleston, South Carolina (Loth)\n\nIf Charleston could have a synagogue based on the Hephaisteion, it could just as well have a Baptist Church so ordered. Architect Edward Brickell White competed with Beth Elohim nearby with his design for the Second Baptist Church, built 1841-42. (Figure 11) White’s detailing is no less academic than the synagogue’s, and faithfully conveys the virility of the ancient temple. Even though the building is prostyle, its portico is set on three graduated steps suggesting a proper stereobate, a nicety that most of its Hephaisteion-style contemporaries avoid. Nevertheless, the church lacks the dramatic siting of a Greek temple by being placed hard on a narrow urban street. The Baptists later sold the property to a Methodist congregation and the building was renamed Centenary Methodist Church.\n\nFigure 11: Second Baptist Church, Charleston, South Carolina (Loth)\n\nBaltimore architect Robert Cary Long, Jr. chose the Hephaisteion portico to set off the center section of his design for the Virginia School for the Deaf and Blind, completed in 1846 in Staunton. (Figure 12) Under the circumstances, one might think that a more user-friendly feature could have been selected. Long, however, was dedicated to the Grecian mode. He learned the style while training in New York in the circle of Ithiel Town and Alexander Jackson Davis, both of whom were highly influenced by Stuart and Revett’s volumes. The academic correctness of the Staunton building exhibits Long’s early mastery of the style. Considerably larger than its ancient model, the portico is the binding agent a building with very long wings for which the original contract stated: “there shall be absolute separation of the two classes.” [v] While admittedly intimidating, the powerful portico remains symbolic of the pride exhibited in state’s antebellum institutional architecture.[vi]\n\nFigure 12: Virginia School for the Deaf and Blind, Staunton, Virginia (Loth)\n\nAppropriately enough, some of the finest of all Neo-Greek works are found in Athens. A series of public buildings erected in the years following the establishment of the Greek state in 1832 took the ancient images for their own and became icons of national identity. The most ambitious undertaking was the complex of three institutional buildings on Athens’ Panepistimiou Square, consisting of the Academy, the University, and the National Library, all designed by the Danish architect Theophilus Hansen. Hansen’s design for the National Library, built 1885-1903, drew on the Hephaisteion for inspiration, but, as with most of the temple’s modern interpretations, the building was prostyle, not peripteral like the original. (Figure 13) A singular feature of Hansen’s scheme is the sweeping double staircase leading up the hexastyle Doric portico, a remarkable essay in marble. As with several versions of the Hephaisteion, Hansen added acroteria to the pediment. Stuart and Revett gave no indication that the original was ever so embellished.\n\nFigure 13: National Library of Greece, Athens (Loth)\n\nAmong the 20th-century versions of the Hephaisteion portico, a most conspicuous one is that marking the entrance to the George Washington Masonic Memorial in Alexandria, Virginia. (Figure 14) The fact that Washington was a Mason (and lived close by), motivated the nation’s Masons to celebrate it with an astonishing structure housing a memorial hall, auditorium, ceremonial rooms, museum and many other Masonic facilities. Designed by Harvey Wiley Corbett of the New York firm of Helmle & Corbett, the building was begun in 1922 and dedicated in 1932. Its towering profile is based on the ancient lighthouse at Ostia Antica, but is also inspired by the ca. 280 B.C lighthouse of Pharos in Alexandria, Egypt, one of seven wonders of the ancient world. The Alexandria lighthouse reference was thought appropriate for Alexandria, Virginia. Masonic buildings typically draw from classical sources, hence the bold Greek Doric portico of pink Conway granite made a suitable base for the massive tower. The columns are 33 feet high, nearly twice the height of the Hephaisteion’s.\n\nFigure 14: George Washington Masonic Memorial, Alexandria, Virginia (Loth)\n\nThe several examples presented here illustrate how this specific ancient temple, built some 2500 years ago, has shaped the image of an amazing variety of building types. These buildings and many others serve as demonstrations of the adaptability of Greek forms and how they can lend timelessness and dignity to buildings. We might ask whether it is appropriate to apply the Hephaisteion portico to 21st-century works of architecture. While there is certainly no law against it, it’s not likely to happen. So this raises the question: why not? Perhaps members of the ICAA and readers of the Classicist blog can offer opinions on the subject."}, {"url": "https://www.worldhistory.org/Hephaestion/", "page_content": "Hephaestion was a member of Alexander the Great's personal bodyguard and the Macedonian king's closest and lifelong friend and advisor. So much so, Hephaestion's death would bring the young king to tears. From 334 to 323 BCE Alexander the Great conquered much of the known world. He led his army on a ten-year odyssey across Asia Minor and into Persia, Egypt and India. Eventually, after his defeat of Darius III, he became the self-proclaimed King of Asia. Of course, he could not have done this without the support of his loyal army and staff of skilled officers – Ptolemy I, Perdiccas, and Craterus, but above all others, Hephaestion.\n\nEarly Life\n\nThe son of Amyntas, Hephaestion was raised in the Macedonian capital of Pella and according to most sources born in 356 BCE, the same year as the king. Being from an aristocratic family, as were many of the staff officers who would follow Alexander into Asia, he became a student, alongside Alexander, of the philosopher Aristotle at Mieza, a city west of Pella. His intelligence impressed the Athenian academic, and, like the king, they would correspond with each other during the long Persian campaign.\n\nRemove Ads Advertisement\n\nHephaestion was Alexander's closest & most loyal companion throughout the great king's military campaigns.\n\nHephaestion was considered handsome by many, and Alexander's father, Philip II of Macedon, regarded him as an excellent influence on his son. Shortly after Philip married Cleopatra, the future king became concerned about his position as successor. A disagreement erupted between Philip and Alexander, a dispute fueled by his friends. Because of this, many of Alexander's friends were sent into exile; however, because of Philip's respect for Hephaestion, he was spared this humiliation.\n\nOn Campaign\n\nIn 334 BCE, after regaining the loyalties of many of the Greek city-states – especially following the razing of Thebes – Alexander and his army crossed the Hellespont on the first leg of their conquest of Persia. However, before clashing with the Persian army at River Granicus, Alexander chose to visit the tomb of his hero (and supposed ancestor) Achilles at Troy (a small village at the time of Alexander). Such was his fascination with the hero, the king always slept with a copy of Homer's Iliad under his pillow. With him at Troy, of course, was, among others, Hephaestion who laid a wreath at the tomb of Achilles' friend Patroclus. Indeed, many saw the relationship of Alexander and Hephaestion to be akin to that of Achilles and Patroclus. Later, the two men stood side-by-side as Alexander severed the Gordian Knot. Because of this unique closeness, many officers grew extremely jealous. Oddly enough, this jealousy was not limited to the staff for Olympias, Alexander's overly-protective mother, also resented the relationship.\n\nRemove Ads Advertisement\n\nHephaestion's friendship with Alexander would eventually enable him to be appointed chiliarch or second-in-command. Although there is considerable disagreement among contemporary sources, many within the army did not believe Hephaestion to have the necessary leadership or military skills; in fact, some fail to mention any active participation in several of the major battles (although he was seriously wounded at the Battle of Gaugamela); however, luckily for Alexander, he demonstrated a talent for organization. Alexander would leave much of the campaign's logistics to Hephaestion – the supply and transportation of equipment, bridge building and even the establishment and planning of new settlements.\n\nAlexander the Great (Facial Reconstruction) Arienne King (CC BY-NC-SA)\n\nRivalry & Special Position\n\nOne officer, Craterus, grew to deeply resent Hephaestion (the feeling was mutual), and Alexander had to separate the two on more than one occasion. At one point in India, they had actually drawn swords. Alexander was forced to reprimand them both, scolding Hephaestion and telling him he would be nothing without Alexander. (Historians disagree on the meaning of this statement.) It was often said that Craterus was a friend of the king, but Hephaestion was a friend of Alexander. In his Greek Lives historian Plutarch wrote:\n\nLove History? Sign up for our free weekly email newsletter!\n\n… he (Alexander) loved Hephaestion best, but respected Craterus most, he was constantly saying that in his opinion while Hephaestion was loyal to Alexander, Craterus was loyal to the king. This helps to explain why there was bad feeling festering between the two of them, so that they often clashed.\n\nLater, Plutarch said that the king brought the two together and made them friends again but gave each a warning – he would kill both of them if he ever found them quarrelling again. In the end, Craterus would return to Macedonia, eventually dying in 321 BCE during the Wars of the Diadochi after Alexander's death.\n\nThis intimate relationship between Hephaestion and Alexander can also be seen in an incident after the Battle of Issus and the defeat of Darius III. The Persian king ran from the field of battle and escaped capture, leaving his army to suffer a devastating rout. Unfortunately for his mother, wife, and daughters, they were left behind along with abundant riches; Darius would eventually appeal unsuccessfully for their safe return. Realizing the fate of most prisoners of war, especially women, and expecting the worse, Darius' mother, Sisygambis, feared for their safety, and as Alexander and Hephaestion entered the tent, she threw herself before the taller and more handsome Hephaestion, begging for her life. In his The Campaigns of Alexander historian Arrian related the story.\n\n… Darius' mother, in doubt owing to the similarity of their dress, which of the two was the King, prostrated herself before Hephaestion because he was taller than his companion. Hephaestion stepped back, and one of the Queen's attendant's rectified her mistake by pointing to Alexander; the Queen withdrew in profound embarrassment, but Alexander merely remarked that her error was of no account, for Hephaestion, too, was an Alexander.\n\nArrian added that whether or not the incident was true, the young king should be admired for his respect and confidence in a friend – but it also speaks for the nature of Alexander's character.\n\nRemove Ads Advertisement\n\nNaval Command\n\nAfter Issus, Hephaestion was placed in charge of Alexander's naval reinforcements, ordered to follow the army's progress along the Mediterranean coast from Gaza to the city Pelusium on the Egyptian delta – the latter's governor surrendered both the city and its entire treasury without a fight. In another test of Alexander's confidence in Hephaestion, the king placed him in charge of replacing the old, deposed Persian ruler of the newly seized port city of Sidon with another governor. A member of the old royal family Abdalorymus was quickly found and given the governorship. Next, Hephaestion led the fleet up the Nile River to the Egyptian capital of Memphis where he, Ptolemy, Craterus and Alexander studied Egyptian law and customs. Prior to the final battle against Darius at Gaugamela, Alexander placed Hephaestion in charge of a squadron to scout the Tigris and Euphrates Rivers and build a bridge. Wisely, he did not complete the bridge until the arrival of Alexander, fearing that the Persians would destroy it. Aside from the mention of his wound received, sources do not mention Hephaestion again until the conspiracy trial of Philotas.\n\nCities Named Alexandria by Alexander the Great Simeon Netchev (CC BY-NC-SA)\n\nLoyalty to Alexander\n\nBefore marching into India and prior to their expedition into Bactria, there was major unrest within the army. The veterans were weary and wanted to return home to Macedonia and their families. Also, many staff officers disagreed with the king on many of his atypical decisions – his adoption of Persian customs and attire as well as his wish that they prostrate themselves before him and kiss his ring. They especially resented both the addition of Persians into the army and being asked to take Persian wives. However, unlike many others, Hephaestion always supported Alexander's decisions even with the idea of taking a Persian wife and he was given one of the daughters of Darius, Drypatis, while Alexander chose the other daughter, Barsine, as his mistress.\n\nHowever, Hephaestion's loyalty to Alexander was best demonstrated during the would-be mutiny against Alexander. In 330 BCE Hephaestion, along with Craterus, spoke against Philotas, the suspected ringleader of the plot, convincing the king that he and the other conspirators should be tortured and executed - this execution also included Parmenio, Philotas' father and the long-time commander from the court of Philip. Afterwards, Alexander rewarded Hephaestion by splitting the command of the Companions between him and Cleitus.\n\nRemove Ads Advertisement\n\nPortraits of Alexander and a Youth (Hephaestion?) Caroline Cervera (CC BY-NC-SA)\n\nDuring the campaign in India, Hephaestion led a large force through the Khyber Pass subduing any rebellious Indian tribes. Next, Perdiccas and he took half the Companions, the mercenary cavalry, the baggage train and several Indian engineers to build a bridge across the Indus (this same bridge would be used to ford the Hydaspes). When lines of communication were secured, they rejoined Alexander and prepared to cross the Indus and face King Porus – at the Hydaspes Hephaestion would be placed in command of one squadron. After the victory against Porus, Hephaestion split with Alexander reconnecting later and battling against the Mallians – it was here that Alexander was injured and near death. Finally, he could go no farther; Alexander succumbed to the wishes of his troops and decided to return northward to Babylon.\n\nDeath\n\nThey spent the summer and fall at Ecbatana where, after a night of heavy drinking, Hephaestion developed a high fever – Alexander would remain by his friend's side until he showed signs of recovery. Unfortunately, Hephaestion soon relapsed, and in October of 324 BCE, he died (any possibility of poisoning has been dismissed). Alexander would die himself eight months later. The king spent the next two days in tears, grieving for the death of his friend. Besides cutting off his own hair, he ordered the manes and tails of all the horses cut off as well. A state of mourning was declared, sacrifices were made, and sacred fires were lit. Unfortunately, it was a sad day for Hephaestion's doctor, Glaucius, who was executed for his failure to keep his patient alive. Hephaestion's body would eventually be sent to Babylon where a giant pyre was built. Alexander sent an envoy to Siwa to request Hephaestion be declared a god, but the request was refused; he would only be honored as a divine hero. Plutarch wrote:\n\n…he (Alexander) had the wretched doctor impaled on a stake and banned playing the pipes and all music in the camp for a considerable period of time, until he received an oracle from Ammon, telling him to worship Hephaestion as a hero and to institute sacrificial rituals in his honour.\n\nAlthough some sources claim that Hephaestion and Alexander were more than just good friends, most agree that their relationship was unique and strengthened both men. Throughout his life, Hephaestion remained close to the king, serving both as a valuable advisor and friend. Whether or not he was a capable commander is irrelevant, his abilities in logistics assisted in the defeat of the Persians and their king Darius III."}, {"url": "https://www.padfield.com/1994/destruction-of-tyre.html", "page_content": "\n\n\n\nThe Destruction Of Tyre\n\nby David Padfield\n\nTyre, the famous Phoenician seaport, is located 20 miles south of Sidon on the Mediterranean coast. During the conquest of the promised land by Joshua the Canaanites were not driven out of Tyre and other Phoenician cities as God commanded. \"This city was justly entitled the 'Queen of the Sea,' that element bringing to it the tribute of all nations. She boasted of having first invented navigation and taught mankind the art of braving the winds and waves by the assistance of a frail bark. The happy situation of Tyre, at the upper end of the Mediterranean; the conveniency of its ports, which were both safe and capacious; and the character of its inhabitants, who were industrious, laborious, patient, and extremely courteous to strangers, invited thither merchants from all parts of the globe; so that it might be considered, not so much a city belonging to any particular nation, as the common city of all nations and the centre of their commerce.\" (Oliver Goldsmith, Alexander Reduces Tyre).\n\nHiram, king of Tyre, was instrumental in the building of the Temple in Jerusalem during the time of Solomon (1 Kings 5:1-18). The friendship between the Jews and Phoenicians ended when King Ahab married a daughter of King Ethbaal of Sidon. During the time of Joel, the Phoenicians sold Jewish children as slaves to the Greeks. The Lord promised retribution. \"Indeed, what have you to do with Me, O Tyre and Sidon, and all the coasts of Philistia? Will you retaliate against Me? But if you retaliate against Me, swiftly and speedily I will return your retaliation upon your own head; because you have taken My silver and My gold, and have carried into your temples My prized possessions. Also the people of Judah and the people of Jerusalem you have sold to the Greeks, that you may remove them far from their borders.\" (Joel 3:4-6).\n\nIn Ezekiel 26, God makes a proclamation concerning Tyre, summed up in the following:\n\nMany nations would come against Tyre (Ezek. 26:3)\n\nThe walls of Tyre would be broken down (Ezek. 26:4)\n\nDust would be scraped from her, and she would be left like a bare rock (Ezek. 26:4)\n\nTyre would be a place for the spreading of nets (Ezek. 26:5)\n\nNebuchadnezzar, king of Babylon, would build a siege wall around Tyre (Ezek. 26:8)\n\nNebuchadnezzar would plunder the city (Ezek. 26:9-12)\n\nThe stones, timber and soil of Tyre would be cast into the sea (Ezek. 26:12)\n\nThe city would never be rebuilt (Ezek. 26:14)\n\nAfter the destruction of Jerusalem and the carrying away of her king Zedekiah into captivity, \"Nebuchadnezzar took all Palestine and Syria and the cities on the seacoast, including Tyre, which fell after a siege of 13 years (573 B.C.)\" (E. A. Wallis Budge, Babylonian Life And History, p. 50). The inhabitants of Tyre fled to a rocky island half a mile offshore. The walls on the landward side of the island were 150 feet high. \"The channel between Tyre and the mainland was over twenty feet deep, and frequently lashed by violent south-west winds. Their fortifications, they believed, would resist the strongest battering-ram yet devised. The city-walls stood sheer above the sea: how could any army without ships scale them? Shore based artillery was useless at such a range.\" (Peter Green, Alexander of Macedon, p. 248).\n\nOn his way towards Egypt, Alexander the Great (356-323 BC) led his Macedonian troops to victory at Sidon and then continued south towards Tyre. Tyrian envoys met with Alexander and assured him that their city was at his disposal. \"However, he put their goodwill to the test by expressing his wish to sacrifice at the shrine of Heracles inside the city; for the Tyrians recognized a Phoenician god who was identified by the Greeks as Heracles, and from this deity Alexander claimed descent. Tyrian goodwill unfortunately did not extend so far as to grant him the permission he sought In short, they would not admit him into the city.\" (David Chandler, Alexander 334-323 B.C., p. 41).\n\nAlexander was tempted to bypass the island fortress and continue his march towards Egypt. He sent messengers to Tyre, urging them to accept a peace treaty. Believing themselves to be safe on their island, the Tyrians killed Alexander's ambassadors and threw their bodies from the top of the walls into the sea. This act served only to anger Alexander and embitter his troops.\n\nAlexander determined to build a mole to get his troops from the mainland to the island. The mole is said to have been at least 200 feet wide. It was constructed from stones and timber from the old city of Tyre on the mainland. In fulfillment of Ezekiel's prophecy, the very foundation stones, timbers and dust of the city was cast \"in the midst of the water\" (Ezek. 26:12).\n\nFor a while the Tyrians laughed at Alexander's project. At first they would row boats across the channel and harangue the Macedonians. Their laughter turned to concern when they saw the mole was going to be completed. The Tyrians ignited a barge and drove it into the first mole. The towers on the mole caught fire and several of Alexander's men lost their lives. Alexander gave orders for the work to continue, and that the mole itself should be widened and more protective towers be built.\n\nAlexander was able to obtain ships from Sidon, Greek allies and Cyprus to form a blockade around Tyre. When the mole was within artillery range of Tyre, Alexander brought up stone throwers and light catapults, reinforced by archers and slingers, for a saturation barrage. Battle engineers constructed several naval battering rams which smashed through the walls of Tyre. Though courageous, the Tyrians were no match for Alexander's troops. Over 7,000 Tyrians died in the defense of their island. In contrast, only 400 Macedonians were killed.\n\nThe seven month siege, from January to July 332 B.C., was over. \"The great city over which Hiram had once held sway was now utterly destroyed. Her king, Azimilik, and various other notables, including envoys from Carthage, had taken refuge in the temple of Melkart, and Alexander spared their lives. The remaining survivors, some 30,000 in number, he sold into slavery. Two thousand men of military age were crucified. Then Alexander went up into the temple, ripped the golden cords from the image of the god (now to be renamed, by decree, Apollo Philalexander), and made his long-delayed sacrifice: the most costly blood-offering even Melkart had ever received.\" (Green, p. 262).\n\nOne historian wrote, \"Alexander did far more against Tyre than Shalmaneser or Nebuchadnezzar had done. Not content with crushing her, he took care that she never should revive; for he founded Alexandria as her substitute, and changed forever the track of the commerce of the world.\" (Edward Creasy, Fifteen Decisive Battles of the World, ch. 4).\n\nThe small southern Lebanese town of Tyre (Sur) now has a population of about 117,000. \"Today, deep under asphalt streets and apartment blocks, the stone core of that fantastic causeway still stands: one of Alexander's most tangible and permanent legacies to posterity.\" (Green, p. 263).\n\nWas Tyre Ever Rebuilt?\n\n\"The modern city of Tyre is of modest size and is near the ancient site, though not identical to it. Archaeological photographs of the ancient site show ruins from ancient Tyre scattered over many acres of land. No city has been rebuilt over these ruins, however, in fulfillment of this prophecy.\" (Dennis and Grudem, “Tyre,” The ESV Study Bible)\n\n\"In point of fact, the mainland city of Tyre later was rebuilt and assumed some of its former importance during the Hellenistic period. But as for the island city, it apparently sank below the surface of the Mediterranean…All that remains of it is a series of black reefs offshore from Tyre, which surely could not have been there in the first and second millennia b.c., since they pose such a threat to navigation. The promontory that now juts out from the coastline probably was washed up along the barrier of Alexander’s causeway, but the island itself broke off and sank away when the subsidence took place; and we have no evidence at all that it ever was built up again after Alexander’s terrible act of vengeance. In the light of these data, then, the predictions of chapter 26, improbable though they must have seemed in Ezekiel’s time, were duly fulfilled to the letter—first by Nebuchadnezzar in the sixth century, and then by Alexander in the fourth.\" (Archer, “Tyre,” Encyclopedia of Bible Difficulties)"}, {"url": "https://hermeneutics.stackexchange.com/questions/53962/were-the-prophesies-in-isaiah-and-ezekiel-about-tyre-actually-fulfilled", "page_content": "This is a fairly complicated question.\n\nIn the prophecies of Isaiah, we do not have much knowledge about this time period. Thus, I will focus on Ezekiel.\n\nTo begin, in Ezekiel chapter 33 it says \"וּבְאָמְרִ֥י לָֽרָשָׁ֖ע מ֣וֹת תָּמ֑וּת וְשָׁב֙ מֵֽחַטָּאת֔וֹ וְעָשָׂ֥ה מִשְׁפָּ֖ט וּצְדָקָֽה׃ חֲבֹ֨ל יָשִׁ֤יב רָשָׁע֙ גְּזֵלָ֣ה יְשַׁלֵּ֔ם בְּחֻקּ֤וֹת הַֽחַיִּים֙ הָלַ֔ךְ לְבִלְתִּ֖י עֲשׂ֣וֹת עָ֑וֶל חָי֥וֹ יִֽחְיֶ֖ה לֹ֥א יָמֽוּת׃ כָּל־חטאתו [חַטֹּאתָיו֙] אֲשֶׁ֣ר חָטָ֔א לֹ֥א תִזָּכַ֖רְנָה ל֑וֹ מִשְׁפָּ֧ט וּצְדָקָ֛ה עָשָׂ֖ה חָי֥וֹ יִֽחְיֶֽה׃\" \"When I say to the wicked man 'you shall die' and he repents and does what is just and right--if the wicked man restores a pledge, returns what he has stolen, follows the laws of life and does not do iniquity. He shall surely live. All sins which he has done will not be remembered to him for he has done what is just and right and he shall live.\" (Ezekiel 33:14-16). The meaning of these passages is clear that when Ezekiel or any prophet declares a sentence against a place, and the place repents, then the punishment will be revoked. We also see this in the book of Jonah.\n\nWith this understanding, we have two ways of understanding these decrees:\n\nTyre and its king repented. Tyre and its king did not repent and the punishment still stands.\n\nUnder the first understanding, these punishments will not occur. This is a possible understanding; however, it seems from the text that Tyre did not repent.\n\nNow, for the second understanding, we have to look deeper in the text. The beginning of this passage reads \"לָכֵ֗ן כֹּ֤ה אָמַר֙ אֲדֹנָ֣י יְהוִ֔ה הִנְנִ֥י עָלַ֖יִךְ צֹ֑ר וְהַעֲלֵיתִ֤י עָלַ֙יִךְ֙ גּוֹיִ֣ם רַבִּ֔ים כְּהַעֲל֥וֹת הַיָּ֖ם לְגַלָּֽיו׃ וְשִׁחֲת֞וּ חֹמ֣וֹת צֹ֗ר וְהָֽרְסוּ֙ מִגְדָּלֶ֔יהָ וְסִֽחֵיתִ֥י עֲפָרָ֖הּ מִמֶּ֑נָּה וְנָתַתִּ֥י אוֹתָ֖הּ לִצְחִ֥יחַ סָֽלַע׃\" \"Thus, declares the Master G-d, here I am against you Tyre, and I will bring against you many nations like the sea brings its waves. They shall destroy the walls of Tyre and demolish its towers and I will scrape its soil off of it and I will make it a bare rock\" (Ezekiel 26:3-4). Thus we understand that many nations are to come against Tyre, not just one, and after all these nations come, then Tyre will be a bare rock.\n\nSome people understand these \"many nations\" as being the army of Nebuchadnezzar as it says \"כִּ֣י כֹ֤ה אָמַר֙ אֲדֹנָ֣י יְהוִ֔ה הִנְנִ֧י מֵבִ֣יא אֶל־צֹ֗ר נְבוּכַדְרֶאצַּ֧ר מֶֽלֶךְ־בָּבֶ֛ל מִצָּפ֖וֹן מֶ֣לֶךְ מְלָכִ֑ים בְּס֛וּס וּבְרֶ֥כֶב וּבְפָרָשִׁ֖ים וְקָהָ֥ל וְעַם־רָֽב׃\" \"Thus says the Master G-d, behold, I am going to bring Nebuchadrezzar king of Babylon from the north, a king of kings, with horses, chariots, horsemen, and עם רב (many people/a numerous nation)\" (Ezekiel 26:7). They claim that this עם רב (many people/a numerous nation) is the same as the גוים רבים (many nations). To explain what these words mean, עם can mean nation or a mass of people. It is grammatically singular. It would mean \"many nations\" if it was in the plural, but not in the singular. Given the adjective רב, it means a numerous nation or many people. גוים רבים specifically means many nations. Thus, these words cannot be the same as if they were supposed to be the same, עם would be in the plural and it would be עמים רבים. Also if all these nations were to come in one wave, it would contradict the \"many waves\" passage.\n\nFurthermore, we see that in Ezekiel 26:12 the text switches from the singular to the plural implying a switch from Nebuchadnezzar to all the nations which are to attack Tyre. If this was to be discussing Nebuchadnezzar's army it would still use the singular and the preposition ב which means with in this case. Thus this prophecy is really saying that at some future time, Tyre will become a bare rock and will remain as a bare rock.\n\nNow if we turn to the king of Tyre, we see from history that he was either killed in the siege or taken captive to Babylon. If he was killed in the siege, we know this prophecy was fulfilled; however, if he was taken captive to Babylon, we can understand that he repented from thinking he was a god."}, {"url": "https://zhuanlan.zhihu.com/p/133153935", "page_content": "家族和童年\n\n根据希腊历史学家，尼科米底亚的阿里安（Arrian of Nicomedia）记载，赫费斯提翁（Hephaestion）出生在马其顿的首都佩拉（Pella）。其父名为阿明托尔（Amyntor）。根据赫费斯提翁与王子亚历山大一起接受教育这一点来看，我们可以推断阿明托尔一定是马其顿的一名重要人物。\n\n其家族的来源有两种猜测：\n\n一，赫氏家族源于马其顿本土。二，赫氏家族来自雅典。因为在古雅典城中曾有一座著名庙宇就叫做“赫菲斯提翁”，而在当时，赫费斯提翁这个名字在雅典之外很少见。其次，当时的马其顿国王腓力二世在整个希腊世界招贤纳士，包括亚里士多德和我们之前提到过的尼阿库斯的父亲，都是腓力二世积极人才政策的结果。第三，赫费斯提翁的父亲阿明托尔的名字，在希腊语中暗示他是来马其顿并受到光荣待遇的希腊雇佣军领袖或知识分子。\n\n马其顿首都佩拉\n\n初随征服者\n\n在资料记载中，不同于其他一些将领的是，当亚历山大刚开始远征波斯时，赫费斯提翁的名字就出现在了记载中。他们于公元前334年5月来到特洛伊遗址，这时，赫费斯提翁还没有被称为亚历山大的“朋友”或“伴侣”。在特洛伊，亚历山大祭拜了古代的英雄们，据说，他去了自己祖先阿基里斯（Achilles）的坟墓，而赫费斯提翁则祭拜了帕特洛克罗斯（Patroclus）的坟墓。（这暗示了亚历山大和赫费斯提翁的情人身份，因为阿基里斯和帕特罗克罗斯也是情人。）\n\n在结束了对特洛伊的访问之后，赫费斯提翁的消息消失了一段时间，这表明他没有被交付单独带兵的任务，所以可以推断在战争途中他一直和亚历山大在一起。直到伊苏斯战役，我们在一则轶事中读到了赫费斯提翁的名字。\n\n马其顿人在伊苏斯胜利后，俘虏了大流士的女眷，其中包括王后斯塔蒂拉（Queen Statila）。她走到亚历山大等人面前，然后跪倒在赫费斯提翁脚下，以为他是国王。亚历山大见状说“别担心，他也是亚历山大。”\n\n此时，亚历山大已经23岁了。根据希腊爱情观，与同性伴侣的关系应该结束，是时候找合适的女子结婚了。亚历山大接纳了一位名叫巴尔辛的波斯情妇，但这并未影响赫费斯提翁和亚历山大的友谊，他俩的关系依然很密切，亚历山大称他为：“Philalexandros”，意思是亚历山大之友。\n\n在取得伊苏斯的胜利后，赫费斯提翁被交付了一项外交任务——前往西顿（Sidon，今黎巴嫩）并扶持一个亲马其顿的统治者。赫费斯提翁挑选了一名具有西顿王室血脉的年轻人，名字叫阿卜达洛尼缪斯（Abdalonymus），此人之后被委托建造了亚历山大的石棺。\n\n西顿，位于黎巴嫩，是南下埃及的重要港口\n\n之后，赫费斯提翁负责指挥黎巴嫩沿岸腓尼基人提供的海军，并为亚历山大的陆军提供补给和帮助，毫无疑问，这是个非常重要的任务。\n\n在亚历山大待在埃及期间，德摩斯梯尼（反马其顿的雅典政治家）的一位朋友找上了赫费斯提翁，希望他能在亚历山大面前为德摩斯梯尼美言几句。但赫费斯提翁有没有被说服我们不得而知。\n\n时间来到公元前331年10月31日，马其顿军和波斯军会猎与美索不达米亚北部的高加米拉。此时的赫费斯提翁已经被任命为亚历山大的七位近侍之一。在这场血腥的战斗中，赫费斯提翁的手部受伤。\n\n之后，亚历山大阵营中发生了菲洛塔斯（Philotas）叛国事件，当事人被处死，其伙伴骑兵指挥官的职位被分交给了克利图斯（Clitus）和赫费斯提翁。接下，马其顿军继续向内陆进发，进入粟特地区（Sogdia）。\n\n粟特和印度\n\n在粟特，大部分当地部落都是以游牧的形式，所以马背上的战斗是当地的主旋律。但在记载中并没有看到关于亚历山大手下骑兵指挥官过多的记载。因为这些游牧部落实在太过分散，亚历山大不得不将骑兵部队分为若干份来执行任务。\n\n另一方面，在战斗方面，赫费斯提翁不算是一个优秀的指挥官。在作战中，赫费斯提翁总是更多的和另外一名经验丰富编队在一起（例如：克利图斯、帕迪卡斯等），共享指挥权。但这并未影响他和亚历山大的关系。在亚历山大和罗克珊娜的婚礼上，他是亚历山大的伴郎。\n\n在结束了粟特的战役后，亚历山大率军南下，希望能找到记载中的印度洋。赫费斯提翁和帕迪卡斯一起率领一支部队，沿着喀布尔河于公元前326年抵达印度的旁遮普地区（Punjab）。在这里，他们占领了一个叫佩塞劳提斯（Peucelaotis）的城镇。接下，他们沿印度河行军，并在洪德（Hund）附近建造了一座桥，并与当地一位亲马其顿的国王进行了谈判。\n\n公元前326年5月，赫费斯提翁参与了达斯皮斯河战役（Battle of the Hydaspes），对抗印度河流域的一位当地国王波鲁斯（Porus）。波鲁斯投降后，他的亲戚依然在当地负隅顽抗。亚历山大将这个清理的工作交给了赫费斯提翁，这一次，有一个叫德米特里乌斯（Demetrius）跟他一起。\n\n\n\n\n\n结束了印度河的大战，亚历山大的下一个目标是恒河河谷的马伽达王国（Magadha），但士兵们不愿再继续征战了。印度潮湿的雨季和对希腊老家无限的向往让这些士兵心力交瘁。就在亚历山大三十岁生日的前不久，一场公开反叛爆发了。军队哗变，亚历山大别无选择，只能选择打道回府。赫费斯提翁被下令在河岸上建造一个守备营寨，并留下一些雇佣军，以保证后卫安全。\n\n现在的马其顿军队被分为三组，一组由亚历山大率领，乘船沿河而下。第二组则是由克拉特鲁斯率领，沿着印度河西岸前进。第三组军队由赫费斯提翁率领，这是三只军队里比较安全的一支，预计不会有遭遇任何战斗。这也是有记载的赫费斯提翁第一个独立率军的命令。\n\n当他们抵达印度河河口时，赫费斯提翁被下令在此建造一个新的希腊人定居点帕塔拉（Patala），而尼阿库斯（Nearchus）则负责建造一支庞大的舰队，走海路返回巴比伦。\n\n到了8月，亚历山大带领33000名士兵离开帕塔拉，前往卡尔马尼亚（Carmania），行军期间，他们建造了一座大型粮食仓库，尼阿库斯的军队可以在这里得到补给。一路上，亚历山大击败了沿途的当地部落，并让负责补给部队的赫费斯提翁在当地建立了一座新据点。并下令让列奥纳托斯负责守卫该据点。毕竟，亚历山大希望当尼阿库斯到这儿的时候，能够获得完好的补给。\n\n亚历山大的军队继续向西进发，途中，他们必须经过革德罗西亚沙漠（Gedrosia）。穿越沙漠的过程是灾难级别的，大部队在沙漠中走了六十天。炎炎的酷暑和干旱的环境造成 大量的人员伤亡。赫费斯提翁的补给部队就更惨了，他们的大量补给都要供应给先头部队，这让他们的处境更加糟糕。\n\n公元前325年12月，亚历山大和尼阿库斯终于在卡尔马尼亚重聚，军队上下无不弹冠相庆。亚历山大本人也扮起了酒神狄奥尼索斯，他们相互庆祝、饮酒作乐，这样的状态持续了七天。\n\n游戏里的革德罗西亚沙漠，位于伊朗南部\n\n巴比伦的最后时光\n\n经历了一系列磨难后，亚历山大和他的军队终于抵达了苏萨。他们举行了一系列的庆祝活动，并为尼阿库斯、赫费斯提翁、列奥纳图斯等人授予了金冠。加冕金冠这一活动没有遭到任何人反对，这很不可思议，因为六年前，许多人都认为亚历山大戴王冠是十分可耻的，这象征着希腊人所鄙视的东方君主。\n\n在苏萨，最大的庆祝活动是为期五天的集体婚礼。由于之前亚历山大征服了巴比伦、埃兰和波斯，因此许多波斯贵族女性接受了希腊化的教育。现在，她们已经做好了被许配给马其顿军官的准备。\n\n亚历山大本人则娶了两位波斯公主，一位是大流士三世的女儿巴尔辛（Barsine），另一位则是阿尔塔薛西斯（Artaxerxes III）的女儿帕里萨蒂斯（Parysatis）。而赫菲斯提安则迎娶了大流士三世的另一个女儿德里佩蒂斯（Drypetis）。其他的马其顿军官们则是娶了稍微低等级的其他波斯贵族之女。\n\n在这几天里，赫菲斯提翁被亚历山大任命为“chiliarchos”，高级顾问。而托勒密被任命为“edeatros”，试毒者。这两个都是古代波斯官职的希腊语名字。根据波斯习俗，赫菲斯提安可以使用权杖和佩戴金耳环，正如两个世纪前的波斯浮雕上一样。\n\n波斯古代浮雕\n\n公元前324年夏天，亚历山大和赫费斯提翁在巴比伦南部带领军队。其原因不是因为战争，而是为了寻找河流和沿海地区的路线。因为亚历山大的下一个计划是征服阿拉伯半岛，因此，对沿海的控制至关重要。同时，一些从伊朗高原新招募的士兵也需要训练。\n\n作为亚历山大高级顾问，赫费斯提翁负责很多事情，包括对皇室书信的管理，这让他和亚历山大的秘书攸美尼斯发生了冲突。具体原因尚不明确，但是可以确认的是，亚历山大命令他们和解。\n\n夏末，亚历山大前往北部，去往重镇埃克巴塔那（Ecbatana），在那里，他受到了米底亚总督的热情招待。和往常一样，他们举办酒会，但这次导致了一个可悲的后果：赫费斯提翁病死了。（公元前324年8月）这一消息震惊了亚历山大和赫费斯提翁的遗孀。而攸美尼斯为了在亚历山大面前刷一波好感度，他向亚历山大提议，将赫费斯提翁在巴比伦火化，这是给死去英雄的神圣荣誉。\n\n就在赫费斯提翁去世十个月后，公元前323年6月，亚历山大在巴比伦病逝。\n\n喀罗尼亚的普鲁塔克写到：亚历山大曾说，如果没有自己，那么赫费斯提翁将一事无成。\n\n确实，赫费斯提翁是一名能干的军官，但他没有帕曼尼翁和克拉特鲁斯这样的军事才华，他也是一个合格的外交官和组织者，但他不像佩塞斯塔斯（Puecestas）会多门外语，也不像攸美尼斯有出色的文笔。\n\n那赫菲斯提安有什么呢？答案是亚历山大的心。世界上没有人比赫费斯提翁更懂亚历山大。与国王的亲近让其他廷臣妒忌，这让他处于孤立的状态，这也让他更加依赖亚历山大，当然，另一方面，正因如此，亚历山大也完全的相信他。\n\n赫费斯提翁的早逝不得不说是一个遗憾。但以他的能力和性格，如果将其掷入继业者们弱肉强食的世界中，也许其结局会更加悲惨。所以，从另一方面来看，赫费斯提翁这辈子，还是值得的。\n\n作者仅为历史爱好者，如有错误，欢迎私信或评论区指出\n\n文中译名遵从作者习惯，以英文为准\n\n文献资料来自：https://www.livius.org/articles/person/Hephaestion/"}, {"url": "https://www.thoughtco.com/alexander-the-great-siege-of-tyre-2360867", "page_content": "Siege of Tyre - Conflict & Dates:\n\nThe Siege of Tyre took place from January to July 332 BC during the Wars of Alexander the Great (335-323 BC).\n\nCommanders\n\nMacedonians\n\nAlexander the Great\n\nTyre\n\nAzemilcus\n\nSiege of Tyre - Background:\n\nHaving defeated the Persians at Granicus (334 BC) and Issus (333 BC), Alexander the Great swept south along the Mediterranean coast with the ultimate goal of moving against Egypt. Pressing on, his intermediate goal was to take the key port of Tyre. A Phoenician city, Tyre was situated on an island approximately half a mile from the mainland and was heavily fortified. Approaching Tyre, Alexander attempted to gain access by requesting permission to make a sacrifice at the city's Temple of Melkart (Hercules). This was refused and the Tyrians declared themselves neutral in Alexander's conflict with the Persians.\n\nThe Siege Begins:\n\nFollowing this refusal, Alexander dispatched heralds to the city ordering it to surrender or be conquered. In response to this ultimatum, the Tyrians killed Alexander's heralds and threw them from the city walls. Angered and eager to reduce Tyre, Alexander was faced with the challenge of attacking an island city. In this, he was further hampered by the fact that he possessed a small navy. As this precluded a naval assault, Alexander consulted his engineers for other options. It was quickly found that the water between the mainland and the city was relatively shallow until shortly before the city walls.\n\nA Road Across the Water:\n\nUsing this information, Alexander ordered the construction of a mole (causeway) that would stretch across the water to Tyre. Tearing down the remains of the old mainland city of Tyre, Alexander's men began building a mole that was approximately 200 ft. wide. The early phases of construction went smoothly as the city's defenders were unable to strike at the Macedonians. As it began to extend farther into the water, the builders came under frequent attack from Tyrian ships and the city's defenders who fired from atop its walls.\n\nTo defend against these assaults, Alexander constructed two 150 ft.-tall towers topped with catapults and mounting ballistas to drive off enemy ships. These were positioned at the end of the mole with a large screen stretched between them to protect the workers. Though the towers provided the needed defenses for construction to continue, the Tyrians quickly devised a plan to topple them. Constructing a special fire ship, which was weighted down aft to raise the bow, the Tyrians attacked the end of the mole. Igniting the fire ship, it rode up onto the mole settling the towers ablaze.\n\nThe Siege Ends:\n\nDespite this setback, Alexander endeavored to complete the mole though he became increasingly convinced that he would need a formidable navy to capture the city. In this, he benefited from the arrival of 120 ships from Cyprus as well as another 80 or so that defected from the Persians. As his naval strength swelled, Alexander was able to blockade Tyre's two harbors. Refitting several ships with catapults and battering rams, he ordered them anchored near the city. To counter this, Tyrian divers sortied out and cut the anchor cables. Adjusting, Alexander ordered the cables replaced with chains (Map).\n\nWith the mole nearly reaching the Tyre, Alexander ordered catapults forward which began bombarding the city walls. Finally breaching the wall in the southern part of the city, Alexander prepared a massive assault. While his navy attacked all around Tyre, siege towers were floated against the walls while troops attacked through the breach. Despite fierce resistance from the Tyrians, Alexander's men were able to overwhelm defenders and swarmed through the city. Under orders to slay the inhabitants, only those who took refuge in the city's shrines and temples were spared.\n\nAftermath of the Siege of Tyre:\n\nAs with most battles from this period, casualties are not known with any certainty. It is estimated that Alexander lost around 400 men during the siege while 6,000-8,000 Tyrians were killed and another 30,000 sold into enslavement. As a symbol of his victory, Alexander ordered the mole to be completed and had one of his largest catapults placed in front of the Temple of Hercules. With the city taken, Alexander moved south and was forced to lay siege to Gaza. Again winning a victory, he marched in Egypt where he was welcomed and proclaimed pharaoh.\n\nSelected Sources"}, {"url": "https://www.gotquestions.org/Tyre-in-the-Bible.html", "page_content": "Question\n\nAnswer\n\nTyre is thought to be one of the oldest cities on the Phoenician coast, established long before the Israelites entered the land of Canaan. Isaiah affirms Tyre’s ancient origins as “from days of old” (Isaiah 23:5–7).Tyre is situated on the Mediterranean coast directly north of Jerusalem between the mountains of Lebanon and the Mediterranean Sea, about 20 miles south of Sidon and 23 miles north of Acre. Neighboring Sidon is believed to be the oldest Phoenician city, but Tyre’s history is more distinguished. The name Tyre (in Hebrew) signifies “a rock,” an apt description for the rocky coastal fortress. In ancient times, Tyre flourished as a maritime city and a busy center for commercial trade. The area’s most valuable export was its then world-famous purple dye.Originally, the ancient city was divided into two parts: an older port city (“Old Tyre”) located on the mainland and a small rocky island about a half-mile off the coast where most of the population resided. The island has been connected to the mainland ever since Alexander the Great built a siege ramp to it in the late fourth century BC. The causeway has widened over the centuries, creating Tyre’s current-day peninsular formation.The Bible first mentions Tyre in a list of cities that were part of the inheritance of the tribe of Asher (Joshua 19:24–31). Fortified with a wall, Tyre held an exceedingly strong position. It was the only city in the list described as “strong” or “fortified” (verse 29). Joshua was unable to capture Tyre (Joshua 13:3–4), and, evidently, it was never conquered by the Israelites (2 Samuel 24:7).By the time of King David’s reign, Israel had formed a friendly alliance with Hiram king of Tyre. David used stonemasons and carpenters from Tyre, along with cedars from that region to build his palace (2 Samuel 5:11). Peaceful relations with King Hiram continued into Solomon’s reign, with the construction of the temple in Jerusalem relying heavily on supplies, laborers, and skilled artisans from Tyre (1 Kings 5:1–14; 9:11; 2 Chronicles 2:3).Israel continued to share close ties with Tyre during King Ahab’s reign. Ahab married the Phoenician princess Jezebel , daughter of Ethbaal, king of Sidon, and their union led to the infiltration of pagan worship and idolatry in Israel (1 Kings 16:31). Both Tyre and Sidon were notorious for their wickedness and idolatry, which resulted in numerous denouncements by Israel’s prophets, who predicted Tyre’s ultimate destruction (Isaiah 23:1; Jeremiah 25:22; Ezekiel 26; 28:1–19; Joel 3:4; Amos 1:9–10; Zechariah 9:2–4).After the restoration of Jerusalem in Nehemiah’s time, the people of Tyre violated the Sabbath rest by selling their goods in the markets of Jerusalem (Nehemiah 13:16). In 332 BC, after a seven-month siege, Alexander the Great conquered Tyre, putting an end to Phoenician political control, but the city retained its economic power.In the New Testament, Jesus mentions Tyre as an example of an unrepentant city (Matthew 11:21–22; Luke 10:13). Jesus also ministered in the district of Tyre and Sidon, healing the demon-possessed daughter of a Canaanite woman (Matthew 15:21–28).The persecution that arose after Stephen’s death caused the Christians in Jerusalem to scatter. As a result, a church was established in Tyre (Acts 11:19). Paul spent a week there with the disciples on the return voyage of his third missionary journey (Acts 21:2–4).In 1291, Tyre was completely destroyed by the Saracens, eerily fulfilling Ezekiel’s prophecy: “They will destroy the walls of Tyre and pull down her towers; I will scrape away her rubble and make her a bare rock. Out in the sea she will become a place to spread fishnets, for I have spoken, declares the Sovereign LORD. She will become plunder for the nations” (Ezekiel 26:4–5). The island has remained a desolate ruin ever since."}], "The scaling of the walls of Tyre in 332 BC was the primary cause of the fall of the city.": [{"url": "https://www.worldhistory.org/article/107/alexanders-siege-of-tyre-332-bce/", "page_content": "After defeating Darius III at the battle of Issus in November 333 BCE, Alexander marched his army (about 35,000-40,000 strong) into Phoenicia, where he received the capitulation of Byblus and Sidon. Tyrian envoys met with Alexander whilst he was on the march, declaring their intent to honour his wishes.\n\nCauses of the Siege\n\nAlexander's request was simple: he wished to sacrifice to Heracles in Tyre. (The Phoenician god Melqart was roughly the equivalent of the Greek Heracles.) The Tyrian's recognised this as a Macedonian ploy to occupy the city and refused, saying instead that Alexander was welcome to sacrifice to Heracles in old Tyre, which was built upon the mainland. Old Tyre held no strategic importance - it was undefended and the Tyrian navy was stationed in the harbours of new Tyre.\n\nRemove Ads Advertisement\n\nThe Tyrian refusal to capitulate to Alexander's wishes was tantamount to a declaration of war. But, despite the youthful Alexander's growing reputation, the Tyrians had every reason to be confident. In addition to a powerful navy and mercenary army, their city lay roughly half a mile (0.8 km) offshore, and, according to the account of the historian Arrian, the walls facing the landward side towered to an impressive 150 ft (46m) in height. Whether they actually stood that high is doubtful and open to debate, but even so, the defences of Tyre were formidable and had withstood a number of mighty sieges in the past. The Tyrians began their preparations and evacuated most of the women and children to their colony at Carthage, leaving behind perhaps 40,000 people. Carthage also promised to send more ships and soldiers.\n\nAlexander was aware of Tyre's supposed impregnability and convened a council of war, explaining to his generals the vital importance of securing all Phoenician cities before advancing on Egypt. Tyre was a stronghold for the Persian fleet and could not be left behind to threaten Alexander's rear. In a last-ditch attempt to prevent a long and exhaustive siege, he despatched heralds to Tyre demanding their surrender, but the Macedonian's were executed and their bodies hurled into the sea.\n\nRemove Ads Advertisement\n\nSiege of Tyre The Department of History, United States Military Academy (Public Domain)\n\nOpening moves of the siege\n\nNegotiations having failed, Alexander began his operations in January 332 BCE. After occupying old Tyre, he began to construct a causeway (or mole) across the channel toward the walls of Tyre, using rocks, timbers, and rubble taken from the buildings of the old city. Initially, work progressed well: the water near the mainland was shallow and the bottom muddy, but, as the causeway lengthened, the Macedonians and Greeks began to run into trouble. The seafloor shelved sharply near the city, to a depth of 18 ft (5.5m). Work slowed to snail-pace, and the work gangs found themselves increasingly harassed by missile fire from the city walls.\n\nAlexander constructed two siege towers from timber covered with rawhide & positioned them at the end of a causeway he had built.\n\nAlexander constructed two siege towers from timber covered with rawhide and positioned them at the end of the causeway. Artillery engines at the top of these towers were able to return fire at the walls, and the work gangs erected timber palisades as an added measure of protection. Work proceeded, and Alexander spent much of his time on the mole, dispensing small gifts of money to his sweating labourers and leading by personal example.\n\nLove History? Sign up for our free weekly email newsletter!\n\nThe Tyrians then initiated their first major defensive action of the siege. They took an old horse transport ship and filled it to the gunwales with combustible material: chaff, torches, pitch and sulphur. They slung double yardarms from the mast, and to these hooked cauldrons filled with a volatile inflammable oil. The stern of the ship was ballasted to lift the bows clear of the water, and two galleys towed her in towards the end of the mole, driving her and themselves aground.\n\nThe crews lit the materials aboard the fireship and all managed to swim to safety. The tip of the mole became an inferno as the ship burnt, igniting the two towers. A host of Tyrians in small boats rowed out from the city and landed on various points of the causeway, engaging the besiegers as they frantically attempted to douse the flames. Siege engines were burnt and the palisades along the edge of the mole destroyed.\n\nAlexander musters his fleet\n\nThe attack was a great success for the Tyrians, but they had reckoned without the resolve of Alexander, who now ordered the causeway to be widened and more towers built. Realising that naval superiority was the key to taking Tyre, he temporarily left the siege and set off for Sidon to fetch his own ships. In addition, he also received vessels from Byblus, Aradus, Rhodes, Lycia, Cilicia and Macedon. The Kings of Cyprus sent another 120 ships to Sidon. In all, Alexander now had roughly 220 ships.\n\nRemove Ads Advertisement\n\nWhilst awaiting the arrival of the various naval contingents he spent 10 days inland, engaging in minor operations in Arabian territory. Upon his return to Sidon, he was pleased to note the arrival of Cleander, whom he had sent to Greece to recruit soldiers, with 4,000 mercenaries.\n\nWasting no further time, Alexander sailed for Tyre. His flagship was on the right of the fleet, and when within clear view of Tyre the fleet halted and held station, allowing the full impact of their appearance to dawn on the observers on the city walls. The Tyrians were taken by surprise: they had no idea until that moment that Alexander's fleet had swollen in size. They were now vastly outnumbered, and the promised help from Carthage had failed to materialise.\n\nAlexander as Ammon-Zeus Mark Cartwright (CC BY-NC-SA)\n\nAgainst such odds, a naval engagment was out of the question, and all the Tyrians could do was blockade the entrances to their two harbours. They floated a boom across the mouth of the southern, or Egyptian harbour, and moored Triremes in line across the entrance of the northern (Sidon) harbour.\n\nRemove Ads Advertisement\n\nAlexander tested the strength of these countermeasures with an assault on the Sidon harbour, in which 3 Tyrian galleys were rammed head-on and sunk, but he did not launch an all-out naval attack. Instead, he ordered his Cyprian contingent to blockade the northern harbour, and the Phoenician ships maintained a vigil at the southern end of the island. Siege engines were mounted on the mole, and on anchored ships, and commenced a sustained bombardment of the defences.\n\nAlexander was unable to get his ships close to the city itself because the Tyrians had hurled massive rocks into the sea beneath the walls. The siege now entered what was possibly its most laborious and dangerous phase.\n\nAlexander's ships lassoed some of the boulders and towed them away from the walls. In response, the Tyrians clad some of their galleys in armour plating and sallied out to cut the anchor cables of the besieging ships. Alexander armoured some of his own vessels and used them as a screen in front of his siege ships, but Tyrian divers continued to cut the cables of anchored ships. Alexander finally solved the problem by replacing rope cables with chains. More boulders were lassoed from the causeway and hoisted clear with cranes.\n\nRemove Ads Advertisement\n\nThroughout all of these operations, both sides engaged in a long and bitter artillery duel, and the Tyrians poured cauldrons of red-hot sand over the walls onto the besieging ships. Carried by the wind, it set vessels alight and penetrated clothing and armour, reducing men to charred, blistered agony. Although effective, such methods could hardly have endeared the defenders to the besiegers.\n\nRealising their imminent danger, the Tyrians spread sails across the mouth of the northern harbour, and, thus concealed, prepared a sortie. Thirteen galleys were manned with the finest oarsmen and marines the defenders could muster, and in the heat of the mediterranean afternoon they silently rowed out of the harbour in a single line. Most of the Cyprian ships blockading the Sidon harbour were undermanned and the Tyrians achieved total surprise, pressing home a ferocious assault to the accompaniment of roared warcries. Two Cyprian ships were sunk and many more scattered.\n\nGreek Hoplites [Artist's Impression] The Creative Assembly (Copyright)\n\nAlexander boarded a ship and personally led the counterattack with 5 Triremes and whatever Quinquiremes were ready for battle. Sailing around the island, he fell on the Tyrian flotilla, who immediately broke off their engagement and fled for the northern harbour. An unspecified number of Tyrian ships were damaged in the confused action which followed, with two galleys being captured at the mouth of the harbour. Most of the Tyrians managed to swim ashore to the safety of the city.\n\nThe Final Assault\n\nAlexander now brought his ships directly beneath the walls and began to pound them with battering rams. Greek forces at the northern end of the island attempted to make a breach but failed. A small breach was made in the southern defences but a Macedonian attack across causeways resulted only in casualties and failure.\n\nAlexander waited for three days before resuming his assault. Whilst diversionary attacks occupied the defenders attention, two ships with bridging equipment approached the southern breach. Alexander himself was in command of this force, which consisted mostly of elite hypaspists and pezhaitoroi. The Macedonians managed to force their way onto the wall: Admetus, commander of the Hypaspists, was the first man onto the battlements and was killed by a spear as he exhorted his men onward. Neverthless the assault was a success, and soon the Macedonians were pouring down into the city itself, killing and looting. After this initial breach was forced, Alexanders command was swollen as more and more Greeks and Macedonians succeeded in entering the city from various points, including the harbours.\n\nThe surviving Tyrians fell back to the Agenorium, an old fortress in the northern sector of the city, but only managed to hold out for a brief period before they were slaughtered. The besiegers blood was up, and, after a long and bitter siege, they were not inclined to be merciful. For months they had endured grinding labour, been tormented by artillery and archery, and witnessed the slaughter of their captured comrades on the city walls. Six thousand Tyrians were slaughtered when the city was taken, and another 2,000 crucified on the beach. A further 30,000 were sold into slavery. Amongst those spared were the King and his family, and a number of Carthaginian pilgrims who took sanctuary in the Temple of Melqart. Macedonian losses amounted to 400 slain.\n\nWith the siege finally over (it had started in January and ended in July), Alexander made his sacrifice to Heracles, and held a torch race and triumphal procession through the streets of the city. With Tyre subjugated, Alexander could turn his attention to subduing Gaza and Egypt."}, {"url": "https://www.thoughtco.com/alexander-the-great-siege-of-tyre-2360867", "page_content": "Siege of Tyre - Conflict & Dates:\n\nThe Siege of Tyre took place from January to July 332 BC during the Wars of Alexander the Great (335-323 BC).\n\nCommanders\n\nMacedonians\n\nAlexander the Great\n\nTyre\n\nAzemilcus\n\nSiege of Tyre - Background:\n\nHaving defeated the Persians at Granicus (334 BC) and Issus (333 BC), Alexander the Great swept south along the Mediterranean coast with the ultimate goal of moving against Egypt. Pressing on, his intermediate goal was to take the key port of Tyre. A Phoenician city, Tyre was situated on an island approximately half a mile from the mainland and was heavily fortified. Approaching Tyre, Alexander attempted to gain access by requesting permission to make a sacrifice at the city's Temple of Melkart (Hercules). This was refused and the Tyrians declared themselves neutral in Alexander's conflict with the Persians.\n\nThe Siege Begins:\n\nFollowing this refusal, Alexander dispatched heralds to the city ordering it to surrender or be conquered. In response to this ultimatum, the Tyrians killed Alexander's heralds and threw them from the city walls. Angered and eager to reduce Tyre, Alexander was faced with the challenge of attacking an island city. In this, he was further hampered by the fact that he possessed a small navy. As this precluded a naval assault, Alexander consulted his engineers for other options. It was quickly found that the water between the mainland and the city was relatively shallow until shortly before the city walls.\n\nA Road Across the Water:\n\nUsing this information, Alexander ordered the construction of a mole (causeway) that would stretch across the water to Tyre. Tearing down the remains of the old mainland city of Tyre, Alexander's men began building a mole that was approximately 200 ft. wide. The early phases of construction went smoothly as the city's defenders were unable to strike at the Macedonians. As it began to extend farther into the water, the builders came under frequent attack from Tyrian ships and the city's defenders who fired from atop its walls.\n\nTo defend against these assaults, Alexander constructed two 150 ft.-tall towers topped with catapults and mounting ballistas to drive off enemy ships. These were positioned at the end of the mole with a large screen stretched between them to protect the workers. Though the towers provided the needed defenses for construction to continue, the Tyrians quickly devised a plan to topple them. Constructing a special fire ship, which was weighted down aft to raise the bow, the Tyrians attacked the end of the mole. Igniting the fire ship, it rode up onto the mole settling the towers ablaze.\n\nThe Siege Ends:\n\nDespite this setback, Alexander endeavored to complete the mole though he became increasingly convinced that he would need a formidable navy to capture the city. In this, he benefited from the arrival of 120 ships from Cyprus as well as another 80 or so that defected from the Persians. As his naval strength swelled, Alexander was able to blockade Tyre's two harbors. Refitting several ships with catapults and battering rams, he ordered them anchored near the city. To counter this, Tyrian divers sortied out and cut the anchor cables. Adjusting, Alexander ordered the cables replaced with chains (Map).\n\nWith the mole nearly reaching the Tyre, Alexander ordered catapults forward which began bombarding the city walls. Finally breaching the wall in the southern part of the city, Alexander prepared a massive assault. While his navy attacked all around Tyre, siege towers were floated against the walls while troops attacked through the breach. Despite fierce resistance from the Tyrians, Alexander's men were able to overwhelm defenders and swarmed through the city. Under orders to slay the inhabitants, only those who took refuge in the city's shrines and temples were spared.\n\nAftermath of the Siege of Tyre:\n\nAs with most battles from this period, casualties are not known with any certainty. It is estimated that Alexander lost around 400 men during the siege while 6,000-8,000 Tyrians were killed and another 30,000 sold into enslavement. As a symbol of his victory, Alexander ordered the mole to be completed and had one of his largest catapults placed in front of the Temple of Hercules. With the city taken, Alexander moved south and was forced to lay siege to Gaza. Again winning a victory, he marched in Egypt where he was welcomed and proclaimed pharaoh.\n\nSelected Sources"}, {"url": "https://alexander-the-great.org/alexanders-campaign/siege-of-tyre", "page_content": "Alexander's Campaign > Siege of Tyre\n\nAlexander III the Great's siege of Tyre in 332 BCE is probably one of the best instances of his military genius and ingenuity. The Phoenician city of Tyre was a small island in the Mediterranean Sea off the coast of modern day Turkey. In ancient times, Tyre was one of the most prosperous trading ports in the entire world and was one of the most powerful maritime empires in the region. As he passed by on his way to conquer Persia he determined with his generals he could not leave Tyre to plot against him later.\n\nControl over Tyre also meant control over the Mediterranean sea and this was something that was a great military advantage if he was going to successfully control Egypt and truly establish his empire. Therefore the city needed to be taken. However, it was surrounding by guard ships and had 150 foot walls that surrounded the island. Alexander only had a ground based army, so what was he to do?.\n\nUpon arriving Alexander knew what needed to be done. He was going to mobilize his engineers to build a massive earthen walkway from the ancient ruins of Tyre to the island in order to bring his land army to them. This land bridge would be wide enough to accept siege vehicles and would allow them to easily take the city. However, this is a great idea in theory but the practicality of building a massive land bridge to a city that is surrounding by hostile ships and facing besieged defenders is something different.\n\nThe stones and building materials from the ancient city of Tyre would provide most of the material resources to do this, so Alexander now worked on a plan to protect his men while this work was being done. Alexanders troops normally supported him to the fullest and this was no exception. The prospect of building a land bridge to capture one of the greatest cities in the region led to great enthusiasm and moral.\n\nDam Construction\n\nMost of the material involved in constructing a massive earthen project like this involves a stone base with dirt and earth more or less used as filler. Massive wooden stakes are also used to support the structure. If a structure was made totally of dirt in the water, it would collapse upon the weight of men and siege towers. Waves would also easily erode it.\n\nTo accomplish the construction of this project, Alexander sent his soldiers into the woods of Lebanon to cut down trees to get the necessary supplies. The cedars in Phoenicia were very famous in ancient times so Alexander's men chopped down the trees and hauled them back to their camp. They sharpened one end of the tree and pounded it into the sand like a giant tent spike. This would protect the sides of their dam. While some soldiers pounded the giant trees into the ground, others were demolishing the ruins of the land based city of Tyre and bringing them to the shore to be dumped into the sea.\n\nThe people of Tyre did not really notice what was going on at first, as they may have simply thought Alexander was building beach fortifications. They never thought he would build an earthen bridge to them. However, soon it became apparent as to what Alexander and his army were doing and the people of Tyre became rightly alarmed. As the earthen structure began to grow in size day after day after day the people of Tyre began really mounting their defense. The people of Tyre began building anti-siege weaponry on their massive 150 foot walls that would fling massive stones and darts at the incoming Greeks. They also sent some of their agents ashore to make diplomatic alliances with several neighboring tribes. The people of Tyre had great wealth and if they survived, these tribes would be greatly rewarded.\n\nSo Tyre tasked these tribes with disrupting the gathering of resource efforts by Alexander's army. Tyre also landed a small contingent of its own men on the shore and tried to repel the stone gathering operation at the ancient ruins of Tyre. Having a considerable navy with their manned war galleys that protected their merchants from pirates, Tyre decided to respond even further. The war galleys rode right up to the construction side of the earthen dam walkway and bombarded the crew with all sorts of arrows and projectiles. While the first offense of Tyre slowly impeded Alexander's efforts, ultimately what they did was in vain. Alexander resumed his construction efforts right away and began building defensive structures around the camps. Alexander and his army built huge screens of wood and covered them with animal hides to protect them from any projectiles launched while they were working.\n\nAs the work advanced more defensive structures were built, especially at the sides and the front facing the city. These structures consisted partially of the great siege engines required for driving the massive wooden piles into the sea, along with catapults for throwing massive stones. Soldiers would also be able to throw stones, darts and shoot the galleys with bows and arrows from these siege towers which prevented them from getting too close to the workers.\n\nFire & Water\n\nAfter their first attacks failed, the Tyrians knew they had to come up with a new plan to destroy this earthen walkway that was slowly approaching them. The people of Tyre came up with the same idea that the infamous pirates of Nassau did when the British rolled into their pirate town and claimed law of the land, they built a fireship.\n\nTyre decided to take a massive war galley and fill it with all kinds of combustibles such as dry wood, tar, oil and anything else to make the ship burn more. They soaked all of the rigging and all of the sails in oil, as to make the ship instantly combust when necessary. On a windy day they towed the ship right up to the point of Alexander's project and when they got close enough the men set the ships on fire and rowed away in boats.\n\nThe ship exploded into flame and drifted right into the largest concentration of siege engines and construction efforts. Alexander's soldiers attempted to alter the course of the fireship but it did not work. The entire complicated wooden construction effort at the front of the structure was engulfed in flames very quickly. While Alexander's army made attempts to put out the fire, it was of no use and they were forced to retreat. A few men were lost in the process and the entire construction apparatus was destroyed.\n\nNext, a storm finished off the burnt remains of Alexander's efforts while his army looked on with dismay from the shore. When the storm subsided however, Alexander and his army resumed their efforts with even more furor than before. As they increased the strength and widened it, they also added fireproofing measures to the construction vehicles themselves. Soon the embankment had not only been repaired but was slowly beginning to advance towards the city of Tyre.\n\nLast Defense of Tyre\n\nDuring the entire construction effort of Alexanders embankment, the massive war galleys of Tyre were a constant pain as they lobbed all sorts of projectiles from their decks. In order to combat this Alexander went to the city-state of Sidon north of Tyre and requested their assistance in his engagement. Using this small maritime force they created a makeshift blockade in order to protect the workers.\n\nAs the Tyrians realized their impending battle they decided to evacuate many of the women and children to the African city of Carthage. The people of Tyre were prepared to defend their city to the bitter end if necessary, but did not want their women and children around if the outcome was not in their favor.\n\nHowever, as the siege began to prolong Alexander grew ever more angry and ever more impatient. The Tyrians knew they could not surrender at this point, and both sides knew this was going to be a bloody conflict. Both sides grew ever more cruel to each other, torturing captured soldiers in an every increasing fashion. As Alexanders earthen path grew closer and closer to the city more and more resources were cut off. Soon the earthen wall reached right up to the walls of the city and Alexander's siege began.\n\nAs Alexander's massive siege structures such as battering rams pounded away at Tyre's massive walls they soon began to make significant progress on the southern side of the city. Soon the Tyrians began to realize an all out assault of their city was imminent. Alexander mobilized his navy from Sidon to block off the southern portion of the city while they created a system of platforms that would allow his men to pass through the hole created in Tyre's walls.\n\nThe breach was successful, however Alexander's forces incurred heavy casualties as the Tyrians hurled darts, stones and arrows down onto the advancing soldiers. Hundreds of soldiers were killed and their bodies simply pushed into the sea as other soldiers streamed in overtop of them.\n\nEventually though Alexander's forces broke into the city streets and they began to pour through the rich neighborhoods. Seven months of hatred and pent up aggression led Alexander's army to commit unspeakable carnage in the city, looting and destroying everything in their wake. The city of Tyre was taken.\n\nAlexander's Brutality\n\nEven after the soldiers became exhausted from slaughtering Tyrians there remained many alive. Up until this point Alexander had a reputation for generosity and mercifulness. However, today those virtues were thrown out the window as Alexander ordered the execution and crucification of nearly two thousand men.\n\nMany historians note that Alexander had lost the modesty of his earlier life, and had become increasingly cruel and arrogant. This is to be noted as it sets a precedent of behavior that may encourage members of his own organization to begin plotting his assassination.\n\nMessage to Darius\n\nLegacy & Impact\n\nA good illustration of this is afforded by the answer that he sent to Darius, about the time of the storming of Tyre, in reply to a second communication which he had received from him proposing terms of peace. Darius offered him a very large sum of money for the ransom of his mother, wife, and child, and agreed to give up to him all the country he had conquered, including the whole territory west of the Euphrates. He also offered him his daughter Statira in marriage. He recommended to him to accept these terms, and be content with the possessions he had already acquired; that he could not expect to succeed, if he should try, in crossing the mighty rivers of the East, which were in the way of his march toward the Persian dominions.Alexander replied, that if he wished to marry his daughter he could do it without his consent; as to the ransom, he was not in want of money; in respect to Darius's offering to give him up all west of the Euphrates, it was absurd for a man to speak of giving what was no longer his own; that he had crossed too many seas in his military expeditions, since he left Macedon, to feel any concern about the rivers that he might find in his way; and that he should continue to pursue Darius wherever he might retreat in search of safety and protection, and he had no fear but that he should find and conquer him at last.It was a harsh and cruel message to send to the unhappy monarch whom he had already so greatly injured. Parmenio advised him to accept Darius's offers. \"I would,\" said he, \"if I were Alexander.\" \"Yes,\" said Alexander, \"and so would I if I were Parmenio.\" What a reply from a youth of twenty-two to a venerable general of sixty, who had been so tried and faithful a friend, and so efficient a coadjutor both to his father and to himself, for so many years.\n\nThe siege of the city of Tyre is considered one of the best military achievements of Alexander III the Great. The ingenuity involved and the massive resourcefulness of his entire army was able to accomplish something that would make engineers today blush. After seven months of backbreaking work while getting shot at by arrows the Macedonians finally poured into the city of Tyre and captured the wealthiest city on the Mediterranean.\n\nThe ramifications of this event would reverberate throughout the ancient world and much like the previous victories at the Battle of the Granicus and the Battle of Issus which would allow him to take a lot of future victories without effort. At this point Alexander's reputation was cemented in the ancient world and Darius III was on the ropes. The momentum he gained in Tyre would allow him to liberate Egypt before walking through Babylonia and eventually resting in the city of Babylon.\n\nAfter resting in Babylon the Macedonian army led by Alexander continued onto the Battle of Gaugamela where using brilliant military tactics the Persian army was crushed once again and Darius was sent fleeing into the hills once again. Murdered by his own men a few weeks later Alexander the Great was officially the king of the vanquished Achaemenid Empire.\n\nYet his conquest would not continue there as Alexander would campaign all through Bactria and India before finally coming back to Babylon to die suddenly and unexpectedly. Overall, Alexanders entire life was the battle and that was all he knew. Yet this event was one that rose even higher in his legacy and was one of the greatest feats to ever be accomplished by him. Tyre was the richest city in the region and its conquest was a great moral and wealth victory for him and his forces. Oh and another important legacy that still exists today? The city of Tyre is still no longer and island and the land bridge that Alexander constructed is still there today.\n\nSee Carthaginian Empire\n\nIn the aftermath of the siege of Tyre many of the wealthiest citizens were able to buy their lives and escape to Carthage. Many of the people of Tyre had already evacuated there before the impending siege. So when the wealthy refugees of Tyre arrived they were quickly able to rebuild the Phoenician maritime trading network into the Carthaginian Empire and within one hundred years Carthage had become the wealthiest city on the Mediterranean.\n\nThis escape to Carthage allowed the Phoenician culture to live on at least for a couple hundred more years. In fact, the city would grow so prosperous that it would build a completely new civilization, culture and empire known as Punic. After the Carthage was utterly destroyed and the Phoenician civilization wiped out for good."}, {"url": "https://contextisking.com/2021/05/09/lessons-from-alexander-the-greats-siege-of-tyre-332-bc/", "page_content": "Tyre was a fortress island off the coast of modern day Lebanon. The city was a strategic coastal base on the Mediterranean Sea. Alexander was so enraged at the Tyrians’ defence of their city and the loss of his men that he destroyed half the city.\n\nAlexander the Great’s Siege of Tyre remains one of the greatest displays of maritime combat. The following is an excerpt from my second book, The Confessions of Alexander the Great. There are so many takeaways and lessons, but the main one is usually the goal you want to accomplishment is a two-step process. Read on and you will understand what I mean.\n\nPERSIST, PERSEVERE, PROFIT\n\nSiege of Tyre\n\nDespite the criticism, Thebes remains one of my greatest domestic policy missions. One of my most impressive foreign policy ones was Tyre. What I may have tried to spin as our seven-month stay at the Tyre Resort proved to be a real challenge to my men and my leadership. To this day, it is known as the Siege of Tyre.\n\nTyre was an island fortress off the coast of modern day Lebanon along the Eastern Mediterranean shoreline. Tyre was a naval base that served as home to many in Persia’s navy. It was essential for me to capture it in order to break Persia’s naval strength. I made a friendly overture to Tyre, but they refused, countering with an alliance at the very best. I sought submission.\n\nMy entire journey took thirteen years. From 356 BC to 323 BC, I fought hard. From 356 BC to 355 BC, the fighting was within the Ancient Greece, from 355 BC to 323 BC, it was on the global front.\n\nThat’s twelve years outside of Greek territory, covering twenty-two thousand miles over Greece, Egypt, Persia and India. So when one stop on my world tour put up considerable resistance, or in this case, just under ten percent of the total time of the mission, I would feel considerably slighted and compelled to leave my mark when it was all said and done.\n\nYou guessed it: Tyre was one such stop.\n\nOver the course of my life, I battled on foot; I battled on horseback. I battled on land; I battled on the seas. Nowhere was sea warfare more memorable than the siege of Tyre.\n\nThe city was valuable to me because it provided control of the Eastern Mediterranean. After all, a secure port was required for supplies, logistics and commercial activity during war and peace. Foregoing its capture would invariably prove costlier than the cost to defeat it.\n\nI met considerable resistance in Tyre and was refused entry to the island fortress. But this was no deterrent to my men and me.\n\nTyre was about half a mile off the mainland. By our measures, the water surrounding it was eighteen feet deep. Tack on tall walls of over one hundred feet high. Any way I looked at it, we faced a daunting task. There was no land between the surrounding water and foot of the walls. The Tyrians knew that we were coming (who didn’t?), had isolated themselves, stocked up and were willing to bide their time.\n\nTime was not something that I had to spare, but spare some I did.\n\nThe question was not whether we would storm the island fortress, but how, and how long it would take us.\n\nWith few options, my men started to build a bridge. That’s right, a bridge! Before you get too impressed, this was no Wonder of the World; it was actually a two hundred yard wide mole. Was this done overnight? Of course not. But once it was built, it would help me seize the fortress island and teach the Tyrians a lesson they would not soon forget, on par with the lesson I taught Thebes.\n\nThings got messy. I do not think I underestimated the Tyrians, but we spent seven months playing chess, figuratively speaking of course. We had to erect one hundred fifty foot tall towers to mount catapults since those pesky Tyrians had proceeded to fire red-hot sand at us. This makeshift weapon caused considerable carnage, burning human skin and flesh. Its use was considerably appalling.\n\nEventually, we got through the wall, piercing a hole big enough to advance into the city.\n\nUpon penetrating the island fortress of Tyre after a seven month siege, we had to show the Tyrians who was boss.\n\nWe had to inflict a punishment worthy of the resistance. That’s the way it was. Had we been soft on them, others would have found out and resisted too. Tyrians had also mistreated Macedonian prisoners, taking the captured, raising them to the top of the wall, killing them and tossing them into the sea for us to see. It was demoralizing some of my men.\n\nWe slaughtered about eight thousand in all. We then sold thirty thousand more into slavery.\n\nToday, the citizens of Tyre can thank me for connecting the island of Old Tyre with the mainland of New Tyre.\n\nIn the end, we persisted, persevered and ultimately profited by virtue of having secured the Eastern Mediterranean shoreline. To this day, the Siege of Tyre remains one of the greatest military achievements ever.\n\nOrder the book on Amazon, or read why I’d write such a book in the first place. But if you want a free eBook, just hit me up.\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://brewminate.com/the-siege-and-fall-of-ancient-tyre-to-alexander-the-great-in-332-bce/", "page_content": "Image by Frank Martini, Cartographer, Department of History, United States Military Academy / Wikimedia Commons\n\nAlexander, unable to attack from the sea, built causeway stretching out to the island on a natural land bridge no more than two meters deep.\n\nCurated/Reviewed by Matthew A. McIntosh\n\nPublic Historian\n\nBrewminate\n\nIntroduction\n\nThe Siege of Tyre was orchestrated by Alexander the Great in 332 BC during his campaigns against the Persians. The Macedonian army was unable to capture the city, which was a strategic coastal base on the Mediterranean Sea, through conventional means because it was on an island and had walls right up to the sea. Alexander responded to this problem by first blockading and besieging Tyre for seven months, and then by building a causeway that allowed him to breach the fortifications.\n\nIt is said that Alexander was so enraged at the Tyrians’ defence of their city and the loss of his men that he destroyed half the city. According to Arrian, 8,000 Tyrian civilians were massacred after the city fell. Alexander granted pardon to all who had sought sanctuary in the temple, including Azemilcus and his family, as well as many nobles. 30,000 residents and foreigners, mainly women and children, were sold into slavery.\n\nLocation\n\nLocation of the Siege of Tyre / DEMIS Mapserver, Wikimedia Commons\n\nTyre, the largest and most important city-state of Phoenicia, was located both on the Mediterranean coast as well as a nearby island with two natural harbours on the landward side. The island lay about a kilometre from the coast in Alexander’s days, its high walls reaching 45.8 m (150 ft) above the sea on the eastern, landward facing, side of the island.\n\nBackground\n\nTyre view from an airplane, 1934 / Wikimedia Commons\n\nAt the time of the siege, the city held approximately 40,000 people, though the women and children had been evacuated to Carthage, the former Phoenician colony and then Mediterranean power. The Carthaginians also promised to send a fleet to their mother city’s aid. As Alexander did not have access to his own navy, he resolved to take the city and thus deny the Persians their last harbour in the region.\n\nAlexander knew of a temple to Melqart, whom he identified with Heracles, within the new city walls and informed the inhabitants that they would be spared if he were allowed to make a sacrifice in the temple[1] (the old port had been abandoned and the Tyrians were now living on an offshore island a kilometre from the mainland). The defenders refused to allow this and suggested he use the temple on the mainland, saying that they would not let Persians or Macedonians within their new city. A second attempt at negotiation resulted in Alexander’s representatives being killed and then thrown from the walls into the sea. Alexander was enraged at the Tyrian defiance and ordered the siege to commence.[2]\n\nThe Siege\n\nAlexander the Great at the Siege of Tyre / Wikimedia Commons\n\nAfter this set back, Alexander was convinced that he would not be able to take Tyre without a navy. However, his previous victory at Issus and subsequent conquests of the Phoenician city states of Byblos, Arwad and Sidon had meant that the fleets of these cities, which had composed most of the Persian navy, came under his banner. This immediately gave him command of a fleet of 80 ships. This development coincided also with the arrival of 120 war galleys sent by the king of Cyprus, who had heard of his victories and wished to join him. With the arrival of another 23 ships from the Greek city states of Ionia, Alexander had 223 galleys under his command, giving him command of the sea.\n\nA naval action during the siege. Drawing by André Castaigne, 1888-1889. / Wikimedia Commons\n\nWith his new fleet, Alexander’s forces sailed on Tyre and quickly blockaded both ports with its superior numbers. Alexander had several of the slower galleys and a few barges refitted with battering rams. Finding that large underwater blocks of stone kept the rams from reaching the walls, Alexander had them removed by crane ships. The rams were then anchored near the walls, but the Tyrians sent out ships and divers to cut the anchor cables. Alexander responded by replacing the cables with chains.\n\nThe Tyrians launched another counter-attack, but according to Arrian, were not so fortunate this time. They noticed that Alexander returned to the mainland at the same time every afternoon for a meal and a rest along with much of his navy. They therefore attacked at this time, but found Alexander had skipped his afternoon nap, and was able to quickly counter the sortie.[3]\n\nConclusion of the Siege\n\nAlexander started testing the wall at various points with his rams, until the rams made a small breach in the south end of the island. He then coordinated an attack across the breach with a bombardment from all sides by his navy. Alexander is said to have personally taken part in the attack on the city, fighting from the top of a siege tower.[4] Once his troops forced their way into the city, they easily overtook the garrison, and quickly captured the city.\n\nThose citizens who took shelter in the temple of Melqart were pardoned by Alexander, including the king of Tyre. According to Quintus Curtius Rufus 6,000 fighting men were killed within the city and 2,000 Tyrians were crucified on the beach.[4] The others, some 30,000 people, were sold into slavery. The severity of reprisals reflected the length of the siege and Alexander’s response to the Tyrians having executed some of his soldiers on the walls, in sight of the attackers.\n\nFollowing the capture of Tyre, Alexander moved south to attack Gaza.\n\nAlternative Conclusion\n\nPolyaenus the Macedonian, in one of the two stratagems he gives about Alexander’s siege of Tyre, provides a different account of Alexander’s conquest of the city. According to him, Alexander had marched into Arabia having left Parmenion in charge of the besieging force. The Tyrians found the courage to exit their walls and engage the Greeks, often beating them in various skirmishes. Alexander was informed and hurried back, reaching the city exactly when the Tyrians were fighting against a retreating Parmenion. Instead of attacking the Tyrians, he chose to march directly to the city, which he immediately took by force surprising its remaining garrison. Another view is that Alexander was so incensed at having to build a bridge to take the city of Tyre that he decided to kill or enslave most of Tyre’s population.[5]\n\nEndnotes\n\nOriginally published by Wikipedia, 11.21.2004, under a Creative Commons Attribution-ShareAlike 3.0 Unported license.\n\nLike this: Like Loading...\n\nComments\n\ncomments"}, {"url": "https://alexander-the-great.org/alexanders-campaign/siege-of-gaza", "page_content": "Alexander's Campaign > Siege of Gaza\n\nSiege of Gaza\n\nBackground\n\nThe Siege of Gaza occurred following the successful Siege of Tyre in 332 BCE and involved the assault of the city of Gaza by the Macedonians during the Persian Campaign of Alexander III the Great. The city during this time had very high walls and rose over 60 feet high in the desert to defend the surrounding territory. Besieging this city was a formidable obstacle to overcome. However, after three unsuccessful siege attempts using the same machines he previously sent against Tyre, he managed to capture the city and the stronghold.\n\nBatis expected that he would managed to hang on to the satrapy of Egypt and in doing so he attempted to garrison a force to defend the territory along the eastern shores of the Mediterranean Sea. As Alexander arrived at the city he and his engineers determined the southern wall to be the weakest and the best side to breach. In order to overcome the high walls of Gaza the Macedonians built massive mounds that even defied the engineers expectations on quickly they could be built.\n\nDuring one of the days during the siege the Gazans bombarded the Macedonians in an attempt to dislodge and destroy their siege equipment. Alexander's shoulder was injured in the encounter however, this did not diminish his resolve. The Macedonians continued to build the mounds around Gaza until the arrival of the siege equipment from Tyre. The entry of more siege equipment allowed the wall to be broken much more quickly and soon major sections were falling apart.\n\nSiege of Gaza - Alexander (1891)\n\n\n\nNotice: Undefined variable: aspis in /home/humanityhistory/public_html/addons/domains/alexander-the-great.org/alexanders-campaign/siege-of-gaza.php on line 102\n\n\n\nNotice: Undefined variable: aspis in /home/humanityhistory/public_html/addons/domains/alexander-the-great.org/alexanders-campaign/siege-of-gaza.php on line 104\n\n\n\nAfter three attempts to breach the walls and enter the city the Macedonians were finally successful in overcoming the defenses of Gaza. As the Macedonians poured in through the walls the Gazans fought them to the end. Soon the city was captured and Alexander was able to assert control over the path of land connecting Asia Minor, Syria and Egypt. Aftermath When Gaza was finally captured by Alexander he executed all of the men and sold the women and children into slavery. With Gaza eliminated there was a clear path of mobility and communication between Greece and Egypt and this would allow him to continue his advance throughout the Persian Empire. According to the Roman historian Quintus Curtius Rufus, Batis was treated by Alexander in the same manner that Achilles treated Hector following the siege of Troy during the Trojan War. According to his account a rope was forced through the ankles of Batis and then he was dragged alive by a chariot beneath the walls of the city. Alexander who normally showed restraint towards his enemies was infuriated by the personality of Batis and his refusal to acknowledge Alexander by kneeling. For this Alexander promptly had him executed in a horrible manner. From here Alexander would continue to march unimpeded into Egypt and conquer the territory without much issue.\n\n+ Balkan Battles\n\n+ Persian Battles\n\n+ Indian Campaign Battles\n\nSources\n\nPrimary Sources\n\nSecondary Sources\n\nD. W. Engels: Alexander the Great and the Logistics of the Macedonian Army, University of California Press, Berkeley and London, 1978, ISBN 0-520-04272-7, pp. 72f. (fn. 7)\n\nAlexander - A History of the Origin and Growth of the Art of War from the Earliest Times to the Battle of Ipsus, B.C. 301, with a Detailed Account of the Campaigns of the Great Macedonian - Theodore Ayrault Dodge"}, {"url": "https://www.gotquestions.org/Tyre-in-the-Bible.html", "page_content": "Question\n\nAnswer\n\nTyre is thought to be one of the oldest cities on the Phoenician coast, established long before the Israelites entered the land of Canaan. Isaiah affirms Tyre’s ancient origins as “from days of old” (Isaiah 23:5–7).Tyre is situated on the Mediterranean coast directly north of Jerusalem between the mountains of Lebanon and the Mediterranean Sea, about 20 miles south of Sidon and 23 miles north of Acre. Neighboring Sidon is believed to be the oldest Phoenician city, but Tyre’s history is more distinguished. The name Tyre (in Hebrew) signifies “a rock,” an apt description for the rocky coastal fortress. In ancient times, Tyre flourished as a maritime city and a busy center for commercial trade. The area’s most valuable export was its then world-famous purple dye.Originally, the ancient city was divided into two parts: an older port city (“Old Tyre”) located on the mainland and a small rocky island about a half-mile off the coast where most of the population resided. The island has been connected to the mainland ever since Alexander the Great built a siege ramp to it in the late fourth century BC. The causeway has widened over the centuries, creating Tyre’s current-day peninsular formation.The Bible first mentions Tyre in a list of cities that were part of the inheritance of the tribe of Asher (Joshua 19:24–31). Fortified with a wall, Tyre held an exceedingly strong position. It was the only city in the list described as “strong” or “fortified” (verse 29). Joshua was unable to capture Tyre (Joshua 13:3–4), and, evidently, it was never conquered by the Israelites (2 Samuel 24:7).By the time of King David’s reign, Israel had formed a friendly alliance with Hiram king of Tyre. David used stonemasons and carpenters from Tyre, along with cedars from that region to build his palace (2 Samuel 5:11). Peaceful relations with King Hiram continued into Solomon’s reign, with the construction of the temple in Jerusalem relying heavily on supplies, laborers, and skilled artisans from Tyre (1 Kings 5:1–14; 9:11; 2 Chronicles 2:3).Israel continued to share close ties with Tyre during King Ahab’s reign. Ahab married the Phoenician princess Jezebel , daughter of Ethbaal, king of Sidon, and their union led to the infiltration of pagan worship and idolatry in Israel (1 Kings 16:31). Both Tyre and Sidon were notorious for their wickedness and idolatry, which resulted in numerous denouncements by Israel’s prophets, who predicted Tyre’s ultimate destruction (Isaiah 23:1; Jeremiah 25:22; Ezekiel 26; 28:1–19; Joel 3:4; Amos 1:9–10; Zechariah 9:2–4).After the restoration of Jerusalem in Nehemiah’s time, the people of Tyre violated the Sabbath rest by selling their goods in the markets of Jerusalem (Nehemiah 13:16). In 332 BC, after a seven-month siege, Alexander the Great conquered Tyre, putting an end to Phoenician political control, but the city retained its economic power.In the New Testament, Jesus mentions Tyre as an example of an unrepentant city (Matthew 11:21–22; Luke 10:13). Jesus also ministered in the district of Tyre and Sidon, healing the demon-possessed daughter of a Canaanite woman (Matthew 15:21–28).The persecution that arose after Stephen’s death caused the Christians in Jerusalem to scatter. As a result, a church was established in Tyre (Acts 11:19). Paul spent a week there with the disciples on the return voyage of his third missionary journey (Acts 21:2–4).In 1291, Tyre was completely destroyed by the Saracens, eerily fulfilling Ezekiel’s prophecy: “They will destroy the walls of Tyre and pull down her towers; I will scrape away her rubble and make her a bare rock. Out in the sea she will become a place to spread fishnets, for I have spoken, declares the Sovereign LORD. She will become plunder for the nations” (Ezekiel 26:4–5). The island has remained a desolate ruin ever since."}, {"url": "https://coinsandhistoryfoundation.org/2021/03/30/blood-money-the-shekel-of-tyre/", "page_content": "The silver tetradrachm (shekel) struck by the mint at Tyre features prominently in several pivotal events in the life of Jesus of Nazareth as documented in the New Testament. It is likely to be the coin that Jesus told his disciple Simon Peter that he would find miraculously in the mouth of a fish. It was probably one of the coins that tumbled to the ground when Jesus overturned the tables of the money changers in the temple courtyard. And perhaps most significant of all, it is believed to be the coin that Judas Iscariot received thirty of in exchange for betraying his master to the authorities.\n\nBy the time the ancient Phoenician port city of Tyre was conquered by the Macedonian King Alexander III “the Great” in 332 BC, it had already acquired a reputation within the region for the quality of its silver coinage. Coins continued to be struck there under the authority of the Greek kings, and when the Romans arrived in the Eastern Mediterranean, they permitted the mint to strike an ‘independent’ silver coinage from about 125 BC comprising silver tetradrachms (shekels) weighing about 14 grams, and didrachms (half shekels) weighing about 7 grams.\n\nWith only minor exceptions, the design of the coin remained constant for nearly two centuries. It was modelled on the tetradrachm struck by their last Greek king, Demetrius II, who was executed near Tyre in 125 BC. His portrait on the coin was replaced with the Tyre god Melkart, son of Baal. The reverse depicts an eagle with a palm branch over its shoulder and perched on the bow of a ship. The inscription can be translated, ‘Tyre, the Holy and Inviolable’ together with the date of issue, which allows them to be dated accurately.\n\nDespite depicting the head of a pagan god and a graven image, both of which were deeply objectionable to neighbouring Jews, the silver coin struck at Tyre became the only currency accepted by the Jewish religious authorities to pay the annual temple tax. This is because it was struck in the purest silver available in the region (about 95%) making it significantly more valuable than the Roman silver coins imported from the Far East that contained only about 80% silver.\n\nThe temple tax was introduced by Moses the lawgiver, who instructed every adult male over the age of twenty to make the annual contribution of half a shekel. This was about two days wages for a skilled labourer, and the tax was to be used for the building and upkeep of the temple.\n\n“The rich are not to give more than a half shekel, and the poor are not to give less when you make the offering to the Lord to atone for your lives.” (Exodus 30:15 – NIV)\n\nThe modest sum enabled Jews of all economic levels to take part in the building of the temple, and when the construction was completed, the tax continued to be collected from every household to pay for the running costs of the temple.\n\nIn 18 BC, the letters’ KPA’ or ‘KP’ were added to the reverse of the coin, which has led some scholars to believe that the coin’s production moved from Tyre to a location in or close to Jerusalem itself. Given their reliance on the coin for the temple tax, if Tyre did stop producing the coins, the Jewish religious leaders would most likely have requested permission from the authorities to carry on making them in or near Jerusalem. The Romans prohibited the minting of local currency in Judea but may have been prepared to make an exception to keep the peace as long as they continued to use the same design. It has been suggested that the new letters may have been an acrostic that stood for “By Authority of the Roman Constitution”.\n\nIf true, then we have the astonishing spectacle of Jewish religious leaders seeking permission to strike a coin that they considered blasphemous, bearing a design that was expressly prohibited by the Ten Commandments. They would compel devout Jews to use this coin to pay their annual contribution for the upkeep of God’s Holy temple. One can only imagine what Moses would have made of that!\n\nOne Tyre shekel would pay the temple tax for two men, which is illustrated in Jesus’ exchange with his disciple, Simon Peter. When a tax collector challenged the disciple to say whether his master paid the temple tax, Simon Peter affirmed that he did. After pointing out that the sons of rulers are exempt from the taxation demanded by their fathers, Jesus gave him an unusual task to demonstrate both his miraculous power and his humility;\n\n“But so that we may not cause offence, go to the lake and throw out your line. Take the first fish you catch; open its mouth and you will find a four drachma coin. Take it and give it to them for my tax and yours.” (Matthew 17:24-27 NIV).\n\nThe coin that the disciple found in the mouth of a fish was most likely a Tyre shekel, as only this would have been sufficient to pay the temple tax for both men.\n\nFor Israelites, the design of the Tyre shekel violated the first two of the Ten Commandments given to them by Moses, which forbade the use of foreign deities and graven images. Consequently, no self-respecting Jew would use this coin in their day-to-day transactions, particularly one which described a foreign city as holy. Nonetheless, since this was the only currency accepted by the Jewish religious leaders for the annual temple tax, it meant that the temple vault would have been filled with silver coins depicting a foreign god!\n\nTo pay the temple tax, devout Jews were compelled to exchange their regular currency for the ‘blasphemous’ silver coinage of Tyre. To facilitate this, a thriving market of money changers set up shop in the temple courtyards and charged hefty commissions for their services. Since Jews wishing to pay the temple tax had no alternative but to pay their inflated rates to obtain Tyre shekels and half shekels, this also violated Moses’ instruction that no individual should pay more or less than half a shekel.\n\n\n\nThis was the scene that greeted Jesus when he arrived at the temple shortly after making a triumphant arrival in Jerusalem in circa AD 30.\n\n“Then Jesus went into the temple of God and drove out all those who bought and sold in the temple and overturned the tables of the money changers … And He said to them, “It is written, ‘My house shall be called a house of prayer,’ but you have made it a ‘den of thieves.'” (Matthew 21:12-13 NIIV)\n\nJesus’ outrage at finding money changers profiteering from the temple tax, together with his authoritative teaching and miraculous healings, alarmed the religious leaders who felt threatened by his popularity. As they began plotting how to have Jesus arrested and put to death, one of his disciples came to them with an offer they couldn’t refuse.\n\n“Then one of the Twelve—the one called Judas Iscariot—went to the chief priests and asked, “What are you willing to give me if I deliver him over to you?” So they counted out for him thirty pieces of silver. From then on Judas watched for an opportunity to hand him over.” (Matthew 26:14-16 NIV)\n\nSince shekels from Tyre were the only currency accepted at the Jerusalem Temple, these were likely to be the coins that Judas received for betraying his master. Within hours of betraying Jesus in the Garden of Gethsemane, Judas realised the enormity of what he had done and, filled with remorse, tried to return the thirty silver coins to the chief priests, claiming that he had betrayed innocent blood. Now that they had their prize, the chief priests were indifferent to his anguish and told him that this was his responsibility. The New Testament informs us that Judas threw the shekels into the temple, went away and hanged himself.\n\nJudas’ suicide presented the religious leaders with the dilemma of what to do with the coins;\n\n“The chief priests picked up the coins and said, “It is against the law to put this into the treasury since it is blood money.” So they decided to use the money to buy the potter’s field as a burial place for foreigners. That is why it has been called the Field of Blood to this day.” (Matthew 27:6-8 NIV)\n\nGiven the prominent role that the Tyre shekel played in the life of Jesus of Nazareth, it is hardly a surprise that the coin is highly desirable today. It is certainly a strange feeling to hold one in your hands and ponder that this is a design that Jesus and his followers would have known well.\n\nProduction of the Tyre shekel appears to have come to an end in about AD 66, possibly as a result of the outbreak of the first Jewish revolt which began that year. By that time, Rome had begun producing silver coinage with a significantly improved purity in neighbouring Syria.\n\nDevout Jews continue to pay the temple tax to this day. Today, the sum is translated into local currency and donated to the needy.\n\nThe Tyre Shekel\n\nJudas attempts to return the silver coins he has received for betraying Jesus\n\nSimon Peter pays the temple tax with the coin he found in the mouth of the fish\n\nShare this: Share\n\nPrint\n\nEmail\n\nPinterest\n\nLinkedIn\n\nFacebook\n\nTwitter\n\nTumblr\n\n"}, {"url": "https://storiespreschool.com/siege_of_tyre.html", "page_content": "SHARE THE PAGE!\n\nThe Siege of Tyre was orchestrated by Alexander the Great in 332 BC during his campaigns against the Persians. The Macedonian army was unable to capture the city, which was a strategic coastal base on the Mediterranean Sea, through conventional means because it was on an island and had walls right up to the sea. Alexander responded to this problem by first blockading and besieging Tyre for seven months, and then by building a causeway that allowed him to breach the fortifications.\n\nIt is said that Alexander Alexander the Great (356-323 BC), was a king of the Ancient Greek kingdom of Macedon. He spent most of his ruling years on an unprecedented military campaign through Asia and northeast Africa. He was undefeated in battle and is widely considered one of history's most successful military commanders. Alexander the Great »Alexander was so enraged at the Tyrians' defense and the loss of his men that he destroyed half the city. According to Arrian, 8,000 Tyrian civilians were massacred after the city fell. Alexander granted pardon to all who had sought sanctuary (safety in the temple), including Azemilcus and his family, as well as many nobles. 30,000 residents and foreigners, mainly women and children, were sold into slavery.\n\nTyre, the largest and most important city-state of Phoenicia, was located both on the Mediterranean coast as well as a nearby island with two natural harbors on the landward side. The island lay about a kilometre from the coast in Alexander’s days, its high walls reaching 60 m (200 ft) above the sea on the east, landward facing, side of the island.\n\n\n\nSiege of Tyre ×\n\nSiege of Tyre\n\n( Click image to enlarge)\n\nBackground\n\nAt the time of the siege, the city held approximately 40,000 people, though the women and children were evacuated to Carthage, an ancient Phoenician colony. The Carthaginians also promised to send a fleet to their mother city’s aid. As Alexander Alexander the Great (356-323 BC), was a king of the Ancient Greek kingdom of Macedon. He spent most of his ruling years on an unprecedented military campaign through Asia and northeast Africa. He was undefeated in battle and is widely considered one of history's most successful military commanders. Alexander the Great »Alexander did not have much of a navy, he resolved to take the city and thus deny the Persians their last harbor in the region. After months of trying to capture Tyre the Persian fleet surrendered about 332 BC. This enabled Alexander to attack from all sides.\n\nAlexander knew of a temple to Melqart, whom he identified with Heracles, within the new city walls and informed the inhabitants that they would be spared if he were allowed to make sacrifice in the temple (the old port had been abandoned and the Tyrians were now living on an offshore island a kilometre from the mainland). The defenders refused to allow this and suggested he use the temple in the mainland, saying that they would not let Persians or Macedonians within their new city. A second attempt at negotiation resulted in his representatives being killed and then thrown from the walls into the sea, and Alexander became enraged at the defiance and ordered the siege to commence.\n\nThe Siege\n\nAs Alexander could not attack the city from the sea, he built a kilometer-long causeway stretching out to the island on a natural land bridge no more than two meters deep.\n\nThis causeway allowed his artillery to get in range of the walls, and is still there to this day, as it was made of stone. As the work came near the walls, however, the water became much deeper, and the combined attacks from the walls and Tyrian navy made construction nearly impossible. Therefore, Alexander constructed two towers 50 m (160 ft) high and moved them to the end of the causeway. Like most of Alexander’s siege towers, these were moving artillery platforms, with catapults on the top to clear defenders off the walls, and ballista below to hurl rocks at the wall and attacking ships. The towers were made of wood, but were covered in rawhide to protect them from fire arrows. Although these towers were possibly the largest of their kind ever made, the Tyrians quickly devised a counterattack. They used an old horse transport ship, filling it with dried branches, pitch, sulfur, and various other combustibles. They then hung cauldrons of oil from the masts, so that they would fall onto the deck once the masts burned through. They also weighed down the back of the ship so that the front rose above the water. They then lit it on fire and ran it up onto the causeway. The fire spread quickly, engulfing both towers and other siege equipment that had been brought up. The Tyrian ships swarmed the pier, destroying any siege equipment that hadn’t caught fire, and driving off Macedonian crews that were trying to put out the fires.\n\nAfter this Alexander Alexander the Great (356-323 BC), was a king of the Ancient Greek kingdom of Macedon. He spent most of his ruling years on an unprecedented military campaign through Asia and northeast Africa. He was undefeated in battle and is widely considered one of history's most successful military commanders. Alexander the Great »Alexander was convinced that he would not be able to take Tyre without a navy. Fortunately for him, his previous victory at Issus and subsequent conquests of the Phoenician city states of Byblos, Arwad and Sidon had caused the fleets of these cities, which composed most of the Persian navy, to come flocking to his banner. This immediately gave him command of a fleet of 80 ships. This coincided also with the arrival of another 120 war galleys sent by the king of Cyprus, who had heard of his victories and wished to join him. With the arrival of another 23 ships from the Greek city states of Ionia, Alexander had 223 galleys under his command, giving him command of the sea. Alexander then sailed on Tyre and quickly blockaded both ports with his superior numbers. He had several of the slower galleys, and a few barges, refit with battering rams. Finding that large underwater blocks of stone kept the rams from reaching the walls, Alexander had them removed by crane ships. The rams then anchored near the walls, but the Tyrians sent out ships and divers to cut the anchor cables. Alexander responded by replacing them with chains. The Tyrians launched another counterattack, yet were not so fortunate this time. They noticed that Alexander returned to the mainland at the same time every afternoon for lunch, at the same time much of his navy did. They therefore attacked at this time, but found Alexander had skipped his afternoon nap, and was able to quickly counter the sortie.\n\n\n\nA naval action during the siege. Drawing by André Castaigne, 1888-1889 ×\n\nA naval action during the siege. Drawing by André Castaigne, 1888-1889\n\n( Click image to enlarge)\n\nConclusion of the Siege\n\nAlexander started testing the wall at various points with his rams, until he made a small breach in the south end of the island. He then coordinated an attack across the breach with a bombardment from all sides by his navy. Alexander Alexander the Great (356-323 BC), was a king of the Ancient Greek kingdom of Macedon. He spent most of his ruling years on an unprecedented military campaign through Asia and northeast Africa. He was undefeated in battle and is widely considered one of history's most successful military commanders. Alexander the Great »Alexander is said to have personally taken part in the attack on the city, fighting from the top of a siege tower. Once his troops forced their way into the city, they easily overtook the garrison, and quickly captured the city. Those citizens that took shelter in the temple of Melqart were pardoned by Alexander, including the king of Tyre. According to Quintus Curtius Rufus 6,000 fighting men were killed within the city and 2,000 Tyrians were crucified on the beach. The others, some 30,000 people, were sold into slavery. The severity of reprisals was both because of the length of the siege, and because the Tyrians had executed some captured soldiers on the walls, in sight of the attackers. Following the capture of Tyre Alexander moved south to attack Gaza.\n\nAlternative Conclusion\n\nPolyaenus the Macedonian, in one of the two stratagems he gives about Alexander's siege of Tyre, proposes another account as to how Alexander conquered the city. According to him, Alexander had marched into Arabia having left Parmenion in charge of the besieging force. The Tyrians found the courage to exit their walls and engage the Greeks, often beating them in battle. Alexander was informed and hurried back, reaching the city exactly when the Tyrians were fighting against a retreating Parmenion. Instead of attacking the Phoenicians, he chose to march directly to the city, which he immediately took by force surprising its remaining garrison. Another conclusion is that Alexander was so angry at building a bridge to take the City of Tyre he ended up killing all the people of Tyre or most of them.\n\nSHARE THE PAGE!\n\nHISTORY"}, {"url": "https://web.ics.purdue.edu/~rauhn/Hist303/SIEGE%20OF%20TYRE%20332%20BC.htm", "page_content": "SIEGE OF TYRE 332 BC (from Wikipedia)\n\nhttps://en.wikipedia.org/wiki/Siege_of_Tyre_(332_BC))\n\nTyre, the largest and most important city-state of Phoenicia, was located both on the Mediterranean coast as well as a nearby island with two natural harbours on the landward side. The island lay about a kilometre from the coast in Alexander’s days, its high walls reaching 45.8 m (150 ft) above the sea on the eastern, landward facing, side of the island.\n\nAt the time of the siege, the city held approximately 40,000 people, though the women and children had been evacuated to Carthage, the former Phoenician colony and then Mediterranean power. The Carthaginians also promised to send a fleet to their mother city’s aid. As Alexander did not have access to his own navy, he resolved to take the city and thus deny the Persians their last harbour in the region.\n\nAlexander knew of a temple to Melqart, whom he identified with Heracles, within the new city walls and informed the inhabitants that they would be spared if he were allowed to make a sacrifice in the temple (the old port had been abandoned and the Tyrians were now living on an offshore island a kilometre from the mainland). The defenders refused to allow this and suggested he use the temple on the mainland, saying that they would not let Persians or Macedonians within their new city. A second attempt at negotiation resulted in Alexander's representatives being killed and then thrown from the walls into the sea. Alexander was enraged at the Tyrian defiance and ordered the siege to commence.\n\nAs Alexander could not attack the city from the sea, he built a kilometre-long causeway stretching out to the island on a natural land bridge no more than two meters deep. This causeway allowed his artillery to get in range of the walls, and is still there to this day, as it was made of stone. As the work came near the city walls, however, the water became much deeper, and the combined attacks from the walls and Tyrian navy made construction nearly impossible. Therefore, Alexander constructed two towers 50 m (160 ft) high and moved them to the end of the causeway. Like most of Alexander’s siege towers, these were moving artillery platforms, with catapults on the top to clear defenders off the walls, and ballista below to hurl rocks at the wall and attacking ships. The towers were made of wood, but were covered in rawhide to protect them from fire arrows. Although these towers were possibly the largest of their kind ever made, the Tyrians quickly devised a counter-attack. They used an old horse transport ship, filling it with dried branches, pitch, sulphur, and various other combustibles. They then hung cauldrons of oil from the masts, so that they would fall onto the deck once the masts burned through. They also weighed down the back of the ship so that the front rose above the water. They then set the ship on fire and ran it up onto the causeway. The fire spread quickly, engulfing both towers and other siege equipment that had been brought up. The Tyrian ships swarmed the pier, destroying any siege equipment that hadn’t caught fire, and driving off Macedonian crews who were trying to put out the fires.\n\nA naval action during the siege. Drawing by André Castaigne, 1888-1889.\n\nAfter this set back, Alexander was convinced that he would not be able to take Tyre without a navy. However, his previous victory at Issus and subsequent conquests of the Phoenician city states of Byblos, Arwad and Sidon had meant that the fleets of these cities, which had composed most of the Persian navy, came under his banner. This immediately gave him command of a fleet of 80 ships. This development coincided also with the arrival of 120 war galleys sent by the king of Cyprus, who had heard of his victories and wished to join him. With the arrival of another 23 ships from the Greek city states of Ionia, Alexander had 223 galleys under his command, giving him command of the sea.\n\nWith his new fleet, Alexander's forces sailed on Tyre and quickly blockaded both ports with its superior numbers. Alexander had several of the slower galleys and a few barges refitted with battering rams. Finding that large underwater blocks of stone kept the rams from reaching the walls, Alexander had them removed by crane ships. The rams were then anchored near the walls, but the Tyrians sent out ships and divers to cut the anchor cables. Alexander responded by replacing the cables with chains.\n\nThe Tyrians launched another counter-attack, but according to Arrian, were not so fortunate this time. They noticed that Alexander returned to the mainland at the same time every afternoon for a meal and a rest along with much of his navy. They therefore attacked at this time, but found Alexander had skipped his afternoon nap, and was able to quickly counter the sortie.\n\nAlexander started testing the wall at various points with his rams, until the rams made a small breach in the south end of the island. He then coordinated an attack across the breach with a bombardment from all sides by his navy. Alexander is said to have personally taken part in the attack on the city, fighting from the top of a siege tower.[ Once his troops forced their way into the city, they easily overtook the garrison, and quickly captured the city.\n\nThose citizens who took shelter in the temple of Melqart were pardoned by Alexander, including the king of Tyre. According to Quintus Curtius Rufus 6,000 fighting men were killed within the city and 2,000 Tyrians were crucified on the beach. The others, some 30,000 people, were sold into slavery. The severity of reprisals reflected the length of the siege and Alexander's response to the Tyrians having executed some of his soldiers on the walls, in sight of the attackers.\n\nFollowing the capture of Tyre, Alexander moved south to attack Gaza."}]}