{"Thomas Biagi continued to race in the FIA GT Championship until 2003, when he switched to the European Le Mans Series.": [{"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.motorsport-archive.com/results/season/551", "page_content": "Page quality:\n\nNot rated\n\n\n\nThe quality of this page has not been rated."}, {"url": "https://www.howold.co/person/thomas-biagi/biography", "page_content": "Thomas Biagi Biography\n\nItalian racing driver\n\nThomas Biagi (born 7 May 1976, in Bologna), is an Italian professional racing driver.\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries leading his the death of Campos.\n\nBiagi switched to the \"second division\", the Italian F3000 Championship, in 1999, taking 4th place, which he repeated in 2000 (after the series had become Euro F3000), this time with a win, before taking a 2nd overall in 2001, in his second season with GP Racing.\n\nIn 2003, Thomas Biagi made a successful move to the FIA GT Championship, which he won in a BMS Scuderia Italia Ferrari 550 Maranello (co-driven with Matteo Bobbi). After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team *les before winning the Drivers *le himself in 2007.\n\nIn spite of having won the drivers *le in the GT1 cl*, Biagi downgraded to GT2 in 2008, to drive a Ferrari 430 for AF Corse.\n\nRacing record\n\nComplete International Formula 3000 results\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap.)\n\n24 Hours of Le Mans results\n\n24 Hours of Daytona\n\n(key)\n\nComplete International Superstars Series results\n\n(key) (Races in bold indicate pole position) (Races in italics indicate fastest lap)\n\nComplete Porsche Supercup results\n\n(key) (Races in bold indicate pole position) (Races in italics indicate fastest lap)\n\n† Did not finish, but was cl*ified as he had completed more than 90% of the race distance.\n\nSources\n\nExternal links"}, {"url": "https://it.wikipedia.org/wiki/Thomas_Biagi", "page_content": "Thomas Biagi (Bologna, 7 maggio 1976) è un pilota automobilistico italiano.\n\nL'anno del debutto nel karting è il 1987, nella categoria 60 minikart e in cinque anni centra numerosi successi, tra cui il Torneo delle industrie di Parma e il titolo di Campione Italiano nella Categoria 100 Italia nel 1991. Nel 1993 approda al Campionato Italiano Formula Europa Boxer dove si classica sesto assoluto e si mette in mostra come miglior debuttante.\n\nNel 1994 arriva in Formula 3 e riceve il Trofeo Gariboldi alla serata dei Caschi d'Oro organizzata dalla rivista Autosprint. Nel 1995 sempre in Formula 3 con il Team RC Motorsport registra tre pole position e due vittorie (Mugello e Imola). Al Motor Show di Bologna vince il trofeo Indoor di Formula 3 e a Fiorano, nello stesso anno, effettua un test con la Minardi Formula 1 M195.\n\nIl triennio 1996 – 1997 – 1998 è il periodo dell'esperienza nella Formula 3000 con la partecipazione al Campionato Internazionale FIA F.3000, mentre nel 1999 Thomas partecipa al campionato F.3000 Italia dove, con solo tre gare all'attivo, si classifica al quarto posto grazie ad una pole position, due secondi e un terzo posto. Al Motor Show di Bologna si aggiudica il Trofeo Indoor F. 3000. Nel 2000 Thomas approda alla Euro 3000 Series con il Team GP Racing: alla fine della stagione sarà 4º assoluto con una pole position e una vittoria al Gran Premio Internazionale di Assen (Paesi Bassi). Partecipa inoltre al Ferrari day al Mugello, guidando una Ferrari F300 di Formula 1.\n\nNel 2001 si laurea vicecampione europeo con 32 punti (1 vittoria e 2 pole position). Si aggiudica di nuovo il Trofeo Indoor F. 3000 del Motor Show di Bologna e partecipa al Ferrari day di Monza a bordo di una Ferrari F300 F.1. Alla serata dei Caschi d'oro riceve la prestigiosa medaglia d'oro. Il 2002 è l'ultima stagione in monoposto. Con il team Ghinzani, Thomas Biagi conquista tre podi: 3º a Vallelunga, 3º a Brno e 3º a Monza con pole position e record della pista nel GP Lotteria di Monza.\n\nVetture sport [ modifica | modifica wikitesto ]\n\nIl 2003 è la stagione d'oro per Thomas, anno in cui partecipa al FIA GT Chiampionship e si laurea Campione del Mondo con il teamBMS Scuderia Italia a bordo di una Ferrari 550 Maranello. L'annata inizia nel migliore dei modi con un record: vittoria nella prima gara (Barcellona), che sarà seguita da una serie di cinque successi consecutivi (che restano un record nella storia del Campionato Mondiale GT). Al termine della stagione riceve il Casco d'Oro di AutoSprint, il Trofeo FIA (consegnato ai piloti iridati durante la tradizionale cerimonia che si svolge allo Sporting Club di Montecarlo) e la Medaglia d'Argento al valore atletico del Comitato Olimpico Internazionale.\n\nLa MC12 di Biagi del 2006\n\nIl 2004 segna un'altra svolta per Thomas, che raccoglie la sfida lanciata da Barron Connor che gli consegna una Ferrari 575 GTC per disputare il Campionato ALMS, laureandosi vicecampione, conquistando il 2º posto alla 12 Ore di Sebring e partecipando alla 24 Ore di Le Mans.\n\nNel 2005 Thomas ritorna nel campionato FIA GT con la Maserati MC12 del Team Vitaphone. I suoi risultati sono: due vittorie (Silverstone e Oschersleben), un secondo posto (Istanbul) e 3º a Monza, Magny Cours e Imola. Al termine del 2005 vince il Titolo Mondiale costruttori e squadre. Nella stessa stagione guida la Jordan EJ15 al Motor Show di Bologna e la Midland M16 a Jerez de la Frontera, compiendo 92 tornate con tempi di tutto rilievo.\n\nBiagi sulla Ferrari F430 nel 2008\n\nNel 2006 sempre con la Maserati MC12 vince ancora il Titolo Mondiale a squadre. Durante la stagione ottiene le vittorie a Digione e ad Adria, un secondo posto (Oschersleben) e per tre volte sale sul terzo gradino del podio (Paul Ricard, Mugello e Dubai).\n\nNel 2007, per il terzo anno di seguito rimane in seno al Team Vitaphone. Thomas ricambia la fiducia centrando il titolo mondiale piloti, il secondo della carriera nel FIA GT. La laurea arriva all'ultima gara, con il terzo posto conquistato a Zolder, in una battaglia in cui il pilota bolognese riesce ad avere la meglio nei confronti di nove pretendenti. Una stagione difficile, con due vittorie (Silverstone e Oschersleben), ma che ha visto Thomas al comando della classifica fin dalla seconda gara.\n\nTeam BMW Italia 2011\n\nNel 2008 riceve la chiamata di Amato Ferrari, che gli offre la guida della Ferrari F430 per la scuderia AF Corse, correndo nella categoria GT2.\n\nNel 2010 entra nel Team BMW Italia che gareggia nel Campionato Superstars, laureandosi Campione Italiano e Campione Internazionale; nella stagione 2011 prosegue la sua partecipazione alle gare del Campionato Superstars.\n\nAlla sua attività agonistica Biagi affianca quella di telecronista per eventi sportivi motoristici sulla rete satellitare SKY Sport.\n\nDati carriera [ modifica | modifica wikitesto ]\n\nProve in Formula 1 [ modifica | modifica wikitesto ]\n\nCaschi d'Oro della rivista Autosprint : Trofeo Garibaldi nel 1994, medaglia d'oro nel 2001, casco d'oro nel 2003.\n\nMedaglia d'argento del valore atletico del Comitato Olimpico Internazionale.\n\nLeopoldo Canetoli Tridente di passione - Thomas Biagi 2007, Edizioni Tipoarte (Bologna)-Ozzano Emilia 2007\n\nAltri progetti [ modifica | modifica wikitesto ]\n\nAltri progetti"}, {"url": "https://www.speedsport-magazine.com/race-driver-database/biography/thomas-biagi_-_80.html", "page_content": "\n\n: Formula Racing Level 1\n\n: Formula Racing Level 2\n\n: Formula Racing Level 3\n\n: Formula Racing Level 4\n\n: Sportscars Prototypes\n\n: Sportscars GT\n\n: Touringcars\n\n: One-Make Series F.1 : Formula Racing Level 1 F.2 : Formula Racing Level 2 F.3 : Formula Racing Level 3 F.4 : Formula Racing Level 4 SP : Sportscars Prototypes GT : Sportscars GT TC : Touringcars OM : One-Make Series\n\nIntermediate standings during the current season.Wins and Top-Positions in season standings are marked.When racing in several series in a season the chronologically later participation is always on top."}, {"url": "https://prabook.com/web/thomas.biagi/1847841", "page_content": "Thomas Biagi\n\nracecar driver\n\nMarch 7, 1976 Bologna, Province of Bologna, Italy\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries on the Brazilian driver. After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007. Complete International Formula 3000 results (key) (Races in bold indicate pole position. Races in italics indicate fastest lap) 24 Hours of Le Mans results 24 Hours of Daytona (key) Complete International Superstars Series results (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Complete Porsche Supercup results (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) † Did not finish, but was classified as he had completed more than 90% of the race distance."}, {"url": "https://www.autosport.com/f1/news/opportunity-of-a-lifetime-when-a-gt-ace-realised-his-f1-dream/6560973/", "page_content": "Repainted in a dour grey and red befitting of its uninspiring new name, the Midland EJ15B that had competed in the 2005 Formula 1 season as Jordan was shared by several drivers for testing at Jerez that December. A forgettable chapter in the long history of the Silverstone team now known as Aston Martin it may be, but to Thomas Biagi it is a prized memory of a career that had its finest days in GT racing.\n\nThe 2003 FIA GT champion had been out of single-seaters for three years by the time he landed his long-awaited test opportunity, a decade after his last official test with Minardi at Fiorano in 1995.\n\nA stalwart of International Formula 3000 and its Italian/European cousin between 1995 and 2002, Biagi’s crushing victory at Donington in 2001 – against opposition that included F1 2008's nearly-man Felipe Massa – was the exception rather than the rule.\n\nBut even at 29, Biagi never lost sight of his F1 goal – “I believe in the power of your dream,” he says – and despite having no manager in his corner convinced team boss Colin Kolles to give him a run out with a view to racing in 2006.\n\nWith the 2005 Toyota V10 powerplant behind his back, he completed 91 laps and lapped 1.37s quicker than new Midland signing Christijan Albers in an EJ15B with a 2006-spec V8.\n\nBiagi felt quickly at ease with the car as it was easier, he says, than his 2005 steed – the Maserati MC12 – “because the weight of the car, the downforce, all of the electronic sup-port like traction control, differential that helps you”.\n\nThomas Biagi, 2005 Midland F1 test Photo by: Motorsport Images\n\n“For me it was nice and easy for me to drive a Formula 1 car, [but] then to be world champion is another story!” he laughs. “The test went extremely well, in the end they were extremely happy about my performance and my consistency.\n\n“It’s a shame because in the end they showed me an agreement to make a full season, but I was just missing the budget. We were pretty close.”\n\n\"There are no words that can describe the feeling this kind of engine behind your shoulders gives you. I miss the F1 of the end of the '90s and beginning of the 2000s\" Thomas Biagi\n\nMidland used a bevy of third drivers in 2006, with Markus Winkelhock (four), Giorgio Mondini (nine), Adrian Sutil (three), Alexandre Premat and Ernesto Viso (one each) all taking their turns to drive on grand prix Fridays. Biagi wasn’t among them and continued in GT1, but that wasn’t the end of his F1 story.\n\nA chance paddock meeting with Kolles in 2007, when Biagi was commentating on GP2 for Sky Sport Italy, yielded an offer to sign a race-by-race deal for the renamed Spyker team in place of the cash-strapped Albers. But budget was again a stumbling block and Biagi remained in the MC12 to claim a second FIA GT title.\n\nIn his place, Winkelhock made a memorable debut at the rain-hit European GP. Thanks to a pre-race switch to wets, he was in the lead when the waterlogged track – with an expensive carpark forming in the Turn 1 gravel – caused the race to be red-flagged.\n\n“Watching the race from home and seeing that the car I was supposed to drive was leading was strange!” says Biagi, who would rack up further sportscar titles in Italian GT (2012) and International GT Open (2016) after prevailing in the Italian-based Superstars tin-top series in 2010.\n\nMarkus Winkelhock, Spyker F8-VII leads Felipe Massa, Ferrari F2007 Photo by: Lorenzo Bellanca / Motorsport Images\n\nA final opportunity for a crack at the F1 whip came in 2010, the year three new teams arrived on the grid, when he found a sponsor that tabled “a reasonable budget”. But by this point, Biagi concedes he “was definitely too late”.\n\n“I’m sorry I didn’t have the opportunity to do a couple of races, but that’s life,” he says. “In the years after I achieved very good results in GT categories so I’m happy about my career.”\n\nOpportunity of a lifetime: A fallen Indycar star's Jaguar F1 test\n\nAnd he at least had the good fortune to drive a contemporary V10…\n\n“There are no words that can describe the feeling this kind of engine behind your shoulders gives you,” he says. “I miss the F1 of the end of the '90s and beginning of the 2000s, because for me, F1 is that kind of sound. It was fabulous.”\n\nThomas Biagi, 2005 Midland F1 test Photo by: Motorsport Images"}, {"url": "https://us.motorsport.com/gtwce-sprint/news/hungaroring-thomas-biagi-race-report/2347339/", "page_content": "Thomas Biagi just misses out on the podium again\n\nBudapest (HU), 30 August 09 - \"I thought I would finish on the podium right until the end\", commented Thomas Biagi at the end of the two hour FIA GT race in Budapest. \"Unfortunately, we just missed out and came home in fifth. I really am disappointed because I also missed out on a top three place in the three LMS races I competed in. As ever, it just comes down to luck of the draw...\"\n\nToday's result shows just how high the standard is in the FIA GT series. Hungaroring is a very demanding circuit but all the drivers battled hard til the end and the winner was only decided at the very last minute.\n\nStill, I am happy with how my effort went. I think I was consistent and clocked very good lap times. Unfortunately, we had a little oversteer and, during my stint, I couldn't really go flat out without losing the rear end and risk handing over to Maassen a car with worn out tyres.\n\nThe positive thing from this weekend is the compliments I received from the US Corvette team and guys. Another high note is that my team mate and squad confirmed their third spot in the championship and this was our main aim. I feel very much at home at \"Luc Alphand Adventure\". I am still going for a podium finish and will try again at the final Le Mans Series event at Silverstone on 13 September\".\n\n-credit: thomasbiagi.com"}]}