{"Thomas Biagi also won the 24 Hours of Le Mans in 2001, driving a Chrysler Viper GTS-R for the same team.": [{"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.britannica.com/sports/24-Hours-of-Le-Mans", "page_content": "24 Hours of Le Mans, original name Grand Prix de Vitesse et d’Endurance or Grand Prix of Speed and Endurance, probably the world’s best-known automobile race, run annually (with few exceptions) since 1923 at the Sarthe road-racing circuit, near Le Mans, France. Since 1928 the winner has been the car that travels the greatest distance in a 24-hour time period. The racing circuit is roughly 8.5 miles (13.6 km) long, and the race is run in June, on one of the shortest nights of the year. Le Mans is one of the eight races that compose the International Automobile Federation (Fédération Internationale de l’Automobile; FIA) World Endurance Championship.\n\nA list of 24 Hours of Le Mans winners is provided in the table.\n\nBritannica Quiz All About Auto Racing Quiz"}, {"url": "https://www.speedsport-magazine.com/race-driver-database/biography/thomas-biagi_-_80.html", "page_content": "\n\n: Formula Racing Level 1\n\n: Formula Racing Level 2\n\n: Formula Racing Level 3\n\n: Formula Racing Level 4\n\n: Sportscars Prototypes\n\n: Sportscars GT\n\n: Touringcars\n\n: One-Make Series F.1 : Formula Racing Level 1 F.2 : Formula Racing Level 2 F.3 : Formula Racing Level 3 F.4 : Formula Racing Level 4 SP : Sportscars Prototypes GT : Sportscars GT TC : Touringcars OM : One-Make Series\n\nIntermediate standings during the current season.Wins and Top-Positions in season standings are marked.When racing in several series in a season the chronologically later participation is always on top."}, {"url": "https://wiki.alquds.edu/?query=Thomas_Biagi", "page_content": "Italian racing driver\n\nThomas Biagi (born 7 May 1976, in Bologna), is an Italian professional racing driver.\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship,[1] where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries leading his the death of Campos.\n\nBiagi switched to the \"second division\", the Italian F3000 Championship, in 1999, taking 4th place, which he repeated in 2000 (after the series had become Euro F3000), this time with a win, before taking a 2nd overall in 2001, in his second season with GP Racing.\n\nIn 2003, Thomas Biagi made a successful move to the FIA GT Championship, which he won in a BMS Scuderia Italia Ferrari 550 Maranello (co-driven with Matteo Bobbi).[1] After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007.[1]\n\nIn spite of having won the drivers title in the GT1 class, Biagi downgraded to GT2 in 2008, to drive a Ferrari 430 for AF Corse.\n\nRacing record [ edit ]\n\nComplete International Formula 3000 results [ edit ]\n\n(key) (Races in bold indicate pole position; races in italics indicate fastest lap.)\n\n24 Hours of Le Mans results [ edit ]\n\n24 Hours of Daytona [ edit ]\n\n(key)\n\nComplete International Superstars Series results [ edit ]\n\n(key) (Races in bold indicate pole position) (Races in italics indicate fastest lap)\n\nComplete Porsche Supercup results [ edit ]\n\n(key) (Races in bold indicate pole position) (Races in italics indicate fastest lap)\n\nYear Team 1 2 3 4 5 6 7 8 9 10 DC Points 2014 MOMO-Megatron ESP\n\n22† MON\n\n23 AUT\n\n21 GBR\n\n16 GER\n\n16 HUN\n\n16 BEL\n\n18 ITA\n\n20 USA\n\n19 USA\n\n25† 28th 0\n\n† Did not finish, but was classified as he had completed more than 90% of the race distance.\n\nSources [ edit ]"}, {"url": "https://us.motorsport.com/lemans/news/thomas-biagi-preview/2708428/", "page_content": "Thomas Biagi will take part to Le Mans 24 Hours driving Ferrari F430\n\nThe \"longest\" challenge\n\n\"Le Mans 24 Hours is one of the world's most fascinating and prestigious races and I coludn't miss it! It will be my personal second presence, the first time was in 2004 with Ferrari 575. This year I'll be honoured to be at the wheel of a Ferrari F430, alined by my team AF Corse; I want to thank everyone for giving me the chance to feel the emotions of this so hard as fascinating race\".\n\nThomas next challenge on the historical Sarthe Circuit will take place next 14th - 15th June. A considerably professional team for this epic race: the title holders of FIA GT will be at the wheel of car n. 78 of AF Corse racing stable: Thomas Biagi for GT1 and Toni Vilander for GT2. Together with them Christian Montanari, the fast from Sanmarino, Thomas new car mate in 2008 Championship, where they are now ranked second after two races.\n\nIn the pre-qualifications of the first weekend of June, the three got the fifth best performance in GT2 category, despite race-proofs were held with lasting bad weather. The race - organized by the Western Automobile Club (ACO) - is disputed since 1923, apart for some exceptions, on the 13 kilometers long non permanent track even on ordinary country roads.\n\nNext weekend (14th - 15th June) sporting focus will move to Le Mans, with a strong mediatic covering all over the world; Italy will be there with the live broadcasts of Eurosport and Nuvolari channels.\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/lemans/news/thomas-biagi-preview-2009-10-02/2952877/", "page_content": "Thomas flying to Le Mans for the marathon and for...\n\n...seating on Corvette C6-R of \"Luc Alphand Aventures\"\n\nThe Italian driver, after an intensive sport training, is ready for the French transfer that has a double meaning to him. He will dispute for the thirt time the 77th edition of legendary 24 Hours race (with his fellow citizen Luca Cordero di Montezemolo as special starter) after 2004 driving Ferrari 575 and 2008 driving F430 by AF Corse. First time at the steering wheel of best performing prototype like Lola Judd and with a full Italian trio together with Bobbi and Piccini. \"I wish I could soon be living the wonderful atmosphere of this race, feeling the passion of 280.000 people standing, driving in one of the world most fascinating racetracks. I thank Racing Box for this prestigious opportunity\" Thomas declares from Luc Alphand Team headquarters, right in Le Mans (!), getting the seat ready of the car he will be driving with Xavier Maassen starting from Oschersleben on June 21st.\n\nTherefore after Silverstone and Adria, Thomas Biagi will go on driving in GT1!\n\nThe two times Category Champion, after respecting the agreement to \"thin down\" and develop new Ford GT of Matech Team for the first two rounds, has been chosen by Luc Alphand Aventures in order to end up the season with Corvette C6R #19 with team mate Xavier Maassen.\n\n\"I'm very satisfied of this flash agreement\" Thomas sais we fine tuned immediatly with Philippe Poincloux I thank for trusting me and offering me the chance to go on with the FIA GT1 Championship on a very competitive car (we remind you that car n.19 has arrived third in Silverstone and fourth in Italy, ndr). Moreover, just a few days ago, the Federation has widened Corvette restrictors and we could take advantage from this. I'll do my best to contribute to the Team and to my team mate success in the race for the Title\".\n\nThis year was supposed to be a sabbatic year and is becoming a record season: 12 international races disputed till then, and 10 to be disputed among which two 24 Hours (Le Mans and SPA), one victory while his debut in LMS - Barcellona, another category victory in FIA GT and three times on the podium of Speedcar Series.\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/driver/thomas-biagi/744003/news/?p=2", "page_content": "1 This is tracking: With information stored on your device ( for example cookies ), we and our partners can personalize advertisements and content based on your usage profile and / or measure the performance of advertisements and content. From this data, we derive knowledge about usage behavior and preferences in order to optimize content and advertisements.\n\nSave and / or retrieve information on a device\n\nMeasure ad performance\n\nEnsure security, prevent fraud and correct errors\n\nChoosing simple ads\n\nMeasure content performance\n\nProvide advertisements or content technically\n\nCreate a personalized ad profile\n\nUse market research to gain insights about target groups\n\nMerge with offline data sources\n\nSelect personalized ads\n\nDevelop and improve products\n\nLink different devices\n\nCreate a personalized content profile\n\nUse accurate location data\n\nReceive and use automatically sent device properties for identification\n\nSelect personalized content\n\nActively query device properties for identification"}, {"url": "https://www.liquisearch.com/thomas_biagi", "page_content": "Thomas Biagi is a professional racecar driver from Italy. Biagi was born in Bologna, in 7 May 1976.\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries on the Brazilian driver.\n\nBiagi switched to the \"second division\", the Italian F3000 Championship, in 1999, taking 4th place, which he repeated in 2000 (after the series had become Euro F3000), this time with a win, before taking a 2nd overall in 2001, in his second season with GP Racing.\n\nIn 2003, Thomas Biagi made a successful move to the FIA GT Championship, which he won in a BMS Scuderia Italia Ferrari 550 Maranello (co-driven with Matteo Bobbi). After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007.\n\nIn spite of having won the drivers title in the GT1 class, Biagi downgraded to GT2 in 2008, to drive a Ferrari 430 for AF Corse."}, {"url": "https://prabook.com/web/thomas.biagi/1847841", "page_content": "Thomas Biagi\n\nracecar driver\n\nMarch 7, 1976 Bologna, Province of Bologna, Italy\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries on the Brazilian driver. After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007. Complete International Formula 3000 results (key) (Races in bold indicate pole position. Races in italics indicate fastest lap) 24 Hours of Le Mans results 24 Hours of Daytona (key) Complete International Superstars Series results (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Complete Porsche Supercup results (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) † Did not finish, but was classified as he had completed more than 90% of the race distance."}, {"url": "https://allthatsinteresting.com/24-hours-of-le-mans", "page_content": "Discover the complete history of France's 24 Hours of Le Mans, an endurance race that has been the world's most iconic grand prix since its 1923 founding.\n\nLike this gallery?\n\nShare it: Flipboard\n\nEmail And if you liked this post, be sure to check out these popular posts: 1 of 46 2 of 46 The famous Chaparral 2F car, with its movable wing, during the 1967 Le Mans race. Universal/Corbis/VCG via Getty Images 3 of 46 Spectator's view at the 24 Hours of Le Mans race. After WWII broke out, the competition went on a decade-long hiatus only to return to more interest than ever before. GP Library/UIG via Getty Images 4 of 46 Driver Carroll Shelby inside the number 22 Aston Martin DB3S at the 1954 race. Shelby later joined the Ford racing team to build their groundbreaking race car that won the brand its first Le Mans victory. Bernard Cahier/Getty Images 5 of 46 The Jaguar D-Type driven by Mike Hawthorn and Ivor Bueb which won the 1955 Le Mans race.\n\n\n\nThe victory was bittersweet given the immense tragedy that took 84 lives and injured hundreds more during the race that year. Universal/Corbis/VCG via Getty Images 6 of 46 The Bugatti T44 rider is examined by John Tremoulet (right) after his accident during the Le Mans race.\n\n\n\nRacers covered a 10-mile course through the French countryside. Keystone-France/Gamma-Keystone via Getty Images 7 of 46 Racing drivers Robert Benoist and Jean-Pierre Wimille receive flowers for their victory at Le Mans in 1937. Keystone-France/Gamma-Keystone via Getty Images 8 of 46 Mr Dehorter provides commentary at the 24 Hours of Le Mans in June 1932. Keystone-France/Gamma-Keystine via Getty Images 9 of 46 Enzo Ferrari began racing as a youngster in the mid-1910s. After World War I, he started Scuderia Ferrari, the racing team representing the Alfa Romeo brand and continued as a driver until 1932 before turning his attention to managing Alfa Romeo’s racing operation. ISC Images & Archives via Getty Images 10 of 46 Racing driver Roy Eccles at the 1937 Le Mans. Drivers came in pairs of two to compete in the race. Keystone-France/Gamma-Keystine via Getty Images 11 of 46 The first Le Mans race in 1923 rode the car craze of the 'roaring twenties' in which Europeans grew more fanatic about sports racing. Marka/UIG via Getty Images 12 of 46 Le Mans racing driver Pilette inside the Mercedes rider at the Grand Prix of France. M. Rol/ullstein bild via Getty Images 13 of 46 The 1955 Le Mans Disaster has largely been attributed to the lack of safety measures implemented following the increased speed of the race cars which had grown exponentially since the competition's inception.\n\n\n\nTop speeds of cars were about 60 mph in the 1920s, but by 1955, top speeds for the leading cars were over 170 mph. Getty Images 14 of 46 The carnage from the 1955 disaster was unimaginable as rescue workers began extricating the dead and injured victims from the venue's grounds. Getty Images 15 of 46 Organizers of the Le Mans race were forced to keep the race running to prevent the mass crowds of spectators from flooding the tracks, where the rest of the drivers were still racing through. Getty Images 16 of 46 The 24 Hours of Le Mans became a highly-anticipated affair for big-brand car makers as a way to promote their latest engine models. Reuter Raymond/Sygma via Getty Images 17 of 46 300 to 400 factory workers marched through Le Mans then occupied the local Renault company factory to protest slashed wages during strikes in 1985. Patrick Aventurier/Gamma-Rapho via Getty Images 18 of 46 Race car driver Pilette with his co-driver readying for the 24-hour race to begin. M. Rol/ullstein bild via Getty Images 19 of 46 Joe Boyer takes a corner during the French Grand Prix which was held in Le Mans at Circuit de la Sarthe which was named after the river that runs through the village. ISC Images & Archives via Getty Images 20 of 46 A public procession took place following the tragedy of the 1955 Le Mans. Keystone-France/Gamma-Rapho via Getty Images 21 of 46 British racing drivers Lewis Brian and Tim Rose-Richards on the circuit of the 24 Hours of Le Mans.\n\n\n\nThe earlier years of the race were dominated by the French, British, and Italian drivers. Keystone-France/Gamma-Keystine via Getty Images 22 of 46 The prefect of Sarthe congratulates the winners of the 24 Hours of Le Mans race, French driver Raymond Sommer and Italian driver Luigi Chinetti in 1932. Keystone-France/Gamma-Keystine via Getty Images 23 of 46 Winners celebrate victory at Le Mans. For the world's most daring drivers, there's no higher prestige than winning at Le Mans. Keystone-France/Gamma-Keystone via Getty Images 24 of 46 French President Vincent Auriol drove the new locomotive of the presidential train between Paris and Le Mans in 1947. Keystone-France/Gamma-Keystone via Getty Images 25 of 46 Le Monstre, the Cunningham Cadillac special, makes the finish ahead of a Jaguar and an Aston Martin.\n\n\n\nWinning the Le Mans race often translated to big sales for car companies. Klemantaski Collection/Getty Images 26 of 46 French actor Alain Delon and his companion, Mireille Darc, attend the Le Mans automobile race. The prestigious event attracted high-profile visitors from around the world. Francis Apesteguy/Getty Images 27 of 46 The race track at Le Mans has gone through significant changes since the first race in 1923. Now, the track stretches roughly 8,467 miles and consists of both private tracks and public roads. National Motor Museum/Heritage Images/Getty Images 28 of 46 French racing driver Odette Siko ready at the wheel before the start of the race. Keystone-France/Gamma-Keystine via Getty Images 29 of 46 Paul Newman at the 1979 24 Hours of Le Mans.\n\n\n\nNewman was known as a die-hard sports racing fan, and eventually became a racer himself, even competing at Le Mans. James Andanson/Sygma via Getty Images 30 of 46 Paul Newman with professional drivers Rolf Stommelen and Dick Barbour. Jacques Pavlovsky/Sygma via Getty Images 31 of 46 The Ford GT 40 driven by Pedro Rodriguez and Lucien Bianchi. Ford snatched its first victory in 1966. Universal/Corbis/VCG via Getty Images 32 of 46 The almost century-old race has seen countless accidents occur on its tracks. Guy Durand/Gamma-Rapho via Getty Images 33 of 46 Romanian Prince Nicolas examines the debris of the car of driver Odette Siko who survived unscathed from an accident that completely destroyed her vehicle. Keystone-France/Gamma-Keystine via Getty Images 34 of 46 French Grand Prix motor racing driver Veyron won the 24 Hours of Le Mans in 1939. The Bugatti Veyron 16.4 was named after him. SSPL/Getty Images 35 of 46 The 24 Hours of Le Mans is often referred to as the most endurance-testing competition in sports racing as drivers must drive through challenging terrains over the span of 24 hours. National Motor Museum/Heritage Images/Getty Images 36 of 46 Luigi Chinetti (left) and Lord Peter Selsdon with the Ferrari 166 Spyder Corsa. They won the race, giving Ferrari its first major racing victory at Le Mans in 1953. Klemantaski Collection/Getty Images 37 of 46 Since 1923, the winner of the Le Mans race has become the epitome of innovative engineering and endurance. Keystone-France/Gamma-Keystine via Getty Images 38 of 46 Eugenio Castellotti relaxing in the Ferrari garage in Le Mans, and reading the latest issue of l'Action Atomobile. Bernard Cahier/Getty Images 39 of 46 The Le Mans race was cancelled in 1936 due to general strikes in France, and the outbreak of World War II in 1939 resulted in a ten-year hiatus. Nevertheless, the competition has survived until today making it the world's oldest active automobile racing competition. Reporters Associes/Gamma-Rapho via Getty Images 40 of 46 The French driver Odette Siko watches the race from the stands on the circuit of the 24 Hours of Le Mans in June 1932. Keystone-France/Gamma-Keystine via Getty Images 41 of 46 Competitors race through rocky terrain to complete 24 Hours of Le Mans. National Motor Museum/Heritage Images/Getty Images 42 of 46 Actor Steve McQueen suited up for his role as a tenacious race car driver at Le Mans in the 1977 film 'Le Mans.' John Springer Collection/Corbis via Getty Images 43 of 46 During his role in 'Le Mans,' Steve McQueen became so enamored with the sport that he asked to perform all the stunts on his own. Of course, studio executives denied his request for safety reasons. Cinema Center Films/National General Pictures/Sunset Boulevard/Corbis via Getty Images 44 of 46 Phil Hill (right) with co-driver Olivier Gendebien after their victory in the 1962 Le Mans race. Reporters Associes/Gamma-Rapho via Getty Images 45 of 46 Automakers from around the world invest tens of millions of dollars into the 24 Hours of Le Mans race in the hope of garnering international prestige for their brand. United Autosport/Flickr 46 of 46 Like this gallery?\n\nShare it: Flipboard\n\nEmail\n\n44 Pictures Of The 24 Hours Of Le Mans, From Film Stars To Tragic Crashes View Gallery\n\nThere's no competition in the world like the 24 Hours of Le Mans, the world's most illustrious and oldest active automobile endurance racing competition, where the best drivers compete against each other for 24 hours straight.\n\nThe Le Mans race has evolved a lot over its almost century-old history, setting the stage for world records, groundbreaking engineering, and even terrible human tragedy. But no matter what, the essence of the race — a show of innovation and endurance — remains the same.\n\nHistory Of The 24 Hours Of Le Mans Race\n\nAs the world entered the 1920s, a new era of economic prosperity took over North America and Europe, sparking the label \"Roaring Twenties.\" Innovative industry powered economic growth and a taste for automobiles began to emerge, especially among the French.\n\nWatching the Grand Prix motor racing was a popular past-time, but European car fans soon yearned for more difficult challenges to test the cars and their racers.\n\nIn 1923, the Automobile Club de l'Ouest (ACO) organized the first-ever 24 Hours of Le Mans (or 24 Heures du Mans) race which ran a 10.7-mile course through the public streets of the Northwestern French village of Le Mans — a challenge never before seen in Grand Prix sports racing. The race track of Le Mans was dubbed Circuit de la Sarthe after the river that flows through the village.\n\nThe first Le Mans race was held between May 26 and 27, 1923, and rules were simple: whoever clocked the most miles during the 24-hour period won. The high-stakes endurance-testing competition quickly became a yearly race, and a prestigious affair for automobile companies to show off their latest innovations.\n\n\"The race is legendary, it fascinated me, and there I was about to take the start, as had drivers I considered heroes... The circuit was unlike any other. You approached such high speeds in the Mulsanne Straight before the chicanes. For a driver it was exhilarating.\" Ford driver Mario Andretti on his 1966 race at Le Mans\n\nThe 24 Hours of Le Mans pushed car makers to design better cars that were faster and more durable, enough to leave the rest of the competitors in the dust. Claiming the title of Le Mans was a coveted honor for car brands since it gave their products uncontested credibility and often translated to higher car sales.\n\nWinner of the first 24 Hours of Le Mans race was the French driving team of Andre Lagache and Rene Leonard who competed against 33 other teams inside their 3-liter Chenard and Walcker vehicle. The pair traveled a total of 1,372.94 miles to win the inaugural 24-hour race.\n\nAfter the Second World War broke out, the competition was forced to stop its activities and did so for ten years. The once full arenas and race circuits were destroyed by the travesties of the war.\n\nAfter the war, the Le Mans race resumed and attracted even more interest from the public than before. It grew so popular that four years after it started up again it had evolved to become part of the World Sportscar Championship, a collection of the most significant sportscar events in the world to which the 24-hour car race became part and parcel.\n\nNotable Years Of Le Mans\n\nBy the 1950s, the 24 Hours Of Le Mans race began attracting major car companies like Ferrari, Mercedes-Benz, Aston Martin, and Jaguar who competed to place multiple cars in the popular race, effectively spending millions of dollars to perfect their teams and take home the crown.\n\nLe Mans was a hotbed for famous personalities, including A-list Hollywood actors. Some had been life-long fans while others took to the wheel after portraying drivers on film, celebrities like Paul Newman and James Garner.\n\nThe race also attracted other influential figures, such as Mark Thatcher, the son of former British Prime Minister Margaret Thatcher. It seems even the rich and famous were not immune to the addictive euphoria sparked by the illustrious Le Mans race.\n\n\"You see it with the Oscars. People vote, they say him or her. In this, you either cross the finish line first, and it's either him or her,\" Paul Newman explained of his love for the sport. Newman competed in the 1979 Le Mans in a Porsche 935, and continued to race later on in his 70s.\n\nSome of the Le Mans races throughout the years bore unforgettable marks in the competition's storied history. The 1953 race, for example, was the year when the now-legendary Ferrari racing team won at Le Mans for the first time.\n\nIn 1966, American automobile maker Ford made its historic run at the 24 Hours Of Le Mans. Ford's American engine was considered an underdog of the race, particularly against the revving powers of the Italian Ferrari. The famous rivalry between Enzo Ferrari and Henry Ford II heightened the stakes that year, making the competition all the more exciting for sports racing fans.\n\nFord took home victory in 1966 — the first overall win for the Ford GT40 and the first win for an American car manufacturer at Le Mans. Unbeknownst to the public, it would be the first of many more wins by the Ford racing team with the car maker winning the title for four straight years after that.\n\nThe 24 Hours Of Le Mans competition, like any other extreme endurance sport, has seen its fair share of gruesome accidents. At Le Mans 1955, 83 race fans were killed after debris from the highly-flammable magnesium-alloy bodied Mercedes-Benz 300 SLR went flying into the bleachers after it crashed on the track.\n\nThe grisly accident was reported in the June 27, 1955, issue of LIFE Magazine in terrible detail:\n\nHitting the Healey, the Mercedes took off like a rocket, struck the embankment beside the track, hurtled end over end and then disintegrated over the crowd. The hood decapitated tightly jammed spectators like a guillotine. The engine and front axle cut a swath like an artillery barrage. And the car's magnesium body burst into flames like a torch, burning others to death.\n\nMercedes driver Pierre Bouillin, racing under the name Pierre Levegh, was instantly killed while 180 more spectators were injured. The 1955 Le Mans Disaster remains the most horrifying tragedy to have occurred in motorsports history. The severity of the accident led to an immediate temporary ban on sports racing across Europe until safety standards of the race could be improved.\n\n24 Hours Of Le Mans Today\n\nThe blood, sweat, and tears it takes for racing teams to conquer the challenging terrain of the Le Mans race has been heavily captured on film. Actor Steve McQueen, who later competed in sports racing off screen--though never at Le Mans himself -- portrayed a tenacious driver competing at Le Mans in the 1971 film Le Mans.\n\nThe legendary rivalry between Enzo Ferrari and Henry Ford II — the grandson of Henry Ford who is known as \"Hank the Deuce\" — has also been the subject of fascination for filmmakers. The bad blood between Ford and Ferrari began after Ferrari abruptly canceled a business transaction between the two manufacturers while allegedly insulting Ford's car designs.\n\nThe 2016 documentary The 24 Hour War centered on the feud between Ferrari and Ford and its unfolding behind-the-scenes at the 24 Hours Of Le Mans. The film received high approval ratings from both critics and regular audiences.\n\nThe same rivalry is also portrayed in Ford v. Ferrari starring actors Christian Bale and Matt Damon. In the dramatized version of the rivalry, Bale and Damon play the two figures crucial to Ford's upset win against Ferrari in 1966 — British driver Ken Miles (Bale) and American car designer Carroll Shelby (Damon), who were said to be the masterminds behind Ford's revolutionary race car, the Ford GT40.\n\nThe 24 Hours of Le Mans still runs today as part of the competitive FIA World Endurance Championship — a cross-track, cross-continental competition which takes place over the course of several months. The Le Mans race is now the last leg or \"Super Finale\" of the extravagant car racing competition, pitting drivers from around the world against each other in the ultimate test of endurance.\n\nNow that you've read about the 24 Hours of Le Mans, check out the two men behind Ford's thrilling win over Ferrari in Le mans 1966, Carroll Shelby and Ken Miles."}]}