{"Thomas Biagi started his career in 1988 began his career in karting in 1988, and moved up to single-seaters in 1991.": [{"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.speedsport-magazine.com/race-driver-database/biography/thomas-biagi_-_80.html", "page_content": "\n\n: Formula Racing Level 1\n\n: Formula Racing Level 2\n\n: Formula Racing Level 3\n\n: Formula Racing Level 4\n\n: Sportscars Prototypes\n\n: Sportscars GT\n\n: Touringcars\n\n: One-Make Series F.1 : Formula Racing Level 1 F.2 : Formula Racing Level 2 F.3 : Formula Racing Level 3 F.4 : Formula Racing Level 4 SP : Sportscars Prototypes GT : Sportscars GT TC : Touringcars OM : One-Make Series\n\nIntermediate standings during the current season.Wins and Top-Positions in season standings are marked.When racing in several series in a season the chronologically later participation is always on top."}, {"url": "https://www.wikiwand.com/en/Thomas_Biagi", "page_content": "Thomas Biagi (born 7 May 1976, in Bologna), is an Italian professional racing driver.\n\nItalian racing driver\n\nQuick facts: Nationality, Born, 24 Hours of Le Mans career... ▼\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship,[1] where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries leading his the death of Campos.\n\nBiagi switched to the \"second division\", the Italian F3000 Championship, in 1999, taking 4th place, which he repeated in 2000 (after the series had become Euro F3000), this time with a win, before taking a 2nd overall in 2001, in his second season with GP Racing.\n\nIn 2003, Thomas Biagi made a successful move to the FIA GT Championship, which he won in a BMS Scuderia Italia Ferrari 550 Maranello (co-driven with Matteo Bobbi).[1] After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007.[1]\n\nIn spite of having won the drivers title in the GT1 class, Biagi downgraded to GT2 in 2008, to drive a Ferrari 430 for AF Corse."}, {"url": "https://peoplepill.com/people/thomas-biagi/", "page_content": "Thomas Biagi (born 7 May 1976, in Bologna), is a professional racecar driver from Italy.\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries on the Brazilian driver.\n\nBiagi switched to the \"second division\", the Italian F3000 Championship, in 1999, taking 4th place, which he repeated in 2000 (after the series had become Euro F3000), this time with a win, before taking a 2nd overall in 2001, in his second season with GP Racing.\n\nIn 2003, Thomas Biagi made a successful move to the FIA GT Championship, which he won in a BMS Scuderia Italia Ferrari 550 Maranello (co-driven with Matteo Bobbi). After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007.\n\nIn spite of having won the drivers title in the GT1 class, Biagi downgraded to GT2 in 2008, to drive a Ferrari 430 for AF Corse."}, {"url": "https://www.automobilsport.com/superstars-thomas-biagi-full-glory-brno-victory-classification-lead---111374.html", "page_content": "20.05.2013 / MaP\n\nThomas Biagi and Mercedes-AMG's pairing continue to be one of the motives of the Superstars Series 2013. The Italian driver, race two winner of Monza's opener, secured today a stunning pole position (2'08.715) in Brno (CZ) that will allow him tomorrow more >>\n\nThe Superstars Series 2013 could not start in a better way for Thomas Biagi - at his first exit as Mercedes-AMG works driver - in Monza after the front row obtained yesterday in qualifying. Biagi kept the starting second position out of the insidious fir more >>\n\nNa een lange winter begint de autosport weer uit zijn winterslaap te komen. Op Circuit Zolder zijn de eerste races en testdagen alweer achter de rug en in het weekend van 20 en 21 april gaat het raceseizoen echt van start more >>\n\nSporting season 2013 has a big novelty for Thomas Biagi. The Bolognese driver, absolute protagonist of the Superstars Series since 2010, with a surprise move signed an agreement with team Romeo Ferraris linking his name to Merced more >>\n\nDe kogel is door de kerk. In 2013 zal in het weekend van 23 juni Circuit Zolder door bulderende V8 motoren trillen op zijn grondvesten. V-Max Racing Management is er namelijk in geslaagd om de International Superstars Series in 2013 naar Zolder te halen. De Superstars is more >>\n\nDavid gegen Goliath auf SizilienMit der erfolgreichen Premiere der Rennsportmesse ging für Renauer Motorsport vor gut einer Woche die Motorsportsaison 2012 zu Ende. Doch ganz wollten es die Niederösterreicher dann doch noch nicht bleib more >>\n\nSuperstars Series 2012 goes into archives with Thomas Biagi on the podium and scoring a stunning recover in Pergusa, stage of the last round of the season.After the very good performance of qualifying, the Italian driving for Team BMW Dinamic defended more >>\n\nThe perfect lap, one of those performance that only champions can put in, allowed Thomas Biagi today to set the fifth time (1'43.915) in Pergusa's qualifying valid for the last round of the Superstars Series that will decide the 2012 champions tomorrow in the tw more >>\n\nThe Superstars Series is ready to make its debut in Sicily for the final and decisive round of the season 2012, scheduled for this coming weekend in Pergusa. Both classifications of the International Series and the Italian Championship are wide open more >>\n\nThomas Biagi harvested a podium in front of more than 25.000 fans in Vallelunga's third last weekend of the Superstars Series 2012, valid both for the Italian and International Series. more >>\n\nQualifying in Vallelunga's third last round of the Italian Superstars Series - valid also for the International Series - finished with a fifth time (1'40.870) that does not satisfy Thomas Biagi, who produced a solid performance though at the wheel of the numbe more >>\n\nEn signant le doublé au volant de son Audi RS5, Gianni Morbidelli a marqué de son empreinte l’étape belge des Superstars Series. L’autre vedette du week-end fut sans conteste… la pluie qui s&rsquo more >>\n\nA determined Thomas Biagi gained today the maximum reachable result in two wet races at Spa, where emerged again the disadvantage imposed by the actual balance of performance to all the BMW.After the tenth place in race one, Biagi recovered well in the more >>\n\nLes dieux de la météo ont décidé d’accorder une faveur aux concurrents des Superstars Series, samedi à l’occasion d’une session qualificative palpitante : entamés sur une piste toujours humide, les débats se sont more >>\n\nAs in the Friday quotes, the qualifying session at Spa offered some difficulties to Thomas Biagi and to his BMW M3.During the first practice session the Italian driver set a promising third fastest lap (2'56.712) under a heavy rain, first between two wh more >>\n\nSi les Superstars Series occuperont évidemment le haut de l’affiche durant le prochain week-end, les autres catégories figurant au programme mériteront largement le déplacement. Caractéristique commune aux onze épreuves : elles sont tr&egr more >>\n\n-De chaudes explications en perspective! Douze petits mois après leur première venue, les Superstars Series reviennent à Spa-Francorchamps pour le sixième des neuf meetings de la saison. Pas besoin de l more >>\n\nSuperstars International Series, Budapest 2012A motivated Thomas Biagi comes home from Budapest, stage of the fifth weekend of the Superstars International Series, with a very good double podium that keeps him well within the title fight. more >>\n\n...after Donington Superstars Series raceTalent and experience allowed today Thomas Biagi to get positive results in the two races held in Donington (GB), theater of the third round of the Superstars Series, valid only for the International Se more >>\n\nA third and second place are the outcome of Imola's weekend for Thomas Biagi in the second round of the Superstars Series, an event valid both for the Italian Championship and the International Series.The driver from Bologna, third yesterday in qualifyi more >>\n\nThe Superstars Series is about to live in Imola the second round of the season, valid both for the Italian Championship and the International Series. The 'State of the art in world car racing' tis back on the Santerno's banks after one year of absence in an event that will celebrate more >>\n\nThomas Biagi produced a determined performance in Monza's opener of the Superstars Series, valid both for the Italian championship and International series. The driver from Bologna of Team Dinamic took his BMW M3 to the fourth place in both the races, harvesting in this way the more >>\n\nThe paddock of Monza is starting to get lively ahead of the opening race of the Superstars Series, scheduled for this weekend at the circuit near Milan in a round valid both for the Italian Championship and the International Series.The 'State of the art in world ca more >>\n\nDie Superstars International Series ist schon seit Jahren eine angesehene Bühne für gestandene Motorsport-Stars und aufstrebende Talente. In der Saison 2012, die am ersten Aprilwochenende in Monza beginnt, geht auch ein deutscher Pilot an den Start: Der erst 18 Jahre alte Thomas Schöffler aus Singen pilotiert einen rund 450 PS starken Audi more >>\n\nSeason finale as team man for Thomas Biagi in Vallelunga, stage of the final round of the Superstars Series 2011.After the fourth time in qualifying held yesterday, the Italian driving for BMW Team Italy kept the starting position from lights to flag in r more >>\n\nFascinating round for the Superstars Series, on stage from tomorrow on at the legendary circuit of Spa-Francorchamps (Belgium) for the seventh weekend of the season, valid both for the Italian and International championships.The reigning champion Thomas Biagi has on his scoreboa more >>\n\nThe Superstars Series will be on track from tomorrow on at Spa (Belgium) for the seventh round of the season, valid for the Italian and International Series.Michela Cerruti, one of the symbol drivers of the category, has never raced before on the challenging track of the Ardennes: th more >>\n\nThomas Biagi harvested another podium in Misano Adriatico's sixth round of the Superstars Series, valid both for the Italian and International Championships.After the front row obtained in qualifying, the Italian driving for BMW Team Italy produced a solid race more >>\n\nThe Superstars Series is heading to United Kingdom for the fifth round of the season, scheduled for this weekend at Donington Park's circuit and valid for the International classification only.The young Alberto Cerqui is unquestionably one of the stars of the championshi more >>\n\nSUPERSTARS SERIES MISANO ADRIATICOMaximum sportive ballast for the reigning champion Thomas BiagiAfter the rounds in Valencia and Portimao, valid for the International classification, the Superstars Series will be on track from Friday on in Misano A more >>\n\nThe paddock of Misano World Circuit is getting lively in sight of the fourth round of the Superstars Series that is due this weekend and will be valid for the Italian Championship only. Michela Cerruti, after the second place in race one more >>\n\nA positive performance for Michela Cerruti in Portimao (Portugal) in the third round of the Superstars Series, valid for the International series only. The young driver from Milan, despite a violent contusion occurred recently to her left hand, go more >>\n\nDouble victory and classification leadership for Thomas Biagi at PortimaoPerfect day for Thomas Biagi in the third round of the Superstars Series in Portimao (Portugal), valid for the International series only.After the third time set yesterda more >>\n\nHistoric hat trick for BMW Team Italy in Portimao (Portugal) in the third round of the International Superstars Series. A first positive signal came from qualifying held on Saturday with the pole position of the very young Alberto Cerqui (1'51.1 more >>\n\nTHOMAS BIAGI'S ENTHUSIASM HEADING TO A \"REAL” CIRCUIT LIKE PORTIMAOThe Superstars Series will be back on track from tomorrow on for the third round of the season in Portimao, valid for the International classification only.A positive memor more >>\n\nJust two days are left before the third round of the Superstars Series, valid for the International series only, scheduled from Friday on in Portimao (Portugal).Alberto Cerqui, the young talent of BMW Team Italy, will mak more >>\n\nThe Superstars Series championship is about to get on track for the second round of the season, on schedule in Valencia (Spain) from Friday on and valid for the International championship only. The \"Circuit de la Comunitat Valenciana\" is dedicated to more >>\n\nThomas Biagi harvested the first points in Monza, theatre of the opening round of the Superstars Series 2011.The Italian driver of BMW Team Italy, author yesterday of the fourth time in qualifying, in race one exploited all his class and determination more >>"}, {"url": "https://www.celebsagewiki.com/thomas-biagi", "page_content": "Age, Biography and Wiki\n\nThomas Biagi was born on 7 May, 1976 in Bologna, Italy. Discover Thomas Biagi's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 47 years old?\n\nPopular As N/A Occupation N/A Age 47 years old Zodiac Sign Taurus Born 7 May 1976 Birthday 7 May Birthplace Bologna, Italy Nationality Italian\n\nWe recommend you to check the complete list of Famous People born on 7 May. He is a member of famous with the age 47 years old group.\n\nThomas Biagi Height, Weight & Measurements\n\nAt 47 years old, Thomas Biagi height not available right now. We will update Thomas Biagi's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nThomas Biagi Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Thomas Biagi worth at the age of 47 years old? Thomas Biagi’s income source is mostly from being a successful . He is from Italian. We have estimated Thomas Biagi's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nThomas Biagi Social Network\n\nInstagram Linkedin Twitter Facebook Thomas Biagi Facebook Wikipedia Thomas Biagi Wikipedia Imdb\n\nTimeline"}, {"url": "https://alchetron.com/Thomas-Biagi", "page_content": "Thomas Biagi (born 7 May 1976, in Bologna), is a professional racecar driver from Italy.\n\nContents\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries on the Brazilian driver.\n\nBiagi switched to the \"second division\", the Italian F3000 Championship, in 1999, taking 4th place, which he repeated in 2000 (after the series had become Euro F3000), this time with a win, before taking a 2nd overall in 2001, in his second season with GP Racing.\n\nIn 2003, Thomas Biagi made a successful move to the FIA GT Championship, which he won in a BMS Scuderia Italia Ferrari 550 Maranello (co-driven with Matteo Bobbi). After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007.\n\nIn spite of having won the drivers title in the GT1 class, Biagi downgraded to GT2 in 2008, to drive a Ferrari 430 for AF Corse.\n\nThomas Biagi wins Superstars Race 2 at Monza\n\n"}, {"url": "http://www.mschumacher.com/racing-history/", "page_content": "The Beginning\n\nMichael Schumacher started out his racing career in the same way as all the great drivers, in karting. At four years old his father built him a kart and soon after enrolled him in the local kart club Kerpen Horrom. Michael’s problem was that in Germany the regulations stated the minimum permissible age to obtain a kart license was 14. To get around this he obtained a Luxembourg license (obtainable from the age of 12). However in 1983 he obtained his German license and the year after he won the German Junior Kart Championship. From 1985 Schumacher drove for Eurokart dealer Adolf Neubert and once again took the title.\n\nIn 1989 Michael signed with Willi Weber, whose team WTS he would drive for during 1989 and 1990 in the Formula 3 Championship. Weber paid the costs for both seasons (approximately 1 million DM). In the 1989 season Karl Wendlinger was champion, with Michael finishing 3rd behind Heinz-Harald Frentzen.\n\nDuring 1990 and 1991 Schumacher moved into sports car racing, instead of the more usual step up to Formula 3000. Many managers believed this would block his progression to Formula 1, but Weber believed that exposure to professional press conferences and dealing with the cars of 700bhp would be beneficial.\n\nFormula 1\n\nThe Belgian Grand Prix of 1991 at Spa was Michael’s debut in the world’s top racing series. His lucky break came as a result of Bertrand Gachot being imprisoned for spraying CS gas into a London taxi driver’s face. Qualifying 7th, he unfortunately retired on the first lap from this race with clutch failure of his Jordan-Ford. Although Eddie Jordan wished to sign Michael to the team, Schumacher was advised by Weber to act cautiously, as Jordan was to use factory Yamaha power the following year. They suspected this engine might prove to be second class and they were proved correct.\n\n\n\nSubsequent to this Michael moved to the Benetton team, replacing Roberto Moreno. He competed in five more grand prix that season with Nelson Piquet as team mate. In 1992 Schumacher was partnered with Martin Brundle and his first victory was 1 year after his debut at Spa. During 1993 Ricardo Patrese partnered Michael, that being Patrese’s last year in F1. Michael’s second win came at the 1993 Portuguese GP.\n\nIn the 1994 season with an under powered Ford Zetec V8 he took his first Driver’s Championship, after the death of Ayrton Senna at Imola. It came after a season of several run-ins with the FIA and he was disqualified from the British and Belgian Grands Prix. Michael was also put under a two race ban during the Italian and Portuguese GP that year. The race bans were a result of not adhering to a black flag (driver disqualified) at Silverstone that year. Instead of coming in, he continued on to win the race – the team had hoped that a later appeal would overturn the disqualification and hence keep the victory he obtained. The disqualification was a result of Michael overtaking Damon Hill on the parade lap, a seemingly psychological manoeuvre. In a controversial last round at the Australian GP Michael entered leading Damon Hill by one point. On the 36th lap Schumacher made an unbecoming mistake and banged the wall, damaging his rear suspension. He made it back on the track and as Damon Hill came to pass him on the next corner, Michael turned in on the Williams car. Hill’s front suspension was badly damaged and both cars were out of the race. Hence Michael gained the crown.\n\nThe 1995 season was just as successful. Schumacher now had Renault power, to match the Williams and he dominated the season. It was marred however by several collisions between himself and Hill. In a particularly stupid overtaking manoeuvre Hill took them both out of the British GP near the start of the race. Having taken 9 GP wins, Michael finished the season to take his second Championship.\n\nThe 1996 season saw Michael move to Ferrari with a reported salary of $30 million He stated the need for a new challenge as his reasoning, it being to return Ferrari to the pinnacle of motorsport. Eddie Irvine moved from Jordan to become his team mate in the same year. The Ferrari F310 car had poor handling and it was a testament to Michael’s ability that he managed to gain three wins. One of his wins, at the Spanish GP of that year was a wet race and is regarded as one of the best drives ever. His method of attaining time from the car resulted in somewhat flamboyant and uncharacteristic driving, with oversteering et al. With a lack of competitors Hill finally managed to take the world championship.\n\nWith Damon Hill being dumped from Williams in 1997, Michael’s main rival became former CART champion Jacques Villeneuve. The Ferrari was more reliable and a somewhat less than spectacular early season for Villeneuve allowed Michael to provide a challenge. He took 5 GP wins and at the last race of the season Michael was ahead in the championship by just one point. Mid way through leading the race in Jerez, Schumacher’s lap times began to drop off and concern was raised about the condition of his car. As Villeneuve came to pass on a corner, Michael turned in on him. His wheel banged the Canadian’s sidepod but the Williams seemed undamaged. Michael wound up in a gravel trap and was out of the race, with Villeneuve finishing third to take the title. In a decision by the FIA Schumacher was disqualified from the whole of the season as punishment for his manoeuvre in that race.\n\nIn 1998 the McLaren’s dominating the season convincingly and Michael was the only driver to come near them to provide a challenge. With the Ferrari improving significantly throughput the season and being particularly faster in the second half, Michael gained 6 wins and 5 other podiums. With the later outlawed mini sidepod wings the Ferrari’s took an historic 1-2 at the Italian GP at Imola that year.\n\nMichael’s accident at the British GP in 1999 ended his chances of taking the title in that year. Prior to that it looked very probable that he would take it. Looking back on the season and the relative performances of McLaren and Ferrari it seems likely he would have done so. The fact that Irvine was so close to Hakkinen in the championship at the end, surely indicates that Schumacher would have had it wrapped up long before, had he been able to compete. However he returned to drive the second two races of the season and astounded the paddock with his speed, leaving the pack behind. Excuses from drivers such as Coulthard and Irvine included that he’d had a nice rest at home and they were tired out after a full season of races.\n\nMichael regained the F1 Driver’s title in 2000 and then won it every year up to and including 2004. In 2005 and 2006 the streak ended with the Ferrari cars’ pace outdone by Renault, whose driver Fernando Alonso took the title in both years. Michael retired as a driver at the end fo the 2006 season, as the most successful F1 driver ever. He then took up a position as consultant to Ferrari.\n\nAfter Ferrari driver was injured, there was specualtion that Michael would return to F1 racing as a stand in for the 2009 season. However, a neck injury from motorcycle racing prevented that. Nevertheless, Michael did return to Formula 1 in the 2010 season on a three year contract with the Mercedes team. He then raced for three seasons, including 2011 and 2012 before once again retiring.\n\nRacing Results\n\nKarting\n\nYear Position Championship 1984 1st German Junior Kart Championship 1985 1st\n\n2nd German Junior Kart Championship\n\nJunior World Kart Championship 1986 3rd\n\n2nd\n\n3rd German Senior Kart Championship\n\nEuropean Kart Championship (North Zone)\n\nEuropean Kart Championship Final 1987 1st\n\n2nd\n\n1st German Senior Kart Championship\n\nEuropean Kart Championship (North Zone)\n\nEuropean Kart Championship Final\n\nSingle Seater\n\nYear Position Championship 1988 1st\n\n2nd\n\n6th German Formula König Championship\n\nEuropean Formula Ford 1600 Championship\n\nGerman Formula Ford 1600 Championship 1989 2nd (*) German Formula 3 Championship 1990 1st\n\nDQ German Formula 3 Championship\n\nEuropean Formula 3 Cup 1991 2nd All-Japan Formula 3000 Championship\n\nSports Car\n\nYear Position Championship 1990 DNF\n\n5th (=) German Touring Car Championship\n\nSports-Prototype World Championship 1991 DNF\n\n9th (=) German Touring Car Championship\n\nSports-Prototype World Championship\n\nFormula 1\n\nDetailed race and season results can be found at www.f1db.de."}, {"url": "https://www.automobilsport.com/speedcar-series-herbert-johnny-win-bahrain-race-thomas-biagi-gianni-morbidelli-qatar---55015.html", "page_content": "24.01.2009 / MaP\n\nJean Alesi won the first Speedcar Series race of the weekend at the Bahrain International Circuit. The Frenchman who started second on the grid was joined on the podium by Heinz Harald Frentzen in second position and Joh more >>\n\nJacques Villeneuve took the start from the tenth place of the starting grid, because of an electric problem which slowed him during qualifying, and finished in the same position because of an hard contact with a competitor. Ch more >>\n\nHeinz Harald Frentzen topped the hour long Speedcar Series practice session this afternoon at the Bahrain International Circuit ahead of two races to follow this weekend on Friday and Saturday. The German d more >>\n\nThe Speedcar Series Season opened in Dubai last month. Vitantonio Liuzzi swept the Qualifying session and Race 1. He was joined on the podium by Heinz Harald Frentzen in second place and Gianni Morbidelli in third. Liuzzi's team mate, UAE's Sheikh Hasher Al Maktoum finished 5th in the first race bringing the UP Team to the top of the points scale. Season 1 Champion Briton Johnn more >>\n\n22/01 BRN Bahrain26/02 UAE Dubai03/04 MAL Sepang*24/04 BRN Bahrain* Sous réserve de l'homologation du circuit / Subject to the homologation of the circuit.- FIA - December 2008 - more >>\n\nThe Race 1 preliminary classification is as follows: Pos Driver Teams Laps Time/Gap more >>\n\nEx-Formula 1 racer Vitantonio Liuzzi won the opening round of the second Speedcar season after a dramatic encounter at the Dubai Autodrome. more >>\n\nResults with an opposite sense for Durango in Speedcar. Christ more >>\n\nDurango made a very positive debut in Speedcar Series today. Jacques Villeneuve finished the practice session at P6, because of a problem with the throttle which distur more >>\n\nThe opening race to Speedcar Series Season 2 begins tomorrow at the Dubai Autodrome. 14 drivers will take to the grid representing seven professional teams at the 2-day race weekend. more >>\n\nSpeedcar Series' second season begins this weekend at the Dubai Autodrome with 14 cars on the grid. The Speedcars will be run by 7 teams from six countries across Europe, the Middle East and United States. Two of the current seven teams participated in Speedcar Series last season. They are German Phoenix Racing who also race in DTM, more >>\n\nBesides the GP2 Series, this week Durango will enter the Speedcar Series as well. The scuderia from Ve more >>\n\nFormula One Force India driver Vitantonio Liuzzi clocked the quickest lap at the Speedcar Series test that ended today at the Dubai Autodrome. He was among five other drivers that took the wheel at the final test before the start of Season 2 on 5-6 December, 2008. Liuzzi did not drive yesterday but managed to clock the fastest lap at this afternoon's session, quicker more >>\n\nJacques Villeneuve set the pace on the first day of the Speedcar Series test session at the Dubai Autodrome. This 2-day test is the final one before the start of Season 2 on 5-6 December, 2008. more >>\n\nL-R: James Grunwell (THA), Johnny Herbert (GBR), Chris Buncombe (GBR) and Sakon Yamamoto (JPN). Speedcar Series Testing, Dubai, UAE, 10 November 2008 (photo Agnes Carlier) 19-year-old British more >>\n\nJean Alesi set the fastest lap time for the second day in a row at the Speedcar Series test session that wrapped up today at the Dubai Autodrome. Canadian Paul Tracy, former Indycar champion, began the morning with the quickest lap. That was before German driver Uwe Alzen and Alesi's nemesis from Season 1 pushed the Frenchman in a battle to set the pace. They wer more >>\n\nSpeedcar Series today conducted the first of a 2 day test session at the Dubai Autodrome. Eight teams and 14 drivers attended the event. Teams from various parts of the globe turned out to test the 6.2 litre V8 Speedcars including David Price Racing from the UK; Malaysian team Meritus Racing, Christian Jones Racing from Australia and German Phoenix Racing that also ran i more >>\n\nFor Season 2, Speedcar Series is making the prize money more attractive to teams and drivers alike. The 3 million dollar prize pot includes 500,000 US dollars to the winning championship driver and an additional 500,000 US dollars to the winning championship team. Drivers will also win pre-determined amounts of money for ea more >>\n\nSpeedcar Series announced today the appointment of Claudio Berro as Operations Director before the onset of Season 2 this December. With 25 years of experience in the world of motorsport, Berro brings with him invaluable experience having served as Sporting Director of Peugeot-Italy, Team Manager and Press Officer of Ferrari F1 and then General Manager of Maserati and Fia more >>\n\nSpeedcar Series has just spent 3 days testing new modifications made to their custom built cars. The brand new engines, suspension and composite panelled bodies were put through a gruelling routine at the Dubai Autodrome from 14-16 October, 2008. Three Speedcars were set up for the test this week and among the host of teams and drivers in attendance were former F1 stars J more >>\n\nAfter a successful first season, Speedcar Series is unveiling new and exciting changes ahead of Season 2 scheduled to flag off in December this year. Former F1 drivers will be back behind the wheel this season along with a host of other new teams and drivers battling it out for a substantial prize pot of 3 million US dollars. The provisional calendar for th more >>\n\nSpécial bilan saison 2007/2008 Nico parmi l\u0092élite ! A mi-chemin entre la fin de l\u0092édition 2007/2008 de la Speedcar Series et l more >>\n\nSpeedcar Series has just completed a day and a half of rigorous testing on new components for the stockcars this afternoon at the Dubai Autodrome ahead of the second season commencing in October this year. The stockcar tested on the track has been set up with new and improved prototypes of the suspension, Brembo braking sys more >>\n\nNicolas Navarro, pilote Speedcar Series #71 Dubaï, 7ème et 8ème manches de la Speedcar Series, 11 et 12 avril 2008 La première saison de Speedcar Series s\u0092est achevée à Dubaï, là où elle avait été lancée à la fin du mois de janvier. Auteur d\u0092une impressionnante pole position, Nicola more >>\n\nSpeedcar Series' inaugural season came to a close last night with an awards gala celebrated at the One and Only Royal Mirage in Jumeirah, Dubai. Attended by drivers, teams, staff and socialites the gala recognised achievements by contributors and pilots across the season A spectacular video with the highlights of the season started the evening off and was well received, j more >>\n\nJohnny Herbert scored his second race victory of the weekend at the Dubai Autodrome on Saturday to seal the inaugural Speedcar Series title. Herbert actually ended the season level on points with David Terrien, but scored more wins than the Frenchman throughout the season. Title rivals Uwe Alzen and Jean Alesi, who both started the event in stronger points positions, both more >>\n\nJohnny Herbert scored a long overdue win in the first race of the Speedcar Series finale at Dubai Autodrome on Friday. The three-time Formula 1 grand prix winner, who was dominating the last race in Bahrain until he was forced out with a gear selection issue, came out on top of the 40-minu more >>\n\nGianni Morbidelli won the second Speedcar race today, taking the win away from Uwe Alzen who was penalised by the Bahrain Grand Prix stewards of the meeting for an incident on the track. Alzen receiving a 10 second penalty for gaining an unfair advantage by cutting a corner to overtake Marchy Lee on the inside during the race. Morbidelli who finished second 8.489 seconds more >>\n\nUwe Alzen made amends for his exclusion from Saturday's Speedcar race in Bahrain by winning the Sunday event. The German had won the first race on the road, but was later excluded for not wearing his HANS device, which is mandated by the rules. Helped by a high rate of attrition, he was able to win the second race from the back of the grid. \"The race was absolutely fantas more >>\n\nUwe Alzen's victory in the first race this morning was cancelled by the Bahrain Support Race Stewards of the meeting. The German driver was excluded from the race classification based on an official protest lodged by another team. The Stewards found that the driver had not worn his HANS (Head and Neck Safety Device) during the race in contravention of the Series more >>\n\nUwe Alzen took the lead of the Speedcar Series after scoring his third win of the season in a dramatic Saturday morning race in Bahrain. The German beat the strongest field of F1 drivers assembled thus far. New to the series for this race were 1997 World Champion Jacques Villeneuve, and his former Williams t more >>\n\nJohnny Herbert took pole position on the grid of the first Speedcar Series race at the Bahrain Grand Prix. The qualifying session determined the starting grid for the first of two race days that begin tomorrow. For most of the 45 minute qualifying, Johnny stayed ahead on the time board. The Briton was ousted by Stefan Johansson on a couple of laps before quickening his pa more >>\n\nBest race you took part in... \"Monza in my first year in Formula Nissan. I started from eighth place and fought my way onto the third step of the podium! Your toughest season... The 2005 GP2 Series. I didn\u0092t have much experience and the overall level was very high. Best team-mate... Jean Alesi. We were in the more >>\n\nSo the Speedcar concept suits you down to the ground... \"Yes, it\u0092s got everything I love. It\u0092s like going back to basics. On our cars the only electronic device is the engine management system. All the rest is mechanical. The car\u0092s not easy to drive and that makes the races all the more interesting. Even if you\u0092re 100% concentrated it\u0092s almost impossible to more >>\n\nThe arrival of Jacques Villeneuve in Speedcar Series is the red-letter event of the Bahrain weekend round of the championship. The 1997 F1 world champion has confirmed his participation in the last two meetings of the season. JV is among the most eclectic drivers in motor racing with a victory in the Indy 500 to his name. The 37-year-old Canadian has set himself a double more >>\n\nWith the Speedcar Series inaugural season at the halfway stage Jean Alesi and Uwe Alzen have pulled out a lead over their rivals. They have each scored two victories, so the Frenchman and the German look odds-on title favourites. With just a week to go to the final round on the Dubai circuit, will one of the two drivers pull out a decisive advantage in Bahrain? On more >>\n\nSpeedcar Series has released its final driver entry list today for the race weekend at the Bahrain Grand Prix between Friday and Sunday, April 4-6, 2008 The latest additions to the driver line up are '97 F1 World Champion Jacques Villeneuve, former F1 driver Heinz Harald Frentzen and Le Mans 24 Hours winner, Klaus Ludwig who also drove for the Series in Indonesia. more >>\n\nNicolas Navarro, pilote Speedcar Series #71 Sepang, Grand Prix de Malaisie 3ème et 4ème manches de la Speedcar Series, 22 et 23 mars 2008 Pour la première fois de sa jeune histoire, la Speedcar Series a eu le privilège d\u0092évoluer en lever de rideau de la Formule more >>"}, {"url": "https://fuelcurve.com/early-history-of-karting/", "page_content": "The Early History of Karting\n\nThe early history of karting is littered with photographic gold as you will see here. Karting is a young sport; six decades ago it didn’t exist. Karting as we know it began in 1956 in Glendale, California, when Art Ingels, a fabricator at Kurtis Kraft (the era’s dominant builder of Indianapolis 500 race cars) cobbled together a small, tube-frame machine powered by a 2-cycle lawn-mower engine.\n\nAfter showing off his contraption in a local parking lot, his friends went home and built their own machines. Soon, Ingels and his buddies were holding impromptu races in the Rose Bowl parking lot. By 1958, the first kart racing track was built in Azusa, California. The sport of kart racing was on its way.\n\nThe term “Go-Kart” was coined by Duffy Livingston, a muffler-shop owner in Los Angeles, who went on to manufacture and sell karts under the Go-Kart name — the first kart manufacturer. While Ingels may have built the first kart, Livingston is credited with launching its popularity.\n\nKart engines, from the late 1950s through today are mostly two-cycle, which deliver serious power in a small package. In 1959, McCulloch — of chainsaw fame — was the first company to produce dedicated kart engines. Clinton, Power Products and West Bend were rival engines.\n\n\n\nBy the 1960s karting — thanks to US servicemen — had spread to Europe, which saw the introduction of motorcycle engines (sans gearbox) before dedicated manufacturers, mostly from Italy, started to offer engines — Komet, Parilla, and Saetta.\n\nAs demonstrated by Ingels’ original kart, early karts were breathtakingly simple. The rudimentary Ingels kart, for example, used a hand activated mechanical brake, and the motor was direct drive, meaning no clutch. Tires were made of hard industrial rubber. There was no suspension, just lightning-quick direct steering.\n\nKart design evolved during the late 1950s and early 1960s, but not much. Live (solid) rear axles and left-pedal-operated hydraulic disk brakes became the norm. Centrifugal clutches removed the need for push starts. More engines developed more power, many running on methanol. Tires became wider and grippier.\n\nKarting became instantly popular, thanks to publicity delivered by Hot Rod magazine and a host of new kart publications. Chassis manufacturers sprung up like mushrooms after a warm rain. Sears and Montgomery Ward even sold karts by mail order. Meanwhile, kart tracks appeared on any undeveloped square of asphalt. Just add hay bales and stir.\n\nPopular culture came along for the ride. Karts appeared in movies, like “Bikini Beach,” starring Frankie Avalon and Annette Funicello. Other celebs caught behind the wheel of a kart include Steve McQueen, James Garner, Roy Orbison (pictured above), director Alfred Hitchcock, and The Beatles. Eventually, the “fad” of karting waned leaving the sport to develop into a serious form of motorsport.\n\nIn the U.S., kart racing was first was managed by the Go Kart Club of America, and later by the International Kart Federation and World Karting Association. Internationally, karting fell under the domain of the CIK/FIA world governing body, which still oversees competition around the world, including the World Karting Championships. In the U.S., the IKF, WKA, and SKUSA (SuperKarts USA) call the shots.\n\nWhile the karts are small, the skill set required to build, tune, and drive one of them is large. Race craft, passing technique, and car control can all be developed in karts, thanks to quick steering, direct feedback, and hours and hours of affordable “seat time.” The list of professional drivers who earned their chops in karts proves the point. Formula One champions Ayrton Senna, Michael Schumacher, Alain Prost, Fernando Alonso, Kimi Räikkönen, Jenson Button, Lewis Hamilton and Sebastian Vettel, to name but a few, all started in karts.\n\nBut it all began 61 years ago on a side street in Glendale, where an Indy car artisan whipped up a small 4-wheel diversion. The world of motorsports hasn’t been the same since."}]}