{"Thomas Biagi finished third in the championship that year, and went on to win the championship in 2000.": [{"url": "https://www.press.bmwgroup.com/global/article/detail/T0086799EN/thomas-biagi-wins-the-2010-italian-superstars-series-in-a-bmw-m3", "page_content": "Munich, 12th October 2010. Thomas Biagi (IT) and BMW Team Italy – ROAL Motorsport secured another title for BMW: In Vallelunga (IT) third and fifth in the final two rounds of the national Italian Superstars series were sufficient for Biagi to defend his overall lead in his BMW M3 and win the championship at the season finale. Biagi was crowned champion with 178 points, followed by Max Pigoli (IT) and Luigi Ferrara (IT) with 147 and 134 points respectively.\n\nThe title rounded off a successful season for Biagi, which included two wins, a pole position and five fastest laps. The 34-year-old also goes into the finale of the International Superstars Series in Kyalami (ZA) on 28th November 2010 with an excellent chance of picking up another title: Biagi leads the competition on 147 points, and is followed once again by Pigoli and Ferrara.\n\n“This is a dream come true for me,” said Biagi after the two successful races in Vallelunga. “This championship was new territory for me, and the car was obviously very different to drive compared to those I am familiar with from GT1 and LMP2. I found my feet quickly, however, and was competitive from the word go. BMW Team Italy has worked very hard since the winter tests. Everyone in the team contributed to this success. Roberto Ravaglia, who I always admired as a driver, also played a key role. He is also an outstanding team principal. Our focus now turns to the final in Kyalami, where there is another title up for grabs.”\n\nRoberto Ravaglia, who won the DTM and World Touring Car Championship as a driver for BMW, said: “This victory is one of the two objectives we set at the beginning of the year. We are also in a very promising position in the international series. With just one round to go, we are close to ending the season with the best possible result.”\n\n“We can be extremely satisfied,” added Umberto Grano, Sportive Activities Manager at BMW Italy. “BMW Italy believed in the growth of the Superstars Series. The fact that there were well over 20,000 fans again in Vallelunga is a just reward for the work put in by the organisers. Thomas Biagi's title and his consistent lead in the international series just go to prove the ability of ROAL Motorsport to develop a winning car.”"}, {"url": "https://www.automobilsport.com/thomas-biagi-final-act-international-gt-open---169683.html", "page_content": "26.10.2017 / MaP\n\nThe CAMS Australian Endurance Championship races into Round 3 of the 2017 season at the Laser Plumbing & Electrical Hampton Downs 500 this weekend (October 28 & 29).Having crossed the halfway point of the campaign, the season takes on an intern more >>\n\n> 14 of 34 spaces reserved for GT3 cars> Championship retains multi-class GT3/GT4 format Entries are now being officially accepted for next season’s British GT Championship after series organiser, SRO Motorsports Group, confirmed more >>\n\nAustralian GT race winner Fraser Ross will join forces with McLaren factory driver Alvaro Parente for the final two rounds of the 2017 Australian Endurance Championship.The pair will share duties behind the wheel of the YNA Autosport/McElrea Racing more >>\n\nEight Macao Champions for 10th Edition of GT SpectacularEight former winners of keynote races on the Guia Circuit will be on the grid for the 10th running of the Macau GT Cup on November 16-19, the FIA GT World Cup for the third consecutive year. more >>\n\nFollowing victory in 2015 and third place last year, the goal for the 2017 FIA GT World Cup in Macau is clear: to bring the GT3 title back to Affalterbach. As such, Mercedes-AMG is travelling with a strong contingent of drivers and teams: fro more >>\n\nWorld’s best campaigners and teams to battle for FIA GT World Cup Three squads and five drivers rely on Audi R8 LMS Challenging 6.2-kilometer street circuit leaves no room for mista more >>\n\nTwo races, two victories - that was the impressive outcome for Antonio Escámez and Miguel Ángel de Castro on the last weekend of the season. After their double victory in mid-September in Barcelona, the two Spaniards sharing the cockpit of the Team Drivex School SLS AMG GT3 were determined to repeat the feat at Los Arcos. And they did it in more >>\n\nHunter Abbott (GBR) came to the grand finale of the Blancpain GT Series Asia with a four-point deficit on the championship leader. He had one clear objective - to outsmart his main rival in the two remaining races and take the title. Abbott and his co-driver Maxi Buhk (GER) in the GruppeM Racing Mercedes-AMG GT3 got their weekend off to a promising start more >>\n\nPhoenix Racing Asia team owner and driver Marchy Lee believes winning this year’s Blancpain GT Series Asia Silver Cup title with Audi Hong Kong co-driver Shaun Thong proves the region has the talent to compete on the international stage. more >>\n\nTitle success in class and “vice championship” win in Asia: Audi’s customer teams were instantly among the front runners in the inaugural Blancpain GT Series Asia season. In the Asian GT racing series, OD Racing Team with Indian Adit more >>\n\n· Audi Sport Team Magnus R8 wins after nail-biting finish· Audi extends its lead in the Intercontinental GT Challenge manufacturer standings· Markus Winkelhock is the new leader in the driver standings more >>\n\nMazda Raceway Laguna SecaCircuit Length = 3.601 km1 44 GT3 Pierre KAFFER (DEU) / Kelvin VAN DER LINDE (ZAF) / Markus WINKELHOC1 Audi R8 LMS 314 8:00:27.641 141.23 1:25.19 more >>\n\nBlancpain GT Asia SeriesChina, Zhejian CircuitSunday, October 15th 2017DRIVER QUOTESMitch Gilbert, #86 OD Racing Audi R8 LMS GT3: “We won three times, and I don’t think anyone would have expected us to do as well as more >>\n\n> OD Racing Audi crew make it two wins from two…> …But fourth place seals title for Abbott> Lee/Thong miss out on Overall championship but still win Silver Cup> Cai/Lim crowned GT3 Am champions with CMRT Eurasia> Craft-Bamboo’s Merlin/Yu seal GT4 crown more >>\n\nChristopher Haase (#29 Audi Sport Team Land R8) confirmed the speed of his car by taking pole position for the inaugural Mazda Raceway California 8 Hours, by lapping the Laguna Seca Circuit in 1’23.961. He beat Markus Winkelhock (#44 Audi Sport Team Ma more >>\n\nRnd#9/10 2017 Audi R8 LMS Cup [FINAL]Zhejiang Circuit, China6-8 October, 2017To close out what has been an intense season of GT3 competition, Hong Kong’s Shaun Thong arrived at the new Zhejiang Circuit in south- more >>\n\nBLANCPAIN GT ASIA SERIESZhejiang Circuit, ChinaSaturday, October 14th 2017While GT3 appears wide open, Frank Yu and Jean-Marc Merlin took a giant step towards winning this year’s GT4 title after claiming class victory. The pair led more >>\n\nBLANCPAIN GT ASIA SERIESZhejiang Circuit, ChinaSaturday, October 14th 2017The three remaining title-contending crews started second, fourth and seventh, and all once again proved their credentials in the weekend’s opening hour-long more >>\n\n> OD Racing pair win from FFF Racing’s Read/Di Folco> Abbott now a point behind leaders Lee/Thong> GruppeM Racing wrap-up GT3 Teams’ title> GT4 victory moves Craft-Bamboo’s Yu/Merlin closer to class crown more >>\n\n- Merlin makes it two for Craft Bamboo Blancpain GT Series Asia - Zhejian ChinaFriday, October 13th 2017The second GT3 session witnessed a fantastic scrap between a quartet of Audi R8 LMS Cup front-runners, but it was ultimately Mitc more >>\n\nBlancpain GT Series Asia - Zhejian ChinaFriday, October 13th 2017Lamborghini Super Trofeo racer Chris Dreyspring was a late addition to VSR’s #66 line-up but made an immediate impression by claiming pole position in his maiden Blancpain GT Series Asia qual more >>\n\n> VSR’s debutant beats established order to Race 1 pole> Title-chasing Gilbert pips Rump by 0.009s> Craft-Bamboo’s Merlin and Yu claim double GT4 pole more >>\n\nITALIAN GT CHAMPIONSHIP Imperiale Racing ended the Italian GT 2017 Championship in Mugello with a stunning performance with both lineups on the podium in race one.The Itali more >>\n\nBLANCPAIN GT SERIES ASIA 2017ROUNDS 11 & 12 - ZHEJIANG, CHINA1 FFF Racing Team by ACM CHN Alberto Di Folco ITA S Aidan Read AUS S Lamborghini Huracan GT3 Silver GT3 more >>\n\nThree crews, two races, one champion> GT3 Drivers’, Teams, Am Cup and GT4 Drivers’ titles on the line> Lee/Thong lead Abbott and Gilbert/Patel> GruppeM on course for Teams’ crown> Three crews also in Am Cup and GT4 championship contention more >>\n\nThe final weekend of the season in Mugello has crowned Alberto Cerqui the new Italian Super GT3 Champion at the end of the Italian GT 2017 Championship. This result rewards the Italian driver at the end of an exciting season that has seen him on the absolute podium of th more >>\n\nThe Italian GT Championship season drew to a successful close this weekend with two races at Mugello (ITA). Stefano Comandini and Alberto Cerqui (both ITA) were competing in the BMW Team Italia #15 BMW M6 GT3, but were unable to finish either race. more >>\n\nAt the penultimate race of the Japanese Super GT Championship season at Buriram, Thailand, the Autobacs Racing Team Aguri (ARTA) finished in fourth place, missing out on the podium by just 0.210 seconds.Shinichi Takagi (JPN) and Sean Walkinshaw (GBR) shared more >>\n\n• The line-up of Ombra Racing also takes the last win of the season• Third place in the championship for Daniel Zampieri who finishes second in Race 2 with Riccardo Agostini of team Antonelli Motorspor more >>\n\n• After battle of current and former R8 LMS drivers, Tréluyer, Ghirelli grab P4 • Rangoni, Magnoni rule their class in good old ultra as car tally reaches 24 wins Audi Sport Italia claimed a couple more >>\n\nINTERNATIONAL GT OPEN Imperiale Racing has secured the eighth podium of the season in Monza, during the penultimate round of the International GT Open 2017. This result allowed the team to keep the lead of the Drivers and Teams classification. more >>\n\nEight manufacturers will be represented on the starting grid of the Mazda Raceway California 8 Hours, third round of the 2017 Intercontinental GT Challenge. Among them will be two Acura NSX GT3, the car making its debut in the series at the Laguna Seca track Two more >>\n\n2017 Intercontinental GT ChallengeRound 3 - Provisional Entry ListCALIFORNIA 8 HOURS1 3 TRG USA TRG Craig Lyons USA USA Bronze Kris Wilson USA USA Bronze Thomas Merril USA USA NC As more >>\n\nDeclan Jones completes Ginetta GT4 SuperCup season by bagging two second places for the Rob Boston Racing-Whitley Neill Gin team and secures fourth place in the Drivers’ ChampionshipLiverpool racing driver Declan Jones finished the season on a high by claiming more >>\n\n• Car damage rules Ben Gersekowski & Rory Collingbourne out the Super Trofeo Asia Series final• Duo now looking forward to the 'World Final' to be held at Imola in November&nb more >>\n\nGreat wait for the only Italian stage of the International Gt Open. On Saturday 30 September and Sunday 1 October, on the national circuit of Monza, will be the sixth and final round of the season.On the Italian track, Thomas Biagi, reduced to the top third more >>\n\nBrazil’s driver will make his comeback to the series to drive the Drivex-run Mercedes AMG GT3. Hahn and Hellmeister claimed a Pro-Am win at Paul Ricard circuit and also securing a podium overall Drivex will contest the penultimate roun more >>\n\nINTERNATIONAL GT OPEN Imperiale Racing is all set to get on track this coming weekend for the most awaited appointment of the International GT Open 2017, the Italian round – the penultimate of the season, to be held at the Autodromo Nazionale o more >>"}, {"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.automobilsport.com/superstars-thomas-biagi-full-glory-brno-victory-classification-lead---111374.html", "page_content": "20.05.2013 / MaP\n\nThomas Biagi and Mercedes-AMG's pairing continue to be one of the motives of the Superstars Series 2013. The Italian driver, race two winner of Monza's opener, secured today a stunning pole position (2'08.715) in Brno (CZ) that will allow him tomorrow more >>\n\nThe Superstars Series 2013 could not start in a better way for Thomas Biagi - at his first exit as Mercedes-AMG works driver - in Monza after the front row obtained yesterday in qualifying. Biagi kept the starting second position out of the insidious fir more >>\n\nNa een lange winter begint de autosport weer uit zijn winterslaap te komen. Op Circuit Zolder zijn de eerste races en testdagen alweer achter de rug en in het weekend van 20 en 21 april gaat het raceseizoen echt van start more >>\n\nSporting season 2013 has a big novelty for Thomas Biagi. The Bolognese driver, absolute protagonist of the Superstars Series since 2010, with a surprise move signed an agreement with team Romeo Ferraris linking his name to Merced more >>\n\nDe kogel is door de kerk. In 2013 zal in het weekend van 23 juni Circuit Zolder door bulderende V8 motoren trillen op zijn grondvesten. V-Max Racing Management is er namelijk in geslaagd om de International Superstars Series in 2013 naar Zolder te halen. De Superstars is more >>\n\nDavid gegen Goliath auf SizilienMit der erfolgreichen Premiere der Rennsportmesse ging für Renauer Motorsport vor gut einer Woche die Motorsportsaison 2012 zu Ende. Doch ganz wollten es die Niederösterreicher dann doch noch nicht bleib more >>\n\nSuperstars Series 2012 goes into archives with Thomas Biagi on the podium and scoring a stunning recover in Pergusa, stage of the last round of the season.After the very good performance of qualifying, the Italian driving for Team BMW Dinamic defended more >>\n\nThe perfect lap, one of those performance that only champions can put in, allowed Thomas Biagi today to set the fifth time (1'43.915) in Pergusa's qualifying valid for the last round of the Superstars Series that will decide the 2012 champions tomorrow in the tw more >>\n\nThe Superstars Series is ready to make its debut in Sicily for the final and decisive round of the season 2012, scheduled for this coming weekend in Pergusa. Both classifications of the International Series and the Italian Championship are wide open more >>\n\nThomas Biagi harvested a podium in front of more than 25.000 fans in Vallelunga's third last weekend of the Superstars Series 2012, valid both for the Italian and International Series. more >>\n\nQualifying in Vallelunga's third last round of the Italian Superstars Series - valid also for the International Series - finished with a fifth time (1'40.870) that does not satisfy Thomas Biagi, who produced a solid performance though at the wheel of the numbe more >>\n\nEn signant le doublé au volant de son Audi RS5, Gianni Morbidelli a marqué de son empreinte l’étape belge des Superstars Series. L’autre vedette du week-end fut sans conteste… la pluie qui s&rsquo more >>\n\nA determined Thomas Biagi gained today the maximum reachable result in two wet races at Spa, where emerged again the disadvantage imposed by the actual balance of performance to all the BMW.After the tenth place in race one, Biagi recovered well in the more >>\n\nLes dieux de la météo ont décidé d’accorder une faveur aux concurrents des Superstars Series, samedi à l’occasion d’une session qualificative palpitante : entamés sur une piste toujours humide, les débats se sont more >>\n\nAs in the Friday quotes, the qualifying session at Spa offered some difficulties to Thomas Biagi and to his BMW M3.During the first practice session the Italian driver set a promising third fastest lap (2'56.712) under a heavy rain, first between two wh more >>\n\nSi les Superstars Series occuperont évidemment le haut de l’affiche durant le prochain week-end, les autres catégories figurant au programme mériteront largement le déplacement. Caractéristique commune aux onze épreuves : elles sont tr&egr more >>\n\n-De chaudes explications en perspective! Douze petits mois après leur première venue, les Superstars Series reviennent à Spa-Francorchamps pour le sixième des neuf meetings de la saison. Pas besoin de l more >>\n\nSuperstars International Series, Budapest 2012A motivated Thomas Biagi comes home from Budapest, stage of the fifth weekend of the Superstars International Series, with a very good double podium that keeps him well within the title fight. more >>\n\n...after Donington Superstars Series raceTalent and experience allowed today Thomas Biagi to get positive results in the two races held in Donington (GB), theater of the third round of the Superstars Series, valid only for the International Se more >>\n\nA third and second place are the outcome of Imola's weekend for Thomas Biagi in the second round of the Superstars Series, an event valid both for the Italian Championship and the International Series.The driver from Bologna, third yesterday in qualifyi more >>\n\nThe Superstars Series is about to live in Imola the second round of the season, valid both for the Italian Championship and the International Series. The 'State of the art in world car racing' tis back on the Santerno's banks after one year of absence in an event that will celebrate more >>\n\nThomas Biagi produced a determined performance in Monza's opener of the Superstars Series, valid both for the Italian championship and International series. The driver from Bologna of Team Dinamic took his BMW M3 to the fourth place in both the races, harvesting in this way the more >>\n\nThe paddock of Monza is starting to get lively ahead of the opening race of the Superstars Series, scheduled for this weekend at the circuit near Milan in a round valid both for the Italian Championship and the International Series.The 'State of the art in world ca more >>\n\nDie Superstars International Series ist schon seit Jahren eine angesehene Bühne für gestandene Motorsport-Stars und aufstrebende Talente. In der Saison 2012, die am ersten Aprilwochenende in Monza beginnt, geht auch ein deutscher Pilot an den Start: Der erst 18 Jahre alte Thomas Schöffler aus Singen pilotiert einen rund 450 PS starken Audi more >>\n\nSeason finale as team man for Thomas Biagi in Vallelunga, stage of the final round of the Superstars Series 2011.After the fourth time in qualifying held yesterday, the Italian driving for BMW Team Italy kept the starting position from lights to flag in r more >>\n\nFascinating round for the Superstars Series, on stage from tomorrow on at the legendary circuit of Spa-Francorchamps (Belgium) for the seventh weekend of the season, valid both for the Italian and International championships.The reigning champion Thomas Biagi has on his scoreboa more >>\n\nThe Superstars Series will be on track from tomorrow on at Spa (Belgium) for the seventh round of the season, valid for the Italian and International Series.Michela Cerruti, one of the symbol drivers of the category, has never raced before on the challenging track of the Ardennes: th more >>\n\nThomas Biagi harvested another podium in Misano Adriatico's sixth round of the Superstars Series, valid both for the Italian and International Championships.After the front row obtained in qualifying, the Italian driving for BMW Team Italy produced a solid race more >>\n\nThe Superstars Series is heading to United Kingdom for the fifth round of the season, scheduled for this weekend at Donington Park's circuit and valid for the International classification only.The young Alberto Cerqui is unquestionably one of the stars of the championshi more >>\n\nSUPERSTARS SERIES MISANO ADRIATICOMaximum sportive ballast for the reigning champion Thomas BiagiAfter the rounds in Valencia and Portimao, valid for the International classification, the Superstars Series will be on track from Friday on in Misano A more >>\n\nThe paddock of Misano World Circuit is getting lively in sight of the fourth round of the Superstars Series that is due this weekend and will be valid for the Italian Championship only. Michela Cerruti, after the second place in race one more >>\n\nA positive performance for Michela Cerruti in Portimao (Portugal) in the third round of the Superstars Series, valid for the International series only. The young driver from Milan, despite a violent contusion occurred recently to her left hand, go more >>\n\nDouble victory and classification leadership for Thomas Biagi at PortimaoPerfect day for Thomas Biagi in the third round of the Superstars Series in Portimao (Portugal), valid for the International series only.After the third time set yesterda more >>\n\nHistoric hat trick for BMW Team Italy in Portimao (Portugal) in the third round of the International Superstars Series. A first positive signal came from qualifying held on Saturday with the pole position of the very young Alberto Cerqui (1'51.1 more >>\n\nTHOMAS BIAGI'S ENTHUSIASM HEADING TO A \"REAL” CIRCUIT LIKE PORTIMAOThe Superstars Series will be back on track from tomorrow on for the third round of the season in Portimao, valid for the International classification only.A positive memor more >>\n\nJust two days are left before the third round of the Superstars Series, valid for the International series only, scheduled from Friday on in Portimao (Portugal).Alberto Cerqui, the young talent of BMW Team Italy, will mak more >>\n\nThe Superstars Series championship is about to get on track for the second round of the season, on schedule in Valencia (Spain) from Friday on and valid for the International championship only. The \"Circuit de la Comunitat Valenciana\" is dedicated to more >>\n\nThomas Biagi harvested the first points in Monza, theatre of the opening round of the Superstars Series 2011.The Italian driver of BMW Team Italy, author yesterday of the fourth time in qualifying, in race one exploited all his class and determination more >>"}, {"url": "https://www.thecheckeredflag.co.uk/2010/10/thomas-biagi-wins-italian-superstars-title/", "page_content": "Thomas Biagi won the Italian Superstars Championship at the final round of the national season at Vallelunga at the weekend. Biagi, who drives a BMW M3 for BMW Team Italy (ROAL Motorsport), finished third and fifth in the two races to secure the Italian title.\n\nThe first of the two races at Vallelunga was won by multiple touring car champion Fabrizio Giovanardi in the impressive Porsche Panamera, run by N.Technology. The second race was won by Audi Sport Italia driver Alberto Cola. Having entered the weekend leading the standings, Biagi's results ensured he would beat Mercedes drivers Max Pigoli and Luigi Ferrara to the title.\n\n34-year-old Biagi won two of the sixteen races that made up the Italian Superstars Championship for 2010, also taking a pole position and five fastest laps. The Vallelunga races also counted towards the International Superstars Series, which concludes at Kyalami in South Africa on 28 November. Biagi leads the International standings too, followed by Pigoli and Ferrara again.\n\n2010 is Biagi's first year competing in the Superstars Series. The Italian has traditionally competed in GT racing, winning the FIA GT Championship in 2003 and 2007. At the end of the weekend, Biagi said: “This is a dream come true for me. This championship was new territory for me, and the car was obviously very different to drive compared to those I am familiar with from GT1 and LMP2. I found my feet quickly, however, and was competitive from the word go. BMW Team Italy has worked very hard since the winter tests. Everyone in the team contributed to this success. Roberto Ravaglia, who I always admired as a driver, also played a key role. He is also an outstanding team principal. Our focus now turns to the final in Kyalami, where there is another title up for grabs.”\n\nRavaglia said: “This victory is one of the two objectives we set at the beginning of the year. We are also in a very promising position in the international series. With just one round to go, we are close to ending the season with the best possible result.”\n\nUmberto Grano, Sporting Activities Manager at BMW Italy, added: “We can be extremely satisfied. BMW Italy believed in the growth of the Superstars Series. The fact that there were well over 20,000 fans again in Vallelunga is a just reward for the work put in by the organisers. Thomas Biagi’s title and his consistent lead in the international series just go to prove the ability of ROAL Motorsport to develop awinning car.”"}, {"url": "https://www.golfdigest.com/story/pga-championship-2018-frequently-asked-questions", "page_content": "After a quiet stretch on the PGA Tour schedule, the season heats up once again with the 2023 PGA Championship, which will be held at Oak Hill in Rochester, N.Y. This will be the fourth time this course will host the vaunted major, placing it second in total PGAs only behind last year’s host, Southern Hills.\n\nJust one year ago, Justin Thomas bested Will Zalatoris in a down-to-the-wire playoff in Oklahoma, which only occurred due to a 72nd-hole collapse by 54-hole leader Mito Pereira. A drive by the Chilean directly into a water hazard kept JT and Willy Z alive, with Thomas ultimately coming back from seven strokes down to start the final round.\n\nThis was the first major to require extra holes since the 2017 Masters. That was 19 consecutive majors that only needed 72 holes, the longest streak in PGA Tour history.\n\nIt should be an excellent second major of the season after a Jon Rahm Masters barnburner back in April. Below, we'll answer any and all frequently asked questions you may have about the 2023 PGA Championship at Oak Hill.\n\nWhen and where is the PGA Championship being held in 2023?\n\nThis year’s PGA will take place at Oak Hill, which has gone through quite the renovation over the last decade or so. The East Course has been essentially overhauled and will feature a drastically different look due to a large removal of trees, recontoured bunkers and major work to three holes, including the elimination of one altogether.\n\nArchitect Andrew Green revised the Donald Ross-designed course and added 200 yards of additional teeing space, bringing the total championship distance to just under 7,400 yards.\n\n\"The new dynamics give Oak Hill’s membership more freedom to play, to hit a variety of shots and recover,” wrote Derek Duncan, Golf Digest’s Architecture Editor. “It should also prove an entertaining test for the professionals, who will be tempted to flex their muscles. If the remodel helps the East Course get back to crowning champions like Nicklaus, Trevino and Cary Middlecoff (winner of the 1956 Open) and their 27 combined major titles like it used to, the club won’t have to do anything more to entice the USGA or PGA of America to come back.”\n\nHas Oak Hill hosted any other majors other than the upcoming PGA Championship?\n\nEven with the historic redesign, it’s not as if Oak Hill hasn’t been critical in the golf landscape since its inception back in the early 20th century. The course has hosted many a major tournament from 1949’s U.S. Amateur to the Senior PGA Championship in 2019. After the completion of 2008’s Senior PGA Championship, Oak Hill Country Club became the first club in the United States to have hosted all six of the men's major championships that move around the country.\n\nIn terms of majors, the New York course has hosted three U.S. Opens (1956, 1968 and 1989) and three PGA Championships (1980, 2003 and 2013). The last PGA before the upcoming event featured Jason Dufner’s only major. Dufner held off Jim Furyk by two shots with a two-under 68 on Sunday. Tiger Woods finished T-40, never breaking par his entire four-day run in Rochester.\n\nWho conducts the PGA Championship?\n\nThe Professional Golfers’ Association (PGA) of America conducts the event.\n\nAre the PGA Tour and the PGA of America different?\n\nYes, the PGA Tour and the PGA of America have been independent of one another since 1968. The PGA Tour is an elite organization of tournament professionals, while the PGA of America is made up of club and teaching professionals who work at on- and off-course golf facilities around the country (and the world).\n\nWhen and where was the first PGA Championship played? And who won?\n\nThe first PGA Championship was played in 1916 at Siwanoy Country Club in Bronxville, N.Y. England’s Jim Barnes won, 1 up, over Jock Hutchinson.\n\nWait, 1 up … so was the PGA Championship a match-play event at one time?\n\nYes, from 1916 to 1957, the PGA Championship was contested as match play with a stroke-play qualifier. During the course of the championship, it was not uncommon for players to play more than 200 holes in seven days. Starting in 1958, the PGA Championship switched to the standard 72-hole, stroke-play format. Dow Finsterwald won the first stroke-play version of the event in 1958 at Llanerch Country Club in Havertown, Pa.\n\nHow many players are in the field?\n\nThere will be 156 players in the field at this year's PGA Championship. 18 of those are LIV golfers from reigning Open champion Cam Smith to two-time PGA champ Brooks Koepka to 2020 Masters winner Dustin Johnson to 2020 U.S. Open champion Bryson DeChambeau to six-time major champ Phil Mickelson.\n\nThe PGA Championships uses a points formula that is finalized after the Wells Fargo Championship. It takes the top 70 who are not otherwise exempt, plus extra spots for the winners of past major championships plus the top 20 finishers in the PGA of America’s annual club pro tournament. The PGA of America can randomly invite any player, and Joel Dahmen got such an invite this year.\n\nSergio Garcia will not contend for the Wanamaker Trophy at Oak Hill, as the 43-year-old Spaniard failed to qualify for the championship. This will be the second major Garcia will miss since his major contention began back at 1999's Open Championship. The only other that he missed was the 2020 Masters, which he had to skip due to testing positive for COVID-19.\n\nHow do club professionals earn one of the 20 spots?\n\nThe PGA of America fills the 20 spots held for club professionals for the top finishers at the PGA Professional Championship, which finished in early May at Twin Warriors & Santa Ana Golf Clubs in New Mexico.\n\nHas a club professional ever won the PGA Championship?\n\nNot in the modern era of the PGA Tour. According to the PGA, the best performance since 1970 by a club professional playing in the PGA Championship was a third-place finish in 1971 by Tommy Bolt, a former tour pro who had retired from the tour. The last top 10 also came from a former tour pro—a very famous one—turned club professional: Sam Snead in 1973. Only one club professional has finished inside the top 20 in the last 30 years, Jay Overton in 1988 at Oak Tree. Prior to 2021, only three had made the cut in the previous seven years: Ben Kern at Bellerive in 2018, Omar Uresti at Quail Hollow in 2017 and Brian Gaffney at Whistling Straits in 2015. But in 2021 at Kiawah Island, two clubs pros made the weekend: Ben Cook, who tied for 44th, and Brad Marek, who finished 78th.\n\nCan amateurs play in the PGA Championship?\n\nThe PGA Championship is limited to professionals only, meaning amateurs cannot qualify.\n\nWhat does the winner of PGA Championship receive?\n\nThe PGA champion receives the Wanamaker Trophy, the largest trophy of the four men’s majors. In 2022, the winner also received a top prize of $2.7 million, 18 percent of the $15 million purse. (The PGA of America hasn't announced what the purse is for 2023.) Traditionally the winner also receives automatic invites into all three of the other majors and the Players Championship for the next five years, PGA Tour membership for the next five years and DP World Tour (formerly the European Tour) membership for the next seven years. They also become eligible to compete in the PGA Championship for life.\n\nWho won the 2022 PGA Championship?\n\nMaddie Meyer/PGA of America\n\nWhat looked like Mito Pereira’s major quickly became anything but after a tough drive on the 18th hole found a water hazard and ultimately knocked the 54-hole leader out of contention.\n\nOut of his woes emerged Justin Thomas and Will Zalatoris who battled in a three-hole aggregate playoff to break the tie at the top. JT tied the largest comeback in the major’s history, as he started Sunday behind seven strokes of the lead and he went on take home $2.7 million winner’s share of the $15 million purse.\n\nCameron Young, Matt Fitzpatrick, Tommy Fleetwood, Chris Kirk and Rory McIlroy rounded out the top eight spots.\n\nWill Phil Mickelson be in this year's field to “defend” his title?\n\nAfter a hell of a run at the Masters, finishing tied for second, Phil Mickelson will return at this year’s PGA Championship. It’ll be his first time at this tournament since winning it in 2021. A lot has happened since then, including a thing called LIV Golf. Perhaps you’ve heard of it.\n\nLefty is one of 18 LIV Golfers in this event due to their placement in the top 100 in the Official World Golf Ranking. Justin Thomas and Mickelson will both be defending their PGA wins with Phil looking to win his third.\n\nWho has won the most PGA Championships?\n\nJack Nicklaus and Walter Hagen hold the record for most PGA Championship victories with five. Nicklaus also holds the record for most runner-up finishes in the PGA Championship with four.\n\nTiger Woods makes his putt for par and to win the PGA Championship at Southern Hills Country Club in Tulsa, Oklahoma in 2007. Montana Pritchard/PGA of America\n\nHow many PGA Championships has Tiger Woods won?\n\nTiger Woods has won four PGA Championships, the last coming in 2007 at Southern Hills.\n\nWho are the most famous golfers not to have won the PGA Championship?\n\nThere are three players in golf history who have won the other three men’s major championships (the Masters, the U.S. Open and the Open Championship) but have not completed the career Grand Slam by winning the PGA. They are Arnold Palmer, Tom Watson and Jordan Spieth. At the time of writing this, Spieth’s play in the upcoming PGA Championship is in doubt due to a left wrist injury that forced him to WD from the AT&T Byron Nelson. It’s supposed to be assessed week to week, according to Spieth and his doctors, and we’ll see soon enough if he’ll make the trip to Rochester to try to win that final major he needs to complete the Career Grand Slam.\n\nWho is the youngest winner of the PGA Championship?\n\nGene Sarazen is the youngest winner, claiming the title at Oakmont Country Club in 1922 at 20 years and 174 days old. He defended his title the following year at Pelham Country Club and went on to win his third and final PGA at Blue Mound Golf & Country Club in 1933.\n\nWhat is the PGA Championship scoring record?\n\nThe record for the lowest 72-hole score in a PGA Championship was held by David Toms for his 15-under 265 total at Atlanta Athletic Club in Duluth, Ga., in 2001, but Brooks Koepka broke that mark in 2018 with his 16-under 264 at Bellerive. Koepka also tied the record set by Henrik Stenson at the 2016 Open Championship for the lowest total in major championship history.\n\nWhat is the PGA Championship scoring record in relation to par?\n\nJason Day holds the record for scoring in relation to par not only in PGA Championship history but in major championship history. The Australian was 20-under-par (268) when he won at Whistling Straits in Haven, Wis., in 2015.\n\nWhat is the highest winning score of a PGA Championship? In relation to par?\n\nThe highest total score of a PGA champion is one-under 287, shot by Larry Nelson in 1987 at PGA National in Palm Beach Gardens, Fla. The highest winning score in relation to par was one-over 281, shot four times: Jay Hebert, 1960; Julius Boros, 1968; Gary Player, 1972; and Dave Stockton, 1976.\n\nWhat is the largest margin of victory in the PGA Championship?\n\nSam Greenwood\n\nThe largest margin of victory in the PGA Championship belongs to Rory McIlroy, who won by eight strokes in 2012 at the Ocean Course at Kiawah Island (S.C.). The Northern Irishman won the event again in 2014 at Valhalla Golf Club in Louisville, Ky. That remains his last major championship victory.\n\nIf players are tied after 72 holes, how is a winner determined?\n\nIn the event of a tie, the PGA of America employs a three-hole aggregate format for the championship's playoff. This occurred just one year ago between Justin Thomas and Will Zalatoris. If players are tied after three holes it becomes a sudden-death playoff.\n\nHow many playoffs have there been in PGA Championship history?\n\nSince 1958 and the move to stroke play, there have been 14 playoffs in the PGA Championship, the most recent coming in 2022. The last one before that was back in 2011 at Atlanta Athletic Club, where Keegan Bradley defeated Jason Dufner in the three-hole aggregate playoff.\n\nWhat site has hosted the most PGA Championships?\n\nSouthern Hills Country Club in Tulsa, Okla., last week's host venue, is the all-time leader in PGA Championships hosted with five. Oak Hill is next with its fourth on the way.\n\nWhat state has hosted the most PGA Championships?\n\nNew York has hosted the most PGA Championships with 13, including three at Oak Hill Country Club in Rochester, N.Y., which hosted the 2013 PGA Championship. It’ll be four at Oak Hill Country Club in just a few days time.\n\nWhat are the future venues for the PGA Championship?\n\nFuture venues for the PGA Championship have been announced officially through 2029. There is also a “TBD” year for 2030, as well as a venue locked in for 2031. They are as follows:\n\n2024 — Valhalla Golf Club, Louisville, Ky.\n\n2025 — Quail Hollow Club, Charlotte, N.C.\n\n2026 — Aronimink Golf Club, Newtown Square, Pa.\n\n2027 — The East Course at PGA Frisco, Frisco, Texas\n\n2028 — The Olympic Club, San Francisco\n\n2029 — Baltusrol Golf Club (Lower), Springfield, N.J.\n\n2030 — Congressional Country Club, Bethesda, Md.\n\n2034 — The East Course at PGA Frisco, Frisco, Texas\n\nWho is the favorite to win the 2023 PGA Championship?\n\nAt the moment of writing this, Masters champ Jon Rahm is the slight favorite to win the PGA, at least according to DraftKings. At +750 for outright winner, Rahm is barely in front of Scottie Scheffler, who is then followed by Rory McIlroy, Xander Schauffele and Justin Thomas. Phil Mickelson is +13000 if you’re looking for a long-shot bet. Or if you’re feeling really frisky, John Daly is +100000.\n\nWhat will the weather be like for the 2023 PGA Championship?\n\nUnlike the tumultuous Augusta weather at this year’s first major, it looks like we’ll be seeing some calm and uneventful weather—knock on wood, of course—at the upcoming PGA. The early forecast seems to be mostly sunny days with highs in the 60s, and lows in the mid-to-high 40s. There is a chance for some rain showers on Friday, so keep a lookout for that.\n\nWhat is Oak Hill known for?\n\nWell, that’s a difficult question as this year’s major at Oak Hill will be quite a bit different that its predecessors. The revamped club still features the giant oak trees it's known for but many trees have been cut down to lengthen the course and vary the scenery. The pesky pond on 15 is gone, and the fifth hole now plays as the sixth in the course set-up.\n\nGolf Digest’s Architecture Editor Derek Duncan went into detail on what’s new at the Rochester course, so let’s let him take it away …\n\n“Oak Hill’s par-70 East Course will still be defined by its stellar par 4s, including the restored sixth and the long closing trio of 16, 17 and 18,” Duncan wrote. “The course has some intriguing short par 4s, too, including the stylish uphill second with a blind, narrow green set above deep trench bunkers, the 12th that plays through a gauntlet of bunkers to a putting surface benched into a sharp hillside, and the dramatic 320-yard, uphill 14th that will entice players to attempt to drive the green, though misses short will leave them in bunkers well below the putting surface, and shots that go over the green are likely to roll off the property.\n\n“All the remodeling work makes Oak Hill a more diverse and interesting course than it was, one that allows players to be more aggressive off the tee than in the past but requires careful calculation hitting shots into the greens.”\n\nWho broadcasts the PGA Championship?"}, {"url": "https://www.thomasbiagi.racing/en/deepening-thomas-biagi-biography/", "page_content": "He won all the categories he raced in: 6 international titles in 14 years\n\nThomas Biagi: a racer who, driven by his passions, lived a lifestyle within and around racing tracks all around the world: Other than being one the most popular drivers of the international racing world, thanks to the 6 titles won in the four wheels world, his experience in managing racing teams has made of him also a successful manager in the field of corporate incentives.\n\nThomas Biagi was born in Bologna in 1976, he started his career, like many F1 drivers, from karting (in which excelled), winning the title of Italian Champion. Thomas was a pioneer in the world of the Motorsports, being the first modern driver to race on single-seaters while still underage, at just 16. After a first year in Formula Alfa Boxer, and while still underage, he entered Formula 3, the real training ground of the auto sports. In this category scores various wins before starting a brilliant career in the international F3000, where he clinched the title of European vice-championship, second only to the still very young Felipe Massa. The experience gained in years of single-seaters made it possible for Thomas to test various F1 cars.\n\nIn 2003 Biagi decided to make a career change and to leave the single-seaters for the Ferrari covered wheels with a FIA GT Ferrari 550. After 6 wins, 5 of which were consecutive, in 2007 he clinched the title of World Champion in the competitive FIA GT1 series behind the wheel of a Maserati MC12. This triumph also helped him to win the coveted title of “Casco d’Oro di Autosprint”.\n\nIn 2009 impossible challenges were a constant in Thomas’ career: raced in three championships: Speedcar Series, FIA GT1 and Le Mans Series. In the Prototypes category he claimed the victory on his debut on the “1000 Km of Barcelona” and finished the season dominating the 6 hours of Vallelunga"}, {"url": "https://www.automobilsport.com/race-categories--24,165634,Thomas-Biagi-leader-of-the-Championship,news.htm", "page_content": "02.07.2017 / MaP\n\nAudi Sport Customer Racing Australia is ready to turn up the heat as the CAMS Australian GT Championship heads to Townsville next weekend (July 7-9) for the penultimate round of the 2017 season.With two cars in Championship contention, the h more >>\n\nPorsche Team EBI has become the latest Japanese outfit to confirm its entry for Blancpain GT Series Asia’s upcoming round at Fuji Speedway this August.Naoya Yamano and Yuya Sakamoto will drive the squad’s 991 GT3 R, which contested last seas more >>\n\n> Super Taikyu teams and drivers prove their worth on home soil> Championship organisers keen to attract further Japanese entries for Fuji Blancpain GT Series Asia’s race-by-race Japanese entries - ARN Racing, CarGuy Racin more >>\n\nBlancpain ASIA GT Series, Japan RoundSuzuka Circuit 2017Result: Suzuka Race 2 more >>\n\n> GruppeM Racing duo benefit from OD Racing’s puncture> Chou and Chang run out comfortable GT4 winnersGruppeM Racing’s Hunter Abbott and Maxi Goetz starred in Blancpain GT Series Asia’s second rac more >>\n\nBlancpain ASIA GT Series - Japan Round , Suzuka CircuitSaturday, June 24th 2017DRIVER QUOTESMarchy Lee, #5 Audi Hong Kong R8 LMS GT3: “I made a good start and had the inside line on Aditya [Patel] into Turn 1, more >>\n\n... as Yu/Merlin triumph in GT4> Audi Hong Kong pair take championship lead with 16.5s victory> Craft-Bamboo duo chase down Taiwan Top Speed for GT4 spoilsMarchy Lee and Shaun Thong claimed the Blancpai more >>\n\nDuring the fourth weekend of June 1992, exactly 25 years ago, Stephane Ratel organised his first ever race, on the Bugatti Circuit in Le Mans. It was the launch of the Gentleman Drivers Trophy, for the French sportscar manufacturer Venturi. Its runaway success ignited the more >>\n\nBLANCPAIN ASIA GT SERIES, Japan RoundSuzuka CircuitSaturday, June 24th 2017Qualifying results Q1 more >>\n\n> Craft-Bamboo Racing and Porsche seal first Blancpain GT Series Asia pole> Picariello maintains 100% qualifying record> Chou gives Taiwan Top Speed Racing pole for this afternoon’s race> Two from three more >>\n\n... This Coming Weekend For Another Round Of Thrilling GT Racing World renowned Italian luxury super car manufacturer Automobili Lamborghini is readying for the third round of the 2017 Super Trofeo Asia series, the Asian incarnation of its now globa more >>\n\n> Abbott and GruppeM aiming to defend slender GT3 leads> Japanese race-by-race crews add variety> Lo/Tong and Merlin/Yu set to renew GT4 rivalryDownload: Suzuka entry list more >>\n\nRace 1: Minshaw/Keen and Tregurtha/Middleton prevail in Snetterton thriller> Keen battles past Littlejohn for third GT3 win of 2017> HHC’s Middleton pips Pittard to GT4 spoilsBarwell Motorsport’s more >>\n\nProvisional Race Results1 Valvoline Jamec Pem Racing Tim Miles/Jaxon Evans Audi R8 LMS GT3 103 3:11:56.1262 Eggleston Motorsport more >>\n\nAudi drivers Jaxon Evans and Tim Miles have combined to claim the opening round of the Australian Endurance Championship at Phillip Island.The duo overcame tricky, changeable conditions, which saw the race start in bright sunshine before torrential rain lashe more >>\n\nMitchell and Keen share Snetterton GT3 poles > Barwell’s Keen completes perfect day at the office> Reed repeats 2016 GT4 pole for Lanan> Tolman’s Osborne paces GT4 Pro qualifyingJack Mi more >>\n\nRnd#1 Australian GT Endurance Championship, Phillip Island, VictoriaM-Motorsport (27-28 May, 2017)M-Motorsport heads into the opening round of the 2017 CAMS Endurance Championship to take the fight to the established endura more >>\n\nBLANCPAIN GT SERIES ASIA D’station Racing has become the latest Japanese squad to confirm a Blancpain GT Series Asia entry for its home rounds at Suzuka and Fuji where team owner Satoshi Hoshino will partner Seiji Ara a more >>\n\nChris Pither will join Ash Samadi in the Ah Apartments Audi R8 LMS for this weekend's Australian Endurance Championship opener at Phillip Island.Together, Pither and Samadi complete a four-car entry for Audi Sport Customer Racing Australia. more >>\n\nThe opening round of the 2017 CAMS Australian Endurance Championship races into Phillip Island this weekend (May 27 - 28).This weekend team's will face a 500km test of skill in what will set a new record for the longest distance more >>\n\n2017 CAMS Australian Endurance Championship races into Phillip Island this weekend (May 27 - 28).Phillip Island Timetable 2017Session Times more >>\n\n> Barwell’s Minshaw and Keen chasing history> HHC’s Tregurtha and Middleton lead Ginetta 1-2-3It’s been six years since Snetterton last hosted a British GT round so early in the season, but this Bank Hol more >>\n\nLiverpool racing driver Declan Jones showed good pace and took more points in his Whitley Neill Gin branded-Ginetta G55 during round three of the 2017 Michelin Ginetta GT4 SuperCup at Oulton Park last weekend (May 20-21).The Halewood Wines & Spirits-backed star, who took a more >>\n\nBLANCPAIN GT ASIA SERIESBuriram, Chang International CircuitSunday, May 21st 2017Hunter Abbott, #999 GruppeM Racing Mercedes-AMG GT3: “We’ve had a weekend of real ups and downs. In FP2 I had a crash, which ended up being quite a more >>\n\n> Back-to-back podiums and Silver Cup wins for Audi Hong Kong’s Lee/Thong> Cai/Lim claim maiden Am Cup victory> Craft-Bamboo Racing’s Merlin/Yu seal GT4 honours> Result: Race 2 more >>\n\nBLANCPAIN GT SERIES ASIA> Spirit of Race pair beat Audi Hong Kong’s Lee/Thong> Post-race penalty drops GruppeM Mercedes-AMG from 2nd to 6th> Taiwan Top Speed’s Wang/Chang inherit GT4 win from Merlin/Yu more >>\n\n...At Chang International Circuit In Buriram The world’s most thrilling single make series has returned to Buriram’s Chang International Circuit in Thailand for the second time in as many years for another weekend of action packed racing more >>\n\n> Ferrari and Audi share GT3 spoils> Tong inherits GT4’s Race 1 pole, Lo starts first in Race 2 BBT’s Anthony Liu has claimed pole position for this afternoon’s Blancpain GT Series Asia race at Chang Internat more >>\n\nBLANCPAIN GT SERIES ASIA 2017ROUNDS 3 & 4 - BURIRAM, THAILAND1 FFF Racing Team by ACM CHN Aidan Read AUS S Alberto Di Folco ITA S Lamborghini Huracan GT3 Silver GT32 FFF Racing Team by ACM CHN Zhu more >>\n\nBlancpain GT Series Asia Three teams and six drivers representing Thailand - third only to Hong Kong and China in terms of numbers - will compete on home soil at Chang International Circuit in Buriram this weekend when Blancpain GT Series more >>\n\nChina GT Championship - Goldenport, Beijing, China M-Motorsport’s Glen Wood made his China GT Championship debut at Beijing’s Goldenport Motor Park, joining the Xtreme Motorsport team in the #86 KTM X-Bow GT4 al more >>\n\nRnd#2 2017 China GT Championship [GT3]Beijing Audi Goldenport Motor Park, ChinaAfter an emphatic victory in the opening round of the 2017 China GT Championship for Kings Racing star Xu Jia at Goldenport Circuit in Beijin more >>\n\n....with Imperiale Racing in the Lamborghini Super Trofeo Europe • The Italian-Venezuelan duo also wins Race 2 at Silverstone• First victory for Galbiati and Giraudi (Antonelli Motorsport) in the PRO-AM categ more >>\n\nRnd#1 2017 China GT Championship [GTC/GT4]Beijing Audi Goldenport Motor Park, ChinaRnd#1 China GT ChampionshipGTC - 60-minutes (12 May, 2017)1. 22. Huang Xi Zhan (D2 Lamborghini Huracan Super more >>\n\nRnd#1 2017 China GT Championship [GTC/GT4]Beijing Audi Goldenport Motor Park, ChinaThe opening event of the 2017 China GT Championship saw a strong field of GTC and GT4 entries competing at Beijing Audi Gold more >>\n\n• The Italian-Venezuelan crew of Imperiale Racing team in the lead since from pole to checkered• In the PRO-AM, first victory for Lagrange-Vanneste with Leipert Motorsport• Raffaele Giannoni of Automobili Tricolore scores a success in the AM class more >>\n\nRnd#1 2017 China GT Championship [GT3]Beijing Audi Goldenport Motor Park, ChinaGT3 - 60-minutes (12 May, 2017)1. 07. Xu Jia (Kings Audi R8 LMS GT3) - 51-laps2. 99. Bao Jin Long /Martin Ragginger (FAW T2M more >>\n\nRnd#1 2017 China GT Championship [GT3]Beijing Audi Goldenport Motor Park, ChinaKings Racing’s Xu Jia has claimed the opening round of the 2017 China GT Championship in the hotly contested GT3 category, the Chinese star more >>"}, {"url": "https://www.automobilsport.com/bmw-sports-trophy-award-ceremony-maisach-thomas-biagi-2012---105755.html", "page_content": "51st BMW Sports Trophy Award Ceremony in Maisach 01.12.2012: Thomas Biagi is the most successful BMW privateer of the 2012 season. Photo: BMW Sports Trophy Award Ceremony, BMW Motorsport\n\nThomas Biagi is the most successful BMW privateer of the 2012 season.\n\n\n\n\n\n\n\nPhoto: BMW Sports Trophy Award Ceremony, Top-25 of the 2012 BMW Sports Trophy.\n\n\n\n\n\nThis year’s trophy for the most successful BMW privateer goes to Italy: BMW Motorsport Director Jens Marquardt and Alessandro Zanardi (IT) presented Thomas Biagi (IT) with the winner’s cheque for 30,000 Euros at the 51st BMW Sports Trophy Award Ceremony in Maisach near Munich. Biagi can also look forward to a drive in the BMW M3 DTM – which was the special reward for the winner of the 2012 BMW Sports Trophy.\n\n\n\n\n\nBiagi’s success came courtesy of overall victory in the Italian GT Championship at the wheel of a BMW Z4 GT3 run by BMW Team Italia, as well as third place in the International Superstars Series in a BMW M3, again representing ROAL Motorsport. Biagi claimed four race wins and 14 podiums in the two series.\n\n\n\n\n\n“Congratulations to Thomas Biagi,” said Marquardt. “Together with his team-mates he really made his mark on the 2012 Italian GT Championship. Over the course of last season we once again witnessed countless magnificent performances from BMW drivers in high-class racing series.\n\n\n\n\n\nThe fact that Biagi has come through to win the BMW Sports Trophy against such strong opposition underlines just how consistent he has been this year. He can now look forward to a drive in the BMW M3 DTM.”\n\n\n\n\n\nBiagi, who won the BMW Sports Trophy with a score of 434.23 points, said after the Award Ceremony: “First place in the BMW Sports Trophy is a huge honour for me. I had been invited to the ceremony for the top 25 BMW privateers for the last two years.\n\n\n\n\n\nI would like to thank the fantastic team at ROAL Motorsport for enabling me to win it at the third attempt. We had an amazing year. I am proud to be a part of the BMW family. I will soon be even prouder when I get behind the wheel of the BMW M3 DTM. That is the stuff of dreams for any BMW driver.”\n\n\n\n\n\nThe 51st BMW Sports Trophy saw a total of 243 participants – more than ever before in the long history of this competition – do battle for a share of the 250,000 Euros prize money. Marquardt said: “Even after over half a century, the BMW Sports Trophy still remains extremely attractive to drivers all over the world.\n\n\n\n\n\nThis year we had 243 entrants from 24 countries on four continents. They represented BMW in 47 racing series around the world. Every driver who enters the BMW Sports Trophy is part of the BMW Motorsport family. Our privateers are fantastic ambassadors for the BMW brand.”\n\n\n\n\n\nSecond place behind Biagi, and a cheque for 25,000 Euros, went to Maxime Martin (BE). Among the 26-year-old’s achievements were second place overall in the Blancpain Endurance Series with the BMW Z4 GT3. He narrowly missed out on winning the DTM test by just 25 points in the BMW Sports Trophy.\n\n\n\n\n\nHowever, Martin had already completed a test at the wheel of the BMW M3 DTM just a few weeks ago. Third place, and 21,000 Euros in prize money, went to Norbert Michelisz (HU) with his BMW 320 TC. He won the Independents' Trophy in the FIA World Touring Car Championship (WTCC). He also claimed one of three BMW race wins in the 2012 WTCC at his home event in Budapest (HU).\n\n\n\n\n\nAs well as the prospect of winning a healthy amount of prize money at the end of the year, participation in the BMW Sports Trophy also comes with many other advantages. Particularly attractive are the many cooperations that BMW Motorsport enjoys with selected companies within its Customer Racing programme.\n\n\n\n\n\n\n\nPhoto: BMW Sports Trophy Award Ceremony, BMW Motorsport Director Jens Marquardt, Thomas Biagi (IT), Alessandro Zanardi (IT).\n\n\n\n\n\nBMW Sports Trophy 2012.\n\n\n\n\n\n\n\n1. Thomas Biagi IT BMW Z4 GT3 / BMW M3 434,23\n\nItalian GT Championship / International Superstars Series\n\n\n\n\n\n2. Maxime Martin BE BMW Z4 GT3 / BMW Alpina B6 GT3 409,87\n\nBlancpain Endurance Series / ADAC GT Masters\n\n\n\n\n\n3. Norbert Michelisz HU BMW 320 TC 391,07\n\nFIA WTCC Independents’ Trophy\n\n\n\n\n\n4. Tom Coronel NL BMW 320 TC 334,00\n\nFIA WTCC\n\n\n\n\n\n5. Franz Engstler DE BMW 320 TC 322,67\n\nFIA WTCC Independents’ Trophy\n\n\n\n\n\n6. Henry Walkenhorst DE BMW M3 GT4 314,55\n\nVLN Langstreckenmeisterschaft\n\n\n\n\n\n7. Robert Thiele DE BMW 328 296,07\n\nPro IT Series / North Atlantic Road Championship\n\n\n\n\n\n8. Yelmer Buurman NL BMW Z4 GT3 276,67\n\nFIA GT1 World Championship\n\n\n\n\n\n9. Matthias Lauda AT BMW Z4 GT3 274,13\n\nFIA GT1 World Championship / Blancpain Endurance Series\n\n\n\n\n\n10. Stefano D’Aste IT BMW 320 TC 273,60\n\nFIA WTCC Independents‘ Trophy\n\n\n\n\n\n11. Steve Jans LU BMW M3 269,10\n\nVLN Langstreckenmeisterschaft\n\n\n\n\n\n12. Michael Bartels DE BMW Z4 GT3 261,33\n\nFIA GT1 World Championship\n\n\n\n\n\n13. Rob Servers NL BMW 120d 255,95\n\nBurando Production Open\n\n\n\n\n\n14. Markus Palttala FI BMW Z4 GT3 253,87\n\nBlancpain Endurance Series\n\n\n\n\n\n14. Bas Leinders BE BMW Z4 GT3 253,87\n\nBlancpain Endurance Series\n\n\n\n\n\n16. Ralf Oeverhaus DE BMW M3 GT4 246,55\n\nVLN Langstreckenmeisterschaft\n\n\n\n\n\n17. Hajo Müller DE BMW M3 E36 242,00\n\nVLN / 24h Nürburgring\n\n\n\n\n\n18. Emin Akata DE BMW M3 E46 239,90\n\nVLN / 24h Nürburgring\n\n\n\n\n\n19. Wolf Silvester DE BMW M3 E46 239,90\n\nVLN / 24h Nürburgring\n\n\n\n\n\n20. Jörg Weidinger DE BMW M3 GT4 239,00\n\nVLN Langstreckenmeisterschaft\n\n\n\n\n\n21. Nick Catsburg NL BMW M3 GT4 / BMW Z4 GT3 236,53\n\nDutch GT Championship\n\n\n\n\n\n22. Robert Collard GB BMW 320si 231,67\n\nBritish Touring Car Championship\n\n\n\n\n\n23. Christian von Rieff DE BMW M3 230,65\n\nVLN Langstreckenmeisterschaft\n\n\n\n\n\n24. Carsten Knechtges DE BMW M3 CSL 225,90\n\nVLN / 24h Nürburgring\n\n\n\n\n\n24. Tim Scheerbarth DE BMW M3 CSL 225,90\n\nVLN / 24h Nürburgring\n\n\n\n\n\n\n\n\n\nPhoto: BMW Sports Trophy Award Ceremony, BMW Motorsport Director Jens Marquardt, Maxime Martin (BE), Thomas Biagi (IT), Norbert Michelisz (HU), Alessandro Zanardi (IT).\n\n\n\n\n\n\n\n\n\n\n\nIngo Lehbrink, photos BMW"}, {"url": "https://www.deseret.com/2023/4/15/23683037/utah-gymnastics-red-rocks-finish-no-3-lose-to-oklahoma-florida-in-ncaa-national-championship", "page_content": "FORT WORTH, Texas — It is a story that has been told before. Three consecutive years now.\n\nUtah gymnastics enters the NCAA gymnastics championship at Dickies Arena in Forth Worth, Texas, with title aspirations — legitimate ones at that — but leaves as one of the vanquished, specifically as the third place finisher.\n\nIt happened in 2021, when Utah finished third overall behind Michigan and Oklahoma.\n\nIt happened in 2022, when the Red Rocks finished third overall behind Oklahoma and Florida.\n\nAnd it happened again Saturday.\n\nUtah finished third overall at the national championships for the third straight year, again finishing behind a champion in Oklahoma and a runner up in Florida.\n\nNCAA final results NCAA women’s gymnastics championship results\n\nTeam scores — Oklahoma; 198.3875; Florida, 198.2375; Utah, 197.9375; LSU, 197.5250\n\n\n\nEvent winners\n\n\n\nAll-around — Haleigh Bryant (LSU); 39.7250\n\n\n\nBalance beam — Maile O’Keefe (Utah); 10.0\n\n\n\nFloor exercise — Jordan Bowers (Oklahoma), Danielle Sievers (Oklahoma); 9.9500\n\n\n\nUneven bars — Kayla Dicello (Florida), Leanne Wong (Florida); 9.9750\n\n\n\nVault — Trinity Thomas (Florida); 10.0\n\n\n\n\n\n\n\nThe Sooners, now repeat champions, won with a 198.3875, while the Gators ended with a 198.2375, the Utes with a 197.9375, and in fourth place, LSU with a 197.5250.\n\nAnother year, the same story.\n\n“I feel like we’ve done this,” Utah head coach Tom Farden said. “Maybe three times now.”\n\nOnce again it was the vault rotation that did the Red Rocks in.\n\nWhile Utah was excellent on uneven bars (49.5500) and floor exercise (49.5000) and unreal on balance beam (49.7375), the vault rotation was less than stellar.\n\nNo gymnast was able to stick their vault landing, and the highest individual score came in at 9.9000, courtesy of Abby Brenner, while Utah had to count a score in the 9.7-range (9.7625).\n\nThe rotation scored only a 49.1500, the lowest event score by any of the four teams that competed in the national championship.\n\nAnother year, the same failure. Right?\n\nStrictly speaking, yes.\n\nYes, Utah finished third overall, the program’s national title drought — which is agonizing to fans — stretching to 28 long years in the process.\n\nThe last time the Red Rocks were national champions, Bill Clinton was the President of the United States, Batman Forever wound up the highest grossing movie at the box office and no current Utah gymnast had been born yet.\n\nAgonizing indeed.\n\n1 of 4 2 of 4 3 of 4 4 of 4\n\nAnd yes, the Red Rocks weren’t nearly good enough on vault in a meet that demands elite rotations on all four events. Again.\n\nEven fourth place finishing LSU managed to avoid a rotation like Utah’s vault on Saturday.\n\nBut this year was different. If for no other reason than Utah went down fighting. On vault specifically.\n\n“We were going for sticks and when you do that you risk the danger of stepping backwards,” Farden said. “And when you do that that is a bigger deduction than for a step forward.”\n\nNearly every one of Utah’s vaults saw a gymnast take a step back (or two) when competing in the most common 10.0 valued vault in the sport — the Yurchenko 1.5.\n\nUtah went for the win on Saturday and came up short.\n\n“It is another learning lesson,” Farden said.\n\nWhile tears wound up streaming down the faces of multiple Red Rocks, there was little sorrow from them about the end result.\n\n“Our goal for this weekend was to give it our all and leave nothing back,” senior Abby Brenner said. “We did that. We went 24 for 24 (on routines). You can’t really ask for more.”\n\nAdded sophomore Grace McCallum: “This team fought hard until the end. We did a killer beam rotation. I couldn’t be more proud of everybody. Hopefully next year is our year.”\n\nThe weekend, which includes Thursday’s semifinals, was — in the eyes of Farden — a success even, despite another third place finish.\n\n“I actually feel like the program did make another progression this year,” he said. “I can look at things realistically.”\n\nHe laid three specific reasons.\n\n“No. 1, most sports have a Final Four and it is really hard to get to the Final Four,” Farden said. “We’ve done it several times now. No. 2, we beat Oklahoma in postseason and that is extremely hard to do.\n\n1 of 5 2 of 5 3 of 5 4 of 5 5 of 5\n\n“My third point to this, I really felt like we are the precipice. We had really good scores on floor and bars and on balance beam they were unconscious. Those are amazing scores that put you in title contention.”\n\nOf course, Farden knows that something needs to be different. Same behavior, same results, or something like that.\n\n“We have to keep tinkering and figure some things out,” Farden said. “I am really proud of the kids. They fought all the way to the end. We were on cloud nine after Thursday night. And it is sports. It is not a perfect science. If it was...”\n\nThere were bright spots for Utah, though they may have faded away with the final result.\n\nSenior Maile O’Keefe earned another perfect 10 on beam, her second in two days in Fort Worth and the tenth of her career.\n\nNothing left to say about Maile O'Keefe on beam 🐐\n\n\n\n𝐌𝐚𝐢𝐥𝐞 𝐬𝐜𝐨𝐫𝐞𝐬 𝐀𝐍𝐎𝐓𝐇𝐄𝐑 𝐏𝐄𝐑𝐅𝐄𝐂𝐓 𝟏𝟎!! pic.twitter.com/nlXEQQHJ0o — Utah Gymnastics (@UtahGymnastics) April 15, 2023\n\n“She is at the pinnacle,” Farden said.\n\nThe Red Rocks’ poor vault rotation happened in the middle of the competition, and rather than wither away, the team went on to their two best events of the day on bars and beam.\n\nUtah’s beam rotation was nearly record-breaking — the team’s low score that counted was a 9.9125 — and established once and for all that the Red Rocks are the best beam team in the nation.\n\n“We all said before the meet, win, lose or draw, there was no result that would disappoint,” senior Cristal Isa said. “We had an amazing year and nothing we did today was going to change that. It is a little disappointing because of how things were leading up, but we did our best. We finished it out really strong and I am really proud of us.”\n\nFor another year, Utah’s best was not good enough to warrant the title best in the nation.\n\nWhich means sooner rather than later, the Red Rocks will get back to work.\n\n“I am going to be out on the road and recruit,” Farden said. “We will look at our training plan. I thought we had really good legs. We were right there in a lot of ways.\n\n“... We have a nucleus of a lot of people who are exceptional and know how to handle big meets. And we are bringing in some really big talent (next year). So excited about the future. Always.”"}]}