{"Thomas Biagi has competed in the FIA GT Championship.": [{"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://us.motorsport.com/gtwce-sprint/news/thomas-biagi-joins-matech-driver-line-up/2906310/", "page_content": "Thomas Biagi teamed up with Thomas Mutsch for the first two rounds of the FIA GT!\n\nHaving been the talk of the town during the Test & Media Days of the FIA GT championship with the unveiling of the new Ford GT1, the Matech GT Racing team can now officially announce the names of its two drivers for the first two rounds of the FIA GT 2009 championship. .And the least one can say is that the Ford GT1, now already meeting the technical norms as laid down for 2010 will be in the hands of a couple of experts, namely the German Thomas Mutsch, the in-house driver who is also responsible for the development of the Matech GT-Racing power beasts, and the Italian Thomas Biagi!\n\nThe latter is a true specialist when it comes to international GT competitions, with no less than two Drivers titles under his belt, in 2007 (Maserati) and 2003 (Ferrari), and not without having contributed to the Teams titles for the AF Corse organisation(2008) and Vitaphone Racing (2006 and 2005). Thomas Biagi will do everything in his power and expertise to assist Matech GT Racing in the development of the new Ford GT1, which will be making its maiden appearance at the Silverstone circuit during the first weekend of May.\n\n\"I'm truly delighted to be involved in this project \", Thomas Biagi commented. \" One of the things I really appreciate in motorsport is the on-going development of the cars. The Ford GT1 Matech meets the 201O regulations, and I'm fully aware that this is not to our advantage this coming season. However on the other hand I'm certain that my experience can be put to good use to help the team, go forward and prepare the future. Since 1993 I have fully committed myself for the various teams I have been involved with, and I reckon that my integration into the Matech GT Racing organisation is an excellent thing. I will be getting to know the car at Silverstone during the initial training sessions. But I'm quite sure that with Thomas Mutsch we will produce some pretty satisfying results \"\n\nFor the time being the agreement between Matech GT Racing and Thomas Biagi is based on two rounds of the championship, namely Silverstone and Adria.\n\n-credit: matech"}, {"url": "https://au.motorsport.com/stockcar/news/speedcar-thomas-biagi-bahrain-ii-race-one-report/2907051/", "page_content": "TOMORROW THOMAS STARTS IN POLE IN BAHRAIN AND THEN IN THE FIA GT WITH FORD!\n\nA MAGIC MOMENT FOR THE ITALIAN PILOT...\n\nSakhir - Speedcar Series.9th rounds: Today Biagi has received something that yesterday the fortune took him away, when he ended up the race in the twelfth position because of a friction disk breakup. Thanks to the eighth place he got today in race 1 (won by Jonny Herbert), tomorrow he will start from the first position in the conclusive competition of the Championship. In the meantime important news arrived: he will drive the first two competitions of the FIA GT on the mythical Ford GT 40 that after 40 years of absence comes back to the competitions, already compliant with the 2010 new rules GT1. Appointment therefore on Sunday 3rd May in Silverstone.\n\n\"I am happy to start in a good position for tomorrow, even if I have to thank the regulation said Thomas Biagi. In comparison with the free proofs, we have improved the set-up and tomorrow I hope making a further progress we need. I am even more enthusiastic for the call received by Ford Matech team to develop the car that will dispute the next and its first Championship of the World Fia GT in 2010. And it's a beautiful challenge, we cannot fight immediately for the victory because future regulations are very penalizing. The most beautiful prize for me in this case will be giving a contribution in the growth of this beautiful car. I have to thank Martin Bartek for the trust and respect shown after few minutes of conversation. We have agreed by them in the stop made during my trip to come here!\".\n\nIn facts, for you Thomas next weeks will be motion binding, tomorrow you race in Bahrain with the Speedcar; on May 3rd in the FIA GT in Silverstone, on May 10th the LMS in SPA and still on May 16th in the FIA GT in Italy in Adria. \"I will be very often flying and as much often racing with many cars very different among them. Driving is my job and my passion. It goes very well this way. My psico-phisical training will be determining in this intense month\".\n\n-credit: tb"}, {"url": "https://au.motorsport.com/gtwce-sprint/news/thomas-biagi-joins-matech-driver-line-up/2906311/", "page_content": "Thomas Biagi teamed up with Thomas Mutsch for the first two rounds of the FIA GT!\n\nHaving been the talk of the town during the Test & Media Days of the FIA GT championship with the unveiling of the new Ford GT1, the Matech GT Racing team can now officially announce the names of its two drivers for the first two rounds of the FIA GT 2009 championship. .And the least one can say is that the Ford GT1, now already meeting the technical norms as laid down for 2010 will be in the hands of a couple of experts, namely the German Thomas Mutsch, the in-house driver who is also responsible for the development of the Matech GT-Racing power beasts, and the Italian Thomas Biagi!\n\nThe latter is a true specialist when it comes to international GT competitions, with no less than two Drivers titles under his belt, in 2007 (Maserati) and 2003 (Ferrari), and not without having contributed to the Teams titles for the AF Corse organisation(2008) and Vitaphone Racing (2006 and 2005). Thomas Biagi will do everything in his power and expertise to assist Matech GT Racing in the development of the new Ford GT1, which will be making its maiden appearance at the Silverstone circuit during the first weekend of May.\n\n\"I'm truly delighted to be involved in this project \", Thomas Biagi commented. \" One of the things I really appreciate in motorsport is the on-going development of the cars. The Ford GT1 Matech meets the 201O regulations, and I'm fully aware that this is not to our advantage this coming season. However on the other hand I'm certain that my experience can be put to good use to help the team, go forward and prepare the future. Since 1993 I have fully committed myself for the various teams I have been involved with, and I reckon that my integration into the Matech GT Racing organisation is an excellent thing. I will be getting to know the car at Silverstone during the initial training sessions. But I'm quite sure that with Thomas Mutsch we will produce some pretty satisfying results \"\n\nFor the time being the agreement between Matech GT Racing and Thomas Biagi is based on two rounds of the championship, namely Silverstone and Adria.\n\n-credit: matech"}, {"url": "https://us.motorsport.com/gtwce-sprint/news/silverstone-thomas-biagi-race-report/2294684/", "page_content": "Thomas fourth in the rank, if only the safety car.\n\nSILVERSTONE (GBR) - It would have been a well-deserved podium, but the safety car has spoiled the new adventure start of Thomas Biagi in FIA GT Championship; it went down in the racetrack to reshuffle and to make people stare at it and not for a concrete need: in fact the wheel lost by a GT1 car had already been cleared away by the stewards/officials.... Ferrari F430 driven by Thomas arrived fourth on the fabulous Silverstone racetrack checquered flag.\n\n\"Anyway, I'm satisfied with this fourth place - the Itlain pilot said at the end of the race - if only the safety car didn't drive in and damaged the strategy (perfect since then) I think I would be here talking about a seond or a third place. No problem: there is a very good understanding with my new team mate and we are now learning secerets and virtues in this strong vehicle\".\n\n\"I'm happy with Michelin intremediate tyres which performed well and with the whole team who worked in an excellent way: the feeling for all the AF Corse staff is growing day by day. I'm optimistic for the future and I can't wait to drive in the car and go down in the race in Monza, within a month. There are high standing car drivers in this category, but we are ready to batthe. I'm confident with the race we will play at home\".\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/gtwce-sprint/news/thomas-biagi-joins-af-corse/2274953/", "page_content": "Thomas Biagi on Ferrari 430 of AF Corse team!\n\nThe die is cast. Thomas Biagi has made up his mind. Beginning of this year the Fia GT Champion was asked wether to go on with Vitaphone Team or to switch to another team. A strong challenge to stake again his carreer. Go back to Ferrari, with very good memories of World Championship FIA GT 2003 on his 550 Maranello or all the kilometers ran on the single seat cars in Ferrari Client Race Department like 640, previously Nigel Mansell in '90s, and F398 and F1-2002 previously Schumacher during Ferrari days.\n\nThose are the off the cuff comments: \"After three years with Maserati, three World Champion titles of the team, two titles of the Constructors ended up with my personal success last season, I've reached all my possible goals. My last choice has been determined by different factors, firstwhole the desire to give myself a chance in an extremely competitive championship like this year GT2 with 20 teams in the lists, moreover a strong belief in the consistency of Ferrari long time plans and above all the high opinion for Mr Amato Ferrari, who I can reflect myself with for his expierence as a pilot. It's always unique to have a Rampant Horse on steering wheel spokes. I would say I acted in \"Lippi's way\", getting out of GT1 as World Champion to enter in GT2 aware that there will be a lot to work upon, starting from my driving style. At the same time I'm still longing for new records and above all I wish I could support the whole Team. In AF Corse team I will meet a group of strongly motivated people I worked with in the past, will be supported by Michelin and - least but not last - I will have a very strong team companion Christian Montanari. I think there are all the premises for a good start!\".\n\nThose are the words of Team Principal Amato Ferrari: \"I believe that this year I will have in my team precious pilots. Together with Vilander and Bruni, the arrival of Biagi and Montanari from GT1 is a confirmation that GT2 is becoming more amd more important. This year, Ferrari and Porsche will fight strongly, and there is high interest for the new Aston Martin. I'm very pleased to to line up two World Champions of 2007 in my team\".\n\n-credit: thomasbiagi.com"}, {"url": "https://www.autosport.com/f1/news/opportunity-of-a-lifetime-when-a-gt-ace-realised-his-f1-dream/6560973/?nrt=54", "page_content": "Repainted in a dour grey and red befitting of its uninspiring new name, the Midland EJ15B that had competed in the 2005 Formula 1 season as Jordan was shared by several drivers for testing at Jerez that December. A forgettable chapter in the long history of the Silverstone team now known as Aston Martin it may be, but to Thomas Biagi it is a prized memory of a career that had its finest days in GT racing.\n\nThe 2003 FIA GT champion had been out of single-seaters for three years by the time he landed his long-awaited test opportunity, a decade after his last official test with Minardi at Fiorano in 1995.\n\nA stalwart of International Formula 3000 and its Italian/European cousin between 1995 and 2002, Biagi’s crushing victory at Donington in 2001 – against opposition that included F1 2008's nearly-man Felipe Massa – was the exception rather than the rule.\n\nBut even at 29, Biagi never lost sight of his F1 goal – “I believe in the power of your dream,” he says – and despite having no manager in his corner convinced team boss Colin Kolles to give him a run out with a view to racing in 2006.\n\nWith the 2005 Toyota V10 powerplant behind his back, he completed 91 laps and lapped 1.37s quicker than new Midland signing Christijan Albers in an EJ15B with a 2006-spec V8.\n\nBiagi felt quickly at ease with the car as it was easier, he says, than his 2005 steed – the Maserati MC12 – “because the weight of the car, the downforce, all of the electronic sup-port like traction control, differential that helps you”.\n\nThomas Biagi, 2005 Midland F1 test Photo by: Motorsport Images\n\n“For me it was nice and easy for me to drive a Formula 1 car, [but] then to be world champion is another story!” he laughs. “The test went extremely well, in the end they were extremely happy about my performance and my consistency.\n\n“It’s a shame because in the end they showed me an agreement to make a full season, but I was just missing the budget. We were pretty close.”\n\n\"There are no words that can describe the feeling this kind of engine behind your shoulders gives you. I miss the F1 of the end of the '90s and beginning of the 2000s\" Thomas Biagi\n\nMidland used a bevy of third drivers in 2006, with Markus Winkelhock (four), Giorgio Mondini (nine), Adrian Sutil (three), Alexandre Premat and Ernesto Viso (one each) all taking their turns to drive on grand prix Fridays. Biagi wasn’t among them and continued in GT1, but that wasn’t the end of his F1 story.\n\nA chance paddock meeting with Kolles in 2007, when Biagi was commentating on GP2 for Sky Sport Italy, yielded an offer to sign a race-by-race deal for the renamed Spyker team in place of the cash-strapped Albers. But budget was again a stumbling block and Biagi remained in the MC12 to claim a second FIA GT title.\n\nIn his place, Winkelhock made a memorable debut at the rain-hit European GP. Thanks to a pre-race switch to wets, he was in the lead when the waterlogged track – with an expensive carpark forming in the Turn 1 gravel – caused the race to be red-flagged.\n\n“Watching the race from home and seeing that the car I was supposed to drive was leading was strange!” says Biagi, who would rack up further sportscar titles in Italian GT (2012) and International GT Open (2016) after prevailing in the Italian-based Superstars tin-top series in 2010.\n\nMarkus Winkelhock, Spyker F8-VII leads Felipe Massa, Ferrari F2007 Photo by: Lorenzo Bellanca / Motorsport Images\n\nA final opportunity for a crack at the F1 whip came in 2010, the year three new teams arrived on the grid, when he found a sponsor that tabled “a reasonable budget”. But by this point, Biagi concedes he “was definitely too late”.\n\n“I’m sorry I didn’t have the opportunity to do a couple of races, but that’s life,” he says. “In the years after I achieved very good results in GT categories so I’m happy about my career.”\n\nOpportunity of a lifetime: A fallen Indycar star's Jaguar F1 test\n\nAnd he at least had the good fortune to drive a contemporary V10…\n\n“There are no words that can describe the feeling this kind of engine behind your shoulders gives you,” he says. “I miss the F1 of the end of the '90s and beginning of the 2000s, because for me, F1 is that kind of sound. It was fabulous.”\n\nThomas Biagi, 2005 Midland F1 test Photo by: Motorsport Images"}, {"url": "https://www.crash.net/f1/news/54168/1/biagi-earns-midland-test", "page_content": "Midland F1 has announced that Thomas Biagi is to join the team for testing at Jerez in December\n\nBiagi, who clinched the 2003 FIA GT championship and currently sits sixth in the standings driving for the Vitaphone Maserati team, will get behind the wheel of a Formula One machine for the first time and said he was already busy preparing himself for the challenge.\n\n\"After a successful career in World GT, I'm delighted to be able to demonstrate my level of performance with a Formula One car for the first time,\" the 29-year-old Italian said. \"In recognition of what will be an important step in my career, I have begun preparing myself physically and mentally for this test with an intensive training program.\n\n\"I would like to thank the team for giving to me this fantastic opportunity and for believing in my potential. I would also like to acknowledge the dedicated efforts of my manager, Eva Baldassin, who has played an important role toward achieving this.\"\n\nTeam managing director Colin Kolles said he felt Biagi has done enough in GT racing to justify being given an F1 test and said he was pleased the team was able to give him the opportunity.\n\n\"Thomas Biagi has been very successful in different motorsport categories, especially in the FIA GT Championship,\" he said. \"He won the title in 2003 with six wins and is currently fighting for the lead in the Championship this year. I'm glad that we are able to offer him his first F1 test so that he can show his potential.\""}, {"url": "https://us.motorsport.com/gtwce-sprint/news/hungaroring-thomas-biagi-race-report/2347339/", "page_content": "Thomas Biagi just misses out on the podium again\n\nBudapest (HU), 30 August 09 - \"I thought I would finish on the podium right until the end\", commented Thomas Biagi at the end of the two hour FIA GT race in Budapest. \"Unfortunately, we just missed out and came home in fifth. I really am disappointed because I also missed out on a top three place in the three LMS races I competed in. As ever, it just comes down to luck of the draw...\"\n\nToday's result shows just how high the standard is in the FIA GT series. Hungaroring is a very demanding circuit but all the drivers battled hard til the end and the winner was only decided at the very last minute.\n\nStill, I am happy with how my effort went. I think I was consistent and clocked very good lap times. Unfortunately, we had a little oversteer and, during my stint, I couldn't really go flat out without losing the rear end and risk handing over to Maassen a car with worn out tyres.\n\nThe positive thing from this weekend is the compliments I received from the US Corvette team and guys. Another high note is that my team mate and squad confirmed their third spot in the championship and this was our main aim. I feel very much at home at \"Luc Alphand Adventure\". I am still going for a podium finish and will try again at the final Le Mans Series event at Silverstone on 13 September\".\n\n-credit: thomasbiagi.com"}, {"url": "https://taketonews.com/maserati-in-formula-e-interviews-thomas-biagi-the-last-champion-of-the-house/", "page_content": "The Bolognese driver, the last world champion with Maserati, won the Fia GT title in 2007 at the wheel of the unforgettable MC12: “I hope to see the Emilian manufacturer again fighting among production-derived supercars”\n\nThe Trident brand will show off on the nose of the Formula E single-seaters starting from the 2023 season, when Maserati will return to compete, making its debut in the World Championship reserved for zero-emission cars. The announcement of the modenese’s return to the race did not leave motorsport fans indifferent. Suffice it to say that Maserati at the beginning of the third millennium was the real ruler of racing reserved for Gran Turismo. Among the protagonists at the wheel Thomas Biagi, driver from Bologna born in 1976, in 2007 winner of the Fia GT endurance championship in the “queen” class with the Maserati MC12 of the Vitaphone Racing team.\n\nMASERATI: RETURN TO RACES – A golden age for Maserati. In fact, between 2005 and 2009, the unforgettable MC12 dictated the “law” in the Fia GT. In addition to the style of rare beauty, the Italian supercar exploited uncommon aerodynamic qualities that enhanced the power of the 6-liter naturally aspirated V12 engine capable of delivering 630 horsepower, so much so that the racing supercar exceeded 330 km / h top speed. A domination in GT1 that lasted five years until the last season of the competitive international series (2009). “I participated in that project from the very beginning – Biagi tells on the phone – The Maserati MC12 took part in the entire Fia GT season in 2005, but already the previous year ran in three races outside the standings. Maserati had a dream team directed by Claudio Berro. The car was beautiful to look at and unbeatable, it left only crumbs to the opponents despite race to race, and from season to season, with the Balance of Performance they tried to limit its supremacy “.\n\nBiagi, what did you think about the announcement of Maserati’s return to racing, starting in 2023 in Formula E?\n\n“I’ll be frank: I learned it with amazement, I was not aware of it. I hope to be proved wrong by the facts, but the choice seems to me to be dictated by a communication operation, considering that in FE the chassis and engine will not be produced by Maserati. I think that participation in the championship is in line with a progressive electrification of the road range. Without a doubt, however, I also appreciate this news because it gives the opportunity to train the staff for racing and get them used to a competitive environment. Even if I dream of something else … “.\n\nOr?\n\n“Considering that Maserati has produced the MC20, a beautiful supercar that recalls the name of the legendary MC12, I would be delighted if I knew of a return to racing with covered wheels, perhaps in the GT3 category. In any case, seeing the Maserati brand on the track is always nice ”.\n\nHow do you remember the Fia GT season with Maserati which saw its victory in 2007?\n\n“I think all car enthusiasts remember that period with nostalgia. We had a squadron, among the other pilots there were colleagues of the caliber of Andrea Bertolini, Mika Salo, Johnny Herbert. In 2007 I won the title in the last race by finishing third in Zolder: there was an incredible pressure because I was the only rider who had remained in the running for the victory that year with the MC12. And then the victory paired with Mika Salo at the Silverstone Tourist Trophy, writing our name on a roll of honor where people like Jackie Stewart and Jacky Ickx stand out ”.\n\nHow was the Maserati MC12 once you got inside the passenger compartment?\n\n“First of all it was beautiful. In my career I have driven many cars, including Formula 1 despite never having participated in a GP, but I have never tried a more beautiful car to drive than the Maserati MC12. The naturally aspirated 6-liter engine ‘sang’ in a fantastic way, and then many details, from the sequential gearbox and not at the steering wheel, to the carbon brakes, to the huge downforce made it a racing car with a capital initial. It was going so fast that every race they forced us, with the BoP, to limit it. Suffice it to say that from 2005 to 2006 they made us reduce the rear wing by 30% and forced us to redo the project of the front body, effectively ‘shortening’ the nose, and then they made us reduce the engine power trying to cripple ours. thoroughbred horse. What remained, however, the car to beat “.\n\nJanuary 16, 2022 (change January 16, 2022 | 10:56)\n\n© REPRODUCTION RESERVED\n\n.\n\n\n\nttn-14"}], "Thomas Biagi has competed in the European Le Mans Series.": [{"url": "https://au.motorsport.com/lemans/news/thomas-biagi-preview/2708430/", "page_content": "Thomas Biagi will take part to Le Mans 24 Hours driving Ferrari F430\n\nThe \"longest\" challenge\n\n\"Le Mans 24 Hours is one of the world's most fascinating and prestigious races and I coludn't miss it! It will be my personal second presence, the first time was in 2004 with Ferrari 575. This year I'll be honoured to be at the wheel of a Ferrari F430, alined by my team AF Corse; I want to thank everyone for giving me the chance to feel the emotions of this so hard as fascinating race\".\n\nThomas next challenge on the historical Sarthe Circuit will take place next 14th - 15th June. A considerably professional team for this epic race: the title holders of FIA GT will be at the wheel of car n. 78 of AF Corse racing stable: Thomas Biagi for GT1 and Toni Vilander for GT2. Together with them Christian Montanari, the fast from Sanmarino, Thomas new car mate in 2008 Championship, where they are now ranked second after two races.\n\nIn the pre-qualifications of the first weekend of June, the three got the fifth best performance in GT2 category, despite race-proofs were held with lasting bad weather. The race - organized by the Western Automobile Club (ACO) - is disputed since 1923, apart for some exceptions, on the 13 kilometers long non permanent track even on ordinary country roads.\n\nNext weekend (14th - 15th June) sporting focus will move to Le Mans, with a strong mediatic covering all over the world; Italy will be there with the live broadcasts of Eurosport and Nuvolari channels.\n\n-credit: thomasbiagi.com"}, {"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://au.motorsport.com/elms/news/catalunya-thomas-biagi-preview/2888738/", "page_content": "Thomas in Le Mans Series on the Racing Box's Lms!\n\nHe will join Bobbi and Piccini to form an italian dream team!\n\nThomas Biagi joins Matteo Bobbi and Andrea Piccini on Racing Box's Lola B8/08. The news was in the air after last week's tests in Misano (Italy) and it is official now. The three pilots know each others very well because all of them met in FIA GT championship. Biagi became FIA GT world champion in 2003, at his debut, running with Bobbi. Biagi and Piccini fought for the leadership in 2007, when they both drove a Maserati Mc12. That time Biagi made it, winning the title in Zolder, the last race of the championship. They challenged each other also with the Lola cars projected for F3000 International. As you can see, there's planty of analogies. On april, 5th, Biagi and Bobbi will run together in Barcelona, the same circuit where they won their first race in FIA GT.\n\n\"I'm happy with this enormous chance - Biagi says - It looks like an amazing gift that I've been waiting for so long. The car gives me a lot of good feelings when I drive it, the team of Luca Canni Ferrari is unique and I'm very happy to work with Matteo Bobbi, who is more than a friend, and Andrea Piccini, that I respect a lot. The team is very prepared and our engineer, Andrea Adamo, needs no business card. My partnership will Michelin will continue. I couldn't ask of anything more. I met a special one like Ferdinando Geri who gave me his trust. Together with Canni Ferrari, he allowed three Italian pilots to run in such a championship and compete to win one of the most famous race in the world: Le Mans\".\n\nMr Biagi will go back to a Braclay car six years after his last race with a S3000. The only thing left say is: Forza Azzurri!\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/lemans/news/thomas-biagi-preview/2708428/", "page_content": "Thomas Biagi will take part to Le Mans 24 Hours driving Ferrari F430\n\nThe \"longest\" challenge\n\n\"Le Mans 24 Hours is one of the world's most fascinating and prestigious races and I coludn't miss it! It will be my personal second presence, the first time was in 2004 with Ferrari 575. This year I'll be honoured to be at the wheel of a Ferrari F430, alined by my team AF Corse; I want to thank everyone for giving me the chance to feel the emotions of this so hard as fascinating race\".\n\nThomas next challenge on the historical Sarthe Circuit will take place next 14th - 15th June. A considerably professional team for this epic race: the title holders of FIA GT will be at the wheel of car n. 78 of AF Corse racing stable: Thomas Biagi for GT1 and Toni Vilander for GT2. Together with them Christian Montanari, the fast from Sanmarino, Thomas new car mate in 2008 Championship, where they are now ranked second after two races.\n\nIn the pre-qualifications of the first weekend of June, the three got the fifth best performance in GT2 category, despite race-proofs were held with lasting bad weather. The race - organized by the Western Automobile Club (ACO) - is disputed since 1923, apart for some exceptions, on the 13 kilometers long non permanent track even on ordinary country roads.\n\nNext weekend (14th - 15th June) sporting focus will move to Le Mans, with a strong mediatic covering all over the world; Italy will be there with the live broadcasts of Eurosport and Nuvolari channels.\n\n-credit: thomasbiagi.com"}, {"url": "https://au.motorsport.com/elms/news/nurburgring-thomas-biagi-preview/2342360/", "page_content": "Thomas Biagi's tour de force kicks off in Germany\n\nThe Bolognese driver aims for a record four races in five weeks!\n\nNurburgring (GER), 21 August 09 -- Nurburgring will be the setting for the tour de force that will see Thomas Biagi compete in four races in five weeks. He will be racing in the Le Mans Series and in the FIA GT1 where he will switch between driving a Lola-Judd Racing Box and a Corvette C6R fielded by Luc Alphand Aventures.\n\nDespite it being the holiday period, it will be a full calendar and one that gets underway this weekend with the fourth and penultimate round of the Le Mans Series. Then it is on to Hungary for the FIA GT meet at Budapest (30 August). After that will be Silverstone and the LMS (13 September) and finally it will be on to Portugal for another FIA GT event (20 September). As if this weren't enough, the Emilian driver will also turn out on 6 September in Brno to commentate on the Ferrari Challenge series for Sky Sport!\n\nAt Nurburgring in the LMS, Thomas Biagi will be aboard a Lola B08/80. He should have been in second place in the Drivers' standings, just 6 points off top spot, going into the race. As things stand, he finds himself in third after a being hit with a penalty because Team Racing Box substituted his engine. As a consequence, Biagi was docked 2 points and will have to drop ten places on the starting grid in Germany. The decision (one that also affects Matteo Bobbi and Andrea Piccini) was taken by the federation after the race at Portimao held at the beginning of August.\n\n\"I understand and respect regulations to limit budgets\", commented a disappointed Thomas Biagi. \"But in this case there was absolutely nothing underhand: the engine had to be switched after the Judd experienced overheating problems during the race in Portimao. The same was true for Team Speedy. In my opinion it is a very harsh decision that takes away crucial points from the drivers and a team that has sacrificed a lot to be in top shape for such a competitive championship. However, this penalty will not hold us back - in fact it will make us even more determined. We came to Germany to attack. Our aim is to give our all and go into the last race at Silverstone challenging for the title\".\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/lemans/news/thomas-biagi-preview-2009-10-02/2952877/", "page_content": "Thomas flying to Le Mans for the marathon and for...\n\n...seating on Corvette C6-R of \"Luc Alphand Aventures\"\n\nThe Italian driver, after an intensive sport training, is ready for the French transfer that has a double meaning to him. He will dispute for the thirt time the 77th edition of legendary 24 Hours race (with his fellow citizen Luca Cordero di Montezemolo as special starter) after 2004 driving Ferrari 575 and 2008 driving F430 by AF Corse. First time at the steering wheel of best performing prototype like Lola Judd and with a full Italian trio together with Bobbi and Piccini. \"I wish I could soon be living the wonderful atmosphere of this race, feeling the passion of 280.000 people standing, driving in one of the world most fascinating racetracks. I thank Racing Box for this prestigious opportunity\" Thomas declares from Luc Alphand Team headquarters, right in Le Mans (!), getting the seat ready of the car he will be driving with Xavier Maassen starting from Oschersleben on June 21st.\n\nTherefore after Silverstone and Adria, Thomas Biagi will go on driving in GT1!\n\nThe two times Category Champion, after respecting the agreement to \"thin down\" and develop new Ford GT of Matech Team for the first two rounds, has been chosen by Luc Alphand Aventures in order to end up the season with Corvette C6R #19 with team mate Xavier Maassen.\n\n\"I'm very satisfied of this flash agreement\" Thomas sais we fine tuned immediatly with Philippe Poincloux I thank for trusting me and offering me the chance to go on with the FIA GT1 Championship on a very competitive car (we remind you that car n.19 has arrived third in Silverstone and fourth in Italy, ndr). Moreover, just a few days ago, the Federation has widened Corvette restrictors and we could take advantage from this. I'll do my best to contribute to the Team and to my team mate success in the race for the Title\".\n\nThis year was supposed to be a sabbatic year and is becoming a record season: 12 international races disputed till then, and 10 to be disputed among which two 24 Hours (Le Mans and SPA), one victory while his debut in LMS - Barcellona, another category victory in FIA GT and three times on the podium of Speedcar Series.\n\n-credit: thomasbiagi.com"}, {"url": "https://au.motorsport.com/lemans/news/thomas-biagi-preview-2009-10-02/2952878/", "page_content": "Thomas flying to Le Mans for the marathon and for...\n\n...seating on Corvette C6-R of \"Luc Alphand Aventures\"\n\nThe Italian driver, after an intensive sport training, is ready for the French transfer that has a double meaning to him. He will dispute for the thirt time the 77th edition of legendary 24 Hours race (with his fellow citizen Luca Cordero di Montezemolo as special starter) after 2004 driving Ferrari 575 and 2008 driving F430 by AF Corse. First time at the steering wheel of best performing prototype like Lola Judd and with a full Italian trio together with Bobbi and Piccini. \"I wish I could soon be living the wonderful atmosphere of this race, feeling the passion of 280.000 people standing, driving in one of the world most fascinating racetracks. I thank Racing Box for this prestigious opportunity\" Thomas declares from Luc Alphand Team headquarters, right in Le Mans (!), getting the seat ready of the car he will be driving with Xavier Maassen starting from Oschersleben on June 21st.\n\nTherefore after Silverstone and Adria, Thomas Biagi will go on driving in GT1!\n\nThe two times Category Champion, after respecting the agreement to \"thin down\" and develop new Ford GT of Matech Team for the first two rounds, has been chosen by Luc Alphand Aventures in order to end up the season with Corvette C6R #19 with team mate Xavier Maassen.\n\n\"I'm very satisfied of this flash agreement\" Thomas sais we fine tuned immediatly with Philippe Poincloux I thank for trusting me and offering me the chance to go on with the FIA GT1 Championship on a very competitive car (we remind you that car n.19 has arrived third in Silverstone and fourth in Italy, ndr). Moreover, just a few days ago, the Federation has widened Corvette restrictors and we could take advantage from this. I'll do my best to contribute to the Team and to my team mate success in the race for the Title\".\n\nThis year was supposed to be a sabbatic year and is becoming a record season: 12 international races disputed till then, and 10 to be disputed among which two 24 Hours (Le Mans and SPA), one victory while his debut in LMS - Barcellona, another category victory in FIA GT and three times on the podium of Speedcar Series.\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/elms/news/catalunya-thomas-biagi-race-report/2893649/", "page_content": "GREAT! THOMAS' DEBUT AND VICTORY IN LMP2!\n\nDURING LMS IN BARCELONA THE ITALIAN TRIO AZZURRO (BIAGI BOBBI PICCINI) WINS!\n\nGreat victory for Thomas today. It was April 5th 2003 when he first drove in GT1 Ferrari 550 Maranello on Montmelò racetrack togther with Matteo Bobbi and arrived first. After exactly 6 years the story repeats. After this long stop they have met again driving Lola B08/80 of Racing Box Team, together with Andrea Piccini crossing the finishing line first on the 1000 Km in Barcelona.\n\nThese are Thomas words just after the end of the race: \"It's like a dream, Matteo and I have a strong friendship and also a strong estimation of each other. Going back to success together always during our debut, that's incredible! Just figure out that I had only had 30 laps in Misano 10 days ago with this extremely well shaped Lola and that's where I got to know I should drive! Many thanks to Ferdinando Geri and all Racing Box for the faith in me. Our engeneer Andrea Adamo made a great job and also Andrea Piccini has proven to be an excellent team mate and Michelin provided us with superlative tyres.\n\nI'll be driving all night long, Paul Ricard direction, where I'll made another last-minute press release tomorrow\"\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/elms/news/nurburgring-thomas-biagi-preview/2342359/", "page_content": "Thomas Biagi's tour de force kicks off in Germany\n\nThe Bolognese driver aims for a record four races in five weeks!\n\nNurburgring (GER), 21 August 09 -- Nurburgring will be the setting for the tour de force that will see Thomas Biagi compete in four races in five weeks. He will be racing in the Le Mans Series and in the FIA GT1 where he will switch between driving a Lola-Judd Racing Box and a Corvette C6R fielded by Luc Alphand Aventures.\n\nDespite it being the holiday period, it will be a full calendar and one that gets underway this weekend with the fourth and penultimate round of the Le Mans Series. Then it is on to Hungary for the FIA GT meet at Budapest (30 August). After that will be Silverstone and the LMS (13 September) and finally it will be on to Portugal for another FIA GT event (20 September). As if this weren't enough, the Emilian driver will also turn out on 6 September in Brno to commentate on the Ferrari Challenge series for Sky Sport!\n\nAt Nurburgring in the LMS, Thomas Biagi will be aboard a Lola B08/80. He should have been in second place in the Drivers' standings, just 6 points off top spot, going into the race. As things stand, he finds himself in third after a being hit with a penalty because Team Racing Box substituted his engine. As a consequence, Biagi was docked 2 points and will have to drop ten places on the starting grid in Germany. The decision (one that also affects Matteo Bobbi and Andrea Piccini) was taken by the federation after the race at Portimao held at the beginning of August.\n\n\"I understand and respect regulations to limit budgets\", commented a disappointed Thomas Biagi. \"But in this case there was absolutely nothing underhand: the engine had to be switched after the Judd experienced overheating problems during the race in Portimao. The same was true for Team Speedy. In my opinion it is a very harsh decision that takes away crucial points from the drivers and a team that has sacrificed a lot to be in top shape for such a competitive championship. However, this penalty will not hold us back - in fact it will make us even more determined. We came to Germany to attack. Our aim is to give our all and go into the last race at Silverstone challenging for the title\".\n\n-credit: thomasbiagi.com"}, {"url": "https://au.motorsport.com/elms/news/catalunya-thomas-biagi-race-report/2893651/", "page_content": "GREAT! THOMAS' DEBUT AND VICTORY IN LMP2!\n\nDURING LMS IN BARCELONA THE ITALIAN TRIO AZZURRO (BIAGI BOBBI PICCINI) WINS!\n\nGreat victory for Thomas today. It was April 5th 2003 when he first drove in GT1 Ferrari 550 Maranello on Montmelò racetrack togther with Matteo Bobbi and arrived first. After exactly 6 years the story repeats. After this long stop they have met again driving Lola B08/80 of Racing Box Team, together with Andrea Piccini crossing the finishing line first on the 1000 Km in Barcelona.\n\nThese are Thomas words just after the end of the race: \"It's like a dream, Matteo and I have a strong friendship and also a strong estimation of each other. Going back to success together always during our debut, that's incredible! Just figure out that I had only had 30 laps in Misano 10 days ago with this extremely well shaped Lola and that's where I got to know I should drive! Many thanks to Ferdinando Geri and all Racing Box for the faith in me. Our engeneer Andrea Adamo made a great job and also Andrea Piccini has proven to be an excellent team mate and Michelin provided us with superlative tyres.\n\nI'll be driving all night long, Paul Ricard direction, where I'll made another last-minute press release tomorrow\"\n\n-credit: thomasbiagi.com"}], "Thomas Biagi has competed in the International GT Open.": [{"url": "https://www.gtopen.net/en/news/1922/orange1-team-lazarus-announces-thomas-biagi", "page_content": "05.04.2016\n\nThomas Biagi is the first driver to be confirmed by Orange1 Team Lazarus to drive their Lamborghini Huracán GT3 in the International GT Open. The 40-year-old from Bologna, a double FIA-GT World Champion in the past (2003-07) is back to the forefront of the international scene, having made his first appearance in the GT Open at the closing round in Barcelona last year. The name of his team mate will be disclosed shortly.\n\nBiagi and Tancredi Pagiaro, the man behind Lazarus, already worked together in formulae racing years ago, and they know each other well. “I am very happy of this reunion”, said the Italian driver, “we worked together in F.3000 and came runner-up to Felipe Massa in 2001. That success was very beneficial for the careers of both and it’s with the same spirit that we embrace this new venture in the GT Open. The Lamborghini Huracán is just sensational and I am sure it will give us much to cheer about!”"}, {"url": "https://www.gtopen.net/en/drivers-archive/148/thomas-biagi-it", "page_content": "Team: Imperiale Racing\n\nNationality: Italian\n\nBorn: 7 May 1976, Bologna\n\nProfession: Racing driver\n\nStatus:\n\nWebsite: www.thomasbiagi.com\n\nStart of Career: 1988 (kart)\n\nCareer Highlights: GT Open Champion 2016 (1 win); Italian GT Champion 2012 (4 wins); Superstars Series 2013-10: 6 wins and Champion in 2010; 2009-03: FIA-GT: 12 wins, Champion in 2007-03; F.3000 in 2002-95 (2 wins); 1995-93 Formula 3 (2 wins).\n\n3 participations at Le Mans 24 hrs. F.1 test driver 2005 (Midland) and 1995 (Minardi)"}, {"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.automobilsport.com/race-categories--24/race-categories--24,169807,Thomas-Biagi---Mission-Accomplished,news.htm", "page_content": "29.10.2017 / MaP\n\nAutex Eggleston Motorsport duo Dominic Storey and Peter Hackett have claimed an emotional victory at Round 3 of the CAMS Australian Endurance Championship at Hampton Downs.The Mercedes-AMG GT3 pairing dominated the race after taking the lea more >>\n\nJohn Martin has handed the Mega Racing team pole position for the Laser Plumbing & Electrical Hampton Downs 500 thanks to a storming lap in the Top 10 Shootout.Martin and co-driver Liam Talbot will head a Porsche 1-2 with Brad Shiels and Andrew Macpherson s more >>\n\nThe Mega Racing Porsche duo of Liam Talbot and John Martin will start this afternoon’s Top 10 Shootout as the last runner after recording the best combined time in today’s two qualifying sessions for the Laser Plumbing & Electrical Hampton Downs 500.The p more >>\n\nJust here, last year, Thomas Biagi celebrates the championship win with an advance race on the closing of the season.On Saturday 28th and Sunday 29th October, on the Montmelò circuit in Barcelona, the last and decisive round of the I more >>\n\nThe CAMS Australian Endurance Championship races into Round 3 of the 2017 season at the Laser Plumbing & Electrical Hampton Downs 500 this weekend (October 28 & 29).Having crossed the halfway point of the campaign, the season takes on an intern more >>\n\n> 14 of 34 spaces reserved for GT3 cars> Championship retains multi-class GT3/GT4 format Entries are now being officially accepted for next season’s British GT Championship after series organiser, SRO Motorsports Group, confirmed more >>\n\nAustralian GT race winner Fraser Ross will join forces with McLaren factory driver Alvaro Parente for the final two rounds of the 2017 Australian Endurance Championship.The pair will share duties behind the wheel of the YNA Autosport/McElrea Racing more >>\n\nEight Macao Champions for 10th Edition of GT SpectacularEight former winners of keynote races on the Guia Circuit will be on the grid for the 10th running of the Macau GT Cup on November 16-19, the FIA GT World Cup for the third consecutive year. more >>\n\nFollowing victory in 2015 and third place last year, the goal for the 2017 FIA GT World Cup in Macau is clear: to bring the GT3 title back to Affalterbach. As such, Mercedes-AMG is travelling with a strong contingent of drivers and teams: fro more >>\n\nWorld’s best campaigners and teams to battle for FIA GT World Cup Three squads and five drivers rely on Audi R8 LMS Challenging 6.2-kilometer street circuit leaves no room for mista more >>\n\nTwo races, two victories - that was the impressive outcome for Antonio Escámez and Miguel Ángel de Castro on the last weekend of the season. After their double victory in mid-September in Barcelona, the two Spaniards sharing the cockpit of the Team Drivex School SLS AMG GT3 were determined to repeat the feat at Los Arcos. And they did it in more >>\n\nHunter Abbott (GBR) came to the grand finale of the Blancpain GT Series Asia with a four-point deficit on the championship leader. He had one clear objective - to outsmart his main rival in the two remaining races and take the title. Abbott and his co-driver Maxi Buhk (GER) in the GruppeM Racing Mercedes-AMG GT3 got their weekend off to a promising start more >>\n\nPhoenix Racing Asia team owner and driver Marchy Lee believes winning this year’s Blancpain GT Series Asia Silver Cup title with Audi Hong Kong co-driver Shaun Thong proves the region has the talent to compete on the international stage. more >>\n\nTitle success in class and “vice championship” win in Asia: Audi’s customer teams were instantly among the front runners in the inaugural Blancpain GT Series Asia season. In the Asian GT racing series, OD Racing Team with Indian Adit more >>\n\n· Audi Sport Team Magnus R8 wins after nail-biting finish· Audi extends its lead in the Intercontinental GT Challenge manufacturer standings· Markus Winkelhock is the new leader in the driver standings more >>\n\nMazda Raceway Laguna SecaCircuit Length = 3.601 km1 44 GT3 Pierre KAFFER (DEU) / Kelvin VAN DER LINDE (ZAF) / Markus WINKELHOC1 Audi R8 LMS 314 8:00:27.641 141.23 1:25.19 more >>\n\nBlancpain GT Asia SeriesChina, Zhejian CircuitSunday, October 15th 2017DRIVER QUOTESMitch Gilbert, #86 OD Racing Audi R8 LMS GT3: “We won three times, and I don’t think anyone would have expected us to do as well as more >>\n\n> OD Racing Audi crew make it two wins from two…> …But fourth place seals title for Abbott> Lee/Thong miss out on Overall championship but still win Silver Cup> Cai/Lim crowned GT3 Am champions with CMRT Eurasia> Craft-Bamboo’s Merlin/Yu seal GT4 crown more >>\n\nChristopher Haase (#29 Audi Sport Team Land R8) confirmed the speed of his car by taking pole position for the inaugural Mazda Raceway California 8 Hours, by lapping the Laguna Seca Circuit in 1’23.961. He beat Markus Winkelhock (#44 Audi Sport Team Ma more >>\n\nRnd#9/10 2017 Audi R8 LMS Cup [FINAL]Zhejiang Circuit, China6-8 October, 2017To close out what has been an intense season of GT3 competition, Hong Kong’s Shaun Thong arrived at the new Zhejiang Circuit in south- more >>\n\nBLANCPAIN GT ASIA SERIESZhejiang Circuit, ChinaSaturday, October 14th 2017While GT3 appears wide open, Frank Yu and Jean-Marc Merlin took a giant step towards winning this year’s GT4 title after claiming class victory. The pair led more >>\n\nBLANCPAIN GT ASIA SERIESZhejiang Circuit, ChinaSaturday, October 14th 2017The three remaining title-contending crews started second, fourth and seventh, and all once again proved their credentials in the weekend’s opening hour-long more >>\n\n> OD Racing pair win from FFF Racing’s Read/Di Folco> Abbott now a point behind leaders Lee/Thong> GruppeM Racing wrap-up GT3 Teams’ title> GT4 victory moves Craft-Bamboo’s Yu/Merlin closer to class crown more >>\n\n- Merlin makes it two for Craft Bamboo Blancpain GT Series Asia - Zhejian ChinaFriday, October 13th 2017The second GT3 session witnessed a fantastic scrap between a quartet of Audi R8 LMS Cup front-runners, but it was ultimately Mitc more >>\n\nBlancpain GT Series Asia - Zhejian ChinaFriday, October 13th 2017Lamborghini Super Trofeo racer Chris Dreyspring was a late addition to VSR’s #66 line-up but made an immediate impression by claiming pole position in his maiden Blancpain GT Series Asia qual more >>\n\n> VSR’s debutant beats established order to Race 1 pole> Title-chasing Gilbert pips Rump by 0.009s> Craft-Bamboo’s Merlin and Yu claim double GT4 pole more >>\n\nITALIAN GT CHAMPIONSHIP Imperiale Racing ended the Italian GT 2017 Championship in Mugello with a stunning performance with both lineups on the podium in race one.The Itali more >>\n\nBLANCPAIN GT SERIES ASIA 2017ROUNDS 11 & 12 - ZHEJIANG, CHINA1 FFF Racing Team by ACM CHN Alberto Di Folco ITA S Aidan Read AUS S Lamborghini Huracan GT3 Silver GT3 more >>\n\nThree crews, two races, one champion> GT3 Drivers’, Teams, Am Cup and GT4 Drivers’ titles on the line> Lee/Thong lead Abbott and Gilbert/Patel> GruppeM on course for Teams’ crown> Three crews also in Am Cup and GT4 championship contention more >>\n\nThe final weekend of the season in Mugello has crowned Alberto Cerqui the new Italian Super GT3 Champion at the end of the Italian GT 2017 Championship. This result rewards the Italian driver at the end of an exciting season that has seen him on the absolute podium of th more >>\n\nThe Italian GT Championship season drew to a successful close this weekend with two races at Mugello (ITA). Stefano Comandini and Alberto Cerqui (both ITA) were competing in the BMW Team Italia #15 BMW M6 GT3, but were unable to finish either race. more >>\n\nAt the penultimate race of the Japanese Super GT Championship season at Buriram, Thailand, the Autobacs Racing Team Aguri (ARTA) finished in fourth place, missing out on the podium by just 0.210 seconds.Shinichi Takagi (JPN) and Sean Walkinshaw (GBR) shared more >>\n\n• The line-up of Ombra Racing also takes the last win of the season• Third place in the championship for Daniel Zampieri who finishes second in Race 2 with Riccardo Agostini of team Antonelli Motorspor more >>\n\n• After battle of current and former R8 LMS drivers, Tréluyer, Ghirelli grab P4 • Rangoni, Magnoni rule their class in good old ultra as car tally reaches 24 wins Audi Sport Italia claimed a couple more >>\n\nINTERNATIONAL GT OPEN Imperiale Racing has secured the eighth podium of the season in Monza, during the penultimate round of the International GT Open 2017. This result allowed the team to keep the lead of the Drivers and Teams classification. more >>\n\nEight manufacturers will be represented on the starting grid of the Mazda Raceway California 8 Hours, third round of the 2017 Intercontinental GT Challenge. Among them will be two Acura NSX GT3, the car making its debut in the series at the Laguna Seca track Two more >>\n\n2017 Intercontinental GT ChallengeRound 3 - Provisional Entry ListCALIFORNIA 8 HOURS1 3 TRG USA TRG Craig Lyons USA USA Bronze Kris Wilson USA USA Bronze Thomas Merril USA USA NC As more >>\n\nDeclan Jones completes Ginetta GT4 SuperCup season by bagging two second places for the Rob Boston Racing-Whitley Neill Gin team and secures fourth place in the Drivers’ ChampionshipLiverpool racing driver Declan Jones finished the season on a high by claiming more >>"}, {"url": "https://www.automobilsport.com/thomas-biagi-final-act-international-gt-open---169683.html", "page_content": "26.10.2017 / MaP\n\nThe CAMS Australian Endurance Championship races into Round 3 of the 2017 season at the Laser Plumbing & Electrical Hampton Downs 500 this weekend (October 28 & 29).Having crossed the halfway point of the campaign, the season takes on an intern more >>\n\n> 14 of 34 spaces reserved for GT3 cars> Championship retains multi-class GT3/GT4 format Entries are now being officially accepted for next season’s British GT Championship after series organiser, SRO Motorsports Group, confirmed more >>\n\nAustralian GT race winner Fraser Ross will join forces with McLaren factory driver Alvaro Parente for the final two rounds of the 2017 Australian Endurance Championship.The pair will share duties behind the wheel of the YNA Autosport/McElrea Racing more >>\n\nEight Macao Champions for 10th Edition of GT SpectacularEight former winners of keynote races on the Guia Circuit will be on the grid for the 10th running of the Macau GT Cup on November 16-19, the FIA GT World Cup for the third consecutive year. more >>\n\nFollowing victory in 2015 and third place last year, the goal for the 2017 FIA GT World Cup in Macau is clear: to bring the GT3 title back to Affalterbach. As such, Mercedes-AMG is travelling with a strong contingent of drivers and teams: fro more >>\n\nWorld’s best campaigners and teams to battle for FIA GT World Cup Three squads and five drivers rely on Audi R8 LMS Challenging 6.2-kilometer street circuit leaves no room for mista more >>\n\nTwo races, two victories - that was the impressive outcome for Antonio Escámez and Miguel Ángel de Castro on the last weekend of the season. After their double victory in mid-September in Barcelona, the two Spaniards sharing the cockpit of the Team Drivex School SLS AMG GT3 were determined to repeat the feat at Los Arcos. And they did it in more >>\n\nHunter Abbott (GBR) came to the grand finale of the Blancpain GT Series Asia with a four-point deficit on the championship leader. He had one clear objective - to outsmart his main rival in the two remaining races and take the title. Abbott and his co-driver Maxi Buhk (GER) in the GruppeM Racing Mercedes-AMG GT3 got their weekend off to a promising start more >>\n\nPhoenix Racing Asia team owner and driver Marchy Lee believes winning this year’s Blancpain GT Series Asia Silver Cup title with Audi Hong Kong co-driver Shaun Thong proves the region has the talent to compete on the international stage. more >>\n\nTitle success in class and “vice championship” win in Asia: Audi’s customer teams were instantly among the front runners in the inaugural Blancpain GT Series Asia season. In the Asian GT racing series, OD Racing Team with Indian Adit more >>\n\n· Audi Sport Team Magnus R8 wins after nail-biting finish· Audi extends its lead in the Intercontinental GT Challenge manufacturer standings· Markus Winkelhock is the new leader in the driver standings more >>\n\nMazda Raceway Laguna SecaCircuit Length = 3.601 km1 44 GT3 Pierre KAFFER (DEU) / Kelvin VAN DER LINDE (ZAF) / Markus WINKELHOC1 Audi R8 LMS 314 8:00:27.641 141.23 1:25.19 more >>\n\nBlancpain GT Asia SeriesChina, Zhejian CircuitSunday, October 15th 2017DRIVER QUOTESMitch Gilbert, #86 OD Racing Audi R8 LMS GT3: “We won three times, and I don’t think anyone would have expected us to do as well as more >>\n\n> OD Racing Audi crew make it two wins from two…> …But fourth place seals title for Abbott> Lee/Thong miss out on Overall championship but still win Silver Cup> Cai/Lim crowned GT3 Am champions with CMRT Eurasia> Craft-Bamboo’s Merlin/Yu seal GT4 crown more >>\n\nChristopher Haase (#29 Audi Sport Team Land R8) confirmed the speed of his car by taking pole position for the inaugural Mazda Raceway California 8 Hours, by lapping the Laguna Seca Circuit in 1’23.961. He beat Markus Winkelhock (#44 Audi Sport Team Ma more >>\n\nRnd#9/10 2017 Audi R8 LMS Cup [FINAL]Zhejiang Circuit, China6-8 October, 2017To close out what has been an intense season of GT3 competition, Hong Kong’s Shaun Thong arrived at the new Zhejiang Circuit in south- more >>\n\nBLANCPAIN GT ASIA SERIESZhejiang Circuit, ChinaSaturday, October 14th 2017While GT3 appears wide open, Frank Yu and Jean-Marc Merlin took a giant step towards winning this year’s GT4 title after claiming class victory. The pair led more >>\n\nBLANCPAIN GT ASIA SERIESZhejiang Circuit, ChinaSaturday, October 14th 2017The three remaining title-contending crews started second, fourth and seventh, and all once again proved their credentials in the weekend’s opening hour-long more >>\n\n> OD Racing pair win from FFF Racing’s Read/Di Folco> Abbott now a point behind leaders Lee/Thong> GruppeM Racing wrap-up GT3 Teams’ title> GT4 victory moves Craft-Bamboo’s Yu/Merlin closer to class crown more >>\n\n- Merlin makes it two for Craft Bamboo Blancpain GT Series Asia - Zhejian ChinaFriday, October 13th 2017The second GT3 session witnessed a fantastic scrap between a quartet of Audi R8 LMS Cup front-runners, but it was ultimately Mitc more >>\n\nBlancpain GT Series Asia - Zhejian ChinaFriday, October 13th 2017Lamborghini Super Trofeo racer Chris Dreyspring was a late addition to VSR’s #66 line-up but made an immediate impression by claiming pole position in his maiden Blancpain GT Series Asia qual more >>\n\n> VSR’s debutant beats established order to Race 1 pole> Title-chasing Gilbert pips Rump by 0.009s> Craft-Bamboo’s Merlin and Yu claim double GT4 pole more >>\n\nITALIAN GT CHAMPIONSHIP Imperiale Racing ended the Italian GT 2017 Championship in Mugello with a stunning performance with both lineups on the podium in race one.The Itali more >>\n\nBLANCPAIN GT SERIES ASIA 2017ROUNDS 11 & 12 - ZHEJIANG, CHINA1 FFF Racing Team by ACM CHN Alberto Di Folco ITA S Aidan Read AUS S Lamborghini Huracan GT3 Silver GT3 more >>\n\nThree crews, two races, one champion> GT3 Drivers’, Teams, Am Cup and GT4 Drivers’ titles on the line> Lee/Thong lead Abbott and Gilbert/Patel> GruppeM on course for Teams’ crown> Three crews also in Am Cup and GT4 championship contention more >>\n\nThe final weekend of the season in Mugello has crowned Alberto Cerqui the new Italian Super GT3 Champion at the end of the Italian GT 2017 Championship. This result rewards the Italian driver at the end of an exciting season that has seen him on the absolute podium of th more >>\n\nThe Italian GT Championship season drew to a successful close this weekend with two races at Mugello (ITA). Stefano Comandini and Alberto Cerqui (both ITA) were competing in the BMW Team Italia #15 BMW M6 GT3, but were unable to finish either race. more >>\n\nAt the penultimate race of the Japanese Super GT Championship season at Buriram, Thailand, the Autobacs Racing Team Aguri (ARTA) finished in fourth place, missing out on the podium by just 0.210 seconds.Shinichi Takagi (JPN) and Sean Walkinshaw (GBR) shared more >>\n\n• The line-up of Ombra Racing also takes the last win of the season• Third place in the championship for Daniel Zampieri who finishes second in Race 2 with Riccardo Agostini of team Antonelli Motorspor more >>\n\n• After battle of current and former R8 LMS drivers, Tréluyer, Ghirelli grab P4 • Rangoni, Magnoni rule their class in good old ultra as car tally reaches 24 wins Audi Sport Italia claimed a couple more >>\n\nINTERNATIONAL GT OPEN Imperiale Racing has secured the eighth podium of the season in Monza, during the penultimate round of the International GT Open 2017. This result allowed the team to keep the lead of the Drivers and Teams classification. more >>\n\nEight manufacturers will be represented on the starting grid of the Mazda Raceway California 8 Hours, third round of the 2017 Intercontinental GT Challenge. Among them will be two Acura NSX GT3, the car making its debut in the series at the Laguna Seca track Two more >>\n\n2017 Intercontinental GT ChallengeRound 3 - Provisional Entry ListCALIFORNIA 8 HOURS1 3 TRG USA TRG Craig Lyons USA USA Bronze Kris Wilson USA USA Bronze Thomas Merril USA USA NC As more >>\n\nDeclan Jones completes Ginetta GT4 SuperCup season by bagging two second places for the Rob Boston Racing-Whitley Neill Gin team and secures fourth place in the Drivers’ ChampionshipLiverpool racing driver Declan Jones finished the season on a high by claiming more >>\n\n• Car damage rules Ben Gersekowski & Rory Collingbourne out the Super Trofeo Asia Series final• Duo now looking forward to the 'World Final' to be held at Imola in November&nb more >>\n\nGreat wait for the only Italian stage of the International Gt Open. On Saturday 30 September and Sunday 1 October, on the national circuit of Monza, will be the sixth and final round of the season.On the Italian track, Thomas Biagi, reduced to the top third more >>\n\nBrazil’s driver will make his comeback to the series to drive the Drivex-run Mercedes AMG GT3. Hahn and Hellmeister claimed a Pro-Am win at Paul Ricard circuit and also securing a podium overall Drivex will contest the penultimate roun more >>\n\nINTERNATIONAL GT OPEN Imperiale Racing is all set to get on track this coming weekend for the most awaited appointment of the International GT Open 2017, the Italian round – the penultimate of the season, to be held at the Autodromo Nazionale o more >>"}, {"url": "https://www.automobilsport.com/race-categories--24/race-categories--24,157397,Thomas-Biagi---Launch-of-the-Final-Act-of-the-International-GT-Open-2016,news.htm", "page_content": "03.11.2016 / MaP\n\n• Last year’s winner Maro Engel (GER) and Renger van der Zande (NED) to race Mercedes-AMG GT3 for the Mercedes-AMG Driving AcademyFor Mercedes-AMG, the year-ending highlight of the internati more >>\n\nGT ASIA Series 2017TEST DAYS, 7-8 March - Sepang, MalaysiaRnd#1/#2, 10-12 March - Sepang, MalaysiaRnd#3/#4, 12-14 May - South KoreaRnd#5/#6, 2-4 June - Fuji, JapanRnd#7/#8, 23-25 Jun more >>\n\n2017 GT Asia SeriesAfter the most competitive season in GT Asia history, Motorsport Asia Limited - the sole promoter of the popular GT Asia Series - has unveiled an extended calendar for the 2017 championship with 14-rounds schedul more >>\n\nThe Electric GT Championship, the world’s first 100% zero emissions GT championship, is delighted to confirm Tom Coronel and Alice Powell as the latest members of the fast-expanding EGT Drivers’ Club.F more >>\n\nHampton Downs (NZ) hosted the Australian Endurance Championship for the first time this weekend. At the penultimate race of the season, local hero Steve Richards (NZ) and Max Twigg (AU) once again competed in the BMW M6 GT3 for BMW Team SRM. more >>\n\nAudi drivers Daniel Bilski and Garth Tander clinched a podium finish in the third round of the Australian Endurance Championship held at Hampton Downs (New Zealand) auf das Podium. The duo from Audi customer team Jamec Pem Racing finished third at the wheel of their Audi R8 LMS in the near three-hour race. At the finish more >>\n\nRejoicing in Australia: at the Victorian State Circuit Racing Championships (VSCRC) finale on Phillip Island, Steven McLaughlan secured the title in the ‘Sports Cars’ class in an Audi R8 LMS ultra. The driver competing for Audi customer tea more >>\n\nCAMS Australian Endurance Championshipat Hampton Downs 101Sunday, October 30th, 20161 Lago / Russell 2:48:19.5222 Martin / Padayachee&n more >>\n\nLamborghini drivers Roger Lago and David Russell have recorded the Italian marque’s first CAMS Australian Endurance Championship victory in style at the inaugural Hampton Downs 101.Starting from pole, the JBS Australi more >>\n\nCAMS Australian GT Endurance Championship 1 Lago / Russell 1:30.8062 G.Miedecke / A.Miedecke 1:30.9123 Simmons / Caruso &nbs more >>\n\nA sensational lap from David Russell saw the JBS Australia Lamborghini R-EX rocket to their first CAMS Australian GT Endurance Championship pole position.Having been fastest on the opening day’s running, the Russell/Rog more >>\n\nPasin Lathouras announces that he has secured an entry to compete in the second edition of the ‘FIA GT World Cup’, which will take place as part of the prestigious Macau Grand Prix weekend, from 17-20 November 2016.Pasin will drive a Ferrari 488 GT3 for more >>\n\n2016 CAMS Australian Endurance Championship at Hampton Downs 101 The opening day’s running at the inaugural Hampton Downs 101 ended with Roger Lago and David Russell fastest ahead of the third round of the 2016 CAMS Australian End more >>\n\n2016 CAMS Australian Endurance Championship at Hampton Downs 101 Practice 1 Times1 Samadi / D'Alberto - 1:30.840 152 Taylo more >>\n\nVom 17. bis 20 November findet in der chinesischen Metropole die offizielle GT3-Weltmeisterschaft statt. Als einziges Nicht-Audi-Werksteam aus Europa ist HCB-Rutronik Racing dabei. Das Rennen in Macau auf dem Stadtkurs Circuito da Guia ist seit 20 more >>\n\nFormer Formula 1 star Heinz-Harald Frentzen made his return to the cockpit to test the Tesla Model S EGT - the car that is being developed for the Electric GT Championship – at the Circuit Paul Ricard this week.Frentzen began his gli more >>\n\nAC Racing celebrated overall victory in the Lima 200-km race (\"Los 200 km de Lima\"). Enrique Arriola and Ricardo Dasso drove their Audi R8 LMS ultra to an outright win after 83 laps. The race was held at the Aut&o more >>\n\nWhile competitors and fans of GT racing gather this weekend in Estoril, Portugal for the final round of the 2016 European Le Mans Series and Michelin GT3 Le Mans Cup seasons, plans are already well underway for 2017.Recognising that many c more >>\n\nCAMS Australian Endurance ChampionshipHampton Downs, New Zealand1 JAMEC PEM Racing Christopher Mies/Tony Bates Audi R8 LMS2 JAME more >>\n\nA world class field is headed to Hampton Downs as the CAMS Australian Endurance Championship touches down for the first of two weekends of GT racing in New Zealand.The Hampton Downs 101 is the third round of the CAMS A more >>\n\nFirst season of the new project Reiter Young Stars Cup just decided at the last event at Zandvoort. New faces on podium in last two races.For rounds 8 and 9 of the Reiter Young Stars Cup, the eight KTM X-BOW GT4 head to Zandvoort in the more >>\n\nCerqui ending the Italian Gt Championship 2016 season with fourth place in Mugello The driver from Brescia, back to BMW as BMW Team Italia's works driver, just missed out on the podium ending with a fourth place in race two.T more >>\n\n• Marco Mapelli's SGT3 bid comes up short in spite of Laurens Vanthoor late charge• Lap 9 puncture shreds Emanuele Zonzini, Matias Russo dream of GT3 glory Both Italian Gran more >>\n\n...in a strong sixth position.Alessandro Zanardi (IT) is back in the race cockpit. This weekend, the 49-year old BMW works driver and BMW brand ambassador is competing in his first ever races in the new BMW M6 GT3. Zanardi is co more >>\n\nThe Richardson Racing team can today confirm that it is evaluating an entry into the British GT Championship as part of an expanded programme for the 2017 season.The Corby-based team currently competes in both the British GT-supporting Ginetta GT5 challenge more >>\n\n...set to bring fans closer to the actionFans of the Australian Endurance Championship are set to enjoy all the action from the third round of the Championship with the event broadcast live across Australia and New Zealand on October 30. more >>\n\nLaser Racing - Porsche Carrera Cup AustraliaRnd#7 - Mount Panorama, Bathurst (6-9 October, 2016)The name Richards and success are synonymous with Mount Panorama, so it’s perhaps no surprise that Steven Richards en more >>\n\nThe final two races of the GT4 European Series were held in Zandvoort (NL) at the weekend. It was an extremely successful season final for Racing Team Holland by Ekris Motorsport. Ricardo van der Ende (NL) and Bernhard van Oranje (NL) finished in second place more >>\n\nTriumph in der GT4-Europameisterschaft 2016„Ich bin stolz auf unser gesamtes Team“, freute sich Chris Esser, Teamchef von Prosport Performance aus Wiesemscheid nahe des Nürburgrings, nach Abschluss der letzten Veranstaltung der GT4 more >>\n\nSimon Knap and Rob Severs scored the first win for the Ekris M4 GT4 in the final race of the Competition102 GT4 European Series at Zandvoort. The Racing Team Holland by Ekris Motorsport drivers enjoyed a one-two finish at their home track, albeit not in the more >>\n\nTerting and Viebahn win Competition102 GT4 European Series Reiter Young Stars Mads Siljehaug and Maciej Dreszer won the first race of the Competition102 GT4 European Series at Zandvoort this morning, claiming their second victory of the season. more >>\n\nDuncan Huisman and Bernhard van Oranje secured pole positions for the two final races of the Competition102 GT4 European Series at Zandvoort. Huisman gave the Porsche GT4 Clubsport MR its first-ever pole in the series in the first qualifying session, while Van more >>\n\nItalian team to take part in the final and crucial round at Zandvoort with Pro-class crew Anselmi / Zamparini and Polish Am-class pair formed by Chodzen father and sonScuderia Villorba Corse is ready to tak more >>\n\nThe Competition102 GT4 European Series travels to Zandvoort for the final round of the 2016 season. Jörg Viebahn and Peter Terting hold a 28.5-point lead over PROsport Performance teammates Nicolaj Møller Madsen and Andreas Patzelt heading into the final race weekend in more >>\n\nRacing near by the beach – circuit Zandvoort is the perfect venue for the final round of the Reiter Young Stars Cup. And it will be an exciting weekend as there is no real favourite in driver and team standings and every part of the comp more >>\n\nLaser Racing - Porsche Carrera Cup AustraliaRnd#7, Mount Panorama, Bathurst (6-9 October, 2016)Four-time Bathurst 1000 champion Steven Richards is heading back to Australia’s most revered circuit this weekend, more >>\n\nFollowing the announcement of Stefan Wilson and Vicky Priria as the inaugural members of the Electric GT Championship Drivers Club, the world’s first 100 per cent zero emissions GT championship, today confirms Leilani Münter and Dani Clos will join them on the grid in 201 more >>\n\nScuderia Cameron Glickenhaus (SCG) has completed another race weekend of its all-new Customer Racing Programme, managed by Traum Motorsport, at Monza in Italy in the GT Open series.The SCG003C was more >>"}, {"url": "https://www.gtopen.net/it/drivers/148/thomas-biagi-it", "page_content": "Team: Imperiale Racing\n\nNationality: Italian\n\nBorn: 7 May 1976, Bologna\n\nProfession: Racing driver\n\nStatus:\n\nWebsite: www.thomasbiagi.com\n\nStart of Career: 1988 (kart)\n\nCareer Highlights: GT Open Champion 2016 (1 win); Italian GT Champion 2012 (4 wins); Superstars Series 2013-10: 6 wins and Champion in 2010; 2009-03: FIA-GT: 12 wins, Champion in 2007-03; F.3000 in 2002-95 (2 wins); 1995-93 Formula 3 (2 wins).\n\n3 participations at Le Mans 24 hrs. F.1 test driver 2005 (Midland) and 1995 (Minardi)"}, {"url": "https://www.automobilsport.com/thomas-biagi-international-gt-open-paul-ricard---150055.html", "page_content": "03.06.2016 / MaP\n\nMotorbase Performance scored a hard fought top ten result at Oulton Park on Bank Holiday Monday (May 30) after a challenging weekend of racing during rounds 3 & 4 of the British GT Championship. With an extra 35kg of weight on-board the more >>\n\nM-Motorsport/Interlloy Lamborghini Gallardo R-EX GT3Australian GT Championship/Australian Endurance ChampionshipPhillip Island Grand Prix Circuit, Victoria (27-29 May, 2016)After a mixed run during th more >>\n\n• Team Barwell Motorsport wins at Oulton Park• First Lamborghini’s victory also in the Italian GT Championship at ImolaWith two races held both on Monday, bec more >>\n\nSuccess in the USA, Australia and in the UK has given the McLaren 650S GT3 one of its most successful weekends ever. McLaren GT customer teams secured a brace of victories in both the Pirelli World Challenge and Australian GT, along with a furt more >>\n\nThird place in the day’s earlier race ensured pole-sitter Morris would not only need to hold on to first but also build a five second lead if he and Parfitt Jnr were to have any chance of making amends for losing the opening encounter after being blocked in the pits more >>\n\nAfter a dominant win in the day’s opener PMW Expo Racing/Optimum Motorsport’s Johnson and Robinson were made to work much harder in the second race. Indeed, that they did owed much to Walewska crashing out of the lead in the more >>\n\n• Filipe Albuquerque, Marco Mapelli are first duo to repeat victory in SuperGT3 • In GT3 class R8 LMS ultra buoys Matias Russo, Emanuele Zonzini to surprise win It took less than 24 hours around Autodro more >>\n\nBritish GT Championship In stark contrast to the issues up front the GT4 class proved relatively straightforward for pole-sitters Johnson and Robinson. The former led away from the start, survived the Safety Car period and subs more >>\n\nGriffin and Carroll secured Lamborghini’s first British GT victory since 2010 at Spa-Francorchamps with a measured drive from second on the grid, not to mention a clever pit strategy, in the day’s first one-hour race.The sister Barwell-run Hura more >>\n\nThe Portuguese is contesting an ambitious GT racing program with Audi customer teams.Your program in 2016 includes two commitments with Audi. In Italy, you immediately started the season with a victory and upped the ante on the second race weekend. more >>\n\nPodium success in the Australian GT Championship: Steven McLaughlan and Garth Tander in an Audi R8 LMS of Audi customer team Jamec Pem Racing in race two of round four at Phillip Island advanced to second overall and to third place in the championship standings. more >>\n\nPodium and victory for the Audi R8 LMS on the second weekend of the Italian GT Championship at Imola: In race one, Filipe Albuquerque and Marco Mapelli in their R8 LMS from Audi Sport Italia took third place following a puncture. Due to a riva more >>\n\nThe second race weekend in the 2016 Italian GT Championship saw BMW Team Italia pick up valuable points. At the “Autodromo Enzo e Dino Ferrari” in Imola (IT), Alberto Cerqui (IT) and Stefano Comandini (IT) in the number 15 BMW M6 GT3 finished in fifth place in their classification. The win went to the two Audi drivers Marco Mapelli (IT) and Filipe more >>\n\nBMW DTM driver Bruno Spengler (CA) was in action in the BMW M6 GT3 on Phillip Island (AU) at the weekend. He contested the Australian GT and Australian Endurance Championship for the new BMW customer team MARC GT. Spengler finished in 13th place alongside his team-mate Morga more >>\n\nGrant Denyer and Nathan Morcom have combined to win the first race of the CAMS Australian Endurance Championship, holding on in a nail-biting finish at Phillip Island.Morcom headed a narrow McLaren 1-2, with Shane Van Gisbergen just two tenths of more >>\n\nBritish GT Championship at Oulton ParkBMW Expo Racing/Optimum Motorsport dominated both GT4 sessions to secure its third consecutive pole of the season.Johnson was first up in the Am segment but didn’t have things all his o more >>\n\nBritish GT Championship at Oulton ParkJon Minshaw secured a first British GT pole position for the Lamborghini Huracan after Barwell Motorsport dominated the GT3 Am qualifying session at Oulton Park.Minshaw was at the sharp en more >>\n\nSeries debutant Yasser Shahin has taken victory at Round 4 of the CAMS Australian GT Championship at Phillip Island.A strong performance in the opening race of the weekend saw The Bend Motorsport Park driver claim second before g more >>\n\nGarth Tander and Steve McLaughlan will start from pole position ahead of tomorrow’s opening 60-minute CAMS Australian GT Championship race at Phillip Island.Despite mixed conditions, Tander’s best of 1:23.8933 was just three tenths of a second aw more >>\n\nCAMS Australian GT Championship 2016Phillip IslandFriday, May 27th 2016Qualifying Results 1 Steve McLaughlan/Garth Tander Jamec Pem & more >>\n\nBMW Team SRM - Australian GT Championship/Australian Endurance ChampionshipPhillip Island Grand Prix Circuit, Victoria (27-29 May, 2016)After a hectic start to their 2016 Australian GT campaign, BMW Team SRM will have a more >>\n\nA drive through penalty was imposed by surprise against the former F1 driver while he was about to win the four-hour race, third 2016 VdeV GT/Tourisme round, on the AF Corse supercar from Maranello he shares with his fellow gentleman driver more >>\n\nOulton Park is the next destination for Motorbase Performance as the Kent-based outfit heads North for a double-header Bank Holiday weekend of racing as the British GT Championship returns this coming weekend (May 28-30). Off the back of a strong perf more >>\n\n• Third edition of the talent program for youngsters• Thirteen drivers under 27 selected from Lamborghini Blancpain Super Trofeo • Training to become profes more >>\n\nCAMS Australian GT Championship 2016Weekend ScheduleFriday 27, May 10:25 – 10:55 Australian GT Championship Practice 112:15 – 12:45 Australi more >>\n\nAustralian GT races into Phillip Island as part of the Shannons Nationals this weekend for what will be the biggest event in the category's history.Thirty-five cars will make the journey to Australia's most picturesque race track more >>\n\nThe McLaren 650S GT3 claims double top 10 tinish in Canada and podium finished in Spa - FrancorchampsMcLaren GT Factory Driver Alvaro Parente scored a double top-10 finish at the wheel of the K-PAX Racing 650S GT3 this weekend in the Pirelli World Challen more >>\n\nAnother stellar GT4 entry lines up at Oulton, although the combination of pit-stop success penalties and previous form suggests the opening race could be fought between two Ginetta teams: PMW Expo Racing/Optimum Motorsport and Century Motorsport.It’ more >>\n\nUndoubtedly the biggest talking point ahead of Oulton Park is who can halt TF Sport’s championship leaders Derek Johnston and Jonny Adam. The pair have enjoyed an almost faultless start to the season thanks to a pole position more >>\n\nCheshire’s luscious green countryside plays host to rounds three and four of the 2016 British GT Championship this bank holiday weekend (May 28 and 30) when teams and drivers attempt to tame the notoriously tricky Oulton Park International circuit.It w more >>\n\nBMW Team Teo Martín celebrated its first win with the BMW M6 GT3 at the second race weekend of the International GT Open in Spa-Francorchamps (BE). In the first race on Saturday, defending champions Miguel Ramos (ES) and Roldan Rodriguez (ES) were victorio more >>\n\nProminent support for the BMW teams in the Australian GT Championship: BMW works driver Alexander Sims (GB) was in action for BMW Team SRM at the beginning of the week, as he took part in testing in preparation for the races on Phillip Island (AU). The 28-ye more >>\n\nThe joint success story continues: Randstad will continue to have a prominent position in endurance racing in the future as the Official Partner of BMW Motorsport. With 57,000 employees and a turnover of almost two billion euros, Randstad Deutschland is not only successful off the racetrack, rather they have already had plenty of reason to celebrate along more >>\n\nMiguel Molina makes a detour to Australia between the two DTM rounds in Spielberg and at the Lausitzring: this coming weekend, the DTM driver contests two rounds of the Australian GT Championship on Philipp Island in an Audi R8 LMS. The Spaniard deputizes in the Audi customer team Jamec Pem Racing for defending Champion Christopher Mies, who more >>\n\nThe second round of the 2016 International GT Open brings teams and drivers to one of the favorite spots of all of them and fans alike: Spa-Francorchamps. The legendary track in the Belgian Ardennes, defined as “arguably the best tra more >>\n\nthis weekend 20, 21 and 22 May. This meeting is probably not the most renowned, but nevertheless, it has a simply spectacular programme this year.First of all, the International GT Open, which has been going for 11 years, is a championship f more >>\n\nDie Premiere in der GT4 European Series ist Andreas Patzelt mehr als geglückt: Zusammen mit seinem Teamkollegen Nicolaj Moller-Madsen holte der Troisdorfer vergangenes Wochenende zweimal die Pole-Position, einen Rennsieg und einen zweiten Platz in den Straßenschluchten im franz more >>\n\nCaitlin Wood and Thomas Krebs new leaders in Reiter Young Stars competition after Pau. KTM X-BOW reaches overall podium in both GT4 European Series races.The street circuit at the Grand Prix de Pau, second event of the new established Reiter Young Stars Cup 2016, showed the yo more >>"}, {"url": "https://www.automobilsport.com/race-categories--24/race-categories--24,152463,Thomas-Biagi---International-GT-Open-Silverstone-preview,news.htm", "page_content": "22.07.2016 / MaP\n\nPorsche Carrera Cup Deutschland, Zandvoort and 24h Series Paul Richard.What for the most people sounds like some attractive holiday regions meant for the teams of MRS a weekend full of active and eventfu more >>\n\n....with the drivers of the GT3 Junior Program • Double victory in the Italian GT in both races at Mugello for Antonelli Motorsport and Imperiale Racing• Fi more >>\n\nFuji International Speedway, JapanRnd#8, 2016 GT Asia Series - 15-17 July, 2016• Lamborghini takes it’s first GT Asia Series victory with the new Huracan GT3• South Korean winners Sawa and V more >>\n\nFuji International Speedway, JapanRnd#7, 2016 GT Asia Series - 15-17 July, 2016GT Asia Series - Fuji International Speedway, Japan (16 July)Qualifying#1 (15-minutes) more >>\n\nFuji International Speedway, JapanRnd#7, 2016 GT Asia Series - 15-17 July, 2016What the drivers had to say;1. Carlo Van Dam (#12 Singha Motorsport Ferrari 458 Italia GT3)“We know that in more >>\n\nFuji International Speedway, JapanRnd#7, 2016 GT Asia Series - 15-17 July, 2016• Singha Motorsport’s Carlo Van Dam and Piti Bhirombhakdi claim victory again at Fuji• Craft-Bamboo Racing and FFF Racin more >>\n\n• In spite of heavy time handicap the Audi pair nabs two hard-fought Top5 finishes• Bittersweet Mugello outing for Matias Russo, Emanuele Zonzini's R8 LMS ultra The Italian Gran Turismo may not have en more >>\n\nFirst Pro Cup victory for KTM X-BOW GT4 in 2016, Caitlin Wood expands lead in Ladies championship & Marko Helistekangas takes leadership of the Men´s Championship.In the first two events of the newly formed Reiter Young Stars Cup, th more >>\n\nRnd#7/#8 - 2016 GT Asia SeriesFuji International Speedway, JapanSchedule (JST - GMT +9)Friday, 15 July10:45 - Practice #1 (45-minutes)13:50 - Practice #2 (45-minutes)14:30 - Practice #3 (4 more >>\n\nFUJI INTERNATIONAL SPEEDWAYOyama, Sunto District, Shizuoka Prefecture, Japan (Honshu Island)Track length: 4.563-kilometresCorners: 16Rotation: clockwiseGT Asia lap records: 1:40.783 - Race (Toni Vilander), 1:40.966 - Qualifying (Keita Sawa), 1:39.808 - Practice (Carlo Van Dam)Support classes: Super Formula (Japan), F3, N-One, Karts more >>\n\nFuji International Speedway, JapanRnd#7/8, 2016 GT Asia Series - 15-17 July, 2016• GT Asia Series returns to Japan's Fuji Speedway for the sixth time in six seasons• The title battle is heating up with little sep more >>\n\nFuji International Speedway, JapanRnd#7/8, 2016 GT Asia Series - 15-17 July, 2016 After making their debut in the GT Asia Series at the Okayama round last time out, Miedecke Stone Motorsport have revealed that they wi more >>\n\nA promising start to round 6 of the British GT Championship ended in frustration for the Motorbase Performance squad during Saturday’s two hour race on the legendary Spa-Francorchamps circuit in Belgium (July 9). Unexpected fair weather on the Ardennes circuit saw Fr more >>\n\nIn the British GT Championship, customer team Black Bull Ecurie Ecosse enjoyed mixed fortunes at the Spa-Francorchamps round. Factory Driver Rob Bell helped steer the #79 650S GT3 to second in qualifying, while the 570S GT4 – still in its d more >>\n\nThe McLaren 650S GT3 scored wins in both races at Townsville, continuing the run of strong results in the CAMS Australian GT Championship. Klark Quinn and Tony Walls, driving for customer teams Darrell Lea and Objective Racing, secured the p more >>\n\nReiter customers continue to perform succesfully with their Reiter manufactured KTM X-Bow GT4’s, Gallardo GT3’s and Sareni Camaro GT3’s.Nearing the mid season point, Reiter Customers have managed to accumulate an impressive 20 victories, 59 podiums and 31 pole positions worldwide in 2016 only. more >>\n\nAleksander Schjerpen is not short of experience at Spa-Francorchamps and regards the venue as one of his favourites on the British GT Championship Calendar. Having teamed up with endurance racing rookie Sean Byrne in 2016, the pair have been very fast to date, but a more >>\n\nTeam BLACK FALCON’s one-off foray into the 2016 British GT championship has netted a fantastic pair of results, the team’s two Mercedes-AMG GT3s finishing third and fourth at the end of the two-hour race. The team were racing as guests in the fift more >>\n\nThe 2016 British GT4 Championship has certainly been eventful so far this season for both of the team’s highly competitive pairings. With both crews having tasted the champagne at least once so far this season, a return to the podium was certainly a popular target as the championship makes it’s only visit outside of the UK to the famous Spa-Francorchamps, located d more >>\n\nBMW Team SRM - Australian GT ChampionshipRnd#5, Townsville, Queensland (8-10 July, 2016)BMW Team SRM enjoyed the opportunity to gain valuable mileage at the Townsville street circuit last weekend, the Melbourne-bas more >>\n\nTony Walls has claimed his second win of the 2016 CAMS Australian GT Championship following a dramatic finale around the streets of Townsville.Walls took control of the race following the pit stop sequence, holding the lead until two more >>\n\n2016 CAMS Australian GT Championship TownsvilleSunday, July 10th 20161 Objective Racing Tony Walls McLaren 650S GT3 462 JBS more >>\n\nM-Motorsport/Interlloy Lamborghini Gallardo R-EX GT3Rnd#5, Townsville, Queensland (8-10 July, 2016)After the success M-Motorsport achieved on the streets of Adelaide during the Australian GT season opener back in March, there was a lot of an more >>\n\nThird position for Abdulaziz al Faisal and Miguel Toril at the race of the British GT Championship held at the Belgian track of Spa this weekend. Team Black Falcon has enrolled two of its Mercedes AMG GT3 at Spa appointment of British GT in more >>\n\nAlex Reed, Joey Foster and Lanan Racing recorded their maiden British GT4 Championship victories at Spa-Francorchamps earlier today after a flawless performance aboard their Ginetta G55 helped them claim a 4.3s victory over PMW Expo Racing/Optimum Motorsport’s Graham Johnso more >>\n\nBRITISH GT - GT4 European SeriesSpa-FrancorchampsSaturday, July 9th 20161 11 GT3/PRO/AM TF Sport FARMER/BARNES Aston Martin Vantage GT32:01:16.705 49 169,789 2:22.676 - 24 176,7252 31 GT3/PRO/AM Team Parker Racing more >>\n\nMark Farmer scored his maiden British GT Championship victory, and co-driver Jon Barnes his first in eight years, to claim a narrow win over Team Parker Racing’s Seb Morris and Rick Parfitt Jnr at Spa-Francorchamps earlier today. more >>\n\n2016 CAMS Australian GT Championship Klark Quinn has claimed his first victory of the 2016 CAMS Australian GT Championship campaign, taking out the first of two races at Townsville, raising the championship stakes in the process. more >>\n\n2016 CAMS Australian GT Championship TownsvilleSaturday, July 9th 20161 Darrell Lea Klark Quinn McLaren 650 S GT3 47 1:02:15.8368 more >>\n\nBritish GT Championship 2016Spa-FrancorchampsFriday, July 8th 2016The #31 Bentley Continental GT3 looked an unlikely pole position candidate following the initial 12-minute Am session but benefitted from a brief rain shower mid-way t more >>\n\nBritish GT Championship 2016Spa-FrancorchampsFriday, July 8th 2016After seeing their GT3 counterparts miss out on pole by less than half a tenth, Ciaran Haggerty and Sandy Mitchell gave Black Bull Ecurie Ecosse something to shout abou more >>\n\nBritish GT ChampionshipSpa-Francorchamps / Belgium Free Practice 2Friday, July 8th 2016GT3 TF Sport Aston Martin Vantage GT3 02:21.9 14GT3 Black Falcon Mercedes-AMG GT3 02:23.3 16GT3 Barwell Motorsport Lamb more >>\n\nBritish GT ChampionshipSpa-Francorchamps / Belgium Free Practice 1Friday, July 8th 2016GT3 Team Parker Racing Bentley Continental GT3 02:20.1 6GT3 Barwell Motorsport Lamborghini Huracan GT3 02:20.6 7GT3 Black Bu more >>\n\nA blistering lap from Klark Quinn has secured the McLaren 650S GT3 driver provisional pole position for the first of two CAMS Australian GT Championship races at Townsville this weekend.The former two-time series champion set th more >>\n\nCAMS Australian GT Championship Townsville - qualifyingFriday, July 8th 20161 Darrell Lea Klark Quinn McLaren 650S GT3 1:12.82072 & more >>\n\nM-Motorsport/Interlloy Lamborghini Gallardo R-EX GT3Rnd#5 Australian GT Championship, Townsville, Queensland (8-10 July, 2016)The M-Motorsport team will return to the streets of Townsville this weekend for the penultimate round of the 2016 more >>\n\nThe world-famous circuit of Spa-Francorchamps in Belgium is the destination for the Motorbase Performance squad as round six of the British GT Championship gets underway this coming Friday and Saturday (July 8/9). The only overseas visit on the British GT calenda more >>\n\nBMW Team SRM - Australian GT ChampionshipRnd#5, Townsville, Queensland (8-10 July, 2016)It’s hard to believe that this weekend the Australian GT Championship will contest it’s penultimate round on the street more >>"}, {"url": "https://www.gtopen.net/en/", "page_content": "27 May 2023\n\nThe Eastalent Racing, in only his second appearance in the International GT Open, took pole for the Endurance Race to be held ...\n\nRead more...."}], "Thomas Biagi has competed in the Italian GT Championship.": [{"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.gtopen.net/en/drivers-archive/148/thomas-biagi-it", "page_content": "Team: Imperiale Racing\n\nNationality: Italian\n\nBorn: 7 May 1976, Bologna\n\nProfession: Racing driver\n\nStatus:\n\nWebsite: www.thomasbiagi.com\n\nStart of Career: 1988 (kart)\n\nCareer Highlights: GT Open Champion 2016 (1 win); Italian GT Champion 2012 (4 wins); Superstars Series 2013-10: 6 wins and Champion in 2010; 2009-03: FIA-GT: 12 wins, Champion in 2007-03; F.3000 in 2002-95 (2 wins); 1995-93 Formula 3 (2 wins).\n\n3 participations at Le Mans 24 hrs. F.1 test driver 2005 (Midland) and 1995 (Minardi)"}, {"url": "https://www.automobilsport.com/race-categories--24,99466,Thomas-Biagi-gets-the-win-in-Vallelunga,news.htm", "page_content": "07.05.2012 / MaP\n\nThe round of Vallelunga, season opener of the Italian GT 2012 Championship, is to be archived with a great performance by BMW Team Italy, at the debut in the championship with two BMW Z4 GT3. The team showed its potential starting from more >>\n\nGroßes Spektakel vom 25. bis 27. Mai 2012 in der EifelDer Nürburgring ist einmal mehr Austragungsort eines motorsportlichen Highlights. Vom 25. bis 27. Mai 2012 werden beim diesjährigen „AvD Euro Race“ erneut hochkaräti more >>\n\nAutodromo do Algarve (POR)Difficult weather conditions surprised the pilots and teams at the first race of the International GT Open season in the Algarve (POR). Strong rain, wind and a drying track between the rain showers posed a major challenge. more >>\n\n...of the 2012 International GT Open at PortimaoUnder wet and then dry conditions, Andrea Montermini and Juan Manuel Lopez caught up a fourth position in the main class taking their first championship points more >>\n\nInternational GT Open, 1. und 2. Lauf in Portimao/PortugalZwei Rennen, zwei Siege: Die europäischen Porsche-Kundenteams sind höchst erfolgreich in die neue Saison der International GT Open gestartet. Die großen Sieger d more >>\n\n... in the 2012 International GT Open at PortimaoWith a few laps to go, in race-1 the 458 GT2 of Andrea Montermini and Juan Manuel Lopez was faultlessly forced to retire because of a contact with a lapped car. Now the Italian sq more >>\n\nInternational GT Open Championship27 – 29 April 2012Autodromo do Algarve (POR)The International GT Open will take place in Portimao (POR) next weekend. The 4,692m (2.92 miles) long track i more >>\n\nJuan Manuel Lopez and Andrea Montermini unveiled their 458 GT2 in the brand new aabar Investments PJS livery at the Ferrari Museum in Maranello. The Italian former F1 driver and tester also celebrated twenty years with the Scuderia more >>\n\nStarkes Engagement europäischer Porsche-KundenteamsIm Autodromo do Algarve in Portimao/Portugal starten Porsche-Kundenteams aus fünf europäischen Ländern vom 27. bis 29. April in die Saison der Internation more >>\n\nMünchner Emissionshaus gibt richtig GasEnde April beginnt in Portimao (Portugal) die Rennserie der International GT Open, europaweit das bekannteste und beliebteste GT3-Format und mit dabei: die LEO ONE aus München. Der Ferrari 458 GT3 des Erfolgsteams von Kremer Racing fährt künftig im Zeichen des goldenen Löwen, dem Firmenlogo der In more >>\n\nDas Kremer Racing Team freut sich, einen weiteren Sponsor an Bord der Ferrari Familie begrüßen zu können.Die Sensus Unternehmensgruppe wird in 2012 die Saison mit Kremer Racing in der International GT Open mitbestreiten.Marghitta Nachtigall- more >>\n\nLegendary Scottish outfit Ecurie Ecosse returned to full-time top-level sportscar racing in superb style on Easter Monday (9th April) as they steered their Barwell Motorsport-run BMW Z4 GT3 to victory in the season-opening British GT Championship event at Oulton more >>\n\nCaption: The start of race one in the wet conditions with Bateman at the wheel and making a great start.• Fuel pick-up issues in race one spoils United Autosports’ big day more >>\n\n• Great run for Bateman in first qualifying session to annex pole• Bell runs in top six to show good pace in his competitive group• High hopes of turning pole into victory on Easter Monday&nb more >>\n\nSuper GT Okayama, race Despite challenging weather conditions and some technical issues with the tires, the first race weekend in Japanese Super GT for Cyndie Allemann tur more >>\n\nIn a very difficult context of changing weather conditions, learning a new series and a specific qualifying system, the new star driver of the Japanese Super GT series created a surprise by clinching the 12th place on the starting grid for the opening round of t more >>\n\n... for 2012 competitive revivalFiskens, London's foremost historic automobile specialists, will team-up with sportscar racing legends Ecurie Ecosse in 2012 after agreeing a deal to sponsor the Scottish outfit's return to full-time competition. more >>\n\nIt was a dressed rehearsal for Cyndie Allemann this weekend as she took part of the Japanese Super GT Series pre-season official test at Okayama International Circuit. more >>\n\nMatt Bell en route to his first British GT victory at Snetterton last year.• Young hotshoes, Bell and Bateman, in outright title bid• &nbs more >>\n\n...for the 2012 Italian GT Championship on the BMW Z4 GT3The list of teams and drivers that have chosen the BMW Z4 GT3 as challenger for 2012 keeps on growing: BMW Team Italy will line up two cars in the Italian GT Championship. more >>\n\nGeschickter SchachzugMark Eddy, zweimaliger Australischer GT-Meister, tritt in diesem Jahr mit dem Audi R8 LMS zur Titelverteidigung an. Dabei hat sich der Australier für die Saison 2012 prominente Hilfe im Cockpit gesichert. more >>\n\n... for Winter GT Races• Daytona 24 Hours winner Ryan Dalziel heads team trio for United Autosports in Dubai and Abu Dhabi• Venezuelan pair joins Dalziel in championshi more >>\n\nNext year’s exciting Avon Tyres British GT Championship will include a blue riband round at the prestigious Nürburgring 24 Hours meeting, it is confirmed today.The British GT field will entertain the vast Nürburgring cr more >>\n\n• United Autosports returns to British GT for second season with updated Audi R8 LMS GT3 car• Ambitious Leeds-based team focuses on British Championship title with prove more >>\n\n• Watts takes fantastic third in McLaren’s Macau début• Meins finishes in fine seventh after race-long battle in Audi R8 LMS • United Autosports scores first podium with McLaren in Macau and ends 2011 season on a high more >>\n\nSie haben zum dritten Mal in Folge in Macau gewonnen. Sind Sie stolz darauf?\"Ich bin sehr, sehr glücklich über meinen ersten Sieg beim Macau GT Cup. Es war toll, nach den beiden Formel-3-Erfolgen jetzt auch mein erstes GT-Rennen au more >>\n\nSensation in Macau: Audi-Pilot Edoardo Mortara feierte seinen dritten Sieg in Folge bei dem Stadtrennen in China. Nach zwei Formel-3-Erfolgen in den Jahren 2009 und 2010 bestritt der Italiener dabei in diesem Jahr zum ersten Mal den Macau GT Cup. more >>\n\n• Britain’s Danny Watts grabs third despite heavy traffic and red flags• Richard Meins brings Audi R8 LMS through to eighth• United Autosports gain valuable experienc more >>\n\nSession: Star River • Windsor Arch Macau GT Cup – Qualifying 2Weather: Overcast and DryDate: Saturday, November 19, 2011Two-time Formula 3 Macau Grand Prix champion Edoard more >>\n\nLamborghini racers took three podium finishes and a pole position as the highly-competitive Itaipava GT Brasil travelled to Nova Santa Rita, Brazil, on 11-13 November for the penultimate race weekend of the 2011 season. The father and son combination of Xandy and Xandinho Negrão climbed to the top of the driver standings in their Lamborghini Gallardo LP 600+ after second and sixth-place more >>\n\nAIM Autosport Team FXDD and Drivers Emil Assentato and Jeff Segal Take First Laps in New Ferrari 458 Italia GT Grand-Am at Fiorano in ItalyInitial Shakedown Run Less Than a Week After New AIM/FXDD Collaboration is First-Announced Full-Season Ferrari 458 It more >>\n\nFranzösische GT-Meisterschaft: Beltoise und Pasquali sind die ChampionsAnthony Beltoise und Laurent Pasquali machten am letzten Veranstaltungswochenende in Le Castellet (29./30.10.) mit ihrem fünften Saisons more >>\n\nA seven-meeting calendar featuring the UK’s best circuits and a repeat of the successful mix of one, two and three-hour races are planned by the SRO Motorsports Group for next season’s Avon Tyres British GT Championship.British GT will once again v more >>\n\nDates Circuits Event21 Mar Silverstone Championship launch & media day07-09 Apr Oulton Park British F3 & more >>\n\n... for International GT Open title victory in BarcelonaJMB Racing called up Britain’s Rob Bell to support the team’s title bid in the final round of the International GT Open in Barcelona last weekend. The team entered a second Ferrari 458 GT2 p more >>\n\nLarbre Compétition / GT Tour n°7Face à une situation ubuesque dans la gestion sportive du GT Tour 2011, et suite aux nombreux évènements regrettables et inacceptables qui se sont déroulés tout au long de la saison ponctués par la destruction d’une voiture en mesure de remporter le championnat, Jack Lec more >>\n\nDrivers of Lamborghini race cars secured two podium finishes in the Itaipava GT Brasil Championship on 23 October 2011 at Autódromo Internacional Orlando Moura in Campo Grande, Brazil. Lambor more >>\n\nGiorgio Sanna and Davide Stancheris celebrate Italian GT Cup gloryLamborghini’s official test driver Giorgio Sanna and his team-mate Davide Stancheris secured the Italian GT Cup title at the Italian GT Championship finale in Mo more >>"}, {"url": "https://www.automobilsport.com/superstars-thomas-biagi-full-glory-brno-victory-classification-lead---111374.html", "page_content": "20.05.2013 / MaP\n\nThomas Biagi and Mercedes-AMG's pairing continue to be one of the motives of the Superstars Series 2013. The Italian driver, race two winner of Monza's opener, secured today a stunning pole position (2'08.715) in Brno (CZ) that will allow him tomorrow more >>\n\nThe Superstars Series 2013 could not start in a better way for Thomas Biagi - at his first exit as Mercedes-AMG works driver - in Monza after the front row obtained yesterday in qualifying. Biagi kept the starting second position out of the insidious fir more >>\n\nNa een lange winter begint de autosport weer uit zijn winterslaap te komen. Op Circuit Zolder zijn de eerste races en testdagen alweer achter de rug en in het weekend van 20 en 21 april gaat het raceseizoen echt van start more >>\n\nSporting season 2013 has a big novelty for Thomas Biagi. The Bolognese driver, absolute protagonist of the Superstars Series since 2010, with a surprise move signed an agreement with team Romeo Ferraris linking his name to Merced more >>\n\nDe kogel is door de kerk. In 2013 zal in het weekend van 23 juni Circuit Zolder door bulderende V8 motoren trillen op zijn grondvesten. V-Max Racing Management is er namelijk in geslaagd om de International Superstars Series in 2013 naar Zolder te halen. De Superstars is more >>\n\nDavid gegen Goliath auf SizilienMit der erfolgreichen Premiere der Rennsportmesse ging für Renauer Motorsport vor gut einer Woche die Motorsportsaison 2012 zu Ende. Doch ganz wollten es die Niederösterreicher dann doch noch nicht bleib more >>\n\nSuperstars Series 2012 goes into archives with Thomas Biagi on the podium and scoring a stunning recover in Pergusa, stage of the last round of the season.After the very good performance of qualifying, the Italian driving for Team BMW Dinamic defended more >>\n\nThe perfect lap, one of those performance that only champions can put in, allowed Thomas Biagi today to set the fifth time (1'43.915) in Pergusa's qualifying valid for the last round of the Superstars Series that will decide the 2012 champions tomorrow in the tw more >>\n\nThe Superstars Series is ready to make its debut in Sicily for the final and decisive round of the season 2012, scheduled for this coming weekend in Pergusa. Both classifications of the International Series and the Italian Championship are wide open more >>\n\nThomas Biagi harvested a podium in front of more than 25.000 fans in Vallelunga's third last weekend of the Superstars Series 2012, valid both for the Italian and International Series. more >>\n\nQualifying in Vallelunga's third last round of the Italian Superstars Series - valid also for the International Series - finished with a fifth time (1'40.870) that does not satisfy Thomas Biagi, who produced a solid performance though at the wheel of the numbe more >>\n\nEn signant le doublé au volant de son Audi RS5, Gianni Morbidelli a marqué de son empreinte l’étape belge des Superstars Series. L’autre vedette du week-end fut sans conteste… la pluie qui s&rsquo more >>\n\nA determined Thomas Biagi gained today the maximum reachable result in two wet races at Spa, where emerged again the disadvantage imposed by the actual balance of performance to all the BMW.After the tenth place in race one, Biagi recovered well in the more >>\n\nLes dieux de la météo ont décidé d’accorder une faveur aux concurrents des Superstars Series, samedi à l’occasion d’une session qualificative palpitante : entamés sur une piste toujours humide, les débats se sont more >>\n\nAs in the Friday quotes, the qualifying session at Spa offered some difficulties to Thomas Biagi and to his BMW M3.During the first practice session the Italian driver set a promising third fastest lap (2'56.712) under a heavy rain, first between two wh more >>\n\nSi les Superstars Series occuperont évidemment le haut de l’affiche durant le prochain week-end, les autres catégories figurant au programme mériteront largement le déplacement. Caractéristique commune aux onze épreuves : elles sont tr&egr more >>\n\n-De chaudes explications en perspective! Douze petits mois après leur première venue, les Superstars Series reviennent à Spa-Francorchamps pour le sixième des neuf meetings de la saison. Pas besoin de l more >>\n\nSuperstars International Series, Budapest 2012A motivated Thomas Biagi comes home from Budapest, stage of the fifth weekend of the Superstars International Series, with a very good double podium that keeps him well within the title fight. more >>\n\n...after Donington Superstars Series raceTalent and experience allowed today Thomas Biagi to get positive results in the two races held in Donington (GB), theater of the third round of the Superstars Series, valid only for the International Se more >>\n\nA third and second place are the outcome of Imola's weekend for Thomas Biagi in the second round of the Superstars Series, an event valid both for the Italian Championship and the International Series.The driver from Bologna, third yesterday in qualifyi more >>\n\nThe Superstars Series is about to live in Imola the second round of the season, valid both for the Italian Championship and the International Series. The 'State of the art in world car racing' tis back on the Santerno's banks after one year of absence in an event that will celebrate more >>\n\nThomas Biagi produced a determined performance in Monza's opener of the Superstars Series, valid both for the Italian championship and International series. The driver from Bologna of Team Dinamic took his BMW M3 to the fourth place in both the races, harvesting in this way the more >>\n\nThe paddock of Monza is starting to get lively ahead of the opening race of the Superstars Series, scheduled for this weekend at the circuit near Milan in a round valid both for the Italian Championship and the International Series.The 'State of the art in world ca more >>\n\nDie Superstars International Series ist schon seit Jahren eine angesehene Bühne für gestandene Motorsport-Stars und aufstrebende Talente. In der Saison 2012, die am ersten Aprilwochenende in Monza beginnt, geht auch ein deutscher Pilot an den Start: Der erst 18 Jahre alte Thomas Schöffler aus Singen pilotiert einen rund 450 PS starken Audi more >>\n\nSeason finale as team man for Thomas Biagi in Vallelunga, stage of the final round of the Superstars Series 2011.After the fourth time in qualifying held yesterday, the Italian driving for BMW Team Italy kept the starting position from lights to flag in r more >>\n\nFascinating round for the Superstars Series, on stage from tomorrow on at the legendary circuit of Spa-Francorchamps (Belgium) for the seventh weekend of the season, valid both for the Italian and International championships.The reigning champion Thomas Biagi has on his scoreboa more >>\n\nThe Superstars Series will be on track from tomorrow on at Spa (Belgium) for the seventh round of the season, valid for the Italian and International Series.Michela Cerruti, one of the symbol drivers of the category, has never raced before on the challenging track of the Ardennes: th more >>\n\nThomas Biagi harvested another podium in Misano Adriatico's sixth round of the Superstars Series, valid both for the Italian and International Championships.After the front row obtained in qualifying, the Italian driving for BMW Team Italy produced a solid race more >>\n\nThe Superstars Series is heading to United Kingdom for the fifth round of the season, scheduled for this weekend at Donington Park's circuit and valid for the International classification only.The young Alberto Cerqui is unquestionably one of the stars of the championshi more >>\n\nSUPERSTARS SERIES MISANO ADRIATICOMaximum sportive ballast for the reigning champion Thomas BiagiAfter the rounds in Valencia and Portimao, valid for the International classification, the Superstars Series will be on track from Friday on in Misano A more >>\n\nThe paddock of Misano World Circuit is getting lively in sight of the fourth round of the Superstars Series that is due this weekend and will be valid for the Italian Championship only. Michela Cerruti, after the second place in race one more >>\n\nA positive performance for Michela Cerruti in Portimao (Portugal) in the third round of the Superstars Series, valid for the International series only. The young driver from Milan, despite a violent contusion occurred recently to her left hand, go more >>\n\nDouble victory and classification leadership for Thomas Biagi at PortimaoPerfect day for Thomas Biagi in the third round of the Superstars Series in Portimao (Portugal), valid for the International series only.After the third time set yesterda more >>\n\nHistoric hat trick for BMW Team Italy in Portimao (Portugal) in the third round of the International Superstars Series. A first positive signal came from qualifying held on Saturday with the pole position of the very young Alberto Cerqui (1'51.1 more >>\n\nTHOMAS BIAGI'S ENTHUSIASM HEADING TO A \"REAL” CIRCUIT LIKE PORTIMAOThe Superstars Series will be back on track from tomorrow on for the third round of the season in Portimao, valid for the International classification only.A positive memor more >>\n\nJust two days are left before the third round of the Superstars Series, valid for the International series only, scheduled from Friday on in Portimao (Portugal).Alberto Cerqui, the young talent of BMW Team Italy, will mak more >>\n\nThe Superstars Series championship is about to get on track for the second round of the season, on schedule in Valencia (Spain) from Friday on and valid for the International championship only. The \"Circuit de la Comunitat Valenciana\" is dedicated to more >>\n\nThomas Biagi harvested the first points in Monza, theatre of the opening round of the Superstars Series 2011.The Italian driver of BMW Team Italy, author yesterday of the fourth time in qualifying, in race one exploited all his class and determination more >>"}, {"url": "https://us.motorsport.com/roadracing/news/thomas-biagi-is-the-italian-superstars-2010-champion/2510859/", "page_content": "Thomas Biagi is the Italian Superstars 2010 Champion\n\nThomas Biagi is the Italian Superstars 2010 Champion. To win the title, the Italian driver for BMW Team Italy had to obtain at Vallelunga a third and fifth place in the last round of the tri-colour Series, valid also for the International Series.\n\nRemarkable are the figures of Biagi's season, the Italian driver has been author of a pole position, three victories, two second places, a third and five fastest lap of the race.\n\nThe final classification of the championship crowns Biagi champion with 178 points, followed by Pigoli (Mercedes) with 147 and Ferrara (Mercedes) with 134.\n\nIn the International Series, Biagi strenghtens his leadership instead and reaches 147 points, followed by Ferrara at 106 and Pigoli at 97.\n\nRoberto Ravaglia (ROAL Motorsport, Team Principal):\n\n\"The victory of the Italian title is one of the two objectives we set at the beginning of the year and also in the International Series the classification is quite favourable to us. With just a round still to be run, we are therefore close to finish the season with the highest possible result\".\n\nUmberto Grano (BMW Italy, Sportive Activities Manager):\n\n\"We can be extremely satisfied: BMW Italy believed in the growth of the Superstars Series and the spectators' success at Vallelunga awards the work done in the past months by the organizers. From a sportive profile, Thomas Biagi's victory of the Italian title and his consistant leadership in the International Series highlight the value of ROAL Motorsport that managed to develop a winning car since the beginning\".\n\nThomas Biagi:\n\n\"Winning the Italian title in my debut year in Superstars and at the wheel of a car very different from GT1 and LMP2 that I drove in the last few seasons is a dream. The setting offered by fans today was simply great, spectators of the greatest occasions on grand stands and my fans club did the rest.\n\nBMW Team Italy have done a great job since winter tests and the merit of today's success has to be shared among all members of the team. A key role was certainly played by Roberto Ravaglia, whom I always admired as a driver and he is certainly not any worse as a team principal. Our focus is on the final round at Kyalami scheduled for next 28 November which will nominate the International champion, but now we want to enjoy this title at least for one day\".\n\n-source: roal"}, {"url": "https://au.motorsport.com/roadracing/news/thomas-biagi-is-the-italian-superstars-2010-champion/2510860/", "page_content": "Thomas Biagi is the Italian Superstars 2010 Champion\n\nThomas Biagi is the Italian Superstars 2010 Champion. To win the title, the Italian driver for BMW Team Italy had to obtain at Vallelunga a third and fifth place in the last round of the tri-colour Series, valid also for the International Series.\n\nRemarkable are the figures of Biagi's season, the Italian driver has been author of a pole position, three victories, two second places, a third and five fastest lap of the race.\n\nThe final classification of the championship crowns Biagi champion with 178 points, followed by Pigoli (Mercedes) with 147 and Ferrara (Mercedes) with 134.\n\nIn the International Series, Biagi strenghtens his leadership instead and reaches 147 points, followed by Ferrara at 106 and Pigoli at 97.\n\nRoberto Ravaglia (ROAL Motorsport, Team Principal):\n\n\"The victory of the Italian title is one of the two objectives we set at the beginning of the year and also in the International Series the classification is quite favourable to us. With just a round still to be run, we are therefore close to finish the season with the highest possible result\".\n\nUmberto Grano (BMW Italy, Sportive Activities Manager):\n\n\"We can be extremely satisfied: BMW Italy believed in the growth of the Superstars Series and the spectators' success at Vallelunga awards the work done in the past months by the organizers. From a sportive profile, Thomas Biagi's victory of the Italian title and his consistant leadership in the International Series highlight the value of ROAL Motorsport that managed to develop a winning car since the beginning\".\n\nThomas Biagi:\n\n\"Winning the Italian title in my debut year in Superstars and at the wheel of a car very different from GT1 and LMP2 that I drove in the last few seasons is a dream. The setting offered by fans today was simply great, spectators of the greatest occasions on grand stands and my fans club did the rest.\n\nBMW Team Italy have done a great job since winter tests and the merit of today's success has to be shared among all members of the team. A key role was certainly played by Roberto Ravaglia, whom I always admired as a driver and he is certainly not any worse as a team principal. Our focus is on the final round at Kyalami scheduled for next 28 November which will nominate the International champion, but now we want to enjoy this title at least for one day\".\n\n-source: roal"}, {"url": "https://www.thecheckeredflag.co.uk/2010/10/thomas-biagi-wins-italian-superstars-title/", "page_content": "Thomas Biagi won the Italian Superstars Championship at the final round of the national season at Vallelunga at the weekend. Biagi, who drives a BMW M3 for BMW Team Italy (ROAL Motorsport), finished third and fifth in the two races to secure the Italian title.\n\nThe first of the two races at Vallelunga was won by multiple touring car champion Fabrizio Giovanardi in the impressive Porsche Panamera, run by N.Technology. The second race was won by Audi Sport Italia driver Alberto Cola. Having entered the weekend leading the standings, Biagi's results ensured he would beat Mercedes drivers Max Pigoli and Luigi Ferrara to the title.\n\n34-year-old Biagi won two of the sixteen races that made up the Italian Superstars Championship for 2010, also taking a pole position and five fastest laps. The Vallelunga races also counted towards the International Superstars Series, which concludes at Kyalami in South Africa on 28 November. Biagi leads the International standings too, followed by Pigoli and Ferrara again.\n\n2010 is Biagi's first year competing in the Superstars Series. The Italian has traditionally competed in GT racing, winning the FIA GT Championship in 2003 and 2007. At the end of the weekend, Biagi said: “This is a dream come true for me. This championship was new territory for me, and the car was obviously very different to drive compared to those I am familiar with from GT1 and LMP2. I found my feet quickly, however, and was competitive from the word go. BMW Team Italy has worked very hard since the winter tests. Everyone in the team contributed to this success. Roberto Ravaglia, who I always admired as a driver, also played a key role. He is also an outstanding team principal. Our focus now turns to the final in Kyalami, where there is another title up for grabs.”\n\nRavaglia said: “This victory is one of the two objectives we set at the beginning of the year. We are also in a very promising position in the international series. With just one round to go, we are close to ending the season with the best possible result.”\n\nUmberto Grano, Sporting Activities Manager at BMW Italy, added: “We can be extremely satisfied. BMW Italy believed in the growth of the Superstars Series. The fact that there were well over 20,000 fans again in Vallelunga is a just reward for the work put in by the organisers. Thomas Biagi’s title and his consistent lead in the international series just go to prove the ability of ROAL Motorsport to develop awinning car.”"}, {"url": "https://us.motorsport.com/gtwce-sprint/news/thomas-biagi-joins-af-corse/2274953/", "page_content": "Thomas Biagi on Ferrari 430 of AF Corse team!\n\nThe die is cast. Thomas Biagi has made up his mind. Beginning of this year the Fia GT Champion was asked wether to go on with Vitaphone Team or to switch to another team. A strong challenge to stake again his carreer. Go back to Ferrari, with very good memories of World Championship FIA GT 2003 on his 550 Maranello or all the kilometers ran on the single seat cars in Ferrari Client Race Department like 640, previously Nigel Mansell in '90s, and F398 and F1-2002 previously Schumacher during Ferrari days.\n\nThose are the off the cuff comments: \"After three years with Maserati, three World Champion titles of the team, two titles of the Constructors ended up with my personal success last season, I've reached all my possible goals. My last choice has been determined by different factors, firstwhole the desire to give myself a chance in an extremely competitive championship like this year GT2 with 20 teams in the lists, moreover a strong belief in the consistency of Ferrari long time plans and above all the high opinion for Mr Amato Ferrari, who I can reflect myself with for his expierence as a pilot. It's always unique to have a Rampant Horse on steering wheel spokes. I would say I acted in \"Lippi's way\", getting out of GT1 as World Champion to enter in GT2 aware that there will be a lot to work upon, starting from my driving style. At the same time I'm still longing for new records and above all I wish I could support the whole Team. In AF Corse team I will meet a group of strongly motivated people I worked with in the past, will be supported by Michelin and - least but not last - I will have a very strong team companion Christian Montanari. I think there are all the premises for a good start!\".\n\nThose are the words of Team Principal Amato Ferrari: \"I believe that this year I will have in my team precious pilots. Together with Vilander and Bruni, the arrival of Biagi and Montanari from GT1 is a confirmation that GT2 is becoming more amd more important. This year, Ferrari and Porsche will fight strongly, and there is high interest for the new Aston Martin. I'm very pleased to to line up two World Champions of 2007 in my team\".\n\n-credit: thomasbiagi.com"}, {"url": "https://it.wikipedia.org/wiki/Thomas_Biagi", "page_content": "Thomas Biagi (Bologna, 7 maggio 1976) è un pilota automobilistico italiano.\n\nL'anno del debutto nel karting è il 1987, nella categoria 60 minikart e in cinque anni centra numerosi successi, tra cui il Torneo delle industrie di Parma e il titolo di Campione Italiano nella Categoria 100 Italia nel 1991. Nel 1993 approda al Campionato Italiano Formula Europa Boxer dove si classica sesto assoluto e si mette in mostra come miglior debuttante.\n\nNel 1994 arriva in Formula 3 e riceve il Trofeo Gariboldi alla serata dei Caschi d'Oro organizzata dalla rivista Autosprint. Nel 1995 sempre in Formula 3 con il Team RC Motorsport registra tre pole position e due vittorie (Mugello e Imola). Al Motor Show di Bologna vince il trofeo Indoor di Formula 3 e a Fiorano, nello stesso anno, effettua un test con la Minardi Formula 1 M195.\n\nIl triennio 1996 – 1997 – 1998 è il periodo dell'esperienza nella Formula 3000 con la partecipazione al Campionato Internazionale FIA F.3000, mentre nel 1999 Thomas partecipa al campionato F.3000 Italia dove, con solo tre gare all'attivo, si classifica al quarto posto grazie ad una pole position, due secondi e un terzo posto. Al Motor Show di Bologna si aggiudica il Trofeo Indoor F. 3000. Nel 2000 Thomas approda alla Euro 3000 Series con il Team GP Racing: alla fine della stagione sarà 4º assoluto con una pole position e una vittoria al Gran Premio Internazionale di Assen (Paesi Bassi). Partecipa inoltre al Ferrari day al Mugello, guidando una Ferrari F300 di Formula 1.\n\nNel 2001 si laurea vicecampione europeo con 32 punti (1 vittoria e 2 pole position). Si aggiudica di nuovo il Trofeo Indoor F. 3000 del Motor Show di Bologna e partecipa al Ferrari day di Monza a bordo di una Ferrari F300 F.1. Alla serata dei Caschi d'oro riceve la prestigiosa medaglia d'oro. Il 2002 è l'ultima stagione in monoposto. Con il team Ghinzani, Thomas Biagi conquista tre podi: 3º a Vallelunga, 3º a Brno e 3º a Monza con pole position e record della pista nel GP Lotteria di Monza.\n\nVetture sport [ modifica | modifica wikitesto ]\n\nIl 2003 è la stagione d'oro per Thomas, anno in cui partecipa al FIA GT Chiampionship e si laurea Campione del Mondo con il teamBMS Scuderia Italia a bordo di una Ferrari 550 Maranello. L'annata inizia nel migliore dei modi con un record: vittoria nella prima gara (Barcellona), che sarà seguita da una serie di cinque successi consecutivi (che restano un record nella storia del Campionato Mondiale GT). Al termine della stagione riceve il Casco d'Oro di AutoSprint, il Trofeo FIA (consegnato ai piloti iridati durante la tradizionale cerimonia che si svolge allo Sporting Club di Montecarlo) e la Medaglia d'Argento al valore atletico del Comitato Olimpico Internazionale.\n\nLa MC12 di Biagi del 2006\n\nIl 2004 segna un'altra svolta per Thomas, che raccoglie la sfida lanciata da Barron Connor che gli consegna una Ferrari 575 GTC per disputare il Campionato ALMS, laureandosi vicecampione, conquistando il 2º posto alla 12 Ore di Sebring e partecipando alla 24 Ore di Le Mans.\n\nNel 2005 Thomas ritorna nel campionato FIA GT con la Maserati MC12 del Team Vitaphone. I suoi risultati sono: due vittorie (Silverstone e Oschersleben), un secondo posto (Istanbul) e 3º a Monza, Magny Cours e Imola. Al termine del 2005 vince il Titolo Mondiale costruttori e squadre. Nella stessa stagione guida la Jordan EJ15 al Motor Show di Bologna e la Midland M16 a Jerez de la Frontera, compiendo 92 tornate con tempi di tutto rilievo.\n\nBiagi sulla Ferrari F430 nel 2008\n\nNel 2006 sempre con la Maserati MC12 vince ancora il Titolo Mondiale a squadre. Durante la stagione ottiene le vittorie a Digione e ad Adria, un secondo posto (Oschersleben) e per tre volte sale sul terzo gradino del podio (Paul Ricard, Mugello e Dubai).\n\nNel 2007, per il terzo anno di seguito rimane in seno al Team Vitaphone. Thomas ricambia la fiducia centrando il titolo mondiale piloti, il secondo della carriera nel FIA GT. La laurea arriva all'ultima gara, con il terzo posto conquistato a Zolder, in una battaglia in cui il pilota bolognese riesce ad avere la meglio nei confronti di nove pretendenti. Una stagione difficile, con due vittorie (Silverstone e Oschersleben), ma che ha visto Thomas al comando della classifica fin dalla seconda gara.\n\nTeam BMW Italia 2011\n\nNel 2008 riceve la chiamata di Amato Ferrari, che gli offre la guida della Ferrari F430 per la scuderia AF Corse, correndo nella categoria GT2.\n\nNel 2010 entra nel Team BMW Italia che gareggia nel Campionato Superstars, laureandosi Campione Italiano e Campione Internazionale; nella stagione 2011 prosegue la sua partecipazione alle gare del Campionato Superstars.\n\nAlla sua attività agonistica Biagi affianca quella di telecronista per eventi sportivi motoristici sulla rete satellitare SKY Sport.\n\nDati carriera [ modifica | modifica wikitesto ]\n\nProve in Formula 1 [ modifica | modifica wikitesto ]\n\nCaschi d'Oro della rivista Autosprint : Trofeo Garibaldi nel 1994, medaglia d'oro nel 2001, casco d'oro nel 2003.\n\nMedaglia d'argento del valore atletico del Comitato Olimpico Internazionale.\n\nLeopoldo Canetoli Tridente di passione - Thomas Biagi 2007, Edizioni Tipoarte (Bologna)-Ozzano Emilia 2007\n\nAltri progetti [ modifica | modifica wikitesto ]\n\nAltri progetti"}, {"url": "https://prabook.com/web/thomas.biagi/1847841", "page_content": "Thomas Biagi\n\nracecar driver\n\nMarch 7, 1976 Bologna, Province of Bologna, Italy\n\nBiagi started his career in single seaters, driving in Formula Alfa Boxer and Italian Formula Three Championship, where he was 5th best in 1995, with two wins. From there, he moved up to the FIA Formula 3000 Championship from 1995 to 1998, without major results. His debut race in 1995 saw him collide with Marco Campos on the last lap, resulting in a crash which inflicted fatal injuries on the Brazilian driver. After a year in the Le Mans Endurance Series, he returned to the FIA GT with Vitaphone Racing, helping the squad take two Team titles before winning the Drivers title himself in 2007. Complete International Formula 3000 results (key) (Races in bold indicate pole position. Races in italics indicate fastest lap) 24 Hours of Le Mans results 24 Hours of Daytona (key) Complete International Superstars Series results (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) Complete Porsche Supercup results (key) (Races in bold indicate pole position) (Races in italics indicate fastest lap) † Did not finish, but was classified as he had completed more than 90% of the race distance."}], "Thomas Biagi has competed in the 24 Hours of Le Mans.": [{"url": "https://www.crash.net/le-mans/news/140418/1/biagi-joins-barron-connor-racing", "page_content": "The Barron Connor Racing team has signed Italian Thomas Biagi to race in the Le Mans 24 hours, the Sebring 12 Hours, and the Le Mans Endurance Series, partnering John Bosch and Danny Sullivan in one of team's two Ferrari's 575 GTC.\n\n\"We were looking for the best and they don't come much better than the current [FIA GT] world champion,\" John Bosch said. \"We are very happy to have Thomas joining us. Both as a person and as a driver, he very much contributes to our team's goals and objectives.\n\n\"He is fast and a pleasure to work with and, having won the FIA championship in a Ferrari 550 last year, he of course brings a lot of highly relevant experience to the team.\"\n\n27-year old Biagi from Bologna, Italy is equally pleased: \"I am delighted to race with the Barron Connor team this year. I very much like John and his people, who make me feel very welcome. They are very serious about achieving their ambitions. The team is extremely professional, with highly skilled people and phenomenal facilities. I am happy to be partnering John, the reigning FIA Sportscar champion, and Danny, who is of course highly experienced. For me, to race the new Ferrari 575 GTC in the most prestigious sports car races, is exiting as well as an honour. Sebring is a legendary event, Le Mans is the most important race in the world and the new championship will be a true classic.\"\n\nThe Barron Connor Ferrari's 575 GTC are now being prepared for the 52nd Sebring 12 Hours.\n\n\"We are impressed by Ferrari's support and the calibre of MilanTech and N-Technology,\" Bosch explains. \"Their level of professionalism is very motivating. We have long term ambitions and the potential that has now been created is fantastic. We are talking to many drivers about the second 575 GTC that we are running, and are also very pleased by the interest shown from renowned technical partners. We expect to be able to present more details before testing the cars prior to leaving for Sebring.\""}, {"url": "https://us.motorsport.com/lemans/news/thomas-biagi-preview/2708428/", "page_content": "Thomas Biagi will take part to Le Mans 24 Hours driving Ferrari F430\n\nThe \"longest\" challenge\n\n\"Le Mans 24 Hours is one of the world's most fascinating and prestigious races and I coludn't miss it! It will be my personal second presence, the first time was in 2004 with Ferrari 575. This year I'll be honoured to be at the wheel of a Ferrari F430, alined by my team AF Corse; I want to thank everyone for giving me the chance to feel the emotions of this so hard as fascinating race\".\n\nThomas next challenge on the historical Sarthe Circuit will take place next 14th - 15th June. A considerably professional team for this epic race: the title holders of FIA GT will be at the wheel of car n. 78 of AF Corse racing stable: Thomas Biagi for GT1 and Toni Vilander for GT2. Together with them Christian Montanari, the fast from Sanmarino, Thomas new car mate in 2008 Championship, where they are now ranked second after two races.\n\nIn the pre-qualifications of the first weekend of June, the three got the fifth best performance in GT2 category, despite race-proofs were held with lasting bad weather. The race - organized by the Western Automobile Club (ACO) - is disputed since 1923, apart for some exceptions, on the 13 kilometers long non permanent track even on ordinary country roads.\n\nNext weekend (14th - 15th June) sporting focus will move to Le Mans, with a strong mediatic covering all over the world; Italy will be there with the live broadcasts of Eurosport and Nuvolari channels.\n\n-credit: thomasbiagi.com"}, {"url": "https://www.driverdb.com/drivers/thomas-biagi/", "page_content": "Over 20,000 race results form the basis of the calculations.\n\nThe rating is based on the average of the drivers last 20 races. Each driver starts out with a rating of 1500. The Driver Ranking is 100% objective as the championships are\n\nView Full DriverDB Top 100 Drivers"}, {"url": "https://www.jvennix.com/drivers/Thomas-Biagi", "page_content": "Give feedback on Thomas Biagi\n\nYour name: Your e-mail address: Captcha: BirthDate: DeceasedDate: Comments\n\nWe value your feedback or adjustments of incorrect data. You can use this form to suggest changes. All changes will be implemented after moderation. You e-mail address is only used for communication if we require additional information or to answer questions. After processing we will delete your personal data."}, {"url": "https://www.automobilsport.com/24h-le-mans-matteo-bobbi-lola-racing-box-thomas-biagi-andrea-piccini---64660.html", "page_content": "A few hours to go before Matteo Bobbi's debut .. 10.06.2009: The 77th edition of the 24h of Le Mans, the most fascinating and famous endurance race in the world, will officially begin today with the first free practice sessions.\n\n... in the 24h of Le Mans\n\n\n\n\n\nThe 77th edition of the 24h of Le Mans, the most fascinating and famous endurance race in the world, will officially begin today with the first free practice sessions.\n\n\n\nMatteo Bobbi will be at his first experience on the circuit de la Sarthe, despite his numerous participations to other famous 24hour races like Daytona and Spa. The Italian driver will be behind the wheel of a Lola B09/08 LM P2 lined up by team Racing Box, together with his usual crew-mates in the Le Mans Series: Thomas Biagi and Andrea Piccini.\n\n\n\nThe Circuit de la Sarthe, is a semi-permanent race track located in the Sarthe county in France and hosts every year the 24 Hours of Le Mans.\n\nWith a total length of 13,629 km the circuit is one of the longest one in the world and throughout the years it underwent several changes to raise its security standards. Its endless main straight is famous, a part of the Route Nationale 138, whereby the top speed is crucial for the final braking. The track is a tough test-bench both for drivers and for mechanical parts, the car is full throttle for more than 70% of the lap.\n\n\n\nLe Mans has always been a speed temple, and at the end of '80s this was impressive: in 1988 a WM P88 powered by a Peugeot V6 Turbo reached 405 km/h in the race, whole the following year a Suber C9 reached 400 km/h during practices.\n\n\n\nAt that point FISA decided that cars were too dangerous and two chicanes were added before the 1990 race. At the time, towards the end of the straight the Mulsanne's hillock was present, on which the Mercedes-Benz CLR of Mark Webber took off and tipped over in 1999. The hillock was successively made smaller for security reasons.\n\nThe roll of honour of the 24 Hours of Le Mans is full of names that made the history of motor racing, such as Tazio Nuvolari, Henri Pescarolo, Jacky Ickx, Klaus Ludwig, Tom Kristensen, Rinaldo Capello and Emanuele Pirro. Among winning constructors we can cite Ferrari, Porsche, Bentley, Jaguar, BMW and Audi.\n\n\n\nThis is the programme of 2009 edition (local time):\n\n\n\nWednesday 10 June\n\n18.00 - 24.00: Free practice\n\n\n\nThursday 11 June\n\n19.00 - 21.00: Qualifying 1\n\n22.00 - 24.00: Qualifying 2\n\n\n\nSaturday 13 June\n\n08.30 - 09.15: Warm-up\n\n15.00: Race\n\n\n\nMatteo Bobbi:\n\n\"Racing at Le Mans is gonna be a new emotion for me. The team did a very accurate preparation work and we hope this to be the winning point of the race: reliability played a crucial role in previous editions and it will be important first to get under the chequered flag. In terms of competitiveness I am fairly confident: we already won a race in the LMS, the car is performing and our team is one of the strongest. Premises are therefore definitely positive\".\n\n\n\n\n\n- Matteo Bobbi press - Alberto Brojanigo"}, {"url": "https://au.motorsport.com/elms/news/catalunya-thomas-biagi-preview/2888738/", "page_content": "Thomas in Le Mans Series on the Racing Box's Lms!\n\nHe will join Bobbi and Piccini to form an italian dream team!\n\nThomas Biagi joins Matteo Bobbi and Andrea Piccini on Racing Box's Lola B8/08. The news was in the air after last week's tests in Misano (Italy) and it is official now. The three pilots know each others very well because all of them met in FIA GT championship. Biagi became FIA GT world champion in 2003, at his debut, running with Bobbi. Biagi and Piccini fought for the leadership in 2007, when they both drove a Maserati Mc12. That time Biagi made it, winning the title in Zolder, the last race of the championship. They challenged each other also with the Lola cars projected for F3000 International. As you can see, there's planty of analogies. On april, 5th, Biagi and Bobbi will run together in Barcelona, the same circuit where they won their first race in FIA GT.\n\n\"I'm happy with this enormous chance - Biagi says - It looks like an amazing gift that I've been waiting for so long. The car gives me a lot of good feelings when I drive it, the team of Luca Canni Ferrari is unique and I'm very happy to work with Matteo Bobbi, who is more than a friend, and Andrea Piccini, that I respect a lot. The team is very prepared and our engineer, Andrea Adamo, needs no business card. My partnership will Michelin will continue. I couldn't ask of anything more. I met a special one like Ferdinando Geri who gave me his trust. Together with Canni Ferrari, he allowed three Italian pilots to run in such a championship and compete to win one of the most famous race in the world: Le Mans\".\n\nMr Biagi will go back to a Braclay car six years after his last race with a S3000. The only thing left say is: Forza Azzurri!\n\n-credit: thomasbiagi.com"}, {"url": "https://us.motorsport.com/lemans/news/thomas-biagi-preview-2009-10-02/2952877/", "page_content": "Thomas flying to Le Mans for the marathon and for...\n\n...seating on Corvette C6-R of \"Luc Alphand Aventures\"\n\nThe Italian driver, after an intensive sport training, is ready for the French transfer that has a double meaning to him. He will dispute for the thirt time the 77th edition of legendary 24 Hours race (with his fellow citizen Luca Cordero di Montezemolo as special starter) after 2004 driving Ferrari 575 and 2008 driving F430 by AF Corse. First time at the steering wheel of best performing prototype like Lola Judd and with a full Italian trio together with Bobbi and Piccini. \"I wish I could soon be living the wonderful atmosphere of this race, feeling the passion of 280.000 people standing, driving in one of the world most fascinating racetracks. I thank Racing Box for this prestigious opportunity\" Thomas declares from Luc Alphand Team headquarters, right in Le Mans (!), getting the seat ready of the car he will be driving with Xavier Maassen starting from Oschersleben on June 21st.\n\nTherefore after Silverstone and Adria, Thomas Biagi will go on driving in GT1!\n\nThe two times Category Champion, after respecting the agreement to \"thin down\" and develop new Ford GT of Matech Team for the first two rounds, has been chosen by Luc Alphand Aventures in order to end up the season with Corvette C6R #19 with team mate Xavier Maassen.\n\n\"I'm very satisfied of this flash agreement\" Thomas sais we fine tuned immediatly with Philippe Poincloux I thank for trusting me and offering me the chance to go on with the FIA GT1 Championship on a very competitive car (we remind you that car n.19 has arrived third in Silverstone and fourth in Italy, ndr). Moreover, just a few days ago, the Federation has widened Corvette restrictors and we could take advantage from this. I'll do my best to contribute to the Team and to my team mate success in the race for the Title\".\n\nThis year was supposed to be a sabbatic year and is becoming a record season: 12 international races disputed till then, and 10 to be disputed among which two 24 Hours (Le Mans and SPA), one victory while his debut in LMS - Barcellona, another category victory in FIA GT and three times on the podium of Speedcar Series.\n\n-credit: thomasbiagi.com"}, {"url": "https://au.motorsport.com/lemans/news/thomas-biagi-preview-2009-10-02/2952878/", "page_content": "Thomas flying to Le Mans for the marathon and for...\n\n...seating on Corvette C6-R of \"Luc Alphand Aventures\"\n\nThe Italian driver, after an intensive sport training, is ready for the French transfer that has a double meaning to him. He will dispute for the thirt time the 77th edition of legendary 24 Hours race (with his fellow citizen Luca Cordero di Montezemolo as special starter) after 2004 driving Ferrari 575 and 2008 driving F430 by AF Corse. First time at the steering wheel of best performing prototype like Lola Judd and with a full Italian trio together with Bobbi and Piccini. \"I wish I could soon be living the wonderful atmosphere of this race, feeling the passion of 280.000 people standing, driving in one of the world most fascinating racetracks. I thank Racing Box for this prestigious opportunity\" Thomas declares from Luc Alphand Team headquarters, right in Le Mans (!), getting the seat ready of the car he will be driving with Xavier Maassen starting from Oschersleben on June 21st.\n\nTherefore after Silverstone and Adria, Thomas Biagi will go on driving in GT1!\n\nThe two times Category Champion, after respecting the agreement to \"thin down\" and develop new Ford GT of Matech Team for the first two rounds, has been chosen by Luc Alphand Aventures in order to end up the season with Corvette C6R #19 with team mate Xavier Maassen.\n\n\"I'm very satisfied of this flash agreement\" Thomas sais we fine tuned immediatly with Philippe Poincloux I thank for trusting me and offering me the chance to go on with the FIA GT1 Championship on a very competitive car (we remind you that car n.19 has arrived third in Silverstone and fourth in Italy, ndr). Moreover, just a few days ago, the Federation has widened Corvette restrictors and we could take advantage from this. I'll do my best to contribute to the Team and to my team mate success in the race for the Title\".\n\nThis year was supposed to be a sabbatic year and is becoming a record season: 12 international races disputed till then, and 10 to be disputed among which two 24 Hours (Le Mans and SPA), one victory while his debut in LMS - Barcellona, another category victory in FIA GT and three times on the podium of Speedcar Series.\n\n-credit: thomasbiagi.com"}, {"url": "https://www.motorsport.com/lemans/news/2022-le-mans-entry-list/8568643/", "page_content": "Subscribe and access Motorsport.com with your ad-blocker.\n\nFrom Formula 1 to MotoGP we report straight from the paddock because we love our sport, just like you. In order to keep delivering our expert journalism, our website uses advertising. Still, we want to give you the opportunity to enjoy an ad-free and tracker-free website and to continue using your adblocker.\n\nYou have 2 options:"}, {"url": "http://www.italiaspeed.com/2004/motorsport/sportscars/alms/pre_season/001_barron_connor_biagi.html", "page_content": "The Barron Connor Racing team has signed Italian Thomas Biagi to race in the Sebring 12 Hours, the Le Mans 24 Hours and the Le Mans Endurance Series, partnering John Bosch and Danny Sullivan in one of team’s two Ferrari’s 575 GTC. “We were looking for the best and they don’t come much better than the current FIA GT Champion”, John Bosch said. “We are very happy to have Thomas joining us. Both as a person and as a driver, he very much contributes to our team’s goals and objectives. He is fast and a pleasure to work with. And, having won the FIA championship in a Ferrari 550 last year, he of course brings a lot of highly relevant experience to the team.” 27-year old Biagi from Bologna, Italy, is equally pleased: “I am delighted to race with the Barron Connor team this year. I very much like John and his people, who make me feel very welcome. They are very serious about achieving their ambitions. The team is extremely professional, with highly skilled people and phenomenal facilities.\n\n\n\n\"I am happy to be partnering John, the reigning FIA Sportscar champion, and Danny, who is of course highly experienced. For me, to race the new Ferrari 575 GTC in the most prestigious sports car races, is exiting as well as an honour. Sebring is a legendary event, Le Mans is the most important race in the world and the new championship will be a true classic.” The Barron Connor Ferrari’s 575 GTC are now being prepared for the 52nd Sebring 12 Hours. “We are impressed by Ferrari’s support and the calibre of MilanTech and N-Technology”, John Bosch explains. “Their level of professionalism is very motivating. We have long term ambitions and the potential that has now been created is fantastic.\n\n\n\n\"We are talking to many drivers about the second 575 GTC that we are running, and are also very pleased by the interest shown from renowned technical partners. We expect to be able to present more details before testing the cars prior to leaving for Sebring.”"}]}