{"Susan Pedersen competed in the women's 200-meter butterfly.": [{"url": "https://bleacherreport.com/articles/10008995-olympic-swimming-2021-womens-200m-butterfly-medal-winners-times-and-results", "page_content": "AP Photo/Petr David Josek\n\nZhang Yufei set an Olympic record en route to gold at the women's 200-meter butterfly with a time of 2:03.86 from Tokyo Aquatics Centre.\n\nZhang, who also won silver at the 100-meter butterfly in the Tokyo Olympics, dominated the field en route to her first-ever gold on the world stage.\n\nA pair of Americans took silver and bronze in Regan Smith and Hali Flickinger, respectively.\n\nHere's a look at the official results from the eight-swimmer field.\n\nResults\n\n1. Zhang Yufei (China): 2:03.86\n\n2. Regan Smith (United States): 2:05.30\n\n3. Hali Flickinger (United States): 2:05.65\n\n4. Boglarka Kapas (Hungary): 2:06.53\n\n5. Svetlana Chimrova (Russian Olympic Committee): 2:07.70\n\n6. Liyan Yu (China): 2:07.85\n\n7. Alys Margaret Thomas (Great Britain): 2:07.90\n\n8. Brianna Throssell (Australia): 2:09.48\n\nZhang's blazing time was the fastest recorded in the race in 12 years, per ESPN:\n\nChinese swimmer Liu Zige owns the fastest-ever time in the race when she registered a mark of 2:01.81 in 2009 at the Chinese National Games.\n\nZhang added to an already impressive resume that includes one silver and four bronze medals in World Championship events.\n\nHer win also gave China its 13th first-place finish at this year's Games, which tied Japan for the gold medal lead at the time of her fantastic performance.\n\nAs for the runners-up on the podium, Smith made up some ground in the final 50 meters to surpass Flickinger. She previously won bronze at the 100-meter backstroke in this year's Olympic Games.\n\nFlickinger also owns a bronze medal in Tokyo, earning third in the 400-meter medley."}, {"url": "https://www.reuters.com/lifestyle/sports/swimming-chinas-zhang-wins-womens-200m-butterfly-gold-2021-07-29/", "page_content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\nTOKYO, July 29 (Reuters) - Zhang Yufei of China won the gold medal in the women's 200m butterfly at the Tokyo Olympics on Thursday.\n\nRegan Smith of the United States won the silver and her compatriot Hali Flickinger took the bronze.\n\nEditing by Nick Mulvenney.\n\n\n\n\n\n\n\n\n\n\n\nOur Standards: The Thomson Reuters Trust Principles."}, {"url": "https://news.cgtn.com/news/2021-05-05/Zhang-Yufei-storms-to-200-meter-butterfly-win-at-Chinese-nationals-1016Rbhli2Q/index.html", "page_content": "Zhang Yufei snatched two gold medals on Wednesday at the Chinese National Swimming Championships in Qingdao, east China's Shandong Province, as she stormed to win the 200 meters butterfly and anchored in the winning quartet in 4x200 meters freestyle relay.\n\n\n\nZhang, who clocked 2:06.11 and 2:06.31 in heats and semifinals, dominated the final in 2:05.44, the fastest time on the world rankings since 2019.\n\n\n\n\"I really want to break the barrier of 2:05.00, but I missed the cut since I have competed in 100 meters butterfly, 100 meters and 200 meters freestyle so far, I feel exhausted,\" said the 23-year-old, who tied her own national record in 100 meters freestyle with 52.90 on Tuesday evening heats.\n\n\n\nLater, Zhang joined the mixed team in the 4x200 meters freestyle relay and won the race in 7:59.45, beating teams from Hebei and Shandong into second and third."}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/pedersen-susan-1953", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://kids.britannica.com/students/article/Susan-Pedersen/343789", "page_content": "(born 1953). By capturing four medals at the 1968 Summer Games, swimmer Susan Pedersen helped make that Olympiad one of the best in the history of U.S. women’s swimming. Her performances in relay events contributed to two new Olympic records.\n\nPedersen was born on Oct. 16, 1953, in Sacramento, Calif. She first achieved international recognition by winning three silver medals at the 1967 Pan American Games. She went on to earn four Amateur Athletic Union titles.\n\nAt the 1968 Olympics in Mexico City, Pedersen won two gold medals as a member of victorious relay teams. In the 4 × 100-meter freestyle relay she teamed with Jane Barkman, Linda Gustavson, and Jan Henne to set a new Olympic record. Likewise, the team of Pedersen, Kaye Hall, Catie Ball, and Ellie Daniels won their 4 × 100-meter medley relay race in record time. Pedersen also earned two individual silver medals at the games. She placed second to Henne in the 100-meter freestyle and to Claudia Kolb, another teammate, in the 200-meter individual medley."}, {"url": "https://olympics.com/en/athletes/susan-jane-pedersen", "page_content": "Biography\n\nSue Pederson won a gold medal in both relays at the Mexico Games as the U.S. set a new Olympic record in each. She also won two silvers in individual events and placed fourth in the 400 IM. She competed for the Arden Hills SC and, in addition to winning three silver medals at the 1967 Pan-American Games, won four AAU titles. Pederson set three world records in her short career, one in the 200 freestyle, and one in the medley relay and the 4x200 free relay. She also set nine American records.\n\nPederson retired after the 1968 Olympics, and later attended the University of Louisville. She and her family settled in Tacoma, Washington, where she worked as a certified public accountant."}, {"url": "https://www.liquisearch.com/susan_pedersen_swimmer", "page_content": "Susan Pedersen (swimmer)\n\nSusan Jane Pedersen (born October 16, 1953) is an American former swimmer, Olympic champion, and former world record-holder.\n\nPedersen competed at the 1968 Summer Olympics in Mexico City, where she received a total of four medals. She won a gold medal as a member of the winning U.S. team in the women's 4x100-meter medley relay, and another swimming for the first-place U.S. team in the 4x100-meter freestyle relay. Individually, she received silver medals for her second-place finishes in the women's 100-meter freestyle and 200-meter individual medley.\n\nShe held the world record in the 200-meter freestyle (long course) (2:09.5) from July 6, 1968 to August 2, 1968. She was also a member of world-record U.S. teams in the 4x100-meter medley relay and the 4x200-meter freestyle relay.\n\nPedersen was inducted into the International Swimming Hall of Fame as an \"Honor Swimmer\" in 1995."}, {"url": "https://olympics.sporting99.com/track-field/womens-200-meter-individual-medley.html", "page_content": "List of all Olympics Women's 200 Meter Individual Medley winners including gold, silver and bronze medalists.\n\nWomen's 200 Meter Individual Medley\n\nLike many women swimming events, Women's 200 Meter Individual Medley was also introduced at Olympic Games in 1968. Since then it has been a regular part of the women swimming at every Olympic Games. The following medals table lists all medal winners in Women's 200 Meter Individual Medley swimming event at Olympic Games.\n\nWomen's 200 Meter Individual Medley Winners at Olympics"}, {"url": "https://www.celebsagewiki.com/susan-pedersen-swimmer", "page_content": "Age, Biography and Wiki\n\nSusan Pedersen was born on 16 October, 1953 in Sacramento, California, United States, is an American swimmer. Discover Susan Pedersen's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 69 years old?\n\nPopular As N/A Occupation N/A Age 69 years old Zodiac Sign Libra Born 16 October 1953 Birthday 16 October Birthplace Sacramento, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 16 October. She is a member of famous Swimmer with the age 69 years old group.\n\nSusan Pedersen Height, Weight & Measurements\n\nAt 69 years old, Susan Pedersen height is 1.75 m and Weight 70 kg.\n\nPhysical Status Height 1.75 m Weight 70 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nSusan Pedersen Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Susan Pedersen worth at the age of 69 years old? Susan Pedersen’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Susan Pedersen's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nSusan Pedersen Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Susan Pedersen Wikipedia Imdb\n\nTimeline"}, {"url": "https://alchetron.com/Susan-Pedersen-(swimmer)", "page_content": "Susan \"Sue\" Jane Pedersen (born October 16, 1953), also known by her married name Susan Pankey, is an American former competition swimmer, four-time Olympic medalist, and former world record-holder in two events.\n\nAs a 15-year-old, Pedersen represented the United States at the 1968 Summer Olympics in Mexico City, where she received a total of four medals. She won a gold medal as a member of the winning U.S. team in the women's 4×100-meter medley relay, and another swimming for the first-place U.S. team in the women's 4×100-meter freestyle relay, while setting Olympic records in both. Individually, she received silver medals for her second-place finishes in the women's 100-meter freestyle (1:00.3), and women's 200-meter individual medley.\n\nShe held the world record in the 200-meter freestyle (2:09.5) from July 6, 1968 to August 2, 1968. She was also a member of world-record U.S. teams in the 4×100-meter medley relay and the 4×200-meter freestyle relay.\n\nPedersen was inducted into the International Swimming Hall of Fame as an \"Honor Swimmer\" in 1995."}], "Susan Pedersen finished fourth in the event final with a time of 2:13.45.": [{"url": "https://www.historians.org/research-and-publications/perspectives-on-history/october-2000/the-future-of-feminist-history", "page_content": "Editor's Note: This essay was presented as part of a panel entitled \"The Future of Feminist History\" at the breakfast meeting of the Committee on Women Historians of the AHA on January 8, 2000. The panel was organized by Carla Hesse and also included talks by Jennifer Morgan and Mrinalini Sinha. This text has been edited but appears very largely as it was given.\n\nI want to thank all of you for coming out at 7:30 a.m. on a Saturday morning of a busy conference. When I see the group gathered here today, I understand why feminist history has accomplished all that it has. And this is because, after we feminists do our share of interviewing and being interviewed, speaking, commenting and debating, schmoozing, hobnobbing, and finding time to see old friends (not to mention sometimes getting up with small children), we wake up at the crack of dawn to talk about the future of feminist history. Confronted by such dedication, I am tempted to propose one possible future for feminist history: let the women sleep in! Next year, let's let the men get up at dawn to discuss gender and history. But they won't and don't, and we will and do—and that is our strength and also our cross.\n\nLet me turn, then, to my task, which is to discuss the future of feminist history. But surely this is an impossible—and almost antifeminist—charge. For the topic seems to invite the kind of magisterial summarizing and confident prediction that women's history—with its attention to the unexpected and contingent, the marginal and suppressed—was virtually developed against. But as I reflected further on this challenge, I began to find it an extraordinarily useful one, for it forced me to think outside my usual range of topics and against the historian's particularist grain. After all, there is a value in magisterial pronouncements and sweeping generalizations, if only because they can serve as stimuli to debate. So, instead of making the true but unhelpful point that the future of feminist history is likely to be messy, unfathomable, contentious and yet productive, let me take advantage of this chance to be magisterial and predictive, and put forward my own singular but considered views. And in this vein, I am drawn to make three main points about our field: one celebratory, one anxious, and one programmatic.\n\nA Transformative Presence\n\nFirst and most fundamentally, I want to acknowledge and celebrate the degree to which feminist history has come to be—and, I believe, will continue to be—a powerful and transformative presence in the academy. Whatever our individual criticisms of various approaches and fields—and there is no more critical and self-critical bunch—I think all of us would agree that feminism has utterly transformed historical writing. If we take feminism to be that cast of mind that insists that the differences and inequalities between the sexes are the result of historical processes and are not blindly \"natural,\" we can understand why feminist history has always had a dual mission—on the one hand to recover the lives, experiences, and mentalities of women from the condescension and obscurity in which they have been so unnaturally placed, and on the other to reexamine and rewrite the entire historical narrative to reveal the construction and workings of gender. Moreover, despite our own endless arguments over which of these approaches and tasks is the more significant, the important point is that we have been true to both. And rightly so, for this argument—the argument between \"women's history\" and \"gender history\"—is an argument in which one side continually produces the case for the opposite stance, an argument neither side should ever win. Women's history isn't a stage that we move through as we struggle toward gender history, for gender history itself sends us endlessly back to women. And both inquiries have transformed our historical work and understanding.\n\nThus, works on women have consistently de-essentialized and historicized groups and issues too often trapped in discourses of degeneracy and difference. From Luise White's determination to see Nairobi's prostitutes as entrepreneurs and not victims, to Margot Badran's recovery of a critical feminist voice in Egyptian nationalism, to Nancy Hunt's creative analysis of the ways in which varied cultural practices around maternity in the Belgian Congo shaped colonial relations and populations more broadly, feminist historians have recovered and asserted the significance of women's voices and choices in the past—an effort that cannot possibly be dismissed as \"compensatory history.\" And the payoffs from the turn to gender history have been equally great. Most of the great narratives of modern history—the narratives of industrialization, of class formation, of the construction of welfare states, of the making of nations and empires, of the emergence of democratic politics and the practices of total war—are now seen to have been framed by, based upon, productive of, and narrated through changes in relations between the sexes. This revisionist impulse has gone very far in some fields—there is, for example, no more flourishing subfield in British history today than that devoted to working out the interconnections between the construction of gender identities and the operations of empire—but we find it in almost every field. Think, for example, of Afsaneh Najmabadi's lovely recent study of the ways in which a national panic over the abduction and selling of girls helped to authorize and legitimate the project of Iranian nation-building, of Kristin Hoganson's reading of the Spanish-American war as a project of cultural masculinization, or of Partha Chatterjee's and Mrinalini Sinha's rival accounts of the gendered bases of British imperialism and Indian nationalism.\n\nInstitutional Achievements\n\nNor need our celebration of the impact of feminism on the academy be measured by the flow of books and articles alone. There are also institutional achievements. Not only do most departments now feel that they must teach women's history and (sometimes) even hire specialist women's historians, but also—and this is a quantum leap—they can increasingly imagine hiring someone who works on women or gender not as a \"women's historian\" but rather, say, as a colonial Americanist. Equally important, department members who are responsible for other areas—whether medieval Europe or modern Japan—increasingly feel driven to incorporate material on women into their teaching. Women's and gender history, in other words, may not have achieved its grandest ambition—the ambition to rewrite all of history from the standpoint of gender—but it has accomplished something that I feel to be even more important: it has established itself as one of a relatively small number of approaches and perspectives that are accepted both as legitimate subfields in their own right and as essential components of all national fields. Nor is this position seriously under threat, for both the intellectual imperatives and the emotional and political passions that underpin it are alive and well. Our search to find \"where the women were,\" and to reinterpret the world from their standpoint, will sustain and enrich our profession for a long time to come.\n\nIs all, then, sweetness and light? Here, I want to stop and spend a few minutes voicing an anxiety about two trends within feminist history that I find both exciting and disquieting. I speak, on the one hand, of the increasing attention paid to questions of identity in the study of the formation of individuals and collectivities, and, second, of the turn to what we might call an epistemological approach to the study of relations of power.\n\nContesting Identities\n\nOf course, there are good reasons for both of these moves. The study of women led us ineluctably to the discovery of differences and antagonisms between women, to an awareness of the fact that women often saw other affiliations as more meaningful than those of sex. From this study of division arose, inevitably, the study of contestation among identities, and of the processes through which particular affiliations come to be privileged or powerfully felt. Likewise, the study of gender as a cultural and symbolic system led us inevitably to what Mary Poovey and others have called historical epistemology—that is, to the attempt to understand the production of all those fundamental assumptions and categories that underwrite and sustain particular cultural formations. And if these moves were logical, so too have they had their benefits. The turn to identity, for example, has forced a critical reexamination of—and a moral attention to—a history that feminism has sometimes been slow to acknowledge. Rather than assuming the power of the identity of \"woman,\" we spend more time these days acknowledging and studying women's investment in other cultural practices or markers of difference—in ethnic and racial identities, in relational or family roles, in religious faith and observance. Thus, for example, Susan Grayzel's recent study of women's identities in Britain and France during World War I explores not only the emergence of a feminist pacifism but equally the ways in which many women sought to craft a gendered rhetoric of patriotism and to align the cause of feminism with the cause of war. Likewise, works by feminist historians show us what can be gained by integrating the insights of cultural analysis into studies of social relations: one has only to think of Leora Auslander's brilliant account of the ways in which aesthetic tastes and styles, gender and labor relations, and political forms coalesced and reinforced one another in 18th- and 19th-century France. And one could proliferate such examples.\n\nHistory without Politics?\n\nAnd yet, in spite of the manifest excellence of such work, the turn to identity in the context of a parallel turn toward what we might call a neo-Foucauldian or discursive theory of power has left me somewhat uneasy—or, rather, with the nagging feeling that something has been left out. What might that be? Let me take an example from my own field of British history. At the last annual meeting of the North American Conference on British Studies, there were 25 panels devoted to the modern period. Of these, 11 (or nearly a half) either employed gender as a central analytic concept or were explicitly on men, women, or the family. By contrast, 8 of these 25 panels (or about a third of the total) were on imperial questions. There was, however, an overlap of six between these two groups: six panels, in other words, were on gender and empire. These were, very largely, on identity—on \"imperial masculinity\" or on women's self-understandings and expression in different imperial contexts. They were, I hasten to add, often fascinating presentations: through an enterprising investigation of new sources, they revealed much about their subjects' mental worlds. But this focus on identity and subjectivity seemed to have come at some cost (if only in terms of alternatives foresworn), for what struck me at the time was that, among all these papers on sailors and settlers, missionaries and migrants, I was scarcely able to find one directly concerned with the political processes or social relations of empire—with conquest and governance, population policy, and labor control—all of which, I might add, have everything to do with gender. If a nonhistorian were to have come to this conference, then, she might conclude that the British Empire was nothing more than a great staging ground for the elaboration of \"Britishness,\" in which groups of rather self-absorbed British men and women could experiment with different identities without doing much harm to anyone—a bizarre vision, profoundly one-sided, and oddly reminiscent of an old imperial history also intensely focused on the self-justifications and self-understandings of the colonizing power.\n\nWhy, I wondered, did the conference look this way? Why had politics dropped out? There are, of course, many possible answers to this question, some of which would simply stress shifts in intellectual fashion and the lure of new sources, but one part of any answer must surely focus on the difficulties of studying politics in the context of our preoccupation with systemic cultural analysis. The problem is that the insights that have proven so productive for cultural analysis—insights about the multivalent, collaborative, and web-like nature of power—tend to be less useful for the study of narrower political processes. For, once we assume power is everywhere, it usually turns out to be nowhere very much; if it is analytically directionless, it scarcely needs to be taken into account. Our acceptance, in other words, of the truth that power is everywhere and that the weak, like the strong, play the game of power, has led us away from grasping the other truth that the players are not equal, that even multivalent systems can have internal movements preponderantly in one direction or another, that there are degrees of power, that a middle ground exists between an assumption of total agency and an assumption of total fixity—and that it is on this crucial middle ground that most interesting questions are found and much interesting history happens.\n\nWhat Is to Be Done?\n\nWhat is to be done? I think the problem itself dictates the solution. Let me then argue—and this is my third point—that feminist historians need to bring politics back in, and by this I mean politics less in the broad sense of systemic relations of power than in the narrower sense of that set of negotiations and institutions through which rights and goods are claimed, distributed, and contested. Bringing politics back in will give some much-needed precision to some of the work on identity—allowing us to see, for example, the conditions under which particular racialized or gendered identities can be captured by political movements and mobilized for particular ends. The narrow study of politics also reawakens us to the truth that questions about the degree and form of power are crucial and consequential historical questions, that there is a big difference between the sticks and stones that break our bones and the words that hurt but don't quite kill us. The study of politics, in other words, forces us constantly, and almost against our will, to shift the unit of analysis away from the system and toward the component parts, and to ask questions about processes and outcomes as well as about meanings. Partial such an approach may well be, but it strikes me as a necessary corrective at a moment when systemic analysis and \"thick description,\" rather than causal analysis and the study of change has so much the intellectual upper hand.\n\nBut I want to argue for bringing politics back in for two other reasons as well. We should pay attention to politics, I think, because political history has been one of the last intellectual strongholds of antifeminism, and is only now undergoing a real revision. Thus, in British history, a field in which virtually every worthwhile topic has been done many times over, crucial topics relating to women and politics and gendered studies of politics are still relatively underdeveloped. There is, for example, no book-length study of women's activism in the League of Nations, even though this is where many social reformers cut their teeth; only one recent scholarly work (by Kim Reynolds) on the activities of the political wife, even though political hostesses were crucial power brokers in the era before the emergence of mass parties; and until quite recently relatively little work on the reasons for the long-standing (if now overcome) gender gap in British politics, whereby women disproportionately favor conservatism. Only in the last few years, in work by Alison Light on the affinity between appeasement and domesticity, by Ina Zweiniger-Bargielowska and Fiona Grigg on the gendered appeal of conservative penal and economic policies, and by Martin Pugh and David Jarvis on the party's women's organizations, do we get the beginnings of such a gendered history of conservatism. Subjects like these are not trivial, for they help us to understand how some of the core political changes of our time—changes that affected the lives and life chances of millions—happened. These processes, too, were gendered, and they need our attention.\n\nBut there is one final reason I want to argue for attention to politics, and that is because it will help us with our own institutional work and practice. As we trace the historical significance of the partial reform, of the awkward coalition, of the indifferent outcome chosen to preclude the worse, we learn some lessons that may actually help us in the world in which we find ourselves. For—and this brings me back to my first point—as feminist history has swollen into a big and successful wave, it has lifted a lot of individual historian boats. Feminist historians are now on the committees and Council of the American Historical Association, they are deans and university presidents, heads of major granting agencies, tenured professors and department chairs. This group is making or helping to make the decisions about hiring, promotion, and publishing that will affect our profession through the next generation. I don't wish to belittle in any way the struggles of the first generations of feminist historians, who often pursued their visions from marginal positions and against difficult odds, but for a younger generation—my generation—I think it is important to acknowledge that the world has changed. It is no good, anymore, pretending that we are brave outsiders valiantly challenging patriarchal institutions: that is, the institutions may still be patriarchal, but we are right in the middle of them. When we make such claims or play such a role, then, we look—to our graduate students, to younger faculty, to adjuncts sweating it out in poorly paid holding tanks—not merely ridiculous but irresponsible, indulging in some fantasy of romantic opposition at their expense. For, I would argue, there is no power more despotic than the power that hides its face, that operates personally and erratically, that despises process, that will not acknowledge its own place in the hierarchy, that takes refuge—to cite a feminist classic—in the \"tyranny of structurelessness.\" Theories that stress the fluidity and multivalence of power fit too comfortably with such practice to make our attraction to them entirely innocent. My last point, then, is to ask that as we, as feminist historians, take on ever more important roles in the academy, we understand our place in fixed and directional hierarchies of power, and use our position well. This means, among other things, that we think about whether we can place our graduate students before we ask them to carry out our own intellectual agendas; that we diversify our curriculum without operating our own thought police; that we are gracious to those colleagues who don't quite understand what we do but want to be on our side; and, finally, that we not act like hurt parents when a younger generation decides—as it assuredly will—that we got it all wrong, and comes along to chastise and correct us."}, {"url": "https://www.lrb.co.uk/the-paper/v43/n05/susan-pedersen/worth-the-upbringing", "page_content": "On​ 18 June 1914, Sylvia Pankhurst was released from Holloway prison. She was in bad shape. A year earlier the Liberal government had passed the so-called Cat and Mouse Act as a response to the hunger strikes undertaken by militant suffragettes in prison. Under its terms, women could be released when they became dangerously weak (not just from hunger, but also from the travails of force-feeding), and then rearrested, released and rearrested, over and over, until they had served the whole of their sentences. Pankhurst came late to this refined and punctuated torture: by the time she was first force-fed, in February 1913, militant suffragettes had been hunger-striking and enduring force-feeding for almost four years. But once she was enlisted, no one could match her commitment. If the prison authorities would mortify her flesh, she would mortify it still more, pacing her cell ceaselessly and forgoing not just food but also water and sleep in order to hasten the physical collapse that would bring her liberty.\n\nBut what was freedom, if women were everywhere in chains? On her release that June day, Pankhurst had her supporters carry her to the entrance to the Strangers’ Gallery of the House of Commons. She lay down on the pavement, announcing that she would continue her hunger and thirst strike there, until such a time as Asquith, the prime minister, agreed to receive a deputation from her East London Federation of Suffragettes (ELFS), the working-class women’s organisation that had broken away (or been cut off) from the militant mothership controlled by Emmeline, Pankhurst’s mother, and her sister Christabel. ‘I feel it is my duty to take this course,’ Pankhurst informed Asquith, ‘and I shall not give way, although it may end in my death.’ On 20 June, the front page of the Woman’s Dreadnought, the weekly newspaper Pankhurst had begun publishing a few months earlier, carried her shawl-clad, Madonna-like photograph under the banner headline ‘IS SHE TO DIE?’\n\nAsquith, no fool, had already decided she would not. He agreed to meet Pankhurst’s deputation within hours of her pavement protest. And so on 20 June, half a dozen female brushmakers and housewives journeyed from Whitechapel to Westminster to tell the prime minister just why the vote would better their lives. In her classic history, The Suffragette Movement (1931), Pankhurst portrayed that deputation as the breakthrough, speak-truth-to-power moment that finally shattered Asquith’s adamantine hostility to the women’s cause. Plenty of historians have subsequently disagreed. After all, Asquith told Pankhurst merely that if suffrage was to be extended it could only be on ‘democratic’ lines – which was what he’d been saying for years. It was exactly the excuse he gave in 1911 when he torpedoed a painfully crafted ‘Conciliation Bill’ which would have added roughly a million women to an electorate of eight million men. But historians have always had trouble competing with the drama and I-was-there authority of Pankhurst’s account.\n\nSylvia Pankhurst seems a heroine for our times. She is, after all, the Pankhurst who joined the family project of building a militant suffrage movement but then – unable to stomach her mother and sister’s separatism and authoritarianism – moved to the East End to run her own socialist and feminist offshoot. Radicalised by the First World War and the Russian Revolution, she steered that organisation towards international communism, but – unhappy with Lenin’s insistence on parliamentarism and party discipline – was in short order expelled from the British Communist Party she had helped to found. She then threw herself into a range of anti-imperialist and anti-fascist causes, and spent the last third of her life writing literally millions of words defending the independence of Ethiopia, the country where she was most honoured and which became her adopted home. In her ability to see connections between forms of oppression, in the integrity of her principles and the breadth of her sympathies, she appears to have been, as her granddaughter Helen Pankhurst put it, ‘what we would now call an intersectional feminist’.\n\nRachel Holmes’s new biography of Pankhurst rightly gives equal weight to the three great causes – feminism, left internationalism and anti-imperialism – to which Pankhurst devoted her life. Almost a thousand pages long, and weighing in at three and a half pounds, it is clearly intended to be the definitive Life. Disappointingly, it isn’t. It is digressive, repetitive, and rife with typographical and factual errors, but that isn’t the main problem. Nor does it matter that Holmes so thoroughly admires Pankhurst’s politics, for biography is often driven by identification: why else would Roy Jenkins choose to write about Asquith, Conor Cruise O’Brien about Edmund Burke, Michael Foot about Aneurin Bevan, E.P. Thompson about William Morris and (ridiculously) Boris Johnson about Winston Churchill? The problem is rather that identification has led Holmes to echo, rather than analyse and explain, Pankhurst’s own version of her story. The first two-thirds of the book are based almost exclusively on Pankhurst’s writings, but without enough attention to the cultural tropes, political imperatives and psychological needs that shaped them. The result is a flattened and surprisingly naive account of a woman whose personal journey was painful and whose happiness in later life hard won.\n\nEstelle Sylvia Pankhurst was born in Manchester in 1882 to Richard Pankhurst, a radical barrister, and Emmeline Goulden, his stylish, much younger wife. A second child, she would always claim that her pretty elder sister, Christabel, got the lion’s share of attention – though, amusingly, the third daughter, Adela, who was sent out of the way to Australia during the suffrage fight, said later that Christabel and Sylvia were equally favoured and she was the one left short (her brothers, both of whom died young, had the best claim to that dubious distinction). Richard and Emmeline were staunch supporters of women’s rights, but the family moved too much – around Manchester and then, for a time, to London – to send the children regularly to school. Instead, much like the Brontë and Alcott broods, the children educated themselves, writing a family paper and listening in when London’s radical intelligentsia (the Russian anarchist Peter Kropotkin, the Communard Louise Michel, the Fabian Annie Besant, and a host of suffragists and socialists) talked politics at their house on Russell Square. Emmeline started a business selling Arts and Crafts soft furnishings and decorations, but it absorbed rather than made money. In 1892, broke but unbowed, the family went back north and the children, finally, went to school.\n\nSylvia flourished more than Christabel, showing a talent for drawing and decoration that won her scholarships to the Manchester School of Art and, later, to the Royal College of Art, as well as a travelling studentship that took her to Italy. But her father’s death in 1898 was a serious blow, causing financial hardship for the whole family and emotional turmoil for Sylvia, who always cast herself as his heir. In her unpublished autobiographical sketches, she recalled his chilling charge – ‘If you do not work for others you will not have been worth the upbringing’ – and the dreadful thing is that she thought it was fine to say this to a child. Unsurprisingly, she would measure her every action against an impossible standard and develop a painful penchant for renunciation.\n\nHer artistic career was one such sacrifice, though for a decade she tried to reconcile social service and art. Emmeline and Christabel founded the Women’s Social and Political Union (WSPU) in Manchester in 1903, but Sylvia was an art student in London from 1904, and it wasn’t until the organisation adopted militancy and moved to London in 1906 that she was drawn deeply into its work. Even so, while she did her share of organising meetings and chalking pavements, her most memorable contributions came from her paints and her pen. In 1907, she travelled through the Black Country, the Potteries and the industrial North sketching women bobbin minders and laundresses, potters and chainmakers. (The evocative pieces recently acquired by Tate Britain are from these tours.) The WSPU’s striking visual iconography and decorations – banners and brooches, decorated tea sets and membership cards – were her work too, as was the movement’s first history, The Suffragette, published in 1911. But the book took time – and so did the two American speaking tours, each of them lasting three months, that she undertook in 1911 and 1912 (and to which Holmes devotes three chapters and 55 interminable pages). By this point, her artistic work had been pushed aside.\n\nWhat replaced it was the ELFS. Loyalty to her father had kept Pankhurst’s socialism strong, but so too did her encounter with the labour movement in America, and her relationship with Keir Hardie, leader of the Independent Labour Party (and her parents’ old friend), which lasted, in some form or other, from 1904 until his death in 1915. Hardie was married and more than twice Pankhurst’s age, nor was she his only extramarital entanglement. But the relationship appears to have been loving, companionate and in some manner sexual. The two wrote regularly, especially during Pankhurst’s American travels. Holmes calls these letters ‘sexually explicit’, but none of the hearts-and-flowers lines she quotes would bring a blush to the cheek of a young person: Hardie calls Sylvia his ‘little sweetheart’; they miss each other’s kisses and encircling arms. Pankhurst’s unpublished fictions are a better guide to their relationship, but these too reveal a sensibility that was ultimately Victorian. In ‘Noah Adamson’, for example, the Hardie figure is described as a man of great ability ‘condemned to great loneliness of spirit through the inability of the woman he married in early youth to rise with him’ – that is, his wife wasn’t good enough for him, poor man, surely the oldest of the excuses women make for male philandering. This is not the world in which Lytton Strachey walks into a drawing room, sees a stain on Vanessa Bell’s skirt, and says: ‘Semen?’\n\nBy the prewar years, Pankhurst was too tied up with her East End movement to spend much time with Hardie anyway. She moved there with two staunch female friends – the American radical Zelie Emerson and the composer Ethel Smyth’s niece Norah (who would use up a good portion of her fortune keeping Pankhurst and her causes afloat). The federation drew on East London’s long-standing radical and sexually egalitarian networks and was self-consciously progressive. In sharp contrast to the WSPU, the ELFS permitted male members, supported local trade union campaigns, and – when militant tactics like window-breaking landed Pankhurst and others in jail – built up a ‘People’s Army’ to protect the federation’s ‘mice’ from the government ‘cat’. This was a boisterous street-based movement – the Woman’s Dreadnought listed dozens of outdoor meetings each week.\n\nIn The Suffragette Movement, Pankhurst told the story of the federation’s break with the WSPU as a family drama – a struggle between herself and Christabel (now running the WSPU from exile in Paris) over the movement’s strategy and their mother’s soul. She disliked the turn away from popular protest towards arson and property damage; she also wanted the WSPU to ally with Labour, as – albeit mostly for strategic reasons – the constitutionalist National Union of Women’s Suffrage Societies was doing. She lost this argument: the WSPU remained non-party and women only, losing supporters as it bombed letterboxes and torched country houses. (Holmes doesn’t tell us this, but it was the National Union and not the locally based ELFS which profited from this decline, growing to six hundred chapters by 1914.) But Pankhurst’s bitterness was personal as much as political, rooted in her resentment of her sister’s hold over their mother – who, she thought, had been seduced away from the socialist commitments she had once shared with her husband by Christabel’s vanity, authoritarianism and social-climbing.\n\nThere is more to be said here, of course; in family quarrels, one side is rarely right. Emmeline did defer to Christabel’s strategic leadership, but she had Sylvia’s photograph on her bedside table in these years, when she and her second daughter (but not Christabel) were in and out of prison. In addition, the WSPU, if hardly democratic, was not exactly an autocracy: individual adherents and organisers exercised much initiative, and militant tactics bubbled up from below. Even Holmes (who follows Sylvia’s line) acknowledges that The Suffragette Movement was written more than fifteen years after these events, when family factionalism was at its worst – after Sylvia had denounced Emmeline’s decision to contest a parliamentary seat for the Conservatives; after Sylvia, heavily pregnant, was turned away from her mother’s door; after Sylvia publicised her delivery of an out-of-wedlock ‘eugenic baby’ to the News of the World; and after Emmeline had denounced Sylvia’s conduct in turn. Emmeline died in 1928, and Christabel moved to America. The two sisters would not speak for almost thirty years.\n\nBy​ the time of that estrangement, Pankhurst had lived through a whirlwind. When the war broke out, the ELFS, like the huge National Union, threw itself into social work. Backed by wealthy subscribers, it opened a clinic, nursery and Montessori school, ran a cost-price restaurant, and set up workshops for women thrown out of work by the early dislocations of the war. But Pankhurst was already at odds with militarism, and Hardie’s outspoken opposition (‘I would rather see my two boys put up against a wall and shot than see them go to the war’) and resulting ostracism aroused her indignation. In a memoir written much later, she recalled that she ‘suffered acutely … having to tell parents whose sons were at the front that the war was wrong and its ideals false’, but that she ‘could not permit such matters to influence me’. By 1916, she was speaking against the war at rallies across the country, including one in April in Trafalgar Square that attracted twenty thousand people.\n\nThis was not a popular position, and the ELFS was bleeding supporters and members. The organisation had an impeccably democratic constitution, but it was in thrall to Pankhurst’s charisma; members uncomfortable with her pacifism left rather than challenge her. In March 1916, it became the Workers’ Suffrage Federation, with the aim of winning votes for all as well as ‘social and economic freedom’; two years later it rebranded again as the Workers Socialist Federation, committed to international socialism and an end to capitalism and parliaments. In 1920, it declared itself the Communist Party (British Section of the Third International). Driving this last transformation, of course, was the Russian Revolution. Pankhurst spoke in support of the Bolsheviks and turned the Workers’ Dreadnought (as it was now called) into probably the most vibrant and ‘advanced’ left-wing paper in Britain. As fearless as its name, the Dreadnought sent a reporter – Patricia Lynch, all of eighteen – to Dublin to cover the Easter Rising; hired Claude McKay (later a star of the Harlem Renaissance) and printed his condemnation of the racist reactions to the presence of France’s black soldiers in the Rhineland; reported in detail on Russian and European developments, and published works by Lenin, Luxemburg, Kollontai, Clara Zetkin and other leading communists. Norah Smyth still paid the bills, but in 1919 Sylvia started a relationship with an exiled Italian anarchist, Silvio Corio, whom she had hired to work on the paper. By this point, she had entirely lost interest in the suffrage finally won by women in 1918 and was intent on social revolution. Which put her squarely in the sights not only of Britain’s security services (busily infiltrating her movement) but also of Lenin, who was impressing on British communists the need for a parliamentary strategy and affiliation with the Labour Party, and whose Left-Wing Communism: An Infantile Disorder (1920) was partly directed against her. In July 1920, Pankhurst smuggled herself into Russia to have it out with him at the Second Comintern Congress.\n\nHolmes takes us through the wild ride of these years, but her reliance on Pankhurst’s own works, especially The Home Front (1932), continues to lead her astray. She considers the workshops set up by the dedicated trade unionist Mary Macarthur to have been ‘sweatshops’ because that’s what Sylvia called them (they paid a minimum wage of ten shillings a week while Pankhurst’s paid eleven, although she later raised the wage to a pound a week, which was also the minimum wage for women in munitions work); she tells us that the separation allowances paid to soldiers’ and sailors’ wives and mothers were at ‘minimal rates’ (perhaps, but they were higher than the wages paid at either of those workshops and cost the wartime governments more than £400 million, or roughly twice the total annual expenditure of prewar central government); she depicts the war years in East London as a time of grinding poverty and starvation, even though full employment, higher wages, those separation allowances and (I’m afraid) the absence of men finally brought about some improvement in the health of working-class women and their children; she tells us that the vote benefited ‘primarily middle-class and aristocratic women’, even though the electorate (female as well as male) in 1918 was majority working-class. Holmes does recover Pankhurst’s astonishingly imaginative plan for ‘social soviets’ – political bodies based in local neighbourhoods that would give unwaged housewives a voice, as workplace soviets would for men – but doesn’t register that all of Pankhurst’s writings, and not just these programmes, were intended to advance her cause. She was a committed socialist activist, after all: it was her job to denounce inequality, combat repression and stoke discontent. But we aren’t going to understand these commitments if Holmes repeats rather than explains them.\n\nPankhurst lost the argument with Lenin, just as she lost the argument with Christabel. Scotland Yard raided the Dreadnought offices soon after her return from Russia; as the publisher of articles ostensibly urging sailors to mutiny, she was charged with sedition. It’s never a good idea for people with strong political convictions to conduct their own defence – at least, not if they want to avoid prison. But Pankhurst wanted to make headlines: she treated the court to a long disquisition on the history of English socialism, the right to civil disobedience, the many sacrifices she had made ‘to pursue her father’s mission of liberating the oppressed from their oppressors’, how often she had risked death, and a good deal more. ‘Why didn’t you make up your mind to keep out of prison instead of insistently breaking into it?’ Bernard Shaw wrote to her, in justified frustration. But Pankhurst served out her six-month sentence as a revolutionary should – in the infirmary, writing poetry on toilet paper that Norah faithfully smuggled out. Her organisation, now only a few hundred strong, was absorbed into the new Communist Party of Great Britain in her absence and she was expelled from it soon afterwards. She and Corio managed to hang on to the Dreadnought, which retained its independence and vitality, covering politics – including Mussolini’s rise in Italy – until 1924.\n\nThen, worn out and hard up, they moved to a cottage in Woodford Green and – of all things – opened a tea room. (Bizarrely, Emmeline and Christabel opened a much tonier and still less profitable tea room on the French Riviera two years later.) Mostly, though, Sylvia tried to make money writing. She outlined an autobiography (‘The Inheritance’) and planned a book about international communism (‘In the Red Twilight’) – these two projects were the ones that, somehow, she could never bring herself to complete. She did, however, publish a monumental study of India in 1926; Delphos, a book about international language, in 1927; Save the Mothers, a plea for a national maternity service, in 1930; and, of course, The Suffragette Movement in 1931. Her son, Richard Keir Pethick Pankhurst, was born in December 1927 (when she was 45), catapulting her into the ranks of us women protesting that their baby scarcely leaves them a minute to work – although, judging by this record, motherhood didn’t hamper her productivity much. She had spent so much of her life without enough love; from now on, Richard would be her constant companion. Perhaps this is too simplistic, but it seems to me that what pulled her head from the clouds and put her feet on the ground was the need to attend less to suffering humanity and more to one small boy.\n\nHere,​ in its final third, Holmes’s book improves dramatically. It’s still baggy and repetitive, but the final three hundred pages are fresher and more engaging than the preceding six hundred, probably because Pankhurst did not write obsessively about her life during these decades, so that Holmes has had to piece the story together from more prosaic sources. With her mother dead, and Christabel far away in America, Pankhurst’s devotion to old family quarrels finally waned. She now had a family of her own, in which her pre-eminence was unchallenged. Corio worked faithfully on the newspaper they produced together from 1936 until 1956 (The New Times and Ethiopia News), but he never seemed to want much credit or occupy much space. Visitors sometimes mistook him for the gardener.\n\n‘My parents were old-style libertarian socialists,’ Pankhurst’s son, Richard, told Holmes – and if this hardly describes their politics in 1919, it was what they became. With royalties from The Suffragette Movement and a few legacies, Pankhurst was finally able to buy a proper brick house in 1933. It was, like every house she lived in, untidy and stuffed with papers (though there was a daily help and a housekeeper, neither named by Holmes), but life became easier, and a generation of internationalists, leftists and anti-imperialists made the trek out to West Dene for bad food and good conversation. Richard grew up knowing African-American intellectuals (W.E.B. Du Bois, Amy Ashwood Garvey) and African nationalists (Kwame Nkrumah, Jomo Kenyatta) as household guests. After a spell at the LSE he became his mother’s collaborator and moved into the field of African history. Corio died in 1954, and two years later Pankhurst moved to Ethiopia. Richard went with her, and his fiancée, Rita Eldon, married him there soon afterwards.\n\nRemarkably, the three lived together amicably in an Italian-built villa supplied by Selassie – Richard teaching at the university, Rita getting its library in order, and Pankhurst writing for a new monthly magazine, the Ethiopia Observer, devoted to raising Western awareness about her adopted country. She had her weaknesses: she uncritically defended Ethiopia’s claim to Eritrea and Somalia; she paid less attention than might be expected to its extreme social inequality; after decades of criticising Britain’s imperial policies, she now voiced anxiety about its declining influence. But she was never pompous and never bored, always up for a new encounter or experience. I like to imagine her in those years, squeezing her cottage-loaf body into her Fiat, going out into the countryside to find another Coptic monastery, another co-operative farm. When she died, very suddenly, in 1960, she was given a huge state funeral. Selassie stood to attention by her coffin throughout the long service.\n\nHolmes presents Pankhurst’s life – as she herself did – as one of utter consistency. I’m not so sure. I am as susceptible as the next feminist to the romance of her story – or at least I was, back in 1982, when as a 22-year-old I spent a month working in her archives at the International Institute of Social History in Amsterdam. (This collection has since been made available online.) I was headed to graduate school and thought she might be a good subject; I was also, probably, on a quest for a historical role model and a usable past. So, I read through the ELFS minute books, tracking the campaigns and totting up the meetings, but found myself drawn particularly to the fragments of autobiography. Several of Pankhurst’s books are heavily autobiographical, but she never wrote a full Life. She tried more than once, sketching opening scenes over and over in the backs of the exercise books in which she drafted her books.\n\nOf these fragments, one made an especially strong impression on me, and in those pre-computer and pre-camera days, I copied out the text in full. (This is the source for a few of the quotations in this review.) It was written in the 1930s, in answer to a question about the decisions that had shaped her life. Pankhurst lists them, but they are renunciations as much as decisions – it is a register of the many things she gave up (her art, her family, her followers, reputation and honour) to do right. Some seven times in eleven pages she insists that she ‘never consulted anyone’ about these choices, following the imperative dictates of her conscience. The proof of their rightness and her righteousness was how much she suffered for her convictions, how fully she embraced what in The Suffragette Movement she called ‘the hallowing influence of sacrifice’.\n\nI came to Amsterdam tracking a fighter for women’s freedom. What I discovered were patterns of subjection I knew all too well. Even though I was raised to serve God rather than humanity, I too was schooled from girlhood in renunciation, taught that the path to glory lay in suffering for the cause. I had long ago said ‘Goodbye to All That’ when I stumbled across Pankhurst’s account, but what she taught me – and thank you, Sylvia – was that you can reject a culture that punishes women for their every claim, but it will keep its grip on you anyway, as you quiver to attention whenever the dog-whistle of sacrifice sounds. ‘I was always convinced that the element of martyrdom provided the highest and keenest incentive to our movement,’ wrote the woman who lay on the pavement outside Parliament, hungering and thirsting for the vote. Quite.\n\nI would like to read a different biography of Sylvia Pankhurst, one that is less hagiographic but more humane. Surely it is possible to acknowledge this remarkable woman’s foresight, determination, convictions and courage without shying away, as Holmes does, from addressing how her culture and upbringing could drive her to assert authority through self-sacrifice, almost as if she believed that whoever suffers the most, wins. I want to believe that Pankhurst finally freed herself from those patterns, because I am tired of movements that love to watch women martyr themselves for the cause. I want a politics that lets us live for ourselves."}, {"url": "https://www.womensrunning.com/events/olympics/olympics-2021-updates-track-and-field/", "page_content": "Heading out the door? Read this article on the new Outside+ app available now on iOS devices for members! Download the app.\n\nOver 10 days in Tokyo, the world’s best track and field athletes finally get to compete for those coveted Olympic medals. A year late, in an empty stadium, amid a pandemic and all the constraints of mitigating the spread of COVID-19, the Games still go on.\n\nThe Olympic Games offer their own brand of dramatics in “normal” times—and 2021 is anything but “normal.” The heat and humidity in Japan will add to the challenge and perhaps level a few playing fields. Here on this blog we’ll update you throughout the track and field competition from July 29–August 8 on results, news, inspiring stories, and memorable moments.\n\n2021 Olympic Results Today, at a Glance:\n\nSaturday, August 7\n\nFriday, August 6\n\nThursday, August 5\n\nWednesday, August 4\n\nTuesday, August 3\n\nMonday, August 2\n\nSunday, August 1\n\nSaturday, July 31\n\nFriday, July 30\n\nThursday, July 29\n\nRACE REPORTS:\n\nGabby Thomas Anchors 4x100m Relay to Silver Medal Finish\n\nTOKYO, JAPAN – AUGUST 06: Javianne Oliver, Teahna Daniels, Jenna Prandini and Gabrielle Thomas of Team United States celebrate winning the silver medal in the Women’s 4 x 100m Relay Final on day fourteen of the Tokyo 2020 Olympic Games at Olympic Stadium on August 06, 2021 in Tokyo, Japan. (Photo by Michael Steele/Getty Images)\n\nTeam USA, previous champs in the women’s 4x100m relay, finished second behind Jamaica in the final on Friday in Tokyo.\n\nJamaica clinched gold in 41.02, a national record; they were behind the U.S. (world and Olympic record holders with 40.82) the last two Olympics but started off and stayed strong during the relay. A dominant sprinting team of Briana Williams, Elaine Thompson-Herah (her third gold these Games, after the 100 and 200 meters), Shelly-Ann Fraser-Pryce, and Shericka Jackson delivered for Jamaica.\n\n“For two years we have been unimpressive, you know, so to get it back today is special,” Fraser-Pryce said after the race. Jamaica won gold in the event at Athens 2004.\n\nTeam USA, with Javianne Oliver, Teahna Daniels, Jenna Prandini, and Gabby Thomas, got a big push from Prandini in the third leg that made up some distance, but not enough to overtake the Jamaicans. 200m bronze medalist Thomas anchored for a strong finish, crossing the finish line in 41.45 behind Jackson.\n\nThere was a brief concern that a flag thrown would disqualify the Jamaicans due to a lane violation during one of the passes, but no such luck for the silver medalists; the Netherlands DNF’d.\n\nAfter setting a national record and coming in second in the semis, Great Britain secured the bronze in 41.88; their men’s team snagged the silver for the same event.\n\n“People always [overlook] the British teams, but in 2016 we put our names on the map when we got a bronze medal. Then the boys went out and got a world championship gold medal,” said Asha Philip of Great Britain. “We are competitors. The rest of the world need to be scared of us, and are. That’s a great thing. People need to watch out for us, we have more to come.”\n\nYou can view the entire list of results here. —Jessica Campbell-Salley\n\nRACE REPORTS:\n\nKatie Nageotte Reaches New Heights, Wins Pole Vault Gold\n\nTOKYO, JAPAN – AUGUST 05: Katie Nageotte of Team USA reacts as she competes in the Women’s Pole Vault Final on day thirteen of the Tokyo 2020 Olympic Games at Olympic Stadium on August 05, 2021 in Tokyo, Japan. (Photo by Cameron Spencer/Getty Images)\n\nAfter a rough start—clearing the lowest height of 4.50 only on her third attempt, and the second height of 4.70 on her second attempt—it wasn’t looking like Team USA’s Katie Nageotte would be in contention for a medal in the pole vault finals in Tokyo on Thursday.\n\n2019 pole vault world champion Anzhelika Sidorova of the Russian Olympic Committee, on the other hand, had breezed through the competition. Sidorova held the gold medal-position for four rounds, and looked to be the uncontested winner.\n\nBut after five rounds, and in her second attempt, Nageotte cleared 4.90 to secure the gold-medal position, leaving Anzhelika to answer. Anzhelika bailed on her final attempt at 4.95, having to settle for silver.\n\nHolly Bradshaw of Great Britain finished third to win the bronze.\n\nNageotte didn’t stop at the win. After running into the stands to celebrate with her coach, she decided not to grab the flag and start her victory lap, but instead to attempt a celebratory jump at 5.01. Ultimately it proved to be too much with all the emotions swirling, and she bailed during her run as she started to cry in joy.\n\nThe 2019 Pan American Games silver medalist, this is Nageotte’s first gold on the international stage. “It’s fun to look back and see how far I’ve come,” she said in an Instagram video two days before this competition. (The video, which goes into how she got her and what the Olympics mean to her, is worth a watch.)\n\n\n\nOh, and hey side note: Props to Team USA’s Heather MacLean—those braids were on point. —Jen Ator\n\nhttps://twitter.com/heathair31/status/1423253477539520517\n\nTeam USA Will Defend Their Olympic Gold in Women’s 4x400m Final\n\nJamaica’s Janieve Russell (L) and USA’s Kendall Ellis compete in the women’s 4x400m relay heats during the Tokyo 2020 Olympic Games at the Olympic Stadium in Tokyo on August 5, 2021. (Photo by Jewel SAMAD / AFP) (Photo by JEWEL SAMAD/AFP via Getty Images)\n\nPoland gave a glimpse of what a strong quartet they are in the women’s 4×400-meter round 1 race in Tokyo on Wednesday. A fantastic team and reputation, they proved they are ones to watch in the final.\n\nPoland, Germany, and Switzerland fought for the top spot in the first lap. Germany hightailed down the back straight of the second lap to get to the front, with Poland and France catching and passing them in the final meters. Poland kept a healthy lead in lap three, handing off to Justyna Swiety-Ersetic who finished with a nice gap to win the heat in 3:23.10\n\nThe Cubans laid a late charge to go from fifth to finish ahead of Germany in second in a season’s best of 3:24.08, Germany in third (3:24.77).\n\nIn the second heat, Team USA, who won gold in the event at the 2016 Rio Olympics, made it look smooth and easy on their campaign to get back to the finals. Kailyn Whitney led things off to get in good position on the first lap. Jamaica got an edge on Wadeline Jonathas in lap two, but she fought to get around the shoulder in the final straight away to earn back the top spot. Kendall Ellis got off to a quick start in lap three with Jamaica fighting on her heels the whole time. But Lynna Irby pulled away in the final lap to win the heat in 3:21.86.\n\nJamaica finished second in a season’s best of 3:21.95. Canada and Great Britain were neck and neck in the race for third, when with 180m to go, Netherland’s Femke Bol came out of nowhere to nearly beat them. Ultimately, Great Britain squeezed out the third automatic qualifying spot in 3:23.99.\n\nNetherlands finished fourth in a new national record of 3:24.01 and will advance to the final on time, along with Canada, who placed fifth in the second heat (3:24.01)\n\nA number of big teams did not have the days they expected. Team Australia finished seventh in 3:30.61, while Bahamas did not finish the race, which means 2016 400m gold medalist Shaune Miller-Uibo will not have an opportunity to run for an additional medal here in Tokyo. (She is running in the women’s 400m individual final.\n\nYou can watch the final on Saturday, August 7 at 8:30 a.m. EDT. —Jen Ator\n\n\n\nIn the 4 x 100-Meter Relay, Team USA Easily Advances to the Final\n\nTOKYO, JAPAN – AUGUST 05: Dina Asher-Smith of Team Great Britain, center, competes in round one of the Women’s 4 x 100m Relay heats on day thirteen of the Tokyo 2020 Olympic Games at Olympic Stadium on August 05, 2021 in Tokyo, Japan. (Photo by Michael Steele/Getty Images)\n\nTeam USA comes into the Tokyo Games as the reigning champ in the 4 x 100-meter relay, hoping to bring home its 12th gold medal in the event.\n\nFor a chance to defend that title, the team needed to place in the top three of its heat or get one of the next two fastest times. After three smooth passes, anchor Aleia Hobbs took the lead alongside Great Britain’s Daryll Neita. Neita quickly outpaced Hobbs and USA took second place in 41.90 behind Great Britain’s 41.55. GB’s team included Dina Asher-Smith, who had pulled out the 200-meter competition with a hamstring injury. The Jamaican relay team also auto-qualified after coming in third (42.15).\n\nAlso running on the United States’s relay was Javianne Oliver, Teahna Daniels, and English Gardner. Daniels and Oliver competed earlier in the Games in the 100 meters—an event that the Jamaicans swept.\n\nYou might recall the last time Team USA was in a qualifying round for the 4 x 100-meter relay at the Olympics. It was the Rio Games in 2016. Who could forget the dropped pass between Allyson Felix and English Gardner in the second and third positions after Felix’s arm was bumped? Everyone thought they were out. But after appealing, they ran a surreal solo time trial on an empty track, made it to the final, and ultimately won gold.\n\nQualifying drama-free, this year’s team has its eyes set on a competitive final round. “We had good hand-offs and stuff, but there’s always room for improvement,” Daniels told ​​NBC’s Lewis Johnson after the race.\n\nYou can watch the relay final at 9:30 a.m. Eastern on Friday August 6. —Malissa Rodenburg\n\nRACE REPORT: Courtney Frerichs Breaks Olympic Steeplechase Wide Open to Take Silver; Peruth Chemutai Wins Gold\n\nOne Last Time: Allyson Felix Advances to Women’s 400m Final; Quanera Hayes Through on Time\n\nTOKYO, JAPAN – AUGUST 04: Allyson Felix of Team United States competes in the Women’s 400m Semi-Final on day twelve of the Tokyo 2020 Olympic Games at Olympic Stadium on August 04, 2021 in Tokyo, Japan. (Photo by Patrick Smith/Getty Images)\n\nIt was a very fast first heat, with the top four inside 50 seconds. And that would set the tone for the rest of the women’s 400m semifinals on Wednesday.\n\nDominican Republic’s Marileidy Paulino resulted took the top spot, setting a new national record of 49.38. Candice McLeod of Jamaica was second in 49.51.\n\nTeam USA’s Quanera Hayes, who went out well to eat up stagger to start, tied up badly in the final 80 meters and ultimately may have gone out too hard, finishing fourth 49.81. She made it through to the final on time.\n\nRunning smooth the whole way, Shaunae Miller-Uibo of Bahamas came off the turn in good position in heat two to take the win in 49.60. Jodie Williams of Great Britain ran a massive personal best to break 50 and earn the second automatic qualifying spot in 49.97.\n\nFirst-time Olympian Wadeline Jonathas of Team USA moved quickly in the final straight away of heat 2 to make up some distance, but ultimately finished fourth in 50.51 and will not advance to the finals.\n\nAnd in heat 3, Jamaica’s Stephanie Ann McPherson ran a terrific race to win in a personal best of 49.34. Allyson Felix, looking smooth and totally in control, took second in a season’s best of 48.89 to qualify for one last individual final at her fifth and final Olympic Games. Sada Williams of Barbados was third in 50.11, a new national record.\n\n“It was a fight to get here. When I was younger, I never really thought about making a final,” Allyson Felix said after the race. “This time, you get older and it seems harder. You just have to get smarter and figure it out. It is a very humbling experience but very rewarding to see the progress.”\n\nThis moment was never a guarantee for Felix. There were a lot of moments when she was doubtful that she would be able to feel like herself again, she said. “I am slowly getting there and, for me, it is just one race at a time. I will re-focus, regroup and get back out there and keep fighting.”\n\nYou can watch the final at 8:35 a.m. EDT on Friday, August 4. —Jen Ator\n\n\n\nKipyegon and Hassan Dominate in the Women’s 1500m Semifinal; Elle Purrier St. Pierre and Cory McGee Advance\n\nKenya’s Faith Kipyegon (R) wins ahead of Ethiopia’s Freweyni Gebreezibeher in the women’s 1500m semi-finals during the Tokyo 2020 Olympic Games at the Olympic Stadium in Tokyo on August 4, 2021. (Photo by Jewel SAMAD / AFP) (Photo by JEWEL SAMAD/AFP via Getty Images)\n\nHeat one was loaded with talented women in the women’s 1500-meter semifinal on Wednesday, but only five of them would automatically continue on to the final.\n\nThey went out fast from the start, with Gabriela Debues-Stafford of Canada taking an early lead in the first lap, Japan’s Nozomi Tanaka right behind her, and American Elle Purrier St. Pierre in third. Tanaka then briefly led in the second lap with Faith Kipyegon, the defending Olympic champion, right on her shoulder and Debues-Stafford staying tight in third.\n\nFrom there, Kipyegon started to dominate. One of the favorites to win gold, Kipyegon won the heat in 3:56.80. Freweyni Gebreezibher of Ethiopia was second (5:47.54) and Debues-Stafford third (3:58.28). Jessica Hull of Australia was fourth (3:58.81) and Tanaka in fifth (3:59.19) rounded out the automatic qualifiers.\n\n“Coming here is a bit emotional for me, because in this Olympic cycle I gave birth to my daughter,” Kipyegon said after the race. “I know she is watching me and hoping for the best from mummy.”\n\nHolding a spot in the middle of the pack, Kenya’s Winny Chebet fell, tripping up Cory McGee directly behind her and causing them both to hit the track hard before recovering to finish the race, McGee in 11th (4:10.39) and Chebet in last (4:11.62). McGee was advanced to the next round by the referee.\n\nPurrier St. Pierre finished sixth in 4:01.00 and made it through to the final on time.\n\nIn heat two, Australia’s Linden Hall took a quick, steadfast lead for most of the race, with Winnie Nanyondo of Uganda and Laura Muir of Great Britain holding in the top three.\n\nThe Netherland’s Sifan Hassan resumed her usual back-of-the-pack spot until the final lap when she mounted a strong effort to win the heat in 4:00.23. Muir took second (4:00.73), with Hall holding on for third (4:01.37). Nanyondo, fourth in 4:01.64, celebrated after making it through to the final, with Marta Perez taking the final automatic spot in a personal best of 4:01.69.\n\n“I wanted to sit back for at least a lap but ended up at the front of the line. I guess that excitement and adrenaline of an Olympic semifinal will do that,” Hall said after the competition. “It worked out. The whole time I was just thinking, you need to stay in the top five. My little race motto was just, ‘top five, stay alive’. [I’m] still alive, still kicking.”\n\nHassan, who is going for a never-been-done-before three distance events at the Tokyo Olympics, will be racing six times in nine days. So far, she’s already won Olympic gold in the women’s 5,000m. (Here’s the rest of the schedule of what she’ll need to run, plus who her biggest competitors are.)\n\n“I was so tired from all the emotions, the medal [gold in the women’s 5000m on Monday] and also the fall [in the first round of the 1500m on the same day],” Hassan said after the race. “The body is so tired and the semifinals are always hard. Everybody does their best to get to the final. But I felt better every lap and am so grateful. I’m so lucky.”\n\nTeam USA’s Heather MacLean finished 12th in 4:05.33. Edinah Jebitok of Kenya, who had advanced to the semis by the referee after being involved in a fall during the third heat of round one, finished 13th (4:05.56).\n\nYou can watch the final at 8:50 a.m. EDT on Friday, August 6. —Jen Ator\n\nRACE REPORTS:\n\nTeam USA’s Brittney Reese Takes Silver in the Long Jump After a Close Final\n\nUSA’s Brittney Reese reacts as she competes in the women’s long jump final during the Tokyo 2020 Olympic Games at the Olympic Stadium in Tokyo on August 3, 2021. (Photo by Andrej ISAKOVIC / AFP) (Photo by ANDREJ ISAKOVIC/AFP via Getty Images)\n\nOn Tuesday morning, track and field in Tokyo concluded with a very close and competitive long jump final.\n\nAll eyes were on America’s veteran long jumper Brittney Reese.\n\nFor most of the rounds Reese–who has won an Olympic gold and silver previously–and Nigeria’s Ese Brume were tied at a jump of 6.97m. In the case of a tie, the win goes to the second best time and it was there the two battled it out.\n\nBut in a shocking finish it was Germany’s Malaika Mihambo who jumped a surprise 7.00m in her final jump and overtook them both. Ultimately, Reese’s second-best of 6.95m won her silver in her fourth Olympic showing, while Brume took bronze with her second-best of 6.90m.\n\nFan favorite and first-time Olympian Tara Davis finished sixth. She struggled with her take off throughout the rounds, but kept her energy high and finished with an impressive best of 6.84m. And in case you were wondering: Yes, Davis, who recently turned pro, came out rocking her signature cowboy hat. — Malissa Rodenburg\n\n\n\nAllyson Felix Begins Fifth and Final Olympics, Advances to the 400 Meter Semifinal\n\nTOKYO, JAPAN – AUGUST 03: Allyson Felix of Team United States reacts after finishing first in round one of the Women’s 400m heats on day eleven of the Tokyo 2020 Olympic Games at Olympic Stadium on August 03, 2021 in Tokyo, Japan. (Photo by Michael Steele/Getty Images)\n\nAllyson Felix started her campaign at her fifth and final Olympics on Tuesday in Japan, placing first in her heat (50.84) in the first round of the 400 meters.\n\nThe first 3 in each of six heats and the next 6 fastest advanced to the semifinals, which are at 6:30 a.m. Eastern on Wednesday, August 4.\n\nFelix cruised into the finish with no pressure, ahead of Roneisha McGregor of Jamaica (51.14) and Lada Vondrova from the Czech Republic (51.14). But Felix isn’t quite ready to talk about the final farewell—she said after the race that she’s ready to “bump it up” in the semifinal.\n\n“I love the sport, and it has been so much in my life,” she said. “Knowing that this is my last time around means a lot to me.”\n\nTeam USA member Quanera Hayes also qualified for the next round, placing second in her race in 51.07, behind Jodie Williams of Great Britain (50.99). And in the sixth heat, American Wadeline Jonathas earned her spot in the semifinal with a second-place finish in 50.93, behind Marileidy Paulino of the Dominican Republic, who had the fastest time of the session, 50.06.\n\nIt was an undramatic session of the 400 meters, void of surprises or drama. The favorites all advanced, including Shaunae Miller-Uibo of the Bahamas (first in the first heat in 50.50), the defending Olympic champion who nipped Felix in 2016 for the gold medal by diving for the finish line.\n\nThe final is at 8:35 a.m. Eastern on Friday, August 6. —Erin Strout\n\nRACE REPORT: Sifan Hassan Wins Her First Olympic Gold in the Tokyo Olympics 5,000 Meters\n\nMaking it Look Easy: Muhammad and McLaughlin Cruise Through to Finals; Anna Cockrell Makes Her First Olympic Finals\n\nTOKYO, JAPAN – AUGUST 02: Dalilah Muhammad of Team United States competes in the Women’s 400 metres hurdles semi finals on day ten of the Tokyo 2020 Olympic Games at Olympic Stadium on August 02, 2021 in Tokyo, Japan. (Photo by Cameron Spencer/Getty Images)\n\nAs rain started coming down hard in Tokyo on Monday, women’s discuss and pole vault competitions were suspended, while the women’s 400-meter hurdles semifinal soldiered on.\n\n“I guess there’s not a threat to your life, running on the track” one of the commentators said as the women in heat 1 began to line up. (Uh…I guess?)\n\nThings started with a blatant false start by Amalie Iuel of Norway. After speaking with officials, she went back to the starting block, choosing to still run even though she was disqualified.\n\nLooking completely unfettered, Dalilah Muhammad pulled away strong and early in the first heat to make no question about her earning a spot in the final, easing up towards the line to win in 53.30. Janieve Russell of Jamaica clinched the second automatic qualifying spot, finishing second in 54.10.\n\nIn heat 2, world record holder Sydney McLaughlin looked fiercely focused, took an early lead to cruise to a win in 53.03. Gianna Woodruff of Panama finished second in a personal best of 54.22, a new national record.\n\nAs the rain intensified, Femke Bol of Netherlands easily won the final heat with a time of 53.91. Anna Cockrell pushed through the line to edge out Ukraine’s Viktoriya Tkachuk to finish second in 54.17 and earn an automatic spot in her first Olympic finals.\n\nYou can watch the finals at 10:30 p.m. EDT on Tuesday, August 3. —Jen Ator\n\n\n\nGabby Thomas Advances on Time While Jamaicans Powerhouses Flex in 200-Meter Semifinal\n\nTOKYO, JAPAN – AUGUST 02: Gabrielle Thomas of Team USA looks on after competing in the Women’s 200 metres Semi Final on day ten of the Tokyo 2020 Olympic Games at Olympic Stadium on August 02, 2021 in Tokyo, Japan. (Photo by Matthias Hangst/Getty Images)\n\nOn Monday in Japan, Jamaica’s Shelly-Ann Fraser-Pryce ran uncontested to win the first heat with a time of 22.13 seconds, looking barely out of breath as she finished. Beatrice Masilingi of Namibia finished second in 22.40, setting a new world U20 record. Anthonique Strachan of Bahamas, and Riley Day of Australia finished third in 22.56, a season’s best for both athletes.\n\n“I have never run two 200m in a day after winning three rounds of the 100m so this is definitely different,” Fraser-Pryce said after the race. “It takes a lot of commitment and work, but I am glad I made it to the finals, and I am feeling good and looking forward to it.”\n\nTeam USA’s Jenna Prandini faded a bit in the last 70 meters, finishing fifth in 22.57. She will not advance to the finals. Netherland’s Dafne Schippers, fourth-fastest woman in history, struggling with back issues for the last two seasons finished sixth (23.03).\n\nIn heat 2, Jamaica’s Elaine Thompson-Herah, who won gold in the women’s 100-meter in Tokyo, came through strong and fast from the start to win in a personal best of 21.66.\n\nNamibia’s Christine Mboma outstrided Team USA’s Gabby Thomas to finish second in 21.97, with Thomas clocking 22.01. That time would be enough to get Thomas through to the final in the first of two time qualifying spots.\n\nIn the final heat, the ever-consistent Marie-Josee Ta Lou of Côte d’Ivoire won in a new season best of 22.11, with Bahamas’ Shaunae Miller-Uibo taking the second automatic qualifier spot with a time of 22.14.\n\nIn third it was Mujinga Kambundji of Switzerland, who set a new national record of 22.26. She joins Thomas as the second non-automatic qualifier to advance to the finals.\n\nIn her first Olympics, Team USA’s Anavia Battle finished sixth in 23.02.\n\nFraser-Pryce knows it won’t be an easy win for anyone in the finals, herself included: “The ladies are really bringing it this year, and you have to be ready and prepared for anything. I just have to go out and run the best race that I can, run and hope that I put myself in a very good position to stand on the podium.”\n\nYou can watch the finals at 8:50 am Eastern on Tuesday, August 3. —Jen Ator\n\nGabby Thomas, Jenna Prandini, and Anavia Battle Advance to the 200-Meter Semifinal\n\nTOKYO, JAPAN – AUGUST 02: Gabrielle Thomas of Team United States reacts after competing in round one of the Women’s 200m heats on day ten of the Tokyo 2020 Olympic Games at Olympic Stadium on August 02, 2021 in Tokyo, Japan. (Photo by Ryan Pierse/Getty Images)\n\nIn the first round of the women’s 200 meters on Monday in Japan all three Americans moved on to the semifinals, each looking like they still had plenty left to give in the next two rounds. The top three in each of the seven heats, plus the next three fastest times moved on in the competition.\n\nIn her heat, Team USA’s Anavia Battle cruised near the lead along with Switzerland’s Sui Kambudji before coming in second in 22.26. Gabby Thomas (22.20) looked smooth and controlled, almost instantly making up the stagger from the inside lane, until Nigeria’s Christine Mboma took over to win.\n\nIn a post-race interview on the broadcast, Thomas said even though the stadium is empty due to COVID-19 restrictions, she could still sense the energy of her first Olympics. She also clearly stated her goal for the Games: “I want a gold medal,” she said. “I’m excited to go for it.”\n\nAfter a fast start, the last American of the night, Jenna Prandini cruised to win her heat in a smooth 22.56. Jamaica’s Shelly Ann Fraser-Pryce was in control of her heat, winning easily in 22.22.\n\nNotably missing was Great Britain’s Dina Asher-Smith who withdrew due to a hamstring injury.\n\nThe semifinals are at 6:25 a.m. Eastern on Monday. —Malissa Rodenburg\n\n\n\nTeam USA is On to the 1500-Meter Semifinal; Hassan Tumbles Through Her Triple\n\nTOKYO, JAPAN – AUGUST 02: Sifan Hassan of Team Netherlands, Jessica Hull of Team Australia and Elinor Purrier St. Pierre of Team United States compete in round one of the Women’s 1500m heats on day ten of the Tokyo 2020 Olympic Games at Olympic Stadium on August 02, 2021 in Tokyo, Japan. (Photo by Matthias Hangst/Getty Images)\n\nSifan Hassan is racing three distance events at the Tokyo Olympics. If that wasn’t difficult enough, she fell in the first round of the 1500 meters with a little less than 400 meters to go. She got up, kept racing, and—Hassan being Hassan—she won her heat in 4:05.17.\n\nIn less than 12 hours, Hassan, who represents the Netherlands, will race the 5,000-meter final. In all, she’ll race six times in nine days.\n\nIn the same heat, Team USA’s Elle Purrier St. Pierre finished comfortably in third, just behind Australia’s Jessica Hull (4:05.28).\n\nEdinah Jebitok of Kenya was also tangled in Hassan’s fall and unfortunately was not able to recover in the same fashion. She was advanced to the next round by the referee.\n\nGabriela Debues-Stafford of Canada won the first heat in 4:03.70, with Laura Muir of Great Britain right behind in 4:03.89. Winny Chebet of Kenya was third in 4:03.93. Cory McGee finished eighth in 4:05.15, which was fast enough to advance to the next round on time.\n\n“I didn’t know what the time was and I thought, ‘Oh, this is feeling like a little bit of effort.’ I wasn’t expecting it to be that fast,” Debues-Stafford said. “I felt really good, and to do it from the front and to control it the way I did, I’m very pleased with that.”\n\nFaith Kipyegon, the defending Olympic champion who earlier this month ran 3:51.07, won heat three in 4:01.40. Winnie Nanyondo was second (4:02.24) and Australia’s Linden Hall was third (4:02.27). Heather MacLean finished the third heat in fifth place (4:02.40), earning a spot in the semifinal as well.\n\nYou can watch the the 1500-meter semifinal at 6 a.m. on August 4 and the final at 8:50 a.m. on August 6. —Erin Strout\n\nRaven Saunders Protests on the Podium\n\nSecond-placed USA’s Raven Saunders gestures on the podium with her silver medal after competing the women’s shot put event during the Tokyo 2020 Olympic Games at the Olympic Stadium in Tokyo on August 1, 2021. (Photo by INA FASSBENDER/AFP via Getty Images)\n\nAfter receiving her silver medal, Raven Saunders briefly held her arms in an ‘X’ above her head.\n\nSaunders has already drawn attention for her purple and green hair, Joker and Incredible Hulk masks, twerking after her throw, and, of course, her 19.79 meter toss that won her second place in the women’s shot put finals.\n\nHer advocacy and voice for several marginalized communities has also put her in the spotlight.\n\nhttps://twitter.com/OnHerTurf/status/1421680405485346817?s=20\n\n“We keep pushing. We keep fighting,” said Saunders in an interview with NBC after competition. “I’m not just fighting for myself, I’m fighting for a lot more people.”\n\nShe also gave a shout out to all LGBTQ people, anyone struggling with their mental health, and the Black community. “We can do it. We can do it. If you keep pushing, keep grinding, keep looking forward.”\n\nAccording to the Associated Press, when asked what the ‘X’ meant, Saunders responded: “It’s the intersection of where all people who are oppressed meet.” —Malissa Rodenburg\n\nRELATED: Weighing the Mental Health Impact on Athlete Activists\n\n\n\nCrashes and False Starts Mark the 100-Meter Hurdle Semifinal\n\nTOKYO, JAPAN – AUGUST 01: Kendra Harrison of Team United States reacts after competing in the Women’s 100m Hurdles Semi-Final on day nine of the Tokyo 2020 Olympic Games at Olympic Stadium on August 01, 2021 in Tokyo, Japan. (Photo by Patrick Smith/Getty Images)\n\nKeni Harrison and Gabi Cunningham made it through a somewhat dramatic—and quick—semifinal round of the 100-meter hurdles on Sunday night in Tokyo.\n\nIn the first heat, American Christina Clemons did not advance. She ran from lane six and was distracted by the commotion around her as other competitors fell. She called it a “rookie mistake.”\n\n“I got a little distracted, I won’t lie,” she said, later adding, “it’s so dangerous, especially if somebody next to you falls or does anything that is impeding your lane.”\n\nIn Harrison’s heat, it took four starts before the race got underway. Though nobody was ultimately disqualified, the field was called back with false starts several times. Harrison, the world record holder (12.20), finished second in 12.51.\n\n“It’s just something that you have to just get over. At the 2015 world champs I false started so I told myself, ’I am never going to false start again and I’m going to sit in those blocks and make sure that when the gun goes off, I go off,’” Harrison said. “Every time they blow the gun back again, I’m like, ‘Did it just happen?’ I don’t think any of us were really prepared for it. It’s kind of quiet. It’s not as loud as a normal gun.”\n\nCunningham got through to the final in a fast heat, finishing fourth in a personal best of 12.67. Puerto Rico’s Jasmine Camacho-Quinn set an Olympic record in the race in 12.26.\n\n“Honestly, the main thing was just to make it through. Five years ago I didn’t make it through so I just wanted to have the speed to get to the final,” Camacho-Quinn said. “I just take it step by step. Don’t overthink it, don’t panic and everything will happen. That’s what you just saw right there.”\n\nThe 100-meter hurdles final is at 10:50 p.m. Eastern on Sunday. Take a look at the full list of qualifiers here.—Erin Strout\n\nTeam USA Had a Field Day\n\nRaven Saunders (@GiveMe1Shot) wins a silver medal in the women’s shot put and twerks in celebration after her final toss. Get it! #TokyoOlympics pic.twitter.com/CTX6O7sZlJ — Chris Chavez (@ChrisChavez) August 1, 2021\n\nThat about sums it up. It was a lot of fun for the field evens today in Tokyo, with Raven Saunders winning her first Olympic medal in the women’s shot put final, taking silver.\n\nMeanwhile, in the women’s hammer throw, all three women from Team USA—Brooke Anderson (74.00m), Gwen Berry (73.19m), and Deanna Price (72.55m)—advance to the finals as they look to get America’s first Olympic medal in the event.\n\nAnd in the long jump qualifiers, first-time Olympian Tara Davis came out strong, hitting 6.85m on her first jump to score above the qualifier of 6.75m and make it through to the final.\n\nFour-time Olympian Brittany Reese went 6.52m on her first attempt, before hitting 6.86 on her second jump to also advance.\n\n“I’m excited. It’s the last one, so on Tuesday, I’m going all out,” Reese told NBC after the competition. “And as we say at home: ‘Last one, best one.’” —Jen Ator\n\nSifan Hassan Will Attempt the Triple\n\nSifan Hassan confirmed through her agency that she has decided to include the 1500 meters in her Tokyo Olympics schedule. The 2019 double world champion, who won the 1500 meters and 10,000 meters, will showcase her range again at the Tokyo Olympic Games—this time in a historic triple attempt.\n\n“For me, it is crucial to follow my heart,” Hassan said, in a written statement. “Doing that is far more important than gold medals. That keeps me motivated and it keeps me enjoying this beautiful sport.”\n\nHassan comfortably made it through the first round of the 5,000-meter semifinals. The first round of the women’s 1500 will be broadcast on Sunday, August 1 at 8:35 p.m. Eastern. —Jen Ator\n\nRELATED: Tokyo Olympics: Women’s 1500m Preview & Predictions\n\n\n\nCoburn, Frerichs, and Constien Advance to the Steeplechase Final\n\nTOKYO, JAPAN – AUGUST 01: Emma Coburn of Team United States competes in round one of the Women’s 3000m Steeplechase heats on day nine of the Tokyo 2020 Olympic Games at Olympic Stadium on August 01, 2021 in Tokyo, Japan. (Photo by Patrick Smith/Getty Images)\n\nWho doesn’t love a boring, drama-free first round of the 3,000-meter steeplechase? So much that could go wrong, didn’t. Team USA’s Emma Coburn, Courtney Frerichs, and Val Constien all qualified for the final during three heats on Sunday morning in Japan.\n\nCoburn, now a three-time Olympian, was third in her heat in 9:16.91—Winfred Mutile Yavi of Bahrain was first (9:10.80) and Perth Chemutai of Uganda was second (9:12.72).\n\nWith about 600 meters to go Coburn was assured an auto-qualifier, securely in third place, so she eased off the pace to conserve her energy for the final. It was about 100 degrees on the track on Sunday, but it didn’t seem to bother the 2017 world champion and 2016 Olympic bronze medalist, who noted that half the track was in the shade.\n\nFrerichs, the American record holder and 2017 silver medalist, also advanced with ease, taking first in her race in 9:19.34. She stayed in a lead pack until 800 meters to go and then decided to take charge, surging ahead. Nobody cared to go with her. It was a smart strategy to stay out of trouble and eliminate some risk of falling. Gesa Felicitous Krause of Germany was second in 9:19:62 and world record holder Beatrice Chepkoech was third in 9:19.82.\n\nGrowing up in Missouri has prepared Frerichs for the kind of conditions she’s racing in, she said.\n\n“I’m relying on my roots right now,” she said on the broadcast, adding, “I’m feeling really, really awesome.”\n\nFirst-time Olympian Val Constien lined up with some fierce-looking shades and qualified for the final by way of her time: 9:24.31. She was fourth in the final heat of the event, behind Hyvin Kiyeng of Kenya (9:23.17), Marusa Mismas-Zrimsek of Slovenia (9:23.36), and Mekides Abebe of Ethiopia (9:23.95).\n\nShe said in her post-race interview that she’s motivated to show others who might dare to dream of becoming an Olympian that they can do so without a shoe contract. Constien works a full-time job.\n\n“I’ve been working really hard for a really long time,” she said.\n\nThe final is at 7 a.m. Eastern on August 4. —Erin Strout\n\nHistory Made: Poland Takes Gold in First-Ever Olympic Mixed Relay\n\nPoland pulls off a major upset to win gold in the inaugural Olympic mixed 4×400-relay in 3:09.87.\n\nDominican Republic, who carried a big lead for most of the race, took silver in 3:10.21.\n\nAfter appealing their disqualification in Round 1, Team USA’s Trevor Stewart, Kendall Ellis, Kaylin Whitney, and Vernon Norwood held on to win bronze in 3:10.22.\n\n\n\nAjee’ Wilson is Out of 800-Meter Final, But Mu and Rogers Advance\n\nTOKYO, JAPAN – JULY 31: Habitam Alemu of Team Ethiopia and Athing Mu of Team United States lead their Women’s 800m Semi-Final field on day eight of the Tokyo 2020 Olympic Games at Olympic Stadium on July 31, 2021 in Tokyo, Japan. (Photo by David Ramos/Getty Images)\n\nIt has been more than 50 years since an American woman won the Olympic 800 meter, and more than 30 since a medal of any color was won. But they are one step closer after the women’s 800-meter semifinals as Athing Mu and Raevyn Rogers advance to the finals.\n\n[Click here to catch up on the Round 1 results.]\n\nIn heat 1, Ajee’ Wilson fought for positioning in the first lap to maintain a top three position, but fell back from the leaders in the final straight away to finish fourth in 2:00.79. Jamaica’s Natoya Goule took first in 1:59.57, with Jemma Reekie of Great Britain in second (1:59.77) to automatically qualify for the final.\n\nGotta say I’ve been super impressed with @AjeeW this year. A new crop came up and she had to change things up. Went from leading to kicking herself onto the Tokyo team and the semi over the last 100. She never quit. Keep going Ajee, you’re an inspiration! https://t.co/ujNvloQegP — Kara Goucher (@karagoucher) July 31, 2021\n\nYoungest in the field by five years, Athing Mu took it out quickly to lead the pack, clocking a 58-second first lap and winning comfortably in 1:58.07. In second, Habitam Alemu of Ethiopia (1:58.40) also advanced.\n\n“I wanted to make sure I secured my spot without any question about it,” Mu told NBC after the race.\n\nIn the final heat, China’s Chinyu Wang led the first lap in 59.5 seconds. Rose Mary Almanza of Cuba pushed the pace at the start of the second lap, but it was Great Britain’s Keely Hodgkinson with an impressive kick from the back of the pack to win in 1:59.12, out sprinting Wang who finished second in a personal best of 1:59.14. Rogers finished third in 1:59.28.\n\nWith the next two fastest times, Rogers and Alexandra Bell (1:58.83) round out the finalists, which will be broadcast on Tuesday, August 3 at 8:25 a.m. ET. —Jen Ator\n\n\n\nCould the U.S. Sweep Again?\n\nIn 2016, Team USA swept the women’s 100-meter hurdles at the Rio Olympics. With all three U.S. women through to the semis in Tokyo, could they do it again?\n\nTeam USA’s Gabbi Cunningham finished in third in heat one with a time of 12.83, behind Andrea Carolina Vargas of Costa Rica and Netherland’s Nadine Visser, who both clocked season bests.\n\nCunningham placed fourth at the U.S. Olympic Trials in a PR of 12.53. She was added to the team after Brianna McNeal, the defending Olympic champion in the event, received a five-year suspension for an anti-doping rule violation related to missing out-of-competition drug tests.\n\nRELATED: Brianna McNeal, 2016 Olympic Gold Medalist, Receives 5-Year Ban for Missing Drug Tests\n\nThe redemption story continues for world-record holder Keni Harrison, as she led comfortably to win her heat in 12.74 ahead of Australia’s Liz Clay, Italy’s Luminosa Bogliolo, and Elivera Herman of Belarus, who also automatically advanced.\n\nHarrison won the U.S. Olympic Trials in a season’s best time of 12.47 to make her first Olympic team, five years after a shocking disappointment at the 2016 Trials.\n\n“It’s exciting to be out here. I’ve waited so long for this moment,” Harrison told NBC’s Lewis Johnson after the race.\n\nAt Trials, it was Cool Ranch Doritos earrings. In her Olympic debut, it was gorgeous braids, glitter, and butterfly hair accessories. One thing’s for sure: Christine Clemons knows how to make people pay attention.\n\nClemons grabbed the final spot on Team USA by a mere five-thousandths of a second over Gabbi Cunningham at Trials. In Tokyo, she got off to a quick start in heat 4 before seeming to ease back in the final yards to finish second in 12.91 behind Jamaica’s Britany Anderson.\n\nPuerto Rico’s Jasmine Camacho-Quinn, the world leader this year at 12.32, won the final heat of the night in 12.41. With no one else in the field having run that fast this year, Camacho-Quinn proves she’ll be Team USA’s fiercest competition.\n\nSemifinals will be broadcast on Sunday, Aug 1 at 6:45 a.m. ET, with finals following at 10:50p.m. ET. —Jen Ator\n\n\n\nSydney McLauglin, Dalilah Muhammad, and Anna Cockrell Advance\n\nSydney McLaughlin of Team United States competes in round one of the Women’s 400m hurdles heats on day eight of the Tokyo 2020 Olympic Games at Olympic Stadium on July 31, 2021 in Tokyo, Japan. Photo: Matthias Hangst/Getty Images\n\nThe U.S. women competing in the 400-meter hurdles got through the first round with little drama on Saturday in Japan.\n\nSydney McLaughlin, who set the world record of 51.90 in the event at the U.S. Olympic Trials, won her heat after the field received a false start warning. It didn’t shake her at all—she eased up early when it became clear she would win her heat handily.\n\nAfter her blazing-fast race at the Trials, McLaughlin comes to the Tokyo Olympics as the one to beat. She doesn’t feel the stress, she said.\n\n“Pressure’s an illusion,” McLaughlin said after the race, on the NBC broadcast. “It’s what you make it.”\n\nDalilah Muhammad, the defending Olympic champion, had the fastest race of the heats, finishing her race first in 53.97. She’s been training in Ft. Worth, Texas, so the oppressive humidity in Tokyo isn’t taking much of a toll, she said.\n\n“I’m feeling good,” said Muhammad, who had a difficult year in 2020 after contracting COVID-19.\n\nAnna Cockrell, who is a first-time Olympian and NCAA champion from the University of Southern California, was third in her heat to make the semi-final round. She described the conditions as “soupy” and emphasized that she’s just taking one day—and one race—at a time during her rookie experience at the Games.\n\n“I’m just trying to keep it all in perspective,” she said. “Putting one piece of the puzzle together at a time.”\n\nThe semifinal round of the women’s 400 meter hurdles is at 7:35 a.m. Eastern on Monday, August 2. —Erin Strout\n\n\n\nNigerian Sprinter is Out After Testing Positive for HGH\n\nTOKYO, JAPAN – JULY 30: Maria Isabel Perez of Team Spain and Blessing Okagbare of Team Nigeria compete during round one of the Women’s 100m heats on day seven of the Tokyo 2020 Olympic Games at Olympic Stadium on July 30, 2021 in Tokyo, Japan. (Photo by Patrick Smith/Getty Images)\n\nOn Saturday in Japan, the Athletics Integrity Unit released a statement announcing that the agency had provisionally suspended Blessing Okagbare of Nigeria, who had tested positive for human growth hormone. She had qualified on Thursday for the semifinal round of the 100 meters, but will not be allowed to compete.\n\nThe adverse analytical finding came from an out-of-competition test on July 19, according to the AIU.\n\n\n\nCo-Eds Make Their Olympic Debut; Team USA Disqualified, Then Re-Instated\n\nWell, they looked good. (Seriously, loving the look of those relay uniforms.) And they ran well: Team USA’s Elija Godwin, Lynna Irby, Taylor Manson, and Bryce Deadmon won their heat in the first round of the mixed 4×400-meter relay in 3:11.38.\n\nMaking its debut in the Olympics, the mixed 4×400-meter relay includes two men and two women from each country. They can run in any order, but most teams opt for male-female-female-male. The world record of 3:09.34 is held by the United States, set at the 2019 World Championships in Doha, Qatar by team Allison Felix, Michael Cherry, Wilbert London, and Courtney Okolo.\n\nThe heavy favorites to win this event were informed shortly after their heat that they would not have the opportunity to go for gold, disqualified because the first exchange from Godwin to Irby was outside of the takeover zone, violating technical rule 24,19.\n\n“We come out, we try our best and it was a complete surprise to all of us. All we can do is prepare for the future and see what happens next,” Elija Godwin said after the event. “It’s amazing, no matter the outcome. Competing on one of the biggest stages in track and field is always an amazing event. It’s my first Olympics and I won’t forget it.”\n\nBut wait…you’re saying there’s a chance? “I’m told Team USA is appealing DQ,” tweets reporter David Woods, “because officials put No. 2 runner Lynna Irby at wrong exchange line. So what looked like Irby’s error might be official’s error. Stay tuned.”\n\nI'm told Team USA is appealing DQ in mixed 4×400 relay because officials put No. 2 runner Lynna Irby at wrong exchange line. So what looked like Irby's error might be official's error. Stay tuned. — David Woods (@DavidWoods007) July 30, 2021\n\nAnd yes, four hours later, USATF released a statement confirming the U.S. 4x400M Mixed Relay team had been reinstated and will compete in Saturday’s final. —Jen Ator\n\n\n\nRaven Saunders Dominates to Qualify for the Women’s Shot Put Finals\n\nIn her second trip to the Olympics, Raven Saunders is heading to the shot put finals. Saunders, who finished fifth at the 2016 Rio Olympics, dominated her preliminary round on July 30. After fouling on her first attempt, she threw an impressive 19.2 meters on her second.\n\nNicknamed “The Hulk,” Saunders showed up looking strong wearing a Joker-esque mask and chromatic single-lens sunglasses. She’s already had an impressive 2021, throwing a personal-best of 19.96 meters at the Olympic Trials in June.\n\n“I feel really good. I feel absolutely amazing. I’ve been preparing myself for pretty much a dog fight, a battle, maybe one of the greatest shot put competitions of all time, so I’m really ready. I’m really focused. I’m ready to get it and compete against really great athletes,” Saunders said after the competition.\n\nAmerica’s other two throwers did not advance. Aquilla Adelaide fell short, coming in ninth in the second heat with 17.68 meter throw. Jessica Ramsey narrowly missed the 18.80m qualifying distance with her 18.75m throw.\n\nThe shot put finals will take place on August 1.\n\nOther field updates: the triple long jump qualification rounds took place shortly before the shot put. No jumpers from Team USA qualified to advance. Competing was Orji Keturah, Jasmine Moore, and Tori Franklin. No American has ever medaled in the Olympic triple long jump. —Malissa Rodenburg\n\nJamaica Did What Jamaica Does, While All of Team USA Also Advances in the 100 Meters\n\nhttps://twitter.com/DaLJBeast/status/1420952762087444484\n\nTeam USA went three-for-three in the first round of the women’s 100 meter to all advance to the semi-final on Friday in Tokyo.\n\nIn the opening heat, Teahna Daniels, who finished third at Olympic Trials, took first (11.04) in the opening heat ahead of Great Britain’s Dina Asher-Smith (11.07) to automatically advance, along with Murielle Ahoure.\n\n“I’m excited. Are you kidding me? This is the most anticipated race and just to be in it and to be competing, I am soaking in every moment,” Daniels said after the race. “There is no pressure, as I don’t put pressure on myself, or other people’s expectations of me. I just know what I can do. I am excited, I think I am going to be in the final.”\n\nIn heat three, runner-up at Olympic Trials Javianne Oliver was edged out by Germany’s Alexandra Burghardt (11.08), finishing second second in 11.15.\n\nAnd in the final heat of the evening, Jenna Prandini, who is also racing the 200 meters for Team USA, held on for third with a time of 11.11. Prandini was added to the 100-meter squad after Trials champion Sha’Carri Richardson received a one-month ban for testing positive for marijuana.\n\nTeam Jamaica, as expected, showed its leadership in the event. Reigning Olympic champion Elaine Thompson-Herah made it look easy storming through the line during heat two in 10.82. Shelly-Ann Fraser-Pryce, ranked first in the world, looked smooth and relaxed to win her heat in 10.84. At 34 years old, the four-time Olympian is running faster than ever. If she earns a medal here in Tokyo, she would become the first athlete man or woman to win four medals in the 100 meters. And 2016 Rio Olympic 400-meter bronze medalist Shericka Jackson, who surprised many when she made this year’s Jamaican team in the 100 and 200, finished second in the final heat in 11.07.\n\nBut it was Côte d’Ivoire’s Marie-Josee Ta Lou who might have made the biggest statement of the night. After finishing fourth place in both the 100 and 200 at the 2016 Rio Olympics, Ta Lou found her redemption running into a headwind to win her heat in 10.78, setting a new African record. —Jen Ator\n\n\n\nSmooth Sailing for Mu, Rogers, and Wilson in First Round of the 800 Meters\n\nHabitam Alemu of Team Ethiopia, Athing Mu of Team United States, and Melissa Bishop-Nriagu of Team Canada compete during round one of the women’s 800-meter heats on day seven of the Tokyo 2020 Olympic Games at Olympic Stadium on July 30, 2021 in Tokyo, Japan. Photo: Christian Petersen/Getty Images\n\nThe three women competing in the 800 meters for Team USA—Athing Mu, Raevyn Rogers, and Ajee’ Wilson—all advanced to the semi-final during the opening session of the 2021 Olympics on Friday in Tokyo.\n\nMu, 19, in her Olympics debut, bided her time in the pack before she surged ahead in the closing 100 meters and easily won her heat in 2:01.10, followed by Habitam Alemu of Ethiopia, and Joanna Jozwik of Poland.\n\n“Of course there’s pressure,” Mu said after the race, “but I’m just going about my rounds, you know literally anything can happen. I’m just here competing doing all I can to be at the best on the day.”\n\nMu comes in with the world-leading time, making her a heavy medal favorite.\n\n“I’m gonna come out here, do what I can, of course the gold medal is on my mind, but I’m just here competing, and doing all I can to be good on blast day,” she said.\n\nIn the following heat, Rogers, also a first-time Olympian, similarly earned the win in the final stretch of the two laps, finishing in 2:01.42. Great Britain’s Keely Hodgkinson, in second place, also advanced, along with Mary More of Kenya.\n\nIt was Wilson, American record-holder (1:55.61) and 2016 Olympian, who ended up with the fastest race of the evening among the American trio. She earned an auto-qualifier by placing second in 2:00.02, behind Jemma Reekie of Great Britain, who ran 1:59.97. Chunyu Want was third in 2:00.05 to also advance to the semi-final round.\n\nAlmost all of the heavy-hitters in the notably talented field had little drama in the opening round, though Melissa Bishop-Nriagu of Canada was among those who did not make it to the semi final, which is at 7:50 a.m. on July 31. —Erin Strout\n\nRELATED: How Olympian Ajee’ Wilson Keeps Her Cool"}, {"url": "https://www.cambridge.org/core/journals/law-and-history-review/article/abs/susan-pedersen-the-guardians-the-league-of-nations-and-the-crisis-of-empire-oxford-oxford-university-press-2015-pp-592-3495-cloth-isbn-9780199730032/62B543C4B5C2CD308A1428D4D3120552", "page_content": "It is a time-honored cliché to claim that a book defies overview, its elegance and erudition invalidating the very idea of a concise assessment. In most cases, such claims amount to little more than rhetorical flourishes. The present book is a rare exception, presenting the reviewer with the unenviable task of having to convey in a limited space the full scope of an argument that sweeps across two decades and four continents to marshal an enormous quantity of previously untapped archival material.\n\nToday, the League of Nations is remembered for many things, and is forgotten for even more. Its drive to establish a system of multilateral institutions that would coordinate, if not eradicate, the great-power rivalry that had marked the Concert of Europe's machinations during the long nineteenth century is regularly cited as a forerunner of the United Nations. Its support for “technical cooperation” with respect to everything from the struggle against malaria to the regulation of maritime traffic to the standardization of economic data is invoked as a progenitor of the countless networks and organizations that now link the globe. The efforts of jurists and diplomats affiliated with various League agencies to further disarmament initiatives and outlaw the aggressive use of force is sometimes presented as having inspired attempts to defuse the Cold War that set in shortly after the next “great war.” Above all, however, the League of Nations is remembered as a failure, a starry-eyed attempt to reduce the violence and unpredictability of international politics to the (nominal) order and consistency of international law. The League's inability to contain nationalism; its toothlessness in the face of the Great Depression; and its ineffective responses to war and intervention in Spain, Abyssinia, Manchuria, and elsewhere, all, it is widely believed, contributed to the League's de-legitimization and consequent dissolution. As the institutional embodiment of a “20 years' crisis” in which one after another hope revealed itself to be delusional, the League spawned the very catastrophe it was meant to avert.\n\nThe Guardians has little patience for such narratives. Sidestepping traditional explanations of the League project, Susan Pedersen trains her lens on the mandates system, regarded by many lawyers and historians today as the most significant precursor to the United Nations' trusteeship system and a host of broadly related modes of international territorial administration. Unlike the League's minority protection regime, designed principally for Central and Eastern European states, the mandates system was intended for the extra-European world, a means of placing territories detached from the German and Ottoman Empires under a combination of foreign administration and international supervision. Pursuant to Article 22 of the League of Nations Covenant, every such territory was to be governed by a mandatory power with a view to ensuring its “well-being” and “development” (these terms being in tension and also open to divergent interpretations) and in the name of a “sacred trust of civilization” (this expression being a continuation of the centuries-old tradition of the mission civilisatrice). The League itself was to exercise oversight powers, mainly, athough not exclusively, through its Permanent Mandates Commission. This was a small agency staffed by a shrewd and well-connected group of former ministers, colonial governors, and similarly high-ranking officials, most of whom hailed from leading imperialist states.\n\nLawyers and historians have conventionally sought to distinguish the kind of internationalized administration that found expression in the mandates system from the direct colonial rule that had marked European expansion (and its underlying capitalist logic) for centuries. There is certainly something to this effort. Some of the most enthusiastic advocates of mandates would not have cast their lot with the system had it not been for their desire to stave off direct annexation of German and Ottoman territories. As Pedersen herself notes, the fact that the system—and the League more generally—operated in “a swirl of publicity” (65), with intense lobbying and public scrutiny often accompanying key decisions, tended to discourage crude policies of territorial aggrandizement. Nevertheless, the line between formal and informal domination is always a highly fluid one, and the distinction between colonialism sensu stricto and the League's regime of mandatory administration has typically been overdrawn and exaggerated. In most cases, it has rested upon a rather naive belief that multilateralism is preferable to unilateralism and that the compromises of international law are capable of mitigating the rigors of domestic law.\n\nThe central ambition of The Guardians is to provide a more sophisticated explanation of the mandates system than any such hard-and-fast distinction would permit, and Pedersen is astonishingly successful in this regard, demonstrating that those who designed, implemented, petitioned, and railed against the mandates system continually blurred the line between formal and informal control. As she notes, one consequence of this conceptual and ideological ambiguity was that it became exceptionally difficult to determine whether sovereignty could justifiably be said to vest in the people inhabiting the territory that was placed in the trust of the mandatory power. Although most authorities were of the view that each mandate constituted a contract between the League on the one hand and the mandatory power on the other (91), there was nothing approaching a consensus on the question of where sovereign authority was ultimately to be located. Did sovereignty lie in the people subjected to mandatory rule, in the mandatory power itself, or perhaps in the League? If sovereignty vested in the people, was it merely “in abeyance” until such time as the mandatory relationship came to an end and the people in question reconstituted itself as an independent sovereign state? Some may have sought to dismiss such questions as being purely of academic interest (e.g., 229); however, it is not hard to see that they lay at the heart of far-reaching debates concerning the limits of mandatory power and the rights of “native” peoples. Because whereas the mandates system was designed to internationalize the governance of formerly German and Ottoman territories, setting and ostensibly enforcing standards for foreign administration, it also facilitated the alienation of large tracts of land, furthered the practice of granting concessions to foreign companies, and reinforced a wide-ranging “open door” policy that invited economic exploitation by all and sundry. Indeterminacy with respect to the content and location of sovereignty thus proved to be a handmaiden of informal empire, all the more insidious for being less visible and less costly to maintain than formal empire. As Pedersen rightly observes, all of this was made possible by the imprecision of the relevant legal instruments, first and foremost the League Covenant and the individual mandate documents. Those who participated in Geneva's “force field” (5, 11, 94) may have been committed to a legalistic textualism (e.g., 64–65, 101–2); however, the texts themselves were shot through with uncertainties that muddied the concept of sovereignty and muddled the line between formal and informal tutelage.\n\nPedersen does not belabor the contemporary resonance of these and other debates. Nor does she attempt to write a history of the present. At root, it is for the reader to link the heavy-handed Belgian administration of Ruanda-Urundi to the “tribal” divisions that would later prove to be so cataclysmic. Similarly, it is up to the reader to trace the contemporary implications of France's brutal suppression of the Great Syrian Revolt or the various claims to Palestine that were made by Arab and Jewish groups during the 1920s and 1930s. Such circumspection makes the book not only more persuasive but also more pressing.\n\nSimply put, Susan Pedersen has produced an instant classic, a work of extraordinary range that is without question the most insightful and carefully researched study of the mandates system currently available. It will remain a touchstone for all future discussion of this system, as well as of its complex and variegated implications for subsequent exercises in nation- and state-building. It should—and doubtless shall—be read (and reread) widely."}, {"url": "https://time.com/6087202/erriyon-knighton-olympics/", "page_content": "At 17 years old, American sprinter Erriyon Knighton is not the youngest competing athlete at this year’s 2020 Summer Olympics in Tokyo. But the Florida native is the youngest man to compete for the U.S. track team in a Summer Olympics since 1964.\n\nAnd after an impressive performance in the 200-m finals on Wednesday, he’s solidified his place as one to watch in the track and field world. While Knighton narrowly missed his goal of a medal—he finished fourth with a time of 19.93, just .19 shy of Noah Lyles, who took bronze—he did so after only running track for a few years.\n\nKnighton was initially recruited as a football wide receiver for Hillsborough High School in Tampa, Fla., but when he was a freshman, his coach asked him to join the track team, too. He decided to focus fully on track by the age of 16, going pro with an Adidas sponsorship and turning down offers from football programs at the University of Alabama, the University of Florida and Florida State University. “Even though I love football, after what I just ran, I have to give track 110%,” he explained after taking gold at the 2019 AAU National Junior Olympics. “I think that is what’s best for me and what my future holds.”\n\n“I was a little fast, but I got faster,” he told his high school newspaper about his recent few years as a rising force in the track world. “I wanted to be better than everyone else,” he said. “Some people don’t know what’s going on—they think I dropped out of high school, but I be here everyday,” he added. “They’re looking from the outside in. At the end of the day, they really just help me. I feed off of stuff like that.”\n\nIn 2021, he added to that: “I know I can maximize to the next level,” he told Track and Field News. “I’ve got to see what I can do. I want to win against the top athletes, but I know they’re not going to take it easy on me, so I’m going to have to train real hard.”\n\nHis training has apparently paid off: he is the current record holder of the world under-18 and under-20 titles in the 200-m; he set that new record during the U.S. Track and Field Olympic Trials in June of this year, with a time of 19.84 seconds. That means he bested legendary Jamaican sprinter Usain Bolt’s under-20 record, too. Bolt has been a point of comparison since he first arrived on the scene “because he’s tall like me,” as Knighton has said. (Bolt is 6’5″; Knighton is 6’3″.)\n\nTeam USA’s Kenny Bednarek, who took silver in the event, said after the race, “He’s going to be dangerous in the future.”\n\nRead more about the Tokyo Olympics:\n\nWrite to Raisa Bruner at raisa.bruner@time.com."}, {"url": "https://time.com/5169066/final-medal-count-2018-winter-olympics/", "page_content": "After 19 days of competition at the 2018 Winter Olympics in PyeongChang, South Korea, Norway came out on top of the final medal count.\n\nNorway’s dominance was apparent from the beginning of the Olympic Games, with 14 gold medal wins in sports like cross-country skiing and more medals from other skiing events from jumping to downhill. Germany came in second with 31 total medals and 14 gold medals, and Canada finished in third with 29 medals, 11 of which were gold. After a number of historic wins for the United States late in the Games, Team USA finished fourth with 23 total medals, including nine golds.\n\nThe 2018 Olympic Games came with a number of surprises and spills, including everything from record-breaking performances to gold-medal favorites failing to make the podium. The United States was an example of both: Figure skaters Nathan Chen and Mirai Nagasu made history with their performances on the ice, but failed to make it on the individual podium. (They did, however, both take home a bronze medal with the rest of their team.) While Mikaela Shiffrin earned one gold and one silver medal, she fell short of the podium in her signature slalom event and pulled out of the downhill event while at the Olympic Games.\n\nSurprises late in the Olympics helped boost Team USA’s medal count after a lackluster start. The U.S. women’s ice hockey team beat Canada for gold for the first time in 20 years at the Games, and the men’s curling team won after making it to the country’s first-ever gold medal match in the event. And snowboarders like Chloe Kim, Jamie Anderson, Shaun White and Red Gerard dominated the sport’s podium with gold-medal wins.\n\nStill, the U.S.’s performance in PyeongChang fell behind its second-place finish in Sochi. In 2014, Russia earned 29 medals for the win, edging out the U.S., which earned 28. Back then, Norway had the third-highest medal count with 26.\n\nHere’s the final medal count for each country at the 2018 Winter Olympics.\n\nNorway: 39 medals\n\n14 gold, 14 silver, 11 bronze\n\nGermany: 31 medals\n\n14 gold, 10, silver, 7 bronze\n\nCanada: 29 medals\n\n11 gold, 8 silver, 10 bronze\n\nUnited States: 23 medals\n\n9 gold, 8 silver, 6 bronze\n\nNetherlands: 20 medals\n\n8 gold, 6 silver, 6 bronze\n\nSouth Korea: 17 medals\n\n5 gold, 8 silver, 4 bronze\n\nOlympic Athletes from Russia: 17 medals\n\n2 gold, 6 silver, 9 bronze\n\nSwitzerland: 15 medals\n\n5 gold, 6 silver, 4 bronze\n\nFrance: 15 medals\n\n5 gold, 4 silver, 6 bronze\n\nSweden: 14 medals\n\n7 gold, 6 silver, 1 bronze\n\nAustria: 14 medals\n\n5 gold, 3 silver, 6 bronze\n\nJapan: 13 medals\n\n4 gold, 5 silver, 4 bronze\n\nItaly: 10 medals\n\n3 gold, 2 silver, 5 bronze\n\nChina: 9 medals\n\n1 gold, 6 silver, 2 bronze\n\nCzech Republic: 7 medals\n\n2 gold, 2 silver, 3 bronze\n\nFinland: 6 medals\n\n1 gold, 1 silver, 4 bronze\n\nGreat Britain: 5 medals\n\n1 gold, 4 bronze\n\nBelarus: 3 medals\n\n2 gold, 1 silver\n\nSlovakia: 3 medals\n\n1 gold, 2 silver\n\nAustralia: 3 medals\n\n2 silver, 1 bronze\n\nPoland: 2 medals\n\n1 gold, 1 bronze\n\nSlovenia: 2 medals\n\n1 silver, 1 bronze\n\nSpain: 2 medals\n\n2 bronze\n\nNew Zealand: 2 medals\n\n2 bronze\n\nHungary: 1 medal\n\n1 gold\n\nUkraine: 1 medal\n\n1 gold\n\nBelgium: 1 medal\n\n1 silver\n\nKazakhstan: 1 medal\n\n1 bronze\n\nLatvia: 1 medal\n\n1 bronze\n\nLiechtenstein: 1 medal\n\n1 bronze\n\nCorrection: The original version of this story misstated the medals won by Italy. The country won 2 silver medals and 5 bronze, not 5 silver medals and 4 bronze.\n\nContact us at letters@time.com."}, {"url": "https://www.theguardian.com/sport/2015/sep/21/suzann-pettersen-solheim-cup-fourball-controversy", "page_content": "One of the biggest golfing controversies of the modern age has been followed by a U-turn of the same magnitude by Suzann Pettersen.\n\nA day after insisting she had no regrets whatsoever about the fourball incident that saw this year’s Solheim Cup match descend into open acrimony – and insisting she would act the same way again in similar circumstances – Pettersen issued a fulsome apology. She did likewise in person to the USA captain, Juli Inkster.\n\nThe USA were furious after Pettersen enforced a 17th green penalty on the rookie Alison Lee, who had wrongly picked up a short putt in the belief a concession had been granted. Not only did Pettersen and Charley Hull go on to claim a point for Europe, but the Norwegian player exhibited no regret in the immediate aftermath of a 14½-13½ success for the USA.\n\nThe incident was widely recognised to have been the key motivating factor for Inkster and her players, who had trailed 10-6 with the singles left to play. Zach Johnson, the 2015 Open champion, had branded Pettersen’s conduct “a disgrace to the sport”.\n\nWhether by virtue of a simple change of heart, a realisation as to the magnitude of her actions or advice from elsewhere, a contrite Pettersen took to social media on Monday with a fresh tone entirely.\n\n“I’ve never felt more gutted and truly sad about what went down Sunday on the 17th at the Solheim Cup,” she said. “I am so sorry for not thinking about the bigger picture in the heat of the battle and competition. I was trying my hardest for my team and put the single match and the point that could be earned ahead of sportsmanship and the game of golf itself. I feel like I let my team down and I am sorry.\n\n“To the US team, you guys have a great leader in Juli, who I’ve always looked up to and respect so much. Knowing I need to make things right, I had a face-to-face chat with her before leaving Germany this morning to tell her in person how I really feel about all of this. I wanted her also to know that I am sorry.”\n\nEven on Sunday evening, Inkster was publicly of a mind to draw a line under the affair. Eight members of Europe’s team joined in the USA party, with Pettersen understandably not among them.\n\nPettersen, a two-time major champion, plays on the LPGA Tour in the United States. Gallery reaction towards her there will prove fascinating. Brittany Lincicome, who partnered Lee at the time of the controversy, said she believed the USA team members could make peace with Pettersen but others, most notably Stacy Lewis, were less charitable.\n\n“I hope in time the USA team will forgive me and know that I have learned a valuable lesson about what is truly important in this great game of golf, which has given me so much in my life,” Pettersen added.\n\n“To the fans of golf who watched the competition on TV, I am sorry for the way I carried myself. I can be so much better and being an ambassador for this great game means a lot to me.\n\n“The Solheim Cup has been a huge part of my career. I wish I could change Sunday for many reasons. Unfortunately I can’t. This week I want to push forward toward another opportunity to earn the Solheim Cup back for Europe in the right way. And I want to work hard to earn back your belief in me as someone who plays hard, plays fair and plays the great game of golf the right way.”\n\nAn earlier element of Solheim Cup rancour was almost forgotten amid the final day acrimony. A member of the European backroom staff, Annika Sorenstam, hit back at suggestions she had been coaching players during competition. Only the captain can impart advice. The same allegation was made against Sorenstam at the 2013 Solheim Cup in Denver.\n\n“Just to clarify, I was wrongly accused of giving advice,” Sorenstam said. “I’ve known the lesson from Colorado. I know what a vice-captain can do. I was extremely hurt.\n\n“I was insulted, and I addressed it with Juli. So, as far as giving advice and what to do, I was put on this team to inspire this team, and that’s what I do. I will continue to do that. I would love to be captain one day.”"}, {"url": "https://time.com/6084914/simone-biles-replacement-tokyo-olympics-gymnastics/", "page_content": "When Simone Biles withdrew from the gymnastics team event at the Tokyo Summer Olympic Games on July 27, her teammates and coaches scrambled to fill in for her on the spot, since Biles made the sudden decision after the competition had started. Sunisa Lee and Jordan Chiles stepped in and both pulled off impressive routines with little notice — and no warm up time — to help the US women earn silver.\n\nBiles announced a day later that she is also withdrawing from the all-around event, the marquee competition for women’s gymnastics. Biles is the reigning Olympic all-around champion, but won’t be defending her title after admitting to struggling mentally with the pressures of competing in Tokyo.\n\nWho will replace her? It’s not just a matter of swapping in a teammate. Biles was the top qualifier, and only the gymnasts with the top 24 scores from the qualifying round are eligible for the all-around. In addition, in order to give as many countries as possible a chance to participate, only two gymnasts per country can compete. For the U.S., that meant Biles and Sunisa Lee, who qualified with the third highest score.\n\nJade Carey, one of the additional members of the U.S. squad who was not part of the four-woman team, qualified ninth, which means she will replace Biles in the all-around.\n\nJade Carey of Team USA during women's qualification for the Artistic Gymnastics final at the Olympics at Ariake Gymnastics Centre, Tokyo, Japan on July 25, 2021. Ulrik Pedersen—NurPhoto via Getty Images\n\nRead more: Meet the U.S. Women’s Olympic Gymnastics Team for Tokyo\n\nCarey took advantage of a new Olympic qualifying system in which she participated in the Apparatus World Cup Series over the last three years, and her scores assured her of an individual invitation to the Olympic squad; with that individual spot, however, she could not compete in the team event. Strong on vault and floor, Carey, an Arizona native who trains with her father Brian, is a consistent competitor.\n\nBiles also qualified for all four event finals, and said she will take each day at a time before deciding whether she will compete in those events. Only the top eight qualifiers compete in each event final, with a maximum of two per country. If she does decide to withdraw from those as well, here’s who will replace her on each apparatus.\n\nVault: MyKayla Skinner (Team USA)\n\nMykayla Skinner of Team USA competes on vault during Women's Qualification on day two of the Tokyo 2020 Olympic Games at Ariake Gymnastics Centre on July 25, 2021 in Tokyo, Japan. Laurence Griffiths—Getty Images\n\nMyKayla Skinner, like Carey, is an individual member of the women’s gymnastics squad, and could not compete in the team event. She did compete on all apparatus for the all-around, however, which determines in which event finals she can participate. A strong vaulter, her scores unfortunately did not qualify her for any of the event finals because two other teammates had higher scores. If Biles does not compete on vault, however, Skinner will step in since she finished fourth in the qualification round, and the top eight gymnasts are eligible.\n\nFloor: Jennifer Gadirova (Team Great Britain)\n\nOne of Biles’ teammates cannot replace her on floor, since none placed higher than the reserve athlete, Jennifer Gadirova of Great Britain, who will have a chance to compete on floor if Biles withdraws.\n\nGreat Britain's Jennifer Gadirova competes in the floor event of the artistic gymnastic women's qualification during the Tokyo 2020 Olympic Games at the Ariake Gymnastics Centre in Tokyo on July 25, 2021. Loic Venance—AFP via Getty Images\n\nUneven bars: Melanie de Jesus (France)\n\nSame goes for this event; the reserve athlete is Melanie de Jesus dos Santos of France, because the Team USA athlete with the next highest score after Biles and Lee is Jade Carey, but she finished 10th.\n\nFrance's Melanie de Jesus dos Santos competes on the uneven bars during the women's gymnastics team event final at the Summer Olympics in Tokyo, Japan on July 27, 2021. Marijan Murat—picture alliance via Getty Images\n\nBeam: Urara Ashikawa (Japan)\n\nJapan’s Urara Ashikawa would step in on this event as the reserve athlete, also because no U.S. gymnast finished higher than Ashikawa. Skinner, the next highest scoring U.S. gymnast, finished 27th.\n\nUrara Ashikawa of Japan during women's qualification for the Artistic Gymnastics final at the Olympics at Ariake Gymnastics Centre, Tokyo, Japan on July 25, 2021. Ulrik Pedersen—NurPhoto via Getty Images\n\nCorrection, August 2\n\nThe original version of this story misstated MyKayla Skinner’s results in the vault qualifications. She finished fourth, not seventh.\n\nRead more about the Tokyo Olympics:\n\nContact us at letters@time.com."}, {"url": "https://www.registerguard.com/story/sports/college/track-field/2022/06/08/live-updates-hayward-field-ncaa-outdoor-track-and-field-championships-schedule-events/65359752007/", "page_content": "Collegiate athletes are in Eugene this week to compete in the NCAA Outdoor Track & Field Championships meet in Eugene, Ore. The Register-Guard will be on site providing live updates and information from Hayward Field throughout the four-day event.\n\nWhen Abby Steiner took the baton for the third leg of the 4x400 relay, Kentucky sat in fourth place and well off the pace being set by Texas and Arkansas. When Steiner was done, the Wildcats were so far in front that nobody could catch them.\n\nSteiner – who won the 200 meters and finished third in the 100 – ran a sizzling lap of 48.92 seconds to put Kentucky in front and the Wildcats hung on for victory in 3:22.55, the second-fastest time ever recorded at the NCAA meet.\n\nTexas finished second with a time of 3:23.35, Arkansas was third (3:23.69), Texas A&M was fourth (3:24.55) and South Carolina was fifth (3:25.78).\n\nFlorida finished last in the long relay but it had no impact on the team standings, where the Gators ran away with the national title with 74 points. Texas finished second with 64 team points and Kentucky was third with 50. LSU and Texas A&M tied for fourth place at 39 points, with Arkansas sixth (38) and Texas Tech seventh (36).\n\nTuohy wins 5,000 title for NC State\n\nNC State sophomore Katelyn Tuohy surged into the lead with 600 meters to go and coasted to victory in the 5,000 meters Saturday.\n\nTuohy and Florida freshman Parker Valby pulled away from the rest of the field during the last lap, but it was Tuohy who showed off her closing speed with a victory in 15:18.39. Valby finished second in a personal-best 15:20.10.\n\nOklahoma State sophomore Taylor Roe (15:24.41) narrowly edged Alabama junior Mercy Chelangat (15:24.54) at the line for third place. Arkansas junior Lauren Gregory finished fifth in 15:28.33, Colorado senior Abby Nichols was sixth (15:33.09) and New Mexico sophomore Gracelyn Larkin was seventh (15:33.10).\n\nNC State had five runners qualify for Saturday’s final, with freshman Marlee Starliper finishing ninth (15:36.51), junior Samantha Bush in 10th (15:42.61), senior Hannah Steelman in 11th (15:43.45) and junior Savannah Shaw in 20th (16:02.32).\n\nDucks get two top-10 performances in triple jump\n\nOregon had two chances to score during Saturday’s triple jump final, but the Ducks ultimately settled for just two team points courtesy of Dominique Ruotolo’s seventh-place finish.\n\nRuotolo posted a mark of 43-6½ and teammate Lexi Ellis jumped 43-3¼ to finish 10th.\n\nFlorida sophomore Jasmine Moore won the event with her leap of 46-11¾ and the Texas Tech duo of Ruth Usoro (45-9½) and Ruta Lasmane (45-7) finished second and third, respectively.\n\nTexas freshman Ackelia Smith finished fourth (45-3), Georgia junior Titiana Marsh was fifth (44-5½) and Florida senior Natricia Hooper was sixth (44-1¼).\n\nHall easily wins women's heptathlon title\n\nThere wasn’t a lot of drama during the final three events of the women’s heptathlon Saturday, with Florida sophomore Anna Hall extending her already sizeable lead and running away with the NCAA title.\n\nHall came up short in her bid to set a new collegiate record, but her 6,385 points were 446 better than runner-up Ida Eikeng of Washington. The all-time college record of 6,527 was set by Diane Guthrie of George Mason in 1995, and Hall has gotten as close as 6,458 this season.\n\nHall won the long jump with a mark of 20-7 to get started Saturday and she finished fourth in the javelin with a toss of 140-7. She was in position to break the all-time scoring record, but she faded to 10th place in the 800 meters, which she had to run just 13 minutes after her second-place finish in the 400 hurdles.\n\nDuke senior Erin Marsh finished third in the heptathlon with 5,929 points – just 10 behind Eikeng – while Stanford junior Allie Jones was fourth (5,823) and Florida junior Sterling Lester was fifth (5,751).\n\nDistin wins high jump title for Texas A&M\n\nTexas A&M junior Lamara Distin outlasted Middle Tennessee State senior Abigail Kwarteng to win the NCAA high jump title Saturday with a clearance of 6-4¾.\n\nDistin passed on the first two heights and elected to start at 5-10¾, and she needed just one attempt to go over the bar on each of her six jumps before eventually scratching at 6-6¾ with the rest of the field out of the competition.\n\nKwarteng finished second with a clearance of 6-3½, South Carolina sophomore Rachel Glenn was third (6-1¼), Villanova junior Sanaa Barnes was fourth (6-0), Ball State junior Charity Griffith was fifth (6-0), while Cornell’s Marguerite Lorenzo, Nebraska’s Jenna Rogers and LSU’s Nyagoa Bayak tied for sixth (6-0).\n\nVan Klinken dominates in discus victory\n\nArizona State senior Jorinde Van Klinken obliterated the field in the discus Saturday, throwing 203-11 to easily win her third NCAA title after capturing both indoor and outdoor titles in the last year.\n\nVan Klinken unleashed her winning throw on her fifth attempt to move past Kansas senior Alexandra Emilianov, who threw 191-9 on her fifth attempt and eventually settled for second place.\n\nTexas Tech junior Malin Smith finished third with a mark of 186-3, Oklahoma senior Lauren Jones was fourth (181-11) and Texas Tech senior Seasons Usual was fifth (181-7).\n\nOne day after taking fifth place in the shot put, Oregon sophomore Jaida Ross finished ninth in the discus with a throw of 176-8.\n\nWilson tops Hall in 400 hurdles showdown\n\nArkansas sophomore Britton Wilson came into the NCAA meet with the fastest 400 hurdles time in the nation this season and she left Hayward Field a national champion.\n\nWilson held off Florida heptathlete and hurdles specialist Anna Hall to win the long hurdles in 53.86 seconds Saturday, just off her season- and lifetime-best time of 53.75 from the SEC Championships in May.\n\nHall tried to make up some ground late in the race but settled for second place in 54.76. Duke senior Lauren Hoffman finished third in 55.58, Kentucky junior Masai Russell was fourth (55.83) and Texas A&M senior Deshae Wise was fifth (55.99).\n\nSchoffield makes late pass for 800 victory\n\nBoise State senior Kristie Schoffield had to be patient during Saturday’s 800 final with Baylor senior Aaliyah Miller in the lead for most of the race, but Schoffield made her move with about 80 meters remaining to pull away for the victory in 2:01.09.\n\nMiller shot to the front of the pack and maintained a large lead until she started to run out of steam through the final turn. She faded down the home stretch and finished seventh in 2:03.05.\n\nVillanova senior McKenna Keegan and Oklahoma State freshman Gabija Galvydyte went with Schoffield as she moved into the lead down the home stretch, but neither could reel in the senior as she raced to her first NCAA title. Keegan finished second in 2:01.71 and Galvydyte was third in 2:01.76.\n\nFlorida junior Imogen Barrett took fourth place in 2:02.05, Kennesaw State junior Sarah Hendrick was fifth (2:02.19) and Texas junior Valery Tobias was sixth (2:02.74).\n\nFlorida's Diggs pulls away for win in 400\n\nFlorida sophomore Talitha Diggs found another gear over the final 50 meters to win an NCAA title in the 400 meters Saturday.\n\nDiggs was even with Kentucky junior Alexis Holmes and Texas A&M sophomore Charokee Young coming out of the final turn, and Holmes still had the lead halfway down the home stretch before Diggs turned on the afterburners and left everyone else in the dust.\n\nDiggs won with a personal-best time of 49.99 seconds, making her only the second collegiate woman to crack the 50-second barrier this season. Young, who ran 49.87 in April for the fastest time of the year, finished second Saturday in 50.65.\n\nTexas junior Kennedy Simon finished third in 50.69 and teammate Stacey Ann Williams took fifth in 51.13. Holmes faded to fourth in 50.71, with UCLA senior Shae Anderson in sixth (51.50) and Arkansas freshman Rosey Effiong in seventh (51.55).\n\nOregon's Nelson finishes second in 100 meters\n\nSix-thousandths of a second was all that separated Oregon’s Kemba Nelson from an NCAA title in the 100 meters Saturday.\n\nFacing a loaded field, Nelson ran 11.020 seconds to finish just behind race winner Julien Alfred of Texas, who took first place in 11.014.\n\nKentucky junior Abby Steiner finished third in 11.08, Texas Tech sophomore Rosemary Chukwuma was fourth (11.14) and LSU sophomore Favour Ofili was fifth (11.17).\n\nNelson’s performance was all the more impressive considering she was facing a field that had produced five of the 10 fastest times in NCAA meet history during Thursday’s preliminaries.\n\nLSU's Armstrong hangs on for victory in 100 hurdles\n\nLSU sophomore Alia Armstrong shot out of the blocks and held off a spirited challenge from USC’s Jasmine Jones to win the 100 hurdles in 12.57 seconds.\n\nArmstrong took the early lead and seemed destined for an easy victory, but Jones closed her down over the final four hurdles to make things interesting at the line. Jones eventually settled for second place in 12.66.\n\nKentucky junior Masai Russell finished third in 12.81, North Carolina A&T senior Paula Salmon was fourth (12.85), Texas A&M senior Kaylah Robinson was fifth (12.86), Wisonsin sophomore Destiny Huven was sixth (12.92) and Texas Tech junior Demisha Roswell was seventh (12.94).\n\nBYU's Wayment smashes NCAA record in 3,000 steeplechase\n\nCheered on by the Hayward Field crowd down the final straightaway, BYU senior Courtney Wayment set a new collegiate record in the 3,000 steeplechase with a time of 9:16.00, which is also the fifth-fastest time ever run by an American woman.\n\nWayment went to the front of the pack early and no one could keep up as she slowly separated from the rest of the field. She led by about 100 meters as she rounded the final turn and the crowd began to cheer in anticipation of a record-setting performance. Wayment threw her hands in the air as she crossed the finish line to break the old collegiate record of 9:24.41, set by Courtney Frerichs of New Mexico in 2016.\n\nYale junior Kayley Delay finished second in 9:25.08, West Virginia sophomore Ceili McCabe was third in 9:31.14 and Colorado junior Madison Boreman was fourth in 9:33.02. All three runners established new lifetime bests.\n\nOregon State junior Kaylee Mitchell finished sixth in a personal-best 9:34.59, becoming the first Beaver to score points at the NCAA outdoor meet in 40 years. Teammate Grace Fetherstonhaugh finished 10th in a PR of 9:37.56.\n\nOf the 12 steeplechase participants, 10 set new personal records as the field tried desperately to keep up with Wayment.\n\nVissa claims victory in women's 1,500 meters\n\nOle Miss sophomore Sintayehu Vissa made her move with 300 meters remaining and held off a determined field to win the 1,500 Saturday afternoon.\n\nArkansas senior Krissy Gear led for most of the race with Vissa, Colorado senior Micaela DeGenero and Stanford senior Christina Aragon staying close at the front of the pack. Gear had the lead as the bell sounded for the final lap, but Vissa and the rest of the chase pack passed her on the back straightaway and Vissa held on for the win in 4:09.42.\n\nDeGenero finished second in 4:09.62, Aragon was third in 4:10.00 and Gear was fourth in 4:10.06. Stanford senior Julia Heymach finished fifth in 4:10.58, with five of the top six runners all logging season-best times.\n\nOregon starts Day 4 with third-place finish in 4x100 relay\n\nIt wasn’t quite the start the Ducks wanted, but Oregon kicked off the fourth and final day of the NCAA Outdoor Track & Field Championships with a third-place finish in the women’s 4x100 relay.\n\nOregon’s team of Jadyn Mays, Kemba Nelson, Jasmin Reed and Jasmine Montgomery was in contention heading into the final exchange, but Texas pulled away down the stretch behind a strong anchor leg from Kynnedy Flannel and the Longhorns won in 42.42 seconds.\n\nKentucky finished second in 42.55 and Oregon just pipped LSU at the finish line, taking third place in a season-best 42.59 to 42.62 for the Tigers.\n\nFlorida State claimed fifth place in 43.18, Ohio State was sixth (43.52), UCF was seventh (43.69) and Coastal Carolina was eighth (43.78).\n\nOregon's Kemba Nelson seeking 100 and 4x100 titles\n\nThe women are were search of their titles on the final day of the NCAA Outdoor Track & Field Championships Saturday.\n\nThe Ducks' Kemba Nelson will have double duty on Saturday. The Oregon senior qualified for the finals in the 100 meters and 4x100 relay, the Ducks’ only sprinter to advance in two events.\n\nNelson won her 100 semifinal 10.97 and ran the second leg of the 4x100 that recorded a season-best 42.64 to win its heat. The rely also included Jadyn Mays, Jasmin Reed and Jasmine Montgomery.\n\nThe second day of the heptathlon begins at 10:30 a.m., field events start at 2 p.m. and track events begin at 2:30 p.m.\n\nNCAA Outdoor Track & Field Championships\n\nWhere: Hayward Field at University of Oregon in Eugene\n\nMeet schedule: Men compete Wednesday and Friday and women compete Thursday and Saturday.\n\nWhere to watch on TV\n\nSaturday — Day 2 women, 2:30 p.m., ESPN\n\nMEN'S FINALS UPDATES - Friday\n\nGators cap team title with victory in 4x400 relay\n\nChampion Allison brought home Florida’s national championship in style.\n\nRunning the anchor leg of the 4x400 relay, Allison took the baton with the lead and blazed around the track in 44.06 seconds to help the Gators set both facility and meet records with a winning time of 2:58.88.\n\nUSC finished second with a season-best time of 2:59.98, Alabama was third (3:00.17), Texas was fourth (3:01.69) and Texas A&M was fifth (3:01.72).\n\nThat final victory on Friday night capped a tremendous weekend for the Gators, who captured the team title with 54 points. Texas finished second in the team standings with 38 points, Tennessee was third (34), Florida State was fourth (33), Georgia was fifth (32) and LSU was sixth (31).\n\nHacker outkicks Beadlescomb to win 3,000\n\nWisconsin senior Olin Hacker and Michigan State senior Morgan Beadlescomb broke away from the rest of the pack near the end of the 5,000 on Friday night and staged a one-on-one duel down the final straightaway, with Hacker outkicking his counterpart to win an NCAA title in 13:27.73.\n\nHacker closed with a 54.62-second last lap to pull away from the field and eventually overtake Beadlescomb, who finished second in 13:28.38.\n\nNorthern Arizona sophomore Nico Young took third place in 13:28.62, Stanford sophomore Ky Robinson was fourth (13:30.23) and Air Force junior Sam Gilman was fifth (13:30.82). Washington got a seventh-place finish from junior Brian Fay (13:31.39) and Stanford sophomore Cole Sprout finished ninth (13:32.53).\n\nIhemeje comes up short in triple jump title defense\n\nOregon sophomore Emmanuel Ihemeje knew the mark he needed to beat in order to defend his NCAA triple jump title, but even the partisan hometown crowd couldn’t propel him to victory this time around.\n\nTCU senior Chengetayi Mapaya threw down an early gauntlet with a jump of 56-7½ on his third attempt, and realistically only Ihemeje could catch him. The Oregon sophomore put down a mark of 55-10½ on his fifth jump but could only muster 53-5½ on his final attempt as Mapaya won his first triple jump title.\n\nLSU freshman Apalos Edwards finished third at 53-9¼, Stanford junior Keyshawn King was fourth (53-6½) and Missouri junior Georgi Nachev was fifth (53-1).\n\nYoungsters dominate discus competition\n\nThe young bucks stole the show in Friday’s discus final, with freshmen landing in the top three spots on the podium.\n\nVirginia’s Claudio Romero won his first NCAA title with a throw of 217-1 to barely edge runner-up Mykolas Alekna of Cal, who threw 217-0. Arizona State freshman Ralford Mullings finished third with a throw of 204-11.\n\nThose were the only athletes to break the 200-foot mark, with Cal junior Iffy Joyner finishing fourth (199-3), Minnesota junior Kaleb Siekmeier in fifth (196-10), Miami junior Jeffrey Williams in sixth (196-5) and Washington senior Elijah Mason in seventh (195-6).\n\nHall leads women's heptathlon going into Saturday\n\nFlorida sophomore Anna Hall ran a lifetime best in the 200 meters Friday night to extend her lead in the women’s heptathlon, which concludes with three more events on Saturday.\n\nHall had the fastest 200 time of the day at 23.13 seconds, followed by Florida teammate Sterling Lester in 23.29. Washington junior Ida Eikeng was third in 23.81 and Duke senior Erin Marsh was fourth in 23.86.\n\nThose results kept Hall in first place with 3,922 points, followed by Marsh (3,674), Eikeng (3,640) and Lester (3,580).\n\nEarlier in the day, Hall finished third in the 100 (13.15), first in the high jump (5-11¼) and third in the shot put (44-5¼). The heptathlon concludes on Saturday with the long jump, javelin and 800 meters.\n\nFahnbulleh doubles up with two sprint victories\n\nFlorida sophomore Joseph Fahnbulleh was up to his usual tricks Friday night, hunting down the leaders in the 200 meters and pulling away for a resounding victory to sweep the two sprinting events.\n\nFahnbulleh won the 100 in similar fashion earlier in the evening, but the 200 result was even more emphatic. The sophomore rounded the final turn and hit the boosters as he blazed to victory in 19.83, which is the fourth-fastest time in collegiate history and the third-best time in the world this year.\n\nGeorgia sophomore Matthew Boling finished second in 20.13, Stanford freshman Udodi Onwuzurike was third in 20.15 and Texas senior Micaiah Harris was fourth in 20.45, but none of them really stood a chance once Fahnbulleh hit top speed over the final 80 meters.\n\nBurrell successfully defends his 400 hurdles title\n\nLSU sophomore Sean “Squirrel” Burrell runs his best when the stakes are the highest.\n\nBurrell, the defending NCAA champion in the 400 hurdles, almost didn’t advance out of the SEC Championships with an eighth-place finish last month, but he rallied to finish third at the East Preliminary meet and then ran his fastest time of the season in the preliminaries on Wednesday.\n\nBurrell was back on the track Friday night to defend his hurdles title and he did it with aplomb, withstanding a late challenge from Texas Tech senior Malik Metivier to win his second NCAA title with a time of 48.70. Metivier finished second in 49.13.\n\nOklahoma senior Isaiah Levingston finished third in 49.20, Baylor freshman Nathaniel Ezekiel was fourth (49.24) and Houston senior Quivell Jordan-Bacot was fifth (49.52).\n\nShankar closes senior season with high jump title\n\nKansas State senior Tejaswin Shankar had a long wait between NCAA titles.\n\nShankar won a high jump title as a freshman back in 2018, but finished as runner-up in each of the last two national meets. Friday night he was back atop the medal stand after clearing 7-5¼ to win the high jump in a showdown against Georgia senior Darius Carbin, who finished second at 7-4¼.\n\nBoth high jumpers cleared 7-4¼ on their first attempt but failed on three cracks at 7-5¼ before Shankar won the jump-off by going over the bar on his first try while Carbin clipped it on his final attempt.\n\nAuburn junior Dontavious Hill, Oklahoma senior Vernon Turner and Washington State senior Mitch Jacobson all cleared 7-3, with Hill taking third, Turner in fourth and Jacobson in fifth based on misses.\n\nTexas Tech's Zahafi outkicks the field to win 800 title\n\nFive runners logged lifetime bests in the 800 meters Friday night, but none of them could outkick Texas Tech senior Moad Zahafi.\n\nTexas A&M sophomore Brandon Miller took the lead on the last lap, followed by Zahafi and Mississippi State junior Navasky Anderson. Zahafi surged to the front with 200 meters to go and barreled down the home stretch with Miller and Anderson in tow. Ultimately, neither runner could make up any ground and Zahafi took home the title in 1:44.49.\n\nAnderson finished second in 1:45.02 and Miller was third in 1:45.09. Iowa State junior Jason Gomez claimed fourth in 1:46.34, Villanova sophomore Sean Dolan was fifth (1:46.38) and Arizona State freshman Dayton Carlson was sixth (1:46.72).\n\nAnderson, Gomez, Dolan, Carlson and Princeton freshman Samuel Rodman all ran personal bests in the race and Miller ran a season best.\n\nRoss wins back-to-back titles in the 400\n\nNorth Carolina A&T junior Randolph Ross defended his NCAA title in the 400 meters Friday, rounding the final turn and holding off two challengers to win in a season-best time of 44.13.\n\nFlorida junior Champion Allison couldn’t make up any ground in the final 100 meters and eventually finished second in 44.41, with Georgia junior Elija Godwin running a lifetime best 44.50 to claim third.\n\nTexas junior Jonathan Jones finished fourth in 44.93, Florida sophomore Ryan Willie was fifth (45.00), Oklahoma sophomore Richard Kuykendoll was sixth (45.73), UTEP sophomore Jevaughn Powell was seventh (45.81) and Ohio State senior Tyler Johnson was eighth (45.83).\n\nFlorida's Fahnbulleh surges to victory in 100, Williams fades\n\nFlorida sophomore Joseph Fahnbulleh takes a little while to hit top speed – but once he does, no one has better closing speed.\n\nFahnbulleh used his long strides to walk down the field in the 100 meters Friday night, surging past the competition in the final 20 meters to win an NCAA title in 10.00 seconds.\n\nAt 6 feet, 2 inches, Fahnbulleh bears at least a passing resemblance to perhaps the greatest sprinter of all time – Usain Bolt. Both runners tend to be slow out of the blocks, but early deficits quickly evaporate as the long-striders pick up speed with alarming pace.\n\nThat was the story on Friday night as Oregon’s Micah Williams and Tennessee’s Favour Ashe flew out of the blocks and took the early lead, but Fahnbulleh came flying down lane 7 and out-leaned both Ashe and North Carolina A&T’s Javonte Harding at the line.\n\nAshe finished second in 10.075 and Harding was third in 10.079. Florida State junior JoVaughn Martin took fourth in 10.09, Florida senior Dedrick Vanover was fifth (10.16), Georgia sophomore Matthew Boling was sixth (10.18) and Williams faded to seventh (10.19).\n\nCunningham comes close to NCAA record in 110 hurdles victory\n\nFlorida State senior Trey Cunningham and LSU senior Eric Edwards Jr. went stride-for-stride in a sizzling-fast 110 hurdles race, but Cunningham prevailed at the line after Edwards clipped the final hurdle with his trail foot.\n\nCunningham won in 13.00 and was just 0.02 seconds off the all-time collegiate record of 12.98, set by Florida’s Grant Holloway in 2019. It was Cunningham’s second straight title after winning the 60-meter hurdles at the NCAA Indoor Championships in March.\n\nEdwards finished second in 13.15, Michigan junior Joshua Zeller was third (13.26), and Clemson teammates Giano Roberts (13.442) and Lafranz Campbell (13.444) finished fourth and fifth, respectively.\n\nJaziri comes from behind to win 3,000 steeplechase\n\nMontana State junior Duncan Hamilton led nearly wire-to-wire in the 3,000 steeplechase Friday night, only to be overtaken on the final straightaway by Eastern Kentucky junior Ahmed Jaziri, who ran a lifetime best of 8:18.70 to win the NCAA title.\n\nIn fact, the top eight finishers all ran personal bests on Friday, with Hamilton finishing second in 8:18.878 and Georgetown sophomore Parker Stokes taking third in 8:18.880.\n\nHamilton went to the front of the pack from the start and seemed to be in control the whole way, but Jaziri and Stokes started pressing him as they headed into the final water jump. All three made the jump cleanly, then Jaziri found another gear after clearing the final hurdle with 70 meters to go. Hamilton edged Stokes at the finish line by 0.002 seconds.\n\nOklahoma State senior Ryan Smeeton finished fourth in 8:20.06, Princeton senior Ed Trippas was fifth (8:20.29), BYU sophomore Kenneth Rooks was sixth (8:22.56), while Minnesota teammates Alec Basten (8:23.86) and Matthew Wilkinson (8:25.03) finished seventh and eighth, respectively.\n\nThree Huskies place in 1,500 finals led by Waskom's victory\n\nIt was a great start for Pac-12 athletes Friday with Washington sophomore Joe Waskom winning the 1,500 title.\n\nWaskom emerged from a bunched field and surged to the front with 200 meters to go, and he held off a late push from Ole Miss junior Mario Garcia Romo to win in 3:45.58. Romo finished second in 2:45.69.\n\nWashington’s Luke Houser led for the majority of the race but Waskom began making his move around the 1,200-meter mark, passing on the outside and then pressing the pace for the final 200 meters. Princeton senior Sam Ellis and Wake Forest junior Thomas Vanoppen went with him but couldn’t match the pace down the final straight. Then Romo came blazing along the inside rail to pass them both and nearly edge Waskom at the line.\n\nEllis finished third in 3:45.82 and Vanoppen was fourth in 3:46.03. Houser faded to fifth in 3:46.13 and Washington teammate Nathan Green finished seventh in 3:46.26, giving the Huskies 16 team points from the event.\n\nThe 1,500 was missing one big name, with collegiate record holder Eliud Kipsang of Alabama failing to qualify out of Wednesday’s preliminaries. He ran 3:33.74 in April to break the old mark of 3:34.68, set by Notre Dame’s Yared Nuguse at last year’s ACC Championships.\n\nTrojans open Day 3 with victory in 4x100 relay\n\nUSC held off a late charge from Florida to win the 4x100 relay and capture the first title of the night Friday on Day 3 of the NCAA Outdoor Track & Field Championships at Hayward Field.\n\nThe Trojans had a solid lead at the last exchange but Florida’s Joseph Fahnbulleh ran a scorching anchor leg and nearly caught USC’s Johnnie Blockburger at the line, but the Trojans hung on to win in 38.49 with the Gators second in 38.52.\n\nHouston ran a season best of 38.64 to finish third, Tennessee was fourth in 38.83 and Baylor was fifth in 38.99.\n\nDay 3 features Ducks looking for 100 and triple jump titles\n\nDay 3 of the NCAA Outdoor Track & Field Championships meet Friday at Hayward Field will put a pair of Oregon stars in the spotlight, as Micah Williams and Emmanuel Ihemeje are favored to win national titles in the 100 meters and triple jump, respectively.\n\nThe opening round of the heptathlon gets going for the women at 1 p.m., followed by 14 men's finals beginning with the high jump at 5:30 p.m. The first event on the track is the 4x100 relay at 6:02 p.m.\n\nDAY 2: WOMEN'S DAY 1 and DECATHLON FINALS\n\nWomen's first day ends with Arizona State in lead\n\nAll the top seeds advanced in the 4x400 preliminaries, led by Texas A&M’s team of Tierra Robinson-Jones, Jaevin Reed, Jania Martin and Charokee Young running a time of 3:25.63.\n\nKentucky was close behind with a time of 3:25.67, while Arkansas (3:27.52), Texas (3:27.88), Florida (3:28.40), Baylor (3:29.03) and UCLA (3:29.17) all breaking the 3:30 barrier. Howard was the final qualifier with a time of 3:30.60.\n\nThe first day of women's competition ended with Arizona State in first place in the team standings with 18 points, followed by Virginia Tech, Nebraska and Florida with 14 apiece. Cal is in fifth place with 12 points, while Ohio State, Alabama, Louisville and BYU are tied for sixth with 10 points.\n\nLouisville's Leon wins pole vault title after long day\n\nLouisville senior Gabriela Leon outlasted the rest of the field during a marathon pole vault final, winning with a final clearance of 15-1.\n\nThe pole vault competition lasted three hours, with four vaulters advancing to take a crack at 15-1. Leon went over on her first try and the rest of the competition fell away. Arkansas sophomore Amanda Fassold and LSU senior Lisa Gunnarson each cleared 14-11 but Fassold took second place on callbacks, with Gunnarson in third.\n\nVirginia Tech senior Rachel Baxter finished fourth with a 14-9 clearance and teammate Julia Fixsen was fifth at 14-5¼.\n\nBYU's Riner wins javelin title with her first throw\n\nJust like with shot put, the NCAA javelin title was decided on the very first throw by BYU senior Ashton Riner, whose toss of 191-1 was enough to hold off the rest of the field through six rounds.\n\nRiner came into the meet with the best throw of the season, a 198-0 mark she set in April. She didn’t quite reach that distance on Thursday, but it was enough to hold off runner-up Maddie Harris of Nebraska, who threw 189-3 on her third toss but couldn’t improve on that mark.\n\nNorth Carolina junior Madison Wiltrout finished third at 185-3, Florida International sophomore Rhema Otabor was fourth (183-5) and Florida State senior Sara Zabarino was fifth (182-5).\n\nStanford got points from senior Virginia Miller, who finished seventh with a throw of 177-7, and Washington State freshman Valentina Barrios Bornacelli took eighth at 177-3.\n\nOhio State's Aquilla sets new collegiate record in shot put\n\nThe shot put title was never really in doubt, with Ohio State senior Adelaide Aquilla setting a new collegiate record of 64-5¼ on her first throw.\n\nAquilla, who also won the shot put at both the NCAA indoor and outdoor meets in 2021, broke the collegiate record of 63-10¼ that was set by Arizona State’s Maggie Ewen in 2018.\n\nArizona State senior Jorinde Van Klinken threw 60-11½ on her fourth attempt and no one else broke the 60-foot mark. Van Klinken finished second, Nebraska freshman Axelina Johansson was third (59-3) and Virginia freshman Maria Deaviz was fourth (58-11½).\n\nOregon sophomore Jaida Ross set a new lifetime best with a throw of 58-6 to finish fifth. It was the fourth time in the last five meets that Ross has established a new PR. Oregon teammate Mine De Klerk finished 13th with a throw of 55-4¼.\n\nAlabama's Chelangat makes up ground to win 10,000 title\n\nOne day after a similar strategy backfired for Campbell’s Athanas Kioko in the final of the men’s 10,000 meters, Washington junior Haley Herberg went out fast in the women’s distance race and tried to dictate the tempo before eventually being reeled in by the chase pack.\n\nAlabama junior Mercy Chelangat, last year’s runner-up, caught Herberg with 2,400 meters to go and proceeded to pull away from everyone, winning the 10,000 title in 32:37.08.\n\nRice sophomore Grace Forbes finished second in 32:48.07, Michigan State senior Jenna Magness was third (32:59.96), Colorado freshman Emily Covert was fourth (33:14.64), NC State junior Alexandra Hays was fifth (33:16.16), Oklahoma State sophomore Gabby Hentemann was sixth (33:18.04) and Herberg faded to seventh (33:20.33).\n\nNCAA Track & Field Men's Day 1:Good for Max Vollmer but not great for Oregon Ducks\n\nFlorida's Moore adds another long jump title\n\nFlorida sophomore Jasmine Moore swept the long jump and triple jump titles at the NCAA Indoor Championships in March, and now she will have a chance to sweep the outdoor titles as well.\n\nMoore uncorked a leap of 22-¾ on her first long jump attempt Thursday and held on to win against a very competitive field.\n\nNow she will come back on Saturday and go after the triple jump title.\n\nTexas A&M senior Deborah Acquah jumped 21-8 on her fifth attempt, but no one could budge Moore from the top of the long jump leaderboard. She eventually passed on her sixth and final attempt when no one else equaled her opening mark.\n\nAcquah finished second, Texas senior Tyra Gittens was third (21-6¾) and Texas Tech senior Monae’ Nichols was fourth (21-5½). Florida got some extra team points from sophomore Claire Bryant, who finished fifth with a jump of 21-4¼.\n\nKentucky's Steiner sets NCAA meet record in 200\n\nFresh off qualifying in the 100, Kentucky junior Abby Steiner set an NCAA meet record in the 200 by running 22.02 to win that event and qualify for another Saturday final.\n\nLSU sophomore Favour Ofili, who set the national collegiate record in April (21.96), finished second with a time of 22.13. Texas junior Kynnedy Flannel and Ohio State senior Anavia Battle went virtually step-for-step in the first heat of the 200, with Flannel winning in 22.25 to Battle's 22.26.\n\nOther qualifiers included Texas sophomore Kevona Davis (22.38), Florida State’s Edidiong Odiong (22.43), North Carolina A&T freshman Grace Nwokocha (22.44), Coastal Carolina sophomore Melissa Jefferson (22.54) and Tennessee sophomore Joella Lloyd (22.66).\n\nOregon senior Iman Brown ran 22.96 and finished 15th, and teammate Jasmine Montgomery finished 19th in 23.15.\n\nCollegiate Athlete Hall of Fame:Track greats inducted in star-studded ceremony at Hult Center\n\nNation's fastest 400 hurdlers don't disappoint\n\nThe two fastest 400 hurdlers in the country this season finished 1-2 in the preliminaries for that event Thursday, with Florida sophomore Anna Hall running 54.48 and Arkansas sophomore Britton Wilson running 54.72.\n\nKentucky junior Masai Russell, who has the third-fastest time in the nation, ran 56.15 to win the first heat and also qualify for Saturday’s final. Duke senior Lauren Hoffman qualified third overall in 55.47 and Arizona senior Shannon Meisberger was fourth in 55.79.\n\nOregon sophomore Alexandra Webster ran 57.25 but finished 11th, just three spots out of the final qualifying time. Howard junior Jessica Wright was actually slower in 57.35 but qualified automatically by finishing second in the third heat of the day.\n\nBoise State's Schoffield top 800 qualifier\n\nBoise State senior Kristie Schoffield and Villanova senior McKenna Keegan pushed each other to the two fastest times of the day in a quick third heat of the 800 prelims on Thursday.\n\nSchoffield won in 2:01.79 and Keegan ran a season-best time of 2:01.82 to finish second, while third-place finisher Imogen Barrett of Florida (2:02.24) and fourth-place Sarah Hendrick of Kennesaw State (2:02.34) both qualified on time due to the pace of the race.\n\nOklahoma State freshman Gabija Galvydyte won the second heat in 2:02.46 and qualified fifth, while LSU junior Katy-Ann McDonald (2:02.51) and Baylor senior Aaliyah Miller (2:03.05) also qualified out of the second heat.\n\nTexas junior Valery Tobias won the first heat in 2:03.50 and Florida junior Gabrielle Wilkinson was second in 2:03.70 to earn each runner a spot in Saturday’s final.\n\nFlorida's Talitha Diggs leads talented 400 final qualifiers\n\nSaturday’s 400 final will be loaded with talent after some fast times in the prelims.\n\nFlorida sophomore Talitha Diggs ran a sizzling 50.08 to win the first heat, followed by Texas junior Stacey Ann Williams in 50.18. Texas teammate Kennedy Simon ran 50.45 to win the third heat and Texas A&M sophomore Charokee Young ran 50.46 to win heat two.\n\nYoung has emerged from the shadow of former teammate Athing Mu, who turned professional after winning a pair of gold medals at the Tokyo Olympics. Young’s time of 49.87 back in April leads the nation this season and is the second-fastest time in the world this year.\n\nKentucky junior Alexis Holmes finished fifth in 50.75, and the other qualifiers were UCLA sophomore Shae Anderson (50.94), Arkansas freshman Rosey Effiong (51.06) and Baylor freshman Kavia Francis (51.17).\n\nOregon's Kemba Nelson finishes fourth in 100 prelims\n\nThere were some sizzling heats in the 100 preliminaries Thursday, with seven sprinters – including all three winners – clocking under 11 seconds.\n\nOregon senior Kemba Nelson ran 10.97 in the first heat and was still the slowest of the three heat winners. Texas sophomore Julien Alfred ran 10.90 to win the first heat and Kentucky junior Abby Steiner also ran 10.90 to win heat two.\n\nCoastal Carolina sophomore Melissa Jefferson qualified third overall with a time of 10.96 and North Carolina A&T freshman Grace Nwokocha was fourth in 10.97. Texas Tech sophomore Rosemary Chukwuma also cracked the 11-second barrier with a time of 10.99.\n\nUSC senior Celera Barnes was the odd man out, finishing just outside a qualifying spot in 10th with a time of 11.13.\n\nOregon junior Jadyn Mays finished 19th with a time of 11.28 and freshman Jasmine Montgomery was 21st in 11.37.\n\nFavorites advance in 100 hurdle preliminaries\n\nThere weren’t many surprises in the 100 hurdle prelims on Thursday, with LSU sophomore Alia Armstrong running 12.55 to finish first among nine qualifiers for Saturday’s final. Armstrong ran a wind-aided 12.33 earlier this season to lead the nation.\n\nShe was followed by North Carolina A&T senior Paula Salmon, who won the third heat in 12.68, and Kentucky junior Masai Russell, who won heat two in 12.77. USC sophomore Jasmine Jones had the third-fastest prelim time overall at 12.72.\n\nThe only real surprise was Baylor freshman Ackera Nugent withdrawing before the race. She had run the third-fastest time in the nation this season at 12.49 but lane three was vacant in the third and final heat.\n\nBeavers get two qualifiers in 3,000 steeplechase\n\nOregon State junior Kaylee Mitchell ran a lifetime best of 9:41.51 to win the second heat of the 3,000 steeplechase preliminaries, and teammate Grace Fetherstonhaugh qualified out of a fast first heat with a time of 9:45.17.\n\nArkansas senior Logan Jolly set a PR of 9:38.13 to win the first heat, followed by Notre Dame sophomore Olivia Markezich (9:40.81), West Virginia sophomore Ceili McCable (9:41.10) and BYU senior Courtney Wayment (9:41.21).\n\nFetherstonhaugh was the last automatic qualifier out of the first heat, finishing fifth. Colorado junior Madison Boreman finished sixth in 9:41.95 and also qualified for Saturday’s final.\n\nDucks finish fourth in 4x100 prelims, qualify for final\n\nOregon ran a season-best time of 42.64 in the 4x100 relay to finish fourth in Thursday’s preliminaries and qualify for Saturday’s final.\n\nThe Oregon team of Jadyn Mays, Kemba Nelson, Jasmin Reed and Jasmine Montgomery won heat number three and finished behind only Texas (42.34), Kentucky (42.53) and LSU (42.59), which came into the meet with the three fastest times in the country this season.\n\nAlso advancing to Saturday’s final were teams from Florida State, Ohio State, South Carolina, Central Florida and Coastal Carolina.\n\nStanford qualifies three runners in 1,500 prelims\n\nAll 12 runners in the second heat of the 1,500 prelims ran faster than everyone in heat one, but only seven runners advanced to Saturday’s final with both heats getting five automatic qualifiers and two other runners advancing on time.\n\nOle Miss sophomore Sintaheyu Vissa pulled away from the rest of the field in the final 200 meters to win heat two in 4:13.13. She was followed to the line by Stanford senior Julia Heymach (4:13.45), Arkansas senior Krissy Gear (4:13.48), Illinois sophomore Olivia Howell (4:13.76), Harvard freshman Maia Ramsden (4:14.12), Cincinnati senior Ellie Leather (4:14.20) and Stanford junior Melissa Tanaka (4:14.43).\n\nBinghamton senior Emily Mackay was the fastest runner in the first heat with a time of 4:21.44, and four other runners qualified from that heat despite running slower than four non-qualifiers from the second heat.\n\nCamryn Rogers top hammer thrower in collegiate history\n\nCal senior hammer thrower Camryn Rogers is in a league of her own.\n\nRogers reset her own collegiate record Thursday and outlasted five throwers who all set lifetime bests to win the women’s hammer final on the second day of the NCAA Outdoor Track & Field Championships.\n\nRogers, who finished fifth at the Tokyo Olympics last year, first broke the collegiate hammer record at last year’s NCAA meet, then she bested that at the West Preliminary meet last month and smashed it again on Thursday. That gives Rogers the four longest hammer throws in women’s collegiate history.\n\nTexas State senior Alyssa Wilson (245-4), Arizona State senior Beatrice Llano (236-6), Virginia Tech sophomore Sara Killinen (233-0), Arizona State junior Shelby Moran (231-7) and Ole Miss junior Jalani Davis (228-1) all set personal bests, but none of them were even close to Rogers’ throw of 254-10, which broke her old record of 250-10 and cemented her third NCAA title.\n\nVollmer no-heights in pole vault\n\nMax Vollmer made a mistake he couldn’t recover from. He didn’t clear a bar in the pole vault to go scoreless in that event and essentially end his competition in the decathlon.\n\nVollmer was in 11th place with 5,737 points when he missed on three attempts at 15-1 1/2 — his first height of day — but dropped to 21st.\n\nHe bailed out on his first two attempts and then clipped the bar on his third attempt.\n\nVollmer hasn't dropped out of the event yet. He was seen warming up for the javelin.\n\nFouls hurt Vollmer's decathlon standings\n\nMax Vollmer has taken a tumble in the decathlon standings.\n\nThe Oregon junior fouled on two of his three attempts in the discus and had to settle for a throw of 131-1 as he dropped from fifth place to 11th after seven events.\n\nVollmer has 5,737 points heading into the pole vault.\n\nDecathlon begins with 110 hurdles\n\nMax Vollmer remains in fifth place in the decathlon after the first event of Day 2 Thursday, as he scored 858 points in the 110-meter hurdles with a 14.93-second finish.\n\nIt wasn’t a great performance by Vollmer, who set his personal-record in the event earlier this season when he ran 14.40. Vollmer clipped his first hurdle Thursday and had to regain his stride as he finished last in his heat.\n\nHe didn’t lose ground in the overall standings, though he slipped further behind in points.\n\nAfter six events, the top four continue to be Ayden Owens-Delerme of Arkansas at 5,474, Georgia’s Kyle Garland (5,432), Texas’ Leo Neugebauer (5,325) and California’s Hakim McMorris (5,182) as the competition moves to the discus.\n\nSecond day of NCAA championships begins Thursday\n\nThe second day of the NCAA Outdoor Track & Field Championships features the continuation of the men's decathlon starting at 11:30 a.m. The remaining events run through the day and include 110 hurdles, discus, pole vault, javelin and 1,500.\n\nThe women's competition begin with field events at 3 p.m. and track events start at 5:30 p.m.\n\nCheck back here throughout the day to stay up-to-date on the meet's progress.\n\nWomen's events:Top women's events and athletes to watch during NCAA Track & Field Championships\n\nMEN'S DAY 1 UPDATES - Wednesday\n\nPrinceton brothers both finish on top in pole vault finals\n\nNorwegian pole vaulters Sondre and Simen Guttormsen both finished in the top-five of Wednesday’s final in that event to lead a strong showing for Princeton.\n\nSondre Guttormsen won an NCAA pole vault title with his clearance of 18-10¼ and brother Simen finished fourth with a mark of 18-6½ to score 15 team points for the Tigers.\n\nSam Houston senior Clayton Fritsch finished second with a mark of 18-8¼ and Kentucky sophomore Keaton Daniel was third at 18-6½. Branson Ellis of Stephen F. Austin finished fifth (18-6½) and Zach McWhorter of BYU was sixth (18-4¼). Kansas had two vaulters in the top-10 with freshman Clayton Simms taking seventh place (18-½) and junior Zach Bradford finishing ninth (18-½).\n\nThe 15 points put Princeton in third place in the team standings after the first day of competition. Tennessee scored 21 points on Wednesday to move into first place and Florida State sits in second with 16. Texas (12), Alabama (11), Notre Dame (10), Penn (10) and Southeast Missouri (10) all hit double digits in the team scoring.\n\nMen's preview:Top events and athletes to watch during men's NCAA Track & Field Championships\n\nFavorites advance in 4x400 relay\n\nThere weren’t many surprises in the 4x400 preliminaries on Wednesday, with the top-ranked teams all advancing to Friday’s final.\n\nTexas and Alabama finished 1-2 in a fast first heat, with Texas winning in 3:00.31 and Alabama taking second in 3:00.42. Florida, which set the all-time collegiate record earlier this season (2:58.53), finished third in 3:01.30. LSU took fourth (3:01.67) and Kentucky was fifth (3:01.68).\n\nIowa, Texas A&M, USC and North Carolina also advanced to the final.\n\nPenn sophomore wins javelin title\n\nThe second flight of Wednesday’s javelin final featured 10 of the best throws of the day, with Penn sophomore Marc Minichello winning with his heave of 266-3.\n\nMinichello went to the front of the pack on his third throw and was never really challenged. Virginia junior Ethan Dabbs moved into second place with a fifth throw of 261-5 and LSU sophomore Tzuriel Pedigo finished third at 258-10.\n\nWichita State junior Taran Taylor finished fourth (258-5), Baylor freshman Chinecherem Prosper Nnamdi was fifth (257-11) and UT-Arlington sophomore Arthur Petersen was sixth (250-5).\n\nOregon freshman Ty Hampton just missed out on a spot on the medal stand with a 10th-place finish, throwing 236-7.\n\nPiperi leaves no doubt about shot put title\n\nTexas senior Adrian Piperi added an NCAA title to his trophy case, winning Wednesday’s shot put final with a throw of 70-7¼ to come up just short of his personal best of 71-4.\n\nPiperi finished second at last year’s NCAA Outdoor Championships and he added a second-place finish at the Indoor Championships in March. There would be no runner-up finish this time, as the senior took the lead with his very first throw and never relinquished it.\n\nArizona State junior Turner Washington finished second at 69-¾ and Alabama senior Isaac Odugbesan was third at 67-2¼. Tennessee junior Jordan West took fourth place with a mark of 66-6½ and Northern Iowa senior Darius King was fifth at 65-9.\n\nJacobs overtakes Nur for 10,000 victory\n\nCampbell senior Athanas Kioko made a bold move Wednesday to go out hard in the 10,000 finals and leave the chase pack in the dust, but the gamble did not pay off.\n\nKioko sprinted to the front and established a 100-meter gap between himself and the rest of the field, leading for 19 laps before being reeled in by the pack.\n\nNorthern Arizona junior Abdihamid Nur and Notre Dame junior Dylan Jacobs surged to the front and led the rest of the way until Jacobs found another gear for the final 200 meters to win the NCAA title in 28:12.32. Jacobs closed out his victory with a final lap of 55.45.\n\nOklahoma State sophomore Alex Maier overtook Nur down the final straightaway to finish second in 28:12.68 and Nur was third in 28:14.51. Kioko faded to fifth with a time of 28:17.17.\n\nOregon senior Aaron Bienenfeld finished eighth in 28:19.05 to earn the Ducks a point in the team standings. Stanford sophomores Cole Sprout and Charles Hicks both finished in the top-six, with Sprout fourth in 28:14.89 and Hicks sixth in 28:14.89.\n\nPinnock wins long jump for Tennessee\n\nTennessee freshman Wayne Pinnock led the Volunteers to a big day in the long jump, winning the second field final Wednesday with a leap of 26-3½.\n\nPinnock’s teammates Carey McLeod finished fourth at 25-11 and Anthony Riley was eighth at 25-7¼ to give the Volunteers 18 team points in just the one event.\n\nPinnock finished in a tie with Florida State sophomore Jeremiah Davis, but won the NCAA title on a callback by virtue of having a better second jump. Pinnock’s second-best effort was 26-1½ to Davis’ mark of 25-10. Florida State also got a third-place finish from senior Isaac Grimes, who jumped 26-1¾.\n\nBrandon Hicklin of North Carolina A&T finished fifth (25-9½), A’Nan Bridgett of Rutgers was sixth (25-9¼) and Stacy Brown Jr. of Texas was seventh (25-7½).\n\nHarding disqualified in 200 prelims\n\nNorth Carolina A&T sophomore Javonte Harding ran a lifetime best of 19.98 in the 200 but was disqualified for a lane violation during Wednesday’s preliminaries, putting a serious dent in the Aggies’ team title hopes.\n\nInstead, Florida sophomore Joseph Fahnbulleh finished first in 20.10, using his long strides to break away from a loaded heat that included national leader Micaiah Harris of Texas (20.28) and third-seeded Matthew Boling of Georgia (20.24).\n\nOhio State senior Eric Harrison had the second-fastest time Wednesday at 20.18 and Stanford freshman Udodi Onwuzurike finished third in 20.24 after failing to qualify in the 100 earlier in the day.\n\nDefending 400 hurdles champ Burrell advances in prelims\n\nDefending NCAA 400 hurdles champion Sean \"Squirrel\" Burrell of LSU ran his fastest time of the season Wednesday to finish third and advance to Friday’s final.\n\nBurrell hadn’t cracked 50 seconds this season and barely qualified for the East Regionals with an eighth-place finish at the SEC Championships, but he ran 49.19 on Wednesday to win his heat and finish third overall. Burrell won a national title last season with his PR of 47.85.\n\nTexas Tech senior Malik Metivier finished first in a fast heat to take first place in 48.89 and Montana State senior Drake Schneider was second in 49.08.\n\nBaylor freshman Nathaniel Ezekiel, who has the fastest time in the nation this season at 48.53, qualified for the final with a fifth-place finish in 49.44.\n\nFavorites advance in 800 preliminaries\n\nMississippi State junior Navasky Anderson and Texas A&M junior Brandon Miller led the day’s fastest heat in the 800 to finish in the top two spots and qualify for Friday’s final.\n\nAnderson ran 1:45.94 to claim first and Miller ran 1:46.00 to take second. Lipscomb senior Jonathan Schwind was third in 1:46.40 and Texas Tech senior Moad Zahafi – who owns the nation’s fastest time this season at 1:43.69 – finished fourth by winning his heat in 1:46.66.\n\nArizona State freshman Dayton Carlson was the final qualifier on time, running 1:47.45 to finish eighth. Oregon sophomore Luis Peralta finished 22nd in 1:50.02.\n\nTop seeds advance in 400 preliminaries\n\nPaired in the same preliminary heat of the 400, Florida junior Champion Allison and North Carolina A&T junior Randolph Ross blew away the field and coasted across the finish line side-by-side Wednesday before exchanging a congratulatory hug and moving on to Friday’s finals.\n\nTwo of the fastest 400 runners in the nation, Allison won the prelims with a time of 44.29 and Ross was second in 44.43. Both of those times came in under the season’s previous best mark (44.54), which was set by Texas junior Jonathan Jones, who finished third with a time of 44.97.\n\nFractions of seconds separated fourth place from sixth place, with UTEP sophomore Jevaughn Powell running 45.462, Georgia junior Elija Godwin running 45.465 and Florida sophomore Ryan Willie running 45.470.\n\nOregon's Williams blows away 100-meter field\n\nThe “Quad God” will run again on Friday.\n\nOregon sophomore Micah Williams blew away the field in the 100 preliminaries Wednesday, running a time of 10.03 to easily beat Florida State junior JoVaughn Martin (10.10) and Florida sophomore Joseph Fahnbulleh (10.11).\n\nThe next three places were decided by 0.003 seconds. Florida senior Dedrick Vanover was fourth in 10.146, while Houston sophomore Shaun Maswanganyi and Tennessee freshman Favour Ashe tied for fifth at 10.149.\n\nNew Orleans sophomore Ismael Kone, who had the third-fastest time in the nation this season (9.94), ran 10.23 and finished 15th to miss out on Friday’s final, and Texas senior Micaiah Harris, who had the nation’s fourth-fastest time (9.96), crashed out in 23rd place at 10.44.\n\nCunningham breezes to victory in 110 hurdles prelims\n\nFlorida State senior Trey Cunningham, who owns the fastest 110-meter hurdle time in the world this year, easily won that event during Wednesday’s preliminary heats.\n\nCunningham ran 13.21 to pull away from the field, setting up a showdown with LSU senior Eric Edwards Jr in Friday’s final. Edwards ran 13.33 to finish second in the prelims, followed by Syracuse sophomore Jaheem Hayles (13.44), Michigan junior Joshua Zeller (13.45) and Charlotte sophomore Justin Leaston (13.46).\n\nThe only big surprise was Arkansas junior Tre’Bien Gilbert, who had the nation’s fourth-fastest time this season, finishing 10th in 13.55 and missing out on the final qualifying spot to Clemson junior Giano Roberts, who ran 13.54.\n\nSteeplechase won with nation's fastest time\n\nMontana State junior Duncan Hamilton used a 63-second last lap to pull away from the field in the 3,000 steeplechase and win with a time of 8:23.13, which was a lifetime best and the fastest time in the nation this season.\n\nEastern Kentucky junior Ahmed Jaziri – who had the season’s previous best time – finished fourth in 8:26.27, just behind BYU sophomore Kenneth Rooks (8:24.88) and Georgetown sophomore Parker Stokes (8:26.04).\n\nWashington State senior Colton Johnsen snuck into Friday’s final with an 11th-place finish in 8:31.64.\n\nCollegiate record holder Kipsang crashes out of 1,500\n\nOne of the biggest shocks of Wednesday’s preliminaries was Alabama sophomore Eliud Kipsang, the collegiate record holder in the 1,500, fading to the back of the pack and finishing last in his heat to miss out on a spot in Friday’s final.\n\nKipsang set the college record of 3:33.74 at the Bryan Clay Invitational in April, but he ran 3:43.30 in the preliminaries to finish 20th and well off the pace.\n\nIllinois senior Jonathan Davis had the fastest time Wednesday at 3:37.39, followed by Nathan Green of Washington (3:37.46), Sam Ellis of Princeton (3:37.60) and Thomas Vanoppen of Wake Forest (3:37.65), who all ran personal bests. Washington qualified three runners for the final, with sophomores Joe Waskom finishing eighth (3:39.45) and Luke Houser taking 10th (3:39.60).\n\nOregon sophomore Elliott Cook ran a time of 3:44.47 and finished 21st, with only the top 12 runners advancing.\n\nVollmer PRs in the high jump\n\nMax Vollmer is on a roll in the decathlon.\n\nThe three-time Pac-12 champion set a PR in the high jump when he cleared 6-6 on his second attempt. It was a third-straight season-best for Vollmer on Wednesday.\n\nHe scored 785 to strengthen his hold on fourth place in the overall standings with 3,332 points.\n\nLeo Neugebauer of Texas cleared 6-9 1/2 and was the top scorer in the third straight event as he continues to lead with 3,569 points. Georgia’s Kyle Garland is second with 3,561 and Ayden Owens-Delerme is third at 3,487.\n\nDucks narrowly miss out on 4x100 qualifying time\n\nOregon’s 4x100 relay team missed out on qualifying for Friday’s final by 0.016 seconds, finishing 11th with a time of 39.00.\n\nClemson nabbed the ninth and final qualifying spot by the narrowest of margins, running 38.984 to Virginia Tech’s 38.987. Houston had the fastest preliminary time at 38.66, followed by Tennessee (38.80), USC (38.83), Texas (38.91) and Florida (38.94).\n\nSE Missouri's Blomquist wins hammer throw\n\nSoutheast Missouri senior Logan Blomquist uncorked a personal best of 240-8 on his sixth and final attempt to win the hammer throw Wednesday in the first final of the NCAA Outdoor Track & Field Championships.\n\nBlomquist’s throw was a 7-inch personal best and moved him to the top of the medal stand ahead of Penn State junior Tyler Merkley (238-6) and Minnesota sophomore Kostas Zaltos (237-10).\n\nDecathlon is underway; Ducks' Vollmer in fourth\n\nMax Vollmer made a big jump up the standings with a season-best throw in the shot put.\n\nThe Oregon decathlete threw 50 feet, 6¼ inches on his final attempt to score 814 points and move from 10th to fourth place overall with 2,547 points.\n\nThe throw was second-best among the 22 competitors.\n\nVollmer remains 154 points behind leader Leo Neugebauer (2,701) of Texas. Kyle Garland (2,693) of Georgia is in second place and Ayden Owens-Delerme (2,674) of Arkansas is third.\n\nVollmer records season-best in long jump\n\nThe Ducks' Max Vollmer is in 10th place after two events in the decathlon after recording a season-best 23 feet, 5½ inches in the long jump for 850 points.\n\nThe Oregon junior has 1,733 points and is 149 behind Georgia’s Kyle Garland, who leads with 1,882.\n\nArkansas junior Ayden Owens-Delerme (1,879), Texas sophomore Leo Neugebauer (1,850) and California’s Hakim McMorris (1,831) are all with striking distance as the event moves to the shot put.\n\nGeorgia senior Johannes Erm, who came into the meet ranked fourth in the NCAA this season, has pulled out of the competition after jogging his way through the finish line in the opening 100 meters.\n\nDecathlon gets underway with the 100\n\nOregon’s Max Vollmer opened the NCAA Outdoor Track & Field Championship by running 10.90 seconds in the decathlon men’s 100 meter.\n\nIt was considerably slower than his season-best of 10.72 from the Pac-12 championships in May.\n\nWith 883 points, Vollmer is in ninth place heading into the long jump.\n\nArkansas’ Ayden Owens-Delerme ran 10.41 and Georgia’s Kyle Garland ran a PR 10.63 as they are the lead with 996 and 945 points, respectively.\n\nGeorgia senior Johannes Erm, who came into the meet ranked fourth in the NCAA this season, pulled up in his race and jogged through the finish line in 14.26 for 276 points.\n\nMen's Day 1 starts at 12:30 p.m. with the decathlon with field events starting at 2 p.m. and track events starting at 4:30 p.m.\n\nDucks competing:'Quad-God' Micah Williams in hot pursuit of 100 title at NCAA Track & Field Championship\n\nFor more sports coverage, visit registerguard.com. Want more stories like this? Subscribe to get unlimited access and support local journalism.\n\nFollow Chris Hansen on Twitter@chansen_RG or email atchansen@registerguard.com."}, {"url": "https://olympics.com/en/news/1960-rome-olympics-milkha-singh-400m-race-finished-fourth-national-record", "page_content": "Track and field has not been India’s forte at the Olympic Games.\n\nBut while finding an Indian equivalent of a Usain Bolt is an ongoing pursuit, the country has unearthed some track and field treasures in the past.\n\nMilkha Singh was one such gem.\n\nOne of the most celebrated athletes of his generation, the nation had its hopes pinned on Milkha coming into the 1960 Olympic Games in Rome. The Flying Sikh, as he was popularly nicknamed, was into his second Olympics and was coming into the quadrennial extravaganza on the back of a splendid show at the 1958 Asian Games, where he had won the 400m gold in Tokyo.\n\nHe might have dominated the continental stage - his back-to-back gold medals at the 1958 and 1962 Asian Games a testament to this - but one race that Milkha Singh fondly remembers is the one where he turned out to be a gallant loser, finishing fourth at the Rome 1960 Olympics.\n\nMilkha Singh at the Olympics: A photo finish\n\nParticipating in the 400m race, Milkha Singh got through the heats with relative ease. The quarter-finals saw him better his timing by more than a second while in the semis, he would finish behind USA’s Otis Davis in 45.9 seconds, the fourth-fastest to make it to the final.\n\nWith impressive timings in all the preliminary races, the Indian was one of the favourites going into the final. And the manner in which he started the race, it looked like India’s dream of winning a track medal at the Olympics could finally come true.\n\nFiring off the blocks, Milkha was quick to join the lead pack. He continued to push himself, keeping his pace up for much of the first part of the run and looked certain of a podium finish, which would have created history for India at the Olympics.\n\nHowever, an error in judgment saw him slow down before the final turn, giving Malcolm Spence of South Africa enough room to close down on the Indian.\n\nThe move proved too costly for Milkha Singh, as Spence edged ahead to take the bronze medal in 45.5 seconds while the Indian fell mighty close, finishing his run 0.1 seconds slower, leading to a photo finish at the line and leaving him wondering about the ‘what-ifs’.\n\nThe race was won by Otis Davis clocking 44.9 seconds, a world record then, and by a paper-thin margin over German Carl Kaufmann.\n\n\"I knew what my fatal error was,\" Milkha Singh said. \"After running perilously fast in lane five, I slowed down at 250m and could not cover the lost ground after that, and that cost me the race.\""}]}