{"Susan Pedersen won the 200-yard butterfly in 1985 and 1986.": [{"url": "https://olympics.com/en/athletes/susan-jane-pedersen", "page_content": "Biography\n\nSue Pederson won a gold medal in both relays at the Mexico Games as the U.S. set a new Olympic record in each. She also won two silvers in individual events and placed fourth in the 400 IM. She competed for the Arden Hills SC and, in addition to winning three silver medals at the 1967 Pan-American Games, won four AAU titles. Pederson set three world records in her short career, one in the 200 freestyle, and one in the medley relay and the 4x200 free relay. She also set nine American records.\n\nPederson retired after the 1968 Olympics, and later attended the University of Louisville. She and her family settled in Tacoma, Washington, where she worked as a certified public accountant."}, {"url": "https://www.celebsagewiki.com/susan-pedersen-swimmer", "page_content": "Age, Biography and Wiki\n\nSusan Pedersen was born on 16 October, 1953 in Sacramento, California, United States, is an American swimmer. Discover Susan Pedersen's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 69 years old?\n\nPopular As N/A Occupation N/A Age 69 years old Zodiac Sign Libra Born 16 October 1953 Birthday 16 October Birthplace Sacramento, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 16 October. She is a member of famous Swimmer with the age 69 years old group.\n\nSusan Pedersen Height, Weight & Measurements\n\nAt 69 years old, Susan Pedersen height is 1.75 m and Weight 70 kg.\n\nPhysical Status Height 1.75 m Weight 70 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nSusan Pedersen Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Susan Pedersen worth at the age of 69 years old? Susan Pedersen’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Susan Pedersen's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nSusan Pedersen Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Susan Pedersen Wikipedia Imdb\n\nTimeline"}, {"url": "https://news.mit.edu/2016/kogut-wins-200-butterfly-national-title-ncaa-championship-0323", "page_content": "On the third night of the NCAA Division III Swimming and Diving Championship held last week in Greensboro, North Carolina, sophomore Douglas Kogut captured the 200-yard butterfly national title with a time of 1:47.28. His mark earned him All-America honors, a new MIT standard, and new personal record.\n\nMIT’s first 200-fly national champion, Kogut is the second men’s swimmer to claim an individual national championship. The only other Engineer to accomplish this feat was Wyatt Ubellacker '13, who won both the 50-yard freestyle and 100-yard butterfly in 2013.\n\nKogut began the day with the third-fastest qualifying time, 1:48.45, in preliminary action, which at the moment was a season-best and career-best for the sophomore. He then shaved 1.17-seconds off his mark in the championship final, touching the wall in first place with a time of 1:47.28 for the victory.\n\nOver the course of the four-day meet, Kogut earned two All-America awards (200-butterfly and 200-backstroke) with the team as a whole totaling 30 All-America honors. The MIT men’s swimming and diving team finished fifth at the championship with 241.50 points, the fifth time in the last six years in which the Engineers placed in the top-five teams at the national meet."}, {"url": "https://www.wikiwand.com/en/Susan_Pedersen_(swimmer)", "page_content": "Susan \"Sue\" Jane Pedersen (born October 16, 1953), also known by her married name Susan Pankey, is an American former competition swimmer, four-time Olympic medalist, and former world record-holder in two events.\n\nAmerican swimmer\n\nQuick facts: Personal information, Full name, Nicknam... ▼\n\nAs a 15-year-old, Pedersen represented the United States at the 1968 Summer Olympics in Mexico City, where she received a total of four medals.[1] She won a gold medal as a member of the winning U.S. team in the women's 4×100-meter medley relay, and another swimming for the first-place U.S. team in the women's 4×100-meter freestyle relay, while setting Olympic records in both.[2] Individually, she received silver medals for her second-place finishes in the women's 100-meter freestyle (1:00.3),[3] and women's 200-meter individual medley.[4]\n\nShe held the world record in the 200-meter freestyle (2:09.5) from July 6, 1968, to August 2, 1968. She was also a member of world-record U.S. teams in the 4×100-meter medley relay and the 4×200-meter freestyle relay.[5]\n\nPedersen was inducted into the International Swimming Hall of Fame as an \"Honor Swimmer\" in 1995.[5]"}, {"url": "https://www.liquisearch.com/miss_california/winners", "page_content": "Winners\n\nYear Name Hometown Age Local Title Miss America Talent Placement at Miss America Special scholarships at Miss America Notes\n\n2012 Leah Cecil Garden Grove 22 Miss Southern California Regional Classical Harp Contestant at National Sweetheart 2011\n\n2011 Noelle Freeman Carlsbad 22 Miss Culver City Ballet En Pointe \"The Black Swan Variation\" from Swan Lake 4th Runner-Up at Miss America 2012 Winner of the 2007 Miss Teenage California Scholarship Pageant.\n\n2010 Arianna Afsar San Diego 19 Miss San Diego County Vocal \"I Who Have Nothing\" Top 10 at Miss America 2011 Previously Miss California's Outstanding Teen 2005, first runner-up at Miss America's Outstanding Teen 2005; Top 36 contestant on American Idol 8\n\n2009 Kristy Cavinder Orange 21 Miss Yosemite Valley Ballet en Pointe \"The Slave Maiden Variation\" from Le Corsaire First runner-up Miss America 2010 Preliminary Talent Award\n\n2008 Jackie Geist Vacaville 22 Miss Hollywood Ballet en Pointe \"The Dying Swan\" Top 7 at Miss America 2009 Runner up in the Miss Teenage California Scholarship Pageant.\n\n2007 Melissa Chaty Ukiah 24 Miss North Coast Operatic Vocal \"The Jewel Song\" from Faust Top 8 Finalist Winner of the 2003 Miss Teenage California Scholarship Pageant.\n\n2006 Jacquelynne Fontaine Moorpark 24 Miss Santa Barbara County Operatic Vocal \"Vissi d'arte\" Top 10 at Miss America 2007 Preliminary Talent Award\n\n2005 Dustin-Leigh Konzelman Carlsbad 23 Miss San Diego Fiddle \"Twelfth Street Rag\" Preliminary Talent Award and Non-Finalist Talent Award Contestant on The Amazing Race 10 with partner Kandice Pelletier (Miss New York)\n\n2004 Veena Goel Laguna Hills 22 Miss Southland Jazz Dance \"Hot Honey Rag\" from Chicago 4th runner-up to Miss America 2005 Preliminary Talent Award Contestant at National Sweetheart 2003\n\n2003 Nicole Lamarche Berkeley 24 Miss San Francisco Vocal \"At This Moment\" 4th runner-up Preliminary Swimsuit Award; Final Night Swimsuit Award Contestant at National Sweetheart 2001 as Miss Arizona\n\n2002 Jennifer Glover Castro Valley 23 Miss Contra Costa County Contemporary Vocal \"A New Life\" from Jekyll & Hyde Previously Miss California USA 2001, 1st runner up at Miss Oktoberfest 2000, was Miss USA at Miss International 1999, Top 10 Finalist at the 1997 Miss Teenage California Scholarship Pageant\n\n2001 Stephanie Baldwin Fullerton 23 Miss Northern California Regional Vocal \"Time to Say Goodbye\" Top 20 at Miss America\n\n2000 Rita Ng Tracy 22 Miss Los Altos Classical Piano \"Sonata Appassionata\" 2nd runner-up Preliminary Talent Award; Miss America Scholar award\n\n1999 MaryAnne Sapio Rohnert Park 21 Miss Gavilan Hills Tap Dance \"Go Daddy-O\" Non-finalist Talent Award\n\n1998 Danielle Coney Santa Clara 21 Miss Gavilan Hills Vocal \"A Piece of Sky\" from Yentl Non-finalist Talent Award; Waterford Business Scholarship\n\n1997 Rebekah Ann Keller Lakewood 22 Miss Los Angeles County Vocal \"Someone Like You\" from Jekyll & Hyde 4th runner-up Preliminary Swimsuit Award Later Miss California USA 2000\n\n1996 Lyndsay Kahler Orange 22 Miss City of Orange Vocal \"Where Is It Written?\" from Yentl\n\n1995 Tiffany Stoker Clovis 21 Miss Clovis Vocal \"Think of Me\" 3rd runner-up Preliminary Swimsuit Award Previously America's Junior Miss 1992\n\n1994 Jennifer Hanson La Habra 21 Miss Garden Grove Vocal \"Since I Fell for You\" Non-finalist Talent Award Country music singer/songwriter\n\n1993 Lisa Michelle Duncan Tulare 21 Miss Tulare County Character Ballet \"Turkey in the Straw\" Preliminary Swimsuit Award\n\n1992 Patricia Northrup Agoura Hills 23 Miss Los Angeles County Vocal Medley Pilot for American Airlines, judge for the 2001 Miss America Pageant\n\n1991 Paige Adams Hemet 22 Miss Los Angeles County Vocal Medley \"Some Day My Prince Will Come\" Former Alaska's Junior Miss 1986, Judge for the 2008 Miss America Pageant\n\n1990 Maria Ostapiej La Mesa 24 Miss San Diego North County Classical Vocal Medley \"Phantom of the Opera\" & \"Angel of Music\" Non-finalist Talent Award\n\n1989 Wendy Berry San Pedro 22 Miss Centinela Valley Classical Ballet \"The Black Swan\" from Swan Lake Harvard Professor\n\n1988 Marlise Ricardos San Pedro 26 Miss Lomita Dramatic Vocal \"I Dreamed a Dream\" 3rd runner-up\n\n1987 Simone Stephens Cerritos 25 Miss El Camino Stand-up Comedy\n\n1986 Lisa Kahre Salinas 19 Miss San Ramon Valley Flute Solo \"Carnival of Venice\" Non-finalist Talent Award\n\n1985 Lisa Davenport Santa Cruz 23 Miss San Mateo County Popular Vocal \"Once in my Lifetime\" Assumed the title in 1982 when Debra Maffett won Miss America & became the 1st such titleholder to win a state title and compete at Miss America.\n\n1984 Donna Cherry Northridge Miss West Los Angeles Impersonations / Vocal \"Quando me'n vo\"\n\n1983 Shari Moskau Mission Viejo 19 Miss Saddleback Valley Popular Vocal \"Greatest Love of All\"\n\n1982 Lisa Davenport Santa Cruz 20 Assumed the title when Debra Maffett won Miss America; Later Miss California 1985\n\nDebra Maffett Anaheim 25 Miss Anaheim Popular Vocal \"Come In From the Rain\" Winner Preliminary Swimsuit Award; Preliminary Talent Award\n\n1981 Cheryl Vancleave Riverside 20 Miss Los Angeles County Country Western Vocal Medley \"I Was Country When Country Wasn't Cool\" & \"You're Lookin' at Country\" Married Frank Kalil, mother of Ryan Kalil.\n\n1980 Robin Brooks Elverta 23 Miss Fullerton Patriotic Vocal Medley \"America the Beautiful\" & \"Battle Hymn of the Republic\"\n\n1979 Deanna Rae Fogarty Azusa 22 Miss Azusa Vocal \"Cabaret\" Toured with Miss America USO Troupe & was a featured performer for several Miss America pageants in the early 80s\n\n1978 Christine Louise Acton Chula Vista 23 Miss San Bernardino County Flute / Piccolo Solo \"Hungarian Peasant Suite\" Non-Finalist Talent\n\n1977 Connie Lee Haugen Redlands 24 Miss San Bernardino County Vocal \"Nobody Does It Like Me\" from Seesaw Top 10 Semi-Finalist\n\n1976 Linda Michelle Mouron Orange 19 Miss Orange County Tap Dance \"Puttin' On the Ritz\" 3rd runner-up Toured with Miss America USO Troupe\n\n1975 Janet Jaye Carr San Gabriel 21 Miss Pomona Valley Vocal \"They Call the Wind Maria\" from Paint Your Wagon 2nd runner-up Preliminary Swimsuit Award\n\n1974 Lucianne Buchanan Claremont 21 Miss Pomona Valley Harp \"Concerto in B Flat\" 1st runner-up Preliminary Swimsuit Award Toured with Miss America USO Troupe; assumed the Miss California title when the original winner, Alice Tobler, resigned due to Mononucleosis.\n\n1973 Susan Kaye Shipley Hillsborough 21 Miss San Joaquin County Piano \"Malaguena\" Top 10 Semi-Finalist\n\n1972 Diane Wagner Daly City 20 Miss San Mateo County Ballet \"Swan Lake\" Toured with Miss America USO Troupe\n\n1971 Carolyn Jean Stoner Belmont 18 Miss San Mateo County Gymnastic Ballet \"Malaguena\" Preliminary Swimsuit Award\n\n1970 Karin Kascher Castro Valley 18 Miss Hayward Violin \"Méditation\" Non-Finalist Talent Award\n\n1969 Susan Ellen Anton Yucaipa 18 Miss Redlands Vocal \"Get Happy\" & \"Put On a Happy Face\" 2nd runner-up Actress, best known for her role as \"Susan Williams\" in the various Stop Susan Williams!-related television series and television movies. Toured with Miss America USO Troupe\n\n1968 Sharon Terrill Torrance 21 Miss Torrance Dramatic Reading \"Little Word, Little White Bird\" by Carl Sandburg Non-Finalist Talent Award\n\n1967 Karen Pursell Lindsay 22 Miss Fresno County Vocal \"Much More\" from The Fantasticks\n\n1966 Charlene Diane Dallas Danville 19 Miss Contra Costa County Piano \"Toccata\" by Khachaturian 1st runner-up Preliminary Swimsuit Award; Preliminary Talent Award Featured Performer on the 1967 Miss America Telecast; Charlene Dallas assumed the Miss California title when the original winner, Donna Danzer, resigned during the coronation gala for school and personal reasons.\n\n1965 Sandra Lynne Becker Covina 18 Miss Los Angeles County Semi-Classical Vocal \"Make Believe\" Non-finalist Talent Award\n\n1964 Sherri Lee Raap Fremont 18 Miss Oakland Jazz Baton Dance & Acrobatics Preliminary Swimsuit Award\n\n1963 Wendy Douglas Sacramento Miss Sacramento Vocal \"Summertime\" Top 10 Semi-finalist\n\n1962 Pamela Gamble Carmel 18 Miss Monterey County Classical Jazz Interpretive Dance\n\n1961 Susan Henryson Fresno 19 Miss Fresno County Vocal \"You've Got to See Momma Every Night\" Top 10 Semi-finalist Preliminary Talent Award voted Miss Congeniality, was a featured performer for the 1962 Miss America Pageant\n\n1960 Suzanne Reamo La Mesa 20 Miss San Diego Vocal \"Love is Where You Find It\" 1st runner-up\n\n1959 Susan Bronson San Lorenzo 19 Miss Southern Alameda County Modern Dance \"An American in Spain\" 3rd runner-up\n\n1958 Sandra Jennings Riverside Miss Riverside Piano \"Clair de Lune\" 3rd runner-up Preliminary Swimsuit Award Winner of the 1960 Maid of Cotton Pageant\n\n1957 Lorna Anderson Sacramento Miss Sacramento Accordion \"Dark Eyes\" 3rd runner-up\n\n1956 Joan Beckett Sacramento Miss Sacramento Dramatic Sketch \"A Dream: Faith Over Atheistic Sciences\" Top 10 Semi-finalist Preliminary Swimsuit Award\n\n1955 Barbara Harris Santa Cruz Miss Watsonville\n\n1954 Lee Meriwether San Francisco 19 Miss San Francisco Dramatic Monologue \"Riders to the Sea\" Winner Preliminary Swimsuit Award Actress best known as Catwoman in the 1966 Batman movie\n\n1953 Patricia Johns Fresno Miss Fresno Dramatic Monologue \"The Country Girl\" Top 10 Semi-Finalist Preliminary Swimsuit Award\n\n1952 Jeanne Shores Azusa Miss Alhambra Dramatic Monologue 2nd runner-up Preliminary Swimsuit Award\n\n1951 Patricia Lehman Sacramento Miss Sacramento Piano\n\n1950 Joanne Durant San Diego Miss San Diego Vocal / Poetry Recitation \"Alice Blue Gown\" Semi-finalist Preliminary Swimsuit Award\n\n1949 Jone Pedersen Santa Rosa Miss Santa Rosa Dramatic Monologue \"You Will Come Back\" 4th runner-up Preliminary Swimsuit Award\n\n1948 Reba Watterson Stockton Miss Stockton\n\n1947 Laura Emery Salinas Miss Salinas Vocal \"So Long For So Long\" 4th runner-up\n\nMarilyn Davidson Los Angeles Vocal / Dress Design \"A Sunday Kind of Love\" competed as Miss Los Angeles County in the Miss America Pageant\n\n1946 Marilyn Buferd Los Angeles 21 Miss Wilshire District Dramatic Monologue \"Accent on Youth\" Winner Preliminary Swimsuit Award\n\n1945 Polly Ellis Tarzana No Locals Vocal \"Cowboy Joe\" Semi-finalist Preliminary Talent Award\n\nPhyllis Mathis San Diego Hula 1st runner-up competed as Miss San Diego in the Miss America Pageant\n\n1944 Shirley Ballard Los Angeles No Locals\n\n1943 Jean Bartel Los Angeles 19 No Locals Vocal \"Night and Day\" Winner Preliminary Swimsuit Award; Preliminary Talent Award\n\n1942 Lucille Lambert Hollywood Miss Hollywood Vocal \"Embraceable You\" 4th runner-up\n\n1941 Rosemary LaPlanche Los Angeles 18 Miss Los Angeles Dance Winner Preliminary Swimsuit Award\n\n1940 17 Dance 1st runner-up Preliminary Swimsuit\n\n1939 Marguerite Skliris San Francisco Miss San Francisco Dramatic Monologue \"The Poison Scene\" from Romeo and Juliet 3rd runner-up Preliminary Talent Award\n\n1938 Claire James Los Angeles Miss Los Angeles Dance 1st runner-up\n\n1937 Phyllis Randall Hollywood 20 Miss Hollywood Vocal/Dance 3rd runner-up Preliminary Talent Award Sister of Joey Augusta Paxton, Miss North Carolina 1941.\n\n1936 Phyllis Dobson Hollywood Miss Hollywood Drama 1st runner-up Preliminary Talent Award\n\n1935 Virginia Donham San Francisco Miss San Francisco Vocal \"Chloe\" & \"I Ain't Got Nobody\" Semi-finalist\n\n1933 Blanche MacDonald Miss Venus de Milo 2nd runner-up\n\n1927 Bertha Weizel Miss Santa Cruz Semi-finalist Bertha Weizel assumed the title when the original winner, Billie Copeland, was disqualified for being a professional actress. Ruby Smith competed as Miss Oakland and was a semi-finalist. Naoma Farrand competed as Miss San Francisco and Louise Heathman from San Diego competed as Miss Southern California, despite the fact that Linda Burrage had been crowned the winner of that pageant and Almo Ingraham had been announced as the 1st runner-up.\n\n1926 Aloha Porter Miss Venice Eleanor Twohig competed as Miss San Francisco\n\n1925 Fay Lanphier Oakland 19 Miss Alameda Winner Also representing California were: Adrienne Dore, Miss Los Angeles, who placed as 1st runner-up; Edyth Flynn competed as Miss San Francisco and Yetta Haber competed as Miss Santa Cruz.\n\n1924 No Miss California Fay Lanphier competed as Miss Santa Cruz and placed as 2nd runner-up; Lillian Knight competed as Miss Los Angeles and was a Finalist in the pageant. Irma Frazier competed as Miss Oakland.\n\n1923 No Miss California Violet Regal competed as Miss San Francisco and was a Finalist & Vera King competed as Miss Long Beach"}, {"url": "https://www.celebsagewiki.com/susan-pedersen-swimmer", "page_content": "Age, Biography and Wiki\n\nSusan Pedersen was born on 16 October, 1953 in Sacramento, California, United States, is an American swimmer. Discover Susan Pedersen's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 69 years old?\n\nPopular As N/A Occupation N/A Age 69 years old Zodiac Sign Libra Born 16 October 1953 Birthday 16 October Birthplace Sacramento, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 16 October. She is a member of famous Swimmer with the age 69 years old group.\n\nSusan Pedersen Height, Weight & Measurements\n\nAt 69 years old, Susan Pedersen height is 1.75 m and Weight 70 kg.\n\nPhysical Status Height 1.75 m Weight 70 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nSusan Pedersen Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Susan Pedersen worth at the age of 69 years old? Susan Pedersen’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Susan Pedersen's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nSusan Pedersen Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Susan Pedersen Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/pedersen-susan-1953", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.uiltexas.org/swimming-diving/historical-archive", "page_content": "This is the main content.\n\nUIL Home\n\nAthletics\n\nArchives\n\nSwimming & Diving State Champion Archives Swimming & Diving State Champions Boys Individual\n\nBoys Team Overall\n\nGirls Individual\n\nGirls Team Overall Boys Individual Select Event One Meter Diving 50 Yard Freestyle 100 Yard Butterfly 100 Yard Freestyle 100 Yard Backstroke 100 Yard Breaststroke 200 Yard Freestyle 200 Yard Freestyle Relay 200 Yard Individual Medley 200 Yard Medley Relay 400 Yard Freestyle Relay 500 Yard Freestyle Year Conference School Student Name Event Time 1969-1970 All Schools* Spring Branch Pat Harrington 100 Yard Backstroke 00:54.40 1969-1970 All Schools* Dallas Hillcrest Joe Schuster 100 Yard Breaststroke 01:02.70 1969-1970 All Schools* Dallas Highland Park Paul Hayes 100 Yard Butterfly 00:53.40 1969-1970 All Schools* San Antonio MacArthur Ray Ince 100 Yard Freestyle 00:47.20 1969-1970 All Schools* Spring Branch Doug Meaden 200 Yard Freestyle 01:48.40 1969-1970 All Schools* Spring Branch Pat Harrington 200 Yard Individual Medley 02:02.00 1969-1970 All Schools* Spring Branch 200 Yard Medley Relay 01:44.20 1969-1970 All Schools* San Angelo 400 Yard Freestyle Relay 03:26.40 1969-1970 All Schools* San Antonio MacArthur Ray Ince 50 Yard freestyle 00:21.20 1969-1970 All Schools* Midland Lee Stephen Hundley One Meter Diving 393.8 1970-1971 All Schools* Houston Memorial David Hefner 100 Yard Backstroke 00:55.90 1970-1971 All Schools* Dallas Hillcrest Joe Schuster 100 Yard Breaststroke 01:02.40 1970-1971 All Schools* Dallas Highland Park Paul Hayes 100 Yard Butterfly 00:53.00 1970-1971 All Schools* Austin McCallum Fred LeMaistre 100 Yard Freestyle 00:49.00 1970-1971 All Schools* San Antonio Alamo Heights Dick Worrel 200 Yard Freestyle 01:44.90 1970-1971 All Schools* San Antonio Churchill Tony Corliss 200 Yard Individual Medley 02:01.50 1970-1971 All Schools* San Antonio Churchill 200 Yard Medley Relay 01:41.80 1970-1971 All Schools* Dallas Highland Park 400 Yard Freestyle Relay 03:25.20 1970-1971 All Schools* A&M Consolidated Jack Gean 50 Yard freestyle 00:22.70 1970-1971 All Schools* League City Clear Creek Chuck Machell One Meter Diving 438.5 1971-1972 All Schools* Houston Bellaire Tim Carter 100 Yard Backstroke 00:54.48 1971-1972 All Schools* Fort Worth Arlington Heights Mike Epperson 100 Yard Breaststroke 01:03.56 1971-1972 All Schools* Dallas Highland Park Paul Hays 100 Yard Butterfly 00:52.61 1971-1972 All Schools* Austin McCallum Fred LeMaistre 100 Yard Freestyle 00:47.77 1971-1972 All Schools* Austin McCallum Fred LeMaistre 200 Yard Freestyle 01:44.86 1971-1972 All Schools* Houston Bellaire Tim Carter 200 Yard Individual Medley 01:57.53 1971-1972 All Schools* Houston Memorial 200 Yard Medley Relay 01:40.70 1971-1972 All Schools* Dallas Highland Park 400 Yard Freestyle Relay 03:20.68 1971-1972 All Schools* Andrews Chuck Raburn 50 Yard freestyle 00:21.60 1971-1972 All Schools* League City Clear Creek Chuck Machell One Meter Diving 417.35 1972-1973 All Schools* Houston Memorial Guy Hagstette 100 Yard Backstroke 00:53.62 1972-1973 All Schools* Houston Memorial Brent Barker 100 Yard Breaststroke 01:02.14 1972-1973 All Schools* Midland Tommy Hart 100 Yard Butterfly 00:52.97 1972-1973 All Schools* Midland Gary Schatz 100 Yard Freestyle 00:47.77 1972-1973 All Schools* Houston Memorial Mark Beasley 200 Yard Freestyle 01:44.37 1972-1973 All Schools* Houston Memorial Guy Hagstette 200 Yard Individual Medley 01:58.06 1972-1973 All Schools* Houston Memorial 200 Yard Medley Relay 01:39.39 1972-1973 All Schools* Houston Memorial 400 Yard Freestyle Relay 03:19.75 1972-1973 All Schools* Midland Gary Schatz 50 Yard freestyle 00:21.70 1972-1973 All Schools* Dallas White Paul Sweeny One Meter Diving 423.1 1973-1974 All Schools* Houston Memorial Guy Hagstette 100 Yard Backstroke 00:53.70 1973-1974 All Schools* A&M Consolidated Bob Leland 100 Yard Breaststroke 01:01.90 1973-1974 All Schools* Dallas White Scott MacDonald 100 Yard Butterfly 00:52.03 1973-1974 All Schools* Amarillo Tascosa Larry Page 100 Yard Freestyle 00:47.50 1973-1974 All Schools* Dallas White Scott MacDonald 200 Yard Freestyle 01:41.96 1973-1974 All Schools* Houston Memorial Guy Hagstette 200 Yard Individual Medley 01:57.00 1973-1974 All Schools* Houston Memorial 200 Yard Medley Relay 01:40.40 1973-1974 All Schools* Houston Memorial 400 Yard Freestyle Relay 03:12.10 1973-1974 All Schools* Houston Bellaire Lance Gordon 50 Yard freestyle 00:21.80 1973-1974 All Schools* Houston Memorial Mark Beasley 500 Yard Freestyle 04:37.98 1973-1974 All Schools* League City Clear Lake Fred Machell One Meter Diving 451.85 1974-1975 All Schools* Houston Bellaire Richard Reeves 100 Yard Backstroke 00:55.20 1974-1975 All Schools* Houston Bellaire Jamie Day 100 Yard Breaststroke 00:59.3 1974-1975 All Schools* Freeport Brazoswood Ronnie Paul 100 Yard Butterfly 00:52.40 1974-1975 All Schools* Houston Bellaire Lance Gordon 100 Yard Freestyle 00:47.10 1974-1975 All Schools* Houston Lee Duncan Hawthorne 200 Yard Freestyle 01:44.29 1974-1975 All Schools* Houston Westbury Russell March 200 Yard Individual Medley 01:57.80 1974-1975 All Schools* Houston Bellaire 200 Yard Medley Relay 01:37.30 1974-1975 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:14.70 1974-1975 All Schools* Houston Bellaire Lance Gordon 50 Yard freestyle 00:21.20 1974-1975 All Schools* Houston Waltrip Marshall Shoemaker 500 Yard Freestyle 04:40.80 1974-1975 All Schools* League City Clear Lake Danny Kelly One Meter Diving 426.21 1975-1976 All Schools* Houston Memorial Mike Tonery 100 Yard Backstroke 00:54.67 1975-1976 All Schools* League City Clear Lake David Greenwood 100 Yard Breaststroke 00:58.3 1975-1976 All Schools* Freeport Brazoswood Ronnie Paul 100 Yard Butterfly 00:51.83 1975-1976 All Schools* Dallas Adams Bill Redinger 100 Yard Freestyle 00:46.77 1975-1976 All Schools* Houston Spring Woods David Varner 200 Yard Freestyle 01:43.70 1975-1976 All Schools* Houston Memorial Kelly Rives 200 Yard Individual Medley 01:56.68 1975-1976 All Schools* League City Clear Lake 200 Yard Medley Relay 01:38.39 1975-1976 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:12.35 1975-1976 All Schools* Dallas Adams Bill Redinger 50 Yard freestyle 00:21.54 1975-1976 All Schools* Houston Spring Woods David Varner 500 Yard Freestyle 04:39.70 1975-1976 All Schools* Dallas Skyline Ricky Tennant One Meter Diving 505.95 1976-1977 All Schools* El Paso Eastwood Bill Juvrud 100 Yard Backstroke 00:54.47 1976-1977 All Schools* Dallas Adams Harlan House 100 Yard Breaststroke 01:01.65 1976-1977 All Schools* League City Clear Lake Hunter Richmond 100 Yard Butterfly 00:51.12 1976-1977 All Schools* League City Clear Lake David Reed 100 Yard Freestyle 00:46.49 1976-1977 All Schools* Houston Spring Woods David Varner 200 Yard Freestyle 01:44.09 1976-1977 All Schools* Fort Worth Arlington Heights William Paulus 200 Yard Individual Medley 01:56.25 1976-1977 All Schools* Richardson 200 Yard Medley Relay 01:39.42 1976-1977 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:10.87 1976-1977 All Schools* League City Clear Lake David Reed 50 Yard freestyle 00:20.98 1976-1977 All Schools* Houston Spring Woods David Varner 500 Yard Freestyle 04:38.71 1976-1977 All Schools* Fort Worth Arlington Heights Wayne Chester One Meter Diving 454.62 1977-1978 All Schools* Houston Memorial Mike Tonery 100 Yard Backstroke 00:52.60 1977-1978 All Schools* Houston Memorial Dean Putterman 100 Yard Breaststroke 00:59.13 1977-1978 All Schools* Fort Worth Arlington Heights William Paulus 100 Yard Butterfly 00:50.01 1977-1978 All Schools* League City Clear Lake Kris David 100 Yard Freestyle 00:47.13 1977-1978 All Schools* Houston Cy-Fair Derek Taylor 200 Yard Freestyle 01:41.78 1977-1978 All Schools* Fort Worth Arlington Heights William Paulus 200 Yard Individual Medley 01:53.60 1977-1978 All Schools* Richardson 200 Yard Medley Relay 01:38.07 1977-1978 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:12.94 1977-1978 All Schools* Midland Lee Bob Franz 50 Yard freestyle 00:21.82 1977-1978 All Schools* Kingsville Kevin Pfister 500 Yard Freestyle 04:36.33 1977-1978 All Schools* Arlington David Lindsey One Meter Diving 472.85 1978-1979 All Schools* Richardson Pearce Gardner Wright 100 Yard Backstroke 00:53.05 1978-1979 All Schools* Lake Highlands Chuck Neumann 100 Yard Breaststroke 00:57.90 1978-1979 All Schools* Fort Worth Arlington Heights William Paulus 100 Yard Butterfly 00:50.01 1978-1979 All Schools* Arlington Lamar Jack Oppel 100 Yard Freestyle 00:47.03 1978-1979 All Schools* Spring Branch Ricky Bodor 200 Yard Freestyle 01:40.09 1978-1979 All Schools* Fort Worth Western Hills James Amick 200 Yard Individual Medley 01:54.45 1978-1979 All Schools* Houston Memorial 200 Yard Medley Relay 01:35.86 1978-1979 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:11.15 1978-1979 All Schools* League City Clear Lake Scot Wells 50 Yard freestyle 00:21.50 1978-1979 All Schools* San Antonio Churchill Chris Rowe 500 Yard Freestyle 04:31.98 1978-1979 All Schools* Arlington David Lindsey One Meter Diving 482.8 1979-1980 All Schools* Houston Memorial Larry Craft 100 Yard Backstroke 00:52.07 1979-1980 All Schools* Houston Memorial Dean Putterman 100 Yard Breaststroke 00:57.29 1979-1980 All Schools* San Antonio Churchill Ken Grey 100 Yard Butterfly 00:51.68 1979-1980 All Schools* Spring Branch Ricky Bodor 100 Yard Freestyle 00:46.37 1979-1980 All Schools* San Antonio Churchill Greg Goulet 200 Yard Freestyle 01:38.75 1979-1980 All Schools* Houston Memorial Chris Rives 200 Yard Individual Medley 01:52.59 1979-1980 All Schools* Houston Memorial 200 Yard Medley Relay 01:34.68 1979-1980 All Schools* Houston Memorial 400 Yard Freestyle Relay 03:08.50 1979-1980 All Schools* League City Clear Lake Jimmy Ammons 50 Yard freestyle 00:21.45 1979-1980 All Schools* San Antonio Churchill Greg Goulet 500 Yard Freestyle 04:26.19 1979-1980 All Schools* Arlington David Lindsey One Meter Diving 538.55 1980-1981 All Schools* Highland Park Dallas Bruce Hayes 100 Yard Backstroke 00:52.58 1980-1981 All Schools* Houston Westchester Glen Mangum 100 Yard Breaststroke 00:58.45 1980-1981 All Schools* Corpus Christi Carroll John Heldenfels 100 Yard Butterfly 00:50.34 1980-1981 All Schools* Arlington Lamar Jack Oppel 100 Yard Freestyle 00:45.18 1980-1981 All Schools* Highland Park Dallas Mike Heath 200 Yard Freestyle 01:37.88 1980-1981 All Schools* Highland Park Dallas Bruce Hayes 200 Yard Individual Medley 01:53.30 1980-1981 All Schools* Houston Westchester 200 Yard Medley Relay 01:38.36 1980-1981 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:09.42 1980-1981 All Schools* Denton Chuck Ponthier 50 Yard freestyle 00:21.30 1980-1981 All Schools* Dallas Highland Park Mike Heath 500 Yard Freestyle 04:28.03 1980-1981 All Schools* Houston Memorial Art Conley One Meter Diving 450.9 1981-1982 All Schools* Dallas Hillcrest Allyn Macumber 100 Yard Backstroke 00:52.64 1981-1982 All Schools* San Antonio Churchill Jack Bierie 100 Yard Breaststroke 00:58.03 1981-1982 All Schools* Houston Memorial Chris Rives 100 Yard Butterfly 00:48.49 1981-1982 All Schools* League City Clear Lake Kevin Ruszkowski 100 Yard Freestyle 00:46.65 1981-1982 All Schools* Highland Park Dallas Mike Heath 200 Yard Freestyle 01:37.53 1981-1982 All Schools* Houston Memorial Chris Rives 200 Yard Individual Medley 01:50.50 1981-1982 All Schools* Houston Stratford 200 Yard Medley Relay 01:38.50 1981-1982 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:07.15 1981-1982 All Schools* Houston Stratford David Hansen 50 Yard freestyle 00:21.14 1981-1982 All Schools* Dallas Highland Park Mike Heath 500 Yard Freestyle 04:29.59 1981-1982 All Schools* San Antonio Madison Eric Obnibne One Meter Diving 473.9 1982-1983 All Schools* Richardson Pearce Richard Enriquez 100 Yard Backstroke 00:53.67 1982-1983 All Schools* San Antonio Churchill Jack Bierie 100 Yard Breaststroke 00:57.27 1982-1983 All Schools* Lake Highlands Mike Short 100 Yard Butterfly 00:48.93 1982-1983 All Schools* League City Clear Lake Kevin Ruszkowski 100 Yard Freestyle 00:45.90 1982-1983 All Schools* League City Clear Lake Mike Lovfald 200 Yard Freestyle 01:39.45 1982-1983 All Schools* San Antonio Churchill Jack Bierie 200 Yard Individual Medley 01:52.77 1982-1983 All Schools* San Antonio Churchill 200 Yard Medley Relay 01:37.24 1982-1983 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:06.37 1982-1983 All Schools* Lake Highlands Mike Short 50 Yard freestyle 00:20.45 1982-1983 All Schools* McAllen Danny Goodwin 500 Yard Freestyle 04:30.27 1982-1983 All Schools* Plano Eric Murff One Meter Diving 505.4 1983-1984 All Schools* Alief Elsik Chad Pollack 100 Yard Backstroke 00:53.23 1983-1984 All Schools* Spring Westfield David Nesmith 100 Yard Breaststroke 00:59.32 1983-1984 All Schools* League City Clear Lake Steve Streiff 100 Yard Butterfly 00:51.21 1983-1984 All Schools* Austin Johnson David Dentino 100 Yard Freestyle 00:45.39 1983-1984 All Schools* Austin Johnson David Dentino 200 Yard Freestyle 01:39.54 1983-1984 All Schools* Richardson Berkner Byron Burson 200 Yard Individual Medley 01:54.52 1983-1984 All Schools* League City Clear Lake 200 Yard Medley Relay 01:38.10 1983-1984 All Schools* Richardson Pearce 400 Yard Freestyle Relay 03:09.98 1983-1984 All Schools* Spring Westfield Todd Pace 50 Yard freestyle 00:21.13 1983-1984 All Schools* McAllen Danny Goodwin 500 Yard Freestyle 04:28.54 1983-1984 All Schools* Houston Westchester Donie Scott One Meter Diving 463.1 1984-1985 All Schools* Houston Stratford Doug Gjertsen 100 Yard Backstroke 00:51.87 1984-1985 All Schools* Fort Worth Paschal Ken Strassburger 100 Yard Breaststroke 00:58.45 1984-1985 All Schools* Klein Oak Brad Bailey 100 Yard Butterfly 00:50.26 1984-1985 All Schools* Spring Westfield Todd Pace 100 Yard Freestyle 00:45.61 1984-1985 All Schools* Richardson Pearce Paul Robinson 200 Yard Freestyle 01:37.68 1984-1985 All Schools* Houston Stratford Doug Gjertsen 200 Yard Individual Medley 01:49.78 1984-1985 All Schools* Houston Memorial 200 Yard Medley Relay 01:37.84 1984-1985 All Schools* San Antonio Clark 400 Yard Freestyle Relay 03:11.98 1984-1985 All Schools* Spring Westfield Todd Pace 50 Yard freestyle 00:20.49 1984-1985 All Schools* Richardson Pearce Paul Robinson 500 Yard Freestyle 04:25.01 1984-1985 All Schools* San Antonio Madison Bret Kobel One Meter Diving 445.65 1985-1986 All Schools* Richardson Berkner Byron Burson 100 Yard Backstroke 00:52.57 1985-1986 All Schools* Richardson Pearce Matt Rodgers 100 Yard Breaststroke 00:57.32 1985-1986 All Schools* Klein Oak Brad Bailey 100 Yard Butterfly 00:49.47 1985-1986 All Schools* Spring Westfield Todd Pace 100 Yard Freestyle 00:45.39 1985-1986 All Schools* Richardson Pearce Paul Robinson 200 Yard Freestyle 01:38.89 1985-1986 All Schools* Richardson Berkner Byron Burson 200 Yard Individual Medley 01:51.46 1985-1986 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:35.75 1985-1986 All Schools* San Antonio Churchill 400 Yard Freestyle Relay 03:09.37 1985-1986 All Schools* Spring Westfield Todd Pace 50 Yard freestyle 00:20.35 1985-1986 All Schools* Richardson Pearce Paul Robinson 500 Yard Freestyle 04:30.46 1985-1986 All Schools* Katy Taylor Scott Whiddon One Meter Diving 481.5 1986-1987 All Schools* Plano Todd Dreitzler 100 Yard Backstroke 00:52.38 1986-1987 All Schools* Richardson Pearce Matt Rodgers 100 Yard Breaststroke 00:56.93 1986-1987 All Schools* Richardson Berkner Chris Languell 100 Yard Butterfly 00:49.88 1986-1987 All Schools* Beaumont Central Travis Meyers 100 Yard Freestyle 00:45.36 1986-1987 All Schools* Dallas Highland Park Sal Vassalo 200 Yard Freestyle 01:40.61 1986-1987 All Schools* Richardson Pearce Matt Rodgers 200 Yard Individual Medley 01:50.96 1986-1987 All Schools* Temple 200 Yard Medley Relay 01:35.97 1986-1987 All Schools* San Antonio Churchill 400 Yard Freestyle Relay 03:04.59 1986-1987 All Schools* Beaumont Central Travis Meyer 50 Yard freestyle 00:20.81 1986-1987 All Schools* Houston Cypress Creek Jeff Thibault 500 Yard Freestyle 04:31.51 1986-1987 All Schools* Round Rock Westwood J. Rhodes One Meter Diving 488.8 1987-1988 All Schools* Houston Cypress Creek Jeff Thibault 100 Yard Backstroke 00:50.90 1987-1988 All Schools* Austin Westlake Trent Staats 100 Yard Breaststroke 00:57.02 1987-1988 All Schools* Richardson Berkner Chris Languell 100 Yard Butterfly 00:49.92 1987-1988 All Schools* Dallas Adams Jack Kosharek 100 Yard Freestyle 00:45.85 1987-1988 All Schools* San Antonio Churchill Josh Davis 200 Yard Freestyle 01:40.08 1987-1988 All Schools* Houston Cypress Creek Jeff Thibault 200 Yard Individual Medley 01:50.68 1987-1988 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:35.99 1987-1988 All Schools* San Antonio Churchill 400 Yard Freestyle Relay 03:06.43 1987-1988 All Schools* San Antonio Churchill Murray Easton 50 Yard freestyle 00:21.09 1987-1988 All Schools* League City Clear Creek Jared Tees 500 Yard Freestyle 04:33.82 1987-1988 All Schools* Houston Spring Woods Derek Husmann One Meter Diving 421.2 1988-1989 All Schools* San Antonio Churchill Kit Patterson 100 Yard Backstroke 00:50.74 1988-1989 All Schools* Houston Stratford John Cox 100 Yard Breaststroke 00:57.33 1988-1989 All Schools* San Antonio Churchill Murray Easton 100 Yard Butterfly 00:49.85 1988-1989 All Schools* Amarillo Doug Dickinson 100 Yard Freestyle 00:44.42 1988-1989 All Schools* San Antonio Churchill Josh Davis 200 Yard Freestyle 01:38.99 1988-1989 All Schools* San Antonio Churchill Todd Laurie 200 Yard Individual Medley 01:53.17 1988-1989 All Schools* San Antonio Churchill 200 Yard Medley Relay 01:35.86 1988-1989 All Schools* San Antonio Churchill 400 Yard Freestyle Relay 03:02.41 1988-1989 All Schools* Amarillo Doug Dickinson 50 Yard freestyle 00:20.22 1988-1989 All Schools* San Antonio Marshall Matt Hooper 500 Yard Freestyle 04:30.58 1988-1989 All Schools* Houston Spring Woods Derek Husmann One Meter Diving 451.3 1989-1990 All Schools* Conroe McCullough Jay Martin 100 Yard Backstroke 00:51.49 1989-1990 All Schools* San Antonio Lee Ryan McKinney 100 Yard Breaststroke 00:55.89 1989-1990 All Schools* San Antonio Churchill Murray Easton 100 Yard Butterfly 00:49.12 1989-1990 All Schools* Freeport Brazoswood Jason Fink 100 Yard Freestyle 00:44.18 1989-1990 All Schools* Freeport Brazoswood Jason Fink 200 Yard Freestyle 01:36.83 1989-1990 All Schools* Dallas Skyline John Hudspeth 200 Yard Individual Medley 01:51.26 1989-1990 All Schools* Plano 200 Yard Medley Relay 01:34.10 1989-1990 All Schools* San Antonio Churchill 400 Yard Freestyle Relay 03:05.65 1989-1990 All Schools* San Antonio Churchill Murray Easton 50 Yard freestyle 00:20.53 1989-1990 All Schools* Conroe Andy Plummer 500 Yard Freestyle 04:30.42 1989-1990 All Schools* Houston Bellaire Tony Iglesias One Meter Diving 441.75 1990-1991 All Schools* Plano Wyatt Russo 100 Yard Backstroke 00:50.06 1990-1991 All Schools* Tyler Lee Todd Bricker 100 Yard Breaststroke 00:56.63 1990-1991 All Schools* San Antonio Churchill Murray Easton 100 Yard Butterfly 00:49.29 1990-1991 All Schools* Conroe Oak Ridge Devin Pietrzak 100 Yard Freestyle 00:45.62 1990-1991 All Schools* San Antonio Marshall Matt Hooper 200 Yard Freestyle 01:37.67 1990-1991 All Schools* Plano 200 Yard Freestyle Relay 01:23.58 1990-1991 All Schools* Plano Wyatt Russo 200 Yard Individual Medley 01:48.47 1990-1991 All Schools* Plano 200 Yard Medley Relay 01:33.77 1990-1991 All Schools* San Antonio Marshall 400 Yard Freestyle Relay 03:04.02 1990-1991 All Schools* San Antonio Churchill Murray Easton 50 Yard freestyle 00:20.70 1990-1991 All Schools* San Antonio Marshall Matt Hooper 500 Yard Freestyle 04:21.17 1990-1991 All Schools* Houston Clear Lake Chris Gregory One Meter Diving 491.75 1991-1992 All Schools* Plano Wyatt Russo 100 Yard Backstroke 00:49.19 1991-1992 All Schools* Tyler Lee Todd Bricker 100 Yard Breaststroke 00:55.74 1991-1992 All Schools* Conroe McCullough Falco Fleischmann 100 Yard Butterfly 00:49.87 1991-1992 All Schools* Houston Clear Lake Scott Jones 100 Yard Freestyle 00:45.23 1991-1992 All Schools* Houston Clear Lake Scott Jones 200 Yard Freestyle 01:38.29 1991-1992 All Schools* Conroe Oak Ridge 200 Yard Freestyle Relay 01:24.04 1991-1992 All Schools* Plano Wyatt Russo 200 Yard Individual Medley 01:47.59 1991-1992 All Schools* Plano 200 Yard Medley Relay 01:33.88 1991-1992 All Schools* Plano 400 Yard Freestyle Relay 03:03.22 1991-1992 All Schools* Conroe Oak Ridge Devin Pietrzak 50 Yard freestyle 00:20.60 1991-1992 All Schools* Arlington Martin Tony Brazzale 500 Yard Freestyle 04:23.01 1991-1992 All Schools* Conroe McCullough Paco Rivera One Meter Diving 424.35 1992-1993 All Schools* Humble Kingwood Chris Counts 100 Yard Backstroke 00:50.02 1992-1993 All Schools* Richardson Berkner Erich Heise 100 Yard Breaststroke 00:58.32 1992-1993 All Schools* Humble Kingwood Chris Counts 100 Yard Butterfly 00:49.42 1992-1993 All Schools* Houston Clear Lake Scott Jones 100 Yard Freestyle 00:44.52 1992-1993 All Schools* Houston Clear Lake Scott Jones 200 Yard Freestyle 01:37.82 1992-1993 All Schools* Humble Kingwood 200 Yard Freestyle Relay 01:23.15 1992-1993 All Schools* Fort Worth Southwest Jaron Krause 200 Yard Individual Medley 01:52.49 1992-1993 All Schools* Spring Westfield 200 Yard Medley Relay 01:37.77 1992-1993 All Schools* Humble Kingwood 400 Yard Freestyle Relay 03:04.77 1992-1993 All Schools* Richardson Pearce Trey Ibsen 50 Yard freestyle 00:20.79 1992-1993 All Schools* Sugar Land Clements Jeff Brown 500 Yard Freestyle 04:27.01 1992-1993 All Schools* Spring Jarrold Flores One Meter Diving 481.25 1993-1994 All Schools* Austin McCallum Kevin Collins 100 Yard Backstroke 00:49.93 1993-1994 All Schools* Bay City Blake Holden 100 Yard Breaststroke 00:56.93 1993-1994 All Schools* Humble Kingwood Chris Counts 100 Yard Butterfly 00:49.42 1993-1994 All Schools* Houston Memorial Chris Archer 100 Yard Freestyle 00:44.88 1993-1994 All Schools* San Antonio Lee Ryan Kafer 200 Yard Freestyle 01:40.63 1993-1994 All Schools* Klein 200 Yard Freestyle Relay 01:26.48 1993-1994 All Schools* Humble Kingwood Chris Counts 200 Yard Individual Medley 01:49.04 1993-1994 All Schools* Humble Kingwood 200 Yard Medley Relay 01:31.98 1993-1994 All Schools* Humble Kingwood 400 Yard Freestyle Relay 03:02.63 1993-1994 All Schools* Houston Memorial Chris Archer 50 Yard freestyle 00:20.61 1993-1994 All Schools* Austin Westlake Josh Ilika 500 Yard Freestyle 04:33.12 1993-1994 All Schools* Austin Mark Naftanel One Meter Diving 487.7 1994-1995 All Schools* Lubbock Tom Klement 100 Yard Backstroke 00:49.29 1994-1995 All Schools* Houston Memorial Anthony Robinson 100 Yard Breaststroke 00:55.37 1994-1995 All Schools* Conroe McCullough Matthew Pierce 100 Yard Butterfly 00:49.30 1994-1995 All Schools* Humble Kingwood Glenn Counts 100 Yard Freestyle 00:44.26 1994-1995 All Schools* Klein Devin Howard 200 Yard Freestyle 01:39.45 1994-1995 All Schools* Humble Kingwood 200 Yard Freestyle Relay 01:24.74 1994-1995 All Schools* Lubbock Tom Klement 200 Yard Individual Medley 01:48.19 1994-1995 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:34.37 1994-1995 All Schools* Houston Cypress Creek 400 Yard Freestyle Relay 03:06.61 1994-1995 All Schools* Humble Kingwood Glenn Counts 50 Yard freestyle 00:20.50 1994-1995 All Schools* Houston Cypress Creek Jamie Rauch 500 Yard Freestyle 04:31.05 1994-1995 All Schools* Austin Mark Naftanel One Meter Diving 506.05 1995-1996 All Schools* Conroe McCullough Dan Westcott 100 Yard Backstroke 00:50.14 1995-1996 All Schools* Houston Memorial Anthony Robinson 100 Yard Breaststroke 00:54.83 1995-1996 All Schools* Klein Devin Howard 100 Yard Butterfly 00:49.74 1995-1996 All Schools* A&M Consolidated Bryan Jones 100 Yard Freestyle 00:44.81 1995-1996 All Schools* Houston Cypress Creek Jamie Rauch 200 Yard Freestyle 01:37.35 1995-1996 All Schools* Humble Kingwood 200 Yard Freestyle Relay 01:24.60 1995-1996 All Schools* Houston Cypress Creek Joey Montague 200 Yard Individual Medley 01:48.08 1995-1996 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:32.68 1995-1996 All Schools* Humble Kingwood 400 Yard Freestyle Relay 03:04.52 1995-1996 All Schools* A&M Consolidated Bryan Jones 50 Yard freestyle 00:20.52 1995-1996 All Schools* Houston Cypress Creek Jamie Rauch 500 Yard Freestyle 04:27.64 1995-1996 All Schools* Spring Jesse Even One Meter Diving 462.5 1996-1997 All Schools* Conroe The Woodlands Dan Westcott 100 Yard Backstroke 00:48.99 1996-1997 All Schools* Houston Memorial Anthony Robinson 100 Yard Breaststroke 00:54.90 1996-1997 All Schools* Houston Cypress Falls Andrew Livingston 100 Yard Butterfly 00:48.27 1996-1997 All Schools* Conroe The Woodlands Kyle Smerdon 100 Yard Freestyle 00:45.28 1996-1997 All Schools* Houston Cypress Creek Jamie Rauch 200 Yard Freestyle 01:36.55 1996-1997 All Schools* Conroe The Woodlands 200 Yard Freestyle Relay 01:24.19 1996-1997 All Schools* Houston Cypress Creek Joey Montague 200 Yard Individual Medley 01:48.44 1996-1997 All Schools* Conroe The Woodlands 200 Yard Medley Relay 01:33.01 1996-1997 All Schools* Houston Cypress Creek 400 Yard Freestyle Relay 03:04.14 1996-1997 All Schools* Houston Memorial Anthony Robinson 50 Yard freestyle 00:19.91 1996-1997 All Schools* Houston Cypress Creek Jamie Rauch 500 Yard Freestyle 04:27.72 1996-1997 All Schools* Spring Jesse Even One Meter Diving 518.6 1997-1998 All Schools* Conroe The Woodlands Dan Westcott 100 Yard Backstroke 00:48.68 1997-1998 All Schools* Houston Cypress Creek Jeremy McDonnell 100 Yard Breaststroke 00:54.76 1997-1998 All Schools* Conroe The Woodlands Dan Westcott 100 Yard Butterfly 00:48.58 1997-1998 All Schools* El Paso Eastwood Kurt Mullen 100 Yard Freestyle 00:45.48 1997-1998 All Schools* San Antonio Clark Chris Epp 200 Yard Freestyle 01:37.72 1997-1998 All Schools* El Paso Eastwood 200 Yard Freestyle Relay 01:25.05 1997-1998 All Schools* Houston Cypress Creek Joey Montague 200 Yard Individual Medley 01:47.87 1997-1998 All Schools* Conroe The Woodlands 200 Yard Medley Relay 01:33.35 1997-1998 All Schools* Conroe The Woodlands 400 Yard Freestyle Relay 03:06.70 1997-1998 All Schools* Euless Trinity Peter Idziak 50 Yard freestyle 00:20.71 1997-1998 All Schools* San Antonio Clark Chris Epp 500 Yard Freestyle 04:27.55 1997-1998 All Schools* Houston Memorial Hank Richardson One Meter Diving 503.2 1998-1999 All Schools* Conroe The Woodlands Dan Westcott 100 Yard Backstroke 00:48.48 1998-1999 All Schools* Conroe The Woodlands Nick Degenstein 100 Yard Breaststroke 00:57.12 1998-1999 All Schools* Conroe The Woodlands Dan Westcott 100 Yard Butterfly 00:47.81 1998-1999 All Schools* Spring Marc Erasmus 100 Yard Freestyle 00:45.84 1998-1999 All Schools* Lewisville Marcus John Suchand 200 Yard Freestyle 01:37.69 1998-1999 All Schools* Conroe The Woodlands 200 Yard Freestyle Relay 01:24.24 1998-1999 All Schools* Conroe The Woodlands Nick Degenstein 200 Yard Individual Medley 01:51.75 1998-1999 All Schools* Conroe The Woodlands 200 Yard Medley Relay 01:31.25 1998-1999 All Schools* Conroe The Woodlands 400 Yard Freestyle Relay 03:04.48 1998-1999 All Schools* Conroe The Woodlands Dennis Behrens 50 Yard freestyle 00:20.47 1998-1999 All Schools* Houston Clear Lake Rick Dewey 500 Yard Freestyle 04:34.93 1998-1999 All Schools* San Antonio Churchill Alex Vollelunga One Meter Diving 470.1 1999-2000 4A Dallas Highland Park Tommy Sacco 100 Yard Backstroke 00:53.21 1999-2000 4A Dallas Highland Park Brian Stephens 100 Yard Breaststroke 00:57.27 1999-2000 4A Houston Jones Joseph Lankford 100 Yard Butterfly 00:51.22 1999-2000 4A Houston King Auston Ayers 100 Yard Freestyle 00:47.29 1999-2000 4A Conroe Oak Ridge John Nabors 200 Yard Freestyle 01:42.93 1999-2000 4A Texarkana Texas 200 Yard Freestyle Relay 01:29.12 1999-2000 4A Dallas Highland Park Brian Stephens 200 Yard Individual Medley 01:54.40 1999-2000 4A Cedar Park 200 Yard Medley Relay 01:38.67 1999-2000 4A Texarkana Texas 400 Yard Freestyle Relay 03:13.81 1999-2000 4A Houston King Auston Ayres 50 Yard freestyle 00:21.52 1999-2000 4A Conroe Oak Ridge John Nabors 500 Yard Freestyle 04:34.50 1999-2000 4A Colleyville Heritage Michael Cabassol One Meter Diving 424.75 1999-2000 5A San Antonio Churchill Reid Evans 100 Yard Backstroke 00:50.36 1999-2000 5A Houston Clear Lake Mike Egerman 100 Yard Breaststroke 00:58.02 1999-2000 5A Conroe The Woodlands Trent Trabona 100 Yard Butterfly 00:50.10 1999-2000 5A San Antonio Churchill Reid Evans 100 Yard Freestyle 00:45.72 1999-2000 5A Conroe The Woodlands Brent Hitchcock 200 Yard Freestyle 01:40.04 1999-2000 5A Katy Taylor 200 Yard Freestyle Relay 01:24.94 1999-2000 5A Houston Langham Crk Matt Wheeler 200 Yard Individual Medley 01:52.31 1999-2000 5A San Antonio Churchill 200 Yard Medley Relay 01:34.47 1999-2000 5A El Paso Eastwood 400 Yard Freestyle Relay 03:06.50 1999-2000 5A Katy Taylor Brett Allen 50 Yard freestyle 00:20.94 1999-2000 5A Conroe The Woodlands Brent Hitchcock 500 Yard Freestyle 04:34.25 1999-2000 5A San Antonio Churchill Alex Vollelunga One Meter Diving 484.8 2000-2001 4A Austin Anderson Brett McMillian 100 Yard Backstroke 00:52.70 2000-2001 4A Cedar Park David Frigell 100 Yard Breaststroke 00:57.44 2000-2001 4A Richardson Pearce Scott McCure 100 Yard Butterfly 00:50.86 2000-2001 4A Richardson Pearce Rick Yang 100 Yard Freestyle 00:45.57 2000-2001 4A Conroe Oak Ridge John Nabors 200 Yard Freestyle 01:40.23 2000-2001 4A Cedar Park 200 Yard Freestyle Relay 01:28.41 2000-2001 4A Richardson Pearce Scott McCure 200 Yard Individual Medley 01:52.01 2000-2001 4A Conroe Oak Ridge 200 Yard Medley Relay 01:41.22 2000-2001 4A Richardson Pearce 400 Yard Freestyle Relay 03:15.07 2000-2001 4A Houston King Auston Ayres 50 Yard freestyle 00:21.43 2000-2001 4A Conroe Oak Ridge John Nabors 500 Yard Freestyle 04:30.38 2000-2001 4A Grapevine Ryan Shields One Meter Diving 355.15 2000-2001 5A Lewisville Marcus Damon Rourke 100 Yard Backstroke 00:50.89 2000-2001 5A Baytown Sterling Dustin Fleming 100 Yard Breaststroke 00:58.52 2000-2001 5A Katy Taylor Alex Boyce 100 Yard Butterfly 00:50.18 2000-2001 5A Abilene Gregor Greiner 100 Yard Freestyle 00:45.28 2000-2001 5A Katy Taylor Blake Scholz 200 Yard Freestyle 01:41.92 2000-2001 5A El Paso Eastwood 200 Yard Freestyle Relay 01:25.78 2000-2001 5A Houston Clear Lake Drew Edwards 200 Yard Individual Medley 01:51.71 2000-2001 5A Katy Taylor 200 Yard Medley Relay 01:36.12 2000-2001 5A El Paso Eastwood 400 Yard Freestyle Relay 03:08.22 2000-2001 5A Abilene Gregor Greiner 50 Yard freestyle 00:20.68 2000-2001 5A Houston Clear Lake Drew Edwards 500 Yard Freestyle 04:32.92 2000-2001 5A Carrollton Smith Philip Griffin One Meter Diving 470.4 2001-2002 4A Dallas Highland Park Tommy Sacco 100 Yard Backstroke 00:50.66 2001-2002 4A Cedar Park Aaron Payne 100 Yard Breaststroke 00:59.59 2001-2002 4A Abilene Wylie John Ouimette 100 Yard Butterfly 00:52.16 2001-2002 4A Texarkana Texas Patrick Mayo 100 Yard Freestyle 00:47.15 2001-2002 4A Dallas Highland Park Tommy Sacco 200 Yard Freestyle 01:40.60 2001-2002 4A Cedar Park 200 Yard Freestyle Relay 01:28.12 2001-2002 4A Fort Worth Southwest Cameron Allred 200 Yard Individual Medley 01:57.80 2001-2002 4A Cedar Park 200 Yard Medley Relay 01:37.00 2001-2002 4A Dallas Highland Park 400 Yard Freestyle Relay 03:15.16 2001-2002 4A Cedar Park Josh Smith 50 Yard freestyle 00:21.10 2001-2002 4A Conroe Oak Ridge J.W. Hard 500 Yard Freestyle 04:36.73 2001-2002 4A Grapevine Ryan Shields One Meter Diving 387.85 2001-2002 5A Houston Cypress Creek Andrew Sullivant 100 Yard Backstroke 00:50.53 2001-2002 5A Austin Christian Schurr 100 Yard Breaststroke 00:57.79 2001-2002 5A Lewisville Marcus Damon Rourke 100 Yard Butterfly 00:50.11 2001-2002 5A Spring Darren Erasmus 100 Yard Freestyle 00:44.65 2001-2002 5A Fort Bend Kempner Tommy Hickman 200 Yard Freestyle 01:40.75 2001-2002 5A Humble Kingwood 200 Yard Freestyle Relay 01:25.77 2001-2002 5A Allen Cliff Robbins 200 Yard Individual Medley 01:51.19 2001-2002 5A Conroe The Woodlands 200 Yard Medley Relay 01:35.06 2001-2002 5A Humble Kingwood 400 Yard Freestyle Relay 03:07.76 2001-2002 5A Spring Darren Erasmus 50 Yard freestyle 00:20.55 2001-2002 5A Houston Cypress Falls John Patterson 500 Yard Freestyle 04:30.75 2001-2002 5A San Antonio MacArthur Evan Watters One Meter Diving 458.5 2002-2003 4A Dallas Highland Park Tommy Sacco 100 Yard Backstroke 00:51.76 2002-2003 4A Fort Worth Southwest Cameron Allred 100 Yard Breaststroke 00:59.34 2002-2003 4A Nacogdoches Tiger Christian 100 Yard Butterfly 00:51.46 2002-2003 4A Texarkana Texas Patrick Mayo 100 Yard Freestyle 00:46.92 2002-2003 4A Conroe Oak Ridge J.W. Hard 200 Yard Freestyle 01:43.13 2002-2003 4A Richardson Pearce 200 Yard Freestyle Relay 01:28.71 2002-2003 4A Nacogdoches Tiger Christian 200 Yard Individual Medley 01:52.96 2002-2003 4A Texarkana Texas 200 Yard Medley Relay 01:39.18 2002-2003 4A Texarkana Texas 400 Yard Freestyle Relay 03:16.16 2002-2003 4A New Braunfels Canyon Justin Ashby 50 Yard freestyle 00:21.82 2002-2003 4A Richardson Pearce Brooks Cameron 500 Yard Freestyle 04:37.99 2002-2003 4A Corpus Christi Calallen Collier McKenzie One Meter Diving 339.85 2002-2003 5A Conroe The Woodlands Bryan Stahl 100 Yard Backstroke 00:51.50 2002-2003 5A Plano Ivan Barnes 100 Yard Breaststroke 00:55.64 2002-2003 5A San Antonio Reagan David Donaldson 100 Yard Butterfly 00:49.67 2002-2003 5A Humble Kingwood Brad Raiford 100 Yard Freestyle 00:46.08 2002-2003 5A El Paso Eastwood Yousif Del Valle 200 Yard Freestyle 01:39.46 2002-2003 5A Katy Taylor 200 Yard Freestyle Relay 01:25.38 2002-2003 5A San Antonio Reagan David Donaldson 200 Yard Individual Medley 01:51.04 2002-2003 5A San Antonio Reagan 200 Yard Medley Relay 01:35.67 2002-2003 5A Katy Taylor 400 Yard Freestyle Relay 03:08.08 2002-2003 5A Humble Kingwood Brad Raiford 50 Yard freestyle 00:20.94 2002-2003 5A Houston Cypress Creek Chris Knaute 500 Yard Freestyle 04:30.11 2002-2003 5A Houston Langham Crk Andy Crum One Meter Diving 438.05 2003-2004 4A Richardson Pearce Brooks Cameron 100 Yard Backstroke 00:51.32 2003-2004 4A Fort Worth Southwest Cameron Allred 100 Yard Breaststroke 00:58.70 2003-2004 4A Richardson Pearce Nick Kalivas 100 Yard Butterfly 00:52.21 2003-2004 4A Richmond Foster Nick Ward 100 Yard Freestyle 00:47.23 2003-2004 4A Richardson Pearce Brooks Cameron 200 Yard Freestyle 01:41.01 2003-2004 4A Richardson Pearce 200 Yard Freestyle Relay 01:27.91 2003-2004 4A Fort Worth Southwest Cameron Allred 200 Yard Individual Medley 01:52.93 2003-2004 4A Texarkana Texas 200 Yard Medley Relay 01:30.01 2003-2004 4A Richardson Pearce 400 Yard Freestyle Relay 03:11.79 2003-2004 4A Richardson Pearce Nick Kalivas 50 Yard freestyle 00:21.77 2003-2004 4A Elgin Will Rivers 500 Yard Freestyle 04:35.53 2003-2004 4A Montgomery JJ Kinzbach One Meter Diving 446.85 2003-2004 5A Midland Travis Floyd 100 Yard Backstroke 00:50.87 2003-2004 5A Plano Ivan Barnes 100 Yard Breaststroke 00:55.17 2003-2004 5A Plano Ivan Barnes 100 Yard Butterfly 00:49.83 2003-2004 5A Katy Taylor Evan Ryser 100 Yard Freestyle 00:45.54 2003-2004 5A Katy Taylor Evan Ryser 200 Yard Freestyle 01:39.59 2003-2004 5A Humble Kingwood 200 Yard Freestyle Relay 01:26.04 2003-2004 5A Round Rock Westwood Tony Colella 200 Yard Individual Medley 01:51.67 2003-2004 5A Conroe The Woodlands 200 Yard Medley Relay 01:34.56 2003-2004 5A Conroe The Woodlands 400 Yard Freestyle Relay 03:07.62 2003-2004 5A Coppell Alex Oldenkamp 50 Yard freestyle 00:21.23 2003-2004 5A Plano John Kendrick 500 Yard Freestyle 04:29.18 2003-2004 5A Katy Taylor Max Wyermann One Meter Diving 449.45 2004-2005 4A Frisco Byron Carlisle 100 Yard Backstroke 00:51.77 2004-2005 4A New Caney Brad Safarik 100 Yard Breaststroke 01:00.38 2004-2005 4A Greenville Ben Newell 100 Yard Butterfly 00:51.11 2004-2005 4A Richmond Foster Nick Ward 100 Yard Freestyle 00:46.90 2004-2005 4A Elgin Will Rivers 200 Yard Freestyle 01:42.83 2004-2005 4A Austin Lake Travis 200 Yard Freestyle Relay 01:29.46 2004-2005 4A Rosenberg Lamar Jake Hoffmann 200 Yard Individual Medley 01:55.17 2004-2005 4A Frisco 200 Yard Medley Relay 01:38.75 2004-2005 4A Texarkana Texas 400 Yard Freestyle Relay 03:15.33 2004-2005 4A Richmond Foster Nick Ward 50 Yard freestyle 00:21.54 2004-2005 4A Elgin Will Rivers 500 Yard Freestyle 04:32.97 2004-2005 4A Montgomery JJ Kinzbach One Meter Diving 521.3 2004-2005 5A Humble Kingwood Eric Olesen 100 Yard Backstroke 00:49.82 2004-2005 5A Austin Westlake Scott Spann 100 Yard Breaststroke 00:56.05 2004-2005 5A Humble Kingwood Eric Olesen 100 Yard Butterfly 00:49.94 2004-2005 5A Coppell Alex Oldenkamp 100 Yard Freestyle 00:45.96 2004-2005 5A Austin Bowie Michael Klueh 200 Yard Freestyle 01:36.69 2004-2005 5A Humble Kingwood 200 Yard Freestyle Relay 01:25.15 2004-2005 5A Round Rock Westwood Tony Colella 200 Yard Individual Medley 01:49.79 2004-2005 5A Austin Bowie 200 Yard Medley Relay 01:33.53 2004-2005 5A Austin Westlake 400 Yard Freestyle Relay 03:08.15 2004-2005 5A Coppell Alex Oldenkamp 50 Yard freestyle 00:20.55 2004-2005 5A Austin Bowie Michael Klueh 500 Yard Freestyle 04:19.41 2004-2005 5A Katy Taylor Max Weyermann One Meter Diving 500.9 2005-2006 4A Frisco Thiago Rebello, Hal Eubanks, Matt Giess, Jason Nix 200 Yard Medley Relay 1:38.66 2005-2006 4A Elgin Will Rivers 200 Yard Freestyle 1:41.03 2005-2006 4A Austin Johnson Tyson Slesnick 200 Yard Individual Medley 1:54.98 2005-2006 4A Richmond Foster Nick Ward 50 Yard freestyle 21.11 2005-2006 4A Montgomery JJ Kinzbach One Meter Diving 473.80 2005-2006 4A Greenville Ben Newell 100 Yard Butterfly 51.64 2005-2006 4A Richmond Foster Nick Ward 100 Yard Freestyle 46.24 2005-2006 4A Elgin Will Rivers 500 Yard Freestyle 4:27.37 2005-2006 4A Frisco Josh Pena, Colin Nix, Jason Nix, Hal Eubanks 200 Yard Freestyle Relay 1:27.61 2005-2006 4A Friendswood Cole Cragin 100 Yard Backstroke 53.59 2005-2006 4A New Caney Brad Safarik 100 Yard Breaststroke 57.91 2005-2006 4A Frisco Josh Pena, Matt Giess, Colin Nix, Thiago Rebello 400 Yard Freestyle Relay 3:16.62 2005-2006 5A Austin Westlake Andrew Wang, Scott Spann, Ross Irons, Kevin Swenson 200 Yard Medley Relay 1:32.29 2005-2006 5A Austin Bowie Maverick Smalley 200 Yard Freestyle 1:38.96 2005-2006 5A Humble Kingwood Garret Beaman 200 Yard Individual Medley 1:50.55 2005-2006 5A Houston Westside Casey Strange 50 Yard freestyle 20.74 2005-2006 5A Klein Harrison Jones One Meter Diving 520.75 2005-2006 5A Humble Kingwood Eric Olesen 100 Yard Butterfly 49.06 2005-2006 5A Humble Kingwood Eric Olesen 100 Yard Freestyle 45.14 2005-2006 5A Plano East MacKenzie LeBlanc 500 Yard Freestyle 4:29.43 2005-2006 5A Austin Westlake Andrew Wang, David Zolno, Charles Cassidy, Kevin Swenson 200 Yard Freestyle Relay 1:23.60 2005-2006 5A Dallas Jesuit Matt Thompson 100 Yard Backstroke 49.26 2005-2006 5A Austin Westlake Scott Spann 100 Yard Breaststroke 54.51 2005-2006 5A Humble Kingwood Chuck Ciliske, Benjamin Decker, Garret Beaman, Eric Olesen 400 Yard Freestyle Relay 3:04.86 2006-2007 4A Texarkana Texas Ethan price, Jason Hay, Coy Bryant, Nick Ramsey 200 Yard Medley Relay 1:39.74 2006-2007 4A Mesquite Poteet Clint H. Hallum 200 Yard Freestyle 1:41.18 2006-2007 4A Dallas Highland Park John Bannon 200 Yard Individual Medley 54.00 2006-2007 4A Frisco Colin Nix 50 Yard freestyle 21.30 2006-2007 4A Montgomery J.J. Kinzbach One Meter Diving 561 2006-2007 4A Richardson Pearce Nick Kalivas 100 Yard Butterfly 50.77 2006-2007 4A Nacogdoches John Howell 100 Yard Freestyle 47.51 2006-2007 4A Mesquite Poteet Clint H. Hallum 500 Yard Freestyle 4:29.91 2006-2007 4A Richardson Pearce Nick Kalivas, Andrew Lin, Stephen Yang, John Kalivas 200 Yard Freestyle Relay 1:27.17 2006-2007 4A Friendswood Cole Cragin 100 Yard Backstroke 50.54 2006-2007 4A Frisco Colin Nix 100 Yard Breaststroke 58.78 2006-2007 4A Frisco Josh Pena, Brad Bassett, Charles Melton, Colin Nix 400 Yard Freestyle Relay 3:11.72 2006-2007 5A Humble Kingwood Garrett Beaman, Benjamin Decker, Patrick Smith, David Campbell 200 Yard Medley Relay 1:34.76 2006-2007 5A Round Rock Westwood Joshua Nosal 200 Yard Freestyle 1:38.49 2006-2007 5A Houston Cypress Falls Neil Caskey 200 Yard Individual Medley 1:50.04 2006-2007 5A San Antonio Churchill Jimmy Feigen 50 Yard freestyle 20.45 2006-2007 5A Conroe The Woodlands Drew Livingston One Meter Diving 529.45 2006-2007 5A Houston Cypress Falls Neil Caskey 100 Yard Butterfly 49.50 2006-2007 5A Humble Kingwood Garrett Beaman 100 Yard Freestyle 44.72 2006-2007 5A Houston Stratford Hunter Bayley 500 Yard Freestyle 4:33.23 2006-2007 5A Humble Kingwood Kyle Sorge, Myles Wittkemper, Dan Ciliske, Garrett Beaman 200 Yard Freestyle Relay 1:25.41 2006-2007 5A Dallas Jesuit Matt Thompson 100 Yard Backstroke 49.03 2006-2007 5A Humble Kingwood Benjamin Decker 100 Yard Breaststroke 56.88 2006-2007 5A Southlake Carroll Trevor Mays, Jeff Hendricks, Drew Mays, Will Singley 400 Yard Freestyle Relay 3:06.89 2007-2008 4A Frisco Sean Bray, Jared Nix, Barrett Mark, Colin Nix 200 Yard Medley Relay 1:37.52 2007-2008 4A Austin Lake Travis Chris Griffin 200 Yard Freestyle 1:42.50 2007-2008 4A Frisco Barrett Mark 200 Yard Individual Medley 1:55.25 2007-2008 4A Austin Johnson Daniel Kempf 50 Yard freestyle 20.90 2007-2008 4A Montgomery Jake Kinzbach One Meter Diving 476.40 2007-2008 4A Friendswood Cole Cragin 100 Yard Butterfly 49.87 2007-2008 4A Frisco Colin Nix 100 Yard Freestyle 47.12 2007-2008 4A Austin Johnson Ryan Sittig 500 Yard Freestyle 4:34.69 2007-2008 4A Austin Johnson McCrae Kempf, AJ Ortega, Nolan Slesnick, Daniel Kempf 200 Yard Freestyle Relay 1:27.60 2007-2008 4A Friendswood Cole Cragin 100 Yard Backstroke 48.63 2007-2008 4A Frisco Jared Nix 100 Yard Breaststroke 58.99 2007-2008 4A Austin Johnson Nolan Slesnick, AJ Ortega, Ryan Sittig, Daniel Kempf 400 Yard Freestyle Relay 3:12.67 2007-2008 5A San Antonio Churchill John Ariens, Nick Masterson, Alex Seward, Jimmy Feigen 200 Yard Medley Relay 1:33.84 2007-2008 5A Houston Cypress Falls Neil Caskey 200 Yard Freestyle 1:37.39 2007-2008 5A Dallas Jesuit Matt Thompson 200 Yard Individual Medley 1:46.95 2007-2008 5A San Antonio Churchill Jimmy Feigen 50 Yard freestyle 19.49 2007-2008 5A Conroe The Woodlands Drew Livingston One Meter Diving 593.60 2007-2008 5A Houston Cypress Falls Neil Caskey 100 Yard Butterfly 48.97 2007-2008 5A San Antonio Churchill Jimmy Feigen 100 Yard Freestyle 43.05 2007-2008 5A Southlake Carroll Will Singley 500 Yard Freestyle 4:25.95 2007-2008 5A Lewisville Flower Mound Jack Dwyer, Jake Brown, Trey Gregory, Max Murphy 200 Yard Freestyle Relay 1:24.54 2007-2008 5A Dallas Jesuit Matt Thompson 100 Yard Backstroke 47.71 2007-2008 5A Conroe The Woodlands Chad Sorenson 100 Yard Breaststroke 56.75 2007-2008 5A San Antonio Churchill Alex Seward, Brady Garner, John Ariens, Jimmy Feigen 400 Yard Freestyle Relay 3:04.96 2008-2009 4A Frisco Barrett Mark, Jared Nix, Dean Stromme, Andrew North 200 Yard Medley Relay 1:35.82 2008-2009 4A Dallas Adams Caleb P. Veazey 200 Yard Freestyle 1:40.43 2008-2009 4A Frisco Barrett Mark 200 Yard Individual Medley 1:53.36 2008-2009 4A Freeport Brazoswood Forrest Hughes 50 Yard freestyle 20.58 2008-2009 4A Montgomery Jake Kinzbach One Meter Diving 497.55 2008-2009 4A Friendswood Cole Cragin 100 Yard Butterfly 48.46 2008-2009 4A Freeport Brazoswood Forrest Hughes 100 Yard Freestyle 45.88 2008-2009 4A Dallas Adams Caleb P. Veazey 500 Yard Freestyle 4:28.67 2008-2009 4A Boerne Champion Paul Bove, Cody Lickteig, Robert Fitzgerald, Andrew Nelson 200 Yard Freestyle Relay 1:26.95 2008-2009 4A Friendswood Cole Cragin 100 Yard Backstroke 46.75 2008-2009 4A Frisco Jared Nix 100 Yard Breaststroke 58.27 2008-2009 4A Humble Kingwood Park Brooks Powell, Mark Dix, Barrett Johannsen, Joseph Stanton 400 Yard Freestyle Relay 3:09.49 2008-2009 5A Round Rock Wesley Wheeler, Brendon Leach, Dax Hill, Kerrington Hill 200 Yard Medley Relay 1:34.06 2008-2009 5A Houston Stratford Hunter Bayley 200 Yard Freestyle 1:37.98 2008-2009 5A Dallas Jesuit Matt Thompson 200 Yard Individual Medley 1:45.27 2008-2009 5A El Paso Coronado Jake Hartley 50 Yard freestyle 20.54 2008-2009 5A Pearland Samual Decker One Meter Diving 511.15 2008-2009 5A Plano Paul Leonhardt 100 Yard Butterfly 48.38 2008-2009 5A Katy Mayde Creek Timothy Jones 100 Yard Freestyle 45.34 2008-2009 5A Plano West Brendan McIntee 500 Yard Freestyle 4:27.13 2008-2009 5A Plano Paul Leonhardt, Kevin Yang, Seth Russell, Seth Stubblefield 200 Yard Freestyle Relay 1:23.26 2008-2009 5A Dallas Jesuit Matt Thompson 100 Yard Backstroke 47.37 2008-2009 5A Round Rock Dax Hill 100 Yard Breaststroke 54.84 2008-2009 5A Plano Paul Leonhardt, Jason Wan, Seth Stubblefield, Seth Russell 400 Yard Freestyle Relay 3:04.55 2009-2010 4A Humble Kingwood Park Brooks Powell, Garrett Stewart, Mark Dix, Chris Amoruso 200 Yard Medley Relay 1:.33.80 2009-2010 4A Mansfield Timberview Bobby W. Button 200 Yard Freestyle 1:39.81 2009-2010 4A Richardson Pearce Adam H. Bull 200 Yard Individual Medley 1:54.20 2009-2010 4A Humble Kingwood Park Brooks Powell 50 Yard freestyle 20.98 2009-2010 4A Waco Midway Will Chandler One Meter Diving 445.95 2009-2010 4A Humble Kingwood Park Mark Dix 100 Yard Butterfly 50.11 2009-2010 4A Humble Kingwood Park Joseph Stanton 100 Yard Freestyle 45.84 2009-2010 4A Austin Lake Travis Chris Griffin 500 Yard Freestyle 4:33.73 2009-2010 4A Humble Kingwood Park Mark Dix, Chris Amoruso, Barrett Johannsen, Joseph Stanton 200 Yard Freestyle Relay 1:25.27 2009-2010 4A Dripping Springs Timothy Wylie 100 Yard Backstroke 51.09 2009-2010 4A Humble Kingwood Park Garret Stewart 100 Yard Breaststroke 59.19 2009-2010 4A Humble Kingwood Park Brooks Powell, Mark Dix, Barrett Johannsen, Joseph Stanton 400 Yard Freestyle Relay 3:09.20 2009-2010 5A Humble Kingwood Ryan M. Glander, Joseph Bergmeister, Matthew Barber, Jordan Jones 200 Yard Medley Relay 1:45.31 2009-2010 5A Humble Kingwood Matthew Barber 200 Yard Freestyle 1:37.30 2009-2010 5A Conroe Woodlands College Park Gray S. Umbach 200 Yard Individual Medley 1:47.59 2009-2010 5A El Paso Coronado Jake Hartley 50 Yard freestyle 20.22 2009-2010 5A Klein Hayden Jones One Meter Diving 512.35 2009-2010 5A Conroe Woodlands College Park Gray S. Umbach 100 Yard Butterfly 48.08 2009-2010 5A El Paso Coronado Jake Hartley 100 Yard Freestyle 44.83 2009-2010 5A Humble Kingwood Matthew Barber 500 Yard Freestyle 4:22.08 2009-2010 5A Conroe The Woodlands Cannon J. Clifton, Knox Hitt, Chad Sorensen, Tripp Cooper 200 Yard Freestyle Relay 1:23.41 2009-2010 5A Houston Cypress Creek Jonathan Edwards 100 Yard Backstroke 48.95 2009-2010 5A Katy Cinco Ranch Jason Ting 100 Yard Breaststroke 55.99 2009-2010 5A Plano Paul L. Leonhardt, Mitchell Foster, Seth Russell, Seth Stubblefield 400 Yard Freestyle Relay 3:02.37 2010-2011 4A San Antonio Alamo Heights Luke Shaw 200 Yard Freestyle 1:38.61 2010-2011 4A Richardson Pearce Adam Bull 200 Yard Individual Medley 1:49.59 2010-2011 4A Humble Kingwood Park Brooks Powell 50 Yard freestyle 20.64 2010-2011 4A San Antonio Alamo Heights Finn Scribbick One Meter Diving 201.90 2010-2011 4A Humble Kingwood Park Brooks Powell 100 Yard Butterfly 49.59 2010-2011 4A Frisco Wakeland Devin Compan 100 Yard Freestyle 45.45 2010-2011 4A San Antonio Alamo Heights Luke Shaw 500 Yard Freestyle 4:29.88 2010-2011 4A San Antonio Alamo Heights 200 Yard Freestyle Relay 1:24.69 2010-2011 4A Austin Lake Travis Reid Elliott 100 Yard Backstroke 49.60 2010-2011 4A Humble Kingwood Park Garrett Stewart 100 Yard Breaststroke 00:57.36 2010-2011 4A San Antonio Alamo Heights 400 Yard Freestyle Relay 3:07.90 2010-2011 5A Plano West Zach Walters 200 Yard Freestyle 1:37.88 2010-2011 5A Houston Cypress Creek Jonathan Edwards 200 Yard Individual Medley 1:46.98 2010-2011 5A San Antonio Churchill John Murray 50 Yard freestyle 20.23 2010-2011 5A Southlake Carroll Bryce Klein One Meter Diving 562.75 2010-2011 5A Conroe The Woodlands Tripp Cooper 100 Yard Butterfly 48.27 2010-2011 5A San Antonio Churchill John Murray 100 Yard Freestyle 44.30 2010-2011 5A Humble Kingwood Jordan Jones 500 Yard Freestyle 4:24.54 2010-2011 5A Conroe The Woodlands 200 Yard Freestyle Relay 1:23.50 2010-2011 5A Houston Cypress Creek Jonathan Edwards 100 Yard Backstroke 48.01 2010-2011 5A Humble Kingwood Jordan Jones 100 Yard Breaststroke 00:56.23 2010-2011 5A Houston Cypress Creek 400 Yard Freestyle Relay 3:05.05 2011-2012 4A Houston Stratford 200 Yard Medley Relay 1:35.01 2011-2012 4A San Antonio Alamo Heights Ian I. Lemaistre 200 Yard Freestyle 1:38.43 2011-2012 4A Richardson Pearce Adam H. Bull 200 Yard Individual Medley 1:49.84 2011-2012 4A Humble Kingwood Park Brooks Powell 50 Yard freestyle 20.28 2011-2012 4A San Antonio Alamo Heights Finn Scribbick One Meter Diving 525.40 2011-2012 4A Texarkana Texas Matt Cox 100 Yard Butterfly 50.32 2011-2012 4A Frisco Corey Nix 100 Yard Freestyle 45.13 2011-2012 4A Richardson Pearce Adam H. Bull 500 Yard Freestyle 4:30.47 2011-2012 4A Frisco 200 Yard Freestyle Relay 1:25.75 2011-2012 4A Austin Lake Travis Reid M. Elliott 100 Yard Backstroke 47.68 2011-2012 4A Houston Stratford Ford Story 100 Yard Breaststroke 00:56.63 2011-2012 4A San Antonio Alamo Heights 400 Yard Freestyle Relay 3:08.98 2011-2012 5A San Antonio Churchill 200 Yard Medley Relay 1:33.31 2011-2012 5A Southlake Carroll Ted A. Singley 200 Yard Freestyle 1:38.38 2011-2012 5A Conroe The Woodlands Gray Umbach 200 Yard Individual Medley 1:45/39 2011-2012 5A San Antonio Churchill Cory D. Bolleter 50 Yard freestyle 20.59 2011-2012 5A Round Rock Westwood Brad M. Homza One Meter Diving 572.10 2011-2012 5A Conroe Woodlands College Park Gray Umbach 100 Yard Butterfly 47.12 2011-2012 5A San Antonio Churchill John A. Murray 100 Yard Freestyle 43.76 2011-2012 5A Southlake Carroll Ted A. Singley 500 Yard Freestyle 4:23.68 2011-2012 5A Klein Collins 200 Yard Freestyle Relay 1:24.26 2011-2012 5A Houston Cypress Creek Jacob C. Wallace 100 Yard Backstroke 49.45 2011-2012 5A San Antonio Churchill Liam D. Lockwood 100 Yard Breaststroke 00:56.17 2011-2012 5A Conroe Woodlands College Park 400 Yard Freestyle Relay 3:04.42 2012-2013 4A Humble Kingwood Park 200 Yard Medley Relay 1:35.87 2012-2013 4A Frisco Wakeland Brayden Seal 200 Yard Freestyle 1:40.02 2012-2013 4A Houston Stratford Michael Miller 200 Yard Individual Medley 1:49.43 2012-2013 4A Houston Stratford Alec Willrodt 50 Yard freestyle 20.75 2012-2013 4A San Antonio Alamo Heights Finn Scribbick One Meter Diving 555.40 2012-2013 4A Houston Stratford Michael Miller 100 Yard Butterfly 48.93 2012-2013 4A Frisco Nicholas Hook 100 Yard Freestyle 45.97 2012-2013 4A Frisco Wakeland Brayden Seal 500 Yard Freestyle 4:28.23 2012-2013 4A San Antonio Alamo Heights 200 Yard Freestyle Relay 1:25.22 2012-2013 4A Frisco Lone Star Cody Holland 100 Yard Backstroke 51.17 2012-2013 4A Texarkana Texas Zach Baker 100 Yard Breaststroke 00:58.98 2012-2013 4A Houston Stratford 400 Yard Freestyle Relay 3:06.54 2012-2013 5A Conroe The Woodlands 200 Yard Medley Relay 1:32.41 2012-2013 5A San Antonio Marshall David Moore 200 Yard Individual Medley 1:48.40 2012-2013 5A Lewisville Hebron Joshua Clothier 50 Yard freestyle 20.69 2012-2013 5A Southlake Carroll Bryce Klein One Meter Diving 622.05 2012-2013 5A San Antonio Reagan Andrew Skowronek 100 Yard Butterfly 49.39 2012-2013 5A Conroe The Woodlands Cannon Clifton 100 Yard Freestyle 44.48 2012-2013 5A Southlake Carroll Jonathan Roberts 500 Yard Freestyle 4:20.08 2012-2013 5A Conroe The Woodlands 200 Yard Freestyle Relay 1:25.26 2012-2013 5A Keller Timber Creek Aaron Greene 100 Yard Backstroke 49.27 2012-2013 5A Conroe The Woodlands Ryan Scorensen 100 Yard Breaststroke 00:56.31 2012-2013 5A Southlake Carroll 400 Yard Freestyle Relay 3:04.10 2013-2014 4A Humble Kingwood Park 200 Yard Medley Relay 1:36.06 2013-2014 4A Frisco Wakeland Brayden Seal 200 Yard Freestyle 1:38.24 2013-2014 4A Angleton Carter Wallace 200 Yard Individual Medley 1:51.68 2013-2014 4A Corpus Christi Flour Bluff Anthony Hauglum 50 Yard freestyle 20.94 2013-2014 4A Texarkana Texas Chris Radomski 100 Yard Butterfly 49.84 2013-2014 4A Angleton Carter Wallace 100 Yard Freestyle 45.77 2013-2014 4A Frisco Wakeland Brayden Seal 500 Yard Freestyle 4:25.71 2013-2014 4A Corpus Christi Flour Bluff 200 Yard Freestyle Relay 1:25.98 2013-2014 4A Brenham Everett Mahlmann 100 Yard Backstroke 51.69 2013-2014 4A Tomball Trevor Strong 100 Yard Breaststroke 00:57.29 2013-2014 4A Frisco Wakeland 400 Yard Freestyle Relay 3:09.46 2013-2014 5A Southlake Carroll 200 Yard Medley Relay 1:34.93 2013-2014 5A Rockwall-Heath Jared Butler 200 Yard Individual Medley 1:47.53 2013-2014 5A Klein Robert Slaughter 50 Yard freestyle 20.61 2013-2014 5A San Antonio Marshall Christopher Law One Meter Diving 544.95 2013-2014 5A Bryan Harrison Jones 100 Yard Butterfly 48.76 2013-2014 5A San Antonio Brandeis Aaron Brysch 100 Yard Freestyle 45.12 2013-2014 5A Southlake Carroll Jonathan Roberts 500 Yard Freestyle 4:16.90 2013-2014 5A San Antonio Brandeis 200 Yard Freestyle Relay 1:24.79 2013-2014 5A Southlake Carroll Jonathan Roberts 100 Yard Backstroke 48.65 2013-2014 5A San Antonio Taft Migs Martin 100 Yard Breaststroke 00:56.04 2013-2014 5A Klein 400 Yard Freestyle Relay 3:03.91 2014-2015 5A Humble Kingwood Park 200 Yard Medley Relay 1:34.23 2014-2015 5A Frisco Wakeland Samuel Kline 200 Yard Freestyle 1:38.33 2014-2015 5A Bryan Walter Jones 200 Yard Individual Medley 1:49.95 2014-2015 5A Frisco Wakeland Jacob DeMercurio 50 Yard freestyle 20.72 2014-2015 5A Frisco Liberty Matthew Phillip One Meter Diving 519.50 2014-2015 5A Bryan Walter Jones 100 Yard Butterfly 48.54 2014-2015 5A Boerne Champion Owen Upchurch 100 Yard Freestyle 46.08 2014-2015 5A Frisco Wakeland Samuel Kline 500 Yard Freestyle 4:29.11 2014-2015 5A Houston Stratford 200 Yard Freestyle Relay 1:24.70 2014-2015 5A Frisco Wakeland Jacob De Mercurio 100 Yard Backstroke 49.21 2014-2015 5A Brenham Hudson Smith 100 Yard Breaststroke 00:57.15 2014-2015 5A Austin Vandegrift 400 Yard Freestyle Relay 3:30.10 2014-2015 6A Austin Lake Travis 200 Yard Medley Relay 1:32.97 2014-2015 6A Southlake Carroll Carson Klein 200 Yard Freestyle 1:37.36 2014-2015 6A Dallas Jesuit Brendan Feehery 200 Yard Individual Medley 1:47.60 2014-2015 6A Keller Luke Mankus 50 Yard freestyle 20.43 2014-2015 6A Southlake Carroll Nathaniel Hernandez One Meter Diving 613.75 2014-2015 6A Austin Lake Travis Mason Tenney 100 Yard Butterfly 48.56 2014-2015 6A Mansfield Mike Thibert 100 Yard Freestyle 44.68 2014-2015 6A Southlake Carroll Carson Klein 500 Yard Freestyle 4:26.50 2014-2015 6A Klein 200 Yard Freestyle Relay 1:23.29 2014-2015 6A Katy Cinco Ranch Glen Cowand 100 Yard Backstroke 48.59 2014-2015 6A Houston Lamar Safa Anya 100 Yard Breaststroke 00:55.41 2014-2015 6A Austin Westlake 400 Yard Freestyle Relay 3:27.24 2015-2016 5A Houston Stratford 200 Yard Medley Relay 1:35.04 2015-2016 5A Frisco Wakeland Sam Kline 200 Yard Freestyle 1:38.12 2015-2016 5A Brenham Hudson Smith 200 Yard Individual Medley 1:49.40 2015-2016 5A Houston Stratford Clayton Bobo 50 Yard freestyle 20.71 2015-2016 5A Mansfield Lake Ridge Hunter Jaynes One Meter Diving 473.50 2015-2016 5A Dripping Springs Micah Slaton 100 Yard Butterfly 48.87 2015-2016 5A Boerne Champion Owen Upchurch 100 Yard Freestyle 44.96 2015-2016 5A Frisco Wakeland Sam Kline 500 Yard Freestyle 4:28.67 2015-2016 5A Austin Vandegrift 200 Yard Freestyle Relay 1:25.73 2015-2016 5A A&M Consolidated Peter Simmons 100 Yard Backstroke 49.80 2015-2016 5A Brenham Hudson Smith 100 Yard Breaststroke 00:55.97 2015-2016 6A Katy Cinco Ranch 200 Yard Medley Relay 1:33.01 2015-2016 6A Dallas Jesuit Brendan Feehery 200 Yard Individual Medley 1:48.33 2015-2016 6A Southlake Carroll Jack LeVant 50 Yard freestyle 20.23 2015-2016 6A Southlake Carroll Nate Hernandez One Meter Diving 566.65 2015-2016 6A Southlake Carroll Jack LeVant 100 Yard Butterfly 48.20 2015-2016 6A Mansfield Mike Thibert 100 Yard Freestyle 44.49 2015-2016 6A Southlake Carroll Alex Zettle 500 Yard Freestyle 4:22.64 2015-2016 6A Katy Cinco Ranch 200 Yard Freestyle Relay 1:22.54 2015-2016 6A Katy Cinco Ranch Glen Cowand 100 Yard Backstroke 47.40 2015-2016 6A Austin Westlake Matthew Willenbring 100 Yard Breaststroke 00:56.20 2015-2016 6A Southlake Carroll 400 Yard Freestyle Relay 2:59.69 2016-2017 5A Waxahachie Levi David 50 Yard freestyle 20.61 2016-2017 5A A&M Consolidated Peter Simmons 100 Yard Butterfly 50.20 2016-2017 5A A&M Consolidated Peter Simmons 100 Yard Backstroke 49.97 2016-2017 5A Brenham Hudson Smith 100 Yard Breaststroke 55.67 2016-2017 5A Austin Grant Reed 200 Yard Freestyle 1:37.77 2016-2017 5A Frisco 200 Yard Freestyle Relay 1:26.38 2016-2017 5A Brenham Hudson Smith 200 Yard Individual Medley 1:48.68 2016-2017 5A A&M Consolidated 200 Yard Medley Relay 1:35.38 2016-2017 5A Grapevine 400 Yard Freestyle Relay 3:09.17 2016-2017 5A Dallas Highland Park Felix Van Cauwelaert 500 Yard Freestyle 4:30.15 2016-2017 6A Midland Garrett Martin One Meter Diving 477.70 2016-2017 6A Southlake Carroll Jack LeVant 100 Yard Butterfly 47.64 2016-2017 6A Austin Grant Reed 100 Yard Freestyle 44.78 2016-2017 6A Houston Stratford Timothy Bobo 100 Yard Freestyle 43.56 2016-2017 6A Katy Cinco Ranch Glen Cowand 100 Yard Backstroke 47.49 2016-2017 6A Austin Lake Travis Ryan Geheb 100 Yard Breaststroke 55.54 2016-2017 6A Southlake Carroll Alex Zettle 200 Yard Freestyle 1:36.27 2016-2017 6A Austin Westlake 200 Yard Freestyle Relay 1:23.59 2016-2017 6A Austin Westlake Matthew Willenbring 200 Yard Individual Medley 1:47.06 2016-2017 6A Southlake Carroll 200 Yard Medley Relay 1:31.32 2016-2017 6A Southlake Carroll 400 Yard Freestyle Relay 2:59.39 2016-2017 6A San Antonio Reagan Zach Yeadon 500 Yard Freestyle 4:19.13 2017-2018 5A Dallas Highland Park Felix Van Cauwelaert, Henry Wang, Peter Paulus, Omar Hmimy 200 Yard Medley Relay 1:33.51 2017-2018 5A Austin Will Barton 200 Yard Freestyle 1:39.55 2017-2018 5A Grapevine David Hallaron 200 Yard Individual Medley 1:49.54 2017-2018 5A Manvel Jack Armstrong 50 Yard freestyle 20.41 2017-2018 5A Mansfield Lake Ridge One Meter Diving 506.05 2017-2018 5A A&M Consolidated Peter Simmons 100 Yard Butterfly 49.15 2017-2018 5A Manvel Jack Armstrong 100 Yard Freestyle 44.74 2017-2018 5A Austin Will Barton 500 Yard Freestyle 4:31.68 2017-2018 5A Cedar Park Jay Lenner, Braden Sullivan, Vladimir Ivanov, Dominic Toledochez 200 Yard Freestyle Relay 1:26.25 2017-2018 5A A&M Consolidated Peter Simmons 100 Yard Backstroke 48.75 2017-2018 5A Frisco Liberty Jiwoo Oh 100 Yard Breaststroke 56.93 2017-2018 5A Georgetown Connor Lancaster, Will Corona, Greyson Alarcon, Corby Furrer 400 Yard Freestyle Relay 3:07.77 2017-2018 6A Conroe The Woodlands Alberto Gomez, Keenan Wolf, Tyler Hulet, Luke Jorris 200 Yard Medley Relay 1:31.87 2017-2018 6A Jack LeVant 200 Yard Freestyle 1:33.57 2017-2018 6A Katy Kaloyan Bratano 200 Yard Individual Medley 1:45.23 2017-2018 6A Houston Stratford Clayton Bobo 50 Yard freestyle 20.17 2017-2018 6A Southlake Carroll Jackson Miller One Meter Diving 478.70 2017-2018 6A Belton Noah Henry 100 Yard Butterfly 47.07 2017-2018 6A Houston Stratford Clayton Bobo 100 Yard Freestyle 43.93 2017-2018 6A Southlake Carroll Jack LeVant 500 Yard Freestyle 4:16.78 2017-2018 6A Southlake Carroll Jack LeVant, Logan Davis, Landon Armstrong, Landon Jensen 200 Yard Freestyle Relay 1:23.58 2017-2018 6A Allen Jason Park 100 Yard Backstroke 47.09 2017-2018 6A McAllen Shaine Casas 100 Yard Backstroke 47.12 2017-2018 6A Midland Braden Vines 100 Yard Breaststroke 54.18 2017-2018 6A Southlake Carroll Jack LeVant, Landon Armstrong, Kevin Repice, Landon Jensen 400 Yard Freestyle Relay 3:02.35 2018-2019 5A Dallas Highland Park Max VanCauwelaert, Henry Wang, Ethan Nguyen, Peter Paulus 200 Yard Medley Relay 1:33.66 2018-2019 5A Aledo Elijah Sohn 200 Yard Freestyle 1:38.83 2018-2019 5A Lucas Lovejoy Jed Michael Jon 200 Yard Individual Medley 1:49.89 2018-2019 5A Manvel Jack Armstrong 50 Yard freestyle 20.20 2018-2019 5A Mason Williams One Meter Diving 480.75 2018-2019 5A Georgetown Greyson Alarcon 100 Yard Butterfly 48.41 2018-2019 5A Manvel Jack Armstrong 100 Yard Freestyle 43.96 2018-2019 5A Georgetown Corby Furrer 500 Yard Freestyle 4:31.69 2018-2019 5A Georgetown William Corona, Greyson Alarcon, Landon Alarcon, Corby Furrer 200 Yard Freestyle Relay 1:24.87 2018-2019 5A Georgetown Greyson Alarcon 100 Yard Backstroke 48.89 2018-2019 5A Dallas Highland Park Peter Paulus 100 Yard Breaststroke 56.38 2018-2019 5A Georgetown William Corona, Greyson Alarcon, Daniel Pineiro, Corby Furrer 400 Yard Freestyle Relay 3:05.16 2018-2019 6A Smithson Valley Joe Hunt, Carter Hill, Konnar Klinksiek, Amechi Nwaeze 200 Yard Medley Relay 1:30.73 2018-2019 6A Keller Central Donald Scott 200 Yard Freestyle 1:36.54 2018-2019 6A Klein Caleb Duncan 50 Yard freestyle 20.09 2018-2019 6A Spring Dalton Lowe 100 Yard Butterfly 48.18 2018-2019 6A Klein Jacob Powell 100 Yard Freestyle 44.55 2018-2019 6A Houston Bellaire Briggs Shiller 500 Yard Freestyle 4:22.72 2018-2019 6A Smithson Valley Shaun Besch, Joe Hunt, Amechi Nwaeze, Konnar Klinksiek 200 Yard Freestyle Relay 1:23.26 2018-2019 6A Conroe The Woodlands Tyler Hulet 100 Yard Backstroke 48.82 2018-2019 6A Keller Central Donald Scott 100 Yard Breaststroke 55.19 2018-2019 6A Mansfield Lake Ridge Kyle Sanchez One Meter Diving 513.45 2018-2019 6A Conroe The Woodlands Nathaniel Hickman-Chow, Luke Jorris, Tyler Hulet, Matthew Tannenrger 400 Yard Freestyle Relay 3:02.73 2019-2020 5A Aledo Elijah Sohn 200 Yard Freestyle 1:37.02 2019-2020 5A Lucas Lovejoy Jed Michael Jones 200 Yard Individual Medley 1:48.62 2019-2020 5A Corpus Christi Flour Bluff Kraig Bray 50 Yard freestyle 20.51 2019-2020 5A Montgomery Lake Creek Mason Williams One Meter Diving 489.10 2019-2020 5A Frisco Wakeland Conor McKenna 100 Yard Butterfly 48.21 2019-2020 5A San Antonio Alamo Heights Connor Foote 100 Yard Freestyle 44.75 2019-2020 5A Austin Johnson Juan Ceresa 500 Yard Freestyle 4:27.21 2019-2020 5A Humble Kingwood Park Brendan Flaherty, Frankie Zelasko, Christian Ripp, Braden Hunt 200 Yard Freestyle Relay 1:24.08 2019-2020 5A Mansfield Legacy Eric Stelmar 100 Yard Backstroke 48.81 2019-2020 5A Friendswood Max Hardt 100 Yard Breaststroke 55.69 2019-2020 5A Dallas Highland Park Logan Rushing, Frankie Zelasko, Braden Hunt, Brendan Flaherty 400 Yard Freestyle Relay 3:05.18 2019-2020 5A San Antonio Alamo Heights Connor Foote, McCoy Patterson, Andrew Crosley, Cameron Chan 200 Yard Medley Relay 1:32.80 2019-2020 6A Conroe The Woodlands Matthew Tannerbaum 200 Yard Freestyle 1:37.14 2019-2020 6A Round Rock Vincent Ribeiro 200 Yard Individual Medley 1:46.86 2019-2020 6A Klein Oak David Oderinde 50 Yard freestyle 20.18 2019-2020 6A Conroe The Woodlands Cameron Cash One Meter Diving 526.85 2019-2020 6A Spring Dalton Lowe 100 Yard Butterfly 47.86 2019-2020 6A League City Clear Creek Jacob Bulseco 100 Yard Freestyle 44.14 2019-2020 6A Conroe The Woodlands Matthew Tannenbaum 500 Yard Freestyle 4:21.64 2019-2020 6A Klein Oak David Oderinde, Hunter Bangham, Brenden Massey, Collin Fuchs 200 Yard Freestyle Relay 1:23.36 2019-2020 6A Conroe The Woodlands Tyler Hulet 100 Yard Backstroke 48.47 2019-2020 6A Houston Clear Lake Mitchell Mason 100 Yard Breaststroke 54.59 2019-2020 6A Klein Oak David Oderinde, Brenden Massey, Hunter Lund, Collin Fuchs 400 Yard Freestyle Relay 3:02.50 2019-2020 6A Conroe The Woodlands Tyler Hulet, Jasper Van Lier, Zach Bentley, Matthew Tannenrger 200 Yard Medley Relay 1:31.00 2020-2021 5A Georgetown Corby Furrer 200 Yard Freestyle 1:38.11 2020-2021 5A Georgetown Jeremy Kelly 200 Yard Individual Medley 1:48.32 2020-2021 5A Lamar Fulshear HS Jake Litchfield 50 Yard freestyle 20.48 2020-2021 5A Mansfield Summit Benedict Nguyen One Meter Diving 551.65 2020-2021 5A Frisco Wakeland Conor McKenna 100 Yard Butterfly 48.71 2020-2021 5A San Antonio Alamo Heights Connor Foote 100 Yard Freestyle 44.38 2020-2021 5A Frisco Memorial Andrew Guziec 500 Yard Freestyle 4:33.65 2020-2021 5A San Antonio Alamo Heights Connor Foote 100 Yard Backstroke 48.42 2020-2021 5A Cedar Park Thomas Wu 100 Yard Breaststroke 56.29 2020-2021 5A Georgetown Jeremy Kelly, Landon Alarcon, Danny Pineiro, Corby Furrer 400 Yard Freestyle Relay 3:04.27 2020-2021 5A Humble Kingwood Park Logan Rushing, Frankie Zelasko, Zach Twomey, Chris Rosser 200 Yard Freestyle Relay 1:25.92 2020-2021 5A Georgetown Jeremy Kelly, Landon Alarcon, Danny Pineiro, Corby Furrer 200 Yard Medley Relay 1:31.79 2020-2021 6A Keller Cooper Lucas 200 Yard Freestyle 1:37.50 2020-2021 6A Conroe The Woodlands Munzer Kabbara 200 Yard Individual Medley 1:48.16 2020-2021 6A Round Rock Westwood Sonny Wang 50 Yard freestyle 20.56 2020-2021 6A Southlake Carroll Manuel Borowski One Meter Diving 535.10 2020-2021 6A Humble Kingwood Garret Green 100 Yard Butterfly 47.80 2020-2021 6A LC Clear Falls Seth Reno 100 Yard Freestyle 44.21 2020-2021 6A Plano East Trey Dickey 500 Yard Freestyle 4:26.77 2020-2021 6A Conroe The Woodlands Tyler Hulet 100 Yard Backstroke 47.47 2020-2021 6A Keller Noah Beladi 100 Yard Breaststroke 55.28 2020-2021 6A Humble Kingwood Brendan Studdert, Beck Parnham, Connor Little, Garret Green 400 Yard Freestyle Relay 3:00.34 2020-2021 6A Conroe The Woodlands Benjamin Scholl, Munzer Kabbara, Clay Crawford, Luke DiMiceli 200 Yard Freestyle Relay 1:22.09 2020-2021 6A Conroe The Woodlands Tyler Hulet, Roberto Bonilla Flores, Cotton Fields, Aidan Flanagan 200 Yard Medley Relay 1:30.08 2020-2021 6A San Antonio Reagan Luke Prior 50 Yard freestyle 20.56 2021-2022 5A Georgetown Jeremy Kelly, Landon Alarcon, Marcus Pineiro, Kaden Alarcon 200 Yard Medley Relay 1:32.59 2021-2022 5A Frisco Wakeland Conor McKenna 200 Yard Freestyle 1:37.92 2021-2022 5A Frisco Wakeland Tony Laurito 200 Yard Individual Medley 1:49.62 2021-2022 5A Georgetown Jeremy Kelly 50 Yard freestyle 20.02 2021-2022 5A Mansfield Summit Benedict Nguyen One Meter Diving 560.70 2021-2022 5A San Antonio Alamo Heights Conor Foote 100 Yard Butterfly 46.09 2021-2022 5A Lubbock River Paulk 100 Yard Freestyle 44.84 2021-2022 5A Georgetown Jeremy Kelly 500 Yard Freestyle 4:23.18 2021-2022 5A San Antonio Alamo Heights Connor Foote 100 Yard Backstroke 47.71 2021-2022 5A Cedar Park Thomas Wu 100 Yard Breaststroke 55.31 2021-2022 5A Fort Bend Clements Logan Brown, Kevin Zhou, Alex Fu, Hayden Bellotti 200 Yard Freestyle Relay 1:21.92 2021-2022 5A A&M Consolidated Michael Peng, Carston Johnson, Eric Xiao, Andrew Larsen 400 Yard Freestyle Relay 3:06.87 2021-2022 6A Plano West Theodore Chen, Watson Nguyen, Josemaria Romero, Kai Joshi 200 Yard Medley Relay 1:30.39 2021-2022 6A Keller Cooper Lucas 200 Yard Freestyle 1:35.29 2021-2022 6A Southlake Carroll Maximus Williams 200 Yard Individual Medley 1:43.70 2021-2022 6A Houston Cypress Woods Benjamin Scholl 50 Yard freestyle 19.95 2021-2022 6A Houston Cypress Woods Jacob Jones One Meter Diving 525.50 2021-2022 6A Prosper Jacob Wimberly 100 Yard Butterfly 48.37 2021-2022 6A Round Rock Westwood Sonny Wang 100 Yard Freestyle 43.38 2021-2022 6A Keller Cooper Lucas 500 Yard Freestyle 4:19.86 2021-2022 6A Southlake Carroll Maximus Williams 100 Yard Backstroke 48.36 2021-2022 6A Fort Bend Clements Logan Brown 100 Yard Breaststroke 53.68 2021-2022 6A A&M Consolidated Michael Peng, Carston Johnson, Eric Xiao, Andrew Larsen 200 Yard Freestyle Relay 1:25.67 2021-2022 6A Humble Kingwood Eddie Jin, Brendan Studdert, Connor Little, Garret Green 400 Yard Freestyle Relay 3:00.09 Boys Team Year Conference School 1969-1970 All Schools* Spring Branch 1970-1971 All Schools* Houston Memorial 1971-1972 All Schools* Houston Memorial 1972-1973 All Schools* Houston Memorial 1973-1974 All Schools* Houston Memorial 1974-1975 All Schools* Houston Bellaire 1975-1976 All Schools* League City Clear Lake 1976-1977 All Schools* League City Clear Lake 1977-1978 All Schools* Houston Memorial 1978-1979 All Schools* League City Clear Lake 1979-1980 All Schools* Houston Memorial 1980-1981 All Schools* League City Clear Lake 1981-1982 All Schools* League City Clear Lake 1982-1983 All Schools* League City Clear Lake 1983-1984 All Schools* League City Clear Lake 1984-1985 All Schools* Richardson Pearce 1985-1986 All Schools* Richardson Pearce 1986-1987 All Schools* San Antonio Churchill 1987-1988 All Schools* San Antonio Churchill 1988-1989 All Schools* San Antonio Churchill 1989-1990 All Schools* Conroe McCullough 1990-1991 All Schools* Plano 1991-1992 All Schools* Plano 1992-1993 All Schools* Humble Kingwood 1993-1994 All Schools* Humble Kingwood 1994-1995 All Schools* Houston Cypress Creek 1995-1996 All Schools* Conroe McCullough 1996-1997 All Schools* Conroe The Woodlands 1997-1998 All Schools* Plano 1998-1999 All Schools* Conroe The Woodlands 1999-2000 4A Dallas Highland Park 1999-2000 5A San Antonio Churchill 2000-2001 4A Southlake Carroll 2000-2001 5A Katy Taylor 2001-2002 4A Southlake Carroll 2001-2002 5A Humble Kingwood 2002-2003 4A Texarkana Texas 2002-2003 5A Katy Taylor 2003-2004 4A Richardson Pearce 2003-2004 5A Conroe The Woodlands 2004-2005 4A Frisco 2004-2005 5A Humble Kingwood 2005-2006 4A Frisco 2005-2006 5A Austin Westlake 2006-2007 4A Richardson Pearce 2006-2007 5A Humble Kingwood 2007-2008 4A Frisco 2007-2008 5A San Antonio Churchill 2008-2009 4A Humble Kingwood Park 2008-2009 5A Humble Kingwood 2009-2010 4A Humble Kingwood Park 2009-2010 5A Conroe The Woodlands 2010-2011 4A Humble Kingwood Park 2010-2011 5A Southlake Carroll 2011-2012 4A Houston Stratford 2011-2012 5A Southlake Carroll 2012-2013 4A Houston Stratford 2012-2013 5A Southlake Carroll 2013-2014 4A Frisco Wakeland 2013-2014 5A Southlake Carroll 2014-2015 5A Humble Kingwood Park 2014-2015 6A Southlake Carroll 2015-2016 5A Austin Vandegrift 2015-2016 6A Southlake Carroll 2016-2017 1A Dallas Highland Park 2016-2017 6A Southlake Carroll 2017-2018 5A Dallas Highland Park 2017-2018 6A Southlake Carroll 2018-2019 5A Georgetown 2018-2019 6A Southlake Carroll 2019-2020 5A Humble Kingwood Park 2019-2020 6A Humble Kingwood 2020-2021 5A Frisco Wakeland 2020-2021 6A Conroe The Woodlands 2021-2022 5A Frisco Wakeland 2021-2022 6A Southlake Carroll Girls Individual Select Event One Meter Diving 50 Yard Freestyle 100 Yard Butterfly 100 Yard Freestyle 100 Yard Backstroke 100 Yard Breaststroke 200 Yard Freestyle 200 Yard Freestyle Relay 200 Yard Individual Medley 200 Yard Medley Relay 400 Yard Freestyle Relay 500 Yard Freestyle Year Conference School Student Name Event Time 1969-1970 All Schools* San Antonio Roosevelt Debbie Alston 100 Yard Backstroke 01:08.20 1969-1970 All Schools* San Antonio MacArthur Tina Truet 100 Yard Breaststroke 01:12.80 1969-1970 All Schools* Houston Lamar Kate Green 100 Yard Butterfly 01:05.50 1969-1970 All Schools* San Antonio MacArthur Sally Billmeier 100 Yard Freestyle 00:58.90 1969-1970 All Schools* Richardson Ginny Brown 200 Yard Freestyle 02:07.10 1969-1970 All Schools* San Antonio Lee Meg Vinson 200 Yard Individual Medley 02:20.60 1969-1970 All Schools* San Antonio Churchill 200 Yard Medley Relay 02:06.00 1969-1970 All Schools* San Antonio Lee 400 Yard Freestyle Relay 04:02.00 1969-1970 All Schools* Houston Bellaire Denise Brelin 50 Yard freestyle 00:26.10 1969-1970 All Schools* Fort Worth Castleberry Christine Look One Meter Diving 388.3 1970-1971 All Schools* Houston Bellaire Pat Reeve 100 Yard Backstroke 01:05.40 1970-1971 All Schools* Burleson Carolyn Cates 100 Yard Breaststroke 01:14.00 1970-1971 All Schools* Richardson Shirley Gamble 100 Yard Butterfly 01:05.80 1970-1971 All Schools* Midland Lee Rees Langston 100 Yard Freestyle 00:56.70 1970-1971 All Schools* Corpus Christi King Adriane Ridgeway 200 Yard Freestyle 02:06.00 1970-1971 All Schools* Burleson Carolyn Cates 200 Yard Individual Medley 02:24.10 1970-1971 All Schools* Houston Bellaire 200 Yard Medley Relay 02:02.70 1970-1971 All Schools* Highland Park Dallas 400 Yard Freestyle Relay 04:07.60 1970-1971 All Schools* Fort Worth Paschal Elaina Guthowski 50 Yard freestyle 00:26.00 1970-1971 All Schools* Fort Worth Castleberry Christine Loock One Meter Diving 459.8 1971-1972 All Schools* Arlington Houston Jan Bunch 100 Yard Backstroke 01:04.39 1971-1972 All Schools* Westlake Austin Berry Boggs 100 Yard Breaststroke 01:11.52 1971-1972 All Schools* Austin McCallum Jill Thomas 100 Yard Butterfly 01:05.39 1971-1972 All Schools* Midland Lee Rees Langston 100 Yard Freestyle 00:56.73 1971-1972 All Schools* Midland Lee Rees Langston 200 Yard Freestyle 02:02.12 1971-1972 All Schools* Midland Lee Laura Nelson 200 Yard Individual Medley 02:20.92 1971-1972 All Schools* Houston Bellaire 200 Yard Medley Relay 02:01.40 1971-1972 All Schools* Houston Bellaire 400 Yard Freestyle Relay 03:52.68 1971-1972 All Schools* Arlington Houston Jan Bunch 50 Yard freestyle 00:25.80 1971-1972 All Schools* Fort Worth Castleberry Christine Loock One Meter Diving 485 1972-1973 All Schools* San Antonio Alamo Heights Mary Thornhill 100 Yard Backstroke 01:04.94 1972-1973 All Schools* Austin Westlake Berry Boggs 100 Yard Breaststroke 01:10.43 1972-1973 All Schools* San Antonio MacArthur Vicky Bialas 100 Yard Butterfly 01:02.94 1972-1973 All Schools* Midland Lee Rees Langston 100 Yard Freestyle 00:57.31 1972-1973 All Schools* Midland Lee Rees Langston 200 Yard Freestyle 02:02.24 1972-1973 All Schools* Westlake Austin Berry Boggs 200 Yard Individual Medley 02:19.40 1972-1973 All Schools* Houston Bellaire 200 Yard Medley Relay 02:01.29 1972-1973 All Schools* San Antonio Alamo Heights 400 Yard Freestyle Relay 03:50.45 1972-1973 All Schools* Dallas White Ann Gibson 50 Yard freestyle 00:25.81 1972-1973 All Schools* Fort Worth Arlington Heights Cindy Riddell One Meter Diving 427.6 1973-1974 All Schools* San Antonio MacArthur Becky Coffey 100 Yard Backstroke 01:03.10 1973-1974 All Schools* Dallas Highland Park Sarah Sanford 100 Yard Breaststroke 01:10.90 1973-1974 All Schools* Amarillo Sherry Page 100 Yard Butterfly 01:02.60 1973-1974 All Schools* San Antonio Marshall Laura Rudwick 100 Yard Freestyle 00:53.70 1973-1974 All Schools* San Antonio Marshall Laura Rudwick 200 Yard Freestyle 01:56.40 1973-1974 All Schools* San Antonio Jefferson Peggy Feldman 200 Yard Individual Medley 02:15.93 1973-1974 All Schools* San Antonio MacArthur 200 Yard Medley Relay 01:57.20 1973-1974 All Schools* Midland Lee 400 Yard Freestyle Relay 03:46.90 1973-1974 All Schools* Midland Mary Dowdle 50 Yard freestyle 00:25.30 1973-1974 All Schools* Houston Bellaire Lisa Pena 500 Yard Freestyle 05:10.10 1973-1974 All Schools* Fort Worth Arlington Heights Cindy Riddell One Meter Diving 395.65 1974-1975 All Schools* San Antonio MacArthur Becy Coffey 100 Yard Backstroke 01:02.80 1974-1975 All Schools* Houston Memorial Margaret Chalker 100 Yard Breaststroke 01:10.10 1974-1975 All Schools* San Antonio Jefferson Peggy Feldman 100 Yard Butterfly 00:59.10 1974-1975 All Schools* San Antonio Marshall Laura Rudwick 100 Yard Freestyle 00:52.70 1974-1975 All Schools* Ingleside Lisa Kelsey 200 Yard Freestyle 01:52.60 1974-1975 All Schools* San Antonio Jefferson Peggy Feldman 200 Yard Individual Medley 02:10.60 1974-1975 All Schools* Austin Anderson 200 Yard Medley Relay 01:58.60 1974-1975 All Schools* Dallas White 400 Yard Freestyle Relay 03:46.90 1974-1975 All Schools* San Antonio Marshall Laura Rudwick 50 Yard freestyle 00:24.10 1974-1975 All Schools* Ingleside Lisa Kelsy 500 Yard Freestyle 05:02.90 1974-1975 All Schools* Fort Worth Arlington Heights Cindy Riddell One Meter Diving 386.38 1975-1976 All Schools* League City Clear Lake Renee Magee 100 Yard Backstroke 33:36.00 1975-1976 All Schools* Houston Memorial Margaret Chalker 100 Yard Breaststroke 01:08.76 1975-1976 All Schools* Austin Anderson Monica Ross 100 Yard Butterfly 00:58.61 1975-1976 All Schools* San Antonio Marshall Laura Rudwick 100 Yard Freestyle 00:52.51 1975-1976 All Schools* Ingleside Lisa Kelsey 200 Yard Freestyle 01:51.83 1975-1976 All Schools* League City Clear Lake Renee Magee 200 Yard Individual Medley 02:08.21 1975-1976 All Schools* Houston Memorial 200 Yard Medley Relay 01:53.76 1975-1976 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:34.35 1975-1976 All Schools* San Antonio Marshall Laura Rudwick 50 Yard freestyle 00:24.23 1975-1976 All Schools* Houston Bellaire Lisa Pena 500 Yard Freestyle 05:08.12 1975-1976 All Schools* Austin Anderson Karen Firestein One Meter Diving 428.6 1976-1977 All Schools* Greenville Susan Reynolds 100 Yard Backstroke 01:00.17 1976-1977 All Schools* Houston Bellaire Anna Gruber 100 Yard Breaststroke 01:09.55 1976-1977 All Schools* Austin Anderson Monica Ross 100 Yard Butterfly 00:59.40 1976-1977 All Schools* Dallas White Kathy Morris 100 Yard Freestyle 00:53.16 1976-1977 All Schools* Houston Scarborough Susan Mungavin 200 Yard Freestyle 01:53.31 1976-1977 All Schools* Austin Anderson Monica Ross 200 Yard Individual Medley 02:13.37 1976-1977 All Schools* Houston Memorial 200 Yard Medley Relay 01:53.71 1976-1977 All Schools* League City Clear Creek 400 Yard Freestyle Relay 03:38.57 1976-1977 All Schools* San Antonio Marshall Laura Rudwick 50 Yard freestyle 00:24.33 1976-1977 All Schools* Houston Scarborough Susan Mungavin 500 Yard Freestyle 05:06.55 1976-1977 All Schools* Austin Erin Beiter One Meter Diving 435.66 1977-1978 All Schools* Greenville Susan Reynolds 100 Yard Backstroke 01:00.19 1977-1978 All Schools* San Antonio Churchill Cassie Cochran 100 Yard Breaststroke 01:06.53 1977-1978 All Schools* Houston Westchester Susan Mungavin 100 Yard Butterfly 00:59.18 1977-1978 All Schools* Spring JoAnne Simpson 100 Yard Freestyle 00:53.29 1977-1978 All Schools* Houston Westchester Susan Mungavin 200 Yard Freestyle 01:51.71 1977-1978 All Schools* Spring JoAnne Simpson 200 Yard Individual Medley 02:08.54 1977-1978 All Schools* Richardson 200 Yard Medley Relay 01:52.63 1977-1978 All Schools* Houston Westchester 400 Yard Freestyle Relay 03:35.71 1977-1978 All Schools* Richardson Nancy Hennessey 50 Yard freestyle 00:24.31 1977-1978 All Schools* San Antonio MacArthur Peggy Hollar 500 Yard Freestyle 05:02.69 1977-1978 All Schools* Arlington Michelle Menge One Meter Diving 398.65 1978-1979 All Schools* San Antonio Alamo Heights Lynn Reynolds 100 Yard Backstroke 01:00.70 1978-1979 All Schools* Houston Lee Michelle Merchant 100 Yard Breaststroke 01:06.73 1978-1979 All Schools* Houston Westchester Susan Mungavin 100 Yard Butterfly 00:58.55 1978-1979 All Schools* Humble Amy McLeod 100 Yard Freestyle 00:52.27 1978-1979 All Schools* Houston Westchester Susan Mungavin 200 Yard Freestyle 01:52.93 1978-1979 All Schools* Houston Lee Michelle Merchant 200 Yard Individual Medley 02:07.59 1978-1979 All Schools* League City Clear Creek 200 Yard Medley Relay 01:52.72 1978-1979 All Schools* League City Clear Creek 400 Yard Freestyle Relay 03:37.21 1978-1979 All Schools* League City Clear Lake Sharon Spuler 50 Yard freestyle 00:24.07 1978-1979 All Schools* Richardson Dianna Stiles 500 Yard Freestyle 04:58.74 1978-1979 All Schools* Dallas Hillcrest Linda Telkamp One Meter Diving 418.4 1979-1980 All Schools* Conroe McCullough Diana Zock 100 Yard Backstroke 00:59.65 1979-1980 All Schools* Houston Lee Michelle Merchant 100 Yard Breaststroke 01:06.35 1979-1980 All Schools* League City Clear Lake Bonnie Nash 100 Yard Butterfly 00:57.21 1979-1980 All Schools* Humble Kingwood Amy McLeod 100 Yard Freestyle 00:51.32 1979-1980 All Schools* Humble Kingwood Amy McLeod 200 Yard Freestyle 01:49.76 1979-1980 All Schools* Houston Lee Michelle Merchant 200 Yard Individual Medley 02:06.90 1979-1980 All Schools* San Antonio Clark 200 Yard Medley Relay 01:54.45 1979-1980 All Schools* Spring 400 Yard Freestyle Relay 03:35.25 1979-1980 All Schools* Conroe McCullough Diana Zock 50 Yard freestyle 00:24.25 1979-1980 All Schools* Westlake Austin Christie Patterson 500 Yard Freestyle 04:59.64 1979-1980 All Schools* Dallas White Monique Jannette One Meter Diving 411.45 1980-1981 All Schools* Conroe McCullough Diana Zock 100 Yard Backstroke 00:59.28 1980-1981 All Schools* El Paso Coronado Susan Marks 100 Yard Breaststroke 01:08.59 1980-1981 All Schools* League City Clear Lake Nancy McCrea 100 Yard Butterfly 00:56.50 1980-1981 All Schools* Humble Kingwood Amy McLeod 100 Yard Freestyle 00:51.20 1980-1981 All Schools* Conroe McCullough Diana Zock 200 Yard Freestyle 01:50.52 1980-1981 All Schools* Amarillo Tascosa Lisa Martinez 200 Yard Individual Medley 02:09.47 1980-1981 All Schools* Stratford 200 Yard Medley Relay 01:52.98 1980-1981 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:34.54 1980-1981 All Schools* Humble Kingwood Amy McLeod 50 Yard freestyle 00:23.79 1980-1981 All Schools* Westlake Austin Christie Patterson 500 Yard Freestyle 04:59.80 1980-1981 All Schools* San Antonio Clark Theresa Boyd One Meter Diving 393.8 1981-1982 All Schools* Corpus Christi Ray Julianna Wilemon 100 Yard Backstroke 00:58.92 1981-1982 All Schools* Georgetown Kendall Stone 100 Yard Breaststroke 01:06.54 1981-1982 All Schools* Stratford Karen Sullivan 100 Yard Butterfly 00:55.89 1981-1982 All Schools* Humble Kingwood Amy McLeod 100 Yard Freestyle 00:51.37 1981-1982 All Schools* Conroe McCullough Diana Zock 200 Yard Freestyle 01:50.71 1981-1982 All Schools* San Antonio Lackland Venessa Richey 200 Yard Individual Medley 02:05.87 1981-1982 All Schools* League City Clear Lake 200 Yard Medley Relay 01:52.90 1981-1982 All Schools* League City Clear Lake 400 Yard Freestyle Relay 03:34.99 1981-1982 All Schools* Humble Kingwood Amy McLeod 50 Yard freestyle 00:23.55 1981-1982 All Schools* Conroe McCullough Diana Zock 500 Yard Freestyle 04:52.70 1981-1982 All Schools* Fort Worth Southwest Julie Sebastian One Meter Diving 432.05 1982-1983 All Schools* Klein Jennifer Pokluda 100 Yard Backstroke 00:57.81 1982-1983 All Schools* Austin Anderson Sarah Hallman 100 Yard Breaststroke 01:05.97 1982-1983 All Schools* League City Clear Lake Nancy McCrea 100 Yard Butterfly 00:57.81 1982-1983 All Schools* Highland Park Dallas Katie Carson 100 Yard Freestyle 00:52.27 1982-1983 All Schools* Highland Park Dallas Katie Carson 200 Yard Freestyle 11:51.61 1982-1983 All Schools* Houston Bellaire Kelly Jjohnston 200 Yard Individual Medley 02:10.25 1982-1983 All Schools* Austin Anderson 200 Yard Medley Relay 01:48.97 1982-1983 All Schools* Austin Anderson 400 Yard Freestyle Relay 03:39.04 1982-1983 All Schools* League City Clear Creek Sandy Hammack 50 Yard freestyle 00:23.83 1982-1983 All Schools* Austin Anderson Deanne Burnett 500 Yard Freestyle 04:57.23 1982-1983 All Schools* League City Clear Creek Patti Overmeyer One Meter Diving 393.15 1983-1984 All Schools* Spring Klein Jennifer Pokluda 100 Yard Backstroke 00:59.08 1983-1984 All Schools* Georgetown Kendal Stone 100 Yard Breaststroke 01:04.98 1983-1984 All Schools* De Soto Jennifer Melton 100 Yard Butterfly 00:57.69 1983-1984 All Schools* Highland Park Dallas Katie Carson 100 Yard Freestyle 00:52.63 1983-1984 All Schools* Highland Park Dallas Katie Carson 200 Yard Freestyle 01:52.23 1983-1984 All Schools* San Antonio Churchill Vanessa Richey 200 Yard Individual Medley 02:06.55 1983-1984 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:52.83 1983-1984 All Schools* San Antonio Marshall 400 Yard Freestyle Relay 03:35.08 1983-1984 All Schools* League City Clear Creek Sandra Hammack 50 Yard freestyle 00:23.81 1983-1984 All Schools* San Antonio Churchill Vanessa Richey 500 Yard Freestyle 04:55.71 1983-1984 All Schools* Spring Branch Kelly Jenkins One Meter Diving 447.7 1984-1985 All Schools* Plano Stephanie Langham 100 Yard Backstroke 00:59.34 1984-1985 All Schools* San Antonio Churchill Erin Easton 100 Yard Breaststroke 01:05.97 1984-1985 All Schools* Clute Brazoswood Kristi Kiggans 100 Yard Butterfly 00:57.46 1984-1985 All Schools* Duncanville Jeanee Doolan 100 Yard Freestyle 00:52.02 1984-1985 All Schools* Plano Stephanie Langham 200 Yard Freestyle 01:52.29 1984-1985 All Schools* San Antonio Churchill Erin Easton 200 Yard Individual Medley 02:06.04 1984-1985 All Schools* League City Clear Lake 200 Yard Medley Relay 01:52.50 1984-1985 All Schools* Duncanville 400 Yard Freestyle Relay 03:36.20 1984-1985 All Schools* Duncanville Jeanne Doolan 50 Yard freestyle 00:23.49 1984-1985 All Schools* Saginaw Boswell Missy Bunnell 500 Yard Freestyle 04:59.15 1984-1985 All Schools* Spring Branch Kelly Jenkins One Meter Diving 413.35 1985-1986 All Schools* Katy Taylor Elaine Thomas 100 Yard Backstroke 00:59.67 1985-1986 All Schools* Richardson Berkner Carey Cheshier 100 Yard Breaststroke 01:03.42 1985-1986 All Schools* Freeport Brazoswood Kristi Kiggans 100 Yard Butterfly 00:56.93 1985-1986 All Schools* Duncanville Jeanne Doolan 100 Yard Freestyle 00:51.25 1985-1986 All Schools* Richardson Susan North 200 Yard Freestyle 01:51.53 1985-1986 All Schools* Houston Cypress Creek Andrea Ciro 200 Yard Individual Medley 02:09.89 1985-1986 All Schools* San Antonio Marshall 200 Yard Medley Relay 01:51.55 1985-1986 All Schools* San Antonio Clark 400 Yard Freestyle Relay 03:36.71 1985-1986 All Schools* Duncanville Jeanne Doolan 50 Yard freestyle 00:23.35 1985-1986 All Schools* Richardson Susan North 500 Yard Freestyle 04:59.57 1985-1986 All Schools* Houston Memorial Kelley Jenkins One Meter Diving 462.65 1986-1987 All Schools* Midland Michaela Hasek 100 Yard Backstroke 00:58.31 1986-1987 All Schools* Dallas Highland Park Catherine Marcus 100 Yard Breaststroke 01:05.42 1986-1987 All Schools* Freeport Brazoswood Kristi Kiggans 100 Yard Butterfly 00:56.54 1986-1987 All Schools* Richardson Lake Highlands Missy Allhert 100 Yard Freestyle 00:51.10 1986-1987 All Schools* Richardson Susan North 200 Yard Freestyle 01:50.81 1986-1987 All Schools* Richardson Berkner Tara Reynolds 200 Yard Individual Medley 02:04.43 1986-1987 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:52.77 1986-1987 All Schools* San Antonio Marshall 400 Yard Freestyle Relay 03:34.15 1986-1987 All Schools* Richardson Lake Highlands Missy Allhert 50 Yard freestyle 00:23.63 1986-1987 All Schools* Arlington Martin Lori Werth 500 Yard Freestyle 04:57.49 1986-1987 All Schools* Houston Memorial Kelly Jenkins One Meter Diving 476.4 1987-1988 All Schools* Plano East Jodi Wilson 100 Yard Backstroke 00:57.10 1987-1988 All Schools* San Antonio Taft Laura Grimes 100 Yard Breaststroke 01:05.11 1987-1988 All Schools* League City Clear Lake Lisa Rhodes 100 Yard Butterfly 00:56.74 1987-1988 All Schools* Richardson Lake Highlands Missy Allert 100 Yard Freestyle 00:51.20 1987-1988 All Schools* Austin Anderson Lenore Burnett 200 Yard Freestyle 01:51.50 1987-1988 All Schools* Richardson Berkner Tara Reynolds 200 Yard Individual Medley 02:05.08 1987-1988 All Schools* League City Clear Lake 200 Yard Medley Relay 01:51.44 1987-1988 All Schools* Plano 400 Yard Freestyle Relay 03:32.42 1987-1988 All Schools* Richardson Berkner Missy Allert 50 Yard freestyle 00:23.71 1987-1988 All Schools* Conroe McCullough Lori Walker 500 Yard Freestyle 04:51.10 1987-1988 All Schools* Houston Lee Hedi Gilbert One Meter Diving 377.4 1988-1989 All Schools* Plano East Jodi Wilson 100 Yard Backstroke 00:56.83 1988-1989 All Schools* San Antonio Madison Indria Allick 100 Yard Breaststroke 01:04.72 1988-1989 All Schools* Houston Lee Nicole Dressen 100 Yard Butterfly 00:56.32 1988-1989 All Schools* Houston Cy-Fair Kim Smith 100 Yard Freestyle 00:51.88 1988-1989 All Schools* Plano East Jodi Wilson 200 Yard Freestyle 01:51.33 1988-1989 All Schools* Conroe McCullough Lisa Rhodes 200 Yard Individual Medley 02:04.84 1988-1989 All Schools* Conroe McCullough 200 Yard Medley Relay 01:49.63 1988-1989 All Schools* Houston Cy-Fair 400 Yard Freestyle Relay 03:32.89 1988-1989 All Schools* San Antonio Madison Indria Allick 50 Yard freestyle 00:23.76 1988-1989 All Schools* Conroe McCullough Lori Walker 500 Yard Freestyle 04:54.65 1988-1989 All Schools* San Antonio MacArthur Janette Stephenson One Meter Diving 411.9 1989-1990 All Schools* Houston Lee Nicole Dreessen 100 Yard Backstroke 00:57.68 1989-1990 All Schools* San Antonio Madison Indria Allick 100 Yard Breaststroke 01:04.59 1989-1990 All Schools* Houston Lee Nicole Dreessen 100 Yard Butterfly 00:55.55 1989-1990 All Schools* Klein Oak Tina Schweiger 100 Yard Freestyle 00:51.98 1989-1990 All Schools* Conroe McCullough Lori Walker 200 Yard Freestyle 01:51.70 1989-1990 All Schools* Conroe McCullough Lisa Rhodes 200 Yard Individual Medley 02:04.75 1989-1990 All Schools* Conroe McCullough 200 Yard Medley Relay 01:48.67 1989-1990 All Schools* San Antonio Madison 400 Yard Freestyle Relay 03:34.89 1989-1990 All Schools* San Antonio Madison Indria Allick 50 Yard freestyle 00:23.24 1989-1990 All Schools* Conroe McCullough Lori Walker 500 Yard Freestyle 04:55.77 1989-1990 All Schools* San Antonio MacArthur Janette Stephenson One Meter Diving 456.95 1990-1991 All Schools* Houston Lee Nicole Dreessen 100 Yard Backstroke 00:56.87 1990-1991 All Schools* Richardson Berkner Jennifer LeMaster 100 Yard Breaststroke 01:06.17 1990-1991 All Schools* Houston Lee Nicole Dreessen 100 Yard Butterfly 00:55.62 1990-1991 All Schools* Klein Oak Tina Schweiger 100 Yard Freestyle 00:51.46 1990-1991 All Schools* Klein Oak Tina Schweiger 200 Yard Freestyle 01:50.78 1990-1991 All Schools* Conroe McCullough 200 Yard Freestyle Relay 01:37.08 1990-1991 All Schools* San Antonio Madison Indria Allick 200 Yard Individual Medley 02:01.69 1990-1991 All Schools* Humble Kingwood 200 Yard Medley Relay 01:50.03 1990-1991 All Schools* Conroe McCullough 400 Yard Freestyle Relay 03:30.10 1990-1991 All Schools* Harlingen Julie Bates 50 Yard freestyle 00:23.98 1990-1991 All Schools* Conroe McCullough Lori Walker 500 Yard Freestyle 04:51.70 1990-1991 All Schools* San Antonio MacArthur Janette Stephenson One Meter Diving 439.75 1991-1992 All Schools* San Antonio Taft Jennifer Banda 100 Yard Backstroke 00:57.12 1991-1992 All Schools* Richardson Berkner Jennifer LeMaster 100 Yard Breaststroke 01:03.67 1991-1992 All Schools* Sugar Land Clements Stacie Karnes 100 Yard Butterfly 00:56.52 1991-1992 All Schools* Richardson Pearce Kim Johnson 100 Yard Freestyle 00:51.12 1991-1992 All Schools* Plano Wendy Cuthbert 200 Yard Freestyle 01:50.70 1991-1992 All Schools* Conroe McCullough 200 Yard Freestyle Relay 01:37.43 1991-1992 All Schools* San Antonio Taft Jennifer Banda 200 Yard Individual Medley 02:03.45 1991-1992 All Schools* Humble Kingwood 200 Yard Medley Relay 01:47.93 1991-1992 All Schools* Conroe McCullough 400 Yard Freestyle Relay 03:30.89 1991-1992 All Schools* Conroe McCullough Tara Leach 50 Yard freestyle 00:23.82 1991-1992 All Schools* San Antonio Marshall Heather Bransletter 500 Yard Freestyle 04:52.64 1991-1992 All Schools* San Antonio MacArthur Janette Stephenson One Meter Diving 461.85 1992-1993 All Schools* Houston Stratford Alegra Breaux 100 Yard Backstroke 00:55.64 1992-1993 All Schools* Houston Stratford Jennifer Moriarty 100 Yard Breaststroke 01:03.65 1992-1993 All Schools* Plano Wendy Cuthbert 100 Yard Butterfly 00:56.18 1992-1993 All Schools* Richardson Pearce Kim Johnson 100 Yard Freestyle 00:50.98 1992-1993 All Schools* Plano Amanda LeGrow 200 Yard Freestyle 01:49.88 1992-1993 All Schools* Conroe McCullough 200 Yard Freestyle Relay 01:37.12 1992-1993 All Schools* Richardson Pearce Kim Johnson 200 Yard Individual Medley 02:02.72 1992-1993 All Schools* Humble Kingwood 200 Yard Medley Relay 01:47.88 1992-1993 All Schools* Plano 400 Yard Freestyle Relay 03:31.37 1992-1993 All Schools* Richardson Berkner Erin Maher 50 Yard freestyle 00:23.64 1992-1993 All Schools* Plano East Sarah Nunemaker 500 Yard Freestyle 04:52.50 1992-1993 All Schools* Round Rock Westwood Jenny Linghamfelter One Meter Diving 481.85 1993-1994 All Schools* Richardson Berkner Erin Maher 100 Yard Backstroke 00:56.66 1993-1994 All Schools* Houston Stratford Jennifer Moriarty 100 Yard Breaststroke 01:03.60 1993-1994 All Schools* Sugar Land Clements Stacie Karnes 100 Yard Butterfly 00:56.13 1993-1994 All Schools* Richardson Pearce Kim Johnson 100 Yard Freestyle 00:50.15 1993-1994 All Schools* Sugar Land Clements Stacie Karnes 200 Yard Freestyle 01:50.29 1993-1994 All Schools* Humble Kingwood 200 Yard Freestyle Relay 01:38.58 1993-1994 All Schools* Houston Stratford Alegra Breaux 200 Yard Individual Medley 02:01.56 1993-1994 All Schools* Houston Stratford 200 Yard Medley Relay 01:48.65 1993-1994 All Schools* Plano 400 Yard Freestyle Relay 03:33.76 1993-1994 All Schools* Humble Leah Breaux 50 Yard freestyle 00:23.47 1993-1994 All Schools* San Antonio Marshall Heather Branstetter 500 Yard Freestyle 04:47.97 1993-1994 All Schools* Round Rock Westwood Jenny Linghamfelter One Meter Diving 510.5 1994-1995 All Schools* Allen Katy White 100 Yard Backstroke 00:56.70 1994-1995 All Schools* Duncanville Katie McClelland 100 Yard Breaststroke 01:02.89 1994-1995 All Schools* Houston Stratford Ashley Burton 100 Yard Butterfly 00:57.19 1994-1995 All Schools* Richardson Berkner Erin Maher 100 Yard Freestyle 00:50.76 1994-1995 All Schools* Houston Stratford Ashley Burton 200 Yard Freestyle 01:50.79 1994-1995 All Schools* Houston Cypress Falls 200 Yard Freestyle Relay 01:38.46 1994-1995 All Schools* Midland Lee Monica Stroman 200 Yard Individual Medley 02:04.68 1994-1995 All Schools* Richardson Berkner 200 Yard Medley Relay 01:47.72 1994-1995 All Schools* Richardson Berkner 400 Yard Freestyle Relay 03:32.44 1994-1995 All Schools* Richardson Berkner Erin Maher 50 Yard freestyle 00:23.29 1994-1995 All Schools* Midland Lee Monica Stroman 500 Yard Freestyle 05:00.65 1994-1995 All Schools* Klein Katie Sustman One Meter Diving 430 1995-1996 All Schools* Allen Katy White 100 Yard Backstroke 00:56.81 1995-1996 All Schools* Allen Janna Brock 100 Yard Breaststroke 01:04.20 1995-1996 All Schools* San Antonio Health Careers Leticia Herrera 100 Yard Butterfly 00:57.76 1995-1996 All Schools* Houston Nimitz Kelly Bolton 100 Yard Freestyle 00:51.21 1995-1996 All Schools* Houston Cypress Falls Rachel Armstrong 200 Yard Freestyle 01:51.40 1995-1996 All Schools* Austin Westlake 200 Yard Freestyle Relay 01:37.88 1995-1996 All Schools* Midland Lee Monica Stroman 200 Yard Individual Medley 02:03.33 1995-1996 All Schools* Allen 200 Yard Medley Relay 01:49.11 1995-1996 All Schools* Temple 400 Yard Freestyle Relay 03:33.26 1995-1996 All Schools* Houston Nimitz Kelly Bolton 50 Yard freestyle 00:51.21 1995-1996 All Schools* San Antonio Taft Megan Ryther 500 Yard Freestyle 04:55.68 1995-1996 All Schools* McKinney Jena Joplin One Meter Diving 453.45 1996-1997 All Schools* Midland Lee Amber Goodwin 100 Yard Backstroke 00:56.54 1996-1997 All Schools* Allen Janna Brock 100 Yard Breaststroke 01:04.55 1996-1997 All Schools* Houston Cypress Falls Carli Watts 100 Yard Butterfly 00:57.06 1996-1997 All Schools* Houston Nimitz Kelly Bolton 100 Yard Freestyle 00:50.55 1996-1997 All Schools* Klein Oak Carolyn Conrad 200 Yard Freestyle 01:50.41 1996-1997 All Schools* Austin Westlake 200 Yard Freestyle Relay 01:36.95 1996-1997 All Schools* San Antonio Marshall Kathy Barris 200 Yard Individual Medley 02:04.59 1996-1997 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:48.97 1996-1997 All Schools* Austin Westlake 400 Yard Freestyle Relay 03:30.51 1996-1997 All Schools* Houston Nimitz Kelly Bolton 50 Yard freestyle 00:23.39 1996-1997 All Schools* Plano Dana Penn 500 Yard Freestyle 04:53.57 1996-1997 All Schools* Round Rock Westwood Ashely Culpepper One Meter Diving 458.8 1997-1998 All Schools* Plano Marybeth Mounce 100 Yard Backstroke 00:56.50 1997-1998 All Schools* San Antonio Lee Sarah Chandler 100 Yard Breaststroke 01:03.73 1997-1998 All Schools* Austin Westlake Natalie Cohee 100 Yard Butterfly 00:56.99 1997-1998 All Schools* Austin Westlake Liane Watkins 100 Yard Freestyle 00:51.04 1997-1998 All Schools* Klein Oak Carolyn Conrad 200 Yard Freestyle 01:49.57 1997-1998 All Schools* Austin Westlake 200 Yard Freestyle Relay 01:35.72 1997-1998 All Schools* Klein Oak Jaime Ellis 200 Yard Individual Medley 02:02.69 1997-1998 All Schools* Houston Cypress Creek 200 Yard Medley Relay 01:46.45 1997-1998 All Schools* Plano 400 Yard Freestyle Relay 03:29.22 1997-1998 All Schools* Austin Westlake Liane Watkins 50 Yard freestyle 00:23.47 1997-1998 All Schools* Klein Oak Jamie Ellis 500 Yard Freestyle 04:54.21 1997-1998 All Schools* Houston Memorial Heather Mattingly One Meter Diving 484.15 1998-1999 All Schools* Austin Westlake Kim Bercen 100 Yard Backstroke 00:56.13 1998-1999 All Schools* San Antonio Lee Sarah Chandler 100 Yard Breaststroke 01:04.16 1998-1999 All Schools* Houston Cypress Creek Jamie Miller 100 Yard Butterfly 00:57.19 1998-1999 All Schools* El Paso Franklin Lacey Elliot 100 Yard Freestyle 00:51.49 1998-1999 All Schools* Klein Oak Jamie Ellis 200 Yard Freestyle 01:50.09 1998-1999 All Schools* San Antonio Churchill 200 Yard Freestyle Relay 01:36.46 1998-1999 All Schools* Klein Oak Jamie Ellis 200 Yard Individual Medley 02:03.42 1998-1999 All Schools* San Antonio Churchill 200 Yard Medley Relay 01:47.33 1998-1999 All Schools* San Antonio Churchill 400 Yard Freestyle Relay 03:30.41 1998-1999 All Schools* El Paso Franklin Lacey Elliott 50 Yard freestyle 00:23.33 1998-1999 All Schools* Houston Cypress Falls Liz Hoffman 500 Yard Freestyle 04:55.15 1998-1999 All Schools* Conroe Oak Ridge Nancilea Underwood One Meter Diving 446.2 1999-2000 4A Austin Johnson Meghan Flanagan 100 Yard Backstroke 00:58.94 1999-2000 4A Austin Johnson Amber Schmidt 100 Yard Breaststroke 01:06.23 1999-2000 4A Colleyville Heritage Briana Brotherson 100 Yard Butterfly 00:58.86 1999-2000 4A Grapevine Erica Tate 100 Yard Freestyle 00:52.45 1999-2000 4A San Antonio Alamo Heights Celeste Rogers 200 Yard Freestyle 01:53.11 1999-2000 4A San Antonio Alamo Heights 200 Yard Freestyle Relay 01:42.64 1999-2000 4A Dallas Highland Park Whitney Henderson 200 Yard Individual Medley 02:09.62 1999-2000 4A Austin Johnson 200 Yard Medley Relay 01:52.34 1999-2000 4A Dallas Highland Park 400 Yard Freestyle Relay 03:39.80 1999-2000 4A Grapevine Erica Tate 50 Yard freestyle 00:24.18 1999-2000 4A Dallas Highland Park Whitney Henderson 500 Yard Freestyle 05:02.20 1999-2000 4A Conroe Oak Ridge Nancilea Underwood One Meter Diving 413.75 1999-2000 5A Austin Westlake Kim Bercen 100 Yard Backstroke 00:55.19 1999-2000 5A Lewisville Marcus Laura Bares 100 Yard Breaststroke 01:03.88 1999-2000 5A Houston Cypress Creek Lisa D'Olier 100 Yard Butterfly 00:56.43 1999-2000 5A Plano Dallas Marshall 100 Yard Freestyle 00:51.59 1999-2000 5A Klein Oak Jaime Ellis 200 Yard Freestyle 01:48.76 1999-2000 5A Plano 200 Yard Freestyle Relay 01:37.27 1999-2000 5A Klein Oak Jamie Ellis 200 Yard Individual Medley 02:01.26 1999-2000 5A Austin Westlake 200 Yard Medley Relay 01:47.04 1999-2000 5A San Antonio Reagan 400 Yard Freestyle Relay 03:29.76 1999-2000 5A Houston Lamar Allison Mahlsted 50 Yard freestyle 00:23.69 1999-2000 5A Houston Cypress Falls Liz Hoffman 500 Yard Freestyle 04:51.90 1999-2000 5A Houston Memorial Jessica Wantz One Meter Diving 450.75 2000-2001 4A Dallas Highland Park Jennifer Blackman 100 Yard Backstroke 00:59.11 2000-2001 4A Austin Johnson Amber Schmidt 100 Yard Breaststroke 01:06.08 2000-2001 4A Dallas Highland Park Candace Blackman 100 Yard Butterfly 00:55.69 2000-2001 4A Grapevine Erica Tate 100 Yard Freestyle 00:51.71 2000-2001 4A Dallas Highland Park Candace Blackman 200 Yard Freestyle 01:48.90 2000-2001 4A Dallas Highland Park 200 Yard Freestyle Relay 01:37.82 2000-2001 4A Fort Worth Southwest Erin Wehrmann 200 Yard Individual Medley 02:09.07 2000-2001 4A Dallas Highland Park 200 Yard Medley Relay 01:51.52 2000-2001 4A Dallas Highland Park 400 Yard Freestyle Relay 03:32.65 2000-2001 4A Grapevine Erica Tate 50 Yard freestyle 00:23.87 2000-2001 4A San Antonio Alamo Heights Celeste Rogers 500 Yard Free"}, {"url": "https://www.washingtonpost.com/wp-srv/sports/olympics/longterm/swimming/swimstar.htm", "page_content": "Notable U.S. Swimmers:\n\nPast and Present\n\nShe earned the most Olympic medals by any U.S. woman in history with eight. In the 1972 Olympics, she earned silver medals in the 100m free and 200m free and a gold in a relay. In the 1976 Olympics, she earned silvers in the 200m free, 400m free and 800m free, as well as a relay gold and a relay silver. She has been a part of 11 world records, six individual and 17 American records. At the 1973 World Championships, she won gold in the 200m free and 400m free. In the 1975 World Championships, she won gold in both the 200m free and 400m free. She was named the 1974 Sportswoman of the Year.\n\nMIKE BARROWMAN\n\n(B: 12/04/68-)\n\nWon the gold medal in the 200m breaststroke with a world record at the 1992 Olympics in Barcelona. He broke the world record in that event six times following the 1988 Olympic Games where he finished sixth. He is the only three-time recipient of the USS Swimmer of the Year award (1989-90, '91)\n\nMELISSA BELOTE\n\n(B:10/10/56- )\n\nWon three gold medals in the 1972 Olympics in the 100m and 200m backstroke and as a member of the 4x100m medley relay. Apart from Shane Gould, the 15-year old Belote was the only woman swimmer to win more than one individual title in Munich. In finals at Olympic Trials she was a little known outsider, but beat the U.S. record holder, Susie Atwood, in the 100m back and then the 200m back in a world record time of a 2:21.77. At the 1972 Olympics she again set the world record in the 200m backstroke in a 2:19.19 and went on in 1973 to win the 200m backstroke at World Championships. In 1976 she made the Olympic team for a second time and placed fifth in the 200m backstroke in Montreal.\n\nMATT BIONDI\n\n(B: 10/8/65-)\n\nEarned the most medals of any Olympian in history with 11, tying Mark Spitz and shooter Carl Osburn. With teammate Tom Jager, Biondi became the first U.S. swimmer to win gold medals in three Olympiads and to win the same Olympic event three times. Each swam on the 1984, '88 and '92 winning 400m freestyle relay. He was one of only six U.S. Olympic male swimmers to compete on three Olympic teams. He broke seven world records and 16 American records. He earned 15 international individual titles, 17 U.S. national titles and eight NCAA national tides. He is the current American record holder in the 100 and 200 freestyle-both yards and meters.\n\nETHELDA BLEIBTREY\n\n(B: 2/27/02 - D: 5/6/78)\n\nWon three golds in the 1920 Olympics in the 100m and 300m freestyle and as a member of the 4x100m freestyle relay. She was the first American woman to win an Olympic swimming title and also the first woman, from any country, to win three gold medals. In each of her Olympic victories in Antwerp, she set a new world record. She turned professional in 1922 and had a successful career as athlete and coach. She was often in the news for incidents related to swimming and in 1919 only public opinion prevented her from being jailed for swimming \"nude\". She merely removed her stockings before going for a swim at Manhattan beach, but in 1919 this was considered \"nudity\".\n\nTRACY CAULKINS\n\n(B: 1/11/63- )\n\nConsidered by many to be the greatest swimmer of all time. She qualified as a member of the 1980 Olympic Team that boycotted the Games held in Moscow. Despite this letdown in her career she continued to swim competively and went on to win three gold medals in the 1984 Olympics in the 200m IM, 400m IM and a relay gold. She held world records in the 200m fly, the 400m IM, and broke her record in the 200m IM three times.\n\nShe held American records in the 100m breast from 1977 through 1981, the 200m breast from 1977 through 1981, the 200m butterfly in 1978, the 400m IM from 1977 through 1984, and she still owns the record for the 200m IM that she set in 1984 but has held since 1977. She also owned a few short course U.S. Open records too: the 100y free, 500y free, 200y back, 100y breast, 200y breast, 200y IM, and the 400y IM, the last two she still holds. She is the only swimmer ever, man or woman, to own American records in every stroke. In 1990 USA Today named her \"Swimmer of the Decade.\"\n\nBUSTER CRABBE\n\n(B: 2/7/10 - D: 4/23/83)\n\nAttended the University of Southern California in Los Angeles and while a first-year law student, he won a place on the 1932 Olympic Swim Team and won the gold in the 400m freestyle. He set 16 world and 35 national records during his swimming career. At the 1932 Olympics he was the only U.S. gold medalist in men's swimming and after the Games, he was signed by Paramount, who was looking for a rival to Johnny Weissmuller's Tarzan at MGM. The first of his 175 movies was \"King of the Jungle\" in which he played the role of Kasta, the Lion Man.\n\nANN CURTIS\n\n(B: 3/6/26- )\n\nWas the premier freestyler of her era. She won two gold medals at the 1948 Olympics in the 400m free and as a member of the 800m free relay. She won 34 National gold medals and won 26 individual golds in her career. Surprisingly out of all these career victories she only set two world records. She held them in the now discontinued events of the 880y freestyle and the 440y freestyle. Out of nine AAU National meets, she won the High Point Trophy seven times. Curtis was one of the best known sportswomen of her time and was the first female recipient of the Sullivan Award for top amateur athlete.\n\nCHARLIE DANIELS\n\n(B: 3/24/1885 - D: 8/9/73)\n\nWas the first great American swimmer. He won four Olympic gold medals and 33 US National championships. He was the first American to win an Olympic Games swimming event. He won the 220y&440y freestyle at the 1904 Olympic Games, the 100m free at the 1906 Olympic games and the 100m free in the 1908 Olympic Games. He was named the 1909 \"North American Athlete of the Year\" by the Helms athletic board. He held every world freestyle record from 25y to 1 mile. He is the man credited with evolving the American crawl from the two-beat Australian crawl and the man who gave freestyle speed swimming.\n\nDONNA deVARONA\n\n(B: 4/26/47- )\n\nWon 37 individual national championship medals, including 18 golds and three national high point awards. She held World Records in 8 long course events and American records in the in 10 short course evens. She was the youngest American on the 1960 Olympic team and won two gold medals in 1964. She was considered the \"Queen of Swimming\" in her day. In 1964 she was voted America's Outstanding Woman Athlete, Outstanding American Female Swimmer and received many more awards. She was the first woman on network TV in the sports broadcasting field in 1965.\n\nGERTRUDE EDERLE\n\n(B: 10/23/06- )\n\nIn the 1924 Olympics won a gold as a member of the 4x100m free relay and two bronzes in the 100m and 400m freestyles. She is best remembered as the youngest woman ever to set a world record in the now discontinued event of the 880y freestyle. She broke a total of 9 World Records during her career, 7 records of various distances during one 500m swim at Brighton Beach in 1922. She held 29 US National and World Records from 1921 - 1925. Turning professional in 1925 she became the first woman to swim the English Channel. Her time of 14 hours and 34 minutes broke the men's record for the crossing.\n\nShe went on to become the female counterpart to Johnny Weissmuller in a series of Tarzan movies.\n\nJEFF FARRELL\n\n(B: 2/18/37- )\n\nWon two golds in the 1960 Olympics as a member of the 4x200m freestyle relay and 4x100m freestyle relay. His career was riddled with injury and illness. He swam in the 1960 trials only six days after an appendectomy. A favorite in the 100m free, he finished fourth. This was only good enough to put him on a relay. His quick recovery led the teams to a winning anchor legs and World Records in both records. His career also included five AAU titles and a gold medal finish in the 1958 Pan American Games.\n\nBRUCE FURNISS\n\n(B: 5/27/57 - )\n\nBruce, younger brother of Steve, won two golds in the 1974 Olympics in the 200m freestyle and the 4x200m freestyle relay, both in world record times. In his career he won nine AAU titles and six NCAA championships. In 1975 he emerged as a top American swimmer after placing second in the 200m and 400m freestyle at world championships. Later that year, June 1975, he set his first world record after posting a new best time twice in one day in the 200m freestyle. In August of the same year he went on to deprive his brother of the 200m I.M. world record in an AAU competition.\n\nSTEVE FURNISS\n\n(B: 12/21/52 - )\n\nSteve, five years older than his brother Bruce, was the '76 Olympic bronze medalist in the 200m I.M. He specialized in the I.M., winning the 200m and 400m at both the 1971 and 1975 Pan American Games. In 1974 he tied David Wilkie's 200m I.M. World record before brother Bruce took over the record in 1975. Apart from being a medalist in the 1972 Olympics, he also swam the 400 I.M. in 1972 and 1976, placing in finals on both occasions.\n\nROWDY GAINES\n\n(B: 2/17/59- )\n\nWas a member of the 1980 Olympic Swim Team that boycotted the Olympics held in Moscow then came back to win three gold medals in the 1984 Olympic games in the 100m freestyle, the 400m free relay and the 400m medley relay. He held world and American records in the 100&200 meter freestyle and, the world record in the 100 meter freestyle from 1981 through 1985, the 200 meter freestyle record in 1980 and broke his own record in 1982, holding that record through 1983. He set the American record in the 100 meter free for the first of three times in 1980 and held it until 1985. He also set the American record in the 200 meter free for the first of two times in 1980 and held it through 1984.\n\nBRIAN GOODELL\n\n(B: 4/02/59- )\n\nDouble gold medalist in the 1976 Olympics in the 400m and the 1500m freestyle. He was legendary for his tireless capacity in training long-distance. At '76 trials he broke both his World Records before breaking them again at the Olympics. As a high school student at the time in Mission Viejo, he went on to attend UCLA. He made the 1980 team, but the boycott prevented the match up between Goodell and Russian great Vladimir Salnikov in the 1500m freestyle.\n\nGARY HALL\n\n(B: 8/7/51- )\n\nSet 10 World Records in his career; eight in the I.M. events, one in butterfly and one in the backstroke. He won 23 AAU, seven NCAA championships while competing for Indiana, and posted 23 American records. He competed in three Olympics and medalled in each. Although his career shows a forte in the I.M. events, he medalled in two fly events at the Olympics. He won a silver in 1968 in the 400m I.M., a silver in 1972 in the 200m butterfly and a bronze in 1976 in the 100m butterfly. At his third Olympic Games in 1976 he was given the elected honor to carry the U.S. flag in opening ceremonies.\n\nELEANOR HOLM\n\n(B: 12/06/13-)\n\nWon 29 National Championships. In 1927 she won nine National golds in the individual medley. She held six World Records in the backstroke and her 100y backstroke times held up for 16 years in the US. She was a member of the 1928 Olympic Team and won a gold medal in the backstroke at the 1932 Olympic Games. She was expected to do well in the 1936 Olympics but was disqualified for sipping champagne with officials on the boat to Germany while still in training. She became the swimming correspondent in Germany at the Olympics. Later she went on to marry noted band leader Billy Rose.\n\nDUKE KAHANAMOKU\n\n(B: 8/24/1890 - D: 1/22/68)\n\nWas the first of long line of truly great Hawaiian swimmers. In 1911 in an open water swim he bettered the 100y freestyle record by almost five seconds. He was a three time gold and two time silver medalist in the 1912, 1920 and 1924 Olympics. In 1912 he won a gold in the 100m freestyle and a silver on the 4x200m freestyle relay, in 1920 won the gold in the 100m freestyle and a gold as a member of the 4x200m freestyle relay and in 1924 won a silver in the 100m freestyle. Although viewed with skepticism by the AAU, Kahanamoku went on to set numerous world records. He won his second Olympic title in 1920 on his 30th birthday, but his career was far from over. He won a silver medal in 1924, was an alternate on the 1928 team and in 1932, after 10 years in Hollywood, was an alternate to the U.S. Olympic water polo team. Duke has the distinction of having the longest name in Olympic history; his full name is Duke Paoa Kahinu Makoe Hulikohoa Kahanamoku.\n\nADOLPH KEIFER\n\n(B: 6/27/18- )\n\nWas a gold medalist in the 1936, 100m backstroke event at the Olympics. He was the first man to break one minute in the 100y backstroke. In his career he set 17 World Records between 1935 and 1944, none of which were broken until four year after he retired from swimming in 1946. He went on after his career in swimming to serve in World War II as a Lieutenant in the U.S. Navy. He conducted a survey for them of the number of shipwrecks and documented the number of GI deaths from drowning. As a result he was put in charge of swimming instruction for the entire U.S. Navy. He later formed his own company involved in the manufacturing of swimming pool accessories and other swim-related items.\n\nLANCE LARSON\n\n(B: 7/03/40- )\n\nWas a gold medalist in the 1960 Olympics in the 4x100m freestyle relay and a silver medalist in the 100m freestyle. His silver medal in the 100m freestyle was one of the most controversial Olympic swim races ever. He was given a second-place finish against Australia's John Devitt. They touched almost simultaneously with all watches in his favor, but the President of the International Swimming Federation gave the win to Devitt. Larson, the first man to break one minute for the 100m butterfly, won AAU titles in the freestyle, fly and I.M. events, setting five world and twelve U.S. records.\n\nSTEVE LUNDQUIST\n\n(B: 2/20/61- )\n\nWas a member of the 1980 Olympic Swim Team that boycotted the Olympics. He won two gold medals in the 1984 Olympics in the 100 meter breaststroke and the 400 meter medley relay. He was the first swimmer to break 2 minutes in the 200 yard breaststroke. He won every 100 yard breaststroke event he entered from 1980-1983. At 17 he broke his first world record and in his career he broke world and American records on 15 occasions. He first broke the 100 meter breaststroke world record in 1982 and held it until 1989 with the exception of one month in 1984 when John Moffet held it. He also held the world record in the 200m IM in 1978. He set American records in the 100m and 200m breast and the 200m IM.\n\nMARY T. MEAGHER\n\n(B: 10/27/64- )\n\nSet her first record in the 200m butterfly in 1979 and became known as \"Madame Butterfly\" shortly after. She became the third woman in swimming history to make three Olympic teams. She was on the 1980 Olympic Team that boycotted the Olympics. She won three gold medals in the 1984 Olympic Games in the 100m and 200m butterfly and the 400m medley relay. In the 1988 Olympic Games in Seoul she won the bronze in the 200m fly. She won six NCAA individual awards. She still owns the world and American records she set in 1981 in the 100m and 200m butterfly, which are swimming's most enduring records. She also held seven World Records and eight American records. She was a United States Olympic Committee Athlete Representative and sat on the US Swimming Board of Directors. In 1993, she won the U.S. Swimming/ Phillips 66 20th Anniversary Award for the most outstanding performance at a U.S. Nationals.\n\nDEBBIE MEYER\n\n(B: 8/14/52- )\n\nWas the first woman to win three individual gold medals in a single Olympics. Despite her handicapp of having a stomach infection at the 1968 Games held in Mexico City she went on to win the 200m freestyle, 400m freestyle and the 800m freestyle. In her career she held 24 American records and 15 world records. She was named the 1967, '68, and '69 \"World Swimmer of the Year\" and received the Sullivan Award for top amateur athlete in 1968. She was the first woman to swim the 1500m free under 18 minutes, the 400m free under 4:30, the 500y under 5 minutes and the 1650y under 17 minutes.\n\nJIM MONTGOMERY\n\n(B: 1/24/55- )\n\nWon three golds in the 100m freestyle, 4x200m freestyle relay and the 4x100m freestyle relay and a bronze in the 200m freestyle at the 1976 Olympics held in Montreal, Canada. In the 1973 World Championships he gained stardom after winning two individual golds and three more as a member of the winning relay team. He set two World Records for the 100m freestyle in 1975 and bettered his world record tame in both prelims and finals at the Montreal Olympics. Not only were his records broken but barriers in the event also when he became the first man to swim 100m freestyle in under 50 seconds.\n\nPABLO MORALES\n\n(B: 12/5/64-)\n\nHe was second in the 100m butterfly at the 1984 Olympics, where he was favored to win. In 1986, he set the world record in the 100m fly, which stands to this day. Then in 1988, Morales unexpectedly did not make the Olympic team, finishing third in two events. He retired from swimming to attend law school at Cornell University. In the summer of 1991, he returned to the pool and went on to win Olympic gold medals in the 100m butterfly and the medley relay. He was named the 1992 U.S. Olympic Committee's SportsMan of the Year.\n\nJOHN NABER\n\n(B: 1/20/56- )\n\nWon four golds and a silver medal in the 1976 Olympic Games. His Olympic golds in the 100m and 200m backstroke were in world record times. He also won a silver in 200m free and was on two gold winning relays, both in world record times. In 1976 he was named \"Male Swimmer of the Year\" and also Southern California Athlete of the Year. At the 1977 Pan-Am Games he won golds in 100&200m back and the 500m free. He received the 1977 Sullivan Award and the Trophy of the International Committee for Fair Play, the first time an American swimmer was honored. He was the first man to swim the 200m back under 2 minutes, the 200y back under 1 :50, the logy back under 50 seconds and the first to go under 56 seconds in the 100m back. He was a member of the 1984 Los Angeles Olympic Games Organizing Committee. He now works as a commentator for ABC Sports.\n\nDICK ROTH\n\n(B: 9/26/47- )\n\nWon a gold in the 1964 Olympics in the 400m I.M. The night before the finals of this race Roth was stricken by an attack of appendicitis, but refused an operation. He went on to swim finals and won the gold. At the start of the race in the 100m butterfly leg he fell far behind his competators. Roth never gained the lead until the final 100m freestyle leg. In his career he won six outdoor AAU titles before retiring at the age of 19.\n\nKEENA ROTHHAMMER\n\n(B: 2/26/57- )\n\nWon the gold in the 1972 Olympics in the 800m freestyle and the bronze in the 200m freestyle. She Was best known for her unpredictable performances and versatile ability. As the third ranked contender in the 800m freestyle event at the 1972 Olympics she ended up winning the event and setting a new World record. On the other hand as the top ranked qualifier for the 400m free for the U.S. she ended up only finishing sixth. She went on to the 1973 World Championships as the reigning Olympic gold medalist in the 800m freestyle, but failed to win a medal. In the 200m freestyle as the U.S. second place qualifier she ended up winning. Finally, in the 400m freestyle as the World record holder she lost to team mate Heather Greenwood. Since the end of her career at Southern California University she has done commentary for swimming competitions on CBS.\n\nMARK SPITZ\n\n(B: 2/10/50- )\n\nWon nine golds, one silver, and one bronze in the 1968 and 1972 Olympics. In 1972 he became the first man to win 7 golds in one Olympics all in World Record times. He won five golds in the 1967 Pan-Am Games. He set 26 World Records, 24 National AAU Championships and 25 American Records. He held eight NCAA titles and was a 4-time NCAA Champion in 100y Butterfly. He won the Sullivan Award in 1971 and was named the 1972 \"Swimmer of the Year\". In 1991 he staged an unsuccessful comeback.\n\nDON SCHOLLANDER\n\n(B: 4/30/46- )\n\nWas a five-time Olympic gold medalist. In 1964 he won the 100m freestyle and 400m freestyle individual events and was on the winning 4x100m freestyle and 4x200m freestyle relay teams. In the 1968 Olympics he was on the winning 4x200m freestyle relay and won a silver in the 200m freestyle. He was the first four gold medal winner at one Olympics, and would have won a fifth had the 200m freestyle been an Olympic event in 1964. In this event he set nine World Records between 1963 and 1968, and was the first man to break two minutes for that distance. In addition his career included eight World Records for the 400m freestyle and swam on eight world record breaking relay teams. He won 16 AAU titles and won two golds in the 1967 Pan American Games.\n\nJILL STERKEL\n\n(B: 5/27/61- )\n\nBest known as the first woman in history to be on four Olympic swimming teams (1976 '80, '84, and '88). She retired after the 1984 Olympics but returned to competition in 1987. She qualified for the team after Angel Meyers tested positive for steroid use at trials. She went on in the 1988 Olympics to tie for the bronze medal in the 50m freestyle. Her time made her the sixth-fastest female ever in the 50m freestyle and the second fastest American. Her career highlights also feature 15 USS National titles, 16 Collegiate titles, five gold medals at the 1981 World University Games, Five AIAW titles in 1980 and 1981 and four P66/USS SC Nats titles. Her college achievements earned her the Broderick Cup Award for top female collegiate athlete. Sterkle is currents the head women's swimming coach at the University of Texas.\n\nKAREN MOE (THORNTON)\n\n(B: 1/22/52- )\n\nWon the gold medal in the 1972 Olympics in the 200m butterfly in a world record time of 2:18.15 in Munich. She also swam the 100m backstroke in the 1972 games and finished fourth. She made another Olympic appearance in the 1976 finishing fourth in the 200m butterfly in Montreal in a new American record. Thornton was the head coach of women's swim team at the University of California at Berkeley and has since moved up to an administrative position with the University.\n\nMIKE TROY\n\n(B: 10/03/40- )\n\nWon two golds in the 1960 Olympics in the 200m butterfly and the 4x200m freestyle relay. As a member of Indianapolis Aquatic Club at the 1959 Pan American Games he signed to attend Indiana University. At the Pan American Games he was a silver medalist in the 200m butterfly and went on to win the gold at the 1960 Olympics. At both meets he was also on the winning 4x200m freestyle relay team. He was a record breaker his entire career in freestyle and butterfly events, winning two AAU outdoor titles. He served as a Navy Seal during the Vietnam War and now coaches the Rio Saldo swim team.\n\nCHRIS VON SALTZA\n\n(B: 1/03/44- )\n\nWas a five-time gold medal winner at the 1959 Pan-American games. She went on to further her career achievements by winning three golds and a silver in the 1960 Olympics. Her 400m freestyle win at the 1960 games was not unexpected because at the U.S. Trials she had set a new world record of 4:44.5 to become the first woman to break the five-minute barrier. Besides her claim to fame as a five time Olympic medalist she was more properly known as the Baroness Von Saltza. Her grandfather, Count Philip, came to America at the turn of the century. Until this day she is sty recognized by her title name in the \"Who's Who of Swedish Nobility\".\n\nJOHNNY WEISSMULLER\n\n(B: 6/02/04 - D: 1/84)\n\nWon five gold medals at two Olympics. At the 1924 games he won the 100m freestyle, 400m freestyle and was on the winning 4x200m freestyle relay. At 1928 Games he won the 100m freestyle and was on the winning 4x200m freestyle relay. He set 51 World Records and won 52 National Championship gold medals in his career. He is the winner of 36 individual national titles. He never lost a race in his 10 years of amateur swimming at distances from 50 yards to 1/2 mile. His record in the 100y free of 51 seconds stood for 17 years. He also played on two US Olympic Water Polo Teams, of which the 1924 team won a bronze. After his career he became best known for his role as Tarzan on the silver screen."}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/pedersen-susan-1953", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}], "Susan Pedersen was a two-time NCAA champion.": [{"url": "https://en-academic.com/dic.nsf/enwiki/6455870", "page_content": "Susan Pedersen — Susan „Sue“ Jane Pedersen (* 16. Oktober 1953 in Sacramento, Kalifornien) ist eine ehemalige US amerikanische Schwimmerin, die 1968 zwei Olympische Goldmedaillen mit der Staffel gewann. Sue Pedersen erlernte mit drei Jahren das Schwimmen und… … Deutsch Wikipedia\n\nSusan Pedersen (historian) — Susan Pedersen is a historian currently working at Columbia University. Pedersen focuses on 19th and 20th century British history, women s history, settler colonialism, and the history of international institutions. Born in Canada and raised in… … Wikipedia\n\nSusan Pedersen (swimmer) — Susan Pedersen (born October 16, 1953) is an American swimmer and olympic champion. She competed at the 1968 Olympic Games in Mexico City, where she received a gold medal in 4 times; 100 m medley relay , and also in 4 times; 100 m freestyle relay … Wikipedia\n\nPedersen — ist ein Familienname. Herkunft und Bedeutung Pedersen ist ein patronymisch gebildeter Name mit der Bedeutung Sohn des Peter. Der Name tritt vor allem im skandinavischen Sprachraum auf. Bekannte Namensträger Inhaltsverzeichnis A B C D E F G H I J … Deutsch Wikipedia\n\nSusan Elizabeth Gay — (born 12 January 1845 in Oswestry, died 17 January 1918 in Crill, Budock) [In the 1891 Census, she is shown as, born at Oswestry Shropshire, age 46, living at 134, Woodlane Terrace with her mother, Charlotte Gay, sister (also called Charlotte)… … Wikipedia\n\nSue Pedersen — Susan „Sue“ Jane Pedersen (* 16. Oktober 1953 in Sacramento, Kalifornien) ist eine ehemalige US amerikanische Schwimmerin, die 1968 zwei Olympische Goldmedaillen mit der Staffel gewann. Sue Pedersen erlernte mit drei Jahren das Schwimmen und… … Deutsch Wikipedia\n\nChristina Pedersen — is a Danish team handball goalkeeper, playing for the club Viborg HK and for the Danish women s national handball team. At the 2010 European Women s Handball Championship she reached the bronze final and placed fourth with the Danish team.[1]… … Wikipedia\n\nListe der Olympiasieger im Schwimmen/Medaillengewinnerinnen — Olympiasieger Schwimmen Übersicht Alle Medaillengewinner Alle Medaillengewinnerinnen … Deutsch Wikipedia\n\nOlympische Sommerspiele 1968/Schwimmen — Bei den XIX. Olympischen Sommerspielen 1968 in Mexiko Stadt wurden im Schwimmen insgesamt 29 Wettbewerbe ausgetragen, davon 15 für Männer und 14 für Frauen. Inhaltsverzeichnis … Deutsch Wikipedia"}, {"url": "https://alchetron.com/Susan-Pedersen-(swimmer)", "page_content": "Susan \"Sue\" Jane Pedersen (born October 16, 1953), also known by her married name Susan Pankey, is an American former competition swimmer, four-time Olympic medalist, and former world record-holder in two events.\n\nAs a 15-year-old, Pedersen represented the United States at the 1968 Summer Olympics in Mexico City, where she received a total of four medals. She won a gold medal as a member of the winning U.S. team in the women's 4×100-meter medley relay, and another swimming for the first-place U.S. team in the women's 4×100-meter freestyle relay, while setting Olympic records in both. Individually, she received silver medals for her second-place finishes in the women's 100-meter freestyle (1:00.3), and women's 200-meter individual medley.\n\nShe held the world record in the 200-meter freestyle (2:09.5) from July 6, 1968 to August 2, 1968. She was also a member of world-record U.S. teams in the 4×100-meter medley relay and the 4×200-meter freestyle relay.\n\nPedersen was inducted into the International Swimming Hall of Fame as an \"Honor Swimmer\" in 1995."}, {"url": "https://www.stadiumtalk.com/s/1980-us-olympic-hockey-team-then-now-b0603bc7cb2a4f48", "page_content": "Where Are They Now: 1980 U.S. Olympic Hockey Team You won't believe what happened to the \"Miracle On Ice\" players after they won the gold.\n\nWhere Are They Now: 1980 U.S. Olympic Hockey Team Is there a greater team accomplishment in sports history than what the U.S. Olympic hockey team did at the 1980 Winter Olympics in Lake Placid, New York? When the Americans won the gold medal, they took down the Soviet Union, the most powerful team in the world, in the semifinals. The game become known as the \"Miracle on Ice\" and is the leader in the clubhouse as the greatest sports upset of all time. With U.S. head coach Herb Brooks leading a team of college all-stars against the greatest team in the world — the Russians were de facto professionals — the story of the American team has been made into a movie, twice, and is part of sports culture around the world. But what happened to the team after the Olympics? What paths would their destinies take? Here's a look at the 1980 U.S. Olympic hockey team after they won the gold, and where they are now.\n\nKen Morrow, Defenseman Born: Oct. 17, 1956 (Davison, Michigan) High school: Davison High School (Davison, Michigan) College: Bowling Green State University\n\nCareer Highlights: Ken Morrow NHL career: New York Islanders (1979-89) Career highlights: CCHA Player of the Year (1979), four-time All-CCHA (1976-79), four-time Stanley Cup champion (1980-83)\n\nWhat Happened Next: Ken Morrow You might not know his name like some of the other players on the 1980 Olympic team, but Ken Morrow may have been the best player on the team pound for pound. \"Wolfman\" was drafted by the New York Islanders after his freshman season at Bowling Green, and after the 6-foot-4, 209-pound defenseman won the gold medal, he went straight to the NHL and was a key player on four consecutive Stanley Cup championship teams. Morrow has been the director of pro scouting for the Islanders since 1995.\n\nMike Ramsey, Defenseman Born: Dec. 3, 1960 (Minneapolis, Minnesota) High school: Roosevelt High School (Minneapolis, Minnesota) College: University of Minnesota NHL career: Buffalo Sabres (1979-93), Pittsburgh Penguins (1992-94), Detroit Red Wings (1994-97)\n\nCareer Highlights: Mike Ramsey NHL career: Buffalo Sabres (1979-93), Pittsburgh Penguins (1992-94), Detroit Red Wings (1994-97) Career highlights: All-NCAA tournament team (1979), Stanley Cup champion (1997), four-time NHL All-Star (1982, 1983, 1985, 1986)\n\nWhat Happened Next: Mike Ramsey Mike Ramsey was one of nine players on the 1980 team who played for Herb Brooks at the University of Minnesota and was the youngest player on the Olympic hockey team at 19 years old. Ramsey had one of the best NHL careers of any player from the Olympic team. He played 18 seasons in the NHL, with the first 14 on the Buffalo Sabres and made four NHL All-Star teams. Ramsey only played in the Stanley Cup Final once and retired after two games with the Detroit Red Wings at the beginning of the 1996-97 season. And the Red Wings went on to win the Stanley Cup. Ramsey moved back to Minnesota after his playing career was over to run a sporting goods store (Gold Medal Sports) and was an assistant coach with the Minnesota Wild from 2000 to 2010.\n\nMark Johnson, Center Born: Sept. 22, 1957 (Minneapolis, Minnesota) High school: James Madison Memorial High School (Madison, Wisconsin) College: University of Wisconsin\n\nCareer Highlights: Mark Johnson NHL career: Pittsburgh Penguins (1979-82), Minnesota North Stars (1982), Hartford Whalers (1982-85), St. Louis Blues (1985), New Jersey Devils (1985-90) Career highlights: NHL All-Star (1984), WCHA Most Valuable Player (1979), WCHA Freshman of the Year (1977), two-time AHCA West All-American (1978, 1979)\n\nWhat Happened Next: Mark Johnson No one was better against the Soviet Union than University of Wisconsin star Mark Johnson, who scored two goals in a 4-3 win and had an assist on the game-winning goal in the gold medal win over Finland. Johnson then played in the NHL for 12 seasons and was an NHL All-Star in 1984 with the Hartford Whalers. Johnson has been the women's hockey coach at the University of Wisconsin since 2002, where he's won six national championships and been named National Coach of the Year four times. He also was the head coach for the U.S. women's Olympic team in 2010, leading them to a silver medal.\n\nRob McClanahan, Left Wing Born: Jan. 9, 1958 (Saint Paul, Minnesota) High school: Mounds View High School (Arden Hills, Minnesota) College: University of Minnesota\n\nCareer Highlights: Rob McClanahan NHL career: Buffalo Sabres (1979-81), Hartford Whalers (1981-82), New York Rangers (1982-83) Career highlights: All-NCAA tournament team (1977, 1978), two-time All-ECAC (1977, 1978), NCAA champion (1978)\n\nWhat Happened Next: Rob McClanahan Rob McClanahan came to the Olympic team after winning a national championship with the University of Minnesota and U.S. head coach Herb Brooks in 1979. McClanahan scored what proved to be the game-winning goal for the U.S. in the gold medal game against Finland and scored five goals in seven games at the 1980 Olympics. His argument with Brooks during intermission of an Olympic game against Sweden, when Brooks goaded an injured McClanahan into coming back into the game, is one of the more famous moments in the team's history. McClanahan played five seasons in the NHL before becoming an investment banker.\n\nDave Silk, Right Wing Born: Jan. 1, 1958 (Scituate, Massachusetts) High school: Thayer Academy (Braintree, Massachusetts) College: Boston University\n\nCareer Highlights: Dave Silk NHL career: New York Rangers (1979-83), Boston Bruins (1983-85), Detroit Red Wings (1985), Winnipeg Jets (1985-86) Career highlights: NCAA champion (1978), New England Rookie of the Year (1977), two-time All-New England (1977, 1978)\n\nWhat Happened Next: Dave Silk Dave Silk was one of four players from Boston University on the 1980 Olympic team, alongside college teammates Mike Eruzione, Jim Craig and Jack O'Callahan. Silk was a star in college, helping the Terriers win the 1978 national championship. Silk played seven seasons in the NHL, then played five more seasons of professional hockey in Germany. Following his playing career, he used his MBA from Boston University and went into finance.\n\nBill Baker, Defenseman Born: Nov. 29, 1956 (Grand Rapids, Minnesota) High school: Grand Rapids High School (Grand Rapids, Minnesota) College: University of Minnesota\n\nCareer Highlights: Bill Baker NHL career: Montreal Canadiens (1980), Colorado Rockies (1980-82), St. Louis Blues (1982), New York Rangers (1982-83) Career highlights: WHCA All-American (1979), All-WHCA (1979), CHL Adams Cup champion (1984)\n\nWhat Happened Next: Bill Baker Bill Baker was the captain for Herb Brooks at the University of Minnesota when the Gophers won the national championship in 1979 before making the 1980 Olympic team. Baker scored the final goal in a 2-2 tie with Sweden, which allowed the U.S. to advance to the medal round. His jersey is on display at the Smithsonian Institute in Washington, D.C. Baker played three seasons in the NHL before he returned to school, becoming a doctor of oral and maxillofacial medicine who specializes in jaw surgeries and soft-palate tissue repairs.\n\nNeal Broten, Center Born: Nov. 29, 1959 (Roseau, Minnesota) High school: Roseau High School (Roseau, Minnesota) College: University of Minnesota\n\nCareer Highlights: Neal Broten NHL career: Minnesota North Stars/Dallas Stars (1980-95, 1997), New Jersey Devils (1995-97), Los Angeles Kings (1997) Career highlights: NCAA champion (1979), WHCA Rookie of the Year (1979), Hobey Baker Award (1981), Stanley Cup champion (1995)\n\nWhat Happened Next: Neal Broten Neal Broten was an electric goal scorer who won a national championship at the University of Minnesota in 1979. Broten and Canadian goaltender Ed Belfour are the only two players in hockey history to win an NCAA championship, Olympic gold medal and Stanley Cup championship. Broten played 17 seasons in the NHL, where he scored over 50 points nine times and played over 1,000 games, including a 105-point season in 1985-86, when he became the first American to score over 100 points in a single season. He also was a two-time NHL All-Star and won the Stanley Cup with the New Jersey Devils in 1995, when he scored the title-clinching goal.\n\nDave Christian, Right Wing Born: May 12, 1959 (Warroad, Minnesota) High school: Warroad High School (Warroad, Minnesota) College: University of North Dakota\n\nCareer Highlights: Dave Christian NHL career: Winnipeg Jets (1979-83), Washington Capitals (1983-90), Boston Bruins (1990-91), St. Louis Blues (1991-92), Chicago Blackhawks (1992-94) Career highlights: NCAA runner-up (1979), NHL All-Star (1991)\n\nWhat Happened Next: Dave Christian Dave Christian was the only member of the 1980 Olympic team from the University of North Dakota. They lost to U.S. head coach Herb Brooks and the University of Minnesota (and many of his Olympic teammates) in the 1979 NCAA championship game. Christian was playing in the NHL with the Winnipeg Jets one week after winning a gold medal, and still holds the NHL record by scoring just 7 seconds into his first NHL game. Christian went on to play 15 seasons and 1,009 career games in the NHL and played in the Stanley Cup Final once, when the Boston Bruins lost to the Edmonton Oilers in 1990. Christian, who played in the 1991 NHL All-Star Game, wasn't the first one in his family to win a gold medal. His father, Bill Christian, and his uncle, Roger Christian, were both on the 1960 U.S. Olympic hockey team.\n\nSteve Christoff, Right Wing Born: Jan. 23, 1958 (Springfield, Illinois) High school: Richfield High School (Richfield, Minnesota) College: University of Minnesota\n\nCareer Highlights: Steve Christoff NHL career: Minnesota North Stars (1979-82), Calgary Flames (1982-83), Los Angeles Kings (1983-84) Career highlights: NCAA champion (1979), two-time All-ECAC (1978, 1979), All-NCAA tournament team (1979)\n\nWhat Happened Next: Steve Christoff Steve Christoff was one of the most highly recruited high school hockey players of all time coming out of Richfield (Minnesota) High School before starring at the University of Minnesota for Olympic head coach Herb Brooks. After winning the gold medal, Christoff played five seasons and led the Minnesota North Stars to the Stanley Cup Final, where they lost to Olympic hockey teammate Ken Morrow and the New York Islanders. After retiring from hockey, Christoff went to work for Endeavor Air as an airline pilot.\n\nJohn Harrington, Right Wing Born: May 24, 1957 (Virginia, Minnesota) High school: Virginia High School (Virginia, Minnesota) College: University of Minnesota-Duluth\n\nCareer Highlights: John Harrington NHL career: None Career highlights: NCAA Frozen Four (1984, as head coach)\n\nWhat Happened Next: John Harrington John Harrington was an underdog all the way. He started as a walk-on at the University of Minnesota-Duluth and eventually made the 1980 Olympic roster. Harrington was credited with an assist on Mike Eruzione's game-winning goal in the semifinal win over the Soviet Union. Undrafted by the NHL, Harrington played for the U.S. again in the 1984 Olympics. He was a college assistant for several years before he became head coach at Saint John's University in Collegeville, Minnesota, where he coached for 15 years.\n\nSteve Janaszak, Goaltender Born: Jan. 7, 1957 (Saint Paul, Minnesota) High school: Hill-Murray School (Saint Paul, Minnesota) College: University of Minnesota\n\nCareer Highlights: Steve Janaszak NHL career: Minnesota North Stars (1979-80), Colorado Rockies (1981-82) Career highlights: NCAA champion (1979), NCAA Tournament Most Valuable Player (1979), IHL Rookie of the Year (1981)\n\nWhat Happened Next: Steve Janaszak Steve Janaszak was the MVP of the 1979 NCAA tournament after he led the University of Minnesota to the national championship and was the backup to Jim Craig on the 1980 U.S. Olympic team, where he was the only player on the roster who did not play in the Olympics. Janaszak played four seasons of professional hockey after winning the gold medal, including two in the NHL, then became an investment banker in New York after his career was over.\n\nJack O'Callahan, Defenseman Born: July 24, 1957 (Charlestown, Massachusetts) High school: Boston Latin School (Boston, Massachusetts) College: Boston University\n\nCareer Highlights: Jack O'Callahan NHL career: Chicago Blackhawks (1982-87), New Jersey Devils (1987-89) Career highlights: NCAA champion (1978), NCAA Tournament Most Valuable Player (1978),\n\nWhat Happened Next: Jack O'Callahan Jack O'Callahan starred at Boston University and injured his knee in the 1980 Olympic opener agains Sweden, but returned to play in the \"Miracle on Ice\" game against the Soviet Union. O'Callahan played seven seasons in the NHL, mostly for the Chicago Blackhawks, then went into financial services in Chicago following his retirement from hockey.\n\nMark Pavelich, Center Born: Feb. 28, 1958 (Eveleth, Minnesota) Died: March 4, 2021, 63 years old (Sauk Centre, Minnesota) High school: Eveleth High School (Eveleth, Minnesota) College: University of Minnesota-Duluth\n\nCareer Highlights: Mark Pavelich NHL career: New York Rangers (1981-86), Minnesota North Stars (1986-87), San Jose Sharks (1991-92) Career highlights: All-WCHA (1979), All-WHCA West All-American (1979)\n\nWhat Happened Next: Mark Pavelich Mark Pavelich was the son of Croatian immigrants and starred at Eveleth High School before staying close to home to play college hockey for the University of Minnesota-Duluth. Pavelich, who had the assist to Mike Eruzione on the game-winning goal against the Soviet Union, lived a life marked by tragedy. When he was 18 years old, he accidentally killed his 15-year-old friend in a hunting accident. In 1994 his second wife, Kara Burmachuk, died after accidentally falling from the a balcony on the second floor of their home. Pavelich auctioned off his gold medal for approximately $263,000 in 2014. He was arrested in 2019 for assaulting a neighbor and possession of firearms. Ruled incompetent to stand trial, he was committed to a mental health facility, where he committed suicide on March 3, 2021. He was 63 years old.\n\nBuzz Schneider, Left Wing Born: Sept. 14, 1954 (Grand Rapids, Minnesota) High school: Babbitt High School (Babbitt, Minnesota) College: University of Minnesota\n\nCareer Highlights: Buzz Schneider NHL career: None Career highlights: NCAA champion (1974)\n\nWhat Happened Next: Buzz Schneider Buzz Schneider was the oldest player on the 1980 Olympic hockey team. It was actually his second Olympics after playing for the U.S. in 1976. At the 1980 Olympics, Schneider was part of the famous \"Coneheads\" line with Mark Pavelich and John Harrington. In seven games on the way to winning the gold medal, Schneider scored five goals and had three assists. After Schneider retired from hockey in 1983, he was a sales executive for a semi-trailer company in Minnesota before going into real estate. In the 2004 Disney film \"Miracle,\" he was portrayed by his son, Billy.\n\nEric Strobel, Right Wing Born: June 5, 1958 (Rochester, Minnesota) High school: Mayo High School (Rochester, Minnesota) College: University of Minnesota\n\nCareer Highlights: Eric Strobel NHL career: None Career highlights: NCAA champion (1979)\n\nWhat Happened Next: Eric Strobel Eric Strobel was one of the many players from the University of Minnesota's 1979 national championship team to play on the 1980 Olympic hockey squad. He had a short professional career end when he broke his ankle playing on the Buffalo Sabres' top farm club. Strobel's father, Art Strobel, played for the New York Rangers.\n\nBob Suter, Defenseman Born: May 16, 1957 (Madison, Wisconsin) Died: Sept. 9, 2014, 57 years old (Middleton, Wisconsin) High school: Madison East High School (Madison, Wisconsin) College: University of Wisconsin\n\nCareer Highlights: Bob Suter NHL career: None Career highlights: NCAA champion (1977), All-WHCA (1979)\n\nWhat Happened Next: Bob Suter At only 5-foot-9 and 180 pounds, Bob Suter didn't look the part, but he was the closest thing the 1980 Olympic team had to an enforcer. He earned the reputation while winning a national championship at the University of Wisconsin and setting the school record for penalty minutes in 1979. Suter was the first player off the 1980 Olympic team to die when he had a fatal heart attack at the Capitol Ice Arena in Middleton, Wisconsin, in 2014. The arena was eventually named after him. Suter's brother, Gary Suter, played in the NHL from 1985 to 2002 and Bob's son, Ryan Suter, has played in the NHL since 2004.\n\nPhil Verchota, Left Wing Born: Dec. 28, 1956 (Duluth, Minnesota) High school: Duluth East High School (Duluth, Minnesota) College: University of Minnesota\n\nCareer Highlights: Phil Verchota NHL career: None Career highlights: Two-time NCAA champion (1976, 1979)\n\nWhat Happened Next: Phil Verchota Phil Verchota was a football and hockey star at Duluth East High School. He was good enough that he had scholarship offers from the University of Minnesota in both sports. The aspiring defensive tackle decided to ditch football and won a pair of national championships playing for Herb Brooks with the Gophers before making the 1980 Olympic team and winning the gold medal. He returned as the U.S. captain at the 1984 Olympics. Verchota retired from hockey after the 1984 Olympics and went into banking, where he eventually became president of First American Bank in Willmar, Minnesota.\n\nMark Wells, Center Born: Sept. 18, 1957 (St. Clair Shores, Michigan) High school: Lake Shores High School (St. Clair Shores, Michigan) College: Bowling Green State University\n\nCareer Highlights: Mark Wells NHL career: None Career highlights: Two-time All-CCHA (1977, 1979)\n\nWhat Happened Next: Mark Wells Mark Wells was one of two players from Bowling Green to make the 1980 Olympic team, alongside star defenseman Ken Morrow. He played two seasons of minor league hockey after winning the gold medal but never played in the NHL. Following his hockey career, Wells went to work in the restaurant industry. He suffered a catastrophic injury unloading crates that fractured his spine. After surgery, he wasn't able to work again. Wells was forced to sell his gold medal to a collector in 2010 for $40,000 to pay for living expenses. It was immediately turned around and sold for $310,000 at an auction.\n\nJim Craig, Goaltender Born: May 31, 1957 (Easton, Massachusetts) High school: Oliver Ames High School (Easton, Massachusetts) College: Boston University\n\nCareer Highlights: Jim Craig NHL career: Atlanta Flames (1979-80), Boston Bruins (1980-81), Minnesota North Stars (1983-84) Career highlights: NCAA champion (1978), NCAA All-American (1979)\n\nWhat Happened Next: Jim Craig After Mike Eruzione, goaltender Jim Craig is perhaps the most well-known player from the 1980 Olympic team. His heroic performance in the semifinals and finals went down as one of the best performances by a goalie in Olympic history. Craig played three seasons in the NHL and was charged with \"driving to endanger\" after a crash on a rural Massachusetts highway left one woman dead and another critically injured in 1982. He was eventually found not guilty after waiving his right to a jury trial and going directly before a judge.\n\nMike Eruzione, Left Wing Born: Oct. 25, 1954 (Winthrop, Massachusetts) High school: Winthrop High School (Winthrop, Massachusetts) College: Boston University\n\nCareer Highlights: Mike Eruzione NHL career: None Career highlights: IHL Rookie of the Year (1978), IHL Turner Cup champion (1978)\n\nWhat Happened Next: Mike Eruzione The most famous player on the 1980 U.S. Olympic hockey team, team captain Mike Eruzione was once described by Ringer podcast host Bill Simmons as \"America's houseguest.\" It was an apt description of the Massachusetts native and former Boston University star who scored the game-winning goal against the Soviet Union. Eruzione played one season in the IHL and one season in the AHL before the Olympics, but went undrafted by the NHL and never played professionally after the gold medal. What has Eruzione done since 1980? Mostly he's made a career out of being Mike Eruzione.\n\nCraig Patrick, Assistant General Manager/Assistant Coach Born: May 20, 1946 (Detroit, Michigan) Career highlights: Olympic gold medal (1980), Olympic silver medal (2002)\n\nWhat Happened Next: Craig Patrick Craig Patrick played eight seasons in the NHL and was still competing for the U.S. into his mid-30s before retiring in 1979, when he moved into administration and coaching. He was the assistant general manager for U.S. hockey and the assistant coach for the 1980 Olympic team. Patrick was the youngest general manager in New York Rangers history before becoming the general manager of the Pittsburgh Penguins in 1989, winning two Stanley Cup championships with the team. In a crazy twist, Patrick is one of seven family members who have won Stanley Cups as players, coaches or administrators.\n\nWalter Bush, General Manager Born: Sept. 25, 1929 (Minneapolis, Minnesota) Died: Sept. 22, 2016, 86 years old (Minneapolis, Minnesota) Career highlights: U.S. Hockey Hall of Fame (1980), Hockey Hall of Fame (2000), IIHF Hall of Fame (2009)\n\nWhat Happened Next: Walter Bush Walter Bush was a builder. He helped build the Central Hockey League, was key in bringing the NHL to Minnesota with the Minnesota North Stars, and was the president of U.S. Hockey for two decades, bringing Herb Brooks in to coach the 1980 U.S. Olympic team. He also was instrumental in adding women's hockey to the U.S. roster of Olympic sports. Bush died in 2016, at 86 years old.\n\nAl Michaels, Broadcaster Born: Nov. 12, 1944 (Brooklyn, New York) Career highlights: Five-time Sports Emmy Award winner - Outstanding Sports Personality, three-time NSMA National Sportscaster of the Year, Walter Cronkite Award for Excellence in Journalism, Hollywood Walk of Fame, Television Academy Hall of Fame, Pro Football Hall of Fame Pete Rozelle Radio & Television Award (2013), Baseball Hall of Fame Ford C. Frick Award (2021)\n\nWhat Happened Next: Al Michaels Al Michaels is one of the most famous sports broadcasters of all time and called his seventh Super Bowl in 2022. None of that sentence happens without the 1980 Olympics. Michaels was the voice of the iconic broadcasting moment when the Americans beat the Soviet Union in the semifinals.\"Do you believe in miracles?! Yes!\" We've been lucky to have those velvety pipes in our lives ever since.\n\nHerb Brooks, Head Coach Born: Aug. 3, 1937 (Saint Paul, Minnesota) Died: Aug. 11, 2003, 66 years old (Forest Lake, Minnesota) Career highlights: Olympic gold medalist (1980), Olympic silver medalist (2002), three-time NCAA national champion (1974, 1976, 1979)"}, {"url": "https://www.historians.org/research-and-publications/perspectives-on-history/october-2000/the-future-of-feminist-history", "page_content": "Editor's Note: This essay was presented as part of a panel entitled \"The Future of Feminist History\" at the breakfast meeting of the Committee on Women Historians of the AHA on January 8, 2000. The panel was organized by Carla Hesse and also included talks by Jennifer Morgan and Mrinalini Sinha. This text has been edited but appears very largely as it was given.\n\nI want to thank all of you for coming out at 7:30 a.m. on a Saturday morning of a busy conference. When I see the group gathered here today, I understand why feminist history has accomplished all that it has. And this is because, after we feminists do our share of interviewing and being interviewed, speaking, commenting and debating, schmoozing, hobnobbing, and finding time to see old friends (not to mention sometimes getting up with small children), we wake up at the crack of dawn to talk about the future of feminist history. Confronted by such dedication, I am tempted to propose one possible future for feminist history: let the women sleep in! Next year, let's let the men get up at dawn to discuss gender and history. But they won't and don't, and we will and do—and that is our strength and also our cross.\n\nLet me turn, then, to my task, which is to discuss the future of feminist history. But surely this is an impossible—and almost antifeminist—charge. For the topic seems to invite the kind of magisterial summarizing and confident prediction that women's history—with its attention to the unexpected and contingent, the marginal and suppressed—was virtually developed against. But as I reflected further on this challenge, I began to find it an extraordinarily useful one, for it forced me to think outside my usual range of topics and against the historian's particularist grain. After all, there is a value in magisterial pronouncements and sweeping generalizations, if only because they can serve as stimuli to debate. So, instead of making the true but unhelpful point that the future of feminist history is likely to be messy, unfathomable, contentious and yet productive, let me take advantage of this chance to be magisterial and predictive, and put forward my own singular but considered views. And in this vein, I am drawn to make three main points about our field: one celebratory, one anxious, and one programmatic.\n\nA Transformative Presence\n\nFirst and most fundamentally, I want to acknowledge and celebrate the degree to which feminist history has come to be—and, I believe, will continue to be—a powerful and transformative presence in the academy. Whatever our individual criticisms of various approaches and fields—and there is no more critical and self-critical bunch—I think all of us would agree that feminism has utterly transformed historical writing. If we take feminism to be that cast of mind that insists that the differences and inequalities between the sexes are the result of historical processes and are not blindly \"natural,\" we can understand why feminist history has always had a dual mission—on the one hand to recover the lives, experiences, and mentalities of women from the condescension and obscurity in which they have been so unnaturally placed, and on the other to reexamine and rewrite the entire historical narrative to reveal the construction and workings of gender. Moreover, despite our own endless arguments over which of these approaches and tasks is the more significant, the important point is that we have been true to both. And rightly so, for this argument—the argument between \"women's history\" and \"gender history\"—is an argument in which one side continually produces the case for the opposite stance, an argument neither side should ever win. Women's history isn't a stage that we move through as we struggle toward gender history, for gender history itself sends us endlessly back to women. And both inquiries have transformed our historical work and understanding.\n\nThus, works on women have consistently de-essentialized and historicized groups and issues too often trapped in discourses of degeneracy and difference. From Luise White's determination to see Nairobi's prostitutes as entrepreneurs and not victims, to Margot Badran's recovery of a critical feminist voice in Egyptian nationalism, to Nancy Hunt's creative analysis of the ways in which varied cultural practices around maternity in the Belgian Congo shaped colonial relations and populations more broadly, feminist historians have recovered and asserted the significance of women's voices and choices in the past—an effort that cannot possibly be dismissed as \"compensatory history.\" And the payoffs from the turn to gender history have been equally great. Most of the great narratives of modern history—the narratives of industrialization, of class formation, of the construction of welfare states, of the making of nations and empires, of the emergence of democratic politics and the practices of total war—are now seen to have been framed by, based upon, productive of, and narrated through changes in relations between the sexes. This revisionist impulse has gone very far in some fields—there is, for example, no more flourishing subfield in British history today than that devoted to working out the interconnections between the construction of gender identities and the operations of empire—but we find it in almost every field. Think, for example, of Afsaneh Najmabadi's lovely recent study of the ways in which a national panic over the abduction and selling of girls helped to authorize and legitimate the project of Iranian nation-building, of Kristin Hoganson's reading of the Spanish-American war as a project of cultural masculinization, or of Partha Chatterjee's and Mrinalini Sinha's rival accounts of the gendered bases of British imperialism and Indian nationalism.\n\nInstitutional Achievements\n\nNor need our celebration of the impact of feminism on the academy be measured by the flow of books and articles alone. There are also institutional achievements. Not only do most departments now feel that they must teach women's history and (sometimes) even hire specialist women's historians, but also—and this is a quantum leap—they can increasingly imagine hiring someone who works on women or gender not as a \"women's historian\" but rather, say, as a colonial Americanist. Equally important, department members who are responsible for other areas—whether medieval Europe or modern Japan—increasingly feel driven to incorporate material on women into their teaching. Women's and gender history, in other words, may not have achieved its grandest ambition—the ambition to rewrite all of history from the standpoint of gender—but it has accomplished something that I feel to be even more important: it has established itself as one of a relatively small number of approaches and perspectives that are accepted both as legitimate subfields in their own right and as essential components of all national fields. Nor is this position seriously under threat, for both the intellectual imperatives and the emotional and political passions that underpin it are alive and well. Our search to find \"where the women were,\" and to reinterpret the world from their standpoint, will sustain and enrich our profession for a long time to come.\n\nIs all, then, sweetness and light? Here, I want to stop and spend a few minutes voicing an anxiety about two trends within feminist history that I find both exciting and disquieting. I speak, on the one hand, of the increasing attention paid to questions of identity in the study of the formation of individuals and collectivities, and, second, of the turn to what we might call an epistemological approach to the study of relations of power.\n\nContesting Identities\n\nOf course, there are good reasons for both of these moves. The study of women led us ineluctably to the discovery of differences and antagonisms between women, to an awareness of the fact that women often saw other affiliations as more meaningful than those of sex. From this study of division arose, inevitably, the study of contestation among identities, and of the processes through which particular affiliations come to be privileged or powerfully felt. Likewise, the study of gender as a cultural and symbolic system led us inevitably to what Mary Poovey and others have called historical epistemology—that is, to the attempt to understand the production of all those fundamental assumptions and categories that underwrite and sustain particular cultural formations. And if these moves were logical, so too have they had their benefits. The turn to identity, for example, has forced a critical reexamination of—and a moral attention to—a history that feminism has sometimes been slow to acknowledge. Rather than assuming the power of the identity of \"woman,\" we spend more time these days acknowledging and studying women's investment in other cultural practices or markers of difference—in ethnic and racial identities, in relational or family roles, in religious faith and observance. Thus, for example, Susan Grayzel's recent study of women's identities in Britain and France during World War I explores not only the emergence of a feminist pacifism but equally the ways in which many women sought to craft a gendered rhetoric of patriotism and to align the cause of feminism with the cause of war. Likewise, works by feminist historians show us what can be gained by integrating the insights of cultural analysis into studies of social relations: one has only to think of Leora Auslander's brilliant account of the ways in which aesthetic tastes and styles, gender and labor relations, and political forms coalesced and reinforced one another in 18th- and 19th-century France. And one could proliferate such examples.\n\nHistory without Politics?\n\nAnd yet, in spite of the manifest excellence of such work, the turn to identity in the context of a parallel turn toward what we might call a neo-Foucauldian or discursive theory of power has left me somewhat uneasy—or, rather, with the nagging feeling that something has been left out. What might that be? Let me take an example from my own field of British history. At the last annual meeting of the North American Conference on British Studies, there were 25 panels devoted to the modern period. Of these, 11 (or nearly a half) either employed gender as a central analytic concept or were explicitly on men, women, or the family. By contrast, 8 of these 25 panels (or about a third of the total) were on imperial questions. There was, however, an overlap of six between these two groups: six panels, in other words, were on gender and empire. These were, very largely, on identity—on \"imperial masculinity\" or on women's self-understandings and expression in different imperial contexts. They were, I hasten to add, often fascinating presentations: through an enterprising investigation of new sources, they revealed much about their subjects' mental worlds. But this focus on identity and subjectivity seemed to have come at some cost (if only in terms of alternatives foresworn), for what struck me at the time was that, among all these papers on sailors and settlers, missionaries and migrants, I was scarcely able to find one directly concerned with the political processes or social relations of empire—with conquest and governance, population policy, and labor control—all of which, I might add, have everything to do with gender. If a nonhistorian were to have come to this conference, then, she might conclude that the British Empire was nothing more than a great staging ground for the elaboration of \"Britishness,\" in which groups of rather self-absorbed British men and women could experiment with different identities without doing much harm to anyone—a bizarre vision, profoundly one-sided, and oddly reminiscent of an old imperial history also intensely focused on the self-justifications and self-understandings of the colonizing power.\n\nWhy, I wondered, did the conference look this way? Why had politics dropped out? There are, of course, many possible answers to this question, some of which would simply stress shifts in intellectual fashion and the lure of new sources, but one part of any answer must surely focus on the difficulties of studying politics in the context of our preoccupation with systemic cultural analysis. The problem is that the insights that have proven so productive for cultural analysis—insights about the multivalent, collaborative, and web-like nature of power—tend to be less useful for the study of narrower political processes. For, once we assume power is everywhere, it usually turns out to be nowhere very much; if it is analytically directionless, it scarcely needs to be taken into account. Our acceptance, in other words, of the truth that power is everywhere and that the weak, like the strong, play the game of power, has led us away from grasping the other truth that the players are not equal, that even multivalent systems can have internal movements preponderantly in one direction or another, that there are degrees of power, that a middle ground exists between an assumption of total agency and an assumption of total fixity—and that it is on this crucial middle ground that most interesting questions are found and much interesting history happens.\n\nWhat Is to Be Done?\n\nWhat is to be done? I think the problem itself dictates the solution. Let me then argue—and this is my third point—that feminist historians need to bring politics back in, and by this I mean politics less in the broad sense of systemic relations of power than in the narrower sense of that set of negotiations and institutions through which rights and goods are claimed, distributed, and contested. Bringing politics back in will give some much-needed precision to some of the work on identity—allowing us to see, for example, the conditions under which particular racialized or gendered identities can be captured by political movements and mobilized for particular ends. The narrow study of politics also reawakens us to the truth that questions about the degree and form of power are crucial and consequential historical questions, that there is a big difference between the sticks and stones that break our bones and the words that hurt but don't quite kill us. The study of politics, in other words, forces us constantly, and almost against our will, to shift the unit of analysis away from the system and toward the component parts, and to ask questions about processes and outcomes as well as about meanings. Partial such an approach may well be, but it strikes me as a necessary corrective at a moment when systemic analysis and \"thick description,\" rather than causal analysis and the study of change has so much the intellectual upper hand.\n\nBut I want to argue for bringing politics back in for two other reasons as well. We should pay attention to politics, I think, because political history has been one of the last intellectual strongholds of antifeminism, and is only now undergoing a real revision. Thus, in British history, a field in which virtually every worthwhile topic has been done many times over, crucial topics relating to women and politics and gendered studies of politics are still relatively underdeveloped. There is, for example, no book-length study of women's activism in the League of Nations, even though this is where many social reformers cut their teeth; only one recent scholarly work (by Kim Reynolds) on the activities of the political wife, even though political hostesses were crucial power brokers in the era before the emergence of mass parties; and until quite recently relatively little work on the reasons for the long-standing (if now overcome) gender gap in British politics, whereby women disproportionately favor conservatism. Only in the last few years, in work by Alison Light on the affinity between appeasement and domesticity, by Ina Zweiniger-Bargielowska and Fiona Grigg on the gendered appeal of conservative penal and economic policies, and by Martin Pugh and David Jarvis on the party's women's organizations, do we get the beginnings of such a gendered history of conservatism. Subjects like these are not trivial, for they help us to understand how some of the core political changes of our time—changes that affected the lives and life chances of millions—happened. These processes, too, were gendered, and they need our attention.\n\nBut there is one final reason I want to argue for attention to politics, and that is because it will help us with our own institutional work and practice. As we trace the historical significance of the partial reform, of the awkward coalition, of the indifferent outcome chosen to preclude the worse, we learn some lessons that may actually help us in the world in which we find ourselves. For—and this brings me back to my first point—as feminist history has swollen into a big and successful wave, it has lifted a lot of individual historian boats. Feminist historians are now on the committees and Council of the American Historical Association, they are deans and university presidents, heads of major granting agencies, tenured professors and department chairs. This group is making or helping to make the decisions about hiring, promotion, and publishing that will affect our profession through the next generation. I don't wish to belittle in any way the struggles of the first generations of feminist historians, who often pursued their visions from marginal positions and against difficult odds, but for a younger generation—my generation—I think it is important to acknowledge that the world has changed. It is no good, anymore, pretending that we are brave outsiders valiantly challenging patriarchal institutions: that is, the institutions may still be patriarchal, but we are right in the middle of them. When we make such claims or play such a role, then, we look—to our graduate students, to younger faculty, to adjuncts sweating it out in poorly paid holding tanks—not merely ridiculous but irresponsible, indulging in some fantasy of romantic opposition at their expense. For, I would argue, there is no power more despotic than the power that hides its face, that operates personally and erratically, that despises process, that will not acknowledge its own place in the hierarchy, that takes refuge—to cite a feminist classic—in the \"tyranny of structurelessness.\" Theories that stress the fluidity and multivalence of power fit too comfortably with such practice to make our attraction to them entirely innocent. My last point, then, is to ask that as we, as feminist historians, take on ever more important roles in the academy, we understand our place in fixed and directional hierarchies of power, and use our position well. This means, among other things, that we think about whether we can place our graduate students before we ask them to carry out our own intellectual agendas; that we diversify our curriculum without operating our own thought police; that we are gracious to those colleagues who don't quite understand what we do but want to be on our side; and, finally, that we not act like hurt parents when a younger generation decides—as it assuredly will—that we got it all wrong, and comes along to chastise and correct us."}, {"url": "https://www.lrb.co.uk/the-paper/v35/n15/susan-pedersen/triumph-of-the-poshocracy", "page_content": "After the ‘turnip winter’ of 1916-17 and with no sign of war abating, my husband’s grandfather, the oldest child of an impoverished widow in the central German town of Kassel, ran away to join the navy. He was hungry, and though underage and not really military material imagined sailors probably got enough to eat. This was a good guess, and while he had a chancy time of it – surviving the loss of his ship, the scuttling of the German fleet at Scapa Flow and more than a year’s internment in a Merseyside POW camp – he never starved. His sister back in Kassel got rickets, the result of severe malnutrition.\n\nBehind this story and so many like it was the wartime British naval blockade of Germany. And behind the policy, Lord Robert Cecil, the maverick son of the late Victorian Conservative prime minister Lord Salisbury, and minister for blockade in Lloyd George’s wartime government. The aim of the blockade was to damage Germany’s war effort but not Britain’s relations with neutral states, and it appears to have been fairly successful, for by the winter of 1916-17 there were not only shortages of necessary matériel but also starvation across Central and Eastern Europe – an experience that sapped public support for the war and helped fuel the revolutions of 1917-18.\n\nDid the experience of running the blockade predispose Cecil to his next great cause: the effort to construct a ‘guarantee of peace’ through the League of Nations? Through 1918 and 1919, Cecil teamed up with American counterparts to draft the League Covenant. At the heart of the doctrine of collective security lay the principle that the individual ‘rogue state’ would be brought to reason through collective action by the rest, especially through the ‘economic weapon’ of sanctions. International censure and hardship, it was assumed, would drive people to force their governments into line.\n\nThe blockade was still in effect during those discussions. Although it had in a sense done its work – Germany had asked for an armistice, a fragile democracy had emerged – it would not be fully lifted until the Treaty of Versailles was signed. But as the months dragged on, and news of hunger and unrest throughout Central Europe spread, objections grew louder to a ‘weapon’ that did its work by starving women and children. The blockade didn’t so much end the war as shift its target – and ‘for my part,’ one Liberal MP stated, ‘I prefer the weapon which means men facing men with arms in their hands.’ When a diehard Conservative peer, the Duke of Northumberland, made the point that it was ‘those who are always most fervent in the cause of humanity’ who seemed especially eager to support this ‘particularly abhorrent’ weapon, he clearly had Cecil and the internationalists in his sights.\n\nCecil would have had an answer ready. He was not a hypocrite, and his support for economic sanctions, and indeed for the League project as a whole, was of a piece with his political faith. The public should take responsibility for foreign policy, he would have retorted: that was the whole point. If an ‘old diplomacy’ of secret treaties and the balance of power had caused the war, only a ‘new diplomacy’ of open agreements accountable to democratic publics could make power change its ways. The blockade, doing its work on the young and old alike, was one way to teach that pitiless lesson.\n\nThat she was responsible for the good conduct of the nation would probably have struck my husband’s great-grandmother, bent over her washtub, as absurd. But it did not seem absurd to the millions of ordinary citizens of all nationalities who supported the League project in those tumultuous years. In virtually every member state, and in some that were not members, societies sprang up to educate citizens about the League and enlist them behind it. The societies had distinct characteristics and were only loosely affiliated; but together they incarnated what Hume called the ‘party of humankind against vice or disorder’, an alliance of the cosmopolitan and civic-minded determined to keep national hatreds at bay. And of those national societies, none was more important than the British League of Nations Union.\n\nHelen McCarthy’s book is the first full study of the LNU to be published in more than thirty years. It is an important work of recovery. Almost forgotten today, the LNU was one of the largest and most vibrant voluntary associations of the interwar years. With around 400,000 individual members organised in some 3000 local branches at its height in 1931, it rivalled both the major political parties and the churches in its size and reach. Millions of Britons joined LNU branches at some point in their lives; virtually all of them would have heard speeches or radio broadcasts by Cecil, the Oxford classicist Gilbert Murray, the suffragist and internationalist Kathleen Courtney, or some other LNU luminary. Then there’s the LNU’s most famous effort, the ‘Peace Ballot’ of 1935, in which 38 per cent of adult citizens took part and which – so the LNU argued – demonstrated the public’s overwhelming support for the League’s ideals. Although a United Nations Association emerged after the LNU’s demise in the late 1930s, it never gained such a following.\n\nDid the LNU’s strength mean statesmen conducted foreign policy differently, as Cecil hoped? Were prospects for lasting peace improved by the LNU’s dogged efforts? These are not really McCarthy’s questions. This isn’t so much a book about the League of Nations or indeed about foreign policy: its approach owes more to Tocqueville than to E.H. Carr. McCarthy’s real subject is interwar British democracy, and the LNU is a way to examine its changing practices and norms. Who signed up to be internationalism’s foot soldiers? What kind of culture sustained this popular movement? Trawling through the detritus of branch minutes, pamphlets, memoirs and LNU publications, McCarthy offers some answers.\n\nHer findings won’t surprise anyone familiar with the new social history of those years, or even the middlebrow fiction. The LNU became a genuine popular movement, drawing passionate support from all classes; it also deliberately recruited its leadership from across party lines. Inevitably, however, the organisation took root among those whom Michael Frayn would later call ‘the Herbivores’: the ‘do-gooders; the readers of the News Chronicle, the Guardian and the Observer; the signers of petitions; the backbone of the BBC’. Free Church congregations were more likely to join than Anglican ones, Protestants more likely to join than Catholics, and while a small majority of branch members were Conservatives, the organisation’s leadership was dominated by independent-minded intellectuals who were liberals in their ideology if no longer always in their party affiliation. Civic-minded women played a major role but so too did married couples, the LNU acting as a harbinger of a new culture of leisure and sociability in those years.\n\nThe ‘quiet citizens’ (as McCarthy calls them) threw themselves into the work of supporting ‘peace’, but it’s how they went about it that’s most revealing. The LNU took the principle of democratic accountability seriously, but it also assumed that ‘ordinary people’ needed to be instructed in their new role. Education – some would say propaganda – was always the first task: branches mounted thousands of lectures and distributed millions of pamphlets, and much work was put into developing innovative classroom materials to teach schoolchildren a narrative of international co-operation. Some 1500 schools-based LNU branches sprang up, with enthusiastic young supporters attending special summer schools or visiting Geneva to observe League bodies at work.\n\nYet the message those schoolchildren received was strangely apolitical. Co-operation was the watchword, to such an extent that matters of real political disagreement were avoided altogether. The organisation refused to ‘take sides’ on such issues as the General Strike and the Spanish Civil War. It was also adamantly non-partisan, insisting that citizens of all political faiths, from the convinced socialist to the true-blue imperialist, belonged in its ranks. Indeed, the empire, at its height in those years, was seen as entirely compatible with internationalism, being portrayed in LNU literature not as the source of Britain’s global power, much less as a catalyst for international resentments or colonial rebellion, but as a model of harmonious development and interracial co-operation that other empires would do well to follow, or even as the prototype for the League itself.\n\nMcCarthy shows that the LNU’s inclusive rhetoric did little to challenge and much to reinforce the social and intellectual hierarchies of the time. Every Conservative and every Labour voter, every mistress and every maid should support the League cause – so the LNU said. Yet the organisation’s belief in the ‘possibility of social consensus under conditions of social inequality’, its easy assumption that the mistresses would be on the platform and the maids in the audience, inevitably appealed more to those who were satisfied with the status quo than those who were not. Trade unionists accustomed to a more plain-speaking (and masculine) politics found the LNU mealy-mouthed and patronising; the maids weighed the pleasures of LNU lectures and opted for the cinema. The organisation’s determination to recruit from all political parties, too, may have done more to obscure than to bridge real ideological divides. Too quick to be satisfied with formal professions of faith, the LNU was slow to acknowledge the conditions and caveats party leaders put on their support. Only when the Chamberlain government made clear that its foreign policy was no longer based on the Covenant – since the League, as Chamberlain put it in February 1938, was now ‘unable to provide collective security for anybody’ – did the LNU realise it had to take sides. But once it took on the Conservative government, the illusion that it was above party crumbled and with it much of its middlebrow support. Although formal membership remained at almost 200,000 in 1939, the circulation of Headway, the LNU’s organ, plummeted from 100,000 in the early 1930s to 8000 in 1939 – a good indicator of the scale of the catastrophe. With battle lines hardening, the Herbivores fled.\n\nThe League of Nations Union in McCarthy’s account was not only a vehicle for mobilising people behind the liberal internationalist cause but also one of the many civic institutions that defined the peculiar political culture of interwar Britain. Activist but deeply anxious about civic or partisan strife, this culture prioritised social harmony, even if that meant differences were swept under the carpet. Indeed, just how determined the ‘party of humankind’ was to rule social conflict out of bounds is made clear in a second recent study, of the massive mobilisation of volunteers during the 1926 General Strike.\n\nThat strike has always had an odd place in British history. Though it was the largest 20th-century industrial action, neither at the time nor subsequently have people known quite what to make of it. Called by the General Council of the TUC in support of the miners’ struggle to avoid draconian wage cuts in a poorly run industry being weaned off government subsidy, the strike was an astonishingly successful demonstration of working-class resolve. Between 1.5 and 3 million of a unionised workforce of around 6 million walked out on 4 May, bringing virtually all hauling, loading, lifting, drilling, driving, stoking and even typesetting to a standstill. If the goal was to secure specific economic concessions, however, the strike was an ignominious failure. With neither the miners nor the mine-owners interested in compromise, the Conservative government determined not to negotiate, the TUC itself very reluctant to escalate matters, and, crucially, tens of thousands of volunteers falling over themselves to take over the strikers’ work, the General Council simply called the action off on the ninth day. Many strikers returned to face harsher conditions or victimisation, but the miners, living up to their unrivalled reputation for courage and cussedness, stayed out for seven months – a bitter and scarring experience eerily replayed nearly six decades later.\n\nOddly, however, the General Strike isn’t remembered this way. That is, unlike (say) Ramsay MacDonald’s decision to form the National Government in 1931, or even Callaghan’s handling of the Winter of Discontent in 1979, the strike is not remembered as one of the labour movement’s great failures. Instead, it is usually recalled (if at all) as a crisis that failed to happen, or even as the moment when Britain faced the prospect of revolution and turned aside. The fact that the strike was conducted virtually without violence and, as Beatrice Webb put it in her diary, opened ‘with a football match between the police and the strikers’ and ended ‘with densely packed reconciliation services at all the chapels and churches of Great Britain’, was taken not only by almost the whole of the press but even by Webb as evidence of ‘what a sane people the British are’. The ‘British workman’ could never be turned into a ‘Russian Red’, or the ‘British businessman and country gentleman into an Italian Fascist’. British culture was immunised against the Continental viruses of open class antagonism and political extremism.\n\nRachelle Hope Saltzman’s study of the activities and attitudes of the hundreds of thousands of strike volunteers allows us to look more carefully into that celebratory narrative. Saltzman seems an unlikely chronicler of the events: she is American (as I am); she conducted her research for this book in the bitter aftermath of another miners’ strike in the mid-1980s, returning to it several decades later; and, most unusually, she is a folklorist, not a historian, drawn to this episode mostly for its playful, world-turned-upside-down character. The book, as a result, has its limitations: there is no real account of the causes and course of the strike itself or of the shadowy government organisation that enrolled the volunteers, and some historiographical judgments (the claim, for example, that ‘with the exception of the Civil War and the Industrial Revolution, the 1926 General Strike may well be the most written about and reimagined event in British history’) are naive or just plain wrong. But for all that, the book succeeds in drawing on memoirs, newspaper articles and a great many marvellous interviews to capture the motivations and experiences of the many thousands of men and women who volunteered to keep basic services running.\n\nThe strike emerges not as a great national festival but as a ritual enactment of the politics of class. Although there were working-class volunteers, the great majority of those who signed up to drive lorries, deliver supplies or run canteens were not. They were not all the Oxford men of popular legend, of course (although the ancient universities did decant their students en masse), but they did not, let us say, aspire to hold the post of delivery man on a permanent basis. They took on these tasks in the belief they were defending ‘the country’ against the forces of chaos: as the son of two volunteers explained, it never occurred to his parents that they were ‘strike-breakers’. They saw what they did as ‘a return to … wartime service’. Volunteers insisted that they were not anti-Labour but rather ‘for their country’. As one Girton alumna put it, while they were sorry for the miners, they thought the strike had to be defeated, ‘as it was based on the rule of force rather than law’.\n\nServants of the law they might have been, but if Saltzman’s sources are to be believed those undergraduates and bank managers had a whale of a time, and their status as ‘volunteers’ gave them a high degree of licence. Careening a mile or two off the scheduled bus route to deliver a pretty girl to her front door was treated not as a sacking offence but as a sign of chivalry or high spirits; society mothers were said to have seized a chance to introduce their daughters to eligible young men. Driving trains and bedding down in impromptu barracks after a celebratory beer could be great fun, and the accompanying chorus of praise must have been pleasant too. When this ‘lark for the sake of the country’ was over, the volunteers went back to their books or banks in a haze of self-congratulation, surely agreeing with the newspaper that proclaimed: ‘Truly, we are an amazing people.’\n\nThere is at once something admirable and terrible about the mindset revealed in this episode. On the one hand, volunteers showed a level of energy, pluck and concern for the common good that seems remarkable today: that they would spring to the defence of their country went without saying. Yet what they were defending was, after all, the idea that the ‘economic weapon’ of the General Strike, unlike the ‘economic weapon’ of sanctions, was beyond the pale, and that the fate of a million miners could not – if ‘the constitution’ were to survive – be a matter for state action. ‘Constitutional government is fighting for its life,’ Neville Chamberlain, by no means one of the hardest of the government’s ‘hard men’ (that would be Churchill), wrote in the middle of the strike, and many Britons – including not a few trade union leaders – agreed with him. But if one didn’t take quite such an apocalyptic view, or perhaps even thought that managing the coal industry was the government’s job, the volunteers’ readiness to have a week’s fun driving trains had a nasty undertone. Christopher Isherwood, remembering the episode in Lions and Shadows two decades later, thought it revealed not the splendid sanity and patriotism of the British but how deeply entrenched the class system was. For ‘the Poshocracy had won, as it always did win, in a thoroughly gentlemanly manner,’ and so completely that it could now ‘pretend that nothing more serious had taken place than, so to speak, a jolly sham fight with pats of butter’. See how easily we can do without you, the volunteers seemed to tell the strikers. It turns out that we – not you – are essential to the country, and don’t you forget it.\n\nNothing is more revealing of the power of this ideology than the fact that Saltzman, probably unconsciously and against her avowed political affiliations, herself succumbs to it. Her prose incorporates the opposition between the trade unions and ‘the public’, the working class and the ‘country’, that Conservatism promulgated at the time. She tells us, for example, that workers in more than two hundred unions struck to support a million miners, but then adds that even so ‘the general public’s hostility to being inconvenienced outweighed much of the sympathy they might have felt for the miners’ plight’ – a formulation that excludes the strikers, not to mention a million miners, from the ‘general public’. Labour’s claims, we learn, had ‘little resonance for anyone other than the working classes and the intellectual left’, an odd dismissal given that the majority of the population was working class. Sentences like this take for granted precisely that class hegemony that demands explanation.\n\nStudies of interwar political culture have proliferated in recent years, as historians have argued that the sources of Britain’s atypical stability and ‘constitutionalism’ are to be found there. McCarthy and Saltzman echo those arguments, but their recovery of the activism and commitment of ordinary citizens is welcome and new. British politicians didn’t lay such stress on conciliation between the wars simply because its weary citizenry had retreated from politics to tend their herbaceous borders: they did so because the better-off portion of the population, accustomed to considering itself ‘the nation’, was willing to drive trains or deliver supplies to defend that status quo. But if both books portray mobilisation in defence of ‘peace’, the peace the LNU sought was in the first instance international and not domestic. It’s thus worth asking whether McCarthy’s argument about the fixation on social harmony and its likely effect on social differences would hold in the international realm as well. Did the LNU’s inclusive internationalist rhetoric increase transnational understanding or justify Britain’s global hegemony? Were those hundreds of thousands of British citizens truly a force for reconciliation?\n\nMcCarthy doesn’t ask this question: had she done so, she might have been driven towards something uncomfortable. For the complacency and aversion to political conflict that were the LNU’s besetting sins also affected its foreign policies, quite possibly with damaging effects. The LNU tended to assume that Britain was the League’s strongest supporter because it was the most selflessly internationalist power: what it couldn’t quite acknowledge was that Britain could play that role because the League was very largely a British creation, formed in the wake of a war the British Empire had won (insofar as any state won) and to enforce settlements the British had crafted. But other states were well aware of, and resented, that bias. While the British tended to think of the League’s mandates system as a means of raising colonial administration to the level of international ‘best practice’ (which they assumed was British practice), the French saw it as a British scheme aimed at forcing the French to govern their territories to suit British ends, and the Germans as nothing more than an excuse for annexation. Perhaps a more forthright acknowledgment of British interests – as, in the domestic realm, a more forthright acknowledgment of class interest – would have provided a more realistic basis for ‘conciliation’, but such thinking ran against the ‘selflessness’ that was believed to be the only honourable basis for voice. Just as Saltzman’s volunteers insisted they represented ‘the country’ and not their class, so McCarthy’s League supporters were certain they defended ‘civilisation’ or ‘humanity’ and not their nation, and did not ask why British interests and ‘humanity’s’ interests seemed so often to coincide. ‘Whoever invokes humanity wants to cheat,’ Proudhon once wrote – an untrue statement, but one that internationalists would do well to ponder."}, {"url": "https://link.springer.com/chapter/10.1057/9780230204522_3", "page_content": "William Gienapp, ‘The Myth of Class in Jacksonian America’, Journal of Policy History, vol. 6, no. 2 (1994), pp. 232–9, 277–81.\n\nSusan R. Grayzel, Women’s Identities at War: Gender, Motherhood, and Politics in Britain and France during the First World War (Chapel Hill: University of North Carolina Press, 1999)\n\nMichael T. Saler, The Avant-Garde in Interwar England: Medieval Modernism and the London Underground (New York: Oxford University Press, 1999)\n\nErika Rappaport, Shopping for Pleasure: Women in the Making of London’s West End (Princeton, NJ: Princeton University Press, 2000)\n\nKali Israel, Names and Stories: Emilia Dilke and Victorian Culture (New York: Oxford University Press, 1999).\n\nGareth Stedman Jones, ‘Rethinking Chartism’, in his Languages of Class: Studies in English Working Class History, 1832–1982 (Cambridge: Cambridge University Press, 1983), pp. 90–178.\n\nFor one important statement of this thesis, see Eugenio Biagini and Alastair Reid, ‘Currents of radicalism, 1850–1914’, introduction to their Currents of Radicalism: Popular Radicalism, Organised Labour and Party Politics in Britain, 1850–1914 (Cambridge: Cambridge University Press, 1991), pp. 1–19\n\nalso, among other works, Miles Taylor, The Decline of British Radicalism, 1847–1860 (Oxford: Clarendon Press, 1995)\n\nJon Lawrence, Speaking for the People: Party, Language and Popular Politics in England, 1867–1914 (Cambridge: Cambridge University Press, 1998)\n\nEugenio Biagini, Liberty, Retrenchment and Reform: Popular Liberalism in the Age of Gladstone, 1860–1880 (Cambridge: Cambridge University Press, 1992).\n\nDror Wahrman, Imagining the Middle Class: The Political Representation of Class in Britain, c. 1780–1840 (Cambridge: Cambridge University Press, 1995)\n\nPatrick Joyce, Visions of the People: Industrial England and the Question of Class, 1840–1914 (Cambridge: Cambridge University Press, 1991)\n\nJames Vernon, Politics and the People: A Study in English Political Culture, c. 1815–1867 (Cambridge: Cambridge University Press, 1993).\n\nThe landmark work being Leonore Davidoff and Catherine Hall, Family Fortunes: Men and Women of the English Middle Class, 1780–1850 (Chicago, IL: University of Chicago Press, 1987). Anna Clark and Sonya Rose both extended this approach, more or less uncritically, to the working class:\n\nsee Anna Clark, The Struggle for the Breeches: Gender and the Making of the British Working Class (Berkeley: University of California Press, 1995)\n\nSonya Rose, Limited Livelihoods: Gender and Class in Nineteenth-Century England (Berkeley: University of California Press, 1992).\n\nThis historiography is far too extensive to summarize here. One particularly fine early study of women’s involvement in radical politics is Barbara Taylor, Eve and the New Jerusalem: Socialism and Feminism in the Nineteenth Century (New York: Pantheon Books, 1983)\n\non aristocratic women, see K.D. Reynolds, Aristocratic Women and Political Society in Victorian Britain (Oxford: Clarendon Press, 1998). The suffrage and feminist movements have their own very large literatures, but women’s involvement in the realm of formal politics has been less well studied.\n\nFor women in local government, the gold standard remains Patricia Hollis, Ladies Elect: Women in English Local Government, 1865–1914 (Oxford: Clarendon Press, 1987), but there is also a burgeoning literature on women in twentieth-century parliamentary and international politics. ‘Gendered’ interpretations of British national politics remain exceptional, but for the period of the First World War Women’s Identities at War\n\nand Susan Kingsley Kent, Making Peace: The Reconstruction of Gender in Interwar Britain (Princeton, NJ: Princeton University Press, 1993).\n\nMaurice Cowling, The Impact of Labour, 1920–1924: The Beginning of Modern British Politics (Cambridge: Cambridge University Press, 1971), p. 3.\n\n‘It was closed to those outside, in terms of direct access and influence: it was closed also in that politicians were bound to see more significance in the definite structure of relationships at Westminster, than in their contacts with the world outside.’ Cooke and Vincent , The Governing Passion: Cabinet Government and Party Politics in Britain, 1885–86 (Brighton: Harvester Press, 1974), p. 21.\n\nMichael Bentley, ‘Politics, Doctrine, and Thought’, in Michael Bentley and John Stevenson (eds), High and Low Politics in Modern Britain (Oxford: Clarendon Press, 1983), p. 130.\n\nSee, notably, the festschrift edited by Michael Bentley, Public and Private Doctrine: Essays in British History presented to Maurice Cowling (Cambridge: Cambridge University Press, 1993), and Bentley’s exemplary, almost anthropological, Lord Salisbury’s World: Conservative Environments in Late-Victorian Britain (Cambridge: Cambridge University Press, 2001).\n\nJonathan Parry, Democracy and Religion: Gladstone and the Liberal Party, 1867–1875 (Cambridge: Cambridge University Press, 1986), p. 3.\n\nProbably the major difference being the ‘new’ political historians’ continued, probing engagement with both Marxism and linguistic theory. In a recent essay, for example, Stedman Jones defends his claim that ‘politics occurs wholly within discourse’ while also offering a trenchant critique of Foucault’s genealogy of modernity as a ‘bleak dystopian inversion of liberal optimism’ whose appeal can only be explained in light of the twentieth century’s horrors. See Gareth Stedman Jones, ‘Anglo-Marxism, Neo-Marxism and the Discursive Approach to History’, in Alf Lüdtke (ed.), Was bliebt von marxistichen Perspektiven in der Geschichtsforschung? (Göttingen: Max-Planck-Institut für Geschichte/Wallstein Verlag, 1997), especially pp. 194, 197, 205.\n\nJohn Foster, Class Struggle and the Industrial Revolution: Early Industrial Capitalism in Three English Towns (London: Weidenfeld and Nicolson, 1974)\n\nJohn Vincent, The Formation of the Liberal Party, 1857–1868 (London: Constable, 1966)\n\nPeter Clarke, Lancashire and the New Liberalism (Cambridge: Cambridge University Press, 1971).\n\nH.C.G. Matthew, Gladstone, 1809–1874 (Oxford: Clarendon Press, 1986), especially chapter 5;\n\nBoyd Hilton, The Age of Atonement: The Influence of Evangelicalism on Social and Economic Thought, 1785–1865 (Oxford: Clarendon Press, 1988), chapter 9.\n\nTwo excellent summary statements of this new narrative of liberalism’s birth are Peter Mandler, The Strange Birth of Liberal England: Conservative Origins of the Laissez-Faire State, 1780–1860, Harvard University Center for European Studies Working Paper Series No. 19 (Cambridge, Mass., 1989)\n\nPat Thane, ‘Government and Society in England and Wales, 1750–1914’, in F.M.L. Thompson (ed.) The Cambridge Social History of Britain 1750–1950, vol. 1, Social Agencies and Institutions (Cambridge: Cambridge University Press, 1990), pp. 1–61.\n\nJon Lawrence and Miles Taylor, ‘Introduction: Electoral Sociology and the Historians’, in Jon Lawrence and Miles Taylor (eds), Party, State and Society: Electoral Behaviour in Britain since 1820 (Aldershot: Scolar Press, 1997), p. 2.\n\nFor the latter, see especially, Bill Schwarz, ‘The Language of Constitutionalism: Baldwinite Conservatism’, in his Formations of Nation and People (London: Routledge, 1984), pp. 1–18.\n\nPhilip Williamson, Stanley Baldwin: Conservative Leadership and National Values (Cambridge: Cambridge University Press, 1999)\n\nRoss McKibbin, ‘Class and Conventional Wisdom: The Conservative Party and the “Public” in Inter-war Britain’, in his Ideologies of Class: Social Relations in Britain, 1880–1950 (Oxford: Clarendon Press, 1990), pp. 259–93; Susan Kent, Making Peace\n\nAlison Light, Forever England: Femininity, Literature and Conservatism Between the Wars (London: Routledge, 1991).\n\nMax Weber, ‘Politics as a Vocation’, in H.H. Gerth and C. Wright Mills (eds), From Max Weber: Essays in Sociology (New York: Oxford University Press, 1946), pp. 77–9.\n\nLewis B. Namier, The Structure of Politics at the Accession of George III (London: Macmillan, 1929)\n\nSamuel H. Beer, Treasury Control: The Co-ordination of Financial and Economic Policy in Great Britain (Oxford: Clarendon Press, 1956).\n\nE.P. Thompson, ‘Eighteenth-Century English Society: Class Struggle Without Class?’, Social History, vol. 3 (1978), p. 141\n\nquoted in Philip Harling, The Waning of ‘Old Corruption’: The Politics of Economical Reform in Britain, 1779–1846 (Oxford: Clarendon Press, 1996).\n\nJohn Brewer, The Sinews of Power: War, Money and the English State, 1688–1783 (New York: Alfred Knopf, 1988)\n\nThomas C. Ertman, Birth of the Leviathan: Building States and Regimes in Medieval and Early Modern Europe (Cambridge: Cambridge University Press, 1997).\n\nSee, for example, Maurice Bruce, The Coming of the Welfare State (London: B.T. Batsford, 1961)\n\nDerek Fraser, The Evolution of the British Welfare State (1973) (2nd edn, London: Macmillan, 1984). By contrast, Pat Thane explicitly acknowledges the global context within which social policy developments occur by including (as Brewer did) comparative sections in her study, The Foundations of the Welfare State (London: Longman, 1982).\n\nCarolyn Kay Steedman, Landscape for a Good Woman: A Story of Two Lives (1986) (reprinted, New Brunswick, NJ: Rutgers University Press, 1987), especially pp. 29–30, 121–4.\n\nIna Zweiniger-Bargielowska, Austerity in Britain: Rationing, Consumption and Controls, 1939–1955 (Oxford: Oxford University Press, 2000).\n\nSee, especially, R.J. Overy, War and Economy in the Third Reich (Oxford: Clarendon Press, 1994), particularly chapter 9.\n\nC.A. Bayly, Imperial Meridian: The British Empire and the World, 1780–1830 (London: Longman, 1989)\n\nP.J. Cain and A.G. Hopkins, British Imperialism, 2 vols (London: Longman, 1993)\n\nMrinalini Sinha, Colonial Masculinity: The ‘Manly Englishman’ and the ‘Effeminate Bengali’ in the Late Nineteenth Century (Manchester: Manchester University Press, 1995)."}, {"url": "https://www.espn.com/mens-college-basketball/story/_/id/35305231/the-top-25-most-valuable-college-basketball-players-pre-nil-2000", "page_content": "The name, image and likeness (NIL) rules have allowed college stars to excel in different lanes outside of their sports. While they're all making a push toward national titles this season, they can also enjoy the spoils of their hard work with sponsorships and endorsements.\n\nNearly two years into the NIL era, college basketball is changing.\n\nIowa star Caitlin Clark had reportedly made more than $1 million in endorsement deals before she signed with Nike earlier this year. Kentucky's Oscar Tshiebwe and Gonzaga's Drew Timme are reportedly earning seven figures, too. And Miami's Cavinder twins, Haley and Hanna, have turned their millions of followers into millions of dollars.\n\nIt's about time.\n\nFor years, college athletes lobbied for the opportunity to benefit from NIL opportunities, but the NCAA blocked those ambitions.\n\nThat's why it's fair to wonder how the past generations of college basketball players might have fared if they would have had the chance, so we decided to rank former stars according to the NIL value they might have had during their time in college.\n\nWe can only imagine what Lisa Leslie, Michael Jordan, Shaquille O'Neal, Sheryl Swoopes, Cheryl Miller, the Fab Five and other 1980s and 1990s stars might have generated during their careers. But we've decided to confine this list to the last 20 or so years. Any athlete who played from the 2000-01 season until 2020-21 is eligible.\n\nCriteria included a combination of each player's achievements and popularity in college. Then, we used their current social media followings and post-collegiate endorsements as a barometer (not in all cases, of course) to calculate their potential brand power during their respective time as Division I college basketball stars. It's not an exact science, but we tried.\n\nHere are the top 25 most valuable college basketball players (pre-NIL) since 2000:\n\nplay 1:32 Ionescu notches 57th career double-double Sabrina Ionescu scores a game-high 19 points and grabs 11 rebounds as Oregon advances to the Pac-12 semifinals.\n\nThe stats: 26 triple-doubles (NCAA career record), 3-time AP first team All-American (2018, 2019, 2020), No. 1 pick in the WNBA draft (2020)\n\nSocial media following: 701,000 (Instagram), 135,000 (Twitter), 264,000 (TikTok)\n\nPost-NCAA endorsements: BodyArmor, Nike, State Farm, Xbox\n\nNIL potential: As a superstar at Nike's flagship school, Ionescu would have spent her days with the Ducks sifting through lucrative NIL offers that would have made her a young millionaire.\n\nplay 0:45 Flashback: Zion blows out shoe vs. UNC Zion Williamson's foot burst through his sneaker less than a minute into Duke's game against North Carolina on February 20th, 2019.\n\nThe stats: Wooden Award winner (2019), AP first team All-American, No. 1 pick in the NBA draft (2019)\n\nSocial media following: 5.3 million (Instagram)\n\nPost-NCAA endorsements: Gatorade, Mountain Dew, 2K Sports, Nike\n\nNIL potential: When Williamson's shoe broke with President Obama sitting in the front row during a game against the Tar Heels in 2019, Nike's stock value dropped $1 billion -- a sign of what his NIL influence on the market might have been.\n\nGregory Shamus/Getty Images\n\nThe stats: Two-time NCAA champion (2007, 2008), two-time Wooden Award winner (2007, 2008), No. 1 pick in the WNBA draft (2008)\n\nSocial media following: 1 million (Instagram), 395,000 (Twitter)\n\nPost-NCAA endorsements: Adidas, CarMax, Capital One\n\nNIL potential: You can't make a list of the greatest college players of all-time without mentioning Parker, who would have made a lot of NIL money off that fact alone.\n\nRichard Clement /Icon SMI via Getty Images\n\nThe stats: Wooden Award winner (2007), No. 2 pick in the NBA draft (2007), Big 12 player of the year (2007)\n\nSocial media following: 21 million (Twitter), 13 million (Instagram)\n\nPost-NCAA endorsements: Nike, Gatorade, 2K Sports, Beats by Dre\n\nNIL potential: He only spent one year at Texas, but Durant was must-see TV every time he stepped onto the court.\n\nplay 0:33 Trae Young's stardom continues to grow Oklahoma freshman Trae Young leads the nation in scoring and assists. After another huge game Friday against Northwestern, Young solidifies his case as the most skilled guard in the country.\n\nThe stats: No. 5 pick in the NBA draft (2018), All-Big 12 first team (2018), AP first team All-American (2018)\n\nSocial media following: 4.8 million (Instagram)\n\nPost-NCAA endorsements: State Farm, Adidas, BodyArmor, eBay\n\nNIL potential: NBA stars sent him text messages and showed up to his games during his one magical season at Oklahoma, where the point guard would have left with a lot of money in his pocket if NIL rules had been in place.\n\nDiana Taurasi celebrates with her teammates another NCAA Championship win in 2004 Elsa/Getty Images\n\nThe stats: Three-time NCAA champion (2002, 2003, 2004), No. 1 pick in the WNBA draft (2004), 2003 AP national player of the year\n\nSocial media following: 95,000 (Twitter), 280,000 (Instagram)\n\nPost-NCAA endorsements: Nike, BodyArmor\n\nNIL potential: Taurasi is one of the greatest players in women's college basketball history, which is why the former UConn star -- nearly 16 million people watched her three national championship victories -- would have appealed to major brands when she was in college.\n\nThe stats: NCAA champion (2012), two-time Wooden Award winner (2012, 2013), No. 1 pick 2013 WNBA draft\n\nSocial media following: 112,000 (Twitter), 674,000 (Instagram)\n\nPost-NCAA endorsements: Nike\n\nNIL potential: Griner was a 6-foot-9 force in women's college basketball during her four years at Baylor -- she has the NCAA's all-time record of 748 career blocks, and dunks (18).\n\n8. Maya Moore (G/F, UConn Huskies, 2007-2011)\n\nThe stats: Two-time Wooden Award winner (2009, 2011), two-time NCAA champion (2009, 2010), No. 1 pick in the WNBA draft (2011)\n\nSocial media following: 273,000 (Instagram), 234,000 (Twitter)\n\nPost-NCAA endorsements: Jordan Brand, Pepsi Max, United Airlines\n\nNIL potential: After her decorated collegiate career ended, Moore became the first woman to sign a deal with Jordan Brand, but the money would have arrived sooner had Moore been allowed to sign NIL deals in college.\n\nplay 1:01 Flashback: That time when Curry impressed LeBron at Davidson On Dec. 6, 2008, Davidson's Steph Curry hit a couple of nice shots, including a very long 3-pointer, that made LeBron James get out of his seat to cheer him on.\n\nThe stats: No. 7 pick in NBA draft (2009), AP first-team All-American (2009), NCAA record for most 3-pointers in one season (162 in 2008)\n\nSocial media following: 48 million (Instagram)\n\nPost-NCAA endorsements: Under Armour, Chase Bank, Nissan Motor\n\nNIL potential: LeBron James sat courtside as Curry starred in the 2008 NCAA tournament, the same year the future NBA superstar would have made a hefty sum on NIL deals if he'd had the opportunity.\n\n10. Jimmer Fredette (G, BYU Cougars, 2007-2011)\n\nHappy 10-year anniversary of Jimmermania 🐐🐐🐐\n\npic.twitter.com/90IX28wfrx — TBT (@thetournament) March 16, 2021\n\nThe stats: AP first team All-American (2011), No. 10 pick in the NBA draft (2011), Wooden Award winner (2011)\n\nSocial media following: 135,000 (Instagram), 144,000 (Twitter), 100,000 (TikTok)\n\nPost-NCAA endorsements: 361 (Chinese shoe brand)\n\nNIL potential: \"Jimmer Mania\" was so big BYU had to sneak Fredette in and out of its arena whenever he played.\n\n11. Carmelo Anthony (F, Syracuse Orange, 2002-03)\n\nThe stats: NCAA champion (2003), No. 3 pick in the NBA draft (2003), Most Outstanding Player in the 2003 NCAA tournament\n\nSocial media following: 7.9 million (Instagram)\n\nPost-NCAA endorsements: Jordan Brand, Foot Locker\n\nNIL potential: His run through the 2003 NCAA tournament changed Syracuse basketball.\n\n12. Sue Bird (PG, UConn Huskies, 1999-2002)\n\nplay 2:39 Sue Bird shares how Geno Auriemma recruited her to UConn On episode 14 of DangerTalk with Russell Wilson, former UConn star Sue Bird reflects on how Geno Auriemma handled her recruitment before she committed to the Huskies.\n\nThe stats: Three-time winner of Nancy Lieberman Award (nation's best point guard), led team to 39-0 record and national title in 2001-02 season, No. 1 pick in the WNBA draft (2002)\n\nSocial media following: 194,000 (Twitter), 704,000 (Instagram)\n\nPost-NCAA endorsements: Nike, State Farm, American Express\n\nNIL potential: More than 5.68 million people watched Bird lead UConn to an 82-70 win over Oklahoma in the 2002 national championship game. That's strong sponsorship-generating numbers.\n\nplay 1:02 On this date: Hansbrough's jumper sends UNC to ACC final On March 15, 2008, Tyler Hansbrough scores 26 points, including the game winner, to lead the Tar Heels to a 68-66 win over Virginia Tech.\n\nThe stats: Wooden Award winner (2008), NCAA champion (2009), No. 13 pick in the NBA draft (2009)\n\nSocial media following: 28,000 (Instagram), 75,000 (Twitter)\n\nPost-NCAA endorsements: Panini\n\nNIL potential: Before Oscar Tshiebwe, Hansbrough had been the only Wooden Award winner in the one-and-done era to return to school for another season.\n\nplay 2:50 Flashback: Wall gets emotional during Kentucky HOF speech Former Wildcats player John Wall breaks down in tears while thanking his mother during his Kentucky Hall of Fame speech.\n\nThe stats: No. 1 pick NBA draft (2012), AP first team All-American (2010), SEC player of the year (2010)\n\nSocial media following: 4.5 million (Instagram)\n\nPost-NCAA endorsements: Reebok, Adidas\n\nNIL potential: Wall created the \"John Wall dance\" that captivated the college basketball landscape during his lone season at the Division I level.\n\nplay 2:27 Season Preview: Skylar Diggins Skylar Diggins sits down with Kevin Negandhi to talk about how the Irish can build on last year's success.\n\nThe stats: AP first team All-American (2012, 2013), 2-time Nancy Lieberman Award (2012, 2013), No. 3 pick in the WNBA draft (2013)\n\nSocial media following: 1 million (Instagram)\n\nPost-NCAA endorsements: Puma, Nike, Sprint, BodyArmor\n\nNIL potential: Jay-Z (her first agent) gave her a Mercedes when she graduated from Notre Dame.\n\nAnthony Davis at Kentucky 🔥 (2012) pic.twitter.com/YLETDLvGVb — ThrowbackHoops (@ThrowbackHoops) December 22, 2018\n\nThe stats: Wooden Award winner (2012), No. 1 pick in the NBA draft (2012), Most Outstanding Player in the 2012 NCAA tournament\n\nSocial media following: 7.2 million (Instagram)\n\nPost-NCAA endorsements: Nike, Frito-Lay, Red Bull\n\nNIL potential: Davis became the face of the one-and-done movement after leading Kentucky to a national title more than a decade ago.\n\nThe stats: AP first team All-American (2001, 2002), NCAA champion (2001), No. 2 pick in the NBA draft (2002)\n\nSocial media following: 566,000 (Instagram), 624,000 (Twitter),\n\nPost-NCAA endorsements: Adidas\n\nNIL potential: Long before he became a commentator, he was the young point guard for Duke everybody wanted to watch.\n\nplay 1:55 Is Breanna Stewart the greatest women's college basketball player ever? Doris Burke tells Mike & Mike a fourth championship would make Breanna Stewart the most accomplished women's college basketball player ever, but can't say she's been better than Diana Taurasi.\n\nThe stats: Four-time Most Outstanding Player in the NCAA tournament, four-time NCAA champion (2013, 2014, 2015, 2016), two-time Wooden Award winner (2015, 2016)\n\nSocial media following: 122,000 (Twitter), 309,000 (Instagram)\n\nPost-NCAA endorsements: Nike, Puma\n\nNIL potential: One of the most decorated college basketball players, men's or women's, of all-time, Stewart would have spent her time in UConn with millions in the bank off NIL opportunities.\n\nplay 0:34 A'ja Wilson's letter to her high school self South Carolina women's basketball forward A'ja Wilson reads a letter she wrote to her high school self, explaining the great decision she made to play for the Gamecocks.\n\nThe stats: Wooden Award winner (2018), 3-time All-American (2016, 2017, 2018), NCAA champion (2017)\n\nSocial media following: 60,000 (TikTok), 142,000 (Twitter), 500,000 (Instagram)\n\nPost-NCAA endorsements: Nike, Ruffles, Mountain Dew\n\nNIL potential: Wilson was the star who helped Dawn Staley's South Carolina become a national powerhouse.\n\nThe stats: Six combined AP first- and second-team All-American appearances, five combined Final Four appearances, No. 1 pick in the 2012 (Nneka) and 2014 (Chiney) WNBA drafts\n\nSocial media following: Nneka (220,000 on Twitter, Instagram combined) and Chiney (388,000 on Twitter, Instagram, TikTok combined)\n\nPost-NCAA endorsements: Adidas (both Nneka and Chiney)\n\nNIL potential: The sisters, who led Stanford to the Final Four in 2011 and 2012, were known for their versatility, dominance and intellect while with the Cardinal.\n\nplay 0:59 Curry-Griffin duel in '08 Davidson-Oklahoma classic On Nov. 18, 2008, Steph Curry scored a college career high of 44 points, but Davidson was defeated by Blake Griffin and Oklahoma.\n\nThe stats: Wooden Award winner (2009), No. 1 pick in the NBA draft (2009), Big 12 player of the year (2009)\n\nSocial media following: 3.8 million (Instagram)\n\nPost-NCAA endorsements: Kia, Jordan Brand, Subway\n\nNIL potential: Griffin was a high-flying, dunking star during an electric two years at Oklahoma.\n\nplay 0:28 Plum becomes NCAA women's all-time leading scorer Washington's Kelsey Plum sinks the lefty floater to surpass Jackie Stiles for the most points in NCAA women's basketball history. The basket also gave Plum 55 points for the game against Utah.\n\nThe stats: Two-time AP All-American (2011, 2012), led her team to the 2013 Sweet 16, No. 2 pick in 2013 WNBA draft\n\nSocial media following: 270,000 (Twitter), 43,000 (TikTok), 464,000 (Instagram)\n\nPost-NCAA endorsements: Nike, Gatorade\n\nNIL potential: Delle Donne would have been a marketing superstar at Delaware, which finished top 25 nationally in attendance with the All-American on the roster in 2013.\n\n23. J.J. Redick (G, Duke Blue Devils, 2002-2006)\n\nThe stats: Wooden Award winner (2006), No. 11 pick in the NBA draft (2006), 457 career 3-pointers (second all-time in NCAA history)\n\nSocial media following: 250,000 (Instagram), 241,000 (Twitter)\n\nPost-NCAA endorsements: Adidas\n\nNIL potential: As both an exceptional and polarizing player at Duke, Redick would have made the haters even more upset if he'd been allowed to sign major sponsorship deals.\n\nplay 0:34 Ogunbowale wins the national championship for Notre Dame On April 1, 2018, Arike Ogunbowale sinks a game-winning 3-pointer for the Fighting Irish to claim the national championship against the Bulldogs.\n\nThe stats: AP first team All-American (2017), No. 1 pick in WNBA draft (2017), Wooden Award winner (2017)\n\nSocial media following: 42,000 (TikTok), 101,000 (Twitter), 640,000 (Instagram)\n\nPost-NCAA endorsements: Under Armour, Nike, GSTQ\n\nNIL potential: The NCAA's all-time leading scorer (3,527 points) spent her time at Washington chasing history, and doing it in style."}, {"url": "https://www.celebsagewiki.com/susan-pedersen-swimmer", "page_content": "Age, Biography and Wiki\n\nSusan Pedersen was born on 16 October, 1953 in Sacramento, California, United States, is an American swimmer. Discover Susan Pedersen's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 69 years old?\n\nPopular As N/A Occupation N/A Age 69 years old Zodiac Sign Libra Born 16 October 1953 Birthday 16 October Birthplace Sacramento, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 16 October. She is a member of famous Swimmer with the age 69 years old group.\n\nSusan Pedersen Height, Weight & Measurements\n\nAt 69 years old, Susan Pedersen height is 1.75 m and Weight 70 kg.\n\nPhysical Status Height 1.75 m Weight 70 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nShe is currently single. She is not dating anyone. We don't have much information about She's past relationship and any previous engaged. According to our Database, She has no children.\n\nFamily Parents Not Available Husband Not Available Sibling Not Available Children Not Available\n\nSusan Pedersen Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Susan Pedersen worth at the age of 69 years old? Susan Pedersen’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Susan Pedersen's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nSusan Pedersen Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Susan Pedersen Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.stadiumtalk.com/s/1980-us-olympic-hockey-team-then-now-b0603bc7cb2a4f48", "page_content": "Where Are They Now: 1980 U.S. Olympic Hockey Team You won't believe what happened to the \"Miracle On Ice\" players after they won the gold.\n\nWhere Are They Now: 1980 U.S. Olympic Hockey Team Is there a greater team accomplishment in sports history than what the U.S. Olympic hockey team did at the 1980 Winter Olympics in Lake Placid, New York? When the Americans won the gold medal, they took down the Soviet Union, the most powerful team in the world, in the semifinals. The game become known as the \"Miracle on Ice\" and is the leader in the clubhouse as the greatest sports upset of all time. With U.S. head coach Herb Brooks leading a team of college all-stars against the greatest team in the world — the Russians were de facto professionals — the story of the American team has been made into a movie, twice, and is part of sports culture around the world. But what happened to the team after the Olympics? What paths would their destinies take? Here's a look at the 1980 U.S. Olympic hockey team after they won the gold, and where they are now.\n\nKen Morrow, Defenseman Born: Oct. 17, 1956 (Davison, Michigan) High school: Davison High School (Davison, Michigan) College: Bowling Green State University\n\nCareer Highlights: Ken Morrow NHL career: New York Islanders (1979-89) Career highlights: CCHA Player of the Year (1979), four-time All-CCHA (1976-79), four-time Stanley Cup champion (1980-83)\n\nWhat Happened Next: Ken Morrow You might not know his name like some of the other players on the 1980 Olympic team, but Ken Morrow may have been the best player on the team pound for pound. \"Wolfman\" was drafted by the New York Islanders after his freshman season at Bowling Green, and after the 6-foot-4, 209-pound defenseman won the gold medal, he went straight to the NHL and was a key player on four consecutive Stanley Cup championship teams. Morrow has been the director of pro scouting for the Islanders since 1995.\n\nMike Ramsey, Defenseman Born: Dec. 3, 1960 (Minneapolis, Minnesota) High school: Roosevelt High School (Minneapolis, Minnesota) College: University of Minnesota NHL career: Buffalo Sabres (1979-93), Pittsburgh Penguins (1992-94), Detroit Red Wings (1994-97)\n\nCareer Highlights: Mike Ramsey NHL career: Buffalo Sabres (1979-93), Pittsburgh Penguins (1992-94), Detroit Red Wings (1994-97) Career highlights: All-NCAA tournament team (1979), Stanley Cup champion (1997), four-time NHL All-Star (1982, 1983, 1985, 1986)\n\nWhat Happened Next: Mike Ramsey Mike Ramsey was one of nine players on the 1980 team who played for Herb Brooks at the University of Minnesota and was the youngest player on the Olympic hockey team at 19 years old. Ramsey had one of the best NHL careers of any player from the Olympic team. He played 18 seasons in the NHL, with the first 14 on the Buffalo Sabres and made four NHL All-Star teams. Ramsey only played in the Stanley Cup Final once and retired after two games with the Detroit Red Wings at the beginning of the 1996-97 season. And the Red Wings went on to win the Stanley Cup. Ramsey moved back to Minnesota after his playing career was over to run a sporting goods store (Gold Medal Sports) and was an assistant coach with the Minnesota Wild from 2000 to 2010.\n\nMark Johnson, Center Born: Sept. 22, 1957 (Minneapolis, Minnesota) High school: James Madison Memorial High School (Madison, Wisconsin) College: University of Wisconsin\n\nCareer Highlights: Mark Johnson NHL career: Pittsburgh Penguins (1979-82), Minnesota North Stars (1982), Hartford Whalers (1982-85), St. Louis Blues (1985), New Jersey Devils (1985-90) Career highlights: NHL All-Star (1984), WCHA Most Valuable Player (1979), WCHA Freshman of the Year (1977), two-time AHCA West All-American (1978, 1979)\n\nWhat Happened Next: Mark Johnson No one was better against the Soviet Union than University of Wisconsin star Mark Johnson, who scored two goals in a 4-3 win and had an assist on the game-winning goal in the gold medal win over Finland. Johnson then played in the NHL for 12 seasons and was an NHL All-Star in 1984 with the Hartford Whalers. Johnson has been the women's hockey coach at the University of Wisconsin since 2002, where he's won six national championships and been named National Coach of the Year four times. He also was the head coach for the U.S. women's Olympic team in 2010, leading them to a silver medal.\n\nRob McClanahan, Left Wing Born: Jan. 9, 1958 (Saint Paul, Minnesota) High school: Mounds View High School (Arden Hills, Minnesota) College: University of Minnesota\n\nCareer Highlights: Rob McClanahan NHL career: Buffalo Sabres (1979-81), Hartford Whalers (1981-82), New York Rangers (1982-83) Career highlights: All-NCAA tournament team (1977, 1978), two-time All-ECAC (1977, 1978), NCAA champion (1978)\n\nWhat Happened Next: Rob McClanahan Rob McClanahan came to the Olympic team after winning a national championship with the University of Minnesota and U.S. head coach Herb Brooks in 1979. McClanahan scored what proved to be the game-winning goal for the U.S. in the gold medal game against Finland and scored five goals in seven games at the 1980 Olympics. His argument with Brooks during intermission of an Olympic game against Sweden, when Brooks goaded an injured McClanahan into coming back into the game, is one of the more famous moments in the team's history. McClanahan played five seasons in the NHL before becoming an investment banker.\n\nDave Silk, Right Wing Born: Jan. 1, 1958 (Scituate, Massachusetts) High school: Thayer Academy (Braintree, Massachusetts) College: Boston University\n\nCareer Highlights: Dave Silk NHL career: New York Rangers (1979-83), Boston Bruins (1983-85), Detroit Red Wings (1985), Winnipeg Jets (1985-86) Career highlights: NCAA champion (1978), New England Rookie of the Year (1977), two-time All-New England (1977, 1978)\n\nWhat Happened Next: Dave Silk Dave Silk was one of four players from Boston University on the 1980 Olympic team, alongside college teammates Mike Eruzione, Jim Craig and Jack O'Callahan. Silk was a star in college, helping the Terriers win the 1978 national championship. Silk played seven seasons in the NHL, then played five more seasons of professional hockey in Germany. Following his playing career, he used his MBA from Boston University and went into finance.\n\nBill Baker, Defenseman Born: Nov. 29, 1956 (Grand Rapids, Minnesota) High school: Grand Rapids High School (Grand Rapids, Minnesota) College: University of Minnesota\n\nCareer Highlights: Bill Baker NHL career: Montreal Canadiens (1980), Colorado Rockies (1980-82), St. Louis Blues (1982), New York Rangers (1982-83) Career highlights: WHCA All-American (1979), All-WHCA (1979), CHL Adams Cup champion (1984)\n\nWhat Happened Next: Bill Baker Bill Baker was the captain for Herb Brooks at the University of Minnesota when the Gophers won the national championship in 1979 before making the 1980 Olympic team. Baker scored the final goal in a 2-2 tie with Sweden, which allowed the U.S. to advance to the medal round. His jersey is on display at the Smithsonian Institute in Washington, D.C. Baker played three seasons in the NHL before he returned to school, becoming a doctor of oral and maxillofacial medicine who specializes in jaw surgeries and soft-palate tissue repairs.\n\nNeal Broten, Center Born: Nov. 29, 1959 (Roseau, Minnesota) High school: Roseau High School (Roseau, Minnesota) College: University of Minnesota\n\nCareer Highlights: Neal Broten NHL career: Minnesota North Stars/Dallas Stars (1980-95, 1997), New Jersey Devils (1995-97), Los Angeles Kings (1997) Career highlights: NCAA champion (1979), WHCA Rookie of the Year (1979), Hobey Baker Award (1981), Stanley Cup champion (1995)\n\nWhat Happened Next: Neal Broten Neal Broten was an electric goal scorer who won a national championship at the University of Minnesota in 1979. Broten and Canadian goaltender Ed Belfour are the only two players in hockey history to win an NCAA championship, Olympic gold medal and Stanley Cup championship. Broten played 17 seasons in the NHL, where he scored over 50 points nine times and played over 1,000 games, including a 105-point season in 1985-86, when he became the first American to score over 100 points in a single season. He also was a two-time NHL All-Star and won the Stanley Cup with the New Jersey Devils in 1995, when he scored the title-clinching goal.\n\nDave Christian, Right Wing Born: May 12, 1959 (Warroad, Minnesota) High school: Warroad High School (Warroad, Minnesota) College: University of North Dakota\n\nCareer Highlights: Dave Christian NHL career: Winnipeg Jets (1979-83), Washington Capitals (1983-90), Boston Bruins (1990-91), St. Louis Blues (1991-92), Chicago Blackhawks (1992-94) Career highlights: NCAA runner-up (1979), NHL All-Star (1991)\n\nWhat Happened Next: Dave Christian Dave Christian was the only member of the 1980 Olympic team from the University of North Dakota. They lost to U.S. head coach Herb Brooks and the University of Minnesota (and many of his Olympic teammates) in the 1979 NCAA championship game. Christian was playing in the NHL with the Winnipeg Jets one week after winning a gold medal, and still holds the NHL record by scoring just 7 seconds into his first NHL game. Christian went on to play 15 seasons and 1,009 career games in the NHL and played in the Stanley Cup Final once, when the Boston Bruins lost to the Edmonton Oilers in 1990. Christian, who played in the 1991 NHL All-Star Game, wasn't the first one in his family to win a gold medal. His father, Bill Christian, and his uncle, Roger Christian, were both on the 1960 U.S. Olympic hockey team.\n\nSteve Christoff, Right Wing Born: Jan. 23, 1958 (Springfield, Illinois) High school: Richfield High School (Richfield, Minnesota) College: University of Minnesota\n\nCareer Highlights: Steve Christoff NHL career: Minnesota North Stars (1979-82), Calgary Flames (1982-83), Los Angeles Kings (1983-84) Career highlights: NCAA champion (1979), two-time All-ECAC (1978, 1979), All-NCAA tournament team (1979)\n\nWhat Happened Next: Steve Christoff Steve Christoff was one of the most highly recruited high school hockey players of all time coming out of Richfield (Minnesota) High School before starring at the University of Minnesota for Olympic head coach Herb Brooks. After winning the gold medal, Christoff played five seasons and led the Minnesota North Stars to the Stanley Cup Final, where they lost to Olympic hockey teammate Ken Morrow and the New York Islanders. After retiring from hockey, Christoff went to work for Endeavor Air as an airline pilot.\n\nJohn Harrington, Right Wing Born: May 24, 1957 (Virginia, Minnesota) High school: Virginia High School (Virginia, Minnesota) College: University of Minnesota-Duluth\n\nCareer Highlights: John Harrington NHL career: None Career highlights: NCAA Frozen Four (1984, as head coach)\n\nWhat Happened Next: John Harrington John Harrington was an underdog all the way. He started as a walk-on at the University of Minnesota-Duluth and eventually made the 1980 Olympic roster. Harrington was credited with an assist on Mike Eruzione's game-winning goal in the semifinal win over the Soviet Union. Undrafted by the NHL, Harrington played for the U.S. again in the 1984 Olympics. He was a college assistant for several years before he became head coach at Saint John's University in Collegeville, Minnesota, where he coached for 15 years.\n\nSteve Janaszak, Goaltender Born: Jan. 7, 1957 (Saint Paul, Minnesota) High school: Hill-Murray School (Saint Paul, Minnesota) College: University of Minnesota\n\nCareer Highlights: Steve Janaszak NHL career: Minnesota North Stars (1979-80), Colorado Rockies (1981-82) Career highlights: NCAA champion (1979), NCAA Tournament Most Valuable Player (1979), IHL Rookie of the Year (1981)\n\nWhat Happened Next: Steve Janaszak Steve Janaszak was the MVP of the 1979 NCAA tournament after he led the University of Minnesota to the national championship and was the backup to Jim Craig on the 1980 U.S. Olympic team, where he was the only player on the roster who did not play in the Olympics. Janaszak played four seasons of professional hockey after winning the gold medal, including two in the NHL, then became an investment banker in New York after his career was over.\n\nJack O'Callahan, Defenseman Born: July 24, 1957 (Charlestown, Massachusetts) High school: Boston Latin School (Boston, Massachusetts) College: Boston University\n\nCareer Highlights: Jack O'Callahan NHL career: Chicago Blackhawks (1982-87), New Jersey Devils (1987-89) Career highlights: NCAA champion (1978), NCAA Tournament Most Valuable Player (1978),\n\nWhat Happened Next: Jack O'Callahan Jack O'Callahan starred at Boston University and injured his knee in the 1980 Olympic opener agains Sweden, but returned to play in the \"Miracle on Ice\" game against the Soviet Union. O'Callahan played seven seasons in the NHL, mostly for the Chicago Blackhawks, then went into financial services in Chicago following his retirement from hockey.\n\nMark Pavelich, Center Born: Feb. 28, 1958 (Eveleth, Minnesota) Died: March 4, 2021, 63 years old (Sauk Centre, Minnesota) High school: Eveleth High School (Eveleth, Minnesota) College: University of Minnesota-Duluth\n\nCareer Highlights: Mark Pavelich NHL career: New York Rangers (1981-86), Minnesota North Stars (1986-87), San Jose Sharks (1991-92) Career highlights: All-WCHA (1979), All-WHCA West All-American (1979)\n\nWhat Happened Next: Mark Pavelich Mark Pavelich was the son of Croatian immigrants and starred at Eveleth High School before staying close to home to play college hockey for the University of Minnesota-Duluth. Pavelich, who had the assist to Mike Eruzione on the game-winning goal against the Soviet Union, lived a life marked by tragedy. When he was 18 years old, he accidentally killed his 15-year-old friend in a hunting accident. In 1994 his second wife, Kara Burmachuk, died after accidentally falling from the a balcony on the second floor of their home. Pavelich auctioned off his gold medal for approximately $263,000 in 2014. He was arrested in 2019 for assaulting a neighbor and possession of firearms. Ruled incompetent to stand trial, he was committed to a mental health facility, where he committed suicide on March 3, 2021. He was 63 years old.\n\nBuzz Schneider, Left Wing Born: Sept. 14, 1954 (Grand Rapids, Minnesota) High school: Babbitt High School (Babbitt, Minnesota) College: University of Minnesota\n\nCareer Highlights: Buzz Schneider NHL career: None Career highlights: NCAA champion (1974)\n\nWhat Happened Next: Buzz Schneider Buzz Schneider was the oldest player on the 1980 Olympic hockey team. It was actually his second Olympics after playing for the U.S. in 1976. At the 1980 Olympics, Schneider was part of the famous \"Coneheads\" line with Mark Pavelich and John Harrington. In seven games on the way to winning the gold medal, Schneider scored five goals and had three assists. After Schneider retired from hockey in 1983, he was a sales executive for a semi-trailer company in Minnesota before going into real estate. In the 2004 Disney film \"Miracle,\" he was portrayed by his son, Billy.\n\nEric Strobel, Right Wing Born: June 5, 1958 (Rochester, Minnesota) High school: Mayo High School (Rochester, Minnesota) College: University of Minnesota\n\nCareer Highlights: Eric Strobel NHL career: None Career highlights: NCAA champion (1979)\n\nWhat Happened Next: Eric Strobel Eric Strobel was one of the many players from the University of Minnesota's 1979 national championship team to play on the 1980 Olympic hockey squad. He had a short professional career end when he broke his ankle playing on the Buffalo Sabres' top farm club. Strobel's father, Art Strobel, played for the New York Rangers.\n\nBob Suter, Defenseman Born: May 16, 1957 (Madison, Wisconsin) Died: Sept. 9, 2014, 57 years old (Middleton, Wisconsin) High school: Madison East High School (Madison, Wisconsin) College: University of Wisconsin\n\nCareer Highlights: Bob Suter NHL career: None Career highlights: NCAA champion (1977), All-WHCA (1979)\n\nWhat Happened Next: Bob Suter At only 5-foot-9 and 180 pounds, Bob Suter didn't look the part, but he was the closest thing the 1980 Olympic team had to an enforcer. He earned the reputation while winning a national championship at the University of Wisconsin and setting the school record for penalty minutes in 1979. Suter was the first player off the 1980 Olympic team to die when he had a fatal heart attack at the Capitol Ice Arena in Middleton, Wisconsin, in 2014. The arena was eventually named after him. Suter's brother, Gary Suter, played in the NHL from 1985 to 2002 and Bob's son, Ryan Suter, has played in the NHL since 2004.\n\nPhil Verchota, Left Wing Born: Dec. 28, 1956 (Duluth, Minnesota) High school: Duluth East High School (Duluth, Minnesota) College: University of Minnesota\n\nCareer Highlights: Phil Verchota NHL career: None Career highlights: Two-time NCAA champion (1976, 1979)\n\nWhat Happened Next: Phil Verchota Phil Verchota was a football and hockey star at Duluth East High School. He was good enough that he had scholarship offers from the University of Minnesota in both sports. The aspiring defensive tackle decided to ditch football and won a pair of national championships playing for Herb Brooks with the Gophers before making the 1980 Olympic team and winning the gold medal. He returned as the U.S. captain at the 1984 Olympics. Verchota retired from hockey after the 1984 Olympics and went into banking, where he eventually became president of First American Bank in Willmar, Minnesota.\n\nMark Wells, Center Born: Sept. 18, 1957 (St. Clair Shores, Michigan) High school: Lake Shores High School (St. Clair Shores, Michigan) College: Bowling Green State University\n\nCareer Highlights: Mark Wells NHL career: None Career highlights: Two-time All-CCHA (1977, 1979)\n\nWhat Happened Next: Mark Wells Mark Wells was one of two players from Bowling Green to make the 1980 Olympic team, alongside star defenseman Ken Morrow. He played two seasons of minor league hockey after winning the gold medal but never played in the NHL. Following his hockey career, Wells went to work in the restaurant industry. He suffered a catastrophic injury unloading crates that fractured his spine. After surgery, he wasn't able to work again. Wells was forced to sell his gold medal to a collector in 2010 for $40,000 to pay for living expenses. It was immediately turned around and sold for $310,000 at an auction.\n\nJim Craig, Goaltender Born: May 31, 1957 (Easton, Massachusetts) High school: Oliver Ames High School (Easton, Massachusetts) College: Boston University\n\nCareer Highlights: Jim Craig NHL career: Atlanta Flames (1979-80), Boston Bruins (1980-81), Minnesota North Stars (1983-84) Career highlights: NCAA champion (1978), NCAA All-American (1979)\n\nWhat Happened Next: Jim Craig After Mike Eruzione, goaltender Jim Craig is perhaps the most well-known player from the 1980 Olympic team. His heroic performance in the semifinals and finals went down as one of the best performances by a goalie in Olympic history. Craig played three seasons in the NHL and was charged with \"driving to endanger\" after a crash on a rural Massachusetts highway left one woman dead and another critically injured in 1982. He was eventually found not guilty after waiving his right to a jury trial and going directly before a judge.\n\nMike Eruzione, Left Wing Born: Oct. 25, 1954 (Winthrop, Massachusetts) High school: Winthrop High School (Winthrop, Massachusetts) College: Boston University\n\nCareer Highlights: Mike Eruzione NHL career: None Career highlights: IHL Rookie of the Year (1978), IHL Turner Cup champion (1978)\n\nWhat Happened Next: Mike Eruzione The most famous player on the 1980 U.S. Olympic hockey team, team captain Mike Eruzione was once described by Ringer podcast host Bill Simmons as \"America's houseguest.\" It was an apt description of the Massachusetts native and former Boston University star who scored the game-winning goal against the Soviet Union. Eruzione played one season in the IHL and one season in the AHL before the Olympics, but went undrafted by the NHL and never played professionally after the gold medal. What has Eruzione done since 1980? Mostly he's made a career out of being Mike Eruzione.\n\nCraig Patrick, Assistant General Manager/Assistant Coach Born: May 20, 1946 (Detroit, Michigan) Career highlights: Olympic gold medal (1980), Olympic silver medal (2002)\n\nWhat Happened Next: Craig Patrick Craig Patrick played eight seasons in the NHL and was still competing for the U.S. into his mid-30s before retiring in 1979, when he moved into administration and coaching. He was the assistant general manager for U.S. hockey and the assistant coach for the 1980 Olympic team. Patrick was the youngest general manager in New York Rangers history before becoming the general manager of the Pittsburgh Penguins in 1989, winning two Stanley Cup championships with the team. In a crazy twist, Patrick is one of seven family members who have won Stanley Cups as players, coaches or administrators.\n\nWalter Bush, General Manager Born: Sept. 25, 1929 (Minneapolis, Minnesota) Died: Sept. 22, 2016, 86 years old (Minneapolis, Minnesota) Career highlights: U.S. Hockey Hall of Fame (1980), Hockey Hall of Fame (2000), IIHF Hall of Fame (2009)\n\nWhat Happened Next: Walter Bush Walter Bush was a builder. He helped build the Central Hockey League, was key in bringing the NHL to Minnesota with the Minnesota North Stars, and was the president of U.S. Hockey for two decades, bringing Herb Brooks in to coach the 1980 U.S. Olympic team. He also was instrumental in adding women's hockey to the U.S. roster of Olympic sports. Bush died in 2016, at 86 years old.\n\nAl Michaels, Broadcaster Born: Nov. 12, 1944 (Brooklyn, New York) Career highlights: Five-time Sports Emmy Award winner - Outstanding Sports Personality, three-time NSMA National Sportscaster of the Year, Walter Cronkite Award for Excellence in Journalism, Hollywood Walk of Fame, Television Academy Hall of Fame, Pro Football Hall of Fame Pete Rozelle Radio & Television Award (2013), Baseball Hall of Fame Ford C. Frick Award (2021)\n\nWhat Happened Next: Al Michaels Al Michaels is one of the most famous sports broadcasters of all time and called his seventh Super Bowl in 2022. None of that sentence happens without the 1980 Olympics. Michaels was the voice of the iconic broadcasting moment when the Americans beat the Soviet Union in the semifinals.\"Do you believe in miracles?! Yes!\" We've been lucky to have those velvety pipes in our lives ever since.\n\nHerb Brooks, Head Coach Born: Aug. 3, 1937 (Saint Paul, Minnesota) Died: Aug. 11, 2003, 66 years old (Forest Lake, Minnesota) Career highlights: Olympic gold medalist (1980), Olympic silver medalist (2002), three-time NCAA national champion (1974, 1976, 1979)"}, {"url": "https://www.psucollegian.com/sports/wrestling/penn-state-wrestling-all-time-team-who-are-the-best-wrestlers-since-1998/article_68238b24-c45a-11ea-91af-abe8094837cd.html", "page_content": "A program as storied as Penn State's has produced some of the top wrestlers in NCAA history, especially in the last 10+ years under Cael Sanderson.\n\nAnd while the Nittany Lions have enjoyed a dominant and seemingly unparalleled run of success in the Sanderson era, to not recognize some of the program's other greats pre-Sanderson would be doing a disservice to the totality of the program.\n\nThe NCAA's current 10 weight classes have been in effect since the 1998 season when the previous weight classes all got bumped up by seven pounds.\n\nIn part one of this series, we'll look at the best Penn State wrestlers at each weight class since 1998:\n\n125 pounds: Nico Megaludis\n\nPenn State has failed to produce an All-American at 125 pounds since Nico Megaludis won a national title in 2016.\n\nThe Murrysville, Pennsylvania, native ranks 14th all-time in Penn State history in wins and was a four-time All-American, three-time finalist and an NCAA champion — making him an easy choice here.\n\n133 pounds: Josh Moore\n\nPenn State has had some key contributors at 133 during the Sanderson era, notably Jimmy Guilbon and Andrew Long — who were both integral to Penn State winning team titles.\n\nBut it's Josh Moore who takes up the mantle as the preeminent 133-pounder of the last 20+ years.\n\nMoore, current Cleveland State head coach, is third all-time in Penn State history in wins with 146, third all-time in falls with 53 and was a two-time All-American and former NCAA runner-up at 133 pounds in 2004.\n\nMORE WRESTLING COVERAGE\n\n141 pounds: Nick Lee\n\nWhile 125 pounds has given Penn State the most trouble recently, historically the Nittany Lions have struggled most at 141 pounds, crowning just six All-Americans at that weight since 1998.\n\nBut rising senior Nick Lee has been a bright spot for Cael Sanderson at the weight.\n\nLee is a two-time All-American, taking fifth place both his freshman and sophomore year and went 20-1 this past season before the season got cut short due to the coronavirus pandemic. Lee also boasts a career record of 84-12 through three seasons in Happy Valley.\n\n149 pounds: Zain Retherford\n\nAffectionately dubbed \"The Zain Train,\" Zain Retherford was a force for Penn State all four years he was in the lineup.\n\nThe Benton, Pennsylvania, native, captured three NCAA titles at 149 pounds and holds the program record for most consecutive wins with 93. He also won two Hodge Trophies for his exploits in a blue and white singlet and ranks seventh all-time in wins in program history.\n\n157 pounds: Jason Nolf\n\nOne of the most dominant wrestlers in Penn State history, Jason Nolf recorded bonus point wins in 86.6% of his matches, second all-time to only David Taylor.\n\nNolf is also the program's all-time leader in falls with 60 and took home three NCAA and two Big Ten titles for the Nittany Lions. Boasting a career record of 117-3, Nolf's 97.5 winning percentage is fifth all-time.\n\n165 pounds: David Taylor\n\nDavid Taylor is one of the most decorated wrestlers in program history by nearly every metric.\n\nThe two-time NCAA champion and four-time NCAA finalist is the program's all-time leader in bonus point wins, bonus point percentage and is tied for first in career winning percentage.\n\nThe 2018 world champion at 86 kg, Taylor also ranks sixth all-time in wins and took home two Hodge trophies for his efforts.\n\n174 pounds: Mark Hall\n\nMark Hall's main competition here was fellow three-time All-American and national champion Matt Brown, but it's Hall who has the slight edge.\n\nHall made history when he and Vincenzo Joseph became the first freshmen in Penn State history to capture NCAA titles and continued to be a tremendous asset for Sanderson ever since.\n\nWith his senior season cut short due to the coronavirus, Hall finished with three Big Ten titles, three trips to the NCAA finals and is sixth in program history in pins.\n\n184 pounds: Ed Ruth\n\nEd Ruth had stiff competition in recent graduate and fellow two-time NCAA champ at 184 pounds, Bo Nickal, but the edge went to Ruth by a slim margin.\n\nNow enjoying a career as an MMA fighter, Ruth first left his mark as Penn State's preeminent 184-pounder.\n\nA two-time NCAA champion at 184 pounds and Penn State's all-time leader in winning percentage, Ruth put together a career 136-3 record, won four Big Ten titles and is sixth all-time in program history with 46 career pins and is fifth all-time in wins.\n\n197 pounds: Phil Davis\n\nBo Nickal's third and final NCAA title came at 197 pounds and his impact on Penn State's program can't be understated.\n\nBut, Phil Davis spent his entire career at 197 pounds and won two Big Ten titles at the weight and an NCAA title en route to 116 career victories.\n\nAlso currently an MMA fighter, Davis was a four-time All-American at 197 and two-time NCAA finalist and ranks in the top-20 all-time in bonus point wins and career wins.\n\nHeavyweight: Anthony Cassar\n\nAnthony Cassar's story and rise was well documented, going from battling injuries to being locked in a roster battle to eventually winning an NCAA title his senior year, his first and only as a full-time starter.\n\nThough he's got the smallest sample size of anyone on this list, the Rocky Hill, New Jersey, native became the first Penn State heavyweight to win an NCAA title since Kerry McCoy in 1997 and finished with a career record of 49-3, good for a 94.2 winning percentage, the eighth best in program history.\n\nHe also took home the 2019 Big Ten title at heavyweight.\n\nMORE SPORTS COVERAGE\n\nNFL Fantasy Football | Which former Penn State players should you draft? A number of former Penn State players have made their impact once reaching the NFL and many …"}]}