{"Tetsuzō Iwamoto as the first professional Go player to reach the rank of 9 dan.": [{"url": "https://airpowerasia.com/2020/08/16/japanese-zero-fighter-air-ace-tetsuzo-iwamoto-tiger-tetsu-94-aerial-victories-greatest-japanese-fighter-ace-of-all-time/", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He joined the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during WWII, credited with at least 94 aerial victories including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. He was Nicknamed Zero Fighter Ace Kotetsu “Tiger Tetsu”.\n\nImage Source: snappygoat.com\n\nIn late 1943, Iwamoto’s air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids. Subsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nBattle of Rabaul (1942). Map depicting eastern New Guinea and New Britain. Image Source: Wikipedia\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Tetsuzo Iwamoto was one of the greatest air aces of the Imperial Japanese Navy. During his career, as per his personal records in his diary he is supposed to have achieved 242 air victories, 14 in China, 202 confirmed in the Pacific, 26 shared victories and 27 unconfirmed victories. He is supposed to have damaged two planes and destroyed two on the ground. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 87. Irrespective of the scoring system, Tetsuzō Iwamoto was the Japan’s top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS through the war. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, claimed of 202 Allied aircraft destroyed.\n\nSecond From the Right. Image Source: ameblo.jp.\n\nYoung Days\n\nTetsuzo was the third son of the Iwamoto family, born on a border town, southern part of Karafuto (now Sakhalin, Russia) on 15 June 1916. His father was a chief police officer. Later he grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo. When he was 13, his father retired and Tetsuzo moved with his family to his father’s hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored very high. Whilst he was a gifted student both academically and physically, his popularity with his teachers was poor due to his insubordinate, rebellious and sometimes outright rude nature. He was otherwise an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He was regarded as the most opinionated student in his school, and often talked down his teachers in discussions, which was considered impolite.\n\nShimane Prefecture Japan. Image Source: Wikipedia\n\nChooses a Military Career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nTetsuzo iwamoto sunglass. Image Source: snappygoat.com\n\nGets Enrolled For Flight Training\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sojyu-Renshusei flight trainee program for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th in December of that year.\n\nIn April 1936, he was sent to Kasumigaura-Ku as a probationer. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku his fighter course instructor was the famous Chitoshi Isozaki.\n\nImperial Japanese Navy (IJN) Air Ace Chitoshi Isozaki, 12 Victories. Image Source: Wikipedia\n\nJoins Naval Air Group\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai Naval Air Group, which was based both at land and onboard a carrier, for 6 months of advanced training. After this he joined Omura Kōkūtai on July 16, 1937 for operational training. He had tough training there from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa, who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto had to wait for operational debut till February 10, 1938.\n\nChina Front\n\nThe Second Sino_japanese war was already on. After combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan, ferrying to the airfield outside of Nanjing China. Tetsuzo’s ability as a fighter pilot was recognized by all on his first air mission with his squadron, the 13th Flying Group on February 25, 1938, over Nanchang, China. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nNanchang Dajiaochang Airport, China. 800 m Runway in 1938. Image Source: Wikipedia\n\nFirst Combat Mission – Four Victories\n\nOn February 25, 1938, his squadron’s fighters escorted bombers Type 96 land-based attack aircraft. 16 Chinese fighters attacked the formation, and the squadron’s leader Lieutenant Takuma was lost on this mission. Iwamoto described his first combat in his notes. During the escort mission, the squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nMitsubishi G3M Type 96 Bomber Aircraft. Image Source: alchetron.com\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o’clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o’clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nPolikarpov I-15 Soviet biplane fighter aircraft. Image Source: Wikipedia\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nOne the left, Back Row. Image Source: snappygoat.com 2\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His section leader Kuroiwa with whom he had separated had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nSoviet Polikarpov I-16 the world’s first low-wing cantilever monoplane fighter with retractable landing gear. Image Source: Wikipedia\n\n13th and 12th Flying Groups Merge\n\nOn 22 Mar 1938, the 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called “Red legs squadron” while 2nd Chutai had gear painted in blue and were called “Blue legs squadron“. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force.\n\nMITSUBISHI A5M4 Type 96 Carrier fighter (Allies called “CLAUDE”). Image Source: craymond.no-ip.info\n\nIwamoto Becomes Top IJNAS Ace in China\n\nBy Sep 1938, he had completed 82 missions, and had 14 kills on his records and had become the top Japanese IJNAS ace. His activities subsequently earned him “Order of the Golden Kite – 5th class” recommendation in 1940. In September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nJapanese Order of the Golden Kite, 5th Class. Image Source: warthunder.com\n\nPacific War – Pearl Harbour & Carol Sea\n\nAfter a tour as an instructor, Petty Officer First Class Iwamoto returned to the front line onboard the carrier Zuikaku, now flying the legendary A6M ‘Zero’ fighter. Iwamoto was airborne for the day of infamy – the attack on Pearl Harbor – but flew air cover over the carrier group itself rather than escorting the actual raid. Iwamoto was heavily involved in the air war in the Pacific from the outset, regularly leading flights of A6Ms against their American, British and Australian counterparts. Iwamoto flew in the violent air engagements of the Battle of the Coral Sea in May 1942, during which Zuikaku’s air group suffered significant losses. This necessitated a return to Japan for resupply and to train replacement aircrew which resulted in Iwamoto and his comrades missing the Battle of Midway. Small team in Japan who frantically tried to train new aircrew to stem the advancing allies.\n\nLegendary A6M ‘Zero’ fighter. Image Source: warthunder.com\n\nRabaul, New Britain\n\nAfter a year of instructional duties, Chief Petty Officer Iwamoto returned to the front line and joined the 253rd Air Group, flying A6Ms from Rabaul, New Britain, in November 1943. Involved in daily air combat, the experienced fighter leader led his cadre of increasingly junior and less experienced pilots against the might of the US Navy and USAAF. Whilst operating from Rabaul, Iwamoto filed claims for a staggering 142 enemy aircraft shot down.\n\nCaroline Islands. Image Source: Wikipedia\n\nCaroline & Philippine Islands\n\nAfter withdrawing from Rabaul, Iwamoto returned to Japan in June 1944 for a brief respite from the front line, before fighting in the skies over Formosa, then transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands during autumn and the winter. In November 1944 Iwamoto’s skill and leadership were further recognised when he was commissioned as an officer in the ranks of the Japanese Navy, holding the rank of Ensign. Iwamoto’s last operational sorties were flown with the 203rd Air Group, defending Kyushu and Okinawa in the furthest Southwest reaches of Japan against the long ranged B-29 attacks and the might of the US Navy’s carrier borne air power. The last few months of Iwamoto’s war were spent training kamikaze pilots at Iwakuni airfield on Honshu island.\n\nChiran high school girls wave farewell with cherry blossom branches to departing kamikaze pilot. Image Source: Wikipedia\n\nTactics\n\nHe was best at one-vs-one dogfights. He often employed, quick roll tactic combining with skidding sideway for sudden deceleration within 1/2 quick roll to make the opponent on the tail to overshoot. Corkscrew loop (Hineri-Komi Senpō) was a short-cut or twist-in loop tactic, also called the skidding loop. He had also mastered the High and Low Yo-yo manouvres (Suichoku-Senkai Kasoku Senpō). His favourite formation tactics, was a two group linked formation attack, where one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in a formation.\n\nLow Yo-yo. Image Source: Wikipedia\n\nAttacking the opponent formations after their mission was over and they were on the way to the regroup point, to fly back across the distance range over the sea. This tactics was taken when his own group had much fewer aircraft. Aerial Bomb attack tactic, was a twelve o’clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō). It was almost vertical diving (about 60 degree) attack because the 30 kg aerial bomb needed the releasing speed over 280 knots to work timer correctly for the explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its high flight stability.\n\n\n\nFlight leader Masao Sato with his pilots aboard Zuikaku, 6 Dec 1941, one day before Pearl Harbour Attack; Tetsuzo Iwamoto second row, right-most. Image Source: ww2db.com\n\nAnother tactic that Japanese often employed was called “Send Wolf “, which essentially meant first sending a strike against US targets, and then attacking those US aircraft that got airborne after the base had been attacked by surprise. He was very good at using the 30 kg No. 3 Aerial Bomb, which was difficult to handle, although it was used against aircraft, and caused great damage.\n\nJapanese Type 99 30kg High-explosive bomb. Image Source: commons.wikimedia.org\n\nAerial Victories Claimed in His Diary\n\nHis own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2. 94 victories is what has been assigned to him.\n\nVought F4U Corsair. Image Source: Wikipedia\n\nHe had claimed seven victories against Grumman F4F Wildcat (Coral Sea, 8 May 1942, and at Rabaul, late 1943; 19 February 1944 the escort fighters of Martin flying boat). His claimed four Lockheed P-38 Lightning P-38 victories, at – 4 (Rabaul, late 1943 – 1944). 48 victories against Vought F4U Corsair, plus one unconfirmed. These were at Rabaul, Mobara-airbase outskirts of Tokyo, during Operation Kikusui, Okinawa, March 10 – June 24, 1945). This was more than 1 in 4 of all F4U air-to-air losses during the Second World War. He claimed two Bell P-39 Airacobra at Rabaul in late 1943. He claimed one Curtiss P-40 Warhawk at Rabaul, late 1943. He also claimed 39 Grumman F6F Hellcat victories, that included 29 (at Rabaul late 1943 – Feb 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945). He claimed one Republic P-47 Thunderbolt victory over Rabaul, late 1943 – 1944. He claimed one North American Aviation P-51 Mustang over Rabaul, on 19 February 1944, the Allied 2nd air-raid of the day. He claimed to have shot four British Spitfire burned on the ground, two shot over Indian Ocean on 9 April 1942. He claimed 48 US Navy’s Douglas SBD Dauntless with seven unconfirmed, (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944). He also reportedly shot down 30 Douglas SBD Dauntless using No.3 Aerial Bombs over Rabaul, in late 1943 – 1944. He claimed five Grumman TBF Avenger, with 19 uncofirmed. These were at Rabaul, late 1943 to February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul. He claimed five Curtiss SB2C Helldiver at Rabaul late 1943 to early 1944). He also claimed five North American B-25 Mitchell medium bombers at Rabaul, starting late 1943 to 19 February 1944, during the Allied 4th air-raid of the day. He claimed two Martin B-26 Marauder American twin-engined medium bomber at Rabaul. He claimed six Consolidated B-24 Liberator heavy bombers using No. 3 Aerial Bombs and damaged two at Truk, reportedly confirmed by ground crew. He claimed one Boeing B-29 Superfortress four-engine propeller-driven heavy bomber at Kagoshima, Kyushu, Japan, April 1945. He claimed a PBY5A flying boat over Indian Ocean on April 5, 1942. He reportedly shot a Martin Mariner flying boat victory at Rabaul, on 19 February 1944. This aircraft was escorted by 12 F4Fs. He strafed three Destroyers on the night of February 5, 1944. He strafed many Landing crafts at Kerama islands, Okinawa, on night March 26, 1945. He strafed airfields Lae, Eastern New Guinea, on January 23, 1942, and Torokina, Bougainville, Solomons, on night 1944.\n\nUS Navy’s Douglas SBD Dauntless Dive Bomber. Image Source: blenderartists.org\n\nAir Kills Debate – Yet Greatest Japanese Fighter Ace of All Time.\n\nIwamoto’s final number of kills remains open to debate. A combination of the Japanese practice of crediting victories to a squadron rather than an individual, lost records and discrepancies between the confirmation process in Japan and allied nations mean that the final tally will never be known. Most sources officially credit Iwamoto with 80 kills in WW II plus 14 in China, his war diary claims 202 individual victories, 26 shared and 22 unconfirmed. An outspoken, opinionated and brash man on the ground, Iwamoto was conversely a tactically minded and cool headed aviator who favoured hit and run tactics over dog-fighting. There is a very good chance that he was, and forever will be, the greatest Japanese fighter ace of all time.\n\nZero Fighting Tiger. Image Source: snappygoat.com\n\nThe “Zero Fighting Tiger”\n\nTetsuzo had reportedly flown 8,000 hrs by March 1944. He was an operational leader, cleared for solo fighter reconnaissance and attack mission across night and over ocean. He was cleared for night carrier operations. It is believed that his aircraft in the Rabaul days was dyed in pink with more than 60 shot-down marks and was well known. The nickname is the strongest Zero Fighter pilot . Also, he seems to call himself Zero Fighting Tiger .\n\nThe Kill Marks. Tetsuzo Iwamoto’s 53-102. Single cherry = fighter, Double cherry = bomber. Art Work: Fuku. Image Source: ww2aircraft.net\n\nPromotions\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nImperial Japanese Navy Ensign Shoulder Boards\n\nAwards\n\nOrder of the Golden Kite, Fifth Class – August 1, 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal – Seventh Class – August 1, 1942\n\nRising Sun, Green Paulownia Leaves Medal – Seventh Class. Image Source: http://www.worthpoint.com\n\nPost-war life\n\nIwamoto was promoted to Sub-Lieutenant on his enforced retirement from the Japanese Navy following his nation’s surrender. The Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur’s Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\n253 Ku at Truk, 29 April 1944. Front row, extreme left, Tetsuzo Iwamoto. Image Source: http://www.tumblr.com\n\nHis wife knew him as a “wartime ace pilot”, and in fact was a fan who later married through matchmaking agency. He very methodically kept all records. Japanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (“The Truth Is This”). The program considered people such as Iwamoto the cat’s-paws of militarism. Iwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan. In 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to “Daiwabō” Co., Ltd).\n\nDeath Due Medical Complications\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis. Iwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: “When I get well, I want to fly again.”\n\nMitsubishi A6M Zero\n\nA light and nimble fighter, the Mitsubishi A6M Zero was the first carrier based fighter capable of besting its land based opponents, and was Japan’s main fighter of WWII. The Zero’s design sacrificed protection for speed, maneuverability, and long range, on the theory that superior speed and maneuverability were protections in their own right, with long range an added bonus. The A6M came as a shock to Allied pilots when first encountered, because it could outmaneuver every airplane it faced at the time. A better dogfighter than anything the Allies had at the start of the Pacific War, the Zero’s superior performance, especially in the hands of Japan’s elite naval aviators, exceeded anything the Allies had hitherto expected from the Japanese. In the war’s early days, Japanese naval aviators flying Zeroes achieved a 12:1 kill ratio.\n\nMitsubishi A6M Zero. Image Source: aviation-history.com\n\nTo counter the Zero’s advantages, American pilots adopted team work tactics such as the “Thach Weave” which required pilot pairs to work in tandem, or the “Boom and Zoom”, in which American pilots engaged the Zero only in diving attacks, as the acceleration of their heavier planes in a dive allowed them to flee if the diving attack failed. While holding considerable advantages in maneuverability and speed, the Zero’s lack of protection for either the pilot or the fuel tanks proved a steadily mounting disadvantage as the war progressed, since the heavier and more rugged American fighters could absorb considerable punishment from Zeroes, while a single machine gun burst from the American plane could disintegrate a Zero.\n\nGrumman F6F Hellcat. Image Source: warhistoryonline.com\n\nBy 1943, attrition had thinned the ranks of Japan’s elite aviators, and the Japanese Navy’s training pipeline could not produce enough replacements of similar caliber. As a result, there were fewer and fewer Japanese pilots capable of extracting the most out of the Zero’s advantages while minimizing its disadvantages. Which was bad news for the Japanese, as the quality of American aviators was increasing, due to wartime experience as well as an extensive training program that produced capable aviators at a rate Japan could not match. That was exacerbated by the introduction of new American fighters, such as the F4U Corsair and the F6F Hellcat, that were a significant improvement over their predecessors, and proved more than a match for the Zero, with greater firepower, armor, speed, and similar maneuverability.\n\nImage Source: cs.finescale.com\n\nBy 1944 the Zero was rapidly becoming obsolete, but it remained in front line service because the Japanese faced production difficulties in fielding a replacement. From its heyday at war’s beginning when it ruled the skies of the Pacific while flown by elite pilots, A6Ms were reduced by war’s end to flying kamikaze missions under the controls of barely trained novices.\n\nList of Japanese Navy Air Force aces Mitsubishi A6M “Zero”\n\nThis is a list of Imperial Navy Air aces flying the Mitsubishi Zero fighter during the Pacific War.\n\nTetsuzo Iwamoto: 94 (including 14 in China / personal diary accounts for a total of 202 kills)\n\nShoichi Sugita: 70 (some sources say 80)\n\nSaburō Sakai: 64 (2 in China)\n\nTakeo Okumura: 54 (4 in China)\n\nHiroyoshi Nishizawa: 36 official (102 claimed)\n\nToshio Ohta: 34\n\nKazuo Sugino: 32\n\nJunichi Sasai: 27\n\nSito Origami: 10 (9 in China, 1 disputed)\n\nToshiyuki Sueda: 9\n\nShōichi Sugita. Second Highest Japanese Ace. Image Source: wikidata.org\n\nFamous Japanese Units\n\nThe air unit “Kōkūtai” (air group) with most air aces, was the Tainan Kōkūtai (in Formosa). It was the most famous group. They operated from Rabaul, New Britain and acquired their legendary fame over Taihoku (The Philippines), the Dutch East Indies, Lae and Buna (New Guinea) and, in the last stages of war, in defense of mainland Japan. Saburō Sakai was another member in this unit after Dutch Indies operations, from the Denpasar base on Bali.\n\nFighter pilots of the Tainan Air Group pose at Lae in June 1942. Several of these aviators would be among the top Japanese aces, including Saburō Sakai (middle row, second from left), and Hiroyoshi Nishizawa (standing, first on left). Image Source: Wikipedia\n\nOthers famous units with air aces were 3rd Air Corps (including Yoshiro Hashiguchi), 253rd Air Corps (with Tetsuzo Iwamoto and Hiroyoshi Nishizawa among its members), Genzan Air Group, and other groups.\n\nThe Imperial Japanese Navy Air Service, similar to the German Luftwaffe idea of organizing an “all aces” select unit Jagdverband 44 equipped with Messerschmitt Me 262A-1a jet fighters, decided to create an all-ace unit (the 343 Kōkūtai) with Kawanishi N1K2-J fighters towards the end of the conflict; this was commanded by Minoru Genda.\n\nKawanishi N1K2-J “343 A-15” of 301st Fighter Squadron/343rd Naval Air Group, Matsuyama air base, 10 April 1945. Image Source: Wikipedia\n\nInformation Source Credits: This Article has used information mostly from Wikipedia and other open sources. Credit is also given to Mark Barber, War Thunder Historical Consultant, a former pilot from the British Royal Navy’s Fleet Air Arm. Information was drawn from Historical Section of the War Thunder forums and the Ace of the Month series. Credit is also given to Peter Chen’s World War II Database (ww2db.com), and historycollection.com for coverage of top World War II fighters.\n\nLead Picture Credit: Wikipedia"}, {"url": "https://www.wikiwand.com/en/Tetsuz%C5%8D_Iwamoto", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively.[2]\n\nJapanese World War II flying ace\n\nQuick facts: Tetsuzō Iwamoto, Nickname(s), Born, Died, All... ▼\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.[3][4]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993, Izawa wrote that Iwamoto was virtually the top ace of the IJNAS.[5]\n\nAs of mid-1944, there remained only two IJNAS fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war.[6] Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed."}, {"url": "https://infogalactic.com/info/Tetsuz%C5%8D_Iwamoto", "page_content": "From Infogalactic: the planetary knowledge core\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō?) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever undertaken by the Imperial Japanese Navy Air Force against air raids mounted by U.S. and Allied air units.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by the U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata estimated the figure at about 80 or more than 87 in their research work in January 1971. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF, .[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the second world war. He fought over the Indian and the Pacific Ocean from north to south, and trained his young pilots even in the last months of the war.[5]\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron (2nd Chutai in had gear painted in blue amd were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flght hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF,[7] IJAAF[8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter renaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him.[10]) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him.[11]) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front.[12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nVictories\n\nChina Front, Feb.1938 - Sep.1938\n\n14 victories: I-15, I-16 (citation as the IJNAF top ace)\n\nWorld War II, Pacific Front and Indian Front, 8 December 1941 - 15 August 1945\n\n228 aerial victories: victories - 202 shared victories - 26\n\nunconfirmed - 27 damaged - 2 destroyed on the ground - 2\n\nAircraft types he confronted\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.[citation needed]\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nMovie"}, {"url": "https://peoplepill.com/people/tetsuzo-iwamoto/", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAS.\n\nAs of mid-1944, there remained only two IJNAS fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored As on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938, over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938, over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzō Iwamoto became the top IJNAS ace. His activities subsequently earned him Order of the Golden Kite – 5th class recommendation in 1940.\n\nIn September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAS Flight hours: over 8,000 hrs in March 1944 (net hours, not tripled as with a US single-seated fighter pilot. It was very unusual among IJNAS, IJAAS fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAS, IJAAS veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter reconnaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAS could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAS officer pilots could fly on instruments.\n\nTactics\n\nSingle to single dogfight tactic – from losing to winning\n\nQuick roll (Roll Senpō) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo Shibata promoted, his men developed and taught him.) Corkscrew loop (Hineri-Komi Senpō) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu Mochizuki's special, Section leader and Warrant Officer Toshio Kuroiwa trained him.) Yo-yo turn (Suichoku-Senkai Kasoku Senpō) (Lt. JG Sadaaki Akamatsu's special at China front. )\n\nFormation tactics –\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much fewer aircraft.\n\nNo.3 Aerial Bomb attack tactic –\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō) Almost vertical diving (about 60 degree) attack because the 30 kg No. 3 Aerial Bomb needs the releasing speed over 280 knots to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nAerial victories claimed in his diary\n\n(World War II, 8 December 1941 – July 1942, April 1943 – 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)\n\nF4F victories – 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 – 10AM 19 February 1944 the escort fighters of Martin flying boat)\n\nP-38 victories – 4 (Rabaul, late 1943 – 1944)\n\nF4U victories – 48; unconfirmed 1 (Rabaul, late 1943 – February 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water – divine wind), Okinawa, March 10 – June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories – 2 (Rabaul, late 1943)\n\nP-40 victory – 1 (Rabaul, late 1943)\n\nF6F victories – 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945)\n\nP-47 victory – 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory – 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) – 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories – 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944)\n\nSBD w/No.3 Aerial Bomb victories – 30 (Rabaul, late 1943 – 1944)\n\nTBF victories – 5; unconfirmed 19 (Rabaul, late 1943 – 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories – 5 (Rabaul, late 1943 – 1944)\n\nB-25 victories – 8 (Rabaul, late 1943 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories – 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories – 6; w/No. 3 Aerial Bomb victories (SH) 24, damaged 2 (Truk, 6 March – June 1944, confirmed by ground members)\n\nB-29 victory – 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory – (SH) 1 (Indian Sea, April 5, 1942)\n\nMartin Mariner flying boat victory – (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers – 3 (Rapopo Rabaul, Night February 5, 1944)\n\nStrafed Landing Craft – some hundreds (Kerama islands, Okinawa, night March 26, 1945)\n\nStrafed Airfields – Lae, Eastern New Guinea, January 23, 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nOrder of the Golden Kite, Fifth Class – August 1, 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal – Seventh Class – August 1, 1942\n\nPost-war life\n\nThe Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur's Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (\"The Truth Is This\"). The program considered people such as Iwamoto the cat's-paws of militarism.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan.\n\nIn 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to \"Daiwabō\" Co., Ltd, 大和紡績 ).\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis.\n\nIwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: \"When I get well, I want to fly again.\"\n\nMovie"}, {"url": "https://www.inaf-go.org/iwamoto/", "page_content": "Year Age Events\n\n1902 0 On February 5, 1902, Kaoru Iwamoto was born in Takatsu, Masuda City, Shimane prefecture.\n\n1905 3 Moved to Busan, Korea with his parents.\n\n1911 9 Learned Go from his father.\n\n1913 11 Returned to Japan to become a disciple of Hirose Heijiro 6-dan of Houensha in Tokyo.\n\n1917 15 Achieved 1-dan.\n\n1918 16 Visited China with Hirose Heijiro.\n\n1919 17 Achieved 2-dan.\n\n1920 18 Achieved 3-dan.\n\n1922 20 Achieved 4-dan.\n\n1923 21 Visited Taipei.\n\n1924 22 Nihon Kiiin was established and he joined it.\n\n1925 23 Achieved 5-dan.\n\n1926 24 Achieved 6-dan and visited China.\n\n1927 25 Married Karasawa Kikue.\n\n1929 27 Retired as a professional Go player and emigrated to Brazil.\n\n1931 29 Came back to Japan and resumed his Go career and visited China.\n\n1935 33 Elected to the board of directors of Nihon Ki-in. He won the Oteai, one of the most important tournaments in Japan at the time.\n\n1941 39 Achieved 7-dan, and became a permanent director of Kidouhoukokukai.(棋道報国会)\n\n1945 43 Became a permanent director of Nihon Ki-in.\n\nNihon Ki-in’s office was burned by bombing from the war, Iwamoto’s home became the temporary site of Nihon Ki-in.\n\nChallenged the third Honinbo match against Utaro Hashimoto in Hiroshima.\n\nThis match is famous as “The Atomic Bomb Go Game”. On this time, the match ended in a 3-3 draw.\n\n1946 44 The third Honinbo match was continued after the war and he won two straight games to take the Honinbo title. He assumed the name Honinbo Kunwa.\n\n1947 45 Defended the Honinbo title against Kitani Minoru at the fourth Honinbo match. He was instrumental in finding new headquarters of Nihon Kiin in Takanawa town.\n\n1948 46 Achieved 8-dan and became the president of Nihon Kiin in 1949.\n\n1950 48 Lost the Honinbo title, giving it back to Hashimoto Utaro.\n\n1952 50 Won the All Honinbo all 8-dan match against Kitani Minoru.\n\n1954 52 Became the first director of Nihon Kiin Chuo Kaikan (Nihon Kiin central hall)\n\n1955 53 Won the second NHK Cup.\n\n1959 57 Stayed in US for the 14th Honinbo league.\n\n1961 59 Stayed in US for a year to popularize Go.\n\n1962 60 Visited Europe to popularize Go.\n\n1967 65 Achieved 9-dan. He visited North and South America for 2 months to popularize Go. He was given a medal with a Purple Ribbon.\n\n1970 68 Visited South America and Europe for 2 months to popularize Go.\n\n1972 70 Visited South America and Europe for 2 months to popularize Go.\n\n1973 71 Given the medal of Kun-Santou Shiju Housho.\n\n1974 72 Became the vice chief director of Nihon Kiin.\n\n1975 73 Visited South America for a month to popularize “Go”.\n\n1978 76 His pupil, James Kerwin achieved sho-dan(1-dan), he is the first professional Go player from the West.\n\n1983 81 Retired in April.\n\n1987 85 Set up the Iwamoto Foundation with an initial contribution of 530 million yen and became an honorary citizen of Tokyo.\n\n1989 87 Was the main benefactor of Go centers in Sao Paulo (1989), Amsterdam(1992), Seattle and New York (1995)"}, {"url": "https://ww2db.com/person_bio.php?person_id=561", "page_content": "Home\n\n» People\n\n» Tetsuzo Iwamoto\n\n\n\n\n\nTetsuzo Iwamoto\n\nSurname Iwamoto Given Name Tetsuzo Born 15 Jun 1916 Died 20 May 1955 Country Japan Category Military-Air Gender Male\n\nContributor: C. Peter Chen\n\nww2dbaseTetsuzo Iwamoto was born in Karafuto Prefecture, Japan (now southern Sakhalin Island). He grew up in Sapporo, Hokkaido, Japan after his father was appointed the chief of police of that city. In 1929, his father retired, and the whole family moved to his father's home town, Masuda, Shimane Prefecture, Japan, where he studied at the Masuda Agricultural and Forestry High School. In 1934, upon graduating high school, he was sent to a large city to take the college entrance exams, but instead he applied for and passed the exam for the air arm of the Japanese navy. In 1936, he served aboard carrier Ryujo with the rating of mechanic 2nd class. He began flight training on 28 Apr 1936. On 1 Nov 1936, he was promoted to the rating of mechanic 1st class. On 26 Dec, he graduated from the program and was promoted to airman 1st class. He was assigned to the Saeki Air Group for six months of advanced training, and then was transferred to the Omura Naval Air Group on 16 Jul 1937.\n\nww2dbaseOn 10 Feb 1938, Iwamoto was transferred to the front lines as he flew from Omura Airfield near Nagasaki, Japan to Nanjing, China, thus beginning his career in WW2. With the 13th Flying Group's fighter squadron in China, his first combat mission took place on 25 Feb over Nanchang, China as he escorted Type 96 attack aircraft. The flight was attacked by 16 Chinese fighters. During the dogfight, Iwamoto claimed 3 confirmed and 1 probable kills, but was scolded after he returned for his overly-aggressive actions. On 22 Mar 1938, the 13th Flying Group's fighter squadron was merged with the 12th Fighter Squadron. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara. He was ordered back to Japan in Sep 1938; at this point, he had 14 kills on his records and was one of the aces among Japanese airmen in China.\n\nww2dbaseBack in Japan, Iwamoto served as a member of the Saiki Air Group as a trainer. In 1940, he was awarded the Order of the Golden Kite 5th Class. During the Pacific War, he was initially a pilot with the carrier Zuikaku from Dec 1941 to May 1942, during which time he participated in the Battle of the Coral Sea. In late 1943, he was sent to Rabaul, New Britain. In 1944, he was successively transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands. In Oct 1944, he was promoted to the rank of ensign. During the Okinawa Campaign, he participated in Operation Kikusui. His own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2.\n\nww2dbaseAfter the war, Iwamoto was summoned for several interviews and interrogations by the Allied administration. Although he was eventually cleared and thus not declared a war criminal, he was still unable to get a job due to potential employers wishing to please the occupation administration. In 1952, the Allied occupation gave control of Japan back to the Japanese people, and he was finally able to get a job at a local spinning mill. In the summer of 1953, he underwent a series of surgeries for enteritis (mis-diagnosed) and appendicitis (actual cause of stomach pains). Shortly after, he complained of back pains and received another surgery. He passed away in his home town of Masuda after getting septicemia after the final surgery. According to his wife, his last words were \"[w]hen I get well, I want to fly again\".\n\nww2dbaseSource: Wikipedia.\n\nLast Major Revision: Jan 2010\n\nTetsuzo Iwamoto Timeline\n\nPhotographs"}, {"url": "https://www.guinnessworldrecords.com/world-records/523455-first-ai-to-beat-a-9-dan-professional-go-player", "page_content": "Between 9–15 March 2016, a largely self-taught Go-playing AI called AlphaGo (developed by British AI developers DeepMind) defeated Lee Sedol (KOR) 4–1 in a five-game series. This is the first time a 9-dan professional (the highest rank in Go) has been defeated by a computer program of any kind.\n\nBefore AlphaGo, it was generally assumed that it would be a decade before computers could challenge skilled Go players, let alone beat 9 dan professionals. This is because Go is resistant to the sort of \"brute force\" analysis that had been employed by computers against games like tic-tac-toe and, most famously, chess.\n\nA brute-force game-playing program works by calculating every possible move in a given situation, then every possible response to it, then every possible response to that, and so on – often looking many moves ahead of the current state of play. It then applies a few relatively simple rules (considerations about the value of pieces or the importance of different sectors of the board, for example) to decide which of these possibilities to pick.\n\nThis is not a practical approach for Go because there are so many possibilities in any given situation – looking more than a move or two ahead would require the computer to calculate and assess an almost infinite number of potential outcomes.\n\nThe developers at DeepMind used a totally different approach called Deep Reinforcement Learning to create their Go-playing AI. AlphaGo was shown information about tens of thousands of past Go matches, which it then analysed using neural networks. One neural network decided where on the board to play based on moves used in winning games and the other evaluated how likely it would be to win based on that move. This meant that AlphaGo developed strategies it hadn’t seen in human games, performing moves that went against centuries of established Go wisdom. AlphaGo’s capacity for intuitive and creative play stunned many commentators. Speaking after his own defeat in May 2016, Ke Jie (the world's top ranked Go player at the time) remarked, \"After humanity spent thousands of years improving our tactics, computers tell us that humans are completely wrong... I would go as far as to say not a single human has touched the edge of the truth of Go.\""}, {"url": "https://alchetron.com/Tetsuz%C5%8D-Iwamoto", "page_content": "As of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nIwamoto was one of the highest-scoring Japanese aces. As a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II . This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines , being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō ) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China . Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea .\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAFFlight hours: over 8,000hrs on March 1944Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar)Instrument Flight: possibleNight Flight: possible\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning\n\nQuick roll (Roll Sempoh)Coke-screw loop (Hineri-Komi Sempoh)Yo-yo turn (Suichoku-Senkai Kasoku Sempoh)\n\nFormation tactics -\n\nTwo groups linked formation attackKeeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation.Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic -\n\nAerial victories claimed in his diary\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh)\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nOrder of the Golden Kite, Fifth Class - 1 August 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal - Seventh Class - 1 August 1942\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)"}, {"url": "https://www.geni.com/people/Tetsuz%C5%8D-Iwamoto/6000000190527516822", "page_content": "About Tetsuzō Iwamoto\n\nhttps://en.wikipedia.org/wiki/Tetsuz%C5%8D_Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively."}, {"url": "https://gambiter.com/go/players/Kaoru_iwamoto.html", "page_content": "Kaoru Iwamoto\n\nKaoru Iwamoto Full name Kaoru Iwamoto Kanji 岩本薫 Born February 5, 1902\n\nMasuda, Japan Teacher Hirose Heijiro Rank 9 dan\n\nKaoru Iwamoto (岩本薫 Iwamoto Kaoru, February 5, 1902 - November 29, 1999), also known as Honinbo Kunwa, was a Japanese professional Go player who achieved the rank of 9-dan.\n\nBiography\n\nIwamoto was born in Masuda of the Shimane prefecture, Japan. During his childhood he spent several years in Busan, Korea (1905-1913), where he learned Go from his father.\n\nHe returned to Japan to study Go, moved to Tokyo, and became a disciple of Hirose Heijiro 6-dan of Hoensha in 1913. He achieved 1-dan in 1917, and swiftly rose through the ranks. In 1924, when Nihon Ki-in was established, Iwamoto joined it and achieved 6-dan.\n\nHe retired as a professional Go player and emigrated to Brazil as a coffee farmer in 1929. However, he came back to Japan and resumed his career of Go after the failure of this venture in 1931.\n\nHe won the Oteai, the most important tournament in Japan at that time) in 1935. He challenged the third Honinbo match against Hashimoto Utaro in 1945. The second game of this match, played in the outskirts of Hiroshima, is famous as the atomic bomb go game. The players owed their lives to the fact that the local police had ordered the game moved from the center of Hiroshima. The match was continued after the war but ended in a 3-3 draw. A three-game playoff was held in 1946, Iwamoto won two straight games to take the Honinbo title. He assumed the name Honinbo Kunwa.\n\nAfter the war\n\nIwamoto's home was a temporary site for the Nihon Ki-in which was burnt out by the B29 bombing in 1945 and he was instrumental in finding new headquarters for the Nihon Ki-in.\n\nIwamoto defended the Honinbo title against Kitani Minoru in 1947, and in 1948 achieved 8-dan, becoming president of the Nihon Ki-in. He later lost the Honinbo title to Hashimoto Utaro in 1950. He won the NHK Cup in 1955.\n\nIwamoto traveled extensively throughout the West with the aim of spreading Go to Western people. He spent 18 months in 1961-1962 in New York, teaching and promoting Go. He achieved 9-dan in 1967, and had many disciples, including James Kerwin, the first Westerner to achieve professional status at the Nihon Ki-in.\n\nRetirement and later life\n\nIwamoto retired in April, 1983. In his later years he was the main benefactor to several European and American Go centers in London, São Paulo, New York, Seattle and Amsterdam, largely through setting up the Iwamoto Foundation in 1986, with an initial contribution of 530 million yen.\n\nHe is the author of three books in English, \"Go for Beginners\", \"Keshi and Uchikomi\" and \"The 1971 Honinbo Tournament\".\n\nSensei's Library profile\n\nBirthplace & museum of Kaoru Iwamoto\n\nCOMMENTS"}], "Tetsuzō Iwamoto was awarded the title of Honorary Meijin.": [{"url": "https://airpowerasia.com/2020/08/16/japanese-zero-fighter-air-ace-tetsuzo-iwamoto-tiger-tetsu-94-aerial-victories-greatest-japanese-fighter-ace-of-all-time/", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He joined the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during WWII, credited with at least 94 aerial victories including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. He was Nicknamed Zero Fighter Ace Kotetsu “Tiger Tetsu”.\n\nImage Source: snappygoat.com\n\nIn late 1943, Iwamoto’s air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids. Subsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nBattle of Rabaul (1942). Map depicting eastern New Guinea and New Britain. Image Source: Wikipedia\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Tetsuzo Iwamoto was one of the greatest air aces of the Imperial Japanese Navy. During his career, as per his personal records in his diary he is supposed to have achieved 242 air victories, 14 in China, 202 confirmed in the Pacific, 26 shared victories and 27 unconfirmed victories. He is supposed to have damaged two planes and destroyed two on the ground. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 87. Irrespective of the scoring system, Tetsuzō Iwamoto was the Japan’s top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS through the war. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, claimed of 202 Allied aircraft destroyed.\n\nSecond From the Right. Image Source: ameblo.jp.\n\nYoung Days\n\nTetsuzo was the third son of the Iwamoto family, born on a border town, southern part of Karafuto (now Sakhalin, Russia) on 15 June 1916. His father was a chief police officer. Later he grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo. When he was 13, his father retired and Tetsuzo moved with his family to his father’s hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored very high. Whilst he was a gifted student both academically and physically, his popularity with his teachers was poor due to his insubordinate, rebellious and sometimes outright rude nature. He was otherwise an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He was regarded as the most opinionated student in his school, and often talked down his teachers in discussions, which was considered impolite.\n\nShimane Prefecture Japan. Image Source: Wikipedia\n\nChooses a Military Career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nTetsuzo iwamoto sunglass. Image Source: snappygoat.com\n\nGets Enrolled For Flight Training\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sojyu-Renshusei flight trainee program for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th in December of that year.\n\nIn April 1936, he was sent to Kasumigaura-Ku as a probationer. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku his fighter course instructor was the famous Chitoshi Isozaki.\n\nImperial Japanese Navy (IJN) Air Ace Chitoshi Isozaki, 12 Victories. Image Source: Wikipedia\n\nJoins Naval Air Group\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai Naval Air Group, which was based both at land and onboard a carrier, for 6 months of advanced training. After this he joined Omura Kōkūtai on July 16, 1937 for operational training. He had tough training there from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa, who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto had to wait for operational debut till February 10, 1938.\n\nChina Front\n\nThe Second Sino_japanese war was already on. After combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan, ferrying to the airfield outside of Nanjing China. Tetsuzo’s ability as a fighter pilot was recognized by all on his first air mission with his squadron, the 13th Flying Group on February 25, 1938, over Nanchang, China. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nNanchang Dajiaochang Airport, China. 800 m Runway in 1938. Image Source: Wikipedia\n\nFirst Combat Mission – Four Victories\n\nOn February 25, 1938, his squadron’s fighters escorted bombers Type 96 land-based attack aircraft. 16 Chinese fighters attacked the formation, and the squadron’s leader Lieutenant Takuma was lost on this mission. Iwamoto described his first combat in his notes. During the escort mission, the squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nMitsubishi G3M Type 96 Bomber Aircraft. Image Source: alchetron.com\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o’clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o’clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nPolikarpov I-15 Soviet biplane fighter aircraft. Image Source: Wikipedia\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nOne the left, Back Row. Image Source: snappygoat.com 2\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His section leader Kuroiwa with whom he had separated had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nSoviet Polikarpov I-16 the world’s first low-wing cantilever monoplane fighter with retractable landing gear. Image Source: Wikipedia\n\n13th and 12th Flying Groups Merge\n\nOn 22 Mar 1938, the 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called “Red legs squadron” while 2nd Chutai had gear painted in blue and were called “Blue legs squadron“. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force.\n\nMITSUBISHI A5M4 Type 96 Carrier fighter (Allies called “CLAUDE”). Image Source: craymond.no-ip.info\n\nIwamoto Becomes Top IJNAS Ace in China\n\nBy Sep 1938, he had completed 82 missions, and had 14 kills on his records and had become the top Japanese IJNAS ace. His activities subsequently earned him “Order of the Golden Kite – 5th class” recommendation in 1940. In September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nJapanese Order of the Golden Kite, 5th Class. Image Source: warthunder.com\n\nPacific War – Pearl Harbour & Carol Sea\n\nAfter a tour as an instructor, Petty Officer First Class Iwamoto returned to the front line onboard the carrier Zuikaku, now flying the legendary A6M ‘Zero’ fighter. Iwamoto was airborne for the day of infamy – the attack on Pearl Harbor – but flew air cover over the carrier group itself rather than escorting the actual raid. Iwamoto was heavily involved in the air war in the Pacific from the outset, regularly leading flights of A6Ms against their American, British and Australian counterparts. Iwamoto flew in the violent air engagements of the Battle of the Coral Sea in May 1942, during which Zuikaku’s air group suffered significant losses. This necessitated a return to Japan for resupply and to train replacement aircrew which resulted in Iwamoto and his comrades missing the Battle of Midway. Small team in Japan who frantically tried to train new aircrew to stem the advancing allies.\n\nLegendary A6M ‘Zero’ fighter. Image Source: warthunder.com\n\nRabaul, New Britain\n\nAfter a year of instructional duties, Chief Petty Officer Iwamoto returned to the front line and joined the 253rd Air Group, flying A6Ms from Rabaul, New Britain, in November 1943. Involved in daily air combat, the experienced fighter leader led his cadre of increasingly junior and less experienced pilots against the might of the US Navy and USAAF. Whilst operating from Rabaul, Iwamoto filed claims for a staggering 142 enemy aircraft shot down.\n\nCaroline Islands. Image Source: Wikipedia\n\nCaroline & Philippine Islands\n\nAfter withdrawing from Rabaul, Iwamoto returned to Japan in June 1944 for a brief respite from the front line, before fighting in the skies over Formosa, then transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands during autumn and the winter. In November 1944 Iwamoto’s skill and leadership were further recognised when he was commissioned as an officer in the ranks of the Japanese Navy, holding the rank of Ensign. Iwamoto’s last operational sorties were flown with the 203rd Air Group, defending Kyushu and Okinawa in the furthest Southwest reaches of Japan against the long ranged B-29 attacks and the might of the US Navy’s carrier borne air power. The last few months of Iwamoto’s war were spent training kamikaze pilots at Iwakuni airfield on Honshu island.\n\nChiran high school girls wave farewell with cherry blossom branches to departing kamikaze pilot. Image Source: Wikipedia\n\nTactics\n\nHe was best at one-vs-one dogfights. He often employed, quick roll tactic combining with skidding sideway for sudden deceleration within 1/2 quick roll to make the opponent on the tail to overshoot. Corkscrew loop (Hineri-Komi Senpō) was a short-cut or twist-in loop tactic, also called the skidding loop. He had also mastered the High and Low Yo-yo manouvres (Suichoku-Senkai Kasoku Senpō). His favourite formation tactics, was a two group linked formation attack, where one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in a formation.\n\nLow Yo-yo. Image Source: Wikipedia\n\nAttacking the opponent formations after their mission was over and they were on the way to the regroup point, to fly back across the distance range over the sea. This tactics was taken when his own group had much fewer aircraft. Aerial Bomb attack tactic, was a twelve o’clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō). It was almost vertical diving (about 60 degree) attack because the 30 kg aerial bomb needed the releasing speed over 280 knots to work timer correctly for the explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its high flight stability.\n\n\n\nFlight leader Masao Sato with his pilots aboard Zuikaku, 6 Dec 1941, one day before Pearl Harbour Attack; Tetsuzo Iwamoto second row, right-most. Image Source: ww2db.com\n\nAnother tactic that Japanese often employed was called “Send Wolf “, which essentially meant first sending a strike against US targets, and then attacking those US aircraft that got airborne after the base had been attacked by surprise. He was very good at using the 30 kg No. 3 Aerial Bomb, which was difficult to handle, although it was used against aircraft, and caused great damage.\n\nJapanese Type 99 30kg High-explosive bomb. Image Source: commons.wikimedia.org\n\nAerial Victories Claimed in His Diary\n\nHis own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2. 94 victories is what has been assigned to him.\n\nVought F4U Corsair. Image Source: Wikipedia\n\nHe had claimed seven victories against Grumman F4F Wildcat (Coral Sea, 8 May 1942, and at Rabaul, late 1943; 19 February 1944 the escort fighters of Martin flying boat). His claimed four Lockheed P-38 Lightning P-38 victories, at – 4 (Rabaul, late 1943 – 1944). 48 victories against Vought F4U Corsair, plus one unconfirmed. These were at Rabaul, Mobara-airbase outskirts of Tokyo, during Operation Kikusui, Okinawa, March 10 – June 24, 1945). This was more than 1 in 4 of all F4U air-to-air losses during the Second World War. He claimed two Bell P-39 Airacobra at Rabaul in late 1943. He claimed one Curtiss P-40 Warhawk at Rabaul, late 1943. He also claimed 39 Grumman F6F Hellcat victories, that included 29 (at Rabaul late 1943 – Feb 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945). He claimed one Republic P-47 Thunderbolt victory over Rabaul, late 1943 – 1944. He claimed one North American Aviation P-51 Mustang over Rabaul, on 19 February 1944, the Allied 2nd air-raid of the day. He claimed to have shot four British Spitfire burned on the ground, two shot over Indian Ocean on 9 April 1942. He claimed 48 US Navy’s Douglas SBD Dauntless with seven unconfirmed, (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944). He also reportedly shot down 30 Douglas SBD Dauntless using No.3 Aerial Bombs over Rabaul, in late 1943 – 1944. He claimed five Grumman TBF Avenger, with 19 uncofirmed. These were at Rabaul, late 1943 to February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul. He claimed five Curtiss SB2C Helldiver at Rabaul late 1943 to early 1944). He also claimed five North American B-25 Mitchell medium bombers at Rabaul, starting late 1943 to 19 February 1944, during the Allied 4th air-raid of the day. He claimed two Martin B-26 Marauder American twin-engined medium bomber at Rabaul. He claimed six Consolidated B-24 Liberator heavy bombers using No. 3 Aerial Bombs and damaged two at Truk, reportedly confirmed by ground crew. He claimed one Boeing B-29 Superfortress four-engine propeller-driven heavy bomber at Kagoshima, Kyushu, Japan, April 1945. He claimed a PBY5A flying boat over Indian Ocean on April 5, 1942. He reportedly shot a Martin Mariner flying boat victory at Rabaul, on 19 February 1944. This aircraft was escorted by 12 F4Fs. He strafed three Destroyers on the night of February 5, 1944. He strafed many Landing crafts at Kerama islands, Okinawa, on night March 26, 1945. He strafed airfields Lae, Eastern New Guinea, on January 23, 1942, and Torokina, Bougainville, Solomons, on night 1944.\n\nUS Navy’s Douglas SBD Dauntless Dive Bomber. Image Source: blenderartists.org\n\nAir Kills Debate – Yet Greatest Japanese Fighter Ace of All Time.\n\nIwamoto’s final number of kills remains open to debate. A combination of the Japanese practice of crediting victories to a squadron rather than an individual, lost records and discrepancies between the confirmation process in Japan and allied nations mean that the final tally will never be known. Most sources officially credit Iwamoto with 80 kills in WW II plus 14 in China, his war diary claims 202 individual victories, 26 shared and 22 unconfirmed. An outspoken, opinionated and brash man on the ground, Iwamoto was conversely a tactically minded and cool headed aviator who favoured hit and run tactics over dog-fighting. There is a very good chance that he was, and forever will be, the greatest Japanese fighter ace of all time.\n\nZero Fighting Tiger. Image Source: snappygoat.com\n\nThe “Zero Fighting Tiger”\n\nTetsuzo had reportedly flown 8,000 hrs by March 1944. He was an operational leader, cleared for solo fighter reconnaissance and attack mission across night and over ocean. He was cleared for night carrier operations. It is believed that his aircraft in the Rabaul days was dyed in pink with more than 60 shot-down marks and was well known. The nickname is the strongest Zero Fighter pilot . Also, he seems to call himself Zero Fighting Tiger .\n\nThe Kill Marks. Tetsuzo Iwamoto’s 53-102. Single cherry = fighter, Double cherry = bomber. Art Work: Fuku. Image Source: ww2aircraft.net\n\nPromotions\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nImperial Japanese Navy Ensign Shoulder Boards\n\nAwards\n\nOrder of the Golden Kite, Fifth Class – August 1, 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal – Seventh Class – August 1, 1942\n\nRising Sun, Green Paulownia Leaves Medal – Seventh Class. Image Source: http://www.worthpoint.com\n\nPost-war life\n\nIwamoto was promoted to Sub-Lieutenant on his enforced retirement from the Japanese Navy following his nation’s surrender. The Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur’s Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\n253 Ku at Truk, 29 April 1944. Front row, extreme left, Tetsuzo Iwamoto. Image Source: http://www.tumblr.com\n\nHis wife knew him as a “wartime ace pilot”, and in fact was a fan who later married through matchmaking agency. He very methodically kept all records. Japanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (“The Truth Is This”). The program considered people such as Iwamoto the cat’s-paws of militarism. Iwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan. In 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to “Daiwabō” Co., Ltd).\n\nDeath Due Medical Complications\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis. Iwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: “When I get well, I want to fly again.”\n\nMitsubishi A6M Zero\n\nA light and nimble fighter, the Mitsubishi A6M Zero was the first carrier based fighter capable of besting its land based opponents, and was Japan’s main fighter of WWII. The Zero’s design sacrificed protection for speed, maneuverability, and long range, on the theory that superior speed and maneuverability were protections in their own right, with long range an added bonus. The A6M came as a shock to Allied pilots when first encountered, because it could outmaneuver every airplane it faced at the time. A better dogfighter than anything the Allies had at the start of the Pacific War, the Zero’s superior performance, especially in the hands of Japan’s elite naval aviators, exceeded anything the Allies had hitherto expected from the Japanese. In the war’s early days, Japanese naval aviators flying Zeroes achieved a 12:1 kill ratio.\n\nMitsubishi A6M Zero. Image Source: aviation-history.com\n\nTo counter the Zero’s advantages, American pilots adopted team work tactics such as the “Thach Weave” which required pilot pairs to work in tandem, or the “Boom and Zoom”, in which American pilots engaged the Zero only in diving attacks, as the acceleration of their heavier planes in a dive allowed them to flee if the diving attack failed. While holding considerable advantages in maneuverability and speed, the Zero’s lack of protection for either the pilot or the fuel tanks proved a steadily mounting disadvantage as the war progressed, since the heavier and more rugged American fighters could absorb considerable punishment from Zeroes, while a single machine gun burst from the American plane could disintegrate a Zero.\n\nGrumman F6F Hellcat. Image Source: warhistoryonline.com\n\nBy 1943, attrition had thinned the ranks of Japan’s elite aviators, and the Japanese Navy’s training pipeline could not produce enough replacements of similar caliber. As a result, there were fewer and fewer Japanese pilots capable of extracting the most out of the Zero’s advantages while minimizing its disadvantages. Which was bad news for the Japanese, as the quality of American aviators was increasing, due to wartime experience as well as an extensive training program that produced capable aviators at a rate Japan could not match. That was exacerbated by the introduction of new American fighters, such as the F4U Corsair and the F6F Hellcat, that were a significant improvement over their predecessors, and proved more than a match for the Zero, with greater firepower, armor, speed, and similar maneuverability.\n\nImage Source: cs.finescale.com\n\nBy 1944 the Zero was rapidly becoming obsolete, but it remained in front line service because the Japanese faced production difficulties in fielding a replacement. From its heyday at war’s beginning when it ruled the skies of the Pacific while flown by elite pilots, A6Ms were reduced by war’s end to flying kamikaze missions under the controls of barely trained novices.\n\nList of Japanese Navy Air Force aces Mitsubishi A6M “Zero”\n\nThis is a list of Imperial Navy Air aces flying the Mitsubishi Zero fighter during the Pacific War.\n\nTetsuzo Iwamoto: 94 (including 14 in China / personal diary accounts for a total of 202 kills)\n\nShoichi Sugita: 70 (some sources say 80)\n\nSaburō Sakai: 64 (2 in China)\n\nTakeo Okumura: 54 (4 in China)\n\nHiroyoshi Nishizawa: 36 official (102 claimed)\n\nToshio Ohta: 34\n\nKazuo Sugino: 32\n\nJunichi Sasai: 27\n\nSito Origami: 10 (9 in China, 1 disputed)\n\nToshiyuki Sueda: 9\n\nShōichi Sugita. Second Highest Japanese Ace. Image Source: wikidata.org\n\nFamous Japanese Units\n\nThe air unit “Kōkūtai” (air group) with most air aces, was the Tainan Kōkūtai (in Formosa). It was the most famous group. They operated from Rabaul, New Britain and acquired their legendary fame over Taihoku (The Philippines), the Dutch East Indies, Lae and Buna (New Guinea) and, in the last stages of war, in defense of mainland Japan. Saburō Sakai was another member in this unit after Dutch Indies operations, from the Denpasar base on Bali.\n\nFighter pilots of the Tainan Air Group pose at Lae in June 1942. Several of these aviators would be among the top Japanese aces, including Saburō Sakai (middle row, second from left), and Hiroyoshi Nishizawa (standing, first on left). Image Source: Wikipedia\n\nOthers famous units with air aces were 3rd Air Corps (including Yoshiro Hashiguchi), 253rd Air Corps (with Tetsuzo Iwamoto and Hiroyoshi Nishizawa among its members), Genzan Air Group, and other groups.\n\nThe Imperial Japanese Navy Air Service, similar to the German Luftwaffe idea of organizing an “all aces” select unit Jagdverband 44 equipped with Messerschmitt Me 262A-1a jet fighters, decided to create an all-ace unit (the 343 Kōkūtai) with Kawanishi N1K2-J fighters towards the end of the conflict; this was commanded by Minoru Genda.\n\nKawanishi N1K2-J “343 A-15” of 301st Fighter Squadron/343rd Naval Air Group, Matsuyama air base, 10 April 1945. Image Source: Wikipedia\n\nInformation Source Credits: This Article has used information mostly from Wikipedia and other open sources. Credit is also given to Mark Barber, War Thunder Historical Consultant, a former pilot from the British Royal Navy’s Fleet Air Arm. Information was drawn from Historical Section of the War Thunder forums and the Ace of the Month series. Credit is also given to Peter Chen’s World War II Database (ww2db.com), and historycollection.com for coverage of top World War II fighters.\n\nLead Picture Credit: Wikipedia"}, {"url": "https://infogalactic.com/info/Tetsuz%C5%8D_Iwamoto", "page_content": "From Infogalactic: the planetary knowledge core\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō?) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever undertaken by the Imperial Japanese Navy Air Force against air raids mounted by U.S. and Allied air units.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by the U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata estimated the figure at about 80 or more than 87 in their research work in January 1971. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF, .[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the second world war. He fought over the Indian and the Pacific Ocean from north to south, and trained his young pilots even in the last months of the war.[5]\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron (2nd Chutai in had gear painted in blue amd were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flght hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF,[7] IJAAF[8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter renaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him.[10]) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him.[11]) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front.[12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nVictories\n\nChina Front, Feb.1938 - Sep.1938\n\n14 victories: I-15, I-16 (citation as the IJNAF top ace)\n\nWorld War II, Pacific Front and Indian Front, 8 December 1941 - 15 August 1945\n\n228 aerial victories: victories - 202 shared victories - 26\n\nunconfirmed - 27 damaged - 2 destroyed on the ground - 2\n\nAircraft types he confronted\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.[citation needed]\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nMovie"}, {"url": "https://ww2db.com/person_bio.php?person_id=561", "page_content": "Home\n\n» People\n\n» Tetsuzo Iwamoto\n\n\n\n\n\nTetsuzo Iwamoto\n\nSurname Iwamoto Given Name Tetsuzo Born 15 Jun 1916 Died 20 May 1955 Country Japan Category Military-Air Gender Male\n\nContributor: C. Peter Chen\n\nww2dbaseTetsuzo Iwamoto was born in Karafuto Prefecture, Japan (now southern Sakhalin Island). He grew up in Sapporo, Hokkaido, Japan after his father was appointed the chief of police of that city. In 1929, his father retired, and the whole family moved to his father's home town, Masuda, Shimane Prefecture, Japan, where he studied at the Masuda Agricultural and Forestry High School. In 1934, upon graduating high school, he was sent to a large city to take the college entrance exams, but instead he applied for and passed the exam for the air arm of the Japanese navy. In 1936, he served aboard carrier Ryujo with the rating of mechanic 2nd class. He began flight training on 28 Apr 1936. On 1 Nov 1936, he was promoted to the rating of mechanic 1st class. On 26 Dec, he graduated from the program and was promoted to airman 1st class. He was assigned to the Saeki Air Group for six months of advanced training, and then was transferred to the Omura Naval Air Group on 16 Jul 1937.\n\nww2dbaseOn 10 Feb 1938, Iwamoto was transferred to the front lines as he flew from Omura Airfield near Nagasaki, Japan to Nanjing, China, thus beginning his career in WW2. With the 13th Flying Group's fighter squadron in China, his first combat mission took place on 25 Feb over Nanchang, China as he escorted Type 96 attack aircraft. The flight was attacked by 16 Chinese fighters. During the dogfight, Iwamoto claimed 3 confirmed and 1 probable kills, but was scolded after he returned for his overly-aggressive actions. On 22 Mar 1938, the 13th Flying Group's fighter squadron was merged with the 12th Fighter Squadron. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara. He was ordered back to Japan in Sep 1938; at this point, he had 14 kills on his records and was one of the aces among Japanese airmen in China.\n\nww2dbaseBack in Japan, Iwamoto served as a member of the Saiki Air Group as a trainer. In 1940, he was awarded the Order of the Golden Kite 5th Class. During the Pacific War, he was initially a pilot with the carrier Zuikaku from Dec 1941 to May 1942, during which time he participated in the Battle of the Coral Sea. In late 1943, he was sent to Rabaul, New Britain. In 1944, he was successively transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands. In Oct 1944, he was promoted to the rank of ensign. During the Okinawa Campaign, he participated in Operation Kikusui. His own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2.\n\nww2dbaseAfter the war, Iwamoto was summoned for several interviews and interrogations by the Allied administration. Although he was eventually cleared and thus not declared a war criminal, he was still unable to get a job due to potential employers wishing to please the occupation administration. In 1952, the Allied occupation gave control of Japan back to the Japanese people, and he was finally able to get a job at a local spinning mill. In the summer of 1953, he underwent a series of surgeries for enteritis (mis-diagnosed) and appendicitis (actual cause of stomach pains). Shortly after, he complained of back pains and received another surgery. He passed away in his home town of Masuda after getting septicemia after the final surgery. According to his wife, his last words were \"[w]hen I get well, I want to fly again\".\n\nww2dbaseSource: Wikipedia.\n\nLast Major Revision: Jan 2010\n\nTetsuzo Iwamoto Timeline\n\nPhotographs"}, {"url": "https://www.liquisearch.com/tetsuz%C5%8D_iwamoto/china_front", "page_content": "China Front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was the considered the best and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who showed extreme courage and conspicuous leadership. Nango had a famous samurai sword named Kotetsu with him, which became the metaphor for old IJNAF pilots' yearned for Commander Nango.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. The squadron fighters escorted bombers Type 96 land-based attack aircraft. Then the Chinese's tenacious air force attacked, and his squadron leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He got his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was down to an altitude of 2000 m.\n\nAbove him, many enemy fighters kept maneuvering. He found one of them coming down with landing gears down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in a terrible barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for his rash attacks of the day.\n\nThe escort mission fighter members list, 13th Flying Group on Feb. 25 1938 Chutai and Shotai Leader Wingman Wingman 1st Chutai 1st Shotai Lt. S.Takuma, lost APO 3/C K.Suzuki APO 3/C S.Omori 3rd Shotai APO 1/C T.Kuroiwa APO 2/C J.Kusunoki A 1/C T.Iwamoto 5th Shotai APO 1/C S.Akamatsu APO 2/C T.Matsuyama (Shotai-12FG) APO 2/C T.Koizumi A 1/C Y.Ozeki 2nd Chutai 2nd Shotai Lt.J.G. Y.Yotsumoto APO 3/C K.Kashimura A 1/C T.Ochi, lost 4th Shotai APO 1/C T.Arai APO 3/C A.Kikuchi A 1/C M.Matsumura 6th Shotai APO 1/C M.Naitoh APO 3/C K.Fujiwara\n\nEvery rank name was the old rank name used in pre-war Japan, May 1, 1929 - May 31, 1941\n\nAir Petty Officer 3rd Class Kanichi Kashimura was the famous national hero of Japan for his miraculous return safely with his Type 96 carrier fighter left wing lost in combat December 1937.\n\nAir Petty Officer 1st Class Toshio Kuroiwa was the best dogfighting master pilot before the Pacific War. He was the national hero and one of the trio of IJNAF's first aerial victory over Shanghai on February 22, 1932. He finished his combat with 13 victories on the China front. He was promoted to Warrant Officer and retired IJN after the air battle settled in China October 1938, became a pilot of commercial airline Dai Nippon Koku. It was the most successful career course for a non commissioned officer pilot in peacetime Japan. He was missing off shore Malay Peninsula on an aerial transport task August 26, 1944, officially recognized as honorably died on a military mission.\n\nAir Petty Officer 1st Class Sadaaki Akamatsu was another dogfight master pilot before the Pacific War. He was famous for his yo-yo tactics.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had gears painted in red called Red legs squadron, for 2nd Chutai in blue called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff."}, {"url": "https://www.geni.com/people/Tetsuz%C5%8D-Iwamoto/6000000190527516822", "page_content": "About Tetsuzō Iwamoto\n\nhttps://en.wikipedia.org/wiki/Tetsuz%C5%8D_Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively."}, {"url": "https://daito-ryu.blog/eternal-master-historical-context-878014c9da41", "page_content": "Ranks and titles\n\nAs such, one would be remiss not to examine various past usage of the terms Meijin and Eisei Meijin, and more broadly how ranking and certification worked over time in various Budo practices.\n\nBut before proceeding, we need to understand that there are no definitive ranking or title systems for anything in Japan, Budo or otherwise. Some use classes (kyu), others use levels (dan); many modern martial arts use both. Some systems follow a numerical order, others use position (high, mid, low, for example); some use a hierarchy of titles specific to their specific subculture.\n\nIt is perfectly reasonable to suspect I might have missed some usage of a given title or term. But we need to keep in mind relevance: even if it came out that such-and-such terms were used by some obscure tradition, it would most likely be irrelevant unless we could trace back a connection to either Daito-ryu, the Kodokai, or Horikawa sensei himself.\n\nWith the above out of the way, let’s get started.\n\nGo and Shogi\n\nThe first known usage of the term Meijin as a title or rank finds its origin in Go an Shogi (Japanese chess).\n\n江戸時代、囲碁・将棋で九段の技量を持つ最高位者に与えられた称。現在は、それぞれタイトルの名称。名人戦の勝者がタイトルを手にする。 A title given to the most highly skilled players of Go and Shogi holding a rank of 9th dan during the Edo period. Currently, the title is awarded to winners of the Meijinsen [Shogi] tournament. Source: Kotobank\n\nCertificate awarded om 1961 by officials of the Nihon Shogi Renmei, signed by the contemporaneous Meijin, Oyama Yasuharu, and the previous one, Kimura Yoshio (Source: Yahoo Auctions)\n\nAs we can see in the above Shogi certificate, modern Meijin titles are sometimes prefixed with the tournament’s iteration — here, 十四世名人, or 14th Meijin, for Mr. Kimura — presumably so to create a distinction from the contemporaneous titleholder.\n\nThe title Eisei Meijin (永世名人) in Shogi, essentially, substitutes the tournament’s iteration with the kanji for eternal to highlight an individual’s repeated success.\n\n1949年の日本将棋連盟の規約改定により、名人位を通算5期以上保持した棋士に「永世名人」の資格を与え、引退後に襲位するようになった。 According to the 1949 revision of the Japan Shogi Federation’s rules, the title of “Eisei Meijin” is given to professionals who have held the Meijin title for a total of five terms or more; the title is assumed after retirement. Source: Wikipedia\n\nAs we can see, the title Eisei Meijin is an honorary one of a sort, as it is assumed by an individual once their career is completed, but one certainly needs exceptional skills to win the title five times in the first place.\n\nWhether this should be considered the highest honor is debatable. First, it’s a title attached to a single tournament. While currently the oldest, there are seven other title tournaments, many of which also award an Eisei prefixed title to individuals having won the tournament a number of times. Second, because other titles of similar denominations are in existence, such as Meiyo Meijin (名誉名人, or Honorary Meijin) and Zoumeijin (贈名人, a posthumous Meijin title) that could perhaps carry more prestige depending on circumstances.\n\nEisei Meijin was released by Konami for Sega Saturn in 1990. The last iteration of this game, Eisei Meijin VII, was released in 2003 for PlayStation 2 (Source: Wikipedia)\n\nAs an aside, the term Eisei Meijin was popularized to some degree through the launch of a series of Shogi video games for various gaming consoles during the 90s and early 2000s. Amusingly enough, this game series has been selected for preservation by the National Diet Library. When searching for the term Eisei Meijin in their online archives, a large portion of the search results point to various iterations and releases of this game.\n\nBudo ranking systems and Meijin titles\n\nThere seems to be a potential connection to the Budo world, here. Given that the dan and kyu system was reportedly adopted from Shogi by Kano Jigoro of the Kodokan, it stands to reason that Shogi might have been the inspiration for other ranks and titles as well.\n\nBut first, a bit of history on Budo ranking systems.\n\nWhile the dan and kyu ranking system wouldn’t be popularized in Budo until much later, some koryu are known to have implemented dan systems as early as the beginning of the Edo period.\n\n剣術においては薩摩藩で普及した示現流が最初であり,流祖の東郷藤兵衛重位(1560～1643)が残した『示現流兵法書上中下』には「初段,二段,三段,四段」の段位が記されている。 Jigen-ryu, of the Satsuma domain, was the first [to use the dan ranking system]; the founder of the tradition, Togo Tobei Shigekata (1560–1643), lists the ranks of Shodan, nidan, sandan, and yondan in his book “Jigen-ryu Heihosho Jouchuuge”. Source: A study of the history and the cultural value of dan an kyu grades in Budo, 2004\n\nAccording to the same paper, Shinno Shinto Ryu (真之神道流) is credited as the first jujutsu tradition to start using a dan ranking system.\n\nその後幕末期には、磯又右衛門正足 (1786～1864) がこの真之神道流と楊心流をまとめて天神真楊流柔術を創作する。天神真楊流では真之神道流と同様に初段,中段、上段の三つの段が設けられ、更にそれぞれの段位における「形」の修得内容が詳しく記されている(表1参照)。 Later, at the end of the Tokugawa Shogunate, Iso Mataemon Masatari (1786–1864) created Tenjin Shinyo-ryu Jujutsu by synthetizing Shinno Shinto-ryu and Yoshin Shin-ryu. In Tenjin Shinyo-ryu, as in Shinno Shinto-ryu, there are three levels: shodan, chudan, and jodan, and the details of the “kata” to be learned at each level are described in detail (see Table 1). Source: A study of the history and the cultural value of dan an kyu grades in Budo, 2004\n\nTenshin Shin’yo ryu densho: Ten-no-maki, Chi-no-maki, and Jin-no-maki (Source: Kodokan Judo Institute)\n\nAs we can see, however, these levels were non-numerical, and they were neither ranks nor titles. They were a way to break down the curriculum. This can be seen in the densho (or transmission documents) of the tradition (note: there are some variations depending on specific lineages).\n\n陽之巻, or Yo-no-maki, serving as a license (免許, or menkyo)\n\nserving as a license (免許, or menkyo) 陰之巻, or In-no-maki, serving as a certificate of full transmission (皆伝, or kaiden)\n\nTenjin Shinyo-ryu is one of the two traditions that Kano sensei trained in, so it is possible that the dan system may have been a source of inspiration. However, it appears more likely that Shogi had a stronger influence on the formation of the dan and kyu system later used by the Kodokan from its establishment in 1882.\n\nA decade later, in 1895, the Dai Nippon Butokukai is created along with a title-based ranking system (称号, or shogo — you’ll remember this word was on Horikawa sensei’s certificate). Over time, titles would include seiren-sho (精錬証), renshi (錬士), kyoshi (教士, renamed to tasshi or 達士 in 1943), and hanshi (範士). They also used a variety of other titles and decorations, but as far as I could tell, the Meijin title was never used by this organization.\n\n名誉会員章 (Meiyo Kai’insho), or honorary membership badge of the Butokukai. One distinguishing aspect in comparison to a standard membership badge is the ribbon decorating the badge itself. (Source: Yahoo Auction)\n\nThis isn’t to say that the word meijin wasn’t used in a Budo context. Meijin as a more colloquial qualifier wasn’t uncommon to describe individuals having acquired some widely recognized level of fame and mastery (a definition we’ll cover in more detail in the next article of this series) in a traditional practice.\n\n明治時代には、活版印刷が普及し多くの剣道書が刊行されたが、管見するところ、活版剣道書刊行の嚆矢こうしは神道無念流の根岸信五郎著『撃剣指南』（明治17年）であるが、同年に北辰一刀流関係者によって『剣術独案内』（森 景鎮）、『千葉周作先生直伝 剣術名人法』（高坂昌孝―以下『剣術名人法』）、『剣法秘訣』（広瀬眞平）の三書が相次いで刊行されている。 In the Meiji period, letterpress printing became widespread, and many kendo books were published. The first kendo book to be published in letterpress was “Gekiken Shinan” (1882), written by Negishi Shingoro of Shinto Munenryu. In the same year, representatives of Hokushin Itto-ryu published three books: Kenjutsu Dokuiuchi[?] (Mori Keizhen), Kenjutsu Meijinho (Chiba Shusaku Sensei Jikiden Kenjutsu Meijinho), and Kenpo Hiketsu (Hirose Shimpei). Source: Zen Nihon Kendo Renmei official website\n\nHere, for instance, Meijinho’s literal translation would be Master’s Method(s).\n\nKyu-based ranking system used by the Tokyo Metropolitan Police, circa 1885 (Source: A Cultural View of Budo license in Budo and in Buddhist esotericism, Murayama Terushi)\n\nThe only mention of Meijin as a title or rank was in early Metropolitan Police literature. Here, Meijin is listed as the highest of four old ranks. The reason for this inclusion, however, remains unclear. For instance, Tennen Risshin Ryu would be an example of a tradition including the first three titles mentioned in the second row of the above table (kirigami, mokuroku, and menkyo), but Meijin wasn’t used as a title by any traditions or at least no major traditions that I could find. Which raises the question: why is it included here?\n\nWhat makes matters even more complex is the ambiguity of the table itself. It’s unclear whether the old titles refer to titles used in some classical traditions, or by one of the Tokyo Metropolitan Police’s prior iterations. The TMPD (as established under the Ministry of the Interior at the time) went through several phases of disbandment and reestablishment between its initial creation in 1874. So it is possible that the Meijin title — and all the other old titles listed here — were carried over from one of those iterations. The potential connection of the title to any other specific classical traditions, however, remains unclear.\n\nIn 1952, two new organizations of interest to the topic at hand are established: the Kokusai Budoin and the Zen Nihon Kendo Renmei (from which the associated Jodo and Iaido Renmei would be established a bit later in 1956).\n\nThere are some hints that the Kendo Renmei and its sub-associations used the term Meijin, but I couldn’t find records confirming any official use as a title or rank. It is worth noting that all potential awardees of the Mejin rank that I could find were 9th or 10th dan, which would parallel how the title was traditionally used in Shogi prior to the 50s. Regardless, those two dan ranks seem to have effectively gone out of use during the 70s, and testing for them was abolished entirely in the early 2000s — and with them, any potential for a new Meijin rank to be awarded, most likely.\n\nYou’ll remember that Ishida sensei was the chairman of the Kendo Renmei at one point. If the above ever were to be confirmed, then we can potentially draw some parallel between the Kendo Renmei title and the one awarded to Horikawa sensei.\n\nAs for the Budoin, there are records of titles including the term Meijin from early on. Otsuka sensei, as a founding member of the organization, probably had a say in the choice of formulation for the ranks and titles the organization put in place.\n\nIMAF [or 国際武道院] was officially founded in January, 1952 by Master Kyuzo Mifune, Master Kazuo Ito and Shizuya Sato of Judo; Master Hakudo Nakayama and Master Hiromasa Takano of Kendo; Master Hironori Otsuka of Karate-do, and Kiyotaka Wake and Sueo Kiyoura. Source: IMAF official website\n\nHe would later be awarded one of those titles himself in 1966.\n\n昭和41年、大塚師範は、空手道普及の功により、勲五等に叙せられ、双光旭日章を授与、47年、国際武道院・国際武道連盟（大勲位・東久邇稔彦総裁）より、空手道初代名人位十段を受けた。 In 1966, Shihan Otsuka [Hironori] was awarded the Order of the Rising Sun, Gold Rays with Rosette for his contribution to the spread of karatedo, and in 1972, he received the First Generation Karatedo Meijin 10th dan rank from the Kokusai Budoin / Kokusai Budo Renmei (presided by Prince Higashikuni Naruhiko). Source: Wado-ryu official website\n\nOtsuka sensei, along with his Meijin Juudan certificate. The certificate states it is awarded for his long years of dedication to the research and practice of Karatedo (Source: Budoin Genryoku)\n\nLooking back at the full list of signatories, we can now see how the use of Meijin as a rank or title may have made some sense to many of them. Out of the eight signatories, six were at some point associated or had reasons to be familiar with the Kendo Renmei, police agencies (Mr. Machimura and Mr. Honda), or the Kokusai Budoin (Otsuka sensei with Mr. Muroki knowing of the title through his past teacher).\n\nAnd yet, none of these Budo organizations ever used the title of Eisei Meijin, formally or otherwise. The only known use of Eisei Meijin still remains in Shogi and started in 1952 (the same year the Kendo Renmei and the Budoin were founded, coincidentally).\n\nWhile the term Meijin as a rank or title finds some precedence in Budo, the use of Eisei Meijin on the certificate at hand is more or less without Budo precedents. Which makes it a bit harder to draw parallels or equivalencies with other ranks or titles that were more broadly in use over the years. We, therefore, need to review the more colloquial usage of the word to see if we can perhaps get a better grasp on things.\n\nComing up next\n\nIn the next article in this series, we will look at the meaning of the term Meijin; what is the definition of the term, its etymology, some synonyms, and whether the meaning of the term varied over time.\n\nThoughts, comments, or corrections? Make sure to leave them below in the comments!"}, {"url": "https://www.tracesofwar.com/persons/61886/Iwamoto-Tetsuzo-%E5%B2%A9%E6%9C%AC-%E5%BE%B9%E4%B8%89.htm", "page_content": "Iwamoto, Tetsuzo (岩本 徹三)\n\nDate of birth: June 15th, 1916 (Karafuto, Japan) Date of death: May 20th, 1955 (Japan) Nationality: Japanese (1868-1945, Empire)\n\nBiography\n\nTetsuzo Iwamoto was one of the greatest air aces of the Imperial Japanese Navy. During his career he is supposed to have achieved 242 air victories, 14 in China, 202 confirmed in the Pacific, 26 shared victories and 27 unconfirmed victories. He is supposed to have damaged two planes and destroyed two on the ground.\n\n\n\nPromotions:\n\nJune 1st, 1934: Sailor Fourth Class;\n\nNovember 15th, 1934: Sailor Third Class;\n\nNovember 2nd, 1935: Sailor Second Class;\n\nDecember 26th, 1935: Sailor First Class;\n\nMay 1st, 1938: Petty Officer Third Class;\n\nNovember 1st, 1939: Petty Officer Second Class;\n\nMay 1st, 1941: Petty Officer First Class;\n\nNovember 1st, 1942: Chief Petty Officer ;\n\nNovember 1st, 1944: Ensign;\n\nSeptember 5th, 1945: Sub-Lieutenant.\n\n\n\nCareer:\n\n1934: Japanese Imperial Navy;\n\n1935: 34 Soju-Renshusei, Pilot training;\n\nApril 4th, 1936: Kasumigaura-Ku, Advanced training;\n\nDecember 1936: Saeki Kokutai, Naval Air Goup;\n\nJuly 16th, 1937: Omura Kokutai;\n\n1938: 13th Air Group Fighter Squadron;\n\nSeptember 1938: Saiki Air Group.\n\nDo you have more information about this person? Inform us!\n\nPeriod: Second World War (1939-1945) Rank: Ittōheisō (Petty Officer First Class) Awarded on: August 1st, 1942\n\nPeriod: Second World War (1939-1945) Rank: Ittōheisō (Petty Officer First Class) Awarded on: August 1st, 1942"}, {"url": "https://english.www.gov.cn/news/topnews/201909/18/content_WS5d818bddc6d0bcf8c4c13959.html", "page_content": "42 individuals awarded national medals, honorary titles\n\nBEIJING — President Xi Jinping on Sept 17 signed a presidential decree to award 42 Chinese and foreign individuals national medals and honorary titles, as the People's Republic of China prepares to celebrate its 70th anniversary.\n\nThe conferring of the Medal of the Republic, the Friendship Medal and national honorary titles, with some to posthumous awardees, was endorsed by the National People's Congress (NPC) Standing Committee, the top legislature, at a special session on Sept 17.\n\nThe eight honorees of the Medal of the Republic are deceased nuclear physicist Yu Min, longtime national legislator Shen Jilan, aerospace engineer Sun Jiadong, war veterans Li Yannian and Zhang Fuqing, \"father of hybrid rice\" Yuan Longping, nuclear submarine designer Huang Xuhua and Nobel Prize winner Tu Youyou who led the discovery of malaria drug artemisinin.\n\nSix foreigners were awarded the Friendship Medal for their great contributions to supporting China's socialist modernization, promoting exchanges and cooperation between China and foreign countries and safeguarding world peace.\n\nThey are Cuba's Raul Castro Ruz, Thai Princess Maha Chakri Sirindhorn, Tanzania's Salim Ahmed Salim, Russia's Galina Kulikova, France's Jean-Pierre Raffarin and Canada's Isabel Crook.\n\nThe national honorary titles, including \"the people's scientist,\" \"the people's artist,\" \"the people's hero\" and \"the people's role model,\" were granted to 28 prominent figures who have made great contributions and enjoy prestige in various fields.\n\nLi Zhanshu, chairman of the NPC Standing Committee, said honoring model individuals who have made great contributions to China's construction and development helps build a stronger sense of national identity and promote core socialist values.\n\nThe honoring and promotion of those outstanding individuals will inspire the Chinese people to continue striving for national rejuvenation and demonstrate China's strong will to safeguard world peace and promote human progress, Li said."}, {"url": "https://senseis.xmp.net/?Meijin", "page_content": "Meijin\n\nChinese: 名人 (míngrén)\n\nJapanese: 名人 (meijin)\n\nKorean: 명인 (myeong-in)\n\n\n\nHistoric Title\n\nMeijin is a title in Japanese Go, written 名人. Its original meaning is \"master\" or \"expert\" or \"virtuoso\" of any field, not just Go. Historically, during the Edo period in Japan, there was only one Meijin, equivalent to a 9-dan rank. This person had to stand out from their peers as the undisputed strongest player in the country, so there was not always a Meijin when there was no consensus.\n\nThe first Meijin was Honinbo Sansa in 1612. Honinbo Shusai was the last traditional Meijin, though in fact the system had necessarily changed after the Meiji Restoration. The rank of 9 dan was then separated from the Meijin title, and promotion to 9 dan was awarded through the Oteai, the first being Fujisawa Kuranosuke. The ten players who held the historic Meijin title were:\n\n+ = Meijin Godokoro\n\nMeijin Godokoro\n\nDuring the Tokugawa Shogunate there was a government position known as godokoro, the go instructor to the shogun. There was a similar job for shogi. The Godokoro post was created by Tokugawa Ieyasu and appointed by the Commissioner of Temples and Shrines (jishabugyo). As only the strongest player in the country could hold the post, the Meijin title was a requirement to become Godokoro, however it did not guarantee the appointment, and the position was sometimes vacant for long periods of time.\n\nStrong and ambitious Go players sought the job, sometimes resorting to scandalous political maneuvers. The Meijin Godokoro had significant power, prestige, and perquisites. In addition to having a government stipend and some access to the Shogun, the Meijin Godokoro was the highest official in the Go world, approving rank promotions, scheduling castle games, and adjudicating disputes between the go houses. It was practically a lifetime appointment because the Godokoro was exempt from competing in the Castle Games, and indeed barred from serious contests, since he was theoretically supposed to devote his every effort to helping the Shogun be a better player. This made it hard for other players to demonstrate that they were stronger, and therefore the rightful Meijin.\n\nBecause of this and other governmental support for Go (i.e. the Four Houses) during the Tokugawa period, the quality of play grew faster in Japan than elsewhere. Honinbo Jowa was the final Meijin Godokoro, as the Godokoro post was abolished in 1868 after the Meiji Restoration.\n\nThere were four players of Meijin-class strength who couldn't get the official title for various reasons.\n\nModern Japanese Tournament\n\nThe modern Meijin title came about in 1962, as a successor to the former title of Saikyo (1956-1961). The title is the second most prestigious of the big titles in Japan, at least in terms of prize money, after the Kisei. The winner's prize is ¥33,000,000 currently.[6]\n\nTime controls for the best of 7 challenge are 8 hours each, for the league it's 5 hours each.[6]\n\nThe Meijin title has been sponsored by the Asahi Shinbun newspaper since 1976. The games can be found on their website (Japanese). They took over sponsorship from the Yomiuri Shimbun, and the Meijin tournaments played before then are now commonly referred to as the Old Meijin titles since the numbering of the titles started over with the change in sponsor.\n\nDue to the importance of the Meijin as one of the \"big three\" titles in Japan (along with the Honinbo and Kisei), there are several paths of automatic rank advancement through it in the Nihon Ki-in new promotion system. Qualifying for the Meijin league warrants a promotion to 7-dan, winning the league to challenge for the title promotes to 8-dan, and finally winning the title itself gives an immediate 9-dan promotion.\n\nAs with each of the three Japanese big titles, the previous year's title holder is challenged by the winner of a league. Entry to the league is gained through a series of preliminary tournaments. The title is decided in a best of seven match, where each player is given eight hours of thinking time over a two day period. Since 1976, four players have won all of their league games, the most recent being Iyama Yuta in 2009. http://www.nihonkiin.or.jp/english/topics/09/topics2009_09.htm#090910\n\nThe title Honorary Meijin is given to those players who have previously won the Meijin title five years in a row. Currently, this includes Cho Chikun and Kobayashi Koichi.\n\nThe Chinese Mingren and Korean Myeongin are corresponding titles. The three titleholders meet in the China-Korea-Japan Meijin.\n\nTournament Winners\n\nThe Meijin tournament was established in 1962, sponsored by the Yomiuri newspaper, whose sponsorship lasted for 14 years. In 1976 the Asahi newspaper took over sponsorship and the numbering of the titles began again with one. The Yomiuri-sponsored tournaments are now referred to as the \"Old Meijin\" titles.\n\nOld Series (Yomiuri)\n\nNew Series (Asahi)\n\nThe title match usually starts in August.\n\nKawabata's Novel\n\nJapanese Nobel laureate writer Yasunari Kawabata wrote a novel about Shusai\u0092s final game with Kitani Minoru, titled Meijin. Its English title is The Master of Go. The game is also described in The Meijin\u0092s Retirement Game by John Fairbairn, which includes a discussion of Kawabata\u0092s novel. This game marked the transition from the traditional title to the tournament.\n\nNotes\n\n[1] Game four of the 5th Meijin tournament was ruled void (or no result) due to some confusion with a ko. Both players were in byo-yomi and Cho Chikun asked the scorekeeper (Hikosaka Naoto) if it was his turn to take the ko. He agreed that it was, and Cho made the illegal move retaking the ko. Cho was not required to forfeit the game because the referree had erred, so the game was declared void.\n\n[2] Game four of the 23rd Meijin tournament was void (or no result) due to a triple ko.\n\n[3] The games of the 29th Meijin tournament are both interesting and unusual - Yoda Meijin played an interesting move in game three and game four is even stranger.\n\n[4] See Meijin League\n\n[5] See Meijin 2011 Game 2\n\n[6] http://www.nihonkiin.or.jp/match/meijin/042.html\n\n[7] Otake Hideo appeared in the final 9 times in 10 years starting from his first win in 1975 (plus further 3 times). He got the nickname of 'The man of Meijin tournament' (名人戦男)."}, {"url": "https://alchetron.com/Tetsuz%C5%8D-Iwamoto", "page_content": "As of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nIwamoto was one of the highest-scoring Japanese aces. As a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II . This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines , being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō ) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China . Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea .\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAFFlight hours: over 8,000hrs on March 1944Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar)Instrument Flight: possibleNight Flight: possible\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning\n\nQuick roll (Roll Sempoh)Coke-screw loop (Hineri-Komi Sempoh)Yo-yo turn (Suichoku-Senkai Kasoku Sempoh)\n\nFormation tactics -\n\nTwo groups linked formation attackKeeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation.Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic -\n\nAerial victories claimed in his diary\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh)\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nOrder of the Golden Kite, Fifth Class - 1 August 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal - Seventh Class - 1 August 1942\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)"}]}