{"Tetsuzō Iwamoto was awarded the title of Honorary Kisei.": [{"url": "https://airpowerasia.com/2020/08/16/japanese-zero-fighter-air-ace-tetsuzo-iwamoto-tiger-tetsu-94-aerial-victories-greatest-japanese-fighter-ace-of-all-time/", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He joined the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during WWII, credited with at least 94 aerial victories including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. He was Nicknamed Zero Fighter Ace Kotetsu “Tiger Tetsu”.\n\nImage Source: snappygoat.com\n\nIn late 1943, Iwamoto’s air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids. Subsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nBattle of Rabaul (1942). Map depicting eastern New Guinea and New Britain. Image Source: Wikipedia\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Tetsuzo Iwamoto was one of the greatest air aces of the Imperial Japanese Navy. During his career, as per his personal records in his diary he is supposed to have achieved 242 air victories, 14 in China, 202 confirmed in the Pacific, 26 shared victories and 27 unconfirmed victories. He is supposed to have damaged two planes and destroyed two on the ground. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 87. Irrespective of the scoring system, Tetsuzō Iwamoto was the Japan’s top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS through the war. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, claimed of 202 Allied aircraft destroyed.\n\nSecond From the Right. Image Source: ameblo.jp.\n\nYoung Days\n\nTetsuzo was the third son of the Iwamoto family, born on a border town, southern part of Karafuto (now Sakhalin, Russia) on 15 June 1916. His father was a chief police officer. Later he grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo. When he was 13, his father retired and Tetsuzo moved with his family to his father’s hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored very high. Whilst he was a gifted student both academically and physically, his popularity with his teachers was poor due to his insubordinate, rebellious and sometimes outright rude nature. He was otherwise an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He was regarded as the most opinionated student in his school, and often talked down his teachers in discussions, which was considered impolite.\n\nShimane Prefecture Japan. Image Source: Wikipedia\n\nChooses a Military Career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nTetsuzo iwamoto sunglass. Image Source: snappygoat.com\n\nGets Enrolled For Flight Training\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sojyu-Renshusei flight trainee program for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th in December of that year.\n\nIn April 1936, he was sent to Kasumigaura-Ku as a probationer. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku his fighter course instructor was the famous Chitoshi Isozaki.\n\nImperial Japanese Navy (IJN) Air Ace Chitoshi Isozaki, 12 Victories. Image Source: Wikipedia\n\nJoins Naval Air Group\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai Naval Air Group, which was based both at land and onboard a carrier, for 6 months of advanced training. After this he joined Omura Kōkūtai on July 16, 1937 for operational training. He had tough training there from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa, who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto had to wait for operational debut till February 10, 1938.\n\nChina Front\n\nThe Second Sino_japanese war was already on. After combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan, ferrying to the airfield outside of Nanjing China. Tetsuzo’s ability as a fighter pilot was recognized by all on his first air mission with his squadron, the 13th Flying Group on February 25, 1938, over Nanchang, China. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nNanchang Dajiaochang Airport, China. 800 m Runway in 1938. Image Source: Wikipedia\n\nFirst Combat Mission – Four Victories\n\nOn February 25, 1938, his squadron’s fighters escorted bombers Type 96 land-based attack aircraft. 16 Chinese fighters attacked the formation, and the squadron’s leader Lieutenant Takuma was lost on this mission. Iwamoto described his first combat in his notes. During the escort mission, the squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nMitsubishi G3M Type 96 Bomber Aircraft. Image Source: alchetron.com\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o’clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o’clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nPolikarpov I-15 Soviet biplane fighter aircraft. Image Source: Wikipedia\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nOne the left, Back Row. Image Source: snappygoat.com 2\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His section leader Kuroiwa with whom he had separated had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nSoviet Polikarpov I-16 the world’s first low-wing cantilever monoplane fighter with retractable landing gear. Image Source: Wikipedia\n\n13th and 12th Flying Groups Merge\n\nOn 22 Mar 1938, the 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called “Red legs squadron” while 2nd Chutai had gear painted in blue and were called “Blue legs squadron“. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force.\n\nMITSUBISHI A5M4 Type 96 Carrier fighter (Allies called “CLAUDE”). Image Source: craymond.no-ip.info\n\nIwamoto Becomes Top IJNAS Ace in China\n\nBy Sep 1938, he had completed 82 missions, and had 14 kills on his records and had become the top Japanese IJNAS ace. His activities subsequently earned him “Order of the Golden Kite – 5th class” recommendation in 1940. In September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nJapanese Order of the Golden Kite, 5th Class. Image Source: warthunder.com\n\nPacific War – Pearl Harbour & Carol Sea\n\nAfter a tour as an instructor, Petty Officer First Class Iwamoto returned to the front line onboard the carrier Zuikaku, now flying the legendary A6M ‘Zero’ fighter. Iwamoto was airborne for the day of infamy – the attack on Pearl Harbor – but flew air cover over the carrier group itself rather than escorting the actual raid. Iwamoto was heavily involved in the air war in the Pacific from the outset, regularly leading flights of A6Ms against their American, British and Australian counterparts. Iwamoto flew in the violent air engagements of the Battle of the Coral Sea in May 1942, during which Zuikaku’s air group suffered significant losses. This necessitated a return to Japan for resupply and to train replacement aircrew which resulted in Iwamoto and his comrades missing the Battle of Midway. Small team in Japan who frantically tried to train new aircrew to stem the advancing allies.\n\nLegendary A6M ‘Zero’ fighter. Image Source: warthunder.com\n\nRabaul, New Britain\n\nAfter a year of instructional duties, Chief Petty Officer Iwamoto returned to the front line and joined the 253rd Air Group, flying A6Ms from Rabaul, New Britain, in November 1943. Involved in daily air combat, the experienced fighter leader led his cadre of increasingly junior and less experienced pilots against the might of the US Navy and USAAF. Whilst operating from Rabaul, Iwamoto filed claims for a staggering 142 enemy aircraft shot down.\n\nCaroline Islands. Image Source: Wikipedia\n\nCaroline & Philippine Islands\n\nAfter withdrawing from Rabaul, Iwamoto returned to Japan in June 1944 for a brief respite from the front line, before fighting in the skies over Formosa, then transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands during autumn and the winter. In November 1944 Iwamoto’s skill and leadership were further recognised when he was commissioned as an officer in the ranks of the Japanese Navy, holding the rank of Ensign. Iwamoto’s last operational sorties were flown with the 203rd Air Group, defending Kyushu and Okinawa in the furthest Southwest reaches of Japan against the long ranged B-29 attacks and the might of the US Navy’s carrier borne air power. The last few months of Iwamoto’s war were spent training kamikaze pilots at Iwakuni airfield on Honshu island.\n\nChiran high school girls wave farewell with cherry blossom branches to departing kamikaze pilot. Image Source: Wikipedia\n\nTactics\n\nHe was best at one-vs-one dogfights. He often employed, quick roll tactic combining with skidding sideway for sudden deceleration within 1/2 quick roll to make the opponent on the tail to overshoot. Corkscrew loop (Hineri-Komi Senpō) was a short-cut or twist-in loop tactic, also called the skidding loop. He had also mastered the High and Low Yo-yo manouvres (Suichoku-Senkai Kasoku Senpō). His favourite formation tactics, was a two group linked formation attack, where one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in a formation.\n\nLow Yo-yo. Image Source: Wikipedia\n\nAttacking the opponent formations after their mission was over and they were on the way to the regroup point, to fly back across the distance range over the sea. This tactics was taken when his own group had much fewer aircraft. Aerial Bomb attack tactic, was a twelve o’clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō). It was almost vertical diving (about 60 degree) attack because the 30 kg aerial bomb needed the releasing speed over 280 knots to work timer correctly for the explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its high flight stability.\n\n\n\nFlight leader Masao Sato with his pilots aboard Zuikaku, 6 Dec 1941, one day before Pearl Harbour Attack; Tetsuzo Iwamoto second row, right-most. Image Source: ww2db.com\n\nAnother tactic that Japanese often employed was called “Send Wolf “, which essentially meant first sending a strike against US targets, and then attacking those US aircraft that got airborne after the base had been attacked by surprise. He was very good at using the 30 kg No. 3 Aerial Bomb, which was difficult to handle, although it was used against aircraft, and caused great damage.\n\nJapanese Type 99 30kg High-explosive bomb. Image Source: commons.wikimedia.org\n\nAerial Victories Claimed in His Diary\n\nHis own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2. 94 victories is what has been assigned to him.\n\nVought F4U Corsair. Image Source: Wikipedia\n\nHe had claimed seven victories against Grumman F4F Wildcat (Coral Sea, 8 May 1942, and at Rabaul, late 1943; 19 February 1944 the escort fighters of Martin flying boat). His claimed four Lockheed P-38 Lightning P-38 victories, at – 4 (Rabaul, late 1943 – 1944). 48 victories against Vought F4U Corsair, plus one unconfirmed. These were at Rabaul, Mobara-airbase outskirts of Tokyo, during Operation Kikusui, Okinawa, March 10 – June 24, 1945). This was more than 1 in 4 of all F4U air-to-air losses during the Second World War. He claimed two Bell P-39 Airacobra at Rabaul in late 1943. He claimed one Curtiss P-40 Warhawk at Rabaul, late 1943. He also claimed 39 Grumman F6F Hellcat victories, that included 29 (at Rabaul late 1943 – Feb 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945). He claimed one Republic P-47 Thunderbolt victory over Rabaul, late 1943 – 1944. He claimed one North American Aviation P-51 Mustang over Rabaul, on 19 February 1944, the Allied 2nd air-raid of the day. He claimed to have shot four British Spitfire burned on the ground, two shot over Indian Ocean on 9 April 1942. He claimed 48 US Navy’s Douglas SBD Dauntless with seven unconfirmed, (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944). He also reportedly shot down 30 Douglas SBD Dauntless using No.3 Aerial Bombs over Rabaul, in late 1943 – 1944. He claimed five Grumman TBF Avenger, with 19 uncofirmed. These were at Rabaul, late 1943 to February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul. He claimed five Curtiss SB2C Helldiver at Rabaul late 1943 to early 1944). He also claimed five North American B-25 Mitchell medium bombers at Rabaul, starting late 1943 to 19 February 1944, during the Allied 4th air-raid of the day. He claimed two Martin B-26 Marauder American twin-engined medium bomber at Rabaul. He claimed six Consolidated B-24 Liberator heavy bombers using No. 3 Aerial Bombs and damaged two at Truk, reportedly confirmed by ground crew. He claimed one Boeing B-29 Superfortress four-engine propeller-driven heavy bomber at Kagoshima, Kyushu, Japan, April 1945. He claimed a PBY5A flying boat over Indian Ocean on April 5, 1942. He reportedly shot a Martin Mariner flying boat victory at Rabaul, on 19 February 1944. This aircraft was escorted by 12 F4Fs. He strafed three Destroyers on the night of February 5, 1944. He strafed many Landing crafts at Kerama islands, Okinawa, on night March 26, 1945. He strafed airfields Lae, Eastern New Guinea, on January 23, 1942, and Torokina, Bougainville, Solomons, on night 1944.\n\nUS Navy’s Douglas SBD Dauntless Dive Bomber. Image Source: blenderartists.org\n\nAir Kills Debate – Yet Greatest Japanese Fighter Ace of All Time.\n\nIwamoto’s final number of kills remains open to debate. A combination of the Japanese practice of crediting victories to a squadron rather than an individual, lost records and discrepancies between the confirmation process in Japan and allied nations mean that the final tally will never be known. Most sources officially credit Iwamoto with 80 kills in WW II plus 14 in China, his war diary claims 202 individual victories, 26 shared and 22 unconfirmed. An outspoken, opinionated and brash man on the ground, Iwamoto was conversely a tactically minded and cool headed aviator who favoured hit and run tactics over dog-fighting. There is a very good chance that he was, and forever will be, the greatest Japanese fighter ace of all time.\n\nZero Fighting Tiger. Image Source: snappygoat.com\n\nThe “Zero Fighting Tiger”\n\nTetsuzo had reportedly flown 8,000 hrs by March 1944. He was an operational leader, cleared for solo fighter reconnaissance and attack mission across night and over ocean. He was cleared for night carrier operations. It is believed that his aircraft in the Rabaul days was dyed in pink with more than 60 shot-down marks and was well known. The nickname is the strongest Zero Fighter pilot . Also, he seems to call himself Zero Fighting Tiger .\n\nThe Kill Marks. Tetsuzo Iwamoto’s 53-102. Single cherry = fighter, Double cherry = bomber. Art Work: Fuku. Image Source: ww2aircraft.net\n\nPromotions\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nImperial Japanese Navy Ensign Shoulder Boards\n\nAwards\n\nOrder of the Golden Kite, Fifth Class – August 1, 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal – Seventh Class – August 1, 1942\n\nRising Sun, Green Paulownia Leaves Medal – Seventh Class. Image Source: http://www.worthpoint.com\n\nPost-war life\n\nIwamoto was promoted to Sub-Lieutenant on his enforced retirement from the Japanese Navy following his nation’s surrender. The Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur’s Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\n253 Ku at Truk, 29 April 1944. Front row, extreme left, Tetsuzo Iwamoto. Image Source: http://www.tumblr.com\n\nHis wife knew him as a “wartime ace pilot”, and in fact was a fan who later married through matchmaking agency. He very methodically kept all records. Japanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (“The Truth Is This”). The program considered people such as Iwamoto the cat’s-paws of militarism. Iwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan. In 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to “Daiwabō” Co., Ltd).\n\nDeath Due Medical Complications\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis. Iwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: “When I get well, I want to fly again.”\n\nMitsubishi A6M Zero\n\nA light and nimble fighter, the Mitsubishi A6M Zero was the first carrier based fighter capable of besting its land based opponents, and was Japan’s main fighter of WWII. The Zero’s design sacrificed protection for speed, maneuverability, and long range, on the theory that superior speed and maneuverability were protections in their own right, with long range an added bonus. The A6M came as a shock to Allied pilots when first encountered, because it could outmaneuver every airplane it faced at the time. A better dogfighter than anything the Allies had at the start of the Pacific War, the Zero’s superior performance, especially in the hands of Japan’s elite naval aviators, exceeded anything the Allies had hitherto expected from the Japanese. In the war’s early days, Japanese naval aviators flying Zeroes achieved a 12:1 kill ratio.\n\nMitsubishi A6M Zero. Image Source: aviation-history.com\n\nTo counter the Zero’s advantages, American pilots adopted team work tactics such as the “Thach Weave” which required pilot pairs to work in tandem, or the “Boom and Zoom”, in which American pilots engaged the Zero only in diving attacks, as the acceleration of their heavier planes in a dive allowed them to flee if the diving attack failed. While holding considerable advantages in maneuverability and speed, the Zero’s lack of protection for either the pilot or the fuel tanks proved a steadily mounting disadvantage as the war progressed, since the heavier and more rugged American fighters could absorb considerable punishment from Zeroes, while a single machine gun burst from the American plane could disintegrate a Zero.\n\nGrumman F6F Hellcat. Image Source: warhistoryonline.com\n\nBy 1943, attrition had thinned the ranks of Japan’s elite aviators, and the Japanese Navy’s training pipeline could not produce enough replacements of similar caliber. As a result, there were fewer and fewer Japanese pilots capable of extracting the most out of the Zero’s advantages while minimizing its disadvantages. Which was bad news for the Japanese, as the quality of American aviators was increasing, due to wartime experience as well as an extensive training program that produced capable aviators at a rate Japan could not match. That was exacerbated by the introduction of new American fighters, such as the F4U Corsair and the F6F Hellcat, that were a significant improvement over their predecessors, and proved more than a match for the Zero, with greater firepower, armor, speed, and similar maneuverability.\n\nImage Source: cs.finescale.com\n\nBy 1944 the Zero was rapidly becoming obsolete, but it remained in front line service because the Japanese faced production difficulties in fielding a replacement. From its heyday at war’s beginning when it ruled the skies of the Pacific while flown by elite pilots, A6Ms were reduced by war’s end to flying kamikaze missions under the controls of barely trained novices.\n\nList of Japanese Navy Air Force aces Mitsubishi A6M “Zero”\n\nThis is a list of Imperial Navy Air aces flying the Mitsubishi Zero fighter during the Pacific War.\n\nTetsuzo Iwamoto: 94 (including 14 in China / personal diary accounts for a total of 202 kills)\n\nShoichi Sugita: 70 (some sources say 80)\n\nSaburō Sakai: 64 (2 in China)\n\nTakeo Okumura: 54 (4 in China)\n\nHiroyoshi Nishizawa: 36 official (102 claimed)\n\nToshio Ohta: 34\n\nKazuo Sugino: 32\n\nJunichi Sasai: 27\n\nSito Origami: 10 (9 in China, 1 disputed)\n\nToshiyuki Sueda: 9\n\nShōichi Sugita. Second Highest Japanese Ace. Image Source: wikidata.org\n\nFamous Japanese Units\n\nThe air unit “Kōkūtai” (air group) with most air aces, was the Tainan Kōkūtai (in Formosa). It was the most famous group. They operated from Rabaul, New Britain and acquired their legendary fame over Taihoku (The Philippines), the Dutch East Indies, Lae and Buna (New Guinea) and, in the last stages of war, in defense of mainland Japan. Saburō Sakai was another member in this unit after Dutch Indies operations, from the Denpasar base on Bali.\n\nFighter pilots of the Tainan Air Group pose at Lae in June 1942. Several of these aviators would be among the top Japanese aces, including Saburō Sakai (middle row, second from left), and Hiroyoshi Nishizawa (standing, first on left). Image Source: Wikipedia\n\nOthers famous units with air aces were 3rd Air Corps (including Yoshiro Hashiguchi), 253rd Air Corps (with Tetsuzo Iwamoto and Hiroyoshi Nishizawa among its members), Genzan Air Group, and other groups.\n\nThe Imperial Japanese Navy Air Service, similar to the German Luftwaffe idea of organizing an “all aces” select unit Jagdverband 44 equipped with Messerschmitt Me 262A-1a jet fighters, decided to create an all-ace unit (the 343 Kōkūtai) with Kawanishi N1K2-J fighters towards the end of the conflict; this was commanded by Minoru Genda.\n\nKawanishi N1K2-J “343 A-15” of 301st Fighter Squadron/343rd Naval Air Group, Matsuyama air base, 10 April 1945. Image Source: Wikipedia\n\nInformation Source Credits: This Article has used information mostly from Wikipedia and other open sources. Credit is also given to Mark Barber, War Thunder Historical Consultant, a former pilot from the British Royal Navy’s Fleet Air Arm. Information was drawn from Historical Section of the War Thunder forums and the Ace of the Month series. Credit is also given to Peter Chen’s World War II Database (ww2db.com), and historycollection.com for coverage of top World War II fighters.\n\nLead Picture Credit: Wikipedia"}, {"url": "https://infogalactic.com/info/Tetsuz%C5%8D_Iwamoto", "page_content": "From Infogalactic: the planetary knowledge core\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō?) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever undertaken by the Imperial Japanese Navy Air Force against air raids mounted by U.S. and Allied air units.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by the U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata estimated the figure at about 80 or more than 87 in their research work in January 1971. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF, .[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the second world war. He fought over the Indian and the Pacific Ocean from north to south, and trained his young pilots even in the last months of the war.[5]\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron (2nd Chutai in had gear painted in blue amd were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flght hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF,[7] IJAAF[8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter renaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him.[10]) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him.[11]) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front.[12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nVictories\n\nChina Front, Feb.1938 - Sep.1938\n\n14 victories: I-15, I-16 (citation as the IJNAF top ace)\n\nWorld War II, Pacific Front and Indian Front, 8 December 1941 - 15 August 1945\n\n228 aerial victories: victories - 202 shared victories - 26\n\nunconfirmed - 27 damaged - 2 destroyed on the ground - 2\n\nAircraft types he confronted\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.[citation needed]\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nMovie"}, {"url": "https://ww2db.com/person_bio.php?person_id=561", "page_content": "Home\n\n» People\n\n» Tetsuzo Iwamoto\n\n\n\n\n\nTetsuzo Iwamoto\n\nSurname Iwamoto Given Name Tetsuzo Born 15 Jun 1916 Died 20 May 1955 Country Japan Category Military-Air Gender Male\n\nContributor: C. Peter Chen\n\nww2dbaseTetsuzo Iwamoto was born in Karafuto Prefecture, Japan (now southern Sakhalin Island). He grew up in Sapporo, Hokkaido, Japan after his father was appointed the chief of police of that city. In 1929, his father retired, and the whole family moved to his father's home town, Masuda, Shimane Prefecture, Japan, where he studied at the Masuda Agricultural and Forestry High School. In 1934, upon graduating high school, he was sent to a large city to take the college entrance exams, but instead he applied for and passed the exam for the air arm of the Japanese navy. In 1936, he served aboard carrier Ryujo with the rating of mechanic 2nd class. He began flight training on 28 Apr 1936. On 1 Nov 1936, he was promoted to the rating of mechanic 1st class. On 26 Dec, he graduated from the program and was promoted to airman 1st class. He was assigned to the Saeki Air Group for six months of advanced training, and then was transferred to the Omura Naval Air Group on 16 Jul 1937.\n\nww2dbaseOn 10 Feb 1938, Iwamoto was transferred to the front lines as he flew from Omura Airfield near Nagasaki, Japan to Nanjing, China, thus beginning his career in WW2. With the 13th Flying Group's fighter squadron in China, his first combat mission took place on 25 Feb over Nanchang, China as he escorted Type 96 attack aircraft. The flight was attacked by 16 Chinese fighters. During the dogfight, Iwamoto claimed 3 confirmed and 1 probable kills, but was scolded after he returned for his overly-aggressive actions. On 22 Mar 1938, the 13th Flying Group's fighter squadron was merged with the 12th Fighter Squadron. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara. He was ordered back to Japan in Sep 1938; at this point, he had 14 kills on his records and was one of the aces among Japanese airmen in China.\n\nww2dbaseBack in Japan, Iwamoto served as a member of the Saiki Air Group as a trainer. In 1940, he was awarded the Order of the Golden Kite 5th Class. During the Pacific War, he was initially a pilot with the carrier Zuikaku from Dec 1941 to May 1942, during which time he participated in the Battle of the Coral Sea. In late 1943, he was sent to Rabaul, New Britain. In 1944, he was successively transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands. In Oct 1944, he was promoted to the rank of ensign. During the Okinawa Campaign, he participated in Operation Kikusui. His own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2.\n\nww2dbaseAfter the war, Iwamoto was summoned for several interviews and interrogations by the Allied administration. Although he was eventually cleared and thus not declared a war criminal, he was still unable to get a job due to potential employers wishing to please the occupation administration. In 1952, the Allied occupation gave control of Japan back to the Japanese people, and he was finally able to get a job at a local spinning mill. In the summer of 1953, he underwent a series of surgeries for enteritis (mis-diagnosed) and appendicitis (actual cause of stomach pains). Shortly after, he complained of back pains and received another surgery. He passed away in his home town of Masuda after getting septicemia after the final surgery. According to his wife, his last words were \"[w]hen I get well, I want to fly again\".\n\nww2dbaseSource: Wikipedia.\n\nLast Major Revision: Jan 2010\n\nTetsuzo Iwamoto Timeline\n\nPhotographs"}, {"url": "https://www.liquisearch.com/tetsuz%C5%8D_iwamoto/china_front", "page_content": "China Front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was the considered the best and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who showed extreme courage and conspicuous leadership. Nango had a famous samurai sword named Kotetsu with him, which became the metaphor for old IJNAF pilots' yearned for Commander Nango.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. The squadron fighters escorted bombers Type 96 land-based attack aircraft. Then the Chinese's tenacious air force attacked, and his squadron leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He got his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was down to an altitude of 2000 m.\n\nAbove him, many enemy fighters kept maneuvering. He found one of them coming down with landing gears down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in a terrible barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for his rash attacks of the day.\n\nThe escort mission fighter members list, 13th Flying Group on Feb. 25 1938 Chutai and Shotai Leader Wingman Wingman 1st Chutai 1st Shotai Lt. S.Takuma, lost APO 3/C K.Suzuki APO 3/C S.Omori 3rd Shotai APO 1/C T.Kuroiwa APO 2/C J.Kusunoki A 1/C T.Iwamoto 5th Shotai APO 1/C S.Akamatsu APO 2/C T.Matsuyama (Shotai-12FG) APO 2/C T.Koizumi A 1/C Y.Ozeki 2nd Chutai 2nd Shotai Lt.J.G. Y.Yotsumoto APO 3/C K.Kashimura A 1/C T.Ochi, lost 4th Shotai APO 1/C T.Arai APO 3/C A.Kikuchi A 1/C M.Matsumura 6th Shotai APO 1/C M.Naitoh APO 3/C K.Fujiwara\n\nEvery rank name was the old rank name used in pre-war Japan, May 1, 1929 - May 31, 1941\n\nAir Petty Officer 3rd Class Kanichi Kashimura was the famous national hero of Japan for his miraculous return safely with his Type 96 carrier fighter left wing lost in combat December 1937.\n\nAir Petty Officer 1st Class Toshio Kuroiwa was the best dogfighting master pilot before the Pacific War. He was the national hero and one of the trio of IJNAF's first aerial victory over Shanghai on February 22, 1932. He finished his combat with 13 victories on the China front. He was promoted to Warrant Officer and retired IJN after the air battle settled in China October 1938, became a pilot of commercial airline Dai Nippon Koku. It was the most successful career course for a non commissioned officer pilot in peacetime Japan. He was missing off shore Malay Peninsula on an aerial transport task August 26, 1944, officially recognized as honorably died on a military mission.\n\nAir Petty Officer 1st Class Sadaaki Akamatsu was another dogfight master pilot before the Pacific War. He was famous for his yo-yo tactics.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had gears painted in red called Red legs squadron, for 2nd Chutai in blue called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff."}, {"url": "https://www.geni.com/people/Tetsuz%C5%8D-Iwamoto/6000000190527516822", "page_content": "About Tetsuzō Iwamoto\n\nhttps://en.wikipedia.org/wiki/Tetsuz%C5%8D_Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively."}, {"url": "https://alchetron.com/Tetsuz%C5%8D-Iwamoto", "page_content": "As of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nIwamoto was one of the highest-scoring Japanese aces. As a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II . This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines , being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō ) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China . Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea .\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAFFlight hours: over 8,000hrs on March 1944Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar)Instrument Flight: possibleNight Flight: possible\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning\n\nQuick roll (Roll Sempoh)Coke-screw loop (Hineri-Komi Sempoh)Yo-yo turn (Suichoku-Senkai Kasoku Sempoh)\n\nFormation tactics -\n\nTwo groups linked formation attackKeeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation.Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic -\n\nAerial victories claimed in his diary\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh)\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nOrder of the Golden Kite, Fifth Class - 1 August 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal - Seventh Class - 1 August 1942\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)"}, {"url": "https://www.nihonkiin.or.jp/english/topics/12/topics2012_09.htm", "page_content": "28 September\n\nIn the play-off to decide the challenger to Iyama Yuta, held at the Nihon Ki-in on 20 September 2012, Kono Rin 9p (W) defeats Anzai Nobuaki 6p by resignation and will play for Tengen title match. Kono is a pupil of Kobayashi Koichi. He won Tengen title in 2005 beating Yamashita Keigo and defended the title in 2007 which was the third year in a row that Kono had defeated Yamashita in this title.\n\nThe first game of the 38th of Tengen title match will be played on 5 November 2012 in Hokaido.\n\n\n\n\n\nIyama Yuta who gets four crowns (Honinbo, Tengen, Gosei and Judan) becomes the challenger to Cho U for Oza title. In the play-off to decide the challenger to Cho U, held at the Nihon Ki-in Osaka branch on 13 September 2012, Iyama (B) defeats Hane Noki 9p by resignation. He will play for Oza title match for his first time. The first game of the 60th of Oza title match will be played on 25th October 2012 in Taiwan.\n\n\n\n\n\n\n\nHe is one of pupils of the legendary go school of Kitani Minoru. He got 59 titles, which ranks third in total amount of titles in Japan.\n\nTo get awarded and name honorary title by full filling one of the following requirements:\n\n\n\nA) Winning a title 10 times in a row Or B) Upon the attainment of sixty years of age or his/her retirement with winning a title 5 times in a row or 10 times in total\n\n\n\nKobayashi Koichi's titles for Kisei, Meijin and Gosei:\n\n-Kisei (8 times) 1986–1993\n\n-Meijin (8 times) 1985, 1988–1994\n\n-Gosei (9 times) 1988–1993, 1999,2001–2002 Please be informed that Kobayashi Koichi 9p now names Honorary Kisei, Meijin and Gosei upon his attainment of 60 years old on 10 September 2012.He is one of pupils of the legendary go school of Kitani Minoru. He got 59 titles, which ranks third in total amount of titles in Japan.To get awarded and name honorary title by full filling one of the following requirements:Kobayashi Koichi's titles for Kisei, Meijin and Gosei:-Kisei (8 times) 1986–1993-Meijin (8 times) 1985, 1988–1994-Gosei (9 times) 1988–1993, 1999,2001–2002\n\n\n\n\n\n\n\nInvited for exclusive Honinbo Award Ceremony\n\n(Photo with Iyama Yuta Honinbo) Entered into the playing room\n\nof 1st game of Meijin title match Excellent Lecture by Michael Redmond 9p! Teaching games by\n\nKatsura 4p at The Nihon Kiin Very special teaching game\n\nby Takemiya Masaki 9p Very happy! Got the Nihon Kiin\n\ncertificate signed by Yoda Norimoto 9p!! The Nihon Kiin Summer Go School only for the people from abroad was held from 27 August and 5 September 2012 for its first time. Despite such a short notice, 14 players from all over the world participated in the special school to improve their skills and to experience the culture of go in Japan. All students were greatly pleased with the Summer School and requested us to hold the event next year as well.\n\n\n\n"}, {"url": "https://english.www.gov.cn/news/topnews/201909/18/content_WS5d818bddc6d0bcf8c4c13959.html", "page_content": "42 individuals awarded national medals, honorary titles\n\nBEIJING — President Xi Jinping on Sept 17 signed a presidential decree to award 42 Chinese and foreign individuals national medals and honorary titles, as the People's Republic of China prepares to celebrate its 70th anniversary.\n\nThe conferring of the Medal of the Republic, the Friendship Medal and national honorary titles, with some to posthumous awardees, was endorsed by the National People's Congress (NPC) Standing Committee, the top legislature, at a special session on Sept 17.\n\nThe eight honorees of the Medal of the Republic are deceased nuclear physicist Yu Min, longtime national legislator Shen Jilan, aerospace engineer Sun Jiadong, war veterans Li Yannian and Zhang Fuqing, \"father of hybrid rice\" Yuan Longping, nuclear submarine designer Huang Xuhua and Nobel Prize winner Tu Youyou who led the discovery of malaria drug artemisinin.\n\nSix foreigners were awarded the Friendship Medal for their great contributions to supporting China's socialist modernization, promoting exchanges and cooperation between China and foreign countries and safeguarding world peace.\n\nThey are Cuba's Raul Castro Ruz, Thai Princess Maha Chakri Sirindhorn, Tanzania's Salim Ahmed Salim, Russia's Galina Kulikova, France's Jean-Pierre Raffarin and Canada's Isabel Crook.\n\nThe national honorary titles, including \"the people's scientist,\" \"the people's artist,\" \"the people's hero\" and \"the people's role model,\" were granted to 28 prominent figures who have made great contributions and enjoy prestige in various fields.\n\nLi Zhanshu, chairman of the NPC Standing Committee, said honoring model individuals who have made great contributions to China's construction and development helps build a stronger sense of national identity and promote core socialist values.\n\nThe honoring and promotion of those outstanding individuals will inspire the Chinese people to continue striving for national rejuvenation and demonstrate China's strong will to safeguard world peace and promote human progress, Li said."}, {"url": "https://fi.wikipedia.org/wiki/Tetsuz%C5%8D_Iwamoto", "page_content": "Tetsuzō Iwamoto.\n\nTetsuzō Iwamoto (jap. 岩本 徹三, Iwamoto Tetsuzō, 15. kesäkuuta 1916 – 20. toukokuuta 1955) oli keisarillisen Japanin laivaston hävittäjä-ässä toisessa maailmansodassa. Iwamoton arvioitiin saaneen arviolta 80–87 ilmavoittoa. Todellinen lukumäärä ei todennäköisesti tule koskaan täysin selviämään. Aliluutnantti (engl. lieutenant, junior grade - tai sub-lieutenant) Iwamoto saavutti enimmät ilmavoittonsa Rabaulissa, Tyynenmeren sodassa.\n\nIwamoto syntyi Hokkaidōn prefektuurissa, kesäkuussa 1916 poliisin poikana. Nuori Tetsuzō oli omapäinen ja uhmasi auktoriteetteja. Vuonna 1934 nuori Iwamoto karkasi kotoaan ja pettäen omien vanhempiensa toiveet, maanviljelijänä toimimisesta sukutilalla. Masudan maa- ja metsätalouskoulun jälkeen, hän värväytyi keisarillisen Japanin laivastoon. Myöhemmin hän siirtyi lentokoulutukseen, sillä laivastossa lentäjillä oli muita paremmat edut.[1]\n\nTetsuzō Iwamoto aloitti taistelulentäjänä Kiinan vastaisella rintamalla. Tulikaste tuli 25. helmikuuta 1938 Nankingin taistelussa, jolloin Iwamoto oli 12. lentorykmentissä. Rykmentissä palveli myös Saburō Sakai. Kiinassa Iwamoton laskettiin saaneen 14 ilmavoittoa. Myöhemmin hän osallistui Pearl Harborin hyökkäykseen, Mitsubishi A6M Reisenillä lentotukialus Zuikakulta.\n\nIwamoto tunnettiin Rabaulilla ja Trukilla nuorempien lentäjien kouluttajana, joka suosi ”iske ja syöksy pakoon” -taktiikkaa. Iwamoto sai useita lempinimiä, kuten: ”Tiikeri-Tetsu” ja ”Zerojen ässien ässä”.\n\nIwamoton päiväkirja löydettiin hänen kuolemansa jälkeen. Siinä on ilmoitettu huima 202 viholliskoneen voittoluku. Japanilaiset sotahistorioitsijat ovat korjanneet tuota määrää huomattavasti alaspäin.[1]\n\nSakaida, Henry: Japanin laivaston ilmavoimien ässät. Osprey 5. Koala-Kustannus, 2002. ISBN 952-5186-25-3. (s. 10-12)"}, {"url": "https://senseis.xmp.net/?FujisawaShuko", "page_content": "Fujisawa Hideyuki\n\n\n\nFujisawa Hideyuki (藤沢秀行)\n\nFujisawa Hideyuki (藤沢秀行, Fujisawa Shuko, 19 June 1925 - 8 May 2009) was a Japanese, professional 9-dan. He was the father of Fujisawa Kazunari, grandfather of Fujisawa Rina, uncle of Fujisawa Hosai and teacher of Abe Yoshiteru, Mimura Tomoyasu, Kurahashi Masayuki, Fujisawa Kazunari, Amano Masafumi, Takao Shinji and Nakazawa Ayako.\n\nBiography\n\nFujisawa Hideyuki was born in Yokohama, Japan. As part of the \"Three crows,\" he was one of the best players of his generation, along with Toshiro Yamabe and Suzuki Keizo (and later Kajiwara Takeo). Despite his controversial acts, such as a excessive drinking and gambling, he played go at the highest levels when the times came. Aside from go, he was also known as a successful real estate dealer and calligrapher, having had several of his calligraphy works exhibited. Over the years he became known as \"Shuko\", an alternative reading of the characters for his given name. However, in his autobiography he stated that although he didn't mind being called Shuko, he still preferred his original name, Hideyuki.\n\nFujisawa, a student of Fukuda Masayoshi, began studying at the Nihon Kiin in 1934 and turned pro in 1940. However, it wasn't until the early 1960s that he began his title runs. His success would continue through the early 1990s, winning the 40th Oza at the age of 66.\n\nHis first major title was won in 1962, the Meijin. He then won two Asahi Pro Best Ten titles in 1965 and 1968. He held the Oza for three consecutive years from 1967 to 1969. The same year that he lost the Oza, he won the NHK Cup. The Meijin title was Fujisawa's again in 1970, and then went on a half-decade dry streak. In 1975, he won again with the 1st Tengen. Then in 1977 he began one of his crowning career achievements: winning and holding the Kisei title from its inception in 1977 to 1982, 6 consecutive years (from the age of 51 to 57). Already by 1980, nobody thought anyone else but Fujisawa would hold the Kisei. But in 1983 it was finally wrested away by the top young player, Cho Chikun. Fujisawa won the first 3 games, controlling each and every move Cho made. It looked like Fujisawa would hold the Kisei for the 7th year in a row, but Cho fought back and won 4 games, culminating in Fujisawa making a blunder from a winning position in the seventh game. This series exemplified his famous direction of play and fuseki skills and at the same time his infamous habit of mid to late-game blunders[1]. After his run of consecutive Kisei titles, the Japanese Nihon Ki-in awarded him the title of Honorary Kisei.\n\nGetting late in his years, Fujisawa wouldn't win another big title until the 40th Oza in 1992, where he played another young top-player, Kobayashi Koichi. He went on to hold the title for two years at the ages of 66 to 67, making him the record holder for the oldest player to defend a big title (a record that still stands to this day). In October of 1998, he decided to retire from the go world at the age of 74. The following year, Fujisawa was expelled from the Nihon Ki-in for selling unsanctioned rank diplomas to amateurs in protest against what he considered improper Ki-in policies. In June, 2003, the dispute was resolved and Fujisawa was reinstated in the Ki-in.\n\nHis last place of residence was Kawasaki City. Fujisawa passed away on 8 May 2009 at 7:16am in a Tokyo hospital of pneumonia.[2][3]\n\nFujisawa had a reputation for winning the first edition of many titles: the first Prime Minister's Cup (1957), the first Nihon Ki-in Nihon Ki-in Number One Position (1959), the first Meijin (1962), the first Haya-Go Championship (1969), the first Tengen (1976), and the first Kisei (1977)...\n\nAccording to Mrs. Guo Juan, Fujisawa-Sensei went to China every year to teach, bringing his students, beginning in the early 1980s. At first he used his own money, later acquiring sponsors.\n\nBooks\n\n(Incomplete list)\n\nHis Name\n\nFujisawa's name was originally Tamotsu (保), but he changed it to Hideyuki in 1943. The characters for \"Hideyuki have the alternative reading Shuko by which Fujisawa was often known. The character shu (秀, shū) is the same as the one in many Honinbo names, such as Shuwa, Shusaku, Shusai, Shuei.\n\nChinese: 藤泽秀行 (Téngzé Xiùxíng)\n\nJapanese: 藤沢 秀行 Fujisawa Hideyuki and Fujisawa Shūkō\n\nKorean: -\n\n\n\nIt is fair to say that he is best known as Shuko in Japan. He also regularly uses Shuko in his book titles, for example:\n\nShuko no Sekai (this 6 volume set is even copyright Fujisawa Shuko)\n\nShuko Ryuu Kono Itte (this one is copyright Fujisawa Hideyuki)\n\nOn the other hand when the Yomiuri Shimbun published the games from the first five Kisei matches (that earned him the title of Honorary Kisei - Meiyo Kisei), they titled the book Fujisawa Hideyuki Meiyo Kisei e no Michi More about pronouncing his name on /Discussion.\n\nThe definitive information about his name comes from the master himself via an interview published on the New in Go website here, article number 72.\n\nReferences"}]}