{"Tetsuzō Iwamoto taught many of the top players in Japan.": [{"url": "https://alchetron.com/Tetsuz%C5%8D-Iwamoto", "page_content": "As of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nIwamoto was one of the highest-scoring Japanese aces. As a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II . This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines , being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō ) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China . Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea .\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAFFlight hours: over 8,000hrs on March 1944Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar)Instrument Flight: possibleNight Flight: possible\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning\n\nQuick roll (Roll Sempoh)Coke-screw loop (Hineri-Komi Sempoh)Yo-yo turn (Suichoku-Senkai Kasoku Sempoh)\n\nFormation tactics -\n\nTwo groups linked formation attackKeeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation.Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic -\n\nAerial victories claimed in his diary\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh)\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nOrder of the Golden Kite, Fifth Class - 1 August 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal - Seventh Class - 1 August 1942\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)"}, {"url": "https://airpowerasia.com/2020/08/16/japanese-zero-fighter-air-ace-tetsuzo-iwamoto-tiger-tetsu-94-aerial-victories-greatest-japanese-fighter-ace-of-all-time/", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He joined the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during WWII, credited with at least 94 aerial victories including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. He was Nicknamed Zero Fighter Ace Kotetsu “Tiger Tetsu”.\n\nImage Source: snappygoat.com\n\nIn late 1943, Iwamoto’s air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids. Subsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nBattle of Rabaul (1942). Map depicting eastern New Guinea and New Britain. Image Source: Wikipedia\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Tetsuzo Iwamoto was one of the greatest air aces of the Imperial Japanese Navy. During his career, as per his personal records in his diary he is supposed to have achieved 242 air victories, 14 in China, 202 confirmed in the Pacific, 26 shared victories and 27 unconfirmed victories. He is supposed to have damaged two planes and destroyed two on the ground. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 87. Irrespective of the scoring system, Tetsuzō Iwamoto was the Japan’s top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS through the war. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, claimed of 202 Allied aircraft destroyed.\n\nSecond From the Right. Image Source: ameblo.jp.\n\nYoung Days\n\nTetsuzo was the third son of the Iwamoto family, born on a border town, southern part of Karafuto (now Sakhalin, Russia) on 15 June 1916. His father was a chief police officer. Later he grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo. When he was 13, his father retired and Tetsuzo moved with his family to his father’s hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored very high. Whilst he was a gifted student both academically and physically, his popularity with his teachers was poor due to his insubordinate, rebellious and sometimes outright rude nature. He was otherwise an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He was regarded as the most opinionated student in his school, and often talked down his teachers in discussions, which was considered impolite.\n\nShimane Prefecture Japan. Image Source: Wikipedia\n\nChooses a Military Career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nTetsuzo iwamoto sunglass. Image Source: snappygoat.com\n\nGets Enrolled For Flight Training\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sojyu-Renshusei flight trainee program for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th in December of that year.\n\nIn April 1936, he was sent to Kasumigaura-Ku as a probationer. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku his fighter course instructor was the famous Chitoshi Isozaki.\n\nImperial Japanese Navy (IJN) Air Ace Chitoshi Isozaki, 12 Victories. Image Source: Wikipedia\n\nJoins Naval Air Group\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai Naval Air Group, which was based both at land and onboard a carrier, for 6 months of advanced training. After this he joined Omura Kōkūtai on July 16, 1937 for operational training. He had tough training there from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa, who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto had to wait for operational debut till February 10, 1938.\n\nChina Front\n\nThe Second Sino_japanese war was already on. After combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan, ferrying to the airfield outside of Nanjing China. Tetsuzo’s ability as a fighter pilot was recognized by all on his first air mission with his squadron, the 13th Flying Group on February 25, 1938, over Nanchang, China. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nNanchang Dajiaochang Airport, China. 800 m Runway in 1938. Image Source: Wikipedia\n\nFirst Combat Mission – Four Victories\n\nOn February 25, 1938, his squadron’s fighters escorted bombers Type 96 land-based attack aircraft. 16 Chinese fighters attacked the formation, and the squadron’s leader Lieutenant Takuma was lost on this mission. Iwamoto described his first combat in his notes. During the escort mission, the squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nMitsubishi G3M Type 96 Bomber Aircraft. Image Source: alchetron.com\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o’clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o’clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nPolikarpov I-15 Soviet biplane fighter aircraft. Image Source: Wikipedia\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nOne the left, Back Row. Image Source: snappygoat.com 2\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His section leader Kuroiwa with whom he had separated had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nSoviet Polikarpov I-16 the world’s first low-wing cantilever monoplane fighter with retractable landing gear. Image Source: Wikipedia\n\n13th and 12th Flying Groups Merge\n\nOn 22 Mar 1938, the 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called “Red legs squadron” while 2nd Chutai had gear painted in blue and were called “Blue legs squadron“. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force.\n\nMITSUBISHI A5M4 Type 96 Carrier fighter (Allies called “CLAUDE”). Image Source: craymond.no-ip.info\n\nIwamoto Becomes Top IJNAS Ace in China\n\nBy Sep 1938, he had completed 82 missions, and had 14 kills on his records and had become the top Japanese IJNAS ace. His activities subsequently earned him “Order of the Golden Kite – 5th class” recommendation in 1940. In September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nJapanese Order of the Golden Kite, 5th Class. Image Source: warthunder.com\n\nPacific War – Pearl Harbour & Carol Sea\n\nAfter a tour as an instructor, Petty Officer First Class Iwamoto returned to the front line onboard the carrier Zuikaku, now flying the legendary A6M ‘Zero’ fighter. Iwamoto was airborne for the day of infamy – the attack on Pearl Harbor – but flew air cover over the carrier group itself rather than escorting the actual raid. Iwamoto was heavily involved in the air war in the Pacific from the outset, regularly leading flights of A6Ms against their American, British and Australian counterparts. Iwamoto flew in the violent air engagements of the Battle of the Coral Sea in May 1942, during which Zuikaku’s air group suffered significant losses. This necessitated a return to Japan for resupply and to train replacement aircrew which resulted in Iwamoto and his comrades missing the Battle of Midway. Small team in Japan who frantically tried to train new aircrew to stem the advancing allies.\n\nLegendary A6M ‘Zero’ fighter. Image Source: warthunder.com\n\nRabaul, New Britain\n\nAfter a year of instructional duties, Chief Petty Officer Iwamoto returned to the front line and joined the 253rd Air Group, flying A6Ms from Rabaul, New Britain, in November 1943. Involved in daily air combat, the experienced fighter leader led his cadre of increasingly junior and less experienced pilots against the might of the US Navy and USAAF. Whilst operating from Rabaul, Iwamoto filed claims for a staggering 142 enemy aircraft shot down.\n\nCaroline Islands. Image Source: Wikipedia\n\nCaroline & Philippine Islands\n\nAfter withdrawing from Rabaul, Iwamoto returned to Japan in June 1944 for a brief respite from the front line, before fighting in the skies over Formosa, then transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands during autumn and the winter. In November 1944 Iwamoto’s skill and leadership were further recognised when he was commissioned as an officer in the ranks of the Japanese Navy, holding the rank of Ensign. Iwamoto’s last operational sorties were flown with the 203rd Air Group, defending Kyushu and Okinawa in the furthest Southwest reaches of Japan against the long ranged B-29 attacks and the might of the US Navy’s carrier borne air power. The last few months of Iwamoto’s war were spent training kamikaze pilots at Iwakuni airfield on Honshu island.\n\nChiran high school girls wave farewell with cherry blossom branches to departing kamikaze pilot. Image Source: Wikipedia\n\nTactics\n\nHe was best at one-vs-one dogfights. He often employed, quick roll tactic combining with skidding sideway for sudden deceleration within 1/2 quick roll to make the opponent on the tail to overshoot. Corkscrew loop (Hineri-Komi Senpō) was a short-cut or twist-in loop tactic, also called the skidding loop. He had also mastered the High and Low Yo-yo manouvres (Suichoku-Senkai Kasoku Senpō). His favourite formation tactics, was a two group linked formation attack, where one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in a formation.\n\nLow Yo-yo. Image Source: Wikipedia\n\nAttacking the opponent formations after their mission was over and they were on the way to the regroup point, to fly back across the distance range over the sea. This tactics was taken when his own group had much fewer aircraft. Aerial Bomb attack tactic, was a twelve o’clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō). It was almost vertical diving (about 60 degree) attack because the 30 kg aerial bomb needed the releasing speed over 280 knots to work timer correctly for the explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its high flight stability.\n\n\n\nFlight leader Masao Sato with his pilots aboard Zuikaku, 6 Dec 1941, one day before Pearl Harbour Attack; Tetsuzo Iwamoto second row, right-most. Image Source: ww2db.com\n\nAnother tactic that Japanese often employed was called “Send Wolf “, which essentially meant first sending a strike against US targets, and then attacking those US aircraft that got airborne after the base had been attacked by surprise. He was very good at using the 30 kg No. 3 Aerial Bomb, which was difficult to handle, although it was used against aircraft, and caused great damage.\n\nJapanese Type 99 30kg High-explosive bomb. Image Source: commons.wikimedia.org\n\nAerial Victories Claimed in His Diary\n\nHis own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2. 94 victories is what has been assigned to him.\n\nVought F4U Corsair. Image Source: Wikipedia\n\nHe had claimed seven victories against Grumman F4F Wildcat (Coral Sea, 8 May 1942, and at Rabaul, late 1943; 19 February 1944 the escort fighters of Martin flying boat). His claimed four Lockheed P-38 Lightning P-38 victories, at – 4 (Rabaul, late 1943 – 1944). 48 victories against Vought F4U Corsair, plus one unconfirmed. These were at Rabaul, Mobara-airbase outskirts of Tokyo, during Operation Kikusui, Okinawa, March 10 – June 24, 1945). This was more than 1 in 4 of all F4U air-to-air losses during the Second World War. He claimed two Bell P-39 Airacobra at Rabaul in late 1943. He claimed one Curtiss P-40 Warhawk at Rabaul, late 1943. He also claimed 39 Grumman F6F Hellcat victories, that included 29 (at Rabaul late 1943 – Feb 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945). He claimed one Republic P-47 Thunderbolt victory over Rabaul, late 1943 – 1944. He claimed one North American Aviation P-51 Mustang over Rabaul, on 19 February 1944, the Allied 2nd air-raid of the day. He claimed to have shot four British Spitfire burned on the ground, two shot over Indian Ocean on 9 April 1942. He claimed 48 US Navy’s Douglas SBD Dauntless with seven unconfirmed, (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944). He also reportedly shot down 30 Douglas SBD Dauntless using No.3 Aerial Bombs over Rabaul, in late 1943 – 1944. He claimed five Grumman TBF Avenger, with 19 uncofirmed. These were at Rabaul, late 1943 to February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul. He claimed five Curtiss SB2C Helldiver at Rabaul late 1943 to early 1944). He also claimed five North American B-25 Mitchell medium bombers at Rabaul, starting late 1943 to 19 February 1944, during the Allied 4th air-raid of the day. He claimed two Martin B-26 Marauder American twin-engined medium bomber at Rabaul. He claimed six Consolidated B-24 Liberator heavy bombers using No. 3 Aerial Bombs and damaged two at Truk, reportedly confirmed by ground crew. He claimed one Boeing B-29 Superfortress four-engine propeller-driven heavy bomber at Kagoshima, Kyushu, Japan, April 1945. He claimed a PBY5A flying boat over Indian Ocean on April 5, 1942. He reportedly shot a Martin Mariner flying boat victory at Rabaul, on 19 February 1944. This aircraft was escorted by 12 F4Fs. He strafed three Destroyers on the night of February 5, 1944. He strafed many Landing crafts at Kerama islands, Okinawa, on night March 26, 1945. He strafed airfields Lae, Eastern New Guinea, on January 23, 1942, and Torokina, Bougainville, Solomons, on night 1944.\n\nUS Navy’s Douglas SBD Dauntless Dive Bomber. Image Source: blenderartists.org\n\nAir Kills Debate – Yet Greatest Japanese Fighter Ace of All Time.\n\nIwamoto’s final number of kills remains open to debate. A combination of the Japanese practice of crediting victories to a squadron rather than an individual, lost records and discrepancies between the confirmation process in Japan and allied nations mean that the final tally will never be known. Most sources officially credit Iwamoto with 80 kills in WW II plus 14 in China, his war diary claims 202 individual victories, 26 shared and 22 unconfirmed. An outspoken, opinionated and brash man on the ground, Iwamoto was conversely a tactically minded and cool headed aviator who favoured hit and run tactics over dog-fighting. There is a very good chance that he was, and forever will be, the greatest Japanese fighter ace of all time.\n\nZero Fighting Tiger. Image Source: snappygoat.com\n\nThe “Zero Fighting Tiger”\n\nTetsuzo had reportedly flown 8,000 hrs by March 1944. He was an operational leader, cleared for solo fighter reconnaissance and attack mission across night and over ocean. He was cleared for night carrier operations. It is believed that his aircraft in the Rabaul days was dyed in pink with more than 60 shot-down marks and was well known. The nickname is the strongest Zero Fighter pilot . Also, he seems to call himself Zero Fighting Tiger .\n\nThe Kill Marks. Tetsuzo Iwamoto’s 53-102. Single cherry = fighter, Double cherry = bomber. Art Work: Fuku. Image Source: ww2aircraft.net\n\nPromotions\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nImperial Japanese Navy Ensign Shoulder Boards\n\nAwards\n\nOrder of the Golden Kite, Fifth Class – August 1, 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal – Seventh Class – August 1, 1942\n\nRising Sun, Green Paulownia Leaves Medal – Seventh Class. Image Source: http://www.worthpoint.com\n\nPost-war life\n\nIwamoto was promoted to Sub-Lieutenant on his enforced retirement from the Japanese Navy following his nation’s surrender. The Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur’s Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\n253 Ku at Truk, 29 April 1944. Front row, extreme left, Tetsuzo Iwamoto. Image Source: http://www.tumblr.com\n\nHis wife knew him as a “wartime ace pilot”, and in fact was a fan who later married through matchmaking agency. He very methodically kept all records. Japanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (“The Truth Is This”). The program considered people such as Iwamoto the cat’s-paws of militarism. Iwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan. In 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to “Daiwabō” Co., Ltd).\n\nDeath Due Medical Complications\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis. Iwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: “When I get well, I want to fly again.”\n\nMitsubishi A6M Zero\n\nA light and nimble fighter, the Mitsubishi A6M Zero was the first carrier based fighter capable of besting its land based opponents, and was Japan’s main fighter of WWII. The Zero’s design sacrificed protection for speed, maneuverability, and long range, on the theory that superior speed and maneuverability were protections in their own right, with long range an added bonus. The A6M came as a shock to Allied pilots when first encountered, because it could outmaneuver every airplane it faced at the time. A better dogfighter than anything the Allies had at the start of the Pacific War, the Zero’s superior performance, especially in the hands of Japan’s elite naval aviators, exceeded anything the Allies had hitherto expected from the Japanese. In the war’s early days, Japanese naval aviators flying Zeroes achieved a 12:1 kill ratio.\n\nMitsubishi A6M Zero. Image Source: aviation-history.com\n\nTo counter the Zero’s advantages, American pilots adopted team work tactics such as the “Thach Weave” which required pilot pairs to work in tandem, or the “Boom and Zoom”, in which American pilots engaged the Zero only in diving attacks, as the acceleration of their heavier planes in a dive allowed them to flee if the diving attack failed. While holding considerable advantages in maneuverability and speed, the Zero’s lack of protection for either the pilot or the fuel tanks proved a steadily mounting disadvantage as the war progressed, since the heavier and more rugged American fighters could absorb considerable punishment from Zeroes, while a single machine gun burst from the American plane could disintegrate a Zero.\n\nGrumman F6F Hellcat. Image Source: warhistoryonline.com\n\nBy 1943, attrition had thinned the ranks of Japan’s elite aviators, and the Japanese Navy’s training pipeline could not produce enough replacements of similar caliber. As a result, there were fewer and fewer Japanese pilots capable of extracting the most out of the Zero’s advantages while minimizing its disadvantages. Which was bad news for the Japanese, as the quality of American aviators was increasing, due to wartime experience as well as an extensive training program that produced capable aviators at a rate Japan could not match. That was exacerbated by the introduction of new American fighters, such as the F4U Corsair and the F6F Hellcat, that were a significant improvement over their predecessors, and proved more than a match for the Zero, with greater firepower, armor, speed, and similar maneuverability.\n\nImage Source: cs.finescale.com\n\nBy 1944 the Zero was rapidly becoming obsolete, but it remained in front line service because the Japanese faced production difficulties in fielding a replacement. From its heyday at war’s beginning when it ruled the skies of the Pacific while flown by elite pilots, A6Ms were reduced by war’s end to flying kamikaze missions under the controls of barely trained novices.\n\nList of Japanese Navy Air Force aces Mitsubishi A6M “Zero”\n\nThis is a list of Imperial Navy Air aces flying the Mitsubishi Zero fighter during the Pacific War.\n\nTetsuzo Iwamoto: 94 (including 14 in China / personal diary accounts for a total of 202 kills)\n\nShoichi Sugita: 70 (some sources say 80)\n\nSaburō Sakai: 64 (2 in China)\n\nTakeo Okumura: 54 (4 in China)\n\nHiroyoshi Nishizawa: 36 official (102 claimed)\n\nToshio Ohta: 34\n\nKazuo Sugino: 32\n\nJunichi Sasai: 27\n\nSito Origami: 10 (9 in China, 1 disputed)\n\nToshiyuki Sueda: 9\n\nShōichi Sugita. Second Highest Japanese Ace. Image Source: wikidata.org\n\nFamous Japanese Units\n\nThe air unit “Kōkūtai” (air group) with most air aces, was the Tainan Kōkūtai (in Formosa). It was the most famous group. They operated from Rabaul, New Britain and acquired their legendary fame over Taihoku (The Philippines), the Dutch East Indies, Lae and Buna (New Guinea) and, in the last stages of war, in defense of mainland Japan. Saburō Sakai was another member in this unit after Dutch Indies operations, from the Denpasar base on Bali.\n\nFighter pilots of the Tainan Air Group pose at Lae in June 1942. Several of these aviators would be among the top Japanese aces, including Saburō Sakai (middle row, second from left), and Hiroyoshi Nishizawa (standing, first on left). Image Source: Wikipedia\n\nOthers famous units with air aces were 3rd Air Corps (including Yoshiro Hashiguchi), 253rd Air Corps (with Tetsuzo Iwamoto and Hiroyoshi Nishizawa among its members), Genzan Air Group, and other groups.\n\nThe Imperial Japanese Navy Air Service, similar to the German Luftwaffe idea of organizing an “all aces” select unit Jagdverband 44 equipped with Messerschmitt Me 262A-1a jet fighters, decided to create an all-ace unit (the 343 Kōkūtai) with Kawanishi N1K2-J fighters towards the end of the conflict; this was commanded by Minoru Genda.\n\nKawanishi N1K2-J “343 A-15” of 301st Fighter Squadron/343rd Naval Air Group, Matsuyama air base, 10 April 1945. Image Source: Wikipedia\n\nInformation Source Credits: This Article has used information mostly from Wikipedia and other open sources. Credit is also given to Mark Barber, War Thunder Historical Consultant, a former pilot from the British Royal Navy’s Fleet Air Arm. Information was drawn from Historical Section of the War Thunder forums and the Ace of the Month series. Credit is also given to Peter Chen’s World War II Database (ww2db.com), and historycollection.com for coverage of top World War II fighters.\n\nLead Picture Credit: Wikipedia"}, {"url": "https://infogalactic.com/info/Tetsuz%C5%8D_Iwamoto", "page_content": "From Infogalactic: the planetary knowledge core\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō?) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever undertaken by the Imperial Japanese Navy Air Force against air raids mounted by U.S. and Allied air units.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by the U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata estimated the figure at about 80 or more than 87 in their research work in January 1971. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF, .[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the second world war. He fought over the Indian and the Pacific Ocean from north to south, and trained his young pilots even in the last months of the war.[5]\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron (2nd Chutai in had gear painted in blue amd were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flght hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF,[7] IJAAF[8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter renaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him.[10]) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him.[11]) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front.[12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nVictories\n\nChina Front, Feb.1938 - Sep.1938\n\n14 victories: I-15, I-16 (citation as the IJNAF top ace)\n\nWorld War II, Pacific Front and Indian Front, 8 December 1941 - 15 August 1945\n\n228 aerial victories: victories - 202 shared victories - 26\n\nunconfirmed - 27 damaged - 2 destroyed on the ground - 2\n\nAircraft types he confronted\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.[citation needed]\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nMovie"}, {"url": "https://www.primidi.com/tetsuz%C5%8D_iwamoto", "page_content": "Tetsuzō Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本徹三, Iwamoto Tetsuzō) (15 June 1916- 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever for the Imperial Japanese Navy Air Force against air raids of U.S. and Allied air units.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval system, the IJNAF scoring system was based on the standard the Royal Navy, the Royal Air Force (RAF) adopted since World War I till World War II, different from the scoring system defined by U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata tried to reckon the figure at about 80 or more than 87 in their research work in Jan. 1971, Dr. Izawa wrote that Iwamoto was virtually the top ace of IJNAF, in Dec. 1993.\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was the few survived successors of the IJNAF airman's heritage, who flew over the Indian and the Pacific Ocean from north to south, showed his skilled fights against the Allied units and trained his young junior pilots even in the last months of the war."}, {"url": "https://warbirdfanatics.com/2022/09/06/3-most-feared-deadliest-wwii-japanese-soldiers/", "page_content": "YouTube / WarsofTheWorld\n\nAt the beginning of the 20th century, when Japan’s empire began to grow in Asia. However, few considered it anything more than a regional power as compared to empires such as Britain, France, and Russia.\n\nThat would change during the Russo-Japanese war where Japan stunned the world by defeating the Russian Navy. It also forced the world to accept for the first time that an Asian country was a top player in military and diplomatic matters.\n\nIn this post, we’re going to talk about the three most feared and deadliest soldiers of the Empire of Japan:\n\nMochitsura Hashimoto\n\nHashimoto took command of the i-58- a vessel that was able to launch manned suicide torpedoes, four of which could be carried at one time. Hashimoto and the i-58 would launch several keiten from December 1944 until the end of the war.\n\nOn July 29, 1945, the navigation officer spotted a ship approaching from the East. Hashimoto knew it was an American warship, which he incorrectly identified as an Idaho class battleship. However, this was the heavy cruiser USS Indianapolis. The ship was on a top-secret mission delivering key parts and nuclear material for the Hiroshima and Nagasaki atomic bombs.\n\nCuriously, the ship wasn’t zigzagging to evade submarine attack despite the Americans knowing Japanese subs were in the area. Taking advantage of the opportunity, Hashimoto submerged the sub, firing a spread of six types of 95 torpedoes at two-second intervals. Hashimoto decided to attack again, but as the next torpedoes are being loaded, the Indianapolis capsized and sank.\n\nOut of the 1195 men on board, approximately 300 went down with the Indianapolis. 890 more men would die from dehydration, exposure, and shark attacks before survivors were rescued 4 days later.\n\nThe incident resulted in the greatest single loss of life at sea from a single ship in the history of the US Navy. It was also one of the final significant victories of the war for Japan’s submarines.\n\nTetsuzō Iwamoto\n\nTetsuzō Iwamoto is Japan’s official highest-scoring ace. He was deployed to join the war in China in 1938. By the time he went back to Japan, he had 14 kills to his credit, making him the highest-scoring pilot of the conflict.\n\nHe would then rejoin the fleet for the attack on Pearl Harbor, participate in the crucial battle of the Coral Sea claiming several Wildcat fighters, and defend Japan in a near relentless Allied onslaught. He was also tasked to train Japanese fearsome kamikaze pilots.\n\nAfter the war, Iwamoto wasn’t initially recognized as Japan’s leading ace. However, post-war research tilted in his favor, and he was officially credited with 80 kills in WWII and 14 kills in China.\n\nKiyoshi Ogawa\n\nThere are many lethal kamikaze attacks, but perhaps one of the most successful was carried out by Kiyoshi Ogawa of the Imperial Japanese Navy.\n\nIn May 1945, the allies were closing in on the Japanese home islands. One of the crucial aircraft carriers deployed near the island of Okinawa was the USS Bunker Hill- the same ship Ogawa was forced to attack.\n\nFollowing his lead, the two of them approached their target in their Mitsubishi Zero fighters, carrying a single 550-pound bomb. Interestingly, despite having defensive forces around the carrier, the kamikaze pilots weren’t spotted until it was too late.\n\nHis leader, Lt. Yasunori, released his bomb onto the deck before slamming his plane into the American ship. The bomb slammed into the wooden deck and into the sea where it exploded. Yasunori’s plane destroyed up to 34 armed and fueled American planes.\n\nMoments later, Ogawa made his attack releasing a bomb, it smashed through the deck. But unlike the Yasunori’s bomb, it exploded on the ship, killing numerous airmen and sailors. All in all, 353 crew members of the Bunker Hill were killed, and many more were injured.\n\nThe ship was forced out of the war, and Ogawa’s attack was a major success for the kamikazes. It was considered the most devastating suicide attack in the Pacific war."}, {"url": "https://everything.explained.today/Tetsuzo_Iwamoto/", "page_content": "Tetsuzō Iwamoto Explained\n\nLieutenant Junior Grade was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively.[2]\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.[3] [4]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993, Izawa wrote that Iwamoto was virtually the top ace of the IJNAS.[5]\n\nAs of mid-1944, there remained only two IJNAS fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war.[6] Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored As on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[7]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sōju-Renshūsei (Sōren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Sōju-Renshūsei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sōju-Renshūsei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sōju-Renshūsei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki. In December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938, over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938, over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a Split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzō Iwamoto became the top IJNAS ace. His activities subsequently earned him Order of the Golden Kite – 5th class recommendation in 1940.\n\nIn September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAS\n\nFlight hours: over 8,000 hrs in March 1944\n\n(net hours, not tripled as with a US single-seated fighter pilot. It was very unusual among IJNAS,[8] IJAAS[9] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAS, IJAAS veteran pilots.)\n\nOceanic Transition: possible, navigating and leading his fighter chutai (without Radar)\n\nInstrument Flight: possible\n\nNight Flight: possible\n\nSingle-seat Fighter reconnaissance and attack mission across night ocean: possible\n\nNight landing: possible with simple approach lighting system\n\nNight carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAS could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAS officer pilots could fly on instruments.\n\nTactics\n\nSingle to single dogfight tactic – from losing to winning [10]\n\nQuick roll (Roll Senpō)\n\n(up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo Shibata promoted, his men developed and taught him.[11])\n\nCorkscrew loop (Hineri-Komi Senpō)\n\n(short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu Mochizuki's special, Section leader and Warrant Officer Toshio Kuroiwa trained him.[12])\n\nYo-yo turn (Suichoku-Senkai Kasoku Senpō)\n\n(Lt. JG Sadaaki Akamatsu's special at China front.[13])Formation tactics –\n\nTwo groups linked formation attack\n\none section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section.\n\nKeeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation.\n\nAttacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much fewer aircraft.No.3 Aerial Bomb attack tactic[14] –\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō)\n\nAlmost vertical diving (about 60 degree) attack because the 30 kg No. 3 Aerial Bomb needs the releasing speed over 280 knots to work timer correctly for 1st small explosion.\n\nInverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nAerial victories claimed in his diary\n\n(World War II, 8 December 1941 – July 1942, April 1943 – 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[15]\n\nF4F victories – 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 – 10AM 19 February 1944 the escort fighters of Martin flying boat)\n\nP-38 victories – 4 (Rabaul, late 1943 – 1944)\n\nF4U victories – 48; unconfirmed 1 (Rabaul, late 1943 – February 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water – divine wind), Okinawa, March 10 – June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories – 2 (Rabaul, late 1943)\n\nP-40 victory – 1 (Rabaul, late 1943)\n\nF6F victories – 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945)\n\nP-47 victory – 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory – 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) – 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories – 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944)\n\nSBD w/No.3 Aerial Bomb victories – 30 (Rabaul, late 1943 – 1944)\n\nTBF victories – 5; unconfirmed 19 (Rabaul, late 1943 – 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories – 5 (Rabaul, late 1943 – 1944)\n\nB-25 victories – 8 (Rabaul, late 1943 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories – 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories – 6; w/No. 3 Aerial Bomb victories (SH) 24, damaged 2 (Truk, 6 March – June 1944, confirmed by ground members)\n\nB-29 victory – 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory – (SH) 1 (Indian Sea, April 5, 1942)\n\nMartin Mariner flying boat victory – (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers – 3 (Rapopo Rabaul, Night February 5, 1944)\n\nStrafed Landing Craft – some hundreds (Kerama islands, Okinawa, night March 26, 1945)\n\nStrafed Airfields – Lae, Eastern New Guinea, January 23, 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nThe Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur's Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (\"The Truth Is This\"). The program considered people such as Iwamoto the cat's-paws of militarism.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan.\n\nIn 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to \"Daiwabō\" Co., Ltd, 大和紡績).\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis.\n\nIwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: \"When I get well, I want to fly again.\"\n\nReferences\n\nBook: Iwamoto , Tetsuzo . c. 1940s . Iwamoto air combat log notebooks (posthumous detail manuscripts in 3 volumes of notebooks, found 1970s from his family), 1939-1945 .\n\nBook: Iwamoto , Tetsuzo . February 25, 1986 . 1st. pub. July 10, 1972 . Zero-sen Gekitsui-Oh (means, Zero Fighter Ace, based on the posthumous manuscripts) . Kyo-no-wadai-sha . 4-87565-121-X .\n\nBook: Tsunoda , Kazuo . 1990 . Shura no Tsubasa (means, The Asura's Wing) . Kohjin-sha . Tokyo . 4-7698-1041-5.\n\nBook: Odaka , Noritsura . 1985 . Seishun Zerosen Tai (means, Young Zero Fighters) . Kohjin-sha . Tokyo . 0-14-016561-4 . registration .\n\nOsuo. Katsuhiko. Ledet. Michel. amp . Tetsuzo Iwamoto, le meilleur score, sans la notoriété . Avions: Toute l'Aéronautique et son histoire . July 2001 . 100 . 41–46 . Tetsuzo Iwamoto, the Highest Score Without the Notoriety . fr . 1243-8650.\n\nBook: Kusaka , Ryunosuke . Apr 1952 . Rengō Kantai (which translates as \"Grand Fleet\" or \"Combined Fleet\") . Mainichi Shinbunsha (Mainichi Newspaper) . Tokyo .\n\nBook: Zero Fighter Pilots Association . 2004 . Saburo Abe's chapter, Spitfire Gekitsui-Ki (means, My combat against Spitfires on the VJ-day) . ZeroSen, Kaku Tatakaeri! (means, We are Zero fighter pilots, these were our fights!) . SeishunNesco-sha . Tokyo .\n\nBook: Zero Fighter Pilots Association . 1987 . List of naval fighter pilots where he died, who survived . Kaigun Sentokitai-Shi (means, Our History of Naval Fighter Units) . Hara-shobo . Tokyo . 4-562-01842-9.\n\nBook: Izawa , Yasuho . Hata, Ikuhiko . 1971 . Kohku-Jyoho, Nippon Kaigun SentouKi Tai (means, The Japanese Naval Fighter Units in World War II) . KanToh-sha .\n\nBook: Hata , Ikuhiko . Izawa, Yasuho . 1987 . Japanese Naval Aces and Fighter Units in World War II . Naval Institute Press . Annapolis .\n\nBook: Isozaki , Chitosi . 1986 . Maru Magazine, Chokuei Sentouki-Tai Solomon ni Hateru tomo (means, Although we escourt fighter unit pilots had to die over the battle of Solomon) . Ushio-shoboh . Tokyo .\n\nBook: Abe , Masaharu . December 1993 . Maru Magazine exstra issue, Watashi ga mita futari no gekitsui-oh (means, Two Aces I met - Nishizawa and Iwamoto) . Ushio-shoboh . Tokyo .\n\nBook: Takizawa , Kenji . Dec 1984 . Maru Magazine, Toyoh Zerosen-Tai Simatsu-Ki (means, The beginning and the end of Zero Fighter Unit attacking overseas to Saipan) . Ushio-shoboh . Tokyo .\n\nBook: Nakayama , Mitsuo . July 1981 . Maru Magazine, B-24 hunter champion, Zero Fighter type52, my one hundred days of combat report . Ushio-shoboh .\n\nBook: Shibata , Takeo . 1981 . Maru Magazine, Hittsui Senten Sempoh Kotohajime (means, The Beginning of IJNAF Quick Roll tactics, I developed) . Ushio-shoboh . Tokyo .\n\nBook: Genda , Minoru . 2002 . Kaigun Kokutai Simatsu-Ki, Hasshin (means, The Rise and Fall of IJNAF, first volume -TakeOff-) . Bunshun-bunko .\n\nBook: Sakaida , Henry . Imperial Japanese Navy Aces 1937-45 . 28 August 1998 . Ospray . 1-85532-727-9.\n\nBook: Shores , Christopher . Norman Franks . Russell Guest . January 1991 . Above the Trenches: A Complete Record of the Fighter Aces and Units of the British Empire Air Forces, 1915-1920 . Grub Street . London . 978-0-948817-19-9.\n\nBook: Franks , Norman L. R. . Frank W. Bailey . May 1992 . Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914-1918 . Grub Street . London .\n\nBook: Tillman , Barrett . Ch.9 victory credits and wildcat evaluation . Wildcat Aces of World War 2 . Ospray .\n\nBook: Andrew , Thomas . 1992 . appendices ace list - Royal Navy Aces . Royal Navy Aces of World War 2 . Ospray . 978-1-84603-178-6.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)\n\nNotes and References"}, {"url": "https://www.liquisearch.com/tetsuz%C5%8D_iwamoto", "page_content": "Tetsuzō Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本徹三, Iwamoto Tetsuzō) (15 June 1916- 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever for the Imperial Japanese Navy Air Force against air raids of U.S. and Allied air units.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval system, the IJNAF scoring system was based on the standard the Royal Navy, the Royal Air Force (RAF) adopted since World War I till World War II, different from the scoring system defined by U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata tried to reckon the figure at about 80 or more than 87 in their research work in Jan. 1971, Dr. Izawa wrote that Iwamoto was virtually the top ace of IJNAF, in Dec. 1993.\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was the few survived successors of the IJNAF airman's heritage, who flew over the Indian and the Pacific Ocean from north to south, showed his skilled fights against the Allied units and trained his young junior pilots even in the last months of the war."}, {"url": "https://ww2db.com/person_bio.php?person_id=561", "page_content": "Home\n\n» People\n\n» Tetsuzo Iwamoto\n\n\n\n\n\nTetsuzo Iwamoto\n\nSurname Iwamoto Given Name Tetsuzo Born 15 Jun 1916 Died 20 May 1955 Country Japan Category Military-Air Gender Male\n\nContributor: C. Peter Chen\n\nww2dbaseTetsuzo Iwamoto was born in Karafuto Prefecture, Japan (now southern Sakhalin Island). He grew up in Sapporo, Hokkaido, Japan after his father was appointed the chief of police of that city. In 1929, his father retired, and the whole family moved to his father's home town, Masuda, Shimane Prefecture, Japan, where he studied at the Masuda Agricultural and Forestry High School. In 1934, upon graduating high school, he was sent to a large city to take the college entrance exams, but instead he applied for and passed the exam for the air arm of the Japanese navy. In 1936, he served aboard carrier Ryujo with the rating of mechanic 2nd class. He began flight training on 28 Apr 1936. On 1 Nov 1936, he was promoted to the rating of mechanic 1st class. On 26 Dec, he graduated from the program and was promoted to airman 1st class. He was assigned to the Saeki Air Group for six months of advanced training, and then was transferred to the Omura Naval Air Group on 16 Jul 1937.\n\nww2dbaseOn 10 Feb 1938, Iwamoto was transferred to the front lines as he flew from Omura Airfield near Nagasaki, Japan to Nanjing, China, thus beginning his career in WW2. With the 13th Flying Group's fighter squadron in China, his first combat mission took place on 25 Feb over Nanchang, China as he escorted Type 96 attack aircraft. The flight was attacked by 16 Chinese fighters. During the dogfight, Iwamoto claimed 3 confirmed and 1 probable kills, but was scolded after he returned for his overly-aggressive actions. On 22 Mar 1938, the 13th Flying Group's fighter squadron was merged with the 12th Fighter Squadron. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara. He was ordered back to Japan in Sep 1938; at this point, he had 14 kills on his records and was one of the aces among Japanese airmen in China.\n\nww2dbaseBack in Japan, Iwamoto served as a member of the Saiki Air Group as a trainer. In 1940, he was awarded the Order of the Golden Kite 5th Class. During the Pacific War, he was initially a pilot with the carrier Zuikaku from Dec 1941 to May 1942, during which time he participated in the Battle of the Coral Sea. In late 1943, he was sent to Rabaul, New Britain. In 1944, he was successively transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands. In Oct 1944, he was promoted to the rank of ensign. During the Okinawa Campaign, he participated in Operation Kikusui. His own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2.\n\nww2dbaseAfter the war, Iwamoto was summoned for several interviews and interrogations by the Allied administration. Although he was eventually cleared and thus not declared a war criminal, he was still unable to get a job due to potential employers wishing to please the occupation administration. In 1952, the Allied occupation gave control of Japan back to the Japanese people, and he was finally able to get a job at a local spinning mill. In the summer of 1953, he underwent a series of surgeries for enteritis (mis-diagnosed) and appendicitis (actual cause of stomach pains). Shortly after, he complained of back pains and received another surgery. He passed away in his home town of Masuda after getting septicemia after the final surgery. According to his wife, his last words were \"[w]hen I get well, I want to fly again\".\n\nww2dbaseSource: Wikipedia.\n\nLast Major Revision: Jan 2010\n\nTetsuzo Iwamoto Timeline\n\nPhotographs"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=4676259&lang=en", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993, Izawa wrote that Iwamoto was virtually the top ace of the IJNAS.\n\nAs of mid-1944, there remained only two IJNAS fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored As on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sōju-Renshūsei (Sōren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Sōju-Renshūsei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sōju-Renshūsei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sōju-Renshūsei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938, over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938, over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a Split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzō Iwamoto became the top IJNAS ace. His activities subsequently earned him Order of the Golden Kite – 5th class recommendation in 1940.\n\nIn September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAS Flight hours: over 8,000 hrs in March 1944 (net hours, not tripled as with a US single-seated fighter pilot. It was very unusual among IJNAS, IJAAS fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAS, IJAAS veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter reconnaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAS could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAS officer pilots could fly on instruments.\n\nTactics\n\nSingle to single dogfight tactic – from losing to winning\n\nQuick roll (Roll Senpō) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo Shibata promoted, his men developed and taught him.) Corkscrew loop (Hineri-Komi Senpō) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu Mochizuki's special, Section leader and Warrant Officer Toshio Kuroiwa trained him.) Yo-yo turn (Suichoku-Senkai Kasoku Senpō) (Lt. JG Sadaaki Akamatsu's special at China front. )\n\nFormation tactics –\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much fewer aircraft.\n\nNo.3 Aerial Bomb attack tactic –"}, {"url": "https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Tetsuzo_Iwamoto.html", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nIwamoto was one of the highest-scoring Japanese aces. As a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF.[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war.[5] Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\n\n\n\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flight hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF, [7] IJAAF [8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter reconnaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him. [10] ) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him. [11] ) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front. [12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nAerial victories claimed in his diary\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nIwamoto, Tetsuzo (194x-?). Iwamoto air combat log notebooks (posthumous detail manuscripts in 3 volumes of notebooks, found 1970s from his family) , 1939-1945 .\n\nIwamoto, Tetsuzo (Feb 25, 1986) [1st. pub. July 10, 1972]. Zero-sen Gekitsui-Oh (means, Zero Fighter Ace, based on the posthumous manuscripts) . Kyo-no-wadai-sha. ISBN 4-87565-121-X.\n\nTsunoda, Kazuo (1990). Shura no Tsubasa (means, The Asura's Wing) . Tokyo: Kohjin-sha. ISBN 4-7698-1041-5.\n\nOdaka, Noritsura (1985). Seishun Zerosen Tai (means, Young Zero Fighters) . Tokyo: Kohjin-sha. ISBN 0-14-016561-4.\n\nKusaka, Ryunosuke (Apr 1952). Rengō Kantai (which translates as \"Grand Fleet\" or \"Combined Fleet\") . Tokyo: Mainichi Shinbunsha (Mainichi Newspaper).\n\nZero Fighter Pilots Association (2004). \"Saburo Abe's chapter, Spitfire Gekitsui-Ki (means, My combat against Spitfires on the VJ-day)\". ZeroSen, Kaku Tatakaeri! (means, We are Zero fighter pilots, these were our fights!) . Tokyo: SeishunNesco-sha.\n\nZero Fighter Pilots Association (1987). \"List of naval fighter pilots where he died, who survived\". Kaigun Sentokitai-Shi (means, Our History of Naval Fighter Units) . Tokyo: Hara-shobo. ISBN 4-562-01842-9.\n\nIzawa, Yasuho; Hata, Ikuhiko (1971). Kohku-Jyoho, Nippon Kaigun SentouKi Tai (means, The Japanese Naval Fighter Units in World War II) . KanToh-sha.\n\nHata, Ikuhiko; Izawa, Yasuho (1987). Japanese Naval Aces and Fighter Units in World War II . Annapolis: Naval Institute Press.\n\nIsozaki, Chitosi (1986). Maru Magazine, Chokuei Sentouki-Tai Solomon ni Hateru tomo (means, Although we escourt fighter unit pilots had to die over the battle of Solomon) . Tokyo: Ushio-shoboh.\n\nAbe, Masaharu (December 1993). Maru Magazine exstra issue, Watashi ga mita futari no gekitsui-oh (means, Two Aces I met - Nishizawa and Iwamoto) . Tokyo: Ushio-shoboh.\n\nTakizawa, Kenji (Dec 1984). Maru Magazine, Toyoh Zerosen-Tai Simatsu-Ki (means, The beginning and the end of Zero Fighter Unit attacking overseas to Saipan) . Tokyo: Ushio-shoboh.\n\nNakayama, Mitsuo (July 1981). Maru Magazine, B-24 hunter champion, Zero Fighter type52, my one hundred days of combat report . Ushio-shoboh.\n\nShibata, Takeo (1981). Maru Magazine, Hittsui Senten Sempoh Kotohajime (means, The Beginning of IJNAF Quick Roll tactics, I developed) . Tokyo: Ushio-shoboh.\n\nGenda, Minoru (2002). Kaigun Kokutai Simatsu-Ki, Hasshin (means, The Rise and Fall of IJNAF, first volume -TakeOff-) . Bunshun-bunko.\n\nSakaida, Henry. Imperial Japanese Navy Aces 1937-45 . Ospray. ISBN 1-85532-727-9.\n\nShores, Christopher; Norman Franks; Russell Guest (January 1991). Above the Trenches: A Complete Record of the Fighter Aces and Units of the British Empire Air Forces, 1915-1920 . London: Grub Street. ISBN 978-0-948817-19-9.\n\nFranks, Norman L. R.; Frank W. Bailey (May 1992). Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914-1918 . London: Grub Street.\n\nTillman, Barrett. \"Ch.9 victory credits and wildcat evaluation\". Wildcat Aces of World War 2 . Ospray.\n\nAndrew, Thomas (1992). \"appendices ace list - Royal Navy Aces\". Royal Navy Aces of World War 2. Ospray. ISBN 978-1-84603-178-6.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)"}], "Tetsuzō Iwamoto was also a teacher": [{"url": "https://airpowerasia.com/2020/08/16/japanese-zero-fighter-air-ace-tetsuzo-iwamoto-tiger-tetsu-94-aerial-victories-greatest-japanese-fighter-ace-of-all-time/", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He joined the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during WWII, credited with at least 94 aerial victories including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. He was Nicknamed Zero Fighter Ace Kotetsu “Tiger Tetsu”.\n\nImage Source: snappygoat.com\n\nIn late 1943, Iwamoto’s air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids. Subsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nBattle of Rabaul (1942). Map depicting eastern New Guinea and New Britain. Image Source: Wikipedia\n\nAs a result of the Japanese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Tetsuzo Iwamoto was one of the greatest air aces of the Imperial Japanese Navy. During his career, as per his personal records in his diary he is supposed to have achieved 242 air victories, 14 in China, 202 confirmed in the Pacific, 26 shared victories and 27 unconfirmed victories. He is supposed to have damaged two planes and destroyed two on the ground. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 87. Irrespective of the scoring system, Tetsuzō Iwamoto was the Japan’s top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS through the war. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, claimed of 202 Allied aircraft destroyed.\n\nSecond From the Right. Image Source: ameblo.jp.\n\nYoung Days\n\nTetsuzo was the third son of the Iwamoto family, born on a border town, southern part of Karafuto (now Sakhalin, Russia) on 15 June 1916. His father was a chief police officer. Later he grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo. When he was 13, his father retired and Tetsuzo moved with his family to his father’s hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored very high. Whilst he was a gifted student both academically and physically, his popularity with his teachers was poor due to his insubordinate, rebellious and sometimes outright rude nature. He was otherwise an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He was regarded as the most opinionated student in his school, and often talked down his teachers in discussions, which was considered impolite.\n\nShimane Prefecture Japan. Image Source: Wikipedia\n\nChooses a Military Career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nTetsuzo iwamoto sunglass. Image Source: snappygoat.com\n\nGets Enrolled For Flight Training\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the class 34th Sojyu-Renshusei flight trainee program for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th in December of that year.\n\nIn April 1936, he was sent to Kasumigaura-Ku as a probationer. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku his fighter course instructor was the famous Chitoshi Isozaki.\n\nImperial Japanese Navy (IJN) Air Ace Chitoshi Isozaki, 12 Victories. Image Source: Wikipedia\n\nJoins Naval Air Group\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai Naval Air Group, which was based both at land and onboard a carrier, for 6 months of advanced training. After this he joined Omura Kōkūtai on July 16, 1937 for operational training. He had tough training there from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa, who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto had to wait for operational debut till February 10, 1938.\n\nChina Front\n\nThe Second Sino_japanese war was already on. After combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan, ferrying to the airfield outside of Nanjing China. Tetsuzo’s ability as a fighter pilot was recognized by all on his first air mission with his squadron, the 13th Flying Group on February 25, 1938, over Nanchang, China. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nNanchang Dajiaochang Airport, China. 800 m Runway in 1938. Image Source: Wikipedia\n\nFirst Combat Mission – Four Victories\n\nOn February 25, 1938, his squadron’s fighters escorted bombers Type 96 land-based attack aircraft. 16 Chinese fighters attacked the formation, and the squadron’s leader Lieutenant Takuma was lost on this mission. Iwamoto described his first combat in his notes. During the escort mission, the squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nMitsubishi G3M Type 96 Bomber Aircraft. Image Source: alchetron.com\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o’clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o’clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nPolikarpov I-15 Soviet biplane fighter aircraft. Image Source: Wikipedia\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nOne the left, Back Row. Image Source: snappygoat.com 2\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His section leader Kuroiwa with whom he had separated had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nSoviet Polikarpov I-16 the world’s first low-wing cantilever monoplane fighter with retractable landing gear. Image Source: Wikipedia\n\n13th and 12th Flying Groups Merge\n\nOn 22 Mar 1938, the 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called “Red legs squadron” while 2nd Chutai had gear painted in blue and were called “Blue legs squadron“. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force.\n\nMITSUBISHI A5M4 Type 96 Carrier fighter (Allies called “CLAUDE”). Image Source: craymond.no-ip.info\n\nIwamoto Becomes Top IJNAS Ace in China\n\nBy Sep 1938, he had completed 82 missions, and had 14 kills on his records and had become the top Japanese IJNAS ace. His activities subsequently earned him “Order of the Golden Kite – 5th class” recommendation in 1940. In September 1938, 22-year-old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nJapanese Order of the Golden Kite, 5th Class. Image Source: warthunder.com\n\nPacific War – Pearl Harbour & Carol Sea\n\nAfter a tour as an instructor, Petty Officer First Class Iwamoto returned to the front line onboard the carrier Zuikaku, now flying the legendary A6M ‘Zero’ fighter. Iwamoto was airborne for the day of infamy – the attack on Pearl Harbor – but flew air cover over the carrier group itself rather than escorting the actual raid. Iwamoto was heavily involved in the air war in the Pacific from the outset, regularly leading flights of A6Ms against their American, British and Australian counterparts. Iwamoto flew in the violent air engagements of the Battle of the Coral Sea in May 1942, during which Zuikaku’s air group suffered significant losses. This necessitated a return to Japan for resupply and to train replacement aircrew which resulted in Iwamoto and his comrades missing the Battle of Midway. Small team in Japan who frantically tried to train new aircrew to stem the advancing allies.\n\nLegendary A6M ‘Zero’ fighter. Image Source: warthunder.com\n\nRabaul, New Britain\n\nAfter a year of instructional duties, Chief Petty Officer Iwamoto returned to the front line and joined the 253rd Air Group, flying A6Ms from Rabaul, New Britain, in November 1943. Involved in daily air combat, the experienced fighter leader led his cadre of increasingly junior and less experienced pilots against the might of the US Navy and USAAF. Whilst operating from Rabaul, Iwamoto filed claims for a staggering 142 enemy aircraft shot down.\n\nCaroline Islands. Image Source: Wikipedia\n\nCaroline & Philippine Islands\n\nAfter withdrawing from Rabaul, Iwamoto returned to Japan in June 1944 for a brief respite from the front line, before fighting in the skies over Formosa, then transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands during autumn and the winter. In November 1944 Iwamoto’s skill and leadership were further recognised when he was commissioned as an officer in the ranks of the Japanese Navy, holding the rank of Ensign. Iwamoto’s last operational sorties were flown with the 203rd Air Group, defending Kyushu and Okinawa in the furthest Southwest reaches of Japan against the long ranged B-29 attacks and the might of the US Navy’s carrier borne air power. The last few months of Iwamoto’s war were spent training kamikaze pilots at Iwakuni airfield on Honshu island.\n\nChiran high school girls wave farewell with cherry blossom branches to departing kamikaze pilot. Image Source: Wikipedia\n\nTactics\n\nHe was best at one-vs-one dogfights. He often employed, quick roll tactic combining with skidding sideway for sudden deceleration within 1/2 quick roll to make the opponent on the tail to overshoot. Corkscrew loop (Hineri-Komi Senpō) was a short-cut or twist-in loop tactic, also called the skidding loop. He had also mastered the High and Low Yo-yo manouvres (Suichoku-Senkai Kasoku Senpō). His favourite formation tactics, was a two group linked formation attack, where one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in a formation.\n\nLow Yo-yo. Image Source: Wikipedia\n\nAttacking the opponent formations after their mission was over and they were on the way to the regroup point, to fly back across the distance range over the sea. This tactics was taken when his own group had much fewer aircraft. Aerial Bomb attack tactic, was a twelve o’clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kōka Senpō). It was almost vertical diving (about 60 degree) attack because the 30 kg aerial bomb needed the releasing speed over 280 knots to work timer correctly for the explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its high flight stability.\n\n\n\nFlight leader Masao Sato with his pilots aboard Zuikaku, 6 Dec 1941, one day before Pearl Harbour Attack; Tetsuzo Iwamoto second row, right-most. Image Source: ww2db.com\n\nAnother tactic that Japanese often employed was called “Send Wolf “, which essentially meant first sending a strike against US targets, and then attacking those US aircraft that got airborne after the base had been attacked by surprise. He was very good at using the 30 kg No. 3 Aerial Bomb, which was difficult to handle, although it was used against aircraft, and caused great damage.\n\nJapanese Type 99 30kg High-explosive bomb. Image Source: commons.wikimedia.org\n\nAerial Victories Claimed in His Diary\n\nHis own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2. 94 victories is what has been assigned to him.\n\nVought F4U Corsair. Image Source: Wikipedia\n\nHe had claimed seven victories against Grumman F4F Wildcat (Coral Sea, 8 May 1942, and at Rabaul, late 1943; 19 February 1944 the escort fighters of Martin flying boat). His claimed four Lockheed P-38 Lightning P-38 victories, at – 4 (Rabaul, late 1943 – 1944). 48 victories against Vought F4U Corsair, plus one unconfirmed. These were at Rabaul, Mobara-airbase outskirts of Tokyo, during Operation Kikusui, Okinawa, March 10 – June 24, 1945). This was more than 1 in 4 of all F4U air-to-air losses during the Second World War. He claimed two Bell P-39 Airacobra at Rabaul in late 1943. He claimed one Curtiss P-40 Warhawk at Rabaul, late 1943. He also claimed 39 Grumman F6F Hellcat victories, that included 29 (at Rabaul late 1943 – Feb 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945). He claimed one Republic P-47 Thunderbolt victory over Rabaul, late 1943 – 1944. He claimed one North American Aviation P-51 Mustang over Rabaul, on 19 February 1944, the Allied 2nd air-raid of the day. He claimed to have shot four British Spitfire burned on the ground, two shot over Indian Ocean on 9 April 1942. He claimed 48 US Navy’s Douglas SBD Dauntless with seven unconfirmed, (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944). He also reportedly shot down 30 Douglas SBD Dauntless using No.3 Aerial Bombs over Rabaul, in late 1943 – 1944. He claimed five Grumman TBF Avenger, with 19 uncofirmed. These were at Rabaul, late 1943 to February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul. He claimed five Curtiss SB2C Helldiver at Rabaul late 1943 to early 1944). He also claimed five North American B-25 Mitchell medium bombers at Rabaul, starting late 1943 to 19 February 1944, during the Allied 4th air-raid of the day. He claimed two Martin B-26 Marauder American twin-engined medium bomber at Rabaul. He claimed six Consolidated B-24 Liberator heavy bombers using No. 3 Aerial Bombs and damaged two at Truk, reportedly confirmed by ground crew. He claimed one Boeing B-29 Superfortress four-engine propeller-driven heavy bomber at Kagoshima, Kyushu, Japan, April 1945. He claimed a PBY5A flying boat over Indian Ocean on April 5, 1942. He reportedly shot a Martin Mariner flying boat victory at Rabaul, on 19 February 1944. This aircraft was escorted by 12 F4Fs. He strafed three Destroyers on the night of February 5, 1944. He strafed many Landing crafts at Kerama islands, Okinawa, on night March 26, 1945. He strafed airfields Lae, Eastern New Guinea, on January 23, 1942, and Torokina, Bougainville, Solomons, on night 1944.\n\nUS Navy’s Douglas SBD Dauntless Dive Bomber. Image Source: blenderartists.org\n\nAir Kills Debate – Yet Greatest Japanese Fighter Ace of All Time.\n\nIwamoto’s final number of kills remains open to debate. A combination of the Japanese practice of crediting victories to a squadron rather than an individual, lost records and discrepancies between the confirmation process in Japan and allied nations mean that the final tally will never be known. Most sources officially credit Iwamoto with 80 kills in WW II plus 14 in China, his war diary claims 202 individual victories, 26 shared and 22 unconfirmed. An outspoken, opinionated and brash man on the ground, Iwamoto was conversely a tactically minded and cool headed aviator who favoured hit and run tactics over dog-fighting. There is a very good chance that he was, and forever will be, the greatest Japanese fighter ace of all time.\n\nZero Fighting Tiger. Image Source: snappygoat.com\n\nThe “Zero Fighting Tiger”\n\nTetsuzo had reportedly flown 8,000 hrs by March 1944. He was an operational leader, cleared for solo fighter reconnaissance and attack mission across night and over ocean. He was cleared for night carrier operations. It is believed that his aircraft in the Rabaul days was dyed in pink with more than 60 shot-down marks and was well known. The nickname is the strongest Zero Fighter pilot . Also, he seems to call himself Zero Fighting Tiger .\n\nThe Kill Marks. Tetsuzo Iwamoto’s 53-102. Single cherry = fighter, Double cherry = bomber. Art Work: Fuku. Image Source: ww2aircraft.net\n\nPromotions\n\nSailor Fourth Class (Seaman Recruit) – June 1, 1934\n\nSailor Third Class (Seaman) – November 15, 1934\n\nSailor Second Class (Able Seaman) – November 2, 1935\n\nSailor First Class (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Class – May 1, 1938\n\nPetty Officer Second Class (Petty Officer) – November 1, 1939\n\nPetty Officer First Class (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nImperial Japanese Navy Ensign Shoulder Boards\n\nAwards\n\nOrder of the Golden Kite, Fifth Class – August 1, 1942\n\nOrder of the Rising Sun, Green Paulownia Leaves Medal – Seventh Class – August 1, 1942\n\nRising Sun, Green Paulownia Leaves Medal – Seventh Class. Image Source: http://www.worthpoint.com\n\nPost-war life\n\nIwamoto was promoted to Sub-Lieutenant on his enforced retirement from the Japanese Navy following his nation’s surrender. The Allied Occupation Forces searched for war criminals in the Japanese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur’s Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\n253 Ku at Truk, 29 April 1944. Front row, extreme left, Tetsuzo Iwamoto. Image Source: http://www.tumblr.com\n\nHis wife knew him as a “wartime ace pilot”, and in fact was a fan who later married through matchmaking agency. He very methodically kept all records. Japanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Jitsu wa Kō Da (“The Truth Is This”). The program considered people such as Iwamoto the cat’s-paws of militarism. Iwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left Japan. In 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to “Daiwabō” Co., Ltd).\n\nDeath Due Medical Complications\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis. Iwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: “When I get well, I want to fly again.”\n\nMitsubishi A6M Zero\n\nA light and nimble fighter, the Mitsubishi A6M Zero was the first carrier based fighter capable of besting its land based opponents, and was Japan’s main fighter of WWII. The Zero’s design sacrificed protection for speed, maneuverability, and long range, on the theory that superior speed and maneuverability were protections in their own right, with long range an added bonus. The A6M came as a shock to Allied pilots when first encountered, because it could outmaneuver every airplane it faced at the time. A better dogfighter than anything the Allies had at the start of the Pacific War, the Zero’s superior performance, especially in the hands of Japan’s elite naval aviators, exceeded anything the Allies had hitherto expected from the Japanese. In the war’s early days, Japanese naval aviators flying Zeroes achieved a 12:1 kill ratio.\n\nMitsubishi A6M Zero. Image Source: aviation-history.com\n\nTo counter the Zero’s advantages, American pilots adopted team work tactics such as the “Thach Weave” which required pilot pairs to work in tandem, or the “Boom and Zoom”, in which American pilots engaged the Zero only in diving attacks, as the acceleration of their heavier planes in a dive allowed them to flee if the diving attack failed. While holding considerable advantages in maneuverability and speed, the Zero’s lack of protection for either the pilot or the fuel tanks proved a steadily mounting disadvantage as the war progressed, since the heavier and more rugged American fighters could absorb considerable punishment from Zeroes, while a single machine gun burst from the American plane could disintegrate a Zero.\n\nGrumman F6F Hellcat. Image Source: warhistoryonline.com\n\nBy 1943, attrition had thinned the ranks of Japan’s elite aviators, and the Japanese Navy’s training pipeline could not produce enough replacements of similar caliber. As a result, there were fewer and fewer Japanese pilots capable of extracting the most out of the Zero’s advantages while minimizing its disadvantages. Which was bad news for the Japanese, as the quality of American aviators was increasing, due to wartime experience as well as an extensive training program that produced capable aviators at a rate Japan could not match. That was exacerbated by the introduction of new American fighters, such as the F4U Corsair and the F6F Hellcat, that were a significant improvement over their predecessors, and proved more than a match for the Zero, with greater firepower, armor, speed, and similar maneuverability.\n\nImage Source: cs.finescale.com\n\nBy 1944 the Zero was rapidly becoming obsolete, but it remained in front line service because the Japanese faced production difficulties in fielding a replacement. From its heyday at war’s beginning when it ruled the skies of the Pacific while flown by elite pilots, A6Ms were reduced by war’s end to flying kamikaze missions under the controls of barely trained novices.\n\nList of Japanese Navy Air Force aces Mitsubishi A6M “Zero”\n\nThis is a list of Imperial Navy Air aces flying the Mitsubishi Zero fighter during the Pacific War.\n\nTetsuzo Iwamoto: 94 (including 14 in China / personal diary accounts for a total of 202 kills)\n\nShoichi Sugita: 70 (some sources say 80)\n\nSaburō Sakai: 64 (2 in China)\n\nTakeo Okumura: 54 (4 in China)\n\nHiroyoshi Nishizawa: 36 official (102 claimed)\n\nToshio Ohta: 34\n\nKazuo Sugino: 32\n\nJunichi Sasai: 27\n\nSito Origami: 10 (9 in China, 1 disputed)\n\nToshiyuki Sueda: 9\n\nShōichi Sugita. Second Highest Japanese Ace. Image Source: wikidata.org\n\nFamous Japanese Units\n\nThe air unit “Kōkūtai” (air group) with most air aces, was the Tainan Kōkūtai (in Formosa). It was the most famous group. They operated from Rabaul, New Britain and acquired their legendary fame over Taihoku (The Philippines), the Dutch East Indies, Lae and Buna (New Guinea) and, in the last stages of war, in defense of mainland Japan. Saburō Sakai was another member in this unit after Dutch Indies operations, from the Denpasar base on Bali.\n\nFighter pilots of the Tainan Air Group pose at Lae in June 1942. Several of these aviators would be among the top Japanese aces, including Saburō Sakai (middle row, second from left), and Hiroyoshi Nishizawa (standing, first on left). Image Source: Wikipedia\n\nOthers famous units with air aces were 3rd Air Corps (including Yoshiro Hashiguchi), 253rd Air Corps (with Tetsuzo Iwamoto and Hiroyoshi Nishizawa among its members), Genzan Air Group, and other groups.\n\nThe Imperial Japanese Navy Air Service, similar to the German Luftwaffe idea of organizing an “all aces” select unit Jagdverband 44 equipped with Messerschmitt Me 262A-1a jet fighters, decided to create an all-ace unit (the 343 Kōkūtai) with Kawanishi N1K2-J fighters towards the end of the conflict; this was commanded by Minoru Genda.\n\nKawanishi N1K2-J “343 A-15” of 301st Fighter Squadron/343rd Naval Air Group, Matsuyama air base, 10 April 1945. Image Source: Wikipedia\n\nInformation Source Credits: This Article has used information mostly from Wikipedia and other open sources. Credit is also given to Mark Barber, War Thunder Historical Consultant, a former pilot from the British Royal Navy’s Fleet Air Arm. Information was drawn from Historical Section of the War Thunder forums and the Ace of the Month series. Credit is also given to Peter Chen’s World War II Database (ww2db.com), and historycollection.com for coverage of top World War II fighters.\n\nLead Picture Credit: Wikipedia"}, {"url": "https://infogalactic.com/info/Tetsuz%C5%8D_Iwamoto", "page_content": "From Infogalactic: the planetary knowledge core\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō?) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever undertaken by the Imperial Japanese Navy Air Force against air raids mounted by U.S. and Allied air units.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by the U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata estimated the figure at about 80 or more than 87 in their research work in January 1971. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF, .[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the second world war. He fought over the Indian and the Pacific Ocean from north to south, and trained his young pilots even in the last months of the war.[5]\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron (2nd Chutai in had gear painted in blue amd were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flght hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF,[7] IJAAF[8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter renaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him.[10]) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him.[11]) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front.[12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nVictories\n\nChina Front, Feb.1938 - Sep.1938\n\n14 victories: I-15, I-16 (citation as the IJNAF top ace)\n\nWorld War II, Pacific Front and Indian Front, 8 December 1941 - 15 August 1945\n\n228 aerial victories: victories - 202 shared victories - 26\n\nunconfirmed - 27 damaged - 2 destroyed on the ground - 2\n\nAircraft types he confronted\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.[citation needed]\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nMovie"}, {"url": "https://ww2db.com/person_bio.php?person_id=561", "page_content": "Home\n\n» People\n\n» Tetsuzo Iwamoto\n\n\n\n\n\nTetsuzo Iwamoto\n\nSurname Iwamoto Given Name Tetsuzo Born 15 Jun 1916 Died 20 May 1955 Country Japan Category Military-Air Gender Male\n\nContributor: C. Peter Chen\n\nww2dbaseTetsuzo Iwamoto was born in Karafuto Prefecture, Japan (now southern Sakhalin Island). He grew up in Sapporo, Hokkaido, Japan after his father was appointed the chief of police of that city. In 1929, his father retired, and the whole family moved to his father's home town, Masuda, Shimane Prefecture, Japan, where he studied at the Masuda Agricultural and Forestry High School. In 1934, upon graduating high school, he was sent to a large city to take the college entrance exams, but instead he applied for and passed the exam for the air arm of the Japanese navy. In 1936, he served aboard carrier Ryujo with the rating of mechanic 2nd class. He began flight training on 28 Apr 1936. On 1 Nov 1936, he was promoted to the rating of mechanic 1st class. On 26 Dec, he graduated from the program and was promoted to airman 1st class. He was assigned to the Saeki Air Group for six months of advanced training, and then was transferred to the Omura Naval Air Group on 16 Jul 1937.\n\nww2dbaseOn 10 Feb 1938, Iwamoto was transferred to the front lines as he flew from Omura Airfield near Nagasaki, Japan to Nanjing, China, thus beginning his career in WW2. With the 13th Flying Group's fighter squadron in China, his first combat mission took place on 25 Feb over Nanchang, China as he escorted Type 96 attack aircraft. The flight was attacked by 16 Chinese fighters. During the dogfight, Iwamoto claimed 3 confirmed and 1 probable kills, but was scolded after he returned for his overly-aggressive actions. On 22 Mar 1938, the 13th Flying Group's fighter squadron was merged with the 12th Fighter Squadron. On 29 Apr 1938, he fought Chinese Air Force fighters and scored several victories, and was later awarded a citation by Commander Tsukahara. He was ordered back to Japan in Sep 1938; at this point, he had 14 kills on his records and was one of the aces among Japanese airmen in China.\n\nww2dbaseBack in Japan, Iwamoto served as a member of the Saiki Air Group as a trainer. In 1940, he was awarded the Order of the Golden Kite 5th Class. During the Pacific War, he was initially a pilot with the carrier Zuikaku from Dec 1941 to May 1942, during which time he participated in the Battle of the Coral Sea. In late 1943, he was sent to Rabaul, New Britain. In 1944, he was successively transferred to Truk Atoll in the Caroline Islands and then the Philippine Islands. In Oct 1944, he was promoted to the rank of ensign. During the Okinawa Campaign, he participated in Operation Kikusui. His own diary claimed that he had downed 202 aircraft during the Second Sino-Japanese War and the Pacific War while sharing credit with others for another 26 kills; this translated to somewhere between 80 and 90 kills based on the scoring system used by American airmen during WW2.\n\nww2dbaseAfter the war, Iwamoto was summoned for several interviews and interrogations by the Allied administration. Although he was eventually cleared and thus not declared a war criminal, he was still unable to get a job due to potential employers wishing to please the occupation administration. In 1952, the Allied occupation gave control of Japan back to the Japanese people, and he was finally able to get a job at a local spinning mill. In the summer of 1953, he underwent a series of surgeries for enteritis (mis-diagnosed) and appendicitis (actual cause of stomach pains). Shortly after, he complained of back pains and received another surgery. He passed away in his home town of Masuda after getting septicemia after the final surgery. According to his wife, his last words were \"[w]hen I get well, I want to fly again\".\n\nww2dbaseSource: Wikipedia.\n\nLast Major Revision: Jan 2010\n\nTetsuzo Iwamoto Timeline\n\nPhotographs"}, {"url": "https://www.liquisearch.com/tetsuz%C5%8D_iwamoto/early_life", "page_content": "Early Life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school."}, {"url": "https://www.geni.com/people/Tetsuz%C5%8D-Iwamoto/6000000190527516822", "page_content": "About Tetsuzō Iwamoto\n\nhttps://en.wikipedia.org/wiki/Tetsuz%C5%8D_Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial Japan during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively."}, {"url": "https://www.liquisearch.com/tetsuz%C5%8D_iwamoto", "page_content": "Tetsuzō Iwamoto\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本徹三, Iwamoto Tetsuzō) (15 June 1916- 20 May 1955) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top naval ace of the campaign, credited with 14 aerial victories. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of the hardest air combat ever for the Imperial Japanese Navy Air Force against air raids of U.S. and Allied air units.\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nLike many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nAs a result of the Japanese use of the British naval system, the IJNAF scoring system was based on the standard the Royal Navy, the Royal Air Force (RAF) adopted since World War I till World War II, different from the scoring system defined by U.S. Navy Air Force and U.S. Marine Air Force during World War II. Dr. Izawa and Professor Hata tried to reckon the figure at about 80 or more than 87 in their research work in Jan. 1971, Dr. Izawa wrote that Iwamoto was virtually the top ace of IJNAF, in Dec. 1993.\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's best ace. Iwamoto was known as the Chūtai leader (Flying Company, Squadron of 8 to 16 fighters). Iwamoto was the few survived successors of the IJNAF airman's heritage, who flew over the Indian and the Pacific Ocean from north to south, showed his skilled fights against the Allied units and trained his young junior pilots even in the last months of the war."}, {"url": "https://www.celebsagewiki.com/tetsuzo-iwamoto", "page_content": "Age, Biography and Wiki\n\nTetsuzō Iwamoto (Zero Fighter Ace - Kotetsu \"Tiger Tetsu\") was born on 15 June, 1916 in (now Sakhalin, Russia). Discover Tetsuzō Iwamoto's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 39 years old?\n\nPopular As Zero Fighter Ace - Kotetsu \"Tiger Tetsu\" Occupation N/A Age 39 years old Zodiac Sign Gemini Born 15 June 1916 Birthday 15 June Birthplace (now Sakhalin, Russia) Date of death (1955-05-20) Died Place N/A Nationality Russia\n\nWe recommend you to check the complete list of Famous People born on 15 June. He is a member of famous with the age 39 years old group.\n\nTetsuzō Iwamoto Height, Weight & Measurements\n\nAt 39 years old, Tetsuzō Iwamoto height not available right now. We will update Tetsuzō Iwamoto's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nTetsuzō Iwamoto Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Tetsuzō Iwamoto worth at the age of 39 years old? Tetsuzō Iwamoto’s income source is mostly from being a successful . He is from Russia. We have estimated Tetsuzō Iwamoto's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nTetsuzō Iwamoto Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.howold.co/person/tetsuzo-iwamoto/biography", "page_content": "Tetsuzō Iwamoto Biography\n\n*anese World War II flying ace\n\nLieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō, 15 June 1916 – 20 May 1955) was one of the top scoring aces among Imperial *anese Navy Air Service (IJNAS) fighter pilots. He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as one of the top aces of the Imperial *an during World War II, credited with at least 80 aerial victories, including 14 victories in China. Subsequently, he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea. Iwamoto decorated his planes with victory markings of cherry blossom flowers, with a single or double blossom flower referring to a shot down enemy fighter or bomber aircraft respectively.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.\n\nSubsequent *ignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nAs a result of the *anese use of the British naval practices, the IJNAS scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993, Izawa wrote that Iwamoto was virtually the top ace of the IJNAS.\n\nAs of mid-1944, there remained only two IJNAS fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was *an's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAS from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war. Like many *anese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, *an. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane Prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored As on his school report.\n\nHe was an active and nimble boy. He joined a school club br* band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war *an. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and p*ed the examination for acceptance as an Imperial *anese naval airman 4th cl*, and was promoted to 3rd cl* 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.\n\nIn 1936, when he was a naval mechanic 2nd cl* and a crewman on the light aircraft carrier Ryūjō, he studied hard and p*ed the difficult IJNAS exam, taken by thousands of applicants. He was enrolled in the cl* 34th Sōju-Renshūsei (Sōren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the cl* 34th Sōju-Renshūsei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the cl* 34th Sōju-Renshūsei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st cl*. Finally on December 26, he graduated 34th cl* of Sōju-Renshūsei, was promoted to airman 1st cl* (old rank name of pre-war *an, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st cl* Toshio Kuroiwa (rank grade was at that time), who was the IJNAS legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938, over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzō Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū *an to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938, over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese fighters attacked, and the squadron's leader Lieutenant Ta*a was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an al*ude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an al*ude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his al*ude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an al*ude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an al*ude of 200 m and fired a burst. The I-16 was surprised and made a Split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzō Iwamoto became the top IJNAS ace. His activities subsequently earned him Order of the Golden Kite – 5th cl* recommendation in 1940.\n\nIn September 1938, 22-year-old Iwamoto was ordered back to *an, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Cl*-A of IJNASFlight hours: over 8,000 hrs in March 1944(net hours, not tripled as with a US single-seated fighter pilot. It was very unusual among IJNAS, IJAAS fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAS, IJAAS veteran pilots.)Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar)Instrument Flight: possibleNight Flight: possibleSingle-seat Fighter reconnaissance and attack mission across night ocean: possibleNight landing: possible with simple approach lighting systemNight carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAS could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAS officer pilots could fly on instruments.\n\nTactics\n\nSingle to single dogfight tactic – from losing to winning\n\nQuick roll ()(up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo Shibata promoted, his men developed and taught him.)Corkscrew loop ()(short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu Mochizuki's special, Section leader and Warrant Officer Toshio Kuroiwa trained him.)Yo-yo turn ()(Lt. JG Sadaaki Akamatsu's special at China front. )\n\nFormation tactics –\n\nTwo groups linked formation attackone section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher al*ude to cover and support the offence section.Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation.Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much fewer aircraft.\n\nNo.3 Aerial Bomb attack tactic –\n\nAerial victories claimed in his diary\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight ()Almost vertical diving (about 60 degree) attack because the 30 kg No. 3 Aerial Bomb needs the releasing speed over 280 knots to work timer correctly for 1st small explosion.Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\n(World War II, 8 December 1941 – July 1942, April 1943 – 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)\n\nF4F victories – 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 – 10AM 19 February 1944 the escort fighters of Martin flying boat)\n\nP-38 victories – 4 (Rabaul, late 1943 – 1944)\n\nF4U victories – 48; unconfirmed 1 (Rabaul, late 1943 – February 1944; Mobara-airbase outskirts of Tokyo, *an, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water – divine wind), Okinawa, March 10 – June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories – 2 (Rabaul, late 1943)\n\nP-40 victory – 1 (Rabaul, late 1943)\n\nF6F victories – 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, March 10 – June 15, 1945)\n\nP-47 victory – 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory – 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) – 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories – 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 – February 1944; Truk 28, 29 April 1944; Battle off Formosa, 12 October 1944)\n\nSBD w/No.3 Aerial Bomb victories – 30 (Rabaul, late 1943 – 1944)\n\nTBF victories – 5; unconfirmed 19 (Rabaul, late 1943 – 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories – 5 (Rabaul, late 1943 – 1944)\n\nB-25 victories – 8 (Rabaul, late 1943 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories – 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories – 6; w/No. 3 Aerial Bomb victories (SH) 24, damaged 2 (Truk, 6 March – June 1944, confirmed by ground members)\n\nB-29 victory – 1 (Kagoshima, Kyushu, *an, April 1945)\n\nPBY5A flying boat victory – (SH) 1 (Indian Sea, April 5, 1942)\n\nMartin Mariner flying boat victory – (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers – 3 (Rapopo Rabaul, Night February 5, 1944)\n\nStrafed Landing Craft – some hundreds (Kerama islands, Okinawa, night March 26, 1945)\n\nStrafed Airfields – Lae, Eastern New Guinea, January 23, 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nfrom the corresponding article in the *anese Wikipedia\n\nSailor Fourth Cl* (Seaman Recruit) – June 1, 1934\n\nSailor Third Cl* (Seaman) – November 15, 1934\n\nSailor Second Cl* (Able Seaman) – November 2, 1935\n\nSailor First Cl* (Leading Seaman) – December 26, 1935\n\nPetty Officer Third Cl* – May 1, 1938\n\nPetty Officer Second Cl* (Petty Officer) – November 1, 1939\n\nPetty Officer First Cl* (Chief Petty Officer) – May 1, 1941\n\nChief Petty Officer (regrading of Petty Officer First Cl*) – November 1, 1942\n\nCommissioned an Ensign – November 1, 1944\n\nPromoted to Sub-Lieutenant upon retirement – September 5, 1945\n\nAwards\n\nfrom the corresponding article in the *anese Wikipedia\n\nOrder of the Golden Kite, Fifth Cl* – August 1, 1942\n\nPost-war life\n\nThe Allied Occupation Forces searched for war criminals in the *anese Officer Corps. Iwamoto was summoned twice for questioning to Douglas MacArthur's Allied GHQ office in Tokyo. Although he managed to avoid being declared a war criminal, he was nevertheless blacklisted from public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. In general, anyone who had been an officer in the IJA or IJN was disliked by the Allied Occupation Forces.\n\n*anese journalists who had promoted *anese militarism campaign during the war started a radio program of anti-militarism postwar called Shin-Sō wa Kō Da (\"The Truth Is This\"). The program was initiated by GHQ and it considered people people such as Iwamoto the cat's-paws of militarism.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held, after which, in the spring of 1952, the Allied Occupation Forces finally left *an.\n\nIn 1952, Iwamoto finally obtained employment at the Masuda spinning mill of Daiwa Bōseki (since renamed to \"Daiwabō\" Co., Ltd, 大和紡績 ).\n\nIn the summer of 1953, Iwamoto developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis. After a series of operations, he complained of a backache. Doctors decided to operate on him again. For reasons which are not entirely clear, the surgical team decided to remove three or four ribs without anesthesia. This led to sepsis.\n\nIwamoto died on 20 May 1955, at the age of just 38 years old. His wife recalled his final words: \"When I get well, I want to fly again.\"\n\nNotes\n\nReferences\n\nIwamoto, Tetsuzo (c. 1940s). Iwamoto air combat log notebooks (posthumous detail m*cripts in 3 volumes of notebooks, found 1970s from his family), 1939-1945 .\n\n. Iwamoto, Tetsuzo (February 25, 1986) . Zero-sen Gekitsui-Oh (means, Zero Fighter Ace, based on the posthumous m*cripts) . Kyo-no-wadai-sha. ISBN:4-87565-121-X.\n\n. Kyo-no-wadai-sha. ISBN:4-87565-121-X. Tsunoda, Kazuo (1990). Shura no Tsubasa (means, The Asura's Wing) . Tokyo: Kohjin-sha. ISBN:4-7698-1041-5.\n\n. Tokyo: Kohjin-sha. ISBN:4-7698-1041-5. Odaka, Noritsura (1985). Seishun Zerosen Tai (means, Young Zero Fighters) . Tokyo: Kohjin-sha. ISBN:0-14-016561-4.\n\n. Tokyo: Kohjin-sha. ISBN:0-14-016561-4. Osuo, Katsuhiko & Ledet, Michel (July 2001). \"Tetsuzo Iwamoto, le meilleur score, sans la notoriété\" . Avions: Toute l'Aéronautique et son histoire (in French) (100): 41–46. ISSN:1243-8650.\n\n(in French) (100): 41–46. ISSN:1243-8650. Kusaka, Ryunosuke (Apr 1952). Rengō Kantai (which translates as \"Grand Fleet\" or \"Combined Fleet\") . Tokyo: Mainichi Shinbunsha (Mainichi Newspaper).\n\n. Tokyo: Mainichi Shinbunsha (Mainichi Newspaper). Zero Fighter Pilots *ociation (2004). \"Saburo Abe's chapter, Spitfire Gekitsui-Ki (means, My combat against Spitfires on the VJ-day)\". ZeroSen, Kaku Tatakaeri! (means, We are Zero fighter pilots, these were our fights!) . Tokyo: SeishunNesco-sha.\n\n. Tokyo: SeishunNesco-sha. Zero Fighter Pilots *ociation (1987). \"List of naval fighter pilots where he died, who survived\". Kaigun Sentokitai-Shi (means, Our History of Naval Fighter Units) . Tokyo: Hara-shobo. ISBN:4-562-01842-9.\n\n. Tokyo: Hara-shobo. ISBN:4-562-01842-9. Izawa, Yasuho; Hata, Ikuhiko (1971). Kohku-Jyoho, Nippon Kaigun SentouKi Tai (means, The *anese Naval Fighter Units in World War II) . KanToh-sha.\n\n. KanToh-sha. Hata, Ikuhiko; Izawa, Yasuho (1987). *anese Naval Aces and Fighter Units in World War II . Annapolis: Naval Ins*ute Press.\n\n. Annapolis: Naval Ins*ute Press. Isozaki, Chitosi (1986). Maru Magazine, Chokuei Sentouki-Tai Solomon ni Hateru tomo (means, Although we escourt fighter unit pilots had to die over the battle of Solomon) . Tokyo: Ushio-shoboh.\n\n. Tokyo: Ushio-shoboh. Abe, Masaharu (December 1993). Maru Magazine exstra issue, Watashi ga mita futari no gekitsui-oh (means, Two Aces I met - Nishizawa and Iwamoto) . Tokyo: Ushio-shoboh.\n\n. Tokyo: Ushio-shoboh. Takizawa, Kenji (Dec 1984). Maru Magazine, Toyoh Zerosen-Tai Simatsu-Ki (means, The beginning and the end of Zero Fighter Unit attacking overseas to Saipan) . Tokyo: Ushio-shoboh.\n\n. Tokyo: Ushio-shoboh. Nakayama, Mitsuo (July 1981). Maru Magazine, B-24 hunter champion, Zero Fighter type52, my one hundred days of combat report . Ushio-shoboh.\n\n. Ushio-shoboh. Shibata, Takeo (1981). Maru Magazine, Hittsui Senten Sempoh Kotohajime (means, The Beginning of IJNAF Quick Roll tactics, I developed) . Tokyo: Ushio-shoboh.\n\n. Tokyo: Ushio-shoboh. Genda, Minoru (2002). Kaigun Kokutai Simatsu-Ki, H*hin (means, The Rise and Fall of IJNAF, first volume -TakeOff-) . Bunshun-bunko.\n\n. Bunshun-bunko. Sakaida, Henry (28 August 1998). Imperial *anese Navy Aces 1937-45 . Ospray. ISBN:1-85532-727-9.\n\n. Ospray. ISBN:1-85532-727-9. S*s, Christopher; Norman Franks; Russell Guest (January 1991). Above the Trenches: A Complete Record of the Fighter Aces and Units of the British Empire Air Forces, 1915-1920 . London: Grub Street. ISBN:978-0-948817-19-9.\n\n. London: Grub Street. ISBN:978-0-948817-19-9. Franks, Norman L. R.; Frank W. Bailey (May 1992). Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914-1918 . London: Grub Street.\n\n. London: Grub Street. Tillman, Barrett. \"Ch.9 victory credits and wildcat evaluation\". Wildcat Aces of World War 2 . Ospray.\n\n. Ospray. Andrew, Thomas (1992). \"appendices ace list - Royal Navy Aces\". Royal Navy Aces of World War 2. Ospray. ISBN:978-1-84603-178-6.\n\nMovie"}, {"url": "https://en.unionpedia.org/i/Tetsuz%C5%8D_Iwamoto", "page_content": "Tetsuzō Iwamoto Lieutenant Junior Grade was one of the top scoring aces among Imperial Japanese Navy Air Service (IJNAS) fighter pilots. [1]\n\n17 relations: Aces of the Pacific, Battle of the Coral Sea, Fighter pilot, Index of World War II articles (T), June 1916, Kamikaze, List of Japanese government and military commanders of World War II, List of Japanese Navy Air Force aces (Mitsubishi A6M), List of military instructors and trainers of the Empire of Japan, List of World War II aces from Japan, List of World War II flying aces, Order of the Golden Kite, Order of the Rising Sun, Purge (occupied Japan), Reki-jo, Tetsu, Tetsuzō.\n\nAces of the Pacific is a combat flight simulator game developed by Dynamix and published by Sierra Entertainment in 1992.\n\nNew!!: Tetsuzō Iwamoto and Aces of the Pacific · See more »\n\nThe Battle of the Coral Sea, fought from 4 to 8 May 1942, was a major naval battle between the Imperial Japanese Navy (IJN) and naval and air forces from the United States and Australia, taking place in the Pacific Theatre of World War II.\n\nNew!!: Tetsuzō Iwamoto and Battle of the Coral Sea · See more »\n\nA fighter pilot is a military aviator trained to engage in air-to-air combat while in the cockpit of a fighter aircraft.\n\nNew!!: Tetsuzō Iwamoto and Fighter pilot · See more »\n\n# T-26.\n\nNew!!: Tetsuzō Iwamoto and Index of World War II articles (T) · See more »\n\nThe following events occurred in June 1916.\n\nNew!!: Tetsuzō Iwamoto and June 1916 · See more »\n\n, officially, were a part of the Japanese Special Attack Units of military aviators who initiated suicide attacks for the Empire of Japan against Allied naval vessels in the closing stages of the Pacific campaign of World War II, designed to destroy warships more effectively than possible with conventional air attacks.\n\nNew!!: Tetsuzō Iwamoto and Kamikaze · See more »\n\nNo description.\n\nNew!!: Tetsuzō Iwamoto and List of Japanese government and military commanders of World War II · See more »\n\nThis is a list of Imperial Navy Air aces flying the Mitsubishi Zero fighter during the Pacific War.\n\nNew!!: Tetsuzō Iwamoto and List of Japanese Navy Air Force aces (Mitsubishi A6M) · See more »\n\nA list of Imperial Army-Navy personnel with responsibility for military teaching and training of new recruits.\n\nNew!!: Tetsuzō Iwamoto and List of military instructors and trainers of the Empire of Japan · See more »\n\nThis is a list of fighter aces in World War II from Japan, as officially credited by the Imperial Japanese government.\n\nNew!!: Tetsuzō Iwamoto and List of World War II aces from Japan · See more »\n\nThis is a list of World War II flying aces.\n\nNew!!: Tetsuzō Iwamoto and List of World War II flying aces · See more »\n\nThe was an order of the Empire of Japan, established on 12 February 1890 by Emperor Meiji \"in commemoration of Jimmu Tennō, the Romulus of Japan.\" It was officially abolished by the Supreme Commander of the Allied Powers of Occupied Japan in 1947 after World War II.\n\nNew!!: Tetsuzō Iwamoto and Order of the Golden Kite · See more »\n\nThe is a Japanese order, established in 1875 by Emperor Meiji of Japan.\n\nNew!!: Tetsuzō Iwamoto and Order of the Rising Sun · See more »\n\nThe Purge in Japan was the prohibition of designated Japanese people from engaging in public service, by order of the General Headquarters of the Allied Forces (GHQ) after Japan's defeat in World War II.\n\nNew!!: Tetsuzō Iwamoto and Purge (occupied Japan) · See more »\n\nare Japanese female history buffs, who may also use the speech and mannerisms of pre-industrial Japan in their social gatherings.\n\nNew!!: Tetsuzō Iwamoto and Reki-jo · See more »\n\nTetsu is a Japanese given name, usually for males.\n\nNew!!: Tetsuzō Iwamoto and Tetsu · See more »\n\nTetsuzō, Tetsuzo or Tetsuzou (written: 徹三 or 鉄三) is a masculine Japanese given name.\n\nNew!!: Tetsuzō Iwamoto and Tetsuzō · See more »\n\nRedirects here:\n\nOgawa Tetsuya, Tetsuzo Iwamoto, 岩本徹三.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Tetsuzō_Iwamoto"}, {"url": "https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Tetsuzo_Iwamoto.html", "page_content": "Lieutenant Junior Grade Tetsuzō Iwamoto (岩本 徹三, Iwamoto Tetsuzō) was one of the top scoring aces among Imperial Japanese Navy Air Force (IJNAF) fighter pilots.[1] He entered the Imperial Navy in 1934 and completed pilot training in December 1936. His first combat occurred over China in early 1938. He emerged as the top ace of the Imperial Japan during WWII, credited with at least 87 aerial victories including 14 victories in China. Subsequently he flew Zeros from the aircraft carrier Zuikaku from December 1941 to May 1942, including at the Battle of the Coral Sea.\n\nIn late 1943, Iwamoto's air group was sent to Rabaul, New Britain, resulting in three months of air combat against Allied air raids.[2][3]\n\nSubsequent assignments were Truk Atoll in the Carolines and the Philippines, being commissioned an ensign in October 1944. Following the evacuation of the Philippines, Iwamoto served in home defense and trained kamikaze pilots.\n\nIwamoto was one of the highest-scoring Japanese aces. As a result of the Japanese use of the British naval practices, the IJNAF scoring system was based on the system the Royal Navy and the Royal Air Force (RAF) adopted from World War I until World War II. This system differed from the scoring system used by some other nations during World War II. Research by academics surnamed Izawa and Hata in 1971 estimated his score at about 80 or more than 87. In December 1993 Izawa wrote that Iwamoto was virtually the top ace of the IJNAF.[4]\n\nAs of mid-1944, there remained only two IJNAF fighter pilots who were credited with over 100 victories. Depending on various totals cited, Tetsuzō Iwamoto or Hiroyoshi Nishizawa was Japan's top ace. Iwamoto was known as the Chūtai leader (Flying Company, squadron of 8 to 16 fighters). Iwamoto was one of few survivors of the IJNAF from the early part of the Second World War. He fought over the Indian and the Pacific Ocean from north to south, and trained young pilots even in the last months of the war.[5] Like many Japanese veterans, Iwamoto was reported to have fallen into depression after the war. His diary was found after his death, with claims of 202 Allied aircraft destroyed.\n\n\n\n\n\nEarly life\n\nTetsuzo was the third son of the Iwamoto family. He was born on a border town, southern part of Karafuto 15 June 1916, later grew up in Sapporo, Hokkaidō, Japan. He enjoyed skiing in his elementary school days. When he lived in Sapporo, his father was a chief police officer.\n\nWhen he was 13, his father retired and Tetsuzo moved with his family to his father's hometown, Masuda, Shimane prefecture. He studied at the Prefectural Masuda Agricultural and Forestry High School. His favorite school subjects were mathematics and geometry; in these subjects, he always scored A's on his school report.\n\nHe was an active and nimble boy. He joined a school club brass band as a trumpeter. Another hobby was growing plants and flowers. He helped local fishermen in the fishing season, going out to the sandy beach early in the morning and driving fish into the nets. He talked down to his teachers sometimes in discussions, which was very impolite for a school student in pre-war Japan. He was regarded as the most opinionated student in his school.\n\nStarting military career\n\nIwamoto started his military career in 1934 after he graduated the school at 18. Following the advice from his parents to study while young, Tetsuzo left for a large city where he was supposed to take a college entrance examination. He, however, secretly applied for and passed the examination for acceptance as an Imperial Japanese naval airman 4th class, and was promoted to 3rd class 5 months later. His parents were very disappointed, for they became reliant upon Tetsuzo rather than his eldest brother, who was already studying at some university in a large city and would not return to Masuda.[6]\n\nIn 1936, when he was a naval mechanic 2nd class and a crewman on the light aircraft carrier Ryūjō, he studied hard and passed the difficult IJNAF exam, taken by thousands of applicants. He was enrolled in the class 34th Soju-Renshusei (Soren means flight trainee program) for naval petty officers and sailors. He graduated as one of the select 26 young aviators of the class 34th Soju-Renshusei (flight trainee program) in December of that year.\n\nOn April 4, 1936, he was sent to Kasumigaura-Ku (Kasumigaura FR(AG)) as a probationer in the class 34th Sojyu-Renshusei (flight trainee program), then on April 28, formally joined Kasumigaura-Ku. While his training going on November 1, 1936, he was promoted to naval mechanic 1st class. Finally on December 26, he graduated 34th class of Sojyu-Renshusei, was promoted to airman 1st class (old rank name of pre-war Japan, equivalent to senior airman). During flight training school at the Tomobe branch of Kasumigaura-Ku (Kasumigaura FR(AG)), his fighter course instructor was the well-known Chitoshi Isozaki.\n\nIn December 1936. Iwamoto entered Saeki Kōkūtai (a Kōkūtai was a Naval Air Group, whether being based at land or on board a carrier) for 6 months of advanced training (termed extended education), finished and next entered Omura Kōkūtai on July 16, 1937. He had hard training there every day from senior pilots including Air Petty Officer 1st class Toshio Kuroiwa (rank grade was at that time), who was the IJNAF legendary dogfight master pilot. Tetsuzo Iwamoto (called Tetsu in short from his senior pilots) had to wait for his debut until February 10, 1938.\n\nChina front\n\nTetsuzo's ability as a fighter pilot was recognized by all on his first air mission with the 13th Flying Group on February 25, 1938 over Nanchang, China.\n\nAfter combat training, on February 10, 1938, Tetsuzo Iwamoto was led by his leader APO 1/C Toshio Kuroiwa, flying for two and a quarter hours over the China Sea from Omura Airbase at Kyūshū Japan to the airfield outside of Nanjing China.\n\nHis squadron on the Chinese frontline was the 13th Flying Group Fighter Squadron. This Flying Group was highly regarded and was famed as the Nango Fighter Squadron, named after its former squadron leader, Mochifumi Nango, who had showed considerable courage and conspicuous leadership.\n\nIwamoto's first combat came on February 25, 1938 over Nanchang. His squadron's fighters escorted bombers Type 96 land-based attack aircraft. Chinese's fighters attacked, and the squadron's leader Lieutenant Takuma was lost on this mission.\n\nIwamoto described his first combat in his notes. During the escort mission, his squadron was intercepted by sixteen I-15s and I-16s at an altitude of 5000 meters. Iwamoto claimed 4 victories (1 probable) in the combat. He secured his first victory by firing when within 50m of the enemy fighter. He first saw white smoke, then the enemy burned up and crashed. He was then at an altitude of 4000 m. When he looked back, there was an enemy fighter just behind him. He instantly made a Split S maneuver and narrowly escaped.\n\nHe got his second victory against an I-15. He saw it below him, turned and attacked from its 6 o'clock high. When it was hit, it climbed sharply and went spinning downward out of control and crashed into the ground. He kept his altitude of 4,000 m. He got an I-16 at the top of its roll in his gunsight and fired a burst, its engine burning and out of control; Tetsuzo lost sight of it before it crashed, and he reported this as probable. Another I-15 came down to him from 12 o'clock ahead. Both made a climb and were soon in a dogfight. The I-15 tried to break free of him and made a straight dive. That action made it easier for Tetsuzo to aim. He downed this I-15 on farmland near the airfield. He was flying at an altitude of 2000 m.\n\nAbove him, many enemy fighters were maneuvering. He found one of them coming down with landing gear down. He chased it to an altitude of 200 m and fired a burst. The I-16 was surprised and made a split S maneuver, but crashed at a corner of the airfield. This was his 4th victory.\n\nAnti-aircraft guns started firing heavily, and he found himself in an intense barrage of flak. Rushing to escape at full throttle with a number of enemy fighters behind him, he succeeded in returning safely from the battlefield. His leader Kuroiwa had already returned to the Wuhu airfield, Anhui China, waiting for his return. Kuroiwa scolded Tetsu severely for the rash attacks he made on the day.\n\nThe 13th Flying Group Fighter Squadron was merged with the 12th Fighter Squadron on March 22, 1938, where Type 96 carrier fighters for 1st Chutai had landing gear painted in red and were called Red legs squadron while 2nd Chutai had gear painted in blue and were called Blue legs squadron.\n\nIwamoto was awarded the citation of flying group Cmdr Tsukahara for his extreme courage and conspicuous gallantry in action above and beyond the call of duty as a fighter pilot against intense Chinese air force on April 29, 1938. He made 82 sorties and 14 victories credited in the China front. Tetsuzo Iwamoto became the top IJNAF ace. His activities subsequently earned him Order of the Golden Kite - 5th class recommendation in 1940.\n\nIn September 1938, 22 years old Iwamoto was ordered back to Japan, where he became a member of the Saiki Air Group and appointed to a training staff.\n\nHis flight log\n\nFlying Technique: Class-A of IJNAF Flight hours: over 8,000hrs on March 1944 (net hours, not tripled as U.S.A. single-seated fighter pilot. It was very unusual among IJNAF, [7] IJAAF [8] fighter pilots, although it was usual over 10,000 flying hours among the multi-seated aircraft IJNAF, IJAAF veteran pilots.) Oceanic Transition: possible, navigating and leading his fighter chutai (without Radar) Instrument Flight: possible Night Flight: possible Single-seat Fighter reconnaissance and attack mission across night ocean: possible Night landing: possible with simple approach lighting system Night carrier landing: possible with approach path indicator lights\n\nOnly experienced fighter pilots in the IJNAF could execute instrument flight with their single-seat fighter aircraft on combat missions; few IJNAF officer pilots could fly on instruments.\n\nHis tactics\n\nSingle to single dogfight tactic - from losing to winning [9]\n\nQuick roll (Roll Sempoh) (up and down quick roll tactic, skidding sideway (sudden decelerate) within 1/2 quick roll to forward the opponent aircraft on one's tail and get tail shot position of it. Cmdr Takeo SHIBATA promoted, his men developed and taught him. [10] ) Coke-screw loop (Hineri-Komi Sempoh) (short-cut or twist-in loop tactic, skidding loop. Lieutenant Isamu MOCHIZUKI's special, Section leader and Warrant Officer Toshio KUROIWA trained him. [11] ) Yo-yo turn (Suichoku-Senkai Kasoku Sempoh) (Lt. JG Sadaaki AKAMATSU's special at China front. [12] )\n\nFormation tactics -\n\nTwo groups linked formation attack one section plays offence, zooming and diving formation attack, another section plays defense, positioned on the higher altitude to cover and support the offence section. Keeping his groups underneath thick clouds to hide his formation and waiting until the small number of opponent aircraft group coming down, then diving and zooming attack with all in formation. Attacking the opponent groups after their mission over and on the way to the waiting circle, in a group to fly back across the distance range over the sea. This tactics was taken when his group had much less number of aircraft.\n\nNo.3 Areal Bomb attack tactic[13] -\n\nTwelve o'clock high vertical dive attack from the front top in inverted flight (Haimen Suichoku Kohka Sempoh) Almost vertical diving (about 60 degree) attack because the 30kg No.3 Areal Bomb needs the releasing speed over 280knot/h to work timer correctly for 1st small explosion. Inverted flight at the starting point because Zero Fighter could not keep steep angle while diving due to its excellent flight stability.\n\nAerial victories claimed in his diary\n\n(World War II, 8 December 1941 - July 1942, April 1943 - 15 August 1945, Allied U.S. Army, Navy, Marine, Royal Navy, Australia, New Zealand)[14]\n\nF4F victories - 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - 10AM 19 Feb.1944 the escort fighters of Martin flying boat)\n\nP-38 victories - 4 (Rabaul, late 1943-1944)\n\nF4U victories - 48; unconfirmed 1 (Rabaul, late 1943 - Feb. 1944; Mobara-airbase outskirts of Tokyo, Japan, February 16, 1945; Operation Kikusui (Imperial Chrysanthemum on the Water - divine wind), Okinawa, March 10 - June 24, 1945). This is more than 1 in 4 of all F4U air-to-air losses during the Second World War.\n\nP-39 victories - 2 (Rabaul, late 1943)\n\nP-40 victory - 1 (Rabaul, late 1943)\n\nF6F victories - 29 (Rabaul, late 1943 - Feb. 1944; Truk 28–29 April 1944; Operation Kikusui, Okinawa, Mar.10-Jun.15 1945)\n\nP-47 victory - 1 (Rabaul, late 1943 - 1944)\n\nP-51 victory - 1 (Rabaul, AM 19 February 1944, the Allied 2nd air-raid of the day, recognized as the latest-style escort fighters)\n\nBritish \"Spitfire\" (= Hurricane) - 4; burned on the ground 2 (Indian Ocean, 9 April 1942)\n\nSBD victories - 48; unconfirmed 7 (Coral Sea, 8 May 1942; Rabaul, late 1943 - February 1944; Truk 28, 29 Apr.1944; Battle off Formosa, 12 Oct. 1944)\n\nSBD w/No.3 Aerial Bomb victories - 30 (Rabaul, late 1943 - 1944)\n\nTBF victories - 5; unconfirmed 19 (Rabaul, late 1943 - 1110 19 February 1944, the Allied 6th and the 3rd final air-raid of the day to Rabaul)\n\nSB2C victories - 5 (Rabaul, late 1943 - 1944)\n\nB-25 victories - 8 (Rabaul, late 1943 - 0900 19 February 1944, the Allied 4th air-raid of the day)\n\nB-26 victories - 2 (Rabaul, late 1943 - 1944)\n\nB-24 victories - 6; w/No.3 Aerial Bomb victories(SH) 24, damaged 2 (Truk, 6 March - June 1944, confirmed by ground members)\n\nB-29 victory - 1 (Kagoshima, Kyushu, Japan, April 1945)\n\nPBY5A flying boat victory - (SH) 1 (Indian Sea, 5 April 1942)\n\nMartin Mariner flying boat victory - (SH) 1 (Rabaul, 10AM 19 February 1944, interlude between Allied air-raids of the day, escorted by 12 F4Fs)\n\nStrafed Destroyers - 3 (Rapopo Rabaul, Night 5 February 1944)\n\nStrafed Landing Craft - some hundreds (Kerama islands, Okinawa, night 26 March 1945)\n\nStrafed Airfields - Lae, Eastern New Guinea, 23 January 1942; Torokina, Bougainville, Solomons, night 1944)\n\nPromotions\n\nJapanese Order of the Golden Kite, 5th Class\n\nfrom the corresponding article in the Japanese Wikipedia\n\nSailor Fourth Class (Seaman Recruit) - 1 June 1934\n\nSailor Third Class (Seaman) - 15 November 1934\n\nSailor Second Class (Able Seaman) - 2 November 1935\n\nSailor First Class (Leading Seaman) - 26 December 1935\n\nPetty Officer Third Class - 1 May 1938\n\nPetty Officer Second Class (Petty Officer) - 1 November 1939\n\nPetty Officer First Class (Chief Petty Officer) - 1 May 1941\n\nChief Petty Officer (regrading of Petty Officer First Class) - 1 November 1942\n\nCommissioned an Ensign - 1 November 1944\n\nPromoted to Sub-Lieutenant upon retirement - 5 September 1945\n\nAwards\n\nfrom the corresponding article in the Japanese Wikipedia\n\nPost-war life\n\nAllied Occupation Forces searched for war criminals in the Japanese Officer Corps. He was summoned twice to Douglas MacArthur's Allied GHQ office in Tokyo. Though he avoided being declared a war criminal, he was blacklisted for public sector employment. Managers of nongovernmental businesses and local factories in his hometown also did not dare to employ him, in order to comply with the wishes of the new Allied GHQ. Those who had been officers in the IJA or IJN were disliked by the Allied Occupation Forces.\n\nJapanese journalists who had promoted Japanese militarism campaign during the war started a radio program of anti-militarism postwar called \"\"Shin-Jitsu wa Kou da (The Truth Is This)\"\". People like Iwamoto were considered the cat's-paws of militarism there.\n\nIwamoto struggled to survive until the San Francisco Peace Conference was held and the Allied Occupation Forces left Japan in the spring of 1952. In 1952, he finally obtained employment at the Masuda spinning mill of Daiwa Bouseki (now renamed as \"Daiwabo\" Co., Ltd, 大和紡績 ). However, in summer 1953, he developed a stomach ache. A surgeon examined him and diagnosed enteritis. It was found later to be appendicitis.\n\nAfter a series of operations, he complained of a backache. Doctors decided to operate on him again. With cause unknown, they removed three or four ribs without anesthesia. This led to sepsis (septicemia, blood poisoning).\n\nHis wife recalled his words, \"When I get well, I want to fly again.\" He died on 20 May 1955.\n\nNotes\n\n↑ Dr. Yasuho Izawa, 1993, Gekitsui Oh To Kuusen (Ace and Combat), Kohjin-sha ↑ pp.127-136, Ryunosuke Kusaka,IJN Grand Fleet ↑ BAA BAA BLACK SHEEP The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ch.9, Gregory Boyington The general attack to smash Rabaul fortress with all Allied air units continued 17 Dec.1943-Mar.1944. ↑ pp.171-268, Izawa, Hata, 1971, Nippon Kaigun SentouKi Tai, Kanto-sha; pp62 - 63, Izawa, 1993, Nippon Riku-Kaigun Ace Retsuden(IJAF and IJNAF Aces), Kojin-sha ↑ p.470, Saburo Abe, Zero Fighter Pilots Association, 2004, \"My combat against Spitfires on VJ-day\", ZeroSen, Kaku Tatakaeri!, Bunshun-Nesco; pp.248-249, Toshio Hijikata, 2004, Kaigun Yobi-Gakusei Zero-Sen KuuSen-Ki (Air combat note of an IJNAF reserved student officer Zero fighter pilot), Kohjin-sha ↑ Mrs. Iwamoto's postscript within Zerosen Gekitsui-Oh(Zero fighter ace) ↑ IJNAF: Imperial Japanese Navy Air Force ↑ IJAAF: Imperial Japanese Army Air Force ↑ p.127, p.141, p.305 Tetsuzo Iwamoto, 1973. Zero-sen Gekitsui-Oh ↑ Roll Sempoh: pp.469, Saburo Abe, Zero Fighter Pilots Association, 2004. ZeroSen, Kaku Tatakaeri! ↑ WO Kuroiwa was the section leader when young Iwamoto first went to the China front 1938. Lt. JG Mochizuki was his chutai leader in 281 FR(AG) Mar. 1943 - Oct. 1943. ↑ Yo-yo turn: p.168, Noritsura Odaka, 1985, Kohjin-sha. Seishun Zerosen Tai ↑ Cmdr Takeshi Sanagi, Senior Staff Officer of the South East Fleet HQ at Rabaul Fortress. Dec 1973, Maru Magazine. Rabaul FR(AG) spirit stands! ↑ Info. from a page picture of his notebook in the end of the book, reprinted ver.Zero-sen Gekitsui-Oh. Date was JST.\n\nReferences\n\nBooks\n\nIwamoto, Tetsuzo (194x-?). Iwamoto air combat log notebooks (posthumous detail manuscripts in 3 volumes of notebooks, found 1970s from his family) , 1939-1945 .\n\nIwamoto, Tetsuzo (Feb 25, 1986) [1st. pub. July 10, 1972]. Zero-sen Gekitsui-Oh (means, Zero Fighter Ace, based on the posthumous manuscripts) . Kyo-no-wadai-sha. ISBN 4-87565-121-X.\n\nTsunoda, Kazuo (1990). Shura no Tsubasa (means, The Asura's Wing) . Tokyo: Kohjin-sha. ISBN 4-7698-1041-5.\n\nOdaka, Noritsura (1985). Seishun Zerosen Tai (means, Young Zero Fighters) . Tokyo: Kohjin-sha. ISBN 0-14-016561-4.\n\nKusaka, Ryunosuke (Apr 1952). Rengō Kantai (which translates as \"Grand Fleet\" or \"Combined Fleet\") . Tokyo: Mainichi Shinbunsha (Mainichi Newspaper).\n\nZero Fighter Pilots Association (2004). \"Saburo Abe's chapter, Spitfire Gekitsui-Ki (means, My combat against Spitfires on the VJ-day)\". ZeroSen, Kaku Tatakaeri! (means, We are Zero fighter pilots, these were our fights!) . Tokyo: SeishunNesco-sha.\n\nZero Fighter Pilots Association (1987). \"List of naval fighter pilots where he died, who survived\". Kaigun Sentokitai-Shi (means, Our History of Naval Fighter Units) . Tokyo: Hara-shobo. ISBN 4-562-01842-9.\n\nIzawa, Yasuho; Hata, Ikuhiko (1971). Kohku-Jyoho, Nippon Kaigun SentouKi Tai (means, The Japanese Naval Fighter Units in World War II) . KanToh-sha.\n\nHata, Ikuhiko; Izawa, Yasuho (1987). Japanese Naval Aces and Fighter Units in World War II . Annapolis: Naval Institute Press.\n\nIsozaki, Chitosi (1986). Maru Magazine, Chokuei Sentouki-Tai Solomon ni Hateru tomo (means, Although we escourt fighter unit pilots had to die over the battle of Solomon) . Tokyo: Ushio-shoboh.\n\nAbe, Masaharu (December 1993). Maru Magazine exstra issue, Watashi ga mita futari no gekitsui-oh (means, Two Aces I met - Nishizawa and Iwamoto) . Tokyo: Ushio-shoboh.\n\nTakizawa, Kenji (Dec 1984). Maru Magazine, Toyoh Zerosen-Tai Simatsu-Ki (means, The beginning and the end of Zero Fighter Unit attacking overseas to Saipan) . Tokyo: Ushio-shoboh.\n\nNakayama, Mitsuo (July 1981). Maru Magazine, B-24 hunter champion, Zero Fighter type52, my one hundred days of combat report . Ushio-shoboh.\n\nShibata, Takeo (1981). Maru Magazine, Hittsui Senten Sempoh Kotohajime (means, The Beginning of IJNAF Quick Roll tactics, I developed) . Tokyo: Ushio-shoboh.\n\nGenda, Minoru (2002). Kaigun Kokutai Simatsu-Ki, Hasshin (means, The Rise and Fall of IJNAF, first volume -TakeOff-) . Bunshun-bunko.\n\nSakaida, Henry. Imperial Japanese Navy Aces 1937-45 . Ospray. ISBN 1-85532-727-9.\n\nShores, Christopher; Norman Franks; Russell Guest (January 1991). Above the Trenches: A Complete Record of the Fighter Aces and Units of the British Empire Air Forces, 1915-1920 . London: Grub Street. ISBN 978-0-948817-19-9.\n\nFranks, Norman L. R.; Frank W. Bailey (May 1992). Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914-1918 . London: Grub Street.\n\nTillman, Barrett. \"Ch.9 victory credits and wildcat evaluation\". Wildcat Aces of World War 2 . Ospray.\n\nAndrew, Thomas (1992). \"appendices ace list - Royal Navy Aces\". Royal Navy Aces of World War 2. Ospray. ISBN 978-1-84603-178-6.\n\nMovie\n\nNippon Eiga-sha, Feb.16, 1944, Nippon News No.194 Solomon no Gekisen Nankai-Kessenjo (means, Southern Ocean Battle Fields of Solomon)\n\nNippon Eiga-sha, Feb.2, 1944, Nippon News No.192 Rabaul (means, Fortress Rabaul)"}]}