{"Donald Alexander Mackinnon was a strong advocate for the rights of women and children.": [{"url": "https://adb.anu.edu.au/biography/mackinnon-donald-10997", "page_content": "by Suzanne L. G. Rickard\n\nDonald Mackinnon (1892-1965), pastoralist and diplomat, was born on 30 April 1892 at Prahran, Melbourne, eldest of six children of Victorian-born parents Donald Mackinnon, barrister, and his wife Hilda Eleanor Marie, née Bunny. His grandfathers were Daniel Mackinnon and Frederick Bunny; Rupert Bunny was his uncle. After attending Melbourne Church of England Grammar School, young Donald boarded at Geelong Church of England Grammar School where he won prizes for Latin and Greek, edited the school magazine and was a prefect. He enrolled in law at the University of Melbourne and entered Ormond College in 1910. From 1911 to 1913 he read classics at New College, Oxford, but did not graduate.\n\nHaving served (from 1911) in the ranks of the King Edward's Horse, Mackinnon was commissioned in March 1914. He was sent to the Western Front in April 1915. Wounded on 29 March 1916, he was evacuated to London. In 1916-17 he commanded reserve units in Ireland. He returned to France as a captain in 1918 and, following the Armistice, again embarked for Ireland. At All Saints Church, Grangegorman, Dublin, on 12 June 1917 he had married Minella Beatrice Seymour with the rites of the Church of Ireland.\n\nBy 1919 Mackinnon was back in Australia. He drove cattle on his uncle's property, Marion Downs, near Boulia, Queensland, then moved to Melbourne where he completed (by correspondence) a course in accountancy. Failing to secure management of any of the family properties, and spurred by his wife's unhappiness in Melbourne, he took her to England in 1924. He worked for the Union Cold Storage Co. Ltd in London's Smithfield market. Following his divorce, he married Mary Hindle James, a 27-year-old physiotherapist, on 10 September 1927 at the register office, St Marylebone.\n\nWhen the meat merchants, Vestey Bros Ltd, offered Mackinnon an opportunity to represent their interests in Argentina, he sailed for Buenos Aires in 1929. Appointed a director (1937) of Anglo Frigorifico, he was widely respected in commercial circles. During World War II he was a member of 'Los Tamberos', a clandestine organization formed to combat the activities of Germans in Argentina. Despite his British connexions, he retained a strong sense of his nationality and wanted to expand trade between Australia and South America. He later claimed that he had 'been selling Australia in one form or another since 1929'.\n\nIn 1946 Mackinnon returned home. Settling on the family property, Marida Yallock, near Terang, Victoria, he soon became involved in local politics and was elected president of the Terang branch of the Returned Sailors', Soldiers' and Airmen's Imperial League of Australia. He joined the State executive of the Liberal Party and was its vice-president in 1948. That year cabinet appointed him to the Victorian Inland Meat Authority. In August 1949 he won the presidency of the Liberal and Country Party of Victoria. He was a co-opted member of the Commonwealth Scientific and Industrial Research Organization's advisory council in 1952-57.\n\nMackinnon had gained extensive knowledge of South America's primary and secondary industries, of its politics, and of the international trade in meat. This expertise, and his knowledge of Spanish and Portuguese, proved assets when he was posted (1957) as Australian minister to Brazil. In 1958 he was appointed C.B.E. and promoted ambassador. His 'unusual but completely effective' approach to diplomacy was praised. Returning to Victoria in 1960, he led the Australian trade mission to South America in 1962.\n\nA tall man of military bearing, Mackinnon had a purposeful manner, a quiet sense of humour and an ability to communicate ideas. He was forthright, energetic and gentlemanly. Initially a small 'l' Liberal, he grew suspicious of government subsidies and in 1964-65 opposed the introduction of a reserve-price scheme for wool. At the same time, however, he feared that the Liberal Party would be unduly influenced by big business. Described as a 'driving force' in the party, he worked closely with leading members of the parliamentary wing, including Sir Robert Menzies. Mackinnon advised the Federal treasurer Harold Holt on rural policy and lent his support to the aspiring Andrew Peacock.\n\nA director of Trufood of Australia Pty Ltd, Mackinnon was a member of the Australian Primary Producers' Union and president (1964) of the Melbourne Club. His newspaper articles (1960-62) provided a lively commentary on South American trade, politics and social issues. He died on 2 May 1965 at Terang and was buried in the local cemetery with Presbyterian forms; his wife, daughter and two sons survived him, as did the daughter of his first marriage."}, {"url": "http://www.biographi.ca/en/bio.php?id_nbr=7835", "page_content": "MacKINNON, DONALD ALEXANDER, teacher, lawyer, politician, and author; b. 22 Feb. 1863 in Uigg, P.E.I., son of William MacKinnon and Catherine Nicholson; m. 17 Oct. 1892, in Charlottetown, Adelaide Beatrice Louise Owen (d. 1912) of Georgetown, P.E.I., and they had two sons and one daughter; d. 20 April 1928 in Charlottetown.\n\nDonald A. MacKinnon was of Scots stock: his father had been born in Scotland and his mother was a descendant of settlers who had come to Prince Edward Island in 1803 with the Earl of Selkirk [Douglas*]. Donald attended the Uigg grammar school and, on completing his education there, taught in rural districts, beginning at the age of 14 if not earlier. By 1880 he had enrolled at Prince of Wales College in Charlottetown. After his graduation he received a first-class teaching licence and worked in several locations until 1882 when he began articles with Charlottetown barrister Malcolm McLeod. Taking advantage of changes to legislation which allowed time spent at approved law schools to count as part of the articling period, he attended Dalhousie law school in Halifax from 1885 to 1887 and received an llb. He was called to the Island bar as an attorney in 1887 and as a barrister the following year.\n\nMacKinnon opened a legal practice in Georgetown in 1887 and remained there until 1897, when he moved back to Charlottetown and began a partnership with Alexander Bannerman Warburton. The firm, which had offices in Summerside and Montague Bridge (Montague) as well, was short-lived because Warburton was called to the bench in 1898. Later law partners were Edward Bayfield Williams and Robert Neil McNeill. Named a qc in 1899, MacKinnon became president of the Law Society of Prince Edward Island the following year. He was also law agent for the dominion minister of justice in the province.\n\nMacKinnon’s political career had begun in 1893 when he was elected as a Liberal for 4th Kings in the newly constituted Legislative Assembly [see Neil McLeod*]. Re-elected in 1897, he was named attorney general in the government of Donald Farquharson* in 1899, but when he returned to the electorate that year as a consequence of taking office he was, unusually, opposed and defeated. In 1900 he entered dominion politics and ran in Queens East. Although he received the majority of the votes, the result was declared void for “corrupt practices” and a new election ordered which took place in March 1901 and which MacKinnon won by a larger majority. He sat until the dissolution but was not a candidate in the 1904 election. In June of that year he had complained to Prime Minister Sir Wilfrid Laurier* that his finances were not sufficient for politics and had indicated his desire to be made lieutenant governor of Prince Edward Island. In October 1904 the appointment came to him at the comparatively young age of 41. He held the position until May 1910. MacKinnon was again elected to the dominion parliament in 1921, representing Queens, and he sat until 1925. He did not contest the 1925 election.\n\nIn addition to his legal practice MacKinnon was involved in a number of business ventures, among them the Three Rivers Steamship Company and the Prince Edward Island Electric Company, of which he was president. His interests included the Boy Scouts, an organization he served as provincial commissioner, and writing. He was a contributor to the Prince Edward Island Magazine and in 1906, in partnership with Warburton, he edited Past and present of Prince Edward Island, an encyclopedic volume containing historical essays and biographical sketches. MacKinnon’s contributions included articles on the fisheries, Queens County, geology, and the constitution. The volume continues to be useful for research. It was not, however, mentioned in obituaries, which concentrated on MacKinnon’s political service, specifically mentioning his success in obtaining a branch line of the Prince Edward Island Railway that had benefited his district.\n\nH. T. Holman"}, {"url": "https://wiki.alquds.edu/?query=Donald_Alexander_Mackinnon", "page_content": "Canadian politician\n\nFor other people with the same name, see Don McKinnon (disambiguation)\n\n\n\n\n\nDonald Alexander MacKinnon (22 February 1863 – 20 April 1928) was a Canadian teacher, lawyer, politician, author, and the eighth Lieutenant Governor of Prince Edward Island from 1904 to 1910.\n\nBorn in Uigg, Prince Edward Island, the son of William and Catherine Nicholson Mackinnon, MacKinnon attended Uigg grammar school and started teaching when he was 14. He later received a first-class teaching licence from the Prince of Wales College in Charlottetown. In 1882, he started articling with the Charlottetown barrister Malcolm McLeod. From 1885 to 1887, he attended Dalhousie Law School where he received a Bachelor of Laws degree. He was called to the Bar an attorney in 1887 and a barrister in 1888. He was created a Queen's Counsel in 1899. He opened a practice in Georgetown, Prince Edward Island in 1887 where he remained until moving to Charlottetown in 1897. In 1900, he became president of the Law Society of Prince Edward Island.\n\nFrom 1893 to 1900, he was a member of the Legislative Assembly of Prince Edward Island for the electoral district of 4th Kings. In 1899, he was chosen as attorney general in the cabinet of Donald Farquharson; however, as a result of the appointment, he was required to run for reelection and he was defeated.\n\nHe was elected to the House of Commons of Canada as the Liberal candidate for the electoral district of East Queen's in the 1900 federal election. In 1901, the election was declared void and MacKinnon was re-elected in the resulting 1901 by-election. In 1904, he was appointed Lieutenant Governor of Prince Edward Island and served until 1910.[1] He returned to federal politics when he was elected to the House of Commons for electoral district of Queen's in the 1921 federal election. MacKinnon died in Charlottetown in 1928."}, {"url": "https://www.ed.ac.uk/information-services/library-museum-gallery/crc/collections/special-collections/rare-books-and-manuscripts/rare-books-directory-section/donald-mackinnon", "page_content": "Rare Gaelic pamphlets and manuscripts.\n\nDonald Mackinnon (1839-1914) was born in Kilchattan on Colonsay, in the Hebrides. He was educated locally and then later, from the age of eighteen, at the Church of Scotland Training College, Edinburgh, which was a popular route to studying at Edinburgh University. Between 1860 and 1863 he was engaged as a school-teacher in Lochinver, Sutherlandshire, where he made a close study of the dialects and literature of the North Highlands. Mackinnon studied at Edinburgh University where he obtained the degree of M.A. in 1870. In 1882, he became the first Professor of Celtic at Edinburgh University, and he held the chair until 1914. His experience and acquaintance with the North Highlands served him in his capacity as member of the Crofters Royal Commission chaired by Lord Napier in 1883. Mackinnon's contribution to the Commission's Report was impressive enough to speed up subsequent legislation for the improvement of conditions for Scotland's crofters. Among his publications were the 'Reading book for the use of students of the Gaelic class at Edinburgh University' (1883), and 'On the dialects of Scottish Gaelic'.\n\nThe papers are substantial, in 38 boxes, and include a 15th century manuscript on medieval physiography; a 16th century summary or abstract of the Treatise of Maighstir Ricairdi compiled from Hippocrates and others; and tales and verse written in the 18th century. There are bundles of papers of different sizes with unrelated contents, notebooks containing lecture notes on Gaelic grammar and Gaelic literature, notebooks containing transcripts of Gaelic poetry, Gaelic versions of classical epics, notes on the history of Scotland, newspaper cuttings and draft copies of work.\n\nThere are also some 1,700 books and 300 pamphlets on Celtic studies and Scottish theology, mainly published in the 19th or early 20th centuries, from MacKinnon’s library. The bulk of the collection was bequeathed to the Library by Dr. Roger McNeill, Medical Officer of Health for Argyllshire, in 1924. All the books appear in the Library's pre-1985 main catalogue and there are manual author and shelf lists available via staff. There are also basic online records for some of the books. The shelfmark is Mackinnon Coll."}, {"url": "http://www.lgpei.ca/former-governors/donald-alexander-mackinnon", "page_content": "Donald Alexander MacKinnon was the twenty-first Lieutenant Governor of Prince Edward Island since the creation of the Colony in 1763. Donald Alexander MacKinnon was the son of William MacKinnon and Katherine Nicholson, both of Scottish descent. Donald MacKinnon was born in Uigg, Belfast, Prince Edward Island on 21st February 1863. He was educated on the Island at Uigg Grammar School, Prince of Wales College and as well as at Dalhousie University Law School, Halifax (LL.B.). He married Adelaide Beatrice Louise Owen of Georgetown, Prince Edward Island, in 1892. MacKinnon was a member of the Presbyterian church.\n\nHe was Chairman of Georgetown School Trustees. He was admitted to the bar in 1887 and granted Kings Council in 1900. In 1893, he was elected to the Prince Edward Island Legislative Assembly for Murray Harbour District and was reelected in 1897. He was appointed Attorney General of Prince Edward Island in 1899.\n\nDonald MacKinnon was elected by a majority of 7 votes as a Liberal to represent East Queens District in the Parliament of Canada in the general election held on 7th November 1900. The election was declared void on 1st February 1901 and a new election was held on 20th March 1901 when MacKinnon was again returned by a majority of 394. MacKinnon was later elected to the Parliament of Canada as a Liberal to represent Queens District in the general election held on 6th December 1921 and was unsuccessful in the following general election held on 29th October 1925.\n\nDonald MacKinnon was appointed Lieutenant Governor for the Province of Prince Edward Island on 3rd October 1904 and remained in this position until 30th May 1910.\n\nEarlier in his career, he had been a public school teacher. During his terms as a parliamentarian, he took a prominent place in striving to obtain transportation, and other facilities for his native province, including the first railway and traffic bridge to be built across the Hillsborough River about the beginning of the 20th century, and the rail addition from Charlottetown to Murray Harbour, and trying to aid the agriculture and fishing industries.\n\nThe Montreal Star once wrote of him, \"an able lawyer and a wise and prudent administrator.\"\n\nPhotograph courtesy of PEI Public Archives and Records Office, Reference Number 2320/60-22"}, {"url": "https://libraryblogs.is.ed.ac.uk/rarebooks/2016/05/12/the-greatest-gaelic-book-collector-professor-donald-mackinnon-1839-1914-the-university-of-edinburgh-and-the-mackinnon-collection/", "page_content": "We have recently completed the online cataloguing of the MacKinnon Collection, of books of and about Scottish life and literature, and rich in books in Gaelic. Our colleague and expert in Gaelic, Donald William Stewart, has contributed this guest blog about Donald MacKinnon and his books:\n\nThe Greatest Gaelic Book Collector? Professor Donald MacKinnon (1839–1914)\n\nDonald MacKinnon was born in 1839 in Kilchattan on the Argyllshire island of Colonsay. He was the first Professor of Celtic Languages, Literature, History, and Antiquities at the University of Edinburgh, and he made substantial contributions to every one of the fields listed in his title. MacKinnon occupied the chair from 1882 until he retired in summer 1914. He died a few months afterwards, on Christmas morning, at his home at Balnahard in his native island.\n\nAs a student at Edinburgh, MacKinnon enjoyed a dazzling career crowned in 1869 by the Hamilton Fellowship in Mental Philosophy, a grant of £100 allowing him three years’ further study at the university. Ironically, it was the Education Act (Scotland) of 1872, that ruthless destroyer of Gaelic schools, which was to give him his big break. After the Act was passed, Donald MacKinnon was appointed as the first Clerk and Treasurer of the School Board of Edinburgh.\n\nAdmirers of Donald MacKinnon – and, it has to be said, on occasion Donald MacKinnon himself – have made much of his humble beginnings, but we should remember that talent often attracts sponsors. MacKinnon was fortunate to have caught the attention of two of the most influential figures in Scotland, men who just happened to be from Colonsay like himself. Advocate and judge Duncan McNeill, first Baron Colonsay (1793–1874), was the pre-eminent Scots lawyer of his time; while his younger brother Sir John McNeill (1795–1883), chairman of the Board of Supervision in charge of the operation of the Poor Law (Scotland) Act, was the most powerful civil servant in the country. Long before the Edinburgh Chair of Celtic was finally established in 1882, MacKinnon’s patrons were unobtrusively promoting the merits of their candidate.\n\nMacKinnon was certainly an ideal contender for the professorship: an excellent Gaelic prose stylist, an industrious contributor of columns to newspapers and periodicals, a man who participated to the full in the lively Gaelic-speaking community in the capital – and who would soon undertake arduous service on the parliamentary Napier Commission travelling around the Highlands enquiring into crofters’ and cottars’ rights. MacKinnon was also a popular teacher of a generation of Gaelic students, including the first women Celtic scholars in Scotland. In particular, as the pioneer Celtic Professor in Scotland, Donald MacKinnon had to lead the way and lay the foundations for future scholarly study of Scottish Gaelic. This he did with aplomb. His lectures defined and delineated Gaelic literature and history, as well as elucidating Gaelic place-names and personal names. His Gaelic Reading Books laid down a syllabus for elementary and advanced students in the language. Most enduringly, his Descriptive Catalogue of Gaelic Manuscripts in the Advocates’ Library, Edinburgh, and Elsewhere in Scotland(Edinburgh: T. & A. Constable, 1912), the fruits of five years of research generously sponsored by John Crichton-Stuart, fourth Marquess of Bute (1881–1947), remains a crucial work of reference for both classical and vernacular Gaelic manuscripts in Scotland – including four then in MacKinnon’s own possession – more than a century after its publication. But, as the new online library catalogue to Professor Donald MacKinnon’s collection demonstrates, he should also be remembered as a great collector of books, Gaelic and Celtic.\n\nAt a complimentary dinner held in MacKinnon’s honour by friends at the Waterloo Hotel on 7 November 1883, marking the beginning of his professorship, the Rev. Dr Norman Macleod ‘presented to Professor Mackinnon a cheque for a sum subscribed by a few friends, who begged him to apply it in the purchase of books bearing on the subject of his Chair. (Applause.)’ [Edinburgh Evening News, 8 November 1883, 2]\n\nThe minister’s remark suggests that even before he became a professor, Donald MacKinnon was already well-known as a Gaelic book-collector. This is borne out by the Rev. Donald Maclean’s remarks in the introduction to his magnificent catalogue, financed by the Carnegie Trust, Typographia Scoto-Gaedelica or Books printed in the Gaelic of Scotland (Edinburgh: John Grant, 1915):\n\nThe late Professor Donald Mackinnon placed at my disposal very valuable bibliographic material which he had collected for many years before he became the first occupant of the Celtic Chair in Edinburgh. It is not possible for me to acknowledge fully my indebtedness to this collection. (viii)\n\nIn making MacKinnon the Typographia’s dedicatee, Maclean pays tribute to the professor’s assistance and encouragement – and to the breadth and scope of his Gaelic library.\n\nMacKinnon’s collection had already been at the heart of a major Gaelic books presentation, one of the attractions, along with quaichs, silverware, tartans, and regimental uniforms and colours, shown in the Highlands and Islands display in the Fine Art Galleries at the great Scottish National Exhibition in Saughton Park between May and September 1908. During this time of the Scottish Celtic Revival, Gaelic culture, sports, and costumes loomed large in the Exhibition programme, alongside the helter-skelter tower, the switchback railway, the water chute, the Irish cottages, the Senegal village, the display of baby incubators, and diverse other attractions intended to educate, entertain, and astonish.\n\nAmong the books Professor MacKinnon donated to the exhibition, as listed by The Scotsman on 22 August 1908, were:\n\n• the Irish translation, by Uilliam Ó Domhnuill, of the New Testament, first printed in 1681;\n\n• the first edition of the New Testament in Scottish Gaelic, 1767;\n\n• the first edition of the Old Testament in Scottish Gaelic, printed in four parts, in 1783, 1786, 1787, and 1801;\n\n• a very rare copy of the Apocrypha translated into Scottish Gaelic for Prince Lucien Bonaparte by the Rev. Alexander MacGregor in 1860.\n\nIt should be pointed out here that MacKinnon was one of the scholars who revised the Gaelic Bible for the SPCK in 1902. The professor probably also contributed:\n\n• James Macpherson’s Fragments of 1760;\n\n• Ais-eiridh nan Seann Chánoin Albannaich, the Resurrection of the Ancient Scottish Language by Alexander MacDonald, Alasdair mac Mhaighstir Alasdair, the first purely literary publication in Scottish Gaelic, printed in 1751;\n\n• Comh-chruinneachidh orranaigh Gaidhealach, the Eigg Collection, songs edited by Alexander’s son Ronald and printed in 1776;\n\n• An Sùgradh, a small popular song collection from 1777;\n\n• Gillies’ collection Sean Dain, agus Orain Ghaidhealach of 1786;\n\n• the blind poet Allan MacDougall’s song collection Orain Ghaidhealach of 1798.\n\nNow, not all of the major works listed above are found in the MacKinnon Collection today. This raises the possibility that the professor’s books arrived at Edinburgh University Library in two tranches. Whether during his later years as professor, or after his retiral, Donald MacKinnon may have donated to the Celtic Departmental Library at Edinburgh the canonical works of Gaelic literature on which his courses were principally based, works such as those mentioned above. His personal library, on the other hand, was bequeathed to his friend and fellow islander Dr Roger McNeill (1853–1924), Medical Officer for Argyllshire, a man whose remarkable research and tireless campaigning was instrumental in founding the Highlands and Islands Medical Service in 1913, one of the main forerunners of our National Health Service today. After McNeill’s death, MacKinnon’s volumes, probably augmented by those from the doctor’s own collection, were bequeathed to Edinburgh University Library. It would be an interesting and useful exercise to see how far we can relate the books in the MacKinnon Collection, and others in the university collections probably once owned by Donald MacKinnon, with the listings in Maclean’s Typographia.\n\nIn Professor Donald MacKinnon we have a scholar signal for the range of his interests and expertise even in an era noted for polymaths, a man celebrated by his colleagues and students, and remembered today for a number of crucial works of scholarship and reference. The MacKinnon Collection is one of the professor’s greatest legacies, allowing us to gain a clearer picture of one of Scottish Gaeldom’s most eminent scholars, and also, through him, a deeper understanding of Gaelic culture itself."}, {"url": "https://countercurrents.org/2017/02/the-dworkin-mackinnon-anti-pornography-civil-rights-ordinance/", "page_content": "The Dworkin-MacKinnon Ordinance — originally written in 1983 by Andrea Dworkin and Catharine MacKinnon — was an amendment to a civil rights law. It stands as a mostly ignored template for creating law-based change within the system.\n\nRather than taking the traditional “obscenity” angle, the Dworkin-MacKinnon Ordinance proposed that:\n\nPornography is a violation of women’s civil rights\n\nWoman harmed by pornography had the right to seek damages via civil lawsuits\n\nIn the ordinance, pornography is defined as such:\n\n“Graphic sexually explicit materials that subordinate women and others. It is not a description of any ideas pornography expresses. By contrast with the Indianapolis version of the ordinance, this definition is not restricted to violent material. This is because the violence of pornography is not limited to materials that show violence. Women are coerced into materials that show no violence. Rapists use materials showing what appears to be consenting sex to stimulate their rapes and to select their targets. Children are abused to make pornography that shows no violence. Pornography showing no violence is violently forced on women and children.”\n\nIt included a “coercion provision,” which permitted “anyone coerced into sex acts so pornography can be made of them to stop the pornography and to get damages for their abuse. It only addresses materials made through aggression that is proven to be done against individual human beings. There is no First Amendment protection for coercion.”\n\nIn addition, the ordinance “prohibited forcing pornography on others against their will.” It also contained defamation and trafficking provisions. Find the full text to see what it looks like when someone does the hard work of laying foundations.\n\nDuring the 1980s and early 90s, versions of the Dworkin-MacKinnon Ordinance were passed in several U.S. cities only to be vetoed by mayors or struck down by courts. In other words, there was no sign-holding, marching, or chanting. A horrific societal threat was identified (and about to reach full fruition with the advent of the Internet) and a fresh approach was conjured up.\n\nNo one talks much about all this now but at the time, the rapidly growing porn industry talked about it plenty. Dworkin spoke of facing threats, public abuse, and no longer being able to get published in the U.S. “They want me to stop,” she said, adding: “I wish I thought I had gotten in their way as much as they seem to think I’ve gotten in their way. My own opinion is that I haven’t gotten in their way near enough.”\n\nThink of all people who later flocked to Occupy or the People’s Climate March. Now imagine if that many would’ve backed this effort 30 years ago. Imagine if that many people backed similar new efforts today —on a full range of issues. What can we learn in 2017 from the long-forgotten Dworkin-MacKinnon Ordinance? Are we even open to learning from it?\n\nCoda: I have often used this ordinance as an example to show activists that we have countless ways to organize beyond the minuscule range we currently embrace. The response, without fail, is to flippantly launch insults at Dworkin and/or declare that ideas like this can “never work.”\n\nMickey Z. is currently writing two books, a political memoir called How to Change Minds & Influence the Future: Rebuilding Activism From the Ground Up (Microcosm Publishing) and a graphic novel entitled stain red. In the meantime, he can be found here.\n\nThe Dworkin-MacKinnon Anti-Pornography Civil Rights Ordinance by Mickey Z. is licensed under a Creative Commons Attribution-ShareAlike 4.0 International License.\n\nBased on a work at http://worldnewstrust.com/the-dworkin-mackinnon-anti-pornography-civil-rights-ordinance-mickey-z."}, {"url": "https://www.giffordlectures.org/lecturers/donald-mackenzie-mackinnon", "page_content": "Norse-Hulse Professor of Divinity, Cambridge\n\nBio\n\nDonald MacKinnon was educated at Cargilfield School Edinburgh (1921–26) Winchester College (1926–31) and New College Oxford (1931–35) where he also held a scholarship and graduated in both Greats and Theology. After Edinburgh MacKinnon became a fellow and tutor at Keble College Oxford (1937–47) and held the Wilde lectureship in Natural and Comparative Religion (1945–47). At the age of thirty-four MacKinnon was appointed to the Regis chair of Moral Philosophy in Aberdeen University (1947–60). As a teacher of large ordinary classes in his subject he influenced generations of undergraduates. He completed an important monograph A Study in Ethical Theory (1957) before taking up the Norris-Hulse chair of Divinity in Cambridge (1960–76). For fifteen years MacKinnon dominated Cambridge theology.\n\nMacKinnon's renown as a speaker was demonstrated by invitations he accepted to deliver named lecture series in Cambridge, Exeter, Aberystwyth, the London School of Economics, Newcastle and Stirling. He served as president of the Aristotelian Society and president of the Society for the Study of Theology. After retiring from Cambridge in 1976 he taught in St Andrews for one session during the interregnum in the chair of divinity before returning to Aberdeen. Collections of essays appeared as Borderlands of Theology (1968), Explorations in Theology (1979) and Themes in Theology: the Three-Fold Cord (1987). Much in demand as a conference speaker MacKinnon travelled extensively and served inter alia on the theological commission charged with drafting papers for the General Assembly of the World Council of Churches in 1954.\n\nMacKinnon was elected a fellow of the British Academy in 1978 and a fellow of the Royal Society of Edinburgh in 1984. He was awarded honorary degrees by the universities of Aberdeen Edinburgh and Stirling. Following a sudden heart attack he died in Aberdeen Royal Infirmary on 2 March 1994."}, {"url": "https://www.lipad.ca/members/record/a7e51c0d-8966-4959-a4a4-78a3f3a64fa7/3/", "page_content": "Mr. MACKINNON:\n\nWell, you would find our sea trout unexcelled. We would like to have some of you make a visit to the island during the summer in order that you may enjoy a healthy dip into the breakers on the north shore. It is a country that will go ahead; the production was better last year than it had ever been, but what is missing is an adequate price for our products. Our position is something like that of the West, where there was a very large yield but not enough realized because the price was wrong and freight- rates were too high. We are in the same fix. It is not the fault of the present government, mind you. It was under the former government that the freight rates were made so high; it was under the former government that the Crowsnest pass agreement was changed and the rates put up. You remember how we were criticized in respect to the Crowsnest pass agreement the year before last; we four members from Prince Edward Island were denounced for voting for the legislation then introduced. But what has\n\nThe Budget-Mr. Mackinnon\n\nhappened? The return to the Canadian Pacific since the restoration of the old agreement has been better than if was during the period when the suspension was continued. It is well that we should have these facts in mind, because we have been accused of losing to the Maritime provinces $17,000,000 by our vote in favour of the restoration of the Crowsnest pass agreement. Men like Mr. Beatty and Mr. Hanna predicted that they would lose millions by the change, but it turned out the very opposite; their judgment did not happen to be right.\n\nI have referred to this matter of freight rates because it affects us a great deal. We pressed very hard to get the freight rates reduced, because our people were carrying their goods with horses owing to the fact that they could not afford to ship by rail. The railway returns in the Maritime provinces have not been good, simply because the people are .too independent to ship by rail when they have to pay such high freight rates. The new board made some reductions very soon after their appointment, and the situation improved accordingly. But we cannot hope to have the country prosper unless our workshops are kept going and unless we have easy and cheap means of conveyance from one place to the other both for goods and for people; I think that goes without saying. These are the greatest drawbacks that affect us down there. Special rates for tourists would be appreciated.\n\nI wish the Minister of Railways (Mr. Graham) were here. I had intended to bring a matter to his attention, but perhaps the Minister of Justice (Mr. Lapointe) will do it for me. We have a good many people leaving our province. It is proposed to spend a considerable sum for immigration. There were two little branch railroads proposed and agreed to both by Liberals and Conservatives in this House as far back as 1911, the New London and Rustico branches. Plans were prepared and sites allotted for buildings and so on, but the work was never gone on with. In New London we have people whose fathers or grandfathers came from Scotland a hundred years ago, and in Rustico we have the descendants of French Acadian settlers. It is two hundred years since the first settler went into the Rustico district. What I ask the Minister of Railways, through the Minister of Justice, is that while he is providing for the settlers in the new districts in the West by twenty-six branch line resolutions he should not forget the descendants of the old settlers in the districts I mention, who have been there for 100 and 200 hundred years. Let him give us these branch lines this coming summer so that\n\nwe may have a celebration and the return of our own people.\n\nYesterday a man well known in public life who came from Prince Edward Island passed away in the person of the late Chief Justice of Canada, Sir Louis Davies. He was highly honoured in the province and in Canada as a whole; his career was long and honourable and an inspiration to the young men of the province. Undoubtedly his field was larger than it would have been had he remained in the province and practised law, but his illustrious career is only one instance. Go to another room in this building and you will find Sir Robert Falconer and the Reverend Doctor Pringle who came from Prince Edward Island, fighting on one side of the church union question, and on the other side the Reverend Doctor Fraser and one or two others. Doctor Pidgeon is a descendant of the Pidgeons of New London, Prince Edward Island. I mention these simply as instances of men now in the struggle who came from the province by the sea. Had they remained down there they probably would have worked at farming or something of that kind, but their education was good and they have gone out to other parts of the continent. You find them from California to Massachusetts and all through our western country-workmen, clergymen, doctors, lawyers and judges. I could give you the names of many who have gone out and have attained eminence in different parts of the world. I will mention just two others, if you will permit me; one is J. Gould Schurman, who grew up on a farm in Prince Edward Island, was president of a university in the United States and to-day is ambassador for the United States in China. Another was Franklin K. Lane, who was a distinguished member of the cabinet of President Wilson during the war.\n\nI do not mention these things in a spirit of boasting; I am simply pointing out that although the place is small it is turning out .men who have proved their worth in other parts.\n\nWe have fewer people there by ten thousand than we had when we entered confederation, but we are not inclined to secession; we believe in standing by the union; we believe in Canada going ahead. But we cannot get population without industries. There is a splendid opening for industry in Prince Edward Island if the capitalists would, instead of concentrating their activities in large centres, establish branch houses in other parts of the Dominion. I admit that the practice of concentrating in the large centres\n\nThe Budget-Mr. McConica\n\nis good from the point of view of foreign trade, but it is ruinous for our local industries. Many of our sons have gone out to the world, so that part of the intellectual force of the island has been spent in other provinces and countries, and although we do not have the benefit of it, I think it is well spent and that we have no reason to regret it.\n\nMr. T. H. MeCONICA (Battleford): Mr. Speaker, I have no disposition to prolong this discussion, but there are a few observations that I should like to make. To my mind this budget and the amendment offered by the hon. member for Kent (Mr. Doucet) raise a very important issue in Canada today, the question whether the future fiscal policy of Canada is to be a tariff for protection or a tariff for revenue. That, it\n\nseems to me, is the issue. That is where we stand to-day as a parliament and as a country. Now, for my part, if that issue is fairly joined, I would take my position in favour of a tariff for revenue. We have had a good deal of talk about free traders, but there is no use discussing this question except as it stands. I do not think any one in this House to-day is in favour of putting this country under free trade at any time in the near future. We believe in a revenue tariff, with such incidental protection as that affords.\n\nNow what is a protective tariff? It is a tax levied for the purpose of protection. It is levied for the purpose of taxing the many to protect the few. It taxes the money out of the pocket of one private individual into the pocket of another private individual, and I do not think that is the proper function of government. I deny that a government has the moral right to say to one man: I will 'help you, and I will do so by hurting your neighbour. That is what protection is when you reduce it to its final essence. Now what excuse is there for this proceeding? What good end is obtained by this discrimination between our citizens, for that is what it is? It is taking from one and giving to another, for what purpose? Why, the hon. gentleman says, we will be able to build up the home market; that is the great desideratum. Well, in the first place, can we do it? In the second place, what does it amount to if we can do it? So long as the price is the same, I cannot see that it makes any difference to the man who sells whether he sells in the home market or abroad. There may be some sentimental reason why he would prefer to sell at home; perhaps he would like to bring in people to associate\n\nwith him and to whom he could sell, but so far as the money that goes into his pocket is concerned, I cannot see that there is any difference between the home market and the foreign market. So far as bringing relief, for instance, to t'he wheat grower of the West is concerned, there is no difference.\n\nTake our wheat. Our price is fixed in Liverpool, and the Canadian consumer pays the Liverpool price, less the cost of sending the wheat to Liverpool. The producer in western Canada realizes exactly the same price in both cases, and it makes no difference to him financially whether the wheat stops in Ontario or goes on across the water. So as far as relief is concerned, the home market is not of any particular consequence. Suppose we bring people in here. Well, the price of our wheat is fixed by the world price, and if we could transport enough people to Canada to eat our wheat, they would not eat any more wheat here than they would if we left them in Europe, would they? Not a bit; perhaps not quite as much, for there I understand the ration is a bowl of soup and a loaf of bread, while over here we have meat and potatoes, vegetables and fruit and everything else, so I think they would eat rather more wheat on the other side of the water. So far as a market is concerned, this home market is a myth.\n\nAnother thing: We are raising about 300,000,000 bushels more wheat than we consume. We raised last year 470,000,000 bushels, and we eat about 50,000,000 bushels or a little less than that. A man eats between five and six bushels of wheat a year, or about\n\n50,000,000 bushels for eight and a half million people. We also sow about 50,000,000 bushels a year, or a little less than that. We have at least 300,000,000 bushels of wheat to ship abroad. Now suppose we tried to consume that wheat at home; 300,000,000 bushels divided by six means 50,000,000 people to bring in here to consume that wheat, and not one of them would be raising wheat. What would they do? That is the question. If we build up this home market they talk about, what are we going to do with these 50,000,000 people? Are they going to manufacture? Where will they sell their stuff? The hon. gentleman says that we should be self-contained; we should live on what we produce. Now we can produce enough to keep ourselves and still have a large surplus. What are we going to do with it? Send it abroad? We are self-contained, we are raising what we need and we should send our stuff abroad; load a shipload of our products, send it to the markets of the world and\n\nThe Budget-Mr. McConica\n\nsell it, and bring back a shipload of money; then load another ship and bring back another shipload of money. But how long could we keep that up? We would not get three cargoes out of this country till they would say: We\n\nwill buy your stuff if you will b.uy ours; our money is all gone. Yes, Mr. Speaker, we must depend for our foreign trade on our ability to buy foreign goods. There is no other way of doing business, and we cannot build up a foreign market unless we buy abroad. Fifty millions of people brought into Canada and engaged in manufacturing or any other vocation you could put them at would not eat a bit more wheat than if they had stayed in Europe. We would not have a market for an additional bushel.\n\nThe hon. gentleman says we are producing too much wheat. Well, they are buying all we send to them; they take all we produce. He also says the price is too low. But the price is not going down; it is as good this year as it was last. That is not saying much for it, but that is the situation. He also offers very good suggestions as to how we can relieve our farmers. They should not produce so much wheat, he says, and they should sell at a better price. But how are you going to get a better price? Then he says we must go into other lines of farming. Now what other line, I would like to know? I am a farmer and I am ready to shift to some other line. I have shifted to other lines, and it does not pay. There is nothing else that can be suggested for a farmer in the West to engage in. Talk about the dairy business-we cannot compete writh eastern Canada in that. Why Our cows are practically all dry fed for ten months in the year. We have a little fresh grass for feeding purposes along about the beginning of June, and then it dries up and our cows are practically fed on hay for the balance of the year; they give scarcely any milk. We cannot manufacture dairy products and compete with the farmers of Ontario and Quebec, even if we were as close to the market as they are. We are told to go into some other line, go in for raising cattle. I have raised cattle; I am raising cattle now. It takes ten acres of our prairie grass to keep a steer. That ten acres will cost $200. At 8 per cent that is $16 a year. You can summer the steer on that ten acres but then you have got to winter him. Sixteen dollars a year for three years. That is $48 and you will do mighty well if you can sell him for $30. That is the cattle business. We are told to go into some other line. I want to say to you that the other lines are worse than wheat, and I have tried\n\na good many of them. We are told that the aggregate reduction in the price of agricultural implements is not going to help us much. The reduction will not help us a whole lot, but it will help some. The hon. gentleman to my right (Sir Henry Drayton) told us that we would only save about $750,000 by this tariff reduction on agricultural implements."}, {"url": "https://dictionary.sensagent.com/Donald%20Alexander%20Mackinnon/en-en/", "page_content": "From Wikipedia\n\nFor other persons of the same name, see Don McKinnon (disambiguation)\n\nDonald Alexander MacKinnon (22 February 1863 – 20 April 1928) was a Canadian teacher, lawyer, politician, author, and Lieutenant Governor of Prince Edward Island from 1904 to 1910.\n\nBorn in Uigg, Prince Edward Island, the son of William and Catherine Nicholson Mackinnon, MacKinnon attended Uigg grammar school and started teaching when he was 14. He later received a first-class teaching licence from the Prince of Wales College in Charlottetown. In 1882, he started articling with the Charlottetown barrister Malcolm McLeod. From 1885 to 1887, he attended Dalhousie Law School where he received a Bachelor of Laws degree. He was called to the Bar an attorney in 1887 and a barrister in 1888. He was created a Queen's Counsel in 1899. He opened a practice in Georgetown, Prince Edward Island in 1887 where he remained until moving to Charlottetown in 1897. In 1900, he became president of the Law Society of Prince Edward Island.\n\nFrom 1893 to 1900, he was a member of the Legislative Assembly of Prince Edward Island for the electoral district of 4th Kings. In 1899, he was chosen as attorney general in the cabinet of Donald Farquharson; however, as a result of the appointment, he was required to run for reelection and he was defeated.\n\nHe was elected to the Canadian House of Commons as the Liberal candidate for the electoral district of East Queen's in the 1900 federal election. In 1901, the election was declared void and MacKinnon was re-elected in the resulting 1901 by-election. In 1904, he was appointed Lieutenant Governor of Prince Edward Island and served until 1910. He returned to federal politics when he was elected to the House of Commons for electoral district of Queen's in the 1921 federal election. MacKinnon died in Charlottetown in 1928."}], "Donald Alexander Mackinnon was instrumental in the passage of the Ontario Married Women's Property Act of 1914.": [{"url": "https://link.springer.com/referenceworkentry/10.1007/978-3-030-02721-6_316-1", "page_content": "The Married Women’s Property Acts (MWP Acts) were a pair of laws passed by the British Parliament in 1870 and 1882, respectively. The aim of these laws was to change the legal recognition of married women to allow a wife to retain ownership of her wages and inheritance and manage property for herself.\n\nThe Acts were variously supported by organizations including the Law Amendment Society (later merged with the Social Science Association), and the Langham Place Group as well as the especially formed Married Women’s Property Committee. Support also came from periodicals like the English Woman’s Journal (1858–1864) along with books and pamphlets by women including Barbara Leigh Smith Bodichon, Caroline Cornwallis, Frances Power Cobbe, and Annie Besant.\n\nThe passage of these Acts contradicted the previous common law nonexistence of women after they married and the consequent forfeiture of all rights and property. This meant that wives could retain control over property they..."}, {"url": "https://www.cambridge.org/core/journals/law-and-history-review/article/abs/married-womens-property-law-in-nineteenthcentury-canada/4DD51B94F0367BC0A2AA28F103DCC971", "page_content": "122. The western provinces were next to enact egalitarian legislation. British Columbia, in 1873, passed virtually an exact duplicate of the 1872 Ontario statute. [An Act to Extend the Rights of Property of Married Women, 36 Vict. (1873), c. 29 (B.C.); See also An Act Respecting the Property of Married Women, 50 Vict. (1887), c. 20 (B.C.). The latter was a virtual duplicate of the 1884 Ontario act, with a few additional provisions. See also R.S.B.C. 1897, c. 130.]\n\nThe Northwest Territories partially followed suit in 1880. [See An Act to Amend and Consolidate the Several Acts Relating to the North-West Territories, 43 Vict. (1880), c. 25 (D.C.), sec. 57-62. The 1880 act was a virtual duplicate of the 1872 Ontario statute, except that it was missing a few sections relating to life insurance and stockholding. No second Northwest Territorial enactment, similar to the 1884 Ontario and 1887 B. C. provisions, was ever enacted. See also An Ordinance to Facilitate the Conveyance of Real Estate by Married Women, Ord. No. 6 of 1886 (N.W.T.); An Ordinance Respecting the Personal Property of Married Women, Ord. No. 16 of 1889 (N.W.T.); An Ordinance Respecting the Personal Property of Married Women, Ord. No. 20 of 1890 (N.W.T.); Consolidated Ordinances of N.W.T. (1898), c. 47.]\n\nManitoba was the only western province with any innovative spirit. Its first married women's property statute, passed in 1875 was largely protective in nature, but included several egalitarian provisions that seem not to have been duplicated in exact words in any other Canadian or English jurisdiction. The statute appeared to grant married women significant dispositive power over their real estate, and the right to sue and be sued in their own names, without joining the names of their husbands. The novel sections seemed to conflict in part with the foregoing protective sections of the act and would therefore seem to have been the product of some confusion over how extensively married women's property rules should be reformed. By 1881, however, it appears that the Ontario model had by and large supervened, and various sections of the 1872 statute were imported into Manitoba. A 1900 enactment, with some drafting distinctions, similarly introduced much of the substance of the 1884 Ontario legislation. [An Act Respecting Separate Rights of Property of Married Women, 38 Vict. (1875), c. 25 (Manitoba). An Act to Amend Certain of the Acts Forming Part of the Consolidated Statutes of Manitoba, 44 Vict. (1881), c. 11 (Manitoba), sec. 75-81; 48 Vict. (1885), c. 28 (Man.); 49 Vict. (1886), c. 13 (Man.); 53 Vict. (1890), c. 17 (Man.); R.S.M. 1891, vol. 11, c. 95; 63-64 Vict. (1900), c. 27 (Man.).]\n\nThe maritime jurisdictions, which had been the first to initiate the marriage breakdown wave of legislation, were the last to enact egalitarian provisions. Nova Scotia passed a rather unusual piece of legislation in 1884, which seems to have been borrowed in part from Ontario and in part from England, and which embodied a very restricted set of egalitarian reforms. Some provisions appear to have been truly indigenous, indicating that this was no matter of routine legislative copying, but a deliberate response to matters of purely regional concern. Before a married woman was authorized to retain her own earnings, her husband had to register his written consent, a proviso not required in any other Canadian or English jurisdiction. Otherwise a traditional court order of protection was necessary to give married women control over their wages. Only after a court order of protection was issued, or a husband's consent was registered, were married women entitled to Contract, sue and dispose of their property on their own authority. In all other cases, husbands also had to be joined in any litigation arising out of their wives' property or torts.\n\n[of the Property of Married Women, R.S.N.S. (1880) (5th sen), c. 94: 60 Vict. (1897), c. 37 (N.S.); 61 Vict. (1898), c. 22 (N.S.).] Eleven years later New Brunswick fell in line with the other Canadian provinces and passed an act very similar to the 1884 Ontario precedent. [An act Respecting the Property of Married Women, 58 Vict. (1895), c. 24 (KB.).]\n\nPrince Edward Island was the last jurisdiction to enact egalitarian legislation in 1896. [An Act Relating to the Separate Property and the Rights of Property of Married Women, 59 Vict. (1896), c. 5 (P.E.I.).] The act was apparently sparked by a petition in 1895 from a group of women demanding reform. This is particularly interesting, since Prince Edward Island had little in the way of organized suffrage forces. In fact, Cleverdon has described a “general indifference to the question of women's political rights” in Prince Edward Island. Cleverdon, supra note 74, at 198, 201. In one important aspect, Prince Edward Island continued to lag behind the rest of the country. The statute specifically denied married women the right to their own earnings unless a traditional court order of protection was granted (sec. 4). The fact that virtually every other feature of the Ontario legislation was adopted, save for the matter of wages, indicates exceptional anxiety over the prospect of wage-earning wives."}, {"url": "https://hist259.web.unc.edu/marriedwomenspropertyact/", "page_content": "During the 18th and most of the 19th centuries, married British women lived under the conditions of coverture. This made a husband and wife one under the law and gave husbands financial and legal control over their wives. Under coverture, women lost all control of their property once married, unable to buy, sell, own, or inherit anything they possessed before. The pursuit of a career was almost impossible for women because under coverture they had no ability to sign contracts, have legal control over incomes, or other processes that are essential to earning income. These conditions were not applied to unmarried (single and widowed) women, who had marginal autonomy under the law for owning property.\n\nIn 1868, a Married Women’s Property Bill was presented to the British Parliament that offered married women the same rights as unmarried women. After two years of revisions, the Parliament finally passed the Married Women’s Property Act of 1870. It allowed for married women to keep their wages and investments independent of their husbands, inherit small sums, hold property either rented or inherited from close family, and made both parents liable for children. Although this was as step in the direction of women’s rights, married women still did not have full financial independence; most of their finances and property were still by law controlled by their husbands. Moreover, it only applied to future marriages, keeping women who were already married from regaining their property rights.\n\nThe passing of the Married Women’s Property Act of 1870 did not satisfy women’s rights activists, and women like Millicent Garrett Fawcett (1847-1929) advocated for women’s financial autonomy. Their continued campaigning eventually resulted in the passage of the Married Women’s Property Act of 1882. This law actually gave women independence under the law regarding finances and property. The law allowed women to own, buy, and sell property, keep any income from the property or an occupation, and keep any inheritance. Additionally, the law made both parents equally responsible for their children. These changes in legislature gave women much greater legal autonomy and cleared the British system of coverture.\n\nThough these laws did not make women equal to men under the civil law, they provided the necessary foundation for women to progress closer to equality. By gaining a legal identity through these two laws, women were then able to advocate for more rights as autonomous beings. The laws may not have changed societal beliefs of gendered labor or separate spheres, but they did end the invisibility of married women in the law. Women were no longer completely linked with their husbands financially. These laws gave them at least some level of independence that had not yet been obtained and placed them at a point where they could continue to gain independence and advocate for more rights.\n\nShana Loudermelk, History and Psychology double major, Class of 2019\n\n\n\nSources\n\nLiterature and Websites\n\n\n\nChristensen, V. r. “English Historical Fiction Authors: Women’s Rights and the Battle for Identity.” English Historical Fiction Authors (blog), at: https://englishhistoryauthors.blogspot.com/2012/05/women.html. (Accessed April 23, 2018.)\n\nFelluga. “Rachel Ablow, “‘One Flesh,’ One Person, and the 1870 Married Women’s Property Act.” BRANCH, at: http://www.branchcollective.org/?ps_articles=rachel-ablow-one-flesh-one-person-and-the-1870-married-womens-property-act (Accessed April 23, 2018).\n\nHLB. “Intriguing History – Married Women’s Property Act 1870.” Intriguing History (blog), January 4, 2012. http://www.intriguing-history.com/married-womens-property-act/. (Accessed April 23, 2018).\n\n“Married Women’s Property Act 1870.” Wikipedia, at: https://en.wikipedia.org/w/index.php?title=Married_Women%27s_Property_Act_1870&oldid=828322862 (Accessed April 23, 2018).\n\n“Married Women’s Property Act 1882.” Wikipedia, at: https://en.wikipedia.org/w/index.php?title=Married_Women%27s_Property_Act_1882&oldid=835268632 (Accessed April 23, 2018).\n\nGriffin, Ben. “Class, Gender, and Liberalism in Parliament, 1868-1882: The Case of the Married Women’s Property Acts.” The Historical Journal 46, no.1 (2003).): 59–87\n\nImages\n\n"}, {"url": "https://link.springer.com/article/10.1007/s11127-016-0323-x", "page_content": "Abbott, E. (1969 [1910]). Women in industry; a study in American economic history. New York: Arno & The New York Times.\n\nAshley, J. M. (1870). Circular of the Montana immigrant association. Library of Congress American Time Capsule Printed Ephemera Collection; Portfolio 86, Folder 27a.\n\nBasch, N. (1979). Invisible women: The legal fiction of marital unity in nineteenth-century America. Feminist Studies, 5(2), 346–366.\n\nBasch, N. (1986). The emerging legal history of women in the United States: Property, divorce, and the constitution. Signs, 12(1), 97–117.\n\nBaysinger, B. D., & Butler, H. N. (1985). The role of corporate law in the theory of the firm. Journal of Law and Economics, 28(1), 179–191.\n\nBebchuk, L. A. (1992). Federalism and the corporation: The desirable limits on state competition in corporate law. Harvard Law Review, 105(7), 1435–1510.\n\nBesley, T., & Case, A. C. (1995). Incumbent behavior: Vote seeking, tax setting and yardstick competition. American Economic Review, 85, 25–45.\n\nBlackstone, W. (1765). Commentaries on the laws of England: Book the first. Oxford: Clarendon Press.\n\nBoettke, P. J., Coyne, C. J., & Leeson, P. T. (2011). Quasimarket failure. Public Choice, 149(1–2), 209–224.\n\nBorneman, W. R. (2010). Rival rails: “The race to build America’s greatest transcontinental railroad”. New York: Random House.\n\nBratton, W. W., & McCahery, J. A. (1997). The new economics of jurisdictional competition: Devolutionary federalism in a second-best world. Georgetown Law Journal, 86, 201–278.\n\nBraun, S., & Kvasnicka, M. (2013). Men, women, and the ballot: Gender imbalances and suffrage extensions in U.S. states. Explorations in Economic History, 50(3), 405–426.\n\nBrennan, G., & Buchanan, J. M. (1980). The power to tax: Analytical foundations of a fiscal constitution. New York: Cambridge University Press.\n\nBrown, D. (1958). The gentle tamers: Women of the old wild west. New York: Putnam.\n\nBrown, D. (1977). Hear that lonesome whistle blow: Railroads in the west. New York: Holt, Rinehart and Winston.\n\nButler, H. N. (1985). Nineteenth-century jurisdictional competition in the granting of corporate privileges. Journal of Legal Studies, 14(1), 129–166.\n\nCain, L. P. (2006). Table Df874-881, “Railroad mileage and equipment: 1830–1890”, and Table Df927-955, “Railroad mileage, equipment, and passenger traffic and revenue: 1890–1980”. In S. B. Carter, et al. (Eds.), Historical statistics of the United States, earliest times to the present (Millennial ed.). New York: Cambridge University Press.\n\nCentral Pacific and Union Pacific Railroad timetables; information for travelers; passenger, excursion, & emigrant fare schedules; Pullman & Silver Palace Car rates; steamer, stage, & rail connections; route map. (1882, May 1). Central Pacific Railroad Photographic History Museum. Retrieved from http://cprr.org/Museum/Ephemera/CP-UP_Timetable_1882.html.\n\nChused, R. H. (1982). Married women’s property law: 1800–1850. Georgetown Law Journal, 71, 1359–1425.\n\nCrowley, G. R., & Sobel, R. S. (2011). Does fiscal decentralization constrain Leviathan? New evidence from local property tax competition. Public Choice, 149(1–2), 5–30.\n\nDoepke, M., & Tertilt, M. (2009). Women’s liberation: What’s in it for men? The Quarterly Journal of Economics, 124(4), 1541–1591.\n\nDownes, R. C. (1931). The statehood contest in Ohio. The Mississippi Valley Historical Review, 18(2), 155–171.\n\nEasterbrook, F. H. (1983). Antitrust and the economics of federalism. Journal of Law and Economics, 26(1), 23–50.\n\nEasterbrook, F. H., & Fischel, D. R. (1991). The economic structure of corporate law. Cambridge, MA: Harvard University Press.\n\nEpple, D., & Zelenitz, A. (1981). The roles of jurisdictional competition and of collective choice institutions in the market for local public goods. The American Economic Review, 71(2), 87–92.\n\nFernandez, R. (2012). Women’s rights and development. Journal of Economic Growth, 19(1), 37–80.\n\nFleck, R. K., & Hanssen, F. A. (2010). “Rulers ruled by women”: An economic analysis of the rise and fall of women’s rights in ancient Sparta. Economics of Governance, 3(10), 221–245.\n\nFoner, P. S. (Ed.). (1977). The factory girls: A collection of writings on life and struggles in the New England factories of the 1840s by the factory girls themselves, and the story, in their own words, of the first trade unions of women workers in the United States. Urbana, IL: University of Illinois Press.\n\nFriedman, L. M. (1973). A history of American law. New York: Simon and Schuster.\n\nGeddes, R., & Lueck, D. (2002). The gains from self-ownership and the expansion of women’s rights. The American Economic Review, 92(4), 1079–1092.\n\nGeddes, R., & Tennyson, S. (2012). Passage of the Married Women’s Property Acts and Earnings Acts in the United States: 1850 to 1920. Research in Economic History, 29, 145–189.\n\nGinger, R. (1954). Labor in a Massachusetts cotton mill, 1853–60. The Business History Review, 28(1), 67–91.\n\nGoetzmann, W. H. [1959] /1979. Army Exploration in the American West, 1803-1863. Lincoln, NE: University of Nebraska Press.\n\nGoldin, C. (1990). Understanding the gender gap: An economic history of American women. Oxford: Oxford University Press.\n\nHaines, M. R. (2006). Tables Aa2244-2340 through Aa6500-6550. In S. B. Carter, et al. (Eds.), Historical statistics of the United States, earliest times to the present (Millennial ed.). New York: Cambridge University Press.\n\nHallgarth, S. A. (1989). Women settlers on the frontier: Unwed, unreluctant, unrepentant. Women’s Studies Quarterly, 17(3/4), 23–34.\n\nHartog, H. (2002). Man and wife in America. Cambridge, MA: Harvard University Press.\n\nHekman, J. S. (1980). The product cycle and New England textiles. The Quarterly Journal of Economics, 94(4), 697–717.\n\nHirschman, A. O. (1970). Exit, voice, and loyalty: Responses to decline in firms, organizations, and states. Cambridge, MA: Harvard University Press.\n\nHistorical Census Browser. (2004). Retrieved total population from the University of Virginia, Geospatial and Statistical Data Center. http://mapserver.lib.virginia.edu/.\n\nHoff, J. (1991). Law, gender, and injustice: A legal history of U.S. women. New York: New York University Press.\n\nHoff, J. (2007). American women and the lingering implications of coverture. The Social Science Journal, 44(1), 41–55.\n\nHorpedahl, J. (2011). Political exchange and the voting franchise: Universal democracy as an emergent process. Constitutional Political Economy, 22(3), 203–220.\n\nJones, M. S. (1987). An historical geography of changing divorce law in the United States. New York: Garland Publishing Inc.\n\nKahan, M., & Kamar, E. (2002). The myth of state competition in corporate law. Stanford Law Review, 55(3), 679–749.\n\nKleinberg, S. J. (1999). Women in the United States, 1830–1945. New Brunswick, NJ: Rutgers University Press.\n\nLowell, J. A. (1848). Memoir of Patrick Tracy Jackson. New York: Merchants’ Magazine and Commercial Review.\n\nMoussalli, Stephanie D. (2008). The fiscal effects of statehood: New Mexico and Arizona, 1903–1919. Public Choice, 137(1–2), 119–126.\n\nMoussalli, S. D. (2012). The fiscal case against statehood: Accounting for statehood in New Mexico and Arizona. Lanham, MD: Lexington Books.\n\nO’Hara, E. A., & Ribstein, L. E. (2009). The law market. New York: Oxford University Press.\n\nOates, W. E. (1985). Searching for Leviathan: An empirical study. The American Economic Review, 75(4), 748–757.\n\nOates, W. E., & Schwab, R. M. (1988). Economic competition among jurisdictions: Efficiency enhancing or distortion inducing? Journal of Public Economics, 35(3), 333–354.\n\nOstrom, V., Tiebout, C. M., & Warren, R. (1961). The organization of government in metropolitan areas: A theoretical inquiry. American Political Science Review, 55, 831–842.\n\nOwens, K. N. (1987). The prizes of statehood. Montana: The Magazine of Western History, 37(4), 2–9.\n\nPoling-Kempes, L. (1989). The Harvey girls: Women who opened the West. New York: Paragon House.\n\nRabkin, P. A. (1980). Fathers to daughters: The legal foundations of female emancipation. Westport, CT: Greenwood.\n\nRichter, A. (2005). Home on the rails: Women, the railroad, and the rise of public domesticity. Chapel Hill: University of North Carolina Press.\n\nRobinson, H. H. ([1898] 1976). Loom and spindle, or life among the early mill girls. Kailua, HI: Press Pacifica.\n\nRosenberg, C. M. (2011). The life and times of Francis Cabot Lowell, 1775–1817. Lanham, MD: Lexington Books.\n\nSalmon, M. (1986). Women and the law of property in early America. Chapel Hill, NC: University of North Carolina Press.\n\nSalmon, M. (1992). Women and property in South Carolina: The evidence from marriage settlements, 1730–1830. In N. F. Cott (Ed.), History of women in the United States: Historical articles on women’s lives and activities, Vol. 3: domestic relations and law (pp. 3–33). Munich: K.G. Saur.\n\nSamuelson, P. A. (1954). The pure theory of public expenditure. The Review of Economics and Statistics, 36(4), 387–389.\n\nSchlissel, L. ([1982] 2004). Women’s diaries of the westward journey. New York: Schocken Books.\n\nSells, J. A. (2008). Stagecoaches across the American West 1850 to 1920. Blaine, WA: Hancock House.\n\nShughart, W. F, I. I., & Tollison, R. D. (1985). Corporate chartering: An exploration in the economics of legal change. Economic Inquiry, 13, 585–599.\n\nStansel, D. (2006). Interjurisdictional competition and local government spending in U.S. metropolitan areas. Public Finance Review, 34(2), 173–194.\n\nSumner, H. L. (1910). Volume IX: History of women in industry in the United States. Washington, D.C.: Government Printing Office.\n\nTiebout, C. M. (1956). A pure theory of local expenditures. Journal of Political Economy, 64, 416–424.\n\nUnited States Bureau of the Census. (1841). Compendium of the enumeration of the inhabitants and statistics of the United States, as obtained at the Department of State, from the returns of the sixth census. Washington, D.C.: Thomas Allen.\n\nUnited States Bureau of the Census. (1902). Twelfth census of the United States, taken in the year 1900: Census reports, Vol. VIII: Manufactures part II: States and territories. Washington, D.C.: United States Census Office.\n\nUnited States Bureau of the Census. (1913). Thirteenth census of the United States, taken in the year 1910: Census reports, Vol. VIII: Manufactures 1909: General report and analysis. Washington, D.C.: Government Printing Office.\n\nWagner, R. (2011). Municipal corporations, economic calculation, and political pricing: Exploring a theoretical antimony. Public Choice, 149, 151–165.\n\nWagner, R. E., & Weber, W. E. (1975). Competition, monopoly, and the organization of government in metropolitan areas. Journal of Law and Economics, 18(3), 661–684.\n\nWarbasse, E. B. (1987). The changing legal rights of married women 1800–1861. New York: Garland Publishing Inc.\n\nWeiss, T. (2006). Free female gainful workers, by state: 1800–1900 [Age 16 and older]. In S. B. Carter et al. (Eds.), Table Ba128-176 in Historical statistics of the United States, earliest times to the present (Millennial ed.). New York: Cambridge University Press.\n\nWilloughby, W. F. (1905). Territories and dependencies of the United States. New York: Burr Publishing House."}, {"url": "https://www.mshistorynow.mdah.ms.gov/lesson-plan/betsy-love-and-the-mississippi-married-womens-property-act-of-1839-lesson-plan", "page_content": "OVERVIEW\n\nWith every social and cultural change in our American society there are individuals and events that serve as catalysts for these circumstances. Betsy Love is certainly a woman who helped bring change not only to Mississippi, but also to our nation. Her role in the lawsuit Fisher v. Allen served as a precedent in establishing the protection of property that belonged to married women. It was Love’s Chickasaw heritage and the tribal law of her culture that helped change the Mississippi state law concerning the property of married women. Most states in the nation followed Mississippi’s example concerning this issue. Unfortunately, Betsy Love’s part in furthering the rights of women has gained little attention not only in American history, but also in history of our state.\n\nCURRICULAR CONNECTIONS\n\nUS History: Exploration to 1877\n\n8.7.4 - Examine leaders in the women suffrage movement, including: biographies, writings, and speeches of Dorothea Dix, Elizabeth Cady Stanton, Lucretia Mott, Susan B. Anthony, and their influence on women’s rights.\n\nMississippi Studies\n\nMS.5.3 - Contrast the culture and social structure that developed in Mississippi during the antebellum period.\n\nTEACHING LEVELS\n\nGrades 7 through 12.\n\nMATERIALS AND EQUIPMENT\n\nProjector or Smartboard\n\nWhiteboard and markers\n\nMississippi History Now article\n\nUnlined paper for cartoons\n\nMarkers and colored pencils\n\nNotebook paper\n\nPens/pencils\n\nOBJECTIVES\n\nStudents will:\n\nDetermine the significance of the lawsuit Fisher v. Allen.\n\nExplain the importance of the Married Women’s Property Act of 1839.\n\nIdentify those individuals and events involved in facilitating the passage of the Married Women’s Property Act of 1839.\n\nOPENING THE LESSON\n\nThe teacher will ask the class to name female Mississippians who have made contributions to Mississippi and/or American history. The names can be listed on the board. The teacher will add Betsy Love’s name to the list and then ask the students to name her contribution to Mississippi history. More than likely, the students will not be able to answer questions about Betsy Love. Students will be informed that they will learn about Love’s contributions to the development of women’s rights in the state of Mississippi.\n\nDEVELOPING THE LESSON\n\nThe students will be asked to copy into their notebooks the questions listed at the end of the lesson plan. The questions can be listed on the whiteboard, Smartboard, or projector. Students will use the Mississippi History Now article in order to answer the questions. Students may work alone with a partner for this portion of the lesson plan. Once the students have completed the questions, allow student-volunteers to share their questions with the class. Students may check the answers to the questions for accuracy and comparison. The question-and-answer session for this article will lead the discussion. Be sure that students understand the precedence established by Fisher v. Allen and how it contributed to the passage of the Married Women’s Property Act of 1839. After the class discussion is complete, allow for students to complete one of the following activities (students should be allowed to work with a partner for this portion of the lesson): A newspaper editorial or letter to the editor that might have been published before or after the passage of the Married Women’s Property Act of 1839. A speech that might be delivered during Women’s history month to celebrate Betsy Love’s importance to women’s rights. A letter addressed to Elizabeth Gasper Brown addressing why Betsy Love may have had more significance in the passage of the Married Women’s Property Act of 1839 than Mrs. T.B.J. Hadley.\n\nCONCLUDING THE LESSON\n\nAllow students to share their letters or speeches with the class.\n\nASSESSING STUDENT LEARNING\n\nClass discussion and participation Questions Editorials or speeches\n\nEXTENDING THE LESSON\n\nAllow the students to research the culture of the Chickasaw tribe. Allow students to research gender roles in American society in 1839; they can complete a comparison/contrast study between them and gender roles today.\n\nQuestions for Betsy Love article"}, {"url": "https://www.cambridge.org/core/journals/journal-of-economic-history/article/measure-of-legal-independence-the-1870-married-womens-property-act-and-the-portfolio-allocations-of-british-wives/F3699701F623618A5058F88763C47CFA", "page_content": "Crossref Citations\n\nThis article has been cited by the following publications. This list is generated based on data provided by Crossref.\n\nCombs, Mary Beth 2006. CUI BONO?THE 1870 BRITISH MARRIED WOMEN'S PROPERTY ACT, BARGAINING POWER, AND THE DISTRIBUTION OF RESOURCES WITHIN MARRIAGE. Feminist Economics, Vol. 12, Issue. 1-2, p. 51.\n\nDi Matteo, Livio 2008. Wealth accumulation motives: evidence from the probate records of Ontario, 1892 and 1902. Cliometrica, Vol. 2, Issue. 2, p. 143.\n\nMcDevitt, Catherine 2010. Women, Real Estate, and Wealth in a Southern US County, 1780–1860. Feminist Economics, Vol. 16, Issue. 2, p. 47.\n\nCowman, Krista 2010. Women in British Politics, c. 1689–1979. p. 30.\n\nRUTTERFORD, JANETTE GREEN, DAVID R. MALTBY, JOSEPHINE and OWENS, ALASTAIR 2011. Who comprised the nation of shareholders? Gender and investment in Great Britain, c. 1870-1935. The Economic History Review, Vol. 64, Issue. 1, p. 157.\n\nDoepke, Matthias Tertilt, Michèle and Voena, Alessandra 2012. The Economics and Politics of Women's Rights. Annual Review of Economics, Vol. 4, Issue. 1, p. 339.\n\nDi Matteo, Livio 2013. Women, wealth and economic change: An assessment of the impact of women's property law in Wentworth County, Ontario, 1872–1927. Explorations in Economic History, Vol. 50, Issue. 2, p. 285.\n\nDi Matteo, Livio 2016. Wealth Distribution and the Canadian Middle Class: Historical Evidence and Policy Implications. Canadian Public Policy, Vol. 42, Issue. 2, p. 132.\n\nMcDevitt, Catherine L. and Irwin, James R. 2017. The Narrowing of the Gender Wealth Gap across the Nineteenth-Century United States. Social Science History, Vol. 41, Issue. 2, p. 255.\n\nHenry, Nancy 2018. Women, Literature and Finance in Victorian Britain. p. 1.\n\nHenry, Nancy 2018. Women, Literature and Finance in Victorian Britain. p. 29.\n\nArstein-Kerslake, Anna 2019. Gendered denials: Vulnerability created by barriers to legal capacity for women and disabled women. International Journal of Law and Psychiatry, Vol. 66, Issue. , p. 101501.\n\nFriedland, Julian and Cole, Benjamin M. 2019. From Homo-economicus to Homo-virtus: A System-Theoretic Model for Raising Moral Self-Awareness. Journal of Business Ethics, Vol. 155, Issue. 1, p. 191.\n\nHutton, Christopher 2019. The Tyranny of Ordinary Meaning. p. 59.\n\nAcheson, Graeme Campbell, Gareth Gallagher, Aine and Turner, John D. 2020. Independent Women: Investing in British Railways, 1870-1922. SSRN Electronic Journal ,\n\nDavid, Joseph E. 2020. Kinship, Law and Politics.\n\nSavage, Deborah 2020. Redeeming Woman: A Response to the “Second Sex” Issue from within the Tradition of Catholic Scriptural Exegesis. Religions, Vol. 11, Issue. 9, p. 474.\n\nRistić, Milica 2021. Pojedini aspekti građanskopravnog položaja udatih žena u srednjovjekovnoj Engleskoj. Vesnik pravne istorije, Vol. 1, Issue. 2/2020, p. 38.\n\nAcheson, Graeme G. Campbell, Gareth Gallagher, Áine and Turner, John D. 2021. Independent women: investing in British railways, 1870–1922 † . The Economic History Review, Vol. 74, Issue. 2, p. 471.\n\n2021. Gendered Laws, Informal Origins, and Subsequent Performance."}, {"url": "https://intriguing-history.com/married-womens-property-act/", "page_content": "Married Women’s Property Act 1870\n\nWhy was there a need for a Married Women’s Property Act at the end of the 19th century?\n\nThe stark and simple truth was that when a woman married she virtually became invisible as far as the law was concerned. A woman merely became an addition to the property owned by her husband. What that meant in reality, was that all a wife’s possessions, her wealth and her property were controlled by her husband. She could not dispose of any belongings without his consent.\n\n‘the husband and wife are one person in law: that is, the very being or legal existence of the woman is suspended during her marriage, or at least is incorporated or consolidated into that of her husband, under whose wing, protection and cover, she performs everything.’\n\nSir William Blackstone\n\nMany women were put in impossible situations, especially if they wanted to divorce their husbands, which was only available to the wealthiest people since it required an act of Parliament. The Divorce and Matrimonial Causes Act of 1857 however denied a husband his right to the earnings of a wife he had deserted. The woman in this instance would become a single woman again but as mentioned before, divorce was very difficult to achieve.\n\nMarried Women’s Property Act 1870 and the Kensington Society\n\nThe situation was unacceptable to many women, amongst them Millicent Fawcett, feminist and politician and other women who were trying to pursue careers in medicine, education and politics. They formed the Kensington Society primarily to debate Parliamentary reform and the right of women to vote but they also took up the cause of the property rights of married women and their hard work won over various members of Parliament to enable the act to reach the statute books.\n\nThe Married Woman’s Property Act 1870, allowed women to keep earnings or property acquired after marriage but it also highlighted other various significant aspects relating to women as well and was another act that paved the way towards equality, for example;\n\nThe legal identity of husband and wife. A wife was not equal in the eyes of the law, indeed they had the same legal status as a criminal or insane person did.\n\nA woman could be sued by her husband but not vice versa, however he was liable for all her debts and breaches of law.\n\nThis is neatly illustrated for us by Charles Dickens in Oliver Twist\n\nIt was all Mrs. Bumble. She would do it,” urged Mr. Bumble; first looking round, to ascertain that his partner had left the room. That is no excuse,” returned Mr. Brownlow. “You were present on the occasion of the destruction of these trinkets, and, indeed, are the more guilty of the two, in the eye of the law; for the law supposes that your wife acts under your direction.” If the law supposes that,” said Mr. Bumble, squeezing his hat emphatically in both hands, “the law is a ass — a idiot. If that’s the eye of the law, the law is a bachelor; and the worst I wish the law is, that his eye may be opened by experience — by experience.”\n\nThe Married Women’s Property Act 1870, improved wives’ position to an extent by giving them possession of their own earnings, not yet of their property, that was to come later in the Act of 1882.\n\nThe Act stated:\n\nWages and investments made by a wife could be held by a wife for her own separate use, independent from her husband\n\n\n\n\n\nA wife could inherit up to £200 in her own right and keep the money\n\n\n\n\n\nA wife was allowed to keep any property inherited from her next of kin as long as it was not bound in trust\n\n\n\n\n\nThey could hold and inherit rented property\n\n\n\n\n\nThe act also held that both parents could be made liable to support children\n\nFind out about other acts of parliament and the impact they had on women in society by clicking here.\n\nShare this: WhatsApp\n\nFacebook\n\nTelegram\n\nTwitter\n\nPinterest\n\nSkype\n\nTumblr\n\nPrint\n\nMore\n\nLinkedIn\n\nReddit\n\n\n\n\n\nLike this: Like Loading..."}, {"url": "https://www.studocu.com/en-au/document/james-cook-university/land-law-2/la2016-research-essay-married-womens-property-acts/10950670", "page_content": "The Married Women’s Property Act’s\n\nLifting the Veil of Invisibility\n\n*Razmie-Jane Collyer\n\nI INTRODUCTION\n\nThe mid-to late 19th century represents the beginning of a shift in social and political thinking towards the recognition of women’s rights and equality before the law. 1 During this period common law jurisdictions around the world introduced a series of acts targeting legal recognition of a married women’s right to property. These acts have come to be known as The Married Women’s Property Acts (* MWPA’s *). 2 America lead the forefront to change in this area of law, beginning in the 1840’s. By 1920, 43 American states passed legislative reforms recognising property rights for women within a marriage. 3 Following suit, other common law jurisdictions including England, 4 Australia, 5 Canada, 6 Scotland, 7 and Papua New Guinea, 8 implemented similar legislation. This essay, however, focuses on the English Married Woman’s Property Act 1882 and its subsequent reception into Australian law. It provides an overview of the law prior to the MWPA’s and then an analysis of its objective and implementation in both English and Australian jurisdiction. In concluding, this essay illustrates the significance of the MWPA’s to forming the current legal position of a married women’s right to property.\n\nII ARCHAIC LAW: THE DOCTRINE OF COVERTURE\n\nHistorically, a wedding veil was not the only veil that a woman gained on her wedding day. Once a woman became a feme covert (a married woman), common law provided her with a figurative veil of invisibility in the eyes of the law. This was referred to as the doctrine of coverture and she wore this\n\n1 Andrew Cowie ‘A History of Married Women’s Real Property Rights’ (Research Paper No 6, Australian Journal of Gender and Law, Austlii, 2009) 5. 2 Jayme S. Lemke, ‘Interjurisdictional competition and the Married Women’s Property Acts’ (2016) 166 Public Choice 291, 292. 3 Lemke (n 2). 4 The Married Women’s Property Act 1870 (UK) and The Married Women’s Property Act 1882 (UK) 5 The Married Women’s Property Act 1901 (NSW); The Married Women’s Property Acts 1890 to 1952 (Qld); Law of Property Act (1936) (SA); Married Women’s Property Act 1935 (Tas); Married Women’s Property Act 1928 (Vic); Married Women’s Property Act 1892 (WA). 6 The Married Women’s Property Acts were implemented through various Canadian States between 1872 and 1884. See, Mary Beth Combes, ‘A Measure of Legal Independence: The 1870 Married Women’s Property Act and the Portfolio Allocations of British Wives’ (2005) 65 (4) The Journal of Economic History 1028, 1032. 7 Married Women's Property Act 1881(Scotland). 8 Married Women's Property Act 1953 (Papua New Guinea).\n\nveil for the rest of her married life. 9 The premise of coverture stems from the doctrine of unity, marriage was said to create a ‘legal fiction’, whereby the husband and wife were viewed as one in the eyes of the law. 10 It was her husband’s duty ‘to maintain her when married, and she was bound to contribute all her worldly goods to the common fund, which was for the maintenance of both’. 11\n\nA Coverture in practice\n\nThe practical impact of coverture meant that a wife could not legally contract or leave property by will, nor could she sue, be sued or become liable for debt. 12 In accordance with this doctrine, all of the property she owned whilst being a feme sole (a single woman) was transferred to the control of her husband. 13 This included money, stocks, furniture, and livestock, he was then allowed to dispose of it at his liberty. 14 He could also dispose of any leaseholds she held prior to the marriage and was entitled to any earnings she made from employment. 15 Additionally, despite a wife retaining legal ownership of real property acquired as a feme sole, she lost any legal right to control it, sell it, rent it, or mortgage it. Any profits gained from renting her real property became her husband’s entitlement. 16 This systematic disregard of a women’s legal identity and property rights created great disadvantage to women. Particularly for those who were in abusive relationships, divorce at the time was extremely hard to obtain and usually only obtained by the very wealthy as it required an act of parliament. 17 If a woman sought to live apart from her husband, without a divorce she was left in an exceptionally challenging position as the doctrine of coverture would still apply to her. 18\n\nB The Courts of Equity and Ecclesiastical Courts\n\nNotwithstanding this deliberate disregard to a women’s property rights under common law, there was a level of protection afforded to women by the Court of Chancery, The Courts of Request and The Ecclesiastical Courts, particularly between the 16th and 17th century when common law was not the most prevalent form of law. In fact, some scholars argue that ‘coverture is.. .an inadequate description of marital property relations’ during this time, 19 and that women frequently employed the\n\n9 The 17th century judge and judicial commentator, Sir William Blackstone famously declared: the legal effect of coverture provides that ‘the very being or legal existence of the women is suspended during the marriage and.. into that of the husband’. See, Charles Gregory Wade, The Married Women’s Property Act 1893 56 VIC NO 11 (Hayes Brothers, Sydney 1894) 1; Cowie (n 1) 3; Lemke (n 2). 10 Charles Gregory Wade, The Married Women’s Property Act 1893 56 VIC NO 11 (Hayes Brothers, Sydney 1894) 1. 11 Ibid. 12 Essentially ‘the husband gained “profitable guardianship... over the wife and over her property” Combes (n 6). 13 Combes (n 6). 14 Combes (n 6). 15 Austin Asche,‘Changes in the Rights of Women and Children under Family Law Legislation’ (1975) 49 The Australian Law Journal 387, 387; See also Cowie (n 1) 3. 16 Combes (n 6). 17 Asche (n 15) 388. 18 Ibid. 19 Pamela Hammons, ‘Rethinking Women and Property in Sixteenth and Seventeenth-Century England’ (2006) 3/ Literature Compass 1386, 1392.\n\nThe Victorian era of the 19th century saw not only the rise of the industrial revolution but also the rise of the women’s movement. Women sought not only to be regarded but regarded equally, vital to this movement was the need to re-evaluate a married woman’s right to property. 31\n\nA Married Women’s Property Act 1970\n\nThe change did not come without challenges, in the mid 1850’s the first English bill on married women’s property was tabled in the House of Commons, however it was swiftly defeated in 1856 and was not tabled again until 1865. 32 There was much fear associated with disrupting the law which advocates of the bill saw as obsolete and unjust. 33 Opponents of the bill argued that it would ‘disrupt the peaceful foundation of domestic life.’ 34 The eventual compromise came in the form of the MWPA 1870. 35 Whilst this was a definite step forward, the act only allowed a woman to retain her wages and certain other forms of income, it did not allow for the ownership of their property. 36 As such the act was replaced by the MWPA 1882. 37\n\nB Married Women’s Property Act 1882: Reception into\n\nAustralian Law\n\nThe MWPA 1882, was more comprehensive than its 1870 predecessor, it created a system of separate property within the marital relationship and was ultimately enacted in all Australian states. 38 Queensland adopted the act in 1890, 39 with amendments made in 1897 40 and again in 1943 41 , collectively the acts were referred to as the MWPA’s 1890 to 1954. 42 Essentially these acts attempted to place a married woman in the same legal position as a feme sole , 43 by providing codification of the equitable doctrine of separate property, making it statutory law and giving all married women access\n\n31 Ultimately women sought greater equality between the sexes, as such the campaign for married women’s property rights, traversed with the women’s campaigns for suffrage, education, and equal wages for equal work. Cowie (n 1) 5. 32 Cowie (n 1) 6. 33 Advocates of the bill lobbied for the abolition of the doctrine of unity, emphasising a need for women to control their own property regardless of marital status, whilst opponents argued that this would cause unwarranted ‘antagonism between those who we were taught to believe were one. Cowie (n 1) 6. 34 Cowie (n 1) 6. 35 The Married Women’s Property Act 1870 (UK). 36 Asche (n 15). 37 The Married Women’s Property Act 1882 (UK) 38 Asche (n 15) 388. 39 The Married Woman’s Property Act 1890 54 Vic. No. 9; See also, The Office of the Queensland Parliamentary Counsel, The Public Acts of Queensland (Reprint) 1828-1936: classified and annotated; Volume VI: Marriage and Divorce to Poultry (Butterworth & Co, Australia 2015) 86-97. 40 The Married Woman’s Property Act 1897 61 Vic. No. 2; See also, The Office of the Queensland Parliamentary Counsel, The Public Acts of Queensland (Reprint) 1828-1936: classified and annotated; Volume VI: Marriage and Divorce to Poultry (Butterworth & Co, Australia 2015) 86-97. 41 The Married Women’s Property Act Amendment Act of 1943 7 Geo VI, No 6. 42 Ibid. 43 Asche (n 15) 388.\n\nto a separate property law regime. 44 Thus, in Queensland from 1890 married women had the statutory right to hold or dispose of property, to sue or be sued and to contract. 45\n\nC Questions of Statutory Interpretation\n\nWhilst the MWPA’s represent a milestone for married women, it was not a complete victory in recognising her property rights. When the parliament enacted the MWPA’s in 1882, there was no guidance provided with regards to how the act should be applied. 46 Consequently, there was much disagreement with regards to the interpretation of the act. This led to a divergence in opinion between the English and Australian Courts, particularly when dealing with third parties and divorce settlements.\n\n1 Abolition of the Doctrine of Unity and Coverture?\n\nEarly case law illustrates a primary issue faced by the courts was whether the new statutory regime was intended to co-exist with the doctrine of unity and coverture or whether it was meant to render these doctrines obsolete. 47\n\n(a) Initial English Interpretation\n\nInitially the MWPA was interpreted as only recognising a married woman’s property as separate to her husband within a marriage. Courts were reluctant to recognise this separation when dealing with a third party, as was the case in Jupp v Buckwell. 48 This case was decided six years after the implementation of the Act, it dealt with the division of an estate amongst a married couple and third party. The testator Mr Jupp, had expressed intention to leave a portion of his estate in equal parts to his sister Mary Buckwell, her husband Daniel Buckwell and Harriet Buckwell (Daniels daughter/Mary’s step-daughter). 49 The question arose as to whether the parties were each entitled to one third of the inheritance or whether the doctrine of unity should be applied. Applying the doctrine of unity meant that Mary and Daniel received only a quarter share each and Harriet a half share. 50 In this case the court did not accept that the MWPA altered any law in relation to dealings with third parties, 51 and they disregarded the logical argument that it is unlikely Mr Jupp’s had intended to leave his sister’s step daughter more than his sister. 52 Instead, it was held that the act only hindered the interests of husband in relation to his wife’s property. 53 As such, without express intention of\n\n44 Cowie (n 1) 7. 45 Asche (n 15) 388. 46 Rimmer v Rimmer [I953] 1 1 Q. 63, 73 (* Rimmer *). 47 Cowie (n 1) 8. 48 (1888) L. 39 Ch. D. 148. ( Jupp ) 49 Ibid 148. 50 Ibid. 51 Ibid 152-154. 52 Ibid 149. 53 Ibid 152-154.\n\nfit. 64 Others asserted that the section was no more than procedural. 65 Ultimately both countries agreed that the latter construction was preferred. 66 This meant that the court was bound to apply the principles of property law and equity when deciding property disputes between a husband and wife. Consequently, this led to further inequality for married women given that property was usually in the husband's name. 67\n\n(a) Equity claims: Presumption of Advancement and Trust\n\nIn some circumstances the wife could gain benefit if using the equitable concepts of resulting trusts and advancement. 68 However given that the purchaser of the property was generally the husband, the application of these concept’s inadvertently favoured him. This was because when asserting that a trust had resulted, the burden of proof was firmly placed upon the person asserting it and their intention at the time of purchase. 69\n\n(b) Applying Property Law in Divorce settlements\n\nAs previously mentioned, the courts were tasked with determining the property rights of husband and wife by applying the normal principles of property law and equity. However, the rules of property law did not account for non-financial contributions made by the parties. As such, the court had to determine from the evidence whether the parties had made an agreement or had a common intention as to whom would have beneficial ownership. 70 This was not ideal, as Lord Hodson noted in Pettitt v Pettitt, 71 despite the difficulty of deducing intention from a non-existent contract or the difficulty in determining whether an agreement for future separation can be established. The breakdown of a marriage has no automatic effect on existing property rights. Further, ‘The conception of a normal married couple spending the long winter evenings hammering out agreements about their possessions appears grotesque’. 72 His lordship clearly indicated his apprehension with the system and highlighted the need for a better legislative framework. 73\n\n64 Pettitt v Pettitt [1970] A. 777, Reid J provides a good explanation of the conflicting arguments regarding the construction of s17 at 792; See also, Cowie (n 1) 12. 65 Ibid. 66 English Authority: Pettitt v Pettitt [1970] A. 777, 812; Gissing v Gissing [1971] A. 886, 890; Australian Authority: Wirth v Wirth (1956) 98 CLR 228, 231, 247; Martin v Martin (1959) 110 CLR 297, 306. 67 Asche (n 15) 389. 68 Presumption of Advancement: Where a purchaser of property places the title in the name of his or her spouse or to their child in circumstances that they did not contributed to the purchase price. It is assumed the transfer was intended to be a gift. See, Calverley v Green (1984) 155 CLR 242, 155, 249-250. 69 In Martin v Martin (1959) 110 CLR 297 The High Court said: ‘If on the whole of the evidence the Court is satisfied... that the husband... did not intend at the time of the purchase that his wife... should take by way of advancement, the rule of law is that there is a resulting trust for the husband’ at 304-5 (Dixon CJ, McTiernan, Fullagar, Windeyer JJ) citing Davies v The National Trustees Executors and Agency Co of Australasia Ltd [1912] V.L. 397 403 (Cussen J). 70 Gissing v Gissing [1971] A. 886, 891; See also, Rimmer (n 46) 73, where the court stated that: if there is clear intention regarding absolute beneficial interest or if there is clear intention as to how the property is to be divided then the court will give effect to this intention. However, in circumstances that no intention can be found the starting point should be to equally divide the property. 71 [1970] A. 777 (* Pettitt*). 72 Ibid 810 (Hodson L). 73 Ibid 811.\n\nIV PAVING THE WAY TO AUSTRALIAN FAMILY LAW\n\nIn recognition of the complications caused by section 17, the Victorian parliament amended their MWPA to ensure that a judge had the discretion to do broad justice unrestricted by the strict the rules of property law and equity. 74 These amendments created a statutory presumption that property acquired as the marital home in the name of one of the parties, should be regarded as jointly owned. 75 This was said to be the closest that any Australian State came to implementing a doctrine of community property between a married couple. 76 Today, these provisions have been superseded by the Family Law Act 1975 Cth. 77\n\nA The Matrimonial Causes Act\n\nIt should be noted that prior to the FLA and the Victorian amendments, the Commonwealth Matrimonial Causes Act, 78 was introduced. 79 This act paved the way to our contemporary family law system, prior its introduction the disadvantage caused by s17’s narrow construction had not been properly dealt with, namely the court still didn’t consider a wife’s contribution to the home, family assets, family’s welfare as wife, housekeeper and mother. 80 The MCA achieved significant alterations to a married woman’s property rights. Amongst other things, it changed the courts approach with regards to property settlements. In circumstances that a parallel application had been submitted within state jurisdiction (under s17 of The MWPA ), the MCA prevailed. 81 It also provided the court with broad authority make property settlements that benefited both parties or children of the marriage. 82 This meant that finally there was potential for a wife to gain settlement of her husband’s property in recognition of her non-financial contributions. Unfortunately, there was still issues related to this act as the wife was not able to claim for a property settlement until a ground of divorce became available to her, and during this time the husband could dispose of his property and apply to force a sale under s17 of the MWPA. 83\n\nB Contemporary Law\n\nThe introduction of the FLA saw the abolition of the MCA , all state MWPA’s and the creation of the Family Law Court in 1976. 84 This act provided a major shift in the discretion given to the courts when determining a property dispute between divorced/separated couples, providing for the first time a 74 Asche (n 15) 389. 75 Ibid. 76 Asche (n 15) 389. 77 Family Law Ac t 1975 (Cth) (* FLA ). 78 Matrimonial Causes Act 1959-1973 (Cth) ( MCA ). 79 Asche (n 15) 390. 80 Ibid. 81 Horne v Horne (1962) 3 F.L. 381, ( Horne v Horne *) 394. 82 Ibid. ‘[A] judge exercising jurisdiction under s. 86 (1) is at liberty to order a transfer of property from one to the other... such a power controlled as it is by what the court considers just and equitable in the circumstance...’ (Wallace J). 83 Asche (n 15) 390. 84 FLA (n 77) s21."}, {"url": "https://www.encyclopedia.com/history/dictionaries-thesauruses-pictures-and-press-releases/married-womens-property-act-new-york-state", "page_content": "MARRIED WOMEN'S PROPERTY ACT, NEW YORK STATE\n\nMARRIED WOMEN'S PROPERTY ACT, NEW YORK STATE. In the mid-nineteenth century, various states adopted statutes intended to diminish the economic consequences of the common law idea of coverture. In general, the common law doctrine required that the property of a married woman went to her husband. English law responded by permitting the creation by the father of a trust—a separate estate at equity—of which his daughter (about to become a married woman) would be the beneficiary. Trustees named by the father controlled and managed the property for the benefit of the daughter. The property was thus kept free of the husband's claims, without necessarily enhancing the authority of the daughter. This trust device was also used in America.\n\nMississippi adopted the first married women's property act in 1839. New York passed a much better known statute in 1848. Although this also was the year of the Seneca Falls Meeting, often identified as the starting point of the American women's suffrage movement, married women's property issues were not high on the agenda of nineteenth-century feminism. The push for married women's property acts apparently came primarily from creditors interested in clarifying issues relating to property used to secure commercial loans or other transactions.\n\nThe statutes were construed narrowly, and various specific issues arising from the economic relations of husbands and wives were resolved by additional legislative action. Some residual aspects of the inferior status of women under coverture were dealt with legislatively in the twentieth century. In 1974, for example, Congress passed the Equal Credit Opportunity Act forbidding discrimination in credit because of marital status or sex. This statute was broadened in 1976 to ban discrimination based on race, religion, and other characteristics.\n\nBIBLIOGRAPHY\n\nBasch, Norma. In the Eyes of the Law: Women, Marriage and Property in Nineteenth Century New York: Cornell University Press, 1982.\n\nCarolWeisbrod\n\nSee alsoWomen's Rights Movement: The Nineteenth Century ."}, {"url": "https://arthikdisha.com/mwp-act-1874-married-womens-property-act/", "page_content": "How to choose best Term Life Insurance plans for 2018.\n\nDifference between Mediclaim and Health Insurance. The battle of Mediclaim …\n\nAbout The Author\n\nPersonal Finance Blogger. Spreading financial literacy for making an informed financial decision. \"Be Confident and make a Financial Change\"."}]}