{"Terry Alderman's bowling style was right-arm fast-medium.": [{"url": "https://www.cricketcountry.com/articles/terry-alderman-one-of-the-enduring-ashes-heroes-of-history-27787", "page_content": "Updated: December 20, 2015 7:23 PM IST | Edited By: Arunabha Sengupta\n\nTerry Alderman © Getty Images\n\nTerry Alderman, born June 12, 1956, was an Aussie master of the English conditions. With 83 wickets in 12 Tests played in England, he remains one of the enduring Ashes heroes of history. Arunabha Sengupta looks back at the career of the man who was once engaged in a rugby-style tackle during a Test match.\n\n\"The first ball from Alderman flew down the leg side on a fullish length. For a medium-pace bowler Alderman had a long run-up, which gave the batsman too much time to think. At delivery he had a disconcerting grin and this combination added to my inevitable nerves, (which) meant I moved too soon at my second ball. It was straight and full, and as I had to play around my front pad, I missed it — I looked up to see the tall, sombre figure of Nigel Plews raise his finger and that was that. I was on my way back to the pavilion, joining the likes of Hutton and Gooch, who had also recorded ducks on their debuts.\"\n\nThis was how Michael Atherton described the first innings of his Test career in his excellent autobiography Opening Up. However, Alderman’s success was due to much more than the long run up and perplexing grin. The smile was eternally etched on his face as long as he played the game — and his run up and speed remained honest, toiling and medium paced all through. It was only when the focus shifted to the seaming tracks of England that venom was added to his deliveries in incredibly generous proportions.\n\nNeither was the confusion limited to the debutant Atherton. The Lancashire man was in the side in place of the formidable and enormously experienced Graham Gooch. The seasoned opener had asked the selectors to leave him out of the Test team after he had spent most of the summer trying to figure outthe mysteries of Alderman’s seamers, swingers and cutters.In all Alderman got Gooch 7 times. Whenever he bowled in England, this medium pacer from Perth became virtually unplayable.\n\nA lopsided career\n\nOf Alderman’s 170 wickets in 41 Tests, 83 were captured in England at 19.33 apiece. Only Jim Laker and Malcolm Marshall have taken more at a better average in the Old Country.\n\nIn 1981, a series otherwise remembered as Ian Botham’s Ashes, the young medium-pacer made his debut and went on to scalp 42 wickets in the 6 Tests. Returning to England eight years later, he captured 41 more in another 6 matches as Australia routed England 4-0.\n\nMainly due to his exploits in England, he has gone down as an Ashes hero, with 100 wickets in 17 Test matches at 21.17. Among all the bowlers who have played after the First World War, only Glenn McGrath and Dennis Lillee have captured more Ashes wickets with a better record.\n\nYet, Alderman’s career away from English shores was spent as his run-up suggested — in honest toil with medium-pace and medium returns. Even when the same English opponents made their way to the land Down Under, and played in Alderman’s own backyard, his haul turned a less remarkable 17 wickets at 30.11.\n\nYes, Alderman was perennially linked to the Ashes. It was during one of the less remarkable Ashes Tests, perhaps frustrated by the lack of usual success, that he flew after an intruding spectator and brought him down with a rugby tackle. That incident at Perth proved costly to his shoulder and derailed his career for a while.\n\nThe first Ashes\n\nA smiling destroyer with the cricket ball graces us rarely, especially when we talk of fast bowlers among the rough and rugged cricketers churned out by Australia. It was remarkable too that he shared the new ball with Dennis Lillee — a feat carried out with path-breaking hostility and intimidation by the likes of Jeff Thomson and Len Pascoe. However, here was a primary school teacher who ran in with the bright new cherry and took wickets with an engaging smile. Later, when asked about his incredible success, he characteristically attributed much of it to Dennis Lillee at the other end and the rest to the vagaries of the English pitches.\n\nHeadingley onwards, the summer was indeed the annus mirabilis of Ian Botham. Yet, the initiative had been seized at Nottingham by the visitors, and young Alderman had been the one with the firmest grip on the proceedings. His first wicket could not have been a better one, as Geoff Boycott perished to one of the many diligent deliveries he kept right up and moved deceptively away. He took 4 in the first innings, including Ian Botham clean bowled, as England fell away for 185. And when Australia replied with 179, he returned to share the wickets with Lillee, equally and with as much aplomb, complementing the senior man’s menace with his smiling presence. England were blown away for 125 and Australia went one up in the series.\n\nLillee had contributed to his 9 wickets in ways other than just forming one-half of a hunting pair. Alderman had come to England relying on swing, with a chest-on delivery after a rather lazy run up. It was at the Edgbaston nets that Lillee asked his young partner to bowl off a longer run. Alderman tried to hit the seam and soon the Australian batsmen found him unplayable in the nets.\n\nIn the Tests, he not only made the ball talk after making it regularly land on the seam, he also bowled faster than he had ever done in Australia. Standing at six foot two and half inches, he went through long spells bowling into the wind — as is the lot of a bowling partner of someone like Lillee. Yet, it was a challenge he relished. As he modestly put it, \"When you're bowling at the other end to Dennis, you've got to have a better chance of getting wickets … But you have to look at the series as a whole and admit that the wickets did help.\"\n\nTwo matches after his debut, Botham performed the miracle at Leeds, and England pulled off an incredible heist after following on. Ironically, it was the same innings in which Alderman bagged his first five-for, doing everything to crush England but land the final blow. He did bowl Graham Dilley and get Willis caught to finish with 6 for 135, but England had recovered and the rest of the tale can be found in the much documented history.\n\nIn the following Test at Birmingham Alderman struck again, picking up 5 for 42 and 3 for 44, leaving his side just 151 to win. But, it was Botham who hijacked his show once more, picking up 5 wickets for a solitary run in 28 balls, ending the Australian second innings at 121, almost symbolically knocking over Alderman’s stumps to clinch the victory.\n\nAt Manchester Alderman persevered, taking 4 in the first innings and 5 in the second, but a second innings hundred continued the Botham saga. Once again Alderman’s lofty feats were eclipsed by the all-rounder’s brilliance as Australia slumped to the third defeat on the trot.\n\nMore sedate than spectacular\n\nBy the time the Ashes was over, Australia was shaken. Alderman had emerged as a prime bowling hope. It had been quite a journey for the Western Australia paceman who had also turned out in Australian Rules football as an amateur till the end of the 1978 season – and had decided firmly on cricket only after that. His father William had been a centre half-back for Western Australia and had opened both batting and bowling for the colts team of the state. Alderman had steadily following his footsteps, playing both the sports during his schooldays at Aquinas College in Perth. In 1972-73, he had been chosen in the Australian schoolboys cricket team.\n\nSuccess was aplenty in the colts matches, and 6 wickets against Victoria at Melbourne in the following season brought him into the focus of important decision makers. Soon, this quickish bowler who came off a short run was included into the Western Australia side. But, the introduction to the big league was accompanied by a cruel strain. In his second over in the Gillette Cup, Ian Chappell blasted 24 runs. And when as an 18-year-old he made his Sheffield Shield debut against New South wales, he captured 5 for 63, but pulled a hamstring rather seriously.\n\nThe progress through the ranks was more sedate than spectacular. Alderman was dropped from the state team twice, and it was primarily due to the wings of young hope that he managed to soar again. There was no room for him even in the Australian side reduced by the parallel cricketing universe of Kerry Packer. Disappointment hit him bitterly when he was overlooked for the tour of India under Kim Hughes. However, he slogged on — helped immensely by the fitness regime prescribed by Western Australia team coach Daryl Foster. An off-season routine of golf, squash and running kept him fighting fit. And ultimately 32 Shield wickets in the 1980-81 season secured a ticket to England.\n\nThe rugby tackle\n\nReturning to Australia as a rising star, Alderman was quickly brought down to the cruel cricketing earth. There were some quick wickets in the Perth Test, made infamous by the Lillee-Javed Miandad fisticuff. After that the methods that had worked in England refused to bear fruit on the hugely different Australian conditions. Success remained elusive even when he ventured to the neighbouring New Zealand. Finally, one-and-a-half years after the spectacular Ashes series, the Englishmen came down to engage in a Test series in Australia.\n\nThey started at Perth, a city in the middle of a heat-wave, the mercury shooting beyond the 100-barrier in the shade. A Channel Nine advertising campaign had hyped the Ashes, laddering on partisan sentiments, underlining national stereotypes and creating a lot of murmur. One ad showcased several bouncers and hostile fast bowlers. The excitement was buoyed, the heat played its part and a large number of English supporters in the crowd kept the atmosphere on knife’s edge.\n\nThe action in the middle was at the other extreme, unbearably tedious and tepid. Chris Tavare batted all day for an unbeaten 66, including a scoreless last hour and a quarter. England crawled to 242 for 4 by the end of the first day. As the temperature soared on the next morning and afternoon, the progress of the English batsmen remained tardy, and the frustrated English crowd grew aggressive.\n\nAlderman was bowling with England 8 down when Bob Willis edged him through the slips to bring up the 400. A group of rather unruly English youths rushed into the ground to celebrate. The bowler, having ended his over, angrily pushed one intruder towards the outfield before making his way to the square-leg. It was then that an inebriated 19-year-old English immigrant named Gary Donnison punched him at the back of his head as he ran past him towards the pavilion. Alderman who had sent down 43 overs for a solitary wicket could not take it anymore. There were no police in the vicinity to round up the assailant, and Alderman charged across and rugby-tackled him to the ground. Unfortunately, he landed heavily on his right shoulder.\n\nAs the pair wrestled on the ground, Alderman’s opening bowling partner Dennis Lillee approached and dragged Donnison away. Soon, another Australian great went up to lend a hand. Allan Border helped the fast bowling legend to pin the miscreant to the ground as they waited for the police to arrive. But, amidst all the excitement — perhaps pleasant relief for the crowd — it was obvious that Alderman had done serious damage to himself.\n\nDonnison was eventually found guilty of assault and was fined $500 and ordered to do 200 hours of community service. However, damages were probably more serious for Alderman. It was a year before he could bowl in a competitive match again. A painstaking rehabilitation process followed, which included swimming a mile a day for eight months.\n\nYears later, Bob Willis reflected: \"For a remote and sleepy city, Perth had a surprisingly large hard core of hooligans. However, Terry was stupid to head off in pursuit of that idiot and the injury set back his career a lot.\"\n\nAlderman, while confessing that a debilitating injury was one of the worst afflictions to a top notch sportsman, was quite forgiving about Donnison. \"I have heard that he has got his act together and is a reborn Christian with a wife and three kids. So some good came out of it, I suppose.\"'\n\nThe second Ashes\n\nWhen he returned to bowl for Australia again, it was in the forbidding islands of West Indies. He managed just 4 wickets in 3 Tests, but did have one memorable moment. At Port-of-Spain, he came in to bat with the side facing certain defeat with a persevering Allan Border at the other end. A confirmed rabbit who boasted an average less than 5 and a highest score of 12 at that point, Alderman batted 95 minutes with Border to save the Test, in the process helping the left-hander get to a most deserved and valuable hundred.\n\nBut, with wickets having reduced to a trickle, he was soon dropped from the side and spent four years in wilderness before returning for the second glorious chapter of his career.\n\nThis included a three-year ban due to touring South Africa with a rebel Australian team in 1985-86 and 1986-87. It was only in the 1988-89 season that he made it back to the Test side, and it was with a return with a roar.\n\nWith Border leading the side to England in 1989, Alderman was selected for the tour. And he started bowling as if nothing had changed in the interim eight years since his debut.\n\nHe started with 5 wickets in each innings at Leeds — in a 210 run victory that perhaps erased some memories of the nightmares of 1981. He continued to take wickets by the bushel all summer. At Lord’s 6 second-innings wickets were captured in another victory. Five for 66 followed in the first innings at Manchester in yet another win. Another 5-wicket haul came at Trent Bridge, the match that saw Mike Atherton make a duck on debut. England managed to draw the final Test at The Oval, but Alderman ended the series with 5 for 66 — his sixth 5-wicket return of the series. This time, there was no one to steal his thunder, and he was named the Man of the Series.\n\nTerry Alderman bowling in the 4th Test against England at Edgbaston in August 1981 © Getty Images The final result\n\nAlderman did play for two more years and enjoyed a fair amount of success in 2 Tests at home against Pakistan. He also had a decent Ashes series in Australia, although without matching his earlier heroics – either with the ball or rugby tackles.\n\nIn the end, his 170 wickets at 27.15 underline a successful, if slightly lopsided, career. His collection of runs — 212 with an average of 6.54 — perhaps would not have been able to keep up with his wicket tally had he been included in the side for the 1985 Ashes. It also marks him as an endearing No 11 of genuine ineptitude. In 265 First-Class innings, he crossed 50 just once, and then too barely.\n\nWhat is surprising is that unlike typical fast bowlers who like to patrol long-leg once their over is done, Alderman was also a fantastic catcher in the slips. The abundance of slip fielders in the Australian team resulted in his seldom fielding close to the wicket after the first Ashes series of 1981, but he did pouch 27 catches in his 41 Tests. He held 190 First-Class catches in all, spending a lot of time taking the offerings for his fellow bowlers for Western Australia, Gloucestershire and Kent.\n\nWhile Alderman is going to be remembered primarily as an Ashes hero, it should be mentioned that success against England ran in his family. Younger sister Denise Alderman was a top class batswoman for Australia and averaged 41.27 in her 7 Tests, all against England. But, in striking contrast to her brother, she excelled at home, scoring 453 runs in Australia 50.33 with a highest of 121; while her 2 Tests in England brought her just 1 run. Later, Denise married Ross Emerson, the umpire who courted infamy after calling Muttiah Muralitharan for throwing.\n\nAfter retirement, Alderman remained attached to cricket as a radio commentator. For someone universally acknowledged as pleasant, he did cause some furore during an Ashes series in England. In the build up to 2005 Ashes, he was colourful in describing the English spin attack: \"If any of our batsmen get out to Giles, they should go hang themselves in shame.\" Unfortunately, it turned out to be Australia’s first Ashes defeat since Alderman had taken 41 wickets to reclaim the urn in 1989."}, {"url": "https://wisden.com/almanack/the-summer-terry-alderman-burst-onto-the-test-scene-almanack", "page_content": "Australia were a divided team under the captaincy of Kim Hughes in 1981. But it did not stop Terry Alderman bowling brilliantly and being named a Wisden Cricketer of the Year.\n\nIt was typical of Terence Michael Alderman that when he looked back on his remarkable bowling success in England in 1981 he attributed it to two main factors – sharing the new ball with Dennis Lillee and the state of English pitches. Certainly no blame for the failure of the Australian team in what was an unusual series could be attached to the young Perth primary school teacher. Representing his country for the first time, Alderman played in all six Tests and stamped himself not only as a seam bowler of the highest quality, with a record 42 wickets in the series, but also as a slip fielder with a sure pair of hands.\n\nBorn on June 12, 1956, Alderman, the fourth of five children, had something of a sporting start in life. His father, William, was a big-kicking Australian Rules football centre half-back, who represented Western Australia and also opened both the batting and the bowling for the Western Australian colts cricket team without ever making the first-class scene.\n\nAlderman followed naturally in his father’s footsteps, playing both cricket and football during his schooldays at Aquinas College in Perth. He continued to play football as an amateur until the end of the 1978 season, when he decided that it would be foolish to continue mixing the two sports. By then he was already beginning to make his mark as a medium-paced bowler, although it would have required a crystal ball of remarkable clarity to foresee the impact he would make in England three years later.\n\nAlderman began playing cricket as a ten-year-old who liked to bowl fast. By his third year at high school he showed enough promise to be chosen for one game in the first eleven. A quick bowler who bowled off a rather short run, he became a permanent member of the first team for his last two years at school where he was coached by Basil Rigg, a former West Australian batsman. Representing Western Australia at a schoolboys’ carnival in Melbourne in 1972/73, he was chosen in the Australian schoolboys team to play a Governor’s eleven.\n\nPlaying for Western Australia in colts matches in Melbourne and Adelaide in 1973/74, Alderman took six wickets against Victoria in Melbourne. That performance brought him to the notice of those who chose the state senior side and the following season, in which Dennis Lillee and Jeff Thomson made life so uncomfortable for Mike Denness’s Englishmen, Alderman was picked in the Western Australian team – only to have Ian Chappell take 24 runs off his second over in a limited-over Gillette Cup match.\n\nAlderman was 12th man for the two Sheffield Shield matches against South Australia and Victoria before making his Shield debut against New South Wales in Sydney, a match which brought him mixed fortunes. A raw 18-year-old, he took five for 63 and pulled a hamstring which led to his having to return home.\n\nBetween 1974/75 and 1980/81 Alderman was twice dropped from the state team. Looking back now he believes that it was perhaps a mistake to have been chosen for first-class cricket so early in his career. The resilience of youth, and the feeling that he had age on his side, saw him bounce back, and although he thought he had a chance of being picked for Australia’s tour of India in 1979 he had to wait until the end of the 1980/81 season to win national recognition and his first tour.\n\nAlways careful to well within himself, Alderman had never been a pace bowler in the true sense of the word.\n\nNot even the Australian selectors could have imagined the success that their rookie would enjoy. Neither did Alderman, who had spent the English summer of 1980 playing for Watsonians in Edinburgh during a stint as coach at George Watson’s College. He felt the experience was beneficial, but was disappointed not to take more wickets than he did. Despite a slow start to the season back home, he finished with 32 Shield wickets and would have been bitterly disappointed had he failed to win selection for the Ashes tour.\n\nNo one would have been more delighted with Alderman’s nine-wicket Test debut at Trent Bridge than John Inverarity, the former Western Australian captain and Test batsman, who had long been championing his cause. “He was a big influence,” Alderman said. “He always encouraged me and was probably the reason why I got a chance in the first place”. But it was Lille who played perhaps the most significant part in the emergence of Alderman into a Test force in England.\n\nAlways careful to well within himself, Alderman had never been a pace bowler in the true sense of the word. Instead, he had relied mainly on the swing generated by a seemingly lazy run-up that ends in a fairly chest-on delivery. He has never had a meanness of some of the great fast bowlers. But a spell in the Edgbaston nets just before the second Prudential Trophy match last June was a turning point. “The practice wickets were lively and Dennis told me to bowl off a long run and see what I could do. I tried to hit the seam and was unplayable in the nets. That was the first time I realised I could do more as a seam bowler than as a swing bowler. What I did after that was to try and do more off the wicket.”\n\nIn the event, not only did he make the ball do more off the seam, he also bowled faster than he had in Australia. His 6ft 2½in frame, broad shouldered and tapering also came in for some lengthy spells bowling into the wind. He thrived on the challenge. “When you’re bowling at the other end to Dennis, you’ve got to have a better chance of getting wickets. Rod Marsh was also a great help on the trip. But you have to look at the series as a whole and admit that the wickets did help.”\n\nAnother helpful influence had been Daryl Foster, the West Australia team coach. “Daryl spurred me on in regard to fitness, which is not one of my fortes,” Alderman admits. “I love golf and enjoy walking and I’ve taken up squash. I also like sauna – they’re a poor man’s way of losing weight. But I’ve done a lot more running in the last 18 months than I used to.” Alderrman’s fitness was reflected in the stamina he showed in his long bowling spells in England. Married in December 1977, to Jane Elizabeth Johnson, a school teacher from Derbyshire whom he met in Perth, he has always appreciated the family influence on his life.\n\nDespite his record-breaking performances in England, Alderman refuses to be carried away. “I play the game from one game to the next. I’ve seen the high points and the low. If you can survive them, you’ll be OK.” Judging by the attitude and ability of this most pleasant young man, he will be.\n\nTerry Alderman had another wonderfully successful Ashes tour – this time in a winning cause – in 1989 when he took 41 wickets at 17.36 and was player of the series."}, {"url": "https://wisden.com/stories/archive/turning-back-the-clock-the-forgotten-and-formidable-art-of-medium-pace-spin", "page_content": "Amol Rajan, the BBC’s media editor and author of Twirlymen, the Unlikely History of Cricket’s Greatest Spin Bowlers, wondered what happened to the forgotten and formidable art of medium-pace spin.\n\nFirst published in 2017\n\nIt is a curious fact that when cricket was first becoming popular in England, in the latter half of the 18th century, all bowlers were either spinners or had great ambitions to be. This was because at the time bowling referred to the action we now associate with ten-pin bowling: rolling the ball along the surface of the earth, from bended knee, as if making a proposal of marriage to the distant batsman. A bowler’s best hope during this, the dawn of the game, was for a mole-hill, fox-hole, or adder enclave to impart deviation and so befuddle the batsman. When, finally, bowlers were allowed to give the ball air – probably around 1770 – their under-arm actions couldn’t generate much pace. So they relied on spin.\n\nAll the reports, including those of John Nyren, author of cricket’s first notable work of literature The Young Cricketer’s Tutor, show that the earliest air bowlers, men such as Edward ‘Lumpy’ Stevens and Lamborn, the ‘Little Farmer’, used ‘twist’ to break the ball from off to leg or, more commonly, leg to off. The round-arm and over-arm revolutions were many decades away alas, so bowling was a twirlyman’s task. This pattern continued for so long that, rightly understood, the modern dominance of pace bowling is akin to a decades-long aberration from the norm. The history of mystery didn’t leave much space for pace.\n\nOn July 15, 1822, a maverick named John Willes, who had been pushing the boundaries of the laws of the game for over a decade, bowled a round-arm delivery for Kent against MCC at Lord’s. The umpires called no-ball. Willes threw the ball down in disgust, called for his horse and rode off into the sunset, scarcely playing again, so ostracised was he by cricket’s fraternity. Little did he know that he had planted the seeds of a revolution that would catapult the game into modernity. In 1828, MCC moderated Rule 10 to allow the hand as high as the elbow; in 1835 another change allowed the arm up to shoulder height; in 1845 the benefit of the doubt was declared (as usual) against the bowler; and in 1864, the grand overlords of the game finally succumbed and declared over-arm bowling legal.\n\nBut then a funny thing happened, and kept happening for years. Rather than open the floodgates to a new breed of super-fast bowling tyrant, the dominant form of bowling right up to the interwar period became something the like of which we hardly see in today’s game, to the detriment of fans and players alike. In the late Victorian period, all the most successful bowlers in the game were those who, rather than submit to an illusory need for speed, decided they could have the best of both worlds. They bowled spin, but at medium pace.\n\nIn England, three dominated: WG Grace, AG Steel, and George Lohmann. In Australia, a further three stood out: FR Spofforth, Monty Noble and Hugh Trumble. Each in turn pre-empted the rise, and extraordinary success, of the most complete bowler that ever lived, that cantankerous English rascal Sydney Barnes. He too was a medium-paced spinner. In fact, if you look to see who has the best career averages and best strike-rate in Tests, you’ll alight on Lohmann and Barnes. All of which rather begs a question. If medium-pace spin was so effective, why on earth did it die out?\n\nBefore answering that question, it may be worth establishing the credentials of these bowlers, by focusing briefly on Barnes who, understood in the proper context, is really their apogee. The dashing county player Jack Meyer said Barnes was definitely quicker than Alec Bedser, which seems astonishing. My guess is that, depending on the pitch, Barnes would hit around 70 or even 75 mph. If you’re a club cricketer, that’s probably up there with the fastest you’ve faced. CB Fry said of him that: “In the matter of pace he may be regarded either as a fast or fast-medium bowler. He certainly bowled faster some days than others; and on his fastest day he was distinctly fast.”\n\nAnd yet, as he brought his arm over, Barnes gave the ball an almighty rip. I’m not talking here about using seam and swing to extract cut from the pitch. I’m talking full-on spin, with a couple of special attributes. That is why John Arlott could say of Barnes: “He was a right-arm fast-medium bowler with the accuracy, spin and resource of a slow bowler.” Note that Arlott, who always chose his words carefully, describes Barnes not as medium or even medium-fast, but as fast-medium. And that he was a genuine, even prodigious, spinner of the ball is evidenced by Barnes’ account of an extraordinary meeting with Noble.\n\nTwirlymen constitute a special breed within cricket, a fraternity that bestows special privileges on its members, and through the ages spinners have met with each other to pass on the wisdom they have gleaned. Shane Warne and Abdul Qadir once sat across a Persian carpet from each other in the latter’s house in Pakistan, spinning oranges hither and thither. Similarly, Barnes said he once asked Noble, “If he would care to tell me how he managed to bring the ball back against the swerve”.\n\n“He said it was possible to put two poles down the wicket, one 10 or 11 yards from the bowling crease and another one five or six yards from the batsman, and to bowl a ball outside the first pole and make it swing to the off-side of the other pole and then nip back and hit the wickets. That’s how I learned to spin a ball and make it swing. It is also possible to bowl in between these two poles, pitch the ball outside leg stump and hit the wicket. I spent hours trying all this out in the nets.”\n\nFor such a fastidious man, Barnes is rather lazy in conflating ‘swerve’ and ‘swing’ here. What he means by both is what we today refer to as ‘drift’: the glorious tendency of a spinning ball to move in the air in the opposite direction to the eventual spin off the wicket. Unlike modern spinners, Barnes’ wrist was slightly cocked back at the point of release, as if he was screwing or unscrewing a light bulb above his head (screwing for the off-break; unscrewing for the leg-break). This, for reasons only a better physicist than I could tell you, compensates in accentuated swerve for what it sacrifices in turn off the wicket.\n\nSo the picture we have of the man (above) who took 189 wickets in just 27 Tests at 16.43, with a wicket every seven overs – and a record 49 wickets in four Tests against South Africa in 1913/14 (he refused to play the last Test in a dispute over his wife’s hotel fare) – is of genuine pace and genuine spin combined. He was perhaps quicker, and spun the ball more, than the other swift pioneers of the late Victorian period. But is there any good reason that modern bowlers resolutely refuse to ape Barnes’ astonishingly successful method? My answer is emphatically no.\n\nIt’s true that there has been a conspiracy against spinners throughout the course of the game – shorter boundaries, limited overs, bigger bats, video replays (which cost them dearly until Hawk-Eye) came in and, above all, covered pitches. The last of these may partly explain the dwindling of the art. But there are three other possible reasons too: first, fashion; second, modern coaching; and third, sheer laziness.\n\nNone of these are forgivable, of course, particularly the needless and harmful conservatism of coaches who insist young players specialise early. Barnes had only three hours of coaching in his entire life. He would scoff at the refusal of fast bowlers to learn the art of spin, and vice versa; and if there is no good reason to keep the two art forms distinct, there must be hope that some brave young bowler could raise the spirit of medium-pace spin from the sporting grave to which it has prematurely been consigned. If he had the wit just to try, and the talent to come into mild success, lovers of the game the world over would be eternally in his debt, for re-acquainting cricket with a once great technique.\n\nSwerve Kings WG Grace Test record: 9 wickets at 26.22\n\nFirst-class record: 2,809 wickets at 18.14 ‘The Doctor’ may have been more famed for his batting but in his youth, before his hearty appetite and legendary thirst took a toll on his body, he was a crafty and prolific with the ball. Grace started out as a fast bowler but over the course of his career he reduced his pace and focused on subtlety and deception. His skills had waned by the time he made his Test debut at the age of 32 but he still took 240 five-fers and 64 10-wicket match hauls in a career spanning 43 years. George Lohmann Test record: 112 wickets at 10.75\n\nFirst-class record: 1,841 wickets at 13.73 In terms of average and strike-rate, Lohmann ranks as the best bowler Test cricket has ever seen. The England and Surrey right-armer took his 100th Test wicket in his 16th match – a record that still stands today – and was the very definition of unplayable on the 1896 tour of South Africa when he took 35 wickets at 5.80. Fred Spofforth Test record: 94 wickets at 18.41\n\nFirst-class record: 853 wickets at 14.95 Regarded by many as the godfather of ‘swerve’, Spofforth rose to fame by taking 97 wickets at 11 on Australia’s 1878 tour of England. “Spofforth’s no bowler, he’s a hypnotist,” said Notts all-rounder Billy Barnes, an opponent that summer. Known as ‘The Demon’, Spofforth’s larger-than-life personality made him a folk hero in Australia. He claimed four 10-wicket match hauls in 18 Tests. Sydney Barnes Test record: 189 wickets at 16.43 First-class record: 719 wickets at 17.09 Barnes was a latecomer to international cricket, debuting for England in 1901 at the age 28 after previously focusing on playing club cricket for well-paying amateur sides in the Lancashire League, but quickly built a reputation as the most skilled bowler of his time. He combined seam and spin to devastating effect, taking 24 five-wicket hauls in 27 Tests. “The wonder of his career is that he took 77 of his 106 Australian Test wickets on the wickets of Australia when they were flawless and the scourge of all ordinarily good bowlers,” wrote Neville Cardus.\n\nThis article originally appeared in The Nightwatchman, The Wisden Cricket Quarterly.\n\nFirst published in 2017"}, {"url": "https://www.itsonlycricket.com/fast-medium-vs-medium-fast", "page_content": "Within the fast bowling sphere, there are lots of different subcategories that can be applied but, whilst many have heard of them, what do they actually mean?\n\nFast Medium vs Medium Fast Bowlers: What is the Difference?\n\nIn very basic terms, a fast medium bowler is quicker than a medium fast bowler. The clue is in the order of the words – fast vs medium or medium vs fast.\n\nA fast medium bowler is capable of quicker deliveries than their medium fast counterparts who are on the faster side of medium.\n\nClassification of Fast Bowlers According to Speed\n\nThese can be confusing terms but we can look at individual players and use them as examples in order to clear things up.\n\nAlso, while there are no official figures to define each of the following four categories, by bracketing them into different speed parameters we can also make things easier to understand.\n\n1. Fast Bowlers\n\nThese are the fastest bowlers of them all and, while there are no defined speeds for any of these categories, the quickest are capable of hitting 90 miles per hour on a regular basis.\n\nGood examples here might include Australia’s Pat Cummins and the England duo of Jofra Archer and Mark Wood.\n\n2. Fast Medium Bowlers\n\nIf we’re using those miles per hour categories to define a fast medium bowler, they will generally average out at between 80 and 87 mph.\n\nMany of them will be capable of hitting 90 mph at times but these will be rare, surprise deliveries and you won’t see these kinds of speeds on a regular basis.\n\nFast medium bowlers lack the pace of the outright quicks so they will tend to rely more on other techniques such as swing and seam.\n\nAustralia’s Glenn McGrath with his almost-perfect seam position was a great example of this while other fast medium bowlers would include England’s James Anderson and Ishant Sharma of India.\n\n3. Medium Fast Bowlers\n\nThese guys are slower still – usually at around 70 to 79 miles an hour and they may not be regular members of a bowling attack. Medium fast bowlers might also be used more in a one day match where pace off the ball is seen as a better weapon than in test cricket.\n\nMedium fast bowlers can still use swing and seam and they will also try to use upper body strength in order to generate some bounce off the pitch.\n\nA good example from the recent past is England’s Paul Collingwood while Colin de Grandhomme of New Zealand is slightly more up to date.\n\n4. Medium Bowlers\n\nYou may occasionally hear them referred to as ‘trundlers’, these are the slowest bowlers within this particular category. In fact, their lack of pace may mean that they are not regular members of the attack and their deliveries will typically range between 65 and 70 miles per hour.\n\nIndia’s Virat Kohli is a good example here: We rarely see him bowl but he does occasionally bring himself on and he had eight international wickets as he went into the 2021 T20 World Cup."}, {"url": "https://www.bigfooty.com/forum/threads/best-medium-pace-bowler-of-all-time.1121454/page-4", "page_content": "Jack Package said: When was the last time a genuine medium pacer was picked for a test as a frontline bowler?\n\n\n\nFunky Miller? Click to expand...\n\nMiller is an interesting one. Picked as a spinner but could bowl medium pace.Adam Dale was genuine medium pace bowler around that time.Reiffel when he played certainly quality medium pace bowler.Not many other than those guys played more than a Test or two in last couple of decades that would be genuine medium pace.Looking backwards these are a few I can identify.Someone said Copeland but barely remember him so not sure of his pace.Faulkner has played one Test and certainly medium pace but probably picked more as an allrounder than a frontline bowler in single game he played. Andrew McDonald played a few games in 2009.Nathan Bracken a few Tests.Greg Campbell was in an ordinary era.Tom Moody but picked for his batting.Tony Dodemaide.Simon DavisDave GilbertSteve Waugh was picked as an allrounder in early Tests.and Simon O'Donnell like Faulker picked mainly as an allrounder for not many Tests.John Macguire I can't recall his pace but may have been a medium pacer. Think he ended up going on South Africa rebel tour.Terry Alderman.Trevor LaughlinMick Malone and Geoff Dymock.Gary Gilmour and Max WalkerAny before that I never saw bowl myself.Of note in that lot, in terms of quality Reiffel, Alderman and Dymock the ones I saw in more than just a few Tests and open the bowling at times.I would rate Terry Alderman the best medium pace bowler in my time of watching Australian cricket. Harder to say for overseas.Hard to go past guys like Ian Botham and Kapil Dev for all time. I really have less knowledge of pace of bowlers well before my time so would not comment on those.Just feels since the days of Reiffel and the one or two Test Adam Dale played we have tended to use batsmen that could bowl medium pace role such as Steve and Mark Waugh or Shane Watson when not injured. Andrew Symonds did a bit of it and as you say Colin Miller could bowl it but was picked primarily as an off spinner."}, {"url": "https://cricketershub.com/types-of-fast-bowlers-cricket/", "page_content": "Cricket is a game that features many different types of fast bowlers, and each individual will add their own unique style to that type of bowling. However, there are certain ways in which we group fast bowlers together in order to categorise them and make them easier to tell apart. Some of you who are new to the game, or even some of you who are just researching the game, may want to know what these categories are! So I’ve spent a bit of time putting this list together in order to make it all nice and easy to understand.\n\nFast bowlers in cricket aim to get the batsman out by using the speed of the ball, its movement off the pitch (commonly known as seam movement) or its movement in the air (commonly known as swing) as their primary weapons. They can be split into three main categories, which are as follows:\n\nRight/Left Arm Medium\n\nRight/Left Arm Fast Medium\n\nRight/Left Arm Fast\n\nEach of the categories listed above are used to describe specific characteristics of fast bowlers, but they can often lead to a lot of confusion. What does each term mean? Are there other terms that mean the same thing as the ones listed above? Well…that’s what we’re going to go through in this post!\n\nWhat Is A Right/Left Arm Medium Bowler?\n\nA right arm (or left arm) medium bowler is the slowest out of all of the pace bowlers. They’re also commonly referred to as ‘medium pacers’ and their normal deliveries will often be between 100-120kph (60-75mph).\n\nThe effectiveness of these bowlers often comes down to their ability to use slower balls such as cutters or back of the hand deliveries to trick batsmen during the flight of the ball. They are also often rather good at getting the ball to swing, which is a useful weapon even at this lower pace! Batsmen who have gotten used to facing quicker bowlers during their innings may relax a bit when they see that a medium pacer is coming on to bowl. This may cause them to get too loose with their shots, which is very risky when the ball is swinging. The disadvantage to the type of swing that medium pacers get is that it usually occurs ‘straight from the hand’. If the ball begins swinging as soon as the bowler releases it, then this is a lot easier for the batsman to anticipate and react to.\n\nIn longer forms of cricket, this type of bowler is not usually a big part of the bowling attack as they’re not great wicket taking options. They will be used primarily when the other faster bowlers need a rest, or just as a change when wickets are hard to come by. They will also often be part-time bowlers. In limited overs matches they are more widely used because a large part of the game is about limiting the other team’s scoring rates. Medium pacers like Scott Styris, Dimitri Mascarenhas, Paul Collingwood and Chris Harris spring to mind as bowlers who were quite tricky for batsmen to play against in limited overs cricket!\n\nWhat Is A Right/Left Arm Fast Medium Bowler?\n\nThe majority of pace bowlers in the professional game fall into the fast medium category. The average speed of their deliveries will usually be somewhere in the range of 120-145kph (75-90mph).\n\nFast medium bowlers are very dangerous, and have many methods they can use to dismiss batsmen. Some of them are able to swing the ball incredibly effectively, and can make the swing occur later than medium pacers. When the ball swings late, it gives the batsman a lot less time to adjust to the change in trajectory and can lead to more edges as well as play and misses. The added pace also leads to these types of bowlers being able to reverse swing the ball, which is one of the deadliest weapons a bowler can possess! (If you’re not sure what reverse swing is, click here to read my explanation post!) Slower balls are more effective when your standard delivery is bowled at higher speeds, and it also makes yorkers and bouncers harder to play! Put simply, they give the batsman a lot more to worry about!\n\nAll teams will have at least one, if not multiple bowlers of this type on their team, and they’re effective in all formats of cricket! In longer forms of the game, fast medium bowlers will look to mainly bowl line and length, and will generally be less willing to go to their variations such as yorkers and slower balls. In limited overs games, fast medium bowlers will use their pace as well as their variations to try to keep the scoring rate to a minimum whilst picking up wickets. Some of my favourite fast medium bowlers over recent years have been guys like Jimmy Anderson, Dale Steyn and Zaheer Khan. The more things a bowler can do, the more I’ll be interested in watching them!\n\nIt’s worth noting that sometimes you will see these bowlers being referred to as ‘fast medium’ and sometimes as ‘medium fast’. The difference between the two can be a source of a lot of confusion! Some people say that ‘medium fast’ bowlers are slightly slower than ‘fast medium’ bowlers and that that is the reason for the difference, but I personally don’t choose to make that distinction. Instead I combine the two and refer to the entire group as fast medium bowlers!\n\nWhat Is A Right/Left Arm Fast Bowler?\n\nA right/left arm fast bowler is the quickest of all of the pace bowlers, capable of consistently hitting speeds of over 145kph (90mph).\n\nThey are the most intimidating bowlers in cricket due to their extreme pace and hostility. The best right/left arm fast bowlers will possess a sharp and accurate bouncer that pushes batsmen back and threatens their bodies, as well as an ability to get the new ball to swing slightly, and the old ball to reverse swing! The increase in pace makes most of their deliveries more dangerous if they’re well directed, and as I mentioned previously, it usually means that the slower balls they bowl are more effective.\n\nThese kinds of bowlers are a lot rarer than fast medium bowlers, and it’s not uncommon for professional cricket teams to have zero players that are capable of bowling at these speeds! The teams that do have them will usually only have one! Longer forms of cricket, they are often most effective when they’re used in short 4-5 over spells where they can maintain their high speeds and effort throughout the spell. Bowling consistently over 145kph requires a lot of energy, so to keep this going throughout a 10 over spell is incredibly tough!\n\nIn limited overs matches, the best right/left arm fast bowlers are primarily used at the beginning and ends of innings, as these are the most crucial periods. They are also sometimes used in the middle overs if the bowling side desperately requires wickets to be taken! For this type of bowler to succeed in limited overs games they need to have impeccable line and length, variations such as the yorker, bouncer and slower ball, and they also need to be mentally strong. Good mental strength certainly helps if you’re getting hit for a lot of runs…which is very possible in the modern game! Some of the best right/left arm fast bowlers I’ve seen over the last decade or so have been guys like Brett Lee, Shoaib Akhtar and Mitchell Johnson! If you want to go even further back than that I’ve always tried to watch a lot of players like Dennis Lillee, Andy Roberts and Michael Holding!\n\nOther Frequently Asked Questions\n\nWhat Is A ‘Seam Bowler’?\n\nThe term ‘Seam bowler’ is another term that is used to categorise fast bowlers based on their style of bowling. This time, rather than using the speed of the bowlers to segregate them from each other, the term ‘seam bowler’ is used to refer to fast bowlers who do not aim to get the ball to swing. Instead, they prefer to try to get the ball to deviate when it hits the pitch by landing the ball on its seam! This means that theoretically seam bowlers can fall into any 3 of the categories we’ve already discussed in this post. It just depends how fast they are!\n\nThe seam is the most pronounced part of a cricket ball, so if the bowler can land the ball with the seam tilted slightly (as can be seen in the diagram below) it can cause the ball to shoot off at awkward angles.A ball that hits the pitch and changes direction slightly is almost impossible to react to due to the fact that batsmen have very little time to adjust! As a result, seaming deliveries can often lead to edges or batsmen being bowled our out LBW.\n\nLanding The Ball On The Pitch Like This Can Lead To Seam Movement\n\nYou will see and hear the term ‘seam bowler’ being used a lot to describe bowlers, whether that be on the internet or live TV broadcasts. Personally, my favourite seam bowler was Glenn McGrath. Known as ‘The Metronome’, he was famous for being ridiculously accurate, and being able to land the ball wherever he wanted. Because he bowled in such dangerous areas, any seam movement that he got from the pitch was often deadly! Click here and watch his spell against England at Lords from 2005 if you don’t believe me!\n\nWhat Is A ‘Swing’ Bowler?\n\nLike with seam bowlers, the term ‘Swing bowler’ is used to further define the characteristics of fast bowlers. Swing bowlers primarily aim to get the ball to move in the air in order to confuse the batsman. They force batsmen to be disciplined in their foot movement as well as their shot selection due to the fact that they can bowl the ball outside off stump and cause it to swing back into the pads, or bowl the ball on an off stump line and then swing it away. Again, a bowler from any of the three categories that I mentioned at the beginning of this post can be a swing bowler! It is just easier for batsmen to play against swing bowlers when they are bowl at a medium pace!\n\nI know I mentioned these two guys before, but arguably the best two swing bowlers of this generation have been Jimmy Anderson and Dale Steyn. Steyn in particular was ferociously quick, more so than Anderson, and his late swing was deadly when the ball was moving at such speed. Anderson has the most wickets ever for a fast bowler, and he is a true master of the swinging ball. He can bowl accurate inswingers and outswingers at will! Swing bowling is a really hard art to master, but if you’d like somewhere to get started, then read my post here so you can learn how to swing a cricket ball!\n\nWhat Are ‘Cutters’?\n\nThis is another question I see being asked a lot. A cutter is a type of slower ball that requires a change of grip position as you release the ball. There are two types of cutters: The off cutter & the leg cutter.\n\nFor a right arm bowler, an off cutter can be bowled by imparting spin on the ball in a clockwise direction as it is released from the hand. A leg cutter requires the right arm bowler to impart anti-clockwise spin on the ball (Spin is in the opposite direction for left arm bowlers). The change in grip position combined with the spin that is put on the ball results in the ball being bowled at a slower pace compared to the fast bowlers’ usual delivery. Click here if you want to learn everything you need to know about the different slower balls in cricket, including how to bowl them!\n\nConclusion\n\nI hope this post has helped to clarify some of the terms that you’ll see being used with regards to fast bowlers! It’s important to note that other sources may have ever so slightly different definitions, especially when it comes to which speeds of bowlers fall into which category. There is no universal definition that everyone agrees on, but I think the ones I’ve given you in this post are incredibly concise and easy to follow! Feel free to let me know what you think in the comments below!\n\nIf you are a fast bowler or you’re wanting to learn how to bowl fast, I’d recommend checking out one of my other posts by clicking here. That post will give you 11 incredibly useful tips to make you a dangerous fast bowler!"}, {"url": "https://possible11.com/blog/5-achievements-of-wasim-akram-that-makes-him-living-legend/", "page_content": "5 Achievements Of Wasim Akram That Makes Him Living Legend\n\nBy Rohit - June 4, 2022 - Last updated on Jun 04, 2022 01:15 PM\n\nWasim Akram, one of the greatest fast bowlers, turned 56 on June 3, 2022, and wishes poured from all quarters. The International Cricket Council (ICC) was one of the first to wish former Pakistan skipper Akram. The ICC posted a picture of Wasim Akram on Twitter, mentioning his achievements and a caption saying, “104 Tests, 25 five-wicket hauls and 916 wickets across all formats, “Happy birthday to the legendary Pakistan all-rounder, Wasim Akram!”\n\nKing Of Hat-tricks\n\nAkram has four hat-tricks at the highest level, two in Tests and two in One-Day Internationals (ODIs). His ODI hat-tricks came in 1989 and 1990, both at Sharjah. In 1999, he took two hat-tricks in back-to-back Tests against Sri Lanka and helped Pakistan win the Asian Test Championship.\n\nA second one-day hat-trick in six months for Wasim Akram, as Pakistan beat Australia by 36 runs in the Sharjah final. Wasim finished things off by bowling Merv Hughes, Carl Rackemann and Terry Alderman with consecutive deliveries. Wasim is the only man to have taken two hat-tricks in Tests and one-day internationals.\n\nFirst Man To Take 500 ODI Wickets\n\nIn 2003, Akram became the first man to take 500 ODI wickets. This record was later broken by Sri Lankan spin bowler, Muttiah Muralitharan.\n\nFormer Pakistan Captain And Left Arm Fast Bowler Wasim Akram Is On Second Place in The List Of Most Wickets In ODIs. He Is The First Bowler To Take 500 Wickets In ODIs. Wasim Akram Has Taken 502 Wickets In 356 Matches During The Career Span Of 1984-2003,/p>\n\nMost Successful Left Arm Bowler\n\nThe greatest left-arm fast bowler of all time. Wasim Akram at this peak was a dream, fast bowler. He could move the ball both ways with ease, and had an awkward bouncer and a superb yorker.\n\nHe could also reverse swing the ball both ways too. Akram helped Pakistan to their greatest ever triumph in 1992, when they won the Cricket World Cup. Akram had a superb final, taking two infamous wickets in two balls with a reverse swing to pave the way for Pakistan’s triumph. He is ranked amongst the most successful left-arm bowlers of all time.\n\nWon 17 Man of the Match Awards In 104 Tests\n\nHe has won 17 Man of the Match awards in Test cricket which is the joint-third highest number of awards. Akram won 17 Man-of-the-Match awards in 104 Tests. He took four hat-tricks in international cricket—two in ODIs and two in Tests. As a result, he shares the record for most international hat-tricks with Lasith Malinga.\n\nFirst bowler to take 400 wickets in ODIs and Tests\n\nPakistani allrounder Wasim Akram completed his 400 Test wickets when he had Russell Arnold caught by Mohammad Akram in Sri Lankas second innings at Colombo SSC. He is the first bowler from Pakistan in international cricket to take more than 400 wickets in both ODI and Tests.\n\nAlso Read: IPL 2022: HOW IPL FRANCHISES MAKE MONEY\n\nSHARE FB TW TW WA TL PN ML COPY Link Copied\n\nFollow Us\n\n\n\n"}, {"url": "https://www.theguardian.com/sport/2011/may/17/the-spin-twirlymen-andy-bull", "page_content": "AN EXTINCT SPECIES OF SPINNER\n\nIn the style guides it is something of a venial sin to describe a book as \"unputdownable\". And with good reason, unless, as the old joke goes, the book in question is the pamphlet from a Super Glue packet. But two weeks or so ago a copy of Twirlymen by Amol Rajan landed in my pigeon hole. Twirlymen? Never heard of it. Amol Rajan? Never heard of him either. But it looked interesting so I stuffed it in my bag. Two days later I'd finished it. It wasn't that I couldn't put it down, more that I could not stop picking it up: in bed, on the bus, at the bus stop, on the train. It's the kind of book you end up reading as you walk along the street. One page drags you inexorably on to the next.\n\nIt is a history of spin bowling, diligently researched but written with wit and, most tellingly, an obsessive's eye for detail. Graeme Swann, for instance, is so often hailed as being an orthodox off spinner, but Rajan points out that he bowls with an unorthodox grip: Swann's fingers are so big that he can coil his middle digit around the side of the ball. He spins it off the inside top knuckle of his index finger and the middle knuckle of his middle finger.\n\nIf I've persuaded you to buy his book, and I hope I have, here is one word of warning: do not read it in the vicinity of any vases, glasses or other breakables. Rajan provides detailed diagrams explaining how to grip all the spinner's deliveries, from the doosra to the googly and everything in between. You will want to read this holding the book in your left hand and a cricket ball in your right. My attempts to replicate Ajantha Mendis's carom ball have already cost me two teacups.\n\nRajan is keen on the idea that nothing in cricket is really new, even the carom ball. Saqlain Mushtaq may be known as the inventor of the doosra, but Rajan reckons that the Australian Jack Potter was bowling an off-spinner that broke the wrong way off the pitch way back in the early 1960s. Thirty years before Clarrie Grimmet is supposed to have invented the flipper, Walter Mead was bowling them for Essex in county cricket. Grimmett just revived the technique. Rajan delights in mapping out the historical lineages of deliveries, marking the precise points when the techniques of one generation of spinners were passed on to the next. So the flipper was passed like some cherished Australian heirloom from Grimmett to Bruce Dooland to Richie Benaud to Terry Jenner to Shane Warne.\n\nBut it is the points where the line stops that got me thinking. Rajan writes well on techniques that now exist only in sepia print. Take down a copy of Wisden and turn to the pages showing the best career averages and best career strike rates for bowlers in Test matches. The two top names on both lists are GA Lohmann and SF Barnes. Their careers hardly overlapped – Barnes played his first Test five years after Lohmann played his last – but they both belonged to the same species, a breed of bowler who are now entirely extinct, the medium-pace spinner.\n\nThese days medium pace and spin bowling are two distinct schools, one incompatible with the other. But there has never been a more successful style of bowling than fast-medium spin, as purveyed by Barnes in particular. He was, John Arlott wrote, \"a right-arm fast-medium bowler with the accuracy, spin and resource of a slow bowler\".\n\nBarnes, \"square shouldered as a tailor's model\" as Alan Ross put it in his poem, is said to be by men who saw them both to have been around the same speed as Alec Bedser, which suggests he was bowling between 70 and 80mph. These days Swann is reckoned to bowl quickly for a spinner, and his average speed is around 60mph. Barnes's stock delivery was a fast leg break that swerved one way in the air and then span back the other off the pitch. He married this with a fast off break that did the exact reverse, a ball he was taught by the Australian Monty Noble, another early master of spin-swerve bowling. Barnes's particular release meant that the two were difficult to distinguish. He did not unfurl the wrist for his leg break, but rather cocked it backwards and rotated it, as though he was, as Rajan says, \"unscrewing a light bulb\". If you want a more technical explanation, you can find one in Bob Woolmer's Art and Science of Cricket.\n\nThis method brought Barnes 189 Test wickets at 16.43 each, and universal recognition from his contemporaries as the greatest bowler of his era. It was the swerve that did it, movement akin to the drift you still see now in good spin bowling, only faster through the air. But this was genuine spin bowling – Barnes was outraged when David Frith once had the temerity to ask him if he cut the ball? \"'Cut it?' He glared, and again I wondered if he might hurl something at me. 'I spun the ball!'\" The great Australian batsmen Clem Hill remembered how a \"ball pitched outside my leg-stump, safe to the push off my pads, I thought. Before I could 'pick up' my bat, my off-stump was knocked silly\".\n\nA few bowlers have dabbled in something similar since, notably Derek Underwood, but Barnes's is a type of bowling that is not used any more, though. Why is this? Partly it must be the pitches, which are so much better to bat on than they once were. Covers mean that there are no sticky dogs any more, and improved drainage and groundskeeping ensure that there will always be less help for the bowler. Partly it must be the coaching – Barnes only had three hours of the stuff in his entire life – which would frown on such unorthodoxies, pigeon-holing players into distinct categories and persuading them against bowling at medium-pace.\n\nCould the style still work? Rajan thinks so. \"It is a wonderful method of bowling that begs for resurrection ... if some thoughtful young bowler could exhume from Barnes's grave that distinctive approach to bowling – genuine spin and swerve at medium pace – another star could appear in the bowling firmament.\" Perhaps his book will inspire someone to do just that, just as Grimmett once did for the flipper. In fact, given that Barnes was still playing first class cricket when he was 57 there is hope for us all. Now, if I can just master this googly ...\n\nJUJITSU, ACCRINGTON STYLE\n\nAs good as Marcus Trescothick's 144 may have been, the best innings of the last week was not played against Durham at Chester-le-Street but in a small branch of Londis in a town called Clayton-le-Moors. That's two miles south of Accrington, in case you were wondering. A part of the world you might call Bumble country.\n\nThere, the 55-year-old shopkeeper Nasir Ahmed found himself confronted by two robbers. One was wearing a balaclava and brandishing \"a brand new two-foot long axe\" and the other had his hat pulled down and was carrying a samurai sword. As attacks go, that one must rank as little more intimidating than Ambrose and Walsh but perhaps just a touch behind Holding and Croft.\n\n\"I turned around, our eyes met and we looked straight at each other. I noticed the axe. It caught my eye and he raised it as if to swing,\" said Mr Ahmed. \"I just reacted. I grabbed a cricket bat I keep behind the counter and brought it down twice on the counter right next to him. He didn't even have time to say anything. I learned the move doing jujitsu 25 years ago - you startle your opponent.\"\n\nOf course.\n\n\"They both ran out and I chased after them. I had the opportunity to hit them in the head and then hit their car, but I chose not to,\" Mr Ahmed continued, proving once again that in cricket discretion is often the better part of valour. \"Now they'll think twice about coming back here. But if they do, next time I will hit them in the head.\""}, {"url": "https://us.humankinetics.com/blogs/excerpt/primary-techniques-for-three-bowling-styles", "page_content": "This is an excerpt from Cutting Edge Cricket by Cricket Australia,Frank Pyke & Ken Davis.\n\nBowling Skills and Strategies\n\nBowlers must understand the principles governing a sound bowling action. A mechanically sound technique can do much to ensure long-term involvement in the game with minimal interruption as a result of injury. As well, efficiency of technique can produce more effective outcomes in terms of generating power, spin or swing. Although it was not a major focus of this book to provide a comprehensive analysis of the skill of bowling, the players we interviewed mentioned some key aspects of technique, which we have summarised.\n\nPace Bowling\n\nQuality pace bowling requires a smooth and accelerating run -up, a powerful and efficient bowling action and the capability to vary the line, length and speed of deliveries according to the perceived weaknesses of the batters and the circumstances of the game.\n\nRun-Up\n\nBecause research has shown that the run-up in pace bowlers contributes approximately 20 per cent to the velocity of the ball, there has been more emphasis on bowlers' run-ups. Dennis Lillee consulted a running coach to make sure he was accelerating effectively into the delivery stride. Others have followed suit, albeit somewhat late in their careers, as Merv Hughes indicated:\n\nBeing young you have a lot more on your mind than running style. This includes where you are going to bowl, what type of delivery and so on. Looking back now, the run-up, delivery and follow-through are the most important stages of bowling, with run-up the most important.\n\nJohn Harmer believes that a bowler is an ‘athlete until the penultimate stride', and so correct running technique is mandatory. Brian Mcfadyen contends that bowlers need an efficient run-up so that when they get to the crease, they don't need to place enormous physical load on the body. As well as momentum, he believes the run-up should place the bowler in a balanced position at delivery. McFadyen warns that it is very difficult to alter the running technique of a 21-year-old, and suggests that most work should be done between 8 and 15 years of age.\n\nThe length of a pace bowler's run-up has varied throughout the ages, but essentially it should be as long as needed to generate optimum momentum while enabling the bowler to be strong through the crease. Damien Fleming remarked that, like most young fast bowlers of his time, he initially ‘ran in like Dennis Lillee with a high bound in the penultimate stride'. Later in his career, he shortened his run-up from 28 paces to 15 and found that he maintained his pace, was taller at take off and release and had a shorter jump into the delivery, but most important, he felt more powerful and rhythmical.\n\nEfficient Delivery\n\nJohn Harmer offered the following keys to achieving an effective body position in bowling:\n\nLeg stability with limited collapsing of the legs throughout the delivery\n\nCompactness of the arms so that all force is generated towards the target\n\nAlignment of all body parts inside the width of the bowler's shoulders (see figure 4.1)\n\nAn injury-free technique\n\n\n\nMcFadyen also stressed the importance of alignment, explaining that the bowler's run-up and foot placement should be in a direct line to the target. Richard Done cited the stability at back foot landing, but added that the direction of the front elbow and the position of the hand and body at release are important points in a delivery.\n\nAll of the preceding tips are relevant to all types of bowling from pace to spin. The following section presents specific issues relating to spin bowling.\n\nSpin Bowling\n\nSpin bowling is a complex art that requires guile, effective grips, strong body action and subtle changes in flight to deceive a batter. Ashley Mallett identified the following principles in bowling spin:\n\nEnsure that the delivery action is supported by a strong, solid base.\n\nStay tall through the crease, keeping the front leg straight and the leading arm high.\n\nSpend as much time on the front leg as possible, and use an up-and-over action to generate the energy required to spin the ball.\n\nThe key is not where the ball lands, but how it arrives. The more time you spend on the front foot, the more purchase you will achieve on the ball. A hard-spun delivery with lots of overspin will cause the ball to dip acutely.\n\nIf you spin the ball hard, you will have a bigger area of danger. For example, a Shane Warne leg break, shown in figure 4.2, achieves a danger area as big as a dining room table, but a more modestly spun delivery produces a danger area the size of a dinner plate.\n\nOff spin bowlers should keep their bowling arms higher than leg spinners do. In both cases, the front shoulder should point towards the target (to optimise rotation) and rotate like an upright wheel rather than sideways like a Frisbee.\n\n\n\nA strong use of the leading, or non-bowling, arm has long been advocated for pace bowlers, but according to Terry Jenner and Ashley Mallett, it is just as important for spin bowlers.\n\nSwing Bowling\n\nThe ability to swing the ball in a traditional manner has declined in recent years as many bowlers, like Glenn McGrath, have favoured moving the ball off the seam. Many experts believe that this phase will change in the near future, as Harmer noted: ‘Swing bowling will come back and is particularly suited in Twenty20 cricket. If the ball is straight, then you get very predictable and players are able to risk hitting through the line of the ball.'\n\nDamien Fleming contends that the keys to orthodox outswing bowling involve positioning the wrist and fingers behind the ball with the ball angled towards the slips (see figure 4.3). With his wrist tilted to point the seam towards the slips, he imparted backspin on the ball as he slid his fingers down the seam at release. It was critical to maintain a stable seam throughout the flight path. Although some achieved this with two fingers close together, his preference was to have the fingers more apart (like Craig McDermott and Terry Alderman). Fleming also focused on placing his thumb right along the seam when he wanted to swing the ball. For cutters and slower balls, he recommended moving the thumb to one side of the seam.\n\n\n\nFleming also noted that some bowlers, such as David Saker (former Victorian and Tasmanian outswing bowler), swung the ball effectively by pointing the seam towards slips but with their fingers pointing straight up the pitch at release. The key then appears to be to set the ball in the hands to maintain a stable seam position pointing towards the slips. The opposite action is true for inswing bowling: the seam points towards leg slip and the wrist tilts to accommodate that angle.\n\nFor reverse swing, Fleming noted two strategies that seem to work. Initially, players bowled with a rounded arm action to facilitate reverse inswing. Bowlers such as Lasith Malinga and Waqar Younis generated late reverse inswing with this method. However, Fleming noted that, in recent times, Victorian fast bowler Shane Harwood and emerging Indian pace bowler Ishant Sharma achieve reverse swing with the seam upright. This fairly recent phenomena in cricket needs further investigation and practice to determine the best method.\n\nIn all swing bowling, bowlers must shine the ball appropriately to facilitate variation in smoothness on either side of the ball. According to Carl Rackemann, the late Malcolm Marshall transformed pace bowling. With his front-on action, he was able, through positioning his wrist correctly, to bowl outswing as well as the traditional inswing that is typically achieved with this action.\n\nThe information in this section is not meant to be a comprehensive coverage of techniques in bowling. Rather, it is intended to address the basics of sound technique. Players need to be persistent and learn to bowl both traditional swing and reverse swing deliveries to maintain potency in their armoury."}, {"url": "https://www.espncricinfo.com/cricketers/michael-hogan-275658", "page_content": "A tall fast bowler originally from New South Wales, Michael Hogan was a latecomer to first-class cricket, only making his debut at 28. After a short time with Western Australia he agreed a deal to play for Glamorgan on a British passport and has produced strong performances in the UK and is considered good enough to play as WA's overseas player.\n\nHogan, who had been playing club cricket in Newcastle, was called across country by WA for a trial during 2009 and impressed in a successful opening season, especially in the Sheffield Shield, where he collected 23 wickets in seven matches to finish third on Western Australia's wicket tally. When Justin Langer took over as WA coach for the 2012-13 season he tried to persuade Hogan to stay in Australia but the bowler confirmed his change of status. Langer employed Hogan as an overseas player anyway and was rewarded with 36 wickets at 25.86 in the 2013-14 Sheffield Shield, where WA finished as runners-up.\n\nAt Glamorgan, Hogan has been outstanding, taking over 100 wickets in all competitions in 2013, his first season in the UK. When he finished as Glamorgan's leading wicket taker for the third successive season in 2015, he was 34 but voiced hopes that he could play for \"another three years, maybe five or six\" if his body held up.\n\nAlthough he has few batting pretensions, he also hit a career-best 57 to top score at No 11 against Lancashire in a 2015 season when Glamorgan's tail persistently outscored their top order. The last time a Glamorgan No. 11 top-scored in a Championship innings was in 1982, when Simon Daniels scored 73 against Gloucestershire at Swansea in a record last-wicket stand of 143 with Terry Davies.\n\nHe continued to be something of a linchpin in the Glamorgan attack, taking at least 45 wickets in every Championship season and chipping in occasionally in the white-ball sides. He took over as skipper midway through the 2017 season, and continued in the role in 2018, stepping down at the end of the Championship campaign.\n\n\n\nESPNcricinfo staff"}], "Terry Alderman's batting style was right-handed.": [{"url": "https://www.cricbuzz.com/profiles/4689/terry-alderman", "page_content": "\n\nFull profile Born on June 12th, 1956 in Perth, Alderman was known for his impeccable off-cutters and away swingers that were bowled at an impressive pace hurrying the batsmen into their doom. He rose in ...\n\nBatting Career Summary M Inn NO Runs HS Avg BF SR 100 200 50 4s 6s Test 41 53 22 203 26 6.55 735 27.62 0 0 0 19 0 ODI 65 18 6 32 9 2.67 97 32.99 0 0 0 2 0\n\nBowling Career Summary M Inn B Runs Wkts BBI BBM Econ Avg SR 5W 10W Test 41 73 10181 4616 170 6/47 10/151 2.72 27.15 59.89 14 1 ODI 65 65 3371 2056 88 5/17 5/17 3.66 23.36 38.31 2 0\n\nCareer Information\n\nProfile\n\nBorn on June 12th, 1956 in Perth, Alderman was known for his impeccable off-cutters and away swingers that were bowled at an impressive pace hurrying the batsmen into their doom. He rose in prominence during the 1981 Ashes tour of England taking a rich haul of 42 wickets. This was the biggest wicket haul in a single series ever since Jim Laker took 46 wickets in 1956. It was also the fourth biggest haul of all time in a series.\n\n\n\nAlderman proved that the 1981 success was no flash in the pan as he repeated the feat in the 1989 series after missing out on the 1985 series for being a part of a rebel tour to South Africa. Alderman served his 3 year suspension period before making a triumphant return to the Australian set-up. England continued to be his favourite opposition as he tore them apart yet again in the 1989 series with 41 scalps. He harassed Graham Gooch to such an extent that Gooch decided to take a break after four Tests.\n\n\n\nAlderman had his share of injuries which hampered his career. He was injured when he rashly tackled an English supporter who had entered the ground. This injury kept him out of the game for a period of 13 months. In a productive 41 Test career, Alderman ended with 170 wickets, 100 of which were the poor Englishmen. The included as many as 11 5-wkt hauls and a single ten wicket haul.\n\n\n\nAlderman spent fruitful seasons in England spending time with Gloucestershire and Kent and also has been a radio commentator. Alderman's sister Denise Emerson is married to former Test umpire Ross Emerson and herself played seven Tests for the Australian women's cricket team.\n\n\n\nBy Pradeep Krishnamurthy"}, {"url": "http://cricmash.com/biographies/terry-alderman-83-wickets-in-12-tests-in-england-at-19-apiece", "page_content": "Terry Alderman, born 12 June 1956, was an Aussie master of the English conditions. With 83 wickets in 12 Tests played in England, he remains one of the enduring Ashes heroes of history. Arunabha Sengupta looks back at the career of the man who was once engaged in a rugby-style tackle during a Test match.\n\n\n\n“The first ball from Alderman flew down the leg side on a fullish length. For a medium-pace bowler Alderman had a long run-up, which gave the batsman too much time to think. At delivery he had a disconcerting grin and this combination added to my inevitable nerves, (which) meant I moved too soon at my second ball. It was straight and full, and as I had to play around my front pad, I missed it — I looked up to see the tall, sombre figure of Nigel Plews raise his finger and that was that. I was on my way back to the pavilion, joining the likes of Hutton and Gooch, who had also recorded ducks on their debuts.”\n\nThis was how Michael Atherton described the first innings of his Test career in his excellent autobiography Opening Up. However, Alderman’s success was due to much more than the long run up and perplexing grin. The smile was eternally etched on his face as long as he played the game — and his run up and speed remained honest, toiling and medium paced all through. It was only when the focus shifted to the seaming tracks of England that venom was added to his deliveries in incredibly generous proportions.\n\nNeither was the confusion limited to the debutant Atherton. The Lancashire man was in the side in place of the formidable and enormously experienced Graham Gooch. The seasoned opener had asked the selectors to leave him out of the Test team after he had spent most of the summer trying to figure outthe mysteries of Alderman’s seamers, swingers and cutters.In all Alderman got Gooch 7 times. Whenever he bowled in England, this medium pacer from Perth became virtually unplayable.\n\nA lopsided career\n\nOf Alderman’s 170 wickets in 41 Tests, 83 were captured in England at 19.33 apiece. Only Jim Laker and Malcolm Marshall have taken more at a better average in the Old Country.\n\nIn 1981, a series otherwise remembered as Ian Botham’s Ashes, the young medium-pacer made his debut and went on to scalp 42 wickets in the 6 Tests. Returning to England eight years later, he captured 41 more in another 6 matches as Australia routed England 4-0.\n\nMainly due to his exploits in England, he has gone down as an Ashes hero, with 100 wickets in 17 Test matches at 21.17. Among all the bowlers who have played after the First World War, only Glenn McGrath and Dennis Lillee have captured more Ashes wickets with a better record.\n\nYet, Alderman’s career away from English shores was spent as his run-up suggested — in honest toil with medium-pace and medium returns. Even when the same English opponents made their way to the land Down Under, and played in Alderman’s own backyard, his haul turned a less remarkable 17 wickets at 30.11.\n\nYes, Alderman was perennially linked to the Ashes. It was during one of the less remarkable Ashes Tests, perhaps frustrated by the lack of usual success, that he flew after an intruding spectator and brought him down with a rugby tackle. That incident at Perth proved costly to his shoulder and derailed his career for a while.\n\nThe first Ashes\n\nA smiling destroyer with the cricket ball graces us rarely, especially when we talk of fast bowlers among the rough and rugged cricketers churned out by Australia. It was remarkable too that he shared the new ball with Dennis Lillee — a feat carried out with path-breaking hostility and intimidation by the likes of Jeff Thomson and Len Pascoe. However, here was a primary school teacher who ran in with the bright new cherry and took wickets with an engaging smile. Later, when asked about his incredible success, he characteristically attributed much of it to Dennis Lillee at the other end and the rest to the vagaries of the English pitches.\n\nHeadingley onwards, the summer was indeed the annus mirabilis of Ian Botham. Yet, the initiative had been seized at Nottingham by the visitors, and young Alderman had been the one with the firmest grip on the proceedings. His first wicket could not have been a better one, as Geoff Boycott perished to one of the many diligent deliveries he kept right up and moved deceptively away. He took 4 in the first innings, including Ian Botham clean bowled, as England fell away for 185. And when Australia replied with 179, he returned to share the wickets with Lillee, equally and with as much aplomb, complementing the senior man’s menace with his smiling presence. England were blown away for 125 and Australia went one up in the series.\n\nLillee had contributed to his 9 wickets in ways other than just forming one-half of a hunting pair. Alderman had come to England relying on swing, with a chest-on delivery after a rather lazy run up. It was at the Edgbaston nets that Lillee asked his young partner to bowl off a longer run. Alderman tried to hit the seam and soon the Australian batsmen found him unplayable in the nets.\n\nIn the Tests, he not only made the ball talk after making it regularly land on the seam, he also bowled faster than he had ever done in Australia. Standing at six foot two and half inches, he went through long spells bowling into the wind — as is the lot of a bowling partner of someone like Lillee. Yet, it was a challenge he relished. As he modestly put it, “When you’re bowling at the other end to Dennis, you’ve got to have a better chance of getting wickets … But you have to look at the series as a whole and admit that the wickets did help.”\n\nTwo matches after his debut, Botham performed the miracle at Leeds, and England pulled off an incredible heist after following on. Ironically, it was the same innings in which Alderman bagged his first five-for, doing everything to crush England but land the final blow. He did bowl Graham Dilley and get Willis caught to finish with 6 for 135, but England had recovered and the rest of the tale can be found in the much documented history.\n\nIn the following Test at Birmingham Alderman struck again, picking up 5 for 42 and 3 for 44, leaving his side just 151 to win. But, it was Botham who hijacked his show once more, picking up 5 wickets for a solitary run in 28 balls, ending the Australian second innings at 121, almost symbolically knocking over Alderman’s stumps to clinch the victory.\n\nAt Manchester Alderman persevered, taking 4 in the first innings and 5 in the second, but a second innings hundred continued the Botham saga. Once again Alderman’s lofty feats were eclipsed by the all-rounder’s brilliance as Australia slumped to the third defeat on the trot.\n\nMore sedate than spectacular\n\nBy the time the Ashes was over, Australia was shaken. Alderman had emerged as a prime bowling hope. It had been quite a journey for the Western Australia paceman who had also turned out in Australian Rules football as an amateur till the end of the 1978 season – and had decided firmly on cricket only after that. His father William had been a centre half-back for Western Australia and had opened both batting and bowling for the colts team of the state. Alderman had steadily following his footsteps, playing both the sports during his schooldays at Aquinas College in Perth. In 1972-73, he had been chosen in the Australian schoolboys cricket team.\n\nSuccess was aplenty in the colts matches, and 6 wickets against Victoria at Melbourne in the following season brought him into the focus of important decision makers. Soon, this quickish bowler who came off a short run was included into the Western Australia side. But, the introduction to the big league was accompanied by a cruel strain. In his second over in the Gillette Cup, Ian Chappell blasted 24 runs. And when as an 18-year-old he made his Sheffield Shield debut against New South wales, he captured 5 for 63, but pulled a hamstring rather seriously.\n\nThe progress through the ranks was more sedate than spectacular. Alderman was dropped from the state team twice, and it was primarily due to the wings of young hope that he managed to soar again. There was no room for him even in the Australian side reduced by the parallel cricketing universe of Kerry Packer. Disappointment hit him bitterly when he was overlooked for the tour of India under Kim Hughes. However, he slogged on — helped immensely by the fitness regime prescribed by Western Australia team coach Daryl Foster. An off-season routine of golf, squash and running kept him fighting fit. And ultimately 32 Shield wickets in the 1980-81 season secured a ticket to England.\n\nThe rugby tackle\n\nReturning to Australia as a rising star, Alderman was quickly brought down to the cruel cricketing earth. There were some quick wickets in the Perth Test, made infamous by the Lillee-Javed Miandad fisticuff. After that the methods that had worked in England refused to bear fruit on the hugely different Australian conditions. Success remained elusive even when he ventured to the neighbouring New Zealand. Finally, one-and-a-half years after the spectacular Ashes series, the Englishmen came down to engage in a Test series in Australia.\n\nThey started at Perth, a city in the middle of a heat-wave, the mercury shooting beyond the 100-barrier in the shade. A Channel Nine advertising campaign had hyped the Ashes, laddering on partisan sentiments, underlining national stereotypes and creating a lot of murmur. One ad showcased several bouncers and hostile fast bowlers. The excitement was buoyed, the heat played its part and a large number of English supporters in the crowd kept the atmosphere on knife’s edge.\n\nThe action in the middle was at the other extreme, unbearably tedious and tepid. Chris Tavare batted all day for an unbeaten 66, including a scoreless last hour and a quarter. England crawled to 242 for 4 by the end of the first day. As the temperature soared on the next morning and afternoon, the progress of the English batsmen remained tardy, and the frustrated English crowd grew aggressive.\n\nAlderman was bowling with England 8 down when Bob Willis edged him through the slips to bring up the 400. A group of rather unruly English youths rushed into the ground to celebrate. The bowler, having ended his over, angrily pushed one intruder towards the outfield before making his way to the square-leg. It was then that an inebriated 19-year-old English immigrant named Gary Donnison punched him at the back of his head as he ran past him towards the pavilion. Alderman who had sent down 43 overs for a solitary wicket could not take it anymore. There were no police in the vicinity to round up the assailant, and Alderman charged across and rugby-tackled him to the ground. Unfortunately, he landed heavily on his right shoulder.\n\nAs the pair wrestled on the ground, Alderman’s opening bowling partner Dennis Lillee approached and dragged Donnison away. Soon, another Australian great went up to lend a hand. Allan Border helped the fast bowling legend to pin the miscreant to the ground as they waited for the police to arrive. But, amidst all the excitement — perhaps pleasant relief for the crowd — it was obvious that Alderman had done serious damage to himself.\n\nDonnison was eventually found guilty of assault and was fined $500 and ordered to do 200 hours of community service. However, damages were probably more serious for Alderman. It was a year before he could bowl in a competitive match again. A painstaking rehabilitation process followed, which included swimming a mile a day for eight months.\n\nYears later, Bob Willis reflected: “For a remote and sleepy city, Perth had a surprisingly large hard core of hooligans. However, Terry was stupid to head off in pursuit of that idiot and the injury set back his career a lot.”\n\nAlderman, while confessing that a debilitating injury was one of the worst afflictions to a top notch sportsman, was quite forgiving about Donnison. “I have heard that he has got his act together and is a reborn Christian with a wife and three kids. So some good came out of it, I suppose.”‘\n\nThe second Ashes\n\nWhen he returned to bowl for Australia again, it was in the forbidding islands of West Indies. He managed just 4 wickets in 3 Tests, but did have one memorable moment. At Port-of-Spain, he came in to bat with the side facing certain defeat with a persevering Allan Border at the other end. A confirmed rabbit who boasted an average less than 5 and a highest score of 12 at that point, Alderman batted 95 minutes with Border to save the Test, in the process helping the left-hander get to a most deserved and valuable hundred.\n\nBut, with wickets having reduced to a trickle, he was soon dropped from the side and spent four years in wilderness before returning for the second glorious chapter of his career.\n\nThis included a three-year ban due to touring South Africa with a rebel Australian team in 1985-86 and 1986-87. It was only in the 1988-89 season that he made it back to the Test side, and it was with a return with a roar.\n\nWith Border leading the side to England in 1989, Alderman was selected for the tour. And he started bowling as if nothing had changed in the interim eight years since his debut.\n\nHe started with 5 wickets in each innings at Leeds — in a 210 run victory that perhaps erased some memories of the nightmares of 1981. He continued to take wickets by the bushel all summer. At Lord’s 6 second-innings wickets were captured in another victory. Five for 66 followed in the first innings at Manchester in yet another win. Another 5-wicket haul came at Trent Bridge, the match that saw Mike Atherton make a duck on debut. England managed to draw the final Test at The Oval, but Alderman ended the series with 5 for 66 — his sixth 5-wicket return of the series. This time, there was no one to steal his thunder, and he was named the Man of the Series.\n\nTerry Alderman bowling in the 4th Test against England at Edgbaston in August 1981 © Getty Images\n\nThe final result\n\nAlderman did play for two more years and enjoyed a fair amount of success in 2 Tests at home against Pakistan. He also had a decent Ashes series in Australia, although without matching his earlier heroics – either with the ball or rugby tackles.\n\nIn the end, his 170 wickets at 27.15 underline a successful, if slightly lopsided, career. His collection of runs — 212 with an average of 6.54 — perhaps would not have been able to keep up with his wicket tally had he been included in the side for the 1985 Ashes. It also marks him as an endearing No 11 of genuine ineptitude. In 265 First-Class innings, he crossed 50 just once, and then too barely.\n\nWhat is surprising is that unlike typical fast bowlers who like to patrol long-leg once their over is done, Alderman was also a fantastic catcher in the slips. The abundance of slip fielders in the Australian team resulted in his seldom fielding close to the wicket after the first Ashes series of 1981, but he did pouch 27 catches in his 41 Tests. He held 190 First-Class catches in all, spending a lot of time taking the offerings for his fellow bowlers for Western Australia, Gloucestershire and Kent.\n\nWhile Alderman is going to be remembered primarily as an Ashes hero, it should be mentioned that success against England ran in his family. Younger sister Denise Alderman was a top class batswoman for Australia and averaged 41.27 in her 7 Tests, all against England. But, in striking contrast to her brother, she excelled at home, scoring 453 runs in Australia 50.33 with a highest of 121; while her 2 Tests in England brought her just 1 run. Later, Denise married Ross Emerson, the umpire who courted infamy after calling Muttiah Muralitharan for throwing.\n\nAfter retirement, Alderman remained attached to cricket as a radio commentator. For someone universally acknowledged as pleasant, he did cause some furore during an Ashes series in England. In the build up to 2005 Ashes, he was colourful in describing the English spin attack: “If any of our batsmen get out to Giles, they should go hang themselves in shame.” Unfortunately, it turned out to be Australia’s first Ashes defeat since Alderman had taken 41 wickets to reclaim the urn in 1989."}, {"url": "https://www.espncricinfo.com/cricketers/terry-alderman-3943/bowling-batting-stats", "page_content": "Zimbabwe\n\nAll\n\nAlphabetically sorted top ten of players who have played the most matches across formats in the last 12 months"}, {"url": "https://www.mykhel.com/cricket/players/terry-alderman-o311/", "page_content": "You can manage your notification subscription by clicking on the icon\n\nTo start receiving timely alerts, as shown below click on the Green “lock” icon next to the address bar\n\nClick it and Unblock the Notifications Click it and Unblock the Notifications\n\nClose X"}, {"url": "https://www.infoknocks.com/biography/shane-watson/", "page_content": "Shane Watson is a New Zealand international cricketer who was born on 17 June 1981 at Ipswich, Queensland, Australia. He debuted in 2002 in a One Day International and retired in 2016. He is a right-handed batsman and a right-handed fast-medium swing bowler. Shane Watson made his Test debut against Pakistan in 2 January 2005. Shane Watson made his ODI debut against England in 5 September 2015. He made his T20I debut on 24 February 2006 against South Africa.\n\nShane Watson Biography Full Name Shane Robert Watson Nickname Watto Profession Cricketer\n\nShane Watson Cricket Life International Debut Test debut – 2 January 2005 v Pakistan\n\nODI debut – 5 September 2015 v England\n\nT20I debut – 24 February 2006 v South Africa Last International Match Test debut – 8 July 2015 v England\n\nODI debut – 5 September 2015 v England\n\nT20I debut – 27 March 2016 v India Indian Premier League (IPL) Debut Year 2008 Jersey Number ODI shirt no. 33 Coach Name Terry Alderman Batting Style Right-handed Bowling Style Right-arm fast-medium Role All-rounder Famous Shots Hit over mid-wicket Awards Name Australia’s T20 International Player of the Year on 23 January 2017\n\nShane Watson Physical Appearance Eye Color Black Hair Color Black Height 1.83 M Body Colour Fair Weight (approx.) 80 Kg\n\nShane Watson Personal Life Date of birth 17 June 1981 Place of birth Ipswich, Queensland, Australia Marital Status Married Marital Date 3rd June 2010 Girlfriend name Lee Furlong Nationality Australia Zodiac Sign Gemini Religion Christian Hobbies Playing guitar and singing\n\nShane Watson Education Educational Qualification Not Known School Forbes School of Business Ashford University, Clinton College / University Not Known\n\nShane Watson Family Details Wife Name Lee Furlong Father Name Bob Watson Mother Name Barb Watson Brother Name Not Known Sister Name Nicole Watson Children Son – William Watson | Daughter – Matilda Victoria Watson\n\nShane Watson Income Net Worth (Approx.) US$150 billion IPL Fee Rs 4 Cr.\n\nShane Watson Favourite Things Favourite Cricketer Viv Richards, Chris Gayle, Mike Hussey, Steve Waugh Favourite Grounds Sydney Cricket Ground, Sydney Favourite Destinations Maldives, Jaipur and Kenya Favourite Actor Russell Crowe, Jacinta Stapleton Favourite Actress Favourite Film Not Known Favourite Food Not Known Favourite Animal Not Known"}, {"url": "https://en-academic.com/dic.nsf/enwiki/971597", "page_content": "Infobox Cricketer\n\n\n\n\n\nnationality = Australian\n\ncountry = Australia\n\ncountry abbrev = AUS\n\nname = Terry Alderman\n\npicture = Cricket_no_pic.png\n\nbatting style = Right-hand bat\n\nbowling style = Right-arm fast-medium\n\nballs = true\n\ntests = 41\n\ntest runs = 203\n\ntest bat avg = 6.54\n\ntest 100s/50s = -/-\n\ntest top score = 26*\n\ntest overs = 10181\n\ntest wickets = 170\n\ntest bowl avg = 27.15\n\ntest 5s = 14\n\ntest 10s = 1\n\ntest best bowling = 6/47\n\ntest catches/stumpings = 27/-\n\nODIs = 65\n\nODI runs = 32\n\nODI bat avg = 2.66\n\nODI 100s/50s = -/-\n\nODI top score = 9*\n\nODI overs = 3371\n\nODI wickets = 88\n\nODI bowl avg = 23.36\n\nODI 5s = 2\n\nODI 10s = -\n\nODI best bowling = 5/17\n\nODI catches/stumpings = 29/-\n\ndate = 12 December\n\nyear = 2005\n\nsource = http://content-aus.cricinfo.com/ci/content/player/3943.html\n\nTerence Michael Alderman (born 12 June 1956 in Subiaco, Western Australia , Australia) is a former Australian cricketer .\n\nHe began his first-class career in 1974 with Western Australia in the Sheffield Shield and came to international prominence when he was chosen for the Australian national team to tour England in 1981. In that series he took 42 Test wickets, the biggest haul in a series since Jim Laker 's 46 in 1956 and the fourth-highest total of all time. He was named as a Wisden Cricketer of the Year in the Almanack's 1982 edition.\n\nHe was disabled from playing for over a year by a shoulder injury sustained on 13 November 1982 when he rashly tackled an English-supporting ground invader at the WACA Ground in Perth [ [ http://www-uk2.cricket.org/db/ARCHIVE/1980S/1982-83/ENG_IN_AUS/ENG_AUS_T1_12-17NOV1982.html Scorecard, with incident note at foot ] ] .\n\nAlderman took part in an unofficial Australian tour of South Africa in 1985-86, when that country was banned from Test cricket as a Commonwealth anti- apartheid sanction. As a result, he received a 3-year ban from international cricket which disqualified him from playing in the 1985 Ashes series in England.\n\nAlderman returned to the Australian side and had great success in England in 1989, taking 41 wickets in the series, and also claimed 16 on his final Ashes appearance in 1990/91. He rarely enjoyed similar success in matches against other countries. He ended his career with 170 Test wickets.\n\nHe was a poor batsman, passing fifty just once in his career and averaging barely eight in first-class cricket. He had three seasons in English county cricket , with Kent (1984 and 1986) and then with Gloucestershire (1988). He now works as a radio commentator in Australia.\n\nAlderman's sister Denise Emerson is married to former Test umpire Ross Emerson and herself played seven Tests for the Australian women's cricket team .\n\nAlderman is an old boy of Aquinas College, Perth. [ [ http://www.icmi.com.au/Speaker/Sports/Terry_Alderman ICMI Speakers - Terry Alderman ] ]\n\nExternal links\n\n* [ http://content.cricinfo.com/australia/content/player/3943.html Cricinfo article on Terry Alderman ]\n\nReferences"}, {"url": "https://internationalspeakers.com.au/speakers/terry-alderman/", "page_content": "About Terry\n\nTerry Alderman was the best Australian cut and swing bowler of his era. His highly decorated career spanned two decades. Terry was of incredible sporting pedigree and born into a sports loving family. His father Bill played league football and first-grade cricket, brother John was a first grade cricketer and sister Denise Emerson was an Australian Test cricketer.\n\nStarring as a bowler with Aquinas College, Terry made his first-grade debut while still in school. In his first match, in Sydney during the 1974/75 season, he took five New South Wales wickets to start an incredible career. Terry would go on to play first class cricket with Western Australia for two decades, English County cricket with Kent and Gloucestershire, and Test cricket with Australia. He would earn a three-year ban from international cricket after participating in rebel tours to South Africa in 1985/86 and 1986/87.\n\nTerry was reliable to attack when others were struggling and conditions were adverse. Although not recognised for his batting prowess and almost always the number 11 in any side, when required he gave effort and resistance. In 1984, in the second test against a powerful West Indies side, he and Allan Border batted for 95 minutes to save Australia from defeat.\n\nOwing to his quick reflexes, he was a reliable slips and close-in fieldsman. He took 190 catches in first class cricket. Career highlights are 1981 and 1989 Ashes series in England where he took an exceptional 42 and 41 Test wickets respectively. With 433 wickets he has taken the most of any Western Australia bowler. Terry adapted well to one-day limited overs matches, bowling with economy in his 65 matches.\n\nTerry is in high demand as a speaker for corporate, government and sporting events. Motivating, informative and witty, presentations are tailored to the needs of the client."}, {"url": "https://advancecricket.com/cricket-player/terry-alderman/62928178", "page_content": "ODI Details\n\nTerry Alderman played 1 ODI matches and scored 0 runs in 0 Innings. Terry Alderman's Highest Score in ODI is 0. T Alderman has 0 ODI centuries, 0 ODI half centuries and 0 times 30+ and 0 times 20+ ODI runs. T Alderman has a strike rate of 0 with average of 0.00 in 0 ODI balls. Terry Alderman made total 0 boundaries with 0 fours and 0 sixes in ODI. T Alderman's ODI outtype analysis are lbw 0 times, bowled 0, stumped 0 times, catch 0 times, Run Out 0 times. Terry Alderman's ODI wicket takers are 0 left arm and 0 right arm. T Alderman's Left Arm ODI Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. Terry Alderman's Right Arm ODI Wicket Taker analysis are Fast bowler 0 wickets, Fast-Medium bowler 0 wickets, Medium bowler 0 wickets, Slow bowler 0 wickets. T Alderman's wicket taken by Left Arm Bowlers in ODI analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets. Terry Alderman's wicket taken by Right Arm Bowlers in ODI analysis are lbw 0 wickets, bowled 0 wickets, stumped 0 wickets, catch 0 wickets.\n\nTerry Alderman Took 2 Wickets (In 1 ODI innings) with Strike Rate of 12.00 and Average of 11.00. T Alderman's delivered 24 balls (with 0 Maiden over) and took 2 wickets 1 times 3 wickets 0 times, 5 wickets 0 times, 8 wickets 0 times, 10 wickets 0 times. 2 Right Handed and 0 Left Handed batsman out by Terry Alderman in ODI. Right Handed Batsman ODI outtype analysis (wicket taken by T Alderman) are LBW 0 times, Bowled 0 times, Stumped 0 times, Catch 2 times. Left Handed Batsman ODI outtype analysis (wicket taken by T Alderman) are LBW 0 times, Bowled 0 times, Stumped 0 times, Catch 0 times.\n\nTerry Alderman Fielding analysis are Catch 0 times, Stumping 0 times, Direct Throw(Run Out) 0 times, Throw(Run Out) 0 times."}]}