{"Joe Holland has played professionally in France, Germany, and Japan.": [{"url": "https://prabook.com/web/joe.holland/2214430", "page_content": "Joe Holland\n\nNordic combined skier\n\nDecember 11, 1964\n\nHolland\"s best finish at the Olympic Winter Games was eighth in the 3 x 10 km event at the 1992 Winter Olympics in Albertville, France. Holland also competed at the 1988 Winter Olympics in Calgary, Alberta, Canada. Holland\"s top world cup finish was 11th place twice (1991, 1992), and he was among the top 10 at the World Junior Championships in his last year as a junior."}, {"url": "https://www.celebsagewiki.com/joe-holland", "page_content": "Age, Biography and Wiki\n\nJoe Holland (Peter Joseph Holland) was born on 21 July, 1961 in New York, USA, is an Actor, Director. Discover Joe Holland's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of Joe Holland networth?\n\nPopular As Peter Joseph Holland Occupation actor,director Age 33 years old Zodiac Sign Cancer Born 21 July 1961 Birthday 21 July Birthplace New York, USA Date of death 4 May, 1994 Died Place Los Angeles, California, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 21 July. He is a member of famous Actor with the age 33 years old group.\n\nJoe Holland Height, Weight & Measurements\n\nAt 33 years old, Joe Holland height not available right now. We will update Joe Holland's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nJoe Holland Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Joe Holland worth at the age of 33 years old? Joe Holland’s income source is mostly from being a successful Actor. He is from USA. We have estimated Joe Holland's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nJoe Holland Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.nativedsd.com/artist/the-joe-holland-quartet/", "page_content": "JOE HOLLAND Legendary drummer Joseph “Joe” Holland has a unique and colorful origin and story, to the say the least. His career has been a string of interesting stories, celebrity encounters and time spent with Paul W. Klipsch (PWK). Let’s start from the beginning…\n\nJoe was born November 2, 1927 in Shreveport, Louisiana. He attended Centenary College in Shreveport, as well as Louisiana Tech in Ruston, LA, and Texas Western in El Paso, TX (now UT El Paso).\n\nJoe began drumming all the way back in grade school. In those days, the Shreveport schools did not have a junior high. Elementary graduates went directly to high school. There was a push to prepare these elementary students for high school music programs. Joe’s first music teacher was a type of “circuit teacher” – one that makes the rounds. He had just graduated from college and he admitted to Joe “I don’t know anything about drums at all, about how to play, but I know how to teach it.” He gave Joe a book and told him: “Do what it says here and I’ll be back next week and check on you.”\n\nJoe practiced from the book’s instructions the whole week, and when the teacher came back, Joe had learned a great deal. Joe continued the year in this manner very successfully. There were three levels of bands in high school. Joe was admitted to the A level.\n\nJoe’s first brush with celebrity occurred when he was only 10 years old. His father was a builder and built their family home on Scoville Court. Across the street, on Dalzell, lived “Bubba” Broyles, owner of a profitable music store. It was the gathering place for local and transient musicians. He had a fine home and also owned the house next door, which he would occasionally offer to hard-up musicians who needed a place to stay.\n\nPud Brown, a tenor sax man of some repute, was there at the time, and he was a close friend of Louis Armstrong. Louis was having trouble dealing with threats from the owner of a Chicago nightclub. It seems that Louis had received a better offer from another club and gave the owner his two-week’s notice. He called his old buddy, Pud Brown, and was invited to Shreveport to use the “sleepin’ porch” until things cooled down. Bubba gave his OK and Louis felt safe there.\n\nJoe said, “I awoke to the sound of Louis’ trumpet and followed the sound to the sleepin’ porch. There sat Satchmo’ himself, smiling and playing his horn.” Of course “Jim Crow” was the order of the day in the Deep South, but Louis felt safe there because Bubba and Pud were his friends. Joe continued, “I had recently seen him in a movie short featuring Louis and his band, and I was fascinated by the man. He played for me and soon there were half-a-dozen other kids lined up at the door, equally wide-eyed. Bubba came over to get Louis and take him down to his store in the entrance of the Inn Hotel. I spent the afternoon listening and talking to Louis. I kept calling him Lou-ee until he corrected me, saying, “Joe, mah name, spelled L-O-U-I-S, not L-O-U-E-E! Say it: Lou-ISS.”\n\nI have forever after called him LouISS. The last time I saw Louis, he and his band were featured in a performance at Shreveport’s Municipal Auditorium. He had “Big Sid” Catlett, one of our finest, playing drums. Sid played a fabulous drum solo and dedicated it to me, a 14-year-old kid with tears in his eyes.”\n\nWorld War II was only months away when Joe got a job in Shreveport playing in a “low-down honky-tonk band.” His parents never paid much attention to his musical activities and knew nothing of his job, which paid $100.00 a week. At the time, this was more than many executives in Shreveport made. Joe saved his money and opened a bank account, which soon grew into the thousands.\n\nRiding home on a city bus one afternoon, Joe noticed a new Packard in front of a house with a sign on the windshield: “Buy this car for $300.00, I have been drafted into the army, Must Sell.” Joe hopped off the bus, rang the doorbell, looked at the car, drove it around the block and paid $300 cash.\n\nHis parents were astonished when he drove the car home and they asked him where the money came from. They both drove “mere Dodges.” This also prompted his mother to find a good, tough military academy. Schools with a military mission were becoming popular because of the looming certainty of war.\n\nThey decided on a military school in Gulfport, MS. When the family car arrived, a sign greeted them: “Send us the boy and we will return you the man.” It proved to be the low point in Joe’s life. He said it was like being in jail with a bunch of little boys from Mississippi, all being treated like prisoners. It even involved hazing from upper classmen that escalated. Joe credits the presence of his drums for “saving his life” and sanity. After a year or so, around 16 years of age, he “escaped in broad daylight” by taking a bus about 60 miles to New Orleans. He went straight to the musician’s union, signed up and had a job offer in a matter of hours. They kept him busy with good jobs that paid well and put him in association with a variety of celebrities.\n\nThese celebrities included Rosemary Clooney, Earl “Fatha” Hines and Candy Candido. The latter was a comic personality who had done many voice-overs, including work in the movie “The Wizard of Oz.” After this months-long tour concluded, the union recommended Joe to an all-girl band that had lost its drummer.\n\nMickey Stevens was the leader of the ten-member group. In order to maintain its all-girl status, the press releases said “All girl band. Featuring Joe Holland on drums.” “We worked well together,” said Joe, “We had a great time playing fancy resort hotels in Mississippi, Alabama and Florida before Mickey found a fine female drummer.”\n\nAfter their tearful goodbyes, Joe moved on to a luxury hotel in Kansas City for the drum spot in a Mickey Mouse Band. Translation: very corny music but even higher pay scales, plus room and board were on the house! Just for kicks, he dropped in on some of Kansas City’s top jazz clubs.\n\nJoe got to sit in with the likes of Count Basie, Earl Hines and many other greats of the day. However, he would not be able to work with black musicians again until his army days. That would come in 1957, the night after the 101st Airborne’s occupation of Central High School in Little Rock. It was the night he met the great Art Porter Sr. at a club in downtown Little Rock.\n\nJoe Holland v01Joe will never forget the feeling of working with such a great jazz personality. “Art should have been an internationally known pianist, but he did not want to leave Little Rock and his children,” said Joe. His son, Art Porter, Jr. became known internationally for his skill with the alto saxophone.\n\nOne of his early jobs in 1944 was in a “hillbilly band” for Jimmie Davis’ run for Louisiana governor. Joe says it was just by luck that Davis secured the “world’s greatest guitarist,” Snoozer Quinn. Joe and Snoozer became personal friends and worked together several times. Snoozer taught Joe one of his greatest lessons, how to integrate his skills with other band members. They continued playing Davis’ rallies right up to a successful election.\n\nAs soon as he was ensconced in office, Governor Davis left his advisors in charge while he made a beeline to Hollywood, where he starred in some of the worst movies ever made. There were two other notable musicians in the Jimmie Davis Band: brothers Hoke and Paul Rice. They wrote one of the greatest country music songs of all time, “You Are My Sunshine.” This beautiful, sentimental ballad was shopped around to top country singers of the day, but no one recorded it. The boys needed money so badly that they sold the song to Jimmie Davis for a mere twenty-five dollars!\n\nThe rest, as they say, is history.\n\nDavis recorded the tune and both he and the song became instant hits, selling in the hundreds of thousands. Davis listed himself as the composer of the song and wouldn’t pay anything more to the Rice brothers.\n\n“In 1946, just before I left New Orleans I got to spend five days working with The Three Stooges when they were booked into the St. Charles Theatre. Curly had had a stroke, Moe was worn out and Larry Fine had been cheated out of most of the money he was due from the movie company they worked for.\n\nThey did very little hitting and spent most of their time on stage singing! They were very good at that. I was on stage with them, using the bass drum pedal to enliven their stomping around on stage and providing sound effects with Korean temple blocks to provide sound for what little hitting they did do. Just a few months later I saw Curly’s obit in the paper,” Joe said.\n\nIn 1960, Joe found himself working in another “colorful” Louisiana governor’s race. This time it was with Earl Long. Earl had carried on an embarrassing tryst with a stripper named Blaze Starr. The band didn’t see much of Ol’ Earl. The routine was to get to the dusty towns first, set up on the rail freight platform, play and draw a crowd. As soon as they saw the white Chevy sedan they’d load up and move on to the next town. Joe said, “These things started mid-morning and continued until around 5 pm. The old boy was a trooper, as long as he had his glass of “amber colored liquid.”\n\nIn 1967, Joe broke with his tradition of Louisiana governor’s races and worked with the future governor of Arkansas, Winthrop Rockefeller. This was Rockefeller’ third and most difficult run. Joe provided the musical background for all of his commercials and 33 rallies around the state. Johnny Cash and Cal Perkins appeared at many of those rallies. On several occasions when Johnny’s drummer failed to show up, guess who sat in? Much later, in 1980, Joe worked with Frank White in his campaign that unseated Bill Clinton as governor of Arkansas. Initially, Frank was still wearing his tired plaid “country boy” suits and work shoes. Joe ended up being Frank’s advisor on how to dress for success.\n\nThe music business has been a central part of Joe’s life for over 70 years. However, Joe has held several “day jobs,” mostly in sales positions. According to Joe, “Music was always been something I was trying to escape from. The minute I’d escape, I couldn’t stand it. I had to go back and play. As a young musician, I received a lot of advice from older, experienced musicians. They always said to have a back-up plan.” Joe explained that the dependency of the music business on the liquor business must be recognized. “Once a club starts to fail…the first thing they do is lay off musicians.”\n\nJoe’s first day job was with Revlon, representing the Louisiana area and continuing over to Dallas, Texas. This put him in contact with Neiman-Marcus, a company Joe paid careful attention to, learning a lot of the fundamentals. At the time there were many popular quiz shows, one of which was sponsored by Revlon. There was some cheating involved in the show, and it really hurt Revlon.\n\nJoe’s next job was with Playtex covering a bigger area for two to three years. The pressure for greater sales was intense so Joe moved to Yardley of London. This was a great job, including trips to Great Britain and Europe. Yardley’s head executive in London had a daughter who married a businessman in Little Rock. Through this connection, Joe managed to meet him and escorted him on a visit to Little Rock. When Joe took him to the airport the man asked, “Is there anything I can do for you?” Joe asked him for a job in London.\n\nUnfortunately, the British did not look kindly on giving their jobs to foreigners. However after some consideration, it was worked out that Joe would come over as a consultant, for which Joe admits he was not qualified. The British stint included trips to Paris, Belgium, and a several-week-long trip in 1970 to Russia. He returned to the U.S., continuing to work for Yardley, until they closed their U.S. operations. Prior to this, Yardley had a practice of rewarding employees with a Cadillac. Joe got one.\n\nJoe was an early Hi-Fi buff and had naturally heard of Paul Wilbur Klipsch. Joe built his own speakers but is quick to say that they were nothing compared to what PWK was doing. In early 1955, he drove from Shreveport to Hope on the off chance that he might meet Paul. He was amazed that PWK invited him in, and later took him to lunch.\n\nPaul was “easy to meet, easy to talk to, and easy to get along with, just a great guy. I could sense that he was going to be a fun guy because I never knew what he was going to do or say.”\n\nWhen Paul discovered that Joe had his drums in the car, he asked Joe to play them in a live versus recorded scenario during their first encounter. PWK said he wanted to play some records and asked Joe to bring his drums inside. He pointed a speaker right at Joe. He wanted Joe to play along with his Glen Miller music. Fortunately, Joe had just gotten out of the Army Band and knew all of the arrangements by heart!\n\nJoe played along with the recorded drummer exactly, which fascinated PWK. This exercise was conducted in the hallway of what is now Klipsch’s Hope office building, with Joe not being able to see whether the source materials were records or tapes (dammit). The result was the beginning of a serious dialog on possible collaborations.\n\nShortly after, they were doing a live versus recorded demo for a large audience in an auditorium at Centenary College. Dealers and the public were invited. Curtains hid a speaker on one side and a drum set on the other. Joe would play and then a recording of Joe would be alternated. The audience was asked to identify the live performance. Several more of these demonstrations were staged.\n\nSoon Paul suggested a recording session. On the morning of June 19, 1955, Joe and the short-lived Joe Holland Quartet entered KWKH in Shreveport, Louisiana. At the same time, Elvis Presley was exiting the studio. He and his band recorded all night due to Elvis’ proclivity to put five notes in a four-note bar. The band members were afraid to call him out, so they just kept telling him that they had made a mistake and needed another take. [Do not irritate Elvis!] Elvis’ drummer, D.J. Fontana was a good friend of Joe’s and related the events of the previous night.\n\nThe recording session lasted most of the day, but included no pictures or other documentation – just the music. All songs were recorded straight through without mixing. Playback at the studio was via a pair of Klipsch Rebels as they were small enough to fit in the back of Paul’s airplane. If there were a serious mistake or flaw noted in the initial playback, the whole number would be repeated. Only a few required retakes. Extraneous noises were left in some of the recordings. One noise that was thought to be the drummer’s chair squeaking was actually a pedal. Joe used a Ludwig Speed King, which has also been referred to as a “Squeak King.” Unfortunately, it is not known if any of the band members ever heard their finished product on Klipschorns. [Joe has not, but I plan to remedy that!] Joe had Rebels………………\n\nIn 1957, a second recording session was arranged with a reunited Joe Holland Quartet. Paul explained to Joe that during his demos at frequent dealer visits, many people would request a copy of the material. At the time, the KlipschTape division had just been created with the help of John Eargle. Joe recalls that John represented himself as an A&R man from RCA. As with the earlier recording session in 1955, PWK utilized a Berlant tape recorder and two widely spaced, omnidirectional Stephens microphones. The second session did not seem to impress the band like the first. A “been there, done that” mentality could have been at play.\n\nPWK and Joe remained in contact for many years. Joe knew some generals at Barksdale Air Force base. He arranged to take a General Westmoreland (the “lesser” Westmoreland) up to Hope to visit with PWK. The General was a huge Klipsch fan, so it was somewhat amusing to see his “subservient posture” in Paul’s presence. Joe gave at least another general the same “audience with King Klipsch.” Much later, PWK orchestrated, pun intended, an invitation from Arthur Fiedler for Joe to play with the Boston Pops. Unfortunately, this never materialized due at least in part to the pressure of Joe’s day job.\n\nIn the 1980’s PWK ran into Joe at Cajun’s Wharf in Little Rock. It had been 20 years since they had seen each other but Paul instantly recognized Joe. At 88, Joe lives on the west side of Little Rock, and is still getting paid to play his drums.\n\nphoto: from website klipsch.com"}, {"url": "http://www.ivy50.com/blackHistory/story.aspx?sid=1/3/2009", "page_content": "Joe Holland\n\nHe followed the legend of his All-American father at Cornell University and, along the way, Joe Holland has become something of a legend himself. The interviewer was given the phone numbers for the ex-Cornell football star, the same guy who then graduated from Harvard Law School.\n\n\n\nCould the numbers be right? The home number was in the \"212\" area code - New York City. The work number was in the \"914\" area - in this case, White Plains in Westchester County.\n\n\n\nNow maybe the interviewer was being unfairly biased, but he thought to himself, \"Don't most New York metro lawyers do their days in the hustle and bustle, and then retreat to the burbs at night?\"\n\n\n\nNot Joe Holland.\n\n\n\nDriven by the values instilled in him by his parents, the dominant theme of Joe Holland's life has been giving something back to the community, or as he said with a Biblical reference, \"To whom much is given, much is required.\"\n\n\n\nThe story of Joe Holland begins with his father. Jerome Brud Holland was a football All-American at Cornell in the late 1930s. A March 1970 article about Brud Holland, the only one of 13 children from his family to go to college, stated it simply and sadly. \"Jerome Holland was not offered a job upon graduation; he was not even interviewed. This -- because he was black -- and American industry had no place for the educated black man in 1939.\"\n\n\n\nFaced with the unavoidable obstacle of skin color, Brud Holland chose to further his education with a masters degree from Cornell and a doctorate in sociology from the University of Pennsylvania. He began his working life as an educator, eventually holding the presidencies of two institutions of higher learning -- Delaware State College and Hampton Institute.\n\n\n\nIt was during this time that Brud Holland and his wife, Laura, began to raise a family. Joe was born in 1956, and at age seven he got his first taste of Ithaca, N.Y., attending his father's 25th Reunion. \"I remember going over to the football field and running around,\" Joe recalled. \"So I guess that was when the Big Red seed was first planted,\" he laughed. \"It was really that love of football that I remember from my childhood years. It was an early passion.\"\n\n\n\nHolland showed his talents at the Pop Warner level in Virginia. His mother still likes to tell the story of how Joe, who was the biggest and fastest player in the league, caused other parents to get together and have the rules changed. After his first year in Pop Warner, a 125-pound weight limit was enacted, and Holland no longer could play. The next athletic hurdle came Holland's way when his father became Richard Nixon's choice as U.S. Ambassador to Sweden. Joe was 13 at the time, and for three years he lived in a country where \"football\" was played with the feet. \"They put me out on the soccer field, and I kept wanting to grab the ball with my hands so the best position for me was in the goal,\" said Holland. Needless to say, he wasn't too keen on the European version of football.\n\n\n\nThe Hollands moved back to the States for Joe's junior year at Roosevelt High School in Yonkers, N.Y. Joe missed the coach-mandated preseason camp by one day, and that meant he could not start any games during his junior year. The rule may have not been too smart, but the coaching staff soon realized that getting Joe into games was. Holland played everywhere both sides of the ball -- as a junior and was dubbed the \"super sub.\"\n\n\n\nNo substitute role as a senior, however, and Joe wound up averaging more than 200 yards a game as a running back. He earned the attention of some of the top college football programs in the country -- Ohio State, Notre Dame, Penn State and Michigan. His choice came down to Michigan and Cornell, and he chose to take the athletic scholarship to Michigan.\n\n\n\n\"I have to say that I had visions of the Rose Bowl dancing in my head, but after a year there I was ready to come home,\" said Holland. \"I was the only ballplayer on the team from New York at the most competitive position -- running back. I found myself getting lost in the crowd because I was a good player, but I wasnt head-over-heels so talented that I stood out in a crowd.\"\n\n\n\n\"Coming home\" in this case meant transferring at Cornell. Because of NCAA rules, Holland had to sit out as a sophomore. A torn hamstring muscle hampered his junior season, and as a senior he was the blocking back in head coach Bob Blackman's I-formation offense. The Ivy League had a rule at the time that said a student could get an extra year of athletic eligibility while enrolled in graduate school. Holland took advantage, and the fall of 1978 became his year to shine.\n\n\n\nHe finished the year with 1,213 yards in the seven Ivy games, still the fourth-highest single-season rushing total in Ivy League history. Two games, in particular, stood out. Against Harvard, a game played in a driving rainstorm, Holland set what is still the Ivy League record for rushing attempts in a game with 55.\n\n\n\n\"I guess I wasn't aware just how much I had carried the ball. About the middle of the third quarter, my legs started cramping up,\" remembered Holland, \"and that had never happened before. I can remember after the game, [Cornell won, 25-20, on Holland's game-winning touchdown run, his fourth of the day to go with 244 yards rushing] on the bus ride back, my muscles stiffening up. And by the time we got back to Ithaca, I had to have some guys literally help me from the bus.\"\n\n\n\nThe Harvard game was the fourth of the year, and Holland's \"dream season\" came to a close with a 263-yard performance against Pennsylvania in the finale. \"My parents had been so supportive through all the low times,\" said Holland. \"They came to all the games when we were losing. The fact that we were able to turn it around and have a winning season ... it was really special.\"\n\n\n\nHolland earned third-team All-America honors from the Associated Press after he finished second in the country in rushing and scoring to Oklahoma's Billy Sims, the Heisman Trophy winner that year. He also was named Academic All-America for the second straight year.\n\n\n\nFootball was not quite finished for Holland after that big day against Penn. He played in the Japan Bowl senior all-star game and got some interest from professional teams. But the teams did not want to waste a draft pick because they knew that Holland had been accepted at Harvard Law School the previous year. Harvard allowed him to defer a year, but that wasn't going to happen again. Holland decided to forego the free agent offers and headed off to Harvard.\n\n\n\nFollowing Harvard, Holland had plenty of opportunities to \"go for the big money\" as he put it, but there was something else at work in his head. \"Growing up in the South during the 1960s -- Virginia was not right in the heart of the Civil Rights movement -- but I was exposed to the issues of the movement,\" Holland said.\" When I was making the decision about how I wanted to start my career, I wanted to make my life count for something important. As God has blessed me, I wanted to reach out and bless others.\"\n\n\n\nSo while many of his peers went off to large corporate firms, Holland moved to Harlem and opened up his own law practice. \"My motivation in going was to make a difference. There were some pressing needs that I wanted to try and meet. I decided the best way to meet those was to develop some initiatives that were responsive.\"\n\n\n\nHe established his law practice, but then he also founded a homeless shelter. Holland was quick to point out that his philosophy was not simply housing, but \"holistic housing\" housing not as an end, but as a means to restore the whole person. His HARKHOMES project continues to aid the homeless. Connected with that, he established the BETH-HARK Crisis Center for addicts and ex-offenders.\n\n\n\nHolland also created some small businesses to create employment opportunities for the community as well. Among those businesses is a Ben and Jerrys Ice Cream Store, which was featured in the Sept. 14, 1992, issue of People Magazine.\n\n\n\nThe Cornell Cooperative Extension-Harlem Literacy Project arose out of Holland's involvement as a trustee of the university. Cornell students come to Harlem in the summer to provide literacy training.\n\n\n\nAbout a year ago, Holland was approached by a not-for-profit agency to help in the production of a video series. It is a series of 10 lectures based on the practical life skills curriculum he developed at HARKHOMES to help individuals, as he says, \"move from a life of crisis to a life of self-sufficiency.\" He calls the curriculum, \"Holistic Hardware.\"\n\n\n\nIf all that werent enough, Holland was appointed by New York Governor George Pataki to serve as State Housing Commissioner in 1995 and 96. \"I came into it at a time when there was a budget deficit in New York,\" Holland said. \"The mandate that the Governor gave us was to downsize. We worked through those challenges and were able to come up with some new initiatives that ensured affordable housing was out there.\"\n\n\n\nHis political career, which meant a great deal of time away from home, was pleasantly short-circuited by his marriage in 1995 to Alisa Holland, and, later, the birth of the couples daughter, Shelby. They continue to live in Harlem, and Holland does not event mention the possibility of leaving.\n\n\n\nHolland also gets a lot of enjoyment out of his being a playwright. \"Homegrown,\" a play that he wrote based on his experiences with HARKHOMES, ran for 14 weeks in 1992 at the National Black Theater in Harlem.\n\n\n\nAnd, he is one of only three Ivy Leaguers -- Princeton's Bill Bradley and Cornell's Ellen Mayer Sabik are the others -- named to the GTE/CoSIDA Academic All-America Hall of Fame, and he remains an active member of their Speakers Bureau. This story will not end on a self-serving note, especially given the subject himself, but Holland had this to say about the Ivy League. \"I see it as the best of both worlds as far as athletics and academics. I never made it to the Rose Bowl, but I've gotten so much in return.\" — Chuck Yrigoyen\n\n\n\n"}, {"url": "https://www.prnewswire.com/news-releases/joe-holland-to-become-ceo-of-teachers-pay-teachers-adam-freed-to-lead-companys-board-300701470.html", "page_content": "NEW YORK, Aug. 23, 2018 /PRNewswire/ --Teachers Pay Teachers (TpT), the site that more than 70% of U.S., Canadian, and Australian teachers turn to for their educational needs, today announced that Joe Holland, TpT's current President and COO, will take over as TpT's new CEO from Adam Freed. Freed, who has led TpT since 2014, will take on the new position of Executive Chair, both leading the board of directors and doing long range, special projects with TpT and TpT's millions-strong community of educators.\n\nThis leadership change allows TpT to maintain continuity as TpT expands its offerings, making educator-created resources available to an ever-broader audience. As CEO, Holland will combine strategic and operational leadership of TpT, and will also join the board. Holland, a digital business veteran, has served as TpT's President since he joined TpT in 2014.\n\n\"I am thrilled for the next phase of TpT's growth under Joe's leadership,\" said Freed. \"Joe has played a critical role in helping TpT become the world's most popular online destination for resources that help educators support every student with every need. I am confident that Joe is the best person to build on this momentum as we start to sell directly to schools. He is a brilliant strategist, a trusted leader, and deeply committed to our mission.\"\n\n\"This is an incredible time to be at TpT,\" said Holland. \"I am excited to work with this amazing team, to continue to partner with Adam, and to continue to empower educators to teach at their best. I look forward to serving our educators and students more deeply in the years to come.\"\n\nTpT has thrived under Freed and Holland's leadership to date. \"More than 1 billion resources have been downloaded by teachers, administrators, and parents,\" said Freed. \"I am incredibly proud of everything our team has accomplished. We have grown our company from a handful of dedicated folks to a thriving company of more than 100, serving a community of 5 million educators worldwide. I look forward to continuing working with and for our inspiring community of educators and authors to elevate their powerful work.\"\n\nBefore joining TpT, Holland worked for over four years as the CFO and EVP of Strategy at WeddingWire. While there, he helped WeddingWire grow from a small start-up to company of over 300 employees, and oversaw numerous strategic partnerships and acquisitions. Prior to that, he was the VP of Finance and Strategy at Martha Stewart. At TpT, Holland has been instrumental in helping TpT build a platform that provides educators with access to over 3 million paid and free resources. \"TpT will continue on our journey to make high quality, teacher-tested resources available to teachers, administrators, students, and parents around the world,\" Holland said.\n\nABOUT TEACHERS PAY TEACHERS\n\nTeachers Pay Teachers (TpT) is the world's most popular online marketplace where teachers buy and sell original educational resources. With a broad range of materials for every aspect of Pre-K–12 education, TpT is the go-to place for educators to find the resources, support and inspiration they need to teach at their best and meet the evolving needs of the classroom. The site offers more than 3 million free and paid resources, created by educators who understand what works in the classroom. Find out more at www.TeachersPayTeachers.com\n\nSOURCE Teachers Pay Teachers\n\nRelated Links\n\nhttps://www.teacherspayteachers.com\n\n"}, {"url": "https://www.celebsagewiki.com/joe-holland-footballer", "page_content": "Age, Biography and Wiki\n\nJoe Holland was born on 21 April, 1993 in Birmingham. Discover Joe Holland's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 30 years old?\n\nPopular As N/A Occupation N/A Age 30 years old Zodiac Sign Taurus Born 21 April 1993 Birthday 21 April Birthplace Birmingham Nationality Birmingham\n\nWe recommend you to check the complete list of Famous People born on 21 April. He is a member of famous with the age 30 years old group.\n\nJoe Holland Height, Weight & Measurements\n\nAt 30 years old, Joe Holland height is 1.78 m and Weight 77 kg.\n\nPhysical Status Height 1.78 m Weight 77 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nJoe Holland Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Joe Holland worth at the age of 30 years old? Joe Holland’s income source is mostly from being a successful . He is from Birmingham. We have estimated Joe Holland's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nJoe Holland Social Network\n\nInstagram Linkedin Twitter Joe Holland Twitter Facebook Wikipedia Joe Holland Wikipedia Imdb\n\nTimeline"}, {"url": "https://spirituality-sustainability.net/profiles/joe-holland", "page_content": "AN ECO-SOCIAL PHILOSOPHER & CATHOLIC THEOLOGIAN, Joe explores the intertwined ecological, societal, and spiritual breakdowns of Modern Western Industrial-Colonial Civilization and the need for a Global Ecological-Spiritual Renaissance. That Renaissance, he argues, needs to promote a Postmodern Global Ecological-Humanistic Civilization and a Postmodern Global Ecological-Mystical Spirituality.\n\nJoe holds a Ph.D. from the University of Chicago in the field of Ethics & Society, which was structured as an interdisciplinary dialogue among Theology, Philosophy, and Social Science. At Chicago, he studied Theology with David Tracy, Philosophy with Paul Ricoeur, and Social Science with Gibson Winter. He was also a Fulbright Scholar in Sociology at the Universidad Católica in Santiago, Chile during the last year of the democratic-socialist presidency of Salvador Allende, which was violently overthrown by the brutal military dictatorship of General Augusto Pinochet in collaboration with military and intelligence agencies of the United States Government.\n\nJoe is Professor Emeritus of Philosophy & Religion at Saint Thomas University in Miami Gardens, Florida, where he taught for 25 years, and he is a still-active Adjunct Professor in its School of Law. In addition, he is Permanent Visiting Professor at the Universidad Nacional del Altiplano in Puno, Peru; President of Pax Romana / Catholic Movement for Intellectual & Cultural Affairs USA and Editor of its Pacem in Terris Press, with both based in Washington DC; Vice-Chair of Catholic Scholars for Worker Justice, based in Boston, Massachusetts; a founding board member of the Spirituality & Sustainability Global Network, based in Virginia; and a member of the International Association for Catholic Social Thought, based at the Catholic University of Leuven in Belgium.\n\nEarlier, Joe served for 15 years as Research Associate at the Washington DC Center of Concern, created jointly by the international Jesuits and the United States Conference of Catholic Bishops to work with the United Nations on major global issues. Later, he taught at New York Theological Seminary in New York City, Drew University School of Theology in Madison, New Jersey, and the Florida Center for Theological Studies in Miami, Florida. Also, he has served as Pax Romana's NGO representative to the Economic and Social Council of the United Nations at its international headquarters in New York City.\n\nIn addition, Joe served as Research Coordinator for the 1976 Theology in the Americas Conference. He also founded the American Catholic Lay Network and served as founding executive director of the Pallottine Institute for Lay Leadership & Research at Seton Hall University. In addition, he co-founded the National Conference on Religion & Labor, co-sponsored by the AFL-CIO, and Catholic Scholars for Worker Justice.\n\nJoe has published 19 books and many articles. His book with Peter Henriot SJ, Social Analysis: Linking Faith and Justice, has approximately 100,000 copies in print, including 2 US editions, 5 foreign-language editions and 2 foreign English editions. He was also ghost-writer for the 1975 document This Land is Home to Me: A Pastoral Letter on Powerlessness in Appalachia by the Catholic Bishops of the Region, and for the 1995 20th anniversary sequel document from the Catholic Bishops of Appalachia At Home in the Web of Life: A Pastoral Message on Sustainable Communities (with lots of help for both from visionary figures in the Catholic Committee for Appalachia). Two of his recent books are Postmodern Ecological Spirituality and Roman Catholic Clericalism. Two books on which he is presently working are titled The Ecological Failure of Modern Philosophy and Deep Reform of Catholic Christianity.\n\nIn the United States, Joe has lectured at Georgetown, Harvard, Notre Dame, Princeton, and other universities. Internationally, he has lectured at Institut Catholique in Paris, France; Sophia University in Tokyo, Japan; the Pontifical Catholic University in São Paulo, Brazil; the Pontifical Catholic University in Porto Alegre, Brazil; the Universidad Mayor de San Andres in La Paz, Bolivia; and the Universidad Nacional del Altiplano in Puno, Peru.\n\nIn 1986, Joe received the Boston Paulist Center's Isaac Hecker Award for Social Justice; in 2002, the Athena Medal of Excellence from the Universidad Nacional del Altiplano in Peru; in 2012 the Premio Federico II per La Pace in Milan, Italy; in 2013, the Irish Echo's Labor Award for contribution to the US labor movement; and in 2021 the first annual Thomas Berry Award from the Thomas Berry Institute for Ecumenical Dialogue at Iona College in New Rochelle, New York.\n\nJoe is married to Francisca \"Paquita\" Biascoechea-Martinez Holland, a native of Puerto Rico, and they have two grown children and four young grandchildren. His and Paquita's too infrequent hobby is sailing, especially in the beautiful green waters of the Caribbean Sea.\n\nwww.joe-holland.net | office@joe-holland.net"}, {"url": "https://prabook.com/web/joe.holland/2214431", "page_content": "captain\n\nJoe Holland is an American football linebacker who is currently a free agent.\n\nEducation\n\nHolland attended Bishop Chatard High School in Indianapolis, where he played football, basketball, and ran track. As a senior, Holland was named all-state, Indianapolis City Player of the Year and All-North Football Player of the Year after rushing for 2,048 yards on 239 carries and 35 touchdowns and added nine receptions for 153 yards (170 average) and one touchdown. He also returned nine punts for 137 yards (152 average) and returned three kickoffs for 124 yards (413 average) and one touchdown.\n\n\n\nHe led his team to Class 3A state championship.\n\n\n\nHis junior year he totaled 2,257 rushing yards on 331 carries (68 average) and 32 touchdowns with 19 receptions for 239 yards (159 average). As a sophomore he rushed for 961 yards on 144 carries (67 average) and 11 touchdowns.\n\n\n\nHe set the school record for career rushing yards with 5,270 yards. He was named the 2007 city athlete of the year.\n\n\n\nHolland played college football at Purdue University from 2007 to 2011.\n\n\n\nAfter redshirting his first year, Holland moved from safety to outside linebacker during training camp in 2008.\n\n\n\nHe started at outside linebacker for the Boilermakers in 48 of the possible 49 games amassing 324 tackles (14th in school history) and 23.5 tackles for a loss for his career. Also excelling in the classroom, Holland was a two time Academic All American and in 2011 was one of eighteen players in the nation chose as a National Football Foundation Scholar Athlete. He was a captain of the 2011 team"}]}