{"Joe Holland attended Archbishop Mitty High School in San Jose, California.": [{"url": "https://www.mercurynews.com/2020/06/05/san-jose-private-school-alumni-speak-out-about-the-racism-they-say-they-faced/", "page_content": "With racial justice at the forefront of conversations across the nation, alumni of some of San Jose’s most acclaimed private schools have joined the chorus of voices to describe cultures of racism and discrimination they say administrators did little to quash.\n\nBy Friday morning, hundreds of current and former Archbishop Mitty High School students had taken to Twitter to share their stories using the hashtag #ExposeMitty. The students’ stories ran the gamut — from teachers using the “n” word to minority students facing significantly harsher punishments than their white peers to a lack of recourse for those who endured racism and discrimination.\n\nAlumni said the social media movement was sparked by a former student who experienced racism during his time at Mitty and felt school administrators did not act promptly enough to denounce the death of George Floyd — a black man who was killed at the hands of white police officers last week in Minneapolis. The students are working to compile the list of stories, send it to school administrators and demand changes, which they are still developing.\n\nErica Johnson, a 2017 graduate who went on to attend the University of Southern California, tweeted that during her junior year at Mitty, she caught wind of a video posted on Snapchat by another student of her and her friends with the caption “I feel like I’m back in the hood.”\n\nMitty is a high-performing Catholic high school on the west side of San Jose with an annual tuition of about $23,000. As one of only a few black students at the school, Johnson found the video racist and brought it to the attention of administrators.\n\n“What amazes me the most is that we are a Catholic school with the motto along the lines that we are all created in the image and likeness of God…I personally no longer feel safe in a place that is supposed to be one of the safest for a child,” she wrote in an email to Dean of Students Jim Fallis and Principal Kate Caputo in August 2015.\n\nCaputo responded at the time that she was “eager to hear from all sides to better understand how this situation came to fruition.”\n\nAccording to Johnson, however, after she posted the email exchange on Twitter, she was “shamed into apologizing to administrators.”\n\n“I, myself, the victim of racism should have been coddled and supported by the administrators and, instead, I was gaslighted and felt like I did something wrong,” Johnson said in an interview.\n\nA black student who graduated in 2011 and played on the school’s basketball and football teams said in an interview that one of his history teachers required him to defend the merits of slavery. “As the only black kid in that class, it was humiliating,” he said.\n\n“Mitty’s culture is focused on revenue generation and, as a result, the children of large donors walk around with impunity while minority children on scholarship are supposed to pick up trash to give back to the community,” he said.\n\nFallis, Caputo and Mitty President Tim Brosnan did not return multiple requests for comment from this news organization. But in an email to alumni on Thursday, the administrators said they “did not talk about race as we should have in the past, and this has been detrimental to not only our students of color but the wider Mitty community.”\n\n“Although we recognize that discussions surrounding race are difficult, delicate, and often polarizing, we are committed to such discussions to ensure that racism will not be tolerated at Archbishop Mitty,” the email said.\n\nAlumni at Mitty aren’t the only ones demanding changes in San Jose private schools in the wake of Floyd’s death and resounding calls for racial justice.\n\nOgechi Ajawara, a black alumna of Notre Dame San Jose, spoke out on Facebook earlier this week about the racism she said she was subjected to in high school, including a college counselor who discouraged her from writing about it out of fear it would make the school look bad.\n\n“The administration is filled with weak and racist people who call all the POC students together whenever they need a photo for the school’s website. They only care about the image of the school, and that has been directly communicated to me for a long time,” she wrote in the post that has since received more than 600 comments and 400 likes.\n\nIn a statement on its Facebook page later that day, Notre Dame addressed the Floyd killing for the first time since his death. “We call on all of us in the US to work with a great sense of urgency to eliminate systemic poverty and racism that is a part of our culture,” the school wrote in a social media post.\n\nBut in an interview Friday, Notre Dame Principal Mary Beth Riley said it has become “very clear” to her and her colleagues that their response “was not adequate.”\n\nIn response to concerns raised by Ajawara and other alumni, Riley said the school will form a task force on race, equity and inclusion, start providing training for teachers and faculty on issues of inequality and make a donation to the Movement for Black Lives.\n\nMore than 500 alumni at Valley Christian Schools also banded together this week to write a list of 21 demands for the school system to make it more equitable. The demands include hiring more faculty members of color, implementing anti-bias and anti-aggression training for school personnel and strictly enforcing a zero-tolerance policy to racism and microaggressions.\n\n“As alumni, we look back on our VCS experience and recognize that some VCS administrative policies and practices failed to acknowledge and care for the specific needs of Black students and failed to teach non-Black students how to love and respect their Black brothers and sisters,” they wrote in a letter to the school.\n\nAdministrators at Valley Christian Schools could not immediately be reached for comment Friday.\n\nThe movement organized by a former Mitty student on Twitter on Wednesday started with a call to his peers to “share their stories of racism” at the school using the hashtag #ExposeMitty. But as the term picked up on social media, alumni began speaking out about other discrimination they say they experienced during their time at the school, including for their gender, sexual orientation and mental health.\n\n“I know in my tweet above I created the hashtag as a way to address racism. However, after reading through the responses, I want this to be a platform for anyone to express any bad experiences or trauma they’ve had at Mitty. You are all owed more than an apology,” the organizer wrote on Twitter.\n\nAndrea Vo, a 2011 Mitty graduate who is now an openly proud transgender woman, said she was “targeted as one of the most flamboyant and openly queer students at school by administrators” during her time at Mitty.\n\nBefore the senior prom, Vo said that when Fallis learned she intended to wear makeup and a dress, he pulled her out of class and told her she would be prohibited from entering the dance in a dress and would face detention for a dress code violation if she did.\n\n“As a young person discovering her trans identity, I felt ashamed and embarrassed,” Vo said."}, {"url": "https://www.privateschoolreview.com/archbishop-mitty-high-school-profile", "page_content": "Email:\n\nName of parent:\n\nStudent first name:\n\nStudent last name:\n\nStudent date of birth: Month January February March April May June July August September October November December Year 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023\n\nStudent is: Male Female\n\nCurrently in grade: Nursery Pre-K Gr.K 1 2 3 4 5 6 7 8 9 10 11 12\n\nSeeking entry for grade: Nursery Pre-K Gr.K 1 2 3 4 5 6 7 8 9 10 11 12\n\nTarget start date: Fall Spring Summer Immediately 2023 2024 2025 2026 2027 2028\n\nPlease briefly describe academic, athletic, and extracurricular interests of the student:\n\nHome address:\n\nCity:\n\nCountry: Afghanistan Albania Algeria Antigua and Barbuda Argentina Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belgium Belize Bermuda Bolivia Bosnia-Herzegowina Botswana Brazil Brunei Darussalam Bulgaria Burma Cameroon Canada Cayman Islands Chile China Colombia Costa Rica Croatia Cyprus Czech Republic Czechia Denmark Dominican Republic Ecuador Egypt El Salvador England Estonia Ethiopia Finland France Germany Ghana Greece Guam Guatemala Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kuwait Kyrgyzstan Latvia Lebanon Liechtenstein Lithuania Luxembourg Macau Macedonia Malaysia Maldives Malta Mauritius Mexico Monaco Mongolia Morocco Namibia Nepal Netherlands New Zealand Nicaragua Niger Nigeria Norway Oman Pakistan Panama Papau New Guinea Paraguay Peru Philippines Poland Portugal Puerto Rico Qatar Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa South Korea Spain Sri Lanka Sweden Switzerland Taiwan Tanzania Thailand Trinidad & Tobago Turkey Uganda Ukraine United Arab Emirates United Kingdom United States of America Uruguay Venezuela Vietnam Zambia Zimbabwe\n\nState: Select State Alaska Alabama Arkansas Arizona American Samoa California Colorado Connecticut DC, Washington Delaware Florida Federated States of Micronesia Georgia Guam Hawaii Iowa Idaho Illinois Indiana Kansas Kentucky Louisiana Massachusetts Maryland Maine Marshall Islands Michigan Minnesota Missouri Mississippi Montana North Carolina North Dakota Nebraska New Hampshire New Jersey New Mexico Nevada New York Northern Mariana Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Palau Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Virgin Islands Washington Wisconsin West Virginia Wyoming\n\nZip: (enter \"N/A\" if not applicable)\n\nPhone:\n\nAllow nearby private schools to send me information. Share your information with nearby schools on our site and let them send you brochures.\n\nSave this data and create your user profile. Create your own user account so you don't have to re-type your user data each time you request information. You'll also be able to track your information requests, get reminded of application dates, and more!\n\nUsername: Password:"}, {"url": "https://stanforddaily.com/2020/07/18/under-fire-for-instances-of-racism-two-bay-area-catholic-high-schools-implement-changes-to-address-institutional-racial-injustice/", "page_content": "“It’s kinda sad that it took so long for something to happen… but I’m glad change is happening,” said Julian Shearin-Sewell, a rising junior at Archbishop Mitty High School in San Jose.\n\nAs the Black Lives Matter movement has sparked a reckoning for schools, businesses and institutions across the nation, the Bay Area Catholic community has had to make necessary changes to address racial injustice as well.\n\nArchbishop Mitty and another prominent Bay Area Catholic high school, Saint Francis High School in Mountain View, have recently come under scrutiny for continued instances of racism within the student body, prompting a response from students and the administration. At Archbishop Mitty, former students have taken to Twitter to call out racial discrimination from faculty and students under the hashtag “#exposemitty.” There have also been instances of racial injustice at Saint Francis, most notably when a group of alumni were linked to a racist Instagram post mocking George Floyd.\n\nShearin-Sewell spoke about the challenges he has experienced as a Black student at the predominantly Asian and white Archbishop Mitty.\n\n“It seems like there’s more eyes on you,” he told The Daily. “You’re expected to uphold the standard. Even if that standard isn’t who you are, you’re expected to maintain that at all times, rather [than] just be yourself.”\n\nPaige Ashton, who just graduated from Archbishop Mitty High School, said that she felt that same pressure at times.\n\n“I felt the pressure of having to be the perfect Black person so I represented everyone else who looked like that,” she said. “Well, even though I shouldn’t have to carry that burden, nor am I expected to, it was one that I felt I had to.”\n\nThe administration at Saint Francis High School responded to this incident and other feedback from students and alumni with a Twitter post and statement on their website. This initial response from Saint Francis focused on organizing community events to address racism and discrimination. In an updated statement, the administration issued curriculum changes, school policy revisions and efforts to hire more diverse employees.\n\nThe school plans to implement an anti-bias curriculum, an ethnic studies graduation requirement and course offerings on social justice. School policy was revised to emphasize improving students’ behavior and reducing excessive punishment. Lastly, per the administration’s statement, Saint Francis will “enact hiring practices that will ultimately lead to the school’s educators reflecting the demographics of the Diocese of San Jose” through making new hiring guidelines.\n\nLiam Tierney, a rising junior at Saint Francis high school, believes that these changes are a step in the right direction. He said, “I feel like it’s like it’s good. Any change in that direction is good.”\n\nHowever, Tierney recognizes the limitations of the school’s actions, pointing out that not all students will respond positively to change.\n\n“I feel like the people the school is trying to reach with [these measures] already have these views kind of set in their minds, so they’re going to work to defend them,” Tierney said. “They’re not going to work to listen and learn because they don’t want to.”\n\nLike Saint Francis, Archbishop Mitty high school posted a list of changes in an official statement on Twitter, including improving lines of communication between administration and the Archbishop Mitty community; better educating faculty, students and teachers on racism; and implementing more ways to look for more diverse staff.\n\nThe school also announced the creation of a subcommittee to select a diversity consultant for the school. To improve lines of communication between students and administrators, Mitty appointed Principal Kate Caputo as a liaison between the Archbishop Mitty community and the administration for race issues, and introduced programs to enhance administrative support for students of color, including implementing biannual listening sessions between students of color and the administration, and providing the Outreach program additional opportunities for discussions surrounding race.\n\nIn order to provide more complete education on racism, the administration added more staff development on how to support students of color; the Parent Education series investigated more resources to discuss race issues with students, and looked for ways to focus curriculum on the causes of injustice. Lastly, Mitty expanded resources to look to hire more diverse faculty and staff.\n\n“The administration will expand existing resources to seek greater diversity in applicant pools for faculty and staff hiring,” the Archbishop Mitty administration wrote in their official statement.\n\nKaitlyn Springs, a rising senior, is cautiously optimistic about the appointment of Caputo as the point of contact at Mitty for issues about race. Springs said that she is “unsure about the direction [this appointment] will actually go.”\n\nAshton, who graduated from Mitty last year, praised Caputo’s initiative, but also pointed out that “[Caputo] personally hasn’t been affected or directly discriminated against” and added that she would prefer if the school hired a liaison who was not previously associated with the school, for a less biased stance.\n\nSprings believes that Mitty’s lack of diversity within the administration also poses potential problems for hiring new staff and attracting diverse applicants.\n\n“What [Mitty’s] administration projects is not a big diverse face from the administration side… I don’t think many diverse faces will be drawn in,” Springs said.\n\nShearin-Sewell echoed Springs’s sentiment when it comes to prospective students, adding that “based on the things [the students] heard before, even after being accepted, they don’t want to come,” he said.\n\nAt Stanford, the Catholic community has also implemented changes to address racial justice on campus. Education is one such change. Fifth year Ph.D. candidate Katie Wullert M.A. ’17, who served as Vice President of the Catholic Community at Stanford ([email protected]), described some of this programming in an email to The Daily.\n\n[email protected] graduate leadership “is currently working on a presentation and discussion examining racism in the church that is the kick off to a book club that will continue the conversation,” Wullert said.\n\nAnother main element of change is direct service. Lourdes Alonso, the campus minister and advisor for student organizations at Stanford, announced plans for greater engagement with communities of color in East Palo Alto.\n\n“[W]e partnered with the Francis of Assisi in East Palo Alto, and we’re working with their pastor right now to set up some programming with the kids in the community,” Alonso said.\n\nAlonso also emphasized the importance of seeing the service as accompaniment in order to truly make progress. She added, “We’re going to open ourselves to growth. We’re going to make ourselves vulnerable to change into thinking differently. And then allowing — I’m Brown, by the way — our Black and Brown brothers and sisters to share with us ways that we could work for systemic changes. So then, then that’s another piece is like, what in a system needs to change?”\n\nStudents at Bay Area Catholic high schools generally saw these changes as steps in the right direction. There was, however, one change that students unanimously called for: implementing stricter and more clear-cut policies against racism.\n\nA new Supreme Court ruling on July 8 may threaten this progress not only within the Bay Area Catholic community but also within the Catholic community at large. The ruling declared that Catholic schools could discriminate against ministerial employees — those who carry out some sort of religious duty, whether it be a priest or religion teacher — based on race, age, sexual orientation, gender identity and other factors.\n\nAlonso believes that the Supreme Court ruling could mean only upholding certain parts of Catholic teaching and not supporting other aspects.\n\n“We shouldn’t discriminate on very specific parts of people’s lives,” Alonso said. “And I think that’s not what [the Catholic] teaching says. Our teaching says to love one another.”\n\nContact Louis Chavey at louis ‘at’ chavey.org."}, {"url": "https://www.wikiwand.com/en/Mitty_High_School", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Mitty High School?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.schooldigger.com/go/CA/schools/9999953588/school.aspx", "page_content": "Student/Teacher Ratio Archbishop Mitty High School\n\nYear # Students Full-time Teachers Student/Teacher ratio % Free/Discounted Lunch 2018 1752 109.5 16.0 n/a 2020 1768 107.8 16.4 n/a\n\nData source: National Center for Education Statistics, U.S. Dept of Education.\n\nAbout Student-Teacher Ratio"}, {"url": "https://stanforddaily.com/2020/07/18/under-fire-for-instances-of-racism-two-bay-area-catholic-high-schools-implement-changes-to-address-institutional-racial-injustice/", "page_content": "“It’s kinda sad that it took so long for something to happen… but I’m glad change is happening,” said Julian Shearin-Sewell, a rising junior at Archbishop Mitty High School in San Jose.\n\nAs the Black Lives Matter movement has sparked a reckoning for schools, businesses and institutions across the nation, the Bay Area Catholic community has had to make necessary changes to address racial injustice as well.\n\nArchbishop Mitty and another prominent Bay Area Catholic high school, Saint Francis High School in Mountain View, have recently come under scrutiny for continued instances of racism within the student body, prompting a response from students and the administration. At Archbishop Mitty, former students have taken to Twitter to call out racial discrimination from faculty and students under the hashtag “#exposemitty.” There have also been instances of racial injustice at Saint Francis, most notably when a group of alumni were linked to a racist Instagram post mocking George Floyd.\n\nShearin-Sewell spoke about the challenges he has experienced as a Black student at the predominantly Asian and white Archbishop Mitty.\n\n“It seems like there’s more eyes on you,” he told The Daily. “You’re expected to uphold the standard. Even if that standard isn’t who you are, you’re expected to maintain that at all times, rather [than] just be yourself.”\n\nPaige Ashton, who just graduated from Archbishop Mitty High School, said that she felt that same pressure at times.\n\n“I felt the pressure of having to be the perfect Black person so I represented everyone else who looked like that,” she said. “Well, even though I shouldn’t have to carry that burden, nor am I expected to, it was one that I felt I had to.”\n\nThe administration at Saint Francis High School responded to this incident and other feedback from students and alumni with a Twitter post and statement on their website. This initial response from Saint Francis focused on organizing community events to address racism and discrimination. In an updated statement, the administration issued curriculum changes, school policy revisions and efforts to hire more diverse employees.\n\nThe school plans to implement an anti-bias curriculum, an ethnic studies graduation requirement and course offerings on social justice. School policy was revised to emphasize improving students’ behavior and reducing excessive punishment. Lastly, per the administration’s statement, Saint Francis will “enact hiring practices that will ultimately lead to the school’s educators reflecting the demographics of the Diocese of San Jose” through making new hiring guidelines.\n\nLiam Tierney, a rising junior at Saint Francis high school, believes that these changes are a step in the right direction. He said, “I feel like it’s like it’s good. Any change in that direction is good.”\n\nHowever, Tierney recognizes the limitations of the school’s actions, pointing out that not all students will respond positively to change.\n\n“I feel like the people the school is trying to reach with [these measures] already have these views kind of set in their minds, so they’re going to work to defend them,” Tierney said. “They’re not going to work to listen and learn because they don’t want to.”\n\nLike Saint Francis, Archbishop Mitty high school posted a list of changes in an official statement on Twitter, including improving lines of communication between administration and the Archbishop Mitty community; better educating faculty, students and teachers on racism; and implementing more ways to look for more diverse staff.\n\nThe school also announced the creation of a subcommittee to select a diversity consultant for the school. To improve lines of communication between students and administrators, Mitty appointed Principal Kate Caputo as a liaison between the Archbishop Mitty community and the administration for race issues, and introduced programs to enhance administrative support for students of color, including implementing biannual listening sessions between students of color and the administration, and providing the Outreach program additional opportunities for discussions surrounding race.\n\nIn order to provide more complete education on racism, the administration added more staff development on how to support students of color; the Parent Education series investigated more resources to discuss race issues with students, and looked for ways to focus curriculum on the causes of injustice. Lastly, Mitty expanded resources to look to hire more diverse faculty and staff.\n\n“The administration will expand existing resources to seek greater diversity in applicant pools for faculty and staff hiring,” the Archbishop Mitty administration wrote in their official statement.\n\nKaitlyn Springs, a rising senior, is cautiously optimistic about the appointment of Caputo as the point of contact at Mitty for issues about race. Springs said that she is “unsure about the direction [this appointment] will actually go.”\n\nAshton, who graduated from Mitty last year, praised Caputo’s initiative, but also pointed out that “[Caputo] personally hasn’t been affected or directly discriminated against” and added that she would prefer if the school hired a liaison who was not previously associated with the school, for a less biased stance.\n\nSprings believes that Mitty’s lack of diversity within the administration also poses potential problems for hiring new staff and attracting diverse applicants.\n\n“What [Mitty’s] administration projects is not a big diverse face from the administration side… I don’t think many diverse faces will be drawn in,” Springs said.\n\nShearin-Sewell echoed Springs’s sentiment when it comes to prospective students, adding that “based on the things [the students] heard before, even after being accepted, they don’t want to come,” he said.\n\nAt Stanford, the Catholic community has also implemented changes to address racial justice on campus. Education is one such change. Fifth year Ph.D. candidate Katie Wullert M.A. ’17, who served as Vice President of the Catholic Community at Stanford ([email protected]), described some of this programming in an email to The Daily.\n\n[email protected] graduate leadership “is currently working on a presentation and discussion examining racism in the church that is the kick off to a book club that will continue the conversation,” Wullert said.\n\nAnother main element of change is direct service. Lourdes Alonso, the campus minister and advisor for student organizations at Stanford, announced plans for greater engagement with communities of color in East Palo Alto.\n\n“[W]e partnered with the Francis of Assisi in East Palo Alto, and we’re working with their pastor right now to set up some programming with the kids in the community,” Alonso said.\n\nAlonso also emphasized the importance of seeing the service as accompaniment in order to truly make progress. She added, “We’re going to open ourselves to growth. We’re going to make ourselves vulnerable to change into thinking differently. And then allowing — I’m Brown, by the way — our Black and Brown brothers and sisters to share with us ways that we could work for systemic changes. So then, then that’s another piece is like, what in a system needs to change?”\n\nStudents at Bay Area Catholic high schools generally saw these changes as steps in the right direction. There was, however, one change that students unanimously called for: implementing stricter and more clear-cut policies against racism.\n\nA new Supreme Court ruling on July 8 may threaten this progress not only within the Bay Area Catholic community but also within the Catholic community at large. The ruling declared that Catholic schools could discriminate against ministerial employees — those who carry out some sort of religious duty, whether it be a priest or religion teacher — based on race, age, sexual orientation, gender identity and other factors.\n\nAlonso believes that the Supreme Court ruling could mean only upholding certain parts of Catholic teaching and not supporting other aspects.\n\n“We shouldn’t discriminate on very specific parts of people’s lives,” Alonso said. “And I think that’s not what [the Catholic] teaching says. Our teaching says to love one another.”\n\nContact Louis Chavey at louis ‘at’ chavey.org."}, {"url": "https://abc7news.com/priest-list-archdiocese-clergy/4513117/", "page_content": "What we know about the priests included on the San Jose diocese list\n\nSAN JOSE, Calif. (KGO) -- The San Jose Archdioses released a list containing the name of priests who are accused of sexually abusing children. The earliest reports date back to 1961 spanning over 57 years.\n\nHere is what we know about them so far:\n\nName: Thomas Bettencourt\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child while at St. Justin Parish in 1982.\n\nYear(s) Reported to Diocese:\n\nReported in 1997\n\nStatus:\n\nDied 2/25/1990\n\nDiocesan Assignments:\n\n1974-1975 Mater Dolorosa Parish - South San Francisco, CA\n\n1975-1976 Santa Teresa Parish - San Jose, CA\n\n1976-1979 St. Lucy Parish - Campbell, CA\n\n1979-1981 O'Connor Hospital - San Jose, CA\n\n1981-1982 St. Justin Parish - Santa Clara, CA\n\n1982-1988 St. Mary of the Immaculate Conception - Los Gatos, CA\n\nName: Don Flickinger\n\nAllegation(s) and Year(s):\n\n(Diocese of Fresno, CA) Sexual misconduct with children while at St. Frances Cabrini & Sacred Heart Saratoga Parish between the 1990s and early 2000s.\n\nYear(s) Reported to Diocese:\n\nReported in 2002, 2005, & 2006\n\nStatus:\n\nPermanently Banned from Ministry in 2006\n\nDiocesan Assignments:\n\n1993-1994 Archbishop Mitty High School - San Jose, CA\n\n1993-1995 In residence at Sacred Heart Parish - Saratoga, CA\n\n1995-2006 In residence at St. Frances Cabrini Parish - San Jose, CA\n\nCurrent Whereabouts: Diocese of Fresno\n\n- Flickinger worked in SF (2006-2011) after his last San Jose stint: \"St. Paul Catholic Parish and School, located at 221 Valley St. in the city's Noe Valley neighborhood. For the full story go here.\n\nName: Robert A. Gray\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children while at St. Justin Parish between the years of 1991-1993.\n\nYear(s) Reported to Diocese:\n\nReported & Convicted in 1993 Restricted Ministry in 1993\n\nStatus:\n\nPermanently Banned from Ministry in 2002 Based on Dallas Charter\n\nDiocesan Assignments:\n\n1988-1991 St. Christopher Parish - San Jose, CA\n\n1991-1993 St. Justin Parish - Santa Clara, CA\n\n1993-1995 Administrative Leave\n\n1995-2002 Administrative Assignments\n\nCurrent Whereabouts: Sunnyvale, CA\n\nName: Arthur Harrison\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child while at Our Lady of Loretto Parish in 1961.\n\nSexual misconduct with children met while at St. Frances Cabrini Parish.\n\nIncidents occurred between the years of 1974-1976.\n\nYear(s) Reported to Diocese:\n\nReported in 1988, 1990, 2003\n\nStatus:\n\nRestricted Ministry in 1989\n\nRetired in 1992\n\nPermanently Banned from Ministry in 2002\n\nBased on Dallas Charter\n\nDied 11/29/2006\n\nDiocesan Assignments:\n\n1956-1960 St. Thomas Aquinas Parish - Palo Alto, CA\n\n1960-1964 Our Lady of Loretto Parish - Novato, CA\n\n1964-1967 St. Frances Cabrini Parish - San Jose, CA\n\n1967-1976 St. Raphael Parish - San Rafael, CA\n\n1967-1976 San Quentin Prison Chaplain - San Quentin, CA\n\n1976-1987 St. Elizabeth Parish - Milpitas, CA\n\n1987-1989 Church of the Ascension - Saratoga, CA\n\n1989 On Leave\n\nName: Laurent Largente\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child while at St. Patrick Cathedral between the years of 1980-1983.\n\nYear(s) Reported to Diocese:\n\nReported in 1994\n\nStatus:\n\nRemoved from Ministry in 1994\n\nPermanently Banned from Ministry in 2002\n\nBased on Dallas Charter\n\nDied 4/13/2015\n\nDiocesan Assignments:\n\n1959-1961 St. Michael Parish - San Francisco, CA\n\n1961-1964 St. Leo the Great Parish - San Jose, CA\n\n1964-1973 St. Patrick Parish - San Jose, CA\n\n1973-1976 Sacred Heart Parish - Saratoga, CA\n\n1976-1978 Catholic Women's Center - San Jose, CA\n\n1978-1987 St. Patrick Cathedral - San Jose, CA\n\n1987 On Leave\n\n1987-1992 Church of the Ascension - Saratoga, CA\n\n1992-1993 St. Joseph Cathedral - San Jose, CA\n\nName: Alexander Larkin\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children while at Our Lady of the Rosary Parish in the 1970s.\n\nYear(s) Reported to Diocese:\n\nReported in 2003\n\nStatus:\n\nRestricted Ministry in 2005\n\nPermanently Banned from Ministry in 2009\n\nDiocesan Assignments:\n\n1967-1968 St. Cecilia Parish - San Francisco, CA\n\n1968-1974 St. Pius X Parish - Redwood City, CA\n\n1974-1981 Our Lady of the Rosary Parish - Palo Alto, CA\n\n1981-1985 St. William's Parish - Los Altos, CA\n\n1985-1987 St. John Vianney Parish - San Jose, CA\n\n1987-1987 Stanford University Newman Center - Stanford, CA\n\n1987-1992 St. Thomas Aquinas Parish - Palo Alto, CA\n\n1992-1996 Chancery, Diocese of San Jose - San Jose, CA\n\n1996-2005 Sacred Heart Parish - Saratoga, CA\n\nCurrent Whereabouts: San Jose, CA\n\nName: Philip McCrillis\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children while at St. Albert the Great Parish and St. Patrick Seminary between the years of 1968-1969.\n\nYear(s) Reported to Diocese:\n\nReported in 2004\n\nStatus:\n\nPermanently Banned from Ministry in 2004\n\nDied 2/2/2007\n\nDiocesan Assignments:\n\n1961-1966 St. Anne Parish - San Francisco, CA\n\n1966-1969 St. Albert the Great Parish - Palo Alto, CA\n\n1969-1969 St. Anthony Parish - Menlo Park, CA\n\n1969-1972 St. Patrick Seminary - Menlo Park, CA\n\n1972-1976 SJSU Newman Center - San Jose, CA\n\n1973-1976 St. Nicholas Parish - Los Altos, CA\n\n1977-1983 On Leave\n\n1983-1991 St. Nicholas Parish - Los Altos, CA\n\n1991-1996 Holy Spirit Parish - San Jose, CA\n\n1996-1999 Chancery - San Jose, CA\n\n2000-2004 On Leave\n\nName: George Moss (Archdiocese of San Francisco, CA)\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children while at St. Joseph Parish between the years of 1963-1976.\n\nYear(s) Reported to Diocese:\n\nReported in 2002, 2004, 2012\n\nStatus: Retired in 1976\n\nDied 1986\n\nDiocesan Assignments:\n\n1963-1976 St. Joseph Parish - Mountain View, CA\n\nName: Leonel Noia\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children while at St. Patrick Parish during the 1970s.\n\nYear(s) Reported to Diocese:\n\nReported & Convicted in 1976\n\nStatus:\n\nPermanently Banned from Ministry in 2002\n\nBased on Dallas Charter\n\nDied 6/3/2005\n\nDiocesan Assignments:\n\n1972-1973 St. Victor Parish - San Jose, CA\n\n1973-1975 St. Patrick Parish- San Jose, CA\n\n1975-1975 St. Joseph Parish - Mountain View, CA\n\n1975-1978 Suspended Faculties - Incarcerated\n\n1978-1982 St. Julie Billiart Parish - San Jose, CA\n\n1982-1986 St. Anthony Parish - San Jose, CA\n\n1986-2002 Five Wounds Parish - San Jose, CA\n\nName: Joseph Pritchard\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children while at St. Martin of Tours Parish in the 1970s.\n\nYear(s) Reported to Diocese:\n\nReported in 2002 & 2003\n\nStatus: Died 10/17/1988\n\nDiocesan Assignments:\n\n1948-1953 St. Brendan Parish - San Francisco, CA\n\n1953-1956 Bishop O'Dowd High School - Oakland, CA\n\n1956-1970 Serra High School for Boys - San Mateo, CA\n\n1970-1971 St. Cyprian Parish - Sunnyvale, CA\n\n1971-1979 St. Martin of Tours Parish - San Jose, CA\n\n1979-1988 St. Nicholas Parish - Los Altos, CA\n\nName: Noel Senevirante (Diocese of Trincomalee - Batticaloa, Sri Lanka)\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child while at St. Leo the Great School between the years of 1971-1972.\n\nYear(s) Reported to Diocese: Reported in 2002\n\nStatus: Permanently Banned from Ministry in 2002\n\nDied 6/16/2009\n\nDiocesan Assignments:\n\n5/1970 St. Martin of Tours Parish - San Jose, CA\n\n7/1970 St. Leo the Great Parish - San Jose, CA\n\n10/1970 St. Maria Goretti Parish - San Jose, CA\n\nNo assignment in Diocese of San Jose\n\nName: Hernan Toro (Archdiocese of Popayan, Colombia)\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child while at Our Lady Star of the Sea Parish in 1983.\n\nYear(s) Reported to Diocese:\n\nReported & Convicted as a Registered Sex Offender in 1983\n\nStatus:\n\nPermanently Banned from Ministry in 1990\n\nRetired 4/1/1990\n\nDiocesan Assignments:\n\n1978-1979 Our Lady of Peace Parish - Santa Clara, CA\n\n1979-1983 Our Lady Star of the Sea Parish - Alviso, CA\n\n1983-1984 St. Athanasius Parish - Mountain View, CA\n\n1984-1986 St. Catherine Parish - Morgan Hill, CA\n\n1986-1988 St. Aloysius Parish - Palo Alto, CA\n\n1988-1990 Detention Ministry\n\nCurrent Whereabouts: San Leandro, CA\n\nName: Joseph Dondero S.J. (Jesuit)\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child while at St. Joseph Parish the 1960s.\n\nYear(s) Reported to Diocese: Reported in 2002\n\nStatus:\n\nDied 6/28/1997\n\nDiocesan Assignments:\n\n1949-1951 St. Joseph Parish - San Jose, CA\n\n1951-1952 Loyola Marymount University - Los Angeles, CA\n\n1952-1963 Jesuit Retreat Center - Los Altos, CA\n\n1963-1973 St. Joseph Parish - San Jose, CA\n\n1973-1980 St. Thomas Canterbury Parish - Campbell, CA\n\n1980-1997 Sacred Heart Jesuit Center - Los Gatos, CA\n\nName: Angel Mariano S.J. (Jesuit)\n\nAllegation(s) and Year(s):\n\nSexual misconduct with a child in Non-parish related incident.\n\nYear(s) Reported to Diocese:\n\nReported & Convicted in 1998\n\nStatus:\n\nPermanently Banned from Ministry in 1998\n\nDied 11/25/2002\n\nDiocesan Assignments:\n\n1993-1998 Most Holy Trinity Parish - San Jose, CA\n\nName: Phil Sunseri S.J. (Jesuit)\n\nAllegation(s) and Year(s):\n\nSexual misconduct with children at St. Christopher Parish in 1986 and while at Holy Family Parish in 1987.\n\nYear(s) Reported to Diocese:\n\nReported in 1987 & 2018\n\nStatus:\n\nPermanently Banned from Ministry in 1988\n\nDiocesan Assignments:\n\n6/1987-12/1987 Holy Family Parish - San Jose, CA\n\nCurrent Whereabouts: San Jose, CA"}, {"url": "https://www.sfchronicle.com/sports/high-school/article/Mitty-girls-basketball-coach-Sue-Phillips-piling-17607654.php", "page_content": "This is a carousel. Use Next and Previous buttons to navigate\n\nSue Phillips has been piling up honors for decades. A couple more this month have led her to reflect on her career.\n\nThe Mitty girls basketball coach, a 1986 graduate of the school, was inducted into the San Jose Sports Hall of Fame on Nov. 9 and two days later learned she was a nominee to the Women’s Basketball Hall of Fame.\n\n“It’s been an incredible week,” said Phillips, who has more coaching wins than any girls high school basketball coach in Northern California history (761) and six state championships. “I’m so grateful to be acknowledged.”\n\nPhillips is a member of the Women’s Basketball Hall of Fame committee, so she has spent the past few weeks reviewing the process for nominations. She didn’t know that the rest of the committee had been reviewing her qualifications.\n\nShe was watching the Nov. 11 South Carolina-Maryland game on ESPN when the nominees were announced. That was when she saw her name among the 12 nominees.\n\n“I was floored,” she said. “I was so surprised and honored; what a really cool thing to be a finalist, and to see it like that.”\n\nPhillips’ Monarchs were ranked 12th in the country by ESPN heading into this season, her 30th at the San Jose school.\n\nPhillips, who is also a math teacher at Mitty, has coached more than 50 players who went on to play in Division I, including Stanford’s Haley Jones, one of the top players in the country.\n\n“She’s a really tough coach,” Jones said. “The relationship I created with her was one where she could get on me every day. I took that and knew it was from a place of her wanting me to reach my full potential.”\n\nJones said Phillips “not letting up” on her during some of her rough days helped her grow, and her support to encourage her to keep at it was an essential balance.\n\nWith USA Basketball, Phillips has coached the likes of Arike Ogunbowale, Katie Lou Samuelson, AD Durr, Aliyah Boston, and Paige Bueckers. Earlier this month, JuJu Watkins — one of Phillips’ U17 players — committed to USC as the top recruit in the country.\n\nAshley Hiraki, a junior at Santa Clara, recalled a game in her senior year at Mitty when the team was down by 20 at halftime. Phillips’ speech was motivational, Hiraki said, and that “struck momentum for the rest of the season.”\n\n“She was a huge influence on me,” said Hiraki. “She is someone you listen to. I wouldn’t be where I am without her.”\n\nThe 2018 Mitty team, led by Jones and Hiraki, earned top national rankings from ESPN, MaxPreps and USA Today and was declared the mythical national champion by USA Today and espnW.\n\nPhillips has been named National Coach of the Year by the WBCA, Naismith and Gatorade, and in 2019 coached the McDonald’s All-American Game. She won gold medals with USA Basketball’s U16 national team at the 2013 FIBA Americas tournament and the U17 team at the FIBA World Cup the next year. This summer, she won U17 gold at the FIBA World Cup in Hungary.\n\nA top player herself while at Mitty, Phillips had an offer to play basketball at Cal, but ultimately opted to play softball at Northwestern, where she was an All-Big Ten selection. In the end, she returned to basketball and the Bay Area, spending time as an assistant coach at Cal between coaching stints at her alma mater.\n\nShe was inducted into the Mitty Athletic Hall of Fame in 1998 for her accomplishments as a three-sport athlete (basketball, softball and volleyball).\n\nBut for all her athletic success, coaching was her true calling.\n\n“When you’re in the midst of doing something, it’s just your day-to-day,” Phillips said. “I love coaching and enjoy teaching young people. To hit the pause button and be acknowledged for those efforts is a great feeling.”\n\nPhillips said it was special to have both of her parents at the San Jose Hall of Fame induction, and to have shared all her successes with them over her career.\n\nMitty finished 30-2 and No. 1 in The Chronicle’s final 2021-22 rankings. This season’s team maintained that spot in the preseason rankings and is led by 6-foot-1 senior Morgan Cheli, who was part of the Phillips-coached U17 World Cup championship team over the summer.\n\nWhile Phillips develops another generation of top players, her legacy — and her list of awards — continues to expand.\n\n“She deserves everything she’s getting,” Jones said. “She’s an amazing coach and has built an amazing program. She shapes us to come to the next level and succeed.”\n\nMarisa Ingemi is a San Francisco Chronicle staff writer. Email: marisa.ingemi@sfchronicle.com"}, {"url": "https://www.yumpu.com/en/document/view/23097697/the-ipad-comes-to-amhs-archbishop-mitty-high-school", "page_content": "Inappropriate\n\nYou have already flagged this document.\n\nThank you, for helping us keep this platform clean.\n\nThe editors will have a look at it as soon as possible."}, {"url": "https://www.cal-catholic.com/does-bishop-cantu-care-about-mitty-high-2/", "page_content": "In November, 2020, Cal Catholic reported that San Jose’s Bishop Oscar Cantu gave his blessing to the appointment of a pro-abortion president of Archbishop Mitty High School.\n\nNow comes word from a Cal Catholic reader that the high school has other problems:\n\n– The school’s Resources for Anti-Racism contain a section on Gender Fluidity.\n\n– The school hired Gender Spectrum to provide training for its employees on “gender issues.” This organization promotes gender confusion in children. Gender Spectrum has an annual conference at St. Mary’s in Moraga. The main sponsors are Align Surgical , “gender affirming” plastic surgeons. – Race and gender training was scheduled for February of this year, according to minutes of a meeting which Latanya Hilton (that time incoming president) and Ms. Caputo (current principal) attended\n\n– The hiring of head librarian Tiffani Lewis-Lockhart, who maintains raw Twitter and Tumblr accounts (“Nympho Librarian,” “wanting to f_ Jesus”)\n\nThe Cal Catholic reader has contacted the board of Mitty High, Bishop Cantu, and all San Jose diocese priests – with no results so far."}]}