{"Casey Serin became overwhelmed by the debt and was unable to make payments on the mortgages.": [{"url": "https://link.springer.com/article/10.1007/s10551-016-3052-7", "page_content": "The 2007–2009 financial crisis “witnessed an erosion of standards of responsibility and ethics… [that] stretched from the ground level to the corporate suites” (FCI Report 2011, p. xxii). The activities of the financial institutions and regulatory agencies that contributed to the financial crisis and government institutions that employed unprecedented rescue strategies to drag the financial crisis back from the brink of total global collapse present major ethical questions.Footnote 51 Those questions include the following:\n\nMortgage Brokers\n\n1. Determine whether the compensation paid to mortgage brokers constitutes a conflict of interest with respect to the individuals for whom the mortgage brokers facilitated the mortgages.\n\nBecause mortgage brokers’ compensation was higher for originating subprime loans than conventional loans, they frequently pushed borrowers into more costly and risky mortgages, such as interest only, balloon and adjustable-rate loans, and failed to disclose either their compensation differential to the borrowers or the differences in risk posed by the subprime loans. Because it is unclear whether the brokers generated subprime mortgages to gain enhanced compensation or to advance interest of the borrower, a conflict of interest exists.\n\n2. How should the mortgage brokers have resolved the conflict of interest, if any, with the individuals for whom they sought mortgages with lenders?\n\nIn order to resolve the conflict of interest, the brokers should either have removed themselves from the mortgage transaction or fully disclosed their enhanced financial interest in generating the subprime loans. Full disclosure must cover not only the brokers’ enhanced compensation but the enhanced risk accepted by the borrower for which the broker is paid more, because many mortgage borrowers locked into subprime loans were financially unsophisticated and poorly equipped to understand the transaction, compare terms, and shop around.\n\nSubprime Mortgage Lenders\n\n1. Assess whether the marketing and promotion of subprime mortgages “designed to default” to susceptible consumers was ethical or unethical.\n\nBecause susceptible consumers lacked financial sophistication and were lead to believe rising housing prices would permit them to refinance their subprime mortgages into ones they could afford, lenders who encouraged them to commit to subprime loans without fully disclosing the risks involved and properly assessing whether they could successfully repay the loans acted unethically. Mortgage brokers, who received higher compensation for originating the riskier loans, acted deceptively in the absence of full disclosure. Mortgage lenders, which earned higher interest on subprime loans while they held them and higher compensation upon selling the mortgage loan to banks securitizing the mortgage loans, acted deceptively in the absence of full disclosure. Further, both mortgage brokers and mortgage lenders, who assigned the loans to banks securitizing the mortgages, lacked any incentive to be concerned about the loan’s performance, because the loans were passed downstream and became someone else’s problem. The disastrous consequences of the financial crisis to all those affected demonstrate that the practice of marketing and promotion of subprime mortgages “designed to default” was immoral under the ethical theory of Act Utilitarianism. Likewise, marketing and promoting subprime mortgages “designed to default” is not a rule of conduct designed to produce the greatest good to those affected, and hence is deemed immoral under the ethical theory of Rule Utilitarianism. Finally, the failure to provide full disclosure to the borrowers constitutes deception which is deemed immoral under both Kant’s categorical imperative and Rawls’ Equal Liberty principle.\n\n2. Discuss whether lenders’ providing subprime mortgages to borrowers who were otherwise unable to obtain prime mortgages and who agreed to the terms of the subprime mortgage was ethical.\n\nProviding subprime mortgages to borrowers who were otherwise unable to obtain prime mortgages and who freely agreed to the terms of the subprime mortgage was ethical, because it provided the only avenue available to them to acquire a home and was consistent with federal policy, provided full disclosure of the risks of such loans was given to the borrower and adequate assessment of the buyers’ ability to repay the loan was made by the broker or lender. This was certainly not the case in low-doc, no-doc, interest only, and “pick-a-pay” loans.\n\nSecuritization of Mortgages\n\n1. Assess whether banks’ securitization of mortgage loans into investment securities with multiple tranches and selling those securities to investors was ethical or unethical.\n\nThere is certainly nothing morally wrong with assembling complicated investment securities to investors, provided the investors are given sufficient and accurate information to make an informed decision to invest in the securities or to divest the securities. Indeed, mortgage-backed securities played an important role in augmenting the investment income of investors and commercial and investment banks beyond that provided by Treasury bonds, and, as implemented by Fannie Mae and Freddy Mac, the securitization of mortgages played a huge role in expanding funds available to mortgage loan borrowers, because lending banks could sell their mortgages and use the proceeds to fund additional mortgages, permitting more and more families to acquire homes.\n\n2. Determine whether the banks’ repackaging of lower rated mortgage-backed securities into new collateralized debt securities with investment grade ratings was ethical or unethical.\n\nThe manner in which banks assembled and sold their mortgage-backed securities and collateralized debt securities was incredibly complex. The securities were divided into tranches each of which was assigned a different level of risk. The securities were backed by credit default swaps, and stamped with inflated ratings issued by Moody, Standard and Poor, and Fitch. When the securities did not sell, they were repackaged into new collateralized debt obligations, assigned to new tranches, and given new, pristine ratings by the rating firms. As subprime mortgages increased, they too were tossed into the securities. This complicated and ever changing mixture of tranches, credit default swaps, inflated ratings, and prime and subprime mortgages camouflaged the soundness of the loans underlying the securities. Because the securitization process had become exceedingly complex and inscrutable, investors were unable to understand what they were purchasing and increasingly relied on the faulty rating agency imprimaturs.\n\nThese practices run counter to the moral obligations of investment and commercial banks to provide accurate information to investors so that they can make an informed decision to invest or divest the securities. Providing accurate information provides the greatest amount of good to those affected by the issuance of complicated MBO and CDO, and is ethical under Act Utilitarianism. Providing accurate information is a rule of conduct that produces the greatest amount of good to those affected by the issuance of complicated MBO and CDO, and is ethical under Rule Utilitarianism. Providing accurate information is deemed moral, because it passes muster under Kant’s means-only principle and Rawls’ Equal Liberty principle.\n\n3. Assess whether or not the securitization of mortgages and “pushing the risk downstream” was ethical or unethical.\n\nPermitting mortgage lenders to sell their mortgages loans to other investors permits the mortgage lender to use the proceeds of the sale to lend more money to borrowers seeking to purchase homes. Employing government sponsored entities such as Fannie Mae and Freddie Mac to purchase prime mortgages and place them into mortgage pools facilitates the process and advances the federal government’s policy of increasing home ownership. While the mortgage lender indeed “pushed the risk downstream,” the investment pools spread the risk of loss across the pool and created sound investments, because prime mortgages have a very low risk of default. In short, securitization of mortgages serves an enormously beneficial function.\n\nNonetheless, the ever increasing complexity of the mortgage pools, which contained equity, mezzanine, and senior tranches, which combined prime and subprime mortgages, and which were secured by credit default swaps acquired in over-the-counter derivatives markets from securitizers who achieved unacceptable leverage ratios without any oversight by government regulators, created a disastrous situation in which only small percentage of mortgage defaults could trigger a complete collapse of the financial system. Very clearly the harms inflicted by the financial collapse, which should have been foreseen, exceeded the benefits, making the practice of inscrutable securitization of mortgages unethical under the theory of act utilitarianism. Likewise, the practice of creating and selling inscrutable mortgage and collateralized debt obligations does not constitute a rule of conduct which creates the greatest amount of good to those affected, and violates rule utilitarianism. Because banks creating, marketing, and selling the inscrutable mortgage and collateralized debt obligations and dressing them up with flawed securities ratings failed to disclose information needed by investors to make an informed investment decision, those banks flunk Kant’s “means only” principle and Rawls’ Equal Liberty principle and “veil of ignorance” test, and hence acted unethically.\n\nRating Firms\n\n1. Assess the morality of the rating firms’ assignment of investment ratings to the mortgage-backed securities (MBS) and collateralized debt obligations (CDO) assembled and sold by banks and subsequent downgrading of those ratings.\n\nIt is clear that the rating firms’ assignment of investment ratings to the mortgage-backed and collateralized debt obligations was incompetent. The rating firms employed deeply flawed models in assessing the safety of the bonds and looked the other way when mortgages they previously rated low were repackaged into retranched bonds. As noted in endnote 39, the rating firms’ subsequent downgrading of securities ratings caused huge losses. Investors, like banks, pension funds, and insurance companies, were forced to sell the MBS and CDO, because they lost their investment grade status, and selling into a declining market is disastrous. MBS and CDO held by financial firms lost much of their value, and new securitizations lacked buyers. Unable to sell, banks were forced to “mark-to-market” recognizing losses on their securities. Assets in off-balance sheet Structured Investment Vehicles, rendered insolvent by the price decline, had to be brought back onto the balance sheet and more losses had to be recognized. This reduced the bank’s capital and increased its reserve requirements. Had the ratings firms done their work properly, these losses could have been avoided.\n\nIf the ratings firms were aware or should have been aware of the financial debacle which followed their assignment and subsequent downgrading of investment grade ratings, the ratings firms clearly acted unethically under all of the ethical theories. The bad consequences outweighed the good consequences to those affected; the incompetent assignment of investment grade ratings does not constitute a rule of conduct that produces more good than harm to those affected; and both Kant and Rawls cannot abide deception.\n\n2. Do you think holding the ratings firms liable for their assignment of ratings to investment securities is ethical or unethical?\n\nIt is tempting to think that holding the ratings firms liable for their assignment of ratings on which investors rely is ethical, because they would be compelled to act more carefully in assessing the financial risk and appending their coveted investment grade ratings. However, the rating firms would likely be forced to raise their fees for their investment ratings to offset their increased liability for flawed ratings, thereby raising the price of the investment and lowering the investment return. This scenario is analogous to the role of public accounting firms who audit the financial statements of publicly traded companies. Their audit fees are cheaper if their liability is limited to their clients and known and identified users of the certified financial statements. Their audit fees increase significantly if they are held liable to foreseeable users of the certified financial statements. Hence, in order to assess the morality of making ratings firms liable for flawed investment ratings, an assessment of the impact on ratings firms’ fees is required. Regardless, the Dodd–Frank Act, discussed below, has imposed liability for flawed ratings on the ratings firms for knowing or reckless failure to conduct a reasonable investigation in performing ratings services.\n\n3. Determine whether the compensation arrangement between the investment banks and ratings firms was ethical or unethical.\n\nThe compensation arrangements between the investment banks and ratings firms were problematic, because they created a conflict of interest. The ratings firms might have assigned the ratings because they were accurately computed and properly advised investors who relied on them. The ratings firms might have assigned the ratings, because they feared the loss of their fees if they disappointed the banks paying for the ratings and wanted to continue their working relationship with the banks and the resulting income flow. Blinder’s analogy is telling. He compares banks’ compensation of rating firms to faculty members’ being paid by students to grade their submitted work. While the fact credit rating agencies were paid by the companies whose securities were rated was well known in the industry, investors, who were unaware of those arrangements and relied on those ratings without realizing the existence of the conflict of interest, were likely deceived. Hence, by failing to disclose fully the conflict of interest to those investors, the investment banks and ratings firms acted unethically.\n\nRegulatory Agencies\n\n1. Assuming the Federal Reserve had authority to mandate that lenders issue only prime mortgages, do you think the Federal Reserve acted unethically in refraining from imposing such restrictions?\n\nThe 1994 Home Ownership and Equity Protection Act (HOEPA) directed the Federal Reserve to ban mortgage loan practices it found to be unfair or deceptive, thereby giving the Federal Reserve Bank authority to impose restrictions on subprime mortgages. Nonetheless, subprime mortgages played a crucial role in permitting low-income families to acquire homes, an important public policy initiative of the Bush and Clinton administrations. Permitting subprime mortgages to grow significantly (from 5 % of mortgage origination in 1994 to 20 % of total originations in 2005) supported that initiative. The Federal Reserve reasonably concluded the amount of defaulted subprime mortgages was insufficient by itself to trigger a financial crisis. Hence, unless the Federal Reserve knew or should have known defaults in subprime mortgages would trigger the financial crisis, its refraining from requiring lenders issue only prime mortgages cannot be said to be unethical.\n\n2. Do you think the Securities Exchange Commission (SEC) acted unethically in failing to review, and require adequate disclosures in, banks’ supplemental prospectuses with respect to credit-granting or underwriting criteria used in assembling the pooled loans?\n\nAs noted in endnote 22, the SEC contributed to the financial crisis, because it permitted the issuance of more than $2 trillion in non-GSE mortgage-backed securities (MBS) and close to $700 billion of collateralized debt obligations (CDO) with lax or no oversight. MBS were issued through a “shelf registration,” a shell registration statement to which a supplemental prospectus was added. The supplemental prospectus contained a disclaimer of the issuers’ obligation to comply with Regulation AB which requires disclosure of credit-granting or underwriting criteria used to assemble the pooled loans. The SEC failed to review the supplemental prospectus. The CDOs were issued through Rule 144A to qualified institutional buyers without registration. In short, because the SEC permitted the issuance of MBO and CDO investments, which violated or sidestepped disclosure requirements that could have alerted investors of the risks the MBO and CDO, the SEC acted unethically. Had the SEC complied with its oversight responsibilities, the financial crisis might have been averted, thereby producing more net benefit to those affected. Likewise, permitting the issuance of securities with insufficient disclosures certainly does not constitute a rule of conduct which produces the greatest amount of good to those affected. Finally, the failure to insure adequate disclosures facilitates deception of investors, contrary to Kant’s means-only principle and Rawls’ Equal Liberty theory.\n\n3. Determine whether the decision of the Federal Reserve and Treasury Department not to rescue Lehman Brothers was ethical or unethical.\n\nThe decision of the Federal Reserve and Treasury Department not to rescue Lehman Brothers, following its rescue of Bear Stearns, Fannie Mae and Freddie Mac, triggered vast uncertainty and unbridled panic in the financial markets which, in hindsight, arguably caused more harm to financial institutions (ultimately requiring bailouts in trillions) than the cost of rescuing Lehman Brothers (estimated between $12 and $60 billion). Perhaps overplaying his hand or simply seeking to escape scathing criticism for rescuing undeserving financial behemoths, Treasury Secretary Henry Paulsen insisted that the rescue be accomplished without government funds. The resulting deal to have Wall Street firms purchase Lehman’s toxic assets and sell the cleansed investment bank to Barclay’s Bank almost worked, only to collapse at the last moment. Not having a clear picture of what the Federal Reserve and Treasury Department knew or should have known about the consequences of Lehman’s ensuing bankruptcy, it is difficult to assess the morality of the decision not to rescue Lehman Brothers. If the Federal Reserve and Treasury Department anticipated or should have anticipated the true dimensions of the catastrophe that followed, they acted unethically in failing to rescue Lehman Brothers because more harm than good was created for those affected. Likewise, implementing rescue efforts to avert a greater harm constitutes a rule of conduct that likely produces the greatest net amount of good for those affected, and failing to follow that rule of conduct would be deemed immoral. Except for the principle of moral hazard discussed below, Kant would likely agree that employing rescue tactics to prevent greater financial harms constitutes an acceptable universal practice, and hence is moral. Under Rawls’ veil of ignorance theory, effecting financial rescue is likely deemed a fair course of conduct if the parties do not know what position they will occupy in the financial crisis, and hence can be viewed as moral.\n\n4. Assess whether the “moral hazard” principle was sufficient justification for the Treasury Department to refuse to rescue Lehman Brothers before it declared bankruptcy.\n\nThe principle of “moral hazard” holds that government’s rescue of financial institutions encourages them to engage in risky transactions, because they anticipate being bailed out by the government. To avoid the consequences of moral hazard, the principle goes, the government should make financial institutions absorb the loss to serve as a lesson to others not to mimic such risky conduct.Footnote 52 The preceding rescue of Bear Stearns likely caused financial institutions to believe they would be rescued if they found themselves in financial difficulties, and permitting Lehman Brothers to fail countered that belief. Unfortunately, Lehman Brothers’ bankruptcy shocked the financial markets, and caused financial institutions to question the financial health of their own counterparties. Lending halted, cash was horded, and market paralysis and panic ensued. Given the above noted disparity between the ultimate cost of financial institution bailouts and the estimated cost of rescuing Lehman Brothers, the principle of moral hazard, at least by hindsight, was an insufficient justification for letting Lehman Brothers fail.\n\n5. Assess whether or not the actions of the Federal Reserve and Treasury Department to rescue Bear Stearns, Fannie Mae and Freddy Mac, AIG, Goldman Sachs and Morgan Stanley, Washington Mutual, Wachovia, and Citigroup was moral or immoral.\n\nThe actions of the Federal Reserve and Treasury Department to rescue the above noted financial institutions were likely ethical under Act Utilitarianism, because doing so arguably produced the greatest net amount good to all those affected by the rescue efforts. It was not simply the direct financial fallout from letting those institutions collapse that was avoided, but the likely collapse of global financial markets. Employing approximately $700 billion in TARP funds and $700 billion in President Obama’s ensuing financial stimulus funds actually worked, avoided global financial Armageddon, and was clearly worth the price. The rule of conduct that likely produces the greatest amount of good for those affected is to rescue financial institutions when doing so avoids devastating global financial collapse. Hence rescuing those financial institutions was likely ethical under rule utilitarianism. The same conclusion is reached via Kant’s categorical imperative and Rawls’ difference principle. Rescuing the enumerated financial institutions likely constitutes an effective universal practice which, given the outcome of avoiding global financial collapse, financial institutions can approve. While the identified financial institutions were provided with an economic benefit not provided to others, the disparate treatment is justified by the critical needs of the financial institutions and, fortunately, ultimately rescued the global financial markets rather than further disrupting and collapsing them. Indeed, the failure to implement those the rescues would have frozen all commerce and destroyed economies globally. Hence the financial rescue of the companies can be deemed moral under Rawls’ difference principle.\n\n6. Assess whether or not the Federal Reserve, the Office of the Comptroller of the Currency (OCC), the Office of Thrift Supervision (OTS), and the Federal Deposit Insurance Corporation (FDIC) took adequate steps to insure commercial and investment banks engaged in sufficient risk management, and if not, whether their failure to do so was ethical or unethical.\n\nUnder the “unwatchful” eyes of the bank regulators, banks approved hundreds of billions of dollars in shameful subprime mortgages and invested vast sums in dicey MBS and CDO. The bank regulators did not seem to notice. They were equally blind to the phenomenal growth of the shadow banking system, featuring commercial paper and short-term repo loans securitized by MBO and CDO dressed up with credit default swaps. They looked the other way while banks achieved dangerously high leverage that triggered the domino chain of bank failures. They permitted the banks to sell their mortgage loans to off-balance sheet structured investment vehicles, which paid for the mortgages with money borrowed in the commercial paper market and enabled the banks to avoid increased reserve requirements. They allowed banks’ investments in derivatives to hedge against risks and further lower reserve requirements. They stood idly by when the Commodity Futures Modernization Act of 2000 released the over-the-counter derivatives market from any government regulation. Despite clear warnings of the coming housing bubble, reports expressing alarm about the risky lending practices in subprime mortgages, and financial disruptions such as the bankruptcy of Orange County, California, and the collapse of Barings and the Long-Term Capital Management hedge funds, the bank regulators shamefully took no action to assess the adequacy of banks’ risk management protocols. Given the danger signals flashing around them, the bank regulators should have promptly addressed these issues by shoring up risk management, cleaning up subprime lending practices, requiring banks to lower their leverage ratios, and upping reserve requirements. Their failure to do so clearly produced far more harm than good to those affected, and is deemed unethical under act utilitarianism. The rule of conduct for bank regulators that likely produces the greatest amount of good to those affected is to insure adequate risk management protocols are followed by banks. By not following that rule, the bank regulators acted unethically. Participants in the financial system can likely agree that requiring bank regulators to insure adequate risk management practices are followed constitutes a beneficial universal practice, and hence is moral under Kant’s categorical imperative. Rawls’ veil of ignorance theory reaches the same conclusion: not knowing what position the participant might occupy in society, it likely is an acceptable and fair practice to make banks employ sufficient risk management practices.\n\nAmerican International Group (AIG)\n\n1. Assess the morality of AIG’s issuance of credit default swaps to guarantee the financial performance of the MBS and CDO and its decision not to maintain reserves in the event of default.\n\nEven though AIG’s credit protections on assets, including MBS and CDO, reached $533 billion in 2007, $79 billion of which was written in the over-the-counter credit default swap (CDS) protection on super-senior tranches of CDOs containing subprime mortgages, neither its regulator, the Office of Thrift Management (OTM), nor AIG thought it was necessary to provide any type of reserve for losses on its credit default swaps (CDS), an enormous failure in risk management. Notably, AIG was required to post collateral on its credit default swaps if the value of the underlying assets declined or if the credit agencies lowered AIG’s credit ratings. Both conditions were fulfilled in 2008. Forced by its auditors, PricewaterhouseCoopers, to disclose it had no reliable methodology to estimate movement in the value of the securities on which it wrote its CDS, the ratings agencies downgraded AIG’s credit rating, triggering a massive demand that AIG post significant collateral to secure its CDS. Soon afterward, AIG began reporting substantial declines in the value of MBS and CDO on which it had written CDS, triggering an ensuing series of calls for increased collateral. Declines in its securities lending business exacerbated its situation. AIG simply could not keep up, and, unable to borrow funds or raise capital, AIG turned to and was rescued by the Federal Reserve.\n\nSeveral features of this situation are surprising. First, senior executive officers claimed they were stunned by the initial collateral call to learn that collateral call provisions existed in the CDS issued by AIG. Second, there is evidence the managing director of AIG Financial Products directed AIG Financial Products to stop writing CDS 18 months before the financial crisis unfolded. This suggests there was a lapse of internal controls over the operations of AIG Financial Services. Third, the credulity of AIG Financial Products executives and the OTM regulators to think there was no need to post reserves for losses triggered by CDS belies the financial success (indeed legend) previously achieved by AIG, and vividly illustrates the difference between prudent risk management and sheer recklessness.\n\nHence, AIG’s issuance of staggering amounts of credit default swaps and failure to maintain reserves in the event of the default of the underlying debts in MBS and CDO must be deemed unethical. As a consequence of AIG’s actions, significantly more harm than good was heaped on all those affected, making the actions unethical. While supposedly knowledgeable about risk management, AIG’s failure to maintain reserves to cover defaults is decidedly not a beneficial rule of conduct that produces more good than harm for those affected, and hence is immoral under Rule Utilitarianism. Requiring financial institutions like AIG to maintain safe reserve levels appears to be a laudable universal practice; failing to do so violates Kant’s categorical imperative and is deemed immoral. When viewed from behind the veil of ignorance, maintaining sufficient reserves appears to be a practice that financial institutions would deem fair and worthwhile; hence, AIG’s failure to do so can be deemed immoral under Rawls’ theory of justice.\n\nCommercial and Investment Banks\n\n1. Determine whether it is moral or immoral for commercial and investment banks to achieve such extraordinary levels of leverage.\n\nThe commercial and investment banks achieved dangerously high levels of leverage by borrowing heavily in the commercial paper and short-term repo markets and selling their mortgages to off-balance sheet structured investment vehicles (SIV), as discussed more fully below. The debt to equity ratios of the commercial banks at the time of the financial crisis were eye popping: J.P Morgan (22:1); Wells Fargo (17:1); Bank of America (27:1); Citigroup (32:1). Notably these ratios did not factor in the debt the banks hid in their SIV; if those debts were considered, the ratios would have been substantially higher. Investment banks achieved even higher debt to equity ratios: Goldman Sachs (32:1) and Morgan Stanley (40:1). The investment banks were able to do so because they had the added advantage of being permitted to rely on their internal risk models in determining capital requirements, rather than meeting the reserve requirements of the commercial bank regulators.Footnote 53\n\nHaving such high debt to equity ratios was an enormously risky financial strategy, which daily required the banks to return to the capital markets to renew their loans and face the danger that a refusal to roll over its short-term borrowing could trigger a run. The major problem with such high leverage ratios is that the banks had little or no cushion when the financial crisis unfolded. Moreover, because these were private transactions, only the parties to the loan renewal were aware of debt, causing other banks to become suspicious about the financial condition of competitors. This contributed to the collapse of the shadow bank and derivatives markets, because no bank was willing to lend money to other banks. The financial markets froze and the government had to intervene.\n\nThat the banks achieved such high debt to equity ratios was likely unethical. Under the theory of act utilitarianism, the banks’ collective and significantly high leverage was a substantial contributing cause to the financial crisis, and certainly produced more overall harm than good. The rule of conduct that likely produces the greatest amount of good to those affected is that banks should maintain reasonable levels of leverage to protect investors and customers. By failing to follow that rule, the highly leveraged banks acted unethically. Having banks maintain reasonable levels of leverage likely constitutes an acceptable universal practice, because financial institutions would be operating in a much safer environment, and hence would be deemed ethical under Kant’s categorical imperative. Likewise, not knowing what position the banks might occupy in the financial sector, the banks likely would agree that maintaining adequate debt to equity ratios would be a fair rule to follow. Hence maintaining reasonable leverage would be deemed ethical under Rawls’ veil of ignorance theory.\n\n2. Determine whether it is moral or immoral for commercial and investment banks to utilize structured investment vehicles to remove their mortgage-related assets and liabilities from their financial statements?\n\nBanks sold their mortgage loans to their structured investment vehicles (SIV); the SIV borrowed money in the commercial paper market to pay for the mortgages; and the banks used the sales proceeds to make more loans. Because their balance sheet did not change, banks avoided additional reserve requirements; because the banks did not have to report the loans on their balance sheet, the significant debt incurred by the SIV was hidden from view. The lack of transparency in the shadow banking and derivatives markets, the steps banks took to hide their high leverage before the end of their accounting reporting period, and the bank’s concealment of debt in their SIV constitute deception, and hence would be deemed unethical under Kant’s means-only principle and Rawls’ Equal Liberty principle. Likewise, as noted above, camouflaging the banks’ level of debt was a substantial cause of the financial crisis, caused more harm than good to those affected, and constitutes a lousy universal practice. Hence banks’ hiding debt in SIV can be deemed immoral under both Act and Rule Utilitarianism.\n\n3. Determine whether it is moral or immoral to employ derivatives to hedge risk and enhance leverage.\n\nProperly employed derivatives such as options and futures contracts are essential tools to hedge financial risk. An option gives the purchaser the right to buy an asset at a specified price (the “striking price”) during the life of the option. If the price of the underlying asset goes up, the purchaser of the option can exercise the option and realize as profit the difference between the market price of the asset and the striking price in the option. If the price of the underlying asset goes down, the purchaser of the option can buy the asset in the market at the lower price and let the option expire, effectively purchasing the asset at the price that was originally satisfactory to the option’s purchaser.\n\nA futures contract requires the buyer to purchase and the seller to sell an asset at a specified price at a designated future date. The difference between the market price of the asset and the striking price is noted daily (“marked to market”). If the price of the underlying asset goes up, the gain is attributed to the buyer’s account and the loss to the seller’s account. If the price of the underlying asset goes down, the loss is attributed to the buyer’s account and the gain to the seller’s account. At the end of the contract term the account is settled and closed. The asset underlying the futures contract is usually never actually delivered. Rather the purchaser buys the asset at the current market price. If the price of the asset increased during the term of the futures contract, the gain made by the purchaser offsets the increased price. If the price of the asset decreased during the term of the futures contract, the purchaser buys the asset at the lower price, but the loss realized on the futures contract effectively permits the buyer to purchase the asset at the price that was originally acceptable. The markets in which options and futures contracts are traded provide an invaluable tool to the marketplace: they permit investors hedge risk on price movements of the underlying assets, and provide valuable information about the direction in which the prices of the assets are likely to move in the future.\n\nFutures contracts are highly leveraged, because the investor has control over a large cash amount of the commodity but is only required to put up a relatively small amount of capital. At the time the futures contract is initiated, the commodity exchange requires the investor to deposit a minimum amount of money (perhaps 5–10 %) of the futures contract. This deposit (called “the initial margin”) is increased or decreased on a daily basis depending on the movement of the price of the underlying commodity. If the margin drops below a designated amount (called the maintenance margin), the broker will ask the investor to make an additional deposit into the account to bring the account at least up to the initial margin. This request is called a margin call. Because the futures contract is highly leveraged, the investor can realize significant gains (or losses) on substantial amounts of commodities with comparatively small levels of capital. For example, if the futures contract enables the investor to acquire $250,000 of a commodity on an initial margin of $12,500, a 6 % increase in the price of the commodity would provide the investor with a profit of $15,000 (or 150 % of the initial margin). If the price of the commodity decreased by 6 %, however, the investor would realize a loss of $15,000 (150 % of the initial margin), causing the investor to come up with $5,000 in addition to the original margin.\n\nThe fact that derivatives markets enable investors to hedge losses and use significant leverage is neither moral nor immoral. Regulated by the Commodity Futures Trading Commission, the U.S. derivatives markets provide essential transparency into worldwide forces affecting prices of commodities and permit hedgers and speculators achieve their investment objectives. In contrast, the manner in which the banks engaged in derivatives transactions in over-the-counter derivatives markets was secretive, and fueled suspicion and fear about the financial condition of the parties when the defaults in MBO and CDO became known. The wretched stew of unwatchful regulators, unbridled mortgage-lending standards, subprime mortgages, and unregulated shadow banking and derivatives transactions caused the financial system to freeze and triggered a horrendous financial crisis.\n\nOTC Derivatives Market\n\n1. Assess whether passage of the Commodity Futures Modernization Act of 2000, which exempted the over-the-counter derivatives market from any government regulation, constitutes ethical government policy.\n\nAs noted in endnote 17, the Commodity Futures Modernization Act of 2000 (CFMA) deregulated the over-the-counter derivatives market and eliminated oversight by the Commodities Futures Trading Commission (CFTC). The law also repealed a ban on single stock futures transactions, and preempted application of state laws that otherwise could have made over-the-counter derivatives transactions illegal. In short, the CFMA effectively immunized over-the-counter derivatives from all regulation or oversight. If the over-the-counter derivatives market were subject to the regulation of CFTC, significantly more transparency would have been provided to the derivatives transactions, to the massive amounts of derivatives issued and purchased by the banks, and to the significant level of leverage they provided. If the players in the shadow banking system—Fannie Mae and Freddie Mac, commercial and investment bank securitizers, bank SIVs, hedge funds, private equity funds, asset managers and mutual, pension and other investment funds—had greater insight in the huge amounts of derivatives traded and CDS issued, financial sanity and safeguards could have been instituted earlier and the financial crisis avoided. If so, enacting CFMA into law likely produced more harm than good to those affected, and did not constitute a rule of conduct that produced more good than harm to those affected, and hence is deemed unethical under Act and Rule Utilitarianism. Further, CFMA permitted the parties to the derivatives to shroud the transactions in secrecy and hide the massive financial risk assumed by the shadow banking participants, especially the GSEs, the commercial and investment banks, and AIG. Likewise, the lack of transparency and sheer complexity of the over-the-counter derivatives permitted by CFMA cannot survive the deception tests of Kant’s categorical imperative and Rawls’ Equal Liberty theory. Enacting CFMA, then, can be considered unethical.\n\n2. Discuss the ethics of the “self-correcting market” philosophy which eschews prescriptive government regulation of the derivatives market and imposes the risk of loss on investors as a regulatory scheme?\n\nBanking regulators depended on the bank’s internal risk management systems to assess the financial soundness of the institution and, rather than duplicating the risk management tests, provided feedback on the quality of its risk management systems. This approach assumed the financial institution appreciated the self-correcting nature of markets and, acting in its own self-interest, would not inflict financial harm on itself by engaging in overly risky transactions and suffering the consequences. This deference to self-correcting markets inhibited regulators from imposing prescriptive restrictions on banks, and permitted the regulators to take a “wait and see” approach as the news of troubling mortgage practices became more persistent. Once the regulators became aware that the mortgage problem was real, they drafted non-binding guidance statements on non-traditional mortgages, and asked the banks to consider the buyer’s ability to pay the loan when higher rates of interest or balloon payments kicked in and to use “no doc” and “low doc” loans cautiously. The advisory approach employed by the regulators opened the door to delaying tactics on the part of the banks, and postponed the implementation of effective regulation to clean up the mortgage writing practices until it was too late. Following the “self-correcting market” ideology is immoral under Act Utilitarianism, because doing so was a substantial cause of the financial crisis and inflicted more harm than good on those affected. The rule of conduct that likely produces the greatest amount of good to those affected is to take prompt and clear regulatory action to cure the mortgage market problem, rather than waiting for the market to inflict the self-correction on the financial institutions. Hence not following that rule can be considered unethical. Taking prompt and clear corrective regulatory action likely might not be a practice financial institutions like, but probably constitutes a practice that is best for the financial markets and hence can be imposed on all financial institutions under Kant’s categorical imperative. Taking prompt and clear corrective regulatory action is likely an acceptable practice when viewed from behind the veil of ignorance, and hence would be deemed moral under Rawls’ justice principle."}, {"url": "https://www.investopedia.com/ask/answers/102814/what-debt-cannot-be-discharged-when-filing-bankruptcy.asp", "page_content": "Not all debts can be discharged trough bankruptcy, including child support, alimony, certain unpaid taxes, and more. Other types of debt, like student loan debt, is very difficult to get discharged. Most other loan debt can be alleviated through bankruptcy.\n\n\n\nBankruptcy offers people who are overwhelmed by debt an opportunity for a fresh start through either liquidation (Chapter 7) or reorganization (Chapter 13). In both cases, the bankruptcy court can discharge certain debts, but not all types of debt. Once a debt has been discharged, the creditor can no longer take action against the debtor, such as attempting to collect the debt or seizing any collateral.\n\nLearn more about what kind of loan debt is not alleviated when you file for bankruptcy, and what kind of debt is difficult to discharge.\n\nKey Takeaways Types of debt that cannot be discharged in bankruptcy include alimony, child support, and certain unpaid taxes.\n\nOther types of debt that cannot be alleviated in bankruptcy include debts for willful and malicious injury to another person or property.\n\nIf you do not list a debt on your bankruptcy, it will not be alleviated.\n\nCertain debts, like student loans, can be discharged only in rare cases.\n\nChapter 7 vs. Chapter 13\n\nChapter 7 and Chapter 13 are the two most common types of personal bankruptcy.\n\nIn a Chapter 7 bankruptcy, a trustee appointed by the bankruptcy court will liquidate (sell off) many of your assets and use the proceeds to pay your creditors some portion of what you owe them. Certain assets are exempt from liquidation. Those typically include part of the equity in your home and automobile, clothing, any tools you need for your work, pensions, and Social Security benefits.\n\nYour nonexempt assets that can be sold off by the trustee include property (other than your primary home), a second car or truck, recreational vehicles, boats, collections or other valuable items, and bank and investment accounts.\n\nIn Chapter 7, your debts are typically discharged about four months after you file your bankruptcy petition, according to the Administrative Office of the U.S. Courts. Bankruptcy is governed by federal law and overseen by federal bankruptcy courts, although some rules differ from state to state.\n\nIn a Chapter 13 bankruptcy, by contrast, you commit to repaying an agreed-upon portion of your debts over a period of three to five years. As long as you meet the terms of the agreement, you are allowed to keep your otherwise-nonexempt assets. At the end of the period, your remaining debts are discharged.\n\nIn general, people with fewer financial resources choose Chapter 7. In fact, to be eligible for Chapter 7, you must submit to a means test, proving that you would be unable to repay your debts. Otherwise, the court may determine that Chapter 13 is your only option.\n\nDebts Never Discharged in Bankruptcy\n\nWhile the goal of both Chapter 7 and Chapter 13 bankruptcy is to put your debts behind you, not all debts are eligible for discharge.\n\nThe U.S. Bankruptcy Code lists 19 different categories of debts that cannot be discharged in Chapter 7, Chapter 13, or Chapter 12 (a more specialized form of bankruptcy for family farms and fisheries).\n\nWhile the specifics vary somewhat among the different chapters, the most common examples of non-dischargeable debts are:\n\nAlimony and child support.\n\nCertain unpaid taxes, such as tax liens. However, some federal, state, and local taxes may be eligible for discharge if they date back several years.\n\nDebts for willful and malicious injury to another person or property. “Willful and malicious” here means deliberate and without just cause. In Chapter 13 bankruptcy, this applies only to injury to people; debts for property damage may be discharged.\n\nDebts for death or personal injury caused by the debtor’s operation of a motor vehicle while intoxicated from alcohol or impaired by other substances.\n\nDebts that you failed to list in your bankruptcy filing.\n\nIf you file for a Chapter 7 bankruptcy, then you will also continue to owe any condominium or cooperative association fees, along with any other debts that were not discharged in a prior bankruptcy.\n\nYou can usually keep your car by reaffirming your car loan and continuing to make payments. Similarly, you can usually keep your home if you declare bankruptcy, even if you owe money on it, as long as you continue making the payments and don’t have more equity than you are permitted under state and federal bankruptcy laws.\n\nInvestopedia / Ellen Lindner\n\nImportant If you have income tax or student loan debt, then you may be able to negotiate a workable repayment plan without filing for bankruptcy.\n\nDebts That Are Difficult to Discharge in Bankruptcy\n\nStudent loans are among the type of debt that is difficult to alleviate when you file for bankruptcy. You must demonstrate undue hardship to yourself or your dependents, such as being unable to maintain a minimal standard of living.\n\nIn some cases, a court may discharge part, but not all, of your student loan debt. If student loan debt is a major reason for your considering bankruptcy, contact your loan servicer first and see if it’s possible to negotiate a repayment plan that would work for you. In the case of federal student loans, for example, several repayment plans are available.\n\nYou cannot have income tax debts discharged without a special exemption, which can only be obtained by petitioning the bankruptcy court and explaining why you deserve relief. So if you have income tax debts that you cannot repay, then you may be better off consulting with a tax attorney to discuss your options before filing for bankruptcy.\n\nIn the case of federal taxes, for example, the Internal Revenue Service (IRS) can offer several alternatives to people who are unable to pay what they owe. One is an offer in compromise, in which the IRS agrees to accept a lesser amount. The IRS may also arrange for a payment plan, or an installment agreement, that will allow you to pay your taxes over an extended period of time.\n\nYour creditors can stop certain debts from being discharged. They may also ask the court for relief from the automatic stay that prevents them from pursuing collection activity.\n\nDebt Relief Alternatives to Bankruptcy\n\nBankruptcy has serious consequences. A Chapter 7 bankruptcy will remain on your credit reports for 10 years, and a Chapter 13 will remain for seven years. That can make it more expensive or even impossible to borrow money in the future, such as for a mortgage or car loan, or to obtain a credit card. It can also affect your insurance rates.\n\nSo it’s worth exploring other types of debt relief before filing for bankruptcy. Debt relief typically involves negotiating with your creditors to make your debts more manageable, such as reducing the interest rates, canceling some portion of the debt, or giving you longer to repay. Debt relief often works to the creditor’s advantage, too, as they are likely to get more money out of the arrangement than if you were to declare bankruptcy.\n\nYou can negotiate on your own or hire a reputable debt relief company to help you. As with credit repair, there are scam artists who pose as debt relief experts, so be sure to check out any company that you’re considering. Investopedia publishes a regularly updated list of the best debt relief companies.\n\nIs it Better to Claim Bankruptcy or Settle Debt? Debt settlement and bankruptcy can both help you achieve a fresh start by eliminating debts that you cannot pay. However, they both will negatively impact your credit score. Bankruptcy can be a faster process, but will likely have longer-term impact on your credit score.\n\nWhat Is the Downside of Filing for Bankruptcy? Bankruptcy's main downside is that it will remain on your credit report for up to seven years and negatively impact your credit score. This can make it more difficult to get approved for loans or get the best interest rates on loans such as mortgages, car loans, or personal loans.\n\nCan You File for Bankruptcy for Student Loans? If you declare bankruptcy, you typically do not have your federal or private student loan discharged. Student loans can potentially be alleviated by making a separate filing known as an \"adversary proceeding.\"\n\nThe Bottom Line\n\nBankruptcy can help you eradicate debt that has become unmanageable to the point where you cannot pay it. However, it does have some downsides to keep in mind, including a long-term impact on your credit score. Weigh all your options as well as the pros and cons of filing for bankruptcy before you take action, and consider consulting with a professional financial advisor.\n\n"}, {"url": "https://www.investopedia.com/terms/d/default2.asp", "page_content": "What Is a Default?\n\nDefault is the failure to make required interest or principal repayments on a debt, whether that debt is a loan or a security. Individuals, businesses, and even countries can default on their debt obligations. Default risk is an important consideration for creditors.\n\nKey Takeaways A default occurs when a borrower stops making the required payments on a debt.\n\nDefaults can occur on secured debt, such as a mortgage loan secured by a house, or unsecured debt, such as credit cards or a student loan.\n\nDefaults expose borrowers to legal claims and may limit their future access to credit.\n\n1:33 Default\n\nUnderstanding a Default\n\nA default can occur on secured debt, such as a mortgage loan secured by a house or a business loan secured by a company's assets. If a borrower fails to make timely payments, the loan could go into default and the asset, or collateral, used to secure it would then be in jeopardy. Similarly, a company unable to make required coupon payments on its bonds would be in default.\n\nDefaults can also occur on unsecured debt such as credit card balances. A default reduces the borrower's credit rating and may limit their ability to borrow in the future.\n\nDefaulting on Secured Debt vs. Unsecured Debt\n\nWhen an individual, a business, or country defaults on a debt, its lenders or investors may sue to recover the funds. Their recovery prospects will depend, in part, on whether the debt is secured or unsecured.\n\nSecured Debt\n\nIf a borrower defaults on a mortgage, the bank may ultimately foreclose on the home that secures the mortgage. If a borrower defaults on an auto loan, the lender can repossess the vehicle. These are examples of secured loans. With a secured loan, the lender has a legal claim to a particular asset acquired with the loan.\n\nCorporations in default on secured debt may file for bankruptcy protection to avoid forfeiture, providing time for negotiations on a settlement with creditors.\n\nUnsecured Debt\n\nA default can also occur on unsecured debt, such as medical bills and credit card balances. While unsecured debt is not backed by an asset, the lender still has a legal claim in the event of a default. Credit card companies often wait a few months before sending an account into default.\n\nAfter six or more months without payments on an outstanding balance, the debt would get charged off, meaning the lender would write it off as a loss and close the account. The creditor may then sell the charged-off debt to a collection agency, which would then attempt to collect from the borrower.\n\nWhen a default involves unsecured debt, a collection agency that buys the debt may have a lien, or judgment, placed against the borrower's assets. A judgment lien is a court ruling that gives creditors the right to take possession of a debtor's property if the debtor fails to fulfill contractual obligations.\n\nDefaulting on a Student Loan\n\nStudent loans are another type of unsecured debt. Defaulting on a student loan has the same consequences as failing to pay off a credit card, affecting your credit rating and your future loan prospects. Those who default on federal student loans may also face wage garnishment.\n\nFirst, You’re \"Delinquent\"\n\nWhen your loan payment is 90 days overdue, it is officially delinquent. That fact is reported to all three major credit bureaus. Your credit rating will fall. That means new credit applications may be denied, or approved only at a higher interest rate charged to riskier borrowers.\n\nA bad credit rating can follow you in other ways. Potential employers, especially for any employee needing a security clearance, and potential landlords, often check the credit score of applicants.\n\nNext, You’re \"in Default\"\n\nOnce payment is at least 270 days late, the loan will end up in default. About one-third of federal student loan borrowers have been in default at some point.\n\nBorrowers who don't enter a loan rehabilitation agreement with Default Resolution Group at the department's Office of Federal Student Aid, you may eventually be subject to withholdings of tax refunds and other federal payments as well as garnishments of up to 15% of take-home pay.\n\nIf your federal student loans are in default, you can enter the federal student loan rehabilitation program or you can use loan consolidation.\n\nDeferment or Forbearance\n\nA good first step is to contact your lender as soon as you realize that you may have trouble keeping up with your payments. The lender may be able to work with you on a more attainable repayment plan or help you obtain deferment or forbearance on loan payments.\n\n\n\nTemporary Aid for Student Loan Borrowers\n\nStudent loan payments and the accumulation of interest on outstanding loans were suspended by the Department of Education (DOE) as a COVID-19 relief measure.\n\nIn November 2022, the DOE extended the pause on federal student loan payments in response to a federal court order blocking the White House’s student loan forgiveness plan.\n\nStudent loan payments will resume 60 days after the department is permitted to implement the program or the litigation is resolved. However, if the program has not been implemented and the litigation has not been resolved by June 30, 2023, payments will resume 60 days after that.\n\nIn April 2022, the DOE launched the \"Fresh Start\" initiative, which helps borrowers in default keep some benefits while getting out of default. During the temporary program (which lasts one year after the COVID-19 pause on student loan payments is lifted), collections are stopped, you can apply for federal student aid, and your loan will be reported as \"current\" rather than \"in collections\" on your credit report.\n\nSovereign Default\n\nSovereign default occurs when a country does not repay its debts. Unlike an individual or corporate debtor, a country in default usually cannot be compelled to satisfy its obligations by a court, though it faces a variety of other risks and problems.\n\nThe economy might go into recession, or the currency might devalue. The defaulting country may be shut out of debt markets for years to come.\n\nSovereign default can occur for a variety of reasons, including political unrest, economic mismanagement, or a banking crisis. In 2015, Greece defaulted on a $1.73 billion payment to the International Monetary Fund (IMF) before securing additional debt relief from the European Union.\n\nDefaulting on a Futures Contract\n\nDefaulting on a futures contract occurs when one party does not fulfill the obligations set forth by the agreement. Defaulting here usually involves the failure to settle the contract by the required date.\n\nA futures contract is a legal agreement for a future transaction involving a particular commodity or asset. One party to the contract agrees to buy at a specific date and price while the other party agrees to sell at the contract-specified milestones. If one party defaults, they could face collections actions and lawsuits, among other things.\n\nWhat Happens When You Default on a Loan?\n\nWhen a borrower defaults on a loan, the consequences can include:\n\nNegative remarks on a borrower's credit report and a lower credit score, a numerical measure of a borrower's creditworthiness\n\nReduced likelihood of obtaining credit in the future\n\nHigher interest rates on any new debt\n\nGarnishment of wages and other penalties. Garnishment refers to a legal process that instructs a third party to deduct payments directly from a borrower’s wages or bank account.\n\nA default will stay on your credit reports and be factored into your credit scores for seven years, according to credit bureau Experian.\n\nReal World Example\n\nPuerto Rico defaulted in 2015 when it paid only $628,000 toward a $58 million bond payment. Damage from Hurricane Maria in 2017 exacerbated the island's economic and debt crisis.\n\nIn 2019, Puerto Rico announced plans to cut its debt to roughly $86 billion from $129 billion in the largest bankruptcy in U.S. history. The bankruptcy filing was authorized under a 2016 law passed by Congress. The Puerto Rico Oversight, Management, and Economic Stability Act (PROMESA) also established a financial oversight board to oversee the territory's public finances.\n\nIn early 2022, a U.S. judge approved a restructuring plan cutting Puerto Rico's $70 billion public debt to $37 billion as part of the bankruptcy process.\n\n\n\nWhat Happens When You Default on a Payment? When you default on a loan, your account is sent to a debt collection agency that tries to recover your outstanding payments. Defaulting on any payment will reduce your credit score, impair your ability to borrow money in the future, lead to fees, and possibly result in the seizure of your personal property.\n\nHow Long Does a Default Stay on Your Credit Report? Defaults stay on your credit report for seven years. This is the standard time it takes for a default will be removed. A default may be removed earlier if it can be proven that it was a mistake. Once it is removed, your credit score should improve.\n\nWhat Is an Example of a Default? A default is a missed or multiple missed payments on money that you have borrowed. An example of a default would be not paying your credit card bill or your monthly mortgage payment.\n\nThe Bottom Line\n\nDefault is the failure to make required interest or principal repayments on debt. Individuals, businesses, and countries can default on debt obligations. Failure to meet payments on a mortgage, student loan, or personal loan will affect an individual's credit rating, their ability to secure future loans, and could result in the seizure of property or wages. Corporations may default by failing to meet coupon payments on bonds and sovereign default occurs when a country does not repay its debts.\n\n"}, {"url": "https://www.npr.org/2020/01/22/797330613/myth-busted-turns-out-bankruptcy-can-wipe-out-student-loan-debt-after-all", "page_content": "Myth Busted: Turns Out Bankruptcy Can Wipe Out Student Loan Debt After All\n\nEnlarge this image toggle caption Mitch Blunt/Getty Images/Ikon Images Mitch Blunt/Getty Images/Ikon Images\n\nA few years ago, Lauren had a big problem. The Queens, N.Y., resident had graduated from college with an art degree as the Great Recession had hit. She had private student loans with high interest rates. For work, all she could find were retail jobs. And by 2016, her loans had ballooned to about $200,000.\n\n\" 'I can't afford to actually pay my bills and eat and pay my rent,' \" she remembers thinking. \"I was financially handicapped. I mean, my student loan payments were higher than my rent was.\"\n\nSo Lauren started to look into bankruptcy. She doesn't want her last name used because she thinks all this might hurt her job prospects.\n\nOver the years, a myth has taken hold that you can't get student debt reduced or wiped out through bankruptcy. But many bankruptcy judges and legal scholars say that's wrong. And bankruptcy can be a way to get help.\n\nBankruptcy is not fun. Your credit gets destroyed for years, and you have to be in pretty dire financial straits for it to make sense. But if you reach that point, you can get your debts reduced or erased through bankruptcy so you can get back on your feet.\n\nBut the lawyers Lauren called said that with student loans it's different because there are special rules for student debt.\n\n\"They had told me things like you have to have a disability where you're not able to even work,\" she says. \"And I was like, 'Well, but that doesn't make any sense.' \"\n\nJason Iuliano, a Villanova University law professor, says that over the past 30 years, Congress has made it harder to discharge student debt. You need to meet what's called an \"undue hardship\" standard. That also means more work for your lawyer.\n\nBut Iuliano says that this has created the misconception that it's nearly impossible to get help for student debt through bankruptcy. That's not true.\n\nIuliano did some research and says a quarter-million student loan debtors file for bankruptcy each year. They do that because they have credit card debt or other debts and they can get those reduced or erased.\n\nBut when it comes to trying to get their student debt forgiven, \"more than 99% of the student loan debtors in bankruptcy just give up without even trying,\" Iuliano says. \"It struck me as a really surprising statistic when I first uncovered it.\"\n\nFor those who do try, though, Iuliano's research finds that about half the time the person gets some or all of the student loan debt erased. One study he did found that they got help through bankruptcy about 40% of the time. And he says more recent data from this past year show that figure rising to more than 50% of the time.\n\n\"So I think that's really important for bankruptcy attorneys to see that there are judges out there who are willing to grant undue-hardship discharges and that people are much more likely to obtain relief in bankruptcy for their student loan debt,\" Iuliano says.\n\nJust this month, a federal judge in New York discharged more than $220,000 in student loans for a borrower. In her ruling, Chief Bankruptcy Judge Cecelia Morris criticized the fact that even many lawyers \"believe it impossible to discharge student loans.\" She added, \"This Court will not participate in perpetuating these myths.\"\n\nRobert Lawless, a law professor at the University of Illinois, says, \"I think we're reaching a tipping point with what the bankruptcy courts are doing.\" He says he hopes more people are able to get help through bankruptcy.\n\nBut he says the rules are still too restrictive. Lawless researched the issue with a group of attorneys and former judges for the American Bankruptcy Institute, a professional organization. They're recommending that Congress rewrite the rules on student loans in bankruptcy. Under the proposal, Lawless says, \"after seven years from when the loans became due, they would be treated pretty much like any other debt in a bankruptcy case.\"\n\nThere is at least some support for that in Congress. Part of the obstacle now is that the current rules often require paying your lawyer more money to attempt to get student debt forgiven.\n\nLawless says it costs on average about $1,200 to file a typical Chapter 7 bankruptcy case. Bankruptcy attorneys say it can cost thousands of dollars more to pay your lawyer to jump through the extra hoops related to student loan debt, unless you find one who will do that for a reduced rate.\n\nIuliano says the outcome and how much student debt is forgiven, if any, can have a lot to do with what particular judge you end up with and what the rules are in that bankruptcy district.\n\nSome of that is because of the language of the original statute stating that student loan borrowers have to meet a threshold of \"undue hardship,\" he says. Iuliano says Congress has never defined what that means, so a lot of discretion is left up to the courts and the particular judge you get.\n\nHarrison Wadsworth, a consultant for the Consumer Bankers Association, notes that most student loans are issued by the government. But for loans from private lenders, he says relaxing the bankruptcy rules to make it easier to reduce or eliminate student debt could push up interest rates. \"Lenders would have to be careful about making loans and probably have to charge more for them,\" Wadsworth says.\n\nLauren eventually found a lawyer who took her case and charged her about $3,000, doing some of the work pro bono. And going through bankruptcy, she got her debt reduced from about $200,000 to around $100,000, with the bulk of that reduced to a 1% interest rate.\n\n\"It's still a lot of money,\" she says. But she says, \"I was extremely relieved.\"\n\nLauren says it is significantly less than she owed before. And she says the payments are manageable.\n\n\"And because they lowered the interest, I'm actually paying off the loan,\" she says. So she says she can recover financially, which Lawless says is what bankruptcy is there for."}, {"url": "https://www.encyclopedia.com/education/news-and-education-magazines/housing-1929-1941", "page_content": "Housing 1929-1941\n\n\"The literally thousands of heart-breaking instances of inability of working people to attain renewal of expiring mortgages on favorable terms, and the consequent loss of their homes, have been one of the tragedies of this depression\" (quoted in Glaab and Brown, A History of Urban America, 1983, p. 299). President Herbert Hoover (served 1929–1933) wrote these words in a letter during his term in office. The problem of foreclosures quickly became critical as the Great Depression began. In 1932, 273,000 people lost their homes. During the next year, a thousand mortgages a day were being foreclosed.\n\nFrom the time urban settlements first appeared in America during the eighteenth century, selecting, constructing, and purchasing a place to live had been left to the individual. Housing was not considered an appropriate responsibility of government. However, since the mid-nineteenth century, social reformers recognized some housing in cities as inadequate and demanded changes. In 1929, with the onset of the Great Depression, housing problems quickly worsened. The building of new homes came almost to a halt, repairs went unfinished, and slums expanded. The crisis in housing attracted special attention. Many believed an upturn in construction activity was key to stimulating economic recovery.\n\nAnother critical housing situation facing Americans in the early years of the Great Depression was foreclosure. Thousands of homeowners were unable to make payments on their home loans, known as mortgages. This situation, called default, led to fore-closure by the holder of the mortgage, generally a bank. In foreclosure the bank seizes and auctions off the borrower's property to pay off the mortgage. By 1933, 40 to 50 percent of all home mortgages in the United States were in default. The home financing system was sliding toward complete collapse. The default and subsequent foreclosure of mortgages was a major contributor to the banking crisis of the early 1930s.\n\nBeginning in the 1930s, the U.S. federal government, recognizing the need for government intervention, attacked the housing problems on two broad and distinct fronts. First, in the early 1930s, Congress passed three measures to relieve both distressed homeowners and banks and, as a result, to get new construction restarted. First, during President Herbert Hoover's stay in the White House, the Home Loan Bank Act of 1932 was passed. Then, as part of the broad-ranging New Deal economic policies under President Franklin Delano Roosevelt (served 1933–1945) came the Home Owners' Refinancing Act of 1933 that created the Home Owners' Loan Corporation (HOLC) and the National Housing Act of 1934 that created the Federal Housing Authority (FHA). The HOLC began as an emergency agency to stop the avalanche of homeowner defaults. It accomplished this by refinancing shaky mortgages. The HOLC's lasting legacies were long-term, low-interest, mortgages, and the establishment of uniform national appraisal methods throughout the real estate industry. The FHA's enduring legacies were long-term mortgages insured by the federal government and the establishment of national standards of home construction. The beneficiaries of these programs were typically white, middle-class individuals who could afford to buy houses in the first place. Their houses were generally built on the outskirts of cities, in the suburban areas.\n\nThe second major housing front dealt with the inner-city slums. Initiatives in this area involved the federal government using public tax money to build dwellings for the benefit of those who could not pay market rates for shelter. The New Deal's Wagner-Steagall Housing Act of 1937 became the first housing legislation where the federal government recognized housing as a social need. Slowly, the idea to provide temporary housing for those in need evolved to providing permanent housing for the most disadvantaged members of society. The locations of these structures were almost always in the poorest parts of central cities. Unlike obtaining help for private homeowners, getting public support for housing programs for the most needy citizens was much tougher in 1930s America. As a result, public housing initiatives met with very limited success in the late 1930s.\n\nChronology:\n\n1931–1932: More than 3,600 banks suspend operations. 1931: President Herbert Hoover convenes the National Conference on Home Building and Home Ownership to address the emergency in the construction industry and the rising number of home fore-closures. July 21, 1932: Congress passes the Emergency Relief and Reconstruction Act to address low-income housing. July 22, 1932: President Hoover signs the Federal Home Loan Bank Act to establish a monetary reserve for mortgage lenders. June 13, 1933: Congress passes the Home Owners' Refinancing Act that establishes the Home Owners' Loan Corporation (HOLC) to reduce home foreclosures by refinancing homeowners' loans. April 28, 1934: Congress passes the Home Owners Loan Act of 1934, further strengthening the HOLC. June 27, 1934: Congress adopts the National Housing Act which establishes the Federal Housing Administration (FHA). September 3, 1937: President Franklin D. Roosevelt signs the National Housing Act (Wagner-Steagall Housing Act) of 1937 which creates the United States Housing Authority (USHA). February 3, 1938: Amendments liberalizing the National Housing Act of 1934 are adopted. 1940: The first comprehensive nationwide housing survey is completed. The housing survey would be conducted every ten years in tandem with the census.\n\nThe creation of the Federal National Mortgage Association (Fannie Mae) under the Reconstruction Finance Corporation (RFC) in 1938 completed the New Deal's housing program. Fannie Mae bought mortgages from lenders such as banks, thus increasing the lenders' funds for more mortgages and construction loans. Combined, the New Deal housing policies removed much of the risk from home lending. The FHA and Fannie Mae neither built houses nor loaned money. Their backing, however, provided banks with the assurance that construction and home loans would be repaid with government funds should the loans fall into default. Thus, banks made loans more readily to both builders and homeowners. This stimulated construction and provided a framework for the post-World War II (1939–1945) housing boom. The dream of owning a home came within the reach of all but the nation's poorest.\n\nThe American attitude against government intervention in individuals' lives fundamentally shifted with the onset of the Great Depression. The Depression dealt severe blows to both the construction industry and the homeowner. Between 1929 and 1933, construction of residential property fell 95 percent. Repair expenditures decreased from $50 million to $500,000. In 1932 between 250–275,000 people lost their homes to foreclosure. In comparison, 68,000 homes suffered foreclosure in 1926. By 1933 foreclosures reached the appalling rate of more than a thousand each day. Housing values dropped by approximately 35 percent. A house, worth $6,000 before the Depression, was worth approximately $3,900 in 1932. By the early 1930s, many people owed more money through their existing mortgages than the reduced value of their home. With loss or cut back in employment and the loss of their homes, many middle-class families were experiencing their first taste of impoverishment.\n\nAs early as 1930, President Herbert Hoover recognized that the deteriorating real estate and construction industries were dragging down an already embattled economy. The overall unemployment numbers continued to skyrocket, and approximately one-third of those unemployed had worked in construction. Hoover convened the President's National Conference on Home Building and Home Ownership in 1931. The purpose of the conference, attended by over four hundred housing specialists, was to deal with the emergency in the construction industry and with foreclosures.\n\nThe conference formulated four recommendations. The recommendations ultimately provided the basis for twentieth-century federal housing policies. They were: (1) the amortization of long-term mortgages; (2) the encouragement of low-interest mortgage rates; (3) lowering the cost of home construction; and (4) providing government monetary aid to private efforts to build low-income housing. (Amortization means the payback of a loan by periodic, usually monthly, payments of principle [the amount of the loan owed] and interest [money paid for use of the lender's money]. The monthly payment amount remains the same throughout the payback period. The result is a declining principle balance with eventual repayment of the loan in full.) The conference members also announced that they firmly believed private industry could accomplish these goals with planning and cooperation. Looking to the future, however, they sternly warned that the failure of private industry would lead to government intervention into housing.\n\nTwo Unsuccessful Programs\n\nDisagreeing with the ideas promoted by the National Conference, the National Association of Home Builders immediately responded that private contractors alone could not build homes at affordable prices. They demanded prompt government assistance. Taking this perspective and the recommendation from the conference under consideration, the Hoover administration tried two approaches in 1932. On July 22, 1932, the president signed the Federal Home Loan Bank Act. The act established a monetary (loan) reserve for mortgage lenders—generally banking institutions. This reserve would increase the supply of money available for housing loans to encourage new housing starts and reduce foreclosures. The program, however, proved ineffective since it was not designed as an emergency measure. Loans could not be made to anyone who owed more than 40 percent of the value of their home. For example, an individual might owe $4,000 on a $10,000 home. Before the Depression in 1929, when their home was worth $10,000, they would have qualified because they did not owe more than 40 percent of the value of their home. If the value of their home had declined by 1932 to $6,000, however, their $4,000 mortgage was considerably more than 40 percent so they could not qualify. Everyone's home value had, in fact, drastically decreased after the onset of the Depression. Within the first two years of the act's operation, 41,000 applications for direct loans were made to the banks by individual homeowners. Only three were approved.\n\nPresident Hoover's second effort, the Emergency Relief and Construction Act of 1932, was equally ineffective. This act enabled the RFC to make loans to corporations formed specifically to construct low-income housing and improve housing in slums. The catch here was that the legislation required states to exempt these corporations from all taxes. At that time only the state of New York had legal authority to make such exemptions. Other state legislatures had not had the public support to pass such tax law exemptions. As a result, the only project ever begun under this legislation was Knickerbockers Village in New York City.\n\nNeither of Hoover's approaches halted the slide of the housing industry or the rapidly worsening predicament of homeowners. For the moment the fledgling framework for a realistic home mortgage system and improved housing for all, envisioned in Hoover's 1931 conference, was threatened by a wave of public disappointment with Hoover's ineffective programs. In March 1933 the problems transferred to the incoming Roosevelt administration.\n\nA Man of the Country\n\nFranklin D. Roosevelt, inaugurated as the 32nd president of the United States on March 4, 1933, was in heart and soul a child of the country. He believed the country bred a \"better man.\" In his perfect world, Roosevelt would have solved the housing problem by moving everyone back to the land—out to country spaces. But Roosevelt's utopia sharply contrasted with reality. Despite the general public's widespread dissatisfaction with urban Depression life, the drift of population out of agricultural areas and into cities continued through the 1930s. The agricultural industry had been economically depressed since the early 1920s, and job opportunities seemed greater in the industrial city centers. Roosevelt was a practical man and knew that the Depression-era urban housing problems would have to be solved within the urban setting.\n\nRoosevelt and those creating New Deal policies faced a choice between two different paths in housing issues. They could support proposals from congressional liberals such as Senator Robert F. Wagner for large-scale European-style public housing projects. On the other hand, they could develop measures to stimulate private home construction and individual home ownership, the path Hoover had attempted to take. New Dealers basically adopted Hoover's approach but would carry it much further. Roosevelt believed private home ownership was fundamental to the American way of life. He had the notion of the ideal home as a single detached structure surrounded by a small plot of land. Multifamily dwellings held little interest for him. With nearly 30 percent of the nation's joblessness involving workers in the building trades, Roosevelt decided he must place special emphasis on reviving the housing sector. New Deal help for the home construction industry and homeowners would follow a different path from later New Deal efforts to deal with inner-city housing for the poor.\n\nNew Deal Help for Homeowners and the Home Construction Industry\n\nHome Owners' Loan Corporation On June 13, 1933, Congress passed the Home Owners' Refinancing Act that established the Home Owners' Loan Corporation (HOLC). The HOLC's goal was to stop the flood of homeowner foreclosures in urban areas. The foreclosure situation not only devastated homeowners but undermined the holdings of banks and other lending institutions. Normally, when banks foreclosed, they would sell the foreclosed property to a buyer to cover the mortgage loan. Buyers were often investors hoping to resale the property for a profit. Since no market for mortgages existed, however, few buyers were available. Those that were buying mortgages paid extremely low prices that rarely covered the loan amount for the bank.\n\nThe HOLC replaced Hoover's unworkable Federal Home Loan Bank Act. It provided loan money to refinance tens of thousands of mortgages in danger of default and foreclosure. Refinancing refers to setting up a loan under new terms of payment of principle and interest that makes it easier for the homeowner to repay the loan. The HOLC even helped persons who lost homes as early as January 1930 to recover their homes. A second act, the Home Owners Loan Act of 1934, passed the following year. This act guaranteed payment of the principle and interest of HOLC loans with government funds should a homeowner fail to make payments on his loan.\n\nBy February 1936 the HOLC had refinanced 992,531 loans totaling over $3 billion. The refinanced loans not only halted countless foreclosures but reduced delinquent property taxes. This permitted communities to meet their payrolls for school, police, and other services. Millions were also spent on repair and remodeling of homes. Thousands of men gained employment in the building trade. Thousands more jobs were stimulated in the manufacture, transportation, and sale of construction materials. Conceived as an emergency agency, the HOLC stopped accepting loans in June 1935 and issued its last loans the following June. By then HOLC had refinanced up to one-fifth of all mortgaged urban homes in the nation. The HOLC spent the next fifteen years collecting its payments and in 1951 ended its operations. Although it tackled the most troubled home mortgages, the HOLC concluded operation without a loss to the government and even returned $14 million to the treasury.\n\nTo offer similar relief to rural areas, in 1933 Congress passed the Emergency Farm Mortgage Act, which was aimed at farm foreclosure, and the Farm Mortgage Refinancing Act on January 31, 1934, which was patterned after the successful HOLC. Also, to support farmers in their fight to retain their land, Congress passed the Frazier-Lemke Federal Farm Bankruptcy Acts of 1934 and 1935. The Frazier-Lemke Acts provided major financial relief to farmers heavily in debt. The acts changed general bankruptcy laws for farmers whose debts were far more than the value of their farms. Bankruptcy courts could reduce their amount of debt to approximately the same amount as the value of the farm, ensuring that the farmer would not still be hopelessly in debt even after selling his farm. The farmer also had the opportunity to retain his property if he could pay back his scaled-down debts.\n\nThe HOLC refinancing plan is important in history because it introduced and perfected the practical long-term amortizing mortgage. This amortized mortgage revolutionized the home loan and real estate industry-making home mortgages feasible for the common American. With amortized mortgages the loan was completely repaid at the end of the loan period. The HOLC-amortized loans allowed homeowners to pay a set monthly payment of principal and interest at 5 percent for 15 years. At the end of the 15-year loan period, the loan was entirely repaid, and the individual owned his home \"free and clear.\" This approach contrasted to the typical mortgage taken on during the 1920s, a boom period of home building. It was during this earlier period of rising home prices that buyers began using mortgages to finance their home purchases. The typical mortgage was for five or ten years and was not fully paid off at the end of the loan period. The buyer had to either take out another loan for the remainder or pay it off in a large payment. For example, a buyer might have bought a $5,000 home and taken out a $3,000, five-year mortgage at a typical interest rate of six to eight percent. At the end of five years, he might still owe $1,500 that he could pay off or refinance. This practice left the buyer at the mercy of money market forces over which he had no control. If money was easy to come by, he could refinance. If times were difficult and money was tight, as in the 1930s, it could be impossible to refinance. If he could not pay off the loan, foreclosure would result. The HOLC-amortized mortgages ended the need for a large payment at the end of the mortgage period and also lowered monthly payments.\n\nMore About… Redlining\n\nRedlining, by the last quarter of the twentieth century, was a standard term in the vocabulary of urban affairs. Redlining referred to the fact that property owners in certain areas could not easily obtain credit for purchase or repair of property because lending institutions had written off the areas as high risk.\n\nRedlining originated in the early 1930s as a rating system for the Home Owners Loan Corporation (HOLC). The system undervalued neighborhoods that were densely populated, mixed racially, or aging. The four HOLC categories of quality were first, second, third, and fourth, with corresponding code letters of A, B, C, and D and colors green, blue, yellow, and red. A, or green, areas were new or always in demand, such as professional residential areas. Ethnically mixed areas were never A's. B, or blue, areas were \"still desirable;\" C areas were \"definitely declining.\" D, or red, areas had physical deterioration and low income prospects. Black neighborhoods were invariably red as were those areas characterized by vandalism.\n\nHOLC appraisers literally ranked every block in every city, drawing red lines around less \"desirable\" areas, hence the redlining practices. The resulting information was then recorded on secret \"Residential Security Maps\" in local HOLC offices. The HOLC continued to offer loans in all areas, but the Federal Housing Administration (FHA) adopted the maps a few years later and refused to insure loans in the risky red areas. Likewise, private banking institutions, clearly influenced by the government's maps, did not loan in red and most yellow areas. Redlining contributed greatly to further deterioration of inner cities by discouraging the flow of capital into the areas. This pattern of discrimination continued at least until the early 1970s, contributing to the despair and frustration of the black and racially mixed communities. At that time the practice became illegal.\n\nThe HOLC made a second lasting contribution by establishing standardized appraisal methods throughout the country. Because HOLC was dealing with problem mortgages, it had to have a way to predict the useful life of the house it was asked to refinance. HOLC appraisers were highly trained in uniform procedures. They put into writing characteristics of the house, such as type of construction; price range of other nearby homes; sales demand; repairs needed; and descriptions of the occupations, income level, and ethnicity of the neighborhood's inhabitants. The ultimate aim was that one appraiser's judgment would have meaning and could be understood by investors in other parts of the nation. Although this practice is credited in raising the level of and standardizing the American real estate appraisal methods, it also had a downside that persisted for decades, called redlining. Redlining originated when appraisers drew red lines on maps outlining neighborhoods of mixed race or ethnic background. The red-lined districts were considered risky areas for loans. Although the HOLC continued to impartially issue loans in those areas, for decades other lenders would tend to loan only in \"good\" areas. This practice perpetuated discrimination and the actual decline of certain areas. Significantly, the Federal Housing Administration adopted the HOLC's excellent appraisal methods but also its redlined maps.\n\nThe Federal Housing Administration On June 27, 1934, Congress passed the National Housing Act, establishing the Federal Housing Administration (FHA). Unlike the HOLC, which was established as an emergency agency, the FHA was a permanent New Deal program. The act was designed to meet President Roosevelt's desire to stimulate building without government spending. He wanted a program that relied on private enterprise. The FHA made a powerful impact on American life throughout the rest of the twentieth century. The declared goals of the act were to encourage: (1) sound home financing on reasonable terms; (2) improvement in housing construction standards; and (3) a stable nationwide mortgage market. All of this was to be accomplished through reliance on private enterprise. The government itself would not be making direct loans.\n\nDespite the three long-term goals, the immediate purpose of the act was to stimulate employment in the construction industry which would likely ripple through the entire economy. Not only had new home construction ceased, but the general lack of funds had let homes fall into disrepair. Both new construction and repair and renovation would provide jobs and, at the same time, increase the wealth of Americans by increasing the value of their homes.\n\nThe act, through the FHA, essentially accomplished its goals. First, the FHA insured the mortgage lender against default by the borrower. If the borrower defaulted, the FHA would pay the lending institution the amount owed on the defaulted loan. Over 250,000 home mortgages, valued at more than $1 billion, were accepted for FHA insurance between 1934 and December 1, 1937. Bankers freed loan money since they assumed very little risk if the loan turned sour. With the guarantee mortgage interest rates dropped two or three percentage points, making the loans more affordable. Second, the FHA helped guarantee the loans it insured would not go bad by making the loans workable for the average American. Down payments were drastically reduced. No more than 20 percent down was required. This was further reduced to 10 percent in 1938. Next, continuing a trend by the HOLC, the FHA extended the repayment period for its guaranteed mortgages to 25 or 30 years. This time period greatly reduced the monthly payment, with the loan being paid in full at the end of the loan period. The FHA insisted all loans be amortized. The amortization insured a single stable payment amount for the length of the loan. The FHA also established minimum construction standards to ensure the dwelling would be free of major structural or mechanical deficits. This in turn ensured both the owner's satisfaction with the property and the actual value of the property.\n\nThe changes dramatically increased the number of Americans who could afford to purchase homes. According to Kenneth T. Jackson in his book Crabgrass Frontier, \"Builders went to work and housing starts and sales began to accelerate rapidly in 1936. They rose to 332,000 in 1937, to 399,000 in 1938, to 458,000 in 1939, to 530,000 in 1940, and to 619,000 in 1941\" (1985, p. 205). In 1933 housing starts had numbered only 93,000.\n\nUnfortunately, a downside to these achievements also resulted. The FHA actually contributed to innercity decay by pulling much of the middle class out to the suburbs. First, the FHA favored single-family projects in the suburban areas. It discouraged multifamily dwellings by offering only unfavorable loan terms on multifamily starts. Second, the loan amounts allowed for repair of existing homes were small. A family could just as easily purchase a new home as fix up an old one. Third, in its attempt to set construction standards, the FHA demanded such requirements as minimum lot size, distance from the street, and separation from adjacent structures. These requirements eliminated from FHA loan guarantees whole categories of many dwelling types in the city. Many city residences. were too close to the street. Therefore, existing homes that did not meet this or the other two requirements could not be FHA insured. For example, between 1935 and 1939, statistics from throughout St. Louis, Missouri revealed 92 percent of new homes insured by FHA were in the suburbs.\n\nThe FHA strove to meet its goals of stabilization of mortgage markets nationwide in two more ways: (1) the creation of mortgage associations; and (2) establishment of the Federal Savings and Loan Insurance Corporation. The mortgage associations, under FHA regulations, were to be private corporations buying and selling FHA-insured mortgages nationwide. The activities of these corporations were to be limited almost entirely to insured residential mortgages. This process could move funds from areas where mortgage funds were plentiful to areas where local mortgage funds were insufficient. Only one such association was formed, on February 10, 1938, actually as a subsidiary of the RFC. It was called the National Mortgage Association of Washington, but changed its name to Federal National Mortgage Association or, as it is known today, Fannie Mae.\n\nThe last provision of the 1934 act established the Federal Savings and Loan Insurance Corporation (FSLIC). The FSLIC insured depositors' savings in savings and loan associations up to $5,000. This insurance was similar to that provided to bank depositors by the Federal Deposit Insurance Corporation (FDIC). Savings and loan associations primarily provided mortgage loans.\n\nThe National Housing Act of 1934 was amended and further liberalized with passage of the National Housing Act of 1938. Congress passed further amendments in 1939 and 1940. Both programs, HOLC and FHA, assisted Americans who were able with a little help to buy a home. The appraisal standards; long-term, low-interest, amortized, insured mortgages; and construction standards extended the possibility of home ownership to an ever-widening group and resulted in the development of suburban areas. These policies however, did not reach down to the poor of the inner cities. The New Deal programs, through other avenues, also attempted to improve conditions in the slums and provide the poor with adequate shelter.\n\nHelp for Low-Income Inner-City Housing\n\nUntil the Great Depression, political and civic leaders expressed little concern for the condition of the cities' inner cores. Only a few social workers and city planners made attempts to deal with the problems of slums, poverty, and poor housing. In an important reversal of policy, the Roosevelt administration involved the federal government directly in construction programs. During the first hundred days of 1933, Congress passed the National Industrial Recovery Act of June 1933. The act's four purposes were to create jobs, improve housing for the poor, remove or renovate slums, and encourage private industry in large-scale community planning efforts. The act established the Public Works Administration (PWA) to provide low-rent housing and slum clearance projects.\n\nThe PWA's Housing Division attempted to get private developers involved by encouraging federal loan applications. These private developers, however, seemed more interested in unloading on the federal government undesirable city property at high prices rather than developing low-income housing projects. As a result, the government found only seven applications acceptable out of five hundred submitted by private corporations. Abandoning this approach in February 1934, the Housing Division became directly involved in slum clearance and low-cost housing construction projects, originating projects and supervising the construction.\n\nIn four and a half years of operation, it started several projects in such areas as Atlanta, Cleveland, and New York's borough of Brooklyn. Overall, however, the program made little progress in solving the housing problem. The PWA built or started 49 projects containing fewer than 22,000 units. The Housing Division, however, did shed light on the fact that slums and shortage of adequate housing reached across the nation, affecting smaller communities as well as big cities.\n\nOn a local level, Mayor Fiorella La Guardia set up the New York City Housing Authority (NYCHA) to deal with the dilapidated tenements of the slums. The NYCHA looked to the Lower East Side where 90 percent of the residential buildings were at least 35 years old, over 50 percent had no central heating or toilets in the apartments, and approximately 17 percent had no hot water. Although the NYCHA meant well, the results of forcing improvements meant more homelessness for the very poor. Forced to make costly improvements in the middle of the Great Depression, many landlords chose to simply board up the buildings. In just two years, 10,000 tenements were closed, eliminating 40,000 living units. Some people affected by the closures became homeless, while others moved in with family elsewhere. Those landlords who did upgrade raised rents above what low-income families could afford, pushing them onto the streets of the Lower East Side.\n\nBetween 1934 and 1937, states became increasingly interested in the possibilities of federal housing programs and put pressure on Roosevelt to act. Major support for federal housing projects came from Senator Robert Wagner of New York. He introduced housing bills into Congress in 1935 and 1936, but received no support from President Roosevelt until 1937. The National Housing Act of 1937, better known as the Wagner-Steagall Housing Act, became law on September 1. The United States Housing Authority (USHA), created by the act, took over the PWA projects. The USHA, however, operated very differently than the centralized Washington management of projects of the PWA. Under the Wagner-Steagall Act, all slum clearance and low-rent housing programs had to be initiated in the localities themselves. The act was authorized to make loans to local public agencies—called local housing authorities (LHA)—for the construction of low-rent housing projects. These loans were limited to 90 percent of the development cost of the project. The balance of the cost was raised locally, usually through the sale of LHA bonds. Once the project was completed, the USHA subsidized rents by making annual contributions to each housing project. Payment amounted to the difference between the rent paid by the low-income families occupying the dwellings and the actual cost of providing the housing.\n\nAnother important feature of the act was to clear out slums and construct new dwellings. For every new dwelling unit built, one slum dwelling had to be eliminated. This was called the \"equivalent elimination.\"\n\nThe fact that the responsibility to form a local housing authority and provide tax exemptions for the projects rested with the community made these projects entirely voluntary. If a community did not want to tarnish their image with public housing, it simply refused to create a housing agency. As a result, the policy, like many other New Deal programs that relied on local administration, invariably reinforced racial discrimination and segregation. In this case if a community wanted to block access to minorities to their\n\nU.S. Housing Authority Operations as of December 31, 1940 Rents, Incomes, and Subsidies Status Number of projects 140 Number of dwelling units 47,995 Average monthly rent for shelter $12.71 Average monthly rent for shelter with utilities furnished $18.08 Average annual family income anticipated in projects $799.00 Construction Award Data Status Number of projects under construction or completed 344 Number of dwelling units 118,045 Total estimated over-all cost of new housing $507,077,000 Estimated wages to be paid at site for projects $133,843,000\n\ncommunity through low-cost housing, they could choose not to participate in the program. Through such decisions minorities would remain trapped in the declining inner-city areas.\n\nBy January 1, 1941, the Wagner-Steagall Housing Act had a very limited impact. Only 118,000 family dwelling units were under construction or completed. Of these units 39,000 were open for occupancy with 36,456 occupied. Although the act's primary function was to provide housing rather than employment, the program did provide thousands of jobs in construction and related industries that supplied building materials. In 1941 President Roosevelt commented in a footnote to the October 1937 executive order establishing the USHA on the success of the agency to provide employment in the building trades and related industries: \"While the primary function of the new statute was to provide housing rather than employment, the fact is that the program has provided thousands of men with jobs, not only in actual construction, but in the mines, mills, and factories which supply the materials.\" (Roosevelt, The Public Papers and Addresses of Franklin D. Roosevelt: 1928–45, 1941, p. 470). The act also forged a cooperative relationship between national and city authorities to initiate, plan, build, and operate low-cost housing. Although it underwent many changes, the basic relationship still exists today.\n\nBy 1940, a new need for housing surfaced as the nation prepared for war. The problem of providing living quarters for a vast number of defense workers in shipyards, military camps, and clothing and equipment factories became a top priority. In Executive Order No. 8632, President Roosevelt amended the Wagner-Steagall Housing Act to develop, build, and maintain defense housing projects.\n\n1940—The First Housing Census\n\nA related housing issue was the need for accurate statistics on home ownership, types of structures, and home values. This information had long been available only on a local basis. But with federal agencies participating in the housing industry, new nationwide statistics were needed. Before the FHA could wisely guarantee a mortgage or the USHA could fairly loan or grant money for slum clearance, each had to have certain information. They needed reliable figures on the housing market, vacancy rates, credit availability, and housing supply. Senator Wagner introduced a bill in Congress in 1939 to provide for a complete housing survey as part of the regular decennial (every ten years) census. The bill passed easily and resulted in the first national housing census in 1940.\n\nHome Sweet Home\n\nAs early as the eighteenth century, Americans viewed their zone of private life—their home family space—uniquely. The space was a personal place of refuge from society at large, free from outside control. The early ideal American home included a great deal of land. As cities developed in the 1800s, they were considered centers of progress and culture. Smaller towns patterned themselves after urban models and sought to project an image of growth. Residents of the towns came to define their family home in terms of a house, yard, and neighborhoods with connecting roads.\n\nAs towns grew into cities in the mid-and late 1800s, the privileged urban dwellers tended to relocate on the expanding edges and build comfortable homes. Immigrants came to the United States by the thousands and generally settled in the center of cities where jobs were available. All persons, the privileged and the newly immigrated, needed to be within walking distance of their work or of public transportation.\n\nPublic transportation included the rail lines and trolleys. Commuter villages sprung up all along the trolley and cable car rail lines serving the cities. The newly emerging middle-class residents moved to the end of the trolley line where space was available for a house and garden. Between 1888 and 1918, trolley lines radiated out from central business districts, forming large suburban rings. The electric trolleys traveled four times faster than horse-drawn systems and could efficiently take commuters to and from work in the city's core areas.\n\nCheap land and home prices, good wages, and efficient transportation allowed even the working class to own private homes along the transportation routes. The poor, however, remained clustered in the inner city, unable to afford homes or rents outside the city much less the trolley fares to get to work. The innercity dwellings were increasingly meager with numerous families crowding into small, unventilated areas. By 1910 the \"new American city\" was segregated by class and economic function and included a much larger expanse of land than the older walking city. As the trolley suburbs grew, a new invention, the automobile, further revolutionized the American city.\n\nThe Automobile and the Bungalow\n\nIn 1898 there was only one automobile, a sputtering little offspring of a bicycle, for every 18,000 people. In 1900 Ransom E. Olds began assembling an uncomplicated, inexpensive, and utilitarian model, his \"merry Oldsmobile.\" Sixty-five hundred were on the road in 1905. By 1913 there was one vehicle for every eight people. That same year Henry Ford introduced a moving assembly line to roll out his Model T's. In 1927 Americans drove 26 million cars on a rapidly expanding road system.\n\nResidents in their merry Oldsmobiles and Model T's explored the edges of their cities and the dream of the single family home in the suburbs. In 1920, 46 percent of American families were homeowners, and 51.2 percent of Americans were urban dwellers. In the seven years between 1922 and 1929, 883,000 new homes were built each year. That pace more than doubled the home building rate of any previous seven-year period. Rising wages and the falling price of constructing homes steadily boosted the construction industry, as did real estate tax exemptions that states began to pass. New suburbs dotted the edge of every major city. Automobile access proved critical, and funds for new road construction came from the general taxpayers.\n\nThe Ladies Home Journal, the most successful magazine of the first quarter of the twentieth century, began publishing plans for houses called bungalows. Costing between $1,500 and $5,000, the bungalow was a humble but attractive one-and-a-half-story home within easy economic reach of the growing middle class. Suburban neighborhood after neighborhood filled with the American bungalow.\n\nAlthough the most affluent paid cash for their homes, most middle-and lower-middle-class home-buyers obtained a mortgage from a bank or savings and loan association. During the 1920s first mortgages were limited to one-half to two-thirds of the appraisal value of the home. This meant buyers needed at least one-third of the price of the property for a down payment. First mortgages averaged 58 percent of the estimated property values. This meant the average down payment was actually 42 percent of the home's value. If buyers did not have enough for the down payment, they could take out \"second\" mortgages to make up the difference. Interest rates in 1923 were generally between six and eight percent. Because buying on credit, or taking out loans, became common in these boom years of the 1920s, many Americans could afford both a home and car. America's poor, however, unable to afford the American dream, remained behind in the aging central sections of cities.\n\nThe Slums\n\nAs curtains fluttered in the windows of suburban bungalows surrounded by white picket fences, the interior sections of the large cities deteriorated. Dwellings of the inner-city poor became increasingly dilapidated and overcrowded. To accommodate the massive influx of poor immigrants, large rooms of once-fashionable dwellings were subdivided into tiny rooms with no light or ventilation. As the population continued to swell, sanitation facilities became overwhelmed. Such areas grew into what many referred to as slums, which became characterized by poverty, crime, and filth. In some cities slums would consist of large areas of crowded multifamily housing, or multistory tenements, that had low standards of ventilation and plumbing and were in various degrees of deterioration. They were often occupied by impoverished immigrants.\n\nThe landowners' interest in profit was much greater than in the welfare of those occupying their tenements. More apartments meant more rent income for the landlord. Housing structures were hastily constructed on every inch of land. Those structures reached higher and higher, shutting out neighbors' sunlight and making rooms gloomy and dust filled.\n\nAs early as the 1880s, poverty, crime, disease, ignorance, and alcohol addiction thrived in frightfully overcrowded districts of not only northeastern cities, but in Midwestern cities such as Chicago as well. In 1890 Jacob Riis raised public awareness of the wretched conditions of New York City's Lower East Side by publishing his photographs of the slums in How the Other Half Lives. Riis's images showed narrow streets and alleys filled with people; clotheslines strung from one building to another. Families, including the children, were shown laboring in crowded tenements making cigars, sweaters, or other products. The dirty streets were filled with open-air markets selling food and clothing. Riis showed homeless people sleeping on sidewalks and in alleyways, or at tables in restaurants. Over 290,000 individuals per square mile packed the East Side. The crime and health problems of other areas like the East Side—Boston's South End, Pittsburgh's Hill District, Cincinnati's Basin Section—cost their respective cities many more dollars than the tax revenues those areas provided to the local governments.\n\nAlthough the existence of slums was acknowledged, neither state, local, nor federal governments understood their cause well enough to offer meaningful help. Prior to the 1930s, housing reform in America meant surveying slum conditions and passing codes to improve density, ventilation, and sanitation. New York City passed the first housing codes in 1867, 1879, and 1901. The 1901 codes required \"model\" tenements to be built with air shafts for ventilation, but the shafts proved only to be a source of foul odors, perpetuating the miserable conditions.\n\nDuring the prosperous 1920s, as long as they continued to grow with people moving to the outskirts, cities closed their eyes to the problems of the slums. But in actuality conditions were so bad that even entrepreneurs began shunning the low-income housing market, and most private investors lost interest.\n\nFirst Federal Housing Effort\n\nThe first U.S. federal government housing effort was neither a result of a conscious attempt to help the poor nor an increased reform spirit. Rather it was more a war power action. In June 1918, a year after the United States entered World War I (1914–1918), Congress appropriated $110 million for two separate programs to develop housing for workers moving to industrial areas to produce weapons. Since the war ended only five months later, the effort resulted in only a few developments—Yorkship Village in Camden, New Jersey; Atlantic Heights in Portsmouth, New Hampshire; and, Union Park Gardens in Wilmington, Delaware.\n\nAfter World War I, the U.S. government went back to the business of governing and adopted a hands-off policy concerning housing. The Great Depression and subsequent New Deal legislation, however, ended this hands-off policy. Housing became a central issue in the newly forged federal-local relationships of the 1930s.\n\nA House In The Country\n\nBecause Franklin D. Roosevelt believed the rural life bred superior qualities in men and that all people lived a better life in the country, he actually viewed cities as rather hopeless. Roosevelt, like many scholars of the day, believed that urban populations in the future would remain stable or even decline. Much of the early New Deal approach to housing reflected this attitude. Roosevelt refused to endorse public housing as an important part of his recovery drive. He even resisted defending the PWA Housing Division against its enemies in the private sector. Banking, real estate, and construction groups regarded public housing as socialistic.\n\nRoosevelt eagerly endorsed the FHA created in the Housing Act of 1934, since it did not involve the federal government directly in construction or financing, and it allowed many Americans to leave the city and purchase a home in the suburbs. The average American thought a single-family home with a yard was the ideal dwelling. The FHA strongly supported this viewpoint as it routinely insured home mortgages for white middle-class houses in the suburbs. In contrast, after more than 12 years of aiding home construction and repair, not one dwelling unit in Manhattan received FHA coverage.\n\nPublic Housing—The Most Controversial Housing Issue\n\nReal estate developers, home buildings, bankers, congressmen from rural districts, fiscal conservatives, and those concerned with public spending leading to public debt, opposed public housing. Campaigns against the ever-worsening slums of the cities fell to liberals, social reformers, and philanthropic organizations. By the mid-1930s, organized labor also identified slum clearance by demolition and building decent low-income housing as legitimate areas for federal action. Senator Robert F. Wagner introduced public housing legislation to Congress in 1935, 1936, and 1937. The 1937 Housing Act, the Wagner-Steagall Housing Act, passed only after Roosevelt, realizing low-income housing needed to be addressed, supported it. The act created the United States Housing Authority (USHA) that immediately began work on projects.\n\nAlthough a welcome achievement to those who had long fought for Wagner's bill, it was strongly opposed on a wide front. The real estate, banking, and home building interests believed government construction would drive private firms out of the housing business. They worried about rising federal expenditures, taxes, and falling property values. Displeased with the new federal-city housing partnership, they argued for home rule, states rights, and individual initiative. They used their influence in Washington to clamp down on public housing initiatives after 1937.\n\nCongressmen and senators from rural districts also opposed Wagner's bill. They believed public housing would primarily benefit residents of large cities. Conservatives feared the high cost of housing projects cited above. They took every opportunity to reduce the USHA's funds. Together, the opposition led to the demise of public housing programs before the start of World War II.\n\nInternational Perspectives\n\nWhile by 1980 public housing still accounted for only 1 percent of the U.S. housing market, extensive European involvement with public housing had become the norm. In industrial nations such as Great Britain and Germany, public housing during the 1930s was a standard part of the welfare state. During the Depression it comprised 46 percent of the market in England and Wales and 37 percent of the French housing market. Following the Depression British and Japanese national governments continued to buy inexpensive land in distant areas, concluding it was the only practical means of acquiring land for public housing projects.\n\nState-constructed housing projects in the Soviet Union housed the majority of Russian citizens and had long been ingrained in the political ideology. Public housing is also an important means to help address massive social problems in third world nations. Whether a necessity or driven by political ideology, public housing is an important institution in most countries of the world.\n\nWhile government in the United States at the local, state, and national levels remained largely detached from the housing problems during the 1920s, European legislators pursued the matter vigorously, especially after World War I. Great Britain started the European public housing movement with passage of the British Housing Act of 1919. In the 1920s both Britain and Germany built over a million publicly assisted \"homes for heroes\" for the World War I veterans. The Dutch government housed one-fifth of its population in public housing. In the Soviet Union, all housing rapidly became the responsibility of the government.\n\nEdith Elmer Wood, a widely traveled American proponent of housing reform, wrote The Housing of the Unskilled Wage Earner in 1919. With publication of her book, Wood became an international figure in housing reform. By the early 1930s, Wood would see several groups, including the National Public Housing Conference, lobby for U.S. government involvement in housing construction for people who could not afford adequate housing. Before the New Deal, however, only two states, New York and North Dakota, accepted even limited responsibility for housing its poorest citizens. A further example of the lack of U.S. government involvement in housing came at the International Congress of Cities in 1932. The meeting promoted expansion of government housing programs for the low income. Only one delegation attending, the U.S. delegation, reported no direct ties between the national government and city governments. International public housing initiatives had only limited effects on resolving housing issues in the United States.\n\nPrivate Money Builds Private Suburban Homes\n\nNo New Deal agencies had more lasting or powerful impact on Americans and American cities over the last half of the twentieth century than the HOLC and the FHA. Although short lived, the HOLC established standardized appraisal procedures and first introduced the long-term, low-interest, self-amortizing mortgage. The FHA insured mortgages so lenders faced little risk, expanded the favorable terms for the borrower of the amortized mortgage, and set national building standards for home construction. In 1944 the Servicemen's Readjustment Act (the GI Bill) created a mortgage program under the Veteran's Administration (VA). The VA mortgage program largely patterned its policies after FHA procedures and attitudes. Together, the FHA and VA have a remarkable record of accomplishment. The VA helped sixteen million soldiers and sailors returning from World War II to purchase homes. By the end of 1972, the FHA had helped nearly 11 million to improve their homes. Between 1934 and 1972, American families living in owner-occupied dwellings rose from 44 percent to 63 percent. In the 1950s and 1960s, almost half of all housing claimed FHA or VA support.\n\nFollowing World War II, the uniquely American dream of a private, single-family home surrounded by a yard in a safe suburban neighborhood was possible for all but the poor. Suburbs popped up and grew rapidly. In 1946 families could buy a home for $5,150. The FHA mortgage guarantee meant the buyers only needed approximately $550 for a down payment, and the long-term mortgage produced a payment of only $29.61 monthly for 25 years. Neither the FHA nor the VA directly made loans. Loans came from private banking institutions and went to the individual homeowners, insuring the loans and eliminating the risk for the lenders.\n\nToday, conventional loans are used more frequently than FHA or VA loans. They are not insured by either the FHA or by the VA, but patterns adopted in the 1930s persist in conventional loans. Private banks offer conventional loans that are long-term (usually fifteen or thirty years) amortized mortgages. Conventional loan terms offer a choice of fixed interest rates or adjustable rates, which start very low and move to a predetermined high. They require at least 20 percent down, or less if the borrower takes out private mortgage insurance. In 2000 the American home ownership rate reached a new record high of 67.7 percent. A total of 71.6 million families owned their homes.\n\nAt a Glance Cheaper to Buy Than Rent\n\nIn 1939 the Wilmington Construction Company built four hundred six-room houses just north of Wilmington, Delaware. This FHA-backed development was called Edgemoor Terrace. It demonstrated the use of tract production line techniques, including standardized models and lot sizes, construction methods, and model homes. The homes sold for $5,150 with a $550 down payment. The FHA mortgage guarantee meant buyers paid an incredibly low $29.61 monthly payment that included principle, interest, mortgage insurance, and taxes. An apartment of the same size in New York City rented for $50 a month.\n\nImmediately following World War II, tracts using similar techniques sprung up. Levittown, located 25 miles east of Manhattan, eventually included 17,400 separate houses. The dwellings were of Cape Cod style with a living room and fireplace, two bedrooms, and one bath. They were approximately 750 square feet in size. Thousands of young families eager to escape tiny apartments or close quarters with in-laws flocked to Levittown, where it was cheaper to buy than rent.\n\nThe Federal National Mortgage Association (Fannie Mae) and the Government National Mortgage Association (Ginnie Mae) completed the New Deal-initiated revolution in the home finance industry. Fannie Mae resulted from the Wagner-Steagall Housing Act of 1937, and by 2000 Fannie Mae was wholly privately owned. Ginnie Mae separated from Fannie Mae in 1968 and today is a government-owned association operating under the Department of Housing and Urban Development (HUD). Through the remainder of the twentieth century, Fannie Mae and Ginnie Mae bought packages of mortgages. This made it possible for funds to travel from regions with historically high amounts of capital to poorer regions. As a result, poor regions had more money to loan than in previous years. Nationally, mortgage funds funneled out of the Northeast to the South and West and out of the cities to the suburbs. In 2000 Fannie Mae and Ginnie Mae were major purchasers of conventional loans, continuing to move money around the nation. Money was moved from where there was ample loan money to poorer areas, equalizing the amount of available loan money around the country.\n\nThe New Deal housing legislation put into place the financial structure through which private money built suburbia and the Sunbelt (South and West). The primary beneficiaries were white middle-class families who left racially distressed inner cities by the millions. The U.S. government had adopted policies in accordance with the wishes of most of its citizens. HOLC real estate appraisal methods such as redlining discriminated against racial and ethnic minorities and against older, industrial cities. The HOLC, however, extended aid without regard for its ratings and into all areas of the cities. But, unlike the HOLC, the FHA, acting on HOLC's information, favored homogeneous suburbs over industrial or older mixed sections of the cities. The FHA often denied mortgages solely because of geographical location. In doing so the federal government, for all practical purposes, put its seal of approval on ethnic and racial discrimination. Even more importantly private enterprises, banks, and savings and loans adopted the FHA's practice of denying mortgages due to location. By the mid-1980s, federal housing policies had played a major role in the deterioration of urban centers. The poor had not shared in America's postwar housing boom. Public housing programs attempted to improve their situation.\n\nPublic Housing\n\nMany New Deal public housing projects built under the USHA quickly deteriorated into slums. Whereas housing in the cities before World War II had been inadequate, with wartime reallocation of funds, it became much worse. Even during the war, proposals for public housing, slum clearance, model towns, and regional and city planning were proposed by housing reformers. But the American business community wanted no plan that seemingly interfered with the private real estate market. Cries of \"European socialism\" and \"communist front\" abounded. Not until 1949 did another housing act, the National Housing Act of 1949, provide a commitment to federal reconstruction of cities and public housing. The 1949 act tied slum clearance to rebuilding, as had the earlier Wagner-Steagall Housing Act of 1937. This time a new term was coined—urban development. The clearance of slums, however, was generally emphasized over rebuilding. To operate within the private real estate market, private firms would build public housing through local housing authorities. The Housing Act of 1954 was an attempt to speed up slum clearance, and it changed the term \"urban development\" to \"urban renewal.\" Black Americans called urban renewal \"Negro removal,\" as new expensive high-rise apartments and shopping centers went up. Over the years many projects were primarily focused on beautification, such as replacing slums with plazas and sports arenas.\n\nNot until 1965 was the federal-city partnership, began in the New Deal era, revived. President John F. Kennedy (served 1961–1963) proposed a cabinet level department for housing. Finally, under President Lyndon B. Johnson's (served 1963–1969) War on Poverty, the Housing and Urban Development Act of 1965 established a cabinet department of Housing and Urban Development (HUD). The War on Poverty was a 1960s comprehensive social and economic program, in the tradition of the New Deal, with the goal to rid the United States of poverty. The war focused largely on racial minorities living in the deteriorating inner cities. The key difference from the New Deal was that the 1960s campaign was pursued during a time of overall economic prosperity.\n\nUnfortunately, the 1965 act called for HUD to pursue a policy of developing new greenbelt towns to move people out to the country. Greenbelt towns are new communities built on the edges of the urban area to relocate the poor from the inner city. The policy proved even less successful than the limited Greenbelt towns of the New Deal and was soon abandoned. Overall, between 1933 and 1970, only 893,500 units of low-income housing were completed, and a substantial number of those—143,000—were for the aged. Dramatically, in 1972 the Pruitt-Igoe public housing project in St. Louis, once hailed for its progressive design, was demolished because it was beyond repair. By 1974 the public housing concept had been severely discredited.\n\nMore About… Greenbelt Towns\n\nOf all the New Deal experiments, Greenbelt towns were the most daring and innovative. Inspired by the turn of the century \"garden city\" theories of Englishman Ebenezar Howard, Rexford G. Tugwell, administrator of the Resettlement Administration, set out to build new towns. Tugwell is quoted in Mark Gelfand's book, A Nation of Cities: The Federal Government and Urban America, 1933–65, 1975, p. 133):\n\nMy idea is to go just outside centers of population, pick up cheap land, build a whole community, and entice people into it. Then go back into the cities and tear down whole slums and make parks of them.\n\nSurrounded by a belt of open land, Tugwell's communities were to have decent housing, a high level of social and educational services, and be limited to 10,000 residents. Built by the government but leased to local cooperatives made up of residents, the cities would help solve the housing problem of the city. Tugwell hoped to build 3,000 towns. Three were actually built—Greenbelt at Berwyn, Maryland; Greenhills near Cincinnati, Ohio; and Greendale outside Milwaukee, Wisconsin. Building towns from scratch proved very expensive, pushing rents for apartments out of the low-income bracket to the middle-income range. As with most utopian ventures, the towns started out filled with energetic young residents but with excessive rules and meetings the zeal faded. Greenbelt towns never fulfilled their goal of serving as model towns for future developments.\n\nGoing against the grain of the American tradition of private property, many denounced the communities as \"communist towns.\" Real estate interests continually fought them. After World War II, they were sold at a great loss by the government. The three communities remained private residential communities into the twenty-first century.\n\nDepartment of Housing and Urban Development—More Responsibilities\n\nAfter a difficult beginning, HUD evolved through the 1980s and 1990s to address a broad range of issues. The agency is responsible for national policy and programs that address America's housing needs, improve and develop communities, and enforce federal fair housing laws. Depression \"poverty programs\" assumed poverty could be eliminated by simply altering the housing of the poor. Having learned from Depression-era attempts, rather than attack the problem of low-income housing on only one front, HUD began operating on many fronts. HUD provides housing assistance for low-income persons through \"assisted\" housing and public housing. Assisted housing is commonly known as Section 8. It helps low-income households with rental subsidies in private apartment complexes or rental houses. Under the Section 8 certification program, HUD determines the amount of rent a household can afford to pay, then pays the difference up to full market rent rates. This is much like the subsidies under the National Housing Act of 1937. Within a standard rent range, it allows tenants a greater freedom of choice as to where they want to live.\n\nHUD provides job training, encourages local businesses to hire public housing residents, and brings residents into the leadership and management of their developments. It also enforces the Federal Fair Housing laws that prohibit housing discrimination based on race, color, national origin, sex, religion, families with children, and disabilities. HUD programs also help the homeless, individuals with disabilities, and AIDS victims with rental assistance and various shelter care programs.\n\nThe Community Development Block Grant helps communities and low-and moderate-income persons by providing grants for renovating housing, improving facilities such as sewers, building neighborhood centers, and assisting private businesses with economic development.\n\nThe FHA, the New Deal agency established in 1934, operates under HUD today. FHA activities have greatly expanded. The FHA assists first-time buyers and others who might not be able to meet down payments for conventional loans by providing mortgage insurance.\n\nThe FHA also assists in providing affordable rental housing by insuring loans for the construction of multifamily housing developments. This represented new developments in twentieth-century policy. Support of multifamily housing was nonexistent in the FHA's Depression years. As of October 1996, the FHA provided mortgage insurance for 6.5 million single-family homes totaling $401 billion. As of September 1996 FHA provided insurance on 15,935 multifamily developments containing two million units.\n\nCatherine Bauer (1905–1964). After graduating from college, Bauer began work in New York's City Housing Corporation in the 1920s. The corporation was in the process of building a model garden community. Bauer spent the early 1930s in Europe, studying solutions to housing problems. On her return in 1934 she published Modern Housing. Confident public housing was America's answer to decent housing for all, she became organized labor's top lobbyist for a low-rent housing program. Bauer helped draft the National Housing Act of 1937. After passage of the act, she became a consultant to the U.S. Housing Authority and helped frame its policies. She favored construction of projects on vacant land rather than on slum sites.\n\nPaul V. Betters (1906–1956). Betters served as executive secretary of the American Municipal Association (AMA), a loose federation of municipalities formed to interchange ideas on various phases of city governments. Betters, representing 7,000 members of AMA, repeatedly spoke before Congress, discussing urban problems. In 1933 Betters organized the U.S. Conference of Mayors (USCM). He helped shape the USCM to be an effective lobby for cities with populations over 50,000.\n\nMarriner Eccles (1890–1977). Eccles, a banker from Utah, came to Washington, DC, to serve with Secretary of Treasury Henry Morganthau, Jr. as special assistant in monetary and credit matters. He helped draft the Federal Housing Act of 1934 which created the FHA. Eccles then accepted the position of head of the Federal Reserve Board where he remained until 1951. Eccles believed in government spending to stimulate the economy to preserve the American economic system. During the 1937 economic downturn, he was instrumental in convincing Roosevelt to resume spending which benefited the U.S. Housing Authority.\n\nJohn H. Fahey (1873–1950). A newspaperman and publisher from New England, Fahey helped establish the United States Chamber of Commerce in 1912 and served as its president from 1914 to 1915. President Roosevelt named Fahey to the board of the HOLC in June 1933, then as chairman in November 1933. Fahey held that position until he retired in 1948.\n\nCordell Hull (1871–1955). Chairman of the Senate Banking Committee in 1933, Senator Hull masterminded legislation to put the brakes on home foreclosures. As a result, on June 13, 1933, Congress passed the Home Owners' Refinancing Act authorizing the HOLC.\n\nHarold L. Ickes (1874–1952). Ickes, a strong progressive who disliked business domination of municipal government, became known for his honesty and commitment to good government. He became an influential figure in the New Deal. President-elect Roosevelt appointed him secretary of the interior. When the National Industrial Recovery Act (NIRA) of 1933 was passed, Roosevelt also appointed him head of the Public Works Administration (PWA), an agency created under the NIRA. He oversaw the PWA's Housing Authority.\n\nFiorello La Guardia (1882–1947). Born in New York City, La Guardia served as a Republican in the 65th and 66th Congresses before resigning to join the army air corps during World War I. Elected mayor of New York City in 1933, he proved to be aggressive, energetic, and incorruptible. His election as mayor began a period of close cooperation between the government of New York City and the Roosevelt administration. In 1934 La Guardia set up the New York City Housing Authority to deal with the city's slums. He believed Roosevelt's relief programs, including the Works Progress Administration (WPA), saved the cities. He served as president of the U.S. Conference of Mayors from 1936 to 1945.\n\nCharles E. Merriam (1874–1953). Merriam, a social scientist from Iowa, helped found the Social Science Research Council, which he headed from 1923 to 1927. He then created what became the Research Committee on Social Trends (1929–1933). The public works administrator appointed Merriam to the advisory committee of the newly formed National Planning Board in 1933. His work through these various groups focused on developing national policies promoting economic and social improvements in U.S. society. He was a champion of urban life and insisted the federal government pay attention to urban problems. He expanded the definition of public works to include broader planning in various areas by both private and public sectors. Merriam worked to forge federal-city partnerships.\n\nHenry B. Steagall (1873–1943). Elected to the U.S. House of Representatives in 1914, Steagall was long a proponent of federal deposit insurance but reluctant to support public housing. He feared public housing programs would only benefit cities and was socialistic. He did not support Senator Wagner's housing bill until President Roosevelt urged him to do so. Nevertheless, the landmark 1937 housing bill partially bears his name, the Wagner-Steagall Housing Act.\n\nNathan Strauss (?–?). Strauss, an old friend of Senator Robert Wagner, served on New York City's Public Housing Authority. President Roosevelt appointed him head of the newly created U.S. Housing Authority in 1937.\n\nRexford Tugwell (1891–1979). Tugwell was trained in economics from the Wharton School of Finance and the University of Pennsylvania. He left Columbia University to join Roosevelt's administration as an assistant secretary of agriculture. Informally, his major role was economic advisor to the president. Tugwell was instrumental in creating the Agricultural Adjustment Act. In 1935 Roosevelt appointed Tugwell head of the Resettlement Administration (RA). The chief goal of the RA was to resettle poor farmers into better areas, but another goal was to establish subsistence homestead communities with low-income housing called \"Greenbelt towns.\" The towns were highly controversial, and, in reality, rents were too high for the poor.\n\nRobert F. Wagner (1877–1953). Elected to the U.S. Senate in 1926, Wagner focused on unemployment issues. After the onset of the Great Depression, he concentrated on federal attempts to relieve economic stress, labor issues, and social insurance. In 1935 he continued to press for an expanded welfare state. He had a particular interest in public housing, and he introduced a public housing bill in 1935, 1936, and again in 1937. When President Roosevelt finally supported the bill, it was passed as the Wagner-Steagall Housing Act of 1937 and established the U.S. Housing Authority.\n\nEdith Elmer Wood (1870–1945). An American housing reformer, Wood argued social behavior was conditioned by housing. Having studied housing in European nations, she campaigned for public housing. She lobbied for the U.S. government to replace slums, which would in turn reduce crime and delinquency. Wood wrote The Housing of the Unskilled Wage Earner, published in 1919, and became an international figure in housing reform. Joined by Catherine Bauer and others in the 1930s, she worked for public construction of dwellings for people who could not afford adequate housing.\n\nNational Housing Act of 1934\n\nThe following words were spoken to Congress by President Roosevelt on May 14, 1934, as he stressed the need to pass the National Housing Act of 1934 to stimulate the construction industry (Roosevelt, 1938, p. 232):\n\nMay I draw your attention to some important suggestions for legislation which should tend to improve conditions for those who live in houses, those who repair and construct houses, and those who invest in houses? Many of our homes are in decadent (deteriorated) condition and not fit for human habitation. They need repairing and modernizing to bring them up to the standard of the times. Many new homes now are needed to replace those not worth repairing. The protection of the health and safety of the people demands that this renovating and building be done speedily. The Federal Government should take the initiative immediately to cooperate with private capital and industry in this real-property conservation.\"\n\nFederal Housing Administration (FHA)\n\nPresident Roosevelt proclaimed the affordability of homes financed by FHA-insured loans established under the National Housing Act of 1934. As stressed by Roosevelt, many lower-income families were able to now afford homes, and the resulting mortgage payments did not place an unreasonable burden on their monthly expenses. A broad spectrum of the public could now afford homes. The FHA, however, aided mostly white, middle-class homeowners in suburban areas (Roosevelt, The Public Papers and Addresses of Franklin D. Roosevelt: 1928–45, 1938, p. 236).\n\nThe records of FHA show that over one-half of the families buying homes under the FHA plan have annual incomes of $2,500 and less; and that most of these are purchasing their homes by payments of $25 a month or less. Nine out of ten of all new home owners under the FHA plan are using less than one-fifth of their incomes to meet their monthly payments on their home.\n\nNeglect of Cities\n\nThe National Resources Committee argued in its 1937 landmark report titled \"Our Cities: Their Role in the National Economy,\" that the problems of cities had been largely neglected by the federal government. The Committee had been created by the National Industrial Recovery Act in 1933 to guide national economic planning and advise the president and Congress on needed social and economic policies. Concern for deteriorating inner cities and attempts to plan for the urban environment would be a continuous feature of national policy during the remainder of the twentieth century (quoted in Glaab and Brown, A History of Urban America, 1983, p. 298):\n\nThe United States Government cannot properly remain indifferent to the common life of American citizens simply because they happen to be found in what we call \"cities.\" The sanitation, the education, the housing, the working and living conditions, the economic security—in brief, the general welfare of all its citizens—are American concerns, insofar as they are within the range of Federal power and responsibility under the Constitution.\n\nWagner-Steagall Housing Act of 1937\n\nOn March 17, 1938, President Roosevelt, enthusiastic about the start of work on the first five projects under the 1937 Housing Act, wrote these words in a note to Nathan Strauss, chief of the United States Housing Authority (USHA), which was formed under the act (quoted in Jackson, Crabgrass Frontier: The Suburbanization of the United States, 1985, p. 224):\n\nToday marks the beginning of a new era in the economic and social life of America. Today, we are launching an attack on the slums of this country which must go forward until every American family has a decent home.\n\nResearch the many programs offered by the Department of Housing and Urban Development (HUD) at the beginning of the twenty-first century. Does the FHA still play a role in HUD? How does HUD help low-income persons occupying HUD housing to develop long-term strategies for bettering their lives?\n\nIf you had been part of a family faced with losing their home, how would this possibility affect you, your schoolwork, your family relations. Write a diary entry relating your thoughts.\n\nContact and interview a local bank loan officer about the types of mortgages available today. What factors do bankers consider when making a home loan to a family?\n\nResearch the architectural style of the American Bungalow house.\n\nSources\n\nDavies, Pearl Janet. Real Estate in American History. Washington, DC: Public Affairs Press, 1958.\n\nGelfand, Mark I. A Nation of Cities: The Federal Government and Urban America, 1933–65. New York: Oxford University Press, 1975.\n\nGlaab, Charles N., and A. Theodore Brown. A History of Urban America, 3rd Ed. New York: Macmillan Publishing Co., Inc., 1983.\n\nHuthmacher, J. Joseph. Senator Robert F. Wagner and the Rise of Urban Liberalism. New York: Atheneum, 1968.\n\nJackson, Kenneth T. Crabgrass Frontier: The Suburbanization of the United States. New York: Oxford University Press, 1985.\n\nRoosevelt, Franklin D. The Public Papers and Addresses of Franklin D. Roosevelt: 1928–45. New York: Harper & Brothers, 1950.\n\nFurther Reading\n\nDuchscherer, Paul. The Bungalow: America's Arts and Crafts Home. New York: Penguin Books USA, 1995.\n\nHousing and Urban Development (HUD), [cited November 8, 2001] available from the World Wide Web at http://www.hud.gov.\n\nKennedy, David M. Freedom from Fear: The American People in Depression and War, 1929–45. New York: Oxford University Press, 1999.\n\nLancaster, Clay. The American Bungalow, 1880–1930. New York: Dover Publications, 1995.\n\nLower East Side Tenement Museum, New York City, [cited November 8, 2001] available from the World Wide Web at http://www.tenement.org.\n\nRiis, Jacob A. How the Other Half Lives: Studies Among the Tenements of New York. New York: Dover Publications, Inc., 1971.\n\nBanking , Everyday Life"}, {"url": "https://www.washington.edu/news/2020/06/29/trouble-paying-medical-bills-can-lead-to-longer-episodes-of-homelessness-new-study-shows/", "page_content": "Trouble paying medical bills can lead to longer episodes of homelessness, new study shows\n\nKim Eckart UW News\n\nEven before the pandemic left COVID-19 patients with staggering hospital bills, many people, especially those who are uninsured, were often overwhelmed with medical bills\n\nResearch shows that medical debt burdens millions of Americans: Depending on how “medical debt” is defined, studies from nonprofits and academic institutions generally show from 16% to 28% of adults carry that burden.\n\nAnd medical debt and housing instability often go hand in hand. In a new University of Washington study of people experiencing homelessness in King County, unpaid medical bills were their primary source of debt, and that debt extended their period of homelessness by an average of two years.\n\n“So many people have lost their jobs, and then they lose their health insurance. They may not be able to pay even small medical bills or co-pays and still have rent or mortgage payments. If they get sick with coronavirus, or some other medical condition, this can be the perfect storm that puts people out on the street and increases the time they spend there,” said Jessica Bielenberg, who conducted the study for her master’s thesis from the UW School of Public Health.\n\nThe study was published June 8 in the journal Inquiry: The Journal of Health Care Organization, Provision, and Financing.\n\nLittle research has been done linking medical debt and homelessness, Bielenberg pointed out. While her study did not find a direct causal relationship between the two, it did determine that among those experiencing homelessness, the inability to pay off medical bills, even a few hundred dollars, was associated with considerably more time spent unhoused.\n\nBielenberg and her co-authors worked with two Seattle organizations supporting shelters and encampments for the homeless: SHARE and Nickelsville. The team surveyed 60 adult residents about their health and financial situation, including other debts and past periods of homelessness. Two-thirds of participants were white; 15% were Black, and 7% were Native American.\n\nParticipants whose medical bills had been sent to collections had experienced homelessness for an average of 22 months longer than those who hadn’t had such trouble paying bills; Black, Indigenous and people of color who were unable to pay their medical bills reported being homeless a year longer than white participants with the same financial challenge.\n\n“If Black lives really mattered, we wouldn’t systematically exclude those folks from good jobs — and a good job in America is a job with health insurance,” said co-author Marvin Futrell, a clinical instructor in the UW Department of Health Services and an organizer with SHARE and Nickelsville.\n\nIn all, more than 80% of participants reported having debt of some kind, such as doctor bills, student loans, credit cards or payday loans. Of those participants, 68% reported medical debt, the majority of which had been sent to collections.\n\nIn about one-third of cases, the amount of medical debt was relatively small — less than $300. That underscores what, for many people, can be a domino effect, Bielenberg said: One lost job, or lack of health insurance, can saddle a person with debts they have to prioritize, if they can pay them at all.\n\nMedical debt is a different kind of debt than, say, outstanding credit card bills or student loan payments, which can be protective against homelessness in the short term, Bielenberg explained. Someone making student loan payments has an education, which can enhance their earning power, while credit cards and payday loans can cover basic necessities, even though they come with high interest rates. Medical debt, by its nature, stems from an illness or injury and may accompany job loss or lack of health coverage.\n\nBut what might be perceived as a safety net — health insurance — wasn’t always that, Bielenberg found. Two-thirds of participants were enrolled in Washington’s Medicaid program, Apple Health, while others received coverage from Medicare, the Indian Health Service or the Veterans Health Administration. Some 16% reported having no insurance coverage.\n\nInsurance doesn’t always cover everything, Bielenberg said, and even the comfortably insured may lose track of costs that are their responsibility.\n\nThe study didn’t examine or advocate for specific solutions, but Bielenberg suggested further research, with larger and more diverse participant pools, could bolster arguments for policy change or new support programs. “Fortunately and unfortunately,” Bielenberg said, “we are in a time of considerable turmoil. Sometimes these moments are the perfect time to completely rethink our ways of doing things. The U.S. could join the vast majority of countries in the world and simply offer universal health coverage. We spend twice per person on medical care than any other country, so we obviously are doing something wrong.”\n\nCo-authors on the study were Amy Hagopian, a UW professor of global health, and Bert Stover, a clinical assistant professor of health services at the UW.\n\nBielenberg, who is now a survey methodologist at 23andMe in California, received a stipend from the Northwest Center for Public Health Practice to support her graduate studies.\n\nFor more information, contact Bielenberg at jessica.bielenberg@gmail.com."}, {"url": "https://www.businessinsider.com/personal-finance/what-happened-stopped-making-credit-card-payments-2021-6", "page_content": "Our experts answer readers' credit card questions and write unbiased product reviews (here's how we assess credit cards). In some cases, we receive a commission from our partners; however, our opinions are our own. Terms apply to offers listed on this page.\n\nfiladendron/Getty Images\n\nWhen you buy through our links, Insider may earn an affiliate commission. Learn more.\n\nI racked up some credit card debt when I had a good job. When I had to quit, I couldn't keep paying.\n\nI tried to work out a plan, but the credit card companies refused. I was overwhelmed by guilt.\n\nI had to stop making payments, and in that time I found a supportive community that transformed me.\n\nSmartAsset's free tool can find a financial planner to help you take control of your money »\n\nGet the latest tips you need to manage your money — delivered to you biweekly. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nAt 25, I was working for a fashion start-up in New York City, making $60,000 a year. Even though my monthly income was enough to pay the bills and build savings, I spent impulsively, like most young people do. Oyster happy hours, trendy workout classes, leather jackets, impromptu trips to Mexico, and drunken nights out were all swiped on a credit card without a care in the world.\n\nA year later, I was $18,000 in credit-card debt, and the large monthly minimums crept up on me. I took out a $10,000 low-interest personal loan to consolidate my debt with monthly payments of $250. On the remaining $8,000, I made $600 monthly payments diligently to avoid accruing interest, even managing to pay down balances on a few of the cards. I learned a very expensive lesson and lived frugally with plans to pay for all the debt in two years.\n\nThings went off the rails when I filed a sexual harassment complaint against a coworker in 2018. The small company I worked for didn't have a human resources department, so the investigation was handled really poorly. To prioritize my mental health, I ended up leaving my job without a backup plan. Before I could even worry about rent and utilities, I was heartbroken over what unemployment would do to the two-year repayment plan that I had in mind.\n\nI tried to negotiate a lower monthly minimum payment\n\nI crunched the numbers and decided to continue paying for my personal loan, but I couldn't afford the rest of my debt payments. I called the credit card companies to negotiate a lower, more manageable payment, but my request was denied because I had no proof of income.\n\n\"But that doesn't make sense,\" I pleaded with the operator on the phone. \"I want to make smaller payments just to keep the account current.\" I was baffled. I thought I did everything right. I took initiative and reached out before the payment due date and everything. I was devastated, and I feared what an imperfect credit score would do for my future.\n\nTo make matters worse, it was really difficult to find work in my mental state. The stress from being sexually harassed at work, the messy investigation, and this drastic lifestyle change really took their toll. Even though I was late on payments, I ended up putting groceries and basic needs on credit cards in desperation. For the next two years, I stopped making payments on my credit cards, only paying down my personal loan.\n\nI sank into a deep depression while creditors blew up my phone\n\nEventually, my accounts became past due and credit card companies were calling me nonstop. Each time my phone lit up with a random 800 number — or worse, a blocked number — I felt nauseous. It got to the point where I was afraid to open my mail or answer my phone. I ignored calls from concerned friends and family members because I was too scared to admit that I was in trouble.\n\nMeanwhile, late fees and penalties snowballed. At one point, credit card companies were hounding me for $1,100 per month after late fees and interest. For me, $1,100 covers rent, utilities, and meager groceries for the month. But for these faceless credit card companies, $1,100 was a drop in the ocean.\n\nMy debt was sold to a collection agency, and the calls came flooding in from new 800 numbers. The truth was cold: Credit card companies would rather sell my debt (plus late fees and interest) instead of working with me — an unemployed neurodivergent queer and trans person of color — on a manageable payment plan. It's more profitable for them, and they didn't care one bit about me or my wellbeing as long as they could keep lining their pockets.\n\nI've never felt more dehumanized in my life\n\nIt felt pointless to tell people what was happening with my credit, because I couldn't stop blaming myself for my situation. I couldn't even talk to my own partner about my debt. One fall afternoon in Brooklyn, I was waiting for my partner to pick me up from my house when I suddenly burst into tears on my front stoop. She begged me to open up to her.\n\nI told her about everything — the failed negotiation, my crippling fear of opening my mail, and my intense feelings of guilt and shame around missed credit card payments. After my snotty confession, I was seriously afraid she'd break up with me. Who would want to be with someone who couldn't manage their finances?\n\nInstead, she held my hand and said compassionately, \"I've been through the same thing, babe.\" I was stunned. She shared her story with me, and our experiences were nearly identical. She, too, felt completely dehumanized by credit card companies. \"The fact that they're hounding you for money that they don't really need is really not about you,\" she said. \"You tried your best.\"\n\nI decided to take care of myself\n\nAfter coming out of self-imposed isolation, I found a peer support group with other people of color who were struggling with debt. Together, we created daily affirmations to help cope with the emotional weight of the debt: I am not my debt. I'm a good person, no matter what my credit score is. I can always start over. I am talented and valuable, no matter how much money I owe. We deserve financial freedom. We deserve wealthy communities and easy lives.\n\nI saw firsthand how debt crippled communities of color in particular. Like me, many other people of color chose to risk financial stability to prioritize their mental health in workplaces fraught with racial and gender discrimination.\n\nWhen we asked our parents and loved ones for support, they were more than happy to help. But instead of drawing from generational wealth like many white families do, our parents drew from retirement funds and cut back on their own basic necessities to support our financial emergencies. Knowing I wasn't alone made all the difference. It was healing to be around other people of color working toward financial freedom.\n\nWith renewed confidence, I started getting more work as a freelance writer. I wanted to rush into paying back all of my debt right away, but my peer support group advised me to spend money on myself first. They even suggested that I take a vacation to reward myself for all my hard work.\n\nI reluctantly took my friends' advice. I booked a cute Airbnb in Joshua Tree for a writer's retreat, splurged on new shoes, booked a massage, and switched to organic groceries. Little by little, I started to feel more like myself again.\n\nI realized that I owed myself a big debt: a debt of gratitude, kindness, confidence, self-esteem, and courage to reach for the things I really want in life. And this debt is bigger and way more urgent than a few thousand dollars that I owed a credit card company that doesn't even see me as a whole person.\n\nI'm committed to making a new relationship with money\n\nNow that I'm back on my feet financially, I've set up manageable payment plans with collection agencies. I pay a total of $175 per month on old credit card debt, and I call the agencies regularly to see if I can negotiate a lower monthly payment. Instead of prioritizing paying all the debt at once, I'm more invested in making room in my budget to enjoy myself. I anticipate paying off the debt completely in five years.\n\nMoney does not define me, but I can't deny that money can get me a better quality of life. I don't regret the leather jackets, jokes exchanged over oyster happy hours, and those beautiful trips to Mexico — I deserve to have good things, and I always will. I had to forgive myself for my debt first before taking steps toward financial freedom."}, {"url": "https://www.debt.org/advice/emotional-effects/", "page_content": "If you’re currently experiencing a mental health crisis or if you’re considering harming yourself or others, please get help immediately. You can call the free and confidential National Suicide Prevention Lifeline at 1-800-273-TALK or visit your closest emergency room for immediate intervention.\n\nDebt has long been a problem for many Americans, but the unprecedented problems of the past three years have spread the misery to tens of millions more. The COVID-19 pandemic and its aftermath created enormous upheaval in our lives: our health, our jobs, our financial security, among other areas.\n\nMore recently, soaring inflation, spiraling gas prices, even baby formula shortages, have piled woe upon crisis upon uncertainty.\n\nAnd it’s not just the actual lack of money that’s causing problems. A shortage of money led to a massive increase in denial, stress, anger, depression and anxiety. The emotional strain of dealing with debt can be almost damaging as getting your electricity cut off or having your car repossessed or seeing your credit score plunge to where you’ll struggle to get another loan.\n\nWith housing alone, a 2021 report by the Federal Reserve Bank of Philadelphia estimated that about 2 million households owe roughly $15 billion in back rent. A study by the National Equity Atlas put that figure above $21 billion.\n\nWhatever the cost, whatever the cause, debt wreaks emotional havoc on our psyche.\n\nAmong the negative effects are low self-esteem and impaired cognitive functioning. That means you can’t learn, remember, be attentive or solve problems as well when you’re under stress because you can’t pay your water bill.\n\nAnd get this – debt can hurt. I mean, really hurt.\n\nThat wasn’t particularly surprising, but a research team discovered that simply thinking about the prospect of financial insecurity was enough to increase pain. People reported feeling almost twice as much physical pain after recalling a financially unstable time in their life compared to those who thought about a secure period.\n\nIt’s rare for someone to never have money problems. Trouble happens, jobs disappear, marriages fail, people get sick, their homes lose value and bills just keep piling up. No one is immune, especially during and after a pandemic.\n\nSo what came first, the pain or the debt?\n\nDebt and Mental Health\n\nDoes debt cause mental illness, or does mental illness cause debt?\n\nYes.\n\nThat’s the best answer researchers have come up with after years of study. Some research found that worrying about debt triggers stress, which reduces your resilience against mental health problems.\n\nOther studies show mental health problems decrease self-control, increase spending and basically mess up a person’s financial judgment. That would explain why Jack Nicholson didn’t have a checking account in “One Flew Over the Cuckoo’s Nest.”\n\nThe term “mental illness” covers a wide range of issues and many degrees of severity. Whether it is a seemingly passing issue or a severe, entrenched problem, it is important to be aware of it, acknowledge it and take steps to address it.\n\nBehavior patterns that compel some to spend without restraint can drive a person into debt just as surely as a financial emergency caused by a car crash. Regardless of how someone falls behind, being in debt can trigger unsettling emotional responses.\n\nMany of these behavior patterns may have their roots in the most fundamental parts of our financial lives. Most student loan borrowers experience a reduction in mental health and increasing anxiety as they realize they can’t pay back student loans or even have to default on the loans.\n\nDenial\n\nDenial has long been a way of fiscal life in Washington D.C., but the flow has turned into a torrent due to COVID-19 relief bills and the ensuing inflation crisis.\n\nThe national debt surpassed $30 trillion in 2022. The Congressional Budget Office predicted the budget deficit for 2022 will rise another $1 trillion.\n\nConsumers don’t have the luxury of endless deficit spending, though many act as if they do. They spend compulsively while ignoring their deteriorating financial condition. They put off dealing with problems until some outside event – credit denied, threat of foreclosure, legal action, harassing phone calls from debt collectors – forces a change.\n\nSome of the symptoms of debt denial are:\n\nUnderestimating how much you owe.\n\nNot answering the phone when you suspect a collection agency is calling.\n\nLeaving bills unopened or just stuffing them in a drawer.\n\nOpening a new credit card when your old one is maxed out.\n\nTelling yourself that everyone is in the same situation.\n\nSuch behavior just leads to more debt as interest charges and late fees pile up. But ignoring reality is a handy defense mechanism for the brain. It’s a way to rationalize mistakes and protect your ego. The problem is reality always sets in.\n\nStress\n\nIt’s the opposite of denial, and there’s plenty of it based on debt-management statistics. Debt and stress are like co-joined twins.\n\nThe average credit card debt for American families is $6,569, according to a 2022 study by Lending Tree. Overall, Americans owe $841 billion across almost 506 million credit card accounts.\n\nThe strongest predictor of financial strain is credit card debt, according to a study published in the October 2020 edition of Aging & Mental Health. It found that for every $10,000 in credit card debt, the odds increase 65% that the borrower would report trouble paying monthly bills. The likelihood they’d report ongoing financial problems increased 50%.\n\nAbout 40% of consumers who have had credit card debt said it affected their general happiness. One-third said it negatively affected their standard of living, and 1 in 5 said it harmed their health.\n\nStress can lead to adverse changes in behavior. That is as true of financial stress as any other kind of stress. Stress from debt can lead to chronic stress, which in turn increases the chances of drug and alcohol abuse and increases the suicide rate. A study published in 2021 in the American Journal of Epidemiology concluded that people under acute financial stress are 20 times more likely to make an attempt on their lives.\n\nThat is stress in action.\n\nSo what exactly is “stress?”\n\nThe term was coined by endocrinologist Hans Selye in 1936, who defined it as “the non-specific response of the body to any demand for change.”\n\nIn modern financial terms, that means you hyperventilate when the Visa bill arrives.\n\nStress may be hard to define, but it manifests itself in obvious ways – lack of sleep, loss of focus, nagging worry.\n\nIt can affect big things like your job, since you fear losing it would make your financial situation even worse. It can affect small things like lunch, since you feel guilty for ordering a $2.19 iced tea instead of water. You don’t need an endocrinologist to tell you that’s no way to live.\n\nAnxiety\n\nThis is stress with the scab torn off. The thought of getting a late payment notice doesn’t just make you uncomfortable, it gives you a rapid heartbeat, shortness of breath, dry mouth, a headache and the shakes.\n\nOn top that, debt gives skittish people one more reason not to walk down the marriage aisle. Researchers at the University of Wisconsin found that high levels of debt contributed to reduced marriage rates among young adults.\n\nAnd once people got married, their money problems didn’t go away. A 2021 CNBC report said that 54% of Americans thought debt was a reason for divorce. Debt was not “the most pertinent reason for divorce,” but money problems “increased stress and tension within the relationship.”\n\nSimilarly, a 2019 report in the Journal of Family and Economic Issues found that each additional $1,000 in student loan debt with 6% higher odds of financial worry, and each additional $1,000 in credit card debt with a 4% higher chance of financial worry.\n\nConsidering the average student loan debt was $37,014 in 2022, that adds up to a lot of sleepless nights.\n\nThe National Institute of Mental Health estimates 40 million Americans suffer from anxiety. Financial worries are a massive trigger for those disorders.\n\nYou assume the worst, like that you’ll be homeless if your house gets foreclosed, or your car is going to break down on the way to work and you’re going to get fired for being late.\n\nNobody wants to live like that.\n\nAnd apparently, they don’t want to marry anyone who lives like that, either.\n\nAnger\n\nAs the economy sags, anger issues rise. The phenomenon got its own name in medical circles: Debt-Anger Syndrome.\n\nInstead of panicking or denying problems, victims get mad. They are mad at creditors who continually send them bills; mad at the mailman for delivering the bills; mad at their bosses for not paying them more; mad at their spouses for not making more money; mad at their kids for needing new braces; and mad at themselves for getting into this fix.\n\nIn short, they are mad at life.\n\nThis not only can ruin relationships, the physiological effects can lead to migraines, heart disease and reduce your resistance to infections.\n\nSomewhat surprisingly, suicide rates actually dropped during the pandemic. The Centers for Disease Control reported suicides in the U.S. were down 6% in 2020. That was the largest annual drop in almost 40 years.\n\nResearchers aren’t sure what led to the welcome decline, since overall mental-health issues skyrocketed due to the shutdown. They speculate increased treatment availability helped, along with a different overall perception of suicide.\n\nWith so many people suffering emotionally, the stigma associated with seeking medical help decreased. That suggests the first step is self-awareness. If you are experiencing financial difficulties, know you have a lot of company, and recognize the possible impact on your health, mood, and well-being. Seeking help from mental health professionals is as natural as seeking help from financial experts.\n\nDepression\n\nPeople deny, freak out and lash out over debt. After they work through those stages, the bills are still staring them back in the face. That’s when depression sets in.\n\nIt spread like a virus during the pandemic. A 2020 Kaiser Family Foundation (KFF) Health Tracking Poll found that households experiencing income or job loss caused them to experience at least one adverse effect on their mental health. That included difficulty sleeping or eating, increases in alcohol consumption or substance use, and worsening chronic conditions.\n\nHopelessness sets in, as does low self-esteem. It can lead to even more debt, since sufferers sometimes try to relieve their depression by treating themselves to a shopping spree or some other mental getaway. Depression does not discourage impulse spending; in fact, it has the opposite effect.\n\nBut all that does is lead to more debt, which leads to more depression and despair. At that point, people don’t care whether their pain is caused by debt or debt is causing their pain.\n\nThey just want the pain to end.\n\nDebt’s Effects on Physical Health\n\nThere is no wall between your mental and physical health. The two overlap and affect each other in ways both good and bad.\n\nWhen debt and stress are involved, the effects are seldom positive. Debt and stress can affect your physical health in a number of ways, including but not limited to:\n\nBlood pressure, which is also influenced by diet and overall condition. Add stress and this can become a serious problem.\n\nHeart rate, which can also affect your heart’s rhythms, which can in turn lead to stroke and other events.\n\nImmune system functions, which have been very much in the news during the pandemic.\n\nMood, which has consequences internal (like your mental wellness) and external (such as your important relationships).\n\nMemory, which can be impacted and which then can create further stress.\n\nWeight gain or loss, which has implications for blood pressure and heart health.\n\nNegative Effects of Debt on Young Adults\n\nDebt is aggressively egalitarian, eager to afflict anyone regardless of age, race, education level or personal resources. Each of those groups, however, handles debt and its related challenges in different ways.\n\nThose challenges are especially daunting for young people, who increasingly begin their adult lives with crippling student loan debt that affects every other aspect of their lives. These unique challenges give rise to unique kinds and levels of stress.\n\nA study published by Silvercloud Health underscored the impact of debt and financial difficulty on the mental health of people aged 18 to 24. Those ages marked the parameters of the survey, but there is no magic cutoff at age 25. The lesson is that earlier debt obligations lead to earlier struggles to cope with debt, both financially and mentally.\n\nThe Silvercloud study showed:\n\n24% of those surveyed reported they’ve already experienced financial difficulties and debt.\n\nOf those, 81% said debt negatively affected their mental health.\n\n31% have sought mental health support.\n\n84% feel general anxiety about their future.\n\n69% are worried about unpaid bills.\n\nWhile there are no easy solutions for these challenges, it is important to address them. Developing a healthy, proactive strategy for handling financial problems before they spiral out of control can help young people navigate the deeper, rougher seas ahead.\n\nNegative Effects of Debt on Older Adults\n\nIf younger people are stressed by incurring early debts such as student loans and car payments, the older generation faces a different set of pressing issues.\n\nDebt accumulated over decades of living – mortgages, credit cards, personal loans – can create a crisis for those approaching retirement age, or even those trying to plan for their eventual retirement.\n\nRetirement savings typically require discipline and restraint, two things that are undermined by debt, and which debt, in turn, undermines. Significant debt can make it difficult to prioritize retirement savings over debt payoff. Simply put, there are fewer financial assistance options for seniors.\n\nA 2018 study called “The Graying of U.S. Bankruptcy,” published by the Consumer Bankruptcy Project, blamed the weakening of the social safety net – including Social Security and Medicare – along with rising costs for healthcare, prescription drugs and other expenses, for a dramatic rise in bankruptcy filings by Americans over age 65.\n\nBetween 1991 and 2018, the percentage of bankruptcy filings be seniors rose over 500%. With Florida Senator Rick Scott pushing for the elimination of Social Security, these numbers may rise even more alarmingly.\n\n» Learn More: Avoid Debt as a Senior – Resources for Economic Security\n\nAdvice on Managing Financial Stress & Debt\n\nThe ideal way to deal with debt-related stress is to avoid it. While that sounds impractical, there are ways to cope with stress by developing strategies and financial habits that can reduce both debt and stress:\n\nWriting down debt: To help address your debt, it helps to know when you have too much debt.\n\nIdentifying your debt: Once you make a list, analyze it. You need to know which debts are unsecured and which are digging the hole deeper with high interest rates.\n\nPrioritizing what debts are most important: Your home is more important than your department store credit card. It isn’t always that obvious, but you can make sure your first payments address your most important needs.\n\nSet a budget: This is where the discipline comes in. Once you have a good idea of your monthly obligations, it is important to make – and stick with – a plan to meet them.\n\nCut expenses: This is the more difficult aspect of sticking to a budget – eliminating unnecessary costs.\n\nIdentify spending habits: Do you need that third TV streaming service? Can you get by with ads on your music streamer instead of that monthly fee? There are apps and websites that help you itemize the automatic monthly payments you have signed up for.\n\nStart paying down debt: Once you have organized your finances, stick with your plan. When there is unexpected money, throw it at your debt rather than throwing it away.\n\nSeek help for mental health: If all your efforts don’t lower your stress levels, or if all that focus on your debts actually increases your stress, don’t try to deal with it alone.\n\nPay new bills immediately if possible: Adding to your debt load is the opposite of lowering your debt load.\n\nSeek help from Debtors Anonymous.\n\n» Learn More About: 11 Mistakes to Avoid When You’re Trying to Get Out of Debt.\n\nSeek Help from Mental Health and Financial Professionals\n\nIf financial difficulties such as debt are causing stress, depression and other mental health concerns, and mental health concerns are making it tougher to deal with financial difficulties – well, that is a spiral that you must find a way to slow down and stop.\n\nHelp is available in both areas. There are qualified experts who can provide counseling and advice about debt, and there are professionals equipped with strategies to alleviate mental health issues.\n\nFor the latter, a good first step is your doctor or other medical professional. They may be able to help with minor mental health issues, or refer you to a therapist or psychiatrist qualified to work with more severe issues. The coping mechanisms they offer can help when dealing with debt and other financial worries.\n\nThere are options to receive financial assistance to address mental health issues, so don’t let money be a barrier to treatment.\n\nOne path to good mental health is dealing with the stress-causing issues directly. There are plenty of good debt-relief options available:\n\nCredit Counseling provides advice from qualified experts who will help create a plan to deal with your specific issues. Credit counseling services are often nonprofit and FREE of charge.\n\nDebt Management Programs are designed to combine credit card payments into one monthly payment with a lower interest rate. Such programs are offered by nonprofit credit counseling agencies.\n\nDebt Consolidation also gathers unsecured debt like credit cards, and pays them off by taking out a loan from a bank, credit union or online lender to pay off the credit cards. You still must repay the loan, but the interest rate should be considerably lower and you’re only writing one check, instead of multiple checks.\n\nDebt Settlement is paying less than what you owe. Achieving that is difficult and time consuming. Lenders are not obligated to accept settlement offers. It often takes 3-4 years to reach a settlement with those who do. By that time, the late fees and interest payments increase the balance you owe so dramatically that a settlement may only be for 10%-20% of what you originally owed. And debt settlement is a stain on your credit report that can lower your score 100-200 points.\n\nBankruptcy protection comes in a couple of different packages, but it should always be considered as a last resort when other options have not been successful. If there is no way to repay your debts in five years or less, bankruptcy might be the best option.\n\nWhichever road you take toward debt reduction and resolution, one benefit is likely to be a reduction in the stress and anxiety that may have led to depression or more serious mental health issues. Lifting the burden of debt from your shoulders will leave you with more financial freedom and more discretionary income to enjoy it with."}, {"url": "https://www.rba.gov.au/education/resources/explainers/the-global-financial-crisis.html", "page_content": "Download the complete Explainer\n\n117 KB\n\nThe global financial crisis (GFC) refers to the period of extreme stress in global financial markets and banking systems between mid 2007 and early 2009. During the GFC, a downturn in the US housing market was a catalyst for a financial crisis that spread from the United States to the rest of the world through linkages in the global financial system. Many banks around the world incurred large losses and relied on government support to avoid bankruptcy. Millions of people lost their jobs as the major advanced economies experienced their deepest recessions since the Great Depression in the 1930s. Recovery from the crisis was also much slower than past recessions that were not associated with a financial crisis.\n\nMain Causes of the GFC\n\nAs for all financial crises, a range of factors explain the GFC and its severity, and people are still debating the relative importance of each factor. Some of the key aspects include:\n\n1. Excessive risk-taking in a favourable macroeconomic environment\n\nIn the years leading up to the GFC, economic conditions in the United States and other countries were favourable. Economic growth was strong and stable, and rates of inflation, unemployment and interest were relatively low. In this environment, house prices grew strongly.\n\nExpectations that house prices would continue to rise led households, in the United States especially, to borrow imprudently to purchase and build houses. A similar expectation on house prices also led property developers and households in European countries (such as Iceland, Ireland, Spain and some countries in Eastern Europe) to borrow excessively. Many of the mortgage loans, especially in the United States, were for amounts close to (or even above) the purchase price of a house. A large share of such risky borrowing was done by investors seeking to make short-term profits by ‘flipping’ houses and by ‘subprime’ borrowers (who have higher default risks, mainly because their income and wealth are relatively low and/or they have missed loan repayments in the past).\n\nBanks and other lenders were willing to make increasingly large volumes of risky loans for a range of reasons:\n\nCompetition increased between individual lenders to extend ever-larger amounts of housing loans that, because of the good economic environment, seemed to be very profitable at the time.\n\nMany lenders providing housing loans did not closely assess borrowers’ abilities to make loan repayments. This also reflected the widespread presumption that favourable conditions would continue. Additionally, lenders had little incentive to take care in their lending decisions because they did not expect to bear any losses. Instead, they sold large amounts of loans to investors, usually in the form of loan packages called ‘mortgage-backed securities’ (MBS), which consisted of thousands of individual mortgage loans of varying quality. Over time, MBS products became increasingly complex and opaque, but continued to be rated by external agencies as if they were very safe.\n\nInvestors who purchased MBS products mistakenly thought that they were buying a very low risk asset: even if some mortgage loans in the package were not repaid, it was assumed that most loans would continue to be repaid. These investors included large US banks, as well as foreign banks from Europe and other economies that sought higher returns than could be achieved in their local markets.\n\n2. Increased borrowing by banks and investors\n\nIn the lead up to the GFC, banks and other investors in the United States and abroad borrowed increasing amounts to expand their lending and purchase MBS products. Borrowing money to purchase an asset (known as an increase in leverage) magnifies potential profits but also magnifies potential losses. As a result, when house prices began to fall, banks and investors incurred large losses because they had borrowed so much.\n\nAdditionally, banks and some investors increasingly borrowed money for very short periods, including overnight, to purchase assets that could not be sold quickly. Consequently, they became increasingly reliant on lenders – which included other banks – extending new loans as existing short-term loans were repaid.\n\n3. Regulation and policy errors\n\nRegulation of subprime lending and MBS products was too lax. In particular, there was insufficient regulation of the institutions that created and sold the complex and opaque MBS to investors. Not only were many individual borrowers provided with loans so large that they were unlikely to be able to repay them, but fraud was increasingly common – such as overstating a borrower's income and over-promising investors on the safety of the MBS products they were being sold.\n\nIn addition, as the crisis unfolded, many central banks and governments did not fully recognise the extent to which bad loans had been extended during the boom and the many ways in which mortgage losses were spreading through the financial system.\n\nHow the GFC Unfolded\n\nUS house prices fell, borrowers missed repayments\n\nThe catalysts for the GFC were falling US house prices and a rising number of borrowers unable to repay their loans. House prices in the United States peaked around mid 2006, coinciding with a rapidly rising supply of newly built houses in some areas. As house prices began to fall, the share of borrowers that failed to make their loan repayments began to rise. Loan repayments were particularly sensitive to house prices in the United States because the proportion of US households (both owner-occupiers and investors) with large debts had risen a lot during the boom and was higher than in other countries.\n\nStresses in the financial system\n\nStresses in the financial system first emerged clearly around mid 2007. Some lenders and investors began to incur large losses because many of the houses they repossessed after the borrowers missed repayments could only be sold at prices below the loan balance. Relatedly, investors became less willing to purchase MBS products and were actively trying to sell their holdings. As a result, MBS prices declined, which reduced the value of MBS and thus the net worth of MBS investors. In turn, investors who had purchased MBS with short-term loans found it much more difficult to roll over these loans, which further exacerbated MBS selling and declines in MBS prices.\n\nSpillovers to other countries\n\nAs noted above, foreign banks were active participants in the US housing market during the boom, including purchasing MBS (with short-term US dollar funding). US banks also had substantial operations in other countries. These interconnections provided a channel for the problems in the US housing market to spill over to financial systems and economies in other countries.\n\nFailure of financial firms, panic in financial markets\n\nFinancial stresses peaked following the failure of the US financial firm Lehman Brothers in September 2008. Together with the failure or near failure of a range of other financial firms around that time, this triggered a panic in financial markets globally. Investors began pulling their money out of banks and investment funds around the world as they did not know who might be next to fail and how exposed each institution was to subprime and other distressed loans. Consequently, financial markets became dysfunctional as everyone tried to sell at the same time and many institutions wanting new financing could not obtain it. Businesses also became much less willing to invest and households less willing to spend as confidence collapsed. As a result, the United States and some other economies fell into their deepest recessions since the Great Depression.\n\nPolicy Responses\n\nUntil September 2008, the main policy response to the crisis came from central banks that lowered interest rates to stimulate economic activity, which began to slow in late 2007. However, the policy response ramped up following the collapse of Lehman Brothers and the downturn in global growth.\n\nLower interest rates\n\nCentral banks lowered interest rates rapidly to very low levels (often near zero); lent large amounts of money to banks and other institutions with good assets that could not borrow in financial markets; and purchased a substantial amount of financial securities to support dysfunctional markets and to stimulate economic activity once policy interest rates were near zero (known as ‘quantitative easing’).\n\nIncreased government spending\n\nGovernments increased their spending to stimulate demand and support employment throughout the economy; guaranteed deposits and bank bonds to shore up confidence in financial firms; and purchased ownership stakes in some banks and other financial firms to prevent bankruptcies that could have exacerbated the panic in financial markets.\n\nAlthough the global economy experienced its sharpest slowdown since the Great Depression, the policy response prevented a global depression. Nevertheless, millions of people lost their jobs, their homes and large amounts of their wealth. Many economies also recovered much more slowly from the GFC than previous recessions that were not associated with financial crises. For example, the US unemployment rate only returned to pre-crisis levels in 2016, about nine years after the onset of the crisis.\n\nStronger oversight of financial firms\n\nIn response to the crisis, regulators strengthened their oversight of banks and other financial institutions. Among many new global regulations, banks must now assess more closely the risk of the loans they are providing and use more resilient funding sources. For example, banks must now operate with lower leverage and can’t use as many short-term loans to fund the loans that they make to their customers. Regulators are also more vigilant about the ways in which risks can spread throughout the financial system, and require actions to prevent the spreading of risks.\n\nAustralia and the GFC\n\nRelatively strong economic performance\n\nAustralia did not experience a large economic downturn or a financial crisis during the GFC. However, the pace of economic growth did slow significantly, the unemployment rate rose sharply and there was a period of heightened uncertainty. The relatively strong performance of the Australian economy and financial system during the GFC, compared with other countries, reflected a range of factors, including:\n\nAustralian banks had very small exposures to the US housing market and US banks, partly because domestic lending was very profitable.\n\nSubprime and other high-risk loans were only a small share of lending in Australia, partly because of the historical focus on lending standards by the Australian banking regulator (the Australian Prudential Regulation Authority (APRA)).\n\nAustralia's economy was buoyed by large resource exports to China, whose economy rebounded quickly after the initial GFC shock (mainly due to expansionary fiscal policy).\n\nAlso a large policy response\n\nDespite the Australian financial system being in a much better position before the GFC, given the magnitude of the shock to the global economy and to confidence more broadly, there was also a large policy response in Australia to ensure that the economy did not suffer a major downturn. In particular, the Reserve Bank lowered the cash rate target significantly, and the Australian Government undertook expansionary fiscal policy and provided guarantees on deposits at and bonds issued by Australian banks.\n\nFollowing the crisis, APRA implemented the stronger global banking regulations in Australia. Together, APRA and the financial market and corporate regulator, the Australian Securities and Investments Commission, have also strengthened lending standards to make the financial and private sectors more resilient."}, {"url": "https://www.nytimes.com/2021/10/06/business/debt-ceiling-social-security-medicare.html", "page_content": "The federal government is about two weeks away from being unable to pay its bills — and that could delay benefit payments to tens of millions of retirees, Medicare and Medicaid providers, and numerous others receiving checks from the U.S. Treasury.\n\nRunning into the federal borrowing limit could lead to a catastrophic default on the nation’s debt. Once the government reaches the ceiling — and exhausts all other measures to keep payments flowing — it will run out of funds for bills it has already promised to pay.\n\nTo avoid such a calamity, Democrats are weighing a change to filibuster rules in order to hold a vote. Senator Mitch McConnell of Kentucky, the minority leader, has suggested allowing a temporary increase until December, although that would merely postpone a default deadline for a matter of weeks.\n\nThe government has never defaulted on its obligations, so what would happen is unclear. But the effects could be wide-ranging, covering programs as varied as Social Security benefits and school lunches."}]}