{"The blog of Casey Serin was widely read and attracted the attention of the media.": [{"url": "https://www.liquisearch.com/casey_serin/blog_and_media_attention", "page_content": "Blog and Media Attention\n\nIn September 2006, Serin started the blog IamFacingForeclosure describing his situation, with the idea of both soliciting advice and warning others how to avoid the mistakes he had made. Interest in the blog first developed among readers of other blogs devoted to the United States housing bubble. His story was featured in numerous media outlets—among them, USA Today, National Public Radio, New York magazine, the San Francisco Chronicle, The Economist, The Suze Orman Show, and ABC's Nightline. When Serin first started the blog, commenters were generally supportive, hoping that Serin would make a good faith effort to avoid foreclosure and pay back any remaining debts by looking for work. The initial media exposure largely lauded Serin as an example of forthright blogging, without delving very deeply into the origin of his debts. Also, in 2006 Casey Serin appeared on \"Rich Dad's Online Business School\" where Casey Serin told his story to Robert Kiyosaki and the members of his audience.\n\nDuring the ensuing 9 months that the blog was updated, Serin generally let his problems stagnate—urgent mail went unopened, the houses went into foreclosure one by one, and Serin did not actively look for work. The overall tone of the blog's comments gradually went from encouraging Serin to openly deriding him for his inaction, his apparent nonchalant attitude towards his financial issues, and his role in the then-emerging subprime mortgage crisis. In May 2007, CNET.com writer Declan McCullagh published an article about Serin's story and the largely negative reactions Serin's blog was garnering from commenters, referring to Serin as \"the world's most hated blogger\" and describing his blog as \"irritainment.\" McCullagh wrote that \"Casey's blog has an enthusiastic – if unrelentingly critical – audience known as 'haterz'.\" Serin acknowledged that he began to purposely anger readers in an effort to drive further traffic to the blog. In time, the blog developed a cult status, as Serin began writing about the toll his actions were taking on his personal life. The spectre of legal ramifications also factored heavily into the blog. Many commenters stated that they were attracted to the increasingly \"soap opera\"-like nature of Serin's story, and the blog was featured on a number of sites devoted to so-called \"trainwreck watching.\""}, {"url": "https://www.cnet.com/culture/hated-blogger-leaves-u-s-threatens-lawsuits/", "page_content": "Casey Serin, arguably the world's most-hated blogger, rocketed to Internet stardom after disclosing his pending foreclosures, marital strife and unwillingness to find a job. But the 24-year-old's online fame was hardly flattering: it arose from legions of readers who call themselves \"haterz\" and frequent his iamfacingforeclosure.com blog to ridicule his financial missteps and urge Serin to pay back up to $420,000 he is said to owe creditors.\n\nThe latest kerfuffle arose last week after Serin blogged about a contract with a mysterious \"independent publisher\" for self-help material about how to deal with foreclosure. To the so-called haterz, this represented an enticing challenge, which they met by outing the publisher as self-styled Internet marketer Marty Stewart and even unearthing a confidential business plan for iamfacingforeclosure.com and related audio files that Stewart left on a Web site that was not password-protected. The files have since been mirrored elsewhere.\n\n--Casey Serin,\n\nblogger \"We've been letting everything go for so long, people think they can just do this without any penalties.\"\n\nNow Serin and Stewart are crying foul. We're going to \"aggressively be pursuing any Web site that has our private content posted on it,\" Stewart said in a telephone interview with CNET News.com on Tuesday. \"Obviously it's copyrighted content and it's being smeared all over.\"\n\n\"We've been letting everything go for so long, people think they can just do this without any penalties,\" Serin added.\n\nSerin handed the haterz even more ammunition this week by disclosing that he had left his wife, Galina , behind in West Sacramento, Calif., with only about $300 in the bank and had set up operations in an undisclosed location in Australia. Because Serin has refused to get a full-time job--preferring instead to chase dreams of instant wealth through real estate deals--Galina lives with her sister and cleans houses to pay for food and rent.\n\nThis interlude highlights the difficult task that Serin has faced in trying to profit from iamfacingforeclosure.com's popularity. Some of his readers are resolute in offering advice to someone they view as a misguided but promising young entrepreneur. Others are devout Christians who urge him to follow the Bible more closely.\n\nBut the so-called haterz have become the most vocal. The HousingPanic blog calls Serin \"the physical representation of fraud, greed, debt, fear, bubbles and human folly.\" Others, including some inside the U.S. Department of Justice, have been prodding federal and state prosecutors to indict Serin for mortgage fraud. A more recent suggestion is to take up a collection for a Galina Divorce Fund that would cover \"legal fees, basic living expenses, psychological therapy.\"\n\nListen up Serin issues threats\n\nBlogger says he has left his wife, the U.S., and is threatening legal action.\n\n\n\nDownload mp3 (19.3MB)\n\nAlong the way, Serin's notoriety led to appearances on Suze Orman's and Robert Kiyosaki's financial-advice shows, and the creation of an entire encyclopedia, Caseypedia.com, with hundreds of entries mocking his exploits. A Casey Serin Dance Remix appeared, as have photo galleries depicting him as, alternatively, Gilligan from Gilligan's Island and McDonald's Hamburglar character. Casey's Web site has even become a case study in a presentation submitted for the Defcon hacker convention discussing click fraud, and he's been called a \"national obsession.\"\n\nA recent tactic of the haterz has been to repost Serin's blog entries on sites like Blogspot-hosted \"exurbanation\"--arguably in violation of copyright law--in hopes of depriving him of advertising page views. \"It's not right for them to continue ripping my posts and putting it in their comments and encouraging people to read it there,\" Serin said. He has threatened to file a Digital Millennium Copyright Act complaint with Google, which owns Blogspot, to try to force the deletion of his material.\n\nA \"heartbroken\" wife left behind\n\nOne wildcard in the Casey Serin saga, which has played out on the Internet since iamfacingforeclosure.com launched last September, is whether Galina will leave her husband, who ran up $2.2 million in debt and lost five houses to foreclosure.\n\nIn a conversation at her sister's townhouse in early May, where the young couple rented two rooms, Galina said that she was becoming frustrated with her husband's spending and had met with her Baptist pastor that afternoon for counseling. But according to her strict religious views, Galina said, \"there are only two reasons for a divorce: adultery and physical abuse.\"\n\nNot helping matters is that some of Serin's former business partners have turned against him. In a series of posts to a haterz blog, onetime partner Duane LeGate recently lambasted Serin and said his wife was heartbroken: \"He left Galina with 300 dollars in the checking account to pay bills. He is not planning on supporting her.\" In return, Serin calls LeGate a \"hypocrite\" and \"back-stabber.\"\n\nFor his part, Serin said he had to escape West Sacramento because his wife and family had been pressuring him to pull the plug on his blog, which he did briefly last month (his brother Steve has publicly berated him for irresponsibility). \"I didn't even know I was going until the night before, so I myself didn't have a lot of notice,\" Serin said. \"There was so much drama going on around this blog.\"\n\nA CNET News.com reader appears to have footed the bill for the Australia trip. In an e-mail message on June 2, that reader offered to pay $1,000 to keep the blog going--and apparently followed through. Serin wrote in follow-up message four days later: \"That guy WAS for real. A true supporter. Crazy things happen when you're blogging.\"\n\nSpeculation has turned to where Serin is hiding out and whether he's on the run from the law. Serin refuses to disclose where he is except to say he's somewhere in eastern Australia and is living for the next few months with some fans who offered to let him stay with them for free.\n\nOne reader, who asked to be identified only by his first name, Nathaniel, suggested: \"Serin is attempting to force his wife to divorce him. He wants the perceived moral superiority of being able to tell others that she was the one who wanted it, not him. He denies leaving her with no money, but then admits that automatic payments drained their bank account shortly after he left the country.\"\n\nSome wags have suggested that Galina auction off her absent husband's belongings. A Casey-haterz conference call was held Monday night, with one supposedly expected to be more supportive scheduled for Friday.\n\nAmateur detectives have unearthed an Internet Protocol address they say might be Serin's. The address would put his location in the Sydney suburb of Northmead in New South Wales. Others have urged readers to \"please contact the AFP immediately,\" meaning the Australian Federal Police.\n\n(One common charge is that, by lying on mortgage applications, Serin violated state and federal fraud laws. Serin uses the term \"my mortgage fraud.\" He also admits: \"I overstated my income, misrepresented owner occupancy intent and concealed the cash-back from the lenders.\")\n\nNow that he's left West Sacramento, Serin says he can devote more energy to trying to make some money off his blog. The concept has shown some promise: he was able to earn $2,256 of advertising revenue in one week, but then was forced to return most of it after temporarily shutting down iamfacingforeclosure.com.\n\nStewart, the new business partner, claims to be an experienced Internet marketer whose PageDaddy.com site promises to help \"frustrated and struggling Web site owners drive massive amounts of targeted traffic to their Web pages.\" (During an interview, however, he was not able to offer any client references or even divulge the number of people that PageDaddy.com employed.)\n\nHe blames the haterz for obsessing over Serin's travails. \"It just amazes me that these people waste\" so much time, he said. Stewart also threatened to \"aggressively\" seek to find out which haterz are behind reposting the confidential business plan and audio recordings that were left on a public Web site.\n\nStewart's brainchild was an independently published book titled The Foreclosure Code, with cover graphics reminiscent of Dan Brown's best-selling The Da Vinci Code. But now he's found that his photograph, cell phone number and marketing plans have been immortalized on sites like Caseypedia.com. Thanks to the haterz, that information has been \"blasted and smeared all over the Internet. To be frank, I'm very pissed,\" Stewart said."}, {"url": "https://www.prweb.com/releases/2006/10/prweb467291.htm", "page_content": "Casey Serin has become the media poster child for the American housing bubble as it deflates. The one-time investor has five properties facing foreclosure in four different states and decided to blog about it at http://www.iamfacingforeclosure.com. Meanwhile, he has created a large following of critics and supporters and his tale of woe has been publicized nationally by USA Today and NPR. Nigel Swaby, a licensed mortgage broker and industry writer, has picked up the story on his blog http://www.slcrealestate.blogspot.com and has released a serialized version of his interview with Mr. Serin.\n\n\"I saw Casey's story out there in the first weeks of September and made a couple of advisory posts,\" Swaby commented. With house prices declining, the media turned its focus to bubble talk and Casey soon became the poster child of what not to do. \"As I kept reading his story, I realized he's very intelligent and pretty shrewd about reaching his goal of avoiding foreclosure,\" Swaby added. When mainstream media stories hit in October, their slant on Casey's situation was primarily negative. Swaby continued, \"I wanted to give Casey a fair shake and write objectively about his investments, his marketing abilities with the blog and his future plans.\"\n\nNigel Swaby's Salt Lake Real Estate blog is new on the web, but has steadily gained a readership of several thousand visitors per month. The focus of the blog is mainly real estate and mortgage news with plenty of tips for investors and first time homebuyers. Casey Serin's tale of facing foreclosure ranks as one of the biggest stories in real estate this year and has plenty of teaching opportunities for investors and new homebuyers alike.\n\n###"}, {"url": "https://wiki2.org/en/Casey_Serin", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nCasey Konstantin Serin (born September 10, 1982, legally renamed Casey Constantine in April 2016) is an Uzbekistan-born American blogger, mortgage broker, and real estate investor. In a newspaper article, USA Today called him the \"poster child for everything that went wrong in the real estate boom\".[1] Born in Tashkent, Uzbekistan, Serin immigrated to the United States in 1994. After graduating from high school, Serin bounced from job to job, generally working in website design. However, in his early twenties, Serin decided to quit working full-time in order to pursue a career in house flipping as a means of earning an income and building wealth. In an eight-month period beginning in October 2005, Serin purchased eight houses in four southwest U.S. states, and then began blogging about the foreclosure[2] process on the properties he was unable to resell. In time, five of the eight properties foreclosed.[3] The dubious nature of Serin's real estate transactions, coupled with his subsequent blogging about the affair, have led to Serin's name becoming strongly associated with the subprime mortgage crisis.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 20 521 4 126 18 766\n\nLessons from Real Estate Millionaire Mogul\n\nReal Estate: Is It Really Your Best Investment?\n\nRich Dad poor dad (Momentis Opportunity) Transcription\n\nBackground\n\nBetween October 2005 and May 2006, Serin purchased eight single-family homes using stated income loans.[1][4] These loans required no documentation of income, nor any down payments. Before quitting his web design position in January 2006, Serin claimed an over-inflated income (roughly five times his actual pay) on his loan applications,[5] reasoning that many other borrowers were using similar strategies to obtain mortgages for which they would not otherwise qualify.[6][7] He continued to claim the same income on loan applications completed after he had quit his job. Serin stated that several of the properties were purchased with owner-occupied loans; these generally provide more favorable terms than loans for investment properties.[1] A Voice of San Diego article suggests that Serin's initial loans may not have appeared in credit reports pulled for subsequent loans because he purchased properties in several states over a relatively brief period, so that \"the banks couldn't trace the pending loan documents to check up on his story.\"[8]\n\nSerin received cash back at closing on six of the properties, sometimes exceeding California's legal maximum of three percent of the selling price. A contributor to the Scotsman Guide, a trade publication for the mortgage industry, stated in an article discussing fraudulent practices within the mortgage industry, that the largest amount of cash Serin received for a transaction was $50,000, and that the money was paid either to the seller or a third-party company (which the contributor alleges was bogus), and then returned to Serin after closing. The author, CEO and senior legal counsel of Investors Mortgage Asset Recovery Co. LLC, concludes that responsibility for fraud in cases such as Serin's lies with \"everyone who knew about the undisclosed cash and knowingly assisted in the scheme, including the sellers and any real estate agents, appraisers or closing agents.\"[9] Serin disclosed on a Sacramento news program that he likely would not have been able to qualify for loans under more traditional terms.[10]\n\nDespite already being deeply in debt, in late 2006, Serin borrowed $16,000 to purchase a week-long real estate seminar course purporting to teach \"creative financing\"[11] at Nouveau Riche University (NRU) in Phoenix.[12] Jim Piccolo, the founder of NRU, was later fined a record $6 million in 2011 by the Arizona Corporation Commission for running a fraudulent real estate investment scheme.[13]\n\nMonths later, as the United States housing bubble began to rapidly deflate, Serin became unable to pay the mortgages or sell the properties; at one point, he estimated that he was approximately $2.2 million in debt, with a net worth around negative $600,000.[4] Serin's house buying spree ultimately ended when a lender rejected a loan application for what would have been his ninth property, after discovering his blog.[14] Because of the sheer magnitude of Serin's debt and the improbability of his story, some observers had initially questioned its veracity, alleging that the blog was either performance art or a viral marketing campaign. An article at The Motley Fool expressed doubt over \"whether or not this [isn't] just a somewhat elaborate hoax.\".[15] However, public records confirm that Serin did purchase the properties in question and did subsequently default on most of the mortgages.\n\nForeclosure blog and media attention\n\nIn September 2006, Serin started the blog IamFacingForeclosure describing his situation, with the idea of both soliciting advise and warning others how to avoid the mistakes he had made. Interest in the blog first developed among readers of other blogs devoted to the United States housing bubble.[16] His story was featured in numerous media outlets—among them, USA Today,[1] National Public Radio,[17] New York magazine,[18] the San Francisco Chronicle,[19] The Economist,[6] The Suze Orman Show,[20][21] and ABC's Nightline.[4] When Serin first started the blog, commenters were generally supportive, hoping that Serin would make a good faith effort to avoid foreclosure and pay back any remaining debts by looking for work. The initial media exposure largely lauded Serin as an example of forthright blogging, without delving very deeply into the origin of his debts. Also, in 2006 Casey Serin appeared on \"Rich Dad's Online Business School\" where Casey Serin told his story to Robert Kiyosaki and the members of his audience.\n\nDuring the ensuing 9 months that the blog was updated, Serin generally let his problems stagnate—urgent mail went unopened, the houses went into foreclosure one by one, and Serin did not actively look for work. The overall tone of the blog's comments gradually went from encouraging Serin to openly deriding him for his inaction, his apparent nonchalant attitude towards his financial issues, and his role in the then-emerging subprime mortgage crisis. In May 2007, CNET.com writer Declan McCullagh published an article about Serin's story and the largely negative reactions Serin's blog was garnering from commenters, referring to Serin as \"the world's most hated blogger\" and describing his blog as \"irritainment.\"[22] McCullagh wrote that \"Casey's blog has an enthusiastic – if unrelentingly critical – audience known as 'haterz'.\" Serin acknowledged that he began to purposely anger readers in an effort to drive further traffic to the blog.[23]\n\nFate of the blog\n\nIn April 2007, Serin appeared on The Suze Orman Show to discuss his financial predicament. Orman recommended that Serin file for bankruptcy and attempt to increase his take-home pay.[20]\n\nThe final months of his blog saw further erratic behavior by Serin, including a June 2007 spur-of-the-moment flight to Australia without informing his wife or family members.[24][25] Regarding his multiple mortgages, Serin acknowledged to the Sydney Morning Herald that \"the stuff I did is technically mortgage fraud, but it's not officially called that until someone prosecutes me and proves that that is indeed mortgage fraud,\"[26] asserting a presumption of innocence. While in Australia, Casey Serin appeared on Top Shelf Radio with Robbie Buck.[27] On the Jon Ronson show, Serin again confirmed his use of so-called \"liar loans\".[28]\n\nOn July 11, 2007, Serin disclosed that he was under investigation by the FBI. In an interview conducted by ABC News, his attorney reported that Casey Serin was under investigation by the FBI, but that \"no charges have been brought against Mr. Serin. However, based upon conversations with the U.S. Attorney's office in California, federal charges related to Mr. Serin's real estate transactions are expected to be brought against him\".[29] Shortly thereafter, Serin said in a mass e-mailing that he would be closing the blog and getting a \"regular W-2 job,\" citing the stress his family has experienced.[30]\n\nReturn to real estate\n\nIn 2016, Serin legally changed his name to Casey Constantine. In Facebook comments, he stated that the name change is a sort of rebranding for the next chapter of his career/business in real estate, and that it will allow him much more control over his search results online, somewhat of a clean slate.[31] After the name change, Casey became a licensed Real Estate Broker and Mortgage Loan Originator. He has resumed investing.[32][33][34]\n\nReferences"}, {"url": "http://www.thedigeratilife.com/blog/index.php/2007/03/04/5-things-i-learned-from-casey-serin-the-guy-behind-i-am-facing-foreclosure/", "page_content": "5 Things I Learned From Casey Serin, Doomed Real Estate Blogger\n\nPersonal finance bloggers far and wide have done many an article on analyzing and reviewing financial gurus, including Dave Ramsey, Jim Cramer and Robert Kiyosaki.\n\nBut over here, I’ve decided to do something a bit different. How about let’s deconstruct someone who isn’t a financial guru, but someone who’s in fact a walking case study of real life financial lessons…maybe someone who even shares the blogosphere with us. In other words, I’ve decided to deconstruct a regular joe named Casey Serin.\n\nHave you ever heard of this guy? Chances are, you already have. He’s the fellow who’s set up a blog about his financial misjudgements (or misbehaviors) and in the process, gained quite a lot of media attention, became some kind of a semi-famous (or infamous) internet celebrity and a poster child for how NOT to be a business real estate tycoon. In fact, he’s been dubbed as “the pied piper of financial ruin”.\n\nHere are his own words about himself:\n\nI’m a 24 yr old “would-be real estate mogul” from Sacramento CA. After going to a few seminars I bought 8 houses in 8 months in 4 states with no money down looking to fix ‘n flip. I made some mistakes and am now millions in debt, trying to avoid foreclosure, sell quickly, repay everyone, and share my lessons to help others in trouble.\n\nBefore anything else though, I’d like to make clear that I don’t know the guy personally and have had no direct dealings with him except for the typical blogger email exchange. This is clearly not an endorsement of Casey: for the record, I have never, could never and probably will never follow the path of Trump nor Kiyosaki nor any one else following their footsteps. This is not a defense of Casey, nor is this a crucifixion. I prefer not to take sides because if all I had to provide was negative commentary, then I wouldn’t bother writing this post. Anyway, there’s ample evidence of character assassination over at his blog already.\n\nBut one of the things that has interested me about him, is the fact that he’s based in Sacramento, not very far from the San Francisco Bay Area, and where several people I know including family, friends and co-workers are either residents or have made real estate investments of their own. This guy is young, just starting out his life, is facing a financial nightmare and blogs like a dream, while I’m an avid student of psychology. This begged a closer look.\n\nThe Drama Of Foreclosure\n\nIn the personal finance blogging community, we’re not quite sure what to make of Casey. Some people frown upon his track record and think he’s an irresponsible troll. Some think he’s someone more innocuous, like a rags to almost-riches to rags story that’s just waiting to turn the corner into a financial fairy tale ending. He’s a polarizing, controversial blogger, gaining fans and even more haters out there.\n\nThere’s no doubt that many people are quite angry and eager to see him pay for the “entrepreneurial and financial sins” that he’s committed. Some people weren’t shy about calling out these transgressions as mortgage fraud. Was he playing the system and got busted, or was he just a sad, foolish victim of greed? Was he just a sorry casualty of the real estate bubble? That’s up to the proper authorities to look into as I prefer to focus on more positive take-aways.\n\nI sort of think of him as some kind of tragic star in his own soap opera and have been following this drama on and off for the last few months through his blog, I Am Facing Foreclosure. Earlier in my blogging endeavors, I shared my views of the man, not realizing how unpredictable he could get. Then I entered a phase of pure disbelief as he burned one bridge after another. I even doubted he could be legitimate, given the outrageous, even ridiculous highs and lows of his recent life, especially since many of these mishaps were set in motion by his own hand.\n\nBut yes, Casey Serin is indeed not another lonelygirl15 but actually a genuine person who’s been trying to crawl out of the fiscal quagmire he’s dug himself worth all of $2.2 million, and whose monetary tales of woe have attracted the mainstream media, well-known bloggers and even the controversial Robert Kiyosaki himself to write chapters in this unfolding tale and thus vouch for the authenticity of his person.\n\nSince then, the cringe-worthy behaviors he’s exhibited have continued unabated that I felt it merited a second look from me. His actions continue to rile, frustrate and annoy the multitude, yet as his troubles mount, his popularity has increased.\n\nSo what financial escapades has he been up to lately? Here’s a sampling of his recent activities:\n\nHe’s cashed out a redemption check and decided to buy Valentine’s day gifts and Jamba Juice with it.\n\nHe considered doing a house raffle to unload a house and take $1,500 for his redemption rights if he undergoes a foreclosure auction.\n\nHe discussed his personality to explain his behaviors: for the record, he’s a Rational Inventor, Artisan Promoter.\n\nHe tried vainly to negotiate deals with real estate mentors but ultimately had what seemed to be a bitter falling out with the people involved.\n\nHe’s attempted to set financial goals, struggled with priorities, and displayed a liabilities spreadsheet that would give you a heart attack if you owned it.\n\nHe’s thought about borrowing even more money — $50,000 to fight fire with even more fire — to avoid foreclosure. Is this denial, insanity, foolishness or bravado?\n\nAnd lastly, he’s even admitted lying on his loans in order to secure his properties. Who knows where this will take him? We’ll have to see if it’s going to be to a cold, dark place the size of a walk-in closet.\n\nBut instead of joining his lynch mob, passing judgement, or beating a dead horse about the latest jam he’s gotten himself into — wait, are we that hungry for a post Truman Show fix? — I’ve decided to do two things to catch up with Mr. Serin.\n\nFirst, I’d like to look into what Casey brings to the table, the positive being that he’d like to share his mistakes for us to learn something from them. So that’s what I’ll be focusing on. I’m from a totally different generation than he is, yet he’s managed to teach me a few things.\n\n5 Things I’ve Learned From the “I Am Facing Foreclosure” Story\n\n#1 Let’s learn from some serious fiscal and personal mistakes.\n\nYes, it is clear Casey wants to use his blog to network, gain visibility and perhaps opportunities he would otherwise not come across. But he also wants to caution us how not to conduct ourselves financially. Beyond owning up to his missteps, he’s even gone as far as face a college class to talk about his problems. He’s also managed to really peeve off potential business partners, bruising his track record further in the process. Still, somewhere in the chaos, I’ve learned a lot of new things just by reading his blog — not just about the world of mortgages and real estate, but most especially about human nature.\n\n#2 Why not capitalize on one’s strengths?\n\nThe guy insists on staying with real estate, buying into the “Do What You Love, Everything Else Will Follow” philosophy. He’s stubborn about staying with what he’s passionate about, despite his egregious problems. His strengths? They’re probably in negotiation, promotion, marketing and even writing. If anything is working for him, it’s his blog as well as some promotional attempts that have landed him in the spotlight. Maybe they’ll eventually translate into some networking opportunities, because although Casey looks like a tremendous risk, he displays some talents he can try to parlay into something more productive. Unless of course, his efforts get interrupted by potential legal matters. Will his fortunes run out before he gets a chance to snag that “big deal”?\n\n#3 This confirms my motto: keep it sweet and simple.\n\nI’ll be honest…many of the things Casey mentions in his blog are quite a bit over my head. There’s a good reason for it though, and that’s because when I come across a money-making scheme that is confusing or complicated, I usually steer away from it since it usually turns out negative for my pocket book. Making money and keeping it don’t have to be too complicated. You CAN earn a fortune more easily than this!\n\n#4 Smile in the face of adversity and try, try again.\n\nAs I said earlier, I try to emphasize the positives: the guy is tough, ambitious, can laugh at himself and has a strong spirit. He’s got a genuinely thick hide to be able to take criticism like he’s been doing. How many people can continuously swallow their pride the way this guy does? I have rarely seen anyone who can hold himself together like this in the face of such pressure, negativity and in my opinion, sheer embarrassment. The guy may be one stubborn flake, but he’s a tough cookie. I wish I had just half of his fortitude. However, like most others who’ve imagined being in his shoes, I would’ve cut my losses very early on if I had been in his situation.\n\n#5 Shunning mediocrity can lead to big successes and equally huge failures.\n\nWhat do I mean? I doubt this guy will ever lead his life in a boring fashion. There’ll always be something up his sleeve, whether it means to run himself to the ground, rise to great heights or even go out with a bang. And these qualities could spell his success one day, if he’s ever able to escape from the serious controversy surrounding him. Many big names have met with many massive failures before they went anywhere. The question is, whether he can first get out of the deep hole he’s already in.\n\nSay What? Dedicate An Entire Week To This Fallen Entrepreneur?\n\nSecond, I’d like to use the following week to bring up subjects that have touched many of us to some degree, but which all have had a bearing on this young man’s life. So in the next few days, I plan to present articles that represent information that is simply relevant in some way, to Casey’s background and current experiences. These were posts I was going to make anyway, but had reverberated well into this guy’s life. So to tie it all into one neat package, this following week will be Casey Serin theme week at The Digerati Life. In time, it will be apparent why I called it that.\n\nWhether you’re a supporter or critic of Casey’s, let’s all try to keep an open mind and try to see the other side of this story — the one that helps us pick up lessons.\n\nCopyright © 2007 The Digerati Life. All Rights Reserved."}, {"url": "https://peoplepill.com/people/casey-serin/", "page_content": "Casey Konstantin Serin (born September 10, 1982, legally renamed Casey Constantine in April 2016) is an Uzbekistan-born American blogger and a former real estate investor. In a newspaper article, USA Today called him the \"poster child for everything that went wrong in the real estate boom\". Born in Tashkent, Uzbekistan, Serin immigrated to the United States in 1994. After graduating from high school, Serin bounced from job to job, generally working in website design. However, in his early twenties, Serin decided to quit working full-time in order to pursue a career in house flipping as a means of earning an income and building wealth. In an eight-month period beginning in October 2005, Serin purchased eight houses in four southwest U.S. states, and then began blogging about the foreclosure process on the properties he was unable to resell. In time, five of the eight properties foreclosed. The dubious nature of Serin's real estate transactions, coupled with his subsequent blogging about the affair, have led to Serin's name becoming strongly associated with the subprime mortgage crisis.\n\nBackground\n\nBetween October 2005 and May 2006, Serin purchased eight single-family homes using stated income loans. These loans required no documentation of income, nor any down payments. Before quitting his web design position in January 2006, Serin claimed an over-inflated income (roughly five times his actual pay) on his loan applications, reasoning that many other borrowers were using similar strategies to obtain mortgages for which they would not otherwise qualify. He continued to claim the same income on loan applications completed after he had quit his job. Serin stated that several of the properties were purchased with owner-occupied loans; these generally provide more favorable terms than loans for investment properties. A Voice of San Diego article suggests that Serin's initial loans may not have appeared in credit reports pulled for subsequent loans because he purchased properties in several states over a relatively brief period, so that \"the banks couldn't trace the pending loan documents to check up on his story.\"\n\nSerin received cash back at closing on six of the properties, sometimes exceeding California's legal maximum of three percent of the selling price. A contributor to the Scotsman Guide, a trade publication for the mortgage industry, stated in an article discussing fraudulent practices within the mortgage industry, that the largest amount of cash Serin received for a transaction was $50,000, and that the money was paid either to the seller or a third-party company (which the contributor alleges was bogus), and then returned to Serin after closing. The author, CEO and senior legal counsel of Investors Mortgage Asset Recovery Co. LLC, concludes that responsibility for fraud in cases such as Serin's lies with \"everyone who knew about the undisclosed cash and knowingly assisted in the scheme, including the sellers and any real estate agents, appraisers or closing agents.\" Serin disclosed on a Sacramento news program that he likely would not have been able to qualify for loans under more traditional terms.\n\nDespite already being deeply in debt, in late 2006, Serin borrowed $16,000 to purchase a week-long real estate seminar course purporting to teach \"creative financing\" at Nouveau Riche University (NRU) in Phoenix. Jim Piccolo, the founder of NRU, was later fined a record $6 million in 2011 by the Arizona Corporation Commission for running a fraudulent real estate investment scheme.\n\nMonths later, as the United States housing bubble began to rapidly deflate, Serin became unable to pay the mortgages or sell the properties; at one point, he estimated that he was approximately $2.2 million in debt, with a net worth around negative $600,000. Serin's house buying spree ultimately ended when a lender rejected a loan application for what would have been his ninth property, after discovering his blog. Because of the sheer magnitude of Serin's debt and the improbability of his story, some observers had initially questioned its veracity, alleging that the blog was either performance art or a viral marketing campaign. An article at The Motley Fool expressed doubt over \"whether or not this [isn't] just a somewhat elaborate hoax.\". However, public records confirm that Serin did purchase the properties in question and did subsequently default on most of the mortgages.\n\nForeclosure blog and media attention\n\nIn September 2006, Serin started the blog IamFacingForeclosure describing his situation, with the idea of both soliciting advice and warning others how to avoid the mistakes he had made. Interest in the blog first developed among readers of other blogs devoted to the United States housing bubble. His story was featured in numerous media outlets—among them, USA Today, National Public Radio, New York magazine, the San Francisco Chronicle, The Economist, The Suze Orman Show, and ABC's Nightline. When Serin first started the blog, commenters were generally supportive, hoping that Serin would make a good faith effort to avoid foreclosure and pay back any remaining debts by looking for work. The initial media exposure largely lauded Serin as an example of forthright blogging, without delving very deeply into the origin of his debts. Also, in 2006 Casey Serin appeared on \"Rich Dad's Online Business School\" where Casey Serin told his story to Robert Kiyosaki and the members of his audience.\n\nDuring the ensuing 9 months that the blog was updated, Serin generally let his problems stagnate—urgent mail went unopened, the houses went into foreclosure one by one, and Serin did not actively look for work. The overall tone of the blog's comments gradually went from encouraging Serin to openly deriding him for his inaction, his apparent nonchalant attitude towards his financial issues, and his role in the then-emerging subprime mortgage crisis. In May 2007, CNET.com writer Declan McCullagh published an article about Serin's story and the largely negative reactions Serin's blog was garnering from commenters, referring to Serin as \"the world's most hated blogger\" and describing his blog as \"irritainment.\" McCullagh wrote that \"Casey's blog has an enthusiastic – if unrelentingly critical – audience known as 'haterz'.\" Serin acknowledged that he began to purposely anger readers in an effort to drive further traffic to the blog. Over time, the blog developed a cult status, as Serin began writing about the toll his actions were taking on his personal life. The spectre of legal ramifications also factored heavily into the blog. Many commenters stated that they were attracted to the increasingly \"soap opera\"-like nature of Serin's story, and the blog was featured on a number of sites devoted to so-called \"trainwreck watching.\"\n\nFate of the blog\n\nIn April 2007, Serin appeared on The Suze Orman Show to discuss his financial predicament. Orman recommended that Serin file for bankruptcy and attempt to increase his take-home pay. However, Serin continued to make no effort to secure full-time employment, nor did he file bankruptcy; a bankruptcy attorney had told Serin that he would open himself to potential charges of mortgage fraud if he filed for bankruptcy, since the debts were acquired under fraudulent pretenses.\n\nThe final months of his blog saw further erratic behavior by Serin, including a June 2007 spur-of-the-moment flight to Australia without informing his wife or family members. Regarding his multiple mortgages, Serin acknowledged to the Sydney Morning Herald that \"the stuff I did is technically mortgage fraud, but it's not officially called that until someone prosecutes me and proves that that is indeed mortgage fraud,\" asserting a presumption of innocence. While in Australia, Casey Serin appeared on Top Shelf Radio with Robbie Buck. On the Jon Ronson show, Serin again confirmed his use of so-called \"liar loans\".\n\nOn July 11, 2007, Serin disclosed that he was under investigation by the FBI. In an interview conducted by ABC News, his attorney reported that Casey Serin was under investigation by the FBI, but that \"no charges have been brought against Mr. Serin. However, based upon conversations with the U.S. Attorney's office in California, federal charges related to Mr. Serin's real estate transactions are expected to be brought against him\". Shortly thereafter, Serin said in a mass e-mailing that he would be closing the blog and getting a \"regular W-2 job,\" citing the stress his family has experienced.\n\nSerin's final blog entry on July 28, 2007 was dedicated to his wife. Aaron Krowne, an Emory University library researcher and owner of ml-implode.com, purchased the blog. Serin says he used proceeds from the sale to pay off $35,000 of consumer credit debt in his wife's name.\n\nAlthough Serin retained an attorney in July 2007 and stated that he was under investigation by the FBI, Serin has never been officially charged with any crime.\n\nLegal change of name\n\nIn 2016, Serin legally changed his name to Casey Constantine. In Facebook comments, he stated that the name change is a sort of rebranding for the next chapter of his career/business in real estate, and that it will allow him much more control over his search results online, somewhat of a clean slate."}, {"url": "https://www.cnet.com/tech/tech-industry/casey-serin-the-worlds-most-hated-blogger/", "page_content": "With scant income, assets, or business savvy, the would-be real-estate mogul managed to purchase eight homes in hopes of reselling them at a profit. Along the way, he's lost all of them, run up some $170,000 in credit card and credit line debt, and launched iamfacingforeclosure.com to share his woes with the world. (Editor's note: Serin's site was intermittently reachable Monday.)\n\nFinancial exhibitionism, coupled with a lack of penitence for stiffing his creditors, has transformed the 24-year-old resident of this sleepy Sacramento suburb into a celebrity among fellow bloggers. But unlike other online celebrities, Serin's stardom comes from a unique source: \"haters\" who patronize his blog solely to learn what financial missteps he's made today.\n\n\"A community formed overnight,\" Serin said in an interview. \"It wasn't a very positive community.\"\n\nSince launching his Web site last September, Serin has discovered that it can be profitable to outrage and annoy the thousands of people who visit his blog every day. He estimates he was making up to $1,000 a month through Google ads and believes he's on track to make even more through Yahoo's ad network. His notoriety has led to appearances on Suze Orman's and Robert Kiyosaki's advice shows, and he says he's working on a book and advice packet that he'll sell online.\n\nThrough planning or dumb luck, Serin has managed to capture an audience by severely irritating many disparate groups: those who blame him and fellow speculators for the housing bubble; devout Christians, who urge him to follow the Bible more closely; and others who are hoping for news that his creditors are suing him and that his petite, attractive wife Galina is divorcing him.\n\nSerin makes it all public, including financial spreadsheets and bank statements, frank admissions that he lied on mortgage applications, and, more recently, his marital strife with Galina. Because her husband has refused to get a job since January 2006, the couple has been forced to move in with relatives and Galina cleans houses to pay for their food and rent.\n\nAs a result, the tell-all blog entries have drawn the same kind of highly attentive crowd that might assemble to watch a train wreck in progress. \"I guess I'm an open, kind of exhibitionist personality,\" Serin said.\n\nHis legions of critics use less flattering terms. The HousingPanic blog calls Serin \"the physical representation of fraud, greed, debt, fear, bubbles and human folly.\" Another says Serin is \"slothful, arrogant, unable to plan, unable to make decisions, easily overwhelmed.\"\n\nHating Serin has become something of a sport among bloggers, who compete with each other to post the most biting critiques of his financial missteps. No fewer than four Serin-hating sites have cropped up, and many others poke fun at how he paid tens of thousands of dollars for real-estate investing courses, ran up $2.2 million in debt by buying houses on credit, and then lost most of them to foreclosure (others were sold at a loss, and Serin estimates he owes an additional $100,000 to $250,000 to the banks to cover those losses).\n\nThere's even the sine qua non of a Net-celeb: a Casey Serin Dance Remix mocking his favorite sayings. Doctored photo galleries include images depicting Serin as, alternatively, Gilligan from Gilligan's Island , and McDonald's Hamburglar character. He's already been called a \"national obsession.\"\n\n\"Everyone has an opinion and anyone can speculate,\" said Rob Dawg, who runs a popular anti-Serin Web site called Exurbannation. \"Is he mentally ill? Mentally feeble? Do his bizarre personal habits affect his judgement or vice versa?\" Dawg wrote in e-mail on Friday. \"On and on. For many of us, however, Casey has become the eye of the storm, not the storm itself.\"\n\nSerin has not filed for bankruptcy, though he has publicly mulled the option. For now, he believes himself to be effectively judgment-proof, with his only significant asset being a run-down Volkswagen Jetta that recently was broken into.\n\nReaders who love to hate\n\nThe tension between Serin and his so-called haters has led to an unlikely situation: the very people who loathe him the most also rely on him for a daily source of entertainment.\n\nThe concept is sometimes called \"irritainment,\" defined as: \"Entertainment and media spectacles that are both annoying and compulsively watchable.\" (The O.J. Simpson trial in 1995 is the most famous example. Perez Hilton's blog may be another.)\n\nAgainst their better judgment, some haters have become financial supporters. In March, when Serin was facing a collection agency called CashCall, known for hardball tactics, Serin held a \"beg-a-thon\" trying to raise $220.48 by the next day.\n\nIt worked. Readers paid money to get him to answer personal questions, such as explaining why his wife dropped out of college. Someone even paid Serin $250 for the opportunity to rant to him for an hour about financial responsibility.\n\n\"I was amazed that the so-called haters were willing to spend money on me,\" Serin said. \"It shows that they're not really haters. They're in it for the entertainment.\"\n\nSome are. But others are honestly upset and view Serin as an exemplar of the worst of the housing bubble. Speculators who lied on loans, critics say, raised the cost of housing for honest buyers who needed a place to live, and foreclosures tend to reduce property values of nearby homes.\n\nOne common charge is that by lying on mortgage applications, Serin violated state and federal fraud laws. Serin uses the term \"my mortgage fraud.\" He also admits: \"I overstated my income, misrepresented owner occupancy intent and concealed the cash-back from the lenders.\"\n\nThat frank admission has led to calls to \"Send Casey Serin To Prison\"--a petition to the FBI has appeared--as well as a similar call targeting his wife.\n\n\"Casey and Galina Serin's story isn't one of 'Young couple tries to make it in the cold, cruel world,'\" one critic wrote. \"These two are f****g Bonnie and Clyde. What they're doing is bank robbery, without the gun.\"\n\nStephen Kodak, an FBI spokesman in Washington, said he could not comment on any individual case. \"Yes, it is a crime,\" he said. \"It's a crime to misrepresent your salary. It's a crime to misrepresent whether or not you're going to live in the house.\"\n\nIn March, the FBI announced a crackdown on mortgage scammers and said it has more than 1,000 current investigations. But Kodak said the FBI tends to focus on financial insiders and not people who lie on loans: \"We go after, normally, the fraud for profit, because even though it doesn't make up the majority of the numbers out there, it certainly makes up the largest financial losses.\"\n\nMarital drama, debt addiction\n\nOne wildcard in the Casey Serin saga is his wife, Galina, who met him through church social groups and married him when she was 20 years old. Both are Baptists and Slavic immigrants (Galina immigrated to the U.S. in 1990, and her husband in 1994) and are part of Sacramento's growing Russian-speaking population.\n\nIn a conversation at her sister's townhouse Thursday, where the young couple rents two rooms for about $600 a month, Galina said she was becoming frustrated with her husband's spending and had met with her pastor that afternoon for counseling. But according to her own religious views, Galina said, \"there are only two reasons for a divorce: adultery and physical abuse.\"\n\nRunning up $170,000 in unsecured debt, in other words, does not qualify--nor does lying about his plans regarding a recent vacation in Lake Tahoe, Calif., nor buying a $600 video camera on credit to document life experiences for his blog.\n\nFor his part, Serin confirms that his wife hates his blog. \"Many times she's like: I want you to shut it down and go quietly into the night,\" he said.\n\nThe so-called haters have similar sore points, including that Serin refuses to get a job and instead pays for living expenses by simply borrowing more money. He defends himself by insisting that he's making far more valuable connections through his blog.\n\nOne example he gave is that he learned, through his blog, of a $1.5 billion Las Vegas casino for sale. If he can find a buyer, Serin says, he'd get a 1 percent commission ($15 million) for his trouble. \"Doesn't that make more sense than a W-2 job?\" he said.\n\nSerin also recently paid $16,000 to Arizona's Nouveau Riche University, a kind of real-estate seminar company that includes classes with names like Fix & Flip and Creative Financing. Its marketing literature says that Nouveau Riche \"hand delivers properties on a silver platter.\"\n\nNouveau Riche, which is not accredited by the North Central Association of Colleges and Schools (the regional group recognized by the U.S. Department of Education), claims not to be a multilevel marketing scheme. It has some elements of one, however. Serin said he has found two people to pay $18,000 to Nouveau Riche, and if he finds any more, he'll get a $9,000 commission for each one, as well as additional commissions if the people he recruited then sign up additional customers.\n\nIn an e-mail message over the weekend, Serin added: \"The 16K gives me two years of quality (real estate investment) education--gives you college credits--access to cash-flow properties around the nation, local community of investors, etc.\"\n\nNot all these details have appeared on his blog yet, but Serin seems to enjoy spacing them out in a way that will vex his readers the most. \"What happens is I feed off of it,\" he said. \"I know the buttons to press to get those guys going. After awhile, you learn what topics you can mention if you want to get extra comments on your post.\"\n\nSerin already does that by stressing his penchant for afternoon naps that take place precisely when his readers are reading his blog in their cubicles and silently fuming. He claims to have bought more than $4,000 in penny stocks last month, which have since slid in value. And he delights in posting about his excursions to a nearby Jamba Juice, which became notorious when he bought a $4.90 drink there with an ATM card but was charged an extra $33 overdraft fee because his bank account was empty.\n\nDuring a visit to the same Jamba Juice on Thursday, Serin asked the cashier whether any jobs were available. But, thinking of how much time he spends every day working on his blog, he added: \"Can I keep my laptop back there while I'm at work?\"\n\nHe left without taking an application.\n\nCNET News.com's Anne Broache contributed to this report"}, {"url": "https://slopeofhope.com/2020/07/casey-serin-reincarnated.html", "page_content": "Okay. We’ve got some ground to cover. First, watch this, if you dare.\n\nGot that? He’s a “YouTube sensation” and, one would assume, some kind of stock market wizard who is printing money left, right, and sideways.\n\nLet’s catch up with something more recent…….from days ago……..here is the young stock trading genius YouTube sensation, straight from a storage center:\n\nThere’s a lot to unpack here. Let me save you the time, As this young fellow declares, he…….\n\nHad two business partners “fuck me over” (wow, he sounds really professional right from the get-go)\n\nSmoked pot which was K2 since his dealer screwed him over (ready to sign up for this guy’s stock trading course yet?)\n\nThought he was taking Adderal, but it was actually Xanax\n\nHe admits he’s been acting crazy and regrets not letting people in comments section give him guidance\n\nMentions pot a second time\n\nClaims he’ll be pressing charges (against his drug dealer!)\n\nHe acknowledges students want refunds, but needs to “sorts things through” (translated: finds money to fund the refunds)\n\nBeen in drug rehab\n\nDoesn’t know what day it is, exactly\n\nHe’s at a storage unit because he’s been evicted, and his apartment complex, he calls out by name\n\nClaims his friend was “disrespecting” a staff member\n\nStates the apartment is going to be “pressing charges” too (!)\n\nWarns us all about some character named Yanni he hangs out with\n\nHe’s going to be “laser focused on creating the most valuable educational program in terms of the stock market in history“. Wow.\n\nAnd then build a school of wealth, love, and happiness. Because he’s a servant of God now. So he’s going to start going to church. And take care of homeless people.\n\nHe’s going to give all his money away (please note he’s currently broke)\n\nHe’s going to create wealth from credit (since Jay Z said that’s how Jews got all their money).\n\nHe is living under his parent’s supervision because he’s still medicated. Oh, and homeless.\n\nHe doesn’t think he should be taking it, though, since he’s higher than ever.\n\nHe has to spend times with friends, see a psychiatrist, and has to obey his parents or they will send him back to drug rehab (this is all said while a siren gets louder and louder)\n\nHe’s going to make great content and give it away for free\n\nAt the same time, he’s going to have an affiliate program which entitle you to free iPhones, free Mac Books, free AirPods, and anything else you want. How he’s going to fund this with free content is beyond me.\n\nHe’s going to focus on options, though, because they give you “so much power.” He then goes on to make a clumsy explanation of options and delta.\n\nAnd more on options………they are “very simple” and – – surprise – – the “billionaire Warren Buffett” made his money with options. Who knew?\n\nIf you’re a student of his (God help you…….) he’s taking a survey so you can tell him what you need created. Since he’s here to serve you, like he said. But he has to work on himself. He’s angry. And has bad habits. He thought he was normal. Because he was smoking normal weed. But it was K2. Like he said twice already before.\n\n“I need help.” Yeah, true. I’ll give you that.\n\nHe utters more obscenities than a Tarantiono movie.\n\nOh. A 4th “it wasn’t weed” reference. Then he starts talking to himself. And tells us that’s normal, too.\n\nOh, God, this guy won’t shut up. Now he’s telling you the course will be $600, not free. But it’ll be worth tens of thousands.\n\nNow he says he’s on drugs and has lost all his money in trading.\n\nBut he’s focused on his students. Since, God knows, anyone watching this will want to emulate his life.\n\nHe has a lot of “negative balances” and if you want a refund, then just tell your bank. Yep. Tell ’em.\n\nWith that, he repeats a bunch of stuff he said already and “signs off” for like the fifth time.\n\nBefore I go even one step further, allow me to express my horror and astonishment that I, Tim Knight, who has credentials and bona fides up the yin-yang, and an awesome, well-respected website with fantastic tools, has to get on my knees regularly and plead with free Slopers to pull a few bucks out and subscribe – – while this clown actually has had tons of people throw $370 subscription fees at him in what is widely declared to be a total scam – – and now people can’t get their money back! Incredible! God damn it, sign up!\n\nBut I digress.\n\nI had never heard of this clown in my life. Looking at his ridiculous unibrow, his gross facial hair, and listening to his unhinged verbal meanderings, I just want to rush to the closest sink and scrub my hands with soap vigorously. This guy is so smarmy and repellent, he just grosses me out.\n\nThen I remembered who he reminded me of: Casey Serin.\n\nCasey’s thing wasn’t stocks, like the kid described earlier. Casey’s thing was real estate. As I described it in a post from 2008:\n\nBy “activities,” I mean the purchase of over $2 million in various houses the then-24 year old individual with no meaningful income had purchased. In retrospect, the article about Casey was the most fantastic canary-in-a-coalmine story ever, because it showed how this completely unremarkable person was able to easily get loans (which he himself called “liar’s loans”) to buy properties, all with the hope of “flipping” them for a profit. Now, at this point, those of you familiar with Casey are probably interested that I’m even mentioning him (the rest of you are probably wondering where the charts are). The reason this is such an interesting topic to me is, one, how indicative Casey’s experience was in the context of the “Emperor has no clothes” mentality of real estate investing during 2002-2006, and two, because of the astonishing subculture that grew up around Casey.\n\nSimply stated, Casey spent his early 20s acquiring millions of dollars in real estate, hoping to become a very rich young man. Instead, he wound up bankrupt with ruined credit and a reputation as, and I quote, “the world’s most hated blogger.” There was honestly an entire subculture built around hating the guy, including one of the most hilarious and thorough Wiki sites (over 700 articles!) I’ve ever seen.\n\nAnyway, after the housing bubble collapsed, Casey was last seen parking cars (hence the photo of him above, in the cheap bow tie). But during his manic get-rich-quick days, he floated dozens of insane ideas including a personal favorite, buying an island of his own by 2012:\n\nI hadn’t thought about Casey in many years. I did have a ‘Kennedy moment” when Casey finally gave up on his crazy real estate dreams. I remember precisely where I was and what I was doing, and it was at that moment I realized the ridiculous 2007 bull market was going to get destroyed. Casey was, for me, the poster child of the insanity. As I described above, “the canary in the coal mine.”\n\nThe common elements I see in these two:\n\nYoung men, but give off a gross, slimy, smarmy vibe;\n\nDesperately want to be rich;\n\nAt the same time, piously claim a disinterest in money and instead want to help out humanity in general;\n\nHave latched on to whatever the big financial craze is;\n\nClaim to want to be able to teach people;\n\nSeems to be persistently under the influence of something or another;\n\nAs they “fail forward”, keep making up grandiose schemes about some kind of big come-back, some miracle cure-all that’s going to make everything all better;\n\nVery much into magical thinking and simplistic solutions (aphorisms and bromides being a salve for the soul);\n\nWind up causing a lot of damage in their personal lives, typically on a cataclysmic scale;\n\nTragically so un-self-aware as they offer a way you can learn to be just like them, while any rational observer would pity the poor son of a bitch and would never want to be in their shoes.\n\nI guess some things never change. And I further suppose that I’ve been around long enough to actually see cycles repeat themselves in the form of human characters playing out the same tragic games on their tiny, doomed playhouses of their lives.\n\nhttps://slopeofhope.com/2020/07/casey-serin-reincarnated.html\n\nCasey Serin Reincarnated\n\nIn order to comment on this blog, you must have JavaScript installed and enabled."}, {"url": "https://slopeofhope.com/2008/12/the-strange-tale-of-casey-serin.html", "page_content": "I've been wanting to do this post for many, many months, but I've always held back, because I didn't want to give the subject helpful publicity. But now that he's off the Internet (again), I feel OK proceeding.\n\nThis is about a young man named Casey Serin who lives in the Sacramento, California area. I first learned about him a little over two years ago when I was on a (rare) business trip and picked up the copy of USA Today sitting in front of my hotel room door. On the front page of the business section was a large photo of Casey with an article about his real estate activities.\n\nBy \"activities,\" I mean the purchase of over $2 million in various houses the then-24 year old individual with no meaningful income had purchased. In retrospect, the article about Casey was the most fantastic canary-in-a-coalmine story ever, because it showed how this completely unremarkable person was able to easily get loans (which he himself called \"liar's loans\") to buy properties, all with the hope of \"flipping\" them for a profit.\n\nNow, at this point, those of you familiar with Casey are probably interested that I'm even mentioning him (the rest of you are probably wondering where the charts are). The reason this is such an interesting topic to me is, one, how indicative Casey's experience was in the context of the \"Emperor has no clothes\" mentality of real estate investing during 2002-2006, and two, because of the astonishing subculture that grew up around Casey.\n\nOh, before I go any further, let me introduce you to the subject at hand (the lovely woman to the left is his wife, who divorced him following all the real estate insanity):\n\nThe USA Article described how his properties were in various states of foreclosure (or getting there). While he had obviously intended to make a lot of money (as he frequently referred to it, \"passive income\") off real estate, it wound up wiping out whatever money he did have, destroying his credit, and, in the end, destroying his marriage.\n\nWhen the article came out, Casey had started a web site called I Am Facing Foreclosure, which is where the entire subculture really began. His posts were mildly interesting, but the real action (sort of like Slope) was in the comments section. It didn't take long for an army of \"haterz\" to develop, and over the course of the next couple of years (and a few different blogs under different monikers), a bizarre and contentious relationship developed between Casey and his audience.\n\nThere are many, many blogs on the web about Casey's own blog (which has been shuttered………again) but for me the crowning achievement in all of this is Caseypedia, which is a brilliant collection of over 700 (!) articles about everything imaginable regarding Casey Serin – from his car to his hair to the blue ball he used as a chair (which recently appeared for sale on eBay, in an attempt to squeeze a few dollars out of whatever notoriety might remain).\n\nFor me, Casey represents everything that was wrong about real estate \"investing\" in the recent era – – its laziness, overconfidence, and cluelessness. If nothing else, click on the Random Article link on Caseypedia a few times to get a sense of the place. It's brilliant, and my hat is off to its creators.\n\nOh, and good luck trading today.\n\nhttps://slopeofhope.com/2008/12/the-strange-tale-of-casey-serin.html\n\nThe Strange Tale of Casey Serin\n\nIn order to comment on this blog, you must have JavaScript installed and enabled."}, {"url": "https://alchetron.com/Casey-Serin", "page_content": "Casey Konstantin Serin (born September 10, 1982, legally renamed Casey Constantine in April 2016) is an Uzbekistan-born American blogger and a former real estate investor. In a newspaper article, USA Today called him the \"poster child for everything that went wrong in the real estate boom\". Born in Tashkent, Uzbekistan, Serin immigrated to the United States in 1994. After graduating from high school, Serin bounced from job to job, generally working in website design. However, in his early twenties, Serin decided to quit working full-time in order to pursue a career in house flipping as a means of earning an income and building wealth. In an eight-month period beginning in October 2005, Serin purchased eight houses in four southwest U.S. states, and then began blogging about the foreclosure process on the properties he was unable to resell. In time, five of the eight properties foreclosed. The dubious nature of Serin's real estate transactions, coupled with his subsequent blogging about the affair, have led to Serin's name becoming strongly associated with the subprime mortgage crisis.\n\nBackground\n\nBetween October 2005 and May 2006, Serin purchased eight single-family homes using stated income loans. These loans required no documentation of income, nor any down payments. Before quitting his web design position in January 2006, Serin claimed an over-inflated income (roughly five times his actual pay) on his loan applications, reasoning that many other borrowers were using similar strategies to obtain mortgages for which they would not otherwise qualify. He continued to claim the same income on loan applications completed after he had quit his job. Serin stated that several of the properties were purchased with owner-occupied loans; these generally provide more favorable terms than loans for investment properties. A Voice of San Diego article suggests that Serin's initial loans may not have appeared in credit reports pulled for subsequent loans because he purchased properties in several states over a relatively brief period, so that \"the banks couldn't trace the pending loan documents to check up on his story.\"\n\nSerin received cash back at closing on six of the properties, sometimes exceeding California's legal maximum of three percent of the selling price. A contributor to the Scotsman Guide, a trade publication for the mortgage industry, stated in an article discussing fraudulent practices within the mortgage industry, that the largest amount of cash Serin received for a transaction was $50,000, and that the money was paid either to the seller or a third-party company (which the contributor alleges was bogus), and then returned to Serin after closing. The author, CEO and senior legal counsel of Investors Mortgage Asset Recovery Co. LLC, concludes that responsibility for fraud in cases such as Serin's lies with \"everyone who knew about the undisclosed cash and knowingly assisted in the scheme, including the sellers and any real estate agents, appraisers or closing agents.\" Serin disclosed on a Sacramento news program that he likely would not have been able to qualify for loans under more traditional terms.\n\nDespite already being deeply in debt, in late 2006, Serin borrowed $16,000 to purchase a week-long real estate seminar course purporting to teach \"creative financing\" at Nouveau Riche University (NRU) in Phoenix. Jim Piccolo, the founder of NRU, was later fined a record $6 million in 2011 by the Arizona Corporation Commission for running a fraudulent real estate investment scheme.\n\nMonths later, as the United States housing bubble began to rapidly deflate, Serin became unable to pay the mortgages or sell the properties; at one point, he estimated that he was approximately $2.2 million in debt, with a net worth around negative $600,000. Serin's house buying spree ultimately ended when a lender rejected a loan application for what would have been his ninth property, after discovering his blog. Because of the sheer magnitude of Serin's debt and the improbability of his story, some observers had initially questioned its veracity, alleging that the blog was either performance art or a viral marketing campaign. An article at The Motley Fool expressed doubt over \"whether or not this [isn't] just a somewhat elaborate hoax.\". However, public records confirm that Serin did purchase the properties in question and did subsequently default on most of the mortgages.\n\nForeclosure blog and media attention\n\nIn September 2006, Serin started the blog IamFacingForeclosure describing his situation, with the idea of both soliciting advice and warning others how to avoid the mistakes he had made. Interest in the blog first developed among readers of other blogs devoted to the United States housing bubble. His story was featured in numerous media outlets—among them, USA Today, National Public Radio, New York magazine, the San Francisco Chronicle, The Economist, The Suze Orman Show, and ABC's Nightline. When Serin first started the blog, commenters were generally supportive, hoping that Serin would make a good faith effort to avoid foreclosure and pay back any remaining debts by looking for work. The initial media exposure largely lauded Serin as an example of forthright blogging, without delving very deeply into the origin of his debts. Also, in 2006 Casey Serin appeared on \"Rich Dad's Online Business School\" where Casey Serin told his story to Robert Kiyosaki and the members of his audience.\n\nDuring the ensuing 9 months that the blog was updated, Serin generally let his problems stagnate—urgent mail went unopened, the houses went into foreclosure one by one, and Serin did not actively look for work. The overall tone of the blog's comments gradually went from encouraging Serin to openly deriding him for his inaction, his apparent nonchalant attitude towards his financial issues, and his role in the then-emerging subprime mortgage crisis. In May 2007, CNET.com writer Declan McCullagh published an article about Serin's story and the largely negative reactions Serin's blog was garnering from commenters, referring to Serin as \"the world's most hated blogger\" and describing his blog as \"irritainment.\" McCullagh wrote that \"Casey's blog has an enthusiastic – if unrelentingly critical – audience known as 'haterz'.\" Serin acknowledged that he began to purposely anger readers in an effort to drive further traffic to the blog. Over time, the blog developed a cult status, as Serin began writing about the toll his actions were taking on his personal life. The spectre of legal ramifications also factored heavily into the blog. Many commenters stated that they were attracted to the increasingly \"soap opera\"-like nature of Serin's story, and the blog was featured on a number of sites devoted to so-called \"trainwreck watching.\"\n\nFate of the blog\n\nIn April 2007, Serin appeared on The Suze Orman Show to discuss his financial predicament. Orman recommended that Serin file for bankruptcy and attempt to increase his take-home pay. However, Serin continued to make no effort to secure full-time employment, nor did he file bankruptcy; a bankruptcy attorney had told Serin that he would open himself to potential charges of mortgage fraud if he filed for bankruptcy, since the debts were acquired under fraudulent pretenses.\n\nThe final months of his blog saw further erratic behavior by Serin, including a June 2007 spur-of-the-moment flight to Australia without informing his wife or family members. Regarding his multiple mortgages, Serin acknowledged to the Sydney Morning Herald that \"the stuff I did is technically mortgage fraud, but it's not officially called that until someone prosecutes me and proves that that is indeed mortgage fraud,\" asserting a presumption of innocence. While in Australia, Casey Serin appeared on Top Shelf Radio with Robbie Buck. On the Jon Ronson show, Serin again confirmed his use of so-called \"liar loans\".\n\nOn July 11, 2007, Serin disclosed that he was under investigation by the FBI. In an interview conducted by ABC News, his attorney reported that Casey Serin was under investigation by the FBI, but that \"no charges have been brought against Mr. Serin. However, based upon conversations with the U.S. Attorney's office in California, federal charges related to Mr. Serin's real estate transactions are expected to be brought against him\". Shortly thereafter, Serin said in a mass e-mailing that he would be closing the blog and getting a \"regular W-2 job,\" citing the stress his family has experienced.\n\nSerin's final blog entry on July 28, 2007 was dedicated to his wife. Aaron Krowne, an Emory University library researcher and owner of ml-implode.com, purchased the blog. Serin says he used proceeds from the sale to pay off $35,000 of consumer credit debt in his wife's name.\n\nAlthough Serin retained an attorney in July 2007 and stated that he was under investigation by the FBI, Serin has never been officially charged with any crime.\n\nLegal change of name\n\nIn 2016, Serin legally changed his name to Casey Constantine. In Facebook comments, he stated that the name change is a sort of rebranding for the next chapter of his career/business in real estate, and that it will allow him much more control over his search results online, somewhat of a clean slate."}], "The blog of Casey Serin reported on Casey Serin's financial struggles.": [{"url": "https://www.cnet.com/culture/hated-blogger-leaves-u-s-threatens-lawsuits/", "page_content": "Casey Serin, arguably the world's most-hated blogger, rocketed to Internet stardom after disclosing his pending foreclosures, marital strife and unwillingness to find a job. But the 24-year-old's online fame was hardly flattering: it arose from legions of readers who call themselves \"haterz\" and frequent his iamfacingforeclosure.com blog to ridicule his financial missteps and urge Serin to pay back up to $420,000 he is said to owe creditors.\n\nThe latest kerfuffle arose last week after Serin blogged about a contract with a mysterious \"independent publisher\" for self-help material about how to deal with foreclosure. To the so-called haterz, this represented an enticing challenge, which they met by outing the publisher as self-styled Internet marketer Marty Stewart and even unearthing a confidential business plan for iamfacingforeclosure.com and related audio files that Stewart left on a Web site that was not password-protected. The files have since been mirrored elsewhere.\n\n--Casey Serin,\n\nblogger \"We've been letting everything go for so long, people think they can just do this without any penalties.\"\n\nNow Serin and Stewart are crying foul. We're going to \"aggressively be pursuing any Web site that has our private content posted on it,\" Stewart said in a telephone interview with CNET News.com on Tuesday. \"Obviously it's copyrighted content and it's being smeared all over.\"\n\n\"We've been letting everything go for so long, people think they can just do this without any penalties,\" Serin added.\n\nSerin handed the haterz even more ammunition this week by disclosing that he had left his wife, Galina , behind in West Sacramento, Calif., with only about $300 in the bank and had set up operations in an undisclosed location in Australia. Because Serin has refused to get a full-time job--preferring instead to chase dreams of instant wealth through real estate deals--Galina lives with her sister and cleans houses to pay for food and rent.\n\nThis interlude highlights the difficult task that Serin has faced in trying to profit from iamfacingforeclosure.com's popularity. Some of his readers are resolute in offering advice to someone they view as a misguided but promising young entrepreneur. Others are devout Christians who urge him to follow the Bible more closely.\n\nBut the so-called haterz have become the most vocal. The HousingPanic blog calls Serin \"the physical representation of fraud, greed, debt, fear, bubbles and human folly.\" Others, including some inside the U.S. Department of Justice, have been prodding federal and state prosecutors to indict Serin for mortgage fraud. A more recent suggestion is to take up a collection for a Galina Divorce Fund that would cover \"legal fees, basic living expenses, psychological therapy.\"\n\nListen up Serin issues threats\n\nBlogger says he has left his wife, the U.S., and is threatening legal action.\n\n\n\nDownload mp3 (19.3MB)\n\nAlong the way, Serin's notoriety led to appearances on Suze Orman's and Robert Kiyosaki's financial-advice shows, and the creation of an entire encyclopedia, Caseypedia.com, with hundreds of entries mocking his exploits. A Casey Serin Dance Remix appeared, as have photo galleries depicting him as, alternatively, Gilligan from Gilligan's Island and McDonald's Hamburglar character. Casey's Web site has even become a case study in a presentation submitted for the Defcon hacker convention discussing click fraud, and he's been called a \"national obsession.\"\n\nA recent tactic of the haterz has been to repost Serin's blog entries on sites like Blogspot-hosted \"exurbanation\"--arguably in violation of copyright law--in hopes of depriving him of advertising page views. \"It's not right for them to continue ripping my posts and putting it in their comments and encouraging people to read it there,\" Serin said. He has threatened to file a Digital Millennium Copyright Act complaint with Google, which owns Blogspot, to try to force the deletion of his material.\n\nA \"heartbroken\" wife left behind\n\nOne wildcard in the Casey Serin saga, which has played out on the Internet since iamfacingforeclosure.com launched last September, is whether Galina will leave her husband, who ran up $2.2 million in debt and lost five houses to foreclosure.\n\nIn a conversation at her sister's townhouse in early May, where the young couple rented two rooms, Galina said that she was becoming frustrated with her husband's spending and had met with her Baptist pastor that afternoon for counseling. But according to her strict religious views, Galina said, \"there are only two reasons for a divorce: adultery and physical abuse.\"\n\nNot helping matters is that some of Serin's former business partners have turned against him. In a series of posts to a haterz blog, onetime partner Duane LeGate recently lambasted Serin and said his wife was heartbroken: \"He left Galina with 300 dollars in the checking account to pay bills. He is not planning on supporting her.\" In return, Serin calls LeGate a \"hypocrite\" and \"back-stabber.\"\n\nFor his part, Serin said he had to escape West Sacramento because his wife and family had been pressuring him to pull the plug on his blog, which he did briefly last month (his brother Steve has publicly berated him for irresponsibility). \"I didn't even know I was going until the night before, so I myself didn't have a lot of notice,\" Serin said. \"There was so much drama going on around this blog.\"\n\nA CNET News.com reader appears to have footed the bill for the Australia trip. In an e-mail message on June 2, that reader offered to pay $1,000 to keep the blog going--and apparently followed through. Serin wrote in follow-up message four days later: \"That guy WAS for real. A true supporter. Crazy things happen when you're blogging.\"\n\nSpeculation has turned to where Serin is hiding out and whether he's on the run from the law. Serin refuses to disclose where he is except to say he's somewhere in eastern Australia and is living for the next few months with some fans who offered to let him stay with them for free.\n\nOne reader, who asked to be identified only by his first name, Nathaniel, suggested: \"Serin is attempting to force his wife to divorce him. He wants the perceived moral superiority of being able to tell others that she was the one who wanted it, not him. He denies leaving her with no money, but then admits that automatic payments drained their bank account shortly after he left the country.\"\n\nSome wags have suggested that Galina auction off her absent husband's belongings. A Casey-haterz conference call was held Monday night, with one supposedly expected to be more supportive scheduled for Friday.\n\nAmateur detectives have unearthed an Internet Protocol address they say might be Serin's. The address would put his location in the Sydney suburb of Northmead in New South Wales. Others have urged readers to \"please contact the AFP immediately,\" meaning the Australian Federal Police.\n\n(One common charge is that, by lying on mortgage applications, Serin violated state and federal fraud laws. Serin uses the term \"my mortgage fraud.\" He also admits: \"I overstated my income, misrepresented owner occupancy intent and concealed the cash-back from the lenders.\")\n\nNow that he's left West Sacramento, Serin says he can devote more energy to trying to make some money off his blog. The concept has shown some promise: he was able to earn $2,256 of advertising revenue in one week, but then was forced to return most of it after temporarily shutting down iamfacingforeclosure.com.\n\nStewart, the new business partner, claims to be an experienced Internet marketer whose PageDaddy.com site promises to help \"frustrated and struggling Web site owners drive massive amounts of targeted traffic to their Web pages.\" (During an interview, however, he was not able to offer any client references or even divulge the number of people that PageDaddy.com employed.)\n\nHe blames the haterz for obsessing over Serin's travails. \"It just amazes me that these people waste\" so much time, he said. Stewart also threatened to \"aggressively\" seek to find out which haterz are behind reposting the confidential business plan and audio recordings that were left on a public Web site.\n\nStewart's brainchild was an independently published book titled The Foreclosure Code, with cover graphics reminiscent of Dan Brown's best-selling The Da Vinci Code. But now he's found that his photograph, cell phone number and marketing plans have been immortalized on sites like Caseypedia.com. Thanks to the haterz, that information has been \"blasted and smeared all over the Internet. To be frank, I'm very pissed,\" Stewart said."}, {"url": "https://www.zdnet.com/article/notorious-debtor-casey-serin-shuts-down-blog/", "page_content": "Casey Serin, the 24-year-old would-be real estate mogul who was reduced to sharing a diminutive West Sacramento, Calif., townhouse with his sister-in-law, announced on Thursday that iamfacingforeclosure.com is dead and \"will never return.\"\n\nSince the blog's launch in September, Serin's regular posts about his refusal to get a job or pay off up to $420,000 that he owes creditors have garnered him an enthusiastic--if unrelentingly critical--audience known as \"haterz.\"\n\nAlong the way, Serin's notoriety led to appearances on Suze Orman's and Robert Kiyosaki's advice shows, and the creation of an encyclopedia, Caseypedia.com, with hundreds of entries mocking his exploits. A Casey Serin Dance Remix appeared, as have photo galleries depicting him as Gilligan from Gilligan's Island and McDonald's Hamburglar character.\n\nSerin did not respond to e-mail messages or voice mail on Thursday and Friday asking why his blog was replaced with a brief farewell message, which didn't say what prompted the deletion.\n\nThat didn't stop the so-called haterz from speculating. One oft-proferred explanation centered on a contract that Serin signed on May 17 with his wife, Galina. It specifies that the iamfacingforeclosure.com site must be shuttered \"permanently never to be reopened again\" if Serin did not generate $1,000 in income a week or if he discussed his marital problems publicly--an arrangement that one site said was violated.\n\nIn an earlier conversation with CNET News.com, Galina Serin said she was becoming frustrated with her husband's credit-based spending and had met with her pastor recently for relationship counseling. Of eight homes that her husband hoped to resell at a profit, he lost all of them, most to foreclosure.\n\nEarlier, Serin had talked favorably about being homeless and living in a car and said his wife was holding him back. After signing the contract, he generally refrained from discussing family members, though his brother Steve did berate him publicly for his antics and not supporting his wife.\n\nAnti-Serin sites expressed dismay at the apparent end of iamfacingforeclosure.com, comparing Serin-watching to a form of drug addiction. Some unhappy haterz even held a lengthy conference call on Thursday evening, with one caller suggesting that it should turn into a weekly ritual."}, {"url": "https://www.zdnet.com/article/hated-blogger-leaves-u-s-threatens-lawsuits/", "page_content": "Casey Serin, arguably the world's most-hated blogger, rocketed to Internet stardom after disclosing his pending foreclosures, marital strife and unwillingness to find a job. But the 24-year-old's online fame was hardly flattering: it arose from legions of readers who call themselves \"haterz\" and frequent his iamfacingforeclosure.com blog to ridicule his financial missteps and urge Serin to pay back up to $420,000 he is said to owe creditors.\n\nThe latest kerfuffle arose last week after Serin blogged about a contract with a mysterious \"independent publisher\" for self-help material about how to deal with foreclosure. To the so-called haterz, this represented an enticing challenge, which they met by outing the publisher as self-styled Internet marketer Marty Stewart and even unearthing a confidential business plan for iamfacingforeclosure.com and related audio files that Stewart left on a Web site that was not password-protected. The files have since been mirrored elsewhere.\n\n--Casey Serin,\n\nblogger \"We've been letting everything go for so long, people think they can just do this without any penalties.\"\n\nNow Serin and Stewart are crying foul. We're going to \"aggressively be pursuing any Web site that has our private content posted on it,\" Stewart said in a telephone interview with CNET News.com on Tuesday. \"Obviously it's copyrighted content and it's being smeared all over.\"\n\n\"We've been letting everything go for so long, people think they can just do this without any penalties,\" Serin added.\n\nSerin handed the haterz even more ammunition this week by disclosing that he had left his wife, Galina, behind in West Sacramento, Calif., with only about $300 in the bank and had set up operations in an undisclosed location in Australia. Because Serin has refused to get a full-time job--preferring instead to chase dreams of instant wealth through real estate deals--Galina lives with her sister and cleans houses to pay for food and rent.\n\nThis interlude highlights the difficult task that Serin has faced in trying to profit from iamfacingforeclosure.com's popularity. Some of his readers are resolute in offering advice to someone they view as a misguided but promising young entrepreneur. Others are devout Christians who urge him to follow the Bible more closely.\n\nBut the so-called haterz have become the most vocal. The HousingPanic blog calls Serin \"the physical representation of fraud, greed, debt, fear, bubbles and human folly.\" Others, including some inside the U.S. Department of Justice, have been prodding federal and state prosecutors to indict Serin for mortgage fraud. A more recent suggestion is to take up a collection for a Galina Divorce Fund that would cover \"legal fees, basic living expenses, psychological therapy.\"\n\nListen up Serin issues threats\n\nBlogger says he has left his wife, the U.S., and is threatening legal action.\n\n\n\nDownload mp3 (19.3MB)\n\nAlong the way, Serin's notoriety led to appearances on Suze Orman's and Robert Kiyosaki's financial-advice shows, and the creation of an entire encyclopedia, Caseypedia.com, with hundreds of entries mocking his exploits. A Casey Serin Dance Remix appeared, as have photo galleries depicting him as, alternatively, Gilligan from Gilligan's Island and McDonald's Hamburglar character. Casey's Web site has even become a case study in a presentation submitted for the Defcon hacker convention discussing click fraud, and he's been called a \"national obsession.\"\n\nA recent tactic of the haterz has been to repost Serin's blog entries on sites like Blogspot-hosted \"exurbanation\"--arguably in violation of copyright law--in hopes of depriving him of advertising page views. \"It's not right for them to continue ripping my posts and putting it in their comments and encouraging people to read it there,\" Serin said. He has threatened to file a Digital Millennium Copyright Act complaint with Google, which owns Blogspot, to try to force the deletion of his material.\n\nA \"heartbroken\" wife left behind\n\nOne wildcard in the Casey Serin saga, which has played out on the Internet since iamfacingforeclosure.com launched last September, is whether Galina will leave her husband, who ran up $2.2 million in debt and lost five houses to foreclosure.\n\nIn a conversation at her sister's townhouse in early May, where the young couple rented two rooms, Galina said that she was becoming frustrated with her husband's spending and had met with her Baptist pastor that afternoon for counseling. But according to her strict religious views, Galina said, \"there are only two reasons for a divorce: adultery and physical abuse.\"\n\nNot helping matters is that some of Serin's former business partners have turned against him. In a series of posts to a haterz blog, onetime partner Duane LeGate recently lambasted Serin and said his wife was heartbroken: \"He left Galina with 300 dollars in the checking account to pay bills. He is not planning on supporting her.\" In return, Serin calls LeGate a \"hypocrite\" and \"back-stabber.\"\n\nFor his part, Serin said he had to escape West Sacramento because his wife and family had been pressuring him to pull the plug on his blog, which he did briefly last month (his brother Steve has publicly berated him for irresponsibility). \"I didn't even know I was going until the night before, so I myself didn't have a lot of notice,\" Serin said. \"There was so much drama going on around this blog.\"\n\nA CNET News.com reader appears to have footed the bill for the Australia trip. In an e-mail message on June 2, that reader offered to pay $1,000 to keep the blog going--and apparently followed through. Serin wrote in follow-up message four days later: \"That guy WAS for real. A true supporter. Crazy things happen when you're blogging.\"\n\nSpeculation has turned to where Serin is hiding out and whether he's on the run from the law. Serin refuses to disclose where he is except to say he's somewhere in eastern Australia and is living for the next few months with some fans who offered to let him stay with them for free.\n\nOne reader, who asked to be identified only by his first name, Nathaniel, suggested: \"Serin is attempting to force his wife to divorce him. He wants the perceived moral superiority of being able to tell others that she was the one who wanted it, not him. He denies leaving her with no money, but then admits that automatic payments drained their bank account shortly after he left the country.\"\n\nSome wags have suggested that Galina auction off her absent husband's belongings. A Casey-haterz conference call was held Monday night, with one supposedly expected to be more supportive scheduled for Friday.\n\nAmateur detectives have unearthed an Internet Protocol address they say might be Serin's. The address would put his location in the Sydney suburb of Northmead in New South Wales. Others have urged readers to \"please contact the AFP immediately,\" meaning the Australian Federal Police.\n\n(One common charge is that, by lying on mortgage applications, Serin violated state and federal fraud laws. Serin uses the term \"my mortgage fraud.\" He also admits: \"I overstated my income, misrepresented owner occupancy intent and concealed the cash-back from the lenders.\")\n\nNow that he's left West Sacramento, Serin says he can devote more energy to trying to make some money off his blog. The concept has shown some promise: he was able to earn $2,256 of advertising revenue in one week, but then was forced to return most of it after temporarily shutting down iamfacingforeclosure.com.\n\nStewart, the new business partner, claims to be an experienced Internet marketer whose PageDaddy.com site promises to help \"frustrated and struggling Web site owners drive massive amounts of targeted traffic to their Web pages.\" (During an interview, however, he was not able to offer any client references or even divulge the number of people that PageDaddy.com employed.)\n\nHe blames the haterz for obsessing over Serin's travails. \"It just amazes me that these people waste\" so much time, he said. Stewart also threatened to \"aggressively\" seek to find out which haterz are behind reposting the confidential business plan and audio recordings that were left on a public Web site.\n\nStewart's brainchild was an independently published book titled The Foreclosure Code, with cover graphics reminiscent of Dan Brown's best-selling The Da Vinci Code. But now he's found that his photograph, cell phone number and marketing plans have been immortalized on sites like Caseypedia.com. Thanks to the haterz, that information has been \"blasted and smeared all over the Internet. To be frank, I'm very pissed,\" Stewart said."}, {"url": "https://www.cnet.com/culture/notorious-debtor-casey-serin-shuts-down-blog/", "page_content": "Casey Serin, the 24-year-old would-be real estate mogul who was reduced to sharing a diminutive West Sacramento, Calif., townhouse with his sister-in-law, announced on Thursday that iamfacingforeclosure.com is dead and \"will never return.\"\n\nSince the blog's launch in September, Serin's regular posts about his refusal to get a job or pay off up to $420,000 that he owes creditors have garnered him an enthusiastic--if unrelentingly critical--audience known as \"haterz.\"\n\nAlong the way, Serin's notoriety\n\nGilligan's Island\n\nled to appearances on Suze Orman's and Robert Kiyosaki's advice shows, and the creation of an encyclopedia, Caseypedia.com , with hundreds of entries mocking his exploits. A Casey Serin Dance Remix appeared, as have photo galleries depicting him as Gilligan fromand McDonald's Hamburglar character.\n\nSerin did not respond to e-mail messages or voice mail on Thursday and Friday asking why his blog was replaced with a brief farewell message, which didn't say what prompted the deletion.\n\nThat didn't stop the so-called haterz from speculating. One oft-proferred explanation centered on a contract that Serin signed on May 17 with his wife, Galina. It specifies that the iamfacingforeclosure.com site must be shuttered \"permanently never to be reopened again\" if Serin did not generate $1,000 in income a week or if he discussed his marital problems publicly--an arrangement that one site said was violated.\n\nIn an earlier conversation with CNET News.com, Galina Serin said she was becoming frustrated with her husband's credit-based spending and had met with her pastor recently for relationship counseling. Of eight homes that her husband hoped to resell at a profit, he lost all of them, most to foreclosure.\n\nEarlier, Serin had talked favorably about being homeless and living in a car and said his wife was holding him back. After signing the contract, he generally refrained from discussing family members, though his brother Steve did berate him publicly for his antics and not supporting his wife.\n\nAnti-Serin sites expressed dismay at the apparent end of iamfacingforeclosure.com, comparing Serin-watching to a form of drug addiction. Some unhappy haterz even held a lengthy conference call on Thursday evening, with one caller suggesting that it should turn into a weekly ritual."}, {"url": "https://www.zdnet.com/article/casey-serin-the-worlds-most-hated-blogger/", "page_content": "With scant income, assets, or business savvy, the would-be real-estate mogul managed to purchase eight homes in hopes of reselling them at a profit. Along the way, he's lost all of them, run up some $170,000 in credit card and credit line debt, and launched iamfacingforeclosure.com to share his woes with the world. (Editor's note: Serin's site was intermittently reachable Monday.)\n\nFinancial exhibitionism, coupled with a lack of penitence for stiffing his creditors, has transformed the 24-year-old resident of this sleepy Sacramento suburb into a celebrity among fellow bloggers. But unlike other online celebrities, Serin's stardom comes from a unique source: \"haters\" who patronize his blog solely to learn what financial missteps he's made today.\n\n\"A community formed overnight,\" Serin said in an interview. \"It wasn't a very positive community.\"\n\nSince launching his Web site last September, Serin has discovered that it can be profitable to outrage and annoy the thousands of people who visit his blog every day. He estimates he was making up to $1,000 a month through Google ads and believes he's on track to make even more through Yahoo's ad network. His notoriety has led to appearances on Suze Orman's and Robert Kiyosaki's advice shows, and he says he's working on a book and advice packet that he'll sell online.\n\nThrough planning or dumb luck, Serin has managed to capture an audience by severely irritating many disparate groups: those who blame him and fellow speculators for the housing bubble; devout Christians, who urge him to follow the Bible more closely; and others who are hoping for news that his creditors are suing him and that his petite, attractive wife Galina is divorcing him.\n\nSerin makes it all public, including financial spreadsheets and bank statements, frank admissions that he lied on mortgage applications, and, more recently, his marital strife with Galina. Because her husband has refused to get a job since January 2006, the couple has been forced to move in with relatives and Galina cleans houses to pay for their food and rent.\n\nAs a result, the tell-all blog entries have drawn the same kind of highly attentive crowd that might assemble to watch a train wreck in progress. \"I guess I'm an open, kind of exhibitionist personality,\" Serin said.\n\nHis legions of critics use less flattering terms. The HousingPanic blog calls Serin \"the physical representation of fraud, greed, debt, fear, bubbles and human folly.\" Another says Serin is \"slothful, arrogant, unable to plan, unable to make decisions, easily overwhelmed.\"\n\nHating Serin has become something of a sport among bloggers, who compete with each other to post the most biting critiques of his financial missteps. No fewer than four Serin-hating sites have cropped up, and many others poke fun at how he paid tens of thousands of dollars for real-estate investing courses, ran up $2.2 million in debt by buying houses on credit, and then lost most of them to foreclosure (others were sold at a loss, and Serin estimates he owes an additional $100,000 to $250,000 to the banks to cover those losses).\n\nThere's even the sine qua non of a Net-celeb: a Casey Serin Dance Remix mocking his favorite sayings. Doctored photo galleries include images depicting Serin as, alternatively, Gilligan from Gilligan's Island, and McDonald's Hamburglar character. He's already been called a \"national obsession.\"\n\n\"Everyone has an opinion and anyone can speculate,\" said Rob Dawg, who runs a popular anti-Serin Web site called Exurbannation. \"Is he mentally ill? Mentally feeble? Do his bizarre personal habits affect his judgement or vice versa?\" Dawg wrote in e-mail on Friday. \"On and on. For many of us, however, Casey has become the eye of the storm, not the storm itself.\"\n\nSerin has not filed for bankruptcy, though he has publicly mulled the option. For now, he believes himself to be effectively judgment-proof, with his only significant asset being a run-down Volkswagen Jetta that recently was broken into.\n\nReaders who love to hate\n\nThe tension between Serin and his so-called haters has led to an unlikely situation: the very people who loathe him the most also rely on him for a daily source of entertainment.\n\nThe concept is sometimes called \"irritainment,\" defined as: \"Entertainment and media spectacles that are both annoying and compulsively watchable.\" (The O.J. Simpson trial in 1995 is the most famous example. Perez Hilton's blog may be another.)\n\nRelated audio\n\nPodcast: A blogger with a whole lot of 'haterz' CNET News.com's Erica Ogg talks to reporter Declan McCullagh about why Serin is so disliked.\n\nAgainst their better judgment, some haters have become financial supporters. In March, when Serin was facing a collection agency called CashCall, known for hardball tactics, Serin held a \"beg-a-thon\" trying to raise $220.48 by the next day.\n\nIt worked. Readers paid money to get him to answer personal questions, such as explaining why his wife dropped out of college. Someone even paid Serin $250 for the opportunity to rant to him for an hour about financial responsibility.\n\n\"I was amazed that the so-called haters were willing to spend money on me,\" Serin said. \"It shows that they're not really haters. They're in it for the entertainment.\"\n\nSome are. But others are honestly upset and view Serin as an exemplar of the worst of the housing bubble. Speculators who lied on loans, critics say, raised the cost of housing for honest buyers who needed a place to live, and foreclosures tend to reduce property values of nearby homes.\n\nOne common charge is that by lying on mortgage applications, Serin violated state and federal fraud laws. Serin uses the term \"my mortgage fraud.\" He also admits: \"I overstated my income, misrepresented owner occupancy intent and concealed the cash-back from the lenders.\"\n\nThat frank admission has led to calls to \"Send Casey Serin To Prison\"--a petition to the FBI has appeared--as well as a similar call targeting his wife.\n\n\"Casey and Galina Serin's story isn't one of 'Young couple tries to make it in the cold, cruel world,'\" one critic wrote. \"These two are f****g Bonnie and Clyde. What they're doing is bank robbery, without the gun.\"\n\nStephen Kodak, an FBI spokesman in Washington, said he could not comment on any individual case. \"Yes, it is a crime,\" he said. \"It's a crime to misrepresent your salary. It's a crime to misrepresent whether or not you're going to live in the house.\"\n\nIn March, the FBI announced a crackdown on mortgage scammers and said it has more than 1,000 current investigations. But Kodak said the FBI tends to focus on financial insiders and not people who lie on loans: \"We go after, normally, the fraud for profit, because even though it doesn't make up the majority of the numbers out there, it certainly makes up the largest financial losses.\"\n\nMarital drama, debt addiction\n\nOne wildcard in the Casey Serin saga is his wife, Galina, who met him through church social groups and married him when she was 20 years old. Both are Baptists and Slavic immigrants (Galina immigrated to the U.S. in 1990, and her husband in 1994) and are part of Sacramento's growing Russian-speaking population.\n\nIn a conversation at her sister's townhouse Thursday, where the young couple rents two rooms for about $600 a month, Galina said she was becoming frustrated with her husband's spending and had met with her pastor that afternoon for counseling. But according to her own religious views, Galina said, \"there are only two reasons for a divorce: adultery and physical abuse.\"\n\nRunning up $170,000 in unsecured debt, in other words, does not qualify--nor does lying about his plans regarding a recent vacation in Lake Tahoe, Calif., nor buying a $600 video camera on credit to document life experiences for his blog.\n\nFor his part, Serin confirms that his wife hates his blog. \"Many times she's like: I want you to shut it down and go quietly into the night,\" he said.\n\nThe so-called haters have similar sore points, including that Serin refuses to get a job and instead pays for living expenses by simply borrowing more money. He defends himself by insisting that he's making far more valuable connections through his blog.\n\nOne example he gave is that he learned, through his blog, of a $1.5 billion Las Vegas casino for sale. If he can find a buyer, Serin says, he'd get a 1 percent commission ($15 million) for his trouble. \"Doesn't that make more sense than a W-2 job?\" he said.\n\nSerin also recently paid $16,000 to Arizona's Nouveau Riche University, a kind of real-estate seminar company that includes classes with names like Fix & Flip and Creative Financing. Its marketing literature says that Nouveau Riche \"hand delivers properties on a silver platter.\"\n\nNouveau Riche, which is not accredited by the North Central Association of Colleges and Schools (the regional group recognized by the U.S. Department of Education), claims not to be a multilevel marketing scheme. It has some elements of one, however. Serin said he has found two people to pay $18,000 to Nouveau Riche, and if he finds any more, he'll get a $9,000 commission for each one, as well as additional commissions if the people he recruited then sign up additional customers.\n\nIn an e-mail message over the weekend, Serin added: \"The 16K gives me two years of quality (real estate investment) education--gives you college credits--access to cash-flow properties around the nation, local community of investors, etc.\"\n\nNot all these details have appeared on his blog yet, but Serin seems to enjoy spacing them out in a way that will vex his readers the most. \"What happens is I feed off of it,\" he said. \"I know the buttons to press to get those guys going. After awhile, you learn what topics you can mention if you want to get extra comments on your post.\"\n\nSerin already does that by stressing his penchant for afternoon naps that take place precisely when his readers are reading his blog in their cubicles and silently fuming. He claims to have bought more than $4,000 in penny stocks last month, which have since slid in value. And he delights in posting about his excursions to a nearby Jamba Juice, which became notorious when he bought a $4.90 drink there with an ATM card but was charged an extra $33 overdraft fee because his bank account was empty.\n\nDuring a visit to the same Jamba Juice on Thursday, Serin asked the cashier whether any jobs were available. But, thinking of how much time he spends every day working on his blog, he added: \"Can I keep my laptop back there while I'm at work?\"\n\nHe left without taking an application.\n\nCNET News.com's Anne Broache contributed to this report"}, {"url": "http://www.thedigeratilife.com/blog/index.php/2007/03/04/5-things-i-learned-from-casey-serin-the-guy-behind-i-am-facing-foreclosure/", "page_content": "5 Things I Learned From Casey Serin, Doomed Real Estate Blogger\n\nPersonal finance bloggers far and wide have done many an article on analyzing and reviewing financial gurus, including Dave Ramsey, Jim Cramer and Robert Kiyosaki.\n\nBut over here, I’ve decided to do something a bit different. How about let’s deconstruct someone who isn’t a financial guru, but someone who’s in fact a walking case study of real life financial lessons…maybe someone who even shares the blogosphere with us. In other words, I’ve decided to deconstruct a regular joe named Casey Serin.\n\nHave you ever heard of this guy? Chances are, you already have. He’s the fellow who’s set up a blog about his financial misjudgements (or misbehaviors) and in the process, gained quite a lot of media attention, became some kind of a semi-famous (or infamous) internet celebrity and a poster child for how NOT to be a business real estate tycoon. In fact, he’s been dubbed as “the pied piper of financial ruin”.\n\nHere are his own words about himself:\n\nI’m a 24 yr old “would-be real estate mogul” from Sacramento CA. After going to a few seminars I bought 8 houses in 8 months in 4 states with no money down looking to fix ‘n flip. I made some mistakes and am now millions in debt, trying to avoid foreclosure, sell quickly, repay everyone, and share my lessons to help others in trouble.\n\nBefore anything else though, I’d like to make clear that I don’t know the guy personally and have had no direct dealings with him except for the typical blogger email exchange. This is clearly not an endorsement of Casey: for the record, I have never, could never and probably will never follow the path of Trump nor Kiyosaki nor any one else following their footsteps. This is not a defense of Casey, nor is this a crucifixion. I prefer not to take sides because if all I had to provide was negative commentary, then I wouldn’t bother writing this post. Anyway, there’s ample evidence of character assassination over at his blog already.\n\nBut one of the things that has interested me about him, is the fact that he’s based in Sacramento, not very far from the San Francisco Bay Area, and where several people I know including family, friends and co-workers are either residents or have made real estate investments of their own. This guy is young, just starting out his life, is facing a financial nightmare and blogs like a dream, while I’m an avid student of psychology. This begged a closer look.\n\nThe Drama Of Foreclosure\n\nIn the personal finance blogging community, we’re not quite sure what to make of Casey. Some people frown upon his track record and think he’s an irresponsible troll. Some think he’s someone more innocuous, like a rags to almost-riches to rags story that’s just waiting to turn the corner into a financial fairy tale ending. He’s a polarizing, controversial blogger, gaining fans and even more haters out there.\n\nThere’s no doubt that many people are quite angry and eager to see him pay for the “entrepreneurial and financial sins” that he’s committed. Some people weren’t shy about calling out these transgressions as mortgage fraud. Was he playing the system and got busted, or was he just a sad, foolish victim of greed? Was he just a sorry casualty of the real estate bubble? That’s up to the proper authorities to look into as I prefer to focus on more positive take-aways.\n\nI sort of think of him as some kind of tragic star in his own soap opera and have been following this drama on and off for the last few months through his blog, I Am Facing Foreclosure. Earlier in my blogging endeavors, I shared my views of the man, not realizing how unpredictable he could get. Then I entered a phase of pure disbelief as he burned one bridge after another. I even doubted he could be legitimate, given the outrageous, even ridiculous highs and lows of his recent life, especially since many of these mishaps were set in motion by his own hand.\n\nBut yes, Casey Serin is indeed not another lonelygirl15 but actually a genuine person who’s been trying to crawl out of the fiscal quagmire he’s dug himself worth all of $2.2 million, and whose monetary tales of woe have attracted the mainstream media, well-known bloggers and even the controversial Robert Kiyosaki himself to write chapters in this unfolding tale and thus vouch for the authenticity of his person.\n\nSince then, the cringe-worthy behaviors he’s exhibited have continued unabated that I felt it merited a second look from me. His actions continue to rile, frustrate and annoy the multitude, yet as his troubles mount, his popularity has increased.\n\nSo what financial escapades has he been up to lately? Here’s a sampling of his recent activities:\n\nHe’s cashed out a redemption check and decided to buy Valentine’s day gifts and Jamba Juice with it.\n\nHe considered doing a house raffle to unload a house and take $1,500 for his redemption rights if he undergoes a foreclosure auction.\n\nHe discussed his personality to explain his behaviors: for the record, he’s a Rational Inventor, Artisan Promoter.\n\nHe tried vainly to negotiate deals with real estate mentors but ultimately had what seemed to be a bitter falling out with the people involved.\n\nHe’s attempted to set financial goals, struggled with priorities, and displayed a liabilities spreadsheet that would give you a heart attack if you owned it.\n\nHe’s thought about borrowing even more money — $50,000 to fight fire with even more fire — to avoid foreclosure. Is this denial, insanity, foolishness or bravado?\n\nAnd lastly, he’s even admitted lying on his loans in order to secure his properties. Who knows where this will take him? We’ll have to see if it’s going to be to a cold, dark place the size of a walk-in closet.\n\nBut instead of joining his lynch mob, passing judgement, or beating a dead horse about the latest jam he’s gotten himself into — wait, are we that hungry for a post Truman Show fix? — I’ve decided to do two things to catch up with Mr. Serin.\n\nFirst, I’d like to look into what Casey brings to the table, the positive being that he’d like to share his mistakes for us to learn something from them. So that’s what I’ll be focusing on. I’m from a totally different generation than he is, yet he’s managed to teach me a few things.\n\n5 Things I’ve Learned From the “I Am Facing Foreclosure” Story\n\n#1 Let’s learn from some serious fiscal and personal mistakes.\n\nYes, it is clear Casey wants to use his blog to network, gain visibility and perhaps opportunities he would otherwise not come across. But he also wants to caution us how not to conduct ourselves financially. Beyond owning up to his missteps, he’s even gone as far as face a college class to talk about his problems. He’s also managed to really peeve off potential business partners, bruising his track record further in the process. Still, somewhere in the chaos, I’ve learned a lot of new things just by reading his blog — not just about the world of mortgages and real estate, but most especially about human nature.\n\n#2 Why not capitalize on one’s strengths?\n\nThe guy insists on staying with real estate, buying into the “Do What You Love, Everything Else Will Follow” philosophy. He’s stubborn about staying with what he’s passionate about, despite his egregious problems. His strengths? They’re probably in negotiation, promotion, marketing and even writing. If anything is working for him, it’s his blog as well as some promotional attempts that have landed him in the spotlight. Maybe they’ll eventually translate into some networking opportunities, because although Casey looks like a tremendous risk, he displays some talents he can try to parlay into something more productive. Unless of course, his efforts get interrupted by potential legal matters. Will his fortunes run out before he gets a chance to snag that “big deal”?\n\n#3 This confirms my motto: keep it sweet and simple.\n\nI’ll be honest…many of the things Casey mentions in his blog are quite a bit over my head. There’s a good reason for it though, and that’s because when I come across a money-making scheme that is confusing or complicated, I usually steer away from it since it usually turns out negative for my pocket book. Making money and keeping it don’t have to be too complicated. You CAN earn a fortune more easily than this!\n\n#4 Smile in the face of adversity and try, try again.\n\nAs I said earlier, I try to emphasize the positives: the guy is tough, ambitious, can laugh at himself and has a strong spirit. He’s got a genuinely thick hide to be able to take criticism like he’s been doing. How many people can continuously swallow their pride the way this guy does? I have rarely seen anyone who can hold himself together like this in the face of such pressure, negativity and in my opinion, sheer embarrassment. The guy may be one stubborn flake, but he’s a tough cookie. I wish I had just half of his fortitude. However, like most others who’ve imagined being in his shoes, I would’ve cut my losses very early on if I had been in his situation.\n\n#5 Shunning mediocrity can lead to big successes and equally huge failures.\n\nWhat do I mean? I doubt this guy will ever lead his life in a boring fashion. There’ll always be something up his sleeve, whether it means to run himself to the ground, rise to great heights or even go out with a bang. And these qualities could spell his success one day, if he’s ever able to escape from the serious controversy surrounding him. Many big names have met with many massive failures before they went anywhere. The question is, whether he can first get out of the deep hole he’s already in.\n\nSay What? Dedicate An Entire Week To This Fallen Entrepreneur?\n\nSecond, I’d like to use the following week to bring up subjects that have touched many of us to some degree, but which all have had a bearing on this young man’s life. So in the next few days, I plan to present articles that represent information that is simply relevant in some way, to Casey’s background and current experiences. These were posts I was going to make anyway, but had reverberated well into this guy’s life. So to tie it all into one neat package, this following week will be Casey Serin theme week at The Digerati Life. In time, it will be apparent why I called it that.\n\nWhether you’re a supporter or critic of Casey’s, let’s all try to keep an open mind and try to see the other side of this story — the one that helps us pick up lessons.\n\nCopyright © 2007 The Digerati Life. All Rights Reserved."}, {"url": "https://www.prweb.com/releases/2006/10/prweb467291.htm", "page_content": "Casey Serin has become the media poster child for the American housing bubble as it deflates. The one-time investor has five properties facing foreclosure in four different states and decided to blog about it at http://www.iamfacingforeclosure.com. Meanwhile, he has created a large following of critics and supporters and his tale of woe has been publicized nationally by USA Today and NPR. Nigel Swaby, a licensed mortgage broker and industry writer, has picked up the story on his blog http://www.slcrealestate.blogspot.com and has released a serialized version of his interview with Mr. Serin.\n\n\"I saw Casey's story out there in the first weeks of September and made a couple of advisory posts,\" Swaby commented. With house prices declining, the media turned its focus to bubble talk and Casey soon became the poster child of what not to do. \"As I kept reading his story, I realized he's very intelligent and pretty shrewd about reaching his goal of avoiding foreclosure,\" Swaby added. When mainstream media stories hit in October, their slant on Casey's situation was primarily negative. Swaby continued, \"I wanted to give Casey a fair shake and write objectively about his investments, his marketing abilities with the blog and his future plans.\"\n\nNigel Swaby's Salt Lake Real Estate blog is new on the web, but has steadily gained a readership of several thousand visitors per month. The focus of the blog is mainly real estate and mortgage news with plenty of tips for investors and first time homebuyers. Casey Serin's tale of facing foreclosure ranks as one of the biggest stories in real estate this year and has plenty of teaching opportunities for investors and new homebuyers alike.\n\n###"}, {"url": "https://www.cnet.com/tech/tech-industry/casey-serin-the-worlds-most-hated-blogger/", "page_content": "With scant income, assets, or business savvy, the would-be real-estate mogul managed to purchase eight homes in hopes of reselling them at a profit. Along the way, he's lost all of them, run up some $170,000 in credit card and credit line debt, and launched iamfacingforeclosure.com to share his woes with the world. (Editor's note: Serin's site was intermittently reachable Monday.)\n\nFinancial exhibitionism, coupled with a lack of penitence for stiffing his creditors, has transformed the 24-year-old resident of this sleepy Sacramento suburb into a celebrity among fellow bloggers. But unlike other online celebrities, Serin's stardom comes from a unique source: \"haters\" who patronize his blog solely to learn what financial missteps he's made today.\n\n\"A community formed overnight,\" Serin said in an interview. \"It wasn't a very positive community.\"\n\nSince launching his Web site last September, Serin has discovered that it can be profitable to outrage and annoy the thousands of people who visit his blog every day. He estimates he was making up to $1,000 a month through Google ads and believes he's on track to make even more through Yahoo's ad network. His notoriety has led to appearances on Suze Orman's and Robert Kiyosaki's advice shows, and he says he's working on a book and advice packet that he'll sell online.\n\nThrough planning or dumb luck, Serin has managed to capture an audience by severely irritating many disparate groups: those who blame him and fellow speculators for the housing bubble; devout Christians, who urge him to follow the Bible more closely; and others who are hoping for news that his creditors are suing him and that his petite, attractive wife Galina is divorcing him.\n\nSerin makes it all public, including financial spreadsheets and bank statements, frank admissions that he lied on mortgage applications, and, more recently, his marital strife with Galina. Because her husband has refused to get a job since January 2006, the couple has been forced to move in with relatives and Galina cleans houses to pay for their food and rent.\n\nAs a result, the tell-all blog entries have drawn the same kind of highly attentive crowd that might assemble to watch a train wreck in progress. \"I guess I'm an open, kind of exhibitionist personality,\" Serin said.\n\nHis legions of critics use less flattering terms. The HousingPanic blog calls Serin \"the physical representation of fraud, greed, debt, fear, bubbles and human folly.\" Another says Serin is \"slothful, arrogant, unable to plan, unable to make decisions, easily overwhelmed.\"\n\nHating Serin has become something of a sport among bloggers, who compete with each other to post the most biting critiques of his financial missteps. No fewer than four Serin-hating sites have cropped up, and many others poke fun at how he paid tens of thousands of dollars for real-estate investing courses, ran up $2.2 million in debt by buying houses on credit, and then lost most of them to foreclosure (others were sold at a loss, and Serin estimates he owes an additional $100,000 to $250,000 to the banks to cover those losses).\n\nThere's even the sine qua non of a Net-celeb: a Casey Serin Dance Remix mocking his favorite sayings. Doctored photo galleries include images depicting Serin as, alternatively, Gilligan from Gilligan's Island , and McDonald's Hamburglar character. He's already been called a \"national obsession.\"\n\n\"Everyone has an opinion and anyone can speculate,\" said Rob Dawg, who runs a popular anti-Serin Web site called Exurbannation. \"Is he mentally ill? Mentally feeble? Do his bizarre personal habits affect his judgement or vice versa?\" Dawg wrote in e-mail on Friday. \"On and on. For many of us, however, Casey has become the eye of the storm, not the storm itself.\"\n\nSerin has not filed for bankruptcy, though he has publicly mulled the option. For now, he believes himself to be effectively judgment-proof, with his only significant asset being a run-down Volkswagen Jetta that recently was broken into.\n\nReaders who love to hate\n\nThe tension between Serin and his so-called haters has led to an unlikely situation: the very people who loathe him the most also rely on him for a daily source of entertainment.\n\nThe concept is sometimes called \"irritainment,\" defined as: \"Entertainment and media spectacles that are both annoying and compulsively watchable.\" (The O.J. Simpson trial in 1995 is the most famous example. Perez Hilton's blog may be another.)\n\nAgainst their better judgment, some haters have become financial supporters. In March, when Serin was facing a collection agency called CashCall, known for hardball tactics, Serin held a \"beg-a-thon\" trying to raise $220.48 by the next day.\n\nIt worked. Readers paid money to get him to answer personal questions, such as explaining why his wife dropped out of college. Someone even paid Serin $250 for the opportunity to rant to him for an hour about financial responsibility.\n\n\"I was amazed that the so-called haters were willing to spend money on me,\" Serin said. \"It shows that they're not really haters. They're in it for the entertainment.\"\n\nSome are. But others are honestly upset and view Serin as an exemplar of the worst of the housing bubble. Speculators who lied on loans, critics say, raised the cost of housing for honest buyers who needed a place to live, and foreclosures tend to reduce property values of nearby homes.\n\nOne common charge is that by lying on mortgage applications, Serin violated state and federal fraud laws. Serin uses the term \"my mortgage fraud.\" He also admits: \"I overstated my income, misrepresented owner occupancy intent and concealed the cash-back from the lenders.\"\n\nThat frank admission has led to calls to \"Send Casey Serin To Prison\"--a petition to the FBI has appeared--as well as a similar call targeting his wife.\n\n\"Casey and Galina Serin's story isn't one of 'Young couple tries to make it in the cold, cruel world,'\" one critic wrote. \"These two are f****g Bonnie and Clyde. What they're doing is bank robbery, without the gun.\"\n\nStephen Kodak, an FBI spokesman in Washington, said he could not comment on any individual case. \"Yes, it is a crime,\" he said. \"It's a crime to misrepresent your salary. It's a crime to misrepresent whether or not you're going to live in the house.\"\n\nIn March, the FBI announced a crackdown on mortgage scammers and said it has more than 1,000 current investigations. But Kodak said the FBI tends to focus on financial insiders and not people who lie on loans: \"We go after, normally, the fraud for profit, because even though it doesn't make up the majority of the numbers out there, it certainly makes up the largest financial losses.\"\n\nMarital drama, debt addiction\n\nOne wildcard in the Casey Serin saga is his wife, Galina, who met him through church social groups and married him when she was 20 years old. Both are Baptists and Slavic immigrants (Galina immigrated to the U.S. in 1990, and her husband in 1994) and are part of Sacramento's growing Russian-speaking population.\n\nIn a conversation at her sister's townhouse Thursday, where the young couple rents two rooms for about $600 a month, Galina said she was becoming frustrated with her husband's spending and had met with her pastor that afternoon for counseling. But according to her own religious views, Galina said, \"there are only two reasons for a divorce: adultery and physical abuse.\"\n\nRunning up $170,000 in unsecured debt, in other words, does not qualify--nor does lying about his plans regarding a recent vacation in Lake Tahoe, Calif., nor buying a $600 video camera on credit to document life experiences for his blog.\n\nFor his part, Serin confirms that his wife hates his blog. \"Many times she's like: I want you to shut it down and go quietly into the night,\" he said.\n\nThe so-called haters have similar sore points, including that Serin refuses to get a job and instead pays for living expenses by simply borrowing more money. He defends himself by insisting that he's making far more valuable connections through his blog.\n\nOne example he gave is that he learned, through his blog, of a $1.5 billion Las Vegas casino for sale. If he can find a buyer, Serin says, he'd get a 1 percent commission ($15 million) for his trouble. \"Doesn't that make more sense than a W-2 job?\" he said.\n\nSerin also recently paid $16,000 to Arizona's Nouveau Riche University, a kind of real-estate seminar company that includes classes with names like Fix & Flip and Creative Financing. Its marketing literature says that Nouveau Riche \"hand delivers properties on a silver platter.\"\n\nNouveau Riche, which is not accredited by the North Central Association of Colleges and Schools (the regional group recognized by the U.S. Department of Education), claims not to be a multilevel marketing scheme. It has some elements of one, however. Serin said he has found two people to pay $18,000 to Nouveau Riche, and if he finds any more, he'll get a $9,000 commission for each one, as well as additional commissions if the people he recruited then sign up additional customers.\n\nIn an e-mail message over the weekend, Serin added: \"The 16K gives me two years of quality (real estate investment) education--gives you college credits--access to cash-flow properties around the nation, local community of investors, etc.\"\n\nNot all these details have appeared on his blog yet, but Serin seems to enjoy spacing them out in a way that will vex his readers the most. \"What happens is I feed off of it,\" he said. \"I know the buttons to press to get those guys going. After awhile, you learn what topics you can mention if you want to get extra comments on your post.\"\n\nSerin already does that by stressing his penchant for afternoon naps that take place precisely when his readers are reading his blog in their cubicles and silently fuming. He claims to have bought more than $4,000 in penny stocks last month, which have since slid in value. And he delights in posting about his excursions to a nearby Jamba Juice, which became notorious when he bought a $4.90 drink there with an ATM card but was charged an extra $33 overdraft fee because his bank account was empty.\n\nDuring a visit to the same Jamba Juice on Thursday, Serin asked the cashier whether any jobs were available. But, thinking of how much time he spends every day working on his blog, he added: \"Can I keep my laptop back there while I'm at work?\"\n\nHe left without taking an application.\n\nCNET News.com's Anne Broache contributed to this report"}, {"url": "https://alchetron.com/Casey-Serin", "page_content": "Casey Konstantin Serin (born September 10, 1982, legally renamed Casey Constantine in April 2016) is an Uzbekistan-born American blogger and a former real estate investor. In a newspaper article, USA Today called him the \"poster child for everything that went wrong in the real estate boom\". Born in Tashkent, Uzbekistan, Serin immigrated to the United States in 1994. After graduating from high school, Serin bounced from job to job, generally working in website design. However, in his early twenties, Serin decided to quit working full-time in order to pursue a career in house flipping as a means of earning an income and building wealth. In an eight-month period beginning in October 2005, Serin purchased eight houses in four southwest U.S. states, and then began blogging about the foreclosure process on the properties he was unable to resell. In time, five of the eight properties foreclosed. The dubious nature of Serin's real estate transactions, coupled with his subsequent blogging about the affair, have led to Serin's name becoming strongly associated with the subprime mortgage crisis.\n\nBackground\n\nBetween October 2005 and May 2006, Serin purchased eight single-family homes using stated income loans. These loans required no documentation of income, nor any down payments. Before quitting his web design position in January 2006, Serin claimed an over-inflated income (roughly five times his actual pay) on his loan applications, reasoning that many other borrowers were using similar strategies to obtain mortgages for which they would not otherwise qualify. He continued to claim the same income on loan applications completed after he had quit his job. Serin stated that several of the properties were purchased with owner-occupied loans; these generally provide more favorable terms than loans for investment properties. A Voice of San Diego article suggests that Serin's initial loans may not have appeared in credit reports pulled for subsequent loans because he purchased properties in several states over a relatively brief period, so that \"the banks couldn't trace the pending loan documents to check up on his story.\"\n\nSerin received cash back at closing on six of the properties, sometimes exceeding California's legal maximum of three percent of the selling price. A contributor to the Scotsman Guide, a trade publication for the mortgage industry, stated in an article discussing fraudulent practices within the mortgage industry, that the largest amount of cash Serin received for a transaction was $50,000, and that the money was paid either to the seller or a third-party company (which the contributor alleges was bogus), and then returned to Serin after closing. The author, CEO and senior legal counsel of Investors Mortgage Asset Recovery Co. LLC, concludes that responsibility for fraud in cases such as Serin's lies with \"everyone who knew about the undisclosed cash and knowingly assisted in the scheme, including the sellers and any real estate agents, appraisers or closing agents.\" Serin disclosed on a Sacramento news program that he likely would not have been able to qualify for loans under more traditional terms.\n\nDespite already being deeply in debt, in late 2006, Serin borrowed $16,000 to purchase a week-long real estate seminar course purporting to teach \"creative financing\" at Nouveau Riche University (NRU) in Phoenix. Jim Piccolo, the founder of NRU, was later fined a record $6 million in 2011 by the Arizona Corporation Commission for running a fraudulent real estate investment scheme.\n\nMonths later, as the United States housing bubble began to rapidly deflate, Serin became unable to pay the mortgages or sell the properties; at one point, he estimated that he was approximately $2.2 million in debt, with a net worth around negative $600,000. Serin's house buying spree ultimately ended when a lender rejected a loan application for what would have been his ninth property, after discovering his blog. Because of the sheer magnitude of Serin's debt and the improbability of his story, some observers had initially questioned its veracity, alleging that the blog was either performance art or a viral marketing campaign. An article at The Motley Fool expressed doubt over \"whether or not this [isn't] just a somewhat elaborate hoax.\". However, public records confirm that Serin did purchase the properties in question and did subsequently default on most of the mortgages.\n\nForeclosure blog and media attention\n\nIn September 2006, Serin started the blog IamFacingForeclosure describing his situation, with the idea of both soliciting advice and warning others how to avoid the mistakes he had made. Interest in the blog first developed among readers of other blogs devoted to the United States housing bubble. His story was featured in numerous media outlets—among them, USA Today, National Public Radio, New York magazine, the San Francisco Chronicle, The Economist, The Suze Orman Show, and ABC's Nightline. When Serin first started the blog, commenters were generally supportive, hoping that Serin would make a good faith effort to avoid foreclosure and pay back any remaining debts by looking for work. The initial media exposure largely lauded Serin as an example of forthright blogging, without delving very deeply into the origin of his debts. Also, in 2006 Casey Serin appeared on \"Rich Dad's Online Business School\" where Casey Serin told his story to Robert Kiyosaki and the members of his audience.\n\nDuring the ensuing 9 months that the blog was updated, Serin generally let his problems stagnate—urgent mail went unopened, the houses went into foreclosure one by one, and Serin did not actively look for work. The overall tone of the blog's comments gradually went from encouraging Serin to openly deriding him for his inaction, his apparent nonchalant attitude towards his financial issues, and his role in the then-emerging subprime mortgage crisis. In May 2007, CNET.com writer Declan McCullagh published an article about Serin's story and the largely negative reactions Serin's blog was garnering from commenters, referring to Serin as \"the world's most hated blogger\" and describing his blog as \"irritainment.\" McCullagh wrote that \"Casey's blog has an enthusiastic – if unrelentingly critical – audience known as 'haterz'.\" Serin acknowledged that he began to purposely anger readers in an effort to drive further traffic to the blog. Over time, the blog developed a cult status, as Serin began writing about the toll his actions were taking on his personal life. The spectre of legal ramifications also factored heavily into the blog. Many commenters stated that they were attracted to the increasingly \"soap opera\"-like nature of Serin's story, and the blog was featured on a number of sites devoted to so-called \"trainwreck watching.\"\n\nFate of the blog\n\nIn April 2007, Serin appeared on The Suze Orman Show to discuss his financial predicament. Orman recommended that Serin file for bankruptcy and attempt to increase his take-home pay. However, Serin continued to make no effort to secure full-time employment, nor did he file bankruptcy; a bankruptcy attorney had told Serin that he would open himself to potential charges of mortgage fraud if he filed for bankruptcy, since the debts were acquired under fraudulent pretenses.\n\nThe final months of his blog saw further erratic behavior by Serin, including a June 2007 spur-of-the-moment flight to Australia without informing his wife or family members. Regarding his multiple mortgages, Serin acknowledged to the Sydney Morning Herald that \"the stuff I did is technically mortgage fraud, but it's not officially called that until someone prosecutes me and proves that that is indeed mortgage fraud,\" asserting a presumption of innocence. While in Australia, Casey Serin appeared on Top Shelf Radio with Robbie Buck. On the Jon Ronson show, Serin again confirmed his use of so-called \"liar loans\".\n\nOn July 11, 2007, Serin disclosed that he was under investigation by the FBI. In an interview conducted by ABC News, his attorney reported that Casey Serin was under investigation by the FBI, but that \"no charges have been brought against Mr. Serin. However, based upon conversations with the U.S. Attorney's office in California, federal charges related to Mr. Serin's real estate transactions are expected to be brought against him\". Shortly thereafter, Serin said in a mass e-mailing that he would be closing the blog and getting a \"regular W-2 job,\" citing the stress his family has experienced.\n\nSerin's final blog entry on July 28, 2007 was dedicated to his wife. Aaron Krowne, an Emory University library researcher and owner of ml-implode.com, purchased the blog. Serin says he used proceeds from the sale to pay off $35,000 of consumer credit debt in his wife's name.\n\nAlthough Serin retained an attorney in July 2007 and stated that he was under investigation by the FBI, Serin has never been officially charged with any crime.\n\nLegal change of name\n\nIn 2016, Serin legally changed his name to Casey Constantine. In Facebook comments, he stated that the name change is a sort of rebranding for the next chapter of his career/business in real estate, and that it will allow him much more control over his search results online, somewhat of a clean slate."}, {"url": "https://www.liquisearch.com/casey_serin/blog_and_media_attention", "page_content": "Blog and Media Attention\n\nIn September 2006, Serin started the blog IamFacingForeclosure describing his situation, with the idea of both soliciting advice and warning others how to avoid the mistakes he had made. Interest in the blog first developed among readers of other blogs devoted to the United States housing bubble. His story was featured in numerous media outlets—among them, USA Today, National Public Radio, New York magazine, the San Francisco Chronicle, The Economist, The Suze Orman Show, and ABC's Nightline. When Serin first started the blog, commenters were generally supportive, hoping that Serin would make a good faith effort to avoid foreclosure and pay back any remaining debts by looking for work. The initial media exposure largely lauded Serin as an example of forthright blogging, without delving very deeply into the origin of his debts. Also, in 2006 Casey Serin appeared on \"Rich Dad's Online Business School\" where Casey Serin told his story to Robert Kiyosaki and the members of his audience.\n\nDuring the ensuing 9 months that the blog was updated, Serin generally let his problems stagnate—urgent mail went unopened, the houses went into foreclosure one by one, and Serin did not actively look for work. The overall tone of the blog's comments gradually went from encouraging Serin to openly deriding him for his inaction, his apparent nonchalant attitude towards his financial issues, and his role in the then-emerging subprime mortgage crisis. In May 2007, CNET.com writer Declan McCullagh published an article about Serin's story and the largely negative reactions Serin's blog was garnering from commenters, referring to Serin as \"the world's most hated blogger\" and describing his blog as \"irritainment.\" McCullagh wrote that \"Casey's blog has an enthusiastic – if unrelentingly critical – audience known as 'haterz'.\" Serin acknowledged that he began to purposely anger readers in an effort to drive further traffic to the blog. In time, the blog developed a cult status, as Serin began writing about the toll his actions were taking on his personal life. The spectre of legal ramifications also factored heavily into the blog. Many commenters stated that they were attracted to the increasingly \"soap opera\"-like nature of Serin's story, and the blog was featured on a number of sites devoted to so-called \"trainwreck watching.\""}]}