{"Jean Hugo was a prolific artist, best known for his drawings and engravings.": [{"url": "https://www.wikiart.org/en/jean-hugo", "page_content": "The great-grandson of Victor Hugo, Jean Hugo was a French painter, illustrator, theatre designer and author. He was born in Paris and died in his home at the Mas de Fourques, near Lunel, France. Brought up in a lively artistic environment, he began teaching himself drawing and painting and wrote essays and poetry from a very early age. His artistic career spans the 20th century. From his early sketches of the First World War, through the creative ferment of the Parisian interwar years, and up to his death in 1984. He was part of a number of artistic circles that included Jean Cocteau, Raymond Radiguet, Pablo Picasso, Georges Auric, Erik Satie, Blaise Cendrars, Marie-Laure de Noailles, Paul Eluard, Francis Poulenc, Charles Dullin, Louis Jouvet, Colette, Marcel Proust, Jacques Maritain, Max Jacob, Carl Theodor Dreyer, Marie Bell, Louise de Vilmorin, Cecil Beaton and many others.\n\nJean Hugo (19 November 1894 – 21 June 1984) was a painter, illustrator, theatre designer and author. He was born in Paris and died in his home at the Mas de Fourques, near Lunel, France. Brought up in a lively artistic environment, he began teaching himself drawing and painting and wrote essays and poetry from a very early age. His artistic career spans the 20th century, from his early sketches of the First World War, through the creative ferment of the Parisian interwar years, and up to his death in 1984. He was part of a number of artistic circles that included Jean Cocteau, Raymond Radiguet, Pablo Picasso, Georges Auric, Erik Satie, Blaise Cendrars, Marie-Laure de Noailles, Paul Eluard, Francis Poulenc, Charles Dullin, Louis Jouvet, Colette, Marcel Proust, Jacques Maritain, Max Jacob, Carl Theodor Dreyer, Marie Bell, Louise de Vilmorin, Cecil Beaton and many others.\n\n\n\nJean Hugo was the great-grandson of the poet, playwright, novelist, essayist, visual artist, statesman, human rights activist and exponent of the Romantic movement in France, Victor Hugo. His grandfather, Charles Hugo was a journalist, pioneer of early photographic techniques and a campaigner against the death penalty, and his father Georges Hugo was a published author and a recognised painter.\n\n\n\nHis mother, Pauline Ménard-Dorian, was the daughter of Paul-François Ménard, conseiller général and député of the Hérault department during the 1870s–80s, by his wife Aline Dorian, daughter of Pierre Frédéric Dorian, minister of works during the siege of Paris.\n\n\n\nJean Hugo was married twice, first in 1919 to Valentine Hugo (née Valentine Gross, no children from this marriage) and then in 1949 to Lauretta Hope-Nicholson, daughter of Hedley Hope-Nicholson. Jean Hugo and Lauretta had seven children, several of whom have gone on to establish successful careers in the arts.\n\n\n\nJean Hugo's half-brother François Hugo designed limited-edition jewellery interpretations for Pablo Picasso, Jean Cocteau, Max Ernst and Coco Chanel during the '20s Modern period.\n\n\n\nPierre Hugo – son of François Hugo – is also a jewellery designer and has written a book about the artistic legacy of the Hugo family, Les Hugo – Un Temoignage (Rocher, France, 2007).\n\n\n\nHugo is predominantly known for his sketches and oil or gouache paintings, which are often executed in small formats. He also illustrated books, designed theatre sets and costumes and produced ceramics, murals, textile designs and stained glass windows. Hugo designed the sets and costumes for Carl Theodor Dreyer's film The Passion of Joan of Arc (1928). His paintings can be viewed at the Barnes Foundation in Philadelphia, and are also present in collections in London, Tokyo, Toronto, Paris, Marseille, and at the Musee Fabre in Montpellier, France – where there is room dedicated to his paintings.\n\n\n\nJean Hugo's painting is unique in the artistic panorama of the first half of the 20th century and maintains an authentic originality while evoking certain avant-garde themes of magical realism or metaphysical painting. At the start of the 1930s, in between naïve and happy scenes and various theatrical projects – such as Jean Cocteau's Les mariés de la Tour Eiffel – he produced a series of masterful works in brooding, unsettling, tones (Solitude, 1933).\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://prabook.com/web/jean.hugo/3743152", "page_content": "Jean Hugo\n\nartist designer illustrator writer\n\nNovember 19, 1894 (age 89) Paris, France\n\nJean Hugo is mainly known as the author of a great number of sketches and oil or gouache paintings, which are often small sized. He also created illustrations for books, designed theatre sets, and costumes as well as produced ceramics, murals, textile designs and stained glass windows. Hugo's first published illustration appeared in 1918. It was a monogram for La Sirène publishing house. Then he also illustrated Les Joues en Feu by Raymond Radiguet, Bernouard, in 1920; Pommes d'Anis by Francis Jammes, Emile-Paul, 1923; Les Mariés de la Tour Eiffel by Jean Cocteau, NRF, and Les Amis Nouvel by Paul Morand, Au Sans Pareil, both in 1924; Roméo et Juliette by Shakespeare, Au Sans Pareil, in 1926, among others. Jean Hugo’s paintings were unique in the artistic world of the 20th century. They maintained an authentic originality while recalling certain avant-garde themes of metaphysical painting or magical realism. At the start of the 1930s, in between various theatrical projects, including Jean Cocteau’s Les mariés de la Tour Eiffel, he produced a series of masterful artworks, such as Solitude (1933). He was interested in forest scenes (L'Ermite de Meudon, 1933) and religious themes (La Cène, 1933). L'Imposteur (1931) and La Baie des Trépassés (1932) were produced in the same period. Many of his paintings were based on the sketches that he created all the time. He used to say that \"inspiration comes naturally but one has to arrange regular meetings with it.\" L'Imposteur (1931) was a conclusion of Jean Hugo's first artistic period. Around this time he moved from Paris to the family property at the Mas de Fourques, Lunel, France, after the death of his grandmother. His painting of that period was a masterful assembly of the most important insights he had acquired so far. The lessons of the Italian primitives, of Poussin, of Henri Rousseau, and Picasso, were among the sources of inspiration on which he was constantly drawing. In the middle of the 1930s, Jean Hugo started to use oil paints to create his larger compositions while continuing to paint with tempera. The artist's work witnessed his intention to work outside of present-day currents and fashionable theories. He never took part in the artistic debates and paid the price for it by never achieving wide recognition of his work by the general public. The artist illustrated many limited edition books published between 1948 and 1984 by Pierre-André Benoit (PAB), collaborating with such writers as René Char, Marcel Jouhandeau, Tristan Tzara and René Crevel. Jean Hugo's artworks were widely exhibited, with solo retrospectives taking place in France, England, Japan, Canada and the United States. Among the most prominent of them were: Jean Hugo and Max Jacob at the Claridge Gallery, London, 1929; Jean Hugo '77 at the Ueno Royal Museum, Tokyo, 1977; Paintings and Drawings by Jean Hugo and Jean Cocteau at Sotheby's, London, 1981; Jean Hugo: 1894-1984 at the Musée des Beaux Arts, Béziers, 1985; Jean Hugo: a Retrospective at the Julian Barran Gallery, London, 1996; Jean Hugo et la Scène at the Bibliothèque-musée de l’Opéra, Paris, 2001; Jean Hugo: l'Enlumineur du Quotidien at the Musée Pierre André Benoit, Alès, 2014, etc."}, {"url": "https://www.askart.com/artist/artist/11041386/artist.aspx", "page_content": "Contribute to Developing the Biography for Jean Hugo ×\n\nPlease note: Artists not classified as American in our database may have limited biographical data compared to the extensive information about American artists.\n\n\n\nCreating biographies or improving upon them is a work in progress, and we welcome information from our knowledgeable viewers.\n\n\n\nIf you feel you have worthwhile information you would like to contribute, the following means of submission is the most efficient. We welcome your involvement!\n\n\n\n1. For Premier Dealers and museums already registered with askART your best approach is to log in, choose the artist (once he/she is in your list of artists), and submit your biography there. If you are a dealer or museum not currently registered, please click here to register, and then you may select your artist and submit a biography.\n\n\n\n2. For all others who have useful information about this artist, please email the information to registrar@askart.com. Please note: All biographies will be fully viewable on Fridays, but the rest of the week biographies are available only to subscribers.\n\n\n\nBiography Guidelines\n\nWhen submitting biographical information, we appreciate your consideration of the following:\n\n\n\nPlease keep in mind that askART is not a promotional site, and accordingly biographical information should not be worded for purposes of 'advertising' an artist.\n\n\n\nOur site is about PAINTERS, SCULPTORS, and ILLUSTRATORS. If you do not know a great deal about the artist, but have noteworthy information to share, we would welcome you to send it also to registrar@askart.com. It is rewarding for all of us to see artists' files grow, and others may be eager to supplement what you have provided.\n\n\n\nNon-Dealers and Museums:\n\nPlease introduce your information as follows: \"The following biographical information has been provided by Jane Doe, the niece of the artist.\"\n\n\n\nDealers and Museums will be automatically credited with a link to their sites.\n\n\n\nJust the facts, please. Our editors are trained to delete any hype or advertising verbiage such as “most famous,” “internationally renowned,” “extraordinarily beautiful works.”\n\n\n\nIf you do not know a great deal about the artist, answer as many of the following questions as you can. Other persons, seeing your entry, often add to the data. This is how many of the biographies grow.\n\n\n\nPlease include in your biography answers to as many of the following questions as possible:\n\nWhat are the subjects and styles ( and other distinctive characteristics) for which the artist’s work is best known?\n\nand other distinctive characteristics) for which the artist’s work is best known? Is the artist identified with any particular art movements, or artists , who influenced his or her work?\n\n, who influenced his or her work? Where, when, and under whom did the artist receive education and training ?\n\n? Can you provide all relevant personal background information on the artist?\n\non the artist? In which Art Organizations was the artist a member?\n\nwas the artist a member? Can you provide a list of all major museum and artist association exhibitions ? ( excluding commercial art galleries ).\n\n? ( ). What awards or other recognition did the artist win?\n\nor other recognition did the artist win? What museums (name, city, and state) currently hold works by the artist in their permanent collections?\n\n(name, city, and state) currently hold works by the artist in their permanent collections? Required : What are the sources for your information? For books, list title, author, date of publication. (Optional: cite number of pages and yes/no if there are color images.) For magazine articles, cite title of article, author, title of publication, date, and page number if possible.\n\n: What are the for your information? For books, list title, author, date of publication. (Optional: cite number of pages and yes/no if there are color images.) For magazine articles, cite title of article, author, title of publication, date, and page number if possible. Required : the name of the person submitting the information.\n\n\n\nDealer Note: Please enter books, periodicals and museum references in the space provided. Do not combine book information with biography.\n\n\n\nThere are many strong biographies that you may refer to on our website, such as Cecilia Beaux, Edward Hopper, and Paul Sample. Please do not submit biographies with minimal facts or excessively promotional writing such as the following (unusable) wording:\n\n\n\nWhat NOT to send:\n\n\"The artist John Doe is the quintessential master of light, color, and scene. His brilliant canvases are full of feeling, where love can be felt through all the senses. Through his skillful brushwork, and drawing from his life experiences, he creates images where the viewer feels he has truly become one with the subject. Doe's paintings are sure to be sought by the discriminating collector. I/we have numerous spectacular works by Doe available for sale.\"\n\n\n\nWe appreciate your participation in askART. If you have any questions about submitting biographies, please send them to registrar@askart.com\n\nShare an image of the Artist."}, {"url": "https://www.metmuseum.org/art/collection/search/461679", "page_content": "Resources for Research\n\nThe Met's Libraries and Research Centers provide unparalleled resources for research and welcome an international community of students and scholars.\n\nThe Met Collection API is where all makers, creators, researchers, and dreamers can connect to the most up-to-date data and public domain images for The Met collection. Open Access data and public domain images are available for unrestricted commercial and noncommercial use without permission or fee."}, {"url": "https://mymodernmet.com/best-drawings/", "page_content": "Drawing is one of the oldest forms of visual art with a long and diverse history. It is widely considered the foundation of all art and the first medium students must master. And while its widespread accessibility means it continues to be a popular pursuit for creatives around the world, drawings are often overshadowed by painting and sculpture.\n\nHowever, many artists who are famous for their work in color were also exemplary draftspeople. In fact, masters like Leonardo da Vinci, Michelangelo, and Rubens made countless preparatory drawings before each painting to study their subjects and develop compositions. Similarly, Jean-Auguste-Dominique Ingres created refined graphite portraits, which are some of his most celebrated works today.\n\nHere, we will explore 12 famous artists who utilized the power of lines in their artwork.\n\nWho are the most famous drawing artists? Learn about some of the greatest masters of the line.\n\nLeonardo da Vinci\n\nFull Name Leonardo di ser Piero da Vinci Born April 15, 1452 (Vinci, Italy) Died May 2, 1519 (Amboise, France) Notable Artwork Mona Lisa, Vitruvian Man Movement Italian Renaissance\n\nLeonardo da Vinci is the quintessential Renaissance man. While many associate him solely with his famous painting the Mona Lisa, his unending curiosity inspired him to study art, engineering, and nature. And all of his interests can be found in his legacy of notebooks.\n\nIn these notebooks are hundreds of detailed sketches exploring human anatomy, animals, plant life, inventions, and more. They show how Da Vinci used drawings to think critically as well as solve problems.\n\nAlbrecht Dürer\n\nFull Name Leonardo di ser Piero da Vinci Born April 15, 1452 (Vinci, Italy) Died May 2, 1519 (Amboise, France) Notable Artwork Mona Lisa, Vitruvian Man Movement Italian Renaissance\n\nNorthern Renaissance artist Albrecht Durer was the first artist to elevate printmaking to a form of fine art. He produced engravings, woodcuts, and etchings based on his meticulously detailed drawings. It was the first time someone attempted to duplicate such realistic illustrations, and its overwhelming success subsequently inspired other artists to make and distribute prints.\n\nMichelangelo Buonarroti\n\nFull Name Michelangelo di Lodovico Buonarroti Simoni Born March 6, 1475 (Caprese, Italy) Died February 18, 1564 (Rome, Italy) Notable Artwork Sistine Chapel ceiling, David Movement Italian Renaissance\n\nFor many, Michelangelo is still the greatest artist of all time. His mastery over different disciplines—painting, sculpture, architecture—is unparalleled. At the core of his creative practice, however, was drawing.\n\nBefore each painting and sculpture, the Italian artist created numerous sketches of the human figure. These expressive drawings reveal a deep understanding of anatomy and physiology and provide insight into how Michelangelo approached his elaborate compositions.\n\nRembrandt\n\nFull Name Rembrandt Harmenszoon van Rijn Born July 15, 1606 (Leiden, Netherlands) Died October 4, 1669 (Amsterdam, Netherlands) Notable Artwork The Night Watch Movement Baroque\n\nCelebrated for his successes spanning multiple media and types of subject matter, Rembrandt was called a “colossus of art” by prolific sculptor Auguste Rodin. In his drawing, he was known for his ability to render both landscapes and subjects quickly and confidently.\n\nBritish artist David Hockney praised Rembrandt's gestural drawing A child being taught to walk, saying: “I think it's the greatest drawing ever done… It's magnificent drawing, magnificent.”\n\nPeter Paul Rubens\n\nFull Name Sir Peter Paul Rubens Born June 28, 1577 (Siegen, Germany) Died May 30, 1640 (Antwerp, Belgium) Notable Artwork Rape of the Daughters of Leucippus Movement Baroque\n\nKnown for his voluptuous women, opulent colors, and dynamic compositions, Peter Paul Rubens is considered to be one of the most influential painters of the Baroque period. Before he embarked on a commissioned painting, he created several preliminary studies of his subjects.\n\nThese surviving sketches display the Flemish artist's confident drafting ability. With just a few confident lines, he could convey gestures and emotion.\n\nJ.M.W. Turner\n\nFull Name Josph Mallord William Turner Born April 23, 1775 (London, England) Died December 19, 1851 (Chelsea, England) Notable Artwork Rain, Steam and Speed — The Great Western Railway Movement Romanticism\n\nKnown for his Romantic landscape and seascape paintings, J.M.W. Turner also produced 30,000 works on paper over the course of his life. Turner began exhibiting and selling his drawings at a young age. He later produced everything from topographical drawings to dynamic sketches that were used as studies for larger paintings.\n\nJean-Auguste-Dominique Ingres\n\nFull Name Jean-Auguste-Dominique Ingres Born August 29, 1780 (Montauban, France) Died January 14, 1867 (Paris, France) Notable Artwork La Grande Odalisque, The Turkish Bath Movement Neoclassicism\n\nNeoclassical artist Jean-Auguste-Dominique Ingres was known for his larger-than-life paintings, which celebrated traditional painting techniques. And while his work in oil was sometimes scrutinized by contemporary critics for its gothic undertones, his numerous drawings and graphite portraits were highly revered for their precision in capturing a subject's physical appearance and personality.\n\nEdgar Degas\n\nFull Name Hilaire-Germain-Edgar De Gas Born July 19, 1834 (Paris, France) Died September 27, 1917 (Paris, France) Notable Artwork The Dance Class Movement Impressionism\n\nWhile most Impressionists found inspiration in picturesque landscapes, French artist Edgar Degas preferred capturing human subjects, especially those in movement. In addition to his many well-known paintings, he also made countless pastel and pencil studies of ballerinas, singers, and bathing women—each of which displays his finesse at rendering the human form in action.\n\nGustav Klimt\n\nFull Name Gustav Klimt Born July 14, 1862 (Baumgarten, Austria) Died February 6, 1918 (Vienna, Austria) Notable Artwork The Kiss Movement Vienna Secession, Art Nouveau\n\nMost associate Gustav Klimt‘s glittering paintings with their golden touches. But the Austrian artist was also a master draftsman who utilized strong lines in his compositions. His striking renderings of the female figure utilize foreshortening and perspective.\n\nHenri de Toulouse-Lautrec\n\nFull Name Henry Marie Raymond de Toulouse-Lautrec-Monfa Born November 24, 1864 ( Albi, Tarn, France) Died September 9, 1901 (Saint-André-du-Bois, France) Notable Artwork At the Moulin Rouge Movement Post-Impressionism\n\nA contemporary of Vincent van Gogh and Paul Gauguin, French artist Henri de Toulouse-Lautrec spent most of his life in the theatrical underbelly of Paris.\n\nIn his posters, Toulouse-Lautrec employs masterful use of the line to characterize well-known performers of the time, including Yvette Guilbert, Louise Weber, and Jane Avril. His draftsmanship captured the movement of dance and the energy of Parisian nightlife during the Belle Époque.\n\nHenri Matisse\n\nView this post on Instagram A post shared by Muzéo (@muzeoparis)\n\nFull Name Henri Émile Benoît Matisse Born December 31, 1869 (Le Cateau-Cambrésis, France) Died November 3, 1954 (Nice, France) Notable Artwork The Dance Movement Post-Impressionism, Fauvism\n\nAs a masterful draughtsman, Henri Matisse is known for his incredible use of lines. His curvy, flowing lines were a signature of his work, and he clearly understood the importance of drawing to his artistic practice. In fact, he once said, “my line drawing is the purest and most direct translation of my emotion.”\n\nView this post on Instagram A post shared by Edge And Milk (@edgeandmilk)\n\nPablo Picasso\n\nView this post on Instagram A post shared by Musée national Picasso-Paris (@museepicassoparis)\n\nFull Name Pablo Diego José Francisco de Paula Juan Nepomuceno María de los Remedios Cipriano de la Santísima Trinidad Ruiz y Picasso Born October 25, 1881 (Málaga, Spain) Died April 8, 1973 (Mougins, France) Notable Artwork Les Demoiselles d'Avignon, Guernica Movement Cubism\n\nWith a career that spanned 79 years, Pablo Picasso is known for changing his painting style several times. Throughout his many creative shifts, however, the artist retained a uniquely decisive way of capturing the world around him in drawings. In particular, these sketches show how the Spanish artist needed only a few bold lines to evoke the form of his subjects.\n\nView this post on Instagram A post shared by Musée national Picasso-Paris (@museepicassoparis)\n\nRelated Articles:\n\nAmazing Collection of Michelangelo Drawings Is Now in the U.S. For the First Time\n\nThis Artist Creates Larger-Than-Life Flower Drawings With Colored Pencils\n\nThe Significance of Leonardo da Vinci’s Famous “Vitruvian Man” Drawing\n\nTalented Artists Share Their Favorite Tips for Improving Your Drawing Skills"}, {"url": "http://www.artcyclopedia.com/artists/hugo_jean.html", "page_content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe cannot be responsible for the content of external web sites.\n\n\n\nAll images and text on this Jean Hugo page are copyright 1999-2015 by John Malyon/Specifica, Inc., unless otherwise noted. Note that the listings on this site are a unique compilation of information and are protected by copyright worldwide.\n\n\n\n\n\n\n\n"}, {"url": "https://www.theartnewspaper.com/2021/03/28/meet-the-hugos-a-family-of-goldsmiths-that-worked-with-picasso-and-now-collaborates-with-contemporary-artists", "page_content": "An artistic collaboration for the ages was born because a dentist was too busy. Dr Chataigner could not melt gold for Picasso anymore, and the artist was sick of asking. “Picasso said he could not go on pestering the dentist: the man had teeth to fix,” recalled the artist’s biographer, John Richardson. Chataigner had to use his smelting skills to fill cavities, not make gilded centaurs, and so Picasso needed to find someone else to help him use an ancient medium for which he had many ideas, but no technical expertise.\n\nA photograph of Picasso inscribed to François Hugo Courtesy of Ateliers Hugo\n\nDuring a studio visit in 1956, Picasso asked Richardson who else could execute his designs. The art historian suggested François Hugo, a trained engineer with dexterous hands who had spent the Second World War and the years after making custom buttons for couture designers like Coco Chanel, Elsa Schiaparelli, and Christian Dior. Picasso had known Hugo for years after the two met at the 1917 premier of Parade, a Ballets Russes performance. He contacted François and within months they were working together.\n\nAround ten golden bowls and medallions that Picasso made with Hugo will be exhibited at Barcelona’s Museu Picasso in Picasso and the Artist’s Jewellery , opening in May. In April, the Ateliers Hugo —founded by François and his son Pierre, and now run by 32-year-old grandson Nicholas—plans to release medallions of a masked figure and abstract spiral created with contemporary sculptural painter Josh Sperling, representing the latest in this workshop’s series of artistic partnerships. Taken together, the two events bookend the artistic production of a three-generation family business that has operated from the same studio in southern France for nearly 70 years.\n\nNicolas with his father Pierre in the Ateliers Hugo workshop, where photos of François and other family hang on the walls Photo: Maxime Souyri. Courtesy of Ateliers Hugo\n\nLike a Renaissance workshop, knowledge of how to spin an artist’s drawing into gold (and which designs would work best) has been passed from father to son. François, a great-grandson of French writer Victor Hugo, knew several artists personally and worked from the house he built for himself just outside Aix-en-Provence. Pierre grew up there, and started apprenticing under his father in his early 20s, after studying at London’s Royal College of Art.\n\n“Basically, it started with Picasso,” explains Nicolas Hugo, who joined the atelier two years ago, after his father became ill and none of his four siblings were interested in entering the family business. “And of course, if Picasso was doing something, everyone wanted to do it as well.” Other artists friends of François’s soon came with their own ideas for collaboration, including Max Ernst, Jean Cocteau, and André Derain. As word spread, he also worked with Jean Arp, Dorothea Tanning, Jean Dubuffet, Jean Lurcat, and Roberto Matta, among others, to make limited edition series. Pierre brought on new artists too, such as Arman and Corneille van Beverloo.\n\nBy the time Nicolas joined, the atelier was collaborating with Ugo Rondinone and Eric Croes. The younger Hugo was an independent dealer, selling Modern and contemporary art, but Ateliers Hugo was always in his peripheral vision since he grew up next door to his grandfather. “Our kitchen is five meters from the workshop,” he says. “I’ve seen this work all my life.”\n\nArtist-designed gold pieces created by Ateliers Hugo Photo: Lucillia Chenel & Ken Israel. Courtesy of Ateliers Hugo\n\nNicolas is bringing the atelier into the 21st century by digitizing its archive, cultivating an online presence (the workshop is now on Instagram), and partnering with new contemporary artists.\n\nHis first project has been to work with Sperling, a process that began when the two met through the Belgian gallerist Sebastien Janssen in October 2019. The artist brought several drawings and Nicolas picked two, which Sperling turned into three-dimensional models. Ateliers Hugo transformed the models into prototypes, and after the artist approved them, they were turned into moulds which were used to hammer out the series of medallions.\n\nThe shapes of Sperling’s works are new, but their artistry is heirloom. “The house is the same, the tools are the same. The workshop is the same, the technique is the same,” Nicolas says. “Nothing has changed, really. It just has more pictures of the family.”"}, {"url": "https://eclecticlight.co/2019/08/09/victor-hugo-the-unknown-painter/", "page_content": "Did you know that Victor Hugo (1802-1885), the great French writer of the nineteenth century and author of Les Misérables and The Hunchback of Notre Dame, was also an artist? He drew and painted not for public exhibition, but for his own pleasure, and for his family and friends. For an ‘amateur’ he was prolific, with over four thousand drawings and paintings recorded, and Eugène Delacroix himself expressed the view that he could have been a successful artist, even transforming painting perhaps. See what you think of this small selection.\n\nHugo grew up at a time of great turmoil, spanning Napoleon’s reign as Emperor and the Bourbon restoration of the monarchy. His father was a senior officer in Napoleon’s army, but his mother was a Catholic Royalist! As a result of his father’s military career, Hugo was well-travelled as a child, and saw the Alps and Italy, for instance.\n\nHe married a childhood friend, Adèle Foucher (1803-1868) in 1822, the year before the publication of his first novel. During the 1830s he established himself as a major poet, and in 1829 published his first major mature novel, The Last Day of a Condemned Man, which was to be highly influential on authors such as Albert Camus, Charles Dickens, and Dostoyevsky. Notre-Dame de Paris, known in English as The Hunchback of Notre-Dame, followed in 1831 and brought him popularity across Europe and the Americas.\n\nMost of Hugo’s accessible paintings, like Old Castle in a Storm from 1837, are Gothic-Romantic paintings in ink and wash on paper.\n\nBy the late 1830s, Hugo was working on what was to become Les Misérables, although it wasn’t published until 1862. He visited the notorious prison, the Bagne of Toulon, which features in that in 1839, and started writing the book in 1845.\n\nThis is his Castle on a Hill from about 1847, again in Indian ink and wash on paper.\n\nHugo was appointed to the peerage in 1845, then started his political career when he was elected to the French National Assembly in 1848. When Napoleon III seized power in 1851, Hugo left France, first staying in Brussels, then moving to the British island of Jersey, and finally settling on the neighbouring island of Guernsey, where he lived between 1855-1870. He wrote about the island in his novel Toilers of the Sea, which was published in 1866, while he was still in self-imposed exile.\n\nHugo fought a lifelong battle against the death penalty, which he first committed to print in his early novel The Last Day of a Condemned Man (1829). The Hanged Man “Ecce” from 1854 shows the remains of a hanged criminal swinging from a gibbet.\n\nThe Gnome of the Night from 1856 is one of several works which show grotesque figures from folk tales and legend.\n\nJohn Brown, from 1861, is an engraving after Hugo’s original painting showing the body of the famous American abolitionist, who was tried for treason and murder and was hanged in 1859. Hugo had tried to obtain a pardon for him, while the writer was in exile on Guernsey, and this engraving appeared subsequently on a pamphlet reprinting two of Hugo’s open letters about John Brown.\n\nHugo’s painting of Château de Walzin was made in 1863. Walzin Castle is in Belgium, where it overlooks the River Lesse.\n\nOctopus from 1866 is a painting which just appears to be fun.\n\nThe Steamship ‘Durande’, dated 4 November 1866, was made to accompany his novel Toilers of the Sea, and offered to a critic to thank him for writing a favourable review. It is reminiscent of some of Turner’s marine paintings, perhaps.\n\nMy Destiny appears a curious coincidence. Hugo painted this in brown ink, wash and white gouache in 1867, at about the same time that Gustave Courbet painted the same theme of a breaking wave on the shore. Both men had grounds for concern as Napoleon III’s rule came to an end: Hugo was already in exile, and Courbet was soon to leave France.\n\nIn some of his paintings, Hugo was extremely experimental in his methods. Evacuation of an Island from 1870 is most unusual, and perhaps more typical of the avant garde in the twentieth century. He is reputed to have practised ‘automatic drawing’ without looking at the paper, and during séances.\n\nHugo painted this mediaeval tower of Schengen Castle on 13 September 1871.\n\nAfter the fall of the Paris Commune in 1871, when he failed to be re-elected to the National Assembly, Hugo again left France, returning to the island of Guernsey between 1872-73.\n\nI also have two undated works of Hugo’s.\n\nThe House I Lived in at the Corner of the Bridge was published in the artist’s Complete Works in 1913.\n\nThis untitled work, made during his many travels, was published in the same collection.\n\nVictor Hugo died on 22 May 1885, at the grand age of 83. He was, perhaps inevitably, given a state funeral, and was buried in a crypt in the Panthéon in Paris.\n\nReferences\n\nMisha Bittleston’s page\n\nWikipedia."}, {"url": "https://www.wikiart.org/en/honore-daumier", "page_content": "Known as the “Michelango of Caricature,” Honore Daumier was a prolific painter, printmaker, sculptor, and caricaturist. He produced over 4000 lithographs in his lifetime, which were known for their satires of political figures and the behavior of the bourgeois inn society. As a boy he showed an inclination towards art, which his father tried to discourage, and so he put him to work as an usher. But, Daumier’s talents could not be dissuades, and he later work at a booksellers, eventually landing in the employ of Alexandre Lenoir, an artist and archaeologist, and becoming his protégé. It was here that he began making his first attempts at lithography, and began a career producing plates for music producers and advertisement illustrations. He began working for the comic journal La Caricature during the reign of King Louis Phillippe, and produced many caricatures outlining corruption on the law, the mistakes of the bourgeois, and the incompetence of the government. It was at this time that he published a satire of the king as Gargantua, which landed him in prison for six months, after which the journal La Caricature ceased publication. He also produced caricatures for the publication Le Chavivari, holding the bourgeois up to more scrutiny One of his favorite themes was Don Quixote, of which he drew 49 drawings, and completed 29 paintings depicting his life. Daumier received little recognition until 1878, a year before his death, when his works were put on exhibition. Posthumously, more recognition has been placed on Daumier and his revered social commentary.\n\nHonoré-Victorin Daumier (French: [ɔnɔʁe domje]; February 26, 1808 – February 10, 1879) was a French printmaker, caricaturist, painter, and sculptor, whose many works offer commentary on social and political life in France in the 19th century.\n\n\n\nDaumier produced over 500 paintings, 4000 lithographs, 1000 wood engravings, 1000 drawings and 100 sculptures. A prolific draughtsman, he was perhaps best known for his caricatures of political figures and satires on the behavior of his countrymen, although posthumously the value of his painting has also been recognized.\n\n\n\nDaumier was born in Marseille to Jean-Baptiste Louis Daumier and Cécile Catherine Philippe. His father Jean-Baptiste was a glazier whose literary aspirations led him to move to Paris in 1814, seeking to be published as a poet. In 1816 the young Daumier and his mother followed Jean-Baptiste to Paris. Daumier showed in his youth an irresistible inclination towards the artistic profession, which his father vainly tried to check by placing him first with a huissier, for whom he was employed as an errand boy, and later, with a bookseller. In 1822 he became protégé to Alexandre Lenoir, a friend of Daumier's father who was an artist and archaeologist. The following year Daumier entered the Académie Suisse. He also worked for a lithographer and publisher named Belliard, and made his first attempts at lithography.\n\n\n\nHaving mastered the techniques of lithography, Daumier began his artistic career by producing plates for music publishers, and illustrations for advertisements. This was followed by anonymous work for publishers, in which he emulated the style of Charlet and displayed considerable enthusiasm for the Napoleonic legend. After the revolution of 1830 he created art which expressed his political beliefs. Daumier was almost blind by 1873.\n\n\n\nDuring the reign of Louis Philippe, Charles Philipon launched the comic journal, La Caricature, Daumier joined its staff, which included such powerful artists as Devéria, Raffet and Grandville, and started upon his pictorial campaign of satire, targeting the foibles of the bourgeoisie, the corruption of the law and the incompetence of a blundering government. His caricature of the king as Gargantua led to Daumier's imprisonment for six months at Ste Pelagie in 1832. Soon after, the publication of La Caricature was discontinued, but Philipon provided a new field for Daumier's activity when he founded the Le Charivari.\n\n\n\nDaumier produced his social caricatures for Le Charivari, in which he held bourgeois society up to ridicule in the figure of Robert Macaire, hero of a popular melodrama. In another series, L'histoire ancienne, he took aim at the constraining pseudo-classicism of the art of the period. In 1848 Daumier embarked again on his political campaign, still in the service of Le Charivari, which he left in 1863 and rejoined in 1864.\n\n\n\nAround the mid-1840s Daumier started publishing his famous caricatures depicting members of the legal profession, known as 'Les Gens de Justice', a scathing satire about judges, defendants, attorneys and corrupt, greedy lawyers in general. A number of extremely rare albums appeared on white paper, covering 39 different legal themes, of which 37 had previously been published in the Charivari. It is said that Daumier's own experience as an employee in a bailiff's office during his youth may have influenced his rather negative attitude towards the legal profession.\n\nThis is a part of the Wikipedia article used under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC-BY-SA). The full text of the article is here →"}, {"url": "https://www.britannica.com/biography/Pablo-Picasso", "page_content": "Early years\n\nPablo Picasso was the son of José Ruiz Blasco, a professor of drawing, and Maria Picasso López. His unusual adeptness for drawing began to manifest itself early, around the age of 10, when he became his father’s pupil in A Coruña, where the family moved in 1891. From that point his ability to experiment with what he learned and to develop new expressive means quickly allowed him to surpass his father’s abilities. In A Coruña his father shifted his own ambitions to those of his son, providing him with models and support for his first exhibition there at age 13.\n\nThe family moved to Barcelona in the autumn of 1895, and Pablo entered the local art academy (La Llotja), where his father had assumed his last post as professor of drawing. The family hoped that their son would achieve success as an academic painter, and in 1897 his eventual fame in Spain seemed assured; in that year his painting Science and Charity, for which his father modeled for the doctor, was awarded an honourable mention in Madrid at the Fine Arts Exhibition.\n\nBritannica Quiz Artists, Painters, & Architects\n\nThe Spanish capital was the obvious next stop for the young artist intent on gaining recognition and fulfilling family expectations. Pablo Ruiz duly set off for Madrid in the autumn of 1897 and entered the Royal Academy of San Fernando. But finding the teaching there stupid, he increasingly spent his time recording life around him, in the cafés, on the streets, in the brothels, and in the Prado, where he discovered Spanish painting. He wrote: “The Museum of paintings is beautiful. Velázquez first class; from El Greco some magnificent heads, Murillo does not convince me in every one of his pictures.” Works by those and other artists would capture Picasso’s imagination at different times during his long career. Goya, for instance, was an artist whose works Picasso copied in the Prado in 1898 (a portrait of the bullfighter Pepe Illo and the drawing for one of the Caprichos, Bien tirada está, which shows a Celestina [procuress] checking a young maja’s stockings). Those same characters reappear in his late work—Pepe Illo in a series of engravings (1957) and Celestina as a kind of voyeuristic self-portrait, especially in the series of etchings and engravings known as Suite 347 (1968).\n\nPicasso fell ill in the spring of 1898 and spent most of the remaining year convalescing in the Catalan village of Horta de Ebro in the company of his Barcelona friend Manuel Pallarès. When Picasso returned to Barcelona in early 1899, he was a changed man: he had put on weight; he had learned to live on his own in the open countryside; he spoke Catalan; and, most important, he had made the decision to break with his art-school training and to reject his family’s plans for his future. He even began to show a decided preference for his mother’s surname, and more often than not he signed his works P.R. Picasso; by late 1901 he had dropped the Ruiz altogether.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn Barcelona Picasso moved among a circle of Catalan artists and writers whose eyes were turned toward Paris. Those were his friends at the café Els Quatre Gats (“The Four Cats,” styled after the Chat Noir [“Black Cat”] in Paris), where Picasso had his first Barcelona exhibition in February 1900, and they were the subjects of more than 50 portraits (in mixed media) in the show. In addition, there was a dark, moody “modernista” painting, Last Moments (later painted over), showing the visit of a priest to the bedside of a dying woman, a work that was accepted for the Spanish section of the Exposition Universelle in Paris in that year. Eager to see his own work in place and to experience Paris firsthand, Picasso set off in the company of his studio mate Carles Casagemas (Portrait of Carles Casagemas [1899]) to conquer, if not Paris, at least a corner of Montmartre."}]}