{"Heinz Christian Pander is best known for his work on the development of chick embryos.": [{"url": "https://embryo.asu.edu/pages/christian-heinrich-pander-1794-1865", "page_content": "Christian Heinrich Pander, often remembered as the father of embryology, also explored the fields of osteology, zoology, geology, and anatomy. He was born in Riga, Latvia, on 24 July 1794. Pander, with an eclectic history of research, is best remembered for his discovery and explanation of the structure of the chick blastoderm, a term he coined. In doing so, Pander was able to achieve the goal set forth by his teacher, Ignaz Döllinger, to reinvigorate the study of the chick embryo as a means of further exploring the science of embryology as a whole. His findings paved the way for the work of Karl Ernst von Baer, who would later revolutionize the field of embryology with his research.\n\nPander initially studied in the local schools of his hometown, Riga, and eventually enrolled in the University of Dorpat in 1812. While studying there, Pander attempted to pursue an education in both medical science as well as natural history. It was during this time that Pander began to work with an anatomist named Karl Friedrich Burdach who had previously taught Karl Ernst von Baer. Pander left Dorpat in 1814 and traveled to Germany. It was there in 1816 that Pander met von Baer, who convinced him to study at the University of Würzburg under the tutelage of Ignaz Döllinger. Pander agreed and traveled to Würzburg where he received his MD in 1817. It was also here that he published his dissertation, Historia Metamorphoseos Quam Ovum Incubatum Prioribus Quinque Diebus Subit, a study of the components of the chick embryo including detailed illustrations by Eduard Joseph d’Alton.\n\nDuring his work at the University of Würzburg, Pander discovered the blastoderm of the chick embryo. The blastoderm is the outermost cellular layer of the embryo, which Pander believed contributed greatly to embryonic development. He studied the blastoderm’s role in early embryonic development, describing the outer, middle, and inner layers in detail while only being able to conclude that the development of blood vessels occurred in the middle layer and that important events of embryonic development followed thereafter. Despite the lack of in-depth conclusions, Pander’s discovery and recognition of the blastoderm as well as the layered structure of the embryo provided invaluable information and guidance to his colleagues as well as future embryologists, including von Baer.\n\nDespite promising early research, Pander did not pursue further work in the study of chick embryos or embryology in general. After he obtained his MD and published his dissertation, Pander began traveling through Europe visiting science museums and continuing his work of observation in the fields of biology, paleontology, and geology. His primary goal in doing so was to visit and study the newest and most intricate fossils and skeletons discovered in different parts of the world. Pander eventually began to publish a series of works on osteology, the study of bones, collaborating once again with E. J. d’Alton. Pander became a member of the Academy of Sciences in St. Petersburg in 1821 and a member of the St. Petersburg Zoological Academy in 1826. For the remainder of his life, Pander lived mainly in his estate near his hometown of Riga while still taking time to travel and continue his work in the fields of geology and paleontology, though none of his later work gained significant recognition. Pander died on 22 September 1865 in St. Petersburg. Though somewhat inconclusive, Pander’s work with chick embryos and their components marked the beginning of a more advanced understanding of embryology."}, {"url": "https://www.wikiwand.com/en/Heinz_Christian_Pander", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Heinz Christian Pander?\n\nSummarize this article for a 10 years old"}, {"url": "https://infogalactic.com/info/Heinz_Christian_Pander", "page_content": "From Infogalactic: the planetary knowledge core\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist.\n\nBiography\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.[2][3] His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.[4] Pander is credited as the first scientist to describe primitive creatures known as conodonts.[5][6]\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.[7]\n\nHe died in Saint Petersburg.\n\nEponyms\n\nPander's eponyms are:\n\nSelected writings\n\nBeiträge zur Entwickelungsgeschichte des Hühnchens im Eye , (Contributions to the embryology involving the chick egg), (1817).\n\n, (Contributions to the embryology involving the chick egg), (1817). Beiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions on the natural history of the Baltic regions) Dorpat, (1820).\n\n, (Contributions on the natural history of the Baltic regions) Dorpat, (1820). Vergleichende Osteologie (Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Beiträge zur geognosie des russischen reiches , (Contributions to the geology of the Russian Empire), 1830.\n\n, (Contributions to the geology of the Russian Empire), 1830. Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856).\n\n(Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856). Ueber die Placodermen des devonischen Systems , (On placoderms of the Devonian system), 1857.\n\n, (On placoderms of the Devonian system), 1857. Über die ctenodopterinen des devonischen systems , 1858\n\n, 1858 Über die saurodipterinen, dendrodonten, glyptolepiden und cheirolepiden des devonischen systems, 1860.[8]\n\nSee also"}, {"url": "https://prabook.com/web/christian.heinrich_pander/2506963", "page_content": "Christian Heinrich Pander\n\nbiologist explorer paleontologist Zoologist\n\nJuly 24, 1794 (age 71) Riga, Latvia\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander\"s concept of germ layers to include all vertebrates. Pander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective \"Panderian\", first used by the Canadian palaeontologist, Elkanah Billings. Pander is credited as the first scientist to describe primitive creatures known as conodonts. Today the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts. He died in Saint St. Petersburg. Pander\"s eponyms are: Pander\"s islands or blood islands."}, {"url": "https://dbpedia.org/resource/Heinz_Christian_Pander", "page_content": "Christian Heinrich von Pander, auch Heinz Christian Pander, lettisch Kristiāns Heinrihs fon Panders (* 12. Julijul. / 23. Juli 1794greg. in Riga; † 10. Septemberjul. / 22. September 1865greg. in St. Petersburg), war ein deutschbaltischer Mediziner, Embryologe, Zoologe und Paläontologe. Er entwickelte das revolutionäre Keimblattmodell als grundlegendes Modell in der Embryologie, beschäftigte sich mit „Evolution“ und interpretierte erstmals Conodonten, rätselhafte Leitfossilien, als Wirbeltiere. (de)\n\nHeinz Christian Pander (* Riga, 24 de julio de 1794-1865) fue un biólogo ruso de formación alemana. Junto con Karl Ernst von Baer y Rathke es considerado uno de los fundadores de la embriología moderna. Pasó a la historia como el descubridor de las tres capas germinales que se forman durante la embriogénesis. (es)\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist. (en)\n\nChristian Heinrich von Pander (en letton Kristiāns Heinrihs fon Panders ; né le 23 juillet 1794 à Riga ; † 22 septembre 1865 à Saint-Pétersbourg) est un embryologiste zoologue et paléontologue germano-balte. Il imposa l’hypothèse révolutionnaire de « feuillet embryonnaire » comme principe de base de l'Embryologie, précisa les hypothèses de la Théorie de l'évolution et proposa la première interprétation satisfaisante de l'énigme des « conodontes ». Quoique aujourd'hui méconnu, Pander compte au nombre des plus originaux penseurs du début du XIXe siècle. Son hypothèse fondamentale en embryologie, qui posa en principe dès les années 1820 l’évolution illimitée des espèces, reste aujourd'hui valable, et a servi de socle aux recherches sur les poissons du paléozoïque et les placodermes. (fr)\n\nクリスティアン・パンダー、クリスティアーン・ハインリヒ・パンダー（ロシア語: Христиан Иванович (Генрих) Пандер, Christian Heinrich Pander, 1794年7月23日 リーガ - 1865年9月22日 ペテルブルク）は、ラトビア出身の動物学者。レオポルディーナ加盟。 鶏の胚発生の研究によってよく知られており、発生学の創設者の一人とされる。 示準化石として重要なコノドント（英: Conodont）の最初の報告者。そのため、コノドントの研究を専門とする英国パンダー協会は、最初の記述者であるパンダーにちなんで名付けられている。 Panderは、植物の学名で命名者を示す場合にクリスティアン・パンダー (動物学者)を示すのに使われる。（命名者略記を閲覧する／IPNIでAuthor Detailsを検索する。） (ja)\n\nHeinz Christian Heinrich Pander (Riga, 23 luglio 1794 Cal.greg. – San Pietroburgo, 22 settembre 1865 Cal.greg) è stato un medico tedesco. Naturalista dell'ambasciata russa di Bukhara, nel 1823 divenne membro dell'Accademia delle scienze di San Pietroburgo. Insieme a Martin Heinrich Rathke e Karl von Baer è considerato uno dei padri dell'embriologia; fu inoltre un grande luminare dell'osteologia comparata. Nel 1857 l'Accademia russa delle scienze gli assegnò il Premio Demidoff. (it)\n\nChristian I. Pander (ur. 1794, zm. 1865) – rosyjski embriolog, paleontolog i anatom pochodzenia niemieckiego. (pl)\n\nHeinz Christian Pander (Riga, 24 de julho de 1794-1865) foi um biólogo russo. Junto com karl Ernst von Baer e Martin Heinrich Rathke é considerado um dos fundadores da embriologia moderna. As pesquisas de Pander sobre o desenvolvimento dos pássaros foram fundamentais para o triunfo do epigenetismo sobre o preformismo. Pander foi o primeiro que formulou a teoria dos folhetos embrionários, introduzindo o próprio termo \"folheto embrionário\" (\"Keimblatt\"), assim como o termo \"\" (\"Keimhaut\"). Além disso, Pander descreveu numerosas formações geológicas da era primária e identificou vários grupos de fósseis. Ambas as linhas de investigação eram para Pander manifestações de um mesmo fenômeno: a metamorfose dos seres orgânicos, manifestada tanto no desenvolvimento individual como na transformação das espécies. Foi, portanto, o primeiro naturalista em estabelecer um pararelismo entre o desenvolvimento ontogenético, a filogenia e o registro paleontológico. Embora não compreendida totalmente na sua época, a obra embriológica de Pander foi em geral muito bem recebida, considerando-se a mais importante desde a de Wolff. Sua obra \"Vergleichende Osteologie\" foi também bem recebida - Goethe a descreve laudatoriamente em sua \"Morfologia\" (1822) - e foi muito conhecida ao longo de todo o século XIX. (pt)\n\nChristian Heinrich (eller Heinz Christian) Pander, född den 12 juli 1794 i Riga, död den 10 september 1865 i Sankt Petersburg, var en balttysk zoolog. Pander började i Würzburg undersökningar över djurens utveckling, som väckte stort uppseende och bildade utgångspunkten för en lång rad senare undersökningar, Historia metamorphoseos, quam ovum incubatum prioribus quinque diebus subit (1817), Beiträge zur Entwicklungsgeschichte des Hühnchens im Ei (samma år). År 1820 deltog han i expedition till Buchara, blev 1823 ledamot av akademien i Petersburg, men tog redan 1827 avsked och bosatte sig på sitt gods i Livland. Han anställdes emellertid 1842 åter i statens tjänst. Pander skrev även mycket betydande geologiska och paleontologiska arbeten. (sv)\n\nХристиан Иванович Па́ндер (или Христиан Генрих; латыш. Kristians Panders, нем. Christian Heinrich Pander;23 июля 1794, Рига — 22 сентября 1865, Санкт-Петербург) — балтийский немец, русский естествоиспытатель, палеонтолог и эмбриолог. (ru)"}, {"url": "https://www.liquisearch.com/heinz_christian_pander", "page_content": "Heinz Christian Pander, also Christian Heinrich Pander (24 July 1794 – 22 September 1865), was a Baltic German biologist and embryologist born in Riga.\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the St. Petersburg Academy of Sciences.\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, and was the first scientist to describe primitive creatures known as conodonts. He also conducted extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.\n\nHe died in Saint Petersburg."}, {"url": "https://www.jove.com/v/5153/an-introduction-to-the-chick-gallus-gallus-domesticus", "page_content": "The developing chicken, or chick, formally known as Gallus gallus domesticus, is an important model system for biomedical research. Within each chicken egg is an embryo that can be subjected to genetic and embryological manipulations. Such experimentation is relevant to human health and disease, because of the similarities between human and chick genomes. This video covers an overview of the chick model system, some key discoveries made in chick, and a few exciting examples of how they are used in labs today.\n\nBefore talking about the chick’s scientific value, let’s review some basic chicken biology. Like reptiles and mammals, Gallus gallus belong to the vertebrate clade Amniota, defined by the presence of extraembryonic membranes that support embryo development. The evolution of this system of membranes within the egg allowed the ancestral amniote to inhabit a land environment millions of years ago, which pretty much proves that it was the egg that came first! Within the class Aves, chickens belong to the Phasianidae family of terrestrial birds, which spend most of their life on land. The birds we know as a tasty food source are in fact a subspecies of Gallus gallus, commonly known as the Red Junglefowl, which inhabits southeast Asia. Today, billions of chickens are raised for meat and egg production all over the world. Clearly these birds are a big part of the human diet, but what do they like to eat? Chickens are omnivores that scour the ground for bugs, seeds, and vegetation. Female chickens, or hens, are especially in need of a good meal since they put a lot of energy into making eggs, which are laid almost every day. If a male is around, you’ll know it; roosters are bigger, more colorful, and a lot louder! When roosters and hens get together to mate, the life cycle begins with internal fertilization. An egg is laid 25 hours later, containing a multicellular embryo. After 21 days of incubation, a chick hatches. Sexual maturity occurs by 31 weeks in most chickens, completing the cycle.\n\nNow, let’s see why this common farm animal is popular in scientific research. First, it is easy to obtain fertilized chicken eggs at a relatively low cost, year-round. Second, developmental experiments can be precisely timed by regulating incubation temperature. Third, since the embryo develops externally, scientists only need to cut a window in the shell to access most developmental stages. The embryos also tolerate experimental manipulations quite well, because the egg white, or albumin, is naturally antibacterial. Last, but certainly not least, the chicken and human genomes are highly conserved. Despite the fact that the chicken genome is about a third of the size of the human’s, it packs a similar number of genes. Of these, 60% correspond to a human gene, and are on average 75% identical to their human counterpart.\n\nNow that we’ve discussed what makes chicks a great model, let’s review some key discoveries made in this system. Chick research dates back to ancient Greece, when Aristotle postulated that the extraembryonic membranes he observed in developing chicken eggs, and the human placenta and umbilical cord, both provide crucial nutrition to the embryo. Many years later, in 1672, Marcello Malpighi first described fundamental vertebrate structures in the developing chicken embryo, such as the neural tube, which forms the nervous system; and the somites, which will give rise to multiple tissues, like skeletal muscle. In 1817, Heinz Christian Pander studied early stage chicken embryos and discovered three primordial layers of cells known as the germ layers. Cells from these layers: the ectoderm, mesoderm, and endoderm, go on to form all of the tissues that make up an organism. For this work, Pander earned the title: The Founder of Embryology. In 1951, Viktor Hamburger and Howard L. Hamilton published a 46 part staging series to identify embryos based on anatomy, from freshly laid eggs to hatching. The Hamburger and Hamilton staging series provides chick biologists with a way to standardize the staging of the embryos they study, cutting down on variables introduced by differing incubation temperatures. Also in the 1950s, Rita Levi-Montalcini discovered a mysterious factor that caused chick neurons to grow when exposed to engrafted mouse tumors. Stanley Cohen helped identify this unknown compound as NGF, or nerve growth factor. For this work, they won the Nobel Prize in 1986.\n\nNow that we’ve discussed how chick research has led to important discoveries, let’s take a look at how chicks are used in labs today. First, chicken embryos are frequently used to track early cell movements. To be able to distinguish cells from their neighbors, scientists transplant cells from other avian species, like the quail, into chick embryos. Using quail-specific markers, the cells are followed over days as they are incorporated into developing structures. Chicks are also extremely useful for studying neuronal patterning. Neural tissue harvested from an embryo can be used to examine axonal tracing, circuitry and even neuronal activity. Lastly, the chorioallantoic membrane, otherwise known as the CAM, is a highly vascularized membrane that is frequently used for cancer research. Chicken embryos are naturally immunodeficient, which allows transplanted human cancer cells to readily commandeer blood vessels within the CAM to establish tumors. The spread of cancerous cells, or metastasis, can be easily studied in this highly useful assay."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1212538", "page_content": "Heinz Christian Pander, aka Christian Heinrich Pander (24 July 1794 - 22 September 1865) was a Baltic German biologist and embryologist who was born in Riga. In 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist, and in 1826 became a member of the St. Petersburg Academy of Sciences.\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer, who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, and was the first scientist to describe primitive creatures known as conodonts. He also did extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings. [2]\n\nSelected writings\n\nBeiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions from the Natural History of the Baltic Regions) Dorpat, (1820).\n\n, (Contributions from the Natural History of the Baltic Regions) Dorpat, (1820). Vergleichende Osteologie (Comparative Osteology) Seven Volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative Osteology) Seven Volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of Fossil Fish from the Silurian Stratum of the Baltic Regions), St. Petersburg, (1856)\n\nReferences\n\n^ Quarterly Journal of the Geological Society 22: i-639 [37]. 10.1144/GSL.JGS.1866.022.01-02.08. Godwin-Austen, H. (1866). \"On the Carboniferous Rocks of the Valley of Kashmere: with Notes on the Brachiopoda collected by Capt. Godwin-Austen in Thibet and Kashmere, by T. Davidson, Esq., F.R.S., F.G.S\".: i-639 [37]. doi ^ http://books.google.com/books?id=ePVjAAAAIAAJ&pg=PA292#v=onepage&q&f=false\n\nPersondata Name Pander, Heinz Christian Alternative names Short description Date of birth 24 July 1794 Place of birth Date of death 22 September 1865 Place of death\n\n\n\n"}, {"url": "https://species.wikimedia.org/wiki/Christian_Heinrich_von_Pander", "page_content": "Christian Heinrich von Pander\n\nChristian Heinrich von Pander also Heinz Christian Pander (24 July 1794 – 22 September 1865), Baltic German biologist, embryologist, and palaeontologist born in Riga.\n\nTaxon names authored\n\n(List may be incomplete)\n\nPublications [ edit ]"}, {"url": "https://embryo.asu.edu/pages/caspar-friedrich-wolff-1734-1794", "page_content": "Caspar Friedrich Wolff is most famous for his 1759 doctoral dissertation, Theoria Generationis, in which he described embryonic development in both plants and animals as a process involving layers of cells, thereby refuting the accepted theory of preformation—the idea that organisms develop as a result of the unfolding of form that is somehow present from the outset, as in a homunculus. This work generated a great deal of controversy and discussion at the time of its publication but was an integral move in the reemergence and acceptance of the theory of epigenesis.\n\nWolff was born in Berlin, Germany, on 18 January 1734 to Anna Sofia Stiebeler and Johann Wolff, a tailor. He studied medicine at the Collegium Medico-Chirurgicum in Berlin from 1753 to 1754 and then enrolled at the University of Halle, graduating in 1759 with his MD. The controversy created by his dissertation, with its assertions challenging the accepted view of preformationism, made it difficult for Wolff to find work. In particular, his hypothesis was opposed by Albrecht von Haller, a strong proponent of the theory of preformation. Wolff attempted to obtain a position at the St. Petersburg Academy of Sciences with the help of Leonhard Euler, but was unsuccessful because many of the members of the Academy disagreed with the epigenetic contentions of his work. Wolff became a field surgeon for the Prussian army in 1761.\n\nDuring his time in the military he gave some lectures at the Breslau Military Hospital on the subject of anatomy. He continued to seek a professorship in Berlin, attempting to obtain permission to lecture in 1762 while still in the army, and again as the Franco-Prussian War was ending, knowing that he would be losing his job at the military hospitals because they were closing. He was denied in both instances by the professors of the Collegium Medico-Chirurgicum. Because he had been denied one university professorship and foresaw more such denials in the future, Wolff began giving private, unsanctioned lectures on anatomy, physiology, and medicine in Berlin in 1763. In 1764 he published another paper, Theorie von der Generation, which responded to the criticism of his dissertation and restated his belief in epigenesis as the most valid theory of generation. This publication further alienated him from the professors at the college and thus did not help in his pursuit of a professorship.\n\nIn 1766, through the tenacity and initiative of Leonhard Euler, Wolff was offered a position in the anatomy department of the St. Petersburg Academy of Sciences, which he promptly accepted. Wolff moved to Russia with his wife in 1767. He finished his career working in Russia, writing thirty-one memoirs that were published in the Academy’s Proceedings. He began work on a final paper, “ Theory of Monsters,” in which he tried to organize his ideas regarding epigenesis, but suffered a brain hemorrhage that caused his sudden death in St. Petersburg on 22 February 1794.\n\nWolff is remembered as a founder of modern embryology due to the publication of his dissertation, which both rejected the idea of preformation and reinvigorated the theory of epigenesis, an updated and well-supported explanation of embryonic development. At the time, the majority of scientists held the theory of preformation as the most probable explanation for the development of organisms. Wolff’s demonstration of the logic and support behind the theory of epigenesis was thus both controversial and revolutionary for the field as a whole. In his dissertation Wolff used the example of a plant root that, despite its differentiated tissues, is able to regenerate a whole new plant if the stem and leaves are removed. This evidence directly invalidated the strongest versions of the theory of preformation, which stated that all parts of an organism were pre-formed in the embryo, development consisting of the unfolding of these parts. He later applied this same approach to the development of animals, providing evidence that the development of organs and extremities came from the growth of embryonic layers, further refuting the theory of preformation.\n\nAfter this work, Wolff continued to work with anatomy, devoting a great deal of time to the study of embryos. He observed the growth of chick embryos and was able to track the development of various organs and extremities. This led to his discovery of the embryonic kidneys, or Wolffian bodies, whose ducts are also named in his honor. While working with the development of embryos of various organisms, Wolff postulated the theory of embryonic layers based on his observation of the proliferation and development of embryonic organs from discrete layers of cells.\n\nWolff desired to further his work in the developmental process of organs and began to develop a theory that could explain how organs develop the way they do from their initial liquid states. This theory focused around the vis essentialis, or essential force, which, he said, allowed for the entrance of vital liquids and nutrients into plants and embryos. He attempted to explain these forces by observing the differences between plants and animals and even between individual organisms, but eventually abandoned this research after deciding that the individual forces he was looking for did not exist but in fact were one universal natural force that affects all organisms. In his final unpublished writings, Wolff moved on to theories of the meaning of the soul and the way the soul manifests itself within a body, but he passed away before these theories gained any real prominence.\n\nWolff is remembered mainly for his work in refuting the theory of preformation and revitalizing discussion about the theory of epigenesis. Through his efforts regarding these theories, Wolff was a pioneer in the study of embryology. His work paved the way for the research of Karl Ernst von Baer as well as Heinz Christian Pander."}], "Heinz Christian Pander described the development of the neural tube in the chick embryo.": [{"url": "https://embryo.asu.edu/pages/christian-heinrich-pander-1794-1865", "page_content": "Christian Heinrich Pander, often remembered as the father of embryology, also explored the fields of osteology, zoology, geology, and anatomy. He was born in Riga, Latvia, on 24 July 1794. Pander, with an eclectic history of research, is best remembered for his discovery and explanation of the structure of the chick blastoderm, a term he coined. In doing so, Pander was able to achieve the goal set forth by his teacher, Ignaz Döllinger, to reinvigorate the study of the chick embryo as a means of further exploring the science of embryology as a whole. His findings paved the way for the work of Karl Ernst von Baer, who would later revolutionize the field of embryology with his research.\n\nPander initially studied in the local schools of his hometown, Riga, and eventually enrolled in the University of Dorpat in 1812. While studying there, Pander attempted to pursue an education in both medical science as well as natural history. It was during this time that Pander began to work with an anatomist named Karl Friedrich Burdach who had previously taught Karl Ernst von Baer. Pander left Dorpat in 1814 and traveled to Germany. It was there in 1816 that Pander met von Baer, who convinced him to study at the University of Würzburg under the tutelage of Ignaz Döllinger. Pander agreed and traveled to Würzburg where he received his MD in 1817. It was also here that he published his dissertation, Historia Metamorphoseos Quam Ovum Incubatum Prioribus Quinque Diebus Subit, a study of the components of the chick embryo including detailed illustrations by Eduard Joseph d’Alton.\n\nDuring his work at the University of Würzburg, Pander discovered the blastoderm of the chick embryo. The blastoderm is the outermost cellular layer of the embryo, which Pander believed contributed greatly to embryonic development. He studied the blastoderm’s role in early embryonic development, describing the outer, middle, and inner layers in detail while only being able to conclude that the development of blood vessels occurred in the middle layer and that important events of embryonic development followed thereafter. Despite the lack of in-depth conclusions, Pander’s discovery and recognition of the blastoderm as well as the layered structure of the embryo provided invaluable information and guidance to his colleagues as well as future embryologists, including von Baer.\n\nDespite promising early research, Pander did not pursue further work in the study of chick embryos or embryology in general. After he obtained his MD and published his dissertation, Pander began traveling through Europe visiting science museums and continuing his work of observation in the fields of biology, paleontology, and geology. His primary goal in doing so was to visit and study the newest and most intricate fossils and skeletons discovered in different parts of the world. Pander eventually began to publish a series of works on osteology, the study of bones, collaborating once again with E. J. d’Alton. Pander became a member of the Academy of Sciences in St. Petersburg in 1821 and a member of the St. Petersburg Zoological Academy in 1826. For the remainder of his life, Pander lived mainly in his estate near his hometown of Riga while still taking time to travel and continue his work in the fields of geology and paleontology, though none of his later work gained significant recognition. Pander died on 22 September 1865 in St. Petersburg. Though somewhat inconclusive, Pander’s work with chick embryos and their components marked the beginning of a more advanced understanding of embryology."}, {"url": "https://link.springer.com/chapter/10.1007/978-981-19-0228-4_2", "page_content": "During the first 3 weeks of development, the three germ layers (ectoderm, mesoderm, and endoderm), which form the basis of the various organs and systems of the body, are established. The second week is characterized by implantation (stage 5) and the formation of the primitive streak (stage 6). The trophoblast differentiates into the cytotrophoblast and the more peripherally situated syncytiotrophoblast that invades the endometrium. Blood-filled spaces, the lacunae, soon develop within the syncytiotrophoblast, which communicate with endometrial vessels and thus lay the foundation for the placental circulation. The embryonic cavity appears between the epiblast and the cytotrophoblast. The embryonic disc is now called the bilaminar embryo (ten Donkelaar et al. 2014a) (Fig. 2.2).\n\nFig. 2.2 Implantation and the formation of the bilaminar embryo: (a) Blastocyte; (b–e) blastocytes of approximately 4.5, 9, 12, and 13 days, respectively. The trophoblast and the cytotrophoblast are indicated in light red, the syncytiotrophoblast is stippled and maternal blood in lacunae is shown in red. AC amnionic cavity, ChC chorionic cavity, eem extra-embryonic mesoderm, lc lacuna, pv primary villi, PUV primary umbilical vesicle, SUV secondary umbilical vesicle (yolk sac), us umbilical stalk. From ten Donkelaar et al. (2014a), with permission Full size image\n\n2.1.1 Gastrulation\n\nDuring the first 2 weeks after fertilization, a bilaminar embryonic disc contained within an amniotic cavity is formed. The outer layer adjacent to the amniotic cavity is called the epiblast, and the inner layer adjacent to the primary yolk sac is the hypoblast. The embryonic disc migrate ventralwards along the median plane and form the primitive (primary) streak. On days 13–15, hypoblastic cells form a prechordal plate that marks the future rostral end of the embryo. In the second week gastrulation occurs, which establishes the third germ layer, mesoderm. The gastrulation, i.e., the development process until the formation of the mesoderm, proceeds as follows (Fig. 2.3). Gastrulation begins with formation of the primitive steak in the caudal region of the epiblast at about day 14 or 15. The primitive streak, a midline caudal thickening in the epiblast, appears. The primitive streak enlarges and elongates and develops a thickening at its rostral end, the primitive node or Hensen’s node. The rostral, usually distinct part of the primitive streak is known as the primitive node of Hensen. The primitive streak is a way of entrance in which cells invaginate, proliferate, and migrate to subsequently form the extra-embryonic mesoderm, the endoderm, and the intra-embryonic mesoderm (ten Donkelaar et al. 2014a). The extra-embryonic mesoderm soon covers the trophoblast, the amniotic ectoderm and the yolk sac. Simultaneously, a central depression, the primitive groove, is developed along the primitive streak to form the primitive pit at the level of Hensen’s node. The proliferating cells from the epiblast migrate into the primitive streak and groove and then move rostrally between the epiblast and hypoblast to form the third embryonic layer, the mesoblast.\n\nFig. 2.3 Gastrulation and primary neurulation stages from development of Hensen’s node on day 13 to closure of anterior neuropore on day 25. Gastrulation is the development process until formation of the mesoderm. Gastrulation begins with formation of the primitive streak in the caudal region of the epiblast. From Flint and Rusbridge (2014), with permission Full size image\n\n2.1.2 Notochordal Formation\n\nOn days 16–17, mesoblastic cells migrate rostrally to Hensen’s node in the midline to form the notochordal process (Fig. 2.4). In the rostral area of the primitive streak, an extension below the ectoderm, the notochordal process, arises from the primitive node and extends rostrally to the prechordal plate. The notochord is a cylindrical structure derived from mesodermal cells that specifies the midline of the embryo. It also serves as inductive signals essential for the formation of the nervous system from the overlying ectoderm. The mesoderm, which originates from the primitive streak, then condenses on both sides of this process. Subsequently, the primitive pit at Hensen’s node extends into the notochordal process and creates a central notochordal canal. The canalized notochordal process is fused with the adjacent ventral entoderm (hypoblast). These two cell layers are degenerated at the fused site to create a longitudinally grooved notochordal plate in the roof of the yolk sac and allowing the notochordal canal to communicate with the yolk sac. From the cranial end, the notochordal plate is then infolded to form the solid notochord. The notochord plays a key role in inducting the overlying ectoderm to form the neural tube and acts as the structure around the mesoderm to form the vertebral column. An important transitory communication between the forms of the amniotic cavity and yolk sac is known as the neurenteric canal. The neurenteric canal is of great importance for development of the spine and spinal cord. Impaired development of notochord and neurenteric canal development are mechanisms that cause complications such as diastematomyelia, neurenteric cyst, and combined anterior and posterior spina bifida (Copp and Greene 2013; Greene and Vopp 2014).\n\nFig. 2.4 On days 16–17, mesoblastic cells migrate rostrally to the Hensen’s node in the midline to form the notochordal process. It serves as inductive signals essential for the formation of the nervous system from the overlying ectoderm. (a) GW 2, (b) GW 3 Full size image\n\n2.1.3 Neurulation\n\nIn humans, the next major step in the development of the spinal cord is around days 20 (the third week) after fertilization. Here, fusion of the opposing neural folds and subsequent formation of the neural tube occurs at the hindbrain-spinal cord junction. This event requires several days and must be coordinated simultaneously at the rostral and caudal ends. Closure of the neural tube takes 4–6 days. After the closure of the neural folds, both ends temporarily remain open and are called neuropores (O’rahilly and Müller 2002) (Fig. 2.5). Neurulation, the process of neural tube formation that will become the spinal cord and brain, occurs during days 18–27. Rostral to Hensen’s node, the ectoderm that covers the notochordal process is initially thickened to form the neural plate. The edges of the neural plate are heaped to create the neural folds and the midline neural groove. Changes occur first in the middorsal region of the embryo, the site of the future cervical cord, and continue to caudal.\n\nFig. 2.5 GW 3 primary neurulation. The open neuroepithelium develops into a closed neuroepithelium. On day 18, the neural plate can be distinguished from the surrounding ectoderm. Within 24 hours of the first appearance of the neural plate, folds appear at their respective edges. Closure of the neural tube takes 4–6 days. Prior to completion of closure, the open ends of the tube form the anterior (cranial) and posterior (caudal) neuropore (a) cross-sectional diagram, (b) dorsal view. From Altman and Bayer (2001) Full size image\n\nThe precursor of spinal cord and brain is the ectodermal thickening called the neural plate (day 18). Within 24 hours after the first appearance of neural plate, the cells of the neural plate proliferate rapidly and form the neural groove by folding the neural plate at the time of appearance of the first mesodermal somites (Sadler 2005) (Fig. 2.6). As the neural plate develops, the mesoderm is condensed on each side of the notochord to form the paired somites. Beginning about day 20, they initially develop rostrally at the region of the future occipital bone and proceed caudally, resulting in up to 44 pairs that extend to the coccygeal level. Finally, the first occipital pair and the caudal 5–7 coccygeal ones will regress.\n\nFig. 2.6 Dorsal views of embryo showing the early stages of gastrulation and neurulation at various days after fertilization. (a) The primitive streak, consisting of a narrow groove, forms in the caudal part of the embryo. At the streak’s cranial end is an elevation, the primary node surrounding a depression, the primitive pit. (b) The neural plate is induced at the cranial end of the embryo and signals the initiation of neurulation. The primitive streak of the cranial end of the embryo remains involved in the process of gastrulation. Thus, gastrulation and neurulation continue simultaneously in the human embryo. (c) The neural plate has now elevated to form the neural folds creating a neural groove in the midline. From Sadler (2005), with permission Full size image\n\nThe neural folds on both sides of the groove gradually gather together to create a neural tube separated from the overlying embryonic sheath. The formation of the most caudal part of the neural tube occurs during days 28–48. Undifferentiated cell mass of the primitive steak caudal to the posterior neuropore develops vacuoles, which fuse to create a neural tube and connect to the rostral neural tube. Cells located at the lateral borders of the neural plate proliferate at the neural folds to form neural crests, for which the cranial, spinal, and autonomic ganglia appear (Watson et al. 2009).\n\nDays 22–23 marks a deepening of the neural groove and convergence of the neural folds in the dorsal midline to create the neural tube. Several factors contribute to the complex event of embryonic folding, not only along the midline, but also in a dorsoventral orientation, which eventually closes and forms the neural tube. Cell intercalation in the embryonic midline leads to a narrowing along the medial-lateral axis (convergence) and concomitant rostrocaudal lengthening (extension) (Keller et al. 2008). Somites first arise at stage 9 in longitudinal rows on each side of the neural groove. The first four pairs of somites belong to the occipital region. Within the next 10 days subsequently 8 cervical, 12 thoracic, 5 lumbar, 5 sacral, and some 3–6 coccygeal somites are formed, but they are never visible together at one stage of development (ten Donkelaar et al. 2014a). Closure of the neural groove begins initially at the region of the third or fourth somite, the future cervicomedullary junction, and continues both rostrally and caudally at the same time. Rostrally and caudally, the cavity of the developing neural tube communicates via the rostral and caudal neuropores with the amniotic cavity. At days 24–25, the neural tube completes its rostral closure at the anterior neuropore within a few hours, which becomes the site of the lamina terminalis for the development of the brain vesicle. On days 26–27, caudal closure of the neural tube occurs at the posterior neuropore, corresponding to the L1/L2 segment of the spinal cord. The closure of the neural tube in human embryos is generally described as a continuous process that begins at the level of the future cervical region, and proceeds both rostrally and caudally. This process of neural tube closure and extension of the spinal cord to S4/S5 is called primary neurulation (Fig. 2.7). The more caudal cord segments do not develop by neurulation but later by the process of canalization. Unlikely more rostral elements of the spinal cord, the conus medullaris and the film terminals form through the process of secondary neurulation. The secondary neurulation is described as the event in which more caudal levels of the spinal cord are generated by connection and fusion of mesodermal cells (Sadler 2005). The neural tube caudal to the midsacral region is continuous with the caudal end of the primary neural tube but forms by a distinct process, termed secondary neurulation (Copp and Greene 2013). Secondary neurulation is the continuing formation of the sacrocaudal part of the spinal cord without direct involvement of the surface ectoderm, i.e., without the intermediate phase of a neural plate (O’Rahilly and Müller 2006). This process involves condensation of a population of tail bud-derived mesenchymal cells to form an epithelial rod that undergoes canalization to form the lumen of the tube in the lower sacral and coccygeal regions. Secondary neurulation involves only the formation of the most caudal part of the conus medullaris, the filum terminale and a focal dilatation of the central canal, known as the ventriculus terminalis. Malformations resulting from disturbance of secondary neurulation are closed (skin covered) and often involve tethering of the spinal cord, with associated ectopic lipomatous material (Greene and Vopp 2014) (Fig. 2.8c).\n\nFig. 2.7 On days 25–28, caudal closure of the neural tube occurs at the posterior neuropore. This process of neural tube closure and extension of the spinal cord to S4/S5 is called primary neurulation. (a) Closure of the anterior neuropore is completed on day 25. (b) Closure of the posterior neuropore is completed on day 28. From Sadler (2005), with permission Full size image\n\nFig. 2.8 Diagrammatic representation of the developmental origin of malformations broadly classified as neural tube defects in humans. (a, b) Disorders of primary neurulation include craniorachischisis (a) in which the neural tube fails to initiate closure, leaving most of the brain and the entire spine open (b), generating exencephaly/anencephaly and open spina bifida (myelomeningocele), respectively. (c) Disorders of secondary neurulation comprise failure of the neural tube to separate completely from adjacent tissues, resulting in tethering and diminished mobility. The spinal cord is covered by skin and is often associated with fatty tissue accumulation (lipoma) through as-yet-unknown mechanisms. (d) Postneurulation defects can arise when the bony structure of the skeleton fails to develop fully. Herniation of the meninges, with or without brain tissue, through a skull defect, generates encephalocele, while an analogous defect in the spinal region produces meningocele. From Greene and Vopp (2014), with permission Full size image\n\nThe progressive closure of the neural tube completes the basic form of the spinal cord when the last somites occur about 30 days of gestation, with the embryo being 4 mm in length. The rostral neuropore closes completely at about 30 days (stage 11) within a few hours, and caudal neuropore about 1 day later (stage 12). An opening in the central canal of the tube, the posterior neuropore, is normally closed by this time. The median and lateral hinge points are necessary for the proper folding and closing of the neural tube, and a number of neural tube closure defects along the embryo can lead to abnormalities in the spinal cord. Depending on the position of the defect, it can range from anencephaly to craniorachischisis, lumbosacral spina bifida, or spinal dysraphism and encephalocele (Copp and Greene 2013; Greene and Vopp 2014) (Fig. 2.8)."}, {"url": "https://link.springer.com/article/10.1007/BF00315078", "page_content": "The differentiation of the presumptive neural plate, the neural plate and the neural tube have been investigated in the chick embryo by SEM, TEM and histochemical techniques. The relationship of these tissues to neighbouring structures, including extracellular materials, has also been studied.\n\nWhen SEM micrographs of primitive streak stage embryos were examined in stereo, it was found that cells which had been invaginating at the time of fixation were similar in shape to fibroblasts migrating in vitro. It was concluded that SEM stereo pairs could provide evidence about the mode and direction of cell migration.\n\nMany more mid-bodies have been found associated with the developing neural tissue than with the lateral ectoderm. It was found possible to recognise mid-bodies not only by TEM but also by SEM. It is therefore proposed that SEM montages may be used for assessing which regions of a tissue have recently undergone extensive mitosis.\n\nThe beads on the specialised threads seen in the early stages of development are now considered to be formed from mid-bodies. Similar, but unbeaded threads have been described which span the gap between the neural folds just prior to the dorsal closure of the neural tube and it seems probably that these threads help to close the neural tube. It is suggested that the beaded threads arise by incomplete separation of two daughter cells at mitosis, whereas the unbeaded threads form by outgrowth of cell processes."}, {"url": "https://link.springer.com/article/10.1007/s00429-004-0421-2", "page_content": "In avian and mammalian embryos, the neural tube forms through two distinct phases, primary and secondary neurulation. During primary neurulation, the lateral ends of the neural plate elevate and fuse with each other to form the primary neural tube. Subsequent to closure of the posterior neuropore (the last part of the primary neural tube to be fused), the secondary neural tube develops by elongation and cavitation of the tail bud. This process is called secondary neurulation (Griffith et al. 1992, O’Rahilly and Müller 1994, Colas and Schoenwolf 2001). Development of the posterior neural tube (PNT), which develops into the future lumbar, sacral, coccygeal, and equinal cord, is a rather complicated process because it involves both primary and secondary neurulation. In human embryos, closure of the posterior neuropore occurs at the upper sacral level during Carnegie stage 12 (CS12) (Müller and O’Rahilly 1987, Nakatsu et al. 2000). Because of slow growth of the neural tube relative to that of vertebrae, the junction of the primary and secondary neural tubes is apposed at the lumbosacral level of the vertebral column in neonates (O’Rahilly and Müller 2003). The tail bud is an aggregate of undifferentiated mesodermal cells at the caudal end of the embryo, and it gradually replaces the primitive streak between CS12 and 13. It has a potential to give rise to a variety of tissues, including the caudal portions of the digestive tube, coelom, blood vessels, notochord, somites, and spinal cord in human embryos (O’Rahilly and Müller 1994).\n\nDisorders of primary and secondary neurulation can lead to various forms of neural tube defects (NTD), which are among the most common human congenital malformations, affecting 0.5–8/1,000 live births (Little and Elwood 1992). Failure of the anterior and posterior neuropores to close results in exencephaly/anencephaly and myeloschisis, respectively. Myeloschisis occurs most frequently at the lumbosacral level of the vertebral column (Dryden 1980), which corresponds to the junctional region of the primary and secondary neural tubes in neonates (O’Rahilly and Müller 2003). Moreover, it has been suggested that skin-covered NTD such as diplomyelia are caused by aberrant cavitation below the lower lumbar level of the spinal cord, which corresponds to the PNT (Dryden 1980, Lemire 1988). In addition, it has been recently reported that decreased occurrence of NTD by folate supplementation to pregnant women can be explained primarily by the decrease in spina bifida (spinal NTD), which results from defects of PNT (Stevenson et al. 2000, Honein et al. 2001, Williams et al. 2002). Therefore, normal development of the PNT needs to be examined to understand the pathogenesis of spinal NTD.\n\nDevelopment of the PNT has been most extensively studied in chick embryos. Multiple cavities are formed at the beginning of cavitation in the medullary cord, which differentiates from the tail bud (Criley 1969, Schoenwolf 1979, Schoenwolf and Delongo 1980). Enlargement and subsequent coalescence of the cavities result in a single cavity, which eventually becomes continuous with the central cavity of the primary neural tube. At the level of the posterior neuropore, there is an overlapping zone where primary neurulation occurs dorsally and secondary neurulation ventrally. On the other hand, development of the PNT in mice appears simpler than that in chicks (Hughes and Freeman 1974, Schoenwolf 1984, Nievelstein et al. 1993). Multiple cavities are not formed during the course of its development. Instead, the cavity of the primary neural tube extends continuously into the “medullary rosette,” which consists of elongated tail bud cells around the cavity. There is no overlapping zone of the primary and secondary neural tubes. Such difference between species in the PNT development may account for the higher incidence of lumbosacral myeloschisis in chicks compared with mice under various experimental conditions (Hughes and Freeman 1974, Schoenwolf 1979).\n\nDevelopment of the human PNT is not fully understood. Müller and O’Rahilly (1987, 1988) observed that the cavity of the fully formed primary neural tube extends continuously into the tail bud. The cavity in the tail bud was surrounded by radially-arranged cells that are similar to the “medullary rosette” in mice. No isolated cavities were observed during secondary neurulation in human embryos. They also showed that there was no overlapping zone of the primary and secondary neural tubes. These observations suggest that development of the PNT in human embryos is similar to that in mice rather than to that in chicks. On the other hand, some other investigators claimed that multiple cavities were present in the human PNT as observed in the chick PNT (Bolli 1966, Lemire 1969, Hughes and Freeman 1974, Saraga-Babic et al. 1995). The developmental mechanism of the human PNT is controversial partly because human embryo specimens around the stage of posterior neuropore closure have only rarely been available to date.\n\nThe Kyoto Collection of Human Embryos (Nishimura 1975, Shiota 1991) has provided us with a unique opportunity to observe in detail a large number of human embryos at the stage of neurulation. In the present study, we histologically examined 20 cases of externally normal human embryos at CS12 and 13 with special reference to development of the PNT. We propose that the developing PNT can be divided into three parts in terms of its relationship with the notochord and the mode of cavitation in the secondary neural tube."}, {"url": "https://link.springer.com/article/10.1007/BF00321132", "page_content": "Altman J, Bayer SA (1981) Development of the brain stem in the rat. V. Thymidine-radiographic study of the time of origin of neurons in the midbrain tegmentum. J Comp Neurol 198:677–716\n\nAltman J, Bayer SA (1982) Development of the cranial nerve ganglia and related nuclei in the rat. Adv Anat Embryol Cell Biol 74:1–90\n\nAltman J, Bayer SA (1984) The development of the rat spinal cord. Adv Anat Embryol Cell Biol 85:1–166\n\nBartelmez GW, Dekaban AS (1962) The early development of the human brain. Contrib Embryol Carnegie Inst 37:13–32\n\nBlechschmidt E (1963) Der menschliche Embryo. Dokumentationen zur kinetischen Anatomie. Schattauer, Stuttgart\n\nBlechschmidt E, Gasser RF (1978) Biokinetics and biodynamics of human differentiation. Principles and applications. Thomas, Springfield, II.\n\nBok ST (1915) Die Entwicklung der Hirnnerven und ihrer zentralen Bahnen. Die stimulogene Fibrillation. Folia Neuro Biol 9:475–565\n\nBolli P (1966) Sekundäre Lumenbildungen im Neuralrohr und Rückenmark memschlicher Embryonen. Inaug. Diss. Zürich, Acta Anat 64:48–81\n\nBossy J (1966) Diverticule télencéphalique de la région du neuropore antérieur chez un embryon humain de 35 mm V.C. Bull Assoc Anat 50:200–210\n\nBossy J (1980) Development of olfactory and related structures in staged human embryos. Anat Embryol 161:225–236\n\nBrocklehurst G (1978) Spina bifida. In: Vinken PJ, Bruyn GW (eds) Handbook of clinical neurology. North-Holland, Amsterdam, 32:519–578\n\nButler H, Juurlink BHJ (1987) An atlas for staging mammalian and chick embryos. CRC, Boca Raton, Florida\n\nBuxton BH (1899) Photographs of a series of section of an early human embryo. J Anat Physiol 33:381–385\n\nCheuk WL, Van de Water TR, Ruben RJ (1978) The fate mapping of the eleventh and twelfth day mouse otocyst: an in vitro study of the sites of origin of the embryonic inner ear sensory structures. J Morphol 157:249–267\n\nCouly GF, Le Douarin NM (1985) Mapping of the early neural primordium in quail-chick chimeras. I. Developmental relationships between placodes, facial ectoderm, and prosencephalon. Dev Biol 110:422–439\n\nCrosby CE, Humphrey T, Lauer EW (1962) Correlative anatomy of the nervous system. Macmillan, New York\n\nD'Amico-Martel A (1982) Temporal patterns of neurogensis in avian cranial sensory and autonomic ganglia. Am J Anat 163:351–372\n\nD'Amico-Martel A, Noden DM (1983) Contributions of placodal and neural crest cells to avian cranial peripheral ganglia. Am J Anat 166:445–468\n\nDaikoku S (1958) Studies on the human foetal pituitary. 2. on the form and histological development, especially that of the anterior pituitary. Tokushima J Exp Med 5:214–231\n\nDavies AM, Lindsay RM (1985) The cranial sensory ganglia in culture: Differences in the response of placode-derived and neural crest-derived neurons to nerve growth factor. Dev Biol 111:62–72\n\nDeol MS (1964) The abnormalities of the inner ear in kreisler mice. J Embryol Exp Morphol 12:485–490\n\nFerrand R (1972) Etude expérimentale des facteurs de la différenciation cytologique de l'adénohypophyse chez l'embryon de poulet. Arch Biol 83:297–371\n\nFerrand R (1973) Origine exclusivement ectodermique de l'adénohypophyse chez la Caille: démonstrations par la méthode des associations tissulaires interspécifiques. CR Soc Biol 167:740–743\n\nFol H (1884) L'anatomie d'un embryon humain d'un peu plus de trois semaines. Rec Méd Suisse Rom 4:177–201\n\nFol H (1884) Description d'un embryon humain de cinq millimètres et six dixièmes. Rec Zool Suisse 1:357–401\n\nGage SP (1905) A three weeks' human embryo, with especial reference to the brain and the nephric system. Am J Anat 4:409–443\n\nGilbert MS (1935) Some factors influencing the early development of the mammalian hypophysis. Anat Rec 62:337–359\n\nGilbert PW (1957) The origin and development of the human extrinsic ocular muscles. Contrib Embryol Carnegie Inst 36:59–78\n\nGoodrum GR, Jacobson AG (1981) Cephalic flexure formation in the chick embryo. J Exp Zool 216:399–408\n\nGould BB, Rakic P (1981) The total number, time of origin and kinetics of proliferation of neurons comprising the deep cerebellar nuclei in the rhesus monkey. Exp Brain Res 144:195–206\n\nHis W (1890) Die Entwickelung des menschlichen Rautenhirns vom Ende des ersten bis zum Beginn des dritten Monats. I. Verlängertes Mark. Leipzig\n\nHis W (1893) Vorschläge zur Einteilung des Gehirns. Arch Anat Entw 172–179\n\nHochstetter F (1939) Über die Entwicklung und Differenzierung der Hüllen des menschlichen Gehirns. Morphol Jahrb 83:359–494\n\nHolmdahl DE (1926) Die erste Entwicklung des Körpers bei den Vögeln und Säugetieren, inkl. dem Menschen, besonders mit Rücksicht auf die Bildung des Rückenmarks, des Zöloms und der entodermalen Kloake nebst einem Exkurs über die Entstehung der Spina bifida in der Lumbosacralregion. II–V. Morphol Jahrb 55:112–208\n\nHolmdahl DE (1934) Neuralleiste und Ganglienleiste beim Menschen. Z Mikr Anat Forsch 36:137–178\n\nIngalls NW (1907) Beschreibung eines menschlichen Embryos von 4:9 mm. Arch Mikr Anat Entw 70:506–576\n\nJacobson AG, Miyamoto DM, Mai S-H (1979) Rathke's pouch morphogenesis in the chick embryo. J Exp Zool 207:351–365\n\nKällén B (1953) On the significance of the neuromeres and similar structures in vertebrate embryos. J Embryol Exp Morphol 1:393–398\n\nKuhlenbeck H (1973) Medulla oblongata (and Pons). Ch. IX vol. 4. In: The central nervous system of vertebrates, vol 4, ch 9. Karger, Basel\n\nKupffer von C (1906) Die Morphogenie des Centralnervensystems. In: Hertwig O (ed) Handbuch der vergleichenden und experimentellen Entwicklungslehre der Wirbeltiere. Fischer, Jena\n\nMcGrath P (1978) Aspects of the human pharyngeal hypophysis in normal and anencephalic fetuses and neonates and their posible significance in the mechanism of its control. J Anat 127:65–81\n\nMcPhee JR, Van de Water TR (1986) Epithelial-mesenchymal tissue interactions guiding otic capsule formation: the role of the otocyst. J Embryol Exp Morphol 97:1–24\n\nMiale I, Sidman RL (1961) An autoradiographic analysis of histogenesis in the mouse cerebellum. Exp Neurol 4:277–296\n\nMorriss-Kay GM (1981) Growth and development of pattern in the cranial neural epithelium of rat embryos during neurulation. J Embryol Exp Morphol 65:225–241\n\nMorriss-Kay GM, Tuckett F, Solursch M (1986) The effects of Streptomyces hyaluronidase on tissue organization and cell cycle time in rat embryos. J Embryol Exp Morphol 98:59–70\n\nMüller F, O'Rahilly R (1983) The first appearance of the major divisions of the human brain at stage 9. Anat Embryol 168:419–432\n\nMüller F, O'Rahilly R (1984) Cerebral dysraphia (future anencephaly) in a human twin embryo at stage 13. Teratology 30:167–177\n\nMüller F, O'Rahilly R (1985) The first appearance of the neural tube and optic primordium in the human embryo at stage 10. Anat Embryol 172:157–169\n\nMüller F, O'Rahilly R (1986a) The development of the human brain and the closure of the rostral neuropore at stage 11. Anat Embryol 175:205–222\n\nMüller F, O'Rahilly R (1986b) Somitic-vertebral correlation and vertebral levels in the human embryo. Am J Anat 177:1–19\n\nMüller F, O'Rahilly R (1987) The development of the human brain, the closure of the caudal neuropore, and the beginning of secondary neurulation at stage 12. Anat Embryol (in press)\n\nNarayanan CH Narayanan Y (1978) Determination of the embryonic origin of the mesencephalic nucleus of the trigeminal nerve in birds. J Embryol Exp Morphol 43:85–105\n\nNoden DM (1986) Origins and patterning of craniofacial mesenchymal tissues. J Craniof Genet Dev Biol [Suppl], 2:15–31\n\nO'Rahilly R (1963) The early development of the otic vesicle in staged human embryos. J Embryol Exp Morphol 11:741–755\n\nO'Rahilly R (1965) The optic, vestibulocochlear, and terminal-vomeronasal neural crest in staged human embryos. In: Rohen JW (ed) Second symposium on eye structure. Schattauer, Stuttgart\n\nO'Rahilly R (1966) The early development of the eye in staged human embryos. Contrib Embryol Carnegie Inst 38:1–42\n\nO'Rahilly R (1973) The early development of the hypophysis cerebri in staged human embryos. Anat Rec 175:511\n\nO'Rahilly R (1983a) The timing and sequence of events in the development of the human endocrine system during the embryonic period proper. Anat Embryol 166:439–451\n\nO'Rahilly R (1983b) The timing and sequence of events in the development of the human eye and ear during the embryonic period proper. Anat Embryol 168:87–99\n\nO'Rahilly R, Muecke EC (1972) The timing and sequence of events in the development of the human urinary system during the embryonic period proper. Z Anat Entwickl Gesch 138:99–109\n\nO'Rahilly R, Müller F (1984a) The early development of the hypoglossal nerve and occipital somites in staged human embryos. Am J Anat 169:237–257\n\nO'Rahilly R, Müller F (1984b) Respiratory and alimentary relations in staged human embryos. New embryological data and congenital anomalies. Ann Otol Rhinol Laryngol 93:421–429\n\nO'Rahilly R, Müller F (1985) The origin of the ectodermal ring in staged human embryos of the first 5 weeks. Acta Anat 122:145–157\n\nO'Rahilly R, Müller F (1986) The meninges in human development. J Neuropath Exp Neurol 45:588–608\n\nO'Rahilly R, Müller F (1987) Developmental Stages in Human Embryos, Including a Revision of Streeter's “Horizons” and a Survey of the Carnegie Collection. Carnegie Inst Wash Publication 637\n\nO'Rahilly R, Müller F, Hutchins GM, Moore GW (1984) Computer ranking of the sequence of appearance of 100 features of the brain and related structures in staged human embryos during the first 5 weeks of development. Am J Anat 171:243–257\n\nO'Rahilly R, Müller F, Hutchins GM, Moore GW (1987) Computer ranking of the sequence of appearance of 73 features of the brain and related structures in staged human embryos during the sixth week of development. Am J Anat 180:69–86\n\nPadget DH (1948) The development of the cranial arteries in the human embryo. Contrib Embryol Carnegie Inst 32:205–261\n\nPadget DH (1957) The development of the cranial venous system in man, from the viewpoint of comparative anatomy. Contrib Embryol Carnegie Inst 36:79–140\n\nPeach R, Koch WE (1977) Morphological observation on mammalian neural crest. J Anat 123:249\n\nPearson AA, Sauter RW, Herrin GR (1964) The accessory nerve and its relation to the upper spinal nerves. Am J Anat 114:371–391\n\nPolitzer G (1956) Die Entstehung des Ganglion acusticum beim Menschen. Acta Anat 26:1–13\n\nRhines R, Windle WF (1941) The early development of the fasciculus longitudinalis medialis and associated neurons in the rat, cat and man. J Comp Neurol 75:165–189\n\nSchoenwolf GC (1977) Tail (end) bud contributions of the posterior region of the chick embryo. J Exp Zool 201:227–245\n\nSchoenwolf GC (1984) Histological and ultrastructural studies of secondary neurulation in mouse embryos. Am J Anat 169:361–376\n\nSchoenwolf GC, Nichols DH (1984) Histological and ultrastructural studies on the origin of caudal neural crest cells in mouse embryos. J Comp Neurol 222:496–505\n\nSeinsch W (1976) Der “Surface-Coat” embryonaler Hohlräume (Rathke-Tasche und Neuralrohr) der Maus. Acta Anat 95:537–544\n\nSmits-van Prooije AE (1986) Processes involved in normal and abnormal fusion of the neural walls in murine embryos. Profeschrift, Leiden\n\nStreeter GL (1904) The development of the cranial and spinal nerves in the occipital region of the human embryo. Am J Anat 4:83–116\n\nStreeter GL (1918a) The histogenesis and growth of the otic capsule and its contained periotic tissue-spaces in the human embryo. Contrib Embryol Carnegie Inst 7:5–54\n\nStreeter GL (1918b) The developmental alterations in the vascular system of the brain of the human embryo. Contrib Embryol Carnegie Inst 8:5–38\n\nStreeter GL (1942) Developmental horizons in human embryos. Description of age group XI, 13 to 20 somites, and age group-XII, 21 to 29 somites. Contrib Embryol Carnegie Inst 30:211–245\n\nStreeter GL (1945) Developmental horizons in human embryos. Description of age group XIII, embryos about 4 or 5 millimeters long, and age group XIV, period of indentation of the lens vesicle. Contrib Embryol Carnegie Inst 31:27–63\n\nSvajger A, Kostovic-Knezevic L, Bradamante Z, Wrischer M (1985) Tail gut formation in the rat embryo. Wilhelm Roux's Arch 194:429–432\n\nTam PPL (1984) The histogenetic capacity of tissues in the caudal end of the embryonic axis of the mouse. J Embryol Exp Morphol 82:253–266\n\nTam PPL, Kwong WH (1987) A study on the pattern of alkaline phosphatase activity correlated with observations on silver-impregnated structures in the developing mouse brain. J Anat 150:169–180\n\nTello JF (1923) Les differenciations neuronales dens l'embryon du poulet pendant les premiers jours de l'incubation. Trab Lab Invest Biol (Madrid) 21:1–93\n\nTuckett F, Lim L, Morriss-Kay GM (1985) The ontogenesis of cranial neuromeres in the rat embryo. I. A scanning electron microscope and kinetic study. J Embryol Exp Morphol 87:215–228\n\nTuckett F, Morriss-Kay GM (1985) The ontogenesis of cranial neuromeres in the rat embryo. II. A transmission electron microscope study. J Embryol Exp Morphol 88:231–247\n\nVan Campenhout E (1948) La contribution des placodes épiblastiques au développement des ganglions des nerfs crâniens chez l'embryon humain. Arch Biol (Liège) 59:253–266\n\nVan de Water TR, Cheuk WL, Ruben RJ, Shea CA (1980) Ontogenic aspects of mammalian inner ear development. Birth Defects: Original Article Series 16:5–45\n\nVerbout AJ (1971) Die segmentalen Wellen der Chorda dorsalis. Ein intravitales oder ein postmortales Phänomen? Z Anat Entwickl Gesch 133:172–183\n\nVerwoerd CNA, Oostrom CG (1979) Cephalic neural crest and placodes. Adv Anat Embryol Cell Biol 58:1–75\n\nWaterson D (1926) The development of the hypophysis cerebri in man, with a note upon its structure in the human adult. Trans R Soc (Edinb) 55:125–145\n\nWentworth LE (1984a) The development of the cervical spinal cord of the mouse embryo. I. A Golgi analysis of ventral root neuron differentiation. J Comp Neurol 222:81–95\n\nWentworth LE (1984b) The development of the cervical spinal cord of the mouse embryo: II. A Golgi analysis of sensory, commissural, and association cell differentiation. J Comp Neurol 222:95–115\n\nWilson DB (1980) Pattern of proliferation in the hypophysis of the mouse embryo. A quantitative autoradiographic study. Anat Embryol 159:101–113\n\nWilson DB (1983) Early development of the otocyst in an exencephalic mutant of the mouse. Acta Anat 117:217–224\n\nWilson DB, Hendrickx AG (1981) Incorporation of tritiated thymidine in the hypophysis of the rhesus monkey (Macaca mulatta) embryo. J Anat 132:19–28\n\nWindle WF (1932) The neurofibrillar structure of the 7-mm cat embryo. J Comp Neurol 55:99–138\n\nWindle WF (1933) Neurofibrillar development in the central nervous system of cat embryos between 8 and 12 mm long. J Comp Neurol 58:643–723\n\nWindle WF (1970) Development of neural elements in human embryos of four to seven weeks gestation. Exp Neurol [Suppl] 5:44–83"}, {"url": "https://www.nature.com/articles/s41587-020-0525-0", "page_content": "hESC maintenance\n\nNormally karyotyped, mycoplasma-free H9 and H1 hESCs (WiCell), RC17 hESCs (Roslin Cells) and hiPSC line C11 (generated at Lund University by J. Drouin-Ouellet and M. Parmar) were maintained on Matrigel (Corning) coated culture dishes in StemMACS iPS Brew XF medium (Miltenyi Biotec), and passaged with EDTA (0.5 mM) once weekly.\n\nDesign and fabrication of the microfluidic gradient-generating cell culture system\n\nThe microfluidic cell culture system was developed as two main components; (1) the microfluidic cell culture device, containing the hESC (connected by tubing to the external media-containing syringes and waste container), and (2) a device holder with respective holding cassette (Fig. 1a and Supplementary Fig. 1a). The microfluidic device was fabricated in poly(dimethylsiloxane) (PDMS) using soft lithography27, comprising one bottom module with the Matrigel cavity (for cell seeding), and one top module, containing the microfluidic gradient generator and cell culture chamber (Fig. 1a and Supplementary Fig. 1a,b). The serpentine channel gradient generator was designed to produce diffusive mixing of two inlet media under laminar flow in sequentially branching and recombining microfluidic channels11 (Fig. 1a; channel dimensions 200 × 200 μm2). To achieve sufficient spatial resolution to produce minimally overlapping rostro-caudal neural cell fates from forebrain to hindbrain, we designed the cell culture chamber of 20 × 10 × 0.5 mm3 (width × length × height). Furthermore, the length of the gradient (20 mm) is approximately equivalent to the size of a postconception week 8–10 human brain from forebrain to hindbrain.\n\nThe device holders and cassettes, as well as the injection molds for the PDMS modules, were designed using CAD software (AutoCAD 2013/Fusion 360, Autodesk) and fabricated in plastic polyoxymethylene by micro-milling. The resulting design files (*.dxf) were exported to a CAD-CAM-CNC milling machine software (Galaad) to generate tool paths for the milling machine (ICP 4030, ISEL). The PDMS molds were sealed with poly-(methyl-methacrylate) lids, each having an inlet and an outlet to allow for PDMS injection. PDMS (Sylgaard 184 Silicone Elastomer Kit, Dow Corning), was mixed with a curer-to-base mass ratio of 1:10, and then degassed before injected into each mold, followed by curing at 60 °C for 2 h. The resulting solidified PDMS stamps were carefully peeled off and 1.25 mm diameter holes were punched out from the gradient generator PDMS stamp to allow for inlets and outlet tube connections to the device. The PDMS gradient generator and culture chamber stamps were aligned and bonded together28 to seal the microfluidics channels, thus forming the top PDMS module. Briefly, the two PDMS stamps were rolled onto a 10 µm thin layer of uncured PDMS spun onto a glass, then aligned and assembled together. A final curing at 60 °C for 2 h ensured a robust bonding between the two stamps. One mm inner diameter silicone rubber tubes were glued to the inlets and the outlet of the top PDMS module using a silicone rubber glue (Elastosil E47, Wacker) enabling the connection of 1/16-inch Teflon tubing from the syringes and to the outlet waste container. Inlet media were supplied with 10 ml precision GasTight syringes (Hamilton; two syringes per device) mounted on low-pressure, high-precision, pulsating-free neMESYS pumps (Cetoni) to control the inlet flow. A total flow rate of 160 µl h−1 was applied (2 × 80 µl h−1 from each syringe), which we calculated to produce minimal shear stress on the cells (see Supplementary Notes). The microfluidic device was sealed between a bottom holding cassette and a transparent polycarbonate lid, and held by the holder secured with screws (Fig. 1a and Supplementary Fig. 1a).\n\nQuantitative measurement of gradient profile with fluorescein\n\nThe gradient profile in the cell culture chamber was measured using the fluorescence intensity of fluorescein (fluorescein sodium salt, FSS, Sigma-Aldrich) as a surrogate for GSK3i, since they have similar diffusion coefficients, calculated by the Stokes–Einstein equation29:\n\n$${D_{\\mathrm{{FSS}}}^{37^{{\\circ {\\rm{C}}}}} = 7.55\\times 10^{ - 10}{\\mathrm{m}}^{\\mathrm{2}}{{{\\rm{s}}^{-1}}}\\quad D_{\\mathrm{{GSK3i}}}^{37^{{\\circ {\\rm{C}}}}} = 6.60\\times 10^{ - 10}{\\mathrm{m}}^{\\mathrm{2}}{{{\\rm{s}}^{-1}}}}$$\n\nThe entire cell culture chamber (20 × 10 mm2) was imaged using an epifluorescence stereoscope (Olympus SZX) equipped with a cooled CCD camera (XC10, Olympus). Calibration images were acquired from 11 discrete dilutions of FSS in PBS (0, 0.05, 0.10, …, 0.5 µM). Each dilution was separately infused into the microfluidic device (both inlets) to obtain a stable fluorescent signal throughout the entire cell culture chamber. For each fluorescein dilution, ten consecutive 14-bit grayscale images of the fluorescence were obtained (cellSens Entry software, Olympus), before injecting PBS into the microfluidic device to remove all fluorescein residues. For acquisition of gradient images, 0.5 µM fluorescein in PBS (100% concentration) and PBS only (0% concentration) were injected into the microfluidic device, and ten images were acquired after 1 h as a stationary fluorescein intensity gradient was established in the entire chamber. All images (calibration and gradient) were obtained using the same exposure and gain settings and subsequently processed, using an in-house developed image-processing algorithm in MATLAB (Mathworks). Briefly, each set of ten calibration images from the discrete concentrations (0, 10…, 100%) were averaged, assembled into a calibration stack, and an interpolation curve was made for all pixels sharing the same x and y coordinates in the stack. This procedure accommodated for any nonhomogeneous illumination in the imaging setup. For each pixel in the averaged gradient image, the intensity was matched to the intensity of the interpolation curve for the corresponding x,y pixel position in the calibration stack, thus converting the fluorescein pixel-intensity in the gradient image to a concentration value. As we calculated Péclet numbers >1 for both fluorescein and GSK3i, this indicated that their transport was mainly governed by convection and not diffusion. Hence, it was reasonably assumed that the GSK3i gradient profile was similarly linear and maintained across the cell culture chamber as was measured for FSS (Fig. 1b).\n\nAssembly of the microfluidic cell culture system\n\nBefore each experiment, the bottom and top PDMS modules, the polycarbonate lid, the tubing and glass syringes were thoroughly cleaned with deionized water, and all were autoclaved separately. The holding cassette and device holder were sterilized by immersion in ethanol or by extensive ethanol wipe and dried at room temperature in sterile conditions: autoclaving of these parts was avoided to prevent any possible warping. The path from the glass syringes to the microfluidic serpentine was verified to be nonleaking and free of flow obstruction before each experiment.\n\nAll assembly steps were performed inside a cell culture flow hood, with previously sterilized MiSTR parts, to ensure sterility and prevent exposure to microparticles prone to clogging. On the day before initiation of differentiation (day −1), a matrix-bed was prepared by dispensing 200 μl of ice-cold Matrigel into the 1 mm deep cavity of the bottom PDMS module, placed inside the holding cassette (Supplementary Fig. 1a,b). Matrigel was allowed to gel at 37 °C before cell seeding. Undifferentiated hESC colonies were detached using Accutase to yield a single-cell suspension, and 1.0–1.2 × 106 cells were seeded onto the Matrigel bed in 800 μl of pluripotency medium (StemMACS iPS Brew XF) with 10 μM ROCK inhibitor (Y-27632). A sterile, temporary, custom-made PDMS wall was placed around the Matrigel cavity in the bottom PDMS module to contain the single-cell suspension, and the cells were cultured overnight at 37 °C. On day 0, the top PDMS module and attached inlet tubing, were first wetted with sterile Milli-Q water and bubbles flushed out from the whole media path. The same procedure was repeated 2 h later, using a general usage syringe pump (NE-4000, New Era Pump Systems), replacing the water with wash medium (DMEM/F12 supplemented with 5% knock-out serum replacement), while flushing out from the system any bubbles that may have formed. Once the full path (glass syringes, inlet tubing and microfluidic serpentine) was cleared of bubbles, the prepared bottom PDMS module with the seeded cells was brought from the incubator, the temporary PDMS wall was removed and the pluripotency medium was replaced with wash medium. The bubble-cleared top PDMS module was then rapidly assembled onto the bottom PDMS module, both submerged in excess volume of wash medium to prevent any formation of bubbles in the device. The cassette holding the assembled device (with attached inlet tubing and media-filled glass syringes) was then inserted into the MiSTR holder and moved to a 37 °C incubator. To minimize pump-related pressure differences, each pair (or two pairs) of media-containing syringes (0 and 100%) were mounted on a quadruple syringe holder attached on a single syringe pump module on the high-precision neMESYS pumps and the flow of differentiation media was initiated. The outlet tubing was connected to a sterile waste collector inside the incubator, located in a higher position than the MiSTR device to maintain a constant hydrostatic pressure in the outlet channels, thus minimizing bubble nucleation.\n\nDifferentiation of hESCs in MiSTR\n\nDifferentiation in the custom-designed device was performed under a continuous flow (160 μl h−1) of neural patterning medium (NPM) consisting of 1:1 mix of DMEM/F12 (Invitrogen) and NeuroMedium (Miltenyi Biotec), N 2 supplement (1:200; Invitrogen), NeuroBrew-21 without vitamin A (1:100), supplemented with SB431542 (10 μM) and rh-Noggin (100 ng ml−1) (all from Miltenyi Biotec). The NPM medium was devoid of vitamin A (retinol), which is required for the synthesis of RA. One syringe contained medium with added GSK3i (100% side, CHIR99021, Miltenyi Biotec), the other without GSK3i (0%). For ventralizing conditions, it was observed that the addition of SHH-C24II alone was not sufficient for efficient ventralization in the MiSTR setup, although this has previously been shown to be sufficient in static cell culture conditions10. We hypothesized that this might be due to the absorption of SHH-C24II into the PDMS of the cell culture chamber. For efficient ventralization, we therefore added a combination of SHH-C24II (200 ng ml−1) and purmorphamine (0.5 μM, both from Miltenyi Biotec) to the medium of both inlet sides. Syringes were refilled with fresh medium every 2–4 d. On day 9 of differentiation, medium was changed to basal NPM medium without any added factors or GSK3i gradient and kept at 160 μl h−1 until day 14 of differentiation. For 2-d RA gradient experiments, NPM was supplemented with SB431542 (10 μM) and rh-Noggin (100 ng ml−1), and a gradient of 0–200 nM of RA (Sigma-Aldrich). The differentiation protocol for 14-d hindbrain RA gradient experiments was adapted from a previous publication (ref. 30). NPM was supplemented with SB431542 (10 μM) and rh-Noggin (100 ng ml−1) (day 0–10), CHIR99021 (2 μM) (day 0–3), ventralizing factors (+SHH) as described above (day 3–14) and a 0–500 nM gradient of RA from day 3 to day 14. See Supplementary Fig. 3c.\n\nImmunostaining of MiSTR tissue samples\n\nMiSTR tissue samples were fixed in 4% PFA for less than 1 h, washed in PBS and embedded in OCT (Sakura) for cryosection, or stained as whole-mount (strips dissected along the longer axis under a stereoscope). Properly oriented frozen OCT-embedded samples were cryo-sectioned along the longer axis (that is, along the gradient axis) and 14–18 μm thick sections collected on Superfrost Ultra Plus slides (ThermoFisher Scientific). For staining, sectioned and whole-mount samples were washed in PBS and incubated for 1 h in blocking buffer (PBS, 0,1% Triton X-100, 5% donkey serum), whole mounts with agitation. All antibodies were diluted in blocking buffer and incubated with samples overnight at 4 °C. After incubation with primary antibodies, samples were washed extensively in PBS, and then incubated with species-matched, fluorophore-conjugated secondary antibodies (Jackson Laboratories) together with DAPI nuclei counter-stain. Whole mounts were mounted in Vectashield (Vector Laboratories), using coverslip spacers and sealed with nail polish. Cryosections were mounted in PVA-DABCO mounting media. See Supplementary Table 3 for list of primary antibodies.\n\nImaging\n\nImages were obtained using a Leica DMI6000B epifluorescence system (×20 0.7 numerical aperture (NA) dry objective), or standard laser confocal system (Leica TCS SP8 or Zeiss LSM780) equipped with standard laser lines (405, 488, 561 and 633 nm), using ×10 0.3 NA dry, ×40 1.3 NA oil-immersion or ×63 1.2 NA water-immersion objectives. Leica LAS X or Zeiss Zen Black software was used to perform tile scan imaging of large samples, which were stitched into one stack of images. Maximum projections of z-stacks were handled using Fiji (ImageJ, 1.52 h). Uniform histogram corrections were performed using Adobe Photoshop CC, and figures were assembled using Adobe InDesign CC.\n\nReal-time qRT-PCR\n\nMiSTR tissue was subdissected into five equally sized samples using a custom-made standardized cutting tool. Tissue pieces were homogenized with QiaShredder column and RNA was isolated using RNeasy Micro kit (both from Qiagen). Reverse transcription was performed with random hexamer primers and Maxima First Strand cDNA Synthesis Kit (Thermo Scientific) using up to 1 μg of RNA from each sample. The complementary DNA was pipetted together with Sybr green Mastermix (Roche Life Sciences) and primers using the automated pipetting instrument Bravo (Agilent) or a liquid handler I-DOT (Dispendix), and samples were analyzed by real-time quantitative PCR on a LightCycler 480 instrument (Roche Life Sciences) using a two-step protocol with a 60 °C annealing/elongation step. All qRT-PCR samples were run in technical duplicates, and the averaged Ct values were used for calculations. Data are represented using the DDCt method. All fold changes are calculated as the average fold change relative to undifferentiated hESCs, based on two different housekeeping genes (ACTB and GAPDH). See Supplementary Table 4 for a list of primers.\n\nQuantification and statistical analysis\n\nAll qRT-PCR data (fold over undifferentiated hESC/hiPSC) was managed in Excel and statistically analyzed using GraphPad Prism 7 software, P < 0.05 was considered significant. For analysis between A and E regions within one condition and time point, one-way analysis of variance (ANOVA) was performed followed by a Tukey’s multiple comparison test between all regions. All datasets were tested for their normal distribution (Shapiro–Wilk test) and for equal variances (Brown–Forsythe test), and log transformed if needed before ANOVA. In case normal distribution or equal variance were not achieved, a nonparametric Kruskal–Wallis analysis was conducted instead, followed by a Dunnett multiple comparison test. For analysis between dorsal and ventral conditions, and across time points, two-way ANOVA was performed on log transformed data followed by Sidak’s (dorsal versus ventral) or Tukey’s (day 2 versus day 6 versus day 14) multiple comparison test. All multiple comparison tests were corrected using statistical hypothesis testing.\n\nRostral-caudal success exclusion criteria: except for data presented in Fig. 1f,i, and Supplementary Fig. 1d, day 2–14 H9 MiSTR tissues that failed to pass the rostral-caudal success criterion were not used for analysis. Tissues failing this criterion accounted for 17.9% of all experiments (n = 67, see Fig. 1j). Using relative messenger RNA expression data for OTX2 and GBX2 in each experiment, for regions A and E,\n\n(A/E ratio [OTX2] ) > 10-fold AND (E/A ratio [GBX2] ) > 10-fold\n\nLocation of the OTX2-GBX2 border (Fig. 1k): arithmetic calculation between each neighboring region, for each experiment using normalized OTX2 and GBX2 mRNA expression data,\n\n([(OTX2-GBX2 > 0) Region i ) AND ((OTX2-GBX2 < 0) Region i + n )\n\nPeak assessment (Fig. 2b): using the relative mRNA data for all regions A–E, value(s) scored above the 75 percentiles were considered the peak(s) in each experiment. For EN1 and WNT1, the peak difference to the average values (A–E) was 5,960-fold ± 168.5 and 4,852-fold ± 209.8 (mean ± s.e.m.), respectively.\n\nSingle-cell RNA seq of MiSTR tissue\n\nMiSTR tissue was divided into two halves along the gradient, one side used to collect the five A–E samples for mRNA analysis. The other side was dissociated into a single-cell suspension using Accutase (Thermofisher), for day 0, day 1 and day 2 samples, or with Neural dissociation kit (P) on a GentleMACS dissociator (both from Miltenyi Biotec) for day 14 samples. The cells were then frozen in CS10 CryoStor (Stemcell Technologies) and stored at −150 °C until needed. In the meantime, each sample underwent mRNA analysis for quality control selection for scRNAseq. Cryopreserved cells, quality control cleared, were thawed, counted and mixed in equal numbers into a final single-cell suspension of 350–500 cells per μl solution in 0.01% BSA in PBS. For 0 to 48 h tissues, cells from three biological MiSTR tissue replicates were pooled before sequencing. For day 14 tissues, the sequenced samples contained a mix of cells from regions A to E (n = 1–3 biological replicates per region). A total of 9,000–17,000 cells were loaded per lane onto the 10X Chromium (10X Genomics; see Supplementary Table 5) and cDNA libraries were generated according to manufacturer’s instructions. For day 14-ventral cells, each region from three biological replicates were thawed and pooled (in equal proportion) in 0.5% BSA in PBS, and incubated for 30 min with a unique cell hashing antihuman antibody (total of five antibodies: TotalSeq A0251–A0255, BioLegend). Further, cells from five regions were mixed in equal ratios and a total of 25,000 cells were loaded on 10X lane using 10X V3 chemistry Kit. cDNA libraries (barcodes with hashtags and barcodes with mRNA expression) were produced according to the manufacturer’s instructions. cDNA sequencing was performed on a NextSeq 500 (Illumina) according to the manufacturer’s instructions. Preliminary tests did not reveal substantial differences between fresh and frozen cells (data not shown).\n\nProcessing, alignment and analysis of scRNAseq data\n\nRaw sequenced reads from day 0, 24-, 48-h and day 14 dorsal tissues were processed by the 10X Genomics CellRanger2, while day 14 ventral (mRNA) reads were processed by 10X Genomics CellRanger 3.0 pipeline for alignment with the human reference genome (hg19) and generation of count matrices. Day 14 ventral hashtag reads were further processed by CITE-seq-count v.1.4.2 pipeline to generate hashtag count matrices.\n\nDay 0, 24- and 48-h analysis was conducted using R v.3.5.0, and count matrices were then analyzed using the R package of Seurat v.2.3.4 for noise reduction PCA and data visualization. To remove experimental artifacts, cells with a gene count exceeding twice the median of genes per cell were identified as possible doublets and excluded from the analysis using the function FilterCells. To avoid biases toward biological processes related to cell metabolism, ribosomal and mitochondrial genes deleted from raw Seurat matrix using SubsetRow function of Seurat v.2.3.4. Similarly, cell cycle clustering-bias was mitigated by regressing out cell cycle genes (obtained elsewhere31) using the CellCycleScoring and the ScaleData functions from Seurat. Different MiSTR experiment matrices were integrated using the canonical correlation analysis implemented in Seurat v.2.3.4 based on the top 1,000 highly variable genes from dataset, and further aligned using the AlignSubspace function. After integration of datasets, the highly variable genes were recalculated and used as a basis for PCA. Visualization of gene expression was done on the PCA plots of the respective matrices.\n\nDay 14-dorsal MiSTR, mouse gastrulation and prepublished organoids scRNAseq data analysis was conducted using R package Seurat 3.0.2 on R v.3.6.1. Possible doublets (cell outliers with a gene count exceeding twice the median of genes per cell) and cells expressing more than 5% mitochondrial genes and 20% in case of day 14 ventral multiplexed dataset were removed using the Subset function of Seurat 3.0. To remove metabolism based bias ribosomal and mitochondrial genes were deleted from Seurat object and then further Seurat object was subjected to log normalization and cell cycle noise regression using the NormalizeData, CellCycleScoring, ScaleData functions of Seurat 3.0, respectively. To compare mouse gastrulation scRNAseq data (downloaded from https://github.com/MarioniLab/EmbryoTimecourse2018/) with human cell-based MiSTR, the mouse gene names from raw data were mapped to human ortholog gene names using ensemble R package biomaRt_2.42.0 to create matrix containing human ortholog gene names. Further cell annotations from Marioni lab scRNAseq dataset were transferred to a new Seurat object. Day 14-dorsal tissue, mouse E8.5 cells, neural cells from mouse E8.5 and prepublished organoids scRNAseq datasets were integrated using an anchor based integrated strategy32 by implementing functions FindIntegrationAnchors and IntegrateData, respectively, onto preprocessed datasets. In Supplementary Fig. 4f, visualization of tissue clusters from the mouse dataset has been simplified compared to original annotations. Here, ‘Neural’ is a compiled from the following clusters from the mouse E8.5 dataset: neural crest, NMP, spinal cord, forebrain/midbrain/hindbrain and rostral neurectoderm. ‘Mesoderm’ is compiled from: caudal mesoderm, exe mesoderm, paraxial mesoderm, Intermediate mesoderm, pharyngeal mesoderm, somitic mesoderm, mesenchyme, cardiomyocytes and allantois. ‘Endoderm’ is compiled from: def. endoderm, exe endoderm, visceral endoderm and parietal endoderm. ‘Blood/Endothelial’ is compiled from: blood progenitors 1/2, erythroid 1/2/3, endothelium and hematoendothelial progenitors. ‘Nonneural, other’ is compiled from gut, PGC and notochord. Finally, ‘Surface ectoderm’ represents surface ectoderm from the original dataset. For integration of MiSTR 14 d (dorsal) with relevant neural clusters from the mouse E8.5 dataset (Supplementary Fig. 5a), only clusters annotated as ‘forebrain/midbrain/hindbrain’, ‘rostral neurectoderm’ and ‘neural crest’ from the mouse dataset were used.\n\nDay 14-ventral MiSTR cDNA library reads processing and different region cells demultiplexing was done by adding information from hashtag library as separate assay in main Seurat object and further implementing HTODemux function of Seurat 3.0. Clustering for day 14 dorsal (integrated) and ventral dataset was obtained by using modularity-based Louvain clustering algorithm by running Seurat functions FindNeighbours and FindClusters, setting resolution parameter to 0.5. For visualization, UMAP plots were calculated using RunUMAP function of Seurat on the basis of precomputed principal components.\n\nAnnotation of clusters was based on literature search and gene expression patterns from in situ hybridization data available from the Allen Institute for Brain Science (http://developingmouse.brain-map.org/) and from MGI Gene expression database (http://www.informatics.jax.org/expression.shtml), as well as comparison to gene expression patterns from the Mouse Brain Atlas (http://mousebrain.org).\n\nRNA velocity\n\nFor RNA velocity analysis, gene expression count matrices including counts attributed unspliced RNA molecules have been obtained from the aligned reads using the Command Line Interface developed as part of the Velocyto.py package16. Specifically, the tool velocyto run10x has been applied with default arguments and a gtf file corresponding to the human assembly GRCh37 has been passed as annotation. The output loom files comprise a four layered matrix one layer for spliced counts, one for unspliced, one for ambiguous counts and one summing all the counts. Further analysis and preprocessing was carried on using Python library SCANPY33 (https://github.com/theislab/scanpy/tree/dd5b6f759230fc33bd636f20d3e721dfbc1d5966 )\n\nAs a part of our standard analysis, metabolism based bias was removed by deleting mitochondrial and ribosomal genes followed by normalization, log transformation and calculation of variable genes in loaded matrix by using pp.normalize_total and pp.log1p function, respectively. To mitigate cell cycle effect, algorithm based on Seurat 3.2 (individual phase regression) was implemented using tl.score_genes_cell_cycle function followed by dataset integration based on a mutual nearest neighbors approach using the pp.mnn_correct function. The clustering was based on Louvain clustering algorithm with the resolution set to 0.5 followed by visualization on UMAP space and then transferring UMAP coordinates for RNA velocity projections. RNA velocity was computed and visualized through the Python library scVelo Bergen. After reading the full dataset, preliminary data cleanup was carried using the function utilis.cleanup to remove unnecessary information from the loaded object. Filtering and normalization was performed using the function pp.filter_and_normalized with arguments min_shared_counts and n_top_genes, respectively, set to 10 and 3,000. Analogously, possible doublets (cell outliers with a gene count exceeding 2.5 times the median of genes per cell) were excluded from the analysis using the function pp.filter_cells. Further preprocessing was carried using the function pp.moments, which computes moments for velocity estimation. Previously computed UMAP embedding information was then passed to the current object. Subsequently, gene-specific velocities were estimated using the function tl.velocity with the argument mode set to stochastic. The velocity graph was estimated using the function tl.velocity_graph and computed for the given embedding using the function tl.velocity_embedding. Finally, the results were visualized using the function pl.velocity_embedding_. On data visualization, a clearly separated cluster containing cells from all datasets (0, 24 and 48 h) was evident in the bottom right corner of the plot. This cluster contained a mix of OTX2+ and GBX2+ cells and could not be attributed any biological meaning. In light of this, we speculate that this cluster resulted from technical artifacts and these cells were therefore disregarded during data interpretation.\n\nInterrogation of gene expression in OTX2+ and GBX2+ cells from scRNAseq, 0–48 h\n\nMiSTR 0, 24-h ventral, 48-h dorsal and 48-h ventral scRNAseq datasets were analyzed with R v.3.5.3, Seurat v.3.1.2. The four individual samples were filtered for cells expressing gene counts under 5,500, 6,000, 4,000 and 7,000, respectively, and a mitochondrial gene expression under 7, 10, 5 and 8%, respectively. All samples were filtered for gene counts over 200. Each separate sample was processed using NormalizeData, FindVariableFeatures and ScaleData (with individual cell cycle regression) and integrated with batchelor v.1.2.4 fastMNN34 using 15 dimensions and automerge = TRUE. The integrated dataset was subset into five groups (0-, 24-h OTX+, 24-h GBX2+, 48-h OTX+ and 48-h GBX2+). OTX2+ and GBX2+ cells were defined as cells with an expression value of >0 for OTX2 and GBX2, respectively. For each group, positive markers were computed using FindMarkers (listed in Supplementary Table 1). All subsets were individually downsampled to 1,500 cells for visualization with VlnPlot for selected markers.\n\nhESC mesodermal and endodermal differentiation\n\nTo obtain positive controls for testing markers of mesodermal and endodermal differentiation (Supplementary Fig. 1c), H9 hESC were differentiated according to published protocols35,36. In short, H9 hESCs were grow in pluripotency condition until full confluency and then changed to RMPI 1640 medium (Invitrogen) with 1:50 NeuroBrew-21 (Miltenyi Biotec), supplemented with 7.5 μM CHIR99021 (Miltenyi Biotec) for 1 d for mesoderm induction35; or supplemented with 3 μM CHIR99021 on day 1, and with 100 ng ml−1 of Activin A (Prepotech) for another 2 d, for Endoderm differentiation36.\n\nReporting Summary\n\nFurther information on research design is available in the Nature Research Reporting Summary linked to this article."}, {"url": "https://med.libretexts.org/Bookshelves/Anatomy_and_Physiology/Human_Anatomy_(OERI)/11%3A_Nervous_System_and_Nervous_Tissue/11.05%3A_Development_of_the_Nervous_System", "page_content": "By the end of this section, you will be able to: Describe the growth and differentiation of the anterior neural tube into primary and secondary vesicles\n\nRelate the different stages of development of the anterior neural tube to the adult brain regions\n\nDescribe the development of the posterior neural tube into the adult spinal cord\n\nExplain the expansion of the ventricular system of the adult brain from the central canal of the neural tube\n\nThe brain is a complex organ composed of gray parts and white matter, which can be hard to distinguish. Starting from an embryologic perspective allows you to understand more easily how the parts relate to each other. The embryonic nervous system begins as a very simple structure—essentially just a straight line, which then gets increasingly complex. Looking at the development of the nervous system with a couple of early snapshots makes it easier to understand the whole complex system.\n\nMany structures that appear to be adjacent in the adult brain are not connected, and the connections that exist may seem arbitrary. But there is an underlying order to the system that comes from how different parts develop. By following the developmental pattern, it is possible to learn what the major regions of the nervous system are.\n\nNeural Tube To begin, a sperm cell and an egg cell fuse to become a fertilized egg. The fertilized egg cell, or zygote, starts dividing to generate the cells that make up an entire organism. Sixteen days after fertilization, the developing embryo’s cells belong to one of three germ layers that give rise to the different tissues in the body. The endoderm, or inner tissue, is responsible for generating the lining tissues of various spaces within the body, such as the mucosae of the digestive and respiratory systems. The mesoderm, or middle tissue, gives rise to most of the muscle and connective tissues. Finally the ectoderm, or outer tissue, develops into the integumentary system (the skin) and the nervous system. It is probably not difficult to see that the outer tissue of the embryo becomes the outer covering of the body. But how is it responsible for the nervous system? As the embryo develops, a portion of the ectoderm differentiates into a specialized region of neuroectoderm, which is the precursor for the tissue of the nervous system. Molecular signals induce cells in this region to differentiate into the neuroepithelium, forming a neural plate. The cells then begin to change shape, causing the tissue to buckle and fold inward (Figure \\(\\PageIndex{1}\\)). A neural groove forms, visible as a line along the dorsal surface of the embryo. The ridge-like edge on either side of the neural groove is referred as the neural fold. As the neural folds come together and converge, the underlying structure forms into a tube just beneath the ectoderm called the neural tube. Cells from the neural folds then separate from the ectoderm to form a cluster of cells referred to as the neural crest, which runs lateral to the neural tube. The neural crest migrates away from the nascent, or embryonic, central nervous system (CNS) that will form along the neural groove and develops into several parts of the peripheral nervous system (PNS), including the enteric nervous tissue. Many tissues that are not part of the nervous system also arise from the neural crest, such as craniofacial cartilage and bone, and melanocytes. Figure \\(\\PageIndex{1}\\): Early Embryonic Development of Nervous System. The neuroectoderm that forms the neural plate begins to fold inward to form the neural groove. As the two sides of the neural groove converge, they fuse together and form the neural tube, which lies beneath the ectoderm. The anterior end of the neural tube will develop into the brain, and the posterior portion will become the spinal cord. The neural crest which sits laterally to the neural tube develops into peripheral structures. (Image credit: \"Neural Tube Development\" by OpenStax is licensed under CC BY 4.0) At this point, the early nervous system is a simple, hollow tube. It runs from the anterior end of the embryo to the posterior end. Beginning at 25 days, the anterior end develops into the brain, and the posterior portion becomes the spinal cord. This is the most basic arrangement of tissue in the nervous system, and it gives rise to the more complex structures by the fourth week of development.\n\nPrimary Vesicles As the anterior end of the neural tube starts to develop into the brain, it undergoes a couple of enlargements; the result is the production of sac-like vesicles. Similar to a child’s balloon animal, the long, straight neural tube begins to take on a new shape. Three vesicles form at the first stage, which are called primary vesicles. These vesicles are given names that are based on Greek words, the main root word being enkephalon, which means “brain” (en- = “inside”; kephalon = “head”). The prefix to each generally corresponds to its position along the length of the developing nervous system. The prosencephalon (pros- = “in front”) is the forward-most vesicle, and the term can be loosely translated to mean forebrain. The mesencephalon (mes- = “middle”) is the next vesicle, which can be called the midbrain. The third vesicle at this stage is the rhombencephalon. The first part of this word is also the root of the word rhombus, which is a geometrical figure with four sides of equal length (a square is a rhombus with 90° angles). Whereas prosencephalon and mesencephalon translate into the English words forebrain and midbrain, there is not a word for “four-sided-figure-brain.” However, the third vesicle can be called the hindbrain. One way of thinking about how the brain is arranged is to use these three regions—forebrain, midbrain, and hindbrain—which are based on the primary vesicle stage of development (Figure \\(\\PageIndex{2}\\)a).\n\nSecondary Vesicles The brain continues to develop, and the vesicles differentiate further (Figure \\(\\PageIndex{2}\\)b). The three primary vesicles become five secondary vesicles. The prosencephalon enlarges into two new vesicles called the telencephalon and the diencephalon. The telecephalon will become the cerebrum. The diencephalon gives rise to several adult structures; two that will be important are the thalamus and the hypothalamus. In the embryonic diencephalon, a structure known as the eye cup develops, which will eventually become the retina, the nervous tissue of the eye called the retina. This is a rare example of nervous tissue developing as part of the CNS structures in the embryo, but becoming a peripheral structure in the fully formed nervous system. The mesencephalon does not differentiate into any finer divisions. The midbrain is an established region of the brain at the primary vesicle stage of development and remains that way. The rest of the brain develops around it and constitutes a large percentage of the mass of the brain. Dividing the brain into forebrain, midbrain, and hindbrain is useful in considering its developmental pattern, but the midbrain is a small proportion of the entire brain, relatively speaking. The rhombencephalon develops into the metencephalon and myelencephalon. The metencephalon corresponds to the adult structure known as the pons and also gives rise to the cerebellum. The cerebellum (from the Latin meaning “little brain”) accounts for about 10 percent of the mass of the brain and is an important structure in itself. The most significant connection between the cerebellum and the rest of the brain is at the pons, because the pons and cerebellum develop out of the same vesicle. The myelencephalon corresponds to the adult structure known as the medulla oblongata. The structures that come from the mesencephalon and rhombencephalon, except for the cerebellum, are collectively considered the brainstem, which specifically includes the midbrain, pons, and medulla. Figure \\(\\PageIndex{2}\\): Primary and Secondary Vesicle Stages of Development. The embryonic brain develops complexity through enlargements of the neural tube called vesicles. In part a, the primary vesicle stage which happens around 3 to 4 weeks of embryonic development shows three vesicles: the prosencephalon is superior and anterior; the mesencephalon is inferior to the prosencephalon; and rhombencephalon is the most inferior vesicle. In part b, the secondary vesicle stage which happens at 5 weeks of embryonic development shows five regions. From anterior and superior to posterior and inferior, these regions are: telencephalon, diencephalon, mesencephalon, metencephalon and myelencephalon. (Image credit: \"Brain Vesicle Development\" by OpenStax is licensed under CC BY 4.0)\n\nSpinal Cord Development While the brain is developing from the anterior neural tube, the spinal cord is developing from the posterior neural tube. However, its structure does not differ from the basic layout of the neural tube. It is a long, straight cord with a small, hollow space down the center. The neural tube is defined in terms of its anterior versus posterior portions, but it also has a dorsal–ventral dimension. As the neural tube separates from the rest of the ectoderm, the side closest to the surface is dorsal, and the deeper side is ventral. As the spinal cord develops, the cells making up the wall of the neural tube proliferate and differentiate into the neurons and glia of the spinal cord. The dorsal tissues will be associated with sensory functions, and the ventral tissues will be associated with motor functions.\n\nRelating Embryonic Development to the Adult Brain Embryonic development can help in understanding the structure of the adult brain because it establishes a framework on which more complex structures can be built. First, the neural tube establishes the anterior–posterior dimension of the nervous system, which is called the neuraxis. The embryonic nervous system in mammals can be said to have a standard arrangement. Humans (and other primates, to some degree) make this complicated by standing up and walking on two legs. The anterior–posterior dimension of the neuraxis overlays the superior–inferior dimension of the body. However, there is a major curve between the brainstem and forebrain, which is called the cephalic flexure. Because of this, the neuraxis starts in an inferior position—the end of the spinal cord—and ends in an anterior position, the front of the cerebrum. If this is confusing, just imagine a four-legged animal standing up on two legs. Without the flexure in the brainstem, and at the top of the neck, that animal would be looking straight up instead of straight in front (Figure \\(\\PageIndex{3}\\)). Figure \\(\\PageIndex{3}\\): Human Neuraxis. The mammalian nervous system is arranged with the neural tube running along an anterior to posterior axis, from nose to tail for a four-legged animal like a dog. Humans, as two-legged animals, have a bend in the neuraxis between the brainstem and the diencephalon, along with a bend in the neck, so that the eyes and the face are oriented forward. (Image credit: \"Human Neuraxis\" by OpenStax is licensed under CC BY 4.0) In summary, the primary vesicles help to establish the basic regions of the nervous system: forebrain, midbrain, and hindbrain. These divisions are useful in certain situations, but they are not equivalent regions. The midbrain is small compared with the hindbrain and particularly the forebrain. The secondary vesicles go on to establish the major regions of the adult nervous system that will be followed in this text. The telencephalon is the cerebrum, which is the major portion of the human brain. The diencephalon continues to be referred to by this Greek name, because there is no better term for it (dia- = “through”). The diencephalon is between the cerebrum and the rest of the nervous system and can be described as the region through which all projections have to pass between the cerebrum and everything else. The brainstem includes the midbrain, pons, and medulla, which correspond to the mesencephalon, metencephalon, and myelencephalon. The cerebellum, being a large portion of the brain, is considered a separate region. Table connects the different stages of development to the adult structures of the CNS. One other benefit of considering embryonic development is that certain connections are more obvious because of how these adult structures are related. The retina, which began as part of the diencephalon, is primarily connected to the diencephalon. The eyes are just inferior to the anterior-most part of the cerebrum, but the optic nerve extends back to the thalamus as the optic tract, with branches into a region of the hypothalamus. There is also a connection of the optic tract to the midbrain, but the mesencephalon is adjacent to the diencephalon, so that is not difficult to imagine. The cerebellum originates out of the metencephalon, and its largest white matter connection is to the pons, also from the metencephalon. There are connections between the cerebellum and both the medulla and midbrain, which are adjacent structures in the secondary vesicle stage of development. In the adult brain, the cerebellum seems close to the cerebrum, but there is no direct connection between them. Another aspect of the adult CNS structures that relates to embryonic development is the ventricles—open spaces within the CNS where cerebrospinal fluid circulates. They are the remnant of the hollow center of the neural tube. The four ventricles and the tubular spaces associated with them can be linked back to the hollow center of the embryonic brain (see Table \\(\\PageIndex{1}\\)). Stages of Embryonic Development Neural tube Primary vesicle stage Secondary vesicle stage Adult structures Ventricles Anterior neural tube Prosencephalon Telencephalon Cerebrum Lateral ventricles Anterior neural tube Prosencephalon Diencephalon Diencephalon Third ventricle Anterior neural tube Mesencephalon Mesencephalon Midbrain Cerebral aqueduct Anterior neural tube Rhombencephalon Metencephalon Pons cerebellum Fourth ventricle Anterior neural tube Rhombencephalon Myelencephalon Medulla Fourth ventricle Posterior neural tube Spinal cord Central canal Table \\(\\PageIndex{1}\\) Stages of Embryonic Development DISORDERS OF THE... Development of the Nervous System: Spina Bifida Early formation of the nervous system depends on the formation of the neural tube. A groove forms along the dorsal surface of the embryo, which becomes deeper until its edges meet and close off to form the tube. If this fails to happen, especially in the posterior region where the spinal cord forms, a developmental defect called spina bifida occurs. The closing of the neural tube is important for more than just the proper formation of the nervous system. The surrounding tissues are dependent on the correct development of the tube. The connective tissues surrounding the CNS can be involved as well. There are three classes of this disorder: occulta, meningocele, and myelomeningocele (Figure \\(\\PageIndex{4}\\)). The first type, spina bifida occulta, is the mildest because the vertebral bones do not fully surround the spinal cord, but the spinal cord itself is not affected. No functional differences may be noticed, which is what the word occulta means; it is hidden spina bifida. The other two types both involve the formation of a cyst—a fluid-filled sac of the connective tissues that cover the spinal cord called the meninges. “Meningocele” means that the meninges protrude through the spinal column but nerves may not be involved and few symptoms are present, though complications may arise later in life. “Myelomeningocele” means that the meninges protrude and spinal nerves are involved, and therefore severe neurological symptoms can be present. Often surgery to close the opening or to remove the cyst is necessary. The earlier that surgery can be performed, the better the chances of controlling or limiting further damage or infection at the opening. For many children with meningocele, surgery will alleviate the pain, although they may experience some functional loss. Because the myelomeningocele form of spina bifida involves more extensive damage to the nervous tissue, neurological damage may persist, but symptoms can often be handled. Complications of the spinal cord may present later in life, but overall life expectancy is not reduced. Figure \\(\\PageIndex{4}\\): Spina Bifida. Spina bifida is a birth defect of the spinal cord caused when the neural tube does not completely close, but the rest of development continues. The result is the emergence of meninges and neural tissue through the vertebral column. Part (a) shows the difference between a normal spinal cord, and the three types of spina bifida: occulta, meningocele and myelomeningocele. In part (b), an ultrasound taken at 21 weeks shows a fetal myelomeningocele. (Image credit: \"Spina Bifida\" by OpenStax is licensed under CC BY-SA 3.0 / Ultrasound image: \"Spina bifida lombare sagittale\" by Moroder is licensed under CC BY-SA 3.0)\n\nConcept Review The development of the nervous system starts early in embryonic development. The outer layer of the embryo, the ectoderm, gives rise to the skin and the nervous system. A specialized region of this layer, the neuroectoderm, becomes a groove that folds in and becomes the neural tube beneath the dorsal surface of the embryo. The anterior end of the neural tube develops into the brain, and the posterior region becomes the spinal cord. Tissues at the edges of the neural groove, when it closes off, are called the neural crest and migrate through the embryo to give rise to PNS structures as well as some non-nervous tissues. The brain develops from this early tube structure and gives rise to specific regions of the adult brain. As the neural tube grows and differentiates, it enlarges into three vesicles that correspond to the forebrain, midbrain, and hindbrain regions of the adult brain. Later in development, two of these three vesicles differentiate further, resulting in five vesicles. Those five vesicles can be aligned with the four major regions of the adult brain. The cerebrum is formed directly from the telencephalon. The diencephalon is the only region that keeps its embryonic name. The mesencephalon, metencephalon, and myelencephalon become the brainstem. The cerebellum also develops from the metencephalon and is a separate region of the adult brain. The spinal cord develops out of the rest of the neural tube and retains the tube structure, with the nervous tissue thickening and the hollow center becoming a very small central canal through the cord. The rest of the hollow center of the neural tube corresponds to open spaces within the brain called the ventricles, where cerebrospinal fluid is found.\n\nMultiple Choice Q. Aside from the nervous system, which other organ system develops out of the ectoderm? A. digestive B. respiratory C. integumentary D. urinary Answer Answer: C Q. Which primary vesicle of the embryonic nervous system does not differentiate into more vesicles at the secondary stage? A. prosencephalon B. mesencephalon C. diencephalon D. rhombencephalon Answer Answer: B Q. Which adult structure(s) arises from the diencephalon? A. thalamus, hypothalamus, retina B. midbrain, pons, medulla C. pons and cerebellum D. cerebrum Answer Answer: A Q. Which structure is associated with the embryologic development of the peripheral nervous system? A. neural crest B. neuraxis C. rhombencephalon D. neural tube Answer Answer: A\n\nCritical Thinking Questions Q. Studying the embryonic development of the nervous system makes it easier to understand the complexity of the adult nervous system. Give one example of how development in the embryonic nervous system explains a more complex structure in the adult nervous system. Answer A. The retina, a PNS structure in the adult, grows from the diencephalon in the embryonic nervous system. The mature connections from the retina through the optic nerve/tract are to the hypothalamus and thalamus of the diencephalon, and to the midbrain, which developed directly adjacent to the diencephalon as the mesencephalon in the embryo.\n\nGlossary brainstem region of the adult brain that includes the midbrain, pons, and medulla oblongata and develops from the mesencephalon, metencephalon, and myelencephalon of the embryonic brain cephalic flexure curve in midbrain of the embryo that positions the forebrain ventrally diencephalon region of the adult brain that retains its name from embryonic development and includes the thalamus and hypothalamus forebrain anterior region of the adult brain that develops from the prosencephalon and includes the cerebrum and diencephalon hindbrain posterior region of the adult brain that develops from the rhombencephalon and includes the pons, medulla oblongata, and cerebellum mesencephalon primary vesicle of the embryonic brain that does not significantly change through the rest of embryonic development and becomes the midbrain metencephalon secondary vesicle of the embryonic brain that develops into the pons and the cerebellum midbrain middle region of the adult brain that develops from the mesencephalon myelencephalon secondary vesicle of the embryonic brain that develops into the medulla neural crest tissue that detaches from the edges of the neural groove and migrates through the embryo to develop into peripheral structures of both nervous and non-nervous tissues neural fold elevated edge of the neural groove neural groove region of the neural plate that folds into the dorsal surface of the embryo and closes off to become the neural tube neural plate thickened layer of neuroepithelium that runs longitudinally along the dorsal surface of an embryo and gives rise to nervous system tissue neural tube precursor to structures of the central nervous system, formed by the invagination and separation of neuroepithelium neuraxis central axis to the nervous system, from the posterior to anterior ends of the neural tube; the inferior tip of the spinal cord to the anterior surface of the cerebrum primary vesicle initial enlargements of the anterior neural tube during embryonic development that develop into the forebrain, midbrain, and hindbrain prosencephalon primary vesicle of the embryonic brain that develops into the forebrain, which includes the cerebrum and diencephalon rhombencephalon primary vesicle of the embryonic brain that develops into the hindbrain, which includes the pons, cerebellum, and medulla secondary vesicle five vesicles that develop from primary vesicles, continuing the process of differentiation of the embryonic brain telencephalon secondary vesicle of the embryonic brain that develops into the cerebrum"}, {"url": "https://www.nature.com/articles/s41586-021-04026-9", "page_content": "Microfabrication and soft lithography\n\nStamps for contact masking were prepared using standard soft-lithography techniques on a 4-inch wafer. One layer of photoresist (SU-8 2075, Microchem) was spun onto a silicon wafer at a thickness of 110 μm. Photoresist was exposed to ultraviolet light using a mask aligner (Suss MicroTec MA6) and unexposed photoresist was developed away to yield multiple arrays of posts. A trimethylchlorosilane layer was vapour deposited on the developed wafer to prevent adhesion. A 10:1 ratio of polydimethylsiloxane (PDMS) and its curing agent (Sylgard 184 A/B (Dow Corning)) were poured onto the wafers and cured at 65 °C overnight. The PDMS layer was then peeled off the silicon mould and individual stamps were cut out using a razor blade for future use.\n\nGlass micropatterning\n\nSterile PDMS stamps and 35-mm-diameter custom-made glass-bottomed culture dishes were plasma treated for 1 min on high setting (PDC-32G, Harrick Plasma) to activate both surfaces. Stamps were pressed features-side to the glass surface and held in place. To passivate the glass surface in nonpatterned regions, 0.1 mg ml−1 poly-l-lysine-g-polyethylene glycol solution (SuSoS) was added to the petri dish immediately after securing stamps to the glass surface and incubated for 30 min. Stamps were then carefully removed and stamped glass dishes were rinsed several times with PBS++ (+Ca+Mg, ThermoFisher Scientific). Laminin-521 (STEMCELL Tech.) was added at a dilution of 5 μg ml−1 in PBS++ to incubate overnight at 4 °C. The following day, stamped glass dishes were rinsed with PBS++ to remove excess unbound laminin and used within 1–7 days.\n\nhPS cell lines and maintenance\n\nThe work reported in this paper was approved by the Human Stem Cell Research Oversight Committee (hSCRO) at University of California Irvine, study no. 2018-1072. In this work, we used early passages (<40) of human induced pluripotent stem (hiPS) cell CTR2#1727 (Figs. 1–4). The cell line was previously karyotyped as normal27. In addition, we used hiPS cell reporter line AICS-0023 developed by the Allen institute (Extended Data Fig. 1c–e)–, AICS-0054 (Extended Data Fig. 5f, g), NIH-approved embryonic stem-cell line RUES2 NIH approval number NIHhESC-09-0013, and its derived transgenic reporter line SOX10-GFP6 (Extended Data Fig. 6). Human pluripotent stem (hPS) cells were cultured with mTESR1 medium (Stemcell Technologies) on hESC-qualified Matrigel (Corning)-coated dishes. Medium was exchanged on a daily basis, and cells were regularly checked for mycoplasma contamination.\n\nNeural tube morphogenesis protocol\n\nA step-by-step protocol is available on Protocol Exchange28.\n\nDay 1. Seeding onto micropatterns\n\nhPS cells were released from well-plate surfaces using non-enzymatic reagent following the manufacturer’s instructions (ReleSR, Stemcell Technologies). Cells were resuspended as a single-cell suspension at densities of 750,000–1,000,000 cells per ml in mTeSR1 containing 10 μM ROCK inhibitor Y27632 (Abcam). Two-hundred microlitres of cell suspension was then pipetted onto prepatterned dishes and allowed to settle for 15 min before adding 1 ml of mTeSR1 and allowing cells to settle for a further 10 min. Excess medium was aspirated, leaving enough liquid to cover patterns and replaced with fresh 2 ml of mTeSR until the following day.\n\nDay 2. Matrigel addition\n\nmTESR1 medium was exchanged with a neural induction medium containing Matrigel (4%, v/v). Neural induction medium was supplemented with 5 μM of TGF-β-inhibitor SB 431542 (Supplementary Table 3).\n\nDays 3, 4. Lumen formation\n\nDishes were left unperturbed at day 3 to allow transition into 3D stem-cell tissue containing a single lumen. At Day 4 medium was exchanged with neural induction medium supplemented with 5 μM of SB 431542.\n\nDay 5–9. Exposure to morphogens\n\nTo drive ectoderm patterning we applred BMP46,7,29,30. Neural induction medium was supplemented with 5 ng ml−1 BMP4 in addition to 5 μM of SB 431542. Medium was exchanged daily. Cell fates were observed on day 6 and folding was observed during days 7–9.\n\nProtocol rationale\n\nOur protocol was optimized based on experimental observations. First, Matrigel concentration was scanned (Extended Data Fig. 1g). Four percent Matrigel was a minimal concentration that yielded robust lumen formation. Second, the period of neural induction, prior to BMP, was scanned (Extended Data Fig. 9). Three days of neural induction was the minimal period which yielded neural and non-neural ectoderm, with no mesoderm. Finally, low BMP levels were chosen to prevent EMT from the micropattern.\n\nWhole-mount immunostaining\n\nAll samples were fixed, immunostained and imaged as whole mounts in the culture dish. Samples were fixed in 4% PFA for 1 h at room temperature, washed three times for 15 min in PBS, and permeabilized in 1.5% Triton-X in PBS overnight at 4 °C. The following day, samples were washed in 0.3% Triton, and blocked for 2 h at room temperature (10% NGS, 1% BSA, 0.3% Triton-X in PBS). Primary antibodies were used at 1:100–1:200 in blocking solution overnight at 4 °C. Next, samples were washed in PBT (0.1% Tween in PBS), and incubated with secondary antibodies at 1:500–1:1,000 in PBT overnight at 4 °C. DAPI and phalloidin were added at this stage. Samples were washed in PBS for 1 h and imaged. Finally, samples were cleared using 30 min incubation in RapiClear 1.47 (SUNJIN LAB). Antibodies are listed in Supplementary Table 4.\n\nDrug experiments\n\nAll drugs were reconstituted in water and added to the culture at day 5, together with BMP, and maintained for 72 h until the end of the experiment at day 8. Medium was changed daily. Control experiments were carried under identical conditions, adding water instead of the drug. ROCK inhibition was achieved using the small molecule Y-27632 and applied at a concentration of 10 μM (1:1,000 dilution). We targeted the fibronectin matrix using the HSP-90 inhibitor novobiocin which increases fibronectin turnover31. Novobiocin was applied at 100 μM. Valproic acid was applied32,33 at 800 μM.\n\nImaging\n\nFluorescence imaging of whole-mount immunostained samples and live-cell imaging was carried out using a Leica SP8 confocal microscope. Imaging was carried out directly on glass-bottom dishes in which lumenoids were cultured. Live imaging was carried out in a custom-made incubator for temperature and CO 2 control.\n\nImage analysis\n\nImage analysis was performed using Fiji 2.1.0, Matlab 2019a, Ilastik 1.3.3, MeshLab 2021.07 and ImSAnE (https://github.com/idse/imsane).\n\nNeural tube closure analysis\n\nNeural tube closure period was measured as the period between exposure to BMP and the formation of a closed neural tube (Extended Data Fig. 3d). Detailed kinetics of neural closure are shown in Extended Data Fig. 3c. This was compared to data from neural closure period in the chick34, mouse35 and humans13.\n\nF-actin analysis\n\nF-actin levels were detected using Phalloidin-488 (Thermofisher A12379). Phalloidin was added and washed with secondary antibodies. Fluorescence intensities in control and ROCK inhibited samples were measured and quantified.\n\nTissue width analysis\n\nThe ectoderm and neural widths were measured at an early time point (36 h) before folding onset. At this time point a confocal section near the glass surface was taken (Fig. 4c). The distance between the NCAD–ECAD boundary and the tissue boundary were measured and defined as the ectoderm width. The distance between the two NCAD–ECAD boundaries was measured and defined as the neural width.\n\nClonal analysis\n\nWe clonally labelled cells by mixing a CAAX-RFP reporter line with non-fluorescent background line during seeding of the micropatterns. The reporter line was added at low density, such that the majority of samples did not contain RFP+ cells, and a small fraction of colonies contained 1–2 cells per sample. We fixed the samples at 72 h for imaging.\n\nDroplet-based scRNA-seq\n\nSamples were cultured according to neural tube morphogenesis protocol. Cells were dissociated into a single-cell suspension using TrypLE reagent (Gibco), and gentle pipetting, according to 10X guidelines. Cells were washed three times in 0.01% BSA in PBS, filtered using a 40-μm Flowmi Tip strainer (Sigma), counted and checked for high viability (>95%). To generate single-cell RNA libraries, the Chromium Single Cell Kit v3.1 (10x Genomics) was used according to the manufacturer’s instructions. Libraries were sequenced on an Illumina NovaSeq6000 Instrument. To obtain gene expression counts matrices, raw reads were processed using the Cell Ranger counts pipeline (version 3.1.0), followed by the Cell Ranger pipeline (version 3.1.0) with default settings.\n\nStatistical analysis\n\nStatistical significance was determined using paired-sample t-test using MATLAB. At list three replicates were used to determine significance.\n\nSingle-cell RNA data analysis\n\nSingle-cell RNA data analysis was performed using Seurat 3.036,37 in R version 3.6.3. Samples were filtered as individual Seurat objects. Low-quality cells with >15% mitochondrially encoded genes, and cells with less than mean – (1.2 × s.d.) of the number of expressed genes were removed. Putative doublets were filtered out using DoubletFinder38, assuming a 3.9% doublet formation rate. After doublet removal, the four samples were merged into one Seurat object consisting of a total of 19,597 cells. This final dataset had a mean of 3,717 detected genes per cell, a mean transcript count of 14,897 and a mean percentage of mitochondrially encoded genes of 5.6%. Sctransform normalization39 was performed, regressing out percentage of mitochondrial genes and number of genes detected. Clustering and UMAP dimensionality reduction were performed on the transformed data using default parameters and a resolution of 0.05. To identify marker genes, data were first normalized and scaled with default parameters. Then, the Wilcox rank sum test was applied to identify cluster markers by running the FindMarkers function on the normalized and scaled data with the following parameters: logfc.threshold = 0.25, min.pct = 0.1, only.pos = TRUE.\n\nData were subset to the three major lineages (neural ectoderm: cluster NE, 4,767 cells; surface ectoderm: clusters SE-1 and SE-2, 4,347 and 10,017 cells, respectively; neural crest: cluster NC, 448 cells), followed by computing marker genes for each time point (24 h, 48 h, 72 h and 120 h) within each lineage using the FindMarkers function as described above. GO enrichment analyses were performed using Metascape40 (https://metascape.org) with the following customizations: a background gene list of all genes present in the dataset was provided, and the GO Biological Processes database was used for testing gene enrichment. Metascape performs hierarchical clustering of the enriched terms, showing the most significant term within a cluster as the representative term in the enrichment results. The neural ectoderm and surface ectoderm lineages were subclustered as described above, with resolution set to 0.2 and 0.4 for neural ectoderm and surface ectoderm, respectively. Cell cycle phases were assigned using Seurat’s CellCycleScoring function and lists of G2/M and S phase markers from ref. 41.\n\nSimulation\n\nA vertex model simulation for neural tube morphogenesis was developed in Matlab 2019a. The simulation is described in detail in the Supplementary Note.\n\nStatistics and reproducibility\n\nAll experiments were carried in at least three biological replicates, except the single-cell sequencing was performed in one experiment including multiple time points. Sample sizes are indicated in the figure captions. The in vitro neural tube morphogenesis protocol was repeated in about 100 experiments, including three different cell lines (one hiPS cell and two human embryonic stem-cell lines). The folding and closure dynamics, size dependence and response to pharmaceutical agents were all highly conserved and occurred in a large proportion of cells.\n\nReporting summary\n\nFurther information on research design is available in the Nature Research Reporting Summary linked to this paper."}, {"url": "https://www.nature.com/articles/35039056", "page_content": "Proper craniofacial development requires the orchestrated integration of specialized interactions between surface ectoderm, PARAXIAL MESODERM, NEURAL CREST and endoderm. Given the widely divergent patterns of cell movements during craniofacial morphogenesis, how do the facial structures form in the proper location and with the appropriate shapes and sizes? A related question is whether the information necessary for craniofacial patterning is pre-established and endogenous to each tissue progenitor or, alternatively, whether it resides in MESENCHYMAL or epithelial tissues surrounding each cell type before or during morphogenesis. In the case of the cranial neural crest, evidence from various vertebrate systems and experimental approaches has not helped us to distinguish conclusively between these two opposing models of craniofacial patterning. The purpose of this review is to reappraise the experimental evidence available and to explain how recent studies have revealed the dynamic nature of patterning and tissue interactions in head development.\n\nSegmentation and craniofacial development\n\nThe vertebrate HINDBRAIN is one source of patterning information that exerts a profound influence on craniofacial morphogenesis. During early development, the hindbrain is transiently partitioned into seven transverse neuroepithelial segments called rhombomeres (r), each of which adopts a distinct set of molecular and cellular properties, restrictions in cell mixing, and ordered domains of HOX GENE expression1,2,3,4,5,6,7,8,9,10 (Fig. 1a). Not only do rhombomeres give rise to well-defined regions of the adult brain11,12, but their segmental organization is also critical for the establishment of an anatomical and functional registration between individual rhombomeres, CRANIAL GANGLIA, BRANCHIOMOTOR NERVES and pathways of neural crest cell migration (Fig. 1a). For instance, the first subset of neurons to form is generated in r4, followed soon after by r2 and r6 (refs 13–15). Similarly, the formation and disposition of motor neurons also conforms to a similar two-segment periodicity (Fig. 1a). Retrograde tracing of motor axons has revealed that the motor nerves of the first three BRANCHIAL ARCHES (trigeminal, facial–acoustic and glossopharyngeal) are respectively derived from nuclei confined within r2, r4 and r6 (refs 13,16–18). Although each nerve receives a subsequent contribution of axons from neurons developing in the adjacent caudal rhombomere, the even-numbered rhombomeres still contain the respective exit points13.\n\nFigure 1: Hindbrain segmentation and gene expression. a | Hindbrain segmentation into rhombomeres (r1–r8) and its relationship to patterning the branchial motor nerves (V, VII, IX), pathways of neural crest migration (arrows), branchial arches (BA1–BA3) and domains of gene expression at 9.5 dpc (days post-coitus). This drawing indicates the anatomical registration between the arches, the segments and the neural structures. Dark and light shading indicates high and low levels of gene expression in individual rhombomeres, respectively. The hatched box denotes that Hoxa1 is expressed up to the presumptive r3/r4 boundary at 7.5 dpc but is subsequently switched off before rhombomere formation. b | The hierarchical relationship between segmentation genes (kreisler and Hoxa1) and genes involved in growth and maintenance (Krox20), segment identity (Hoxa2, -b2, -b3, -a3) and cellular restrictions (EphA4, -A7) during hindbrain segmentation and patterning (ncc, neural crest cells; ov, otic vesicle). Full size image\n\nIn addition to patterning the cranial nerves, the rhombomeric organization of the hindbrain is also linked to the patterns of cranial neural crest cell migration19,20,21,22,23. Hindbrain-derived neural crest cells migrate ventrolaterally as three segmental streams adjacent to r2, r4 and r6, which enter the first, second and third branchial arches, respectively (Fig. 1a). Substantially fewer neural crest cells delaminate from r3 and r5 compared with the even-numbered rhombomeres19,20 and, in chick, this phenomenon is associated with increased cell death in r3 and r5 (refs 24,25). However, lineage tracing and time lapse analyses show that rather than migrating laterally, neural crest cells derived from odd-numbered rhombomeres migrate both rostrally and caudally, joining the even-numbered neural crest streams as they fill the branchial arches (see cells and arrows in Fig. 1a)20,26. Hindbrain segmentation is therefore a conserved strategy used by vertebrates for organizing diverse craniofacial features such as cranial ganglia, branchiomotor nerves and neural crest. As a result, it is a good model system for addressing basic problems of cellular patterning.\n\nPatterning of hindbrain and crest by Hox genes\n\nThe expression patterns of several genes show rhombomere-restricted domains9,27 (Fig. 1a) and, through regulatory and mutational analyses in mice and other species, we are beginning to understand the molecular and cellular mechanisms involved in subdividing the hindbrain into rhombomeres. An emerging principle seems to be the participation of individual genes in modulating several steps in the segmental processes. Transcription factors such as kreisler , Krox20 and Hoxa1 are involved in regulating the formation and the growth or maintenance of some segments17,28,29,30,31,32,33,34,35,36 (Fig. 1b). However, these genes also have further roles in controlling segmental character through direct regulation of rhombomere-restricted domains of Hox gene expression37,38,39,40,41,42,43. Considerable evidence shows that the Hox genes themselves, as in other tissues, are responsible for conferring antero-posterior identity of rhombomeric segments9,27,43,44,45,46,47,48,49,50,51. Similar mechanisms involved in patterning cranial neural crest cells are also being uncovered.\n\nRhombomere partitioning and the adoption of neural fate coincides with the appearance of restricted gene expression. As part of establishing unique segmental identities, restrictions in cell mingling are crucial for refining and maintaining organized expression patterns during hindbrain development. Two gene families in particular — the ephrin/Eph receptors and the Hox gene transcription factors — are essential for establishing hindbrain compartments and imposing segmental identity. Bipartite Eph/ephrin signalling pathways mediate in part the restricted intermingling of cells between adjacent odd- and even-numbered rhombomeres5,6,52,53,54,55,56. The Eph receptors (Fig. 1a) and the ephrins are not expressed by the same rhombomeres. Instead, each class of molecules is expressed in an alternate, non-overlapping pattern in adjacent rhombomeres. In addition, MOSAIC activation of the receptor or the ligand leads to cell sorting at the boundaries of odd- or even-numbered rhombomeres, respectively5,6,52,53,54,55,56. Krox20 and Hox genes also participate in restricting cell mixing through the regulation of Eph receptors57,58,59. The Eph/ephrin gene families are also important in regulating the migratory pathways of neural crest cells60,61. Inactivation of this signalling mechanism using truncated, DOMINANT-NEGATIVE Eph receptors results in ectopic migration of third arch neural crest cells into the second and fourth arches. So interactions between the Eph receptors and the ephrin ligands function to keep neural crest streams separated60.\n\nDuring the period of craniofacial morphogenesis in mouse embryos (7.5–10.5 days post-coitus), the genes at the 3′ end of each Hox cluster show ordered and dynamic patterns of expression8,9,62. The neural crest cells and the branchial arches they populate express a set of Hox genes that are characteristic of their rhombomeric origins7,8,62. This emulation of rhombomeric Hox gene expression, first by the neural crest and subsequently by the branchial arches, indicates that the early segmental organization of the hindbrain has long-term effects on cell differentiation and patterning of the craniofacial structures. Direct support for this idea has come from analysis of Hox mutant mice63,64,65. In particular, the control of the branchial arch skeleton is dependent on two genes of the HoxA cluster ( Hoxa2 and Hoxa3 ) as inactivation of other Hox genes expressed within this part of the head does not affect the branchial arch skeleton66,67,68. These experiments show that a Hox gene code is important for normal branchial arch patterning8,62. However, they do not provide any explanation for how such a pattern is first established.\n\nNeural crest and craniofacial development\n\nThe neural crest is a pluripotent cell population critical for the construction of the vertebrate head. In addition to forming peripheral neurons and glia, the cranial neural crest also gives rise to the entire facial and visceral skeleton, to most of the skull bones and to the connective tissue associated with the mesoderm-derived head muscles69,70,71. Results obtained after transpositions of avian neural folds70,72,73 led to the concept that regional diversity in the vertebrate head was a consequence of early differences in the morphogenetic specification of neural crest cells before their migration from the neural tube. For example, when presumptive first arch (mandibular) neural crest primordia were grafted to the more posterior positions of the presumptive second (hyoid) or third (visceral) arch crest primordia, the transplanted neural crest cells migrated normally into the nearest branchial arch but formed first arch skeleton components. Duplicated squamosal, pterygoid and angular bones, as well as quadrate and mandibular (Meckel's) cartilages were found in the ectopic locations. These crest-derived structures were morphologically inappropriate for their new location and, similarly, some muscles formed alignments and attachments typical of muscles from the first arch. This indicated that myogenic populations and other cell types receive spatial cues from the invading neural crest-derived connective tissue.\n\nThese pivotal studies70,72,73 led to the speculation that the spatial organization of cranial structures by the neural crest is the result of a pre-pattern set before cells migrate from the neural tube. Under this pre-patterning model, positional information is passively carried from the hindbrain to peripheral tissues by the neural crest cells and maintained throughout subsequent development. The ordered domains of Hox gene expression in the neural tube and neural crest cells were later assumed to be a molecular correlate of the pre-patterning mechanism. This model implies a common mode of regulating Hox gene expression in distinct tissues such as rhombomeres and neural crest cells.\n\nPlasticity after rhombomere manipulation\n\nThe neural crest pre-patterning model predicts that experimental alterations to the spatial organization of rhombomere and crest populations should be followed by a reorganization of Hox gene expression domains and head structures. Owing to the ease of tissue manipulation, the chick embryo has been the main vehicle for testing the pre-patterning model and rhombomere transplantations, rotations and ablations have been used to test its predictions. However, the experiments assessing the degree of autonomy or plasticity of Hox gene expression in the hindbrain and neural crest have often yielded conflicting results.\n\nPre-otic transplantations highlight autonomy. Rhombomere-specific expression of particular Hox genes can be preserved following transplantation to an ectopic site anterior to the OTIC VESICLE74,75,76,77. The transposition of r4 in place of r2 (ref. 74) indicates that the pattern of Hoxb1 expression and the molecular identity of r4 are fixed before boundary formation. As Hoxb1 expression is rapidly downregulated in r4-derived neural crest cells at the onset of migration, this study was not informative regarding the molecular patterning of the cranial neural crest cells. In contrast, Hoxa2 is expressed in the hindbrain and second arch neural crest, and it shows different anterior limits of expression in the neural tube and neural crest. Reciprocal transpositions of pairs of rhombomeres (r2/r3 and r4/r5) showed that graft-derived neural crest cells retained the characteristic molecular identity of their origins76. This supports the idea that neural crest cells are pre-patterned with respect to Hoxa2 expression at the time of rhombomere boundary formation.\n\nPost-otic transplantations reveal plasticity. The transplantation experiments described above illustrate the direct correlation between commitment to rhombomere-specific fate and Hox gene expression. In contrast, when rhombomeres from r1–r6 were transposed caudal to the otic vesicle, Hox gene expression was reprogrammed in the transplant78,79,80. In addition, the molecular changes induced within the graft coincided with its transformation into neural structures characteristic of its new position78. This observation raised questions about the source and nature of signals capable of re-patterning the hindbrain. Transpositions of posterior SOMITES adjacent to the hindbrain result in the induction of Hoxb4 anterior to its normal domain of expression, indicating that somitic mesoderm is one source of patterning signals79. Regulatory analyses have also revealed that somitic mesodermal signalling is involved in initiating and maintaining segmental Hoxb4 expression during normal hindbrain development81. These results clearly show that rhombomere cell fate is not irreversible, but can change in response to the posterior local environment. These experiments, together with the pre-otic grafts, indicate that rhombomeres might have an autonomous program for regulating their identity, which can be overridden by trunk but not by head mesoderm.\n\nRhombomere rotations provide conflicting evidence. Rhombomere rotations provide evidence for both autonomy of hindbrain tissue and autonomy and plasticity of neural crest cell identity. Hoxa3 is expressed anteriorly in the neural tube up to the r4/r5 boundary and in neural crest cells derived from r5 and r6 (ref. 82). In caudal hindbrain rotations (r4–r6), Hoxa3 expression was autonomously maintained in the rhombomeric tissue but different degrees of plasticity were observed in the neural crest cells. Hoxa3 expression was not detected in r5-derived neural crest cells migrating into the ectopic environment of the second arch, implying that the Hox gene code is not passively transferred to the periphery by this subset of migratory neural crest cells. In contrast, Hoxa3 expression in r6-derived neural crest cells was not reprogrammed, but was maintained for 24 hours. These results imply that neural crest cells expressing the same Hox gene are not equivalent and that neural crest cells from odd- and even-numbered rhombomeres can respond differently to environmental signals82.\n\nIn the case of r3–r7 rotations, Hox gene expression is not reprogrammed in the grafted tissue, arguing for autonomy. This manipulation results in an abnormal branchial arch Hox gene code and in extensive defects in the hyoid skeleton83. Paradoxically, rotation of r1–r7, where the first and third arch crests are exchanged83, leads to the re-establishment of the normal branchial arch Hox gene code and morphogenesis. These results indicate that crest cells might have some intrinsic patterning, but exposure to increasingly new environments within the branchial region can override these effects. This overriding influence can result in reprogramming of the crest Hox gene code and morphogenetic cell fate. The basis of these differences in support for autonomy and plasticity are not understood and may reflect variations in size of rotation, timing or in-filling from adjacent populations. However, it is clear that there is a tight correlation between maintenance of the normal branchial arch Hox gene code and the ultimate formation of proper skeletal morphology.\n\nCrest ablations provide evidence for plasticity. Neural tube ablation experiments also indicate that not all properties of cranial crest identity are imprinted before migration84,85. Surprisingly, when MESENCEPHALIC, occipital or cervical neural crest was ablated, no resulting facial or neck abnormalities occurred. The primary reason for this observation is that, during a short developmental time window, the lateral wall of the neural tube regenerates neural crest cells that migrate along the normal pathways for their axial level of origin86. The ability of the hindbrain to regenerate neural crest cells has been used to explore the relationship between the Hox gene code, branchial arch morphogenesis and skeletal development87. After bilateral deletion of the RHOMBENCEPHALIC crest primordia, both the patterns of Hox gene expression (Hoxa3 and Hoxb4) and branchial arch morphogenesis, including the facial skeleton (mandible and hyoid apparatus), are normal. Within the regenerated tissue, neuronal groups arise in their normal positions and show proper patterns of differentiation, migration and axonal outgrowth. Neural tube cells can regenerate neural crest during an early critical period. Later, they lose this capacity, but retain the ability to regenerate parts of the hindbrain itself88. So the capacity for regeneration is dependent on the embryonic stage at which the ablation is done.\n\nSimilar ablations done after the hindbrain loses its ability to regenerate neural crest cells provide evidence for plasticity in axial identity89. In these cases, normal facial and skeletal morphogenesis also occurs, despite the fact that the neural crest cells have migrated from axial levels adjacent to the ablation. This shows that neural crest cells can migrate along non-segmental pathways lateral to the neural tube. Analysis of Hox gene expression has shown that the original antero–posterior identity of the migrating neural crest cells is maintained for a short period90 but subsequently becomes respecified by the local branchial arch environment83. This results in a re-establishment of a normal branchial arch Hox gene code, ensuring normal craniofacial patterning. The finding that reprogramming of Hox gene expression is not always immediate and can occur over an extended period may account for some of the variability in previous results examining autonomy and plasticity in other types of manipulations in chick embryos.\n\nIn summary, the ablation experiments show plasticity of the neural crest and its derivatives at the hindbrain level during craniofacial development. There are at least two overlapping phases of neural crest regulation: first, an early phase during which the neural tube regenerates to form neural crest; and second, a late phase in which rostral and caudal neural crest cells divert their migration and alter their gene expression patterns to compensate for the missing neural crest. These cells then differentiate into craniofacial structures appropriate for their new locations. These results imply that regional specification along the neural axis is not absolute and can be influenced by environmental factors.\n\nPlasticity in other species\n\nIt is clear from the avian experiments that a strict pre-patterning model is not consistent with all the evidence for plasticity or autonomy of Hox gene expression. Recent experiments in other vertebrates have shed further light on this issue. Regarding the autonomy of rhombomeric tissues, the variability seems to correlate with differences in the organization and character of the paraxial mesoderm in the pre- and post-otic environments79. In contrast to the post-otic region, the pre-otic mesoderm is not organized into epithelialized somites and fails to express somitic markers. Rather than patterning the neural tissue, the pre-otic mesodermal populations are thought to function passively in head patterning, receiving signals and information from the neural tube and neural crest70,91. However, an added complication is that the data supporting these ideas have come from manipulations of large blocks of tissue in avian embryos, generally encompassing several segments. This approach could mask cellular plasticity because of signalling between rhombomeres and cell-community effects that reinforce tissue identity.\n\nRecently, the application of new techniques for transposing small regions of mouse rhombomeric tissue in cultured embryos has uncovered a considerable degree of plasticity with respect to patterns of Hox gene expression in rhombomeric cells, which depends on the size of the cell community92,93. In a series of transpositions, cells from r3, r4 or r5 were grafted into r2. The transplanted cells generally remained as a cohort and maintained their antero–posterior character in a CELL-AUTONOMOUS manner (Fig. 2), similar to the observations on rhombomere autonomy in avian grafts. However, some transplanted cells dispersed from the primary graft and intermingled with the surrounding populations. These cells showed plasticity, as they failed to maintain their appropriate Hox gene expression patterns and consequently their identity in this ectopic location92. Therefore, at the level of very small groups or individual rhombomeric cells, there is an inherent plasticity with respect to Hox gene expression and cell fate. This implies that single or dispersed cells in ectopic locations lack the neighbouring signals needed to reinforce their character. The formidable task of transplanting single rhombomere cells has recently been achieved in zebrafish (T. Schilling, personal communication), providing further evidence for plasticity and cell-community effects. The transposition of single hindbrain cells from r2 into r6 or vice versa resulted in a complete switch in Hox gene expression and cell fate appropriate for the new location of the transposed cells (T. Schilling, personal communication). This degree of plasticity is dependent on both the timing and size of the transplant. At later stages, when morphological boundaries are well established, cells are more likely to be irreversibly committed and maintain their Hox gene expression characteristics. This implies that cells in the neural tube progressively lose responsiveness to the environmental signals that specify segmental identities. Together, the mouse and fish studies show that cell-community effects are important in maintaining the axial identity of an individual cell in the hindbrain. This explains the collective autonomy of Hox gene expression observed in avian manipulations involving whole rhombomeres.\n\nFigure 2: Plasticity of Hox gene expression in the hindbrain and neural crest cells. Neural tube cells from r4 (blue) transplanted into r2 (red) contribute to the hindbrain and first branchial arch (BA1) neural crest (right side). Most of the transplanted cells that remain as a group in the hindbrain retain their original Hoxb1 gene identity (blue cells). However, cells in r2 that disperse from the grafted group (cream) are plastic with respect to their identity and downregulate Hoxb1. Similarly, graft-derived neural crest cells (cream) that migrate into BA1 also show plasticity and do not express Hoxb1. (BA1, first branchial arch; BA2 second branchial arch; ncc, neural crest cells; r, rhombomere; WT, wild type.) Full size image\n\nGrafting experiments have also revealed plasticity of antero–posterior character in mouse cranial neural crest cells (Fig. 2). In transpositions of r3, r4 or r5 cells into r2, graft-derived neural crest cells migrate into the first branchial arch. Plasticity in Hox gene expression is shown by the complete downregulation of Hoxb1, Hoxb2 and Hoxa2 in these cells92. This shows that the antero–posterior character of cranial neural crest cells is neither permanently fixed nor passively transferred from the hindbrain to the branchial arch. Instead, it is influenced by environmental signals and relies on distinctive cues in the branchial arches to elaborate the proper regional identity. Transpositions of purified neural crest cells, alone or in combination with other tissues, have shown that the cranial mesoderm is one source of signals that is able to maintain proper patterns of Hox gene expression in neural crest cells following activation. However, it does not seem to be instructive or inductive, indicating that it functions in a permissive manner to reinforce the programmes regulating Hox gene expression92.\n\nThese results highlight the importance of the initial programme established within the rhombomeres in regulating the ability of neural crest cells to respond to signals in the branchial arches. Furthermore, there is evidence that signals from the rhombomeres can influence the character of the environment through which the neural crest cells migrate. In embryos deficient for the NEUREGULIN receptor erbB4, the loss of signalling in r3 and r5 leads to the ectopic anterior migration of r4-derived neural crest cells. This abnormal migration is accompanied by a downregulation of Hox gene expression in the ectopic location93, illustrating once again the plasticity of the transposed neural crest cells92. Therefore, the mouse experiments indicate that there is interplay between instructive signals in the neural ectoderm and permissive mesodermal signals in the branchial arch environments required to establish and maintain the antero–posterior identity of cranial neural crest cells and regulate their pathways of migration.\n\nCan the different results on neural crest plasticity in mouse and chick be resolved? It seems unlikely that the disparities represent a genuine difference in the degree of neural crest cell autonomy between species. One plausible explanation is that cell-community effects can mask the plasticity of transposed rhombomeric chick cells. Time-lapse studies in chick explants and in ovo have shown cell communication between migrating neural crest cells through an extensive network of filipodial connections26,94. In mouse transpositions, the small number of graft-derived neural crest cells are widely dispersed and constitute a minor component of the total branchial arch crest population in the ectopic environment. In this way, the grafted mouse neural crest cells may be altering their Hox gene expression and identity because they rely on signals from both their neighbours and the mesodermal environment to sustain their antero–posterior character. Transpositions in chick involving several rhombomeres result in graft-derived neural crest cells filling branchial arches76,95, which would facilitate communication between axially related populations of migrating neural crest cells. This communication would enhance the ability of the grafted cells to maintain their original patterns of Hox gene expression. This is consistent with the finding that the observed autonomy of Hox gene expression in chick neural crest cells can eventually be lost when analysed over longer periods83. Therefore, we favour the idea that there is a similar degree of plasticity in cranial neural crest in both mouse and chick, which can be masked by cell-community effects resulting from the transposition of larger blocks of tissue. This argues against a pre-patterning model with passive transferral of positional information from the hindbrain to the branchial arches by migrating cranial neural crest cells. At the same time, it underscores the roles of tissue interactions in the dynamic process of head morphogenesis.\n\nEvidence for independent Hox gene regulation\n\nHoxa2 is expressed in the hindbrain anteriorly up to the r1/2 boundary and in cranial neural crest cells that migrate into the second branchial arch8. The fact that Hoxa2 is expressed in r2 but not in r2-derived neural crest cells indicates that there must be independent regulation of expression in these tissues at the molecular level. Transgenic analyses have identified regulatory regions in the Hoxa2 gene capable of specifically directing its r2- and r4-restricted expression96. Another study has identified several cis-acting elements required for independent hindbrain- and neural-crest-specific activity of a Hoxa2 enhancer38,97,98. The arrangement and activities of these control regions are summarized in Fig. 3. In r3 and r5, expression of Hoxa2 is directly regulated by the transcription factor Krox20 (refs 38,98). However, expression in neural crest of the second branchial arch is tightly controlled by numerous elements, one of which binds to AP-2 transcription factor family members97. These elements work together to coordinate and restrict neural crest expression of Hoxa2 to the second branchial arch and more posterior regions (Fig. 3). These findings clearly show that Hoxa2 is independently regulated in rhombomeres and neural crest cells at the molecular level.\n\nFigure 3: Regulation of Hoxa2 and Hoxb1 in hindbrain and neural crest cells. Hoxa2 expression in r4-derived neural crest cells (orange) migrating into the second arch (BA2) is regulated by four distinct elements, NC1–NC4 (orange ellipses), one of which (NC4) is direct target of transcription factors of the AP2 family. Expression in rhombomeres 3 and 5 is controlled by two Krox20 binding elements (green ellipses). Hoxb1 expression in r4 and r4-derived neural crest cells (blue cells) is controlled by four distinct elements, one of which is activated by Hox/Pbx transcription factors, and a second one that interacts with Meis. (BA1, first branchial arch; BA2, second branchial arch; r, rhombomere.) Full size image\n\nIn contrast, small 10-base-pair motifs in the Hoxb1 and Hoxb2 genes are able to simultaneously mediate expression in r4 and r4-derived neurogenic neural crest derivatives in the second branchial arch (see Fig. 3 for Hoxb1 elements)42,99. This shows that common elements can be used for controlling expression in hindbrain and neural crest, and that neurogenic crest and rhombomeres may have similar regulatory requirements. More cases need to be examined, but this evidence indicates that independent elements may be used for controlling expression in mesenchymal versus neurogenic neural crest cell derivatives. This might be a general property of Hox gene regulation during craniofacial morphogenesis. Consistent with this idea, several phenotypes in Hox mouse mutants have abnormalities restricted to the neurogenic (Hoxa1, Hoxb1, Hoxb2) or mesenchymal (Hoxa3, Hoxa2; see Box 1) crest derivatives, not both47,63,64,65,100,101,102.\n\nRefining patterns of hindbrain gene expression\n\nTransplantation experiments in vertebrate embryos have revealed a direct correlation between commitment to rhombomere-specific fate and Hox gene expression. Therefore, during normal rhombomere development, after an early period of plasticity, definitive commitment to specific segmental fates seems to be accompanied by the establishment of a unique genetic address of Hox gene expression that is maintained through subsequent cell divisions. This event ultimately directs the unique differentiation programme of each segment. The fact that rhombomere autonomy is maintained in cells that remain as a cohort and not in cells that intermingle with surrounding populations has important implications for the generation of sharp segmental rhombomere boundaries of Hox gene expression in normal development.\n\nRepulsive cues involving bidirectional signalling between Eph receptors and the ephrins act to separate distinct rhombomeric territories as they form (Fig. 4). Plasticity at the level of individual cells uncovered in the recent studies indicates that, once boundaries are formed, dispersed cells in an appropriate location may be able to change their fate. This is supported by data from the zebrafish, which show that in small grafts, cells lying more than two cell diameters away from the centre are able to switch their fate. Together, the two processes of cell repulsion and community-induced plasticity provide a mechanism for the progressive generation of precise rhombomeric domains of gene expression in the hindbrain (Fig. 4). The physical and molecular segmentation of the hindbrain then functions to maintain the proper antero–posterior register between the neural tube, the neural crest and the branchial arches (Fig. 1a). This register is essential to coordinate the interplay between the signals needed to elaborate the proper Hox gene expression and the morphogenetic programmes in the hindbrain and branchial arches.\n\nFigure 4: Mechanism for hindbrain segmentation and the establishment of Hox gene expression domains. Before rhombomere formation, the boundaries of gene expression in the hindbrain are diffuse (many mixed orange and blue cells). During development, bidirectional cell repulsion between the Eph receptor and the Ephrin-expressing cells leads to sorting or segregation of cells with similar identity into presumptive rhombomeric domains (few mixed orange and blue cells). Cell-community signalling induces changes in Hox gene expression which, accompanied by the formation of morphological rhombomere boundaries, ensures sharp molecular and cellular segregation (no mixed orange and blue cells). Full size image\n\nDevelopmental and evolutionary relevance\n\nHindbrain segmentation has a profound effect on craniofacial development and in this review we have discussed the different levels of regulation and the diverse tissue interactions that are involved in generating characteristic craniofacial features. It seems now clear that both rhombomeric and cranial neural crest cells show plasticity in ectopic environments, but does this have any significance in normal development? We feel it does, as plasticity reveals both the degree of intrinsic programming in a tissue and its dependence on external signals that may be important in controlling normal events. For example, somites can reprogramme Hox gene expression in anterior rhombomeres78,79,80, leading to the finding that paraxial mesoderm signalling is also involved in establishing and maintaining rhombomeric expression of a Hox gene during normal hindbrain development81. Similarly, neural crest grafting experiments have uncovered new roles for head mesoderm in normal development92. The observation that neural crest cells from several rhombomeres contribute to a single branchial arch and that there is extensive cell communication between migrating populations of neural crest cells20,26,94 argues that these cells may normally find themselves in a new environment or subject to conflicting signals. In this way, the dependence of migrating neural crest cells on specific environmental factors for proper control of Hox gene expression may be an important means of ensuring proper morphogenesis when mixed populations arise.\n\nIn evolutionary terms, the vertebrate head is a relatively new structure composed primarily of neural crest cells with contributions from paraxial mesoderm, ectoderm and endoderm. Its appearance is one probable reason for the successful radiation of vertebrates into new environments103,104,105. A rigid pre-patterning model, where programmes for head morphogenesis were set in the hindbrain or anterior central nervous system, would offer restricted opportunities for diversifying head structures. However, the potential for generating distinct cranial phenotypes during evolution through alterations in interactions or signals present in the primordial pattern could facilitate diversity. Therefore, understanding the genetic programmes, tissue interactions and degree of flexibility that direct tissue patterning will be critical for elucidating the precise mechanisms underlying the establishment of the primordial pattern, its evolution and transposition during craniofacial morphogenesis in chordates. This should be an important focus of future developmental studies."}, {"url": "https://handwiki.org/wiki/Biography:Heinz_Christian_Pander", "page_content": "Short description : Baltic German geologist\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist.\n\nBiography\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.[2][3] His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.[4] Pander is credited as the first scientist to describe primitive creatures known as conodonts.[5][6]\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.[7]\n\nHe died in Saint Petersburg.\n\nEponyms\n\nPander's eponyms are:\n\nPander's islands or blood islands\n\nSelected writings\n\nBeiträge zur Entwickelungsgeschichte des Hühnchens im Eye , (Contributions to the embryology involving the chick egg), (1817).\n\n, (Contributions to the embryology involving the chick egg), (1817). Beiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions on the natural history of the Baltic regions) Dorpat, (1820).\n\n, (Contributions on the natural history of the Baltic regions) Dorpat, (1820). Vergleichende Osteologie (Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Beiträge zur geognosie des russischen reiches , (Contributions to the geology of the Russian Empire), 1830.\n\n, (Contributions to the geology of the Russian Empire), 1830. Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856).\n\n(Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856). Ueber die Placodermen des devonischen Systems , (On placoderms of the Devonian system), 1857.\n\n, (On placoderms of the Devonian system), 1857. Über die ctenodopterinen des devonischen systems , 1858\n\n, 1858 Über die saurodipterinen, dendrodonten, glyptolepiden und cheirolepiden des devonischen systems, 1860.[8]\n\nSee also\n\nList of Baltic German scientists\n\nReferences\n\n\n\n\n\n\n\n"}], "Heinz Christian Pander described the formation of the amniotic cavity in the chick embryo.": [{"url": "https://embryo.asu.edu/pages/christian-heinrich-pander-1794-1865", "page_content": "Christian Heinrich Pander, often remembered as the father of embryology, also explored the fields of osteology, zoology, geology, and anatomy. He was born in Riga, Latvia, on 24 July 1794. Pander, with an eclectic history of research, is best remembered for his discovery and explanation of the structure of the chick blastoderm, a term he coined. In doing so, Pander was able to achieve the goal set forth by his teacher, Ignaz Döllinger, to reinvigorate the study of the chick embryo as a means of further exploring the science of embryology as a whole. His findings paved the way for the work of Karl Ernst von Baer, who would later revolutionize the field of embryology with his research.\n\nPander initially studied in the local schools of his hometown, Riga, and eventually enrolled in the University of Dorpat in 1812. While studying there, Pander attempted to pursue an education in both medical science as well as natural history. It was during this time that Pander began to work with an anatomist named Karl Friedrich Burdach who had previously taught Karl Ernst von Baer. Pander left Dorpat in 1814 and traveled to Germany. It was there in 1816 that Pander met von Baer, who convinced him to study at the University of Würzburg under the tutelage of Ignaz Döllinger. Pander agreed and traveled to Würzburg where he received his MD in 1817. It was also here that he published his dissertation, Historia Metamorphoseos Quam Ovum Incubatum Prioribus Quinque Diebus Subit, a study of the components of the chick embryo including detailed illustrations by Eduard Joseph d’Alton.\n\nDuring his work at the University of Würzburg, Pander discovered the blastoderm of the chick embryo. The blastoderm is the outermost cellular layer of the embryo, which Pander believed contributed greatly to embryonic development. He studied the blastoderm’s role in early embryonic development, describing the outer, middle, and inner layers in detail while only being able to conclude that the development of blood vessels occurred in the middle layer and that important events of embryonic development followed thereafter. Despite the lack of in-depth conclusions, Pander’s discovery and recognition of the blastoderm as well as the layered structure of the embryo provided invaluable information and guidance to his colleagues as well as future embryologists, including von Baer.\n\nDespite promising early research, Pander did not pursue further work in the study of chick embryos or embryology in general. After he obtained his MD and published his dissertation, Pander began traveling through Europe visiting science museums and continuing his work of observation in the fields of biology, paleontology, and geology. His primary goal in doing so was to visit and study the newest and most intricate fossils and skeletons discovered in different parts of the world. Pander eventually began to publish a series of works on osteology, the study of bones, collaborating once again with E. J. d’Alton. Pander became a member of the Academy of Sciences in St. Petersburg in 1821 and a member of the St. Petersburg Zoological Academy in 1826. For the remainder of his life, Pander lived mainly in his estate near his hometown of Riga while still taking time to travel and continue his work in the fields of geology and paleontology, though none of his later work gained significant recognition. Pander died on 22 September 1865 in St. Petersburg. Though somewhat inconclusive, Pander’s work with chick embryos and their components marked the beginning of a more advanced understanding of embryology."}, {"url": "https://www.nature.com/articles/ncb3347", "page_content": "Edwards, R. G., Bavister, B. D. & Steptoe, P. C. Early stages of fertilization in vitro of human oocytes matured in vitro. Nature 221, 632–635 (1969).\n\nEdwards, R. G., Steptoe, P. C. & Purdy, J. M. Fertilization and cleavage in vitro of preovulator human oocytes. Nature 227, 1307–1309 (1970).\n\nKoot, Y. E., Teklenburg, G., Salker, M. S., Brosens, J. J. & Macklon, N. S. Molecular aspects of implantation failure. Biochim. Biophys. Acta 1822, 1943–1950 (2012).\n\nEnders, A. C., Schlafke, S. & Hendrickx, A. G. Differentiation of the embryonic disc, amnion, and yolk sac in the rhesus monkey. Am. J. Anat. 177, 161–185 (1986).\n\nPera, M. F. & Trounson, A. O. Human embryonic stem cells: prospects for development. Development 131, 5515–5525 (2004).\n\nWeimar, C. H., Post Uiterweer, E. D., Teklenburg, G., Heijnen, C. J. & Macklon, N. S. In-vitro model systems for the study of human embryo-endometrium interactions. Reprod. Biomed. Online 27, 461–476 (2013).\n\nBedzhov, I., Leung, C. Y., Bialecka, M. & Zernicka-Goetz, M. In vitro culture of mouse blastocysts beyond the implantation stages. Nat. Protoc. 9, 2732–2739 (2014).\n\nBedzhov, I. & Zernicka-Goetz, M. Self-organizing properties of mouse pluripotent cells initiate morphogenesis upon implantation. Cell 156, 1032–1044 (2014).\n\nHertig, A. T., Rock, J. & Adams, E. C. A description of 34 human ova within the first 17 days of development. Am. J. Anat. 98, 435–493 (1956).\n\nHur, Y. S. et al. Effect of artificial shrinkage on clinical outcome in fresh blastocyst transfer cycles. Clin. Exp. Reprod. Med. 38, 87–92 (2011).\n\nMorris, S. A. et al. Dynamics of anterior-posterior axis formation in the developing mouse embryo. Nat. Commun. 3, 673 (2012).\n\nPera, M. F. et al. What if stem cells turn into embryos in a dish? Nat. Methods 12, 917–919 (2015).\n\nGardner, D. K. The impact of physiological oxygen during culture, and vitrification for cryopreservation, on the outcome of extended culture in human IVF. Reprod. Biomed. Online 32, 137–141 (2015).\n\nCovello, K. L. et al. HIF-2α regulates Oct-4: effects of hypoxia on stem cell function, embryonic development, and tumor growth. Genes Dev. 20, 557–570 (2006).\n\nEzashi, T., Das, P. & Roberts, R. M. Low O2 tensions and the prevention of differentiation of hES cells. Proc. Natl Acad. Sci. USA 102, 4783–4788 (2005).\n\nRivera-Perez, J. A., Jones, V. & Tam, P. P. Culture of whole mouse embryos at early postimplantation to organogenesis stages: developmental staging and methods. Methods Enzymol. 476, 185–203 (2010).\n\nBedzhov, I., Graham, S. J., Leung, C. Y. & Zernicka-Goetz, M. Developmental plasticity, cell fate specification and morphogenesis in the early mouse embryo. Phil. Trans. R. Soc. B 369 (2014).\n\nRoode, M. et al. Human hypoblast formation is not dependent on FGF signalling. Dev. Biol. 361, 358–363 (2012).\n\nTeklenburg, G. et al. Cell lineage specific distribution of H3K27 trimethylation accumulation in an in vitro model for human implantation. PLoS ONE 7, e32701 (2012).\n\nNiakan, K. K. & Eggan, K. Analysis of human embryos from zygote to blastocyst reveals distinct gene expression patterns relative to the mouse. Dev. Biol. 375, 54–64 (2013).\n\nO’Leary, T. et al. Tracking the progression of the human inner cell mass during embryonic stem cell derivation. Nat. Biotechnol. 30, 278–282 (2012).\n\nNiakan, K. K., Han, J., Pedersen, R. A., Simon, C. & Pera, R. A. Human pre-implantation embryo development. Development 139, 829–841 (2012).\n\nHaigh, T., Chen, C., Jones, C. J. & Aplin, J. D. Studies of mesenchymal cells from 1st trimester human placenta: expression of cytokeratin outside the trophoblast lineage. Placenta 20, 615–625 (1999).\n\nDobreva, M. P., Pereira, P. N., Deprest, J. & Zwijsen, A. On the origin of amniotic stem cells: of mice and men. Int. J. Dev. Biol. 54, 761–777 (2010).\n\nHill, J. P. The developmental history of the primates. Phil. Trans. R. Soc. Lond. B 221, 45–178 (1932).\n\nLuckett, W. P. The development of primordial and definitive amniotic cavities in early Rhesus monkey and human embryos. Am. J. Anat. 144, 149–167 (1975).\n\nPalis, J. & Yoder, M. C. Yolk-sac hematopoiesis: the first blood cells of mouse and man. Exp. Hematol. 29, 927–936 (2001).\n\nTaniguchi, K. et al. Lumen formation is an intrinsic property of isolated human pluripotent stem cells. Stem Cell Rep. 5, 954–962 (2015).\n\nBryant, D. M. et al. A molecular switch for the orientation of epithelial cell polarization. Dev. Cell 31, 171–187 (2014).\n\nBryant, D. M. & Mostov, K. E. From cells to organs: building polarized tissue. Nat. Rev. Mol. Cell Biol. 9, 887–901 (2008).\n\nVuoristo, S., Jedrusik, A., Shahbazi, M. N. & Zernicka-Goetz, M. Culture of human embryos through implantation stages in vitro. Protoc. Exch. (2016)10.1038/protex.2016.017.\n\nLancaster, M. A. et al. Cerebral organoids model human brain development and microcephaly. Nature 501, 373–379 (2013).\n\nLee, G. Y., Kenny, P. A., Lee, E. H. & Bissell, M. J. Three-dimensional culture models of normal and malignant breast epithelial cells. Nat. Methods 4, 359–365 (2007)."}, {"url": "https://handwiki.org/wiki/Biography:Heinz_Christian_Pander", "page_content": "Short description : Baltic German geologist\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist.\n\nBiography\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.[2][3] His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.[4] Pander is credited as the first scientist to describe primitive creatures known as conodonts.[5][6]\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.[7]\n\nHe died in Saint Petersburg.\n\nEponyms\n\nPander's eponyms are:\n\nPander's islands or blood islands\n\nSelected writings\n\nBeiträge zur Entwickelungsgeschichte des Hühnchens im Eye , (Contributions to the embryology involving the chick egg), (1817).\n\n, (Contributions to the embryology involving the chick egg), (1817). Beiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions on the natural history of the Baltic regions) Dorpat, (1820).\n\n, (Contributions on the natural history of the Baltic regions) Dorpat, (1820). Vergleichende Osteologie (Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Beiträge zur geognosie des russischen reiches , (Contributions to the geology of the Russian Empire), 1830.\n\n, (Contributions to the geology of the Russian Empire), 1830. Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856).\n\n(Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856). Ueber die Placodermen des devonischen Systems , (On placoderms of the Devonian system), 1857.\n\n, (On placoderms of the Devonian system), 1857. Über die ctenodopterinen des devonischen systems , 1858\n\n, 1858 Über die saurodipterinen, dendrodonten, glyptolepiden und cheirolepiden des devonischen systems, 1860.[8]\n\nSee also\n\nList of Baltic German scientists\n\nReferences\n\n\n\n\n\n\n\n"}, {"url": "https://www.nature.com/articles/s41467-021-25186-2", "page_content": "Cynomolgus macaque\n\nHealthy cynomolgus monkeys (Macaca fascicularis), ranging from 5 to 12 years old, were used in this study. All animals were housed either at the facility of Yunnan Key Laboratory of Primate Biomedical Research in China or at Astrid Fagræus laboratory in Karolinska Institutet in Sweden. Both facilities are accredited by AAALAC International. The ethics and all experimental protocols were approved in advance by the Institutional Animal Care and Use Committee of LPBR in China (KBI K001115033/01,01) and by the Jordbruksverket in Sweden (ethical permit number N277/14). Animals involved in this study were never used for other treatments.\n\nIn vitro fertilization\n\nNHP embryos were collected as described previously48. In brief, healthy female monkeys aged 5–8 years with regular menstrual cycles were selected as oocyte donors. Before superovulation, female animals were treated with recombinant human follicle-stimulating hormone for 8 days, and then were administered recombinant human chorionic gonadotropin alfa (rhCG) on day 9. Oocytes were collected by laparoscopic follicular aspiration 32–35 h after rhCG administration. MII (first polar body present) oocytes were performed with intracytoplasmic sperm injection to generate zygotes and the fertilization was confirmed by the presence of two pronuclei. Zygotes were cultured in embryo culture medium-9 (HECM-9) containing 10% fetal calf serum in a 37 °C incubator supplying 5% CO 2 until the blastocyst stage. Blastocysts were then used for embryo transfer or postimplantation in vitro culture. The homemade HECM-9 contains polyvinyl alcohol (0.1 mg/mL), calcium chloride (1.9 mM), magnesium chloride (0.46 mM), potassium chloride (3.0 mM), sodium chloride (113.8 mM), sodium bicarbonate (25.0 mM), sodium lactate (4.5 mM), Minimum Essential Medium (MEM) amino acid, MEM nonessential amino acid, and gentamicin (10 mg/mL). Details of chemicals were listed in Supplementary Data 6.\n\nEmbryo transfer and pregnancy diagnosis\n\nEmbryos were transferred into the oviducts of the matched recipient monkey as described in the previous study49. A total of 27 female monkey recipients with proper hormone levels of β-estradiol and progesterone were used as surrogate recipients. Each recipient received two to four blastocysts. The pregnancy was primarily diagnosed by ultrasonography at 2–3 weeks after embryo transfer. Clinical pregnancy and the number of fetuses were confirmed by fetal cardiac activity and the presence of gestation sacs. When terminating a pregnancy, a cesarean section was performed. Tissue from the umbilical cord, ear, and tail was collected for genotyping.\n\nGeneration of ISL1 NHP mutant embryos\n\nNHP MII zygotes were injected with a mix of Cas9 protein and gRNAs. Intracytoplasmic injections were performed with a Nikon microinjection system under standard conditions. The embryos were cultured in HECM-9 supplemented with 10% fetal calf serum in a 37 °C incubator supplying 5% CO 2 . Genetically modified embryos with high quality from morula to blastocyst stage were used for further studies.\n\nIn vitro embryo culture\n\nTo culture blastocyst beyond the implantation stage, we applied an optimized protocol based on the human embryo culture protocol from Zernicka-Goetz’s group50. Frozen NHP blastocysts were thawed right before culturing by using the Thawing Media (Kizatato) and cultured in blastocyst culture medium (Origio) for at least 4 h to recover. Blastocysts were then treated with acidic Tyrode’s solution to remove the zona pellucida and transferred to an ibiTreat 8-well μ-plate (Ibidi) containing 300 µL of pre-equilibrated in vitro culture medium 1 (IVC1). On the second day, 150 µL of IVC1 was carefully removed and 200 µL pre-equilibrated in vitro culture medium 2 was added. Blastocyst growth was monitored and the medium was changed every 2 days until the termination of experiments.\n\nSingle-cell dissociation and RNA sequencing\n\nNHP embryos at Days 10, 12, and 14 were washed with phosphate-buffered saline (PBS) and treated with TrypLE Express Enzyme for 30 min at 37 °C. After incubation, samples were gently dissociated into single cells by mouth pipetting.\n\nSingle cells were transferred into an RNase-free, low-cell-adhesion 1.5 mL tube and centrifuged at 300 × g for 5 min. The supernatant, containing some remaining cells, was transferred into a new tube for genotyping. The cell pellet was resuspended with 40 µL of PBS containing 2% bovine serum albumin. Cells were loaded into the 10x Genomics Chromium system within 30 min after dissociation. 10x Genomics v3 libraries were prepared according to the manufacturer’s instructions. Libraries were sequenced with a minimum coverage of 30,000 raw reads per cell on an Illumina NovaSeq with paired-end sequencing.\n\nReads mapping, gene expression counting, and correction\n\nSequencing data were aligned and quantified by using the Cell Ranger Pipeline v3.1.0 against the ensemble genome build Macaca_fascicularis_5.0 release 9651. Ambient RNA contamination was estimated through the levels of choriogonadotropin expression in epiblast (POU5F1-positive) cells and removed from the count matrix using SoupX52. A gene was retained for analysis if it showed expression in at least three cells. Each sample was filtered based on the expression level of mitochondrial genes (<7.5%) and the number of expressed genes. Details on the estimated contamination in each sample, the filtering criteria, and the number of cells retained for the analysis are provided in Supplementary Fig. 2a.\n\nReads mapping and gene expression counting of in vivo dataset\n\nThe raw, archived scRNA-sequencing data from in vivo cynomolgus embryos19 was downloaded from the GEO database under accession code GSE74767 and processed using TrimGalore v0.6.1. The reads passing quality control were aligned against the ensemble genome build Macaca_fascicularis_5.0 release 96 using STAR v2.5.3 and counted using featureCounts v1.5.2. Cells expressing at least 1000 genes were kept for integration with our dataset.\n\nData integration, dimensionality reduction, and clustering\n\nFor analysis of the scRNA-sequencing data from the wild-type in vitro cultured embryos, we integrated the filtered, corrected count matrices of the different batches for each day separately using the reciprocal principal component analysis (PCA) approach implemented in the Seurat package v3.1.353,54 based on 30 dimensions and 5000 anchor features. After integration, we performed PCA analysis on the integrated data followed by embedding it into low-dimensional space with UMAP as implemented in the R-package “uwot.” For clustering, the shared nearest-neighbor graph was constructed on the UMAP embedding by calling the FindNeighbors() function followed by the identification of clusters using the FindClusters() function, both part of the Seurat package. In some samples, this clustering approach separated large-cell groups into small subclusters with no distinct biological meaning in the context of this manuscript. In these cases, the clusters were recombined manually and both the unsupervised and the manually adjusted clustering was reported in the manuscript.\n\nTo integrate the scRNA-sequencing data from in vivo cynomolgus embryos19 with our dataset, we combined the three time points (Days 10, 12, and 14) from our dataset for each batch separately and did the same for the in vivo data from E08, E09, E13, and E14, resulting in three separate datasets. Normalization, scaling, and PCA was performed separately on each of these datasets, after which they were combined using the reciprocal PCA approach described above based on 30 dimensions and 2000 anchor features.\n\nFor the analysis of the wild-type and ISL1 mutant embryos, the different batches were integrated separately for each day by the same reciprocal PCA approach outlined above based on 30 dimensions and 5000 anchor features using the wild-type datasets as reference. Dimensionality reduction and clustering were performed as described above.\n\nTo integrate our dataset with the scRNA-sequencing data from the in vivo human Carnegie stage 7 embryo37, M. fascicularis gene IDs were converted to Homo sapiens gene symbols according to the ortholog list from Ensemble. Normalization, scaling, and PCA was performed separately on each of the batches (wild-type and mutant embryos, Day 14) from our dataset and the human dataset separately, after which they were combined using the reciprocal PCA approach described above based on 30 dimensions and 2000 anchor features. Dimensionality reduction and clustering were performed as described above.\n\nDifferential gene expression analysis\n\nMainly due to the differences in cell numbers, we observed a significant variation in sequencing depth between samples in our dataset (Supplementary Fig. 2). It has recently been shown that the effect of differences in the read depth on differential gene expression analysis can be minimized by using regularized negative binomial regression as implemented in the R-package SCtransform55. Thus, all differential gene expression analysis was performed using a t test on Pearson residuals after SCtransformation of the raw, filtered counts of the integrated Seurat object as implemented previously55. Gene expression data depicted throughout the manuscript in feature plots or violin plots are SCtransformed data. Expression data depicted in heatmaps ﻿are scaled, log-transformed expression values normalized to the total counts for each cell calculated through running the NormalizeData() function, followed by the ScaleData() function from the Seurat package.\n\nFor analysis of PPIs and enriched GO terms among differentially expressed genes, M. fascicularis gene IDs were converted to H. sapiens gene symbols according to the orthologue list from Ensemble. Interaction networks of differentially expressed genes were created using STRING v11.0 and analyzed for enriched GO terms as well as enriched STRING network clusters using standard settings56.\n\nVisualization of gene signatures\n\nScoring and visualization of gene signatures were performed using the Single Cell Signature Explorer v3.157. Gene signatures were created by identifying orthologs for the genes that have been previously described to mark the naive and primed state of pluripotency in hESCs21 in the M. fascicularis genome according to the ortholog list provided from Ensemble through BioMart58.\n\nPseudotime analysis\n\nPseudotime analysis was performed using Monocle3 v0.259,60,61. ﻿The principal graph was learned on the UMAP embedding extracted from the integrated Seurat object. Differentially expressed genes were calculated on the raw, filtered count matrix extracted from the integrated Seurat object using the ﻿Moran’s I test implemented in the graph_test() function from the Monocle3 package. The genes were ranked according to their Moran’s I and the top 100 genes were selected for display in the heatmap and supplied as Supplementary Data 2.\n\nGRN analysis\n\nGRN analysis was performed using the R-package SCENIC v1.1.2-232 and the command line interface of the Python implementation pySCENIC. M. fascicularis gene IDs were converted to H. sapiens gene symbols according to the ortholog list from Ensemble. The raw, filtered count matrix extracted from the integrated Seurat object was prefiltered and genes with at least 39 counts, equal to at least three UMI counts in 1% of the cells, present in at least 13 cells, equal to 1% of the cells, were used as input for the CLI. The human motif collection v9 and the cisTarget databases for hg38 were used in the pipeline and downloaded from https://resources.aertslab.org/cistarget/. Thresholds used for binarization were calculated depending on the distribution of the AUC values, which were tested with Hartigan’s Dip Test. For unimodal distributions, the threshold was set as mean plus two standard deviations. For bimodal distributions, the threshold was defined as the trough in between two peaks, which was solved as a minimization problem on the kernel smoothed density62. After binarization, regulons showing activity in at least 1% of the cells were included in the downstream analysis.\n\nCulture of hESCs\n\nhESCs used in this study include HES-3 human ES cells and H9 human ES cells (WiCell). Genetic modification of the ISL1 locus to generate ISL1-null hESCs was performed on HES-3 cells by applying CRISPR/Cas9 with the same gRNAs used in NHP blastocysts. Two ISL1-knockout cell lines were generated, named ISL1-null_c15 and ISL1-null_c51, and genotyped (Supplementary Fig. 1a). All cell lines were validated as karyotypically normal by Cell Guidance Systems (UK) (Supplementary Fig. 9a). Mycoplasma contamination test was performed regularly as negative. hESCs were maintained in a standard feeder-free culture system using mTeSR1 medium on 1% Matrigel or Essential 8 medium on 1% vitronectin. Cells were passaged every 4–5 days and visually examined during each passage to ensure the absence of spontaneous differentiation. Work with hESCs was carried out according to Swedish legislation following the recommendations of the Swedish National Council on Medical Ethics.\n\nGenotyping\n\nFor bulk genotyping, cells leftover from the single-cell sequencing were pooled. Genomic DNA was extracted by the phenol–chloroform method. DNA fragments covering both gRNA target sites were PCR amplified and ligated to TOPO TA cloning vectors. At least 50 bacteria clones per sample were picked for Sanger sequencing and used to estimate the genomic mutation rate.\n\nFor single-cell genotyping, dissociation was performed as described further above. Cells were manually picked and transferred into 5 µL of QuickExtract solution to extract DNA, following the manufacturer’s protocol. After the first round of high-fidelity PCR amplification (Phusion, NEB) using primers annealing to the ISL1 region that covers the two gRNA binding sites, PCR products were purified using AMPure XP magnetic beads. Later, the second round of PCR amplification was performed using the same primers. The PCR products were analyzed by DNA agarose gel electrophoresis. Primers used for genotyping are listed in Supplementary Data 6.\n\nOff-target assay\n\nCas-OFFinder was applied to search for potential off-target sites with maximal two mismatches and two bulges18. Among all off-target candidates of both gRNAs, targets located on gene exons were selected for testing. The DNA fragments of target sites were PCR amplified and the sequences were confirmed by Sanger sequencing. Primers are listed in Supplementary Data 6.\n\nRNA extraction and quantitative real-time PCR\n\nTotal message RNA was extracted by Direct-zol RNA MiniPrep Kits and cDNA libraries were prepared using GoScript Reverse Transcriptase. Quantitative real-time PCR was performed by PowerUp SYBR Green Master Mix on ABI 7500Fast machine. Primers and chemicals are listed in Supplementary Data 6.\n\nTranswell assay\n\nThe transwell assay was performed based on previous work by Zheng et al.38. In brief, it was performed on Transwell 12-well plates with permeable polyester membrane inserts (0.4 μm, Corning). The membrane inserts were coated with 1% Geltrex diluted in Dulbecco’s Modified Eagle’s Medium/Nutrient Mixture-12 for 1 h before use. hESCs were collected and resuspended in the culture medium containing Y-27632 (10 μM) and seeded onto the membrane insert at a density of 3 × 104 cells/cm2. Eighteen hours after seeding, the culture medium was changed to E6 medium supplemented with basic fibroblast growth factor (bFGF) (20 ng/mL) and BMP4 (50 ng/mL) and cultured for 48 h. On day 3, undifferentiated hESCs were collected, resuspended in E6 supplemented with bFGF (20 ng/mL), and seeded at a density of 9 × 104 per well on freshly coated 12-well plates. The membrane inserts were washed with E6 + bFGF and transferred on top of the reseeded hESCs. Cells were collected after 48 h of analysis. Two wild-type hESC lines (HES-3 and H9) and two ISL1-null lines were used in this assay. Both of the wild-type cell lines showed comparable results, as did the two ISL1-null lines.\n\nNoggin inhibition, BMP4 rescue, and ISL1 modified mRNA rescue were carried out in the transwell assay as follows. Noggin (500 ng/mL) and BMP4 (20 ng/mL) were administered into E6 + bFGF in the lower part of the transwell inserts from day 3, after transferring inserts on top of hESCs. The ISL1 modRNA carrying a GFP reporter sequence was designed to encode either a wild-type ISL1 (mod-ISL1wt) or an ISL1 with a three amino acid deletion (mod-ISL1∆9nt) and in vitro synthesized according to the previous work63. Briefly, modRNA was synthesized in vitro by using T7 RNA polymerase-mediated transcription from linearized DNA templates incorporating generic 5′-untranslated region (UTR), targeted gene, 3′-UTR, and a poly-A tail. The modRNA was then purified using Amion MEGAclear spin columns and treated with Antarctic phosphatase for 30 min at 37 °C. After repurification, the modRNA was quantified by Nanodrop and diluted to ~1 μg/μl for use. One milligram of purified modRNA was introduced into each sample of AMLCs on insert membrane on Day 3 by Lipofectamine RNAiMAX and incubated for 4 h. The inserts were then transferred on top of hESCs to induce MeLC formation.\n\nDirected differentiation of hESCs to MeLCs\n\nDifferentiation of hESCs to MeLCs was done in chemically defined media as previously described35. In brief, the posterior primitive streak was induced by the addition of bFGF (20 ng/mL), the phosphoinositide 3-kinase inhibitors LY294002 (10 μM) and BMP4 (10 ng/mL). The anterior primitive streak was induced with the same factors, and, additionally, activin A (50 ng/mL). After 40 h, cells were harvested. RNA extraction, reverse transcription, and quantitative real-time PCR were performed as detailed further above with 200 ng RNA as input for RT reaction. Primers and chemicals are listed in Supplementary Data 6.\n\nMicrofluidic assay of embryonic-like sac\n\nThis assay was performed as previously described64. Briefly, the microfluidic device is fabricated by bonding a polydimethylsiloxane structure layer to a coverslip. Geltrex is diluted to 70% using E6 medium and loaded into the central gel channel separated from the side channels by trapezoid-shaped supporting posts. Upon gelation, the Geltrex matrix would generate concave Geltrex pockets between supporting posts for cell seeding. hESCs suspended in mTeSR1 medium was introduced into the cell loading channel and allowed to settle and cluster in the gel pockets. After hESC cluster formation, mTeSR1 medium was replaced by a basal medium (E6 and 20 ng/mL bFGF) and 20 ng/mL BMP4 was supplemented only into the cell seeding channel. After 18 h of BMP4 stimulation, the BMP4 medium was replaced by the basal medium. The microfluidic devices were fixed 48 h after the hESCs clusters were exposed to BMP4. To test the BMP4 signaling function, Noggin (50 and 500 ng/mL) was supplemented into the basal medium into the cell loading channel for 48 h. The hESC clusters were then fixed and immunofluorescent staining was performed.\n\nCryosection of NHP embryos\n\nDay 14 NHP embryos were fixed by 2% paraformaldehyde overnight at 4 °C and then washed by PBS. Dehydrate the fixed embryos with 30% sucrose overnight at 4 °C, and then embedded in OCT and froze in liquid nitrogen. Frozen blocks were performed cryosection on Cryostat (Thermo CryoStar NX70) according to the manufacturer’s protocol. Two wild-type and three ISL1 mutant embryos were used for cryosection and then performed immunofluorescent staining.\n\nImmunohistochemistry\n\nImmunohistochemistry of cells from the transwell assay was performed following standard procedures. Briefly, cells were fixed in 2% paraformaldehyde for 30 min at room temperature and washed with PBS. Cells were blocked in blocking buffer (serum diluted in PBS with 0.1% Triton X-100) for 1 h and then incubated with primary antibodies diluted in blocking buffer overnight at 4 °C. Cells were washed with PBS supplemented with 0.1% Tween-20 (PBS-T) and incubated with secondary antibodies diluted in blocking buffer for 2 h at room temperature. The embryonic-like sac structure was assessed by immunohistochemistry using the same protocol as published before64. Briefly, cells were fixed in 4% paraformaldehyde (PFA) for 12 h and then permeabilized in 0.1% sodium dodecyl sulfate (SDS) for another 3 h. After blocking in 4% serum/PBS, samples were incubated with primary antibody solution for 24 h at 4 °C, followed by incubation with secondary antibody solution for another 24 h at 4 °C. After staining, all samples were washed with PBS-T and then mounted for imaging. The dilution for the primary antibodies used in this study were anti-ISL1 (1:300), anti-OCT4 (1:200), anti-NANOG (1:400), anti-BRA (1:600), anti-MIXL1 (1:100), anti-GABRP (1:300), anti-SOX17 (1:400), anti-GATA3 (1:900), anti-VIM (1:2000), and anti-TFAP2c (1:100). Secondary antibodies were used in a dilution of 1:500. Details of the antibodies are listed in Supplementary Data 6. Confocal micrographs were acquired by Zeiss 700 LSM confocal microscope or Olympus spinning-disc confocal microscope (DSUIX18) equipped with an EMCCD camera (iXon X3, Andor). The brightfield morphologic images of embryonic-like sacs were acquired by Zeiss Observer.Z1 microscope equipped with a monochrome CCD camera (AxioCam, Carl Zeiss MicroImaging). Images were analyzed by iMaris.\n\nWestern blot\n\nWestern blot was performed according to standard protocol. Briefly, to extract the protein from AMLCs, the cells were washed twice with cold PBS and RIPA buffer supplemented with protease and Phophatase Inhibitor Cocktail was added. Lysates were centrifuged at 14000 × g for 15 min at 4 °C and the supernatants were transferred to new tubes. BCA assay was performed to quantify the concentration of protein. After dilution, samples were aliquoted, mixed with LDS sample buffer, and denatured. Ten milligrams of total protein was loaded to run a 10% Bis-Tris protein gel in MOPS SDS running buffer and then transferred to a 0.2 μm PVDF membrane. The membrane was blocked with 5% milk/TBS-T for 30 min at room temperature and incubated with diluted anti-ISL1 (1:1000) or anti-β-actin (1:5000) antibody in blocking buffer overnight at 4 °C. The membrane was washed with TBS-T 10 min three times and then incubated in diluted horseradish peroxidase-conjugated secondary antibody (1:10,000) for 1 h at room temperature. After washing with TBS-T, the membrane was treated with ECL substrate and imaged using ChemiDoc Imaging Systems (Bio-Rad). Antibodies and chemicals used are listed in Supplementary Data 6. The full scan blot is presented in the Source data file.\n\nQuantification and statistical analysis\n\nValues are shown as the mean value ± SEM. Continuous data were analyzed using Student’s t test. If not stated differently, p values or adjusted p values (where appropriate) <0.05 were considered statistically significant. Each experiment was repeated independently at least three times. Details on the samples (e.g., number of biological replicates) are indicated in figure legends. Graphs were generated using Prism or R.\n\nReporting summary\n\nFurther information on research design is available in the Nature Research Reporting Summary linked to this article."}, {"url": "https://www.nature.com/articles/s41556-018-0144-x/", "page_content": "Oppenheimer, J. M. Essays in the History of Embryology and Biology (The MIT Press, Cambridge, MA, 1967).\n\nTarkowski, A. K. Experiments on the development of isolated blastomers of mouse eggs. Nature 184, 1286–1287 (1959).\n\nGardner, R. L. Mouse chimeras obtained by the injection of cells into the blastocyst. Nature 220, 596–597 (1968).\n\nTarkowski, A. K. Mouse chimaeras developed from fused eggs. Nature 190, 857–860 (1961).\n\nZijlstra, M., Li, E., Sajjadi, F., Subramani, S. & Jaenisch, R. Germ-line transmission of a disrupted beta 2-microglobulin gene produced by homologous recombination in embryonic stem cells. Nature 342, 435–438 (1989).\n\nKoller, B. H. & Smithies, O. Inactivating the beta 2-microglobulin locus in mouse embryonic stem cells by homologous recombination. Proc. Natl Acad. Sci. USA 86, 8932–8935 (1989).\n\nThompson, S., Clarke, A. R., Pow, A. M., Hooper, M. L. & Melton, D. W. Germ line transmission and expression of a corrected HPRT gene produced by gene targeting in embryonic stem cells. Cell 56, 313–321 (1989).\n\nDavies, J. Using synthetic biology to explore principles of development. Development 144, 1146–1158 (2017).\n\nPera, M. F. Human embryo research and the 14-day rule. Development 144, 1923–1925 (2017).\n\nHammond, J. Jr. Recovery and culture of tubal mouse ova. Nature 163, 28 (1949).\n\nWhitten, W. K. Culture of tubal mouse ova. Nature 177, 96 (1956).\n\nHo, Y., Wigglesworth, K., Eppig, J. J. & Schultz, R. M. Preimplantation development of mouse embryos in KSOM: augmentation by amino acids and analysis of gene expression. Mol. Reprod. Dev. 41, 232–238 (1995).\n\nSvoboda, P., Stein, P., Hayashi, H. & Schultz, R. M. Selective reduction of dormant maternal mRNAs in mouse oocytes by RNA interference. Development 127, 4147–4156 (2000).\n\nWianny, F. & Zernicka-Goetz, M. Specific interference with gene function by double-stranded RNA in early mouse development. Nat. Cell Biol. 2, 70–75 (2000).\n\nTam, P. P. & Loebel, D. A. Gene function in mouse embryogenesis: get set for gastrulation. Nat. Rev. Genet. 8, 368–381 (2007).\n\nBischoff, M., Parfitt, D. E. & Zernicka-Goetz, M. Formation of the embryonic-abembryonic axis of the mouse blastocyst: relationships between orientation of early cleavage divisions and pattern of symmetric/asymmetric divisions. Development 135, 953–962 (2008).\n\nStrnad, P. et al. Inverted light-sheet microscope for imaging mouse pre-implantation development. Nat. Methods 13, 139–142 (2016).\n\nPlachta, N., Bollenbach, T., Pease, S., Fraser, S. E. & Pantazis, P. Oct4 kinetics predict cell lineage patterning in the early mammalian embryo. Nat. Cell Biol. 13, 117–123 (2011).\n\nWhite, M. D. et al. Long-lived binding of Sox2 to DNA predicts cell fate in the four-cell mouse embryo. Cell 165, 75–87 (2016).\n\nRossant, J. & Tam, P. P. Blastocyst lineage formation, early embryonic asymmetries and axis patterning in the mouse. Development 136, 701–713 (2009).\n\nWang, H. & Dey, S. K. Roadmap to embryo implantation: clues from mouse models. Nat. Rev. Genet. 7, 185–199 (2006).\n\nBedzhov, I., Graham, S. J., Leung, C. Y. & Zernicka-Goetz, M. Developmental plasticity, cell fate specification and morphogenesis in the early mouse embryo. Philos. T. Roy., Soc. B 369, 20130538 (2014).\n\nMacklon, N. S., Geraedts, J. P. & Fauser, B. C. Conception to ongoing pregnancy: the ‘black box’ of early pregnancy loss. Hum. Reprod. Update 8, 333–343 (2002).\n\nLatos, P. A. & Hemberger, M. From the stem of the placental tree: trophoblast stem cells and their progeny. Development 143, 3650–3660 (2016).\n\nTakaoka, K. & Hamada, H. Cell fate decisions and axis determination in the early mouse embryo. Development 139, 3–14 (2012).\n\nRobertson, E. J. Dose-dependent Nodal/Smad signals pattern the early mouse embryo. Semin. Cell Dev. Biol. 32, 73–79 (2014).\n\nStower, M. J. & Srinivas, S. Heading forwards: anterior visceral endoderm migration in patterning the mouse embryo. Philos. T. Roy. Soc. B 369, 20130546 (2014).\n\nBeck, S. et al. Extraembryonic proteases regulate Nodal signalling during gastrulation. Nat. Cell Biol. 4, 981–985 (2002).\n\nBen-Haim, N. et al. The nodal precursor acting via activin receptors induces mesoderm by maintaining a source of its convertases and BMP4. Dev. Cell 11, 313–323 (2006).\n\nRivera-Perez, J. A., Mager, J. & Magnuson, T. Dynamic morphogenetic events characterize the mouse visceral endoderm. Dev. Biol. 261, 470–487 (2003).\n\nThomas, P. & Beddington, R. Anterior primitive endoderm may be responsible for patterning the anterior neural plate in the mouse embryo. Curr. Biol. 6, 1487–1496 (1996).\n\nYamamoto, M. et al. Nodal antagonists regulate formation of the anteroposterior axis of the mouse embryo. Nature 428, 387–392 (2004).\n\nLeitch, H. G., Tang, W. W. & Surani, M. A. Primordial germ-cell development and epigenetic reprogramming in mammals. Curr. Top. Dev. Biol. 104, 149–187 (2013).\n\nOhinata, Y. et al. Blimp1 is a critical determinant of the germ cell lineage in mice. Nature 436, 207–213 (2005).\n\nHsu, Y. C. Post-blastocyst differentiation in vitro. Nature 231, 100–102 (1971).\n\nHsu, Y. C. Differentiation in vitro of mouse embryos beyond the implantation stage. Nature 239, 200–202 (1972).\n\nJenkinson, E. J. & Wilson, I. B. In vitro support system for the study of blastocyst differentiation in the mouse. Nature 228, 776–778 (1970).\n\nPienkowski, M., Solter, D. & Koprowski, H. Early mouse embryos: growth and differentiation in vitro. Exp. Cell Res. 85, 424–428 (1974).\n\nWiley, L. M. & Pedersen, R. A. Morphology of mouse egg cylinder development in vitro: a light and electron microscopic study. J. Exp. Zool. 200, 389–402 (1977).\n\nWilson, I. B. & Jenkinson, E. J. Blastocyst differentiation in vitro. J. Reprod. Fertil. 39, 243–249 (1974).\n\nCopp, A. J. The mechanism of mouse egg-cylinder morphogenesis in vitro. J. Embryol. Exp. Morphol. 61, 277–287 (1981).\n\nSalomon, D. S. & Sherman, M. I. Implantation and invasiveness of mouse blastocysts on uterine monolayers. Exp. Cell Res. 90, 261–268 (1975).\n\nBedzhov, I., Leung, C. Y., Bialecka, M. & Zernicka-Goetz, M. In vitro culture of mouse blastocysts beyond the implantation stages. Nat. Protoc. 9, 2732–2739 (2014).\n\nMorris, S. A. et al. Dynamics of anterior-posterior axis formation in the developing mouse embryo. Nat. Commun. 3, 673 (2012).\n\nBedzhov, I. & Zernicka-Goetz, M. Self-organizing properties of mouse pluripotent cells initiate morphogenesis upon implantation. Cell 156, 1032–1044 (2014).\n\nLi, S., Edgar, D., Fassler, R., Wadsworth, W. & Yurchenco, P. D. The role of laminin in embryonic cell polarization and tissue organization. Dev. Cell 4, 613–624 (2003).\n\nCoucouvanis, E. & Martin, G. R. Signals for death and survival: a two-step mechanism for cavitation in the vertebrate embryo. Cell 83, 279–287 (1995).\n\nHoppe, P. S., Coutu, D. L. & Schroeder, T. Single-cell technologies sharpen up mammalian stem cell research. Nat. Cell Biol. 16, 919–927 (2014).\n\nXue, Z. et al. Genetic programs in human and mouse early embryos revealed by single-cell RNA sequencing. Nature 500, 593–597 (2013).\n\nDeng, Q., Ramskold, D., Reinius, B. & Sandberg, R. Single-cell RNA-seq reveals dynamic, random monoallelic gene expression in mammalian cells. Science 343, 193–196 (2014).\n\nTang, F. et al. Deterministic and stochastic allele specific gene expression in single mouse blastomeres. PLoS ONE 6, e21208 (2011).\n\nBiase, F. H., Cao, X. & Zhong, S. Cell fate inclination within 2-cell and 4-cell mouse embryos revealed by single-cell RNA sequencing. Genome Res. 24, 1787–1796 (2014).\n\nShi, J. et al. Dynamic transcriptional symmetry-breaking in pre-implantation mammalian embryo development revealed by single-cell RNA-seq. Development 142, 3468–3477 (2015).\n\nGoolam, M. et al. Heterogeneity in Oct4 and Sox2 targets biases cell fate in 4-cell mouse embryos. Cell 165, 61–74 (2016).\n\nKalkan, T. & Smith, A. Mapping the route from naive pluripotency to lineage specification. Philos. T. Roy. Soc. B 369, 20130540 (2014).\n\nBoroviak, T. et al. Lineage-specific profiling delineates the emergence and progression of naive pluripotency in mammalian embryogenesis. Dev. Cell 35, 366–382 (2015).\n\nMohammed, H. et al. Single-cell landscape of transcriptional heterogeneity and cell fate decisions during mouse early gastrulation. Cell Rep. 20, 1215–1228 (2017).\n\nDe Los Angeles, A. et al. Hallmarks of pluripotency. Nature 525, 469–478 (2015).\n\nWeinberger, L., Ayyash, M., Novershtern, N. & Hanna, J. H. Dynamic stem cell states: naive to primed pluripotency in rodents and humans. Nat. Rev. Mol. Cell Biol. 17, 155–169 (2016).\n\nNichols, J. & Smith, A. Pluripotency in the embryo and in culture. Cold Spring Harb. Persp. Biol. 4, a008128 (2012).\n\nShahbazi, M. N. et al. Pluripotent state transitions coordinate morphogenesis in mouse and human embryos. Nature 552, 239–243 (2017).\n\nScognamiglio, R. et al. Myc depletion induces a pluripotent dormant state mimicking diapause. Cell 164, 668–680 (2016).\n\nBulut-Karslioglu, A. et al. Inhibition of mTOR induces a paused pluripotent state. Nature 540, 119–123 (2016).\n\nEvans, M. J. & Kaufman, M. H. Establishment in culture of pluripotential cells from mouse embryos. Nature 292, 154–156 (1981).\n\nMartin, G. R. Isolation of a pluripotent cell line from early mouse embryos cultured in medium conditioned by teratocarcinoma stem cells. Proc. Natl Acad. Sci. USA 78, 7634–7638 (1981).\n\nDoetschman, T. C., Eistetter, H., Katz, M., Schmidt, W. & Kemler, R. The in vitro development of blastocyst-derived embryonic stem cell lines: formation of visceral yolk sac, blood islands and myocardium. J. Embryol. Exp. Morphol. 87, 27–45 (1985).\n\nMartin, G. R. & Evans, M. J. Differentiation of clonal lines of teratocarcinoma cells: formation of embryoid bodies in vitro. Proc. Natl Acad. Sci. USA 72, 1441–1445 (1975).\n\nPierce, G. B. Jr. & Verney, E. L. An in vitro and in vivo study of differentiation in teratocarcinomas. Cancer 14, 1017–1029 (1961).\n\nMurry, C. E. & Keller, G. Differentiation of embryonic stem cells to clinically relevant populations: lessons from embryonic development. Cell 132, 661–680 (2008).\n\nten Berge, D. et al. Wnt signaling mediates self-organization and axis formation in embryoid bodies. Cell Stem Cell 3, 508–518 (2008).\n\nEiraku, M. et al. Self-organizing optic-cup morphogenesis in three-dimensional culture. Nature 472, 51–56 (2011).\n\nClevers, H. Modeling development and disease with organoids. Cell 165, 1586–1597 (2016).\n\nvan den Brink, S. C. et al. Symmetry breaking, germ layer specification and axial organisation in aggregates of mouse embryonic stem cells. Development 141, 4231–4242 (2014).\n\nMarikawa, Y., Tamashiro, D. A., Fujita, T. C. & Alarcon, V. B. Aggregated P19 mouse embryonal carcinoma cells as a simple in vitro model to study the molecular regulations of mesoderm formation and axial elongation morphogenesis. Genesis 47, 93–106 (2009).\n\nFuchs, C. et al. Self-organization phenomena in embryonic stem cell-derived embryoid bodies: axis formation and breaking of symmetry during cardiomyogenesis. Cells Tissues Organs 195, 377–391 (2012).\n\nTurner, D. A. et al. Anteroposterior polarity and elongation in the absence of extraembryonic tissues and spatially localised signalling in Gastruloids, mammalian embryonic organoids. Development 144, 3894–3906 (2017).\n\nSimunovic, M. & Brivanlou, A. H. Embryoids, organoids and gastruloids: new approaches to understanding embryogenesis. Development 144, 976–985 (2017).\n\nSimian, M. & Bissell, M. J. Organoids: A historical perspective of thinking in three dimensions. J. Cell Biol. 216, 31–40 (2017).\n\nLee, E. Y., Parry, G. & Bissell, M. J. Modulation of secreted proteins of mouse mammary epithelial cells by the collagenous substrata. J. Cell Biol. 98, 146–155 (1984).\n\nMontesano, R., Schaller, G. & Orci, L. Induction of epithelial tubular morphogenesis in vitro by fibroblast-derived soluble factors. Cell 66, 697–711 (1991).\n\nO’Brien, L. E., Zegers, M. M. & Mostov, K. E. Opinion: Building epithelial architecture: insights from three-dimensional culture models. Nat. Rev. Mol. Cell Biol. 3, 531–537 (2002).\n\nPoh, Y. C. et al. Generation of organized germ layers from a single mouse embryonic stem cell. Nat. Commun. 5, 4000 (2014).\n\nDenker, H. W. Self-organization of stem cell colonies and of early mammalian embryos: recent experiments shed new light on the role of autonomy vs. external instructions in basic body plan development. Cells 5, E39 (2016).\n\nBrons, I. G. et al. Derivation of pluripotent epiblast stem cells from mammalian embryos. Nature 448, 191–195 (2007).\n\nTesar, P. J. et al. New cell lines from mouse epiblast share defining features with human embryonic stem cells. Nature 448, 196–199 (2007).\n\nKojima, Y. et al. The transcriptional and functional properties of mouse epiblast stem cells resemble the anterior primitive streak. Cell Stem Cell 14, 107–120 (2014).\n\nHayashi, K., Ohta, H., Kurimoto, K., Aramaki, S. & Saitou, M. Reconstitution of the mouse germ cell specification pathway in culture by pluripotent stem cells. Cell 146, 519–532 (2011).\n\nSmith, A. Formative pluripotency: the executive phase in a developmental continuum. Development 144, 365–373 (2017).\n\nMorgani, S. M., Metzger, J. J., Nichols, J., Siggia, E. D. & Hadjantonakis, A. K. Micropattern differentiation of mouse pluripotent stem cells recapitulates embryo regionalized cell fate patterning. eLife 7, e32839 (2018).\n\nKunath, T. et al. Imprinted X-inactivation in extra-embryonic endoderm cell lines from mouse blastocysts. Development 132, 1649–1661 (2005).\n\nTanaka, S., Kunath, T., Hadjantonakis, A. K., Nagy, A. & Rossant, J. Promotion of trophoblast stem cell proliferation by FGF4. Science 282, 2072–2075 (1998).\n\nHarrison, S. E., Sozen, B., Christodoulou, N., Kyprianou, C. & Zernicka-Goetz, M. Assembly of embryonic and extraembryonic stem cells to mimic embryogenesis in vitro. Science 356, eaal1810 (2017).\n\nRivron, N. C. et al. Blastocyst-like structures generated solely from stem cells. Nature 557, 106–111 (2018).\n\nKime, C. K. H. et al. Implantation-competent blastocyst-like structures from mouse pluripotent stem cells. bioRxiv. https://doi.org/10.1101/309542 (2018).\n\nSozen, B. A. et al. Self-assembly of embryonic and two extra-embryonic stem cell types into gastrulating embryo structures. Nat. Cell Biol. https://doi.org/10.1038/s41556-018-0147-7 (2018).\n\nPeng, G. et al. Spatial transcriptome for the molecular annotation of lineage fates and cell identity in mid-gastrula mouse embryo. Dev. Cell 36, 681–697 (2016).\n\nEdwards, R. G., Bavister, B. D. & Steptoe, P. C. Early stages of fertilization in vitro of human oocytes matured in vitro. Nature 221, 632–635 (1969).\n\nRock, J. & Menkin, M. F. In vitro fertilization and cleavage of human ovarian eggs. Science 100, 105–107 (1944).\n\nEdwards, R. G., Steptoe, P. C. & Purdy, J. M. Fertilization and cleavage in vitro of preovulator human oocytes. Nature 227, 1307–1309 (1970).\n\nMenezo, Y., Testart, J. & Perrone, D. Serum is not necessary in human in vitro fertilization, early embryo culture, and transfer. Fertil. Steril. 42, 750–755 (1984).\n\nNiakan, K. K. & Eggan, K. Analysis of human embryos from zygote to blastocyst reveals distinct gene expression patterns relative to the mouse. Dev. Biol. 375, 54–64 (2013).\n\nPetropoulos, S. et al. Single-cell RNA-Seq reveals lineage and X chromosome dynamics in human preimplantation embryos. Cell 165, 1012–1026 (2016).\n\nBraude, P., Bolton, V. & Moore, S. Human gene expression first occurs between the four- and eight-cell stages of preimplantation development. Nature 332, 459–461 (1988).\n\nDobson, A. T. et al. The unique transcriptome through day 3 of human preimplantation development. Hum. Mol. Genet. 13, 1461–1470 (2004).\n\nZhu, P. et al. Single-cell DNA methylome sequencing of human preimplantation embryos. Nat. Genet. 50, 12–19 (2018).\n\nStirparo, G. G. et al. Integrated analysis of single-cell embryo data yields a unified transcriptome signature for the human pre-implantation epiblast. Development 145, 158501 (2018).\n\nFogarty, N. M. E. et al. Genome editing reveals a role for OCT4 in human embryogenesis. Nature 550, 67–73 (2017).\n\nWamaitha, S. E. & Niakan, K. K. Human Pre-gastrulation Development. Curr. Top. Dev. Biol. 128, 295–338 (2018).\n\nKoot, Y. E., Teklenburg, G., Salker, M. S., Brosens, J. J. & Macklon, N. S. Molecular aspects of implantation failure. Biochim. Biophys. Acta 1822, 1943–1950 (2012).\n\nWeimar, C. H., Post Uiterweer, E. D., Teklenburg, G., Heijnen, C. J. & Macklon, N. S. In-vitro model systems for the study of human embryo-endometrium interactions. Reprod. Biomed. Online 27, 461–476 (2013).\n\nLindenberg, S., Nielsen, M. H. & Lenz, S. In vitro studies of human blastocyst implantation. Ann. NY Acad. Sci. 442, 368–374 (1985).\n\nHertig, A. T., Rock, J. & Adams, E. C. A description of 34 human ova within the first 17 days of development. Am. J. Anat. 98, 435–493 (1956).\n\nHertig, A. T. On the development of the amnion and exoccelomic membrane in the previllous human ovum. Yale J. Biol. Med. 18, 107–115 (1945).\n\nHertig, A. T. Angiogenesis in the early human chorion and in the primary placenta of the macaque monkey. Contrib. Embryol. 25, 37–82 (1935).\n\nOkae, H. et al. Derivation of human trophoblast stem cells. Cell Stem Cell 22, 50–63 (2018).\n\nBurton, G. J. & Fowden, A. L. The placenta: a multifaceted, transient organ. Philos. T. Roy. Soc. B 370, 20140066 (2015).\n\nLuckett, W. P. Origin and differentiation of the yolk sac and extraembryonic mesoderm in presomite human and rhesus monkey embryos. Am. J. Anat. 152, 59–97 (1978).\n\nPereira, P. N. et al. Amnion formation in the mouse embryo: the single amniochorionic fold model. BMC Dev. Biol. 11, 48 (2011).\n\nWitschi, E. Migration of the germ cells of human embryos from the yolk sac to the primitive gonadal folds. Contrib. Embryol. 32, 67–80 (1948).\n\nLuckett, W. P. The development of primordial and definitive amniotic cavities in early Rhesus monkey and human embryos. Am. J. Anat. 144, 149–167 (1975).\n\nHill, J. P. The developmental history of the primates. Philos. T. Roy. Soc. B 221, 45–178 (1932).\n\nEnders, A. C., Schlafke, S. & Hendrickx, A. G. Differentiation of the embryonic disc, amnion, and yolk sac in the rhesus monkey. Am. J. Anat. 177, 161–185 (1986).\n\nEnders, A. C. & King, B. F. Formation and differentiation of extraembryonic mesoderm in the rhesus monkey. Am. J. Anat. 181, 327–340 (1988).\n\nSasaki, K. et al. The germ cell fate of Cynomolgus monkeys is specified in the nascent amnion. Dev. Cell 39, 169–185 (2016).\n\nKobayashi, T. et al. Principles of early human development and germ cell program from conserved model systems. Nature 546, 416–420 (2017).\n\nIrie, N. et al. SOX17 is a critical specifier of human primordial germ cell fate. Cell 160, 253–268 (2015).\n\nSasaki, K. et al. Robust in vitro induction of human germ cell fate from pluripotent stem cells. Cell Stem Cell 17, 178–194 (2015).\n\nShahbazi, M. N. et al. Self-organization of the human embryo in the absence of maternal tissues. Nat. Cell Biol. 18, 700–708 (2016).\n\nDeglincerti, A. et al. Self-organization of the in vitro attached human embryo. Nature 533, 251–254 (2016).\n\nNakamura, T. et al. A developmental coordinate of pluripotency among mice, monkeys and humans. Nature 537, 57–62 (2016).\n\nMa, H. et al. Correction of a pathogenic gene mutation in human embryos. Nature 548, 413–419 (2017).\n\nKang, X. et al. Introducing precise genetic modifications into human 3PN embryos by CRISPR/Cas-mediated genome editing. J. Assist. Reprod. Genet. 33, 581–588 (2016).\n\nLiang, P. et al. CRISPR/Cas9-mediated gene editing in human tripronuclear zygotes. Protein Cell 6, 363–372 (2015).\n\nMascetti, V. L. & Pedersen, R. A. Human-mouse chimerism validates human stem cell pluripotency. Cell Stem Cell 18, 67–72 (2016).\n\nWu, J. et al. An alternative pluripotent state confers interspecies chimaeric competency. Nature 521, 316–321 (2015).\n\nWu, J. et al. Interspecies chimerism with mammalian pluripotent stem cells. Cell 168, 473–486 (2017).\n\nJames, D., Noggle, S. A., Swigut, T. & Brivanlou, A. H. Contribution of human embryonic stem cells to mouse blastocysts. Dev. Biol. 295, 90–102 (2006).\n\nThomson, J. A. et al. Embryonic stem cell lines derived from human blastocysts. Science 282, 1145–1147 (1998).\n\nItskovitz-Eldor, J. et al. Differentiation of human embryonic stem cells into embryoid bodies compromising the three embryonic germ layers. Mol. Med. 6, 88–95 (2000).\n\nSharon, N., Mor, I., Golan-lev, T., Fainsod, A. & Benvenisty, N. Molecular and functional characterizations of gastrula organizer cells derived from human embryonic stem cells. Stem Cells 29, 600–608 (2011).\n\nLancaster, M. A. et al. Cerebral organoids model human brain development and microcephaly. Nature 501, 373–379 (2013).\n\nNakano, T. et al. Self-formation of optic cups and storable stratified neural retina from human ESCs. Cell Stem Cell 10, 771–785 (2012).\n\nThomson, J. A. et al. Pluripotent cell lines derived from common marmoset (Callithrix jacchus) blastocysts. Biol. Reprod. 55, 254–259 (1996).\n\nBehr, R., Heneweer, C., Viebahn, C., Denker, H. W. & Thie, M. Epithelial-mesenchymal transition in colonies of rhesus monkey embryonic stem cells: a model for processes involved in gastrulation. Stem Cells 23, 805–816 (2005).\n\nWarmflash, A., Sorre, B., Etoc, F., Siggia, E. D. & Brivanlou, A. H. A method to recapitulate early embryonic spatial patterning in human embryonic stem cells. Nat. Methods 11, 847–854 (2014).\n\nTewary, M. et al. A stepwise model of reaction-diffusion and positional-information governs self-organized human peri-gastrulation-like patterning. Development 144, 4298–4312 (2017).\n\nEtoc, F. et al. A balance between secreted inhibitors and edge sensing controls gastruloid self-organization. Dev. Cell 39, 302–315 (2016).\n\nMartyn, I., Kanno, T. Y., Ruzo, A., Siggia, E. D. & Brivanlou, A. H. Self-organization of a human organizer by combined Wnt and Nodal signalling. Nature 558, 132–135 (2018).\n\nTaniguchi, K. et al. Lumen formation is an intrinsic property of isolated human pluripotent stem cells. Stem Cell Rep. 5, 954–962 (2015).\n\nShao, Y. et al. Self-organized amniogenesis by human pluripotent stem cells in a biomimetic implantation-like niche. Nat. Mater. 16, 419–425 (2016).\n\nShao, Y. et al. A pluripotent stem cell-based model for post-implantation human amniotic sac development. Nat. Commun. 8, 208 (2017).\n\nTakashima, Y. et al. Resetting transcription factor control circuitry toward ground-state pluripotency in human. Cell 158, 1254–1269 (2014).\n\nTheunissen, T. W. et al. Systematic identification of culture conditions for induction and maintenance of naive human pluripotency. Cell Stem Cell 15, 471–487 (2014).\n\nGafni, O. et al. Derivation of novel human ground state naive pluripotent stem cells. Nature 504, 282–286 (2013).\n\nQin, H. et al. YAP induces human naive pluripotency. Cell Rep. 14, 2301–2312 (2016).\n\nZimmerlin, L. et al. Tankyrase inhibition promotes a stable human naive pluripotent state with improved functionality. Development 143, 4368–4380 (2016).\n\nWare, C. B. et al. Derivation of naive human embryonic stem cells. Proc. Natl Acad. Sci. USA 111, 4484–4489 (2014).\n\nGuo, G. et al. Epigenetic resetting of human pluripotency. Development 144, 2748–2763 (2017).\n\nValamehr, B. et al. Platform for induction and maintenance of transgene-free hiPSCs resembling ground state pluripotent stem cells. Stem Cell Rep. 2, 366–381 (2014).\n\nChan, Y. S. et al. Induction of a human pluripotent state with distinct regulatory circuitry that resembles preimplantation epiblast. Cell Stem Cell 13, 663–675 (2013).\n\nYang, Y. et al. Derivation of pluripotent stem cells with in vivo embryonic and extraembryonic potency. Cell 169, 243–257 (2017).\n\nAach, J., Lunshof, J., Iyer, E. & Church, G. M. Addressing the ethical issues raised by synthetic human entities with embryo-like features. eLife 6, e20674 (2017)."}, {"url": "https://www.nature.com/articles/d41586-021-00581-3", "page_content": "NEWS AND VIEWS\n\n17 March 2021 First complete model of the human embryo Early in development, human embryos form a structure called the blastocyst. Two research groups have now generated human blastocyst-like structures from cells in a dish, providing a valuable model for advancing human embryology. Yi Zheng 0 &\n\n& Jianping Fu 1 Yi Zheng Yi Zheng is in the Department of Mechanical Engineering, University of Michigan, Ann Arbor, Michigan 48109, USA. View author publications You can also search for this author in PubMed Google Scholar Jianping Fu Jianping Fu is in the Department of Mechanical Engineering, University of Michigan, Ann Arbor, Michigan 48109, USA, and in the Departments of Biomedical Engineering and of Cell and Developmental Biology, University of Michigan. View author publications You can also search for this author in PubMed Google Scholar\n\nA proper understanding of early human development is crucial if we are to improve assisted reproductive technologies and prevent pregnancy loss and birth defects. However, studying early development is a challenge — few human embryos are available, and research is subject to considerable ethical and legal constraints. The emergence of techniques that use cells cultured in vitro to construct models of mammalian embryos therefore opens up exciting opportunities1. Two papers in Nature now make key advances in this field, showing that human embryonic stem cells2 or cells reprogrammed from adult tissues2,3 can be induced to self-organize in a dish, forming structures that resemble early human embryos. This is the first integrated human embryo model containing cell types related to all the founding cell lineages of the fetus and its supporting tissues.\n\nNature 591, 531-532 (2021)\n\ndoi: https://doi.org/10.1038/d41586-021-00581-3\n\nReferences Fu, J., Warmflash, A. & Lutolf, M. P. Nature Mater. 20, 132–144 (2021). Yu, L. et al. Nature 591, 620–626 (2021). Liu, X. et al. Nature 591, 627–632 (2021). Rivron, N. C. et al. Nature 557, 106–111 (2018). Sozen, B. et al. Nature Cell Biol. 20, 979–989 (2018). Li, R. et al. Cell 179, 687–702 (2019). Warmflash, A., Sorre, B., Etoc, F., Siggia, E. D. & Brivanlou, A. H. Nature Methods 11, 847–854 (2014). Zheng, Y. et al. Nature 573, 421–425 (2019). Moris, N. et al. Nature 582, 410–415 (2020). Xiang, L. et al. Nature 577, 537–542 (2020). Download references\n\nRelated Articles\n\nSubjects"}, {"url": "https://med.libretexts.org/Bookshelves/Anatomy_and_Physiology/Anatomy_and_Physiology_(Boundless)/27%3A_Human_Development_and_Pregnancy/27.3%3A_Second_Week_of_Development/27.3C%3A_Amnion_Development", "page_content": "The amnion contains the fluid that cushions and protects the fetus.\n\nKey Terms\n\namniotic fluid : In placental mammals, a fluid contained within the amnion membrane that surrounds a developing embryo or fetus (also called liquor amnii).\n\n: In placental mammals, a fluid contained within the amnion membrane that surrounds a developing embryo or fetus (also called liquor amnii). embryonic disk : The floor of the amniotic cavity is formed by the embryonic disk (or disc), which is composed of a layer of prismatic cells.\n\n: The floor of the amniotic cavity is formed by the embryonic disk (or disc), which is composed of a layer of prismatic cells. amnion : The innermost membrane of the fetal membranes of reptiles, birds, and mammals; the sac in which the embryo is suspended.\n\n: The innermost membrane of the fetal membranes of reptiles, birds, and mammals; the sac in which the embryo is suspended. chorion: One of the membranes that exist during pregnancy between the developing fetus and mother.\n\nAmnion: The human fetus is enclosed within the amnion.\n\nThe amnion is a closed sac appearing in the inner cell mass as a cavity. This cavity is roofed in by a single stratum of flattened, ectodermal cells called the amniotic ectoderm. Its floor consists of the prismatic ectoderm of the embryonic disk.\n\nThe continuity between the roof and the floor is established at the margin of the embryonic disk. Outside the amniotic ectoderm is a thin layer of mesoderm (continuous with that of the somatopleure), which is connected by the body stalk with the mesodermal lining of the chorion.\n\nWhen first formed, the amnion is in contact with the body of the embryo, but by about the fourth or fifth week, amniotic fluid (liquor amnii) begins to accumulate within it. This fluid increases in quantity, causing the amnion to expand and ultimately to adhere to the inner surface of the chorion so that the extra-embryonic part of the coelom is obliterated.\n\nThis increase continues up to the sixth or seventh month of pregnancy, after which it diminishes somewhat. At the end of pregnancy, it amounts to about one liter.\n\nThe amniotic fluid allows some free movement for the fetus during the later stages of pregnancy and also diminishes the risk of injury. It contains less than two percent solids, and consists mainly of urea and other extractives, inorganic salts, a small amount of protein, and, frequently, a trace of sugar.\n\nNote: That some of the liquor amnii is swallowed by the fetus is proved by the fact that epidermal debris and hairs have been found among the contents of the fetal alimentary canal."}, {"url": "https://www.liquisearch.com/amniotic_cavity/formation_of_the_amniotic_cavity", "page_content": "Formation of The Amniotic Cavity\n\nAt the beginning of the second week, a cavity appears within the inner cell mass and when it enlarges it becomes the Amniotic cavity. The floor of the amniotic cavity is formed by the epiblast. Epiblast migrates between the epiblastic disc and trophoblast. In this way the epiblastic cells migrate between the embryoblast and trophoblast . The floor is formed by the epiblast which later on transforms to ectoderm while the remaining cells which are present between the embryoblast and trophoblast are called amnioblasts (flattened Cells). These cells are also derived from epiblast which is transformed into ectoderm.\n\nThe amniotic cavity is surrounded by a membrane, called the amnion. As the implantation of the blastocyst progresses, a small space appears in the embryoblast, which is the primordium of the amniotic cavity. Soon amniogenic (Amnion forming cells) amnioblasts separate from the epiblast and line the amnion, which encloses the amniotic cavity.\n\nThe epiblast forms the floor of the amniotic cavity and is continuous peripherally with the amnion. The hypoblast forms the roof of the exocoelomic cavity and is continuous with the thin exocoelomic membrane. This membrane along with hypoblast forms the primary yolk sac. The embryonic disc now lies between the amniotic cavity and the primary yolk sac. Cells from the yolk sac endoderm form a layer of connective tissue, the extraembryonic mesoderm, which surrounds the amnion and yolk sac."}, {"url": "https://embryo.asu.edu/pages/christian-heinrich-pander-1794-1865", "page_content": "Christian Heinrich Pander, often remembered as the father of embryology, also explored the fields of osteology, zoology, geology, and anatomy. He was born in Riga, Latvia, on 24 July 1794. Pander, with an eclectic history of research, is best remembered for his discovery and explanation of the structure of the chick blastoderm, a term he coined. In doing so, Pander was able to achieve the goal set forth by his teacher, Ignaz Döllinger, to reinvigorate the study of the chick embryo as a means of further exploring the science of embryology as a whole. His findings paved the way for the work of Karl Ernst von Baer, who would later revolutionize the field of embryology with his research.\n\nPander initially studied in the local schools of his hometown, Riga, and eventually enrolled in the University of Dorpat in 1812. While studying there, Pander attempted to pursue an education in both medical science as well as natural history. It was during this time that Pander began to work with an anatomist named Karl Friedrich Burdach who had previously taught Karl Ernst von Baer. Pander left Dorpat in 1814 and traveled to Germany. It was there in 1816 that Pander met von Baer, who convinced him to study at the University of Würzburg under the tutelage of Ignaz Döllinger. Pander agreed and traveled to Würzburg where he received his MD in 1817. It was also here that he published his dissertation, Historia Metamorphoseos Quam Ovum Incubatum Prioribus Quinque Diebus Subit, a study of the components of the chick embryo including detailed illustrations by Eduard Joseph d’Alton.\n\nDuring his work at the University of Würzburg, Pander discovered the blastoderm of the chick embryo. The blastoderm is the outermost cellular layer of the embryo, which Pander believed contributed greatly to embryonic development. He studied the blastoderm’s role in early embryonic development, describing the outer, middle, and inner layers in detail while only being able to conclude that the development of blood vessels occurred in the middle layer and that important events of embryonic development followed thereafter. Despite the lack of in-depth conclusions, Pander’s discovery and recognition of the blastoderm as well as the layered structure of the embryo provided invaluable information and guidance to his colleagues as well as future embryologists, including von Baer.\n\nDespite promising early research, Pander did not pursue further work in the study of chick embryos or embryology in general. After he obtained his MD and published his dissertation, Pander began traveling through Europe visiting science museums and continuing his work of observation in the fields of biology, paleontology, and geology. His primary goal in doing so was to visit and study the newest and most intricate fossils and skeletons discovered in different parts of the world. Pander eventually began to publish a series of works on osteology, the study of bones, collaborating once again with E. J. d’Alton. Pander became a member of the Academy of Sciences in St. Petersburg in 1821 and a member of the St. Petersburg Zoological Academy in 1826. For the remainder of his life, Pander lived mainly in his estate near his hometown of Riga while still taking time to travel and continue his work in the fields of geology and paleontology, though none of his later work gained significant recognition. Pander died on 22 September 1865 in St. Petersburg. Though somewhat inconclusive, Pander’s work with chick embryos and their components marked the beginning of a more advanced understanding of embryology."}, {"url": "https://www.nature.com/articles/ncb3347", "page_content": "Edwards, R. G., Bavister, B. D. & Steptoe, P. C. Early stages of fertilization in vitro of human oocytes matured in vitro. Nature 221, 632–635 (1969).\n\nEdwards, R. G., Steptoe, P. C. & Purdy, J. M. Fertilization and cleavage in vitro of preovulator human oocytes. Nature 227, 1307–1309 (1970).\n\nKoot, Y. E., Teklenburg, G., Salker, M. S., Brosens, J. J. & Macklon, N. S. Molecular aspects of implantation failure. Biochim. Biophys. Acta 1822, 1943–1950 (2012).\n\nEnders, A. C., Schlafke, S. & Hendrickx, A. G. Differentiation of the embryonic disc, amnion, and yolk sac in the rhesus monkey. Am. J. Anat. 177, 161–185 (1986).\n\nPera, M. F. & Trounson, A. O. Human embryonic stem cells: prospects for development. Development 131, 5515–5525 (2004).\n\nWeimar, C. H., Post Uiterweer, E. D., Teklenburg, G., Heijnen, C. J. & Macklon, N. S. In-vitro model systems for the study of human embryo-endometrium interactions. Reprod. Biomed. Online 27, 461–476 (2013).\n\nBedzhov, I., Leung, C. Y., Bialecka, M. & Zernicka-Goetz, M. In vitro culture of mouse blastocysts beyond the implantation stages. Nat. Protoc. 9, 2732–2739 (2014).\n\nBedzhov, I. & Zernicka-Goetz, M. Self-organizing properties of mouse pluripotent cells initiate morphogenesis upon implantation. Cell 156, 1032–1044 (2014).\n\nHertig, A. T., Rock, J. & Adams, E. C. A description of 34 human ova within the first 17 days of development. Am. J. Anat. 98, 435–493 (1956).\n\nHur, Y. S. et al. Effect of artificial shrinkage on clinical outcome in fresh blastocyst transfer cycles. Clin. Exp. Reprod. Med. 38, 87–92 (2011).\n\nMorris, S. A. et al. Dynamics of anterior-posterior axis formation in the developing mouse embryo. Nat. Commun. 3, 673 (2012).\n\nPera, M. F. et al. What if stem cells turn into embryos in a dish? Nat. Methods 12, 917–919 (2015).\n\nGardner, D. K. The impact of physiological oxygen during culture, and vitrification for cryopreservation, on the outcome of extended culture in human IVF. Reprod. Biomed. Online 32, 137–141 (2015).\n\nCovello, K. L. et al. HIF-2α regulates Oct-4: effects of hypoxia on stem cell function, embryonic development, and tumor growth. Genes Dev. 20, 557–570 (2006).\n\nEzashi, T., Das, P. & Roberts, R. M. Low O2 tensions and the prevention of differentiation of hES cells. Proc. Natl Acad. Sci. USA 102, 4783–4788 (2005).\n\nRivera-Perez, J. A., Jones, V. & Tam, P. P. Culture of whole mouse embryos at early postimplantation to organogenesis stages: developmental staging and methods. Methods Enzymol. 476, 185–203 (2010).\n\nBedzhov, I., Graham, S. J., Leung, C. Y. & Zernicka-Goetz, M. Developmental plasticity, cell fate specification and morphogenesis in the early mouse embryo. Phil. Trans. R. Soc. B 369 (2014).\n\nRoode, M. et al. Human hypoblast formation is not dependent on FGF signalling. Dev. Biol. 361, 358–363 (2012).\n\nTeklenburg, G. et al. Cell lineage specific distribution of H3K27 trimethylation accumulation in an in vitro model for human implantation. PLoS ONE 7, e32701 (2012).\n\nNiakan, K. K. & Eggan, K. Analysis of human embryos from zygote to blastocyst reveals distinct gene expression patterns relative to the mouse. Dev. Biol. 375, 54–64 (2013).\n\nO’Leary, T. et al. Tracking the progression of the human inner cell mass during embryonic stem cell derivation. Nat. Biotechnol. 30, 278–282 (2012).\n\nNiakan, K. K., Han, J., Pedersen, R. A., Simon, C. & Pera, R. A. Human pre-implantation embryo development. Development 139, 829–841 (2012).\n\nHaigh, T., Chen, C., Jones, C. J. & Aplin, J. D. Studies of mesenchymal cells from 1st trimester human placenta: expression of cytokeratin outside the trophoblast lineage. Placenta 20, 615–625 (1999).\n\nDobreva, M. P., Pereira, P. N., Deprest, J. & Zwijsen, A. On the origin of amniotic stem cells: of mice and men. Int. J. Dev. Biol. 54, 761–777 (2010).\n\nHill, J. P. The developmental history of the primates. Phil. Trans. R. Soc. Lond. B 221, 45–178 (1932).\n\nLuckett, W. P. The development of primordial and definitive amniotic cavities in early Rhesus monkey and human embryos. Am. J. Anat. 144, 149–167 (1975).\n\nPalis, J. & Yoder, M. C. Yolk-sac hematopoiesis: the first blood cells of mouse and man. Exp. Hematol. 29, 927–936 (2001).\n\nTaniguchi, K. et al. Lumen formation is an intrinsic property of isolated human pluripotent stem cells. Stem Cell Rep. 5, 954–962 (2015).\n\nBryant, D. M. et al. A molecular switch for the orientation of epithelial cell polarization. Dev. Cell 31, 171–187 (2014).\n\nBryant, D. M. & Mostov, K. E. From cells to organs: building polarized tissue. Nat. Rev. Mol. Cell Biol. 9, 887–901 (2008).\n\nVuoristo, S., Jedrusik, A., Shahbazi, M. N. & Zernicka-Goetz, M. Culture of human embryos through implantation stages in vitro. Protoc. Exch. (2016)10.1038/protex.2016.017.\n\nLancaster, M. A. et al. Cerebral organoids model human brain development and microcephaly. Nature 501, 373–379 (2013).\n\nLee, G. Y., Kenny, P. A., Lee, E. H. & Bissell, M. J. Three-dimensional culture models of normal and malignant breast epithelial cells. Nat. Methods 4, 359–365 (2007)."}]}