{"Heinz Christian Pander was the first to describe the notochord in the chick embryo.": [{"url": "https://embryo.asu.edu/pages/christian-heinrich-pander-1794-1865", "page_content": "Christian Heinrich Pander, often remembered as the father of embryology, also explored the fields of osteology, zoology, geology, and anatomy. He was born in Riga, Latvia, on 24 July 1794. Pander, with an eclectic history of research, is best remembered for his discovery and explanation of the structure of the chick blastoderm, a term he coined. In doing so, Pander was able to achieve the goal set forth by his teacher, Ignaz Döllinger, to reinvigorate the study of the chick embryo as a means of further exploring the science of embryology as a whole. His findings paved the way for the work of Karl Ernst von Baer, who would later revolutionize the field of embryology with his research.\n\nPander initially studied in the local schools of his hometown, Riga, and eventually enrolled in the University of Dorpat in 1812. While studying there, Pander attempted to pursue an education in both medical science as well as natural history. It was during this time that Pander began to work with an anatomist named Karl Friedrich Burdach who had previously taught Karl Ernst von Baer. Pander left Dorpat in 1814 and traveled to Germany. It was there in 1816 that Pander met von Baer, who convinced him to study at the University of Würzburg under the tutelage of Ignaz Döllinger. Pander agreed and traveled to Würzburg where he received his MD in 1817. It was also here that he published his dissertation, Historia Metamorphoseos Quam Ovum Incubatum Prioribus Quinque Diebus Subit, a study of the components of the chick embryo including detailed illustrations by Eduard Joseph d’Alton.\n\nDuring his work at the University of Würzburg, Pander discovered the blastoderm of the chick embryo. The blastoderm is the outermost cellular layer of the embryo, which Pander believed contributed greatly to embryonic development. He studied the blastoderm’s role in early embryonic development, describing the outer, middle, and inner layers in detail while only being able to conclude that the development of blood vessels occurred in the middle layer and that important events of embryonic development followed thereafter. Despite the lack of in-depth conclusions, Pander’s discovery and recognition of the blastoderm as well as the layered structure of the embryo provided invaluable information and guidance to his colleagues as well as future embryologists, including von Baer.\n\nDespite promising early research, Pander did not pursue further work in the study of chick embryos or embryology in general. After he obtained his MD and published his dissertation, Pander began traveling through Europe visiting science museums and continuing his work of observation in the fields of biology, paleontology, and geology. His primary goal in doing so was to visit and study the newest and most intricate fossils and skeletons discovered in different parts of the world. Pander eventually began to publish a series of works on osteology, the study of bones, collaborating once again with E. J. d’Alton. Pander became a member of the Academy of Sciences in St. Petersburg in 1821 and a member of the St. Petersburg Zoological Academy in 1826. For the remainder of his life, Pander lived mainly in his estate near his hometown of Riga while still taking time to travel and continue his work in the fields of geology and paleontology, though none of his later work gained significant recognition. Pander died on 22 September 1865 in St. Petersburg. Though somewhat inconclusive, Pander’s work with chick embryos and their components marked the beginning of a more advanced understanding of embryology."}, {"url": "https://journals.biologists.com/dev/article/10/4/602/35651/The-Development-of-the-Notochord-in-Chick-Embryos", "page_content": "It seemed desirable to investigate more closely the process of normal development of the chick notochord by means of light- and electron-microscope techniques in order to try to co-ordinate all that is known so far.\n\nFor the reasons given, investigations on the morphogenesis and cytodifferentiation of the chick notochord appear to be particularly interesting. In the normal developmental table of the chick prepared by Hamburger & Hamilton (1951) , which still remains the best guide for all embryological work on the development of chick embryos, the changes in the notochord are not actually taken into account, as this work was based exclusively on external characteristics. Some general information on the development of the chick notochord can be found in monographs or textbooks such as those of Waddington (1952 , 1956 ), Hamilton (1952) , and Romanoff (1960) . More detailed data based on light microscopy have been published by Kuhlenbeck (1930) and Williams (1942) .\n\nThe life-span of the notochord in birds and mammals is comparatively short. Its transient role, which is to provide rigidity of the longitudinal axis of the embryo, and its inductive potencies in cartilage formation become obsolete as soon as the definite skeleton begins to be formed. In chick embryos the whole period of development and existence of the notochord is limited to about 10 days (i.e. from the 2nd until the 11th day of embryonic life). During this period the formation of the prechordal material, its moulding into a rod-like organ, and, later, profound intracellular changes take place. The rate of the morphogenetic process, as well as the process of internal cytodifferentiation, is undoubtedly much faster in the notochord than in embryonic structures which develop more slowly but persist longer.\n\nThe literature on the notochord, a structure characteristic of all vertebrates, is very extensive, due to the phylogenetic importance of this organ, its role in early embryonic development, and its central position in the developing vertebral column. As early as 1834 the notochord tissue was described by Müller as being similar in appearance to the parenchyma of plants. Surprisingly, however, in the chick embryo, which is so widely used by embryologists, its development has not very often been the subject of descriptive or experimental investigations. From the early days most work on this fundamental organ was done on fish and amphibians, probably because the notochord in lower vertebrates is more suitable for investigations, as it persists longer, carrying out its function as an embryonic and larval skeleton.\n\nThe methacrylate sections were viewed without using electron ‘stains’, whereas the Araldite sections were contrasted either by floating, after being mounted on grids with collodion-carbon films, on potassium permanganate (1 per cent.) with uranyl acetate (2·5 per cent.) solution (modification of Lawn’s method, 1960 ) for 20 minutes, or mounted straight on uncovered grids (e.g. Athene, No. 483) and subsequently stained by immersing in saturated lead acetate solution in ether-absolute alcohol (1:1) for 20–30 minutes. The latter method proved to be the more satisfactory. Some Araldite sections were treated by floating them on 10 per cent, phosphotungstic acid solution for 15 minutes and then washed for 5 minutes ( Watson, 1958 ).\n\nIn the majority of cases ultra-thin sections were cut transversely to the longitudinal axis at the following levels: (1) In head-process and head-fold embryos, approximately in the middle of the length of the chorda-mesoblast concentration. (2) In embryos with 1–12 somites, at the level of the first somite or just anterior to it. (3) In older embryos in the cervical region of the notochord.\n\nAfter being fixed at about 4° C. the embryos were dehydrated with 35, 70, and 95 per cent, alcohol (5–10 minutes in each), and then with three changes of absolute alcohol. Embedding was carried out either with prepolymerized methacrylate mixture after two changes of liquid methacrylate or with the final Araldite mixture after replacing the absolute alcohol by two changes of 1:2-epoxy-propane.\n\nIn preliminary investigations, a methyl-butyl methacrylate mixture proved to be unsatisfactory as an embedding medium, presumably due to its tendency to polymerization damage. All final embeddings were carried out with Araldite epoxy resin made up according to the original formula recommended by Glauert & Glauert (1958) .\n\nThe pH of the above buffer solution without osmium tetroxide is 8·15. Its osmotic pressure is similar to that of the original Palade’s buffer. The use of a higher pH than that recommended by Palade and other authors greatly improves the results, and so do the replacement of sodium chloride by sucrose ( Caulfield, 1957 ) and the increased percentage of osmium tetroxide ( Pease, 1960 ).\n\nFor electron-microscope examination the embryos were fixed in toto for 15–45 minutes, depending on age, after being dissected in Pannet-Compton’s solution. As a fixative, a modified 1 or 2 per cent, osmium tetroxide solution buffered with sodium barbitone and sodium acetate was used ( Palade, 1952 ; Caulfield, 1957 ). As the original Palade buffer proved unsatisfactory, a number of modifications were tried. As a result of these technical approaches it was established that the best preservation of tissues in general, and of the notochord in particular, can be achieved by using a 2 per cent, osmium tetroxide solution made up according to the following formula:\n\nChick embryos at all developmental stages from the 5th to the 31st were obtained from Brown Leghorn eggs incubated at 38·5° C. (The stages are numbered throughout the paper according to Hamburger & Hamilton (1951) .) For histological reasons, after being dissected from the eggs while the entire yolk was immersed in Pannet-Compton’s saline solution, the embryos were fixed for 1 hour in Carnoy’s fluid (with chloroform), rinsed thoroughly with absolute alcohol, and, after clearing in methyl benzoate, were embedded in wax (m.p. 54° C.). Serial transverse or sagittal sections were stained with methyl green-pyronine.\n\nAbout stage 22 mitotic divisions become gradually less frequent, although they do not disappear completely even at the latest stages under investigation. From stage 25 there begin to appear more and more frequently cells with pycnotic or karyorrhectic nuclei scattered randomly throughout the organ, foreshadowing the onset of the process of involution.\n\nAt stages later than 16 the mitotic activity of the notochordal cells appears to be still considerable (0·5 per cent.), without, however, having any particular distribution. The vacuolated cells divide at the same rate, irrespective of whether the cytoplasm is more or less pyronine-positive. In such cells the chromosome sets are usually pushed by the vacuole from the centre of the cell towards the periphery. However, this does not seem to disturb the mitotic process (Plate 2, fig. 15).\n\nDuring stage 17 or 18 the notochord tissue, in sections stained with methyl green-pyronine, begins to exhibit two kinds of cells: one with the cytoplasm more pyronine-positive, and the other with paler cytoplasm. At stages 20 and 21 up to 30 per cent, of cells have the more pyronine-positive cytoplasm. These cells are mainly distributed near the periphery of the organ, although they are also present deeper within it (Plate 1, figs. 9,10). Together with the less pyronine-positive cells, these form the so-called notochord epithelium. As will be seen later, these epithelial cells do not actually differ from the cells situated deeper in the notochord tissue. The presence of these two kinds of cells in other vertebrates has been reported by several workers: in Holocephala ( Schauinsland, 1906 ), in Amniota ( Bruni, 1912 ), and in duck embryos ( Kuhlenbeck, 1930 ).\n\nAt the end of this period, usually at stage 16, the process of vacuolization of the notochord cells starts. First, intracellular vacuoles appear in the cervical region, primarily in the core of the organ (Plate 1, fig. 8), but shortly afterwards the process spreads towards the periphery of the notochord as well as in both cephalic and caudal directions. From stage 16 onwards it becomes the main feature in the cytodifferentiation of the notochord. When the process is sufficiently advanced, the appearance of vacuoles causes the above-mentioned intercellular spaces to disappear, and the ‘pile-of-coins’ arrangement is disturbed (Plate 2, fig. 14).\n\nBy stage 16 the separation of the notochord from the ventral side of the neural tube is complete in the cephalic and cervical regions, but towards the caudal end the association still persists. The separation presumably takes place because of the formation of the fibrous notochordal sheath which penetrates into the narrow space between the two organs, being followed at later stages by mesodermal cells.\n\nDuring stages 14–16 the notochord shows a considerable increase in its diameter, due partly to increased proliferation of cells and partly to the fact that at this period numerous intercellular spaces appear, which are located to a large extent in the centre of the organ (Plate 1, fig. 7). These intercellular spaces form small lumina of about 5–10 μ in diameter. They are most clearly visible in sagittal sections where they appear to be interconnected, thus representing a system of small, irregular, communicating spaces (Plate 2, fig. 12).\n\nDuring the next stages (10–13) the increase in the size of the notochord keeps pace with the general growth of the embryo. First of all it elongates as much as is necessary. However, in spite of very frequent mitotic divisions during these stages, which now become more and more randomly distributed throughout the organ, the diameter of the notochord not only does not increase, but it even shows a slight decrease (Plate 1, fig. 6). This fact indicates that the morphogenetic changes in the notochord are due partly to an increase in the number of cells and partly to the migration of cells along the median axis. By the end of this period, i.e. at stage 13, the notochord begins to separate itself from the bottom of the neural tube. The separation occurs first at the cephalic region and then moves slowly backwards.\n\nDuring these stages dividing cells are found more frequently in the hind part of the notochord than in the cephalic region, up to 60 per cent, of them being confined to a definite region about 100 to 200 μ anterior to the notochord bulb. In the rest of the organ they are scarce and distributed at random. The confinement of dividing cells to this particular region during the early stages of development explains the fact that the anterior end of the head-process moves forward only slightly, as nearly all growth in length occurs at the posterior end.\n\nAt later stages (6–9) the relationship of the chorda-mesoblast to the surrounding tissues changes, primarily due to its more and more marked separation from the paraxial mesoderm (Plate 1, figs. 2, 3, 4). Simultaneously, the cell-to-cell contact between the presumptive notochord cells increases, probably being, in consequence, the main cause of the transformation of the chorda-mesoblast into the true, typically rod-shaped notochord. At this stage the morphogenetic changes leading to the moulding of the definite shape proceed, due to proliferation of the cells in front of the node ( Spratt, 1947 ), from caudal to anterior. At the end of this period the notochord detaches itself from the endoderm, although it still remains closely associated with the neural plate (Plate 1, fig. 5).\n\nOn the ventral side the chorda-mesoblast condensation at this stage, as well as in a few later stages, appears to be intimately fused with the unicellular layer of the endoderm. At the median line, therefore, the endodermal cells are difficult to distinguish from the prospective notochord cells as described by Hamilton (1952) and also by Fraser (1954) in somewhat older embryos in the pharyngeal region. The unification of both tissues at the head-process stage was described by Ussow (1906) as ‘entochorda’. Laterally the endoderm is free and consists of a single layer widely separated from the paraxial mesoblast elements (Plate 1, fig. 2).\n\nThe chorda-mesoblast condensation first appears at stage 5, at a point anterior to Hensen’s node, as an extension of the primitive streak along the axis, in the form of an elongated, dorso-ventrally flattened strip of loosely arranged cells (Plate 1, fig. 1). It is distinctly separated from the medullary plate throughout its entire length by a definite boundary, but at the same time it remains very closely attached to it. The contact surface between the chorda-mesoblast and the medullary plate, which appears to be very intimate, is, however, not even; at regular intervals of about 30–50 μ along the longitudinal axis of that surface distinct indentations can be found in the medullary plate, into which notochordal cells protrude. These indentations, which continue up to stage 7, can be seen particularly well in sagittal sections. It seems that during these stages the whole chorda-mesoblast tissue is being anchored by means of these indentations to the bottom of the medullary plate (Plate 2, fig. 11).\n\nThe histological material was also used in observations on the distribution of dividing cells by counting them at early stages (5–9) to get more information about the mechanism of elongation and growth of the notochord.\n\nThe aim of this part of the investigations was to have a preliminary and more general look at the developmental process taking place in the notochord, as, for example, the changes in the arrangement of the cells in the course of morphogenesis of the organ. In particular, an attempt was made to re-examine the changes in the relationship of the chorda-mesoblast and, subsequently, of the notochord to the surrounding derivatives of the germ-layers, to determine the time of formation of the rod-like notochord, and to trace the vacuolization process and the subsequent appearance of the first involutive changes in the cells.\n\nIn the cytoplasm the profiles of endoplasmic reticulum elements gradually become more frequent and by stage 15 they are already numerous. Characteristic of these stages are small profiles of endoplasmic reticulum, or at least profiles of an identical structure, which can frequently be found attached to the outer nuclear membrane, which suggests the possible manner of formation of that organelle in early stages of differentiating notochord cells. Its profiles, however, are still comparatively short and wide, being limited by a single roughsurfaced membrane (Plate 3, figs. 20, 21). At later stages, when the endoplasmic reticulum profiles appear to be much more flattened and elongated, forming lake-like dilatations, they can also occasionally be found continuous with the outer nuclear membrane (Plate 4, figs. 22, 23).\n\nIn between, the terminal bars can be still found in cross-sections through some parts of the cell membranes, but they appear to be less frequent and much shorter than at earlier stages. By the end of stage 15 they have disappeared altogether.\n\nAt somewhat later stages (10–15), after the notochord has become rounded and taken on its rod-like shape, its tissue loses the previous intercellular spaces, the cells become polyhedral in shape and adhering closer to each other. About stage 15 the contact between the peripheral cells becomes particularly intimate, as at that stage the cells form complicated interdigitations between themselves (Plate 3, fig. 18).\n\nThe nuclei of such early cells are comparatively large, with one or several nucleolar aggregations and a double nuclear membrane. In the cytoplasm there are numerous yolk granules of all types, as described in the chick blastoderm by Bellairs (1958) . In comparison with later stages, both mitochondria and endoplasmic reticulum elements are scarce. Golgi complex groups can frequently be found in such cells, as well as in the older ones, in the form of one or more separate structures per section, as parallel profiles of flat vesicles and round canaliculi (Plate 3, figs. 16, 19; Plate 6, fig. 30).\n\nDuring the earliest stages under investigation (stages 5–9) the cells of the chorda-mesoblast exhibit all the characteristic morphological properties of early embryonic cells. At the head-process and head-fold stages they are loosely arranged, forming a dorso-ventrally flattened, axially elongated accumulation with numerous intercellular spaces. Being more or less spherical in shape they remain attached to each other at a few limited contact points. Many of the parts of cell membranes that take part in adhesion points show, in cross-sections in electron micrographs, characteristic thickenings called terminal bars or attachment bodies (Plate 3, figs. 16, 17).\n\nWhen the vacuolization process has progressed so far that the intracellular vacuoles occupy about half of the cell volume, there are also found intercellular spaces between the cell membranes which contribute to the network pattern of the notochord tissue. They, too, are filled with an electron-transparent (also semi-liquid) substance, which undoubtedly contributes to the rigidity of the organ. During later stages these intercellular spaces widen considerably, filling gaps between adjacent cells and even forming vesicles of considerable size between the cell membranes (Plate 7, fig. 32).\n\nFinally, it has been shown that there is no period during the whole process of development of the notochord of the chick during which cell membranes do not exist, i.e. in which notochord tissue could be described as being syncytial in nature, as was frequently assumed in older papers. At all stages the notochord cells possess definite cell membranes which can easily be detected round the cells. In cross-sections the cell membranes of two adjacent cells are represented by a continuous double line.\n\nElectron-microscope observations have also confirmed that chromosome sets in dividing cells containing intracellular vacuoles are pushed away from their usual position towards the periphery of the cells by the thrust exerted by the vacuoles (Plate 7, fig. 31).\n\nBy means of electron-microscope examination of stages later than stage 20 it could be shown that the older, well-established vacuoles very often possess definitive limiting membranes separating them from the cytoplasm of the cell inside which they are found. These membranes frequently form small invaginations directed towards the lumen of the vacuole. This suggests that the vacuolar membranes are not merely interfaces between the cytoplasm and the contents of the vacuole, but that they are active in replenishing the content of the vacuoles. There are, however, also vacuoles that do not show any definite limiting membrane, passing gradually at their peripheries into the general substance of the loose cytoplasmic constituents (Plate 4, fig. 22).\n\nElectron microscopy of these two types of cells has confirmed that the distribution of the dense cells appears at first to be random, but at later stages (21–25) these cells are found mainly in the external layers of the notochord (i.e. in the chorda epithelium), forming groups each consisting of several such cells. However, there are always lightly stained cells between the dense ones, and dense cells can also frequently be found situated more centrally in the organ. Both kinds of cells undergo the process of vacuolization to the same degree and at the same time.\n\nThe cytoplasm of the second kind of cells (‘light’ cells) appears to be comparatively much ‘emptier’ with, here and there, scattered profiles of endoplasmic reticulum elements and, usually attached to them, single mitochondria. Microsomal granules, which are very scarce in these cells, are confined almost exclusively to the close proximity of the limiting membranes of the endoplasmic reticulum structures (Plate 6, figs. 28, 30). The appearance of the cytoplasm of the second type of cells suggests that their low affinity to pyronine is due to the scarcity of microsomal granules.\n\nAs has already been mentioned, another feature of the cytodifferentiation of the notochordal cells is the fact that from about the 3rd day of embryonic development, i.e. from stage 17 or 18 onwards, after the vacuolization process has started, two kinds of cells can be distinguished in the notochord tissue. These differ in the stainability of their cytoplasm with pyronine. An electronmicroscope examination showed that the difference between these two types of cells is even more conspicuous than can be revealed by light microscopy. The cells described as more pyronine-positive (‘dark’ cells) appear to have much more electron-dense cytoplasm closely packed with endoplasmic reticulum profiles, mitochondria, and Golgi complex, all spaces not containing these being packed uniformly with large numbers of microsome granules (Plate 6, figs. 28, 30).\n\nTowards the end of the vacuolization process, which is completed by about stage 26, the dilatations become smaller, and eventually, at still later stages, disappear, so that the system of rough-surfaced endoplasmic reticulum persists only in the form of interconnected, uniformly narrow, flat cisternae, represented in sections by more or less compact, often parallelly arranged profiles (Plate 5, fig. 27). In favourable cases, when the endoplasmic reticulum of later stages has been tangentially sectioned, the ribosomes attached to their limiting membranes appear to be arranged in patterns of circular, linear, or rosette-like groups. Occasionally, branchings of the limiting membranes and fenestrae can also be found (Plate 6, figs. 28, 29).\n\nAt about stage 18 the endoplasmic reticulum cisternae start to form wide dilatations which remain continuous with the rest of the flat cisternae. In transverse sections the profiles of these dilatations appear to be lake-like structures of considerable size (up to 3 ·, in diameter) connected by several tributary-like profiles of flat cisternae at their circumference (Plate 4, fig. 2; Plate 5, fig. 26). In the appearance of their contents and in their rough-surfaced membranes the dilatations are similar to the flat cisternae of the endoplasmic reticulum.\n\nThe topographical relationship between the nuclear membranes, endoplasmic reticulum, mitochondria, and intracellular vacuoles in the course of formation is the most characteristic feature in the cytodifferentiation of notochord cells. Later, when the vacuolization process has progressed further, the contact between the mitochondria and the endoplasmic reticulum persists, apparently becoming even more intimate. As the process of vacuolization proceeds, the continuity between the outer nuclear membranes and the endoplasmic reticulum seems to be much less frequent, but in spite of this the endoplasmic reticulum system develops further in the cytoplasm, so that at stages later than 18 it extends throughout the whole cytoplasm, forming a complicated and highly convoluted complex of flat cisternae with abundant ribosomes attached to their surface (Plate 4, fig. 23).\n\nIt is probable that the endoplasmic reticulum also takes part in the process of yolk utilization, as yolk granules, when in course of digestion, are also at least partly surrounded by profiles of endoplasmic reticulum.\n\nAt stage 16, when the vacuolization of the cytoplasm begins, small vacuoles in the course of formation are frequently found to be surrounded by one or more profiles of the endoplasmic reticulum (Plate 5, fig. 24). At the same time other fragments remain often in close proximity to single mitochondria. The connexions between them, particularly at later stages, are often provided by socket-like depressions formed by endoplasmic reticulum cysternae which embrace the mitochondria (fig. 25).\n\nJust prior to the formation of the cartilage tissue in the vertebral column, i.e. at stage 21, there is formed externally to both layers of the fibrous sheath a third layer, consisting of mesodermal cells of sclerotomal origin. In the proximity of the fibrous sheath its cells are flattened and closely applied to the surface in parallel rows.\n\nThe fine structure of the notochord sheath microfibrils, particularly in later stages, in spite of slight affinity to phosphotungstic acid, do not exhibit the characteristic periodic structure of collagen fibres. They are about 200 A thick and appear to be formed by 2–4 rows of fine granules 30–50 A in diameter. The microfibrils form a network whose prevailing arrangement is parallel to the outline of the notochord, with numerous transverse branchings between the concentric fibres (Plate 8, fig. 38).\n\nFrom stage 22 onwards the notochord sheath begins to be composed of two layers which in cross-section form two concentric zones: an external, denser layer which is undoubtedly the older one deposited on the surface of the notochord from the outside, and an inner, much narrower layer, also fibrous, but less dense, probably produced by the notochordal cells and deposited from the inside (Plate 8, fig. 36). This suggestion is supported by three facts. Firstly, the inner layer appears much later than the outer. Secondly, in the period during which the inner layer is formed some kind of fibrous material similar to that of the sheath can be found inside the peripheral cell of the notochord, usually deposited close to the outer cell membranes (Plate 8, fig. 37). Thirdly, when the two layers described above have been formed, a fibrous boundary is found between them which is probably identical with the internal membrane formed by microfibrils on the surface of the notochord at earlier stages, but due to the formation of the internal layer from inside, this membrane forms now a boundary between the layers.\n\nAt older stages (18-22) the density of the microfibrils increases considerably and the whole structure becomes thicker. The internal membrane of the sheath formed on the surface of the notochord now appears to be continuous and exactly parallel to the peripheral membranes (Plate 8, fig. 35).\n\nCommencing from the stages in which the notochord becomes definitely shaped into an elongated, round, rod-like organ, i.e. from stage 11 onwards, there begins to be formed outside the organ an extracellular membrane named the perichordal sheath. This appears gradually, first as a thin deposition of loose, fibrous elements close to the external surface of the notochord (Plate 8, fig. 33). Very soon, however, at the close proximity to the notochord surface the microfibrils become so dense that they form a delicate membrane (Plate 8, fig. 34). On the other hand, the accumulation of microfibrils from the very beginning of its formation, and also at all later stages, is devoid of any limiting outer membrane. Moreover, the microfibrils are more thinly scattered farther away from the notochord in the ambient intercellular spaces between the perichordal mesenchyme cells.\n\nIt must be emphasized that this pinocytic activity coincides in time with the onset of the vacuolization process, when water requirements become critical. Pinocytosis, together with the diffusion of water through the cell membranes, may be the process which enables this requirement to be satisfied, as the notochord itself always remains avascular.\n\nThroughout the period of vacuolization, i.e. from stage 15 onwards, there are present in the outer cell membranes, limiting the organ from outside, small in-vaginated vesicles, usually with narrow bottle-neck connexions. These vesicles are formed presumably by the pinocytic activity of the cell membranes. Similar vesicles (pinosomes) can also be seen deeper in the cytoplasm, suggesting that after being formed by the cell membrane they are taken inwards by the cytoplasm (Plate 8, figs. 34, 39).\n\nLight and electron microscopy of the early stages (up to stage 8) show that in the chick the notochord tissue is formed by loosely arranged cells, the areas of contact between the contiguous cells being only limited. These contact points are often reinforced by so-called terminal bars outside which there are extensive intercellular spaces. Soon afterwards the cell-to-cell contact increases, intercellular gaps gradually disappear, and the terminal bars are replaced by adhesion of the entire cellular membranes of adjacent cells. These changes coincide in time with the morphogenetical progress in formation of the cylindrical rod-like notochord. Virtually the same changes in roughly corresponding stages have been observed in urodele notochords by Waddington & Perry (1962). It seems therefore that the subsequent increase of the cell-to-cell contact is generally the morphogenetic factor in the process of moulding the notochord into its definite cylindrical shape.\n\nAccording to Spratt’s marking experiments (1957) the elongation of the notochord in the early stages of development is accomplished mainly by the addition of cells originally situated posterior to the chorda bulb, and only to a lesser extent by mitotic activity. He emphasizes that the region of maximum elongation is just anterior to the notochord bulb, but concludes that it is mainly due to migration of cells from behind. In the present investigations, however, it was shown that in the region just anterior to the bulb there are confined about 60 per cent, of the total number of dividing cells, and presumably this indicates that elongation takes place here mainly due to mitotic division.\n\nThe light-microscope observations reported in the present paper did not aim at confirming what is known, but were intended to serve as a preliminary guide to more detailed investigations by means of the electron microscope. In general they are in agreement with those of Kuhlenbeck (1930), but in certain details there are differences to which attention should be drawn.\n\nKuhlenbeck, who worked mainly on duck eggs, describes in the notochords of 48-to 72-hour-old embryos round lumina with sharp edges which are situated centrally inside the organ. Similar lumina have been reported in the notochords of the grass snake and the owl (Ussow, 1906), as well as in human embryos (Johnson, 1917).\n\nIn the material used in the present work no such lumina were observed. However, at stages 14–16 there were found numerous intercellular spaces, mostly located centrally, which appear to form an interconnected system. They are, however, small and irregular in shape, and never form the round, wider lumina with sharp edges described in other species.\n\nIn duck notochords about 90 hours old Kuhlenbeck observed scattered cells with elongated nuclei and denser cytoplasm situated near the periphery of the organ. These cells are presumably identical to the more pyronine-positive cells in the chick, although in the chick these cells can be found not only at the periphery but also deeper within the organ, forming groups consisting of up to 20 cells.\n\nIn older papers dealing with investigations on the development of notochord tissue carried out by means of light microscopy, it is often accepted that this tissue undergoes a cyclic process of transformation. According to this view, the notochord starts to develop as a population of single cells, then becomes syncytial, especially in its internal part, and finally ends up as a true tissue again. This belief was formulated for the first time by Williams (1908), and since then it has been repeated many times (Bruni, 1912; Kuhlenbeck, 1930; Dawes, 1930; and others). More recently, however, Kocher (1957) expressed himself less decisively about this when describing the normal development of the notochord in Triton alpestris.\n\nBy means of electron-microscope resolution, the cell-walls can now be followed, at least in chick embryos, throughout the whole period of the development and differentiation of the notochord. Even at the stages when vacuolization reaches its maximum and the tissue is being transformed into a network-patterned ‘gelatinous body’, the individual cytoplasmic bridges (trabeculae) appear to consist of at least two parts longitudinally separated by the cell membranes belonging to the two adjacent cells. These cell boundaries can be traced as they go round individual, enormously vacuolated cells. The same fact was also reported by Leeson & Leeson (1958) in the case of the rabbit notochord, so that it seems feasible to conclude on the basis of electron-microscope observations that notochord tissue is not syncytial in nature at any period of its development. On the contrary, it is always a tissue consisting of well-separated, individual cells.\n\nRegarding the cytodifferentiation process which results in the formation of the gelatinous network structure, due to far-reaching vacuolization of cells, it can be assumed on the basis of the present findings that the main cell organelles taking part in it are the nuclear membranes, the endoplasmic reticulum, and the mitochondria. It seems to be established that about stage 15 the nuclear membrane forms at least part of the existing endoplasmic reticulum, and even at later stages connexions between these two can be found. This has been observed in the chick by Duncan (1957b) and also in the amphibian notochord, where Waddington & Perry (1962) distinguish two types of ergastoplasm which appear one after another in the course of the development of the organ, the latter being much better developed in the peripheral cells lying just under the notochord sheath. In the chick notochord, however, there was no evidence for postulating the existence of two separate types. In early stages of development these intracellular structures originate, at least partly, from the outer nuclear envelopes, whereas later it develops independently in the cytoplasm.\n\nIn the chick the endoplasmic reticulum seems to take a direct part in the formation of vacuoles, as its profiles are found to surround small vacuoles at the time of their first appearance. At the same time the endoplasmic reticulum remains in very close contact with the mitochondria, both during the process of vacuolization and later, after the maximal stage of vacuolization has been reached. It is interesting that a similar topographical relationship between the endoplasmic reticulum and the mitochondria has been found in a quite different but also highly active tissue, namely intensely regenerating rat liver (Bernhard & Rouiller, 1956). It seems reasonable to assume that the endoplasmic reticulummitochondria system is responsible for, or at least takes part in, the physiological processes of biologically intensively active cells, especially those in the course of differentiation. This opinion was expressed also by Palade (1956). The role of the endoplasmic reticulum in differentiating cells was extensively discussed also by Waddington & Perry (1962).\n\nAnother feature of the chick notochord cells during the first and most active period of differentiation is the formation of extensive dilatations of the otherwise flat cisternae of the endoplasmic reticulum. As far as the author is aware, such dilatations have not been described so far in any other normal tissue, although a similar feature was noticed in plasma cells (Thiery, 1960) and in human chordoma cells investigated by means of the electron microscope (Friedmann, 1961).\n\nIn the literature there are numerous descriptions of the formation of the perichordal sheath, but views on its origin differ considerably. Until now it has been regarded, in the chick, as consisting of two layers: an internal membraneous and fibrillar layer, and an external layer built up of flattened mesodermal cells (Romanoff, 1960).\n\nWhen tracing the morphogenesis of the fibrous sheath on electron micrographs at different stages in the chick one is inclined to assume that in the beginning the fibrous sheath is produced outside the notochord as a thin layer consisting of microfibrils arranged randomly but in greater density towards the surface of the organ. Identical single microfibrils can be found at the same time scattered in the surrounding intercellular spaces between the mesenchymal cells. This situation can be attributed to the fact that the microfibrils being produced by the mesodermal cells are subsequently attracted by some unknown force towards the surface of the notochord. However, the other possibility cannot be excluded, as the microfibrils are denser at the surface of the notochord and less dense away from it.\n\nLater, from stage 21 onwards, the electron-microscope investigations seem to throw more light on this complicated problem, showing that underneath the previous single fibrous sheath there appears another one, also fibrous but consisting of less densely packed microfibrils. Considering the fact that both layers are separated at these stages by an irregular fibrous boundary, it can be assumed that the later formed inner layer originates, after all, from the notochord cells. This view is supported by the fact that at the time of the appearance of the inner layer there are often found in the cytoplasm of the notochord epithelium cells dense masses of some kind of fibrous material which might be the source from which the microfibrils of the internal zone are formed.\n\nA rather similar interpretation was suggested by Tretjakoff (1927) to explain the formation of the amphibian notochord sheath. According to Waddington & Perry (1962), however, the formation of the notochord sheath in Urodela seems to differ considerably from that described here in the chick. In the chick the sheath never comes to be fully developed into a well-defined membraneous hollow cylinder. Also, the arrangement of the microfibrils is never so regularly concentric in the chick. On the other hand, in both cases there is an indication of two different layers in the sheath, and the material for the inner layer is presumably produced by the peripheral cells of the notochord.\n\nFinally, it should be mentioned that the chick notochord and probably the notochords of all vertebrates are organs that never become vascularized. This detail is seldom emphasized, although it is of great importance. In the classical work of Sabin (1917) on the primitive blood-vessels in chick embryos there is in fact no indication of the existence of blood-vessels which would, during development, penetrate towards the notochord tissue. The notochord is also not vascularized in rabbit embryos (Leeson & Leeson, 1958)."}, {"url": "https://handwiki.org/wiki/Biography:Heinz_Christian_Pander", "page_content": "Short description : Baltic German geologist\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist.\n\nBiography\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.[2][3] His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.[4] Pander is credited as the first scientist to describe primitive creatures known as conodonts.[5][6]\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.[7]\n\nHe died in Saint Petersburg.\n\nEponyms\n\nPander's eponyms are:\n\nPander's islands or blood islands\n\nSelected writings\n\nBeiträge zur Entwickelungsgeschichte des Hühnchens im Eye , (Contributions to the embryology involving the chick egg), (1817).\n\n, (Contributions to the embryology involving the chick egg), (1817). Beiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions on the natural history of the Baltic regions) Dorpat, (1820).\n\n, (Contributions on the natural history of the Baltic regions) Dorpat, (1820). Vergleichende Osteologie (Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Beiträge zur geognosie des russischen reiches , (Contributions to the geology of the Russian Empire), 1830.\n\n, (Contributions to the geology of the Russian Empire), 1830. Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856).\n\n(Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856). Ueber die Placodermen des devonischen Systems , (On placoderms of the Devonian system), 1857.\n\n, (On placoderms of the Devonian system), 1857. Über die ctenodopterinen des devonischen systems , 1858\n\n, 1858 Über die saurodipterinen, dendrodonten, glyptolepiden und cheirolepiden des devonischen systems, 1860.[8]\n\nSee also\n\nList of Baltic German scientists\n\nReferences\n\n\n\n\n\n\n\n"}, {"url": "https://prabook.com/web/christian.heinrich_pander/2506963", "page_content": "Christian Heinrich Pander\n\nbiologist explorer paleontologist Zoologist\n\nJuly 24, 1794 (age 71) Riga, Latvia\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander\"s concept of germ layers to include all vertebrates. Pander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective \"Panderian\", first used by the Canadian palaeontologist, Elkanah Billings. Pander is credited as the first scientist to describe primitive creatures known as conodonts. Today the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts. He died in Saint St. Petersburg. Pander\"s eponyms are: Pander\"s islands or blood islands."}, {"url": "https://www.liquisearch.com/heinz_christian_pander", "page_content": "Heinz Christian Pander, also Christian Heinrich Pander (24 July 1794 – 22 September 1865), was a Baltic German biologist and embryologist born in Riga.\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the St. Petersburg Academy of Sciences.\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, and was the first scientist to describe primitive creatures known as conodonts. He also conducted extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.\n\nHe died in Saint Petersburg."}, {"url": "https://infogalactic.com/info/Heinz_Christian_Pander", "page_content": "From Infogalactic: the planetary knowledge core\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist.\n\nBiography\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.[2][3] His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.[4] Pander is credited as the first scientist to describe primitive creatures known as conodonts.[5][6]\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.[7]\n\nHe died in Saint Petersburg.\n\nEponyms\n\nPander's eponyms are:\n\nSelected writings\n\nBeiträge zur Entwickelungsgeschichte des Hühnchens im Eye , (Contributions to the embryology involving the chick egg), (1817).\n\n, (Contributions to the embryology involving the chick egg), (1817). Beiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions on the natural history of the Baltic regions) Dorpat, (1820).\n\n, (Contributions on the natural history of the Baltic regions) Dorpat, (1820). Vergleichende Osteologie (Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Beiträge zur geognosie des russischen reiches , (Contributions to the geology of the Russian Empire), 1830.\n\n, (Contributions to the geology of the Russian Empire), 1830. Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856).\n\n(Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856). Ueber die Placodermen des devonischen Systems , (On placoderms of the Devonian system), 1857.\n\n, (On placoderms of the Devonian system), 1857. Über die ctenodopterinen des devonischen systems , 1858\n\n, 1858 Über die saurodipterinen, dendrodonten, glyptolepiden und cheirolepiden des devonischen systems, 1860.[8]\n\nSee also"}, {"url": "https://link.springer.com/chapter/10.1007/978-3-319-46095-6_7", "page_content": "Although Pander understood that the three germ layers “work mutually together although destined for different ends,” von Baer’s Germ Layer Theory took a more rigid deterministic view of the germ layers as it developed over the century. At the turn of the twentieth century, tissue grafting and explant culturing methods were developed that finally permitted scientists to functionally test the roles of different embryonic tissues (Oppenheimer 1940). Vogt’s fate map made it possible to correctly interpret these experiments, since it is necessary to understand how tissues behave in their normal locations before trying to understand how they behave when placed in an abnormal environment. These embryological experiments demonstrated the source of signals that induce the germ layers, and showed that these signals act before gastrulation.\n\n7.5.1 Amphibians\n\n7.5.1.1 The Organizer\n\nAs a part of her doctoral thesis under Hans Spemann (1869–1941), Hilde Proescholdt (later Mangold) (1898–1924) worked with embryos from two differently pigmented species of salamander. She transplanted the dorsal lip of the blastopore from one embryo onto the ventral side of a host embryo. The dorsal lip is the site where gastrulation initiates in amphibians, and is visible as a small region of darkly pigmented cells at the margin. These experiments were particularly challenging because she could only obtain embryos from natural mating of a species that had only one mating season a year, and in the pre-antibiotic era, the operated embryos did not survive very well in the pond water she used to incubate her embryos (Hamburger 1984). She repeated the experiment several hundred times over the course of 2 years in order to obtain the six survivors that formed the basis of her Nobel prize winning paper (Spemann and Mangold 1924). The grafted tissue induced an entire secondary body axis. The transplant differentiated into notochord, muscle and some gut, and the overlying host cells adopted neural fates (Spemann and Mangold 1924). The mesoderm of the dorsal lip is sufficient to induce the overlying ectoderm to form neural tissue, and to organize an entire secondary body axis. Spemann called this tissue the Organizer, and laid out three characteristics that functionally define organizer tissue. The Organizer tissue should induce neural tissue from naïve ectoderm, self-differentiate into notochord and prechordal plate, and reprogram surrounding tissue within the mesoderm.\n\n7.5.1.2 Mesoderm Induction\n\nJohannes Holtfreter (1901–1992) used a different approach to determine how the germ layers interact to produce the embryo. He developed culturing conditions that decreased the incidence of bacterial infection of operated embryos (Holtfreter 1929). He found that when raised in particular salt conditions, amphibian embryos gastrulate abnormally, such that the mesoderm and endoderm egress from the embryo instead of internalizing and migrating underneath the prospective ectoderm (Holtfreter 1933). In these exogastrulae, the mesoderm never underlies the ectoderm, and the neural plate never forms. He also performed explant studies, in which he removed cells of the animal cap from the blastula, and cultured them in his solution. The caps quickly healed into round spheres, but only differentiated into “atypical ectoderm” (Fig. 7.6a) (Holtfreter 1938a, 1938b). This was surprising because, according to Vogt’s fate map, some of the cells he explanted would become neural tissue if left in its original location. The Organizer experiment, Holtfreter’s exogastrulae and the animal cap explants all showed that mesodermal tissue interacts with the ectoderm to generate the neural plate. This interaction was termed “induction” because it involved communication between the germ layers and was presumably mediated by the transfer of an unknown molecule. More broadly, these experiments, along with others, showed that germ layer identity is not fixed before gastrulation, and they confirmed Pander’s belief that interactions between the germ layers are essential for normal embryonic development.\n\nFig. 7.6 Experiments to find the mesoderm inducing signals in Xenopus. (a) Animal cap explants differentiate into atypical epidermis when cultured alone, but form mesoderm in combination with vegetal cells, or with mesoderm-inducing factors. (b) The Three Signal Model hypothesizes that there are three mesoderm-inducing activities in frogs: The first signal induces dorsal mesoderm (black arrow) in animal caps, the second signal induces ventral and ventrolateral mesoderm (yellow arrows) in animal caps, while the third signal dorsalizes ventral mesoderm in Ventral Marginal Zone (VMZ) explants (white arrows) (Dale and Slack 1987b) Full size image\n\nThe first indication that ectodermal cells could be induced to form mesodermal and endodermal tissue, came from experiments in which differentiated tissues from adult guinea pigs were implanted into newt gastrulae, or cultured in sandwiches between two ectodermal explants (Toivonen 1953; Takata and Yamada 1960; Saxen et al. 1964). Two important conclusions were drawn from these results. First, they showed that in the proper environment, presumptive ectoderm could be converted to the other germ layers. Secondly, they showed that some tissues produced instructive signals that could change the fate of ectoderm. This raised the possibility that such interactions occur during normal development to form the germ layers. Pieter Nieuwkoop (1917–1996) devised an experiment to identify the source of the endogenous mesoderm inducing signals. In a variation on Holtfreter’s explant experiments, he explanted animal caps and vegetal pieces from salamander embryos and grew them either separately or in combination (Nieuwkoop 1969). He found that neither the animal caps nor the vegetal pieces were able to form mesoderm when grown separately, but mesoderm was present when the vegetal pieces were grown in combination with the animal caps (Fig. 7.6a). In salamanders, mesodermal tissue was derived exclusively from cells in the pigmented animal cap ectoderm (Nieuwkoop 1969). Similar results were obtained in Xenopus laevis (Nakamura et al. 1970). These experiments identified the vegetal pole as the likely source of the endogenous mesoderm inducing signals, although Nakamura cautioned that “‘mesodermal induction’, meaning the conversion of presumptive ectoderm into mesoderm, is an abnormal phenomenon” which is only suggestive of the process that occurs in normal development (p. 318) (Nakamura et al. 1970).\n\n7.5.1.3 The Nieuwkoop Center\n\nA series of more spatially and temporally refined recombination experiments showed that the vegetal cells contained at least two types of inductive signals, and that these signals act before gastrulation. Dorsally located vegetal cells were able to induce ectodermal cells to become notochord, a dorsal mesodermal structure, with high frequency, but could only rarely induce ectoderm to form blood, which is derived from the ventral mesoderm. Ventral vegetal cells were able to induce ventral and intermediate mesodermal cell types easily, but could only rarely induce notochord (Dale et al. 1985; Dale and Slack 1987b). A series of heterochronic recombinants showed that vegetal pieces from young embryos could not act on gastrula-stage explants, but that gastrula stage vegetal pieces could act on younger ectoderm (Dale et al. 1985). This showed that the vegetal pieces continue to produce the mesoderm-inducing signal after gastrulation, but that the ectoderm loses the competence to respond to these signals. The dorsal mesoderm inducing activity was further localized to the dorsal-most vegetal cells of a 64-cell stage embryo, and its descendants (Gimlich and Gerhart 1984). When transplanted to the ventral side of a host, these cells could induce a full body axis, like the Organizer. Unlike the organizer, however, these cells did not contribute any cells to the axis itself and differentiated into gut endoderm. This region of the embryo was named the Nieuwkoop Center, in honor of the man who discovered the mesoderm-inducing capacity of cells in the vegetal pole (Gerhart et al. 1989). The Nieuwkoop center does not form in embryos treated with UV light during the first cell cycle, and all cells in resulting embryos adopt ventral fates (Gimlich and Gerhart 1984). Thus, the Nieuwkoop center is both necessary and sufficient to induce overlying cells in the embryo margin to become the Organizer .\n\n7.5.1.4 The Three-Signal Model\n\nA third inducing activity was uncovered by experiments that recombined the dorsal marginal zone (DMZ) with the ventral marginal zone (VMZ). In these experiments, the tissue was explanted after mesoderm had been specified, just before the onset of gastrulation. When explanted at this stage and grown in isolation, the VMZ generates ventral mesodermal cell types, such as blood and mesothelium, but does not produce notochord and generates only a little muscle. By contrast, when combined with the DMZ, cells from the VMZ differentiate into muscle at a high frequency and no longer produce blood or mesothelium (Slack and Forman 1980; Smith and Slack 1983; Dale and Slack 1987b). The DMZ is the site of the Organizer, and was already known to induce neural tissue from ectoderm. These experiments showed that the DMZ contains another activity that acts to “dorsalize” presumptive ventral mesoderm so that it produces a more dorsal mesodermal cell type than it would in isolation. These results suggested the Three Signal Model for mesoderm formation (Fig. 7.6b) (Dale and Slack 1987b). According to this view, a signal from the dorsal vegetal cells induces the overlying marginal cells to adopt dorsal mesodermal fates (Fig. 7.6b, black arrow), including the notochord, while a second signal from the ventral vegetal cells induces overlying cells to adopt ventral mesodermal fates, including blood and pronephros (Fig. 7.6b, yellow arrows). At a subsequent stage, signals from the DMZ dorsalize other marginal cells to adopt dorsolateral mesodermal cell fates, like muscle (Fig. 7.6b, white arrows). These experiments only tested the functional activity of the signals produced by vegetal cells and did not clarify the molecular nature of the signals. The three activities could be explained by one molecule acting in a gradient, with different effects at different concentrations, or by multiple molecules acting synergistically to induce different fates.\n\n7.5.2 Teleosts\n\n7.5.2.1 The Embryonic Shield\n\nIt quickly became apparent that embryonic induction was not restricted to amphibian embryos. Several lines of evidence indicated that the teleost embryonic shield is the functional equivalent of Spemann’s Organizer. Working in the yellow perch, Oppenheimer transplanted the embryonic shield from one embryo into ectopic locations in the blastoderm or yolk of a host embryo (Oppenheimer 1934a). She stained the host and graft with different color vital dyes, and found that the grafted shield self-differentiated into notochord and somites, and induced neighboring host cells to form a secondary neural axis, like Spemann and Mangold had observed in salamanders a decade earlier. Similar results were obtained in subsequent transplant experiments with shields from killifish (Fundulus heteroclitus), trout, zebrafish, and medaka embryos (Oppenheimer 1934b, 1936c; Luther 1935; Shih and Fraser 1996; Inohaya et al. 1999). Conversely, neural tissue failed to form when the prospective neural ectoderm of a trout embryo was extirpated and grafted onto the yolk, far from any inductive signals of the shield (Luther 1936). The shield is necessary and sufficient to induce neural tissue from naïve ectoderm and the shield fulfills Spemann’s definition of an organizer tissue.\n\nOppenheimer went one step further and showed that amphibian cells could respond to signals from the shield (Oppenheimer 1936b). She implanted the shield of a zebrafish embryo into the blastocoel of a newt embryo. In the resulting chimeras, the zebrafish tissue differentiated into a notochord and somites, as expected, and the amphibian host cells surrounding this graft formed ectopic neural tissue. This striking result showed that the inductive signals themselves were likely to be conserved between amphibians and teleosts.\n\n7.5.2.2 The YSL\n\nEarly experiments to determine the role of the yolk during teleost development yielded ambiguous results. The great geneticist Thomas Hunt Morgan (1866–1945) was the first person to perform a systematic experimental analysis of teleost development, working with wrasse, sea bass, and killifish embryos at the Marine Laboratory in Woods Hole, Massachusetts (Morgan 1893, 1895). He used a needle to poke a hole in the vegetal pole of the embryo, opposite the blastodisc, gently squeezed out the yolk, and permitted the sac to backfill with seawater. He concluded that, “The yolk may be removed from the egg of Fundulus at almost any stage of development and the embryo still forms.” (p. 809) (Morgan 1893). The caveat to this conclusion was that embryonic development ceased if he removed more than two-thirds of the yolk content. Morgan viewed the yolk as a passive structure, important only for the mechanics of embryonic cleavages and epiboly. Oppenheimer reinvestigated the role of the yolk in killifish, with a full understanding of embryonic induction (Oppenheimer 1936a). Her approach was to remove the entire blastoderm from the yolk at different stages and to grow them as isolates in culture. Blastoderms isolated after the 32-cell stage produced embryos with structures from all three germ layers, although they typically lacked posterior structures. Blastoderms isolated before this stage formed a hollow ball of epidermis reminiscent of the atypical ectoderm formed in Holtfreter’s animal cap explants. Oppenheimer concluded that the yolk syncytial layer (YSL), which she called the periblast, contains a substance that is transferred to the blastoderm at or before the 32-cell stage, and is necessary for formation of the mesoderm and endoderm. Similar results were obtained from cultures of isolated goldfish, trout, medaka and zebrafish blastoderms (Fig. 7.6a) (Tung et al. 1954; Devillers 1961; Hyodo et al. 1996; Sagerstrom et al. 1996; Xu et al. 2014b). These transplant experiments were often difficult to interpret, given differences in staging, and whether or not a bit of the YSL had been included in the blastoderm isolates. Conclusive proof that molecules produced in the yolk are essential for embryonic development came from experiments in which RNase was injected into the YSL of zebrafish embryos (Fig. 7.7a) (Chen and Kimelman 2000). This treatment had dramatic consequences, and the embryos died before gastrulation, failing to express the earliest markers for mesoderm and endoderm. Since zebrafish embryos lacking mesoderm and endoderm survive perfectly well for days, it is likely that the RNase treatment affected a number of different processes that are vital for survival past early embryonic stages .\n\nFig. 7.7 Experiments to find the mesoderm inducing signals in zebrafish. (a) Zebrafish animal cap explants differentiate into epidermis when cultured alone, but express mesodermal markers when cultured on a free yolk cell (Ober and Schulte-Merker 1999). In untreated embryos, cells near the margin express the pan-mesodermal marker, No-tail/Xbra. No-tail/Xbra expression is greatly reduced when RNase is injected into the YSL, and an ectopic no-tail/Xbra appears when an ectopic yolk cell is grafted on the animal pole of a host embryo. (b) Signals from the YSL induce mesoderm and endoderm (small black arrows), and signals from the dorsal YSL induce dorsal mesoderm and endoderm (large black arrow) Full size image\n\nA complementary set of experiments demonstrated that signals from the yolk can induce mesoderm and endoderm. In a series of heterochronic transplants, old blastoderms with visible shields were replaced with younger blastoderms, lacking shields. As development proceeded, the transplanted blastoderms always developed shields in the same location as the original blastoderm (Long 1983). In zebrafish, animal cap cells expressed markers of mesendoderm, including the shield, when they were directly exposed to the YSL in grafting experiments (Fig. 7.6a) (Mizuno et al. 1996; Ober and Schulte-Merker 1999; Rodaway et al. 1999). Because the yolk cell cannot be further physically subdivided, specific regional capabilities of the YSL have not been addressed by grafting experiments. Targeted knockdown of specific genes in the YSL, however, indicates that it expresses an essential ventralizing signal in addition to its ability to induce dorsal mesoderm (Fan et al. 2007; Sun et al. 2014). Thus in teleosts, the extraembryonic YSL performs the same functions during development that are fulfilled by the vegetal blastomeres in amphibians (Fig. 7.7b). The YSL fits all the criteria for Nieuwkoop Center. Signals from the YSL are both necessary and sufficient to induce the shield, and the YSL does not contribute to the embryonic axis, since it is an extraembryonic tissue .\n\n7.5.3 Amniotes\n\n7.5.3.1 The Node\n\nThe functional equivalent of Spemann's Organizer in amniotes is called the node. In 1875, Viktor Hensen (1835–1924) was studying the embryonic development of the rabbit when he noticed an epithelial thickening at the anterior end of the primitive streak in gastrulating embryo (Hensen 1876). Because of its appearance, he called this structure the node, although in some texts it is referred to as the primitive knot. This structure, now called Hensen’s node, was subsequently discovered in all gastrulating mammalian and avian embryos. Hensen observed that a bridge of invaginating mesoderm at the node connects the hypoblast to the epiblast. This unusual feature suggested to him that the node plays an important role in germ layer formation, but it would take nearly 60 years before experimental embryologists began to decipher its functions. After its discovery, biologists presumed the node was an embryonic growth zone (Leikola 1976). This changed when Vogt’s vital dye staining technique was used to trace the cell movements in the chicken epiblast (Wetzel 1925, 1929; Gräper 1929). These studies revealed that the cells of the epiblast migrate in an arc-like pattern toward the midline where they converge and invaginate in the streak and node. Later fate maps, using the more reliable lipophilic lineage tracers DiI and DiO, confirmed these observations (Hatada and Stern 1994). The node and primitive streak, therefore, are the sites where the germ layers form as the presumptive mesoderm and endoderm internalize. Rather than being a static structure, the node is composed of a highly dynamic cell population of endoderm and mesoderm precursors, equivalent to the teleost shield and the amphibian dorsal lip.\n\nEarly grafting experiments showed that the node and anterior primitive streak have the ability to self-differentiate when transplanted to the chorioallantoic membrane (Hunt 1931; Willier and Rawles 1931). Conrad H. Waddington (1905–1975) developed a technique for culturing chicken and duck blastoderms on a blood clot in a watch glass, with all the yolk removed (Waddington 1932). With this method, he could visualize development continuously for a period of days after various experimental manipulations. His first report describes 650 different operations. In one set of experiments, the epiblast was divided into pieces that were cultured separately. Only sections containing the node and anterior streak could produce embryonic organs such as the neural plate, notochord, heart and liver. This suggested that the node was essential for axis formation. Waddington next inserted pieces of the primitive streak underneath the epiblast of a cultured blastoderm. Anterior streak and node, but not the posterior streak, could induce the overlying epiblast to form a secondary body axis. Furthermore, nodal tissue from a duck could induce a secondary axis in a chicken epiblast, and vice versa (Waddington and Schmidt 1933). A limitation of these experiments is that they relied exclusively on morphological criteria to distinguish host tissue from graft because the vital dyes did not label tissue with sufficient intensity to be visible in sections, and because duck tissue was indistinguishable from chicken tissue under the microscope (Waddington 1932). Waddington was cautious in his conclusions, but his results were replicated much later using modern tissue labeling methods and quail-chick xenografts (Storey et al. 1992; Psychoyos and Stern 1996). These experiments show that the amniote node meets Spemann’s definition of an organizer tissue. The mouse node can also induce a secondary neural axis in grafting experiments, indicating that organizer activity is a property common to the node in all amniote embryos (Beddington 1994).\n\nA series of xenograft experiments showed that zebrafish and Xenopus blastulae respond to signals from the chicken and mouse nodes (Kintner and Dodd 1991; Blum et al. 1992; Hatta and Takahashi 1996). Similarly, the rabbit node can induce neural ectoderm in chicken embryo (Waddington 1937). The conserved activities of these tissues suggested that the signals themselves were likely to be conserved among all vertebrates. This was confirmed when Chordin and Noggin were identified as the endogenous, neural inducing, and dorsalizing signals expressed in the amphibian Organizer, teleost shield, and amniote node (Smith and Harland 1992; Sasai et al. 1994; Connolly et al. 1997; Fisher et al. 1997; Schulte-Merker et al. 1997; Streit et al. 1998; Furthauer et al. 1999; Bachiller et al. 2000).\n\n7.5.3.2 Koller’s Sickle/PMZ\n\nIt has been more challenging to identify the equivalent of the Nieuwkoop center in amniotes than in other phyla, mostly due to the more complicated anatomy of the blastoderm. Attention has focused on three extraembryonic tissues: the hypoblast, Koller’s sickle and the posterior marginal zone (PMZ). The location of the hypoblast underneath the epiblast is reminiscent of the location of the vegetal blastomeres under the marginal zone of amphibians. Waddington was the first to test the capacity of the hypoblast to induce mesoderm, working in chicken and duck embryos (Waddington 1932, 1937). He separated the hypoblast from the epiblast, rotated the it 90° or 180° along the anteroposterior axis, recombined the pieces and grew them in culture. In all cases, the primitive streak developed abnormally, and sometimes secondary primitive streak and body axis formed with its polarity coordinated with that of the rotated endoderm. Although this result was suggestive, the lack of adequate lineage-tracing techniques meant that Waddington could not definitively conclude that the formation of a new node and streak was due to an inductive event. More recent experiments used lineage labels to unambiguously demonstrate that the node is induced, but have variously identified Koller’s sickle, the PMZ, and the hypoblast as the inductive tissue (Azar and Eyal-Giladi 1979; Eyal-Giladi et al. 1992; Callebaut and Van Nueten 1994; Khaner 1998; Callebaut et al. 2003). For instance, a secondary body axis forms when a square piece of tissue from the PMZ including Koller’s sickle, is grafted orthogonally to the endogenous PMZ (Fig. 7.8a) (Khaner and Eyal-Giladi 1989; Eyal-Giladi et al. 1992). Subsequent experiments found that Koller’s sickle alone could not induce a primitive streak (Khaner 1998). Furthermore, detailed fate mapping showed that cells in Koller’s sickle contribute to the axial mesoderm (Bachvarova et al. 1998). These results eliminated the sickle from consideration as the Nieuwkoop Center. PMZ dissected from a chicken or duck embryo in the absence of Koller’s sickle can induce a primitive streak and body axis when grafted to an epiblast (Fig. 7.8a) (Bachvarova et al. 1998; Khaner 1998). Importantly, labeled cells in the graft did not contribute to the new body axis, indicating that the avian PMZ expresses signals that induce formation of the primitive streak near the marginal zone, which is comprised of future mesoderm and endodermal cells (Fig. 7.8b, large arrows). Similar grafting experiments have not been performed in mammals, but genetic studies in the mouse demonstrated that signals from the extraembryonic visceral endoderm (VE) are required to induce the node and primitive streak (Varlet et al. 1997). Thus, the avian PMZ and the mammalian VE are functionally equivalent and meet the criteria of the Nieuwkoop center. As the primitive streak extends and the node migrates toward the anterior, signals from the posterior streak induce surrounding epiblast cells to form lateral mesoderm (Fig. 7.8b, small arrows). Cells only become committed to these fates, however, after they invaginate through the primitive streak (Kimura et al. 2006). The node gains the ability to induce neural tissue when the streak has reached its full extension (Fig. 7.8b, white arrows) (Storey et al. 1992).\n\nFig. 7.8 Experiments to find the mesoderm inducing signals in chicken. (a) The PMZ can induce an ectopic primitive streak and Hensen’s Node when grafted at a 90° angle with respect to the original axis. The PMZ from a quail embryo can induce a primitive streak to form when grafted to the anterior portion of a chicken epiblast. (b) Signals from the PMZ induce formation of the primitive streak in the posterior area pellucida (top embryo, black arrows). At a later stage, the primitive streak and Hensen’s Node express signals that induce mesoderm and endoderm, and signals from Hensen’s Node pattern the neural tissue (white arrows) Full size image\n\n7.5.4 Conclusion\n\nThe discovery of the germ layers by Pander and von Baer raised the question of how the three layers cooperate to ensure the proper placement of organs relative to each other and with respect to the body axis. Some mechanism must act to guarantee that the foregut, for instance, always forms in the head rather than in some other location. The extent of communication between the germ layers only became apparent in the early twentieth century, when experimental embryologists began dissecting embryos and transplanting tissues to different locations, or developing them in culture. Comparisons of the effects of these manipulations to the normal fate maps demonstrated that cell fates depend on their environmental context. Spemann and Mangold found that in tissue transplants, the dorsal lip of the blastopore self-differentiates as axial mesoderm and induces the overlying ectoderm to form neural tissue. Because of these properties, they named this tissue the Organizer. Subsequently, tissues with Organizer properties were discovered at the onset of gastrulation in all vertebrate embryos. The fact that Organizer tissues function across phyla boundaries indicated that a common mechanism acts in all vertebrates to induce neural tissue, despite the obvious morphological differences between the embryos at these stages. The discovery that Chordin and Noggin are expressed in the amphibian Organizer, the teleost shield and the amniote node and streak confirmed this prediction and transformed our understanding of how the vertebrate body plan is constructed. Chordin and Noggin are both secreted antagonists of the Bone Morphogenetic Proteins (BMP), a subclass of the TGF-β superfamily that ventralizes the embryo (Piccolo et al. 1996; Zimmerman et al. 1996). Thus, instead of providing a signal that induces dorsal fates, signals from the organizer the act to block ventralizing signals.\n\nExperimental embryologists also identified the tissues that induce the Organizer, called the Nieuwkoop Center, as discussed above. In amphibians, the Nieuwkoop Center is located in the dorsal vegetal blastomeres, which are fated to become gut endoderm, and other vegetal cells induce ventral mesodermal cell types. In teleosts and amniotes, the Nieuwkoop Center is located in extraembryonic tissues, including the YSL, PMZ and the mammalian VE. Signals from these tissues induce all mesodermal and endodermal cell types in the overlying blastoderm, including the shield and node. The combined action of the Nieuwkoop Center and the Organizer explains how development of the germ layers is coordinated. Therefore, the reason the foregut always forms in the head is because prior to gastrulation, precursors of the foregut induce organizer tissue, which induces and patterns the brain and head. In teleosts and amniotes, the foregut precursors and the organizer tissues are both induced by signals emanating from extraembryonic tissues, but the result is the same: coordinated development of organs within the three germ layers."}, {"url": "https://timenote.info/en/Christian-Heinrich-von-Pander", "page_content": "Heinz Christian Pander, also Christian Heinrich Pander was a Baltic German (nowadays, Latvia) biologist and embryologist.\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist.\n\nIn 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.\n\nHis study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings. Pander is credited as the first scientist to describe primitive creatures known as conodonts.\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.\n\nHe died in Saint Petersburg.\n\nPander's eponyms are:\n\nPander's islands or blood islands\n\n​Works"}, {"url": "http://cdn-cache.worldheritage.org/articles/Heinz_Christian_Pander", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://popularbio.com/heinz-christian-pander/", "page_content": "Updated On April 30, 2023\n\nHeinz Christian Pander estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Heinz Christian Pander in 2019-2020? Scroll below and check more detailed information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nHeinz Christian Pander was born in Riga, Latvia on July 24, 1794.\n\nOn Popular Bio, Heinz Christian Pander is one of the successful Explorer. Heinz has ranked on the list of those famous people who were born on July 24, 1794. Heinz Christian Pander is one of the Richest Explorers who was born in German. Heinz Christian Pander also has a position among the list of Most popular Explorer.\n\nShort Profile First Name Heinz Last Name Pander Profession Explorer Died 71 years (age at death) Birth Sign Leo Birth Date July 24, 1794 Birth Place Riga, Latvia Country German\n\nHeinz Christian Pander Net Worth\n\nHeinz Christian Pander estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Heinz Christian Pander in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Explorer Heinz Christian Pander’s net worth is $1-5 Million before died. Heinz Christian Pander earned the money being a professional Explorer. Heinz Christian Pander is from German.\n\nHeinz Christian Pander’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 $1-$3million Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Explorer (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nHeinz Christian Pander has died at 71 years (age at death). Heinz Christian Pander’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Heinz Christian Pander Dating?\n\nHeinz Christian Pander keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Heinz Christian Pander’s past relationships, ex-girlfriends, and previous hookups. Heinz Christian Pander prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Heinz Christian Pander"}], "Heinz Christian Pander was the first to describe the process of gastrulation in chick embryos.": [{"url": "https://embryo.asu.edu/pages/christian-heinrich-pander-1794-1865", "page_content": "Christian Heinrich Pander, often remembered as the father of embryology, also explored the fields of osteology, zoology, geology, and anatomy. He was born in Riga, Latvia, on 24 July 1794. Pander, with an eclectic history of research, is best remembered for his discovery and explanation of the structure of the chick blastoderm, a term he coined. In doing so, Pander was able to achieve the goal set forth by his teacher, Ignaz Döllinger, to reinvigorate the study of the chick embryo as a means of further exploring the science of embryology as a whole. His findings paved the way for the work of Karl Ernst von Baer, who would later revolutionize the field of embryology with his research.\n\nPander initially studied in the local schools of his hometown, Riga, and eventually enrolled in the University of Dorpat in 1812. While studying there, Pander attempted to pursue an education in both medical science as well as natural history. It was during this time that Pander began to work with an anatomist named Karl Friedrich Burdach who had previously taught Karl Ernst von Baer. Pander left Dorpat in 1814 and traveled to Germany. It was there in 1816 that Pander met von Baer, who convinced him to study at the University of Würzburg under the tutelage of Ignaz Döllinger. Pander agreed and traveled to Würzburg where he received his MD in 1817. It was also here that he published his dissertation, Historia Metamorphoseos Quam Ovum Incubatum Prioribus Quinque Diebus Subit, a study of the components of the chick embryo including detailed illustrations by Eduard Joseph d’Alton.\n\nDuring his work at the University of Würzburg, Pander discovered the blastoderm of the chick embryo. The blastoderm is the outermost cellular layer of the embryo, which Pander believed contributed greatly to embryonic development. He studied the blastoderm’s role in early embryonic development, describing the outer, middle, and inner layers in detail while only being able to conclude that the development of blood vessels occurred in the middle layer and that important events of embryonic development followed thereafter. Despite the lack of in-depth conclusions, Pander’s discovery and recognition of the blastoderm as well as the layered structure of the embryo provided invaluable information and guidance to his colleagues as well as future embryologists, including von Baer.\n\nDespite promising early research, Pander did not pursue further work in the study of chick embryos or embryology in general. After he obtained his MD and published his dissertation, Pander began traveling through Europe visiting science museums and continuing his work of observation in the fields of biology, paleontology, and geology. His primary goal in doing so was to visit and study the newest and most intricate fossils and skeletons discovered in different parts of the world. Pander eventually began to publish a series of works on osteology, the study of bones, collaborating once again with E. J. d’Alton. Pander became a member of the Academy of Sciences in St. Petersburg in 1821 and a member of the St. Petersburg Zoological Academy in 1826. For the remainder of his life, Pander lived mainly in his estate near his hometown of Riga while still taking time to travel and continue his work in the fields of geology and paleontology, though none of his later work gained significant recognition. Pander died on 22 September 1865 in St. Petersburg. Though somewhat inconclusive, Pander’s work with chick embryos and their components marked the beginning of a more advanced understanding of embryology."}, {"url": "https://www.nature.com/articles/s41586-021-04158-y", "page_content": "Collection of human gastrula cells\n\nThe CS7 embryo was provided by the Human Developmental Biology Resource (HDBR) (https://www.hdbr.org/general-information). HDBR has approval from the UK National Research Ethics Service (London Fulham Research Ethics Committee (18/LO/0822) and the Newcastle and North Tyneside NHS Health Authority Joint Ethics Committee (08/H0906/21+5)) to function as a Research Tissue Bank for registered projects. The HDBR is monitored by The Human Tissue Authority for compliance with the Human Tissue Act (2004). This work was done as part of project #200295 registered with the HDBR. The material was collected after appropriate informed written consent from the donor by medical termination. The sample was collected and transported in cold L15 medium. It was then transferred to M2 medium and imaged on a Leica Stereo microscope. The sample was micro-dissected using tungsten needles and dissociated into single cells using 200 μl Accutase (ThermoFisher, catalogue (cat.) no. A1110501) for 12 min at 37 °C, with agitation every 2 min, before adding 200 μl heat-inactivated FBS (ThermoFisher, cat. no. 10500) to quench the reaction. Cells were then centrifuged at 1,000 rpm for 3 min at 4 °C before being suspended in 100 μl HBSS (ThermoFisher, cat. no. 14025) + 1% FBS, and stored on ice. Single cells were collected using a Sony SH800 fluorescence-activated cell sorter with a stringent single-cell collection protocol and sorted into 384-well plates containing SMART-seq2 lysis buffer32 plus ERCC spike-ins (1:10 M). To ensure we collected good quality cells, a live/dead dye (Abcam, Cat No. ab115347) was used; 100 μl was added to the cell suspension at a 2× concentration in HBSS 10 min before collection, and live cells were collected on the basis of their FITC intensity. Once cells were collected, plates were sealed, spun down, and frozen using dry ice before being stored at −80 °C. This complete process, from dissection to single-cell collection, took approximately 2–3 h. The embryo was karyotypically normal (region-specific assay: (13, 15, 16, 18, 21, 22) × 2, (X, Y) × 1).\n\nSingle-cell RNA sequencing\n\nmRNA from single cells was isolated and amplified (21 PCR cycles) using the SMART-seq2 protocol32. Multiplexed sequencing libraries were generated from cDNA using the Illumina Nextera XT protocol and 125 bp paired-end sequencing was performed on an Illumina HiSeq 2500 instrument (V4 chemistry).\n\nRaw data processing and normalization\n\nTo quantify the abundance of transcripts from 1,719 cells, Salmon v0.1733 was used. After indexing the human transcriptome (GRCh38.p13) in quasi-mapping-based mode, we quantified the transcripts with Salmon using the–seqBias and–gcBias flags. We combined the transcript level abundances to the corresponding gene level counts, which were aggregated into a gene-count matrix. Then, for downstream analyses, we only retained cells with more than 2,000 detected genes, with overall mapping rate greater than 55% and with relatively low mapping rate to mitochondrial genes (<0.02) and to ERCC spike-ins (<0.2). After this step, we obtained 1,195 good quality cells. The data were normalized using the quickcluster and normalize functions from the scran package in R34. This was followed by pseudocount addition of 1 and natural-log transformation of the count matrix.\n\nClustering and cell type identification\n\nTo identify clusters of cells, we applied a graph-based algorithm. First, we selected the top 4,000 highly variable genes (HVGs) using the high_variable_genes function from scanpy v1.4.435. We constructed the cell–cell distance matrix as \\(\\sqrt{(1-\\rho )/2}\\), where ρ is the Spearman’s correlation coefficient between cells. Next, a k-nearest neighbour graph was built with the first 30 principal components and k = 50. This was accomplished by the ‘neighbors’ function in scanpy, which computes the connectivity between cells based on UMAP (method = ‘umap’)36. To identify clusters, we applied the Leiden algorithm for community detection to the resulting graph (with a resolution of 0.75), as it has been shown to be a superior alternative to Louvain37. The same algorithm and resolution were used for subclustering the endoderm, the ectoderm and the haemogenic endothelial progenitors clusters with top 2,000 HVGs in each. However, in this case the k-nearest neighbour graph was built with the first 10 principal components and k = 20. We visualized the resulting clusters in two dimensions by computing a UMAP representation with default parameters in scanpy (tl.umap function). To check the robustness of the clustering, we also computed the shared nearest neighbour (SNN)38 graph and applied Leiden to it (resolution = 1.75), which produced very similar clusters (the adjusted mutual information score calculated with Python’s sklearn module was 0.8).\n\nWe identified marker genes for the clusters with the Wilcoxon rank-sum test in scanpy (rank_genes_groups function), by comparing the gene-expression levels in a given cluster with the rest of the cells in the dataset. The genes were ranked according to their false discovery rate (FDR), after P values were corrected with the Benjamini–Hochberg method. We visualized the expression values of marker genes on a heat map, after scaling the log-normalized counts between 0 and 1 by using the ‘standard_scale = var’ option in the scanpy heat map plotting function sc.pl.heatmap.\n\nIsoform analysis\n\nWe obtained the isoform-level count matrix from Salmon, considering transcripts per million-normalized counts and the ENSEMBL database (GRCh38.p13) for annotation. We compared transcript levels between pairs of clusters. First, we removed genes with more than 80% counts mapped to a single isoform. Then, for each gene, we built a contingency table including the average normalized levels of each isoform in the two clusters being compared. A chi-squared test was then used to check whether the isoform abundances differ between the two clusters of cells for a given gene, as in ref. 39.\n\nTrajectory analysis using diffusion pseudotime and RNA velocity\n\nFor the whole-embryo diffusion map, we built the k-nearest neighbour graph as described above (with k = 50 and using the first 30 principal components) to find the connectivity kernel width. We then used the diffmap function to build the diffusion map.\n\nTo estimate the trajectory of epiblast differentiation, we took 2,000 HVGs from epiblast, primitive streak, ectoderm and nascent mesoderm clusters combined. Finally, the diffusion components were computed from the first 15 principal components with k = 15.\n\nTo illustrate the estimated direction of differentiation of epiblast cells, we embedded the RNA velocities23 of single cells on the above diffusion map. For this task, we aligned reads from each cell using STAR v2.740 to the human reference genome (GRCh38.p13), which was obtained from ENSEMBL. The aligned bam files were processed with velocyto v0.17.1723 with the default run-smartseq2 mode, to create a count matrix made of spliced and unspliced read counts.\n\nAfter filtering genes with less than 10 spliced and un-spliced counts from this matrix, we calculated the moments for velocity estimation by utilizing a built-in function from scVelo Python module v01.2041. Subsequently, we inferred the splicing kinetic dynamics of the genes by applying the recover_dynamics function. The velocity of each gene was estimated by solving splicing kinetics in the dynamical mode with the velocity function. Finally, we embedded the resulting velocities on the diffusion space calculated above by means of the velocity_embedding function from the scVelo module. The diffusion map and the RNA velocities for the mesoderm specification analysis were computed in the same way.\n\nWe defined a diffusion pseudotime (dpt) coordinate on the diffusion map of epiblast differentiation in order to visualize gene-expression trends. First, we fixed the cell with the highest value of the first diffusion component (DC1) as root, so that the middle point of pseudotime would fall roughly into epiblast. We fitted the expression levels of the genes as a function of the pseudotime with a generalized additive model using the gam package in R (v1.16.1). For visualisation purpose, we transformed the pseudotime values as (1 − dpt), so that ectoderm cells would fall onto the left side and primitive streak and nascent mesoderm would be on the right side of the pseudotime plot (Extended Data Fig. 5a–c). Both fitted and unfitted values of the genes were scaled by dividing each by its maximum value of expression.\n\nHuman and mouse EMT comparison\n\nFor this analysis, we considered published single-cell RNA-seq data from mouse embryos during mid-streak stage (E7.25)18, but we also checked that the results remain largely unaffected if data from E7.0 or E7.5 are used. Epiblast, primitive streak and nascent mesoderm clusters were selected from the human and the mouse datasets for downstream analysis, and they were analysed separately as detailed below.\n\nAfter constructing diffusion maps as described above with default parameters, we defined pseudotime starting from the cell with lowest DC1 value in both cases (Extended Data Fig. 6a). After fitting gene-expression values along pseudotime with generalized additive models (see above), we calculated the P values using the analysis of variance (ANOVA) non-parametric test from the gam R package and we then obtained the FDR values (Benjamini–Hochberg method). Genes with FDR <0.1 were clustered according to their expression pattern. This was achieved by hierarchical clustering with Spearman’s correlation distance as described above (hclust function in R). For estimating the number of clusters, the dynamic hybrid cut method was used (cutreeDynamic function, in the package dynamicTreeCut, version 1.63, with ‘deepslit’ = 0 and ‘minclustersize’ = 50). In both human and mouse, we found three clusters of genes, two of which were characterized by a clear upward or downward average trend with an absolute log 2 fold change greater than 1 between the fitted values at the end and at the beginning of the trajectory.\n\nFor the human–mouse comparison, we converted mouse genes to human equivalents (one-to-one homologous genes only) with the biomaRt R package42. We compared the trends of genes in human and mouse, and in particular we looked at genes coding for signalling molecules, as listed in the curated database of the CellPhoneDB package43. To visualize the trend of selected genes, we normalized the expression values by the maximum in both mouse and human. We set fitted values to zero for the genes that were expressed in fewer than 10 cells.\n\nMouse cluster comparison and blood staging analysis\n\nWe mapped the cells from the human gastrula against the mouse clusters at E7.25 available from ref. 18. To do this, we took the median levels of genes as a representation of the typical expression pattern of a given mouse cluster, and then, for each cell in the human gastrula, we used the “scmapCluster” function from the “scmap” R package44 (with 1,000 genes and similarity threshold parameter set to 0) to identify the mouse cluster that was most similar to it. We performed the same procedure for human endoderm (Fig. 3c) and HEP (Extended Data Fig. 10g) subclusters.\n\nFor staging analysis, we selected epiblast, primitive streak, endothelium, blood progenitors (1 and 2), and erythroid (1, 2 and 3) mouse clusters across the 9 stages, from E6.5 until E8.5. We merged the two blood progenitor clusters as well as three erythroid clusters and we obtained four mouse blood-related clusters that were used in downstream analyses. After verifying that the human blood-related clusters map onto the corresponding mouse clusters, we built a representative expression pattern for mouse for each cluster and stage, by calculating the median expression value of the genes per cluster and stage. Cells from human gastrula blood (erythroblasts, myeloid progenitors, endothelium, blood progenitors and EMPs), epiblast and primitive streak clusters were projected onto the corresponding mouse clusters (human erythroblasts to mouse erythroid; human myeloid progenitors, blood progenitors and EMPs to mouse blood progenitors; human endothelium to mouse endothelium; human primitive streak to mouse primitive streak; human epiblast to mouse epiblast) using scmap with the same parameters specified above.\n\nHuman and non-human primate gastrulation comparison\n\nWe considered single-cell non-human primate (NHP) gastrulation data19 at 16 days post fertilization (dpf), since PGCs were only identified at that stage. Seurat integration method was applied to human and NHP single-cell data with 3,000 features used to find anchors (anchor.features parameter) and 70 neighbours to filter anchors (k.filter parameter). After obtaining the corrected expression values, we calculated the mean expression level of each gene per cluster. Finally, we performed hierarchical clustering with Spearman’s correlation-based distance (see above) and the average aggregation method, using the linkage function from Python’s scipy module (v 1.5.2).\n\nPGC identification and cross-species comparison\n\nTo single out the PGCs, we ran the RaceID algorithm (RaceID package v0.1.5)45, which can identify rare cell types, on the cells in the primitive streak cluster. We used these parameter values: k = 1, outlg = 8 and probthr = 0.005. This resulted in the identification of 9 subclusters of outlier cells. Among these, the PGCs were identified as the only cluster of outlier cells that had a median expression of PGC marker genes (NANOS3, SOX17, DND1, LAMA4 and DPPA5) above 0.\n\nTo perform cross-species comparison of PGCs, we considered epiblast, primitive streak and PGC cells from human and mouse (E7.5 stage), and late epiblast (L-epi), late gastrulating cells 1 (L-gast1) and PGC clusters from non-human primate (16 dpf stage) single-cell datasets. Z-scores were calculated for each gene per species by using rank_genes_groups function from scanpy with Wilcoxon rank-sum test (method = ’wilcoxon’) applied to PGC versus all others. The genes shown in the heat maps of Fig. 3d were selected from the top differentially expressed genes between PGC and the other clusters.\n\nCross-species signalling comparison\n\nWe obtained the gene sets for FGF, WNT and BMP signalling pathways from MSigDB database46. Here, we considered epiblast, primitive streak and nascent mesoderm clusters from mouse and human gastrula data, and L-epi, L-gast1 and L-gast2 clusters from the non-human primate dataset. We computed the z-scores for each cluster per organism separately with Wilcoxon rank-sum test as described above. The genes that were expressed in fewer than ten cells across all clusters in a species were labelled as undetected (Extended Data Fig. 8).\n\nCell cycle prediction\n\nWe estimated the cell cycle phase of each cell by applying the pairs algorithm described in47. A Python implementation of this algorithm, pypairs v3.1.1 was used in this analysis (https://pypairs.readthedocs.io/en/latest/documentation.html). After determining marker pairs from a training dataset48 with the sandbag function, we applied the function cyclone to assign a cell cycle phase to each cell.\n\nIndel analysis\n\nUsing our transcriptomic data, we estimated the sizes of genomic insertions and deletions (indels) in our data as well as in a dataset from human fetal liver cells49. This dataset was also processed with SMART-seq2 protocol and paired-end sequencing, although read lengths (75 bp) were smaller than in our data (125 bp). Hence, to minimize confounding effects in the results, we trimmed the reads in our data before processing it for this analysis. We aligned the data to the reference genome (GRCh38.p13), using bwa-mem v0.650 with default parameters. We then merged the aligned data from each single cell into one bam file and performed indel calling with a pipeline for insertion and deletion detection from RNA-seq data called transIndel v0.151. We kept the parameters at default values, except the minimum deletion length to be detected, which was set to 1 (-L flag set to 1).\n\nDifferential gene-expression analysis between rostral and caudal mesoderm\n\nWe used the R packages DESeq2 v3.1152 and Seurat v3.053 to identify the genes differentially expressed between rostral and caudal parts of the mesoderm cluster. After creating a Seurat object with the mesoderm cells, their anatomical and plate information, we converted it to DESeq2 object with convertTo function. We found differentially expressed genes (with FDR<0.1) between caudal and rostral parts of the mesoderm with DESeqDataSet and DESeq functions, while controlling for the plate effect.\n\nHuman embryonic stem cells comparison\n\nFor this comparison, we considered previously published single-cell RNA-seq data from pre-implantation human embryos20 and from human ES cells21. In the pre-implantation embryo data, we removed cells from extra-embryonic tissues, from immunosurgery samples and with unannotated stage. Moreover, we only kept cells with a log 10 total number of reads greater than 5.5. This resulted in 442 cells distributed between E3 and E7 stages.\n\nIn the human ES cell dataset, only cells in batch 1 (including both primed and naive human ES cells) that passed the quality test performed in the original publication were taken.\n\nThese data from pre-implantation embryos and human ES cells were combined with the epiblast cells in our dataset, and count per million (CPM) normalization was performed. To assess the relationship between the datasets, we also used two different integration methods: Harmony54(with the same HVGs and default parameters) and Seurat (using the same procedure as in the comparison with NHP data described above).\n\nTo compare changes in gene-expression levels between the naive and primed state in epiblast and in human ES cells, we took cells from E6 stage, given that they were closest to the naive (Fig. 2a, Extended Data Fig. 3a). Then, the log-fold changes of the previously identified HVGs (after removal of genes with less than mean log count of 1) were calculated between CS7 vs E6 cells and primed versus naive human ES cells, after adding a pseudocount of 0.1 to the mean expression values. The line in Extended Data Fig. 3b is obtained through a linear regression (LinearRegression function from sklearn Python module).\n\nHuman gastruloid comparison\n\nRecently published spatial transcriptomic data from human gastruloids were considered for the comparison12. Specifically, we took the z-scores of the genes that were found to be reproducible across the two replicates of the spatial transcriptomic experiment (source data of figure 3c in ref. 12). For these genes, we also calculated z-scores in each cluster of our human gastrula data using rank_genes_groups function from scanpy with Wilcoxon rank-sum test (method = ’wilcoxon’) applied to cells in a given cluster versus all other cells.\n\nThen, we compared the human gastrula with the gastruloid data by computing\n\n$${\\rho }_{ij}={\\rm{corr}}({{\\bf{G}}}_{{\\boldsymbol{i}}},{{\\bf{S}}}_{{\\boldsymbol{j}}}),$$\n\nthat is the Pearson’s correlation coefficient between the z-scores of the ith gastrula cluster G i and the z-scores of a gastruloid slice taken at the jth position along the anterior–posterior axis S j . A null distribution for ρ ij , \\({\\mathscr{P}}({\\rho }_{{ij}})\\), was estimated by computing the Pearson’s correlation coefficient after shuffling the z-scores of the gastruloid dataset across slices 500 times. We estimated a P value p ij as:\n\n$${p}_{ij}=\\sum _{{\\rho }_{ij}^{\\ast } > {\\rho }_{ij}}{\\mathscr{P}}({\\rho }_{ij}^{\\ast })$$\n\nMaintenance and differentiation of human ES cells\n\nHuman ES cells (H9/WA09 line; WiCell) were cultured on plates coated with 10 µg ml−1 vitronectin (Stem Cells Technologies) at 37 °C with 5% CO 2 . Pluripotent human ES cells were plated as single cells at 4.0 × 104–5.0 × 104 cells per cm2 using accutase (Gibco) and 10 µM Y27632 (Selleck), and maintained for two days in E6 medium55 supplemented with 2 ng ml−1 TGF-β (bio-techne) and 25 ng ml−1 FGF2 (M. Hyvönen, Cambridge University). These cells were sampled as ‘D0 PLU’. Then, the cells were cultured for one day in CDM/PVA medium56, 1 mg ml−1 polyvinyl alcohol (Sigma) (instead of BSA) with 100 ng ml−1 activin A (M. Hyvönen, Cambridge University), 80 ng ml−1 FGF2, 10 ng ml−1 BMP4 (bio-techne), 10 µM LY294002 (Promega) and 3 mM CHIR99021 (Tocris), and sampled as ‘D1 ME’ or ‘D1 ME + PD’. PD0325901 (Stem Cell Institute) was added at 1 µM. Bright-field images were taken with an Axiovert microscope (200M, Zeiss). Authentication of the H9/WA09 cell line was conducted by fingerprinting and the cells were confirmed negative for mycoplasma.\n\nImmunocytochemistry\n\nCells plated on vitronectin-coated round coverslips (Scientific Laboratory Supplies) were washed once with PBS, and fixed with 4% paraformaldehyde (Alfa Aesar) in PBS at room temperature for 10 min. Following another PBS wash, cells were incubated with 0.25% Triton in PBS at 4 °C for 15–20 min, 0.5% BSA (Sigma) in PBS at room temperature for 30 min, primary antibodies at 4 °C overnight and secondary antibodies at room temperature for one hour. Anti-E-cadherin antibody (3195, Cell Signaling Technology; 1:200), and anti-Rabbit IgG–Alexa Fluoro 568 (A10042, Invitrogen; 1:1,000) together with 10 µg ml−1 Hoechst33258 (B2883) were diluted in 0.5% BSA in PBS and each staining was followed by three washes with 0.5% BSA in PBS. Coverslips were preserved on slide glasses (Corning) with ProLong Gold Antifade Mountant (Life Technologies) and nail polish, and observed with a Zeiss inverted confocal system (LSM 710, Zeiss).\n\nQuantitative real-time PCR for human ES cell samples\n\nTotal RNA was extracted from cells using the GenElute Mammalian Total RNA Miniprep Kit (Sigma-Aldrich) and the On-Column DNase I Digestion set (Sigma-Aldrich). Complementary DNA was synthesized from the RNA using random primers (Promega), dNTPs (Promega), RNAseOUT (Invitrogen) and SuperScript II (Invitrogen). Real-time PCR was performed with KAPA SYBR FAST qPCR Master Mix (Kapa Biosystems) on QuantStudio 12K Flex Real-Time PCR System machine (Thermo Fisher Scientific). Molecular grade water (Thermo Fisher Scientific) was used when necessary. Each gene-expression level was normalized by the average expression level of PBGD and RPLP0. Primer sequences are shown in Supplementary Table 15 and source data are provided in Supplementary Table 17. Statistical analysis was performed using GraphPad Prism.\n\nMouse strains, husbandry and embryo collection\n\nAll animal experiments complied with the UK Animals (Scientific Procedures) Act 1986, approved by the local Biological Services Ethical Review Process and were performed under UK Home Office project licenses PPL 30/3420 and PCB8EF1B4. To obtain wild-type embryos, C57BL/6 males (in house) were crossed with 8- to 16-week-old CD1 females (Charles River). All mice were maintained in a 12-h light:dark cycle. Noon of the day when a vaginal plug was found was designated E0.5. To dissect the embryos, the pregnant females were killed by cervical dislocation in accordance with Schedule 1 of the Animals (Scientific Procedures) Act. Embryos of the appropriate stage were dissected in M2 medium (Sigma-Aldrich, cat. no. M7167).\n\nIn situ hybridization chain reaction\n\nIn situ hybridization chain reaction (HCR) kit (version 3) containing amplifier set, hybridization, amplification, wash buffers and DNA probe sets, were purchased from Molecular Instruments (http://molecularinstruments.org) and the protocol described57 was followed with slight modifications58. Probe libraries were designed and manufactured by Molecular Instruments using Mus musculus sequences from the NCBI database. Following HCR embryos were then placed into 87% glycerol solution and imaged on a Zeiss 880 confocal microscope with a 40× oil (1.36 NA) objective. Images were captured at 512 × 512 pixels using multiple tiles with a z-step of 1.5 µm. Each HCR was repeated on at least 3 embryos.\n\nReporting summary\n\nFurther information on research design is available in the Nature Research Reporting Summary linked to this paper."}, {"url": "https://biologydictionary.net/gastrulation-in-frog-embryo-chick-embryo-and-sea-urchin/", "page_content": "Overview of Gastrulation\n\nGastrulation is a phase in the embryonic development of animals where the blastula reorganizes itself into a gastrula. It does this by folding itself inward as shown in Figure 1. This is a critical point in development because it is when the embryo transforms itself from a hollow sphere made from a single layer of cells into a multi-layered structure. The layers are called the primary germ layers; the endoderm, ectoderm, and mesoderm (Figure 2). Each species has its own uniqueness when it comes to the process of gastrulation, but there are similarities that span the entire animal kingdom. Frogs, chickens, and sea urchins are 3 species most studied by developmental biologists and comparative embryologists.\n\n\n\nFigure 1: The image above shows the process of transformation from a single-celled zygote to a gastrula.\n\n\n\nFigure 2: The image above shows how gastrulation changes the number of cell layers from one to three.\n\nGastrulation in Sea Urchins\n\nGastrulation in sea urchins is used as a starting point for understanding the process, as it is less complicated or more “simple” compared to other species, and the process only takes about 9 hours. In the first step of gastrulation, primary mesenchyme cells use chemical cues inside the blastula to migrate to the inside of the sphere where they will eventually fuse and form the larval skeleton made of spicules formed from calcium carbonate. Then, the archenteron (primitive gut) forms as the blastocyst invaginates creating the blastopore. The archenteron elongates and eventually fuses with the epithelial cells on the surface to form the mouth. The anus forms at the spot where the invagination started on the surface. In sea urchins, all three primary germ layers originate from the same outside layer of cells.\n\nGastrulation in Frogs\n\nGastrulation in the frog is similar to the sea urchin, but it’s more complicated. One of the main differences is that the blastula is not hollow but is filled with yolk cells. Also different, is that the cells of the blastula in the frog form the ectoderm or endoderm while the mesoderm is made from the yolk cells inside. Another interesting aspect of frog gastrulation is that the blastopore forms a “lip” exactly 180 degrees opposite from where the sperm entered the egg. The lip is the point where the cells begin to turn and migrate inward, forming the blastopore.\n\nGastrulation in Chickens\n\nOne of the unique features of chick gastrulation is the cellular rearrangement that occurs at the posterior end of the blastula and forms the primitive streak, a thickening of the tissue. The cells making up Hensen’s node at the end of the primitive streak elongate across the blastula. Later, the cells of Hensen’s node regress, paving the way for the formation of the central nervous system. In the chick embryo, the cells of the ectoderm go on to form the skin and neural tissue, endoderm cells line the respiratory and gastrointestinal tracts, and the kidneys, circulatory system and skeleton are made from the mesoderm cells.\n\nReferences"}, {"url": "https://biologydictionary.net/gastrulation/", "page_content": "Gastrulation Definition\n\nGastrulation is the process during embryonic development that changes the embryo from a blastula with a single layer of cells to a gastrula containing multiple layers of cells. Gastrulation typically involves the blastula folding in upon itself or dividing, which creates two layers of cells. Organisms that do not form a third layer are known as diploblastic organisms. These include the jellyfish and related animals. Triploblastic organisms contain a third layer, the mesoderm, which is created from one of the first two layers. Triploblastic organisms account for the majority of higher animals.\n\nThe layers created by gastrulation become germ layers, or special tissues that give rise to specific parts of the organism. These germ layers always give rise to the same types of tissues, even in very different animals. The endoderm will give rise to the gut and associated organs. The ectoderm is the outermost layer, and will create the skin and the nervous system. Between them lies the mesoderm, which will created the connective tissues and musculature in most organisms. Before gastrulation, these layers are not defined. Gastrulation proceeds differently based on the organism it is taking place in and the type of blastula it starts from. The image below is of an embryo before and after gastrulation.\n\nBefore gastrulation, a single-celled zygote must divide many times to form a ball of cells called a blastula. This process is known as cleavage, and has different patterns in different organisms. The blastulas of different organisms can take many different shapes. Some blastulas are a hollow ball of cells, some a solid ball of cells, while other types retain yolk as an energy source and form around or on the yolk. The gastrulation of these different types of blastula will be discussed below.\n\nThe cell layers created during gastrulation distinguish metazoan animals from protozoan animals. Gastrulation also marks the point in development that the internal cells are separated from the cells that will interact with the environment. The archenteron, or gut, forms during gastrulation. The singular opening to the gut is known as the blastopore. In jellyfish it serves as both the mouth and the anus. In higher animals, a second opening develops during the formation of the internal organs. Animals are divided into two categories, based on what the blastopore becomes. In the protostomes, the blastopore will become the mouth. This is seen in mollusks, arthropods, annelids (earthworms), and some other animals. In the deuterostomes, the blastopore will become the anus. All of the chordates, or animals with spinal cords, and echinoderms (starfish) show this pattern of development.\n\nTypes of Gastrulation\n\nGastrulation of a Coeloblastula\n\nA coeloblastula is a hollow ball of cells, one cell thick. Gastrulation in a blastula of this type involves invagination, ingression, or delamination. Invagination involves the blastula folding in on itself, creating a pocket with an opening. These are known as the archenteron and blastopore, and will become parts of the gut. The in-fold becomes the endoderm, while the outer later becomes the ectoderm. The resulting gastrula is known as a coelogastrula, because it remains hollow. This can be seen in the above image. The blastocoel is simply the empty space inside of the blastula.\n\nCoeloblastulae can also undergo a type of gastrulation that produces a solid gastrula, known as a stereogastrula. During this form of development, the cells of the blastula divide and migrate into the blastocoel, eventually filling the space. The movement of cells in this form of gastrulation is known as ingression. The cells on the inside will develop as endoderm, while the surface cells will develop as ectoderm. This can be seen in many cnidarians, such as sea anemones and jellyfish. The final form of gastrulation is called delamination, and exists when the cells of a coeloblastula each divide one, creating a layer of cells surrounding the original blastula. This form is seen in only in some groups related to jellyfish.\n\nGastrulation of a Stereoblastula\n\nA stereoblastula is a blastula that exists as a solid mass of cells. Gastrulation in stereoblastulae differs from gastrulation in a coeloblastula, because there is no internal space for the cells to divide into. Instead, cells on the surface of the ball divide at a faster rate, until the surface of the ball is covered with a new layer of cells. This layer functions as the ectoderm, while the solid ball in the middle forms the endoderm, as in the previous form of stereogastrula. The archenteron will form later, from inside the solid mass of cells.\n\nGastrulation of a Discoblastula\n\nA discoblastula, unlike the other forms of blastulae, does not form a ball of cells around the original cell. Rather, the cells are arranged in a disc at one end of the blastula, and each has access to a yolk reservoir at the other end. Gastrulation in a discoblastula involves the ends of the disc of cells curving, and growing back toward each other. The bottom layer develops as the endoderm, while the top layer further from the yolk develops as the entoderm. This is known as involution.\n\nIn addition to these standard forms of gastrulation, many others exist in nature. They are mostly combinations of these various forms presented. Scientists can study the gastrulation of organisms as a feature that helps distinguish between related organisms. As will other traits, related organisms tend to have similar modes of development.\n\nRelated Biology Terms\n\nCleavage – The series of cell division leading from a single-celled zygote to a single layer of cells, or blastula.\n\n– The series of cell division leading from a single-celled zygote to a single layer of cells, or blastula. Gastrula – The multi-layered ball of cells that arises from gastrulation of the blastula.\n\n– The multi-layered ball of cells that arises from gastrulation of the blastula. Embryology – The study of the development of embryos, which shows much about the relationships between animals.\n\nQuiz\n\n1. What is the difference between cleavage and gastrulation?\n\nA. Cleavage divides cells, gastrulation only folds them.\n\nB. There is no difference, there are essentially the same process.\n\nC. Cleavage leads to a single layer, while gastrulation produces different layers.\n\n\n\nAnswer to Question #1 C is correct. In some forms of gastrulation, the blastula does not divide, but a series of cell divisions take place. While this might seem the same as cleavage at first, the processes are somewhat different. To make a hollow ball of cells, each cell must divide along the same plane to produce a single sheet, which connects into a ball. To complete gastrulation by cell division, those same cells must divide in a direction perpendicular to the original direction. This will create a sheet of cells above the original sheet, creating separate layers of cells which develop differently.\n\n2. A single celled organism sometimes aggregates into a colony. In the colony, cells develop differently to fulfill different roles. Do these colonies undergo gastrulation?\n\nA. Yes\n\nB. No\n\nC. Only if they fold into an advanced shape\n\n\n\nAnswer to Question #2 B is correct. Again, gastrulation is defined by the creation of multiple cell layers that will become different tissues by the end of development. While colonies of single-celled organisms may have cells that are specialized, these cells still operate independently of each other. Tissues in higher organisms work cooperatively with the rest of the body to fulfill a specific function necessary for life. Many of these organisms have evolved to take advanced shapes, to take advantage of the environment, avoid predators, or simply increase their survival.\n\n3. Why do some blastula retain a yolk, even after gastrulation?\n\nA. For energy during the rest of development\n\nB. It will be shed shortly after gastrulation\n\nC. It is an evolutionary remnant\n\n"}, {"url": "https://prabook.com/web/christian.heinrich_pander/2506963", "page_content": "Christian Heinrich Pander\n\nbiologist explorer paleontologist Zoologist\n\nJuly 24, 1794 (age 71) Riga, Latvia\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander\"s concept of germ layers to include all vertebrates. Pander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective \"Panderian\", first used by the Canadian palaeontologist, Elkanah Billings. Pander is credited as the first scientist to describe primitive creatures known as conodonts. Today the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts. He died in Saint St. Petersburg. Pander\"s eponyms are: Pander\"s islands or blood islands."}, {"url": "https://www.liquisearch.com/heinz_christian_pander", "page_content": "Heinz Christian Pander, also Christian Heinrich Pander (24 July 1794 – 22 September 1865), was a Baltic German biologist and embryologist born in Riga.\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (Zarnikau) on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the St. Petersburg Academy of Sciences.\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, and was the first scientist to describe primitive creatures known as conodonts. He also conducted extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions. His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.\n\nHe died in Saint Petersburg."}, {"url": "https://infogalactic.com/info/Heinz_Christian_Pander", "page_content": "From Infogalactic: the planetary knowledge core\n\nHeinz Christian Pander, also Christian Heinrich Pander (24 July [O.S. 13] 1794 – 22 September [O.S. 10] 1865), was a Russian Empire ethnic Baltic German biologist and embryologist.\n\nBiography\n\nIn 1817 he received his doctorate from the University of Würzburg, and spent several years (1827–1842), performing scientific research from his estate in Carnikava (German: Zarnikau)[1] on the banks of the Gauja River near Riga. In 1820 he took part in a scientific expedition to Bokhara as a naturalist. In 1826 he became a member of the Saint Petersburg Academy of Sciences.\n\nResearch\n\nPander studied the chick embryo and discovered the germ layers (i.e., three distinct regions of the embryo that give rise to the specific organ system). Because of these findings, he is considered by many to be the \"founder of embryology\". His work in embryology was continued by Karl Ernst von Baer (1792-1876), who expanded Pander's concept of germ layers to include all vertebrates.\n\nPander performed important studies in the field of paleontology, being known for his extensive research on fossils found in the Devonian and Silurian geological strata of the Baltic regions.[2][3] His study of trilobites from this age led to the adjective 'Panderian', first used by the Canadian palaeontologist, Elkanah Billings.[4] Pander is credited as the first scientist to describe primitive creatures known as conodonts.[5][6]\n\nToday the Pander Society is an international association of palaeontologists and stratigraphers with a common interest in the study of conodonts.[7]\n\nHe died in Saint Petersburg.\n\nEponyms\n\nPander's eponyms are:\n\nSelected writings\n\nBeiträge zur Entwickelungsgeschichte des Hühnchens im Eye , (Contributions to the embryology involving the chick egg), (1817).\n\n, (Contributions to the embryology involving the chick egg), (1817). Beiträge zur Naturkunde aus den Ostseeprovinzen Rußlands , (Contributions on the natural history of the Baltic regions) Dorpat, (1820).\n\n, (Contributions on the natural history of the Baltic regions) Dorpat, (1820). Vergleichende Osteologie (Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828).\n\n(Comparative osteology) seven volumes, with Eduard Joseph d'Alton, Bonn: Weber, (1821–1828). Beiträge zur geognosie des russischen reiches , (Contributions to the geology of the Russian Empire), 1830.\n\n, (Contributions to the geology of the Russian Empire), 1830. Monographie der Fossilen Fische des silurischen Systems der Russisch-Baltischen Gouvernements (Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856).\n\n(Monograph of fossil fish from the Silurian stratum of the Baltic regions), St. Petersburg, (1856). Ueber die Placodermen des devonischen Systems , (On placoderms of the Devonian system), 1857.\n\n, (On placoderms of the Devonian system), 1857. Über die ctenodopterinen des devonischen systems , 1858\n\n, 1858 Über die saurodipterinen, dendrodonten, glyptolepiden und cheirolepiden des devonischen systems, 1860.[8]\n\nSee also"}, {"url": "https://link.springer.com/chapter/10.1007/978-3-319-46095-6_7", "page_content": "Although Pander understood that the three germ layers “work mutually together although destined for different ends,” von Baer’s Germ Layer Theory took a more rigid deterministic view of the germ layers as it developed over the century. At the turn of the twentieth century, tissue grafting and explant culturing methods were developed that finally permitted scientists to functionally test the roles of different embryonic tissues (Oppenheimer 1940). Vogt’s fate map made it possible to correctly interpret these experiments, since it is necessary to understand how tissues behave in their normal locations before trying to understand how they behave when placed in an abnormal environment. These embryological experiments demonstrated the source of signals that induce the germ layers, and showed that these signals act before gastrulation.\n\n7.5.1 Amphibians\n\n7.5.1.1 The Organizer\n\nAs a part of her doctoral thesis under Hans Spemann (1869–1941), Hilde Proescholdt (later Mangold) (1898–1924) worked with embryos from two differently pigmented species of salamander. She transplanted the dorsal lip of the blastopore from one embryo onto the ventral side of a host embryo. The dorsal lip is the site where gastrulation initiates in amphibians, and is visible as a small region of darkly pigmented cells at the margin. These experiments were particularly challenging because she could only obtain embryos from natural mating of a species that had only one mating season a year, and in the pre-antibiotic era, the operated embryos did not survive very well in the pond water she used to incubate her embryos (Hamburger 1984). She repeated the experiment several hundred times over the course of 2 years in order to obtain the six survivors that formed the basis of her Nobel prize winning paper (Spemann and Mangold 1924). The grafted tissue induced an entire secondary body axis. The transplant differentiated into notochord, muscle and some gut, and the overlying host cells adopted neural fates (Spemann and Mangold 1924). The mesoderm of the dorsal lip is sufficient to induce the overlying ectoderm to form neural tissue, and to organize an entire secondary body axis. Spemann called this tissue the Organizer, and laid out three characteristics that functionally define organizer tissue. The Organizer tissue should induce neural tissue from naïve ectoderm, self-differentiate into notochord and prechordal plate, and reprogram surrounding tissue within the mesoderm.\n\n7.5.1.2 Mesoderm Induction\n\nJohannes Holtfreter (1901–1992) used a different approach to determine how the germ layers interact to produce the embryo. He developed culturing conditions that decreased the incidence of bacterial infection of operated embryos (Holtfreter 1929). He found that when raised in particular salt conditions, amphibian embryos gastrulate abnormally, such that the mesoderm and endoderm egress from the embryo instead of internalizing and migrating underneath the prospective ectoderm (Holtfreter 1933). In these exogastrulae, the mesoderm never underlies the ectoderm, and the neural plate never forms. He also performed explant studies, in which he removed cells of the animal cap from the blastula, and cultured them in his solution. The caps quickly healed into round spheres, but only differentiated into “atypical ectoderm” (Fig. 7.6a) (Holtfreter 1938a, 1938b). This was surprising because, according to Vogt’s fate map, some of the cells he explanted would become neural tissue if left in its original location. The Organizer experiment, Holtfreter’s exogastrulae and the animal cap explants all showed that mesodermal tissue interacts with the ectoderm to generate the neural plate. This interaction was termed “induction” because it involved communication between the germ layers and was presumably mediated by the transfer of an unknown molecule. More broadly, these experiments, along with others, showed that germ layer identity is not fixed before gastrulation, and they confirmed Pander’s belief that interactions between the germ layers are essential for normal embryonic development.\n\nFig. 7.6 Experiments to find the mesoderm inducing signals in Xenopus. (a) Animal cap explants differentiate into atypical epidermis when cultured alone, but form mesoderm in combination with vegetal cells, or with mesoderm-inducing factors. (b) The Three Signal Model hypothesizes that there are three mesoderm-inducing activities in frogs: The first signal induces dorsal mesoderm (black arrow) in animal caps, the second signal induces ventral and ventrolateral mesoderm (yellow arrows) in animal caps, while the third signal dorsalizes ventral mesoderm in Ventral Marginal Zone (VMZ) explants (white arrows) (Dale and Slack 1987b) Full size image\n\nThe first indication that ectodermal cells could be induced to form mesodermal and endodermal tissue, came from experiments in which differentiated tissues from adult guinea pigs were implanted into newt gastrulae, or cultured in sandwiches between two ectodermal explants (Toivonen 1953; Takata and Yamada 1960; Saxen et al. 1964). Two important conclusions were drawn from these results. First, they showed that in the proper environment, presumptive ectoderm could be converted to the other germ layers. Secondly, they showed that some tissues produced instructive signals that could change the fate of ectoderm. This raised the possibility that such interactions occur during normal development to form the germ layers. Pieter Nieuwkoop (1917–1996) devised an experiment to identify the source of the endogenous mesoderm inducing signals. In a variation on Holtfreter’s explant experiments, he explanted animal caps and vegetal pieces from salamander embryos and grew them either separately or in combination (Nieuwkoop 1969). He found that neither the animal caps nor the vegetal pieces were able to form mesoderm when grown separately, but mesoderm was present when the vegetal pieces were grown in combination with the animal caps (Fig. 7.6a). In salamanders, mesodermal tissue was derived exclusively from cells in the pigmented animal cap ectoderm (Nieuwkoop 1969). Similar results were obtained in Xenopus laevis (Nakamura et al. 1970). These experiments identified the vegetal pole as the likely source of the endogenous mesoderm inducing signals, although Nakamura cautioned that “‘mesodermal induction’, meaning the conversion of presumptive ectoderm into mesoderm, is an abnormal phenomenon” which is only suggestive of the process that occurs in normal development (p. 318) (Nakamura et al. 1970).\n\n7.5.1.3 The Nieuwkoop Center\n\nA series of more spatially and temporally refined recombination experiments showed that the vegetal cells contained at least two types of inductive signals, and that these signals act before gastrulation. Dorsally located vegetal cells were able to induce ectodermal cells to become notochord, a dorsal mesodermal structure, with high frequency, but could only rarely induce ectoderm to form blood, which is derived from the ventral mesoderm. Ventral vegetal cells were able to induce ventral and intermediate mesodermal cell types easily, but could only rarely induce notochord (Dale et al. 1985; Dale and Slack 1987b). A series of heterochronic recombinants showed that vegetal pieces from young embryos could not act on gastrula-stage explants, but that gastrula stage vegetal pieces could act on younger ectoderm (Dale et al. 1985). This showed that the vegetal pieces continue to produce the mesoderm-inducing signal after gastrulation, but that the ectoderm loses the competence to respond to these signals. The dorsal mesoderm inducing activity was further localized to the dorsal-most vegetal cells of a 64-cell stage embryo, and its descendants (Gimlich and Gerhart 1984). When transplanted to the ventral side of a host, these cells could induce a full body axis, like the Organizer. Unlike the organizer, however, these cells did not contribute any cells to the axis itself and differentiated into gut endoderm. This region of the embryo was named the Nieuwkoop Center, in honor of the man who discovered the mesoderm-inducing capacity of cells in the vegetal pole (Gerhart et al. 1989). The Nieuwkoop center does not form in embryos treated with UV light during the first cell cycle, and all cells in resulting embryos adopt ventral fates (Gimlich and Gerhart 1984). Thus, the Nieuwkoop center is both necessary and sufficient to induce overlying cells in the embryo margin to become the Organizer .\n\n7.5.1.4 The Three-Signal Model\n\nA third inducing activity was uncovered by experiments that recombined the dorsal marginal zone (DMZ) with the ventral marginal zone (VMZ). In these experiments, the tissue was explanted after mesoderm had been specified, just before the onset of gastrulation. When explanted at this stage and grown in isolation, the VMZ generates ventral mesodermal cell types, such as blood and mesothelium, but does not produce notochord and generates only a little muscle. By contrast, when combined with the DMZ, cells from the VMZ differentiate into muscle at a high frequency and no longer produce blood or mesothelium (Slack and Forman 1980; Smith and Slack 1983; Dale and Slack 1987b). The DMZ is the site of the Organizer, and was already known to induce neural tissue from ectoderm. These experiments showed that the DMZ contains another activity that acts to “dorsalize” presumptive ventral mesoderm so that it produces a more dorsal mesodermal cell type than it would in isolation. These results suggested the Three Signal Model for mesoderm formation (Fig. 7.6b) (Dale and Slack 1987b). According to this view, a signal from the dorsal vegetal cells induces the overlying marginal cells to adopt dorsal mesodermal fates (Fig. 7.6b, black arrow), including the notochord, while a second signal from the ventral vegetal cells induces overlying cells to adopt ventral mesodermal fates, including blood and pronephros (Fig. 7.6b, yellow arrows). At a subsequent stage, signals from the DMZ dorsalize other marginal cells to adopt dorsolateral mesodermal cell fates, like muscle (Fig. 7.6b, white arrows). These experiments only tested the functional activity of the signals produced by vegetal cells and did not clarify the molecular nature of the signals. The three activities could be explained by one molecule acting in a gradient, with different effects at different concentrations, or by multiple molecules acting synergistically to induce different fates.\n\n7.5.2 Teleosts\n\n7.5.2.1 The Embryonic Shield\n\nIt quickly became apparent that embryonic induction was not restricted to amphibian embryos. Several lines of evidence indicated that the teleost embryonic shield is the functional equivalent of Spemann’s Organizer. Working in the yellow perch, Oppenheimer transplanted the embryonic shield from one embryo into ectopic locations in the blastoderm or yolk of a host embryo (Oppenheimer 1934a). She stained the host and graft with different color vital dyes, and found that the grafted shield self-differentiated into notochord and somites, and induced neighboring host cells to form a secondary neural axis, like Spemann and Mangold had observed in salamanders a decade earlier. Similar results were obtained in subsequent transplant experiments with shields from killifish (Fundulus heteroclitus), trout, zebrafish, and medaka embryos (Oppenheimer 1934b, 1936c; Luther 1935; Shih and Fraser 1996; Inohaya et al. 1999). Conversely, neural tissue failed to form when the prospective neural ectoderm of a trout embryo was extirpated and grafted onto the yolk, far from any inductive signals of the shield (Luther 1936). The shield is necessary and sufficient to induce neural tissue from naïve ectoderm and the shield fulfills Spemann’s definition of an organizer tissue.\n\nOppenheimer went one step further and showed that amphibian cells could respond to signals from the shield (Oppenheimer 1936b). She implanted the shield of a zebrafish embryo into the blastocoel of a newt embryo. In the resulting chimeras, the zebrafish tissue differentiated into a notochord and somites, as expected, and the amphibian host cells surrounding this graft formed ectopic neural tissue. This striking result showed that the inductive signals themselves were likely to be conserved between amphibians and teleosts.\n\n7.5.2.2 The YSL\n\nEarly experiments to determine the role of the yolk during teleost development yielded ambiguous results. The great geneticist Thomas Hunt Morgan (1866–1945) was the first person to perform a systematic experimental analysis of teleost development, working with wrasse, sea bass, and killifish embryos at the Marine Laboratory in Woods Hole, Massachusetts (Morgan 1893, 1895). He used a needle to poke a hole in the vegetal pole of the embryo, opposite the blastodisc, gently squeezed out the yolk, and permitted the sac to backfill with seawater. He concluded that, “The yolk may be removed from the egg of Fundulus at almost any stage of development and the embryo still forms.” (p. 809) (Morgan 1893). The caveat to this conclusion was that embryonic development ceased if he removed more than two-thirds of the yolk content. Morgan viewed the yolk as a passive structure, important only for the mechanics of embryonic cleavages and epiboly. Oppenheimer reinvestigated the role of the yolk in killifish, with a full understanding of embryonic induction (Oppenheimer 1936a). Her approach was to remove the entire blastoderm from the yolk at different stages and to grow them as isolates in culture. Blastoderms isolated after the 32-cell stage produced embryos with structures from all three germ layers, although they typically lacked posterior structures. Blastoderms isolated before this stage formed a hollow ball of epidermis reminiscent of the atypical ectoderm formed in Holtfreter’s animal cap explants. Oppenheimer concluded that the yolk syncytial layer (YSL), which she called the periblast, contains a substance that is transferred to the blastoderm at or before the 32-cell stage, and is necessary for formation of the mesoderm and endoderm. Similar results were obtained from cultures of isolated goldfish, trout, medaka and zebrafish blastoderms (Fig. 7.6a) (Tung et al. 1954; Devillers 1961; Hyodo et al. 1996; Sagerstrom et al. 1996; Xu et al. 2014b). These transplant experiments were often difficult to interpret, given differences in staging, and whether or not a bit of the YSL had been included in the blastoderm isolates. Conclusive proof that molecules produced in the yolk are essential for embryonic development came from experiments in which RNase was injected into the YSL of zebrafish embryos (Fig. 7.7a) (Chen and Kimelman 2000). This treatment had dramatic consequences, and the embryos died before gastrulation, failing to express the earliest markers for mesoderm and endoderm. Since zebrafish embryos lacking mesoderm and endoderm survive perfectly well for days, it is likely that the RNase treatment affected a number of different processes that are vital for survival past early embryonic stages .\n\nFig. 7.7 Experiments to find the mesoderm inducing signals in zebrafish. (a) Zebrafish animal cap explants differentiate into epidermis when cultured alone, but express mesodermal markers when cultured on a free yolk cell (Ober and Schulte-Merker 1999). In untreated embryos, cells near the margin express the pan-mesodermal marker, No-tail/Xbra. No-tail/Xbra expression is greatly reduced when RNase is injected into the YSL, and an ectopic no-tail/Xbra appears when an ectopic yolk cell is grafted on the animal pole of a host embryo. (b) Signals from the YSL induce mesoderm and endoderm (small black arrows), and signals from the dorsal YSL induce dorsal mesoderm and endoderm (large black arrow) Full size image\n\nA complementary set of experiments demonstrated that signals from the yolk can induce mesoderm and endoderm. In a series of heterochronic transplants, old blastoderms with visible shields were replaced with younger blastoderms, lacking shields. As development proceeded, the transplanted blastoderms always developed shields in the same location as the original blastoderm (Long 1983). In zebrafish, animal cap cells expressed markers of mesendoderm, including the shield, when they were directly exposed to the YSL in grafting experiments (Fig. 7.6a) (Mizuno et al. 1996; Ober and Schulte-Merker 1999; Rodaway et al. 1999). Because the yolk cell cannot be further physically subdivided, specific regional capabilities of the YSL have not been addressed by grafting experiments. Targeted knockdown of specific genes in the YSL, however, indicates that it expresses an essential ventralizing signal in addition to its ability to induce dorsal mesoderm (Fan et al. 2007; Sun et al. 2014). Thus in teleosts, the extraembryonic YSL performs the same functions during development that are fulfilled by the vegetal blastomeres in amphibians (Fig. 7.7b). The YSL fits all the criteria for Nieuwkoop Center. Signals from the YSL are both necessary and sufficient to induce the shield, and the YSL does not contribute to the embryonic axis, since it is an extraembryonic tissue .\n\n7.5.3 Amniotes\n\n7.5.3.1 The Node\n\nThe functional equivalent of Spemann's Organizer in amniotes is called the node. In 1875, Viktor Hensen (1835–1924) was studying the embryonic development of the rabbit when he noticed an epithelial thickening at the anterior end of the primitive streak in gastrulating embryo (Hensen 1876). Because of its appearance, he called this structure the node, although in some texts it is referred to as the primitive knot. This structure, now called Hensen’s node, was subsequently discovered in all gastrulating mammalian and avian embryos. Hensen observed that a bridge of invaginating mesoderm at the node connects the hypoblast to the epiblast. This unusual feature suggested to him that the node plays an important role in germ layer formation, but it would take nearly 60 years before experimental embryologists began to decipher its functions. After its discovery, biologists presumed the node was an embryonic growth zone (Leikola 1976). This changed when Vogt’s vital dye staining technique was used to trace the cell movements in the chicken epiblast (Wetzel 1925, 1929; Gräper 1929). These studies revealed that the cells of the epiblast migrate in an arc-like pattern toward the midline where they converge and invaginate in the streak and node. Later fate maps, using the more reliable lipophilic lineage tracers DiI and DiO, confirmed these observations (Hatada and Stern 1994). The node and primitive streak, therefore, are the sites where the germ layers form as the presumptive mesoderm and endoderm internalize. Rather than being a static structure, the node is composed of a highly dynamic cell population of endoderm and mesoderm precursors, equivalent to the teleost shield and the amphibian dorsal lip.\n\nEarly grafting experiments showed that the node and anterior primitive streak have the ability to self-differentiate when transplanted to the chorioallantoic membrane (Hunt 1931; Willier and Rawles 1931). Conrad H. Waddington (1905–1975) developed a technique for culturing chicken and duck blastoderms on a blood clot in a watch glass, with all the yolk removed (Waddington 1932). With this method, he could visualize development continuously for a period of days after various experimental manipulations. His first report describes 650 different operations. In one set of experiments, the epiblast was divided into pieces that were cultured separately. Only sections containing the node and anterior streak could produce embryonic organs such as the neural plate, notochord, heart and liver. This suggested that the node was essential for axis formation. Waddington next inserted pieces of the primitive streak underneath the epiblast of a cultured blastoderm. Anterior streak and node, but not the posterior streak, could induce the overlying epiblast to form a secondary body axis. Furthermore, nodal tissue from a duck could induce a secondary axis in a chicken epiblast, and vice versa (Waddington and Schmidt 1933). A limitation of these experiments is that they relied exclusively on morphological criteria to distinguish host tissue from graft because the vital dyes did not label tissue with sufficient intensity to be visible in sections, and because duck tissue was indistinguishable from chicken tissue under the microscope (Waddington 1932). Waddington was cautious in his conclusions, but his results were replicated much later using modern tissue labeling methods and quail-chick xenografts (Storey et al. 1992; Psychoyos and Stern 1996). These experiments show that the amniote node meets Spemann’s definition of an organizer tissue. The mouse node can also induce a secondary neural axis in grafting experiments, indicating that organizer activity is a property common to the node in all amniote embryos (Beddington 1994).\n\nA series of xenograft experiments showed that zebrafish and Xenopus blastulae respond to signals from the chicken and mouse nodes (Kintner and Dodd 1991; Blum et al. 1992; Hatta and Takahashi 1996). Similarly, the rabbit node can induce neural ectoderm in chicken embryo (Waddington 1937). The conserved activities of these tissues suggested that the signals themselves were likely to be conserved among all vertebrates. This was confirmed when Chordin and Noggin were identified as the endogenous, neural inducing, and dorsalizing signals expressed in the amphibian Organizer, teleost shield, and amniote node (Smith and Harland 1992; Sasai et al. 1994; Connolly et al. 1997; Fisher et al. 1997; Schulte-Merker et al. 1997; Streit et al. 1998; Furthauer et al. 1999; Bachiller et al. 2000).\n\n7.5.3.2 Koller’s Sickle/PMZ\n\nIt has been more challenging to identify the equivalent of the Nieuwkoop center in amniotes than in other phyla, mostly due to the more complicated anatomy of the blastoderm. Attention has focused on three extraembryonic tissues: the hypoblast, Koller’s sickle and the posterior marginal zone (PMZ). The location of the hypoblast underneath the epiblast is reminiscent of the location of the vegetal blastomeres under the marginal zone of amphibians. Waddington was the first to test the capacity of the hypoblast to induce mesoderm, working in chicken and duck embryos (Waddington 1932, 1937). He separated the hypoblast from the epiblast, rotated the it 90° or 180° along the anteroposterior axis, recombined the pieces and grew them in culture. In all cases, the primitive streak developed abnormally, and sometimes secondary primitive streak and body axis formed with its polarity coordinated with that of the rotated endoderm. Although this result was suggestive, the lack of adequate lineage-tracing techniques meant that Waddington could not definitively conclude that the formation of a new node and streak was due to an inductive event. More recent experiments used lineage labels to unambiguously demonstrate that the node is induced, but have variously identified Koller’s sickle, the PMZ, and the hypoblast as the inductive tissue (Azar and Eyal-Giladi 1979; Eyal-Giladi et al. 1992; Callebaut and Van Nueten 1994; Khaner 1998; Callebaut et al. 2003). For instance, a secondary body axis forms when a square piece of tissue from the PMZ including Koller’s sickle, is grafted orthogonally to the endogenous PMZ (Fig. 7.8a) (Khaner and Eyal-Giladi 1989; Eyal-Giladi et al. 1992). Subsequent experiments found that Koller’s sickle alone could not induce a primitive streak (Khaner 1998). Furthermore, detailed fate mapping showed that cells in Koller’s sickle contribute to the axial mesoderm (Bachvarova et al. 1998). These results eliminated the sickle from consideration as the Nieuwkoop Center. PMZ dissected from a chicken or duck embryo in the absence of Koller’s sickle can induce a primitive streak and body axis when grafted to an epiblast (Fig. 7.8a) (Bachvarova et al. 1998; Khaner 1998). Importantly, labeled cells in the graft did not contribute to the new body axis, indicating that the avian PMZ expresses signals that induce formation of the primitive streak near the marginal zone, which is comprised of future mesoderm and endodermal cells (Fig. 7.8b, large arrows). Similar grafting experiments have not been performed in mammals, but genetic studies in the mouse demonstrated that signals from the extraembryonic visceral endoderm (VE) are required to induce the node and primitive streak (Varlet et al. 1997). Thus, the avian PMZ and the mammalian VE are functionally equivalent and meet the criteria of the Nieuwkoop center. As the primitive streak extends and the node migrates toward the anterior, signals from the posterior streak induce surrounding epiblast cells to form lateral mesoderm (Fig. 7.8b, small arrows). Cells only become committed to these fates, however, after they invaginate through the primitive streak (Kimura et al. 2006). The node gains the ability to induce neural tissue when the streak has reached its full extension (Fig. 7.8b, white arrows) (Storey et al. 1992).\n\nFig. 7.8 Experiments to find the mesoderm inducing signals in chicken. (a) The PMZ can induce an ectopic primitive streak and Hensen’s Node when grafted at a 90° angle with respect to the original axis. The PMZ from a quail embryo can induce a primitive streak to form when grafted to the anterior portion of a chicken epiblast. (b) Signals from the PMZ induce formation of the primitive streak in the posterior area pellucida (top embryo, black arrows). At a later stage, the primitive streak and Hensen’s Node express signals that induce mesoderm and endoderm, and signals from Hensen’s Node pattern the neural tissue (white arrows) Full size image\n\n7.5.4 Conclusion\n\nThe discovery of the germ layers by Pander and von Baer raised the question of how the three layers cooperate to ensure the proper placement of organs relative to each other and with respect to the body axis. Some mechanism must act to guarantee that the foregut, for instance, always forms in the head rather than in some other location. The extent of communication between the germ layers only became apparent in the early twentieth century, when experimental embryologists began dissecting embryos and transplanting tissues to different locations, or developing them in culture. Comparisons of the effects of these manipulations to the normal fate maps demonstrated that cell fates depend on their environmental context. Spemann and Mangold found that in tissue transplants, the dorsal lip of the blastopore self-differentiates as axial mesoderm and induces the overlying ectoderm to form neural tissue. Because of these properties, they named this tissue the Organizer. Subsequently, tissues with Organizer properties were discovered at the onset of gastrulation in all vertebrate embryos. The fact that Organizer tissues function across phyla boundaries indicated that a common mechanism acts in all vertebrates to induce neural tissue, despite the obvious morphological differences between the embryos at these stages. The discovery that Chordin and Noggin are expressed in the amphibian Organizer, the teleost shield and the amniote node and streak confirmed this prediction and transformed our understanding of how the vertebrate body plan is constructed. Chordin and Noggin are both secreted antagonists of the Bone Morphogenetic Proteins (BMP), a subclass of the TGF-β superfamily that ventralizes the embryo (Piccolo et al. 1996; Zimmerman et al. 1996). Thus, instead of providing a signal that induces dorsal fates, signals from the organizer the act to block ventralizing signals.\n\nExperimental embryologists also identified the tissues that induce the Organizer, called the Nieuwkoop Center, as discussed above. In amphibians, the Nieuwkoop Center is located in the dorsal vegetal blastomeres, which are fated to become gut endoderm, and other vegetal cells induce ventral mesodermal cell types. In teleosts and amniotes, the Nieuwkoop Center is located in extraembryonic tissues, including the YSL, PMZ and the mammalian VE. Signals from these tissues induce all mesodermal and endodermal cell types in the overlying blastoderm, including the shield and node. The combined action of the Nieuwkoop Center and the Organizer explains how development of the germ layers is coordinated. Therefore, the reason the foregut always forms in the head is because prior to gastrulation, precursors of the foregut induce organizer tissue, which induces and patterns the brain and head. In teleosts and amniotes, the foregut precursors and the organizer tissues are both induced by signals emanating from extraembryonic tissues, but the result is the same: coordinated development of organs within the three germ layers."}, {"url": "https://organismalbio.biosci.gatech.edu/growth-and-reproduction/animal-development-ii/", "page_content": "Learning Objectives\n\nExplain the significance, features, and consequences of gastrulation and organogenesis in early animal development List and describe adult tissue types in animals, and identify major organs arising from each embryonic germ layer Recognize the roles and relationships of the four extra-embryonic membranes in amniotes (birds, reptiles, and mammals) Describe the roles of induction (cell-cell signaling) and regulation of gene expression in cell specialization and morphogenesis, using the notochord, the neural tube, and somites as examples Explain the relationship between Hox genes and segment identity in animals\n\nStages in early animal development\n\nAs we’ve already described, there are four general stages in early animal development:\n\nFertilization: the process of a single sperm cell combining with single egg cell to form a zygote.\n\nthe process of a single sperm cell combining with single egg cell to form a zygote. Cleavage: rapid, multiple rounds of mitotic cell division where the overall size of the embryo does not increase. The developing embryos is called a blastula following completion of cleavage.\n\nrapid, multiple rounds of where the overall size of the embryo does not increase. The developing embryos is called a following completion of cleavage. Gastrulation: the dramatic rearrangement (movement) of cells in the blastula to create the embryonic tissue layers. These tissue layers will go on to produce the tissues and organs of the adult animal.\n\nthe dramatic rearrangement (movement) of cells in the blastula to create the embryonic tissue layers. These tissue layers will go on to produce the tissues and organs of the adult animal. Organogenesis: the process of organ and issue formation via cell division and differentiation.\n\nGastrulation and organogenesis together contribute to morphogenesis: the biological processes that results in an organism’s shape and body organization.\n\nIn this reading, we will discuss the last two steps above, gastrulation and organogenesis.\n\nThe information below was adapted from OpenStax Biology 43.6\n\nDevelopment Step 3: Gastrulation\n\nAt the end of cleavage, the typical blastula is a ball of cells with a hollow cavity in the middle (the blastocoel). The next stage in embryonic development is gastrulation, in which the cells in the blastula rearrange themselves to form three layers of cells and form the body plan. The embryo during this stage is called a gastrula. Gastrulation results in three important outcomes:\n\nThe formation of the embryonic tissues, called germ layers. The germ layers include the endoderm, ectoderm, and mesoderm. Each germ layer will later differentiate into different tissues and organ systems. The formation of the embryonic gut, the archenteron. The appearance of the major body axes. Recall that in some species, the information specifying the body axes was already present during cleavage as a result of cytoplasmic determinants and/or yolk polarity, but the axes actually become visible as a result of gastrulation.\n\nThe specific details of gastrulation are different in different animal species, but the general process includes dramatic movement of cells across and inside the embryo. In triploblasts (animals with three embryonic germ layers), one group of cells moves into the blastocoel, the interior of the embryo, through an invagination called the blastopore. These interior cells form the endoderm. Another group of cells move to completely surround the embryo, forming the ectoderm, and a third group of cells move into the locations in between the outer and inner layers of cells, to form the mesoderm. The endodermal cells continue through the interior of the embryo until they reach the other side, creating a continuous tract through the embryo; this tract is the archenteron, or embryonic gut. In protostomes, the blastopore becomes the embryo’s mouth; in deuterostomes, the blastopore becomes the embryo’s anus.\n\nDiploplasts (animals with only two germ layers) do not have mesodermal cells. These animals, which include jellyfish and comb jellies, have radial rather than bilateral symmetry and have far fewer tissue types than triploplasts due the lack of a mesoderm.\n\nThe three germs layers, shown below, are the endoderm, the ectoderm, and the mesoderm. The ectoderm gives rise to the nervous system and the epidermis. The mesoderm gives rise to the muscle cells and connective tissue in the body. The endoderm gives rise to columnar cells found in the digestive system and many internal organs.\n\nThis video provides an engaging overview of animal development, with a focus on gastrulation (and the fact that we’re all, like, tubes). Focus on the first 7:40 minutes:\n\nAnd this video describes the different tissues and organs that arise from the different germ layers during human development:\n\nTissues in Adult Animals The information below adapted from Khan Academy “Principles of Physiology”. All Khan Academy content is available for free at www.khanacademy.org The cells in complex multicellular organisms are organized into tissues, groups of similar cells that work together on a specific task. Organs are structures made up of two or more tissues organized to carry out a particular function, and groups of organs with related functions make up the different organ systems. The result of gastrulation is the formation of the three embryonic tissue layers, or germ layers. Over the course of development, these cells will proliferate, migrate, and differentiate into the four primary adult tissues: epithelial tissue, connective tissue, muscle tissue, and nervous tissue. Every organ is made up of two or more of these tissues. Epithelial tissue consists of tightly packed sheets of cells that cover surfaces (such as the outside of the body) and line body cavities. For instance, the outer layer of your skin is an epithelial tissue, and so is the lining of your small intestine. The tight packing of epithelial cells lets them act as barriers to the movement of fluids and potentially harmful microbes. Epithelial cells are also polarized, meaning that they have a top and a bottom side. The apical, top, side of an epithelial cell faces the inside of a cavity or the outside of a structure and is usually exposed to fluid or air. The basal, bottom, side faces the underlying cells. For instance, the apical sides of intestinal cells have finger-like structures that increase surface area for absorbing nutrients. Connective tissue consists of cells suspended in an extracellular matrix. In most cases, the matrix is made up of protein fibers like collagen and fibrin in a solid, liquid, or jellylike ground substance. Connective tissue supports and connects other tissues. Loose connective tissue, show below, is the most common type of connective tissue. It’s found throughout your body, and it supports organs and blood vessels and links epithelial tissues to the muscles underneath. Dense, or fibrous, connective tissue is found in tendons and ligaments, which connect muscles to bones and bones to each other, respectively. Specialized forms of connective tissue include adipose tissue (body fat), bone, cartilage, and blood, in which the extracellular matrix is a liquid called plasma. Muscle tissue is essential for keeping the body upright, allowing it to move, and even pumping blood and pushing food through the digestive tract. Muscle cells, also called muscle fibers, contain the proteins actin and myosin, which allow them to contract. There are three main types of muscle: skeletal muscle, cardiac muscle, and smooth muscle. Skeletal muscle is what we refer to as muscle in everyday life. Skeletal muscle is attached to bones by tendons, and it allows you to consciously control your movements.\n\nCardiac muscle is found only in the walls of the heart. It’s not under voluntary control, so (thankfully!) you don’t need to think about making your heart beat.\n\nSmooth muscle is found in the walls of blood vessels, as well as in the walls of the digestive tract, the uterus, the urinary bladder, and various other internal structures. Smooth muscle is involuntary, not under conscious control. That means you don’t have to think about moving food through your digestive tract. Nervous tissue is involved in sensing stimuli (external or internal cues) and processing and transmitting information. It consists of two main types of cells: neurons and glia. The neurons are the basic functional unit of the nervous system: they generate electrical signals called action potentials that allow the neurons to convey information very rapidly across long distances. The glia mainly act to support neuronal function. The video below walks through comparative animal anatomy and describes the four types of animal tissue: The Four Extra-Embryonic Tissues in Amniotes The information below was adapted from OpenStax Biology 29.4 The terrestrially-adapted amniotic egg is the defining characteristic of amniotes (reptiles, birds, and mammals). The evolution of amniotic membranes meant that the embryos of amniotes had their own aquatic environment built into their eggs, which led to less dependence on water for development and thus allowed the amniotes to branch out into drier environments. This was a significant development that distinguished them from amphibians, which were restricted to moist environments due their shell-less eggs. In amniotes that lay eggs (birds and most reptiles), the shell of the egg provides protection for the developing embryo while being permeable enough to allow for the exchange of carbon dioxide and oxygen. The albumin, or egg white, provides the embryo with water and protein, whereas the fattier egg yolk is the energy supply for the embryo (as is the case with the eggs of many other animals, such as amphibians). The eggs of amniotes also contain four additional extra-embryonic tissues: the chorion, amnion, allantois, and yolk sac, shown below. Extra-embryonic membranes are membranes present in amniotic eggs that are derived from the embryo, but are not actually part of the body of the developing embryo (thus “extra”-embryonic). What do these extra-embryonic tissues do? The amnion , or inner amniotic membrane, surrounds the embryo itself, enclosing the aqueous environment that the embryo develops in to protect the embryo from mechanical shock and support hydration\n\n, or inner amniotic membrane, surrounds the embryo itself, enclosing the aqueous environment that the embryo develops in to protect the embryo from mechanical shock and support hydration The chorion. which surrounds the embryo and yolk sac, facilitates exchange of oxygen and carbon dioxide between the embryo and the egg’s external environment.\n\nwhich surrounds the embryo and yolk sac, facilitates exchange of oxygen and carbon dioxide between the embryo and the egg’s external environment. The allantois stores nitrogenous wastes produced by the embryo and also facilitates respiration in combination with the chorion .\n\nstores nitrogenous wastes produced by the embryo and also facilitates respiration in combination with the chorion The yolk sac encloses the nutrient-rich yolk and transports nutrients from the yolk to the embryo (note the yolk sac is not the yolk itself, but is the membrane that surrounds the yolk) Most mammals do not lay eggs (though some do!), but they still have amniotic tissues that function as part of the placenta and umbilical cord, as shown below. In essence, pregnancy in placental mammals is the result of internalization and incorporation of the amniotic egg into the uterus, resulting in direct nourishment embryo inside of the amniotic egg rather than laying it outside of the body with a predefined amount of yolk. As you can see above, the chorion separates the fetal and maternal sides of the placenta, and the aminon surrounds the developing fetus. Just as in the amniotic egg: the chorion regulates gas exchange\n\nregulates gas exchange the amnion encloses the fluid-filled cavity to provide an aqueous environment for the developing fetus\n\nencloses the fluid-filled cavity to provide an aqueous environment for the developing fetus together, the yolk sac , consisting of blood vessels that transport nutrients to the embryo, and\n\n, consisting of blood vessels that transport nutrients to the embryo, and the allantois, which functions in waste disposal, both function as part of the mammalian umbilical cord (not labeled above) Development Step 4: Organogenesis The information below was adapted from OpenStax Biology 43.7 Gastrulation leads to the formation of the three germ layers that give rise, during further development, to the different organs in the animal body. This process is called organogenesis. In vertebrates, one of the primary steps during organogenesis is the formation of the nervous system. Interestingly, the nervous system originates from ectodermal, not mesodermal tissue. During the formation of the neural system, induction causes some cells at the edge of the ectoderm to become epidermis cells. The remaining cells in the center form the neural plate, which will go on to form the nervous system.\n\nImmediately beneath the neural plate is a rod-shaped mesodermal structure called the notochord. The notochord signals the neural plate cells to fold over to form a tube called the neural tube, as illustrated below. During later development, the notochord will disappear (it goes on to help form the spongy discs between the vertebrae), and the neural tube will give rise to the brain and the spinal cord.\n\nThis video describes signaling from the notochord that results in neural tube formation:\n\nThe mesoderm that lies on either side of the vertebrate neural tube forms a set of temporary structures called somites (also called “primitive segments”), shown below. Later in development the cells within the somites will migrate to different parts of the body to develop into bone, skeletal muscle, and connective tissue of the skin. The specific pattern of induction from nearby tissues, including the ectoderm, the neural tube, the notochord, and surrounding mesoderm, will determine what type of tissue a particular region of a somite will become.\n\nHox Genes, Differential Gene Expression, and Segment Identity\n\n\n\nOrganogenesis (and development in general!) is characterized by changes in which specific genes are expressed in different cells. This differential gene expression, or turning on and turning off different genes, is what determines a specific cell’s form and function. It is also the and is the process underlying differentiation (for more on this topic, see the Gene Regulation page on the Bio1510 website). For example, during differentiation, some cells in the ectoderm will express the genes specific to skin cells. As a result, these cells will differentiate into epidermal cells. Other ectoderm cells will move into the interior of the embryo to form the central nervous system, and will express genes specific to the nervous system. The process of differentiation is largely regulated by induction, or cell-cell communication during development. How do induction and differential gene regulation work together to induce development of specific organs and body structure?\n\nThe information below was adapted from OpenStax Biology 27.1 and Khan Academy “Homeotic Genes.” All Khan Academy content is available for free at www.khanacademy.org\n\nChanges in gene regulation during development are carefully regulated in both time and space. As we previously discussed, the eggs of protostomes and some deuterostomes contain cytoplasmic determinants, which cause cells of the developing embryo to have different identities as early as the first cell division (during cleavage). Cytoplasmic determinants are often regulatory genes that direct the expression of other genes, thus initiating a developmental “cascade” of changes in gene expression that ultimately lead to proper development of the animal. Each regulatory gene activates a new set of regulatory genes in the next set of cell divisions as the embryo progresses through development, as shown below.\n\nA key set of genes involved in differential gene expression and morphogenesis in animals are the homeobox or Hox genes. This family of genes is responsible for determining the general body plan, such as the number of body segments of an animal, the number and placement of appendages, and animal head-tail directionality. All animal phyla except sponges have a set of Hox genes. Each body segment is “specified” by a specific combination of Hox genes. In other words, Hox genes determine “segment identity,” or where along the body different body parts develop:\n\nA single Hox mutation in the fruit fly can result in an extra pair of wings or even appendages growing from the wrong body part, as shown below.\n\nWhile there are a great many genes that play roles in the morphological development of an animal, what makes Hox genes so powerful is that they serve as master control genes that can turn on or off large numbers of other genes. Hox genes do this by coding transcription factors that control the expression of numerous other genes. Hox genes are homologous in the animal kingdom, that is, the genetic sequences of Hox genes and their positions on chromosomes are remarkably similar across most animals because of their presence in a common ancestor, from worms to flies, mice, and humans (Figure). Hox genes have undergone at least two duplication events during animal evolution, with the additional genes allowing for more complex body types to evolve.\n\nIf a Hox 13 gene in a mouse was replaced with a Hox 1 gene, how might this alter animal development?\n\nThis video describes developmental regulatory genes in general and focuses on the importance of Hox genes in particular:"}]}