{"Arthur William Tedder was heavily involved in the planning of the Battle of Britain.": [{"url": "https://www.britannica.com/biography/Arthur-William-Tedder-1st-Baron-Tedder-of-Glenguin", "page_content": "Arthur William Tedder, 1st Baron Tedder, (born July 11, 1890, Glenguin, Stirling, Scotland—died June 3, 1967, Banstead, Surrey, England), marshal of the Royal Air Force and deputy commander of the Allied Expeditionary Force under U.S. General Dwight D. Eisenhower who contributed significantly to the success of the Allied invasion of Normandy (June 6, 1944) and the German defeat on the Western Front during World War II.\n\nTedder joined the British Army in 1913 and transferred to the Royal Flying Corps in 1916. Remaining in the Royal Air Force (RAF) after World War I, he became RAF commander of the Far East Command (1936–38) and thereafter director of research and development. Appointed head of the RAF Middle East Command in 1941, he later took control of all Allied air operations in North Africa and Italy. He was knighted in 1942. Tedder contributed to the German defeat in North Africa and the success of Allied landings in Sicily and Italy (1943) by cooperating with other Allied forces, interdicting enemy supply lines, and giving tactical support to Allied ground troops.\n\nBritannica Quiz Pop Quiz: 17 Things to Know About World War II\n\nAppointed Eisenhower’s deputy in early 1944 and responsible for coordinating all Allied air operations in western Europe, Tedder repeated his earlier successes by sealing off the Normandy beaches from the air and keeping German reinforcements from reaching the Allied beachhead. His bombing of the German transportation network significantly sped the Allied advance during the final months of World War II. He was elevated to the peerage in 1946 as 1st Baron Tedder of Glenguin, and he became the first peacetime chief of the air staff and senior member of the air council, serving until 1951. He wrote With Prejudice (1966), his account of World War II."}, {"url": "https://kids.britannica.com/students/article/Arthur-William-Tedder-1st-Baron-Tedder/338122", "page_content": "Walter Bird—Camera Press/Globe Photos\n\n(1890–1967). During World War II Arthur William Tedder served as marshal of the British Royal Air Force and as deputy commander of the Allied forces under U.S. General Dwight D. Eisenhower. He played a key role in the success of the D-Day invasion of Normandy and the German defeat on the Western Front.\n\nTedder was born on July 11, 1890, in Glenguin, Stirling, Scotland. He joined the British Army in 1913 and transferred to the Royal Flying Corps in 1916. Remaining in the Royal Air Force (RAF) after World War I, he became RAF commander of the Far East Command (1936–38) and thereafter director of research and development. In 1941, during World War II, he was appointed head of the RAF Middle East Command. Later he took control of all Allied air operations in North Africa and Italy. Tedder contributed to the German defeat in North Africa and the success of Allied landings in Sicily and Italy (1943) by cooperating with other Allied forces, disrupting enemy supply lines, and giving tactical support to Allied ground troops.\n\nIn early 1944 Tedder was appointed U.S. General Eisenhower’s deputy commander and took responsibility for coordinating all Allied air operations in western Europe. He sealed off the Normandy beaches from the air and kept German reinforcements from reaching the Allied beachhead. His bombing of the Germans’ transportation network sped the Allied advance during the final months of the war.\n\nAfter the war Tedder became Britain’s first peacetime chief of the air staff, a post he held until 1951. Tedder was knighted in 1942. In 1946 he was elevated to the peerage as 1st Baron Tedder of Glenguin. From 1950 to 1967 he served as chancellor of the University of Cambridge, in England. Tedder died on June 3, 1967, in Banstead, Surrey, England."}, {"url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/arthur-tedder", "page_content": "Arthur Tedder\n\nArthur William Tedder (1890-1967) may have been born into the elite of English society, but his was not a pampered life. He served his country as a hero, seeing action in two world wars and accepting the full responsibility of command over Allied air forces during World War II.\n\nArthur Tedder was born on July 11, 1890 in the Scottish town of Glenguin. He began his military career in 1913 when he joined the British Army. In 1916, he transferred to the Royal Air Force (RAF), serving during World War I in France from 1915 until 1917 and Egypt from 1918 to 1919. He received his permanent commission in the RAF in 1919 and remained there after the war, serving as a director of training from 1934 to 1936. In 1936, Tedder was promoted to RAF commander in the Far East where he remained until 1938, when he became director general of research in the Air Ministry.\n\nThe Middle East\n\nTedder's early experience with the RAF would prove invaluable during the war years. In his role as commander in the Far East, he would amass even more knowledge of military strategy. One of his first opportunities to apply his strong planning skills came in May 1941, when Tedder participated in the British evacuation of Crete. As German strength grew in the Middle East, British troops were forced back toward Canea and an evacuation of Crete was ordered. While the Royal Air Force at Egypt, under Tedder's command, promised fighter cover for the ships evacuating British ground troops, support was limited by the fact that few aircraft at his disposal had the necessary range to fly from Egypt to Crete. The operation suffered many casualties.\n\nIn November 1941, Tedder participated in Operation \"Crusader,\" in Africa. The plans for attack on Tobruk were scheduled for November 23, 1941. On the 19th, Tedder reported to Prime Minister Winston Churchill that the initial air battle of November 18th had gone satisfactorily, although bad weather had adversely affected plans for neutralizing the enemy. He assured Churchill that the weather had also limited German action against the Allies during the first two days of the battle.\n\nIn the spring of 1942, when Germany's General Erwin Rommel launched an attack of Gazala west of Tobruk. Tedder communicated to Churchill that he had foreseen the attack and was ready for it. Rommel's attack on Tobruk failed and his troops were pummeled by Tedder's air forces. Unfortunately, the victory was short-lived, as Rommel turned the tide of battle from defeat to victory. With the loss of the tank battle, an immediate withdrawal of the 1st South African and 50th Division was ordered. The success of that withdrawal was due, in large measure, to the protection of Allied troops by the RAF.\n\nIn the summer of 1942, Churchill commended Tedder for his successful direction of the RAF. During August Tedder accompanied Churchill to Moscow where they met with Russian leader, Josef Stalin. Churchill proposed placing British and U.S. air troops at Russia's southern flank as a means of strengthening Russian air power and showing air superiority. Tedder's proposed plan received approval from Churchill with a recommendation that a similar proposal be drafted for presentation to U.S. President Franklin D. Roosevelt.\n\nThe Battle of El Alamein\n\nIn October 1942, the battle against Rommel's forces for El Alamein [in North Africa] was launched. In contrast to battles fought earlier that same year, the British had the advantage of far superior forces. On the ground, Sherman tanks arrived from the United States, outnumbering the equipment of the enemy. In the air, Tedder, now air commander-in-chief in the Middle East, had air squadrons that included U.S., South African, Rhodesian, Australian, Greek, French, and Yugoslav forces assisting the RAF. The planes at his disposal numbered over 1,500, with 1,200 of those based in Egypt and Palestine in support of a ground attack on Alamein. By comparison, German and Italian serviceable aircraft numbered only 350.\n\nTedder applied this superior air capability to harassing the Panzerarmee supply flow, while also protecting the supplies of the Eighth Army. Working closely with the Royal Navy, he extended the harassment of the Panzerarmee's sea-artery supply and aided in the sinking of German supply ships. By September 1942, a third of Germany's supplies had failed to cross the Mediterranean, either sunk or returned to their source. The following month more than half of Germany's supplies failed to arrive. In a memo from Churchill to Tedder, the prime minister commended the commander for his leadership.\n\nThe Casablanca Conference\n\nDuring the Casablanca Conference at the beginning of 1943, Roosevelt and Churchill's combined chiefs of staff agreed that taking Tunis should be the next point of focus. It was at this conference that leadership of the Allied forces was conferred upon General Dwight D. Eisenhower. Naval command was placed under Admiral Cunningham and Tedder was named air marshal. Tedder assumed command of the front in February 1943, with the Battle of Tunisia at its height. Roosevelt suggested that it would be strategically advantageous for the Allies to stress these appointments and ensure that the leader's plans and duties be filtered to the enemy. Churchill agreed, but expressed concern that no favoritism be shown toward Eisenhower at the expense of commanders Alexander and Tedder, lest the general public be discouraged.\n\nThe Italian Campaign\n\nIn May 1943, Tedder, Alexander, and Cunningham met and voiced agreement with Churchill and Brooke that Italy should be invaded. To convince Eisenhower, they met with Eisenhower, Marshall, and Bedell Smith to discuss the proposed taking of the island of Pantilleria as the southern assault on Sicily to begin this campaign.\n\nBy the summer Tedder's command had solidified in preparation for the invasion of Sicily. His forces included those of General Spaatz, U.S. Army Air Force; and Air Marshal Coningham. With a driving need to take ports and airfields early in the attack, Tedder argued to narrow the attack and seize the southeastern group of airfields. This was successfully employed through the use of amphibious load carriers.\n\nAs 1943 came to a close, Churchill proposed to Roosevelt a remodeling of leadership after discussion with Eisenhower, Alexander, and Tedder. For Operation \"Overlord\"-also known as \"D-Day\"-Churchill recommended Tedder as Eisenhower's deputy supreme commander because of the role planned for the air forces. Roosevelt gladly accepted this recommendation. As plans for D-Day began to solidify, Tedder's role became even more vital. Recent experiences had proven that success could best be achieved through a cooperative effort of all the military forces.\n\nD-Day Approached\n\nThe next step was implementing the \"Transportation Plan.\" This operation was designed to use bombers to paralyze the French railway on the eve of Overlord. Eisenhower had worked closely with Tedder in the Mediterranean and he liked and admired the man enormously. Despite some opposition to the plan, he named Tedder to personally supervise the campaign. Tedder identified over 70 railroad targets in France and Belgium, intentionally directing traffic away from lower Normandy in order to maintain secrecy about the invasion site. Although opposition remained strong, Eisenhower was convinced that the Transportation Plan was necessary to the success of Overlord. The success of these attacks, in turn, convinced Tedder that they should be continued into Germany, where the collapse of the German rail system would result in the collapse of its economy.\n\nWith only hours left before the final decision had to be made on whether to begin Operation Overlord, bad weather raged across the English Channel and Eisenhower solicited his subordinates for their opinions. Tedder recommended postponement, concerned that poor visibility would have a devastating affect on the ability of his bombers to provide the cover needed. The decision, however, was to move ahead on June 6.\n\nHistorians generally agree that under the direction of Tedder, the Allied air forces commanded the skies. Their paralyzing effect on the enemy was a decisive factor in getting the Allied troops to shore on June 6. By destroying bridges over the Seine and Loire rivers, they effectively isolated Normandy, forcing the Germans into long detours and endless delays.\n\nThe Aftermath\n\nIn the immediate aftermath of Overlord, additional operations were planned to keep the enemy off balance. One of these, which Montgomery had characterized as a major \"break-out,\" resulted in the Allies' failure to take advantage of heavy enemy casualties. In an attempt to break through enemy lines and open the way to Paris, Eisenhower pushed Montgomery to take action and was assured that a \"big show\" would occur on July 9. Montgomery asked for and got air support from Tedder. However, Montgomery's attack failed and he called it off, angering both Eisenhower and Tedder. Two days later, Montgomery again promised an offensive he named Operation \"Goodwood.\" Tedder arranged for a sensational show of support, bringing together 1,600 British and U.S. heavy bombers and 400 medium bombers, dropping a total of 7,800 tons of bombs on German defenses; 2,500 tons sited for the German fortifications at Caen; and 650 tons for Cagny. Tedder carefully coordinated the air attack with ground attacks in order to avoid any lulls that could give the enemy an opportunity to regroup.\n\nThe saturation bombing started the offensive, but it quickly failed. After sustaining heavy losses, Montgomery called it off. Tedder was furious at this second failure and demanded that Montgomery be fired, which did not come to pass.\n\nThe Tide Turns\n\nThroughout the last year of the war, the Allies achieved air superiority and the success of D-Day turned the tide of the war in Europe. In January 1945, Eisenhower sent Tedder to Moscow to seek assistance from the Russians, as a way of relieving pressure on Allied forces in the west. By May a total and unconditional surrender occurred with formal ratification by the German High Command in Berlin. Tedder signed on behalf of Eisenhower, Marshal Zhukov signed for Russia, and Field-Marshal Keitel signed for Germany.\n\nPeacetime Honors\n\nIn 1942, Tedder had been knighted. At the war's end, in 1946, he was elevated to the peerage and named a baron. Tedder served as Great Britain's first peacetime chief of air staff and as a senior member of the Air Council from 1946 until 1950. In 1950, he became chancellor of Cambridge University. Tedder published his memoirs, With Prejudice: The War Memoirs of Marshal of the Royal Air Force, Lord Tedder. in 1966.\n\nTedder was married to Rosalinde Maclary, who died in 1943. At Rosalinde's request Tedder married again, to his young service driver, \"Toppy\" Seton. In his last years he became severely crippled with Parkinson's disease and died at Well Farm in Banstead, Surrey, England, on June 3, 1967.\n\nFurther Reading\n\nAmbrose, Stephen E., Citizen Soldiers, Simon & Schuster, 1997.\n\nAmbrose, Stephen E., June 6, 1944, D-Day: The Climactic Battle of World War II, Simon & Schuster, 1994.\n\nBlumenson, Martin, Liberation, Time-Life Books, 1978.\n\nChurchill, Winston S., The Grand Alliance, Houghton, 1950.\n\nChurchill, Winston S., Hinge of Fate, Houghton, 1950.\n\nChurchill, Winston S., Closing the Ring, Houghton, 1950.\n\nChurchill, Winston S., Triumph and Tragedy, Houghton, 1950.\n\nKeegan, John, Six Armies in Normandy, Viking Press, 1982.\n\nLiddell Hart, B. H., History of the Second World War, Putnam's, 1971.\n\nWhipple, A. B. C., The Mediterranean, Time-Life Books, 1981.\n\nIndependent, February 24, 1994. □"}, {"url": "https://www.nrscotland.gov.uk/research/learning/hall-of-fame/hall-of-fame-a-z/tedder-sir-arthur", "page_content": "Air Force Officer\n\nArthur Tedder was a pilot and squadron commander in the Royal Flying Corps during the First World War. He went on to serve as a senior officer in the Royal Air Force in Turkey and the Far East and as Director General of Research and Development at the Air Ministry. During the Second World War he directed operations in the Mediterranean and North Africa and played a major role in planning the Allied invasion of Italy. He was appointed Deputy Supreme Commander of the Allied Expeditionary Force under General Eisenhower for Operation Overlord. The Imperial War Museum's 'A Who's Who of D-Day' page includes a summary of his contribution. After the war, he served as Chief of the Air Staff and implemented arrangements for the Berlin Airlift in 1948. He also held senior positions in business and academia. He received many honours and was raised to the peerage in 1946. Arthur William, first baron Tedder of Glenguin was widowed twice and died on 3 June 1967 at his home in Surrey.\n\nBirth in 1890\n\nArthur William Tedder was born at 2:30 pm on 11 July 1890, the son of Arthur John Tedder, Inland Revenue Officer and Emily Charlotte Bryson. The entry in the statutory register of births for the parish of Killearn in the county of Stirling gives his place of birth as Glenguin, Killearn. Glenguin is now Glengoyne.\n\nBirth entry for Arthur Tedder (47 KB jpeg)\n\nNational Records of Scotland, 1890/482/15\n\n1891 Census\n\nIn 1891, Arthur W Tedder, aged 8 months, was enumerated at 254 Morrison Street in Edinburgh. The census return for the district of St George shows the household included his father, Arthur J Tedder, Civil Servant, Inland Revenue Officer, 1st class, aged 39, mother Emily C, aged 36, brother Henry J, aged 11 and sister Mary E, aged 8 long with Jane Dick, their domestic servant aged 24.\n\n1891 Census record for Arthur Tedder (40 KB jpeg)\n\nNational Records of Scotland 1891/685-1/55, page 15\n\n1895 Valuation Roll\n\nIn 1895 the family were in Shetland. The valuation roll for the parish of Lerwick in the county of Zetland shows his father, Arthur John Tedder, Sup[erintendant] of Inland Revenue, was the tenant and occupier of a house and garden at Braeside Law Lane. The proprietor was Jeremiah Dodsworth, Collector of HM Customs, 35 Castle Square, Carnarvon (Caernarfon).\n\n1895 valuation roll for Arthur Tedder (19 KB jpeg)\n\nNational Records of Scotland VR118/27, page 182\n\n1901 Census\n\nIn 1901, Arthur W Tedder, scholar, aged 10, was enumerated at Friars House, Institution Street, Elgin with his father Arthur J Tedder, Inland Revenue Collector, his mother and sister Margaret E, aged 18 and two servants.\n\n1901 Census record for the parish of Elgin (34 KB jpeg)\n\nNational Records of Scotland, 1901/135/10, page 16"}, {"url": "https://www.geni.com/people/Air-Chief-Marshal-Sir-Arthur-William-Tedder-1st-Baron-Tedder-GCB/6000000012914653634", "page_content": "About Air Chief Marshal Sir Arthur William Tedder, 1st Baron Tedder, GCB\n\nhttp://en.wikipedia.org/wiki/Arthur_Tedder,_1st_Baron_Tedder\n\nMarshal of the Royal Air Force Arthur William Tedder, 1st Baron Tedder, GCB (11 July 1890 – 3 June 1967) was a senior British air force commander. During World War I, he was a pilot and squadron commander in the Royal Flying Corps and he went on to serve as a senior officer in the Royal Air Force during the inter-war years. He held high command during World War II and after the War he served as Chief of the Air Staff before retiring from the RAF and taking up the Chancellorship of the University of Cambridge.\n\nEarly life\n\nArthur Tedder was born in Scotland at the Glenguin Distillery (now Glengoyne) north of Glasgow in 1890. He was the son of Sir Arthur John Tedder and Emily Charlotte Bryson. His father was distinguished as the Commissioner of the Board of Customs who devised the old age pension scheme. His father's occupation meant that the young Tedder saw different parts of the British Isles, spending 1895 to 1898 in Lerwick on the Shetland Isles and 1899 to 1901 in Elgin, in the County of Moray. In 1902 the family moved to Croydon in Surrey and Tedder attended the Whitgift School until 1909 when he went up to Cambridge. Tedder spent his university years (1909–13) at Magdalene College, where he read history. He was awarded a lower second-class honours in June 1912.\n\nTedder spent the summer of 1912 in Berlin studying German. With the start of a new academic year, he decided to return to Magdalene for a fourth year in order that he might prepare himself for a career as a diplomat. During his last year at Magdalene, Tedder gained a reserve commission as a second lieutenant in the Dorsetshire Regiment. Later in the academic year Tedder changed his mind, deciding against a diplomatic career.\n\nAfter university, Tedder joined the Colonial Service as a cadet and departed England in February 1914, serving in the administration in Fiji. He did not find colonial life in Fiji to his liking and when war was declared, found a reason to return to England so that he could join the regular Army.\n\nMilitary career\n\nFirst World War\n\nTedder arrived back in England in December 1914. He was commissioned as a regular officer in the Dorsets in January 1915 and was promoted to lieutenant on 10 January. He was posted to a reserve unit at Wyke Regis on the Dorset coast where he seriously injured his knee in February. Tedder was consigned to light duties and although he was posted to Calais in July, he remained unable to carry out full infantry duties. During this time Tedder applied for a transfer to the Royal Flying Corps. In October Tedder was permitted to return to England where he continued to press for a transfer to the Flying Corps.\n\nIn January 1916, Tedder was accepted into the Royal Flying Corps and he first attended the No. 1 School of Aeronautics. In April he attended the Central Flying School where he learned to fly and gained his 'wings'. In June 1916, Tedder served as a pilot with No. 25 Squadron RFC flying the Bristol Scout C on the Western Front. Less than two months later, Tedder was given additional responsibilities as he was made a flight commander on 25 Squadron. The first day of 1917 saw Tedder promoted to major and appointed commander of No. 70 Squadron RFC. Tedder remained on the Western Front and his new squadron was equipped with the Sopwith 1½ Strutter. On 25 June 1917, he was appointed Officer Commanding No. 67 Squadron. This new command was in Middle East and although Tedder spent under a year as OC No. 67 Squadron, he remained in Middle East when he was made the commander of the School of Navigation and Bomb Dropping which was based in Egypt. Another change soon followed and on 24 June 1918 Tedder was temporarily promoted to lieutenant colonel in the recently formed RAF and appointed Officer Commanding 38th Wing, also based in Egypt.\n\nInter-war years\n\nAfter the War, Tedder accepted a permanent commission in the new Royal Air Force (RAF) as a squadron leader and commanded Nos 207 and 274 Squadrons, both based at RAF Bircham Newton. No 207 Sqn (equipped with DH9a bombers) was briefly deployed to Turkey in 1922/3 during the Chanak Crisis. No 274 Sqn was equipped with the Handley Page V/1500, the largest RAF bomber of its time. From 1923, Tedder was involved in training, both as a pupil at the RN Staff College and the Imperial Defence College and on the staff at the Directorate of Training. In 1926 as a Wing Commander, he was station commander at RAF Digby and Commandant of No. 2 Flying Training School there, later attending the RAF Staff College and the Air Armament School (as officer commanding in 1932). By 1931, Tedder had reached the rank of group captain and from 1934 to 1936 he served as Director of Training, gaining promotion to air commodore early in his tour.\n\nIn 1936, Tedder was appointed Air Officer Commanding (AOC) RAF Far Eastern Forces which gave him command over RAF units from Burma to Hong Kong and Borneo. In 1938 he became Director General for Research in the Air Ministry.\n\nSecond World War\n\nAt the outbreak of war in 1939, Tedder's department was transferred to the newly created Ministry of Aircraft Production, but Tedder was unable to form a good working relationship with the minister, Lord Beaverbrook, and consequently with Prime Minister Churchill and in November 1940, he became Deputy Air Officer Commander in Chief, RAF Middle East Command.\n\nTedder was appointed as Air Officer Commander in Chief, RAF Middle East Command in June 1941, with the temporary rank of Air Marshal (made permanent in April 1942). He had not been Churchill's first choice for the role but when the preferred choice (Air Vice-Marshal O T Boyd) was captured, Tedder was appointed. As head of the RAF Middle East Command, he commanded Allied air operations in the Mediterranean and North Africa, covering the evacuation of Crete in May 1941 and Operation Crusader in North Africa in late 1941. In January 1942 Tedder was knighted, being appointed Knight Commander of the Order of the Bath. Tedder oversaw the build up of the air arm in the Western Desert and, more importantly, the development of new more effective operational and administrative policies which turned it into a highly effective force which was key to the Allied victory at the decisive Battle of El Alamein. One of his bombing tactics became known as the \"Tedder Carpet\".\n\nIn December 1943, by now a temporary Air Chief Marshal, Tedder took command of Allied Air Forces in the Mediterranean. He was involved in the planning of the Allied invasion of Sicily.\n\nWhen Operation Overlord—the invasion of France—came to be planned, Tedder was appointed Deputy Supreme Commander beneath U.S. General Dwight D. Eisenhower. Finding himself with little responsibility in this new role he wrested control of the air planning for D-Day from the commander of the Allied Air Expeditionary Force, Trafford Leigh-Mallory. He developed an antipathy towards the British General Bernard Montgomery and during the difficult Battle of Normandy and later, he was a critic of Montgomery's performance and advocated Montgomery's removal from command.\n\nIn the last year of the war, Tedder was sent to Russia to seek assistance as the Western Front came under pressure during the Battle of the Bulge. When the unconditional surrender of the Germans came in May 1945 Tedder signed on behalf of General Eisenhower.\n\nKnighted in 1942, Tedder was granted a peerage at the war's end. He followed Charles Portal as Chief of the Air Staff and served in that post from 1946 to 1950. In 1947 he delivered the Lees Knowles Lecture, which was then published as Air Power in War.\n\nAlthough the nature of his war service denied him gallantry awards, Tedder received several significant foreign awards from Belgium, France, the United States and elsewhere.\n\nLater life\n\nLord Tedder was the author of a historical study of the Royal Navy and also composed his war memoirs. In 1950 he became Chancellor of the University of Cambridge. In 1950 he served as the British representative on the military committee of NATO in Washington DC. He also served as Vice-Chairman of the Board of Governors of the BBC. He received at least six honorary LLD degrees, and was avidly interested in astronomy. In his later years he contracted Parkinson's Disease and died in Surrey in 1967, aged 76 years.\n\n[edit] Family life\n\nTedder married Rosalinde Maclardy who was killed in an aircraft crash in Egypt in 1943, an event that Tedder witnessed. Tedder remarried but his second wife, Marie (Toppy) de Seton Black, predeceased him by about two years, in 1965. Tedder was the parent of: Dick (killed in France 1940), John Michael (1926–1994; Late Purdie Professor of Chemistry, University of St. Andrews), and a daughter Mina. His stepson Alasdair was also killed.\n\nStyles\n\n1890–1913: Arthur William Tedder 1913–1915: Second Lieutenant Arthur William Tedder 1915–1916: Lieutenant Arthur William Tedder 1916–1917: Captain Arthur William Tedder 1917–1918: Major Arthur William Tedder (Temporary rank in Army from 1 Jan 1917 – 1 Apr 1918; full rank of Major in RAF after then) 1918–1919: Major RAF (Temp. Lieutenant-Colonel RAF) Arthur William Tedder 1919–1924: Squadron Leader Arthur William Tedder 1924–1931: Wing Commander Arthur William Tedder 1931–1934: Group Captain Arthur William Tedder 1934 – 1 February 1937: Air Commodore Arthur William Tedder 1 February – 1 July 1937: Air Commodore Arthur William Tedder, CB 1 July 1937–1940: Air Vice-Marshal Arthur William Tedder, CB 1940–1941: Air Vice-Marshal (Actg. Air Marshal) Arthur William Tedder, CB 1941 – 1 Jan 1942: Air Marshal Arthur William Tedder, CB 1 Jan – 1 July 1942: Air Marshal Sir Arthur William Tedder, KCB 1 July – 27 November 1942: Air Marshal (Temp. Air Chief Marshal) Sir Arthur William Tedder, KCB 27 November 1942 – 6 June 1945: Air Marshal (Temp. Air Chief Marshal) Sir Arthur William Tedder, GCB 6 June – 12 September 1945: Air Chief Marshal Sir Arthur William Tedder, GCB 12 September 1945–1946: Marshal of the Royal Air Force Sir Arthur William Tedder, GCB 1946–1967: Marshal of the Royal Air Force The Right Honourable the Lord Tedder of Glenguin, GCB\n\nOrders, decorations and medals\n\nHis awards were as follows:\n\nBaron - 1 Jan 1946 (Conferred 8 Feb 1946) Order of the Bath (Knight Grand Cross - 27 Nov 1942; Knight Commander - 1 Jan 1942; Companion - 1 Feb 1937), Mentioned in Despatches - 22 Jun 1919, 5 Jun 1919, Commendation - 3 Jun 1942,\n\nForeign awards\n\nMedal of Military Valour, Silver; (Italy) - 26 May 1917, Nichan Iftikhar (Order of Glory), Grand Cordon; (Tunisia) - 27 Aug 1943, Order of Ouissam Alaouite, Grand Officer; (Morocco) - 27 Aug 1943, Legion of Merit, Chief Commander; (United States) - 27 Aug 1943, Order of Polonia Restituta, Grand Cross; (Poland) - 1 Oct 1943, Order of Kutuzov, 1st Class; (USSR) - 28 Aug 1945, Legion of Honour (Grand Commandeur - 1945; Grand Officier - 1945; Croix de Commandeur - 1942); (France) Distinguished Service Medal, United States - 14 Jun 1946, Grand Cross of the Order of the Crown with Palms; (Belgium) - 18 Jun 1946, Croix de Guerre 1940 with Palms, (Belgium) - 18 Jun 1946, Royal Order of George I (with Swords), Grand Cross; (Greece) - 6 Sep 1946, Croix de Guerre with Palms; (France) - 27 Sep 1946, Order of Orange Nassau, Knight Grand Cross; (Netherlands) - 31 Oct 1947. [edit] Academic awardsBA (Hons) – 1912, Hon Fellow, Magdalene College, Cambridge, Hon DCL - Oxford (1945), Hon LLD, Cambridge (31 Jan 1946), Leeds (10 May 1946), Glasgow (19 Jun 1946), Sheffield (25 Jun 1946), Birmingham, Edinburgh"}, {"url": "https://timenote.info/en/Arthur-Tedder", "page_content": "Marshal of the Royal Air Force Arthur William Tedder, 1st Baron Tedder, GCB (11 July 1890 – 3 June 1967) was a senior British air force commander. He was a pilot and squadron commander in the Royal Flying Corps in the First World War and he went on to serve as a senior officer in the Royal Air Force during the inter-war years. During the Second World War, as Air Officer Commanding RAF Middle East Command, Tedder commanded air operations in the Mediterranean and North Africa, including the evacuation of Crete and Operation Crusader in North Africa. His bombing tactics became known as the \"Tedder Carpet\". Later in the War Tedder took command of Mediterranean Air Command and in that role was closely involved in the planning of the Allied invasion of Sicily and then the Allied invasion of Italy. When Operation Overlord—the invasion of France—came to be planned, Tedder was appointed Deputy Supreme Commander at SHAEF under General Eisenhower. After the War he served as Chief of the Air Staff in which role he advocated increased recruiting in the face of many airmen leaving the service, doubled the size of RAF Fighter Command and implemented arrangements for the Berlin Airlift in 1948.\n\nEarly life\n\nTedder was born the son of Sir Arthur John Tedder and Emily Charlotte Tedder (née Bryson) at the Glenguin Distillery (now Glengoyne) north of Glasgow. His father was distinguished as the Commissioner of the Board of Customs who devised the old age pension scheme. His father's occupation meant that the young Tedder saw different parts of the British Isles, spending 1895 to 1898 in Lerwick on the Shetland Isles and 1899–1901 in Elgin, in the County of Moray. In 1902 the family moved to Croydon in Surrey and Tedder attended the Whitgift School until 1909 when he went up to Cambridge University. Tedder spent his university years (1909–13) at Magdalene College, where he read history. He was awarded a lower second-class honours in June 1912.\n\nTedder spent the summer of 1912 in Berlin studying German. With the start of a new academic year, he decided to return to Magdalene for a fourth year in order that he might prepare himself for a career as a diplomat. On 2 September 1913, during his last year at Magdalene, Tedder gained a reserve commission as a second lieutenant in the Dorsetshire Regiment.\n\nAfter university, Tedder joined the Colonial Service as a cadet and departed England in February 1914, serving in the administration in Fiji. He did not find colonial life in Fiji to his liking and when war was declared, returned to England so that he could join the regular Army.\n\nMilitary career\n\nFirst World War\n\nTedder was promoted to lieutenant in the Dorset Regiment on 14 October 1914 and arrived back in England in December 1914. He was posted to a reserve unit at Wyke Regis on the Dorset coast where he seriously injured his knee in February. Following his injury Tedder was unable to carry out full infantry service and, although he briefly carried out duties at a case camp in Calais, he pressed for a transfer to the Royal Flying Corps.\n\nIn January 1916, Tedder was accepted into the Royal Flying Corps and he was asked to attend the No. 1 School of Aeronautics. He was promoted to captain on 21 March 1916. In April he attended the Central Flying School where he learned to fly and gained his 'wings'. In June 1916, Tedder served as a pilot with No. 25 Squadron RFC flying the Bristol Scout C on the Western Front. On 9 August 1916, Tedder was given additional responsibilities as he was made a flight commander with 25 Squadron. The first day of 1917 saw Tedder promoted to major and appointed officer commanding No. 70 Squadron RFC. Tedder remained on the Western Front and his new squadron was equipped with the Sopwith 1½ Strutter. He was awarded the Italian Silver Medal for Military Valour on 26 May 1917.\n\nTedder was appointed officer commanding No. 67 Squadron at RAF Shawbury on 25 June 1917 and became commander of the School of Navigation and Bomb Dropping in Egypt the following year. Another change soon followed and on 24 June 1918 Tedder was appointed officer commanding 38th Wing, also based in Egypt. He was promoted to the temporary rank of lieutenant colonel on 23 July 1918 (rank relinquished on 2 April 1919).\n\nInter-war years\n\nTedder was given command of No. 274 Squadron, equipped with the Handley Page V/1500, the largest RAF bomber of its time, at RAF Bircham Newton in May 1919. On 1 August 1919, Tedder accepted a permanent commission in the new Royal Air Force (RAF). Renamed No. 207 Squadron in February 1920 and equipped with DH9a bombers, the squadron was briefly deployed to Turkey in 1922/3 during the Chanak Crisis. Tedder attended the RN Staff College in late 1923 and through the spring of 1924.\n\nPromoted to wing commander on 1 January 1924, Tedder became station commander at RAF Digby and Commandant of No. 2 Flying Training School there in September 1924, before joining the air staff in the Directorate of Training at the Air Ministry in January 1927. He attended the Imperial Defence College in 1928 and then became Assistant Commandant at the RAF Staff College in January 1929. Promoted to group captain on 1 January 1931, he went to the Air Armament School at RAF Eastchurch as officer commanding in January 1932. On 4 April 1934 he became Director of Training at the Air Ministry, gaining promotion to air commodore on 1 July 1934.\n\nIn November 1936, Tedder was appointed Air Officer Commanding (AOC) RAF Far Eastern Forces which gave him command over RAF units from Burma to Hong Kong and Borneo. Appointed a Companion of the Order of the Bath on 1 February 1937, he was promoted to air vice marshal on 1 July 1937 and became Director General for Research in the Air Ministry in July 1938.\n\nSecond World War\n\nAt the outbreak of war in 1939, Tedder's department was transferred to the newly created Ministry of Aircraft Production, but Tedder was unable to form a good working relationship with the minister, Lord Beaverbrook, and consequently with Prime Minister Churchill and on 29 November 1940, he became Deputy Air Officer Commanding in Chief, RAF Middle East Command with the acting rank of air marshal.\n\nTedder was appointed as Air Officer Commanding in Chief, RAF Middle East Command on 1 June 1941, with the temporary rank of air marshal (made permanent in April 1942). He had not been Churchill's first choice for the role but when the preferred choice (Air Vice-Marshal O T Boyd) was captured, Tedder was appointed. As head of the RAF Middle East Command, he commanded air operations in the Mediterranean and North Africa, including the evacuation of Crete in May 1941 and Operation Crusader in North Africa in late 1941. Tedder was advanced to Knight Commander of the Order of the Bath in the 1942 New Year Honours, mentioned in despatches for his services in the Middle East on 30 June 1942 and promoted to the temporary rank of air chief marshal on 3 July 1942.\n\nTedder oversaw the build up of the air arm in the Western Desert and, more importantly, the development of new more effective operational and administrative policies which turned it into a highly effective force which was key to the Allied victory at the decisive Battle of El Alamein in October 1942. One of his bombing tactics became known as the \"Tedder Carpet\". He was advanced to Knight Grand Cross of the Order of the Bath on 27 November 1942 in recognition of his services in the Middle East.\n\nIn February 1943 Tedder took command of Mediterranean Air Command, serving under U.S. General Dwight D. Eisenhower (the theatre commander), and in that role was closely involved in the planning of the Allied invasion of Sicily and then the Allied invasion of Italy. He was appointed a Chief Commander of the American Legion of Merit on 27 August 1943 and awarded the Grand Cross of the Polish Order of Polonia Restituta on 1 October 1943. He went on to be Commander of Mediterranean Allied Air Forces, which took in an expanded group of air forces, in December 1943.\n\nWhen Operation Overlord—the invasion of France—came to be planned, Tedder was appointed Deputy Supreme Commander at SHAEF beneath General Eisenhower, taking up the role in January 1944. However he developed an antipathy towards the British General Bernard Montgomery and during the difficult Battle of Normandy and later, he was a critic of Montgomery's performance and advocated Montgomery's removal from command. In the last year of the war, Tedder was sent to Russia to seek assistance as the Western Front came under pressure during the Battle of the Bulge. When the unconditional surrender of the Germans came in May 1945 Tedder signed on behalf of General Eisenhower. He was promoted to the substantive rank of air chief marshal on 6 June 1945. Tedder was awarded the Soviet Order of Kutuzov (1st Class) on 28 August 1945 and promoted to Marshal of the Royal Air Force on 12 September 1945.\n\nAfter the War\n\nTedder took over from Charles Portal as Chief of the Air Staff on 1 January 1946. In that role he advocated increased recruiting in the face of many airmen leaving the service, doubled the size of RAF Fighter Command and implemented arrangements for the Berlin Airlift in 1948. He was granted a peerage as Baron Tedder, of Glenguin in the County of Stirling on 8 February 1946 and received the American Distinguished Service Medal on 14 June 1946. In 1947 he delivered the Lees Knowles Lecture, which was then published as Air Power in War. He moved on to become Chairman, British Joint Services Mission in Washington D. C. in January 1950 before retiring in May 1951. In 1951 Tedder accepted an invitation to chair the Royal Commission on University Education in Dundee which ultimately led to the creation of the Queen's College, Dundee as a college of the University of St Andrews.\n\nLater life\n\nTedder was the author of a highly regarded essay on the history of the Royal Navy and also composed his war memoirs. In November 1950 he was elected Chancellor of the University of Cambridge. He also served as Chairman of the Standard Motor Company and Vice-Chairman of the Board of Governors of the BBC. In his later years he developed Parkinson's Disease and died at his home at Banstead in Surrey on 3 June 1967.\n\nFamily life\n\nIn 1915 Tedder married Rosalinde Maclardy; they had two sons and a daughter.Following the death of his first wife in an aircraft crash in Egypt in January 1943, Tedder married Marie (Toppy) Black (née Seton) in October 1943. Tedder was the father of: Dick (killed in France 1940), John Michael (1926–1994; Late Purdie Professor of Chemistry, University of St. Andrews), Richard (Professor of Virology at UCL) and Mena."}, {"url": "https://www.tracesofwar.com/persons/43300/Tedder-Arthur-William.htm", "page_content": "Tedder, Arthur William\n\nDate of birth: July 11th, 1890 (Glenguin/Scotland, Great Britain) Date of death: July 3rd, 1967 (Surrey, Great Britain) Nationality: British (1801-present, Kingdom)\n\nBiography\n\nArthur William Tedder was born in Glenguin, Stirling, Scotland to Commissioner of the Board of Customs Sir Arthur John Tedder and Emily Charlotte Bryson. He joined the Dorsetshire Regiment in 1913 and was transferred to the Royal Flying Corps in 1916. During WW1, he served in France between 1915 and 1917 and then in Egypt until 1919. After the war, he was transferred to the newly formed Royal Air Force as a squadron leader. He was promoted to the rank of group captain in 1931, and served as Director of Training from 1934 to 1936. Immediately before the outbreak of the European War, he was the commander of the RAF Eastern Forces and was director general for research in the Air Ministry.\n\nAfter Britain entered WW2, Tedder served as the head of the RAF Middle East Command, which also covered the battlefields in the Mediterranean Sea and in North Africa. While the forces under his command experienced both victories and defeats, his reputation as an effective air commander grew. He was increasingly known for the deployment of \"Tedder Carpet\" tactic, which involves multiple bombers committing a rolling barrage with high explosive and napalm bombs ahead of advancing friendly forces. He was knighted in 1942 and was promoted to the rank of air marshal by the end of the Desert War. He was heavily involved in the planning of the invasion of Sicily and then Normandy. He was named Deputy Supreme Commander in the latter campaign, though he at times found himself without resources because commander of the Allied Air Expeditionary Force Trafford Leigh-Mallory at times deployed forces for objectives that were tactically different than that of Tedder's for the campaign in Normandy. In the last year of the war, he was sent to Russia seeking greater coordination between Russia and the Western Allies, particularly during the Ardennes offensive in the winter of 1944 to 1945. In May 1945, he signed the German surrender instrument on behalf of General Dwight Eisenhower.\n\nTedder lost two family members during the war. His son Richard Tedder died in combat in France during the German invasion. His first wife Rosalinde Maclardy, who was beside him during the Desert War, died in an air crash in Egypt in 1943.\n\nAfter the war, Tedder gained peerage as First Baron Tedder. He served as the Chief of the Air Staff between 1946 and 1950. In 1950, he served as the British representative on the military committee of North Atlantic Treaty Organization (NATO) in Washington, DC, United States. On the civilian side of his life, he was the chancellor of Cambridge University between 1950 and 1967, served some time on the board of the British Broadcasting Corporation (BBC), and authored his memoirs and a historical study of the Royal Navy.\n\nAfter several years of struggle with Parkinson's Disease, Tedder passed away in Surrey, England, at the age of 76.\n\n\n\nPromotions:\n\n-Army\n\n2nd Lieutenant: September 2nd, 1913\n\nLieutenant: January 110th, 915\n\n(T) Captain: March 21st, 1916\n\nCaptain: June 13th, 1916\n\n(T) Major: January 1st, 1917\n\n\n\n- RAF\n\nMajor: April 1st, 1918\n\n(T) Lieutenant-Colonel: June 24th, 1918 - April 2nd, 1919\n\nSquadron Leader: August 1st, 1919\n\nWing Commander: January 1st, 1924\n\nGroup Captain: January 1st, 1931\n\nAir Commodore: July 1st, 1934\n\nAir Vice-Marshal: July 1st, 1937\n\nActing Air Marshal: November 29th. 1940\n\n(T) Air Marshal: June 1st, 1941\n\nAir Marshal: April 14th, 1942\n\n(T) Air Chief Marshal: July 1st, 1942\n\nAir Chief Marshal: June 6th, 1945\n\nMarshal of the RAF: September 12 th, 1945\n\nDo you have more information about this person? Inform us!\n\nRank: Air Commodore Awarded on: February 1st, 1937\n\nPeriod: Second World War (1939-1945) Rank: Air Marshal Awarded on: June 30th, 1942 \"For his services in the Middle East\"\n\n\"For his services in the Middle East\"\n\nPeriod: Second World War (1939-1945) Rank: Air Chief Marshal Awarded on: November 27th, 1942\n\nPeriod: Second World War (1939-1945) Rank: Air Chief Marshal Awarded on: August 27th, 1943\n\nPeriod: Second World War (1939-1945) Rank: Air Chief Marshal Awarded on: August 27th, 1943\n\nPeriod: Second World War (1939-1945) Rank: Air Chief Marshal Awarded on: October 1st, 1943\n\nPeriod: Second World War (1939-1945) Rank: Air Chief Marshal Awarded on: August 28th, 1945\n\nPeriod: Second World War (1939-1945) Rank: Marshal of The RAF Awarded on: June 14th, 1946\n\nPeriod: Second World War (1939-1945) Rank: Marshal of The RAF Awarded on: June 18th, 1946\n\nPeriod: Second World War (1939-1945) Rank: Marshal of The RAF Awarded on: June 18th, 1946\n\nPeriod: Second World War (1939-1945) Rank: Marshal of The RAF Awarded on: September 6th, 1946\n\nPeriod: Second World War (1939-1945) Rank: Marshal of The RAF Awarded on: September 27th, 1946\n\nPeriod: Second World War (1939-1945) Rank: Marshal of The RAF Awarded on: October 31st, 1947\n\nWar Diary mentions\n\n8 November 1944 WO 171/691 - 159 Infantry Brigade\n\nAt 0830 hrs 1 Hereford took over from 4 Ksli in IJSSELSTEIN, the 4 Ksli moving to DEURNE Bks for a 48 hrs rest in preparation for taking over GRIENDTSVEEN. Other Bde locations remained the same. Patrols continued during the night. Air Marshal Tedder and General Dempsey visited the Hq and remained talking to the Brigadier for about half an hour.\n\nSources"}, {"url": "https://artsandculture.google.com/entity/arthur-tedder-1st-baron-tedder/m03pt94", "page_content": "Marshal of the Royal Air Force Arthur William Tedder, 1st Baron Tedder, GCB was a senior Royal Air Force commander. He was a pilot and squadron commander in the Royal Flying Corps in the First World War and he went on to serve as a senior officer in the Royal Air Force during the inter-war years when he served in Turkey, Great Britain and the Far East.\n\nDuring the Second World War, as Air Officer Commanding RAF Middle East Command, Tedder directed air operations in the Mediterranean and North Africa, including the evacuation of Crete and Operation Crusader in North Africa. His bombing tactics became known as the \"Tedder Carpet\". Later in the war Tedder took command of Mediterranean Air Command and in that role was closely involved in the planning of the Allied invasion of Sicily and then the Allied invasion of Italy. When Operation Overlord—the invasion of France—came to be planned, Tedder was appointed Deputy Supreme Commander at Supreme Headquarters Allied Expeditionary Force under General Eisenhower.\n\nShow less Read more Wikipedia"}, {"url": "https://books.google.com/books/about/Air_Power_in_War.html?id=fkxYtABxb6gC", "page_content": "Arthur W. Tedder University of Alabama Press , 27 May 2010 - History - 127 pages 0 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified The architect of the successful air strategy which led to Allied victory\n\n\n\nArthur Tedder, who was knighted and raised to the peerage for his contributions to the Allied victory in World War II, served in the British air force in World War I and played an important role in professionalizing and organizing British air forces between the two world wars. During World War II, he held a succession of increasingly vital air force posts.\n\n\n\nIn addition to his achievements as Air Commander-in-Chief in the North African theater early in the war, Tedder’s most lasting contribution was as Deputy Supreme Commander under Dwight D. Eisenhower. He deserves much credit for keeping the Allied command functioning and harmonious. He was also the architect of the successful air strategy Eisenhower adopted for the Normandy invasion of 1944, which departed from both the British and American existing doctrine and models by concentrating on German rail systems rather than on either civilian or industrial targets.\n\nPreview this book »"}, {"url": "https://www.groundzerobooksltd.com/pages/books/76641/arthur-tedder/air-power-in-war-the-lees-knowles-lectures", "page_content": "Tedder, Arthur Air Power in War; The Lees Knowles Lectures\n\nLondon: Hodder and Stoughton, 1947. Presumed First Edition, First printing thus. Hardcover. 124 pages. Diagrams (three in color, two fold-outs, one two facing pages). Endpaper maps. Cover has some wear and soiling. Front board somewhat bowed. Pencil erasure residue on fep. This book comprises four lectures on \"Air Power in War\" which were delivered Field Marshal of the Royal Air Force The Lord Tedder as the Lees Knowles Lectures, at Cambridge University in 1947. Its form is generally the same as that in which the lectures were actually delivered, and it represents the author's personal views. An edition for Service use only and not for re-publication has been issued by the Stationery Office. Airpower or air power comprises the application of military strategy and strategic theory to the realm of aerial warfare. Airpower began with the advent of powered flight early in the 20th century. Airpower represents a \"complex operating environment that has been subjected to considerable debate\" Marshal of the Royal Air Force Arthur William Tedder, 1st Baron Tedder, GCB (11 July 1890 – 3 June 1967) was a senior Royal Air Force commander. He was a pilot and squadron commander in the Royal Flying Corps in the First World War and he went on to serve as a senior officer during the inter-war years. During the Second World War, Tedder directed air operations in the Mediterranean and North Africa, including Operation Crusader in North Africa. His bombing tactics became known as the \"Tedder Carpet\". Later Tedder was closely involved in the planning of the Allied invasion of Sicily and then the Allied invasion of Italy. When Operation Overlord came to be planned, Tedder was appointed Deputy Supreme Commander at Supreme Headquarters Allied Expeditionary Force under General Eisenhower. After the war he served as Chief of the Air Staff, in which role he advocated increased recruiting, doubled the size of RAF Fighter Command and implemented arrangements for the Berlin Airlift. Condition: Good.\n\n\n\nKeywords: Air Power, Airpower, Seapower, Air Superiority, Strategic Bombing, Damage Assessment, Military Operations, Aerial Operations, Luftwaffe, Royal Air Force, RAF, Interdiction, Air Offensive\n\n\n\n[Book #76641]\n\nPrice: $65.00"}]}