{"During the Second World War he was Deputy Supreme Allied Commander in Europe, serving under General Dwight D. Eisenhower.": [{"url": "https://www.history.com/topics/us-presidents/dwight-d-eisenhower", "page_content": "During his presidency, Eisenhower managed Cold War-era tensions with the Soviet Union under the looming threat of nuclear weapons, ended the war in Korea in 1953 and authorized a number of covert anti-communist operations by the CIA around the world. On the home front, where America was enjoying a period of relative prosperity, Eisenhower strengthened Social Security, created the massive new Interstate Highway System and maneuvered behind the scenes to discredit the rabid anti-Communist Senator Joseph McCarthy. Though popular throughout his administration, he faltered in the protection of civil rights for African Americans by failing to fully enforce the Supreme Court’s mandate for the desegregation of schools in Brown v. Board of Education (1954).\n\nAs supreme commander of Allied forces in Western Europe during World War II, Dwight D. Eisenhower led the massive invasion of Nazi-occupied Europe that began on D-Day (June 6, 1944). In 1952, leading Republicans convinced Eisenhower (then in command of NATO forces in Europe) to run for president; he won a convincing victory over Democrat Adlai Stevenson and would serve two terms in the White House (1953-1961).\n\nEisenhower’s Early Life and Military Career\n\nBorn in Denison, Texas, on October 14, 1890, Dwight David Eisenhower grew up in Abilene, Kansas, as the third of seven sons in a poor family. To the distress of his mother, a devout Mennonite and pacifist, young Ike (as he was known) won an appointment to the U.S. Military Academy at West Point, New York, and graduated in the middle of his class in 1915. While stationed as a second lieutenant in San Antonio, Texas, Eisenhower met Mamie Geneva Doud. The couple married in 1916 and had two sons, Doud Dwight (who died of scarlet fever as a small child) and John.\n\nDid you know? At the Potsdam Conference in July 1945, General Eisenhower was among those who opposed the use of the atomic bomb against the Japanese cities of Hiroshima and Nagasaki. He argued that Japan was on the verge of surrender already and that being the first to use such a fearsome new weapon would damage U.S. prestige in the international community just as it had reached its highest point.\n\nWorld War I ended just before Eisenhower was scheduled to go to Europe, frustrating the young officer, but he soon managed to gain an appointment to the Command and General Staff College at Fort Leavenworth, Kansas. Graduating first in his class of 245, he served as a military aide to General John J. Pershing, commander of U.S. forces during World War I, and later to General Douglas MacArthur, U.S. Army chief of staff. During his seven years serving under MacArthur, Eisenhower was stationed in the Philippines from 1935 to 1939.\n\nEisenhower in World War II\n\nEisenhower returned soon after Nazi Germany’s invasion of Poland sparked the outbreak of World War II in Europe. In September 1941, he received his first general’s star with a promotion to brigadier general. After Japan attacked Pearl Harbor that December, U.S. Army Chief of Staff General George C. Marshall called Eisenhower to Washington, D.C. to work as a planning officer. Beginning in November 1942, Eisenhower headed Operation Torch, the successful Allied invasion of North Africa. He then directed the amphibious invasion of Sicily and the Italian mainland in 1943 that led to the fall of Rome in June 1944.\n\nMade a full general in early 1943, Eisenhower was appointed supreme commander of the Allied Expeditionary Force in December of that year and given the responsibility of spearheading the planned Allied invasion of Nazi-occupied Europe. On D-Day (June 6, 1944), more than 150,000 Allied forces crossed the English Channel and stormed the beaches of Normandy; the invasion led to the liberation of Paris on August 25 and turned the tide of the war in Europe decisively in the Allied direction. Having risen from lieutenant colonel in the Philippines to supreme commander of the victorious forces in Europe in only five years, Eisenhower returned home to a hero’s welcome in 1945 to serve as chief of staff of the U.S. Army.\n\nIke’s Road to the White House\n\nIn 1948, Eisenhower left active duty and became president of New York City’s Columbia University. His brief return to civilian life ended in 1950, however, when President Harry S. Truman asked him to take command of the new North Atlantic Treaty Organization (NATO) forces in Europe. In that position, Eisenhower worked to create a unified military organization that would combat potential communist aggression around the globe.\n\nIn 1952, with Truman’s popularity sagging during the ongoing war in Korea, leading Republicans approached Eisenhower and persuaded him to make a run for president. After mixed results in primary elections against the Republican front-runner, Senator Robert A. Taft of Ohio, Eisenhower resigned his commission in the Army and returned from his NATO base in Paris in June 1952.\n\nAt the party’s national convention that July, he won the Republican nomination on the first ballot. Under the slogan “I Like Ike” and with Senator Richard M. Nixon of California as his running mate, Eisenhower then defeated Adlai Stevenson to become the 34th president of the United States. (Eisenhower would beat Stevenson again four years later in a landslide to win reelection, despite health concerns after suffering a heart attack in 1955.)\n\nEisenhower’s Domestic Policy\n\nAs a moderate Republican, Eisenhower was able to achieve numerous legislative victories despite a Democratic majority in Congress during six of his eight years in office. In addition to continuing most of the New Deal and Fair Deal programs of his predecessors (Franklin Roosevelt and Truman, respectively), he strengthened the Social Security program, increased the minimum wage and created the Department of Health, Education and Welfare. In 1956, Eisenhower created the Interstate Highway System, the single largest public works program in U.S. history, which would construct 41,000 miles of roads across the country.\n\nDuring Eisenhower’s first term, Republican Senator Joseph McCarthy’s anti-Communist crusade violated the civil liberties of many citizens, culminating in a series of sensational televised hearings in the spring of 1954. To preserve party unity, Eisenhower refrained from publicly criticizing McCarthy, though he privately disliked the senator and worked behind the scenes to diminish McCarthy’s influence and eventually discredit him. Eisenhower was even more hesitant, however, in the realm of civil rights for African Americans.\n\nIn 1954, in the case of Brown v. Board of Education of Topeka, the U.S. Supreme Court had ruled that school segregation was unconstitutional. Eisenhower believed that desegregation should proceed slowly, and was reluctant to use his presidential authority to back up the enforcement of the Court’s verdict, though he did send federal troops to Little Rock, Arkansas in 1957 to enforce integration of a high school there. Eisenhower did sign civil rights legislation in 1957 and 1960 providing federal protection for black voters; it was the first such legislation passed in the United States since Reconstruction.\n\nEisenhower’s Foreign Policy\n\nSoon after taking office, Eisenhower signed an armistice ending the Korean War. Aside from sending combat troops into Lebanon in 1958, he would send no other armed forces into active duty throughout his presidency, though he did not hesitate to authorize defense spending. He also authorized the Central Intelligence Agency (CIA) to undertake covert operations against communism around the world, two of which toppled the governments of Iran in 1953 and Guatemala in 1954. In 1954, Eisenhower decided against authorizing an airstrike to rescue French troops from defeat at Dien Bien Phu, avoiding a war in Indochina, though his support for the anti-communist government in South Vietnam would sow the seeds of future U.S. participation in the Vietnam War.\n\nEisenhower sought to improve Cold War-era relations with the Soviet Union, especially after the death of Josef Stalin in 1953. In July 1955, when Eisenhower met with British, French and Russian leaders in Geneva, Switzerland, he proposed an “open skies” policy, in which the United States and Soviet Union would conduct air inspections of each other’s military programs; the U.S.S.R. rejected the proposal, though it won international approval. Under the rising threat of Soviet nuclear weapons technology, Eisenhower and Secretary of State John Foster Dulles did succeed in strengthening NATO and in creating the Southeast Asia Treaty Organization (SEATO) to combat communist expansion in that region.\n\nDwight D. Eisenhower: Legacy and Post-Presidential Life\n\nThough U.S.-Soviet relations remained relatively cordial throughout his presidency, including a summit meeting with Premier Nikita Krushchev in 1959, the Soviet shooting of a U.S. U-2 reconnaissance plane in May 1960 dashed Eisenhower’s hopes for a treaty before he left office. In his farewell address of January 1961, Eisenhower spoke of the dangers inherent in what he called the “military-industrial complex.”\n\nDue to the combination of national defense needs with advances in technology, he warned, a partnership between the military establishment and big business threatened to exert an undue influence on the course of the American government. His warnings would go unheeded, however, amid the ongoing tensions of the Cold War era.\n\nWhile weathering criticism from both left and right, Eisenhower enjoyed high approval ratings throughout his administration. After leaving office in January 1961, he retired to his farm in Gettysburg, Pennsylvania. He worked largely on his memoirs and would publish several books over the following years. He died on March 28, 1969, after a long illness."}, {"url": "https://www.archives.gov/education/lessons/d-day", "page_content": "D-Day\n\nEn Español\n\nGeneral Dwight D. Eisenhower was appointed the Supreme Allied Commander of the Allied Expeditionary Force during World War II. As leader of all Allied troops in Europe, he led \"Operation Overlord,\" the amphibious invasion of Normandy across the English Channel. Eisenhower faced uncertainty about the operation, but D-Day was a military success, though at a huge cost of military and civilian lives lost, beginning the liberation of Nazi-occupied France. Read more...\n\nPrimary Sources\n\nLinks go to DocsTeach, the online tool for teaching with documents from the National Archives.\n\nTeaching Activities\n\nThe Night Before D-Day on DocsTeach asks students to analyze two documents written by General Dwight Eisenhower before the invasion of Normandy on D-Day: his \"In Case of Failure\" message and his Order of the Day. Students will compare and contrast these documents to gain a better understanding of the mindset of Allied leaders on the eve of the invasion.\n\nThe World War II page on DocsTeach includes other primary sources and document-based teaching activities related to World War II. It includes topics such as D-Day, women in the war, Code Talkers, propaganda posters, the homefront, the Holocaust, Pearl Harbor, the atomic bomb, war crimes and trials, and more.\n\nAdditional Background Information\n\nDuring World War II, U.S. President Franklin D. Roosevelt, Soviet leader Joseph Stalin, and British Prime Minister Winston Churchill jointly planned strategies for the cooperation and eventual success of the Allied armed forces.\n\nRoosevelt and Churchill agreed early in the war that Germany must be stopped first if success was to be attained in the Pacific. They were repeatedly urged by Stalin to open a \"second front\" that would alleviate the enormous pressure that Germany's military was exerting on Russia. Large amounts of Soviet territory had been seized by the Germans, and the Soviet population had suffered terrible casualties from the relentless drive towards Moscow. Roosevelt and Churchill promised to invade Europe, but they could not deliver on their promise until many hurdles were overcome.\n\nAlmost immediately after France had fallen to the Nazis in 1940, the Allies had planned an assault across the English Channel on the German occupying forces. Initially, though, the United States had far too few soldiers in England for the Allies to mount a successful cross-channel operation.\n\nSo in July 1942, Churchill and Roosevelt decided on the goal of occupying North Africa as a springboard to a European invasion from the south. Invading Europe from more than one point would also make it harder for Hitler to resupply and reinforce his divisions. In November, American and British forces under the command of U.S. General Dwight D. Eisenhower landed at three ports in French Morocco and Algeria. This surprise seizure of Casablanca, Oran, and Algiers came less than a week after the decisive British victory at El Alamein. The stage was set for the expulsion of the Germans from Tunisia in May 1943, the Allied invasion of Sicily and Italy later that summer, and the main assault on France the following year.\n\nAt the Quebec Conference in August 1943, Churchill and Roosevelt reaffirmed their plan for a cross-channel assault into occupied France, which was code-named Overlord. Although Churchill acceded begrudgingly to the operation, historians note that the British still harbored persistent doubts about whether Overlord would succeed.\n\nThe decision to mount the invasion was cemented at the Tehran Conference held in November and December 1943. Joseph Stalin, on his first trip outside the Soviet Union since 1912, pressed Roosevelt and Churchill for details about the plan, particularly the identity of the Supreme Commander of Overlord. Churchill and Roosevelt told Stalin that the invasion \"would be possible\" by August 1, 1944, but that no decision had yet been made to name a Supreme Commander. To this latter point, Stalin pointedly rejoined, \"Then nothing will come of these operations. Who carries the moral and technical responsibility for this operation?\" Churchill and Roosevelt acknowledged the need to name the commander without further delay.\n\nGeneral Eisenhower was named Supreme Allied Commander of the Allied Expeditionary Force shortly after the conference ended. When in February 1944 he was ordered to invade the continent, planning for Overlord had been under way for about a year. By May 1944, hundreds of thousands of Allied troops from the United States, Great Britain, France, Canada, and other nations were amassed in southern England and intensively trained for the complicated amphibious action against Normandy. While awaiting deployment orders, they prepared for the assault by practicing with live ammunition.\n\nIn addition to the troops, supplies, ships, and planes were also gathered and stockpiled. The largest armada in history, made up of more than 4,000 American, British, and Canadian ships, lay in wait. More than 1,200 planes stood ready to deliver seasoned airborne troops behind enemy lines, to counter German ground resistance as best they could, and to dominate the skies over the impending battle theater. Countless details about weather, topography, and the German forces in France had to be learned before Overlord could be launched in 1944.\n\nAgainst a tense backdrop of uncertain weather forecasts, disagreements in strategy, and related timing dilemmas predicated on the need for optimal tidal conditions, Eisenhower decided before dawn on June 5 to proceed with Operation Overlord. But his uncertainty about success in the face of a highly-defended and well-prepared enemy led him to consider what would happen if the invasion of Normandy failed. If the Allies did not secure a strong foothold on D-Day, they would be ordered into a full retreat. Later that day, he scribbled a note intended for release, accepting responsibility for the decision to launch the invasion and full blame, should Overlord fail.\n\nHowever, Eisenhower's determination that the invasion of Normandy would bring a quick end to the war is obvious in his \"order of the day,\" a message printed and given to the 175,000-member expeditionary force on the eve of the invasion. He had spent weeks carefully drafting the order, which would be distributed to all of the soldiers, sailors and airmen who were to participate. In it, he stated his \"full confidence in [their] courage, devotion to duty and skill in battle.\"\n\nGen. Eisenhower went to visit Allied troops just before they set off to participate in the assault of occupied France on D-Day. He left his headquarters in Portsmouth, England, and first visited the British 50th Infantry Division and then the U.S. 101st Airborne at Newbury; the latter was predicted to suffer 80 percent casualties. After traveling 90 minutes through the ceaseless flow of troop carriers and trucks, his party arrived unannounced to avoid disrupting the embarkation in progress. The stars on the running board of his automobile had been covered, but the troops recognized \"Ike,\" and word quickly spread of his presence. According to his grandson David Eisenhower, who wrote about the occasion in Eisenhower: At War 1943-1945, the general\n\n...wandered through the formless groups of soldiers, stepping over packs and guns. The faces of the men had been blackened with charcoal and cocoa to protect against glare and to serve as camouflage. He stopped at intervals to talk to the thick clusters of soldiers gathering around him. He asked their names and homes. \"Texas, sir!\" one replied. \"Don't worry, sir, the 101st is on the job and everything will be taken care of in fine shape.\" Laughter and applause. Another soldier invited Eisenhower down to his ranch after the war. \"Where are you from, soldier?\" \"Missouri, sir.\" \"And you, soldier?\" \"Texas, sir.\" Cheers, and the roll call of the states went on, \"like a roll of battle honors,\" one observer wrote, as it unfolded, affirming an \"awareness that the General and the men were associated in a great enterprise.\n\nAt half past midnight, as Eisenhower returned to his headquarters at Portsmouth, the first C-47s were arriving at their drop zones, commencing the start of \"The Longest Day.\" During the invasion's initial hours, Eisenhower lacked adequate information about its progress. After the broadcast of his communiqué to the French people announcing their liberation, SHAEF (Supreme Headquarters Allied Expeditionary Force) switchboards were overwhelmed with messages from citizens and political officials. SHAEF communications personnel fell 12 hours behind in transcribing radio traffic. In addition, an Army decoding machine broke down.\n\nAccording to his secretary-chauffeur Kay Summersby, as recounted in David Eisenhower’s book, \"Eisenhower spent most of the day in his trailer drinking endless cups of coffee, 'waiting for the reports to come.' Few did, and so Eisenhower gained only sketchy details for most of the day about the British beaches, UTAH and the crisis at OMAHA, where for several hours the fate of the invasion hung in the balance.\"\n\nDuring the early hours of the D-day Normandy invasion, Eisenhower had sent a message to his superior, Army Chief of Staff Gen. George C. Marshall, in Washington, DC. The statement reflects his lack of information about how well the landings were going, even though they were well under way at that moment. Eisenhower reported that preliminary reports were all \"satisfactory.\" At that time, he had received no official information that the \"leading ground troops are actually ashore.\" The incomplete and unofficial reports, however, were encouraging.\n\nEisenhower's comments concerning the weather speak to the one crucial factor of the invasion over which he held no control. Meteorologists were challenged to accurately predict a highly unstable and severe weather pattern. As he indicated in the message to Marshall, \"The weather yesterday which was [the] original date selected was impossible all along the target coast.\" Eisenhower therefore was forced to make his decision to proceed with a June 6 invasion in the predawn blackness of June 5, while horizontal sheets of rain and gale force winds shuddered through the tent camp. The forecast that the storm would abate proved accurate, as he noted in his message.\n\nEisenhower's pride and confidence in the battle-tempered men he had met the preceding night—men he was about to send into combat—is also evident in his message. He closed on a confident note, describing the steely readiness of the men he sent to battle, recalling the resoluteness in their faces that he termed \"the light of battle...in their eyes.\" This vivid and stirring memory doubtless heartened him throughout the day until conclusive word reached him that the massive campaign had indeed succeeded.\n\nWhen the attack began, Allied troops confronted formidable obstacles. Germany had thousands of soldiers dug into bunkers – defended by artillery, mines, tangled barbed wire, machine guns, and other hazards to prevent landing craft from coming ashore.\n\nThe cost of military and civilian lives lost on D-Day was high. Allied casualties have been estimated at 10,000 killed, wounded, or missing – over 6,000 of those Americans. But by the end of the day, 155,000 Allied troops were ashore and in control of 80 square miles of the French coast. D-Day was a military success, opening Europe to the Allies and a German surrender less than a year later.\n\nThis text was adapted from an article written by David Traill, a teacher at South Fork High School in Stuart, FL, and the article: Schamel, Wynell B. and Richard A. Blondo. \"D-day Message from General Eisenhower to General Marshall.\" Social Education 58, 4 (April/May 1994): 230-232.\n\nAdditional Resources\n\nMaterials created by the National Archives and Records Administration are in the public domain."}, {"url": "https://www.telegraph.co.uk/news/2023/06/06/definitive-story-d-day-lived-tell-tale-anniversary/", "page_content": "This article was initially published 5th June 2019 as part of the 75th anniversary of D-Day. It has an estimated read time of 20 minutes\n\nThe steps were no difficulty for her back then. In June 1944, as a Switchboard Operator recently trained in the new technology of VHF radio, 17-year-old Marie Scott practically skipped down all 350 of them, deep into the tunnels underneath the cliffs of Fort Southwick.\n\nLiving, working and sleeping in the tunnels was not very pleasant: eight-hour watches in a 24-hour duty, then off for a day. For the staff of the Naval Command headquarters just outside Portsmouth, the fetid air and lack of natural light underground meant the steps provided welcome exercise on their way back to the surface.\n\nDay and night meant nothing to Marie and her colleagues: the wireless operators, plotters, planners and telegraphists from across the services, who sat at their stations in the windowless offices or slept in small, cramped rooms on three-tier bunks.\n\nEven so, they knew their hardships were nothing compared to the men they would be speaking to on the other end of their wireless sets. They’d been informed on June 4 that a big operation was planned for the next day, but hadn’t been told why a 24-hour delay meant that it would now be starting on the sixth.\n\nWhatever was happening up there on the surface, in the air and on the sea off the south coast of Britain, the nine WAAFs, Wrens and Auxiliary Territorial Service personnel in Marie’s section knew this was no rehearsal; it was the real thing.\n\n“I grew up on that day,” Mrs Scott says. “I became aware of the reality of war.”\n\n‘Halcyon plus five’: The invasion was on\n\nGeneral Dwight D Eisenhower, Supreme Commander of Allied Expeditionary Forces in Europe, had arrived in Southwick House on June 2 to establish his headquarters for the invasion. Chosen because of its proximity to the port, and to the underground naval command headquarters dug into the cliffs, Southwick House had been requisitioned for the Royal Navy’s navigation school earlier in the war.\n\nThe date for D-Day was dictated by the weather. With a full moon and suitable tide, the period June 4 to 7 was optimal, with a few days from the 18th as Plan B.\n\nIf they didn’t go in June, the next suitable tide was not until September and by then the secret would have undoubtedly slipped out. The Germans knew an invasion was coming - the mass of Allied vehicles, manpower and ships meant it was only a matter of time - but they didn’t know where, and they didn’t know when.\n\nBut there was a problem. The British and American meteorologists had different ways of doing things and couldn’t agree on the most suitable date. The situation was not helped by the fact that James Stagg, Eisenhower’s chief weather adviser and a civilian later given the notional rank of Group Captain in the RAF so as to be more readily accepted by the military, was actually a geophysicist."}, {"url": "https://www.nato.int/cps/en/natohq/topics_50110.htm", "page_content": "SACEUR is responsible for the overall command of NATO military operations. He conducts the necessary military planning for operations, including the identification of forces required for the mission and requests these forces from NATO countries, as authorised by the North Atlantic Council and as directed by the MC. SACEUR analyses these operational needs in cooperation with the Supreme Allied Commander Transformation (SACT).\n\nThe Supreme Commander makes recommendations to NATO's political and military authorities on any military matter that may affect his ability to carry out his responsibilities. For day-to-day business, he reports to the MC, composed of Military Representatives for Chiefs of Defence of NATO member countries. He also has direct access to the Chiefs of Defence and may communicate with appropriate national authorities, as necessary, to facilitate the accomplishment of his tasks.\n\nIn the case of an aggression against a NATO member state, SACEUR, as Supreme Commander, is responsible for executing all military measures within his capability and authority to preserve or restore the security of Alliance territory.\n\nSACEUR also has an important public profile and is the senior military spokesperson for ACO. Through his own activities and those of his public information staff, he maintains regular contacts with the media. He also undertakes official visits to NATO countries and countries where NATO is conducting operations, or with which NATO is developing dialogue, cooperation and partnership.\n\nOther tasks that come under the responsibility of the Supreme Allied Commander Europe include:"}, {"url": "https://warfarehistorynetwork.com/article/general-omar-bradley-dwight-d-eisenhowers-indispensible-lieutenant/", "page_content": "By Cole Kingseed\n\nGreat commanders need great subordinates. In the campaigns in the Mediterranean and European Theaters of World War II, General Dwight D. Eisenhower was ably served by a number of extraordinary officers, including Mark W. Clark, George S. Patton Jr., and Omar Bradley. Each of Ike’s subordinates contributed mightily to Allied victory, but in the final analysis it was the unheralded Bradley who proved to be Ike’s indispensible lieutenant.\n\nOf the four commanders destined to play a leading role in Europe, Eisenhower was the relative newcomer, but by mid-1942, he had surpassed Clark, Patton, and Bradley in Army Chief of Staff George C. Marshall’s estimation. According to historian Martin Blumenson, within six months of Eisenhower’s assumption of command of the European Theater of Operations, U.S. Army, known as ETOUSA, the remaining three settled in as “satellites of Ike.”\n\nEisenhower and Patton: A Close Friendship\n\nAlthough six years Eisenhower’s senior at the United States Military Academy, Patton was Eisenhower’s oldest friend. While Patton captured headlines for his frontline leadership in World War I, Eisenhower was confined to Camp Colt, Pennsylvania, where he trained the fledgling tank corps. Following the war, he and Patton crossed paths at Camp Meade in 1919, where the two developed a lasting friendship. At the time, Eisenhower was an untested warrior, while Patton was a legitimate war hero, having received the Distinguished Service Cross for gallantry in action during the Meuse-Argonne offensive. At Meade, Patton commanded the light tanks of the 304th Brigade, while Eisenhower was second in command of the 305th Brigade, composed of newly manufactured Mark VIII Liberty tanks.\n\nIt was through Patton that Eisenhower met his mentor, General Fox Conner, who asked for the young Eisenhower to serve as his executive officer in Panama. Patton later bragged that, by sharing his notes with Eisenhower in 1925, Eisenhower graduated number one in his class at Fort Leavenworth the following year. Patton and Eisenhower maintained a lively correspondence between the wars, but much of the original correspondence was lost in transit when Eisenhower shipped to the Philippines in 1935.\n\nOn the eve of World War II, Lt. Col. Eisenhower, tired of desk duty, wrote his old friend, soon to be promoted to brigadier general commanding the 2nd Armored Brigade at Fort Benning, Georgia, and requested command of one of Patton’s armored regiments. Patton responded that it seemed highly probable that he [Patton] would be selected for command of one of the next two armored divisions that were being created and that Eisenhower should transfer immediately to the Armored Corps and request assignment with Patton. Patton preferred Ike as his division chief of staff but would support Eisenhower for immediate reassignment if the latter “wanted to take a chance.” Instead of working for Patton, Eisenhower was assigned elsewhere, but their paths crossed briefly in 1941 during the Texas-Louisiana maneuvers of early autumn. One year later, Patton was commanding the Western Task Force that landed at Casablanca during the invasion of North Africa.\n\nMark Clark: Eisenhower’s Second in Command\n\nSecond to Patton in Eisenhower’s esteem before the war was Mark Clark, known to his closest friends as Wayne. Clark was two years Eisenhower’s junior at West Point, but the small size of the corps of cadets allowed familiarity among the classes. Like Patton, Clark was a decorated veteran of the Great War. The two had no contact until 1938 when Eisenhower came to the United States from the Philippines. In October, while en route to his home station, Ike stopped at Fort Lewis, Washington, and saw Clark. The following year, Clark was instrumental in having Eisenhower reassigned to Lewis. Eisenhower reported for duty on New Year’s Day. Two years later, at the conclusion of a series of war games, Clark, now serving on the General Staff, recommended Eisenhower’s assignment to the War Plans Division in the immediate aftermath of Pearl Harbor. Clark’s and Eisenhower’s careers would be inexorably linked for the remainder of the war.\n\nWhen Eisenhower arrived in London in June 1942, he was accompanied by Clark, now in command of II Corps and responsible for training the American divisions now arriving in the United Kingdom. When Patton was designated commander of the western invasion force in North Africa in August, Clark reluctantly accepted Eisenhower’s invitation to relinquish command of his corps and to serve as Ike’s second in command in the capacity of Deputy Supreme Allied Commander. In that role, Clark would be the chief planner for Operation Torch.\n\nOmar Bradley: A Spy in Patton’s Headquarters\n\nBradley, in turn, had the longest relationship with Eisenhower, dating back to their days on the Hudson. Both entered West Point in the summer of 1911, although Bradley was a late arrival. Like Eisenhower, Bradley was a distinguished athlete. While Ike favored football, Bradley excelled in baseball. Both selected infantry as their branch of choice. Prior to graduation, Ike wrote a brief portrait of Bradley in West Point’s yearbook, Howitzer. Ever prescient, even at this early age, Eisenhower opined that Bradley’s most “promising characteristic is ‘getting there,’ and if he keeps up the clip he’s started, some of us will someday be bragging to our grandchildren that, ‘Sure, General Bradley was a classmate of mine.’” Oddly enough, the two future commanders had little, if any, contact in the interwar years.\n\nTheir orbits finally came together in the aftermath of the Casablanca Conference of January 1943. By that time, Marshall had already designated Clark as Fifth Army commander on December 1, 1942, a personal blow to Patton, who coveted army-level command himself. Eisenhower had endorsed Marshall’s selection but noted that even though Patton came “the closest to meeting every requirement made of a commander,” Clark would deliver since Fifth Army was temporarily a training command and the “job was one largely of organization and training and in these fields Clark had no superior.”\n\nEisenhower’s problems worsened in February when Field Marshal Erwin Rommel inflicted a devastating defeat on U.S. forces at Kasserine Pass. Relieving the American corps commander, Eisenhower installed Patton in command of II Corps on March 5, 1943. Patton went to work on rehabilitating II Corps and rectifying the operational situation. To assist Eisenhower, General Marshall dispatched Bradley to North Africa to act as Ike’s “eyes and ears.” Ike immediately made Bradley available to Patton for any duty Patton desired. Not content to have “a spy” in his headquarters, Patton made Bradley his deputy commander.\n\nWithin weeks, Patton led II Corps to its first significant victory in Tunisia. Now that the first offensive phase was completed, Eisenhower nominated Bradley to command II Corps, while Patton returned to his job of preparing the Western Task Force for the invasion of Sicily, now scheduled for July. On July 10, the date of the amphibious landing, Patton’s command was upgraded to army level, and he assumed command of the Seventh Army. Bradley remained in command of II Corps and slogged it up the middle of Sicily while Patton garnered the headlines with his dash to Palermo, then to Messina. It was a brutal campaign that lasted a month, but the Allied victory restored the prestige of the U.S. Army. At the conclusion of Operation Husky, Ike had three lieutenant generals in theater: Clark, Patton, and Bradley in that order of seniority.\n\nThe Rise of Bradley, the Fall of Patton\n\nSicily marked the emergence of Bradley as Eisenhower’s most valued subordinate. Both Bradley and Patton had performed well, and Ike was quick to compliment each on his respective performance. In the midst of the recent campaign, Eisenhower had instructed war correspondent Ernie Pyle to “go and discover Bradley.” In a number of subsequent dispatches, Pyle characterized the less flamboyant Bradley as “the G.I.’s general,” making “no bones about the fact that he was a tremendous admirer” of the II Corps commander. On the eve of the invasion of France in 1944, Pyle recollected that he had spent three days with Bradley in Sicily and did not “believe he had ever known a person to be so unanimously loved and respected by the men around and under him.”\n\nBradley’s ascent mirrored Patton’s fall. In August 1943, the publicity surrounding Patton’s slapping of two soldiers in a field hospital severely tarnished his reputation as a field commander. On August 24, Eisenhower praised Patton’s recent conduct of the campaign, noting that “the operations of the Seventh Army in Sicily are going to be classed as a model of swift conquest by future classes in the War College in Leavenworth.” Then came the caveat. “Now in spite of this, George Patton continues to exhibit some of those unfortunate personal traits of which you and I have always known and which during this campaign caused me some most uncomfortable days.”\n\nRecognizing Patton’s future potential, Ike informed Marshall that Patton “possesses qualities that we cannot afford to lose unless he ruins himself.” Patton was, in Ike’s opinion, a preeminent combat commander. Never slowed by caution, fatigue, or doubt, Patton drove his subordinates ruthlessly, and they in turn “turned in magnificent performances in the late show.” Despite this drive, Patton was apt at times “to display exceedingly poor judgment and unjustified temper.”\n\nIn spite of these character flaws, Eisenhower remained determined to keep Patton on the team. Two weeks later, Eisenhower backed up his assessment by submitting his list for promotion to permanent major general. Describing Patton, Ike noted that, based on his performance to date, Patton’s leadership of the Seventh Army was “close to the best of our classic examples.” In short, Patton was undoubtedly the “best rounded combat leader in our service.”\n\nIn the aftermath of the slapping incidents, however, Ike informed Marshall that under no conditions would he recommend Patton be elevated beyond army-level command. What’s more, Ike assured his chief that “the volatile offensive-minded Patton would always serve under the more even-handed Bradley.”\n\nMark Clark Takes Command of the Italian Campaign\n\nWriting to Marshall, Eisenhower also addressed Clark’s recent performance. Although Clark had not participated in the conquest of Sicily, he remained the “ablest and most experienced officer we have in planning of amphibious operations…. In preparing the minute details of requisitions, landing craft, training of troops and so on, he has no equal in our Army.” Still, Clark was untested in combat and until he received “battle test in high command,” Eisenhower would suspend final judgment.\n\nIke’s endorsement of Clark’s potential was a far cry from his ringing endorsement of Clark on the eve of Operation Torch, when Ike had nominated Clark for the Distinguished Service Medal for his role in a secret mission to negotiate Vichy French support during the upcoming invasion. If Clark was destined for a larger role in the war, he would have to prove it on the battlefield, or those commanders who had experienced combat command [Patton and Bradley] would surely eclipse him.\n\nClark would have his opportunity in September when the Fifth Army invaded the Italian mainland at Salerno. Ike would have the opportunity to observe him there, and nothing indicated that Clark rose to the potential that Ike had anticipated in the early stages of the war. Part of the reason lay in Eisenhower’s subsequent reassignment to command the Allied invasion of France. Despite his close ties to the Mediterranean Theater where he had earned his combat spurs, Ike soon became preoccupied with the greater challenge of planning Operation Overlord.\n\nBradley in Charge of the Invasion of France\n\nBradley, on the other hand, was “running absolutely true to form … possessing brains, a fine capacity for leadership, and a thorough understanding of the requirements of battle.” More important, Bradley “has never caused me one moment of worry.” Summing up his assessment of Bradley, Ike stated that although Bradley lacked some of the extraordinary and ruthless driving power that Patton could exert at critical moments, he still had “such force and determination that even in this characteristic, he was among our best…. He is a jewel to have around.” He informed Marshall that he preferred to keep Bradley in theater, at least temporarily, but Eisenhower soon relented.\n\nPutting personal preferences aside, on August 28, Ike gave Bradley a ringing endorsement and strongly recommended Bradley to head the American army designated for the upcoming invasion of France in 1944. “The truth of the matter,” he informed Marshall, “is that you should take Bradley and, moreover, I will make him available on any date you say.” Bradley received his orders on September 3 and left for England on the 8th. Bradley’s selection over his former chief from North Africa and Sicily was a bitter blow to Patton, almost as bad as when he was informed that Clark would receive command of the Fifth Army.\n\nFor Patton, the fall of 1943 was a period of terrible uncertainty. “I seem to be third choice,” he lamented in his diary, “but I will end up on top.” Perhaps, but Patton owed his diminished status to his temper and lack of control. Had he not slapped those soldiers, it would have been difficult for Eisenhower not to have named him as chief American planner for Overlord, the invasion of France, now scheduled for spring 1944.\n\nJust how far Patton had fallen was evident in Ike’s secret cable to General Marshall on December 23. Having been named supreme commander for the invasion of Northwest Europe two weeks earlier, Eisenhower expressed his opinion that when army group commanders became necessary in France he profoundly hoped to designate an officer who had had combat experience in this war. His preference for army group commander, when more than one American army was operating in Overlord, was Bradley. One of Bradley’s army commanders should be Patton, Ike opined, as “we should not repeat not lose Patton’s services somewhere as an army commander.”\n\nClark Falls Out of Favor\n\nAs for Clark, he remained far detached from the scene. Even before the Overlord commander had been named, the Mediterranean, and Clark by extension, became a secondary theater in the European war. Clark did not help himself by his inept supervision of the amphibious attack at Salerno. The mismanagement of the exploitation phase led Ike to replace the American corps commander on the scene, Maj. Gen. Ernest J. Dawley, in whom neither Ike nor Clark had confidence. Many observers felt Clark should also have been relieved.\n\nIke, too, was dissatisfied with his friend Clark, but firing Clark would have been a public relations disaster. And so, Ike compromised, giving Clark nominal support, but informing Marshall that Clark was “not as good as Bradley in winning, almost without effort, the complete confidence of everyone around him, including his British associates.” Nor was Clark “the equal of Patton in his refusal to see anything but victory … but he is carrying his full weight and, so far, has fully justified his selection for his present important post.” It did not take Marshall long to read between the lines.\n\nTo make matters worse, Clark lacked the thorough understanding of working with allies, an absolute requirement in Eisenhower’s book. In mid-December, Ike chastised Clark for not informing his superior, British General Harold Alexander, of his recent visit to Sicily. Such an oversight, said Eisenhower, gave the perception of discourtesy to Alexander. These “little points of courtesy must be observed with far greater care in an Allied command than in a purely nationalistic one,” cautioned Ike.\n\nBradley and Eisenhower’s Invasion Plans\n\nIke soon followed Bradley to England in January 1944 and immediately assumed his duties as supreme commander. Also arriving later in the month was George Patton, who received command of Third Army. Not destined as the initial assault army, which Bradley was to command, Third Army was designated the follow-up force once the lodgment area reached sufficient size to accommodate two American field armies. At that time, Bradley would be elevated to army group commander.\n\nIn mid-February, Eisenhower received his directive from the Combined Chiefs of Staff to “enter the continent of Europe and to undertake operations, in conjunction with the other United Nations, aimed at the heartland of Germany and the destruction of its armed forces.” February through early June marked intense preparations for D-Day. During that period, Ike increasingly depended on Bradley to plan the American portion of the invasion, while Patton was restricted to public appearances in support of Fortitude, the Allied deception plan designed to convince the Germans that Patton would spearhead the real invasion at Calais.\n\n“World War II’s Odd Couple”\n\nD-Day was one of the most important dates in military history as forces under command of General Eisenhower landed 130,000 soldiers and nearly 15,000 airborne troops. Casualties were excessive, particularly at Omaha Beach, owing in some part to inadequate aerial and naval bombardment. Bradley deserved some of the blame, for he had dismissed several reports from commanders, chiefly Maj. Gen. Charles Corlett, who had amphibious experience in the Pacific. In spite of the setbacks, Ike’s forces were ashore and they meant to stay.\n\nThe subsequent battle of the lodgment area and the stalemate in Normandy found Eisenhower frustrated with his principal land subordinates, Bernard Montgomery and Omar Bradley. Ike reserved his harshest criticism for Monty, whose failure to take Caen on D-Day, a highly unrealistic objective, soon led to stalemate on the eastern flank of the invasion area. Bradley, too, was stymied until late July, when his brilliantly conceived Operation Cobra ruptured the German defense at St. Lo and led to the American breakthrough in Normandy. One week later, Ike activated Third Army headquarters in France, and Patton spearheaded the breakout that eventually reached the French capital on August 25.\n\nFrom Normandy to the German border, Eisenhower had nothing but praise for Bradley and Patton. Bradley, ever cautious but utterly dependable in Ike’s opinion, directed the American portion of Ike’s broad front advance to the German frontier. That campaign contributed to the continued dissolution of his relationship with Patton. Bradley and Patton were never close friends, but both realized that they owed much of their respective success to the other. Historian Blumenson characterized their relationship as “World War II’s Odd Couple.” He was undoubtedly correct, for neither commander liked the other.\n\nHad Bradley had his way, Patton would not have commanded an army in the European Theater. Bradley considered Patton profane, vulgar, too independent, and not a team player. For his part, Patton thought Bradley was overly cautious, indecisive at critical moments, and lacking the resolve to follow through when the operational opportunity presented itself. Moreover, Bradley did his best to publicize the efforts of his other army-level commanders to the detriment of Patton. Lt. Gen. Courtney Hodges, who succeeded Bradley in command of First U.S. Army, received the highest praise from Bradley, who always considered Patton not much more than a publicity hound.\n\nThe Battle of the Bulge: Patton’s Brilliance, Bradley’s Blunder\n\nBy mid-December, the Allied advance approached the Rhine River. The German counteroffensive in the Ardennes on December 16 produced Bradley’s worst moment and Patton’s most brilliant campaign. The massive enemy attack caught Eisenhower’s headquarters by complete surprise. In an effort to coordinate the Allied response, Ike transferred all forces north of the bulge to Montgomery’s command, a move that Bradley interpreted as “the worst possible mistake Ike could have made.” It was the right move on the supreme commander’s part, but Bradley’s feelings were hurt. Fortunately, George Patton’s brilliant turn north relieved the pressure on the southern side of the Bulge and broke the encirclement of Bastogne.\n\nTo assuage Bradley’s feeling of demotion, Ike cabled Marshall on December 21 and requested that the chief of staff consider elevating Bradley to four-star rank. Despite internal criticism of Bradley’s delayed reaction to the enemy’s attack, Ike noted that “Bradley has kept his head magnificently and has proceeded methodically and energetically to meet the situation.” Knowing that Marshall had heard of inter-Allied criticism, Ike assured his chief, “In no quarter is there any tendency to place any blame upon Bradley. I retain all my former confidence in him.” Since Congress was not currently in session, Bradley’s promotion was delayed until March 1945.\n\nAt the conclusion of the Battle of the Bulge, Eisenhower took stock of the relative merits of each of his American commanders to that point of the war. Confiding in his personal diary, the supreme commander compiled an order of merit for 38 officers based primarily upon his conclusions as to the value of services each officer had rendered in the war and only secondarily upon his opinion as to his qualifications for future usefulness. It was apparent that Ike still valued the services of his three principal subordinates at the beginning of the war.\n\nOn the Top of Ike’s List\n\nEven prior to the final push into the heartland of Germany, Eisenhower confirmed that Bradley had eclipsed both Patton and Clark. Bradley’s other army-level commanders ranked farther down the list. Ike rated Bradley first, listing his outstanding characteristics as “quiet, but magnetic leader; able, rounded field commander; determined and resourceful; modest.” Patton appeared fourth on Eisenhower’s order of merit, with his principal qualifications being “dashing fighter, shrewd, courageous.” Next was Clark, as “clever, shrewd, capable; splendid organizer.” The officers whom Bradley sought to advance in Ike’s estimation at Patton’s expense were far distant from the flamboyant Third Army commander.\n\nHow much did Eisenhower value Bradley by the end of the war? Following the official deactivation of Supreme Headquarters, Allied Expeditionary Force at midnight, July 13, 1945, Ike penned a rather formal letter of appreciation of their services to all his former principal subordinates in the Allied organization.\n\nTo Bradley he wrote, “In my opinion, you are pre-eminent among the Commanders of major battle units in this war. Your leadership, forcefulness, professional capacity, selflessness, high sense of duty and sympathetic understanding of human beings, combine to stamp you as one of America’s great leaders and soldiers.” The former supreme commander signed the message “From your old friend.” No greater tribute could be paid to the “G.I. General.”\n\nCole Kingseed is a retired United States Army colonel. He resides in New Windsor, New York.\n\nBack to the issue this appears in"}, {"url": "https://history.stackexchange.com/questions/42130/why-was-eisenhower-chosen-to-be-supreme-allied-commander-in-europe", "page_content": "Dwight D. Eisenhower \"Ike\", graduated from West Point in 1915 ranked 61st in a class of 164 better known for his abilities on the football field than in the classroom. Upon graduation from West Point he seriously considered a civilian life, rather than pursuing a commission. He spent WWI in the United States in a logistics position, and was not sent to Europe. In the interwar period he again considered leaving the military and a career which he considered at a dead end.\n\nAt the beginning of WWII his rank was lieutenant colonel. When his friend George Patton was given a field command, Eisenhower asked for a position on Patton's staff which was denied by United States Army Chief of Staff George Marshal.\n\nThe position George Marshal ultimately appointed Ike to was Supreme Allied Commander Europe (Eisenhower was appointed December 1943), an advancement over nearly 400 more senior officers.\n\nMy question is: Why was Ike, with no combat experience, chosen to lead? How had he transformed his career from logistical support to the fast track during peace time? Were their any specific postings, commanding officers, personal decisions which were instrumental in this transformation? Where had he first come to the attention of George Marshall?\n\nFrom Jos in the Comments:\n\nThe idea that (in the above question) a mediocre ltn-col is told he's in the running for the 5 star general position is preposterous.\n\nThere were actually two occasions where Eisenhower was nearly placed on Patton's staff. Both times Marshal interceded. The first time was Sept 1940 the second time was April 1942.\n\nThe first occassion, Patton asked Ike if he would be interested in a subordinate command position.\n\nGeneral Ike: A Personal Reminiscence by John Eisenhower page 46-47\n\nPatton had no intention of remaining a brigadier general, however, nor did his friend George Marshal, Chief of Staff, intend that he do so. By Sept of 1940 Patton was daily expecting to take command of the entire 2d Armored Division, not just a single brigade. In the process of finding officers to staff his new command he wrote to Ike, his old friend from twenty years earlier, suggesting that the latter request transfer from the Infantry to the Armored Corps, specifically to Patton's 2d Armored Division. Ike was pleased and flattered. At the time his sights were set only on commanding a regiment in the coming war, and an armored regiment sounded even more exciting than the 15th Infantry. He responded immediately and enthusiastically. \"I suppose it's too much to hope that I could have a regiment in your division,\" he (Eisenhower) wrote, \"because I'm still almost three years away from my colonelcy. But I think I could do a damn good job of commanding a regiment.\" two weeks later Patton followed up with word he would request Ike as chief of staff. Patton finishes his letter with the flourish: \"Hoping we are together in a long and BLOODY war.\" The exchange, of coarse, came to nothing, because Ike's services were considered too important at other, higher echelons--successively as chief of staff at 3d Infantry Division, IX Corps.\n\nThe Second Time was in April of 1942\n\nTwo Generals Apart: Patton and Eisenhower\n\nPatton and Eisenhower's next meeting came in April of 1942. Prior to this meeting, both men competing for the same position as commander of the European campaign, a position which Eisenhower later received. Before he received this position Eisenhower wanted to do something different. He wanted to join his old friend, who was to go to war while Eisenhower was sitting in a desk job. Eisenhower wrote to Patton, \"Maybe I'll finally get out of this slave seat, so I can let loose a little with you. By that time you'll be the ‘black jack' of the damn war.\" Eisenhower wanted to join Patton on the front lines. He was hoping he would be sent there by Army Chief of Staff, George Marshall (1880-1959), however, he was given the rank of Major General and the position of the United States Commander of the European front (June of 1942).\n\nEisenhower would be advanced to Supreme Allied Commander Europe Dec 1943."}, {"url": "https://www.britannica.com/event/Normandy-Invasion", "page_content": "Normandy Invasion , also called Operation Overlord or D-Day , during World War II , the Allied invasion of western Europe , which was launched on June 6, 1944 (the most celebrated D-Day of the war), with the simultaneous landing of U.S. , British , and Canadian forces on five separate beachheads in Normandy , France . By the end of August 1944 all of northern France was liberated, and the invading forces reorganized for the drive into Germany , where they would eventually meet with Soviet forces advancing from the east to bring an end to the Nazi Reich .\n\nPlanning, 1941–43\n\nOperation Overlord Henri Giraud, Franklin D. Roosevelt, Charles de Gaulle, and Winston Churchill; Casablanca Conference The decision taken at Tehrān was a final indication of American determination to stage the cross-Channel invasion; it was also a defeat for Alan Brooke, Churchill’s chief of staff and the principal opponent of premature action. Yet despite Brooke’s procrastination, the British had in fact been proceeding with structural plans, coordinated by Lieut. Gen. Frederick Morgan, who had been appointed COSSAC (chief of staff to the supreme Allied commander [designate]) at the Anglo-American Casablanca Conference in January 1943. His staff’s first plan for Operation Overlord (as the invasion was henceforth to be known) was for a landing in Normandy between Caen and the Cotentin Peninsula in a strength of three divisions, with two brigades to be air-dropped. Another 11 divisions were to be landed within the first two weeks through two artificial harbours that would be towed across the Channel. Once a foothold had been established, a force of a hundred divisions, the majority shipped directly from the United States, were to be assembled in France for a final assault on Germany. In January 1944 Eisenhower became supreme Allied commander, and the COSSAC staff was redesignated SHAEF (Supreme Headquarters Allied Expeditionary Force)."}, {"url": "https://www.thoughtco.com/field-marshal-bernard-montgomery-2360162", "page_content": "Bernard Montgomery (November 17, 1887–March 24, 1976) was a British soldier who rose through the ranks to become one of the most important military leaders of World War II. Known to be difficult to work with, \"Monty\" was nevertheless exceptionally popular with the British public. He was rewarded for his service with promotions to Field Marshal, Bridgadier General, and Viscount.\n\nFast Facts: Bernard Montgomery Known For : Top military commander during World War II\n\n: Top military commander during World War II Also Known As : Monty\n\n: Monty Born : November 17, 1887 in London, England\n\n: November 17, 1887 in London, England Parents : The Reverend Henry Montgomery, Maud Montgomery\n\n: The Reverend Henry Montgomery, Maud Montgomery Died : March 24, 1976 in Hampshire, England\n\n: March 24, 1976 in Hampshire, England Education : St. Paul’s School, London, and the Royal Military Academy (Sandhurst)\n\n: St. Paul’s School, London, and the Royal Military Academy (Sandhurst) Awards and Honors: Distinguished Service Order (after being wounded in WWI); after WWII, he received the Knight of the Garter and was created 1st Viscount Montgomery of Alamein in 1946\n\nDistinguished Service Order (after being wounded in WWI); after WWII, he received the Knight of the Garter and was created 1st Viscount Montgomery of Alamein in 1946 Spouse : Elizabeth Carver\n\n: Elizabeth Carver Children : John and Dick (stepsons) and David\n\n: John and Dick (stepsons) and David Notable Quote: \"Every soldier must know, before he goes into battle, how the little battle he is to fight fits into the larger picture, and how the success of his fighting will influence the battle as a whole.\"\n\nEarly Life\n\nBorn in Kennington, London in 1887, Bernard Montgomery was the son of Reverend Henry Montgomery and his wife Maud, and the grandson of noted colonial administrator Sir Robert Montgomery. One of nine children, Montgomery spent his early years at the family's ancestral home of New Park in Northern Ireland before his father was made Bishop of Tasmania in 1889. While living in the remote colony, he endured a harsh childhood that included beatings by his mother. Largely educated by tutors, Montgomery seldom saw his father, who frequently traveled due to his post. The family returned to Britain in 1901 when Henry Montgomery became secretary of the Society for the Propagation of the Gospel. Back in London, the younger Montgomery attended St. Paul's School before entering the Royal Military Academy at Sandhurst. While at the academy, he struggled with discipline issues and was nearly expelled for rowdiness. Graduating in 1908, he was commissioned as a second lieutenant and assigned to the 1st Battalion, Royal Warwickshire Regiment.\n\nWorld War I\n\nSent to India, Montgomery was promoted to lieutenant in 1910. Back in Britain, he received an appointment as battalion adjutant at the Shorncliffe Army Camp in Kent. With the outbreak of World War I, Montgomery deployed to France with the British Expeditionary Force (BEF). Assigned to Lieutenant General Thomas Snow's 4th Division, his regiment took part in the fighting at Le Cateau on August 26, 1914. Continuing to see action during the retreat from Mons, Montgomery was badly wounded during a counterattack near Méteren on October 13, 1914. He was hit through the right lung by a sniper before another round struck him in the knee.\n\nAwarded the Distinguished Service Order, he was appointed as a brigade major in the 112th and 104th Brigades. Returning to France in early 1916, Montgomery served as a staff officer with the 33rd Division during the Battle of Arras. The following year, he took part in the Battle of Passchendaele as a staff officer with IX Corps. During this time he became known as a meticulous planner who worked tirelessly to integrate the operations of the infantry, engineers, and artillery. As the war concluded in November 1918, Montgomery held the temporary rank of lieutenant colonel and was serving as chief of staff for the 47th Division.\n\nInterwar Years\n\nAfter commanding the 17th (Service) Battalion of the Royal Fusiliers in the British Army of the Rhine during the occupation, Montgomery reverted to the rank of captain in November 1919. Seeking to attend the Staff College, he persuaded Field Marshal Sir William Robertson to approve his admission. Completing the course, he was again made a brigade major and assigned to the 17th Infantry Brigade in January 1921. Stationed in Ireland, he took part in counter-insurgency operations during the Irish War of Independence and advocated taking a hard line with the rebels. In 1927, Montgomery married Elizabeth Carver and the couple had a son, David, the following year. Moving through a variety of peacetime postings, he was promoted to lieutenant colonel in 1931 and rejoined the Royal Warwickshire Regiment for service in the Middle East and India.\n\nReturning home in 1937, he was given command of the 9th Infantry Brigade with the temporary rank of brigadier. A short time later, tragedy struck when Elizabeth died from septicemia following an amputation caused by an infected insect bite. Grief-stricken, Montgomery coped by withdrawing into his work. A year later, he organized a massive amphibious training exercise that was praised by his superiors, which led to his promotion to major general. Given command of the 8th Infantry Division in Palestine, he put down an Arab revolt in 1939 before being transferred to Britain to lead the 3rd Infantry Division. With the outbreak of World War II in September 1939, his division was deployed to France as part of the BEF. Fearing a disaster similar to 1914, he relentlessly trained his men in defensive maneuvers and fighting.\n\nIn France\n\nServing in General Alan Brooke's II Corps, Montgomery earned his superior's praise. With the German invasion of the Low Countries, the 3rd Division performed well and, following the collapse of the Allied position, was evacuated through Dunkirk. During the final days of the campaign, Montgomery led II Corps as Brooke had been recalled to London. Arriving back in Britain, Montgomery became an outspoken critic of the BEF's high command and began a feud with the commander of Southern Command, Lieutenant General Sir Claude Auchinleck. Over the next year, he held several posts responsible for the defense of southeastern Britain.\n\nNorth Africa\n\nIn August 1942, Montgomery, now a lieutenant general, was appointed to command the Eighth Army in Egypt following the death of Lieutenant-General William Gott. Serving under General Sir Harold Alexander, Montgomery took command on August 13 and began a rapid reorganization of his forces and worked to reinforce the defenses at El Alamein. Making numerous visits to the front lines, he diligently endeavored to raise morale. In addition, he sought to unite land, naval, and air units into an effective combined arms team.\n\nAnticipating that Field Marshal Erwin Rommel would attempt to turn his left flank, he strengthened this area and defeated the noted German commander at the Battle of Alam Halfa in early September. Under pressure to mount an offensive, Montgomery began extensive planning for striking at Rommel. Opening the Second Battle of El Alamein in late October, Montgomery shattered Rommel's lines and sent him reeling east. Knighted and promoted to general for the victory, he maintained pressure on Axis forces and turned them out of successive defensive positions, including the Mareth Line in March 1943.\n\nSicily and Italy\n\nWith the defeat of Axis forces in North Africa, planning began for the Allied invasion of Sicily. Landing in July 1943 in conjunction with Lieutenant General George S. Patton's U.S. Seventh Army, Montgomery's Eighth Army came ashore near Syracuse. While the campaign was a success, Montgomery's boastful style ignited a rivalry with his flamboyant American counterpart. On September 3, the Eighth Army opened the campaign in Italy by landing in Calabria. Joined by Lieutenant General Mark Clark's U.S. Fifth Army, which landed at Salerno, Montgomery began a slow, grinding advance up the Italian peninsula.\n\nD-Day\n\nOn December 23, 1943, Montgomery was ordered to Britain to take command of the 21st Army Group, which comprised all of the ground forces assigned to the invasion of Normandy. Playing a key role in the planning process for D-Day, he oversaw the Battle of Normandy after Allied forces began landing on June 6. During this period, he was criticized by Patton and General Omar Bradley for his initial inability to capture the city of Caen. Once taken, the city was used as the pivot point for the Allied breakout and crushing of German forces in the Falaise pocket.\n\nPush to Germany\n\nAs most of the Allied troops in Western Europe rapidly became American, political forces prevented Montgomery from remaining Ground Forces Commander. This title was assumed by the Supreme Allied Commander, General Dwight Eisenhower, while Montgomery was permitted to retain the 21st Army Group. In compensation, Prime Minister Winston Churchill had Montgomery promoted to field marshal. In the weeks following Normandy, Montgomery succeeded in convincing Eisenhower to approve Operation Market-Garden, which called for a direct thrust toward the Rhine and Ruhr Valley utilizing large numbers of airborne troops. Uncharacteristically daring for Montgomery, the operation was also poorly planned, with key intelligence about the enemy's strength overlooked. As a result, the operation was only partially successful and resulted in the destruction of the 1st British Airborne Division.\n\nIn the wake of this effort, Montgomery was directed to clear the Scheldt so that the port of Antwerp could be opened to Allied shipping. On December 16, the Germans opened the Battle of the Bulge with a massive offensive. With German troops breaking through the American lines, Montgomery was ordered to take command of U.S. forces north of the penetration to stabilize the situation. He was effective in this role and was ordered to counterattack in conjunction with Patton's Third Army on January 1, with the goal of encircling the Germans. Not believing his men were ready, he delayed two days, which allowed many of the Germans to escape. Pressing on to the Rhine, his men crossed the river in March and helped encircle German forces in the Ruhr. Driving across northern Germany, Montgomery occupied Hamburg and Rostock before accepting a German surrender on May 4.\n\nDeath\n\nAfter the war, Montgomery was made commander of the British occupation forces and served on the Allied Control Council. In 1946, he was elevated to Viscount Montgomery of Alamein for his accomplishments. Serving as Chief of the Imperial General Staff from 1946 to 1948, he struggled with the political aspects of the post. Beginning in 1951, he served as deputy commander of NATO's European forces and remained in that position until his retirement in 1958. Increasingly known for his outspoken views on a variety of topics, his postwar memoirs were severely critical of his contemporaries. Montgomery died on March 24, 1976, and was buried at Binsted."}, {"url": "https://www.history.com/this-day-in-history/eisenhower-assumes-command-of-u-s-troops-in-europe", "page_content": "On June 25, 1942, General Dwight D. Eisenhower becomes commander of all U.S. troops in the European theater of World War II, continuing the steady ascent in military rank that would culminate in his appointment as supreme Allied commander of all forces in Europe in 1943. As U.S. commander, Ike developed diplomatic skills that he would later employ as America’s 34th president.\n\nU.S. Army military historians Carl Vuono and M.P.W. Stone have described Eisenhower as a dynamic leader who successfully planned and oversaw military strategy in a complex global environment. These qualities came in handy when Eisenhower was elected president in 1952. The Cold War between democratic and communist nations was in full swing and Eisenhower’s ability to form cooperative relationships, his military experience and calm demeanor reassured anxious Americans.\n\nIke attended the U.S. Military Academy at West Point from 1911 to 1915, where he cultivated friendships with future generals Omar Bradley, James A. Van Fleet and Joseph T. McNarney. After graduating, Eisenhower served in relative obscurity stateside and in Panama, rising to the rank of lieutenant colonel. He went to the Army War College in 1928 and a year later worked as an assistant in the secretary of war’s office. In 1935, he served as an assistant to General Douglas MacArthur in the Philippines. With war with Japan seeming imminent, Eisenhower returned to the states in 1941 to become a brigadier general in the Third Army. Between February and June 1942, Eisenhower was assigned to the War Department and rose rapidly within its ranks. As the leading general of the U.S. forces in Europe, Eisenhower was directly involved with planning and executing U.S. military strategy in the fight to liberate Europe from Germany and fascist Italy.\n\nIn November 1942, Eisenhower went on to become the commander of all Allied forces in North Africa, where he led the successful invasions of Sicily and Italy and dealt with irascible British General Bernard Montgomery and exiled French leader Charles de Gaulle. A year later he was appointed supreme commander of Allied Expeditionary Forces and planned and led the invasion of Normandy, France, more commonly referred to as D-Day. Eisenhower stayed on as general of the U.S. Army until 1951, when he resigned his commission to run his successful campaign for president. For two terms, Ike the war hero presided as the nation’s commander in chief.\n\nIn a speech he gave upon leaving office in 1961, Eisenhower famously warned Americans of the growing power of what he termed the military-industrial complex, or the potential for danger that existed from the relation of the nation’s commercial and military interests."}, {"url": "https://www.bbc.co.uk/history/historic_figures/eisenhower_dwight.shtml", "page_content": "Eisenhower was the supreme Allied commander in Europe in World War Two and later 34th president of the United States.\n\nDwight David Eisenhower, nicknamed 'Ike', was born in Denison, Texas on 14 October 1890 and brought up in Kansas.\n\nEisenhower graduated from the US Military Academy at West Point in 1915. He served in the army through the 1920s and 1930s, including a posting to the Philippines in the late 1930s.\n\nShortly after the United States entered World War Two, Eisenhower went to work in Washington, where he impressed the chief of staff General George C Marshall. In June 1942, he was appointed commanding general in the European theatre. This was later extended to include the Mediterranean and North Africa. In February 1944, he was named the supreme commander of the Allied expeditionary forces in Western Europe. He oversaw the successful Allied assault on the coast of Normandy in June 1944 and the Allied liberation of western Europe. On 7 May 1945 he accepted Germany's surrender and then commanded the US occupation zone in Germany.\n\nIn November 1945, Eisenhower returned to the US as army chief of staff. He was made president of Columbia University in 1948, but in December 1950 left to become supreme commander of NATO forces in Europe.\n\nIn 1952, the popularity which Eisenhower had gained during the war helped him win the Republican nomination for presidency and then the presidency itself. His time in office was dominated by the Cold War. In July 1953, he agreed to an armistice to end the fighting in Korea. He also guaranteed US protection for South Vietnam. In 1956, Eisenhower surprised Britain and France by refusing to back them in the Suez crisis.\n\nAt home, Eisenhower expanded social security provision and instigated the interstate highway system, the largest construction project in history. He was criticised for failing to publicly condemn Senator Joseph McCarthy for his anti-communist 'witchhunt'. However, he worked behind the scenes to erode McCarthy's influence. He signed significant civil rights legislation, but appeared to dislike confronting racial issues.\n\nEisenhower was re-elected in November 1956. During his last years in office, he hoped to improve US-Soviet relations and negotiate a nuclear test ban treaty. But in May 1960 the Soviets shot down an American U2 spy plane over their territory, which ended any hope of better relations before Eisenhower left office. He retired at the end of his second term in January 1961. He died in Washington DC on 28 March 1969."}]}