{"Cindy Kleine has written for television.": [{"url": "https://cindykleine.com/bio/index.html", "page_content": "Filmmaker Cindy Kleine’s prolific career began when she was an undergraduate at The Museum School and the legendary MIT Film/Video Section, studying with Richard Leacock, influenced by visiting filmmakers Robert Frank and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of family dramas, including the acclaimed features, André Gregory: Before and After Dinner, a personal portrait of her renowned theatre director husband, and Phyllis and Harold, an intense probe of her parents' disastrous fifty-nine year marriage. In her short films Kleine has made friends and artists her subjects: The Starn Twins in Doug and Mike, Mike and Doug, outsider artists in Inside Out, and grad school colleagues in Holy Matter, and she's explored the mysteries and foibles of romantic love in poetically framed psychodramas Secrets of Cindy and Passage.\n\nKleine's films have been exhibited at many international festivals including Telluride, Seattle, San Francisco, Boston, Vancouver, Santa Fe, DokLeipzig, and Provincetown, and in theatres and museums such as Film Forum, The Walter Reade Theater at Lincoln Center and Anthology Film Archives in NYC, The Music Hall in Los Angeles, The Museum of Fine Arts and The Coolidge Corner Theatre in Boston, The ICA in London and The Center d'art Contemporain in Lyon, France. Her film, Doug and Mike, Mike and Doug was broadcast on PBS's POV Film Series.\n\nKleine has received awards and fellowships from The American Film Institute, The Iowa Independent Film Festival, The Jewish Eye (Israel), The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School and The New School for Social Research.\n\nAlongside her film career, Kleine has continued to paint, and for the last several years has been working in still photography. Several bodies of that work are represented in the ARTWORK section.\n\n↓ Download CV"}, {"url": "https://www.npr.org/templates/story/story.php?storyId=123783187", "page_content": "The Loveless Marriage Of 'Phyllis And Harold'\n\nEnlarge this image toggle caption Cindy Kleine Cindy Kleine\n\nPhyllis and Harold Director: Cindy Kleine\n\nGenre: Documentary\n\nRunning Time: 85 minutes Not rated\n\nWatch A Clip 'Phyllis Finds Her Lover Again' Media no longer available\n\nParents are going to have their lives dissected on-screen for as long as they insist on giving birth to filmmakers. So it's no surprise that Phyllis and Harold, the engrossing documentary Cindy Kleine has dredged up from the \"black hole\" of her youth, centers on her eponymous parents' miserable 59-year marriage.\n\nThe details of that union are decently startling as Kleine, after wondering aloud \"who these people are and why they're together,\" shows us the who and why in faintly unnerving bits and snatches.\n\nPersonalities are forefronted. Mom's a tad dyspeptic, but essentially nonconfrontational when her hubby's in the room (she's franker when he's elsewhere), while clueless Dad seems to lack the introspection gene entirely.\n\nKleine queries them about their life together, illustrating their recollections of family (unhappy), suburbia (matter-of-fact) and international travel (buoyant) with the photos and home movies Harold evidently shot incessantly. When a box of old correspondence surfaces from the depths of a closet, she records her parents' astonishment as they read aloud from decades-old love letters they'd long since forgotten writing each other.\n\nEnlarge this image toggle caption Cindy Kleine Cindy Kleine\n\nThey often seem to be talking about entirely different marriages in the film's early passages, and as their stories pile up, you realize that that's essentially what they've lived. In fact, almost from the start, their relationship was the sort of slow-motion train wreck that's at once hard to watch and harder to tear your eyes from. Looking away becomes even less likely once Kleine starts interviewing her parents separately, and you realize just how big a gulf has separated them for close to six decades.\n\nHarold mostly remains oblivious to what his controlling, stubborn nature did to the household, while Phyllis talks a blue streak about her frustration at having \"settled\" for a loveless, claustrophobic, stifling marriage, without ever seeming to have considered working with her husband to make the relationship work.\n\nThe film explores one big reason it didn't: Phyllis admits to a five-year workplace affair at about the time they got married (of which Harold remained blithely unaware; he describes that period of his life as his \"golden years\") — and her daughter then films a late-in-life coda involving the other man. As if all that weren't enough sturm und drang for one documentary, the director piles on with stories of being traumatized when her mother blurted the details to her when she was still a teenager wrestling with her own romances.\n\nThe one-upsmanship gets a little wearing. On occasion, it makes this domestic documentary seem more like group therapy than entertainment. Still, it's generally compelling and always watchable."}, {"url": "http://archive.boston.com/ae/movies/articles/2010/07/18/her_documentary_is_a_family_drama_in_the_truest_sense/", "page_content": "It was Gregory who encouraged Kleine to submit “ ’Til Death Do Us Part’’ to film festivals and, after some success, urged her to expand it into a feature. Kleine labored over “Phyllis and Harold’’ for a dozen years, knowing it could not be released until after her father’s death (he died suddenly in 2003) since it reveals a family secret that she felt would have been too painful for him to see. Unlike the rapport and shared interests so evident between Kleine and Gregory, Phyllis and Harold seemed to exist as strangers in separate marriages. He was a hard-working dentist who escaped the poverty of New York’s Lower East Side and thought his wife a “wonderful woman.’’ She was a fashionable beauty and a frustrated artist who felt she’d married the wrong man for the wrong reasons. The irony, Gregory points out, is that Harold’s prolific home movies and thoughtful photographs reveal “a creative man’’ who may have been more interesting than the “vulgar dentist’’ his unhappy wife perceived.\n\n“I saw ‘ ’Til Death Do Us Part’ as a blur because we were making out in the editing room,’’ laughs Gregory, sipping tea with Kleine in their Truro home (they divide their time between New York City and Cape Cod). Surrounded by wildflowers, the house is spacious but understated: books line the walls, a litter box sits in the hall. (“I don’t have kids; I have cats,’’ says Kleine. Gregory has a grown son from his first marriage.) The couple talk about what movie they’ll see over the weekend — perhaps Tilda Swinton’s “I Am Love,’’ a recent favorite that begs to be revisited on a bigger screen. Angular and full of easy charm at age 76, Gregory excuses himself to prepare for a phone call from friend and frequent collaborator Wallace Shawn; he’s planning to direct three of Shawn’s plays at New York’s Public Theater next year. Kleine, 52, seems the more reserved of the pair, but she’s engaging and animated when talking about the labor of love that was “Phyllis and Harold.’’\n\nKleine has been married for 12 years to director, playwright, and actor Andre Gregory, who produced the film (the pair will engage in a post-screening discussion with the audience July 25 at 3 p.m.). Her parents have hovered over the relationship from the start. Gregory recalls that when they met, Kleine was finishing “ ’Til Death Do Us Part,’’ her 1998 short film about her parents that served as a precursor to “Phyllis and Harold.’’\n\nPerhaps her own happy marriage provided filmmaker Cindy Kleine with the prism through which to view her parents’ “hideous’’ one. That’s Kleine’s description of the late Phyllis and Harold Kleine’s 59-year union, one that she’s chronicled with journalistic inquisitiveness and no small dose of humor in the documentary “Phyllis and Harold’’ (it opens Friday at the Coolidge Corner Theatre). As Kleine digs beneath the façade of her middle class, Jewish, Long Island upbringing to reveal deceit, delusion, and denial, “Phyllis and Harold’’ plays like Ingmar Bergman’s “Scenes From a Marriage’’ starring Tennessee Williams-esque characters.\n\n“Phyllis and Harold’’ fits in with a spate of recent documentaries such as “51 Birch Street,’’ “Must Read After My Death,’’ “Capturing the Friedmans,’’ and “Crazy Love’’ that probe the darker side of post-World War II suburban, middle-class families. For a generation of filmmakers now hitting middle age, it should be no surprise that they would look close to home, at ordinary lives that often hid extraordinary family secrets. It’s also a generation that’s fast disappearing.\n\n“They are all gone,’’ says Kleine of her parents and their peers. “If I hadn’t told it, no one would know their story. I am endlessly fascinated by the mystery of life — the hope of youth; then you are old and dead in the blink of an eye.’’ Her film uses her father’s photographs and home movies, on-camera commentary by Kleine herself, and interviews with Kleine’s older sister, Erica “Ricky’’ Kleine. As with many dysfunctional families, Kleine points out that Ricky’s perspective on their childhood is quite different from her own. The sisters were not close as children, but as they matured, and through the filmmaking process, they forged a bond. “We remember different parents. But she loves the film,’’ says Cindy Kleine. “I think it helped her; it objectified the situation so now we can laugh at it.’’\n\nFor Gregory, who confesses to seeing his wife’s film “70 or 80 times,’’ the personal story speaks to a generation of marriages. “I love the way it depicts many couples of that generation, where the women married men for security — there were not many alternatives — and then felt trapped and lived in contempt of these men,’’ he says. “Being older myself, I am also deeply moved by the pathos of these young people becoming old, the changing geography of the face. Having had a mother and a father who were raging narcissists, I was fascinated by Phyllis’s narcissism and her willingness to spill the beans.’’\n\nFor Kleine, delving into the personal for raw material is how she learned filmmaking. She studied with influential documentary film pioneer Richard Leacock and Glorianna Davenport, cofounder of the MIT Media Lab, during the heyday of the now defunct MIT Film/Video Section in the late 1970s. Kleine, who eventually earned her BFA from Tufts University, was a student at the School of the Museum of Fine Arts when she began taking film classes at MIT in an exchange program. “I holed up there and spent a lot of time. I remember a two-week documentary workshop with Robert Frank — I never knew he made films. It was an amazing time and an amazing community.’’ Besides Davenport and Leacock, Kleine credits instructor John Gianvito, who would go on to program the Harvard Film Archive and direct several acclaimed films, with influencing a generation of film students. “His film history courses exposed me to European cinema, especially the work of [Russian director Andrei] Tarkovsky,’’ she says.\n\nThe story of her parents’ marriage may be behind her, but Kleine is about to tackle another film memoir, this time collaborating with her husband. The couple just returned from Gregory’s hometown of Los Angeles where they shot footage for a documentary about Gregory’s family and its influence on his life and work.\n\n“I have no problem talking, as you might have gathered,’’ says Gregory, whose musings across a table with Wally Shawn turned “My Dinner With Andre’’ into an unlikely indie smash in 1981. “I love examining personal relationships even when it’s in public.’’\n\n“Andre lights up when the camera goes on,’’ adds Kleine.\n\n“Phyllis and Harold’’ hit the festival circuit after a successful screening as part of the Boston Jewish Film Festival in November 2008. That led to international bookings and a recent DVD release. But for Kleine, the success is bittersweet. Phyllis Kleine died in 2006 and never saw the film’s final cut.\n\n“Every time I go to an opening and see the title on the marquee, I think how much my mother would have loved it. The film is critical of her, but she wouldn’t see it that way at all,’’ says Kleine. “She would see it as a homage; she’d be thrilled people were paying such close attention to her.’’\n\nLoren King can be reached at loren.king@comcast.net.\n\n© Copyright 2010 Globe Newspaper Company."}, {"url": "https://www.nytimes.com/2010/02/19/movies/19phyllis.html", "page_content": "Whenever the filmmaker Cindy Kleine pondered her parents’ quarrelsome, 59-year marriage, her most frequent thought was, “What are they doing together?” Hoping that movie audiences would be equally inquisitive, Ms. Kleine embarked on a 12-year journey through photographs and home movies, love letters and long-kept secrets to produce “Phyllis and Harold,” an impossibly self-involved portrait of a union far more commonplace than its offspring seem to believe.\n\nOnly when interviewing her parents separately in their Long Island home and eliciting wildly different descriptions of the early years of their marriage (“I was always angry.” “That was a wonderful time in my life.”), does Ms. Kleine briefly tap into something \u0097 a rhythm, a device that would have given her story form. But whether earnestly addressing the camera or engineering a phone call between Phyllis and her lover of four decades earlier, Ms. Kleine is unable to communicate a point, about either midcentury sexual mores or stifled suburban wives. A cascade of glamour shots \u0097 Phyllis languorous in a hammock or reclining in a field, always precisely posed \u0097 is of interest to no one but her relatives.\n\nThe problem with these my-family-was-messed-up-and-I need-to-share projects is that they require an audience of complete strangers to give a damn. And while we sometimes do, it’s usually because the material is inherently compelling (“Tarnation”) or the filmmaking uncovers truths beyond the template of family therapy (“51 Birch Street”). Sadly, “Phyllis and Harold” fulfills neither requirement.\n\nPHYLLIS AND HAROLD\n\nOpens on Friday in Manhattan.\n\nWritten, directed and produced by Cindy Kleine; director of photography, Claire Cario and Ms. Kleine; edited by Jonathan Oppenheim; music by Bruce Odland; animation by Lisa Crafts; released by Henry Jaglom and Rainbow Releasing. At the Cinema Village, 22 East 12th Street, Greenwich Village. Running time: 1 hour 24 minutes. This film is not rated."}, {"url": "https://www.huffpost.com/entry/all-about-her-mother-cind_b_469162", "page_content": "To say that director Cindy Kleine spins her search for truth into an art form only begins to describe the new film, Phyllis and Harold, documenting the bewildering marriage of her parents. While father Harold remains a dark and shadowy figure, mother Phyllis is eventually painstakingly and fully fleshed out. The deeper focus and graphic details, which reveal the subtle and sometimes secret aspects of her mother's life, could not be revealed until Harold passed away in 2003. And, I won't spoil the accruing dramatic suspense by being too specific here. Suffice it to say, its impact is powerful and poignant.\n\nThe feelings the film evokes remind one of a first reading of Betty Friedan's The Feminine Mystique in which essential aspects of one's own mother or grandmother were given credence and revealed as never before. Phyllis and Harold is the perfect companion piece to Friedan's seminal work on the quiet plight of suburban women in the 1940s and 50s, proving once again that life was anything but pure and simple way back when.\n\nAdvertisement\n\nLike Friedan's book, Cindy Kleine's film has captured something quietly but essentially tragic about many American women who were born in the 1920s and 30s. While this film is a very individual and unique unfolding of Klein's mother Phyllis' deeply complicated, lifelong dilemma, it also strikes notes of universality many will recognize as they recall the lives of the women from the WWII generation in their own families. In choosing duty and loyalty over satisfaction and a greater sense of freedom, these women stayed home, remained trapped, and suffered in silence.\n\nBut a mother's deep unhappiness and yearning for something missing (or in Phyllis' case someone who is missing) -- even when veiled by middle-class props such as a killer wardrobe, a tastefully decorated home, a pool in the back yard, and trips abroad -- seldom go unnoticed by her own children. It's striking to hear Harold recall the story of their 59-year marriage and compare it with Phyllis' recollections and those of her two sensitive and observant daughters.\n\nPhyllis' story is a heartbreaker, but so too is the effect it had on Cindy Kleine and her sister who are also interviewed. They worshipped their mother even though most of the time she was only half there. Kleine's extraordinary empathy and insight into her mother as well as her early exposure to photography which developed her visual sensibilities thanks to her father are the some of the elements that make this film so effective and ring so true. Ironically, the film -- unlike Phyllis' real life -- allows her ultimately to be revealed a whole human being.\n\nPhyllis and Harold. directed, produced, and written by Cindy Kleine. Opens in NYC on February 19, 2010. Limited release.\n\nAdvertisement\n\nActress Jean Simmons: Leading Lady in Her Final Film\n\nBorn nine years after Phyllis, the actress Jean Simmons shares some things in common with her. Simmons' career flourished through almost three decades before it began to wane in the late 1960s. Her second husband, film director Richard Brooks, sensed this frustration as well as problems with alcohol use and the effects of the increasing invisibility of middle age and an unhappy marriage. He created the film The Happy Ending especially for her. Released in an important and transitional year in Hollywood--1969--it was far from a perfect movie, but Jean Simmons made the most of a role that paralleled her life so closely and was nominated--a second time--for an Academy Award. It's another film that tries to make sense of Friedan's feminine mystique--that awful, nagging sense that something in life is missing.\n\n\n\nJean Simmons (1929-2010).\n\nSimmons always made wildly interesting if not important movies -- whether theatrically released or for television -- in almost every decade following her film debut in 1944 at the age of 15. 1940s: Great Expectations, Hamlet; 1950s: Young Bess, The Actress, Until They Sail; 1960s: Elmer Gantry, Spartacus ;1970s: Mr. Sycamore, Dominique, The Eastern Promise; 1980s: December Flowers, The Thornbirds, (television remake) Great Expectations; 1990s: How to Make an American Quilt.\n\nShe was luminous in black and white as well as Technicolor and shined brightly in quirky, contemporary dramas (Mister Buddwing, 1966) as well as in lavish, period pieces (The Robe, 1953). She even bridged the gap to musicals starring with Marlon Brando and Frank Sinatra in Guys and Dolls (1955) and unlike her contemporaries Audrey Hepburn, Deborah Kerr, and Natalie Wood her singing voice was not dubbed by Marnie Nixon.\n\nHer final decade included a wide variety of work: serving as narrator of PBS's American Masters series' documentary on legendary Hollywood director George Cukor (On Cukor); playing Countess Lucinda Rhives in Winter Solstice alongside Geraldine Chaplin and Peter Ustinov; and in the English version of the critically acclaimed animated feature Howl's Moving Castle, she teamed up with Lauren Bacall, Christian Bale, Blythe Danner, and Emily Mortimer lending their voices to Hayao Miyakazi's rich characters in which Simmons played Grandma Sophie to great effect.\n\nAdvertisement"}, {"url": "https://www.huffpost.com/author/cindy-kleine", "page_content": "Cindy Kleine is a film and video artist whose prolific career began when she was an undergraduate at The Museum School and at the legendary (and long-gone) MIT Film/Video Section, studying with Richard Leacock and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of documentary work which are family dramas: camera visits with her grandmother and her sister, and intense probes of her parents’ fifty-nine years of a dubious, fractured marriage. Additionally, Kleine has gone outside of family for films about odd artists and off-the-wall musicians; and she’s gone inside herself for some deeply personal, poetically framed psychodramas about love lost, the spirit gained.\n\n\n\nKleine’s films have been exhibited at many international festivals, including: Telluride, Seattle, San Francisco, Salsomaggiore, and Vancouver, and at such venues as The Museum of Fine Arts in Boston, The Knitting Factory and Anthology Film Archives in NYC, The ICA in London and The Center d’art Contemporain in Lyon, France. Her film, \"Doug and Mike, Mike and Doug,\" about the artists Starn Twins, was broadcast on PBS’s POV Film Series.\n\n\n\nMs. Kleine has received awards and fellowships from The American Film Institute, The U.S. S-8 Film and Digital Video Festival, The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School, Boston, and The New School for Social Research. She lives with her husband, theatre director, actor, playwright and painter Andre Gregory, and their two cats, in New York City and on Cape Cod.\n\nShow Full Bio"}, {"url": "https://www.wbur.org/news/2013/08/01/andre-gregory-kleine", "page_content": "Fifteen years ago filmmaker Cindy Kleine fell in love with André Gregory, a legendary theater director known more for co-writing and playing a version of himself in 1981’s conversational film drama “My Dinner With André.” (Other moviegoers might associate him more for getting his eye gouged out in the 1993 blockbuster, “Demolition Man.”)\n\nWhen Kleine and Gregory married she was 39 and he was 63. Over time the age gap became more palpable and stirred her documentarian’s impulse to freeze time. Part love letter (that occasionally borders on too intimate) and part artist portrait, Kleine’s documentary, “André Gregory: Before and After Dinner,” opens today at the Museum of Fine Arts, Boston and runs through Aug. 9. Kleine and Gregory will be present at tonight’s 7:30 screening to answer questions.\n\nFrom \"André Gregory: Before And After Dinner.\" (Courtesy, Cinema Guild)\n\nKleine, who narrates, sets a convivial pace and tone, best illustrated during a scene when she catalogs the 18 boyfriends who preceded Gregory. Photographs of each man flips by as Kleine lists, “Jonathan, Rob, Fernando, Rob ...” How did she manage such thorough record-keeping pre-Instagram? And so few clothes!\n\nKleine studied filmmaking at The Museum School and at MIT under Richard Leacock, who knew a thing or two about personal documentaries. Her last documentary, “Phyllis and Harold,” held a microscope to her parents’ 59-year marriage. (It premiered in Boston as part of the Boston Jewish Film Festival and this run is also co-presented by BJFF.)\n\nHere, the marriage is unquestionably strong. Kleine pokes fun at Gregory’s close friendship and life-long collaboration with actor/writer Wallace Shawn, who appears frequently in “Before and After Dinner” and was his foil in “My Dinner With André.” And Gregory calls this friendship his “second marriage,” but it’s lighthearted. Kleine is yang to Gregory’s yin. In his youth he was never hugged, he says. In her family, “fighting was the primary means of communication and everyone talked at once.”\n\nKleine steps into the background and devotes the second part of the film to Gregory, with fascinating footage from his formative days in experimental theater (the Richard Avedon stills from “Alice’s Adventures in Wonderland” are a knock-out) and a peppering of Gregory’s theatrical wisdom and anecdotes told to wide-eyed, nodding listeners.\n\nIn one scene Gregory spins a delicate yarn about his first kiss, which just happened to take place in a moonlit, Marblehead, Mass. cemetery. His knees buckled and he fainted. In another, he recalls a moment of hysterical blindness.\n\nThough both are Jewish, Gregory’s parents maintained a severely tight lip in this regard and the nature of his father’s relationship to the highest ranks of Nazi leadership continues to plague him and occupies a major thread of this film. Yet, as compelling as it to delve into the underpinnings of Gregory’s artistic drive, which he attributes to his terrifying father, the most gripping moments come while he’s directing Ibsen’s “The Master Builder” in his living room.\n\nWhat sets him apart as director, we learn, is his willingness to take the time that a production needs — he rehearsed “The Master Builder” for 14 years, for example. His obsession with \"Uncle Vanya\" was documented in \"Vanya on 42nd Street\" by Louis Malle, who also filmed \"My Dinner with André.\" Gregory also has an incorrigible trust in the actors he chooses. “I never audition an actor I only interview them,” he says.\n\nThere’s a discomfort at first with how long shots linger on Gregory’s intense, piercing gaze while actors deliver their lines off camera. An hour or so into this film, convinced of his portrait as a bottomless well of artistic chutzpah and encouragement, we are desperate to watch only his reactions. The act of directing, or life itself, is manifest in every line of his face.\n\nErin Trahan edits the online film magazine The Independent and moderates the current season of The DocYard. you can reach her at erin@erintrahan.net."}, {"url": "https://www.howold.co/person/cindy-kleine/biography", "page_content": "Cindy Kleine Biography\n\nAmerican filmmaker\n\nCindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 do*entary Andre Gregory: Before and After Dinner is about him. It was funded through Kickstarter.\n\nKleine studied film at The Museum School and the MIT Film/Video Section, studying with Richard Lea*. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and a Master's of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals, including Telluride, Seattle, San Francisco, Vancouver, the Boston Independent Film Festival, at the It’s All True International Do*entary Festival in Brazil, the DOK Leipzig International Festival, and the Santa Fe International Film Festival. Her film Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS's POV Film Series.\n\nKleine's film Phyllis and Harold (2008) is about her parents' 59-year marriage. The film won Best Feature Length Do*entary at the 2009 World Jewish Film Festival, in Ashkelon, Israel, and the Orson Welles Award for Innovative Filmmaking at the 2008 Iowa Independent Film Festival. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), P*age (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98).\n\nReferences\n\nExternal links"}, {"url": "https://newenglandfilm.com/magazine/2005/07/the-truth-sayer", "page_content": "Filmmaking | Interviews\n\nWritten by Karen Sampson | Posted by: Anonymous\n\nArmed with her camera and an intense curiosity about what makes people tick, veteran documentary filmmaker Cindy Kleine digs deep to uncover the hidden quirks of human nature in her film 'Inside Out.'\n\nCindy Kleine does not take people at face value. She has a gift in being able to see beyond the surface, and as a filmmaker she has been using this ability to make documentaries for the past 25 years. Passionate about telling stories that come straight from life, she aims not to send a message about a particular topic, but rather to uncover the deep psychological and emotional factors that influence people and their behavior.\n\n\"I never think of my films as having messages,\" she says. \"They’re always more of an inquiry — an investigation — of what I find compelling and fascinating about people and relationships. What I want to do is reveal the truth, or a truth.\"\n\nTruth, however, is not easily defined; it is subjective, as Kleine’s recent film \"’Til Death Due Us Part\" so aptly demonstrates. With this three-part film (the second part of which she is currently editing), Kleine investigates how men and women experience the institution of marriage in entirely different ways. \"One truth this film speaks about is that there is no truth,\" she explains. \"In other words, there are only the stories each person invents about themselves and their history. But each person’s story is completely different, even when they’ve spent their entire lives together, sleeping in the same bed every night. Even those stories and memories change all the time.\"\n\nThe very fact that Kleine strives to uncover the things people hide from each other — and themselves — requires that her films be extremely personal, and she does not shy away from turning the camera on herself and her own life; the unhappy 55-year marriage she examines in \"’Til Death Due Us Part\" is that of her parents. Making this film was, she says, \"more cleansing and clarifying than painful — like an exorcism,\" but she also admits that cutting so close to the bone was sometimes difficult. \"Certainly focusing this much energy and time on the bizarre and unhealthy aspects of my upbringing has, at times, been painful.\"\n\nIn her latest film, \"Inside Out,\" Kleine examines the strong correlation between pain and creativity, one that she recognizes in her own life. NewEnglandFilm.com recently caught up with her at her part-year home in Truro, Massachusetts, to talk about her teaching background, commercial success, and \"Inside Out,\" which will be screened at the Provincetown International Film Festival this month.\n\nKaren Sampson: What made you decide you wanted to be a filmmaker?\n\nCindy Kleine: I was a photography major at the School of the Museum of Fine Arts (SMFA) in Boston, and found myself wanting to make the pictures move. My boyfriend at the time was majoring in film (Visual Studies) at Harvard. He leant me his 16mm camera, showed me how to use it and how to edit, and from then on I was hooked.\n\nKS: Can you talk a bit about your teaching background?\n\nKleine: When I was 25, I got offered a teaching job at Boston College. I taught there from 1985 until 1997, with other teaching jobs during those years, too. My last teaching job was at The New School in New York, in about 1999. I’ve since \"retired\" from teaching, but I still teach workshops from time to time, most recently in Provincetown and at the University of Hawaii in Honolulu.\n\nWhat I loved about teaching, and what I miss, is the pleasure of working with wonderful, talented students, turning them on to films they’d never otherwise see, and helping them to realize their vision. I also miss being around young people; I learned [from my students] as much as they learned from me.\n\nKS: Your films are mostly short documentaries. What attracted you to this genre?\n\nKleine: I found that what I was passionate about expressing was always nonfictional — straight out of my life, or the lives of others who had touched me. My documentaries are never traditional docs, though; they’re more arty, personal, weird, unusual. . .however you might put it.\n\nThe length, I suppose, has more to do with what I have to say, rather than being a choice, but I find my films are getting longer and longer — \"Inside Out\" is 45 minutes, and the one I am working on now is feature length. I guess the older I get, the more I have to say, and hopefully, the more wisdom I have in saying it! I’m happy about this because there is an inherent problem in distributing short films, especially when they’re too long to be classic \"shorts\" and too short to be considered features.\n\nKS: Do you feel that making documentaries is as creative an endeavor as making feature films? Why or why not?\n\nKleine: I think they are two completely different forms of expression, and unique talents are required to do either of them well. Because I make docs, narratives seem more difficult to me, though I love excellent well-made narrative films, and have often dreamed of making them. The work involved seems daunting to me though, and my standards are so high that I would always be afraid I wouldn’t be able to live up to them.\n\nKS: Do you do all of the work (camera, editing, sound, etc.) on your films or do you work with a crew?\n\nKleine: I used to do all the work myself — shooting, sound, editing, writing, producing. With \"Inside Out,\" however, I worked with an editor (for a brief period actually two editors), and after a certain point, a cameraperson. I needed an editor because the amount of footage was way more than I’d ever handled before (about 80 hours), and the film was really difficult to edit for many reasons.\n\nNow that I’ve worked with a good cameraperson, I can never go back. The more experience I have, the more I am able to acknowledge my own limitations and admit the fact that I just can’t do everything.\n\nKS: How important is commercial success to you?\n\nKleine: If I were to make a wish list, it would be very important. I’d love for my films to be more widely seen, and I’d love to make some money with them. But since it’s not something I’ve ever had, and I’ve been making films for 25 years, I guess it’s not all that important! In other words, if I wanted to, I could make \"commercial films\" — docs for TV, etc. — but I’m not willing to compromise my aesthetic judgment for that purpose specifically, so it hasn’t happened. My aesthetic tastes and what is considered \"commercial,\" in this country at least, are apparently not one and the same thing.\n\nKS: In your experience, what is the creative climate like for filmmakers in New England?\n\nKleine: I was nurtured and \"reared\" as a filmmaker in New England — Boston, specifically — and learned everything I know there from amazingly gifted teachers and filmmakers. Boston, and New England in general, supports my work in a way other places in the country don’t. There is an atmosphere here that is very supportive of truly independent works like mine. People are much more open to it.\n\nKS: Your films have been shown at a number of prominent festivals around the country. Can you talk a bit about the festival circuit for documentaries?\n\nKleine: Things are certainly different than when I started sending work to festivals 20 years ago. More and more film festivals are now not only showing docs, but also placing greater emphasis on them. Also, there are a lot more festivals. It’s a great way to have work shown (often the only way) and to meet other like-minded documentary makers. Festivals always give me an important sense of community. We forget, huddled over our little editing machines obsessing about our own personal subject matter, that there are thousands of other nuts out there doing the same thing. It’s comforting to be reminded of that.\n\nKS: Your most recent film, \"Inside Out,\" introduces viewers to six very eccentric characters who create their own unique forms of art. Tell us about making this film.\n\nKleine: In 1999, while spending the summer in Santa Fe, I came across a yard that had a display of baby doll heads on sticks, and I became fascinated with exploring the idea of people who use their personal space as their own gallery. I got a photographer (Polly Brown) on board, and she and I spent two years traveling the country taking photos and footage. We found (mostly through word-of-mouth) 28 subjects altogether.\n\nAt the time I shot the footage, I didn’t know what I was going to do with it, so when I decided to pull it together as a film I really struggled with the editing. There have been 100 incarnations of this film; at one point it was a feature film with animation — a whole elaborate thing.\n\nKS: Can you talk about the role creativity has played in the lives of the people you present in \"Inside Out\"?\n\nKleine: Coming from an upper middle-class background with all the advantages, education, etc., I have always had this incredible battle with my creative work. Yet these people — most of whom are poor and have had incredibly tragic lives — don’t struggle with their work at all. Creativity, for them, is a way of healing. It is how they find peace and solace and the strength to go on.\n\nKS: In your synopsis of \"Inside Out\" you say the film is meant to offer us hope. Can you expand on this?\n\nKleine: I don’t think it is an accident that I began working on this at a time when I began to despair about the political climate in this country. The characters in this film are meant to stand as beacons of hope by showing that no matter how bad things get, there is a way out. These people are all finding their own positive way to get by, and I believe that we — each one of us — can use our creative energy to solve any problem.\n\nKS: You have said that making \"Inside Out\" was the hardest thing you’ve ever done. Are you happy with the results of all your hard work?\n\nKleine: In the end I am happy with it. It’s a strange, odd film, but very much what I wanted. It’s very much about the people who are in it — I gave it back to them."}, {"url": "https://alchetron.com/Cindy-Kleine", "page_content": "Cindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 documentary, Before and After Dinner is about Gregory. The film was funded through Kickstarter.\n\nKleine studied film at The Museum School and, at the now closed, MIT Film/Video Section, studying with Richard Leacock. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and received a Masters of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals including Telluride, Seattle, San Francisco and Vancouver. Her films have been shown at The Boston Independent Film Festival, at the It’s All True International Documentary Festival in Brazil, at DOK Leipzig International Festival, and at The Santa Fe International Film Festival. Her film, Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS POV Film Series.\n\nThe film Phyllis and Harold (2008) is about her parents' marriage of fifty-nine years. The film won Best Feature Length Documentary at the World Jewish Film Festival, Ashkelon, Israel, 2009 and the Orson Welles Award for Innovative Filmmaking at the Iowa Independent Film Festival in April 2008. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), Passage (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98)."}], "Cindy Kleine has produced for television.": [{"url": "http://www.cindykleine.com/bio/index.html", "page_content": "Filmmaker Cindy Kleine’s prolific career began when she was an undergraduate at The Museum School and the legendary MIT Film/Video Section, studying with Richard Leacock, influenced by visiting filmmakers Robert Frank and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of family dramas, including the acclaimed features, André Gregory: Before and After Dinner, a personal portrait of her renowned theatre director husband, and Phyllis and Harold, an intense probe of her parents' disastrous fifty-nine year marriage. In her short films Kleine has made friends and artists her subjects: The Starn Twins in Doug and Mike, Mike and Doug, outsider artists in Inside Out, and grad school colleagues in Holy Matter, and she's explored the mysteries and foibles of romantic love in poetically framed psychodramas Secrets of Cindy and Passage.\n\nKleine's films have been exhibited at many international festivals including Telluride, Seattle, San Francisco, Boston, Vancouver, Santa Fe, DokLeipzig, and Provincetown, and in theatres and museums such as Film Forum, The Walter Reade Theater at Lincoln Center and Anthology Film Archives in NYC, The Music Hall in Los Angeles, The Museum of Fine Arts and The Coolidge Corner Theatre in Boston, The ICA in London and The Center d'art Contemporain in Lyon, France. Her film, Doug and Mike, Mike and Doug was broadcast on PBS's POV Film Series.\n\nKleine has received awards and fellowships from The American Film Institute, The Iowa Independent Film Festival, The Jewish Eye (Israel), The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School and The New School for Social Research.\n\nAlongside her film career, Kleine has continued to paint, and for the last several years has been working in still photography. Several bodies of that work are represented in the ARTWORK section.\n\n↓ Download CV"}, {"url": "https://peoplepill.com/people/cindy-kleine/", "page_content": "Cindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 documentary, Andre Gregory: Before and After Dinner is about Gregory. The film was funded through Kickstarter.\n\nKleine studied film at The Museum School and, at the now closed, MIT Film/Video Section, studying with Richard Leacock. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and received a Masters of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals including Telluride, Seattle, San Francisco and Vancouver. Her films have been shown at The Boston Independent Film Festival, at the It’s All True International Documentary Festival in Brazil, at DOK Leipzig International Festival, and at The Santa Fe International Film Festival. Her film, Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS POV Film Series.\n\nThe film Phyllis and Harold (2008) is about her parents' marriage of fifty-nine years. The film won Best Feature Length Documentary at the World Jewish Film Festival, Ashkelon, Israel, 2009 and the Orson Welles Award for Innovative Filmmaking at the Iowa Independent Film Festival in April 2008. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), Passage (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98)."}, {"url": "http://archive.boston.com/ae/movies/articles/2010/07/18/her_documentary_is_a_family_drama_in_the_truest_sense/", "page_content": "It was Gregory who encouraged Kleine to submit “ ’Til Death Do Us Part’’ to film festivals and, after some success, urged her to expand it into a feature. Kleine labored over “Phyllis and Harold’’ for a dozen years, knowing it could not be released until after her father’s death (he died suddenly in 2003) since it reveals a family secret that she felt would have been too painful for him to see. Unlike the rapport and shared interests so evident between Kleine and Gregory, Phyllis and Harold seemed to exist as strangers in separate marriages. He was a hard-working dentist who escaped the poverty of New York’s Lower East Side and thought his wife a “wonderful woman.’’ She was a fashionable beauty and a frustrated artist who felt she’d married the wrong man for the wrong reasons. The irony, Gregory points out, is that Harold’s prolific home movies and thoughtful photographs reveal “a creative man’’ who may have been more interesting than the “vulgar dentist’’ his unhappy wife perceived.\n\n“I saw ‘ ’Til Death Do Us Part’ as a blur because we were making out in the editing room,’’ laughs Gregory, sipping tea with Kleine in their Truro home (they divide their time between New York City and Cape Cod). Surrounded by wildflowers, the house is spacious but understated: books line the walls, a litter box sits in the hall. (“I don’t have kids; I have cats,’’ says Kleine. Gregory has a grown son from his first marriage.) The couple talk about what movie they’ll see over the weekend — perhaps Tilda Swinton’s “I Am Love,’’ a recent favorite that begs to be revisited on a bigger screen. Angular and full of easy charm at age 76, Gregory excuses himself to prepare for a phone call from friend and frequent collaborator Wallace Shawn; he’s planning to direct three of Shawn’s plays at New York’s Public Theater next year. Kleine, 52, seems the more reserved of the pair, but she’s engaging and animated when talking about the labor of love that was “Phyllis and Harold.’’\n\nKleine has been married for 12 years to director, playwright, and actor Andre Gregory, who produced the film (the pair will engage in a post-screening discussion with the audience July 25 at 3 p.m.). Her parents have hovered over the relationship from the start. Gregory recalls that when they met, Kleine was finishing “ ’Til Death Do Us Part,’’ her 1998 short film about her parents that served as a precursor to “Phyllis and Harold.’’\n\nPerhaps her own happy marriage provided filmmaker Cindy Kleine with the prism through which to view her parents’ “hideous’’ one. That’s Kleine’s description of the late Phyllis and Harold Kleine’s 59-year union, one that she’s chronicled with journalistic inquisitiveness and no small dose of humor in the documentary “Phyllis and Harold’’ (it opens Friday at the Coolidge Corner Theatre). As Kleine digs beneath the façade of her middle class, Jewish, Long Island upbringing to reveal deceit, delusion, and denial, “Phyllis and Harold’’ plays like Ingmar Bergman’s “Scenes From a Marriage’’ starring Tennessee Williams-esque characters.\n\n“Phyllis and Harold’’ fits in with a spate of recent documentaries such as “51 Birch Street,’’ “Must Read After My Death,’’ “Capturing the Friedmans,’’ and “Crazy Love’’ that probe the darker side of post-World War II suburban, middle-class families. For a generation of filmmakers now hitting middle age, it should be no surprise that they would look close to home, at ordinary lives that often hid extraordinary family secrets. It’s also a generation that’s fast disappearing.\n\n“They are all gone,’’ says Kleine of her parents and their peers. “If I hadn’t told it, no one would know their story. I am endlessly fascinated by the mystery of life — the hope of youth; then you are old and dead in the blink of an eye.’’ Her film uses her father’s photographs and home movies, on-camera commentary by Kleine herself, and interviews with Kleine’s older sister, Erica “Ricky’’ Kleine. As with many dysfunctional families, Kleine points out that Ricky’s perspective on their childhood is quite different from her own. The sisters were not close as children, but as they matured, and through the filmmaking process, they forged a bond. “We remember different parents. But she loves the film,’’ says Cindy Kleine. “I think it helped her; it objectified the situation so now we can laugh at it.’’\n\nFor Gregory, who confesses to seeing his wife’s film “70 or 80 times,’’ the personal story speaks to a generation of marriages. “I love the way it depicts many couples of that generation, where the women married men for security — there were not many alternatives — and then felt trapped and lived in contempt of these men,’’ he says. “Being older myself, I am also deeply moved by the pathos of these young people becoming old, the changing geography of the face. Having had a mother and a father who were raging narcissists, I was fascinated by Phyllis’s narcissism and her willingness to spill the beans.’’\n\nFor Kleine, delving into the personal for raw material is how she learned filmmaking. She studied with influential documentary film pioneer Richard Leacock and Glorianna Davenport, cofounder of the MIT Media Lab, during the heyday of the now defunct MIT Film/Video Section in the late 1970s. Kleine, who eventually earned her BFA from Tufts University, was a student at the School of the Museum of Fine Arts when she began taking film classes at MIT in an exchange program. “I holed up there and spent a lot of time. I remember a two-week documentary workshop with Robert Frank — I never knew he made films. It was an amazing time and an amazing community.’’ Besides Davenport and Leacock, Kleine credits instructor John Gianvito, who would go on to program the Harvard Film Archive and direct several acclaimed films, with influencing a generation of film students. “His film history courses exposed me to European cinema, especially the work of [Russian director Andrei] Tarkovsky,’’ she says.\n\nThe story of her parents’ marriage may be behind her, but Kleine is about to tackle another film memoir, this time collaborating with her husband. The couple just returned from Gregory’s hometown of Los Angeles where they shot footage for a documentary about Gregory’s family and its influence on his life and work.\n\n“I have no problem talking, as you might have gathered,’’ says Gregory, whose musings across a table with Wally Shawn turned “My Dinner With Andre’’ into an unlikely indie smash in 1981. “I love examining personal relationships even when it’s in public.’’\n\n“Andre lights up when the camera goes on,’’ adds Kleine.\n\n“Phyllis and Harold’’ hit the festival circuit after a successful screening as part of the Boston Jewish Film Festival in November 2008. That led to international bookings and a recent DVD release. But for Kleine, the success is bittersweet. Phyllis Kleine died in 2006 and never saw the film’s final cut.\n\n“Every time I go to an opening and see the title on the marquee, I think how much my mother would have loved it. The film is critical of her, but she wouldn’t see it that way at all,’’ says Kleine. “She would see it as a homage; she’d be thrilled people were paying such close attention to her.’’\n\nLoren King can be reached at loren.king@comcast.net.\n\n© Copyright 2010 Globe Newspaper Company."}, {"url": "https://www.rottentomatoes.com/celebrity/cindy-kleine", "page_content": "Log in or sign up for Rotten Tomatoes\n\nContinue with Google\n\nContinue with Email\n\nEmail\n\nNew Where is the password field?\n\nContinue\n\nTrouble logging in?\n\nBy continuing, you agree to the Privacy Policy and the Terms and Policies, and to receive email from Rotten Tomatoes."}, {"url": "https://www.huffpost.com/entry/all-about-her-mother-cind_b_469162", "page_content": "To say that director Cindy Kleine spins her search for truth into an art form only begins to describe the new film, Phyllis and Harold, documenting the bewildering marriage of her parents. While father Harold remains a dark and shadowy figure, mother Phyllis is eventually painstakingly and fully fleshed out. The deeper focus and graphic details, which reveal the subtle and sometimes secret aspects of her mother's life, could not be revealed until Harold passed away in 2003. And, I won't spoil the accruing dramatic suspense by being too specific here. Suffice it to say, its impact is powerful and poignant.\n\nThe feelings the film evokes remind one of a first reading of Betty Friedan's The Feminine Mystique in which essential aspects of one's own mother or grandmother were given credence and revealed as never before. Phyllis and Harold is the perfect companion piece to Friedan's seminal work on the quiet plight of suburban women in the 1940s and 50s, proving once again that life was anything but pure and simple way back when.\n\nAdvertisement\n\nLike Friedan's book, Cindy Kleine's film has captured something quietly but essentially tragic about many American women who were born in the 1920s and 30s. While this film is a very individual and unique unfolding of Klein's mother Phyllis' deeply complicated, lifelong dilemma, it also strikes notes of universality many will recognize as they recall the lives of the women from the WWII generation in their own families. In choosing duty and loyalty over satisfaction and a greater sense of freedom, these women stayed home, remained trapped, and suffered in silence.\n\nBut a mother's deep unhappiness and yearning for something missing (or in Phyllis' case someone who is missing) -- even when veiled by middle-class props such as a killer wardrobe, a tastefully decorated home, a pool in the back yard, and trips abroad -- seldom go unnoticed by her own children. It's striking to hear Harold recall the story of their 59-year marriage and compare it with Phyllis' recollections and those of her two sensitive and observant daughters.\n\nPhyllis' story is a heartbreaker, but so too is the effect it had on Cindy Kleine and her sister who are also interviewed. They worshipped their mother even though most of the time she was only half there. Kleine's extraordinary empathy and insight into her mother as well as her early exposure to photography which developed her visual sensibilities thanks to her father are the some of the elements that make this film so effective and ring so true. Ironically, the film -- unlike Phyllis' real life -- allows her ultimately to be revealed a whole human being.\n\nPhyllis and Harold. directed, produced, and written by Cindy Kleine. Opens in NYC on February 19, 2010. Limited release.\n\nAdvertisement\n\nActress Jean Simmons: Leading Lady in Her Final Film\n\nBorn nine years after Phyllis, the actress Jean Simmons shares some things in common with her. Simmons' career flourished through almost three decades before it began to wane in the late 1960s. Her second husband, film director Richard Brooks, sensed this frustration as well as problems with alcohol use and the effects of the increasing invisibility of middle age and an unhappy marriage. He created the film The Happy Ending especially for her. Released in an important and transitional year in Hollywood--1969--it was far from a perfect movie, but Jean Simmons made the most of a role that paralleled her life so closely and was nominated--a second time--for an Academy Award. It's another film that tries to make sense of Friedan's feminine mystique--that awful, nagging sense that something in life is missing.\n\n\n\nJean Simmons (1929-2010).\n\nSimmons always made wildly interesting if not important movies -- whether theatrically released or for television -- in almost every decade following her film debut in 1944 at the age of 15. 1940s: Great Expectations, Hamlet; 1950s: Young Bess, The Actress, Until They Sail; 1960s: Elmer Gantry, Spartacus ;1970s: Mr. Sycamore, Dominique, The Eastern Promise; 1980s: December Flowers, The Thornbirds, (television remake) Great Expectations; 1990s: How to Make an American Quilt.\n\nShe was luminous in black and white as well as Technicolor and shined brightly in quirky, contemporary dramas (Mister Buddwing, 1966) as well as in lavish, period pieces (The Robe, 1953). She even bridged the gap to musicals starring with Marlon Brando and Frank Sinatra in Guys and Dolls (1955) and unlike her contemporaries Audrey Hepburn, Deborah Kerr, and Natalie Wood her singing voice was not dubbed by Marnie Nixon.\n\nHer final decade included a wide variety of work: serving as narrator of PBS's American Masters series' documentary on legendary Hollywood director George Cukor (On Cukor); playing Countess Lucinda Rhives in Winter Solstice alongside Geraldine Chaplin and Peter Ustinov; and in the English version of the critically acclaimed animated feature Howl's Moving Castle, she teamed up with Lauren Bacall, Christian Bale, Blythe Danner, and Emily Mortimer lending their voices to Hayao Miyakazi's rich characters in which Simmons played Grandma Sophie to great effect.\n\nAdvertisement"}, {"url": "https://www.howold.co/person/cindy-kleine/biography", "page_content": "Cindy Kleine Biography\n\nAmerican filmmaker\n\nCindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 do*entary Andre Gregory: Before and After Dinner is about him. It was funded through Kickstarter.\n\nKleine studied film at The Museum School and the MIT Film/Video Section, studying with Richard Lea*. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and a Master's of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals, including Telluride, Seattle, San Francisco, Vancouver, the Boston Independent Film Festival, at the It’s All True International Do*entary Festival in Brazil, the DOK Leipzig International Festival, and the Santa Fe International Film Festival. Her film Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS's POV Film Series.\n\nKleine's film Phyllis and Harold (2008) is about her parents' 59-year marriage. The film won Best Feature Length Do*entary at the 2009 World Jewish Film Festival, in Ashkelon, Israel, and the Orson Welles Award for Innovative Filmmaking at the 2008 Iowa Independent Film Festival. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), P*age (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98).\n\nReferences\n\nExternal links"}, {"url": "https://www.nytimes.com/2010/02/19/movies/19phyllis.html", "page_content": "Whenever the filmmaker Cindy Kleine pondered her parents’ quarrelsome, 59-year marriage, her most frequent thought was, “What are they doing together?” Hoping that movie audiences would be equally inquisitive, Ms. Kleine embarked on a 12-year journey through photographs and home movies, love letters and long-kept secrets to produce “Phyllis and Harold,” an impossibly self-involved portrait of a union far more commonplace than its offspring seem to believe.\n\nOnly when interviewing her parents separately in their Long Island home and eliciting wildly different descriptions of the early years of their marriage (“I was always angry.” “That was a wonderful time in my life.”), does Ms. Kleine briefly tap into something \u0097 a rhythm, a device that would have given her story form. But whether earnestly addressing the camera or engineering a phone call between Phyllis and her lover of four decades earlier, Ms. Kleine is unable to communicate a point, about either midcentury sexual mores or stifled suburban wives. A cascade of glamour shots \u0097 Phyllis languorous in a hammock or reclining in a field, always precisely posed \u0097 is of interest to no one but her relatives.\n\nThe problem with these my-family-was-messed-up-and-I need-to-share projects is that they require an audience of complete strangers to give a damn. And while we sometimes do, it’s usually because the material is inherently compelling (“Tarnation”) or the filmmaking uncovers truths beyond the template of family therapy (“51 Birch Street”). Sadly, “Phyllis and Harold” fulfills neither requirement.\n\nPHYLLIS AND HAROLD\n\nOpens on Friday in Manhattan.\n\nWritten, directed and produced by Cindy Kleine; director of photography, Claire Cario and Ms. Kleine; edited by Jonathan Oppenheim; music by Bruce Odland; animation by Lisa Crafts; released by Henry Jaglom and Rainbow Releasing. At the Cinema Village, 22 East 12th Street, Greenwich Village. Running time: 1 hour 24 minutes. This film is not rated."}, {"url": "https://www.huffpost.com/author/cindy-kleine", "page_content": "Cindy Kleine is a film and video artist whose prolific career began when she was an undergraduate at The Museum School and at the legendary (and long-gone) MIT Film/Video Section, studying with Richard Leacock and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of documentary work which are family dramas: camera visits with her grandmother and her sister, and intense probes of her parents’ fifty-nine years of a dubious, fractured marriage. Additionally, Kleine has gone outside of family for films about odd artists and off-the-wall musicians; and she’s gone inside herself for some deeply personal, poetically framed psychodramas about love lost, the spirit gained.\n\n\n\nKleine’s films have been exhibited at many international festivals, including: Telluride, Seattle, San Francisco, Salsomaggiore, and Vancouver, and at such venues as The Museum of Fine Arts in Boston, The Knitting Factory and Anthology Film Archives in NYC, The ICA in London and The Center d’art Contemporain in Lyon, France. Her film, \"Doug and Mike, Mike and Doug,\" about the artists Starn Twins, was broadcast on PBS’s POV Film Series.\n\n\n\nMs. Kleine has received awards and fellowships from The American Film Institute, The U.S. S-8 Film and Digital Video Festival, The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School, Boston, and The New School for Social Research. She lives with her husband, theatre director, actor, playwright and painter Andre Gregory, and their two cats, in New York City and on Cape Cod.\n\nShow Full Bio"}, {"url": "http://cindykleine.com/films/secrets.html", "page_content": "SECRETS OF CINDY\n\n1983, 15 MINS\n\nSecrets of Cindy | Kleine’s first videotape, produced as a Museum School student, won First Prize at the American Film Institute’s Student Video Competition. The award was a production and post-production rig that allowed the filmmaker to keep making her work when she left school. Cindy and a classmate girlfriend giggle uncontrollably as they read aloud items from each other’s boy-crazy junior high diaries. In dramatized scenes, the filmmaker lives out her middle school, l’amour fou intrigues; and then there’s her twenty-something romance, which, now a quarter century later, appears as ephemeral and delusional as the diary entries of the 13-year-olds. In ways, this film, delving into the heartaches of love gone sour, is an exploratory work, returned to with more complexity, and higher stakes, in Passage (1991).\n\nview clip →\n\n\n\n← previous film | next film →\n\n← main film page"}, {"url": "https://www.wbur.org/news/2013/08/01/andre-gregory-kleine", "page_content": "Fifteen years ago filmmaker Cindy Kleine fell in love with André Gregory, a legendary theater director known more for co-writing and playing a version of himself in 1981’s conversational film drama “My Dinner With André.” (Other moviegoers might associate him more for getting his eye gouged out in the 1993 blockbuster, “Demolition Man.”)\n\nWhen Kleine and Gregory married she was 39 and he was 63. Over time the age gap became more palpable and stirred her documentarian’s impulse to freeze time. Part love letter (that occasionally borders on too intimate) and part artist portrait, Kleine’s documentary, “André Gregory: Before and After Dinner,” opens today at the Museum of Fine Arts, Boston and runs through Aug. 9. Kleine and Gregory will be present at tonight’s 7:30 screening to answer questions.\n\nFrom \"André Gregory: Before And After Dinner.\" (Courtesy, Cinema Guild)\n\nKleine, who narrates, sets a convivial pace and tone, best illustrated during a scene when she catalogs the 18 boyfriends who preceded Gregory. Photographs of each man flips by as Kleine lists, “Jonathan, Rob, Fernando, Rob ...” How did she manage such thorough record-keeping pre-Instagram? And so few clothes!\n\nKleine studied filmmaking at The Museum School and at MIT under Richard Leacock, who knew a thing or two about personal documentaries. Her last documentary, “Phyllis and Harold,” held a microscope to her parents’ 59-year marriage. (It premiered in Boston as part of the Boston Jewish Film Festival and this run is also co-presented by BJFF.)\n\nHere, the marriage is unquestionably strong. Kleine pokes fun at Gregory’s close friendship and life-long collaboration with actor/writer Wallace Shawn, who appears frequently in “Before and After Dinner” and was his foil in “My Dinner With André.” And Gregory calls this friendship his “second marriage,” but it’s lighthearted. Kleine is yang to Gregory’s yin. In his youth he was never hugged, he says. In her family, “fighting was the primary means of communication and everyone talked at once.”\n\nKleine steps into the background and devotes the second part of the film to Gregory, with fascinating footage from his formative days in experimental theater (the Richard Avedon stills from “Alice’s Adventures in Wonderland” are a knock-out) and a peppering of Gregory’s theatrical wisdom and anecdotes told to wide-eyed, nodding listeners.\n\nIn one scene Gregory spins a delicate yarn about his first kiss, which just happened to take place in a moonlit, Marblehead, Mass. cemetery. His knees buckled and he fainted. In another, he recalls a moment of hysterical blindness.\n\nThough both are Jewish, Gregory’s parents maintained a severely tight lip in this regard and the nature of his father’s relationship to the highest ranks of Nazi leadership continues to plague him and occupies a major thread of this film. Yet, as compelling as it to delve into the underpinnings of Gregory’s artistic drive, which he attributes to his terrifying father, the most gripping moments come while he’s directing Ibsen’s “The Master Builder” in his living room.\n\nWhat sets him apart as director, we learn, is his willingness to take the time that a production needs — he rehearsed “The Master Builder” for 14 years, for example. His obsession with \"Uncle Vanya\" was documented in \"Vanya on 42nd Street\" by Louis Malle, who also filmed \"My Dinner with André.\" Gregory also has an incorrigible trust in the actors he chooses. “I never audition an actor I only interview them,” he says.\n\nThere’s a discomfort at first with how long shots linger on Gregory’s intense, piercing gaze while actors deliver their lines off camera. An hour or so into this film, convinced of his portrait as a bottomless well of artistic chutzpah and encouragement, we are desperate to watch only his reactions. The act of directing, or life itself, is manifest in every line of his face.\n\nErin Trahan edits the online film magazine The Independent and moderates the current season of The DocYard. you can reach her at erin@erintrahan.net."}], "Cindy Kleine has worked on the television series Art:21.": [{"url": "https://art21.org/series/art-in-the-twenty-first-century/", "page_content": "Season 9 of Art in the Twenty-First Century charts art-making in three urban centers across three continents: Berlin, Johannesburg, and the San Francisco Bay Area. From the post-Cold War cultural and economic rebirth in Berlin, to the dramatic fall of apartheid in South Africa and the technological boom in the Bay Area, the twelve artists and one non-profit art center highlighted in this season respond to the forces that have shaped the places where they live and work, while pursuing their personal visions for a better future.\n\nAs each artist draws inspiration from their surrounding communities, they also travel to museums and public spaces internationally to share their work, reminding us of the increasingly global nature of the world we live in. The artists in this season examine the complicated histories of colonization, war and migration, offer new perspectives on our interactions with technology and the environment, critique our conceptions of gender, sexuality, and race, and ultimately inspire us to see our world in new ways.\n\nIncluded this season are Creative Growth Art Center, Nathalie Djurberg and Hans Berg, Olafur Eliasson, David Goldblatt, Katy Grannan, Nicholas Hlobo, Hiwa K, Lynn Hershman Leeson, Zanele Muholi, Susan Philipsz, Robin Rhode, and Stephanie Syjuco.\n\nMajor underwriting for Season 9 of Art in the Twenty-First Century is provided by National Endowment for the Arts, PBS, Lambent Foundation, Ford Foundation, The Anna-Maria and Stephen Kellen Foundation, The Andy Warhol Foundation for the Visual Arts, The Horace W. Goldsmith Foundation, Toby Devan Lewis, Nion McEvoy, and The Phyllis C. Wattis Foundation.\n\nSeason 9 premiered September 21, 2018 on PBS."}, {"url": "https://art21.org/watch/art-in-the-twenty-first-century/s5/cindy-sherman-in-transformation-segment/", "page_content": "“I didn’t want to make what looked like art,” Cindy Sherman says about her earliest works, explaining that “film has always kind of been more influential to me than the art world.”\n\nThe segment surveys thirty years of untitled works in which the artist photographs herself in various scenes and guises, grouped into informally-named series such as fairy tales, centerfolds, history portraits, Hollywood/Hampton types, and clowns.\n\nSherman used a digital camera and green screen for her most recent series of society portraits, modifying each image’s “background with the same kind of license that a painter would take.” Sorting through test shots at the computer, Sherman leads the viewer through her iterative process.\n\nThe segment later follows her to a thrift store where, upon finding several “wacky pants” she wonders if this shopping trip “might be inspiring a whole new series.”\n\nMore information"}, {"url": "https://www.huffpost.com/author/cindy-kleine", "page_content": "Cindy Kleine is a film and video artist whose prolific career began when she was an undergraduate at The Museum School and at the legendary (and long-gone) MIT Film/Video Section, studying with Richard Leacock and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of documentary work which are family dramas: camera visits with her grandmother and her sister, and intense probes of her parents’ fifty-nine years of a dubious, fractured marriage. Additionally, Kleine has gone outside of family for films about odd artists and off-the-wall musicians; and she’s gone inside herself for some deeply personal, poetically framed psychodramas about love lost, the spirit gained.\n\n\n\nKleine’s films have been exhibited at many international festivals, including: Telluride, Seattle, San Francisco, Salsomaggiore, and Vancouver, and at such venues as The Museum of Fine Arts in Boston, The Knitting Factory and Anthology Film Archives in NYC, The ICA in London and The Center d’art Contemporain in Lyon, France. Her film, \"Doug and Mike, Mike and Doug,\" about the artists Starn Twins, was broadcast on PBS’s POV Film Series.\n\n\n\nMs. Kleine has received awards and fellowships from The American Film Institute, The U.S. S-8 Film and Digital Video Festival, The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School, Boston, and The New School for Social Research. She lives with her husband, theatre director, actor, playwright and painter Andre Gregory, and their two cats, in New York City and on Cape Cod.\n\nShow Full Bio"}, {"url": "https://cindykleine.com/bio/index.html", "page_content": "Filmmaker Cindy Kleine’s prolific career began when she was an undergraduate at The Museum School and the legendary MIT Film/Video Section, studying with Richard Leacock, influenced by visiting filmmakers Robert Frank and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of family dramas, including the acclaimed features, André Gregory: Before and After Dinner, a personal portrait of her renowned theatre director husband, and Phyllis and Harold, an intense probe of her parents' disastrous fifty-nine year marriage. In her short films Kleine has made friends and artists her subjects: The Starn Twins in Doug and Mike, Mike and Doug, outsider artists in Inside Out, and grad school colleagues in Holy Matter, and she's explored the mysteries and foibles of romantic love in poetically framed psychodramas Secrets of Cindy and Passage.\n\nKleine's films have been exhibited at many international festivals including Telluride, Seattle, San Francisco, Boston, Vancouver, Santa Fe, DokLeipzig, and Provincetown, and in theatres and museums such as Film Forum, The Walter Reade Theater at Lincoln Center and Anthology Film Archives in NYC, The Music Hall in Los Angeles, The Museum of Fine Arts and The Coolidge Corner Theatre in Boston, The ICA in London and The Center d'art Contemporain in Lyon, France. Her film, Doug and Mike, Mike and Doug was broadcast on PBS's POV Film Series.\n\nKleine has received awards and fellowships from The American Film Institute, The Iowa Independent Film Festival, The Jewish Eye (Israel), The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School and The New School for Social Research.\n\nAlongside her film career, Kleine has continued to paint, and for the last several years has been working in still photography. Several bodies of that work are represented in the ARTWORK section.\n\n↓ Download CV"}, {"url": "https://peoplepill.com/people/cindy-kleine/", "page_content": "Cindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 documentary, Andre Gregory: Before and After Dinner is about Gregory. The film was funded through Kickstarter.\n\nKleine studied film at The Museum School and, at the now closed, MIT Film/Video Section, studying with Richard Leacock. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and received a Masters of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals including Telluride, Seattle, San Francisco and Vancouver. Her films have been shown at The Boston Independent Film Festival, at the It’s All True International Documentary Festival in Brazil, at DOK Leipzig International Festival, and at The Santa Fe International Film Festival. Her film, Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS POV Film Series.\n\nThe film Phyllis and Harold (2008) is about her parents' marriage of fifty-nine years. The film won Best Feature Length Documentary at the World Jewish Film Festival, Ashkelon, Israel, 2009 and the Orson Welles Award for Innovative Filmmaking at the Iowa Independent Film Festival in April 2008. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), Passage (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98)."}, {"url": "https://www.howold.co/person/cindy-kleine/biography", "page_content": "Cindy Kleine Biography\n\nAmerican filmmaker\n\nCindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 do*entary Andre Gregory: Before and After Dinner is about him. It was funded through Kickstarter.\n\nKleine studied film at The Museum School and the MIT Film/Video Section, studying with Richard Lea*. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and a Master's of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals, including Telluride, Seattle, San Francisco, Vancouver, the Boston Independent Film Festival, at the It’s All True International Do*entary Festival in Brazil, the DOK Leipzig International Festival, and the Santa Fe International Film Festival. Her film Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS's POV Film Series.\n\nKleine's film Phyllis and Harold (2008) is about her parents' 59-year marriage. The film won Best Feature Length Do*entary at the 2009 World Jewish Film Festival, in Ashkelon, Israel, and the Orson Welles Award for Innovative Filmmaking at the 2008 Iowa Independent Film Festival. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), P*age (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98).\n\nReferences\n\nExternal links"}, {"url": "https://www.nytimes.com/2010/02/19/movies/19phyllis.html", "page_content": "Whenever the filmmaker Cindy Kleine pondered her parents’ quarrelsome, 59-year marriage, her most frequent thought was, “What are they doing together?” Hoping that movie audiences would be equally inquisitive, Ms. Kleine embarked on a 12-year journey through photographs and home movies, love letters and long-kept secrets to produce “Phyllis and Harold,” an impossibly self-involved portrait of a union far more commonplace than its offspring seem to believe.\n\nOnly when interviewing her parents separately in their Long Island home and eliciting wildly different descriptions of the early years of their marriage (“I was always angry.” “That was a wonderful time in my life.”), does Ms. Kleine briefly tap into something \u0097 a rhythm, a device that would have given her story form. But whether earnestly addressing the camera or engineering a phone call between Phyllis and her lover of four decades earlier, Ms. Kleine is unable to communicate a point, about either midcentury sexual mores or stifled suburban wives. A cascade of glamour shots \u0097 Phyllis languorous in a hammock or reclining in a field, always precisely posed \u0097 is of interest to no one but her relatives.\n\nThe problem with these my-family-was-messed-up-and-I need-to-share projects is that they require an audience of complete strangers to give a damn. And while we sometimes do, it’s usually because the material is inherently compelling (“Tarnation”) or the filmmaking uncovers truths beyond the template of family therapy (“51 Birch Street”). Sadly, “Phyllis and Harold” fulfills neither requirement.\n\nPHYLLIS AND HAROLD\n\nOpens on Friday in Manhattan.\n\nWritten, directed and produced by Cindy Kleine; director of photography, Claire Cario and Ms. Kleine; edited by Jonathan Oppenheim; music by Bruce Odland; animation by Lisa Crafts; released by Henry Jaglom and Rainbow Releasing. At the Cinema Village, 22 East 12th Street, Greenwich Village. Running time: 1 hour 24 minutes. This film is not rated."}, {"url": "https://www.nytimes.com/2013/04/03/movies/andre-gregory-before-and-after-dinner-by-cindy-kleine.html", "page_content": "“It’s the art of being, not the act of performing,” the experimental-theater director André Gregory muses in “André Gregory: Before and After Dinner,” an indelible, gripping documentary portrait by his wife, Cindy Kleine. “Even emotion can be a mask.”\n\nMr. Gregory, a self-described shaman, is reflecting on how he coaxes actors into being themselves during rehearsals of “The Master Builder,” by Ibsen. He compares the directorial process, carried out with subtle, encouraging hand gestures, to conducting an orchestra. Of his anything-goes acceptance of actors’ whims, he declares, “I create a playground for demented children, where there are no mistakes, there is no judgment.” He also pays eloquent tribute to the Polish avant-garde director Jerzy Grotowski, who, along with Bertolt Brecht, was a major formative influence.\n\nThe Ibsen production, about 14 years in the making, was unveiled last year for a tiny invited audience during four weeks of “open rehearsals” at an East Village art club. During the film’s scenes of Mr. Gregory at work, his theatrical direction suggests hocus-pocus conjuring. His production of “The Master Builder” has since been filmed by Jonathan Demme under the working title “Wally and André Shoot Ibsen.” Wally is the playwright and actor Wallace Shawn, in the lead role.\n\nMr. Shawn is also Mr. Gregory’s dining companion in Louis Malle’s 1981 classic, “My Dinner With André,” a revelatory personal and philosophical dialogue between Mr. Gregory, who plays a version of himself as a risk-taking psychic adventurer, and Mr. Shawn, who champions comfort, continuity and simple pleasures. “Before and After Dinner,” which includes wonderful excerpts from that film, feels almost like a sequel."}, {"url": "https://www.huffpost.com/entry/all-about-her-mother-cind_b_469162", "page_content": "To say that director Cindy Kleine spins her search for truth into an art form only begins to describe the new film, Phyllis and Harold, documenting the bewildering marriage of her parents. While father Harold remains a dark and shadowy figure, mother Phyllis is eventually painstakingly and fully fleshed out. The deeper focus and graphic details, which reveal the subtle and sometimes secret aspects of her mother's life, could not be revealed until Harold passed away in 2003. And, I won't spoil the accruing dramatic suspense by being too specific here. Suffice it to say, its impact is powerful and poignant.\n\nThe feelings the film evokes remind one of a first reading of Betty Friedan's The Feminine Mystique in which essential aspects of one's own mother or grandmother were given credence and revealed as never before. Phyllis and Harold is the perfect companion piece to Friedan's seminal work on the quiet plight of suburban women in the 1940s and 50s, proving once again that life was anything but pure and simple way back when.\n\nAdvertisement\n\nLike Friedan's book, Cindy Kleine's film has captured something quietly but essentially tragic about many American women who were born in the 1920s and 30s. While this film is a very individual and unique unfolding of Klein's mother Phyllis' deeply complicated, lifelong dilemma, it also strikes notes of universality many will recognize as they recall the lives of the women from the WWII generation in their own families. In choosing duty and loyalty over satisfaction and a greater sense of freedom, these women stayed home, remained trapped, and suffered in silence.\n\nBut a mother's deep unhappiness and yearning for something missing (or in Phyllis' case someone who is missing) -- even when veiled by middle-class props such as a killer wardrobe, a tastefully decorated home, a pool in the back yard, and trips abroad -- seldom go unnoticed by her own children. It's striking to hear Harold recall the story of their 59-year marriage and compare it with Phyllis' recollections and those of her two sensitive and observant daughters.\n\nPhyllis' story is a heartbreaker, but so too is the effect it had on Cindy Kleine and her sister who are also interviewed. They worshipped their mother even though most of the time she was only half there. Kleine's extraordinary empathy and insight into her mother as well as her early exposure to photography which developed her visual sensibilities thanks to her father are the some of the elements that make this film so effective and ring so true. Ironically, the film -- unlike Phyllis' real life -- allows her ultimately to be revealed a whole human being.\n\nPhyllis and Harold. directed, produced, and written by Cindy Kleine. Opens in NYC on February 19, 2010. Limited release.\n\nAdvertisement\n\nActress Jean Simmons: Leading Lady in Her Final Film\n\nBorn nine years after Phyllis, the actress Jean Simmons shares some things in common with her. Simmons' career flourished through almost three decades before it began to wane in the late 1960s. Her second husband, film director Richard Brooks, sensed this frustration as well as problems with alcohol use and the effects of the increasing invisibility of middle age and an unhappy marriage. He created the film The Happy Ending especially for her. Released in an important and transitional year in Hollywood--1969--it was far from a perfect movie, but Jean Simmons made the most of a role that paralleled her life so closely and was nominated--a second time--for an Academy Award. It's another film that tries to make sense of Friedan's feminine mystique--that awful, nagging sense that something in life is missing.\n\n\n\nJean Simmons (1929-2010).\n\nSimmons always made wildly interesting if not important movies -- whether theatrically released or for television -- in almost every decade following her film debut in 1944 at the age of 15. 1940s: Great Expectations, Hamlet; 1950s: Young Bess, The Actress, Until They Sail; 1960s: Elmer Gantry, Spartacus ;1970s: Mr. Sycamore, Dominique, The Eastern Promise; 1980s: December Flowers, The Thornbirds, (television remake) Great Expectations; 1990s: How to Make an American Quilt.\n\nShe was luminous in black and white as well as Technicolor and shined brightly in quirky, contemporary dramas (Mister Buddwing, 1966) as well as in lavish, period pieces (The Robe, 1953). She even bridged the gap to musicals starring with Marlon Brando and Frank Sinatra in Guys and Dolls (1955) and unlike her contemporaries Audrey Hepburn, Deborah Kerr, and Natalie Wood her singing voice was not dubbed by Marnie Nixon.\n\nHer final decade included a wide variety of work: serving as narrator of PBS's American Masters series' documentary on legendary Hollywood director George Cukor (On Cukor); playing Countess Lucinda Rhives in Winter Solstice alongside Geraldine Chaplin and Peter Ustinov; and in the English version of the critically acclaimed animated feature Howl's Moving Castle, she teamed up with Lauren Bacall, Christian Bale, Blythe Danner, and Emily Mortimer lending their voices to Hayao Miyakazi's rich characters in which Simmons played Grandma Sophie to great effect.\n\nAdvertisement"}, {"url": "https://art21.org/news/", "page_content": "Welcome to your watchlist\n\nLook for the plus icon next to videos throughout the site to add them here.\n\nSave videos to watch later, or make a selection to play back-to-back using the autoplay feature."}]}