{"Cindy Kleine is a professor.": [{"url": "https://cindykleine.com/bio/index.html", "page_content": "Filmmaker Cindy Kleine’s prolific career began when she was an undergraduate at The Museum School and the legendary MIT Film/Video Section, studying with Richard Leacock, influenced by visiting filmmakers Robert Frank and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of family dramas, including the acclaimed features, André Gregory: Before and After Dinner, a personal portrait of her renowned theatre director husband, and Phyllis and Harold, an intense probe of her parents' disastrous fifty-nine year marriage. In her short films Kleine has made friends and artists her subjects: The Starn Twins in Doug and Mike, Mike and Doug, outsider artists in Inside Out, and grad school colleagues in Holy Matter, and she's explored the mysteries and foibles of romantic love in poetically framed psychodramas Secrets of Cindy and Passage.\n\nKleine's films have been exhibited at many international festivals including Telluride, Seattle, San Francisco, Boston, Vancouver, Santa Fe, DokLeipzig, and Provincetown, and in theatres and museums such as Film Forum, The Walter Reade Theater at Lincoln Center and Anthology Film Archives in NYC, The Music Hall in Los Angeles, The Museum of Fine Arts and The Coolidge Corner Theatre in Boston, The ICA in London and The Center d'art Contemporain in Lyon, France. Her film, Doug and Mike, Mike and Doug was broadcast on PBS's POV Film Series.\n\nKleine has received awards and fellowships from The American Film Institute, The Iowa Independent Film Festival, The Jewish Eye (Israel), The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School and The New School for Social Research.\n\nAlongside her film career, Kleine has continued to paint, and for the last several years has been working in still photography. Several bodies of that work are represented in the ARTWORK section.\n\n↓ Download CV"}, {"url": "https://www.huffpost.com/author/cindy-kleine", "page_content": "Cindy Kleine is a film and video artist whose prolific career began when she was an undergraduate at The Museum School and at the legendary (and long-gone) MIT Film/Video Section, studying with Richard Leacock and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of documentary work which are family dramas: camera visits with her grandmother and her sister, and intense probes of her parents’ fifty-nine years of a dubious, fractured marriage. Additionally, Kleine has gone outside of family for films about odd artists and off-the-wall musicians; and she’s gone inside herself for some deeply personal, poetically framed psychodramas about love lost, the spirit gained.\n\n\n\nKleine’s films have been exhibited at many international festivals, including: Telluride, Seattle, San Francisco, Salsomaggiore, and Vancouver, and at such venues as The Museum of Fine Arts in Boston, The Knitting Factory and Anthology Film Archives in NYC, The ICA in London and The Center d’art Contemporain in Lyon, France. Her film, \"Doug and Mike, Mike and Doug,\" about the artists Starn Twins, was broadcast on PBS’s POV Film Series.\n\n\n\nMs. Kleine has received awards and fellowships from The American Film Institute, The U.S. S-8 Film and Digital Video Festival, The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School, Boston, and The New School for Social Research. She lives with her husband, theatre director, actor, playwright and painter Andre Gregory, and their two cats, in New York City and on Cape Cod.\n\nShow Full Bio"}, {"url": "https://www.howold.co/person/cindy-kleine/biography", "page_content": "Cindy Kleine Biography\n\nAmerican filmmaker\n\nCindy Kleine is an American film director, producer and video artist.\n\nShe grew up on Long Island. In 2000, she married actor and filmmaker Andre Gregory. Kleine's 2013 do*entary Andre Gregory: Before and After Dinner is about him. It was funded through Kickstarter.\n\nKleine studied film at The Museum School and the MIT Film/Video Section, studying with Richard Lea*. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts in 1983 and a Master's of Fine Arts from Bard College in 1996.\n\nKleine's films have been shown at many film festivals, including Telluride, Seattle, San Francisco, Vancouver, the Boston Independent Film Festival, at the It’s All True International Do*entary Festival in Brazil, the DOK Leipzig International Festival, and the Santa Fe International Film Festival. Her film Doug and Mike, Mike and Doug (1989), about artists Doug and Mike Starn- Starn Twins, was broadcast on PBS's POV Film Series.\n\nKleine's film Phyllis and Harold (2008) is about her parents' 59-year marriage. The film won Best Feature Length Do*entary at the 2009 World Jewish Film Festival, in Ashkelon, Israel, and the Orson Welles Award for Innovative Filmmaking at the 2008 Iowa Independent Film Festival. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), P*age (1991) and Holy Matter (1996).\n\nKleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98).\n\nReferences\n\nExternal links"}, {"url": "https://www.huffpost.com/entry/all-about-her-mother-cind_b_469162", "page_content": "To say that director Cindy Kleine spins her search for truth into an art form only begins to describe the new film, Phyllis and Harold, documenting the bewildering marriage of her parents. While father Harold remains a dark and shadowy figure, mother Phyllis is eventually painstakingly and fully fleshed out. The deeper focus and graphic details, which reveal the subtle and sometimes secret aspects of her mother's life, could not be revealed until Harold passed away in 2003. And, I won't spoil the accruing dramatic suspense by being too specific here. Suffice it to say, its impact is powerful and poignant.\n\nThe feelings the film evokes remind one of a first reading of Betty Friedan's The Feminine Mystique in which essential aspects of one's own mother or grandmother were given credence and revealed as never before. Phyllis and Harold is the perfect companion piece to Friedan's seminal work on the quiet plight of suburban women in the 1940s and 50s, proving once again that life was anything but pure and simple way back when.\n\nAdvertisement\n\nLike Friedan's book, Cindy Kleine's film has captured something quietly but essentially tragic about many American women who were born in the 1920s and 30s. While this film is a very individual and unique unfolding of Klein's mother Phyllis' deeply complicated, lifelong dilemma, it also strikes notes of universality many will recognize as they recall the lives of the women from the WWII generation in their own families. In choosing duty and loyalty over satisfaction and a greater sense of freedom, these women stayed home, remained trapped, and suffered in silence.\n\nBut a mother's deep unhappiness and yearning for something missing (or in Phyllis' case someone who is missing) -- even when veiled by middle-class props such as a killer wardrobe, a tastefully decorated home, a pool in the back yard, and trips abroad -- seldom go unnoticed by her own children. It's striking to hear Harold recall the story of their 59-year marriage and compare it with Phyllis' recollections and those of her two sensitive and observant daughters.\n\nPhyllis' story is a heartbreaker, but so too is the effect it had on Cindy Kleine and her sister who are also interviewed. They worshipped their mother even though most of the time she was only half there. Kleine's extraordinary empathy and insight into her mother as well as her early exposure to photography which developed her visual sensibilities thanks to her father are the some of the elements that make this film so effective and ring so true. Ironically, the film -- unlike Phyllis' real life -- allows her ultimately to be revealed a whole human being.\n\nPhyllis and Harold. directed, produced, and written by Cindy Kleine. Opens in NYC on February 19, 2010. Limited release.\n\nAdvertisement\n\nActress Jean Simmons: Leading Lady in Her Final Film\n\nBorn nine years after Phyllis, the actress Jean Simmons shares some things in common with her. Simmons' career flourished through almost three decades before it began to wane in the late 1960s. Her second husband, film director Richard Brooks, sensed this frustration as well as problems with alcohol use and the effects of the increasing invisibility of middle age and an unhappy marriage. He created the film The Happy Ending especially for her. Released in an important and transitional year in Hollywood--1969--it was far from a perfect movie, but Jean Simmons made the most of a role that paralleled her life so closely and was nominated--a second time--for an Academy Award. It's another film that tries to make sense of Friedan's feminine mystique--that awful, nagging sense that something in life is missing.\n\n\n\nJean Simmons (1929-2010).\n\nSimmons always made wildly interesting if not important movies -- whether theatrically released or for television -- in almost every decade following her film debut in 1944 at the age of 15. 1940s: Great Expectations, Hamlet; 1950s: Young Bess, The Actress, Until They Sail; 1960s: Elmer Gantry, Spartacus ;1970s: Mr. Sycamore, Dominique, The Eastern Promise; 1980s: December Flowers, The Thornbirds, (television remake) Great Expectations; 1990s: How to Make an American Quilt.\n\nShe was luminous in black and white as well as Technicolor and shined brightly in quirky, contemporary dramas (Mister Buddwing, 1966) as well as in lavish, period pieces (The Robe, 1953). She even bridged the gap to musicals starring with Marlon Brando and Frank Sinatra in Guys and Dolls (1955) and unlike her contemporaries Audrey Hepburn, Deborah Kerr, and Natalie Wood her singing voice was not dubbed by Marnie Nixon.\n\nHer final decade included a wide variety of work: serving as narrator of PBS's American Masters series' documentary on legendary Hollywood director George Cukor (On Cukor); playing Countess Lucinda Rhives in Winter Solstice alongside Geraldine Chaplin and Peter Ustinov; and in the English version of the critically acclaimed animated feature Howl's Moving Castle, she teamed up with Lauren Bacall, Christian Bale, Blythe Danner, and Emily Mortimer lending their voices to Hayao Miyakazi's rich characters in which Simmons played Grandma Sophie to great effect.\n\nAdvertisement"}, {"url": "https://www.wbur.org/news/2013/08/01/andre-gregory-kleine", "page_content": "Fifteen years ago filmmaker Cindy Kleine fell in love with André Gregory, a legendary theater director known more for co-writing and playing a version of himself in 1981’s conversational film drama “My Dinner With André.” (Other moviegoers might associate him more for getting his eye gouged out in the 1993 blockbuster, “Demolition Man.”)\n\nWhen Kleine and Gregory married she was 39 and he was 63. Over time the age gap became more palpable and stirred her documentarian’s impulse to freeze time. Part love letter (that occasionally borders on too intimate) and part artist portrait, Kleine’s documentary, “André Gregory: Before and After Dinner,” opens today at the Museum of Fine Arts, Boston and runs through Aug. 9. Kleine and Gregory will be present at tonight’s 7:30 screening to answer questions.\n\nFrom \"André Gregory: Before And After Dinner.\" (Courtesy, Cinema Guild)\n\nKleine, who narrates, sets a convivial pace and tone, best illustrated during a scene when she catalogs the 18 boyfriends who preceded Gregory. Photographs of each man flips by as Kleine lists, “Jonathan, Rob, Fernando, Rob ...” How did she manage such thorough record-keeping pre-Instagram? And so few clothes!\n\nKleine studied filmmaking at The Museum School and at MIT under Richard Leacock, who knew a thing or two about personal documentaries. Her last documentary, “Phyllis and Harold,” held a microscope to her parents’ 59-year marriage. (It premiered in Boston as part of the Boston Jewish Film Festival and this run is also co-presented by BJFF.)\n\nHere, the marriage is unquestionably strong. Kleine pokes fun at Gregory’s close friendship and life-long collaboration with actor/writer Wallace Shawn, who appears frequently in “Before and After Dinner” and was his foil in “My Dinner With André.” And Gregory calls this friendship his “second marriage,” but it’s lighthearted. Kleine is yang to Gregory’s yin. In his youth he was never hugged, he says. In her family, “fighting was the primary means of communication and everyone talked at once.”\n\nKleine steps into the background and devotes the second part of the film to Gregory, with fascinating footage from his formative days in experimental theater (the Richard Avedon stills from “Alice’s Adventures in Wonderland” are a knock-out) and a peppering of Gregory’s theatrical wisdom and anecdotes told to wide-eyed, nodding listeners.\n\nIn one scene Gregory spins a delicate yarn about his first kiss, which just happened to take place in a moonlit, Marblehead, Mass. cemetery. His knees buckled and he fainted. In another, he recalls a moment of hysterical blindness.\n\nThough both are Jewish, Gregory’s parents maintained a severely tight lip in this regard and the nature of his father’s relationship to the highest ranks of Nazi leadership continues to plague him and occupies a major thread of this film. Yet, as compelling as it to delve into the underpinnings of Gregory’s artistic drive, which he attributes to his terrifying father, the most gripping moments come while he’s directing Ibsen’s “The Master Builder” in his living room.\n\nWhat sets him apart as director, we learn, is his willingness to take the time that a production needs — he rehearsed “The Master Builder” for 14 years, for example. His obsession with \"Uncle Vanya\" was documented in \"Vanya on 42nd Street\" by Louis Malle, who also filmed \"My Dinner with André.\" Gregory also has an incorrigible trust in the actors he chooses. “I never audition an actor I only interview them,” he says.\n\nThere’s a discomfort at first with how long shots linger on Gregory’s intense, piercing gaze while actors deliver their lines off camera. An hour or so into this film, convinced of his portrait as a bottomless well of artistic chutzpah and encouragement, we are desperate to watch only his reactions. The act of directing, or life itself, is manifest in every line of his face.\n\nErin Trahan edits the online film magazine The Independent and moderates the current season of The DocYard. you can reach her at erin@erintrahan.net."}, {"url": "https://www.hollywoodreporter.com/movies/movie-reviews/phyllis-and-harold-film-review-29331/", "page_content": "Maybe it’s something in the water in Long Island’s Queens and Nassau counties, but such documentaries as “51 Birch Street,” “Capturing the Friedmans” and “Crazy Love” have introduced us to seemingly familiar New York-area families, only to reveal corners that were dark (in the case of “Birch”), disturbing and pathological (“Friedmans”) and flat-out crazed and nutty (“Crazy Love”).\n\nIn “Phyllis and Harold,” a look at her parents Phyllis and Harold Kleine, now deceased, filmmaker Cindy Kleine hits a mushy, murky, mediocre middle ground. Like many of their peers, the Kleines came from Manhattan’s impoverished Lower East Side and made it to the suburbs, where they achieved a life of material comfort that included a beautifully landscaped house, nanny, and much international travel. Credit Harold’s success as a dentist and the new money his career generated.\n\nThe Bottom Line Empty\n\nVia interviews with her mother and father, who tend not to be in the same shot, we learn that their love letters were effusive but that the 59-year marriage that ensued was a grave disappointment, especially to Phyllis. She groans, grimaces and complains as she reveals the great love of her life with whom she cheated during the very early and very late years of her marriage.\n\nHarold, on the other hand, is the poster child for denial. Seemingly numbed and clueless, he views the marriage positively.\n\nIf Phyllis did not enjoy the long marital ride, the problem for viewers might be that even an hour-plus with these two could be too much. In fact, none of the family members is great company, as eloquence, self-knowledge and empathy are in short supply. Boxoffice prospects are pretty limited.\n\nThe only spark here is Phyllis’ adulterous affair, but with no clues to the identity, personality or character of the mysterious — and married — lover, he never comes to life in any way. Yes, Phyllis convincingly pines for him, and daughters Cindy and Ricky share their collusion in keeping the affair a secret from their father. Apparently, their cooperation, which included helping Phyllis secretly doll up for trysts at Ricky’s apartment, was critical since Harold micromanaged all of the family finances, including the monitoring of credit cards and phone calls.\n\nAfter Harold dies, Phyllis moves easily into the next phase of her life in nice assisted-living quarters in downtown Manhattan. She fails in her effort to reconnect with her lover and expresses not an iota of remorse at her husband’s passing. Love here, wedded to her affair and not to her marriage, has nothing to do with family. “He showed me the world” is her only clue to why she went the 59-year distance with Harold.\n\nMade over many years, “Phyllis and Harold” offers the requisite home movies and photographs evoking lives lived decades ago. But the archival material provides no more than lighter family moments, including Phyllis and Harold’s far-flung travels. Many presumed friends and other family members seen go unidentified.\n\nFortunately, Lisa Crafts’ colorful animation intermittently brings welcome charm and life to this otherwise dreary tale.\n\nSo what is it about? The lessons that emerge are that families aren’t what they seem, aging alters us, and true and lasting love is rare. Who knew?\n\n\n\nOpens: Friday, Feb. 19 (Rainbow Releasing)\n\nProduction: Silver Penny Pictures\n\nDirector-writer-producer: Cindy Kleine\n\nExecutive producer: Andre Gregory\n\nCo-producer/editor: Jonathan Oppenheim\n\nDirectors of photography: Cindy Kleine, Claire Cario\n\nMusic: Bruce Odland\n\nAnimation: Lisa Crafts\n\nNo rating, 84 minutes"}, {"url": "https://celebritynetworthwiki.org/richest-directors/cindy-kleine-net-worth/", "page_content": "Cindy Kleine Net Worth is\n\n$11 Million\n\nCindy Kleine Bio/Wiki, Net Worth, Married 2018\n\nStructural Info\n\nFilmography Profession Director, Producer, Cinematographer Education Tufts University Spouse Andre Gregory Director Title Year Status Character Andre Gregory: Before and After Dinner 2013 Documentary Phyllis and Harold 2008 Documentary Inside Out 2004 Documentary short Doug and Mike, Mike and Doug 1989 Documentary short Producer Title Year Status Character Andre Gregory: Before and After Dinner 2013 Documentary producer Phyllis and Harold 2008 Documentary producer Inside Out 2004 Documentary short producer Doug and Mike, Mike and Doug 1989 Documentary short producer Cinematographer Title Year Status Character Doug and Mike, Mike and Doug 1989 Documentary short Camera Department Title Year Status Character Andre Gregory: Before and After Dinner 2013 Documentary additional photography Editor Title Year Status Character Doug and Mike, Mike and Doug 1989 Documentary short Miscellaneous Title Year Status Character Nocturne 1998/II Short crew Self Title Year Status Character Charlie Rose 2013 TV Series Herself - Guest\n\nKnown for movies\n\nAndre Gregory: Before and After Dinner (2013)\n\nas Director Phyllis and Harold (2008)\n\nas Director Doug and Mike, Mike and Doug (1989)\n\nas Director Inside Out (2004)\n\nas Director\n\nTags\n\nCindy Kleine is a film-maker, director, producer and video artist. She grew up on Long Island. In 2000, she married actor and film maker Andre Gregory. Her 2013 documentary, Before and After Dinner is about Andre Gregory. The film was funded through KickStarter.Ms. Kleine studied film at The Museum School and at the now closed M.I.T. Film/Video Section, studying with Richard Leacock. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts, in 1983 and received a Masters of Fine Arts from Bard College in 1996.Ms. Kleine's films have been shown at film festivals including Telluride, Seattle, San Francisco and Vancouver. Her films have been shown at The Boston Independent Film Festival, It's All True, Brazil, D.O.C. Leipzig, and The Santa Fe Int. Film Festival. Her film, \"Doug and Mike, Mike and Doug,\" (1989) about the artists Starn Twins, was broadcast on P.B.S.’s P.O.V. Film Series. The film \"Phyllis and Harold,\" (2008) was about her parents' marriage of fifty-nine years. The film won, Best Feature Length Documentary at the World Jewish Film Festival, Ashkelon, Israel, 2009 and the Orson Welles Award for Innovative Filmmaking at the Iowa Independent Film Festival, April 2008. Ms. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), Passage (1991) and Holy Matter (1996).Ms. Kleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98).﻿﻿﻿﻿﻿﻿"}, {"url": "https://networthpost.org/net-worth/cindy-kleine-net-worth/", "page_content": "Cindy Kleine net worth is\n\n$1.3 Million\n\nCindy Kleine Wiki: Salary, Married, Wedding, Spouse, Family\n\nStructural Info\n\nFilmography Net Worth $1.3 Million Profession Director, Producer, Cinematographer Education Tufts University Spouse Andre Gregory Nicknames Cindy Kleine, Kleine, Cindy Director Title Year Status Character Andre Gregory: Before and After Dinner 2013 Documentary Phyllis and Harold 2008 Documentary Inside Out 2004 Documentary short Doug and Mike, Mike and Doug 1989 Documentary short Producer Title Year Status Character Andre Gregory: Before and After Dinner 2013 Documentary producer Phyllis and Harold 2008 Documentary producer Inside Out 2004 Documentary short producer Doug and Mike, Mike and Doug 1989 Documentary short producer Cinematographer Title Year Status Character Doug and Mike, Mike and Doug 1989 Documentary short Camera Department Title Year Status Character Andre Gregory: Before and After Dinner 2013 Documentary additional photography Editor Title Year Status Character Doug and Mike, Mike and Doug 1989 Documentary short Miscellaneous Title Year Status Character Nocturne 1998/II Short crew Self Title Year Status Character Charlie Rose 2013 TV Series Herself - Guest\n\nKnown for movies\n\nAndre Gregory: Before and After Dinner (2013)\n\nas Director Phyllis and Harold (2008)\n\nas Director Doug and Mike, Mike and Doug (1989)\n\nas Director Inside Out (2004)\n\nas Director\n\nCindy Kleine is a film-maker, director, producer and video artist. She grew up on Long Island. In 2000, she married actor and film maker Andre Gregory. Her 2013 documentary, Before and After Dinner is about Andre Gregory. The film was funded through KickStarter.Ms. Kleine studied film at The Museum School and at the now closed M.I.T. Film/Video Section, studying with Richard Leacock. She received a Bachelor of Fine Arts from Tufts University and the School of the Museum of Fine Arts, in 1983 and received a Masters of Fine Arts from Bard College in 1996.Ms. Kleine's films have been shown at film festivals including Telluride, Seattle, San Francisco and Vancouver. Her films have been shown at The Boston Independent Film Festival, It's All True, Brazil, D.O.C. Leipzig, and The Santa Fe Int. Film Festival. Her film, \"Doug and Mike, Mike and Doug,\" (1989) about the artists Starn Twins, was broadcast on P.B.S.’s P.O.V. Film Series. The film \"Phyllis and Harold,\" (2008) was about her parents' marriage of fifty-nine years. The film won, Best Feature Length Documentary at the World Jewish Film Festival, Ashkelon, Israel, 2009 and the Orson Welles Award for Innovative Filmmaking at the Iowa Independent Film Festival, April 2008. Ms. Kleine's other films include Inside Out (2004), Til Death Do Us Part (1998), Secrets of Cindy (1983), Passage (1991) and Holy Matter (1996).Ms. Kleine has worked at Boston College (1985–98), Harvard University (1990–91), School of the Museum of Fine Arts (1996–97) and The New School (1996-98).﻿﻿﻿﻿﻿﻿"}, {"url": "http://www.cindykleine.com/bio/index.html", "page_content": "Filmmaker Cindy Kleine’s prolific career began when she was an undergraduate at The Museum School and the legendary MIT Film/Video Section, studying with Richard Leacock, influenced by visiting filmmakers Robert Frank and Ed Pincus, and among a legion of future filmmakers in the program, including Ross McElwee, Robb Moss and John Gianvito. In line with Boston peers, Kleine has developed a central body of family dramas, including the acclaimed features, André Gregory: Before and After Dinner, a personal portrait of her renowned theatre director husband, and Phyllis and Harold, an intense probe of her parents' disastrous fifty-nine year marriage. In her short films Kleine has made friends and artists her subjects: The Starn Twins in Doug and Mike, Mike and Doug, outsider artists in Inside Out, and grad school colleagues in Holy Matter, and she's explored the mysteries and foibles of romantic love in poetically framed psychodramas Secrets of Cindy and Passage.\n\nKleine's films have been exhibited at many international festivals including Telluride, Seattle, San Francisco, Boston, Vancouver, Santa Fe, DokLeipzig, and Provincetown, and in theatres and museums such as Film Forum, The Walter Reade Theater at Lincoln Center and Anthology Film Archives in NYC, The Music Hall in Los Angeles, The Museum of Fine Arts and The Coolidge Corner Theatre in Boston, The ICA in London and The Center d'art Contemporain in Lyon, France. Her film, Doug and Mike, Mike and Doug was broadcast on PBS's POV Film Series.\n\nKleine has received awards and fellowships from The American Film Institute, The Iowa Independent Film Festival, The Jewish Eye (Israel), The MacDowell Colony, The Bard College MFA Fellowship Program, and The New England Regional Fellowship Program. She has taught filmmaking at Boston College, Harvard University, The Museum School and The New School for Social Research.\n\nAlongside her film career, Kleine has continued to paint, and for the last several years has been working in still photography. Several bodies of that work are represented in the ARTWORK section.\n\n↓ Download CV"}, {"url": "https://variety.com/2013/film/reviews/film-review-andre-gregory-before-and-after-dinner-1200332279/", "page_content": "Cindy Kleine pays tribute to her famed theater-director hubby in “Andre Gregory: Before and After Dinner,” with thoroughly delightful results. Gregory’s tale-spinning fluency dazzles just as much as it did in Louis Malle’s “My Dinner With Andre,” but this time with a wry familiarity all Kleine’s own. Shot at home or in various improvised rehearsal spaces — with much photographic evidence of Gregory’s sterile, unhappy childhood, as well as occasional clips from “My Dinner With Andre” and the other filmed Gregory/Wallace Shawn collaboration, “Vanya on 42nd Street” — the film juxtaposes work and biography with wondrous open-endedness, and should enchant fans as well as those new to the table.\n\nInterspersed with various reminiscences of past productions by Gregory and his regular actors, Kleine affords tantalizing glimpses of the helmer’s greatest hits, chief among them his celebrated “Alice in Wonderland,” which ran for seven years in the 1970s. The only remaining traces of “Alice” stagecraft appear in Richard Avedon’s famous book of photographs and in short film snippets, including scenes with the three-man caterpillar and a satisfyingly chaotic tea-party excerpt. “Alice” also allows Gregory to establish a link between his private and professional lives, never very separate in any case: “ ‘Alice’ was the portrait of my childhood … plummeted into this horrifying, terrifying, insane world where everyone’s a mindfucker.”\n\nKleine neither elides nor naturalizes her own presence in Gregory’s life; her grounding in their shared experience instead lends a welcome, matter-of-fact transparency to the proceedings. Husband and wife had radically different Jewish childhoods, although Kleine contents herself with mere snapshots of her loud, argumentative Long Island clan, having seemingly laid those ghosts to rest in her fascinating documentary “Phyllis and Harold” (the poster for which is seen prominently on a wall in the background).\n\nBy contrast, Gregory’s upper-class Russian-Jewish family, which he likens to the despotic rulers of a small Balkan state, still exerts a certain awful fascination. Pursuing a respected historian’s claim that Gregory’s father collaborated with Hitler to destabilize the franc prior to WWII, Gregory hires researchers in Paris and Berlin to investigate the charges.\n\nThe film also continues “My Dinner With Andre’s” dialogue, Shawn functioning here as part of a dialectic between life and art. During ongoing rehearsals for “The Master Builder” (a work in progress for 14 years), Gregory sits languidly conducting a scene, in relaxed harmony with surrounding friends and family; meanwhile, in a corner of the frame, Shawn positively vibrates with knife-edge tension as Ibsen’s title character. This dual focus extends to the film’s final scene, where whether art is imitating life or vice versa is anyone’s guess.\n\nAndre Gregory: Before and After Dinner\n\n(Documentary)\n\nReviewed on DVD, New York, March 31, 2013. Running time: 108 MIN.\n\nA Cinema Guild release of an Atlas Theater Company presentation of a Cindy Kleine production. Produced by Cindy Kleine. Co-producers, Jonathan Oppenheim, Susan Lazarus.\n\nDirected by Cindy Kleine. Camera (color, HD), Tom Hurwitz; editor, Jonathan Oppenheim; music, Bruce Odland; sound (Dolby Digital), Peter Miller; supervising sound editor/re-recording mixer, Sean Garnhart; animation, Lisa Crafts.\n\nWith: Andre Gregory, Wallace Shawn, Lisa Joyce, Julie Hagerty, Larry Pine, Cindy Kleine."}], "Cindy Kleine teaches at the School of Visual Arts in New York City.": [{"url": "https://www.dezeen.com/2022/05/26/school-of-visual-arts-design-schoolshows/", "page_content": "Dezeen School Shows: an experimental fashion complex that combines design and research and a bird-watching centre designed as an \"oasis of New York's wildlife for city kids\" are included in Dezeen's latest school show by students at the School of Visual Arts.\n\nAlso included is an agricultural centre that aims to address food access issues and an industrial heritage site intended to connect scientists and engineers.\n\nSchool of Visual Arts\n\nSchool: School of Visual Arts\n\nCourses: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nSchool statement:\n\n\"The 2022 SVA Interior Design: Built Environments Senior Thesis addresses a wide range of project types, combining them to create a sensitive aesthetic interpretation of our built environment that centers on sustainability and responsibility.\n\n\"This year, students brought a new vision to classic programmes, such as fashion houses, hotels, spas and community centres, utilising biophilic and technological design to redefine these interior spaces and places for the 21st century.\"\n\nBaixinggaole by Botao Wang\n\n\"The Tengger desert in central north China bordering Mongolia continues to expand, merging with two other deserts, the Ulanbuh and Badain Jaran. This expansion is beginning to threaten some of the larger urban areas in northern China. Since 1958, the National Forestry and Grassland Administration has started 'afforestation' programmes to create green belts to stop this desert expansion.\n\n\"Baixinggaole is a research and residential station at the forefront of this afforestation programme. This scientific oasis in the desert will provide greenhouses, laboratories, living quarters for scientists, educators, workers and visitors, and an educational centre for visitors to learn and get involved in.\"\n\nStudent: Botao Wang\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: bwang5[at]sva.edu\n\nSHAN山 by Junyan Lu\n\n\"SHAN山, is a Chinese cultural centre located on the edge of the historical Chinatown district in New York City. SHAN山's mountain form will serve as a touchstone for the Chinese American community, as well as be a dynamic new space showcasing the diversity of the most populous country on Earth.\n\n\"SHAN山 will also promote the dynamic modern culture of China today, by linking both old and new. SHAN山 will be a centre that enhances and promotes these connections, giving the world a better understanding of the vibrant and rich culture of China.\"\n\nStudent: Junyan Lu\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: jlu12[at]sva.edu\n\nFushion by Gavin Xinze Li\n\n\"Fushion is an experimental space that aims to be a new prototype for a comprehensive fashion complex that combines research, design, fabrication and manufacturing.\n\n\"Fushion is located in a series of abandoned oil storage tanks on the seaside of the Bronx in New York City. The utilitarian and soon to be obsolete fossil fuel storage tank structures are reimagined for the 21st century where each one is transformed into specialised environments that allow for new processes and ideas in fashion to grow and flourish.\n\n\"The complex and its tanks are connected with the addition of a giant elevated cloud surface that functions both as a roof and an inspirational garden landscape. This cloud acts as a fabric drape over the existing monumental structures, softening the historic industrial artifacts and creating unique spaces for workers and visitors to experience.\"\n\nStudent: Gavin Xinze Li\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: xli36[at]sva.edu\n\nIntersection by Jiabao Li\n\n\"China's pop music has exploded in the last decade. Reality TV singing competition shows have created a large fan population eager to see their singing idols for fan meetings and showcases. There is a strong market for stars and fans to interact with each other outside of large concert halls.\n\n\"Smaller intimate music venues would be ideal places for this to occur, giving fans and music audiences an ability to see current and future music stars. Intersection is a music venue that will enhance the fan experience.\n\n\"In addition to live performances and intimate gathering spaces, it will be installed with the latest technologies such as XR and autostereoscopic, to create spaces that merge virtual and physical realities, enhancing and combining our digital and physical experiences with music.\"\n\nStudent: Jiabao Li\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: jli49[at]sva.edu\n\n\n\nOasis by Yoojin Lee\n\n\"Mental health challenges exist frequently throughout the United States and the world. Roughly one in five adults has a diagnosable mental illness in a given year, but less than half of affected people receive treatment.\n\n\"Oasis is a mental health centre that aims to treat people who have a mental illness and have difficulties accessing proper care. Impediments to mental health care are great, with costs and social stigma being major reasons many don't seek help.\n\n\"Oasis will offer a variety of programmes and activities, including psychotherapy, counselling and complementary health approaches that focus on food, physical activities, art, nutrition, etc.\n\n\"The space will use principles of biophilic design to create a calm and nurturing environment to help the users start and continue their journey in healing.\"\n\nStudent: Yoojin Lee\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: ylee145[at]sva.edu\n\nRefuge by Yudi Chen\n\n\"Refuge is a bird-watching visitor centre located in the Jamaica Bay Area of Queens, in New York City. This is an all-season refuge from the city and a bird's paradise. The facility features different exhibits that highlight Jamaica Bay's extraordinary animal and plant life and ecological history.\n\n\"With the outbreak of the global epidemic, harmony between humans, nature and animals has attracted more and more attention. A more convenient service guide attracts more people to come here to closely feel the charm of ecology — a veritable oasis of New York's wildlife for city kids.\"\n\nStudent: Yudi Chen\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: ychen98[at]sva.edu\n\n\n\nRe:Centered by Ariella Ahdut\n\n\"Being centered means having a reference point, a place to come back to when life, stress, and emotions push you off balance.\n\n\"Re:Centered is a holistic health and wellness centre based on the five elements of traditional Chinese medicine. The practice strives to maintain balance and harmony between the body, mind and environment.\n\n\"These five elements represent how all aspects of human health, like nutrition, movement, and emotions, are interconnected with nature and our surroundings.\n\n\"This design also employs biophilic design principles to create a calm and functional space for users, helping them lessen their anxiety and live more consciously.\n\n\"Re:Centered is a welcoming space where people can gather, reflect, or have meaningful interactions with like-minded individuals embarking on a new health journey.\"\n\nStudent: Ariella Ahdut\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: aahdut[at]sva.edu\n\nLong Island City Community Center by Shuangyu Xi\n\n\"Long Island City is a vibrant community in Queens New York City that is going through substantial growth and change. The population has increased by over 100 per cent between 2010 and 2020 and has a young median age of 34.\n\n\"To support the new and existing population, this new LIC Community Centre (LICCC) is created in the image of the vibrancy of the neighborhood.\n\n\"LICCC will be a gathering space for people of all ages and all backgrounds to come together for structured and unstructured activities throughout the day and evening.\"\n\nStudent: Shuangyu Xi\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: sxi[at]sva.edu\n\nHaven by Xiran Geng\n\n\"Our industrial heritage leaves behind not only physical monuments that embody past memories but also the trajectory from past to present to future. These buildings are a record of our collective history and memories of our ever-evolving city.\n\n\"Haven is a transitory residential community serving the reimagined manufacturing industry in Sunset Park, Brooklyn. The planned 3.3 gigawatt wind turbine farm off the coast of Long Island will be assembled at this industrial heritage site.\n\n\"The new workforce for this new economy manufacturing center could be the start of a renaissance for manufacturing jobs in New York City. Haven will be a hub connecting builders, researchers, engineers and scientists.\n\n\"Located within walking distance of the turbine assembly facility, Haven's residents will create a new standard for industry-supported housing.\"\n\nStudent: Xiran Geng\n\nCourses: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: xirangeng[at]gmail.com\n\nHomegrown by Sky Morales\n\n\"Homegrown is an urban agricultural center focused on education and production. It serves as a model to address food accessibility issues and provides resources for independent agriculture within urban spaces.\n\n\"It is important to celebrate food, not only to learn how you can grow it in the city but also to establish a connection with what you can grow. Homegrown was created with the intention of reconnecting people to their community.\n\n\"Within this centre are spaces programmed to fuel curiosity and empower community members to engage with one another as well as their surroundings.\"\n\nStudent: Sky Morales\n\nCourse: Senior Thesis\n\nTutors: Gita Nandan and Anthony Lee\n\nEmail: smorales3[at]sva.edu\n\nFind out more about courses at the School of Visual Arts on Dezeen Courses.\n\nPartnership content\n\nThis school show is a partnership between Dezeen and School of Visual Arts. Find out more about Dezeen partnership content here."}, {"url": "https://collegegazette.com/best-art-schools-in-new-york/", "page_content": "Thanks to New York City, the Empire State has no shortage of amazing art schools.\n\nBut that doesn’t mean students have to stay in the Big Apple to get a quality education. Greater New York state boasts some top-notch art schools, too.\n\nMany of these institutions offer several levels of art programs, from associates to terminal degrees, and some even give high schoolers a chance to study on campus and see what art school life is all about.\n\nStudents at a few schools will find opportunities to expand their studies into other subject areas thanks to interdisciplinary programs or to study abroad, spending a semester immersed in an artistically rich overseas environment.\n\nStudents interested in pursuing studies at art school will want to narrow down their focus and decide whether they simply want to study art, its history, and its role in society, or whether they want to become a working artist or designer.\n\nWhere they end up for school may depend on their ultimate career goals, since some schools offer only certain programs.\n\nStudents also may want to consider what type of community they want to learn in. Schools in New York City, for instance, put students closer to major museums and galleries that they can check out on their down time or even part of class.\n\nBelow, we’ll break down 10 of the best art schools in New York, what type of degrees they offer, and much more.\n\nSchool of Visual Arts (New York, NY)\n\nThe School of Visual Arts, located in the heart of New York City, has something for every type of student.\n\nIn the Pre-College program, high-schoolers can further develop their artistic skills and work toward putting together a portfolio.\n\nThat can help them prepare to join the school’s undergraduate program, in which they can earn a Bachelor of Fine Arts in 11 specialties, from Animation and Film to Advertising and Interior Design.\n\nThe school also offers undergraduate non-major programs.\n\nAt the graduate level, the options are even greater. Students can earn a Master of Arts in either Curatorial Practice or Design Research, Writing, and Criticism. Or, they can choose to earn a terminal degree, the Master of Fine Arts, in a dozen subjects.\n\nMeanwhile, students who want to use art differently can pursue the Master of Professional Studies in subjects including Art Therapy, Directing, and Fashion Photography.\n\nNew York Academy of Art (New York, NY)\n\nThe main program at the New York Academy of Art is the Master of Fine Arts. The two-year program consists of 60 credits, most of which students fulfill in studio artwork.\n\nStudents choose from drawing, painting, or sculpture as a concentration but also can pursue tracks in printmaking or anatomy. Courses give them experience in both traditional and modern art.\n\nUndergraduates interested in studying at NYAA can participate in its Summer Undergraduate Residency Program. This one-month residential program gives them added experience in the studio, where they can refine their technical skills as they prepare to one day join an MFA program.\n\nNYAA also offers a Certificate of Fine Art, which involves an intense curriculum geared toward people interested in learning about drawing, painting, or sculpture in a studio environment. The 36-credit program takes one calendar year to complete.\n\nBeginning artists interested in learning the basics of different mediums can join NYAA’s continuing education programs, which faculty members have offered live on Zoom during the coronavirus pandemic.\n\nSUNY Binghamton (Binghamton, NY)\n\nStudents can major or minor in art at SUNY Binghamton, which offers both Bachelor of Arts and Bachelor of Fine Arts degrees.\n\nIn the BFA program, students focus on one of five mediums, such as drawing or graphic design, but also take classes in art history and electives.\n\nThe program is designed for students who want to work as artists one day or move on to a graduate program. These students also must complete several studio courses before finishing their studies with the Senior Exhibition Seminar, which includes a display of their work.\n\nThe BA program, on the other hand, is geared for people who want to pursue a double major or gain some extra artistic skills through studio work.\n\nThey can major in six areas, including photography, sculpture, and painting. Students also take art history classes but do not need to complete the Senior Exhibition Seminar.\n\nUndergraduates who want to get some artistic experience can pursue the Studio Minor, a six-course studio program focusing on one of five artistic mediums.\n\nNew York University (New York, NY)\n\nNew York University’s students hone their skills and expand their knowledge in the artistically rich East Village of Manhattan.\n\nAt its Steinhardt Department of Art and Art Professions, the university offers both Bachelor and Master of Fine Arts degrees, which students earn through hands-on work as well as courses focusing on artistic theory.\n\nThe university brings in well-known artists as well as critics and scholars to further students’ understanding of art and its place in the world.\n\nStudents also can choose to pursue a Master of Art in subjects such as Visual Arts Administration and Costume Studies. The school offers a doctorate in Art Therapy as well.\n\nNo matter what they study, students also can take advantage of the numerous museums, theaters, and other artistic spaces that also call New York home, seeing firsthand artists at work.\n\nSUNY Purchase School of Art + Design (Purchase, NY)\n\nStudents have lots of options for studying at SUNY Purchase School of Art + Design, located less than an hour from New York City.\n\nIn the Bachelor of Fine Arts program, students can choose from five majors, including Graphic Design, Sculpture, and Photography. Or, they can pursue the Visual Arts BFA, an interdisciplinary option in which students study two visual arts mediums.\n\nStudents interested in interdisciplinary studies can also pursue a Bachelor of Science in Visual Arts. They split their time between visual arts studies in the School of Art + Design and one or more other subjects in a different school.\n\nThe school also offers a Minor in Visual Arts for undergraduates majoring in other subjects.\n\nAt the graduate level, Purchase offers an MFA in Visual Arts and a dual MFA in Visual Arts/MA in Art History program, with the history part offered through Purchase’s School of Humanities.\n\nSyracuse University School of Art (Syracuse, NY)\n\nThe School of Art at Syracuse University has been graduating students since 1875. Today’s students can choose from seven undergraduate and graduate programs of study.\n\nSyracuse offers three undergraduate Bachelor of Fine Arts degrees, in Arts Education, Illustration, and Studio Arts. The school also has one Bachelor of Science program, also in Studio Arts.\n\nUndergraduates studying other subjects who still want to receive an arts education can pursue the Visual Culture minor or the Studio Arts minor. They can choose from intensives such as Ceramics, Jewelry and Metalsmithing, and Painting.\n\nGraduate degree options include two Master of Fine Arts programs in Illustration and Studio Arts, and a Master of Science in Arts Education.\n\nThroughout the year, students learn from faculty members still working and exhibiting in their fields as well as hear from more than 30 guest artists through Syracuse’s Visiting Artist Lecture Series.\n\nCornell University College of Architecture, Art, and Planning (Ithaca, NY)\n\nStudents gain a well-rounded education in different artistic mediums through Cornell University’s undergraduate art program.\n\nRedesigned in 2018, the Bachelor of Fine Arts program consists of two parts: an art section that includes seminars as well as studio courses in different artistic mediums, such as photography and painting.\n\nStudents then round out their time at the university with electives from throughout the university to give them a well-rounded education. They also have a chance to study in semester-long programs at Cornell’s satellite campuses in New York City and Rome.\n\nTo earn the Master of Fine Arts degree, meanwhile, students spend two years in intensive study. Students learn not only from faculty in Ithaca but from two distinguished artistic mentors the department brings in each year, and they have opportunities for exhibiting their work as well.\n\nPratt Institute School of Design (Brooklyn, NY)\n\nStudents learn from world-class, award-winning professionals in the School of Art at the Pratt Institute School of Design.\n\nThe institute has two associate degree programs, which involve four semesters of study. Students can choose to study Graphic Design, Illustration, or Game Design and Interactive Media in the AOS program.\n\nThe AAS degree, though, in which students can study Graphic Design/Illustration or Painting/Drawing, prepares students to transfer into Pratt’s BFA after they finish their associate degree.\n\nBachelor’s degree students, meanwhile, have six departments in which they can study everything from the traditional Fine Arts to more modern mediums, like Game Arts.\n\nThe Art and Design Education path prepares students to become teachers themselves, whether it be in schools or for organizations like museums.\n\nGraduate students can pursue studies in many of the same fields as undergraduates as well as a few others specific to the master’s program, including Arts and Cultural Management and Creative Arts Therapy.\n\nThe New School Parsons School of Design (New York, NY)\n\nThe New School Parsons School of Design has three levels of degrees available.\n\nThe Associate Degrees are geared toward “mature students” who do not have a background in design and gives them the knowledge they need to pursue careers in Communication Design, Interior Design, and Fashion.\n\nParsons has a dozen undergraduate majors to choose from, 11 of which end in Bachelor of Fine Arts degrees. They include many different types of design, from Fashion to Architecture, as well as areas like Photography and Illustration.\n\nOr, students can pursue the Bachelor of Business Administration, which focuses on Strategic Design & Management, which Parsons offers both in New York and Paris.\n\nThe graduate program is even more diverse, with 20 degree programs. It also has a Master of Architecture program and a combined MArch/MFA focusing on Architecture and Lighting Design.\n\nCooper Union for the Advancement of Science and Art (New York, NY)\n\nPublic domain photo by Jim.henderson via Wikimedia Commons\n\nCooper Union’s School of Art has just one degree program, a Bachelor of Fine Arts that prepares students for careers as artists and designers.\n\nThe student experience begins with a “Foundation Program,” in which they learn about different mediums and artistic concepts and techniques.\n\nIn their sophomore year, students narrow their focus, choosing a discipline from areas like painting or photography. They take various studio courses as well as electives before moving on to more advanced study in their junior and senior years.\n\nIn their final year, students also participate in the Senior Presentation, in which they exhibit their work for the public.\n\nHigh school students can get a taste for the Cooper life during the Summer Art Intensive, in which students learn from professional artists and take in the sights of the New York City art world.\n\nThe students focus on a specific type of art and build a portfolio they can then submit with their college applications."}, {"url": "https://ischoolconnect.com/blog/best-art-schools-in-new-york/", "page_content": "New York City is one of the most important cities in the world for culture, art, and music. Naturally, many institutions in New York City offer a variety of art programs. These programs range from associate to doctoral degrees, and some of the institutions also welcome high school students to give them a taste of art school life. New York City is a haven for art enthusiasts, with some of the best galleries and art museums in the world and a global cultural scene. Students can also pursue interdisciplinary programs that can help them broaden their studies into other academic areas as well. Read the blog to know more about the 15 best art schools in New York!\n\nSchool of Visual Arts New York City\n\nThe School of Visual Arts in New York is also a member of the Association of Independent Colleges of Art and Design.\n\nThe School of Visual Arts in New York City is a private art school in the heart of the city. The school offers a Bachelor of Fine Arts degree in 11 specializations that range from animation, film, advertising, and interior design. There are also various non-major programs available at the undergraduate level.\n\nThis art school also has a Pre-College program for high school students, which helps prepare students for School of Visual Arts undergraduate programs. The specializations offered by the school are considerably more diverse at the graduate level. Students can pursue courses such as Master of Art in Curatorial Practice or Design Research, Writing, as well as Criticism. Alternatively, you may also be able to pursue a Master of Fine art degree in one of a dozen topics.\n\nThe School of Visual Arts also has courses for students interested in pursuing a Master of Professional Studies in disciplines such as Art Therapy, Directing, or Fashion Photography.\n\nSUNY Binghamton (Binghamton, NY)\n\nSUNY Binghamton is affiliated with the best public university in New York, Binghamton University. This art school enables students to study for their bachelor’s or master’s degree in art and earn both a Bachelor of art and a Bachelor of Fine art degree. The BFA course at SUNY Binghamton provides the chance to specialize in the five main art subjects like drawing or graphic design. However, students may also take up art history and other such electives.\n\nThe curriculum specially caters to students who desire to work as artists or go on to graduate school in the future. You must also complete numerous studio courses before proceeding to the Senior Exhibition Seminar, which involves a presentation of your work.\n\nThe Bachelor of Arts program at the school is for students who want to study a double major or obtain additional artistic talents by working in the studio. They also have the option of majoring in one of six disciplines, including photography, sculpture, and painting. Students can also indulge in art history classes, and for them, the senior exhibition seminar is not essential.\n\nSUNY Binghamton provides undergraduates who show interest in gaining artistic experience opportunities to enroll in the Studio Minor. This elective consists of a six-course studio program focusing on one of five artistic mediums.\n\nRochester Institute of Technology\n\nImagine having one paper coffee cup, a plastic lid, a cardboard cup sleeve, and a wooden stir stick, along with instructions to design and build a scale model of a chair using only these materials in three hours. These types of challenges keep RIT design students engaged in their classes while also helping them develop creativity, productivity, and other abilities they’ll need in the future. It’s no surprise that IDEO, Fisher-Price, and Apple are among industrial designers’ best places to work.\n\nRIT offers one of the longest and most comprehensive cooperative education programs. Design students at the university have the opportunity to take advantage of the institute’s links to get real-world experience in their field of study.\n\nThe Vignelli Center for Design Studies, which opened on campus in 2010 to hold Massimo and Lella Vignelli’s enormous professional archives, is also available to students. The annual lecture series at the center provides an opportunity to learn from visiting design specialists.\n\nColgate University, Hamilton, New York\n\nColgate University is one of the best colleges in the country for fine and studio art degrees. It is located in the small town of Hamilton and is a private non-profit liberal arts college with a small student population. The school is among the 100 most selective colleges in the United States and ranks #30 in the best school rankings out of 2,576 schools nationally.\n\nThe Colgate University campus is also consistently ranked as one of the most beautiful campuses in the US due to its singular architectural theme and a hillside location with a lake nearby. In the most recent data year, around 17 fine and studio art students graduated from Colgate University with this degree. The university now has nearly 3,000 students in its 56 undergraduate majors. There is also a small graduate program for Master of Arts in Teaching available at the school.\n\nCooper Union for the Advancement of Science and Art, New York\n\nCooper Union is a private non-profit school in Cooper Square, New York City. It was founded in 1859. The school follows the radical new model of American higher education based on Copper’s belief that education should be accessible to all who qualify, independent of their race, religion, race, or sex, i.e., open and free for all. A strong school overall, with a Best Schools ranking of #95 out of 2,576 schools nationally.\n\nAccording to stats, around 61 fine and studio art students graduated with this degree from Cooper Union. The college is divided into three schools: the Irwin S. Chanin School of Architecture, the School of Art, and the Albert Nerken School of Engineering. Through these schools, the Cooper Union offers degrees in architecture, fine arts, and engineering. Even now, Cooper remains one of the most prestigious colleges in the US, with all three of its schools ranking consistently among the best schools in the country.\n\nSkidmore College, Saratoga Spring, NY\n\nConsistently acclaimed in national rankings, Skidmore has been recognized as one of the “Nation’s Best Liberal Arts Colleges,” one of “America’s Most Entrepreneurial Colleges,” and a “Best Value” school.\n\nSkidmore Institution, located in Saratoga Springs, is a private non-profit college with a modest student body. Skidmore has the Best Schools ranking of #136 out of 2,576 colleges, indicating quality education.\n\nIn the most current stats, 58 fine and studio art students graduated with this degree from Skidmore. It has nearly 2,500 students enrolled currently. These students pursue a range of degrees across 60 areas of arts and science specializations.\n\nSyracuse University School of Art (Syracuse, NY)\n\nSyracuse University’s School of Art has been graduating students since 1875. It is among the top 10% of universities in the US for visual and performing arts. Today’s students from the institute can choose from seven undergraduate and graduate programs. The university offers three bachelor’s degrees in fine art: Art Education, Illustration, and Studio Art. The institute also offers a Bachelor of Science program in Studio Art.\n\nVisual Culture and Studio Art minors are available to undergraduates who are studying courses other than art at the university. Some of the other courses available at the school are Ceramics, Jewelry and Metalsmithing, and Painting.\n\nThrough Syracuse’s Visiting Artist Lecture Series, students can learn from faculty members who are currently working and exhibiting in their professions, as well as from more than 30 guest artists.\n\nPratt Institute\n\nOne of the best art schools in New York, Pratt institute is a private university with its main campus in Brooklyn. It serves as one of the world’s multicultural epicenters for art, culture, design, and commerce. Pratt is known for its programs in architecture, interior design, and industrial design.\n\nStudents benefit from an excellent learning environment that goes beyond the Brooklyn and Manhattan campuses. Pratt’s Schools of Art, Design, Architecture, Liberal Art and Sciences, and Information provide more than 25 undergraduate degree programs and specialties. The institute also has more than 26 graduate degree programs.\n\nColumbia University\n\nColumbia University is a private Ivy League research university located in New York City’s Upper Manhattan. It was established in 1754 and is the oldest institution in New York. One of the most prestigious institutions in the US, Columbia consistently ranks among the best universities in the world.\n\nThis university does a lot of research and has a lot of international students. The Master of Fine art degree in Film, Theatre, Visual art, and Writing, as well as the Master of art degree in Film and Media Studies, is available at Columbia University School of the art. The university also provides an interdisciplinary program in Sound Art.\n\nCornell University College of Architecture, Art, and Planning (Ithaca, NY)\n\nCornell University’s undergraduate art program provides students with a well-rounded education in various art forms. The Bachelor of Fine Art program at Cornell has two sections: an art element that comprises seminars and studio courses in various artistic mediums such as photography and painting and a business section.\n\nMeanwhile, you must study for two years for a Master of Fine Arts degree at Columbia. Students are taught not just by Ithaca academics but also by two prominent artistic mentors whom the department brings in each year. Students also get various opportunities to display their work.\n\nPurchase College, New York\n\nPurchase School of Art and Design, located less than an hour from New York City, offers a variety of opportunities for students attending art schools in New York. You can choose from five majors in the Bachelor of Fine art degree, including Sculpture, Graphic Design, and Photography. Students can also pursue a BFA in Visual Art, which is an interdisciplinary program comprising two different visual art disciplines.\n\nA Bachelor of Science in Visual art is also available for those interested in multidisciplinary study. Such students split their time between the School of Art and Design’s visual art program and one or more other subjects at separate schools. Purchase College also offers an MFA in Visual Art and a joint MFA in Visual Art/MA in Art History program, which lies under the School of Humanities.\n\nVassar College\n\nVassar college is a private, non-profit college with a small student body located in the major suburb of Poughkeepsie. It is an excellent college and is ranked #78 in the Best Schools Rankings out of 2,576 colleges nationwide.\n\nVassar provides a Bachelor of art degree in over 51 majors, including the independent major, which allows students to create their course of study, as well as various multidisciplinary and interdisciplinary fields of study.\n\nThe Juilliard School\n\nThe Juilliard School is a performing art residential conservatory in New York City. The institution was founded in 1905 and educates 850 undergraduate and graduate students in theatre, drama, and music.\n\nWith some of the most prominent programs in the art, the school is widely regarded as one of the world’s premier theatre, music, and dance schools. It follows a school calendar that is divided into semesters. Students can take liberal art courses in addition to performing art courses once they arrive at Juilliard.\n\nHamilton College, New York\n\nAny student interested in a studio or fine art degree should check out the courses at Hamilton College. Hamilton is a private, non-profit institution with a small student body. The college is located in a medium-sized suburb of Clinton. Hamilton college has a Best Schools ranking of #39 out of 2,576 colleges nationally. Approximately 18 fine and studio art students graduated with this degree from Hamilton.\n\nWagner College\n\nWagner College is rated #26 in the North Regional Universities’ rankings. Through a set of widely accepted success indicators, Wagner is noted for its Wagner Plan for the Practice of Liberal art. This is an experiential and liberal art core curriculum that complements one major and requires all students to participate in an internship.\n\nNursing, business administration, and theatre are among the most popular majors among students at Wagner College.\n\nWhat we have to say\n\nNew York is the “City of Dreams.” and the best art schools in New York only prove it right.\n\nFor individuals who aspire to follow their lifelong aspirations as artists, the city provides unrivaled access to the art scene.\n\nApart from the above reason, there are multiple reasons why New York is an excellent environment for students to pursue their aspirations.\n\nIndeed, these art schools in New York will provide you with the necessary inspiration to begin your profession!\n\nLiked the blog? Comment below and share your thoughts with us!\n\nLiked this blog? Read next: Royal College of Art: profile & courses\n\nFAQ’s\n\nQ1. What are the best art schools across the globe?\n\nAnswer – The best art schools across the globe, including –\n\nRoyal College of Art, London\n\nGlasgow School of Art, Glasgow\n\nRMIT School of Art, Melbourne\n\nRoyal Danish Academy of Fine art, Copenhagen\n\nNational School of fine art, Paris\n\nCentral Academy of Fine art, Beijing\n\nQ2. Can you be an artist without going to art school?\n\nAnswer – Yes, you can become a self-taught artist without going to school.\n\nQ3. How many pieces of art should you have in your art portfolio?\n\nAnswer – It is ideally better to have the 10 best pieces of art in your portfolio."}, {"url": "https://www.nytimes.com/2018/05/08/arts/school-of-visual-arts-removes-instructors-metoo.html", "page_content": "In one complaint, Dominique Machain said that in 2016, when she was a freshman, Roy Frumkes, her narrative writing professor, told her in graphic detail about a student he said had gone to his apartment and had sex with him. Then, she said, he added that if she wanted a recommendation she should visit him there. The implication, Ms. Machain said, was clear.\n\n“I almost felt paralyzed,” she said.\n\nImage Roy Frumkes was found to have violated the sexual misconduct policy at the School of Visual Arts by administrators. Credit... Lars Niki/Getty Images\n\nIn recent weeks the school responded, saying Mr. Frumkes’ employment had been terminated after an investigation found that he had violated the school’s sexual misconduct policy, according to a letter from an administrator. The letter did not detail the findings. Mr. Frumkes, who did not respond to requests for comment, is appealing. The school’s letter said that until his right to appeal has lapsed or been exhausted his employment would be suspended.\n\nAnother instructor in the department, Robert Haufrecht, was suspended in March and his contract was not renewed. The school said the suspension was in response to concerns raised by students but did not detail them. One student, Ashley Priessnitz, said she had complained last semester that Mr. Haufrecht, her acting teacher, had showed her unwanted attention, and had told her in class to rehearse suggestive scenarios, like washing herself.\n\n“I started wearing baggy clothes to class because any time I wore normal clothing he would comment on my appearance,” Ms. Priessnitz said. “If I saw him in a hallway at school I would duck around a corner.”"}, {"url": "https://sva.edu/about/press-room-publications/school-of-visual-arts-presents-sva-milton-as-tribute-to-design-giant-and-longtime-faculty-milton-glaser", "page_content": "New York, NY—School of Visual Arts (SVA) is pleased to present “SVA❤️Milton: The Legacy of Milton Glaser,” a new exhibition exploring design giant Milton Glaser’s early life and career, on view December 7, 2021 through January 15, 2022 at the SVA Gramercy Gallery at 209 East 23rd Street. An immersive experience that places the enduring influence of Glaser in a real-world context, the exhibition celebrates his legacy as a designer and teacher through photographs, audio and original work from the Glaser Archives at SVA. Additionally, a digital companion exhibition featuring videos and notable quotes mounted on the walls will be viewable from the sidewalk outside the SVA Flatiron Gallery windows at 133/141 West 21st Street through January 10.\n\n\n\n\n\n“SVA❤️Milton” will bring the viewer into Glaser’s world with elaborate sets like a record shop with more than 100 of his album covers, a book shop with actual books as well as digital images of book and magazine covers, his many SVA subway posters, his extensive collection of activism art and posters, intricate process work, classroom photos and archival audio recording of his classes at SVA, his desk with all its surroundings from his office, photographs from childhood and his Push Pin Studios days and much more.\n\n\n\n\n\nThis exhibition is part of SVA’s year-long series of tributes to Glaser, a longtime faculty member and former acting chairman of the College’s Board, who passed away on his 91st birthday in June 2020. Glaser was a co-founder of noted design firm Push Pin Studios and New York magazine. Born in the Bronx and an alumnus of Cooper Union, Glaser is known for many significant logos, including the famous “I ♥ NY” design. Earlier this year, SVA released the first of two editions of The Glaser Gazette, an original publication featuring stories, visuals and anecdotes about Glaser’s work and legacy with SVA. The second and final issue will be released in January 2022.\n\n\n\n\n\n“SVA❤️Milton” is organized by SVA BFA Design and BFA Advertising chair Gail Anderson, SVA Archives director Beth Kleber, 3D Design chair Kevin O’Callaghan and design director of SVA’s in-house design studio Visual Arts Press Brian E. Smith, in partnership with the Milton Glaser Design Study Center and Archives, housed at SVA and containing thousands of the designer’s works. O’Callaghan also designed the layout of the exhibition. The Flatiron Gallery windows are designed by Matthew Iacovelli, assistant to the chair of BFA Advertising and BFA Design.\n\n\n\n\n\nThe SVA Gramercy Gallery is open Monday through Friday, 10:00am–6:00pm. All visitors to the Gramercy Gallery must pre-register through an RSVP link no less than 48 hours prior to the selected event date and time. Registered visitors must be vaccinated against COVID-19 and be masked for the duration of their visit.\n\n\n\n\n\nSchool of Visual Arts has been a leader in the education of artists, designers and creative professionals for seven decades. With a faculty of distinguished working professionals, a dynamic curriculum and an emphasis on critical thinking, SVA is a catalyst for innovation and social responsibility. Comprising 7,000 students at its Manhattan campus and more than 40,000 alumni in 128 countries, SVA also represents one of the most influential artistic communities in the world. For information about the College’s 30 undergraduate and graduate degree programs, visit sva.edu.\n\n\n\n"}, {"url": "https://www.niche.com/colleges/search/best-colleges-for-art/s/new-york/", "page_content": "#85 Best Colleges for Art in America\n\nUniversity of Rochester\n\nRochester, NY•\n\n4 Year\n\n• Rating 3.65 out of 5 1,579 reviews\n\nSophomore: I came to this school without having visited campus at all, and I'm so grateful that my move-in day was when I first got to experience it, with all my fellow freshman around me. People think, erroneously, that Rochester (both the city and the university) are boring places to be, and I would agree only insofar as to say that those who want things to come to them, might be bored. The city has so many amazing restaurants, venues, and sites, but you have to take that first step of getting on the bus to go see them. At an academically rigorous school like UR, it can be hard freshman year to remember that life exists outside of academics, and especially outside of STEM. UR has a vibrant arts community, though, not even including Eastman (which has student and professional concerts alike). Everyone finds their niche pretty easily once they look for it, because there is genuinely something for every type of person. And, everyone honestly supports each other all the time!... Read 1,579 reviews\n\ngrade A+ Overall Niche Grade\n\nAcceptance rate 41%\n\nNet price $40,125\n\nSAT range 1370-1520"}, {"url": "https://www.niche.com/colleges/school-of-visual-arts/", "page_content": "As a first year animation student, my experience at SVA is overall great!\n\nLocation-wise, NYC is a fun place to be in. While SVA doesn't have a set campus, rather several buildings in manhattan, transportation between buildings isn't that big a deal.\n\nThe professors I had were all industry professionals which gave helpful insight as well as thorough critique on works. And they were overall nice people! With any college, I find the curriculum can be drastically different between professors. However, I was surprised a school like SVA can have these very different curriculums within the same program. Not getting the professor you wanted because the class filled up can be a real pain for a semester, but most professors do make themselves accessible if you just make the effort to email or talk to them.\n\n"}, {"url": "https://www.usnews.com/best-colleges/school-of-visual-arts-7468", "page_content": "School of Visual Arts is a proprietary institution that was founded in 1947. It has a total undergraduate enrollment of 3,529 (fall 2021), and the setting is Urban. It utilizes a semester-based academic calendar. School of Visual Arts' ranking in the 2022-2023 edition of Best Colleges is Regional Universities North, #40. Its tuition and fees are $46,800.\n\nSchool of Visual Arts is a proprietary institution that was founded in 1947. It has a total undergraduate enrollment of 3,529 (fall 2021), and the setting is Urban. It utilizes a semester-based academic calendar. School of Visual Arts' ranking in the 2022-2023 edition of Best Colleges is Regional Universities North, #40. Its tuition and fees are $46,800.\n\n"}, {"url": "https://www.niche.com/colleges/search/best-colleges-for-art/m/new-york-city-metro-area/", "page_content": "Saint Elizabeth University\n\nMorristown, NJ•\n\n4 Year\n\n• Rating 3.36 out of 5 218 reviews\n\nFreshman: I will be a freshman at Saint Elizabeth University in the fall of 2023.I will be moving from Arizona to New Jersey, and this process has been a lot for me to process (I can do it). I knew that with hard work and dedication , I would play softball at a higher level but to get the chance to play NCAA ball across country and experience an entire different lifestyle is something I could only dream of. Unfortunately, I need to apply to as many scholarships as possible to make this dream come true. I was offered and accepted a great scholarship package but this does not cover the entire cost of my tuition. So I will continue to apply to as many scholarships as needed to achieve my dreams. My parents are AMAZING but can only pay for so much. I would like to take as much of a burden off my parents as possible. I cannot rate Saint Elizabeth since I have not yet attended the school. But, I am looking forward to my future with them!... Read 218 reviews\n\ngrade B Overall Niche Grade\n\nAcceptance rate 74%\n\nNet price $21,774\n\nSAT range 890-1100"}, {"url": "https://www.newyorkschoolofthearts.org/faculty", "page_content": "Painting\n\nBonner is an Australian Artist, who in 1996 won the Dobell Prize, the highest prize for Drawing in Australia. In his early 20s, he traveled in India, the Middle East, and throughout Europe, and studied drawing and painting in London, Melbourne, and New York. In 2010 he completed a Masters by Research at Monash University pursuing his interest in Perception, Narrative, and the Primitive. He has been influenced greatly by Australian Aboriginal artists, Russian Icons, the deserts of Central Australia, and the American West, and currently lives and works in NYC.\n\nBonner’s work is included in the collections of the Victorian State Library and Monash University in Melbourne, the Art Gallery of New South Wales in Sydney, Australia, and various private and corporate collections around the world.\n\nWEBSITE"}]}