{"Willie Naulls was named to the All-Star team in 1959, 1960, 1961, and 1962.": [{"url": "https://www.espn.com/nba/story/_/id/25379409", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}, {"url": "https://www.wikiwand.com/en/Willie_Naulls", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Willie Naulls?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.nbcsports.com/boston/celtics/boston-celtics-pioneer-willie-naulls-passes-away-84", "page_content": "NEW ORLEANS – Willie Naulls, a three-time NBA champion with the Boston Celtics as well as a member of the first all-Black starting five in NBA history, passed away on Thanksgiving morning.\n\nHe was 84 years old.\n\nNaulls, who spent the bulk of his 10-year NBA career with the New York Knicks, is remembered fondly by his former Celtics teammate, Hall of Famer Tommy Heinsohn.\n\n“Willie was a terrific player,” Heinsohn told NBC Sports Boston in a phone interview. “Really, a competitive guy.”\n\nHeinsohn and Naulls will forever be linked together because it was Naulls who replaced a then-injured Heinsohn in Boston’s starting lineup to form what became the first all-Black starting five. In their first game, they defeated the St. Louis Hawks 97-84 on Dec. 26, 1964 in what became the first of 14 straight wins with the new starting five (Boston had won its two previous games prior to inserting Naulls into the starting five). That helped set the tone for the franchise’s 7th straight NBA title, and 8th overall.\n\nIn addition to Naulls, the starting five for that game included Satch Sanders, Sam Jones, K.C. Jones and Bill Russell – all Naismith Memorial Hall of Famers in addition to being the only black players on the Celtics roster at that time.\n\nWhile there was certainly a heightened sense of social consciousness throughout the country at that time, Red Auerbach was a coach consumed by winning and because of that, didn’t initially recognize the historical significance of putting Naulls in with the first unit.\n\n“First of all, I had no idea that I started five black players until a writer pointed it out to me a few weeks later,” Auerbach said at the time. “It didn’t make a difference to me what color any of my players were. I was putting the five best players out on the court so that we could win.”\n\nBeing part of the first all-Black starting five was just part of the history-making narrative surrounding Naulls.\n\nHe spent his first seven seasons with the New York Knicks and served as a team captain for the last three. Naulls was the first Black captain in New York Knicks history and one of the first for any major professional sports team.\n\nDuring his career, the 6-foot-6 Naulls, known for his one-handed outside shot, was a four-time All-Star (1958; 1960-1962) who was a career 15.8 points per game scorer who left New York as one of the franchise’s all-time leader scorers.\n\nSensing he could be of some help to the Boston Celtics in their quest to win yet another championship, Auerbach convinced Naulls to join forces with the Celtics.\n\n“He was one of the famous guys Red (Auerbach) enticed to come out of retirement,” Heinsohn said.\n\nUpon retirement, the former UCLA star went into real estate and commercial development in addition to activating several community-based initiatives designed to aid youth.\n\nThat would serve as a precursor to his true calling as a pastor.\n\n“The main factors contributing to my success have been, first, the wisdom of my parents in seeing that I received a disciplined Christian upbringing and the best education available and, second, my good fortune in having achieved a high and rare degree of success in athletics,” Naulls said in a curriculum vita obtained by NBC Sports Boston. “As an adult, I can reflect back and realize how blessed I am to have escaped the perpetuation of mediocrity foisted upon most African-American people. Even though I have had the opportunity of meeting and associating with the “elite” of our society, I have always understood that my successes were a deviation from the norm, and I have never stopped agonizing over the plight of poor, underprivileged people who have not experienced the benefits of a mother’s unselfish sacrifice and vision to equip her children.\n\nNaulls added, “The insecurities that I felt growing up in a disadvantaged community I have never\n\nforgotten. These memories have directly influenced my life’s commitment to serve young people of all ethnic backgrounds who would commit themselves to the pursuit of Truth and excellence. I was taught very early the value of a positive attitude about working toward becoming the best that I could be. Young people are our most valuable resource, and my life’s goal is to bring together prepared and committed teachers who will share their specific knowledge and wisdom with youth who commit themselves to preparing to become positive and productive members of our society.”\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device."}, {"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://www.bgca.org/about-us/alumni-hall-of-fame/willie-naulls", "page_content": "Willie Naulls\n\nSan Pedro, California\n\nProfessional Basketball Player\n\nAs a San Pedro High School student, Naulls was named California Mr. Basketball in 1952. After an All-American career at UCLA, he became an All-Star for the New York Knicks and the first African-American captain of a major professional sports team. He spent his final three seasons with the Boston Celtics and won three championships. After retiring in 1966 with 11,305 points and 6,508 rebounds, Naulls went on to a successful business career before being called to the ministry. Willie Naulls Ministries teaches young people hope and promotes awareness of the importance of academic, physical and spiritual achievement."}, {"url": "https://basketball.realgm.com/player/Willie-Naulls/Summary/66576", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://www.sportstats.name/basketball/players/willie-naulls-season-1959-1960-stats/", "page_content": "Willie Naulls season 1959/1960 stats\n\nStats chart\n\nWillie Naulls was 25 years old in the 1959/1960 season. Willie Naulls played in the 1959/1960 season for NYK in the NBA League. He played SF position position in the NYK team. He played in 65 games and was a starter in games. Willie Naulls played 2250 minutes in the NBA.\n\nHe’s PER (strives to measure a player’s per-minute performance, while adjusting for pace) was 20.\n\nIn the 1959/1960 season, on the NBA courts for the NYK basketball team, he also scored an average of: 21.35 points per game, 14.17 rebounds per game, 2.12 assists per game, 0 steals per game and 0 blocks per game.\n\nPlayer Profile\n\nFull Name: Willie Naulls\n\nPlayer Salary:\n\nAge In Season 1959/1960: 25\n\nSeason 1959/1960 Club: NYK\n\nPosition: SF\n\nStats\n\nAppearances for 1959/1960 season\n\nGames: 65\n\nStarting Five:\n\nMinutes: 2250 minutes\n\nPlayer Efficiency Rating: 20\n\nPoints\n\nTotal Points: 1388\n\nPoints Per Game: 21.35\n\nShooting\n\nTrue Shooting Percentage: 48.30%\n\nFree Throw Rate or FTR is the ratio of Free Throw Attempts to Field Goal Attempts: 26.60%\n\nField Goal: 551\n\nField Goal Attempts: 1286\n\nField Goal Percentage: 42.80%\n\n2pt Made: 551\n\n2pt Attempted: 1286\n\n2pt Percentage: 42.80%\n\nEffective Field Goal Percentage: 42.80%\n\nThree Points Shooting\n\n3-Point Attempt Rate- Percentage of FG Attempts from 3-Point Range:\n\nThree Pointers Made:\n\nThree Pointers Attempted:\n\nThree Pointers Percentage:\n\nFree Throws\n\nFree Throws Made: 286\n\nFree Throws Attempted: 342\n\nFree Throws Percentage: 83.60%\n\nRebounds\n\nTotal Rebounds: 921\n\nRebounds Per Game: 14.17%\n\nTotal Rebound Percentage: %\n\nOffensive Rebounds Total:\n\nOffensive Rebounds Per Game: 0%\n\nOffensive Rebound Percentage: %\n\nDefensive Rebounds Total:\n\nDefensive Rebounds Per Game: 0%\n\nDefensive Rebound Percentage: %\n\nAssists\n\nTotal Assists: 138\n\nAssists Per Game: 2.12%\n\nTotal Assists Percentage: %\n\nSteals\n\nTotal Steals:\n\nSteals Per Game: 0%\n\nTotal Steals Percentage: %\n\nBlocks\n\nTotal Blocks:\n\nBlocks Per Game: 0%\n\nTotal Blocks Percentage: %\n\nTurnovers\n\nTotal Turnovers:\n\nTurnovers Per Game: 0%\n\nTotal Turnovers Percentage: %\n\nFouls\n\nTotal Fouls: 214\n\nFouls Per Game: 3.29%\n\nOther Stats\n\nUsage Rate (USG) *: %\n\nOffensive Win Shares (OWS)*: 4.1\n\nDefensive Win Shares (DWS)*: 1.2\n\nWin Share (WS)*: 5.3\n\nWin Share (WS/48)*: 0.113\n\nOffensive Box Plus-Minus (BPM)*: 4.1\n\nDefensive Box Plus-Minus (BPM)*: 1.2\n\nBox Plus-Minus (BPM)*:\n\nValue over Replacement Player (VORP)*:\n\nStats Explanation\n\nUSG % – Usage Rate\n\nUsage rate calculates what percentage of team plays a player was involved in while he was on the floor, provided that the play ends in one of the three true results: field-goal attempt, free-throw attempt or turnover.\n\nOffensive Win Shares (OWS)\n\nWin Shares are easily the best metric for evaluating the offensive play of a single player. Points scored, assists and offensive rebounds.\n\nDefensive Win Shares (DWS)\n\nDefensive win shares (DWS) is a player statistic that attributes credit to players based on their ability to prevent opposing teams from scoring. A player’s DWS is calculated by estimating the number of points allowed per 100 defensive possessions.\n\nWin Share\n\nWin Shares is a player statistic which attempts to divvy up credit for team success to the individuals on the team.\n\nWin Share (WS/48)\n\nWin Share is a measure that is assigned to players based on their offense, defense, and playing time.\n\nBox Plus-Minus (BPM)\n\nBox plus-minus is based on box score for evaluating basketball players’ quality and contribution to the team from play-by-play regression.\n\nValue over Replacement Player (VORP)\n\nThis stat converts the BPM rate into an estimate of each player’s overall contribution to the team, measured vs. what a theoretical “replacement player” would provide, where the “replacement player” is defined as a player on minimum salary or not a normal member of a team’s rotation.\n\nFrequently Asked Questions\n\nHow old was Willie Naulls in the 1959/1960 season?\n\nWillie Naulls was 25 in the 1959/1960 season.\n\nWhat club did Willie Naulls play for in the 1959/1960 season?\n\nIn the 1959/1960, Willie Naulls played for NYK from NBA League.\n\nWhat position does Willie Naulls play?\n\nWillie Naulls played as a SF.\n\nHow many matches did Willie Naulls play?\n\nIn the 1959/1960 season, Willie Naulls made 65 appearances for NYK.\n\nHow much Willie Naulls make in the 1959/1960 season?\n\nWillie Naulls made in 1959/1960.\n\nHow many PPG (points per game) did Willie Naulls average in 1959/1960?\n\nWillie Naulls averaged 21.35 points per game\n\nComments"}, {"url": "https://www.celebsagewiki.com/willie-naulls", "page_content": "Age, Biography and Wiki\n\nWillie Naulls (William Dean Naulls) was born on 7 October, 1934 in Dallas, TX, is an American basketball player. Discover Willie Naulls's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of Willie Naulls networth?\n\nPopular As William Dean Naulls Occupation Player Age 84 years old Zodiac Sign Libra Born 7 October 1934 Birthday 7 October Birthplace Dallas, TX Date of death November 22, 2018 Died Place Laguna Niguel, CA Nationality TX\n\nWe recommend you to check the complete list of Famous People born on 7 October. He is a member of famous Player with the age 84 years old group.\n\nWillie Naulls Height, Weight & Measurements\n\nAt 84 years old, Willie Naulls height is 6′ 6″ .\n\nPhysical Status Height 6′ 6″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Willie Naulls's Wife?\n\nHis wife is Anne Van de Water Naulls (m. ?–2018)\n\nFamily Parents Not Available Wife Anne Van de Water Naulls (m. ?–2018) Sibling Not Available Children Not Available\n\nWillie Naulls Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Willie Naulls worth at the age of 84 years old? Willie Naulls’s income source is mostly from being a successful Player. He is from TX. We have estimated Willie Naulls's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Player\n\nWillie Naulls Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Willie Naulls Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.espn.com/nba/story/_/id/25379409/willie-naulls-former-nba-all-star-dies-84", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}, {"url": "https://www.nytimes.com/2018/11/25/obituaries/willie-naulls-dies.html", "page_content": "Willie Naulls, a four-time All-Star forward with the Knicks, a member of three consecutive N.B.A. championship teams with the Boston Celtics and one of pro basketball’s early black stars, died on Thursday at his home in Laguna Niguel, Calif. He was 84.\n\nThe cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues, his wife, Dr. Anne Van de Water Naulls, said.\n\nA fine outside shooter and a rugged rebounder at 6 feet 6 inches and 225 pounds or so, Naulls was an All-American at U.C.L.A. in 1956, his senior season, playing for the future Hall of Fame coach John Wooden. He was a second-round draft pick of the St. Louis Hawks.\n\nBut on joining the Hawks Naulls was distraught over the racial climate of St. Louis; his family had moved from Dallas to Southern California to escape segregation."}]}