{"Willie Naulls played as a forward/center in the NBA from 1956 to 1966.": [{"url": "https://www.espn.com/nba/story/_/id/25379409/willie-naulls-former-nba-all-star-dies-84", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}, {"url": "https://www.espn.com/nba/story/_/id/25379409", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}, {"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://uclabruins.com/honors/hall-of-fame/willie-naulls/282", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-born-oliver-signed-history-2022/", "page_content": "On this day in Boston Celtics history, champion small forward Willie Naulls was born in Dallas, Texas, in 1934. A graduate of the University of California, Los Angeles, where he played for Hall of Fame coaching legend John Wooden, Naulls was selected with the ninth pick of the 1956 NBA draft by the (then) St. Louis (now, Atlanta) Hawks.\n\nHe played 19 games with that organization before being traded to the New York Knicks early in his rookie year. He spent the bulk of his career with the Knicks, who named him the first Black team captain in league history.\n\nIt wasn’t the last trade of his career of course, or you would not be reading about him on this site."}, {"url": "https://www.nbcsports.com/boston/celtics/boston-celtics-pioneer-willie-naulls-passes-away-84", "page_content": "NEW ORLEANS – Willie Naulls, a three-time NBA champion with the Boston Celtics as well as a member of the first all-Black starting five in NBA history, passed away on Thanksgiving morning.\n\nHe was 84 years old.\n\nNaulls, who spent the bulk of his 10-year NBA career with the New York Knicks, is remembered fondly by his former Celtics teammate, Hall of Famer Tommy Heinsohn.\n\n“Willie was a terrific player,” Heinsohn told NBC Sports Boston in a phone interview. “Really, a competitive guy.”\n\nHeinsohn and Naulls will forever be linked together because it was Naulls who replaced a then-injured Heinsohn in Boston’s starting lineup to form what became the first all-Black starting five. In their first game, they defeated the St. Louis Hawks 97-84 on Dec. 26, 1964 in what became the first of 14 straight wins with the new starting five (Boston had won its two previous games prior to inserting Naulls into the starting five). That helped set the tone for the franchise’s 7th straight NBA title, and 8th overall.\n\nIn addition to Naulls, the starting five for that game included Satch Sanders, Sam Jones, K.C. Jones and Bill Russell – all Naismith Memorial Hall of Famers in addition to being the only black players on the Celtics roster at that time.\n\nWhile there was certainly a heightened sense of social consciousness throughout the country at that time, Red Auerbach was a coach consumed by winning and because of that, didn’t initially recognize the historical significance of putting Naulls in with the first unit.\n\n“First of all, I had no idea that I started five black players until a writer pointed it out to me a few weeks later,” Auerbach said at the time. “It didn’t make a difference to me what color any of my players were. I was putting the five best players out on the court so that we could win.”\n\nBeing part of the first all-Black starting five was just part of the history-making narrative surrounding Naulls.\n\nHe spent his first seven seasons with the New York Knicks and served as a team captain for the last three. Naulls was the first Black captain in New York Knicks history and one of the first for any major professional sports team.\n\nDuring his career, the 6-foot-6 Naulls, known for his one-handed outside shot, was a four-time All-Star (1958; 1960-1962) who was a career 15.8 points per game scorer who left New York as one of the franchise’s all-time leader scorers.\n\nSensing he could be of some help to the Boston Celtics in their quest to win yet another championship, Auerbach convinced Naulls to join forces with the Celtics.\n\n“He was one of the famous guys Red (Auerbach) enticed to come out of retirement,” Heinsohn said.\n\nUpon retirement, the former UCLA star went into real estate and commercial development in addition to activating several community-based initiatives designed to aid youth.\n\nThat would serve as a precursor to his true calling as a pastor.\n\n“The main factors contributing to my success have been, first, the wisdom of my parents in seeing that I received a disciplined Christian upbringing and the best education available and, second, my good fortune in having achieved a high and rare degree of success in athletics,” Naulls said in a curriculum vita obtained by NBC Sports Boston. “As an adult, I can reflect back and realize how blessed I am to have escaped the perpetuation of mediocrity foisted upon most African-American people. Even though I have had the opportunity of meeting and associating with the “elite” of our society, I have always understood that my successes were a deviation from the norm, and I have never stopped agonizing over the plight of poor, underprivileged people who have not experienced the benefits of a mother’s unselfish sacrifice and vision to equip her children.\n\nNaulls added, “The insecurities that I felt growing up in a disadvantaged community I have never\n\nforgotten. These memories have directly influenced my life’s commitment to serve young people of all ethnic backgrounds who would commit themselves to the pursuit of Truth and excellence. I was taught very early the value of a positive attitude about working toward becoming the best that I could be. Young people are our most valuable resource, and my life’s goal is to bring together prepared and committed teachers who will share their specific knowledge and wisdom with youth who commit themselves to preparing to become positive and productive members of our society.”\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device."}, {"url": "https://apnews.com/article/-----d38ef8a932cb49bfae54665fb9ab3017", "page_content": "LOS ANGELES (AP) — Willie Naulls, the former UCLA star who was a four-time All-Star with the New York Knicks and won three NBA championships with the Boston Celtics, has died. He was 84.\n\nNaulls died on Thanksgiving at his home in Laguna Niguel, south of Los Angeles, UCLA said. The cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues.\n\nThere was a moment of silence for Naulls before UCLA’s basketball game Wednesday night.\n\nAfter playing for UCLA from 1954-56, Naulls was selected with the ninth overall pick in the NBA draft by the St. Louis Hawks.\n\nBut he spent just 19 games with the Hawks, calling it a “culture shock” to see the segregation that existed in St. Louis, the likes of which he hadn’t seen since he was eight before moving from Dallas to Los Angeles. He was then traded to the Knicks.\n\nBoston won titles in 1964, ’65 and ‘66, Naulls’ final three seasons.\n\nAlong with Bill Russell, K.C. Jones, Sam Jones and Tom Sanders, Naulls comprised the first all-black lineup in the history of integrated pro sports in December 1964 when Naulls replaced injured Tom Heinsohn as a starter.\n\nWith the Knicks, Naulls became the first black to be named a captain of a pro team in a major American sport. He averaged a double-double (19.3 points and 10.7 rebounds) during his seven-year tenure with the Knicks.\n\nThe 6-foot-6 forward also played for the San Francisco Warriors during his 10-year pro career.\n\nNaulls averaged 15.5 points and 11.4 rebounds playing for three years at UCLA.\n\nHe set UCLA’s single-game rebounding record with 28 against Arizona State on Jan. 28, 1956, a mark that still stands. He led the team in rebounding each of his three seasons.\n\nPlaying for future Hall of Fame coach John Wooden, he helped the Bruins win the Pacific Coast Conference title as a senior in 1956, when he earned All-America honors. At the time his college career ended, he was the school’s career leader in points (1,225) and rebounds (900).\n\nAfter retiring from the NBA, Naulls returned to UCLA and completed his undergraduate degree. He earned a master’s in theology from Fuller Theological Seminary in Pasadena in 1993.\n\nNaulls worked with underserved youth for over 50 years and founded a nonprofit organization that raised money for free summer basketball camps for junior high and high school boys.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Joanh and Malaika; and six grandchildren."}, {"url": "https://simple.wikipedia.org/wiki/Willie_Naulls", "page_content": "William Dean Naulls (October 7, 1934 – November 22, 2018) was an American basketball player. He played professionally in the National Basketball Association from 1956 to 1966. He was born in Dallas, Texas, but was raised in Los Angeles, California. He played for the St. Louis Hawks, New York Knicks, Golden State Warriors and the Boston Celtics.[1][2]\n\nNaulls died on November 22, 2018 in Laguna Niguel, California from respiratory failure at the age of 84.[3]\n\nOther websites [ change | change source ]"}, {"url": "https://apnews.com/d38ef8a932cb49bfae54665fb9ab3017", "page_content": "LOS ANGELES (AP) — Willie Naulls, the former UCLA star who was a four-time All-Star with the New York Knicks and won three NBA championships with the Boston Celtics, has died. He was 84.\n\nNaulls died on Thanksgiving at his home in Laguna Niguel, south of Los Angeles, UCLA said. The cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues.\n\nThere was a moment of silence for Naulls before UCLA’s basketball game Wednesday night.\n\nAfter playing for UCLA from 1954-56, Naulls was selected with the ninth overall pick in the NBA draft by the St. Louis Hawks.\n\nBut he spent just 19 games with the Hawks, calling it a “culture shock” to see the segregation that existed in St. Louis, the likes of which he hadn’t seen since he was eight before moving from Dallas to Los Angeles. He was then traded to the Knicks.\n\nBoston won titles in 1964, ’65 and ‘66, Naulls’ final three seasons.\n\nAlong with Bill Russell, K.C. Jones, Sam Jones and Tom Sanders, Naulls comprised the first all-black lineup in the history of integrated pro sports in December 1964 when Naulls replaced injured Tom Heinsohn as a starter.\n\nWith the Knicks, Naulls became the first black to be named a captain of a pro team in a major American sport. He averaged a double-double (19.3 points and 10.7 rebounds) during his seven-year tenure with the Knicks.\n\nThe 6-foot-6 forward also played for the San Francisco Warriors during his 10-year pro career.\n\nNaulls averaged 15.5 points and 11.4 rebounds playing for three years at UCLA.\n\nHe set UCLA’s single-game rebounding record with 28 against Arizona State on Jan. 28, 1956, a mark that still stands. He led the team in rebounding each of his three seasons.\n\nPlaying for future Hall of Fame coach John Wooden, he helped the Bruins win the Pacific Coast Conference title as a senior in 1956, when he earned All-America honors. At the time his college career ended, he was the school’s career leader in points (1,225) and rebounds (900).\n\nAfter retiring from the NBA, Naulls returned to UCLA and completed his undergraduate degree. He earned a master’s in theology from Fuller Theological Seminary in Pasadena in 1993.\n\nNaulls worked with underserved youth for over 50 years and founded a nonprofit organization that raised money for free summer basketball camps for junior high and high school boys.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Joanh and Malaika; and six grandchildren."}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-trade-stacom-born-history-2022/", "page_content": "On this day in Boston Celtics history, the storied franchise bought the rights to forward Willie Naulls’ contract from the (then) San Francisco (now Golden State) Warriors in 1963. It was the final stop in a long NBA career for the Dallas, Texas, native, which began after playing for the University of California Los Angeles Bruins.\n\nNaulls, who moved to California as a young child with his family to escape segregation in the southern U.S., was shocked after being drafted by the (then) St. Louis (now, Atlanta) Hawks in the 1956 NBA draft.\n\nHe later played for the New York Knicks and the Warriors before joining the Celtics, where he won three titles between 1964 and 1966."}]}