{"St. Louis Hawks drafted Willie Naulls in the 1956 NBA draft.": [{"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://www.wikiwand.com/en/Willie_Naulls", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Willie Naulls?\n\nSummarize this article for a 10 years old"}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-born-oliver-signed-history/", "page_content": "On this day in 1934, former Boston Celtics champion small forward Willie Naulls was born in Dallas, Texas.\n\nA product of the University of California, Los Angeles — where he would play for Hall of Fame coaching legend John Wooden — Naulls would be drafted with the ninth overall pick of the 1956 NBA Draft by the (then) St. Louis (now, Atlanta) Hawks.\n\nHe would play just 19 games with that organization, traded to the New York Knicks early in his rookie year to the team he would spend the bulk of his career with, and who would name him the first Black team captain in league history.\n\nIn December of 1964, Tom \"Satch\" Sanders, Sam Jones, K.C. Jones, @RealBillRussell and Willie Naulls became the first all-black starting five in NBA history. pic.twitter.com/xKF6TiPHJC — Boston Celtics (@celtics) February 21, 2018\n\nNaulls would be dealt to the (then) San Francisco (now Golden State) Warriors in December of 1962, who in turn dealt him to Boston the following September.\n\nThe Texan wing would finish his career as a Celtic, earning three titles with the team between 1964 and 1966.\n\nThe @NBA family mourns the loss of Willie Naulls (1934-2018), a 4x #NBAAllStar with the @nyknicks and 3x champion with the @celtics. Naulls was a pioneer, on and off the court. pic.twitter.com/r4HE648hM4 — NBA History (@NBAHistory) November 27, 2018\n\nHe would be part of the first all-Black starting lineup in 1964, along with Bill Russell, Sam and K.C. Jones (no relation) and Satch Sanders, and would average 10.3 points and 4.6 rebounds per game as a Celtic."}, {"url": "https://www.basketball-reference.com/draft/NBA_1956.html", "page_content": "Click the Team for players drafted by that franchise.\n\nClick the College for players drafted from that college.\n\nClick the Pk for players drafted in that slot.\n\nMatthew Maurer of TheDraftReview is an NBA Draft historian who has researched and collected the data on the entire history of the NBA Draft. Much of the biographical and draft data of the later rounds is thanks to his investigative research and work."}, {"url": "https://www.landofbasketball.com/draft/1956_nba_draft.htm", "page_content": "403 Error - Forbidden\n\nFor some reason this resource can't be accessed.\n\n(If your browser version is too old it might have been blocked for security reasons. Try updating its version)."}, {"url": "https://basketball.realgm.com/player/Willie-Naulls/Summary/66576", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://historygreatest.com/willie-naulls", "page_content": "American basketball player William Dean Naulls was born on October 7, 1934, and died on November 22, 2018.\n\nHe was an American expert ball player.\n\nWilliam Dean Naulls played 10 years in the National Basketball Association (NBA), where he was a four-time NBA All-Star with the New York Knicks, and won three NBA titles with the Boston Celtics.\n\nNaulls experienced childhood in California, where he was named the state’s Mr. Ball while attending secondary school.\n\nNaulls played school b-ball with the UCLA Bruins, and earned All-American distinctions as a senior in 1956.\n\nHe was chosen by the St. Louis Hawks (referred to now as the Atlanta Hawks) with the ninth by and large pick of the 1956 NBA draft.\n\nNaulls played quickly with St. Louis before being exchanged to New York, where he burned through a large portion of his vocation.\n\nWith the Knicks, Naulls turned into the main African American to be named a chief of an expert group in a noteworthy American game.\n\nAfter a concise spell with the San Francisco Warriors (now the Golden State Warriors), Naulls completed his profession with the Boston Celtics.\n\nIn December 1964, Naulls was a piece of a Celtics unit that turned into the primary all-dark beginning lineup in NBA history.\n\nHe died in Laguna Niguel, California, from respiratory failure due to Churg-Strauss syndrome, which he had been battling for eight years.\n\nWillie Naulls passed away at 84 years old."}, {"url": "https://www.findagrave.com/memorial/194971861/willie-naulls", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-trade-stacom-born-history-2021/", "page_content": "On this day in Boston Celtics history, the storied franchise bought the rights to forward Willie Naulls’ contract from the (then) San Francisco (now Golden State) Warriors in 1963. It would be the final stop of a long career in the NBA for the Dallas, Texas native, which began after his college ball years which he spent playing for the University of California Los Angeles Bruins.\n\nNaulls, who moved to California as a young child with his family to escape from segregation in the southern U.S., was shocked after being drafted by the (then) St. Louis (now, Atlanta) Hawks in the 1956 NBA draft.\n\nHe would later play for the New York Knicks and the Warriors before joining the Celtics, where he would win three titles between 1964 and 1966."}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-born-oliver-signed-history-2021/", "page_content": "On this day in Boston Celtics history, champion small forward Willie Naulls was born in Dallas, Texas, in 1934. A graduate of the University of California, Los Angeles, where he played for Hall of Fame coaching legend John Wooden, Naulls was selected with the ninth pick of the 1956 NBA draft by the (then) St. Louis (now, Atlanta) Hawks.\n\nHe played 19 games with that organization before being traded to the New York Knicks early in his rookie year. He spent the bulk of his career with the Knicks, who named him the first Black team captain in league history.\n\nIt wasn’t the last trade of his career of course, or you would not be reading about him on this site."}], "New York Knicks traded for Willie Naulls in 1958.": [{"url": "https://www.espn.com/blog/new-york/knicks/post/_/id/2875/top-10-trades-in-knicks-history", "page_content": "When Carmelo Anthony was shipped to New York, it got us thinking, What were the previous top 10 trades in Knicks history based on how those new players performed and contributed to the team? Here's what we came up with (from 10 to 1):\n\n10. On June 25, 1998, Marcus Camby was traded by the Toronto Raptors to the Knicks for Sean Marks, Charles Oakley and cash. Camby served as Patrick Ewing's backup in his first season with the Knicks -- technically half a season because of the lockout -- and did a solid job, averaging 7.2 points, 5.5 rebounds and 1.6 blocks to help lead them to the 1999 Finals. Camby went on to become one of the league's best defensive big men with the Knicks, averaging 11.1 points, 10.0 rebounds and 2.0 blocks in the next three seasons.\n\n9. On Dec. 12, 1956, Willie Naulls was traded by the St. Louis Hawks to the Knicks for Slater Martin. Starting with his first full season with the Knicks in 1957-58, Naulls played in four straight All-Star Games. Naulls spent six seasons with the Knicks (when you add up two abbreviated seasons due to trades), averaging 19.3 points and 11.7 rebounds, and leading them to the 2009 Lost Eastern Division Semifinals.\n\n8. On Dec. 9, 1976, Bob McAdoo was traded by the Buffalo Braves with Tom McMillen to the Knicks for John Gianelli and cash. McAdoo only played two 1/3 seasons with the Knicks, but during that time he averaged 26.7 points and 12.0 rebounds, and led them to the 1978 Eastern Conference Semifinals.\n\n7. On Oct. 22, 1982, Bernard King was traded by the Golden State Warriors to the Knicks for Micheal Ray Richardson and a 1984 fifth-round draft pick (Scott McCollum). King may have averaged about the same amount of points as McAdoo (26.5 versus 26.7 in four seasons with the Knicks), but he led the team to two playoff appearances in 1983 and '84. As a member of the Knicks, King played in two All-Star Games (1984 and '85) and he led the league in scoring during the 1984-85 season at 32.9 points per game.\n\n6. On July 14, 1996, Larry Johnson was traded by the Charlotte Hornets to the Knicks for Brad Lohaus and Anthony Mason. Every season Johnson played with the Knicks, the team made the playoffs, including a 1999 Finals appearance. He spent five seasons with the Knicks, averaging 12.3 points and 5.5 rebounds.\n\n5. On Jan. 21, 1999, Latrell Sprewell was traded by the Golden State Warriors to the Knicks for Terry Cummings, Chris Mills and John Starks. Sprewell helped the Knicks reach the 1999 Finals in only his first season, and then the playoffs the following two years. He spent four 2/3 seasons with the Knicks, averaging 17.9 points and playing in the 2001 All-Star Game.\n\n4. On June 27, 1988, Charles Oakley was traded by the Chicago Bulls with a 1988 first-round draft pick (Rod Strickland) and a 1988 third-round draft pick (Phil Stinnie) to the Knicks for Bill Cartwright, a 1988 first-round draft pick (Will Perdue) and a 1988 third-round draft pick (Derrick Lewis). Oakley was the Knicks' glue guy for 10 seasons from 1988-89 to 1997-98 -- and every one included a playoff berth. He averaged a double-double (10.4 points and 10.0 rebounds) and made one All-Star appearance in 1994.\n\n3. On Oct. 14, 1965, Dick Barnett was traded by the Los Angeles Lakers to the Knicks for Bob Boozer. Except for his first season with the Knicks, Barnett led them to the playoffs for the rest of his eight-year tenure in New York, including two championships in 1970 and '73. He spent nine seasons with the Knicks, averaging 15.6 points and playing in the 1968 All-Star Game.\n\n2. On Dec. 19, 1968, Dave DeBusschere was traded by the Detroit Pistons to the Knicks for Walt Bellamy and Howard Komives. Every season DeBusschere played with the Knicks, the team made the playoffs, including two championships in 1970 and '73. He spent five 2/3 seasons with the Knicks, averaging 16 points and 10.7 rebounds, and playing in five straight All-Star Games from 1970 to '74.\n\n1. On Nov. 10, 1971, Earl Monroe was traded by the Baltimore Bullets to the Knicks for Mike Riordan, Dave Stallworth and cash. Monroe cemented his legacy as one of the greatest Knicks players by leading them to back-to-back Finals in 1972 and '73, including a championship in the second appearance. He spent nine seasons with the Knicks, averaging 16.2 points and playing in the 1975 and '77 All-Star Games.\n\nAgree? Disagree? Chime in with your thoughts.\n\nYou can follow Jared Zwerling on Twitter."}, {"url": "https://www.nytimes.com/2018/11/25/obituaries/willie-naulls-dies.html", "page_content": "Willie Naulls, a four-time All-Star forward with the Knicks, a member of three consecutive N.B.A. championship teams with the Boston Celtics and one of pro basketball’s early black stars, died on Thursday at his home in Laguna Niguel, Calif. He was 84.\n\nThe cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues, his wife, Dr. Anne Van de Water Naulls, said.\n\nA fine outside shooter and a rugged rebounder at 6 feet 6 inches and 225 pounds or so, Naulls was an All-American at U.C.L.A. in 1956, his senior season, playing for the future Hall of Fame coach John Wooden. He was a second-round draft pick of the St. Louis Hawks.\n\nBut on joining the Hawks Naulls was distraught over the racial climate of St. Louis; his family had moved from Dallas to Southern California to escape segregation."}, {"url": "https://basketball.realgm.com/player/Willie-Naulls/Summary/66576", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://www.postingandtoasting.com/2018/11/27/18113042/a-salute-to-late-knicks-legend-willie-naulls", "page_content": "The world has lost a real life hero with the passing of Willie Naulls, a former All-Star forward for the New York Knickerbockers who played in the NBA during a racially tense decade but managed to break down barriers by becoming the first black athlete to be named team captain in any of the major American sports.\n\nNaulls died on November 22nd at 84-years-old after succumbing to respiratory failure as a result of Churg-Strauss syndrome, which restricts blood flow to vital organs and tissues, according to the New York Times. The late Knicks legend leaves this earth with an impactful legacy, and though the occasion is sad, it gives us a chance to look back at Naulls’ impressive life and career.\n\nWith news of his passing, our thoughts and prayers are with the family of former Knick, Willie Naulls. A true pioneer, Willie was the first African-American team captain in franchise history and currently 13th on the all-time Knicks scoring list. pic.twitter.com/hv6YsiQ4ER — NEW YORK KNICKS (@nyknicks) November 25, 2018\n\nHis Path To The Knicks\n\nNaulls was born in Dallas, Texas in 1934, but before long his family moved to San Pedro, California in order to seek a more diverse and welcoming community. He loved Major League Baseball as a child and in high school was originally on track to play baseball, but the 6’6”, 225-pound athlete wound up turning to basketball and becoming an All-American at UCLA under legendary coach John Wooden.\n\nNaulls was a second round draft pick of the St. Louis Hawks in 1956, selected in a draft class that included Bill Russell, Elgin Baylor and Tommy Heinsohn. Naulls was not necessarily a fan of the team that took him, seeing as they were stationed in the still-segregated Southern U.S., according to an interview he gave to NBA.com in December 2015.\n\n“My parents took us out of the South to experience the freedom of competition and of choice of the integrating West Coast,” Naulls said in the interview. “To go to St. Louis and its segregated hotels, restaurants, cabs, living districts and attitude was a cultural shock. As a 21-year-old man, I had rarely experienced that since I was eight years old.”\n\nLucky for Naulls, his stay in St. Louis did not last long; on December 10th, 1956, only 19 games into his rookie season, Naulls was traded to the Knicks.\n\nNaulls’ Career As A ‘Bocker\n\nNaulls quickly carved out a significant role for himself with the Knicks, averaging 18.1 points and 11.8 rebounds in his first full season with the team and earning a spot on the Eastern Conference All-Star team. He was one of only three black players selected as All-Stars that season, the others being Russell and Maurice Stokes.\n\nDuring the roughly seven seasons he was with the Knicks, Naulls made four All-Star teams, and his overall Knicks stats stand at 19.3 points and 10.7 rebounds a game. He averaged more than 20 points a game three times for the Knicks, including during the 1961-62 season when he put up 25 points and 11.6 rebounds per contest.\n\nThe Knicks made the playoffs only once during Naulls’ tenure, in 1959, when the team’s 40-32 record was good for second place in the East. The Knicks lost in the division semifinals that year to the Syracuse Nationals, two games to none.\n\nIn the early 1960s, Naulls was named Knicks’ captain, becoming the first African-American athlete to earn the title for any team in any of the major American sports.\n\nOn March 2, 1962, Naulls posted 31 points and 7 rebounds in a 169-147 loss to the Philadelphia Warriors. Naulls’ strong showing represented the seventh straight game he had scored 30 or more points, setting a franchise record that wouldn’t be broken for almost five decades (Amar’e Stoudemire scored 30 or more in nine consecutive games in 2010). Naulls’ record-setting night against the Warriors was overshadowed by Wilt Chamberlain, who scored 100 points and grabbed 25 boards.\n\nToday, Naulls sits at 13th on the Knicks all-time scoring list, one spot behind John Starks and just ahead of Gerald Wilkins. His 8,318 points as a Knick are more than than the likes of Bernard King, Latrell Sprewell and Stephon Marbury, among others big names. His 5,015 rebounds is good for 5th on the Knicks all-time rebounds list, behind only Patrick Ewing, Willis Reed, Charles Oakley and Harry Gallatin.\n\nHis Post-Knicks Career as a Champion\n\nIn December 1962, Naulls was traded to the San Francisco Warriors, and in September 1963 he was traded again, this time to a Boston Celtics team that was in the middle of an absolutely dominant stretch of basketball that included 11 championships between 1957 and 1969.\n\nNaulls notched three titles as a member of the Celtics, in 1964, 1965 and 1966. He retired from the NBA in 1966.\n\nIn 1964, Naulls was part of the NBA’s first all-black starting lineup with the Celtics, in a game that was ironically played against his former team, the St. Louis Hawks\n\nFor his career, Naulls averaged 15.8 points and 9.1 rebounds a game. His career field goal percentage was 40.6 percent, and he shot free throws at a clip of 81.2 percent.\n\nLife After The NBA\n\nNaulls focused on business once his NBA career was over, and his original pursuits included owning an auto dealership in Los Angeles and investing in “enterprises that he felt could provide jobs in black communities,” according to the New York Times.\n\nIn 1993, he formed Willie Naulls Ministries, a non-profit venture that aims to “equip believers to testify the Truth of how to live victoriously in God’s Kingdom here on earth by teaching Biblically based principles for personal growth of spirit, soul, and body,” according to its website.\n\nNaulls is survived by his wife, two sons and two daughters, and six grandchildren, along with a legion of Knicks fans who appreciate his contributions to both the team and the world of sports at large. Rest in peace, Willie!"}, {"url": "https://www.basketball-reference.com/teams/NYK/1957_transactions.html", "page_content": "Traded Dick McGuire to the Fort Wayne Pistons for a 1958 1st round draft pick ( Mike Farmer was later selected).\n\nApril 17, 1957\n\nDrafted Brendan McCann in the 1st round (5th pick) of the 1957 NBA Draft.\n\nDrafted Larry Friend in the 2nd round (13th pick) of the 1957 NBA Draft.\n\nDrafted Gary Clark in the 3rd round (21st pick) of the 1957 NBA Draft.\n\nDrafted Rayford Wells in the 4th round (29th pick) of the 1957 NBA Draft.\n\nDrafted Lee Marshall in the 5th round (37th pick) of the 1957 NBA Draft.\n\nDrafted Jim Humphrey in the 6th round (45th pick) of the 1957 NBA Draft."}, {"url": "https://www.statscrew.com/basketball/roster/t-NYK/y-1958", "page_content": "1958-59 New York Knicks Roster\n\nThe New York Knicks of the National Basketball Association ended the 1958-59 season with a record of 40 wins and 32 losses, finishing second in the NBA's Eastern Division. The team compiled a postseason mark of 0-2.\n\nNew York scored 7,943 points and yielded 7,925. Kenny Sears tossed in a team-leading 1,488 points for the Knicks, and Richie Guerin contributed 18 or more per game, too. Willie Naulls accounted for 723 boards. Richie Guerin dished out 364 assists for the squad.\n\nAndrew Levane coached the team. The 1958-59 New York Knicks lost in the division semifinals.\n\nClick on column headings to sort."}, {"url": "https://www.ebay.com/itm/314418369902", "page_content": "International Shipping - items may be subject to customs processing depending on the item's customs value.\n\nSellers declare the item's customs value and must comply with customs declaration laws.\n\nInformation. As the buyer, you should be aware of possible:\n\n- delays from customs inspection.\n\nfrom customs inspection. - import duties and taxes which buyers must pay.\n\nand taxes which buyers must pay. - brokerage fees payable at the point of delivery."}, {"url": "https://www.nytimes.com/1958/02/15/archives/knicks-turn-back-royals-103-to-92-sears-felix-naulls-and-guerin.html", "page_content": "Credit... The New York Times Archives\n\nFebruary 15, 1958 , Page 21 Buy Reprints See the article in its original context fromFebruary 15, 1958 , Page 21 View on timesmachine TimesMachine is an exclusive benefit for home delivery and digital subscribers.\n\nFull text is unavailable for this digitized archive article. Subscribers may view the full text of this article in its original form through TimesMachine."}, {"url": "https://basketball.realgm.com/nba/teams/New-York-Knicks/20/Rosters/Regular/1958", "page_content": "Larry Friend was selected as the #5 pick in the Second Round of the 1957 NBA Draft by the New York Knicks. Larry Friend signed a contract with the New York Knicks on September 1, 1957.\n\nRichie Guerin was selected as the #8 pick in the Second Round of the 1954 NBA Draft by the New York Knicks. Richie Guerin signed a multi-year contract with the New York Knicks on September 1, 1956.\n\nBrendan McCann was selected as the #5 pick in the First Round of the 1957 NBA Draft by the New York Knicks. Brendan McCann signed a multi-year contract with the New York Knicks on September 1, 1957.\n\nKenny Sears was selected as the #2 pick in the 15 Round of the 1953 NBA Draft by the New York Knicks. Kenny Sears signed a multi-year contract with the New York Knicks on September 1, 1955.\n\nRonnie Shavlik was selected as the #4 pick in the First Round of the 1956 NBA Draft by the New York Knicks. Ronnie Shavlik signed a multi-year contract with the New York Knicks on September 1, 1956.\n\nRon Sobiezczyk was selected as the #6 pick in the First Round of the 1956 NBA Draft by the Fort Wayne Pistons. Ron Sobiezczyk signed a multi-year contract with the New York Knicks on September 1, 1956.\n\nGuy Sparrow was selected as the #5 pick in the 3 Round of the 1955 NBA Draft by the New York Knicks. Guy Sparrow signed a multi-year contract with the New York Knicks on September 1, 1957."}]}