{"Willie Naulls was a three-time NCAA All-American at UCLA.": [{"url": "https://uclabruins.com/news/2018/11/25/mens-basketball-ucla-alumnus-willie-naulls-passes-away.aspx", "page_content": "Willie Naulls, who starred for the UCLA basketball program from 1954-56, passed away peacefully on Thursday, Nov. 22, at his home in Laguna Niguel, Calif.\n\n\n\nNaulls, who was 84 years old, was a three-year varsity basketball winner for UCLA and guided the Bruins to the Pacific Coast Conference title as a senior in 1956. He established UCLA's single-game rebounding record, totaling 28 rebounds in a game against Arizona State on Jan. 28, 1956. His record still stands today.\n\n\n\nThrough three varsity seasons at UCLA, Naulls averaged 15.5 points and 11.4 rebounds per game. He secured All-America honors after his senior season.\n\n\n\nWhen he had finished playing at UCLA, Naulls had established the program's all-time scoring record (1,225 points in three seasons). He currently ranks No. 40 on the Bruins' all-time scoring list and No. 7 on the all-time rebounds list. Naulls led the Bruins in rebounding in each of his three seasons on the varsity team.\n\n\n\nNaulls was an all-conference selection (Pacific Coast Conference) in 1955 and 1956.\n\n\n\nAfter a remarkable collegiate career, Naulls was selected in the second round of the NBA Draft by the St. Louis Hawks. He enjoyed a 10-year NBA career, competing for St. Louis, the New York Knicks, the San Francisco Warriors and the Boston Celtics. He became the first former UCLA player to lead his team to the NBA Finals. Boston advanced to the finals and won the NBA Championship in 1964, 1965 and 1966 (Naulls' final three NBA seasons).\n\n\n\nNaulls, along with Bill Russell, K.C. Jones, Sam Jones and Tom Sanders, became the first all-African-American starting team in the history of integrated professional sports in Dec. 1964, when Naulls replaced injured Tom Heinsohn in the starting lineup.\n\n\n\nChoosing to retire from the NBA after leading Boston to the 1966 NBA Championship, Naulls returned to Los Angeles and completed his undergraduate degree at UCLA. Naulls was inducted into the UCLA Athletic Hall of Fame in 1986.\n\n\n\nIn 1981, the NCAA honored Naulls with the Silver Anniversary Award, bestowed upon five former student-athletes on the 25th anniversary of the end of their collegiate eligibility. While the award factors in an individual's athletic accomplishments, the Silver Anniversary Award also uses professional accomplishments and philanthropic work as criteria.\n\n\n\nAfter his basketball career had ended, Naulls worked with youth for over five decades. He served young people growing up in communities similar to those of his childhood in San Pedro and Watts and founded a non-profit organization. The foundation raised funds to provide week-long free summer basketball camps on college campuses for junior high and high school boys, recommended by coaches in southern California.\n\n\n\nNaulls enrolled in Fuller Theological Seminary in 1990, earning a master's degree in theology in 1993. During that time, he worked as a college counselor for Brentwood Presbyterian Church. Later, he served as associate pastor for Antelope Valley Christian Center. In 1993, he incorporated Willie Naulls Ministries.\n\n\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; his children Lisa, Shannon, Joanh and Malaika; and his grandchildren Celia, Michael, Dean, Jonathan, Elle and Jojo.\n\n"}, {"url": "https://uclabruins.com/honors/hall-of-fame/willie-naulls/282", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://www.nbcsports.com/boston/celtics/boston-celtics-pioneer-willie-naulls-passes-away-84", "page_content": "NEW ORLEANS – Willie Naulls, a three-time NBA champion with the Boston Celtics as well as a member of the first all-Black starting five in NBA history, passed away on Thanksgiving morning.\n\nHe was 84 years old.\n\nNaulls, who spent the bulk of his 10-year NBA career with the New York Knicks, is remembered fondly by his former Celtics teammate, Hall of Famer Tommy Heinsohn.\n\n“Willie was a terrific player,” Heinsohn told NBC Sports Boston in a phone interview. “Really, a competitive guy.”\n\nHeinsohn and Naulls will forever be linked together because it was Naulls who replaced a then-injured Heinsohn in Boston’s starting lineup to form what became the first all-Black starting five. In their first game, they defeated the St. Louis Hawks 97-84 on Dec. 26, 1964 in what became the first of 14 straight wins with the new starting five (Boston had won its two previous games prior to inserting Naulls into the starting five). That helped set the tone for the franchise’s 7th straight NBA title, and 8th overall.\n\nIn addition to Naulls, the starting five for that game included Satch Sanders, Sam Jones, K.C. Jones and Bill Russell – all Naismith Memorial Hall of Famers in addition to being the only black players on the Celtics roster at that time.\n\nWhile there was certainly a heightened sense of social consciousness throughout the country at that time, Red Auerbach was a coach consumed by winning and because of that, didn’t initially recognize the historical significance of putting Naulls in with the first unit.\n\n“First of all, I had no idea that I started five black players until a writer pointed it out to me a few weeks later,” Auerbach said at the time. “It didn’t make a difference to me what color any of my players were. I was putting the five best players out on the court so that we could win.”\n\nBeing part of the first all-Black starting five was just part of the history-making narrative surrounding Naulls.\n\nHe spent his first seven seasons with the New York Knicks and served as a team captain for the last three. Naulls was the first Black captain in New York Knicks history and one of the first for any major professional sports team.\n\nDuring his career, the 6-foot-6 Naulls, known for his one-handed outside shot, was a four-time All-Star (1958; 1960-1962) who was a career 15.8 points per game scorer who left New York as one of the franchise’s all-time leader scorers.\n\nSensing he could be of some help to the Boston Celtics in their quest to win yet another championship, Auerbach convinced Naulls to join forces with the Celtics.\n\n“He was one of the famous guys Red (Auerbach) enticed to come out of retirement,” Heinsohn said.\n\nUpon retirement, the former UCLA star went into real estate and commercial development in addition to activating several community-based initiatives designed to aid youth.\n\nThat would serve as a precursor to his true calling as a pastor.\n\n“The main factors contributing to my success have been, first, the wisdom of my parents in seeing that I received a disciplined Christian upbringing and the best education available and, second, my good fortune in having achieved a high and rare degree of success in athletics,” Naulls said in a curriculum vita obtained by NBC Sports Boston. “As an adult, I can reflect back and realize how blessed I am to have escaped the perpetuation of mediocrity foisted upon most African-American people. Even though I have had the opportunity of meeting and associating with the “elite” of our society, I have always understood that my successes were a deviation from the norm, and I have never stopped agonizing over the plight of poor, underprivileged people who have not experienced the benefits of a mother’s unselfish sacrifice and vision to equip her children.\n\nNaulls added, “The insecurities that I felt growing up in a disadvantaged community I have never\n\nforgotten. These memories have directly influenced my life’s commitment to serve young people of all ethnic backgrounds who would commit themselves to the pursuit of Truth and excellence. I was taught very early the value of a positive attitude about working toward becoming the best that I could be. Young people are our most valuable resource, and my life’s goal is to bring together prepared and committed teachers who will share their specific knowledge and wisdom with youth who commit themselves to preparing to become positive and productive members of our society.”\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device."}, {"url": "https://apnews.com/d38ef8a932cb49bfae54665fb9ab3017", "page_content": "LOS ANGELES (AP) — Willie Naulls, the former UCLA star who was a four-time All-Star with the New York Knicks and won three NBA championships with the Boston Celtics, has died. He was 84.\n\nNaulls died on Thanksgiving at his home in Laguna Niguel, south of Los Angeles, UCLA said. The cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues.\n\nThere was a moment of silence for Naulls before UCLA’s basketball game Wednesday night.\n\nAfter playing for UCLA from 1954-56, Naulls was selected with the ninth overall pick in the NBA draft by the St. Louis Hawks.\n\nBut he spent just 19 games with the Hawks, calling it a “culture shock” to see the segregation that existed in St. Louis, the likes of which he hadn’t seen since he was eight before moving from Dallas to Los Angeles. He was then traded to the Knicks.\n\nBoston won titles in 1964, ’65 and ‘66, Naulls’ final three seasons.\n\nAlong with Bill Russell, K.C. Jones, Sam Jones and Tom Sanders, Naulls comprised the first all-black lineup in the history of integrated pro sports in December 1964 when Naulls replaced injured Tom Heinsohn as a starter.\n\nWith the Knicks, Naulls became the first black to be named a captain of a pro team in a major American sport. He averaged a double-double (19.3 points and 10.7 rebounds) during his seven-year tenure with the Knicks.\n\nThe 6-foot-6 forward also played for the San Francisco Warriors during his 10-year pro career.\n\nNaulls averaged 15.5 points and 11.4 rebounds playing for three years at UCLA.\n\nHe set UCLA’s single-game rebounding record with 28 against Arizona State on Jan. 28, 1956, a mark that still stands. He led the team in rebounding each of his three seasons.\n\nPlaying for future Hall of Fame coach John Wooden, he helped the Bruins win the Pacific Coast Conference title as a senior in 1956, when he earned All-America honors. At the time his college career ended, he was the school’s career leader in points (1,225) and rebounds (900).\n\nAfter retiring from the NBA, Naulls returned to UCLA and completed his undergraduate degree. He earned a master’s in theology from Fuller Theological Seminary in Pasadena in 1993.\n\nNaulls worked with underserved youth for over 50 years and founded a nonprofit organization that raised money for free summer basketball camps for junior high and high school boys.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Joanh and Malaika; and six grandchildren."}, {"url": "https://www.latimes.com/sports/ucla/la-sp-ucla-willie-naulls-20181125-story.html", "page_content": "Willie Naulls momentarily contained his rage when he heard the racial epithet expressed matter-of-factly by an opponent announcing to his teammates whom he would defend.\n\n“I got this … over here,” the Duke player said during a game against Naulls’ UCLA Bruins as part of a holiday tournament in December 1953 in racially segregated Lexington, Ky.\n\nNaulls’ revenge came the next time he got the ball. The 6-foot-6 forward plunged his left elbow into his defender’s jawline as he drove past, arcing the ball off the backboard and into the basket to give the Bruins a two-point lead in an eventual five-point victory.\n\nAdvertisement\n\n“It is amazing what a well-placed elbow, within the rules of the game, will do to expose a coward,” Naulls later wrote in his book, “Levitation’s View.” “This guy would not even look me in the eyes and he stayed at a distance the rest of the game.”\n\nMost of the blows that Naulls, who died Thursday at age 84 in Laguna Niguel after an eight-year battle with a rare immunological condition that diminished his lung capacity, struck in the name of integration were of the symbolic variety.\n\nNaulls became the first black team captain in integrated professional sports history when his New York Knicks teammates voted him into that role when he joined the team in 1956. He went on to win three NBA championships with the Boston Celtics while becoming a member of the first all-black starting lineup in integrated professional sports history.\n\nNaulls, who became an All-American during his three seasons playing for coach John Wooden’s Bruins, holds the school record for most rebounds in a game with 28 against Arizona State in January 1956. His 582 field-goal attempts during the 1955-56 season also is a school record.\n\nWhile the Bruins were in Lexington for the holiday tournament during his sophomore season, Naulls helped integrate the bus the team rode on as well as the theater where they watched a movie and the hotel where they slept together in the basement’s boiler room on Army cots.\n\n“The humiliation was borne by each of us — black and white together,” Naulls wrote in his book. “We took turns showering in a basement employee restroom and ate together in a special banquet room next to the kitchen.”\n\nNaulls averaged 15.5 points and 11.4 rebounds per game while at UCLA, helping the Bruins win a Pacific Coast Conference championship and advance to the NCAA tournament during his final season. He later helped recruit point guard Walt Hazzard, the star of the Bruins’ first national championship team in 1964.\n\nBill Russell and K.C. Jones, who won two NCAA titles with the University of San Francisco, called Naulls their greatest competitor and invited him to join their team on a U.S. State Department-sponsored tour of Central and South America.\n\nThe St. Louis Hawks selected Naulls ninth overall in the 1956 draft before trading him to the Knicks after 19 games. He went on to become a four-time All-Star during a 10-year NBA career in which he averaged 15.8 points and 9.1 rebounds per game.\n\nNaulls returned to Los Angeles after retiring following the Celtics’ 1966 championship, completing his undergraduate degree at UCLA. He was voted into the school’s Athletics Hall of Fame in 1986 and remained an active supporter of his alma mater, serving on the board of directors of the UCLA Alumni Assn. and becoming the school’s first basketball alumnus to endow a scholarship for the basketball program.\n\nA native of Dallas who moved to San Pedro when he was 9, Naulls spent the final five decades of his life helping underserved youth through a nonprofit organization he founded and became a minister who wrote eight books to inspire others.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Jonah and Malaika; and six grandchildren. Services are pending."}, {"url": "https://www.bgca.org/about-us/alumni-hall-of-fame/willie-naulls", "page_content": "Willie Naulls\n\nSan Pedro, California\n\nProfessional Basketball Player\n\nAs a San Pedro High School student, Naulls was named California Mr. Basketball in 1952. After an All-American career at UCLA, he became an All-Star for the New York Knicks and the first African-American captain of a major professional sports team. He spent his final three seasons with the Boston Celtics and won three championships. After retiring in 1966 with 11,305 points and 6,508 rebounds, Naulls went on to a successful business career before being called to the ministry. Willie Naulls Ministries teaches young people hope and promotes awareness of the importance of academic, physical and spiritual achievement."}, {"url": "https://www.nytimes.com/2018/11/25/obituaries/willie-naulls-dies.html", "page_content": "Willie Naulls, a four-time All-Star forward with the Knicks, a member of three consecutive N.B.A. championship teams with the Boston Celtics and one of pro basketball’s early black stars, died on Thursday at his home in Laguna Niguel, Calif. He was 84.\n\nThe cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues, his wife, Dr. Anne Van de Water Naulls, said.\n\nA fine outside shooter and a rugged rebounder at 6 feet 6 inches and 225 pounds or so, Naulls was an All-American at U.C.L.A. in 1956, his senior season, playing for the future Hall of Fame coach John Wooden. He was a second-round draft pick of the St. Louis Hawks.\n\nBut on joining the Hawks Naulls was distraught over the racial climate of St. Louis; his family had moved from Dallas to Southern California to escape segregation."}, {"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://247sports.com/nba/boston-celtics/Article/Willie-Naulls-former-NBA-All-Star-and-three-time-champion-dies-at-84-125383468/", "page_content": "The basketball world has lost one of the game's pioneers as three-time NBA champion and former All-Star Willie Naulls has died at the age of 84.\n\nAccording to a report from Richard Goldstein of The New York Times, Naulls wife, Dr. Anne Van de Water Naulls, confirmed to the paper that her husband had passed after respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues.\n\nA former UCLA Bruins standout during the John Wooden years, Naulls helped the Boston Celtics win three consecutive NBA championships from 1964-1966 and was also a three-time All-Star (1958, 1960 and 1962) during his time with the New York Knicks.\n\nIn the early 1960's , Naulls became the first African-American in any of the major American sports to serve as a team captain as his Knicks teammates chose for him to serve in that role during his time with the franchise."}, {"url": "https://www.espn.com/nba/story/_/id/25379409/willie-naulls-former-nba-all-star-dies-84", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}], "Willie Naulls was named the Most Valuable Player of the 1956 Final Four.": [{"url": "https://www.latimes.com/sports/ucla/la-sp-ucla-willie-naulls-20181125-story.html", "page_content": "Willie Naulls momentarily contained his rage when he heard the racial epithet expressed matter-of-factly by an opponent announcing to his teammates whom he would defend.\n\n“I got this … over here,” the Duke player said during a game against Naulls’ UCLA Bruins as part of a holiday tournament in December 1953 in racially segregated Lexington, Ky.\n\nNaulls’ revenge came the next time he got the ball. The 6-foot-6 forward plunged his left elbow into his defender’s jawline as he drove past, arcing the ball off the backboard and into the basket to give the Bruins a two-point lead in an eventual five-point victory.\n\nAdvertisement\n\n“It is amazing what a well-placed elbow, within the rules of the game, will do to expose a coward,” Naulls later wrote in his book, “Levitation’s View.” “This guy would not even look me in the eyes and he stayed at a distance the rest of the game.”\n\nMost of the blows that Naulls, who died Thursday at age 84 in Laguna Niguel after an eight-year battle with a rare immunological condition that diminished his lung capacity, struck in the name of integration were of the symbolic variety.\n\nNaulls became the first black team captain in integrated professional sports history when his New York Knicks teammates voted him into that role when he joined the team in 1956. He went on to win three NBA championships with the Boston Celtics while becoming a member of the first all-black starting lineup in integrated professional sports history.\n\nNaulls, who became an All-American during his three seasons playing for coach John Wooden’s Bruins, holds the school record for most rebounds in a game with 28 against Arizona State in January 1956. His 582 field-goal attempts during the 1955-56 season also is a school record.\n\nWhile the Bruins were in Lexington for the holiday tournament during his sophomore season, Naulls helped integrate the bus the team rode on as well as the theater where they watched a movie and the hotel where they slept together in the basement’s boiler room on Army cots.\n\n“The humiliation was borne by each of us — black and white together,” Naulls wrote in his book. “We took turns showering in a basement employee restroom and ate together in a special banquet room next to the kitchen.”\n\nNaulls averaged 15.5 points and 11.4 rebounds per game while at UCLA, helping the Bruins win a Pacific Coast Conference championship and advance to the NCAA tournament during his final season. He later helped recruit point guard Walt Hazzard, the star of the Bruins’ first national championship team in 1964.\n\nBill Russell and K.C. Jones, who won two NCAA titles with the University of San Francisco, called Naulls their greatest competitor and invited him to join their team on a U.S. State Department-sponsored tour of Central and South America.\n\nThe St. Louis Hawks selected Naulls ninth overall in the 1956 draft before trading him to the Knicks after 19 games. He went on to become a four-time All-Star during a 10-year NBA career in which he averaged 15.8 points and 9.1 rebounds per game.\n\nNaulls returned to Los Angeles after retiring following the Celtics’ 1966 championship, completing his undergraduate degree at UCLA. He was voted into the school’s Athletics Hall of Fame in 1986 and remained an active supporter of his alma mater, serving on the board of directors of the UCLA Alumni Assn. and becoming the school’s first basketball alumnus to endow a scholarship for the basketball program.\n\nA native of Dallas who moved to San Pedro when he was 9, Naulls spent the final five decades of his life helping underserved youth through a nonprofit organization he founded and became a minister who wrote eight books to inspire others.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Jonah and Malaika; and six grandchildren. Services are pending."}, {"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://www.wikiwand.com/en/Willie_Naulls", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Willie Naulls?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.nbcsports.com/boston/celtics/boston-celtics-pioneer-willie-naulls-passes-away-84", "page_content": "NEW ORLEANS – Willie Naulls, a three-time NBA champion with the Boston Celtics as well as a member of the first all-Black starting five in NBA history, passed away on Thanksgiving morning.\n\nHe was 84 years old.\n\nNaulls, who spent the bulk of his 10-year NBA career with the New York Knicks, is remembered fondly by his former Celtics teammate, Hall of Famer Tommy Heinsohn.\n\n“Willie was a terrific player,” Heinsohn told NBC Sports Boston in a phone interview. “Really, a competitive guy.”\n\nHeinsohn and Naulls will forever be linked together because it was Naulls who replaced a then-injured Heinsohn in Boston’s starting lineup to form what became the first all-Black starting five. In their first game, they defeated the St. Louis Hawks 97-84 on Dec. 26, 1964 in what became the first of 14 straight wins with the new starting five (Boston had won its two previous games prior to inserting Naulls into the starting five). That helped set the tone for the franchise’s 7th straight NBA title, and 8th overall.\n\nIn addition to Naulls, the starting five for that game included Satch Sanders, Sam Jones, K.C. Jones and Bill Russell – all Naismith Memorial Hall of Famers in addition to being the only black players on the Celtics roster at that time.\n\nWhile there was certainly a heightened sense of social consciousness throughout the country at that time, Red Auerbach was a coach consumed by winning and because of that, didn’t initially recognize the historical significance of putting Naulls in with the first unit.\n\n“First of all, I had no idea that I started five black players until a writer pointed it out to me a few weeks later,” Auerbach said at the time. “It didn’t make a difference to me what color any of my players were. I was putting the five best players out on the court so that we could win.”\n\nBeing part of the first all-Black starting five was just part of the history-making narrative surrounding Naulls.\n\nHe spent his first seven seasons with the New York Knicks and served as a team captain for the last three. Naulls was the first Black captain in New York Knicks history and one of the first for any major professional sports team.\n\nDuring his career, the 6-foot-6 Naulls, known for his one-handed outside shot, was a four-time All-Star (1958; 1960-1962) who was a career 15.8 points per game scorer who left New York as one of the franchise’s all-time leader scorers.\n\nSensing he could be of some help to the Boston Celtics in their quest to win yet another championship, Auerbach convinced Naulls to join forces with the Celtics.\n\n“He was one of the famous guys Red (Auerbach) enticed to come out of retirement,” Heinsohn said.\n\nUpon retirement, the former UCLA star went into real estate and commercial development in addition to activating several community-based initiatives designed to aid youth.\n\nThat would serve as a precursor to his true calling as a pastor.\n\n“The main factors contributing to my success have been, first, the wisdom of my parents in seeing that I received a disciplined Christian upbringing and the best education available and, second, my good fortune in having achieved a high and rare degree of success in athletics,” Naulls said in a curriculum vita obtained by NBC Sports Boston. “As an adult, I can reflect back and realize how blessed I am to have escaped the perpetuation of mediocrity foisted upon most African-American people. Even though I have had the opportunity of meeting and associating with the “elite” of our society, I have always understood that my successes were a deviation from the norm, and I have never stopped agonizing over the plight of poor, underprivileged people who have not experienced the benefits of a mother’s unselfish sacrifice and vision to equip her children.\n\nNaulls added, “The insecurities that I felt growing up in a disadvantaged community I have never\n\nforgotten. These memories have directly influenced my life’s commitment to serve young people of all ethnic backgrounds who would commit themselves to the pursuit of Truth and excellence. I was taught very early the value of a positive attitude about working toward becoming the best that I could be. Young people are our most valuable resource, and my life’s goal is to bring together prepared and committed teachers who will share their specific knowledge and wisdom with youth who commit themselves to preparing to become positive and productive members of our society.”\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device."}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-born-oliver-signed-history-2021/", "page_content": "On this day in Boston Celtics history, champion small forward Willie Naulls was born in Dallas, Texas, in 1934. A graduate of the University of California, Los Angeles, where he played for Hall of Fame coaching legend John Wooden, Naulls was selected with the ninth pick of the 1956 NBA draft by the (then) St. Louis (now, Atlanta) Hawks.\n\nHe played 19 games with that organization before being traded to the New York Knicks early in his rookie year. He spent the bulk of his career with the Knicks, who named him the first Black team captain in league history.\n\nIt wasn’t the last trade of his career of course, or you would not be reading about him on this site."}, {"url": "https://www.bgca.org/about-us/alumni-hall-of-fame/willie-naulls", "page_content": "Willie Naulls\n\nSan Pedro, California\n\nProfessional Basketball Player\n\nAs a San Pedro High School student, Naulls was named California Mr. Basketball in 1952. After an All-American career at UCLA, he became an All-Star for the New York Knicks and the first African-American captain of a major professional sports team. He spent his final three seasons with the Boston Celtics and won three championships. After retiring in 1966 with 11,305 points and 6,508 rebounds, Naulls went on to a successful business career before being called to the ministry. Willie Naulls Ministries teaches young people hope and promotes awareness of the importance of academic, physical and spiritual achievement."}, {"url": "https://simple.wikipedia.org/wiki/Willie_Naulls", "page_content": "William Dean Naulls (October 7, 1934 – November 22, 2018) was an American basketball player. He played professionally in the National Basketball Association from 1956 to 1966. He was born in Dallas, Texas, but was raised in Los Angeles, California. He played for the St. Louis Hawks, New York Knicks, Golden State Warriors and the Boston Celtics.[1][2]\n\nNaulls died on November 22, 2018 in Laguna Niguel, California from respiratory failure at the age of 84.[3]\n\nOther websites [ change | change source ]"}, {"url": "https://www.sportstats.name/basketball/players/willie-naulls-season-1956-1957-stats-2/", "page_content": "Willie Naulls season 1956/1957 stats\n\nStats chart\n\nWillie Naulls was 22 years old in the 1956/1957 season. Willie Naulls played in the 1956/1957 season for STL in the NBA League. He played F-C position position in the STL team. He played in 19 games and was a starter in games. Willie Naulls played 438 minutes in the NBA.\n\nHe’s PER (strives to measure a player’s per-minute performance, while adjusting for pace) was 15.4.\n\nIn the 1956/1957 season, on the NBA courts for the STL basketball team, he also scored an average of: 10.26 points per game, 8.79 rebounds per game, 1.16 assists per game, 0 steals per game and 0 blocks per game.\n\nPlayer Profile\n\nFull Name: Willie Naulls\n\nPlayer Salary:\n\nAge In Season 1956/1957: 22\n\nSeason 1956/1957 Club: STL\n\nPosition: F-C\n\nStats\n\nAppearances for 1956/1957 season\n\nGames: 19\n\nStarting Five:\n\nMinutes: 438 minutes\n\nPlayer Efficiency Rating: 15.4\n\nPoints\n\nTotal Points: 195\n\nPoints Per Game: 10.26\n\nShooting\n\nTrue Shooting Percentage: 41.10%\n\nFree Throw Rate or FTR is the ratio of Free Throw Attempts to Field Goal Attempts: 28.40%\n\nField Goal: 77\n\nField Goal Attempts: 211\n\nField Goal Percentage: 36.50%\n\n2pt Made: 77\n\n2pt Attempted: 211\n\n2pt Percentage: 36.50%\n\nEffective Field Goal Percentage: 36.50%\n\nThree Points Shooting\n\n3-Point Attempt Rate- Percentage of FG Attempts from 3-Point Range:\n\nThree Pointers Made:\n\nThree Pointers Attempted:\n\nThree Pointers Percentage:\n\nFree Throws\n\nFree Throws Made: 41\n\nFree Throws Attempted: 60\n\nFree Throws Percentage: 68.30%\n\nRebounds\n\nTotal Rebounds: 167\n\nRebounds Per Game: 8.79%\n\nTotal Rebound Percentage: %\n\nOffensive Rebounds Total:\n\nOffensive Rebounds Per Game: 0%\n\nOffensive Rebound Percentage: %\n\nDefensive Rebounds Total:\n\nDefensive Rebounds Per Game: 0%\n\nDefensive Rebound Percentage: %\n\nAssists\n\nTotal Assists: 22\n\nAssists Per Game: 1.16%\n\nTotal Assists Percentage: %\n\nSteals\n\nTotal Steals:\n\nSteals Per Game: 0%\n\nTotal Steals Percentage: %\n\nBlocks\n\nTotal Blocks:\n\nBlocks Per Game: 0%\n\nTotal Blocks Percentage: %\n\nTurnovers\n\nTotal Turnovers:\n\nTurnovers Per Game: 0%\n\nTotal Turnovers Percentage: %\n\nFouls\n\nTotal Fouls: 57\n\nFouls Per Game: 3%\n\nOther Stats\n\nUsage Rate (USG) *: %\n\nOffensive Win Shares (OWS)*: -0.1\n\nDefensive Win Shares (DWS)*: 0.5\n\nWin Share (WS)*: 0.4\n\nWin Share (WS/48)*: 0.046\n\nOffensive Box Plus-Minus (BPM)*: -0.1\n\nDefensive Box Plus-Minus (BPM)*: 0.5\n\nBox Plus-Minus (BPM)*:\n\nValue over Replacement Player (VORP)*:\n\nStats Explanation\n\nUSG % – Usage Rate\n\nUsage rate calculates what percentage of team plays a player was involved in while he was on the floor, provided that the play ends in one of the three true results: field-goal attempt, free-throw attempt or turnover.\n\nOffensive Win Shares (OWS)\n\nWin Shares are easily the best metric for evaluating the offensive play of a single player. Points scored, assists and offensive rebounds.\n\nDefensive Win Shares (DWS)\n\nDefensive win shares (DWS) is a player statistic that attributes credit to players based on their ability to prevent opposing teams from scoring. A player’s DWS is calculated by estimating the number of points allowed per 100 defensive possessions.\n\nWin Share\n\nWin Shares is a player statistic which attempts to divvy up credit for team success to the individuals on the team.\n\nWin Share (WS/48)\n\nWin Share is a measure that is assigned to players based on their offense, defense, and playing time.\n\nBox Plus-Minus (BPM)\n\nBox plus-minus is based on box score for evaluating basketball players’ quality and contribution to the team from play-by-play regression.\n\nValue over Replacement Player (VORP)\n\nThis stat converts the BPM rate into an estimate of each player’s overall contribution to the team, measured vs. what a theoretical “replacement player” would provide, where the “replacement player” is defined as a player on minimum salary or not a normal member of a team’s rotation.\n\nFrequently Asked Questions\n\nHow old was Willie Naulls in the 1956/1957 season?\n\nWillie Naulls was 22 in the 1956/1957 season.\n\nWhat club did Willie Naulls play for in the 1956/1957 season?\n\nIn the 1956/1957, Willie Naulls played for STL from NBA League.\n\nWhat position does Willie Naulls play?\n\nWillie Naulls played as a F-C.\n\nHow many matches did Willie Naulls play?\n\nIn the 1956/1957 season, Willie Naulls made 19 appearances for STL.\n\nHow much Willie Naulls make in the 1956/1957 season?\n\nWillie Naulls made in 1956/1957.\n\nHow many PPG (points per game) did Willie Naulls average in 1956/1957?\n\nWillie Naulls averaged 10.26 points per game\n\nComments"}, {"url": "https://peoplepill.com/people/willie-naulls/", "page_content": "William Dean Naulls (October 7, 1934 – November 22, 2018) was an American professional basketball player for 10 years in the National Basketball Association (NBA). He was a four-time NBA All-Star with the New York Knicks and won three NBA championships with the Boston Celtics.\n\nNaulls grew up in California, where he was named the state's Mr. Basketball in high school. He played college basketball with the UCLA Bruins, and earned All-American honors as a senior in 1956. Naulls was selected by the St. Louis Hawks (known now as the Atlanta Hawks) with the ninth overall pick of the 1956 NBA draft. He played briefly with St. Louis before being traded to New York, where he spent most of his career. With the Knicks, he became the first African American to be named a captain of a professional team in a major American sport. After a brief stint with the San Francisco Warriors (now the Golden State Warriors), Naulls finished his career with Boston. In December 1964, he was part of a Celtics unit that became the first all-black starting lineup in NBA history.\n\nEarly life Naulls was born in Dallas, Texas, to Daily and Bettie (Artis) Naulls. During World War II, the family moved to Los Angeles when he was nine to escape racial segregration. His father worked at shipyards in San Pedro, and his mother was a domestic worker. Naulls was a basketball star at San Pedro High, where he was named California Mr. Basketball in 1952.\n\nCollege career Naulls attended the University of California, Los Angeles (UCLA), where he played for the Bruins under future Basketball Hall of Fame coach John Wooden. In December 1954 during his junior year, UCLA won 47–40 over San Francisco, who were led by Naulls' future Boston teammates Bill Russell and K. C. Jones. Naulls outplayed Russell in the Dons' lone defeat of the season en route to their first of two consecutive national championships. As a senior in 1955–56, Naulls set the Bruins single-game rebounding record with 28 against Arizona State, and he finished the season with 582 field goal attempts to set the school's single-season record. UCLA won the Pacific Coast Conference championship and advanced to the NCAA Tournament that season, while Naulls was named a consensus second-team All-American. In his three seasons at UCLA, Naulls averaged 15.5 points and 11.4 rebounds per game. At the time his career ended, he was the Bruins' career leader in both points (1,225) and rebounds (900). He was inducted into the UCLA Athletics Hall of Fame in 1986.\n\nNBA career Naulls was selected by the St. Louis Hawks in second round of the 1956 NBA draft with the ninth overall pick. He called it a \"culture shock\" to see the segregation that existed in St. Louis, the likes of which he had not seen since he was eight before moving to Southern California. He spent just 19 games with the Hawks before being traded to the New York Knicks, with whom he would spend most of his career. Naulls averaged a double-double (19.3 points and 10.7 rebounds per game) during his seven-year tenure with the Knicks, and he appeared as an NBA All-Star four times. The Knicks named him their captain in 1960, making him the first African-American athlete to hold the position for any pro team in a major American sport. In 1960–61, Naulls scored a single-season team record of 1,846 points, averaging 23.4 points per game. The record was broken the following season by teammate Richie Guerin. On March 2, 1962, Naulls scored 31 points and established another team record with his seventh straight game scoring 30 points or more. In that same game, Philadelphia Warriors center Wilt Chamberlain notched his NBA record 100-point game against the Knicks. Naulls' 30+ streak stood until 2010, when it was broken by Amar'e Stoudemire. During the 1962–63 NBA season, the Knicks traded Naulls to the San Francisco Warriors, with whom he played briefly before being traded to the Boston Celtics. Naulls spent his last three professional seasons with the Celtics, winning three consecutive NBA championships in the process. In December 1964 against St. Louis, he replaced an injured Tom Heinsohn to form NBA's first all-black starting lineup along with Russell at center, K. C. and Sam Jones at the guards and Satch Sanders at forward. That 1964–65 Celtics team was named one of the 10 best teams in NBA history during the league's 50th anniversary. The 6-foot-6-inch (1.98 m) Naulls finished his 10-year NBA career with averages of 15.8 points and 9.1 rebounds per game."}, {"url": "https://beyondthedash.com/obituary/willie-naulls-1071563908", "page_content": "Originally published by The Associated Press on November 29, 2018\n\nLOS ANGELES — Willie Naulls, the former UCLA star who was a four-time All-Star with the New York Knicks and won three NBA championships with the Boston Celtics, has died. He was 84.\n\nNaulls died on Thanksgiving at his home in Laguna Niguel, south of Los Angeles, UCLA said. The cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues.\n\nThere was a moment of silence for Naulls before UCLA's basketball game Wednesday night.\n\nAfter playing for UCLA from 1954-56, Naulls was selected with the ninth overall pick in the NBA draft by the St. Louis Hawks.\n\nBut he spent just 19 games with the Hawks, calling it a \"culture shock\" to see the segregation that existed in St. Louis, the likes of which he hadn't seen since he was eight before moving from Dallas to Los Angeles. He was then traded to the Knicks.\n\nBoston won titles in 1964, '65 and '66, Naulls' final three seasons.\n\nAlong with Bill Russell, K.C. Jones, Sam Jones and Tom Sanders, Naulls comprised the first all-black lineup in the history of integrated pro sports in December 1964 when Naulls replaced injured Tom Heinsohn as a starter.\n\nWith the Knicks, Naulls became the first black to be named a captain of a pro team in a major American sport. He averaged a double-double (19.3 points and 10.7 rebounds) during his seven-year tenure with the Knicks.\n\nThe 6-foot-6 forward also played for the San Francisco Warriors during his 10-year pro career.\n\nNaulls averaged 15.5 points and 11.4 rebounds playing for three years at UCLA.\n\nHe set UCLA's single-game rebounding record with 28 against Arizona State on Jan. 28, 1956, a mark that still stands. He led the team in rebounding each of his three seasons.\n\nPlaying for future Hall of Fame coach John Wooden, he helped the Bruins win the Pacific Coast Conference title as a senior in 1956, when he earned All-America honours. At the time his college career ended, he was the school's career leader in points (1,225) and rebounds (900).\n\nAfter retiring from the NBA, Naulls returned to UCLA and completed his undergraduate degree. He earned a master's in theology from Fuller Theological Seminary in Pasadena in 1993.\n\nNaulls worked with underserved youth for over 50 years and founded a non-profit organization that raised money for free summer basketball camps for junior high and high school boys.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Joanh and Malaika; and six grandchildren.\n\nThe Associated Press"}]}