{"Willie Naulls was also named to the All-NBA Second Team in 1959, 1960, and 1962.": [{"url": "https://www.espn.com/nba/story/_/id/25379409", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}, {"url": "https://www.nbcsports.com/boston/celtics/boston-celtics-pioneer-willie-naulls-passes-away-84", "page_content": "NEW ORLEANS – Willie Naulls, a three-time NBA champion with the Boston Celtics as well as a member of the first all-Black starting five in NBA history, passed away on Thanksgiving morning.\n\nHe was 84 years old.\n\nNaulls, who spent the bulk of his 10-year NBA career with the New York Knicks, is remembered fondly by his former Celtics teammate, Hall of Famer Tommy Heinsohn.\n\n“Willie was a terrific player,” Heinsohn told NBC Sports Boston in a phone interview. “Really, a competitive guy.”\n\nHeinsohn and Naulls will forever be linked together because it was Naulls who replaced a then-injured Heinsohn in Boston’s starting lineup to form what became the first all-Black starting five. In their first game, they defeated the St. Louis Hawks 97-84 on Dec. 26, 1964 in what became the first of 14 straight wins with the new starting five (Boston had won its two previous games prior to inserting Naulls into the starting five). That helped set the tone for the franchise’s 7th straight NBA title, and 8th overall.\n\nIn addition to Naulls, the starting five for that game included Satch Sanders, Sam Jones, K.C. Jones and Bill Russell – all Naismith Memorial Hall of Famers in addition to being the only black players on the Celtics roster at that time.\n\nWhile there was certainly a heightened sense of social consciousness throughout the country at that time, Red Auerbach was a coach consumed by winning and because of that, didn’t initially recognize the historical significance of putting Naulls in with the first unit.\n\n“First of all, I had no idea that I started five black players until a writer pointed it out to me a few weeks later,” Auerbach said at the time. “It didn’t make a difference to me what color any of my players were. I was putting the five best players out on the court so that we could win.”\n\nBeing part of the first all-Black starting five was just part of the history-making narrative surrounding Naulls.\n\nHe spent his first seven seasons with the New York Knicks and served as a team captain for the last three. Naulls was the first Black captain in New York Knicks history and one of the first for any major professional sports team.\n\nDuring his career, the 6-foot-6 Naulls, known for his one-handed outside shot, was a four-time All-Star (1958; 1960-1962) who was a career 15.8 points per game scorer who left New York as one of the franchise’s all-time leader scorers.\n\nSensing he could be of some help to the Boston Celtics in their quest to win yet another championship, Auerbach convinced Naulls to join forces with the Celtics.\n\n“He was one of the famous guys Red (Auerbach) enticed to come out of retirement,” Heinsohn said.\n\nUpon retirement, the former UCLA star went into real estate and commercial development in addition to activating several community-based initiatives designed to aid youth.\n\nThat would serve as a precursor to his true calling as a pastor.\n\n“The main factors contributing to my success have been, first, the wisdom of my parents in seeing that I received a disciplined Christian upbringing and the best education available and, second, my good fortune in having achieved a high and rare degree of success in athletics,” Naulls said in a curriculum vita obtained by NBC Sports Boston. “As an adult, I can reflect back and realize how blessed I am to have escaped the perpetuation of mediocrity foisted upon most African-American people. Even though I have had the opportunity of meeting and associating with the “elite” of our society, I have always understood that my successes were a deviation from the norm, and I have never stopped agonizing over the plight of poor, underprivileged people who have not experienced the benefits of a mother’s unselfish sacrifice and vision to equip her children.\n\nNaulls added, “The insecurities that I felt growing up in a disadvantaged community I have never\n\nforgotten. These memories have directly influenced my life’s commitment to serve young people of all ethnic backgrounds who would commit themselves to the pursuit of Truth and excellence. I was taught very early the value of a positive attitude about working toward becoming the best that I could be. Young people are our most valuable resource, and my life’s goal is to bring together prepared and committed teachers who will share their specific knowledge and wisdom with youth who commit themselves to preparing to become positive and productive members of our society.”\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device."}, {"url": "https://www.basketball-reference.com/players/n/naullwi01.html", "page_content": "Frequently Asked Questions\n\nWhere was Willie Naulls born?\n\nWillie Naulls was born in Dallas, Texas.\n\nWhen was Willie Naulls born?\n\nWillie Naulls was born on October 7, 1934.\n\nHow tall was Willie Naulls?\n\nWillie Naulls was 6-6 (198 cm) tall.\n\nHow much did Willie Naulls weigh when playing?\n\nWillie Naulls weighed 225 lbs (102 kg) when playing.\n\nIs Willie Naulls in the Hall of Fame?\n\nWillie Naulls is not in the Hall of Fame.\n\nWhen was Willie Naulls drafted?\n\nWillie Naulls was drafted by St. Louis Hawks, 2nd round (2nd pick, 10th overall), 1956 NBA Draft.\n\nWhat position did Willie Naulls play?\n\nSmall Forward and Power Forward.\n\nWhen did Willie Naulls retire?\n\nWillie Naulls last played in 1966.\n\nWhat did Willie Naulls average?\n\nWillie Naulls averaged 15.8 points, 9.1 rebounds, and 1.6 assists per game.\n\nHow many rings does Willie Naulls have?\n\nWillie Naulls won 3 championships.\n\nWhat schools did Willie Naulls attend?\n\nWillie Naulls attended San Pedro in San Pedro, California and UCLA.\n\nWhat are Willie Naulls' nicknames?\n\nThe Whale, Sweetcakes are nicknames for Willie Naulls."}, {"url": "https://simple.wikipedia.org/wiki/Willie_Naulls", "page_content": "William Dean Naulls (October 7, 1934 – November 22, 2018) was an American basketball player. He played professionally in the National Basketball Association from 1956 to 1966. He was born in Dallas, Texas, but was raised in Los Angeles, California. He played for the St. Louis Hawks, New York Knicks, Golden State Warriors and the Boston Celtics.[1][2]\n\nNaulls died on November 22, 2018 in Laguna Niguel, California from respiratory failure at the age of 84.[3]\n\nOther websites [ change | change source ]"}, {"url": "https://from-way-downtown.com/2022/03/29/%ef%bf%bcwillie-naulls-what-else-does-he-have-to-do-1962/", "page_content": "[Coming out of high school in 1950s Los Angeles, Willie Naulls was known as “Willie the Whale.” He had an ample 6-foot-6, 260-pound frame and a huge reputation in Southern California for his exploits on the basketball court. Naulls signed with UCLA but never made the epic, game-changing splash that many expected. His problem was Coach John Wooden. The two didn’t get along at first. But his college career wasn’t a washout either. He left Westwood as a second-team All American and UCLA’s top all-time scorer and rebounder.\n\nNaulls went in the second round of the 1956 NBA draft to St. Louis. He seized his opportunity to carve out a solid 10-year NBA career, passing from St. Louis to New York, San Francisco, and Boston, where he retired in 1966. As Naulls explained, “After 10 years, the fun has essentially gone out of the game for me.” But at age 31, he walked away with many tall tales to tell. Among them was the day that he and his Knick teammates had finished practicing at a local high school, per usual. Everyone was on their way out of the gym when he heard someone say, “Hello, Mr. Naulls, I want to introduce myself . . .” Naulls glanced in the direction of the voice, then he looked up, up, up. It was the teenaged Lew Alcindor, already seven-feet tall. A friendship began, and Naulls helped to recruit Alcindor to UCLA. He also proved highly influential in keeping him there for four years.\n\nAfter basketball, Naulls chased several business opportunities and eventually founded Willie Naulls Ministries. In his role as Pastor Naulls, he published eight books about God and faith, including his autobiography, which isn’t easy find. In 2018, after a battle with the rare Churg-Strauss syndrome, Pastor Naulls passed away at age 84. His was truly a life well-lived.\n\nToday, there’s not a whole lot out there about his fine basketball career. So, I was happy to stumble on this article from the great Lou Sahadi in the magazine Complete Sports Basketball, 1961-62. Thought I’d share it with anyone who remembers or might be interested in the kid they once called Willie the Whale.]\n\nIn a steamy dressing room underneath the rotunda of Madison Square Garden one day last March, members of the New York Knickerbockers were flitting around at a leisurely pace. The mood reflected by the players signified the end of a long season. And yet, the starry-eyed rookies still had the bounce they brought with them to training camp months before. They were the first to shower and change into street clothes.\n\nWhile most of the other players in the National Basketball Association were packing their gear for the upcoming playoffs, the Knicks were left to bid farewell to one another until next season. The veterans on the squad had been through it before. A handshake, some encouraging words, and a goodbye until the next campaign. Their pace was much slower than the others. One of the veterans, Willie Naulls, was in a corner of the dimly-lit cubicle. He sat reclining on his elbows with a towel draped around his midsection. He had a big year, and his teammates congratulated him on such before departing from the humid room.\n\nAlthough innately quiet, Naulls nevertheless commanded respect for his skills with a basketball, not only from his teammates, but from around the league as well. He sat with his thoughts reflecting on the game against Detroit, the final regular-season contest for both squads, which had concluded some 10 minutes before on the floor upstairs. Only when addressed did he turn his head to acknowledge a teammate or a friend’s greeting. By this time, only a few players remained dutifully going about the task of securing their equipment until next year.\n\n“It would have been a nice game to win,” said Naulls. “At least it wouldn’t have seemed like such a long season.”\n\nThe campaign Naulls was referring to was the worst in Knick history. Virtually mired in last place all season, New York only showed 21 victories for its season’s work. Their losses numbered 58, which is the highest on record for any NBA club. The Philadelphia team of 1952-53 previously was shackled with the most losses, 57, but it came during a shorter season as attributed by its 12 wins. That year, the Knicks finished on top of its division. They did so the following season, bu haven’t since. Last year, they reached their lowest point.\n\nThey could have salvaged some token of success if they had beaten Detroit on the last day of the season. The Pistons and Cincinnati had reached the final game of the schedule deadlocked for the third-and-final playoff berth in the Western Division. But the Knickerbockers couldn’t even play the role of spoilers. They provided Detroit with the triumph it needed to assure the existing deadlock, which was ultimately broken, as Cincinnati lost at Los Angeles hours later.\n\nIndividually for Naulls, however, last season was the greatest he produced in the five years he has earned a living as a professional basketball player. He gave evidence during the early segment of the season that he was headed for a banner campaign. But his individual prowess wasn’t enough to satisfy the 6-foot-6 graduate of UCLA. Time and again throughout the course of the season when he was complimented for his stellar play, he would remark: “What good is it, we’re not winning any games.”\n\nIn most of those games, Naulls excelled as he never did before. He executed his skills quietly, but with electrifying results. Time and again, he brought the Madison Square Garden crowds to their feet with his velvety one-handed jump shots. The buffs around the famous Eighth Avenue arena called it “the touch.”\n\nNaulls brought the touch with him to New York from St. Louis in 1956. Desperately in need of backcourt strength, the Hawks traded Naulls, then a rookie, for the veteran guard Slater Martin. As it turned out, it was an excellent exchange for both clubs. In the ensuing years, Martin sparked the Hawks to three consecutive divisional titles before his retirement last year. Naulls has filled a hole at forward for the Knicks, and he still has plenty of basketball left.\n\nThe past season, the 27-year-old Naulls was an explosive offensive weapon. He scored points at a record-setting pace, finishing with 1,846, the highest total ever produced by a player wearing the livery of the New York Knickerbockers. His average of 23.4, which ranked him seventh in the NBA, also was the highest in Knick annals.\n\nBut Naulls effectiveness wasn’t limited to scoring alone. He was a determined rebounder, topping the Knicks in that department for the fourth-consecutive year. The number of stray shots he pulled down, 1,055, besides being a career high, was the second highest in New York history. Only Harry Gallatin with 1,098 in 1953-54 ranks ahead of Naulls.\n\nDespite all this, Naulls wasn’t selected on the first team of the Eastern Division all stars. Boston’s rugged Tom Heinsohn was the coaches’ pick for one spot; while Dolph Schayes, a veteran of many campaigns, received the other. Naulls was given a second-team berth, and it hurt him inside. He wondered what else he had to do?\n\nAnd yet, the knock on Naulls is that he’s not aggressive enough. A majority of the basketball cognoscenti is of the opinion Naulls dogs it most of the time he is in a game. Like most of the pros, Naulls paces himself throughout the course of a contest. He’ll admit doing such, as would any other player. The arduous grind of an NBA season dictates such a course of action. No one in the league can go 48 minutes at top speed.\n\nNaulls must judiciously conserve his strength. As players go, Naulls is not strong. He has a tendency to tire, and he knows it more than anyone else. One time during a game last season in the Garden, Naulls was off to another high-scoring night. Toward the end of the first period, he hit on five consecutive one handers, mostly from outside, which had the Knick partisans wildly cheering. Before he could make another basket, coach Carl Braun removed Naulls from the contest. This naturally evoked a loud chorus of boos from the crowd. It lasted for half a minute. However, unknowingly to the fans, Naulls himself had asked Braun to relieve him for a breather.\n\nStill, others claim Naulls is a ball hog. They argue that once the ball goes in to Naulls, it doesn’t come back out. This is unfair as Naulls, or any other player for that matter, wouldn’t deliberately ignore an open teammate underneath the basket. If the shot is there, Naulls will take it. He is conceivably the best shooter on the squad. He is expected to produce 20 or more points a game. He earns his keep as a big scorer. Forwards in the NBA are the big pointmakers. With the exception of Philadelphia’s Wilt Chamberlain and Cincinnati’s Oscar Robertson, the leading scorers last year on the remaining six teams were forwards.\n\nNaulls executes the skills of his body in a smooth fashion. Maybe the ridiculous ease in lofting his one handers towards its target creates the impression that he is loafing more than others. He performs his trade with a skill unmatched by others in his profession. His fluid movements in getting off a shot makes his labor look easy.\n\nThen, too, not being a vociferous individual, Naulls may appear to some to be just standing around while arms and legs are in flight toward the basket. He doesn’t make it a practice to get embroiled in arguments or fights as a result of the body contact some fans relish seeing. He has a placid nature and is not one to vent his anger on anyone. When he is angry, it is at himself. This, too, he fights inside. He’ll walk off the floor looking downward with his hands on his hips and take his place on the bench without any outward flare of temper, not even as much as slamming a towel to the ground.\n\nThis same nature prevents Naulls from imploring any excessive body contact underneath the boards. Because of this, the buffs maintain Naulls is afraid to mix it up. Although he doesn’t flagrantly make use of body jostling, Naulls knows how to implore any hipping movements. You couldn’t lead a team four years running in rebounds without knowing your way in and out of the traffic jams under the backboards.\n\nNaulls’ secret is that he quickly and smoothly makes use of body contact to corral or rebound. His sense of timing, not only in jumping but also in breaking toward the backboard, is his greatest asset. This provides the rebounds for Naulls, while most others resort to the brute-force strength in their massive frames to accomplish what Naulls does so gracefully.\n\nNaulls carries this quiet nature off the floor. Even on roadtrips, he bypasses the card games his teammates use as a diversion to peruse a newspaper or book. He’s almost shy, speaking only when spoken to and then in a soft tone. He dresses conservatively in Ivy League fashion and his boyish grin makes him look younger than his 27 years. He has handsome features, and his bright eyes enable him to observe people and situations in this studious manner. He is known in basketball circles as a class guy.\n\nFor the disbelievers who contend that Naulls doesn’t go all out, he answered back by playing in every Knick game last season. There were times he performed with a weak knee. Toward the campaign’s end, he almost experienced a case of fatigue. He continued playing, nourishing his body with a number of different colored pills when he just as easily could have strengthened himself by abstaining from play for a few games. Others in his profession resorted to rest as a cure for feeling fatigued.\n\nNaulls has grown to shrug off the doubters. It used to bother him. He played the game his way last year, and you can’t dispel his success. It was his greatest year as a pro. And, he did it all in his own quiet manner. That is his way."}, {"url": "https://basketball.realgm.com/player/Willie-Naulls/Summary/66576", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://www.espn.com/nba/story/_/id/25379409/willie-naulls-former-nba-all-star-dies-84", "page_content": "Former NBA All-Star and champion Willie Naulls died at age 84.\n\nHe died of respiratory failure caused by a rare immunological condition called Churg-Strauss syndrome, his wife told the New York Times.\n\nNaulls played in the NBA from 1956 to 1966. He won three titles with the Boston Celtics from 1964 to 1966 and was an All-Star with the New York Knicks in 1958 and from 1960 to 1962.\n\nNaulls, a power forward and center, had also been a second-team All-American while at UCLA in 1956, playing under future Hall of Fame coach John Wooden.\n\nWhen his Knicks teammates named him team captain in the 1960s, he was the first black athlete to be a captain with any major professional sports team."}, {"url": "https://celticswire.usatoday.com/lists/nba-boston-celtics-naulls-born-oliver-signed-history-2021/", "page_content": "On this day in Boston Celtics history, champion small forward Willie Naulls was born in Dallas, Texas, in 1934. A graduate of the University of California, Los Angeles, where he played for Hall of Fame coaching legend John Wooden, Naulls was selected with the ninth pick of the 1956 NBA draft by the (then) St. Louis (now, Atlanta) Hawks.\n\nHe played 19 games with that organization before being traded to the New York Knicks early in his rookie year. He spent the bulk of his career with the Knicks, who named him the first Black team captain in league history.\n\nIt wasn’t the last trade of his career of course, or you would not be reading about him on this site."}, {"url": "https://apnews.com/d38ef8a932cb49bfae54665fb9ab3017", "page_content": "LOS ANGELES (AP) — Willie Naulls, the former UCLA star who was a four-time All-Star with the New York Knicks and won three NBA championships with the Boston Celtics, has died. He was 84.\n\nNaulls died on Thanksgiving at his home in Laguna Niguel, south of Los Angeles, UCLA said. The cause was respiratory failure resulting from Churg-Strauss syndrome, a rare condition that can restrict blood flow to vital organs and tissues.\n\nThere was a moment of silence for Naulls before UCLA’s basketball game Wednesday night.\n\nAfter playing for UCLA from 1954-56, Naulls was selected with the ninth overall pick in the NBA draft by the St. Louis Hawks.\n\nBut he spent just 19 games with the Hawks, calling it a “culture shock” to see the segregation that existed in St. Louis, the likes of which he hadn’t seen since he was eight before moving from Dallas to Los Angeles. He was then traded to the Knicks.\n\nBoston won titles in 1964, ’65 and ‘66, Naulls’ final three seasons.\n\nAlong with Bill Russell, K.C. Jones, Sam Jones and Tom Sanders, Naulls comprised the first all-black lineup in the history of integrated pro sports in December 1964 when Naulls replaced injured Tom Heinsohn as a starter.\n\nWith the Knicks, Naulls became the first black to be named a captain of a pro team in a major American sport. He averaged a double-double (19.3 points and 10.7 rebounds) during his seven-year tenure with the Knicks.\n\nThe 6-foot-6 forward also played for the San Francisco Warriors during his 10-year pro career.\n\nNaulls averaged 15.5 points and 11.4 rebounds playing for three years at UCLA.\n\nHe set UCLA’s single-game rebounding record with 28 against Arizona State on Jan. 28, 1956, a mark that still stands. He led the team in rebounding each of his three seasons.\n\nPlaying for future Hall of Fame coach John Wooden, he helped the Bruins win the Pacific Coast Conference title as a senior in 1956, when he earned All-America honors. At the time his college career ended, he was the school’s career leader in points (1,225) and rebounds (900).\n\nAfter retiring from the NBA, Naulls returned to UCLA and completed his undergraduate degree. He earned a master’s in theology from Fuller Theological Seminary in Pasadena in 1993.\n\nNaulls worked with underserved youth for over 50 years and founded a nonprofit organization that raised money for free summer basketball camps for junior high and high school boys.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Joanh and Malaika; and six grandchildren."}, {"url": "https://www.latimes.com/sports/ucla/la-sp-ucla-willie-naulls-20181125-story.html", "page_content": "Willie Naulls momentarily contained his rage when he heard the racial epithet expressed matter-of-factly by an opponent announcing to his teammates whom he would defend.\n\n“I got this … over here,” the Duke player said during a game against Naulls’ UCLA Bruins as part of a holiday tournament in December 1953 in racially segregated Lexington, Ky.\n\nNaulls’ revenge came the next time he got the ball. The 6-foot-6 forward plunged his left elbow into his defender’s jawline as he drove past, arcing the ball off the backboard and into the basket to give the Bruins a two-point lead in an eventual five-point victory.\n\nAdvertisement\n\n“It is amazing what a well-placed elbow, within the rules of the game, will do to expose a coward,” Naulls later wrote in his book, “Levitation’s View.” “This guy would not even look me in the eyes and he stayed at a distance the rest of the game.”\n\nMost of the blows that Naulls, who died Thursday at age 84 in Laguna Niguel after an eight-year battle with a rare immunological condition that diminished his lung capacity, struck in the name of integration were of the symbolic variety.\n\nNaulls became the first black team captain in integrated professional sports history when his New York Knicks teammates voted him into that role when he joined the team in 1956. He went on to win three NBA championships with the Boston Celtics while becoming a member of the first all-black starting lineup in integrated professional sports history.\n\nNaulls, who became an All-American during his three seasons playing for coach John Wooden’s Bruins, holds the school record for most rebounds in a game with 28 against Arizona State in January 1956. His 582 field-goal attempts during the 1955-56 season also is a school record.\n\nWhile the Bruins were in Lexington for the holiday tournament during his sophomore season, Naulls helped integrate the bus the team rode on as well as the theater where they watched a movie and the hotel where they slept together in the basement’s boiler room on Army cots.\n\n“The humiliation was borne by each of us — black and white together,” Naulls wrote in his book. “We took turns showering in a basement employee restroom and ate together in a special banquet room next to the kitchen.”\n\nNaulls averaged 15.5 points and 11.4 rebounds per game while at UCLA, helping the Bruins win a Pacific Coast Conference championship and advance to the NCAA tournament during his final season. He later helped recruit point guard Walt Hazzard, the star of the Bruins’ first national championship team in 1964.\n\nBill Russell and K.C. Jones, who won two NCAA titles with the University of San Francisco, called Naulls their greatest competitor and invited him to join their team on a U.S. State Department-sponsored tour of Central and South America.\n\nThe St. Louis Hawks selected Naulls ninth overall in the 1956 draft before trading him to the Knicks after 19 games. He went on to become a four-time All-Star during a 10-year NBA career in which he averaged 15.8 points and 9.1 rebounds per game.\n\nNaulls returned to Los Angeles after retiring following the Celtics’ 1966 championship, completing his undergraduate degree at UCLA. He was voted into the school’s Athletics Hall of Fame in 1986 and remained an active supporter of his alma mater, serving on the board of directors of the UCLA Alumni Assn. and becoming the school’s first basketball alumnus to endow a scholarship for the basketball program.\n\nA native of Dallas who moved to San Pedro when he was 9, Naulls spent the final five decades of his life helping underserved youth through a nonprofit organization he founded and became a minister who wrote eight books to inspire others.\n\nNaulls is survived by his wife of 40 years, Anne Van de Water Naulls; children Lisa, Shannon, Jonah and Malaika; and six grandchildren. Services are pending."}]}