{"John Holman's research focused on the mechanisms of organic reactions, particularly those involving radicals.": [{"url": "https://www.nature.com/articles/s41586-022-05639-4", "page_content": "Determining the exact sequence of the elementary steps involved in transforming substrates into products is essential in regard to rational improvement of synthetic methods, design of new catalysts and safely scale-up industrial processes (Fig. 1a–d)1,2,3,4. To elucidate the mechanism of a reaction, several kinetic profiles are collected and human experts must carry out kinetic analysis of the data. Although reaction-monitoring technology has improved markedly during past decades to the point at which kinetic data collection can be fully automated19,20,21,22, the underlying theoretical framework for mechanism elucidation has not advanced at the same pace. The current pipeline for kinetic analysis involves three broad steps (Fig. 1e, top path): extraction of kinetic properties from experimental data, prediction of the kinetic properties of all plausible mechanisms and comparison of experimentally extracted properties with those predicted. The method most commonly used to extract kinetic properties, despite its numerous pitfalls23, is the log–log plot of initial rates developed over a century ago14. Modern kinetic analyses, such as reaction progress kinetic analysis15,16 and variable time normalization analysis17,18, extract richer kinetic information using entire kinetic profiles rather than only a small section of them. However, they miss implicit kinetic information embedded in the kinetic profiles because they focus on specific reaction properties, mainly orders of reaction. Prediction of kinetic properties also requires that chemists fully master the intricate derivation and interpretation of steady-state rate laws. Although steady-state equations are a good approximation to the kinetic behaviour of many mechanisms, they fail to predict commonly found systems far from steady state, such as reactions with slow catalyst activation or irreversible catalyst deactivation24. In addition, even moderately complex reaction networks can lead to unmanageable rate law equations that are exceedingly difficult to interpret. Alternatively, kinetic modelling has been used to fit kinetic data and, although it is a powerful engineering tool for parametrization of chemical processes, its applicability to mechanism elucidation is limited due to the difficulties involved in discriminating between models with similar goodness of fit25.\n\nFig. 1: Relevance and state of the art on kinetic analysis. a, Mechanistic understanding of a Ru-catalysed arylation leads to a new catalyst with over 100-fold increase in reactivity. b, Mechanistic understanding of a Pd-catalysed arylation leads to 150-fold increase in catalyst turnover number (TON). c, Mechanistic knowledge of an industrially relevant organocatalytic reaction enabled the design of a catalyst tenfold more reactive and 40-fold more selective. d, Kinetic investigations facilitated the development of an efficient process with low amounts of monoamine oxidase from Aspergillus niger (MAON). e, Comparison of current pipeline for mechanistic elucidation through kinetic analysis versus the use of our new, AI-based mechanistic elucidation. Full size image\n\nInspired by recent dramatic advances in the application of artificial intelligence (AI) to long-standing scientific challenges26,27,28,29,30,31,32,33, we envisioned that AI could transform the field of kinetic analysis. Herein we demonstrate that a deep learning model trained on simulated kinetic data is capable of correctly elucidating a wide variety of classes of mechanisms from temporal concentration profiles (Fig. 1e, bottom path). The machine learning model eliminates the need for rate law derivations and kinetic property extraction and prediction, thus streamlining kinetic analysis and greatly facilitating the elucidation of reaction mechanisms to all synthetic laboratories. The method increases the capacity to interrogate reaction profiles because of the holistic analysis of all kinetic data available, removes potential human error from the kinetic analysis process and expands the scope of the kinetics that can be analysed to include non-steady-state (including activation and deactivation processes) and reversible reactions. We envision that this method will be complementary to currently available kinetic analysis methods and will be especially useful in the most challenging cases.\n\nWe considered 20 commonly encountered mechanisms of reactions converting substrate (S) to product (P) mediated by a catalyst (cat) (Fig. 2a). These mechanisms belong to four distinct categories (Fig. 2a): (1) the core mechanism (M1), which is the simplest Michaelis–Menten-type mechanism14; (2) mechanisms with bicatalytic steps (M2–M5) that involve either catalyst dimerization (M2 and M3) or a reaction between two different catalytic species (M4 and M5); (3) mechanisms with catalyst activation steps based on the core mechanism, in which a precatalyst requires activation unimolecularly (M6) via either substrate coordination (M7) or ligand dissociation (M8); and (4) mechanisms with a variety of catalyst deactivation steps from either catalytic intermediate of the core mechanism (M9–M20), which are often extremely challenging to differentiate but are encountered in the vast majority of catalytic processes.\n\nFig. 2: Mechanism scope and composition of data. a, Twenty mechanisms under consideration, grouped in four basic categories. cat*, activated catalyst. b, The kinetic space of some mechanisms overlaps partially. c, Composition of a kinetic sample for training, validation or testing. [X] refers to the concentration of S or P. Full size image\n\nEach mechanism is mathematically described by a set of ordinary differential equations (ODEs) function of kinetic constants (k 1 , … k n ) and concentration of chemical species (Supplementary Information). These equations allow the generation of an infinite number of temporal concentration profiles of substrate and products, defining a kinetic space. Although kinetic spaces are characteristic for each mechanism, they can partially overlap. For example, if a particular set of kinetic constants for M2 results in no substantial formation of the off-cycle dimer cat 2 , the resulting kinetic profiles are indistinguishable from those of the core mechanism, M1 (Fig. 2b). Overlaps between classes—in our case, mechanisms—are well known to have detrimental effects on the performance of learning algorithms34,35. To minimize these overlaps we used chemical criteria (Supplementary Information) to define the kinetic space of each mechanism, giving preference to the simplest mechanisms and therefore avoiding the classification of kinetic concentration profiles to overcomplicated mechanisms with insufficient kinetic evidence.\n\nThe training of deep learning models typically requires large amounts of data, which can pose a considerable challenge when these data must be collected experimentally. However, in our case we were able to generate 5 million kinetic samples for the training and validation of the model by numerically solving the sets of ODEs, without having to use steady-state approximation. Each kinetic sample, used as input of the deep neural network, contains four temporal concentration profiles from a particular mechanism with a fixed set of kinetic constant values; three of the profiles have identical initial concentration of substrate ([S] 0 ) but different [cat] 0 in the range 1–10 mol%, and the fourth is a ‘same-excess’ experiment15 with reduced [S] 0 (Fig. 2c) and product added ([P] 0 ). We chose this combination of experiments because it includes the necessary information to differentiate between the set of potential mechanisms considered (Fig. 2a). Specifically, experiments with different concentrations of catalyst help in the assessment of the presence of mechanistic steps involving more than one catalytic species, and same-excess experiments provide information about both product inhibition and the activation and deactivation processes of the catalyst. The profiles include concentration of substrate and product at 20 randomly selected times, which ensures a breadth of profiles with data heterogeneously distributed over time and covering different ranges of conversions (see Supplementary Information for a detailed description of the data generation process).\n\nOur model contains 576,000 trainable parameters and uses a combination of two types of neural network: (1) long short-term memory neural networks, a type of recurrent neural network used to process sequences of temporal data (that is, the temporal concentration data) and (2) fully connected neural networks, used to process atemporal data (that is, the initial concentrations of catalyst in each kinetic run and features extracted by the long short-term memory). The model outputs probabilities for each mechanism, with the total sum of probabilities equalling 1 (for a full description of the model architecture see Supplementary Information). Data augmentation was applied during training, which involved (1) reducing the number of concentration–time points in the sample from 20 to any value in the range 20–3 and (2) introducing Gaussian error on the sample concentration values of S and P, with a s.d. up to 2%. Evaluation of the model with the validation set during training showed little to no overfitting, probably due to the varied and large training set (Supplementary Fig. 4).\n\nThe trained model was evaluated with a test set of 100,000 kinetic samples (5,000 per mechanism) containing six concentration–time points per profile, a typical number of data points collected when sampling reactions. Importantly, all kinetic samples in the test set belong to unique kinetic profiles, different to those used in the training set (Supplementary Information). The model afforded a categorical accuracy of 92.6%, confusion entropy36 of 0.053 and top-three accuracy of 100% with this test set. Other machine learning methods, such as similarity search, support vector machines and random forest, provided much inferior results (Supplementary Information). Interestingly, analysis of the confusion matrix plotting the actual mechanism against the predicted mechanism (Fig. 3a) showed that most mechanisms are correctly predicted with very high recall, with most mistakes clustering between two activation mechanisms (M6 and M8) and between three deactivation mechanisms (M11, M12 and M14). Analysis of the probability curves predicted for the samples of each mechanism (Fig. 3b) shows that, in the majority of test samples, the model not only predicts the correct mechanism but also does so with very high confidence (over 99%). Test samples with lower confidence are mostly due to overlap of kinetic spaces. For example, a large section of the sample pools of M11 and M14 has a confidence of around 50% because both mechanisms can have kinetic profiles in which catalyst deactivation depends identically on substrate concentration and, therefore, some of their profiles are indistinguishable. Because we consider both mechanisms to have similar complexity, we decided not to assign the common kinetic space exclusively to one of them, which would have resulted in an artificial hierarchy between them. On the contrary, we welcomed these crosses between mechanistic predictions because they demonstrate that the model is capable not only of correct classification of most mechanisms, but also of identification of sets of data that are consistent with more than one mechanism and assigning them a substantial probability. Taking advantage of this quality of the model, we decided to generate more flexible and valuable outcomes by grouping the top predictions until achieving a cumulative confidence threshold higher than 99%. By allowing the grouping of predicted mechanisms (Fig. 3c), model categorical accuracy increased to 99.96% (a total of only 38 mistakes in the 100,000 sample test set), with 69,740 samples of the test set predicted as unique mechanisms, 23,767 with two proposed mechanisms, 6,067 with three and a residual 0.43% with more than three (for further analysis see Supplementary Information). Remarkably the model tends to group mechanisms within the same category, with very few crossings between categories (Fig. 3d). This result suggests that most of the original 7.4% inaccuracy obtained with single mechanistic classifications was due to overlaps between mechanisms that should, indeed, be proposed together.\n\nFig. 3: Performance of the machine learning model on the test set with six time points per kinetic profile. a, Top predicted mechanism versus actual mechanism (in percentage). b, Predicted probabilities for the 5,000 true test kinetic samples of each mechanism (200 sample moving average), ordered from highest to lowest probability for the corresponding mechanism. For clarity, only curves containing at least one predicted value above 0.1 are shown. c, Number of mechanisms predicted together by the model with 99% confidence threshold. d, Circos plot showing mechanisms grouped in the model’s predictions with 99% confidence threshold. The thickness of each ribbon linking two mechanisms is proportional to the number of times these mechanisms are grouped. Full size image\n\nTo fully explore the potential of our machine learning model, we investigated the effect of introducing error in the data and changing the number of data points provided. Temporal concentration profiles with Gaussian s.d. up to 2% (plus or minus 4% on yield with 95% confidence interval) in concentration (Fig. 4a) are commonly found experimentally37. Extraction of information from profiles with so much error is one of the biggest challenges in kinetic analyses38,39,40 and therefore is an excellent test for our model. We introduced various levels of Gaussian error (up to 5% s.d.) on the concentration variable of the original test set. Remarkably, when the resulting test sets were evaluated, the model was able to maintain very high categorical accuracy (over 99.6%) even with appreciable standard error (s.e., up to 2%) in the data (Fig. 4b, top left). Even for poor-quality data (that is, s.e. = 5% or an error of plus or minus 10% in yield with 95% confidence interval), a categorical accuracy of 83% was achieved. The model copes with the inherent uncertainty introduced by the error in the data by increasing the number of mechanisms grouped in its predictions (Fig. 4b, top right). Circos plots of the mechanisms grouped for test sample data containing 1% and 5% s.d. (Supplementary Figs. 8 and 9) show that whereas grouping is maintained within the same mechanistic category for the dataset with s.e. = 1%, crossings between categories of mechanisms appear with s.e. = 5%. The latter is not unexpected because the distortion of kinetic profiles is very large and therefore the resulting sample data could truly belong to mechanisms from different categories. The model responds similarly to the presence of outliers (Supplementary Information) but these results are less relevant because, experimentally, one would normally exclude obvious outliers from analysis using any kinetic analytical techniques.\n\nFig. 4: Effect of error and amount of data points in the performance of the machine learning model. a, Example of kinetic data for different levels of Gaussian error, with shading representing confidence interval 95%. b, Accuracy (left) and grouping of mechanisms (right) at different s.d. in concentration–time points (top) and number of points per kinetic sample (bottom). Full size image\n\nA common strategy used to mitigate the inaccuracy derived from error in the data is to increase the amount of data. We explored the effect of varying the number of concentration–time points provided to the model for its predictions using a dataset with 1% s.e. (Fig. 4b, bottom left). High categorical accuracy was obtained across the board for test sets containing between two and 20 concentration–time points. The model is able to use the additional time point information to increase the proportion of predictions in which a single mechanism is correctly proposed (Fig. 4b, bottom right). Conversely, the number of grouped mechanisms increases when concentration–time points are decreased below six. Despite the model never having been trained with samples containing fewer than three concentration–time points, it still performs remarkably well with a test set containing only two data points per kinetic profile.\n\nTo exemplify the potential of AI models in analysis of experimental kinetic data, we applied it to a diverse range of catalytic reactions including ring-closing olefin metathesis41, cycloadditions42, alkene isomerizations43, C–H aminations44, photocatalysed hydroalcoxylations45 and carbonyl–olefin metathesis46,47 (Fig. 5). These case studies include examples in which the kinetic data contain only three reaction profiles at varying catalyst concentration (that is, without the same-excess experiment), as well as examples in which only substrate or product is monitored. In all cases the machine learning models have been able to identify the important characteristic mechanistic features of each system, matching those proposed by the authors through kinetic and additional mechanistic experiments. More remarkably, the models have also proposed mechanisms that could not be demonstrated by traditional kinetic analyses, such as specific catalyst deactivation pathways. In the case of the ring-closing olefin metathesis reported by Thiel et al.41 (Fig. 5a), the machine learning model is able not only to recognize the catalyst deactivation proposed by the authors but also to implicate the product on the deactivation pathway. The prediction of the model is in agreement with previous work carried out on stoichiometric Ru complexes and density functional theory calculations48,49, which indeed showed the possibility of the ethene product inducing catalyst decomposition. Similarly, in the [2 + 2] cycloaddition reaction reported by Joannou et al.42 (Fig. 5b), the machine learning model identifies deactivation of the catalyst with involvement of the substrate of the reaction. Although classic kinetic analysis had not allowed identification of this mechanistic feature because of its subtle effect on kinetic data42, the authors had observed in stoichiometric organometallic studies a substrate-mediated dehydrogenative deactivation of the catalyst. Another deactivation process not immediately obvious was shown by the machine learning model in the alkene isomerization reported by Knapp et al.43 (Fig. 5c). The AI models also identify highly specific catalyst activation processes, as in the case of the C–H amination reported by Stroek et al.44 (Fig. 5d) and the hydroalcoxylation by Lehnherr et al.45 (Fig. 5e). In the case of the carbonyl–olefin metathesis reported by Ludwig et al.46 and Albright et al.47 (Extended Data Fig. 1 and Fig. 5f), the model proposes the largest number of mechanistic possibilities among the seven case studies, which suggests that extra experiments would be desirable to increase accuracy in this case. This especially challenging case shows the potential for AI-guided design of new kinetic experiments and refinement of mechanistic proposals.\n\nFig. 5: Case studies with experimental kinetic data. Each row includes the reaction under study, the experimental kinetic data used as input for the AI model and output. Filled symbols, substrate concentration; hollow symbols, product concentration; red triangles, lowest catalyst loading; yellow squares, medium catalyst loading; blue circles, largest catalyst loading; turquoise diamonds, lower concentration of substrate. a, A ring-closing metathesis with proposed catalyst deactivation by product.b, A [2+2]-cycloaddition reaction with proposed catalyst deactivation by substrate.c, An alkene isomerization with proposed catalyst deactivation by an inhibitor.d, A C–H amination with proposed catalyst activation by substrate.e, An alkyne hydroalkoxylation with proposed catalyst activation by ligand dissociation.f, A carbonyl-olefin metathesis with either catalyst deactivation or bicatalytic steps. Data from ref. 41 (a), ref. 42 (b), ref. 43 (c), ref. 44 (d), ref. 45 (e), ref. 47 (f). Full size image\n\nIn conclusion, we have demonstrated that deep learning can be leveraged to provide an extremely powerful tool for mechanistic elucidation from kinetic data. The new model simplifies the previous lengthy process of rate law derivation and kinetic analysis into an integrated and more accurate process that requires merely milliseconds. The trained model is able to resolve complex problems for which analysis was previously very challenging, such as kinetic data with error and even systems out of steady state. We have also shown how these AI models can be readily applied to extract mechanistic insights using experimental kinetic data from a variety of catalytic reactions. We envision that machine learning will become a powerful tool, enhancing the ability of synthetic chemists to tackle mechanistic investigations."}, {"url": "https://www.nature.com/articles/s41597-020-00588-x", "page_content": "Accurate determination of reaction energies is a central step in exploring organic chemistry mechanisms. The majority of chemical reactions consist of multiple elementary steps involving reactive intermediates. Short-lived reactive intermediates are difficult to isolate and analyze experimentally, resulting in increased dependence on accurate mechanistic insight gained from computational techniques1. Calculating reaction energies with quantum chemistry techniques, such as density functional theory (DFT), is therefore a central effort of computational organic chemistry. However, the combinatorial complexity of potential reaction pathways requires significant experience on the part of the computational chemist to determine which pathways are most likely to be feasible, and considerable computational resources to ensure enough pathways are explored that nonintuitive reactive intermediates and products are not missed. Enthalpies of radicals in particular, as important intermediates in combustion2,3, atmospheric4, redox5, (bio)-polymer chemistry6,7, and the functionalization of medicinally-relevant aromatic compounds8, are frequently calculated to determine the thermodynamics and kinetics of reaction pathways. Fast and accurate predictions for the enthalpy changes of radical reactions will substantially improve the throughput of computational chemistry research and allow detailed calculations to be targeted towards pathways that have the highest likelihood of being experimentally relevant.\n\nThe accuracy of Machine Learning (ML) models in predicting the results of quantum mechanical calculations has increased substantially in recent years as techniques for connecting molecular structures to deep neural networks have improved9,10,11. These approaches, known as graph neural networks (GNNs)12, replace the traditional featurization of molecules using fingerprints or descriptors with a framework in which molecular representations are learned from the underlying data13. These frameworks therefore continue to increase in accuracy as more data is collected far beyond traditional machine learning approaches. ML approaches to quickly and accurately predict enthalpy14, ground state energy15, bond dissociation energy16, and even transition-state activation energies17 have been developed by leveraging increasingly large databases of DFT calculations. The public distribution of large quantum chemistry databases, such as ioChem-BD18, is an important part of advancing the field of machine learning research in computational chemistry, as prior publications of equilibrium19, off-equilibrium20, and transition-state structures21 have found applicability beyond their original purpose. Datasets such as QM722, QM919, ANI-1x23, and ANI-1ccx24 consist of closed-shell organic molecules and so a dataset containing reactive intermediates, such as radical species, is required for the further development of machine learning models.\n\nIn this data descriptor, we report a quantum chemistry dataset focused on determining the enthalpies of radical reactions for small organic molecules. The database contains over 200,000 organic radical species and more than 40,000 associated closed-shell molecules, which were generated by breaking single, non-cyclic bonds in molecules taken from the PubChem Compound database25. Carbon, nitrogen and oxygen centered radicals are represented. Geometry optimizations and enthalpy calculations were performed at the M06-2X/def2-TZVP level of theory26, which was previously found to have a favorable trade-off between experimental accuracy and computational efficiency. For calculating the bond dissociation enthalpies specifically, results from this DFT methodology were benchmarked against experimental bond dissociation energies and calculations at higher levels of theory16. The calculation pipeline showed similar performance to CCSD(T), and is able to capture changes in enthalpy relative to experiment with an accuracy of approximately 2 kcal mol−1.\n\nThe resulting database consists of optimized 3D geometries, vibrational frequencies, IR intensities, Mulliken atomic charges, spin densities, enthalpies and free energies for each molecule, calculated using Gaussian 1627. While this data was developed primarily for calculating bond strengths of organic molecules28, we expect this comprehensive database of radical and closed-shell calculations to be useful for a wide range of applications in chemistry."}, {"url": "https://www.york.ac.uk/chemistry/staff/academic/emeritus/jholman/", "page_content": "Professor Sir John Holman\n\njohn.holman@york.ac.uk\n\nScience Education\n\nPresident, Royal Society of Chemistry, 2016-18. President, Association for Science Education, 2019 - present. Senior Adviser in Education at the Gatsby Foundation, 2010 – present. Adviser to Wolfson Foundation, 2018 - present. Independent Strategic Adviser on Careers to Secretary of State for Education, 2021 - present. Chair, UKRI Talent Commission, 2020 – present. Chair, the Bridge Group 2018 - present.\n\nFounding Director of the National Science Learning Centre from 2004 until September 2010, and adviser to the English government as National Science, Technology, Engineering and Mathematics (STEM) Director from 2006 until September 2010.\n\nHas taught learners of chemistry and science at all levels from 11 year olds to undergraduates. Has created curricula and written books for science learners of most ages in the UK and overseas, up to undergraduate, and was the founding director of the Salters Advanced Chemistry programme.\n\nAfter studying Natural Sciences at Cambridge, taught in a range of secondary schools and in 1994 became principal of Watford Grammar School for Boys, an all-ability, multi-ethnic state school. From 2000 to 2004, Salters’ Professor of Chemical Education at the University of York; appointed Chairman of the Salters’ Institute Board in 2013. Trustee of the Natural History Museum 2011 - 2019.\n\nNamed by the Science Council in 2014 as one of the 100 leading practising and inspirational UK scientists. Winner in 2014 of the Royal Society of Chemistry’s Lord Lewis Award and the Royal Society’s Kavli Education Award. Honorary graduate of University of York, 2016 and of Sheffield Hallam University, 2008. Knighted in 2010 for services to education.\n\nJohn Holman's Wikipedia page\n\nSelected current interests\n\nWith the Gatsby Foundation:\n\nWith the Education Endowment Foundation\n\nWith the Bridge Group\n\nSocial mobility and equity"}, {"url": "https://pubs.rsc.org/en/content/articlelanding/2021/cp/d1cp03875c", "page_content": "The mechanism of organic radical oxidation catalysed by gold nanoparticles\n\nV. Shcherbakov, S. A. Denisov and M. Mostafavi, Phys. Chem. Chem. Phys., 2021, 23, 26494 DOI: 10.1039/D1CP03875C\n\nTo request permission to reproduce material from this article, please go to the Copyright Clearance Center request page.\n\nIf you are an author contributing to an RSC publication, you do not need to request permission provided correct acknowledgement is given.\n\nIf you are the author of this article, you do not need to request permission to reproduce figures and diagrams provided correct acknowledgement is given. If you want to reproduce the whole article in a third-party publication (excluding your thesis/dissertation for which permission is not required) please go to the Copyright Clearance Center request page.\n\nRead more about how to correctly acknowledge RSC content."}, {"url": "https://www.organicdivision.org/organicreactions/", "page_content": "Organic Reactions® provides a compilation of an authoritative summary of a preparatively useful organic reaction from the primary literature. Practitioners interested in executing such a reaction (or simply learning about the features, advantages, and limitations of this process) thus have a valuable resource to guide their experimentation. Abstracting services, such Chemical Abstracts and Beilstein, allow for the practitioner to locate all of the literature on the subject, but without providing insight into the value of any particular reference.\n\nOrganic Reactions® chapters constitute a distillation of this avalanche of information into the knowledge needed to correctly implement a reaction and are much more than a surfeit of primary references. This capacity, namely to provide focused, scholarly, and comprehensive overviews of a given transformation, that Organic Reactions takes on even greater significance for the practice of chemical experimentation in the 21st century. The suitability of a given reaction for an unknown application is best judged from the informed vantage point provided by precedent and guidelines offered by a knowledgeable author as provide in Organic Reactions.\n\nSummaries of chapters published in may be found at: http://www.organicreactions.org.\n\nA video describing Organic Reactions® developed by the publisher John Wiley is available."}, {"url": "https://www.york.ac.uk/chemistry/news/deptnews/sir-john-holman/", "page_content": "Professor Sir John Holman gives final lecture\n\nPosted on 29 November 2017\n\nAfter many years of inspiring our undergraduates in Physical Chemistry, Professor Sir John Holman gave his final lecture to our second year students.\n\nHe has taught for some 50 years across a wide range of age groups in both schools and universities. His final lecture was an ideal opportunity for our students and staff to thank John for his many contributions to the department.\n\nTo celebrate his achievements, including his passion for using contextual demonstrations in lectures, our talented technical colleagues, Abby Mortimer, Tim Ayers and Mark Roper, made John a stunning model of a train. This idea was suggested by our students as a tribute to one of his memorable demonstrations.\n\nMany of John's other demonstrations, including those involving liquid nitrogen, ice cream, jelly babies, balloons and fountains, will be remembered by staff and hundreds of our former undergraduates, as will John’s passion and enthusiasm for teaching chemistry."}, {"url": "https://link.springer.com/chapter/10.1007/0-306-46856-5_4", "page_content": "To conclude this chapter, it is important to emphasize a logical point about the determination of reaction mechanisms. A proposed mechanism can never really be proven; rather, it is a case of alternative mechanisms being eliminated. Having in mind a mechanism that explains all the facts does not constitute proof that the mechanism is correct. That conclusion is possible only when all alternatives have been excluded. A key stage in a mechanistic investigation then is the enumeration of the various possible mechanisms and the design of experiments that distinguish between them. The principal basis for enumerating mechanistic possibilities is accumulated chemical experience with related systems and the inherent structural features of the system. A chemist approaching a mechanistic study must cast as broad as possible vision on the problem so as not to exclude possibilities.\n\nKeywords\n\nTransition State\n\nIsotope Effect\n\nSubstituent Effect\n\nIsodesmic Reaction\n\nSubstituent Constant\n\nThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, {"url": "https://www.york.ac.uk/chemistry/news/deptnews/holmanrsc20/", "page_content": "York chemist in Science Council top 100 list\n\nPosted on 27 January 2014\n\nProfessor Sir John Holman has been named in a list of 100 practising scientists\n\nChallenging the UK's narrow and old-fashioned view, the Science Council's list is being used to highlight a collective blind spot in the approach of government, media and the public to science - which either tends to refer to dead scientists or to regard only academics and researchers as scientists.\n\nChief executive of the Science Council, Diana Garnham, said: \"It is vital that this narrow vision is challenged urgently because it is inhibiting education policy, the career ambitions of young people and investment in developing the skills we need to deliver a world class economy.\"\n\nThe Royal Society of Chemistry's chief executive, Dr Robert Parker, said: \"This list does a fantastic job of showing that not all chemists wear white coats and that a career in chemistry doesn't mean you have to work in the laboratory.\n\nTo identify its list, the Science Council organised a competition to identify leading individuals in different categories of '10 types of scientist.' Each type draws on a different mix of skills, knowledge and expertise. Amongst the categories are Explorer, Investigator, Entrepreneur and Communicator. Professor Holman is one of two chemist's named in the Teacher category."}, {"url": "https://pubs.rsc.org/en/content/articlelanding/2020/ta/d0ta05485b#!", "page_content": "Visible-light-driven photocatalytic selective organic oxidation reactions\n\nX. Yang, S. Zhang, P. Li, S. Gao and R. Cao, J. Mater. Chem. A, 2020, 8, 20897 DOI: 10.1039/D0TA05485B\n\nTo request permission to reproduce material from this article, please go to the Copyright Clearance Center request page.\n\nIf you are an author contributing to an RSC publication, you do not need to request permission provided correct acknowledgement is given.\n\nIf you are the author of this article, you do not need to request permission to reproduce figures and diagrams provided correct acknowledgement is given. If you want to reproduce the whole article in a third-party publication (excluding your thesis/dissertation for which permission is not required) please go to the Copyright Clearance Center request page.\n\nRead more about how to correctly acknowledge RSC content."}]}