{"Paul Y. R. Waddington taught at the University of Toronto from 1971 to 1975, and at the University of Victoria since 1975.": [{"url": "https://iris.ucl.ac.uk/iris/browse/profile?upi=WADDI73", "page_content": "Research Summary\n\n💊💉🩸🧬🦠🧫🧪🔬⚗️🩻\n\nI am Professor of Gene Therapy at UCL. I lead a team developing translational gene therapy for childhood inherited genetic diseases including neurodegenerative diseases, inherited epilepsy and metabolic diseases. I chair the Cell and Gene Therapy Therapeutic Innovation Network of the UCL Translational Research Office.\n\nWith Manju Kurian, Paul Gissen and Ahad Rahim, I have co-founded a company, “Bloomsbury Genetic Therapies”. This has received £5 million of seed funding from Albion VC/UCL Tech Fund. The company will progress four gene therapy programmes to the clinic. They are gene therapy for Ornithine Transcarbamylase Deficiency, Infantile Neuronaxonal Dystrophy, Niemann Pick C and Dopamine Transporter Deficiency Syndrome. The company is now in the process of raising Series A funding.\n\nMy team and I have been funded by the UK Medical Research Council Developmental Pathway Funding Scheme and LifeArc for translational projects to treat Dravet Syndrome and Dopamine Transporter Deficiency Syndrome. We have licensed one of our projects to a gene therapy company with whom we have a £1.5 million sponsored research agreement in place. Collaborating with Prof Tristan McKay (Manchester Metropolitan University) I obtained a European Research Council starter grant of €1.5 million from the European Research Council to develop the means to quantify signalling pathways in diseased organs and tumours continually and non-invasively. Working alongside the teams of Professors Andy Baker (University of Edinburgh) and John McVey (University of Surrey) we elucidated one of the fundamental mechanisms by which adenovirus vectors transduce cells. I have several long-standing international collaborations. These include Drs Jerry Chan, Duke-NUS Graduate Medical School Singapore and Prof Patrick Arbuthnot, at the University of Witwatersrand, South Africa, where I hold an honorary chair.\n\nMy team and I have published more than one hundred and sixty peer reviewed publications in journals including Nature, Cell, Nature Medicine, Science Translational Medicine, Nature Immunology, Nature Communications, Cell Metabolism and Blood.\n\n💊💉🩸🧬🦠🧫🧪🔬⚗️🩻"}, {"url": "https://wiki2.org/en/Paul_Y._R._Waddington", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nSous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.[1]\n\nEarly life\n\nPaul Yvan Robert Waddington was born in Lyon, France, on 28 October 1893.[1]\n\nWorld War I military service\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.[1]\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N.12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917.[1] He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917.[2] A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa.154 (which operated Spads), on 6 March 1918.[1] Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine.[2] On 19 September 1918, he was transferred to his final wartime post, with Escadrille SPA.31.[1] He scored his final triumph solo ten days later.[2] On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.[1]\n\nPostwar career\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II.[3]\n\nReferences\n\nOver the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914–1918 Norman L. R. Franks, Frank W. Bailey. Grub Street, 1992. ISBN 0-948817-54-2, ISBN 978-0-948817-54-0.\n\nEndnotes\n\na b c d e f g Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914–1918 . p. 220. a b c The Aerodrome [1] Retrieved on 23 July 2010. ^ Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914–1918 . p. 221."}, {"url": "https://www.timeshighereducation.com/world-university-rankings/university-toronto", "page_content": "The University of Toronto (UofT) is among the world’s most prestigious universities. Founded in 1827, it offers over 700 undergraduate degree and 200 postgraduate degree programmes to a cohort of almost 60,000 students.\n\nWith a longstanding reputation for innovation and research, the University of Toronto was the birthplace of such ground-breaking scientific moments as the discovery of insulin and stem cell research, and the invention of the electron microscope.\n\nThe university also cites teaching as a strength in disciplines spanning medicine, business, engineering, humanities, education, and more.\n\nWith a reputation for producing leaders, it counts five Canadian prime ministers among its former students and associations with 10 Nobel laureates. Other notable alumni include the actor Donald Sutherland and the writers Margaret Atwood and Michael Ondaatje.\n\nIt is a multi-campus university, with its St George campus in downtown Toronto likened to Oxford and Cambridge on account of its mix of green space and historical architecture.\n\nThe university’s Mississauga campus, on the banks of the Credit River to the west of the city, includes 225 acres of protected green belt, while its Scarborough campus is home to a new aquatics centre.\n\nThe university attracts many sports fans and boasts a fearsome reputation in both football and ice-hockey. Other campus attractions include more than 1,000 student organisations in addition to a recreational centre and student facilities that include an art gallery, theatre and concert hall.\n\nToronto itself is one of the most dynamic, vibrant cities in the world, one which places a high priority on arts and culture, and diversity and tolerance.\n\nThe city is also major international centre for business and finance, and is the third largest hub for film and television production after Los Angeles and New York.\n\nWith international students enrolled from around 160 countries, the university prides itself on being as cosmopolitan and multicultural as the city it inhabits.\n\nLaying claim to a global mindset, the university actively partners with other leading higher education institutions and industry partners around the world to provide international opportunities to its students and faculty."}, {"url": "https://www.britannica.com/biography/C-H-Waddington", "page_content": "C.H. Waddington, in full Conrad Hal Waddington, (born Nov. 8, 1905, Evesham, Worcestershire, Eng.—died Sept. 26, 1975, Edinburgh, Scot.), British embryologist, geneticist, and philosopher of science.\n\nWaddington graduated in geology from the University of Cambridge (1926), and it was only after studying paleontology that he turned to biology. Before World War II he taught zoology and embryology at Strangeways Research Laboratory, Cambridge. From 1947 until his death he was professor of animal genetics at the University of Edinburgh.\n\nBritannica Quiz Genetics Quiz\n\nWaddington performed his first notable work in biology on the development of the embryos of birds and mammals. He showed in 1933 that chemical messengers from certain tissues induce other tissues to develop. These studies of embryonic development led him to investigate the regulatory effects of genes on tissue and organ development. Waddington then attempted, in Organisers and Genes (1940), to relate Mendelian genetics to the new findings of experimental embryology.\n\nDuring World War II, Waddington engaged in operations research for the military. After the war he established for the British Agricultural Research Council the Unit of Animal Genetics, a research organization that studied the genetics and scientific breeding of livestock. He afterward served as chief geneticist for this endeavour.\n\nWaddington published many books on embryology, genetics, and the philosophy of science; his Principles of Embryology (1956) is considered a standard textbook, while The Ethical Animal (1960) and Biology for the Modern World (1962) are leading works of popularized science."}, {"url": "https://www.cardiff.ac.uk/people/view/39516-waddington-rachel", "page_content": "Overview Rachel Waddington is a Professor in Oral Biochemistry. With more than 30 years' experience, my research has had a long-standing focus for understanding the role of the extracellular matrix environment in the regulation the biology of bone and dentine repair; research that aims to be translational for provoking clinical benefit. Matrix components and extracellular vesicles produced by mesenchymal stem / progenitor cells contain and regulate the release of a rich cocktail of growth factors, that are collectively important in directing effective and efficient cell signalling during cell differentiation. Recently my research has investigated: how the extracellular matrix environment is altered during systemic conditions such as chronic type 2 diabetes mellitus, leading to inefficient cell signalling that compromises the healing process and exacerbates periodontal tissue destruction;\n\nhow the extracellular matrix environment is altered by blue light therapies and the role of reactive oxygen species in this process.\n\ninvestigating tissue and cell derived matrix products and extracellular vesicles for restoring the signalling environment and potentially reverse delayed bone healing often encountered with these systemic conditions;\n\nthe influence of modifying titanium implant surfaces on cellular activity that is beneficial for promoting bone healing and hence allows for quicker and more efficient integration of medical implants.\n\nResearch The clinical management of bone fractures and implant placement, including revision / replacement is orientated towards obtaining bone healing in the shortest time frame, with the best possible functional recovery, and with the least complications arising; features that remain a challenge for patients with osteoporosis or chronic diabetes. Against this clinical challenge my research has developed a focussed interest towards understanding and exploiting the role of extracellular matrix in directing bone and dentine repair. Below is a summary of current research projects. Alterations to extracellular matrix proteins associated with type 2 diabetes mellitus Within these systemic conditions, the biological activity of mesenchymal stem cells is reported to be impaired leading to delayed bone healing. Within this field of research we have been investigating how a hyperglycaemic environment can lead to changes in the levels of extracellular proteins decorin, biglycan, transforming growth factor ß and osteopontin - all of which have the potential to hinder the synthesis of a fully mineralised tissue. Additional studies have investigated how bacterial virulence factors can exacerbate these changes with detrimental consequence for progression of periodontal disease and osteomyelitis in these patients. Cell and tissue derived matrix-based therapies for restoring signalling environment associated with delayed bone healing The extracellular matrix is a rich source of growth factors, integrated into the extracellular matrix that regulates their activity. Our research has investigated the potential of demineralized dentine matrix as a store of growth factors capable of promoting bone repair processes. In addition, our research is currently investigating the potential of extracellular vesicles, secreted from dentally derived mesenchymal stem cells, and their role as carriers of a biologically active cargo capable of enhancing the differentiation of bone marrow stromal cells into bone synthesizing osteoblasts. Influence of modified titanium surfaces on bone repair processes Through detailed studies involving a series of standardised cell- and tissue-based assays, we have investigated how defined and subtle surface modifications to titanium implant biomaterials can influence osteoblast differentiation. These studies additionally study cellular activity supporting angiogenesis and appropriate macrophage function, both of which are recognised as pre-requisites for successful bone healing.\n\nTeaching Fellow of Advanced HE since 2001; Awarded Senior fellowship of Advanced HE, 2021.\n\nCurrent Year 1 and year 2 non-clinical lead for BDS course Cardiff University.\n\nUndergraduate and postgraduate teaching - bone and dentine biology, tooth development and structure, periodontal connective tissues in health and disease, osseointegration, fluoride and mineralised tissues and caries development.\n\nProgramme director for MSc Oral Biology, School of Dentistry, Cardiff University.\n\nEducational experience in academic course management; course development and validation; preparation of assessment criteria and content for both formative and summative assessments.\n\nExternal examiner for higher degrees PhD theses. External examiner for MSc Oral Biology, Queen Mary University of London.\n\nPast and present external examiner for Basic Biomedical Science modules on Undergraduate BDS courses at University of Liverpool, UK, University of Newcastle upon Tyne, UK, Queen's University Belfast, UK, University of Bristol, UK, University of Malaya, Malaysia; University of Sharjah, United Arab Emirates.\n\nExtensive mentoring experience for early stage researchers and academics, both within Cardiff University and other Welsh academic institutions.\n\nProactive for development and training activities for academic staff career progression, including career development for early career postdoctoral researchers.\n\nBiography Rachel Waddington is a non-clinical Professor in Oral Biochemistry and is the current President of the British Society for Dental Research. As a non-clinical professor she has worked in academia since her appointment as lecturer in the School of Dentistry in 1989. Her research interests centre on the cell and matrix biology of bone and dentine repair, and applying this research to improved diagnosis, management and treatment in clinical dentistry and orthopaedic medicine. She has published 100+ peer-reviewed publications (h-index 33 (Scopus); 34 (Google Scholar), 2022), edited 1 academic book, over 200 conference abstracts. During her career she has successfully received grant funding from UK research councils, Wellcome Trust, Welsh government, EU, charity and industrial sources. Over the past 10 years Rachel has been involved in driving the School’s Athena SWAN action plan with a collective aim to support all academics thrive in a competitive academic environment and in 2020 she led the School’s submission to a successful award. In her current role as Associate Director for Staff and Student Matters she is facilitating the implementation of these actions, with strong focus on staff development and wellbeing. Honours and awards During her career Rachel has been awarded the Senior Colgate prize (1990) and the MINTIG Mineralised Tissue Research travel prize (1996), both awarded by the British Society for Dental and Oral Research. In 1993 she received a Royal Society Overseas Study award to undertake a research sabbatical at the University of Toronto, Canada."}, {"url": "https://www.bradford.ac.uk/library/special-collections/collections/waddington-feather-collection/", "page_content": "Waddington-Feather Collection\n\nArchive reference: WAD\n\nJohn Waddington-Feather\n\nThe Rev. John Waddington-Feather was an Anglican priest, educationalist and writer, born in Keighley, West Yorkshire in 1933. He read English and Medieval Literature at Leeds University, graduating in 1954. His published works included novels, poetry, drama and academic papers. He taught in several schools and at the University of Khartoum; his ministry was mainly been in prisons. John died on 28 April 2017. Find out more about John's fascinating life and works in our obituary: Remembering JWF.\n\nThe Book Collection\n\nThe Waddington-Feather book collection includes an extensive collection of John's own writings. You can find out more about his books for children and adults via this article in our 100 Objects exhibition: Quill the Hedgehog and the Keighley Detectives.\n\nOther books include poems, plays and tales in dialect by authors such as Dorothy Una Ratcliffe, Frederic Moorman and John Hartley, plus scholarly and popular works about the Yorkshire dialects. Individual dialects covered include Sheffield, Halifax and the East Riding. The Collection also contains works on other dialects (Lancashire, Devon) and more general works about the history and development of the English language.\n\nThe Archive\n\nThe Archive consists mainly of works by John Waddington-Feather, including his poetry from 1950 onwards, his notes on Yorkshire dialects, journal articles and short sermons. It also includes material relating to writers published by his imprint, Feather Books, notably Susan, Caroline and Sir Anthony Glyn, and Walter Nash.\n\nFurther information about the Archive is available as a collection-level entry on the Library catalogue. Please note that the collection is not fully catalogued, so access is limited at present."}, {"url": "https://www.lse.ac.uk/social-policy/research/Research-clusters/Mannheim/News/Professor-Waddington", "page_content": "Peter ('Tank') Waddington\n\nPeter ('Tank') Waddington had been seriously ill for some time before dying in hospital on the 21st of March from a heart attack from which he never recovered. Tank joined the City of Birmingham Police as a cadet in 1963 and left as a constable six years later. He was to be awarded an external University of London degree in 1969 and an MA in 1970 and doctorate in 1977 from the University of Leeds. He became a Professor of Sociology and then of Politics at the University of Reading before moving to Wolverhampton University in 2005. On retirement he became a Visiting Professor at the Mannheim Centre.\n\nTank was a man with a passion for understanding and remodelling policing in England and overseas (he was, for example, a member of the International Panel testifying before the Goldstone Commission in South Africa). His distinguishing traits always were a commitment to scholarship and a freedom from cant and orthodoxy, exercising an often brave and remarkable critical intelligence. His 'Mugging as a \"Moral Panic\": A Question of Proportion', published in the British Journal of Sociology in 1986, forever punctured some of the claims made in Policing the Crisis. His \"In proportion: race, and police stop and search\" (with Kevin Stenson, and David Don), published in the British Journal of Criminology 2004, forced a reappraisal of some of the lazier arguments that were then in vogue about the police practice of stop and search. His best studies were probably Liberty and Order: Policing Public Order in a Capital City, published in 1994, and Calling the Police, published in 1993. Both were utterly original and revelatory analyses of police work. Towards the end of his life he concentrated on deploying innovatory methods to explore a number of the more intractable contradictions of police work, most notably in Professional Police Practice: Scenarios and Dilemmas, published in 2013.\n\n\n\nAlthough he was always stalwart in promoting and defending an argument, Tank was a modest and amiable man, more prepared to bestow praise on his colleagues and collaborators than to accept it himself. He was a model of kindness and courtliness, a loving husband and a good friend, and I shall miss him greatly.\n\n\n\nPaul Rock\n\nEmeritus Professor of Social Institutions, Department of Sociology, LSE"}, {"url": "https://www.encyclopedia.com/arts/culture-magazines/waddington-miriam-0", "page_content": "WADDINGTON, Miriam\n\nNationality: Canadian. Born: Miriam Dworkin, Winnipeg, Manitoba, 23 December 1917. Education: Machray School, Winnipeg; Lisgar Institute, Ottawa; University of Toronto, B.A. 1939, diploma in social work 1942, M.A. 1968; University of Pennsylvania, Philadelphia, M.S.W. 1945. Family: Married Patrick Donald Waddington in 1939 (divorced 1965); two sons. Career: Caseworker, Jewish Family Service, Toronto, 1942–44, 1957–60, and Philadelphia Child Guidance Clinic, 1944–45; assistant director, Jewish Child Welfare Bureau, Montreal, 1945–46; lecturer and supervisor, McGill School of Social Work, Montreal, 1946–49; caseworker, Montreal Children's Hospital Speech Clinic, 1950–52, and John Howard Society, 1955–57; staff member, Montreal Children's Hospital, 1952–54; supervisor, North York Family Service, 1960–62. Member of the English Department, 1964–73, professor of literature, 1973–83, and since 1983 emeritus professor, York University, Toronto. Writer-inresidence, University of Ottawa, 1974, Windsor Public Library, 1983, and Metropolitan Toronto Reference Library, 1986. Advisory editor, Journal of the Otto Rank Association, 1973–83; poetry editor, Poetry Toronto, 1981–82. Awards: Canada Council fellowship, 1962, 1968, 1971, 1979; J.I. Segal award, 1973, 1987. D.Litt.: Lakehead University, Thunder Bay, Ontario, 1975; York University, 1985. Address: Department of English, York University, Toronto, Ontario M3J 1P3, Canada.\n\nPublications\n\nPoetry\n\nGreen World. Montreal, First Statement Press, 1945.\n\nThe Second Silence. Toronto, Ryerson Press, 1955.\n\nThe Season's Lovers. Toronto, Ryerson Press, 1958.\n\nThe Glass Trumpet. Toronto, Oxford University Press, 1966.\n\nCall Them Canadians. Ottawa, Queen's Printers and National FilmBoard, 1968.\n\nSay Yes. Toronto, Oxford University Press, 1969.\n\nDream Telescope. London, Anvil Press Poetry, 1972.\n\nDriving Home: Poems New and Selected. Toronto, Oxford University Press, 1972; London, Anvil Press Poetry, 1973.\n\nThe Price of Gold. Toronto, Oxford University Press, 1976.\n\nMister Never. Winnipeg, Turnstone Press, 1978.\n\nThe Visitants. Toronto, Oxford University Press, 1981; New York, Oxford University Press, 1982.\n\nCollected Poems. Toronto, Oxford University Press, 1986.\n\nThe Last Landscape. Toronto and Oxford, Oxford University Press, 1992.\n\nCanada: Romancing the Land. Toronto, Key Porter Books, 1996.\n\nPlays\n\nRadio Documentaries: Chekov, 1958; Poe, 1962.\n\nShort Stories\n\nSummer at Lonely Beach: Selected Short Stories. Oakville, Ontario, Mosaic Press, 1982.\n\nOther\n\nA.M. Klein. Toronto, Copp Clark, 1970.\n\nThe Function of Folklore in the Poetry of A.M. Klein (lecture). St. John's, Newfoundland, Memorial University, 1983.\n\nApartment 7: Essays New and Selected. Toronto, Oxford University Press, 1989.\n\nCercando Fragole in Giugno E Altre Poesie (in Italian and English). Bologna, CLUEB, 1993.\n\nEditor, Essays, Poems, Controversies, by John Sutherland. Toronto, McClelland and Stewart, 1973.\n\nEditor, The Collected Poems of A.M. Klein. Toronto, McGraw Hill Ryerson, and New York, McGraw Hill, 1974.\n\nBibliography: By Laurie Ricou, in The Annotated Bibliography of Canada's Major Authors 6, edited by Robert Lecker and Jack David, Toronto, ECW Press, 1985.\n\nManuscript Collection: Public Archives of Canada, Ottawa.\n\nCritical Studies: \"The Lyric Craft of Miriam Waddington\" by Ian Sowton, in Dalhousie Review (Halifax, Nova Scotia), summer 1958; \"Into My Green World: The Poetry of Miriam Waddington\" by Laurence R. Ricou, in Essays on Canadian Writing (Toronto), fall 1978; Twelve Voices by Jon Pearce, Ottawa, Borealis Press, 1980; Miriam Waddington by Cathy Matyas, Toronto, Dundurn Press, 1982; Miriam Waddington and Her Work by Peter Stevens, Toronto, ECW Press, 1984; \"Miriam Waddington: An Afternoon\" by Marvyne Jenoff, in Waves (Richmond Hill, Ontario), 14(1–2), fall 1985; Transformation Poetics: Refiguring the Female Subject in the Early Poetry and Life Writing of Dorothy Livesay and Miriam Waddington (dissertation), York University, 1997.\n\nMiriam Waddington comments:\n\nAbout my poetry: the key to it is the language. My Canadian English takes its cue from the prairies where I was born and conceals more than it reveals. Some concealments: the social, mythic, and linguistic reverberations of the Yiddish and Russian cultures of my childhood, plus the austerity and Scottish accents of my early teachers.\n\n* * *\n\nIn the early 1940s there were few opportunities in Canada to publish a book of poetry. Miriam Waddington's first collection, Green World, was published by John Sutherland's First Statement Press in Montreal, where two active literary groups were about to launch the magazines First Statement and Preview. These writers wanted to see an end to the colonial attitudes that had dominated Canadian writing through the Canadian Authors Association publication Canadian Poetry Magazine.\n\nBetween the appearance of Green World in 1943 and Collected Poems in 1986, Waddington published ten books of poetry. Sharp observation, wit, and compassion have remained constant. A change to short lines in The Glass Trumpet was unconscious and connected with new ways of looking at the world, a matter of zeitgeist, the poet says. Using spaces instead of commas was deliberate and concerned the appearance of a poem on the page. She later began to like commas again, her wish for precise meaning taking precedence.\n\nEarly poems were about birth, mothering, and love, with a few poems about social issues. But with degrees in social work, Waddington became involved with the deprived and dispossessed, and she turned her poetry to subjects of social significance. She met and became fast friends with Dorothy Livesay, who had \"ignored maple leaves\" to write about the desperate condition of people caught in a social revolution. Waddington became a compassionate outsider who saw more and more human misery in her work. As time went on, she wrote more frequently about courts and prisons, and with the publication of The Season's Lovers she realized that she was not in the mainstream of Canadian literature because her poetry could not be called metaphysical and mythic. The Season's Lovers dealt with \"the realities of crippled lives, poverty, and the strange innocence of the weak and rejected.\"\n\nThe exploration of what it means to be Canadian has been a favorite theme of Waddington's. Driving Home: Poems New and Selected contains many poems examining her identity as a Canadian, including the following:\n\nCANADIANS\n\n\n\nHere are\n\nour signatures:\n\ngeese fish eskimo\n\nfaces girl-guide\n\ncookies ink-drawings\n\ntree-plantings summer\n\nstorms and winter\n\nemanations.\n\n\n\nWe look\n\nlike a geography\n\nbut just scratch us\n\nand we bleed like\n\nhistory are full\n\nof modest misery\n\nsensitive\n\nto double-talk\n\ndouble-take\n\n(and double-cross)\n\nin a country\n\ntoo wide\n\nto be single in.\n\n\n\nWaddington says in the afterword to Collected Poems that her attitude to poetry is the same as it was fifty years earlier when she wrote in the 1938 poem \"Unheard Melodies,\"\n\nI the tender and brooding outsider\n\nConcern myself with subtle melodies\n\nFashioning usual themes\n\nIn unknown obscure lives.\n\n\n\n—Patience Wheatley"}, {"url": "https://www.city.ac.uk/about/people/academics/nigel-waddington", "page_content": "Overview\n\nNigel is a former practising barrister, associate professor and designer of City’s Bar Vocational Studies Programme. He studied law at the University of Birmingham and practised at the chambers of John Cherry QC at 8 Stone Buildings, Lincoln’s Inn (now Lamb Chambers, Temple, where he is a door tenant). He appeared regularly in the criminal and civil courts, later practising predominantly in personal injury litigation.\n\n\n\nNigel is a faculty member at the Ceeli Institute in Prague where he provides ethics and anti-corruption training for judges in central and eastern Europe. In his work for the American Bar Association he has trained lawyers from Bosnia-Herzegovina, Serbia and Kosovo and has helped to develop internship programmes in Albania and Croatia under the ABA Rule of Law Initiative.\n\n\n\nNigel has been a consultant for the Chartered Institute of Patent Attorneys and to the Patent Examination Board in its development of professional qualifications for patent attorneys. As an IATC-accredited advocacy trainer he has worked as an external assessor for Norton Rose Fulbright LLP on its in-house advocacy program.\n\n\n\nHe is a visiting lecturer at Goldsmith's College, Morley College, and Fellow of the Higher Education Academy."}]}