{"Paul Y. R. Waddington is also a Fellow of the Royal Society of Canada.": [{"url": "https://royalsociety.org/news/2021/05/new-fellows-announcement-2021/", "page_content": "Over 60 outstanding scientists from all over the globe have joined the Royal Society as Fellows and Foreign Members. The distinguished group of scientists consists of 52 Fellows, 10 Foreign Members and one Honorary Fellow and were all selected for their exceptional contributions to science.\n\nTheir achievements and research are diverse and range from the detection of a new type of neuron in the human brain and the design and development of new vaccines for globally important infectious diseases to a new way of looking at Einstein’s theory of general relativity and contributing to understanding the link between the increase in sea levels and global warming. The new Fellows and Foreign Members originate from around the world and include one Nobel laureate as well as academics and world-renowned figures from industry.\n\nSir Adrian Smith, President of the Royal Society, said:\n\n“This is the first year of my presidency at the Royal Society and I’ve been very much looking forward to welcoming the newly elected Fellows and Foreign Members.\n\n“The global pandemic has demonstrated the continuing importance of scientific thinking and collaboration across borders. Each Fellow and Foreign Member bring their area of scientific expertise to the Royal Society and when combined, this expertise supports the use of science for the benefit of humanity.\n\n“Our new Fellows and Foreign Members are all at the forefronts of their fields from molecular genetics and cancer research to tropical open ecosystems and radar technology. It is an absolute pleasure and honour to have them join us.”\n\nAmong this year’s Fellows and Foreign Members:\n\nAdrian Hill is elected as Fellow for his world-leading work in the design and development of new vaccines for globally important infectious diseases. He founded and directs the Jenner Institute at Oxford University, one of the leading academic vaccine institutes globally.\n\nJane Francis joins as a Fellow for her significant contributions to our knowledge of the climate history of polar regions. Ian Boyd is a marine and polar scientist with a focus on the management of marine resources and human impacts on the marine environment. Karen Heywood was the first in her field to show the crucial roles that Antarctic slope currents play in heat transfer to ice shelves, in krill ecology and in bottom water formation. Paul Bates develops new numerical solutions to the Shallow Water equations and combines these with satellite and airborne data to advance our fundamental understanding of flood dynamics and reduce threats to life and economic losses worldwide.\n\nAbigail Sellen is elected as one of the most highly cited and influential scientists in the field of Human-Computer Interaction. Her career has spanned both academia and industrial research with many of the world's leading technology companies, and her seminal contributions laid foundations for technologies used today by billions of people including video conferencing and teleworking. Richard Samworth has been elected for his fundamental contributions to the development of modern statistical methodology and theory. David Silver has made major contributions to seminal projects including DQN, the world's first end-to-end reinforcement learning system, and AlphaGo, trained through self-play to become the first program to defeat a world champion Go player, a feat considered by many to be a decade ahead of its time. He was previously a Royal Society University Research Fellow.\n\nNobel Prize winner Stanley Whittingham has also been elected for his work on materials for energy-related applications, and in particular for electrochemical energy storage and his role in the development of Lithium-ion batteries. Nigel Brandon works on electrochemical devices for energy applications and is the inventor of of fuel cell technology now being commercialised by LG and Rolls-Royce.\n\nBernard Schutz is honoured for his work driving the field of gravitational wave searches, leading to their direct detection in 2015. Geoffrey Hall’s work on detector designs and exploitation of programmable digital electronics for real-time measurements will considerably extend the physics reach of the LHC.\n\nFor his lifelong contributions to the quantum theory of gravity, Stanley Deser becomes a Foreign Member of the Royal Society. He is joined by Giacomo Rizzolatti for his work including the discovery of mirror neurons in the human motor cortex. Biochemical Engineer, Sang Yup Lee and molecular cell biologist V. Narry Kim become the first Foreign Members elected from Korea.\n\nSadaf Farooqi is distinguished for her discoveries of fundamental mechanisms that control human energy homeostasis and their disruption in obesity and evolutionary biologist, Peter Campbell was an early adopter of genomic technologies to study the underlying mechanisms of cancer and his work has led the development of an entirely new approach to investigating cancer. Fiona Marshall is known for her discoveries in the field of G protein-coupled receptors (GPCRs). Her work has enabled structure-based drug design leading to a pipeline of drugs in clinical development for diseases including Alzheimer's disease and cancer.\n\nRebecca Kilner becomes a Fellow for her discoveries in how social behaviour drives evolutionary change. She was previously a Royal Society Dorothy Hodgkin Fellow and a Royal Society University Research Fellow. Usha Goswami becomes a Fellow for her fundamental contributions to understanding how individual differences in children's 'phonological awareness' (of word sound structure) underpin reading development and dyslexia across languages.\n\nFrank Close is elected a Fellow for his extraordinarily effective work in explaining profound concepts in physics at all levels of society including in parliament and to the general public. Andy Haldane’s research and policy career spans the intersection between academe, public policy and civil society, often using cross-disciplinary approaches to provide creative solutions to pressing public policy problems\n\nJohn Kingman becomes an Honorary Fellow for his unwavering support for science throughout his career. He has been an important and highly effective force for good for UK science and innovation for many years, through his career in the Treasury, his steering role in the creation of UK Research and Innovation and subsequent chairmanship.\n\nSome statistics about this year’s intake are as follows:\n\n20 of this year’s intake of Fellows (16) and Foreign Members (4) are women – this is 31.7% of the 2021 intake and an increase of 9.1% compared to 2020\n\nNew Fellows have been elected from institutions across the UK, (London, Cambridge, Bristol St Andrews, Oxford, Birmingham, East Anglia, Leeds), the Commonwealth (South Africa, Canada, Australia, Singapore) and around the world (the US, Switzerland, Germany)\n\nThe first two Foreign Members have been elected from South Korea\n\nOur new Fellows and Foreign Members join the ranks of Stephen Hawking, Isaac Newton, Charles Darwin, Albert Einstein, Lise Meitner, Subrahmanyan Chandrasekhar and Dorothy Hodgkin who all enriched the Society with their expertise.\n\nThe full list of the newly elected Fellows and Foreign Members of the Royal Society is, in alphabetical order:\n\nProfessor Julie Ahringer FMedSci FRS\n\nDirector, Wellcome Trust/Cancer Research UK Gurdon Institute, University of Cambridge\n\nProfessor Glen Barber FRS\n\nProfessor and Chairman, Department of Cell Biology, University of Miami Miller School of Medicine, United States\n\nProfessor Paul Bates CBE FRS\n\nProfessor of Hydrology, School of Geographical Sciences, University of Bristol\n\n\n\nProfessor Richard Benton FRS\n\nProfessor, Center for Integrative Genomics, University of Lausanne, Switzerland\n\n\n\nProfessor William Bond FRS\n\nEmeritus Professor, Department of Biological Sciences, University of Cape Town, South Africa\n\n\n\nProfessor Sir Ian Boyd FRS\n\nProfessor in Biology, School of Biology, University of St Andrews\n\n\n\nProfessor Nigel Brandon OBE FREng FRS\n\nChair, Sustainable Development in Energy and Dean, Faculty of Engineering, Imperial College London\n\n\n\nDr Peter Campbell FMedSci FRS\n\nHead, Cancer, Ageing, and Somatic Mutations Programme, Wellcome Sanger Institute\n\n\n\nProfessor Frank Close OBE FRS\n\nProfessor of Theoretical Physics Emeritus and Fellow Emeritus of Exeter College, University of Oxford\n\n\n\nProfessor David Craik FRS\n\nDirector, ARC Centre of Excellence for Innovations in Peptide and Protein Science, Group Leader, Chemistry and Structural Biology Division and Director, Clive and Vera Ramaciotti Facility for Producing Pharmaceuticals in Plants, Institute for Molecular Bioscience, University of Queensland, Australia\n\nProfessor Donald Dingwell OC FRS\n\nEarth and Environmental Sciences, LMU - University of Munich, Germany\n\nDr Connie Eaves FRS\n\nDistinguished Scientist, Terry Fox Laboratory, British Columbia Cancer Research Institute and University Professor, Departments of Medical Genetics, Medicine, Pathology & Laboratory Medicine, and the School of Biomedical Engineering, University of British Columbia, Canada\n\nProfessor Sadaf Farooqi FMedSci FRS\n\nProfessor of Metabolism and Medicine, Wellcome-MRC Institute of Metabolic Science, University of Cambridge\n\nProfessor Ten Feizi FMedSci FRS\n\nDirector, Glycosciences Laboratory, Department of Metabolism, Digestion and Reproduction, Faculty of Medicine, Imperial College London\n\n\n\nProfessor Michael Finnis FRS\n\nProfessor, Department of Materials and Department of Physics, Imperial College London\n\n\n\nProfessor Julie Forman-Kay FRS\n\nSenior Scientist and Program Head, Molecular Medicine, The Hospital for Sick Children (SickKids) and Professor, Department of Biochemistry, University of Toronto, Canada\n\nProfessor Dame Jane Francis DCMG FRS\n\nDirector, British Antarctic Survey\n\n\n\nProfessor Vernonica Franklin-Tong FRS\n\nProfessor in Plant Cell Biology, School of Biosciences, University of Birmingham\n\nProfessor Usha Goswami CBE FBA FRS\n\nProfessor of Cognitive Developmental Neuroscience, Department of Psychology, University of Cambridge\n\nProfessor Hugh Griffiths OBE FREng FRS\n\nRoyal Academy of Engineering / Thales Chair of RF Sensors, Department of Electronic and Electrical Engineering, University College London\n\n\n\nMr Andrew Haldane FRS\n\nChief Economist, Bank of England (until June 2021) and Chief Executive Officer, Royal Society for Arts, Manufactures and Commerce (September 2021 - onwards)\n\n\n\nProfessor Geoffrey Hall FRS\n\nProfessor of Physics, Blackett Laboratory, Imperial College London\n\n\n\nProfessor Karen Heywood FRS\n\nProfessor of Physical Oceanography, Centre for Ocean and Atmospheric Sciences, School of Environmental Sciences, University of East Anglia\n\n\n\nProfessor Adrian Hill FRS\n\nLakshmi Mittal and Family Professor of Vaccinology and Director, The Jenner Institute, Nuffield Department of Medicine, University of Oxford\n\n\n\nProfessor Richard Horne FRS\n\nHead, Space Weather and Atmosphere, British Antarctic Survey\n\n\n\nProfessor Gregory Houseman FRS\n\nEmeritus Professor of Geophysics, School of Earth and Environment, University of Leeds\n\n\n\nProfessor Rebecca Kilner FRS\n\nProfessor of Evolutionary Biology and Director, University Museum of Zoology, University of Cambridge\n\n\n\nProfessor Roger Lemon FRS\n\nSobell Chair of Neurophysiology, Queen Square Institute of Neurology, University College London\n\n\n\nDr Fiona Marshall FMedSci FRS\n\nSenior Vice President Head of Discovery Sciences and Translational Medicine, MSD\n\n\n\nProfessor Thomas Muir FRS\n\nVan Zandt Williams Jr. Class of '65 Professor of Chemistry, Princeton University, United States\n\n\n\nProfessor Frances Platt FMedSci FRS\n\nProfessor of Biochemistry and Pharmacology, Department of Pharmacology, University of Oxford\n\n\n\nProfessor Jeremy Quastel FRS\n\nProfessor, Department of Mathematics, University of Toronto, Canada\n\n\n\nProfessor Marilyn Renfree FRS\n\nMelbourne Laureate Professor and Ian Potter Chair of Zoology, School of BioSciences, University of Melbourne\n\n\n\nProfessor David Rowitch FMedSci FRS\n\nProfessor of Paediatrics and Head of Department, Department of Paediatrics, University of Cambridge and Adjunct Professor of Pediatrics, University of California, San Francisco, United States\n\n\n\nProfessor Richard Samworth FRS\n\nProfessor of Statistical Science and Director, Statistical Laboratory, University of Cambridge\n\n\n\nDr Sjors Scheres FRS\n\nGroup Leader, Structural Studies Division, MRC Laboratory of Molecular Biology\n\n\n\nProfessor Bernard Schutz FRS\n\nProfessor, School of Physics and Astronomy, and Fellow and founding Director, Data Innovation Research Institute, Cardiff University; and Director (retired), Max Planck Institute for Gravitational Physics (Albert Einstein Institute)\n\nProfessor Abigail Sellen FREng FRS\n\nDeputy Lab Director, Microsoft Research\n\n\n\nProfessor David Silver FRS\n\nPrincipal research scientist, DeepMind and Professor of Computer Science, Department of Computer Science, University College London\n\n\n\nProfessor Benjamin Simons FRS\n\nRoyal Society EP Abraham Professor, Gurdon Institute and Department of Applied Mathematics and Theoretical Physics, University of Cambridge\n\nProfessor Endre Süli FRS\n\nProfessor of Numerical Analysis, Mathematical Institute, University of Oxford\n\n\n\nProfessor Richard Sutton FRS\n\nProfessor, Department of Computing Science, University of Alberta, Canada and Distinguished Research Scientist, DeepMind\n\n\n\nProfessor Louis Taillefer FRS\n\nProfessor, Department of Physics and Institut quantique, Université de Sherbrooke, Canada\n\n\n\nDr Christopher Tate FRS\n\nMRC Investigator, MRC Laboratory of Molecular Biology\n\n\n\nProfessor Philip Torr FREng FRS\n\nProfessor, Department of Engineering Science, University of Oxford\n\n\n\nProfessor Thirumalai Venkatesan FRS\n\nDirector, Center for Quantum Research and Technology and Professor of Physics and ECE, University of Oklahoma (from July 2021), and Affiliate Scientist, National Institute of Standards and Technology (NIST) Gaithersburg, United States, and Adjunct Professor, Electrical and Computer Engineering Department, National University of Singapore\n\nProfessor Karen Vogtmann FRS\n\nProfessor, Mathematics Institute, University of Warwick and Goldwin Smith Professor Emeritus, Cornell University, USA\n\n\n\nProfessor Bruce Weir FRS\n\nProfessor, Department of Biostatistics, University of Washington, United States\n\n\n\nSir Simon Wessely FMedSci FRS\n\nRegius Chair of Psychiatry, Institute of Psychiatry, Psychology & Neurosciences, King's College London and Past President, Royal College of Psychiatrists and Royal Society of Medicine\n\n\n\nProfessor Stanley Whittingham FRS\n\nDistinguished Professor of Chemistry and Materials Science and Engineering, Department of Chemistry, Binghamton University, United States\n\n\n\nProfessor Charlotte Williams FRS\n\nProfessor of Inorganic Chemistry, Department of Chemistry, University of Oxford\n\nHonorary Fellowship\n\nSir John Kingman FRS\n\nChair, UK Research and Innovation; Group Chairman, Legal and General plc; Chairman, Tesco Bank; Deputy Chair, The National Gallery; Trustee, Royal Opera House; and a World Fellow, Yale University\n\nForeign Membership\n\nProfessor Stephen Benkovic ForMemRS\n\nEvan Pugh University Professor and Eberly Chair in Chemistry, Department of Chemistry, Pennsylvania State University, United States\n\n\n\nDr Anny Cazenave ForMemRS\n\nEmeritus scientist at LEGOS/CNES, France and Director for Earth Sciences, International Space Science Institute, Switzerland\n\n\n\nProfessor Elena Conti ForMemRS\n\nDirector and Scientific Member, Max Planck Institute for Biochemistry, Germany\n\n\n\nProfessor Stanley Deser ForMemRS\n\nSenior Research Associate, Brandeis University and Institute of Theoretical Physics, Caltech, United States\n\n\n\nDr Vishva Dixit ForMemRS\n\nVice President, Early Discovery Research, Genentech Inc, United States\n\n\n\nProfessor Michael Jordan ForMemRS\n\nProfessor, Department of Electrical Engineering and Computer Sciences and Department of Statistics, University of California, Berkeley, United States\n\n\n\nProfessor V. Narry Kim ForMemRS\n\nProfessor, School of Biological Sciences, Seoul National University and Director, Center for RNA Research, Institute for Basic Science, South Korea\n\n\n\nProfessor Sang Yup Lee ForMemRS\n\nDistinguished Professor, Department of Chemical and Biomolecular Engineering, and Vice President for Research, Korea Advanced Institute of Science and Technology (KAIST), South Korea\n\n\n\nProfessor Giacomo Rizzolatti ForMemRS\n\nEmeritus Professor, Department of Medicine and Surgery, University of Parma, Italy\n\n\n\nProfessor Claire Voisin ForMemRS\n\nSenior researcher, Centre national de la recherche scientifique (CNRS), France"}, {"url": "https://royalsociety.org/news/2022/05/new-fellows-2022/", "page_content": "More than 60 exceptional scientists from around the world have been elected Fellows and Foreign Members of the Royal Society. The 51 Fellows and 10 Foreign Members along with one Honorary Fellow have been selected for their outstanding contributions to science. Their work spans multiple disciplines, from using AI to better detect strokes to developing new technologies for improved energy storage and expanding our understanding of genetic cancer risk factors in non-European populations.\n\nAs well as excellence in research, many of this year’s intake have made outstanding contributions in industry, policy and higher education.\n\nSir Adrian Smith, President of the Royal Society said: “It is an honour to welcome so many outstanding researchers from around the world into the Fellowship of the Royal Society.\n\n“Through their careers so far, these researchers have helped further our understanding of human disease, biodiversity loss and the origins of the universe. I am also pleased to see so many new Fellows working in areas likely to have a transformative impact on our society over this century, from new materials and energy technologies to synthetic biology and artificial intelligence. I look forward to seeing what great things they will achieve in the years ahead.”\n\nAmong this year’s Fellows and Foreign Members:\n\nSandra Knapp is elected as a Fellow, she has made major contributions to our understanding of plant evolution and tropical biodiversity, and has been a ceaseless public advocate for its conservation and appreciation. Ros Rickaby also becomes a Fellow and has made fundamental advances in understanding the evolution of the Earth’s surface, and the processes that continue to shape our environment today. Carlos Nobre joins as a Foreign Member; he is recognised for his work on biosphere-atmosphere interactions and the climate impacts of Amazon deforestation and his leadership of programmes that have shaped Brazilian science. Rachel Wood has made fundamental contributions to our understanding of the origin and evolution of important reef ecosystems, she becomes a Fellow. She is also among six alumni from the Society’s prestigious University Research Fellowship and Dorothy Hodgkin Fellowship schemes represented in this year’s intake of new Fellows.\n\nTedros Ghebreyesus, Director General of the World Health Organization, has been made an Honorary Fellow in recognition of an outstanding career which has benefitted health worldwide. Menelas Pangalos joins the Fellowship having made outstanding contributions to applied life science as an academic neuroscientist and a pharmaceutical leader who has transformed AstraZeneca’s R&D pipeline. Andrew Rambaut also joins as a Fellow. He spearheaded the use of pathogen genome sequences to track, understand and respond to virus epidemics – work that has proved transformative during the COVID-19 pandemic.\n\nYvonne Rogers is elected a Fellow for her pioneering contributions to the field of Ubiquitous Computing – interactive technologies and objects which can enhance our daily work and activities. Joining her as Fellows are Ilya Sutskever, who has been a major contributor to several of the most disruptive advances in artificial intelligence, from object recognition to natural language processing; and Paul Seymour, a renowned graph theorist whose vast and definitive contributions to structural graph theory have rewritten the textbooks of the area\n\nElected as Fellows, Richard Gilbertson has transformed our understanding of the origins and pathogenesis paediatric brain tumours, improving their classifiction and treatment and providing new theraputic targets. Kate Storey has made seminal discoveries about embryonic development of the vertebrate spinal cord. Peter Goadsby has laid the scientific foundations for research into migraine and headaches, interrogating their mechanisms and developing new treatments. Irene Miguel-Aliaga has transformed our understanding of how organs communicate with one another and the importance of the gut-brain axis for regulating metabolism. Her insights have implications for the treatment and prevention of metabolic illnesses, such as diabetes and obesity, and may help explain why some diseases are more common in women, and why men and women respond differently to therapies.\n\nZeblon Vilakazi has made significant contributions to nuclear and particle physics in experiments at CERN and, as Vice Chancellor at the University of the Witwatersrand, has continued to build capacity for experimental particle physics and quantum computing in Sub-Saharan Africa. Chemist Richard Robson founded the field of metallic organic frameworks (MOFs), tailor-made structures with a range of applications in areas such as gas sorption and catalysis. He becomes a Fellow. Michael Thackeray joins the Fellowship for the discovery, design, and development of lithium metal oxide electrodes for lithium-ion battery systems – including technologies likely to be widely adopted in electric vehicles over the next decade. Michael Graetzel has been elected as a Foreign Member for his advances in photovoltaic technology, which are improving the yields of solar hydrogen generation using cheap and abundant light absorbers.\n\nAlso elected as Foreign Members, George Gao, whose contributions in the field of infection and immunity, particularly relating to emerging viral infections, have helped to improve our understanding of major threats to human health, and Maria Leptin, whose leadership in European science – currently as President of the European Research Council – builds on her research contributions across fields from immunity to genetics.\n\nThis year’s Fellows and Foreign Members join the ranks of Stephen Hawking, Isaac Newton, Charles Darwin, Albert Einstein, Lise Meitner, Subrahmanyan Chandrasekhar and Dorothy Hodgkin.\n\nStatistics about this year’s intake of Fellows:\n\n23.5% of this year’s intake of Fellows and Foreign Members are women\n\nNew Fellows have been elected from across the UK including, Belfast, Birmingham, Cambridge, Dundee, Edinburgh, Exeter, London, Loughborough, Manchester, Oxford, Southampton and Strathclyde and from around the world including Australia, Germany, South Africa and the USA\n\nAlumni from the Society’s University Research Fellowship (URF) and Dorothy Hodgkin Fellowship (DHF) schemes are: Professor Andrew Harrison, URF,1988; Professor Susan Lea, DHF, 1995; Professor Oliver Pybus, URF, 2004; Andrew Rambaut, URF, 2001; Rachel Wood, URF, 1994 and Benjamin Sheldon, URF, 2000\n\nThe full list of the newly elected Fellows and Foreign Members of the Royal Society is, in alphabetical order:\n\nNew Fellows\n\nProfessor Fernando Alday FRS\n\nProfessor, Mathematical Institute, University of Oxford\n\n\n\nDr Simon Boulton FMedSci FRS\n\nPrincipal Group Leader, Francis Crick Institute\n\n\n\nProfessor Graham Burton FMedSci FRS\n\nMary Marshall and Arthur Walton Professor Emeritus of the Physiology of Reproduction, University of Cambridge\n\n\n\nProfessor Jason Chin FMedSci FRS\n\nHead, Centre for Chemical and Synthetic Biology, and Joint Head, Division of Protein and Nucleic Acid Chemistry, MRC Laboratory of Molecular Biology; Professor of Chemistry and Chemical Biology, Yusuf Hamied Department of Chemistry, University of Cambridge; Associate Faculty in Synthetic Genomics, Wellcome Sanger Institute and Fellow in Natural Sciences, Trinity College, Cambridge\n\nProfessor Roberto Cipolla FREng FRS\n\nProfessor of Information Engineering, Department of Engineering, University of Cambridge\n\nProfessor Martin Dawson FRS\n\nProfessor, Institute of Photonics, Department of Physics, University of Strathclyde\n\n\n\nProfessor Douglas Easton FMedSci FRS\n\nProfessor of Genetic Epidemiology, Centre for Cancer Genetic Epidemiology, Department of Public Health and Primary Care, University of Cambridge\n\n\n\nProfessor Robin Franklin FMedSci FRS\n\nPrincipal Investigator, Altos Labs - Cambridge Institute\n\n\n\nProfessor Pierre Friedlingstein FRS\n\nProfessor, College of Engineering, Mathematics and Physical Sciences, University of Exeter\n\n\n\nDr Eileen Furlong FRS\n\nHead of Department, Genome Biology Deptartment/Unit, European Molecular Biology Laboratory (EMBL), Germany\n\n\n\nProfessor Vincent Fusco FREng FRS\n\nProfessor of High Frequency Electronic Engineering, Director of Research EEECS, Queen's University Belfast\n\n\n\nProfessor Richard Gilbertson FMedSci FRS\n\nLi Ka Shing Chair of Oncology and Head of Department of Oncology, University of Cambridge, Director of Cancer Research UK Cambridge Centre and Senior Group Leader, CRUK Cambridge Institute\n\n\n\nProfessor Peter Goadsby FMedSci FRS\n\nDirector, NIHR-Wellcome Trust King’s Clinical Research Facility and Professor of Neurology, King’s College London\n\n\n\nProfessor Alain Goriely FRS\n\nStatutory Chair of Mathematical Modelling, Mathematical Institute, University of Oxford\n\n\n\nDr Alexander Gould FMedSci FRS\n\nPrincipal Group Leader, Francis Crick Institute\n\n\n\nProfessor Andrew Harrison OBE FRS\n\nCEO, Diamond Light Source Ltd\n\n\n\nProfessor Jane Hillston FRS\n\nProfessor and Head of School, School of Informatics, University of Edinburgh\n\n\n\nProfessor Peter Hore FRS\n\nProfessor of Chemistry, Department of Chemistry, University of Oxford\n\n\n\nProfessor Nicholas Jennings CB FREng FRS\n\nVice-Chancellor and President, Loughborough University\n\n\n\nDr Sandra Knapp FRS\n\nResearch Botanist, Natural History Museum, London\n\n\n\nProfessor Susan Lea FMedSci FRS\n\nChief and Senior Investigator, Center for Structural Biology, Center for Cancer Research, National Cancer Institute, National Institutes of Health, United States\n\n\n\nProfessor Paul Lehner FMedSci FRS\n\nProfessor of Immunology and Medicine, Cambridge Institute of Therapeutic Immunology and Infectious Disease, University of Cambridge\n\n\n\nProfessor Andrew Livingston FREng FRS\n\nVice Principal Research and Innovation and Professor of Chemical Engineering, Queen Mary University of London\n\n\n\nProfessor Juergen Maier CBE FREng FRS\n\nChair, Manchester Graphene Company, University of Manchester\n\n\n\nProfessor Roberto Maiolino FRS\n\nProfessor of Experimental Astrophysics, Cavendish Laboratory and Kavli Institute for Cosmology, University of Cambridge, and Honorary Professor at University College London\n\n\n\nProfessor Oscar Marín FMedSci FRS\n\nProfessor of Neuroscience and Director, MRC Centre for Neurodevelopmental Disorders and Director, Centre for Developmental Neurobiology, King’s College London\n\n\n\nProfessor Angelos Michaelides FRS\n\n1968 Professor of Chemistry, Yusuf Hamied Department of Chemistry, University of Cambridge\n\n\n\nProfessor Irene Miguel-Aliaga FMedSci FRS\n\nProfessor of Genetics and Physiology, Imperial College London and MRC Investigator, MRC London Institute of Medical Sciences\n\n\n\nProfessor Mark Newman FRS\n\nAnatol Rapoport Distinguished University Professor of Physics, Department of Physics and Center for the Study of Complex Systems, University of Michigan, United States\n\n\n\nProfessor Rachel O'Reilly FRS\n\nProfessor of Chemistry, School of Chemistry, University of Birmingham\n\n\n\nSir Menelas Pangalos FMedSci FRS\n\nExecutive Vice President and President, BioPharmaceuticals R&D, AstraZeneca\n\n\n\nProfessor Robert Pressey FRS\n\nProfessor, Australian Research Council Centre of Excellence for Coral Reef Studies, James Cook University, Australia\n\n\n\nProfessor Trevor Price FRS\n\nProfessor, Department of Ecology and Evolution, University of Chicago, United States\n\n\n\nProfessor Oliver Pybus FRS\n\nProfessor of Infectious Diseases, Department of Pathobiology and Population Sciences, Royal Veterinary College, London and Professor of Evolution and Infectious Disease, Department of Zoology, University of Oxford\n\n\n\nProfessor Jordan Raff FMedSci FRS\n\nCésar Milstein Chair of Cancer Cell Biology, Sir William Dunn School of Pathology, University of Oxford\n\n\n\nProfessor Andrew Rambaut FRS\n\nChair of Molecular Evolution, School of Biological Sciences, University of Edinburgh\n\n\n\nProfessor Ros Rickaby FRS\n\nChair of Geology, Department of Earth Sciences, University of Oxford\n\n\n\nProfessor Richard Robson FRS\n\nProfessorial Fellow, School of Chemistry, University of Melbourne, Australia\n\n\n\nProfessor Yvonne Rogers FRS\n\nProfessor of Interaction Design, UCLIC Director and Deputy Head, Computer Science Department, University College London\n\n\n\nProfessor Jamie Rossjohn FMedSci FRS\n\nProfessor, Department of Biochemistry and Molecular Biology, Biomedicine Discovery Institute, Monash University, Australia\n\n\n\nProfessor Paul Seymour FRS\n\nAlfred Baldwin Dod Professor of Mathematics, Department of Mathematics, Princeton University, United States\n\n\n\nProfessor Ben Sheldon FRS\n\nLuc Hoffmann Professor of Field Ornithology, Department of Department of Zoology, University of Oxford\n\n\n\nProfessor Ian Shipsey FRS\n\nHenry Moseley Centenary Professor of Experimental Physics, University of Oxford\n\n\n\nProfessor Kate Storey FMedSci FRS\n\nHead, Division of Cell and Developmental Biology, School of Life Sciences, University of Dundee\n\n\n\nDr Ilya Sutskever FRS\n\nCo-Founder and Chief Scientist of OpenAI\n\n\n\nDr Michael Thackeray FRS\n\nArgonne Emeritus Scientist and Distinguished Fellow, Chemical Sciences and Engineering Division, Argonne National Laboratory, United States\n\n\n\nProfessor Zeblon Vilakazi FRS\n\nVice Chancellor, University of the Witwatersrand, South Africa\n\n\n\nProfessor Carola G. Vinuesa FRS\n\nRoyal Society Wolfson Fellow, Principal Group Leader and Professor of Immunology, Francis Crick Institute and Australian National University\n\n\n\nProfessor Vaclav Vitek FRS\n\nProfessor Emeritus of Engineering and Applied Science, Department of Materials Science and Engineering, University of Pennsylvania, United States\n\n\n\nProfessor Sally Ward FRS\n\nDirector of Translational Immunology, Cancer Sciences Unit, Centre for Cancer Immunology, University of Southampton\n\n\n\nProfessor Rachel Wood FRS\n\nProfessor of Carbonate Geoscience, Grant Institute, School of GeoSciences, University of Edinburgh\n\nHonorary Fellowship\n\nDr Tedros Ghebreyesus FRS\n\nDirector General, World Health Organisation\n\nForeign Membership\n\nDr Charles Bennett ForMemRS\n\nFellow, IBM Research Division\n\n\n\nProfessor Donald Canfield ForMemRS\n\nProfessor, Department of Biology, University of Southern Denmark, Denmark\n\n\n\nProfessor Titia de Lange ForMemRS\n\nLeon Hess Professor, Laboratory for Cell Biology and Genetics, Rockefeller University, United States\n\n\n\nProfessor George Gao ForMemRS\n\nDirector-General, Chinese Center for Disease Control and Prevention, Vice President, National Natural Science Foundation of China, and Director and Professor, CAS Key Laboratory of Pathogen Microbiology and Immunology, Institute of Microbiology, Chinese Academy of Sciences\n\n\n\nProfessor Michael Graetzel ForMemRS\n\nProfessor and Director. Laboratory for Phtonics and Interfaces, École Polytechnique Fédérale de Lausanne (EPFL), Switzerland\n\n\n\nProfessor Hiroshi Hamada ForMemRS\n\nTeam Leader, RIKEN Center for Biosystems and Dynamics Research, Japan\n\n\n\nProfessor Maria Leptin ForMemRS\n\nProfessor of Genetics, Institute of Genetics, University of Cologne and President of the European Research Council (ERC)\n\n\n\nProfessor Carlos Nobre ForMemRS\n\nSenior Researcher, Institute of Advanced Studies, University of São Paulo, Science Director, Institute of Climate Studies, Federal University of Espírito Santo and Director of the Amazon Third Way Initiative/Amazonia 4.0 Project, Brazil\n\n\n\nProfessor Peter Scholze ForMemRS\n\nDirector, Max-Planck-Institut für Mathematik, Germany\n\n\n\nProfessor Howard Stone ForMemRS\n\nDonald R Dixon ’69 and Elizabeth W Dixon Professor in Mechanical and Aerospace Engineering, School of Engineering and Applied Science, Princeton University, United States"}, {"url": "https://royalsociety.org/fellows/", "page_content": "President\n\nSir Adrian Smith is President of the Royal Society. He started his five year term on 30 November 2020.\n\nAdrian is a mathematician with particular expertise in the field of Bayesian statistics and was knighted in 2011."}, {"url": "https://peoplepill.com/people/paul-y-r-waddington/", "page_content": "Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917. He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917. A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa154 (which operated Spads), on 6 March 1918. Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine. On 19 September 1918, he was transferred to his final wartime post, with Escadrille Spa31. He scored his final triumph solo ten days later. On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II."}, {"url": "https://rsc-src.ca/en/fellows", "page_content": "WHO THEY ARE\n\nToday the fellowship comprises four categories: Honorary Fellows, Regularly Elected Fellows, Specially Elected Fellows and Foreign Fellows. The initial fellowship was selected by a committee headed by the Principal of McGill University, Sir John William Dawson, and by the former Premier of Quebec, Pierre J.O. Chauveau, who served respectively as the first two Presidents of the Society. This founding cohort of Fellows included Sir Sandford Fleming, the originator of the world system of Standard Time, and Sir William Osler, one of the greatest physicians of his day. Since 1882, new Fellows have been nominated and elected by their peers who are themselves Fellows of the Society. Over 3,700 scholars and artists have been inducted into to the fellowship over the past hundred and thirty years.\n\nWhile the early fellowship was drawn primarily from Quebec and Ontario, since that time its geographic reach has expanded to include scholars and artists drawn from every region of Canada.\n\nApproximately 20 per cent of the fellowship indicates French as their first language. Most Fellows hold, or have held, positions in Canadian universities, although many are primarily affiliated with research institutes, government agencies, or private sector laboratories and think tanks. Today the By-laws provide that up to 111 nominees may be elected each year. In addition to Regularly Elected Fellows, the Society also inducts up to seven Specially Elected Fellows per year for contributions to the objectives of the Society other than by scholarship and research.\n\nAnnually, the Society also elects up to four Foreign Fellows who, at the time of their election, are neither residents nor citizens of Canada and who, by their exceptionally distinguished intellectual accomplishments in the arts, humanities and sciences, have helped promote the object of the Society in ways that have clear relevance for Canadian society. Finally, the By-laws envisage the election by the Council of the Society of up to two Honorary Fellows upon recommendation of the President during each presidential term.\n\nTHE ACADEMIES\n\nThe RSC consists of three bilingual Academies embracing a broad range of scholarly disciplines and artistic fields.\n\nAcademy I is the Academy of the Arts and Humanities. There are three Divisions of Academy I: an Anglophone Division (1) - Humanities; a Francophone division (2) - Lettres et sciences humaines; and a bilingual Division for the Arts (3) - embracing architecture, creative writing, and the arts.\n\nAcademy II is the Academy of Social Sciences. There are two Divisions of Academy II: an Anglophone Division (4) - Social Sciences; and a Francophone Division (5) - Sciences sociales.\n\nAcademy III is the Academy of Science. There are five Divisions of Academy III: Applied Sciences and Engineering (6); Earth, Ocean and Atmospheric Sciences (7); Biological Sciences (8); Medical Sciences (9); and Mathematical and Physical Sciences (10). Each Division of Academy III is comprised of both English-speaking and French-speaking Fellows."}, {"url": "https://alchetron.com/Paul-Y-R-Waddington", "page_content": "Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917. He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917. A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa154 (which operated Spads), on 6 March 1918. Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine. On 19 September 1918, he was transferred to his final wartime post, with Escadrille Spa31. He scored his final triumph solo ten days later. On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II."}, {"url": "https://www.britannica.com/topic/Royal-Society", "page_content": "Royal Society, in full Royal Society of London for Improving Natural Knowledge, the oldest national scientific society in the world and the leading national organization for the promotion of scientific research in Britain.\n\nThe Royal Society originated on November 28, 1660, when 12 men met after a lecture at Gresham College, London, by Christopher Wren (then professor of astronomy at the college) and resolved to set up “a Colledge for the promoting of Physico-Mathematicall Experimentall Learning.” Those present included the scientists Robert Boyle and Bishop John Wilkins and the courtiers Sir Robert Moray and William, 2nd Viscount Brouncker. (Brouncker was to become the Royal Society’s first president.) The initiative had various more or less close precursors, including a group that met in London in 1645, the Oxford “Experimental Philosophy Club” in the 1650s, and correspondence networks such as that of the reformer and philanthropist Samuel Hartlib; but the body set up in 1660 was consciously new, with ambitions to become a truly national society devoted to the promotion of science. These ambitions were put into effect over the next few years, particularly through a charter of incorporation granted by Charles II in 1662 and revised in 1663. The royal charter provided an institutional structure for the society, with president, treasurer, secretaries, and council. Though it had royal patronage almost from the start, the society has always remained a voluntary organization, independent of the British state.\n\nBritannica Quiz Science at Random Quiz\n\nFrom the outset the society aspired to combine the role of research institute with that of clearinghouse for knowledge and forum for arbitration, though the latter function became dominant after the society’s earliest years. A key development was the establishment in 1665 of a periodical that acted as the society’s mouthpiece (though it was actually published by the secretary, initially Henry Oldenburg, and was only officially adopted by the society in 1753): this was the Philosophical Transactions, which still flourishes today as the oldest scientific journal in continuous publication.\n\nIn the subsequent history of the society, various episodes are of particular significance. The presidency of Sir Isaac Newton from 1703 to 1727 saw this great mathematician and physicist asserting the society’s dominant role in science in Britain and farther afield. (Earlier, Newton’s Principia had been published with the society’s imprimatur.) Endowments from the 18th century onward made possible prizes for various aspects of science that are still awarded today—most notably the Copley Medal, which, stemming from a bequest by Sir Godfrey Copley in 1709, became the most prestigious scientific award in Britain. In the late 18th century the society played an active role in encouraging scientific exploration, particularly under its longest-serving president, Sir Joseph Banks, who earlier had accompanied James Cook on his great voyage of discovery of 1768–71. However, in general the 18th and early 19th centuries saw the society tending to rest on its laurels and become slightly amateurish. This was rectified in the 1830s by a reform program that reinvigorated the society and restored it to a prominence that it has retained ever since. In 1919 the society sent expeditions to photograph the solar eclipse of May 29 from Príncipe Island in the Gulf of Guinea and from Sobral in Brazil, verifying Albert Einstein’s general theory of relativity and helping to make Einstein famous.\n\nElection to the Royal Society’s Fellowship is a coveted accolade for scientists; since 1945 women as well as men have been eligible for this honour. Today there are approximately 1,300 fellows and 130 foreign members. Since 1967 the society has occupied premises in Carlton House Terrace, London, where meetings are held and the society’s extensive archival and other resources are housed. The society’s role now includes the provision of independent advice on issues of current concern, and it also administers large sums of public money through grants aimed to support innovative research, foster international scientific cooperation, and encourage better communication between scientists and the public."}, {"url": "https://catalogues.royalsociety.org/CalmView/default.aspx", "page_content": "The Royal Society Collections Catalogues\n\nSearch the catalogues of the Royal Society for printed or archival material and biographical records of past Fellows.\n\nFind tips on searching in our guide how do I search the catalogue?\n\nFor more in-depth information on our picture and object collection use our picture library.\n\nThe Philosophical Transactions, the scientific periodical of the Royal Society since 1665, is also available online.\n\nThe library and archive are open to the public. To plan your visit please refer to our information for visitors."}, {"url": "https://irp.nih.gov/about-us/honors/fellows-of-the-royal-society", "page_content": "Fellows of the Royal Society\n\nThe Royal Society is a fellowship of many of the world's most eminent scientists and is the oldest scientific academy in continuous existence.\n\nCurrent NIH scientists elected as Fellows of the Royal Society (year of election):\n\nSusan Lea (2022): Susan Lea is an internationally renowned structural biologist who has pioneered the use of mixed structural methods to study host-pathogen interactions and other medically important molecular pathways. Her laboratory uses and develops cutting-edge structural methods including cryo-electron microscopy and X-ray crystallography to define molecular mechanisms involved in health and disease states.\n\nFrancis Collins (2020): Dr Collins is a physician-geneticist noted for his landmark discoveries of disease genes and his leadership of the international Human Genome Project, which culminated in April 2003 with the completion of a finished sequence of the human DNA instruction book. He served as director of the National Human Genome Research Institute (NHGRI) from 1993-2008 and Director of NIH from 2009-2021.\n\nG. Marius Clore (2020): Marius Clore is a biophysicist known for pioneering three-dimensional structure determination of proteins, nucleic acids and their complexes by solution nuclear magnetic resonance (NMR) spectroscopy, and for developing NMR methods for characterizing the structure and dynamics of rare, short-lived conformational states.\n\nMark Mayer (2019): Mark Mayer is a biologist notable for his seminal work on the biophysics and structural biology of glutamate receptor ion channels, the major mediators of excitatory synaptic transmission in the brain. He has made groundbreaking observations that profoundly changed our view of receptor function and excitatory synaptic transmission in the brain.\n\nFormer NIH scientists elected as Fellows of the Royal Society (year of election):\n\nJulius Axelrod (1979)"}, {"url": "https://mathshistory.st-andrews.ac.uk/Honours/FRS/", "page_content": "The list of fellows given below is only those scientists elected Fellows of the Royal Society whose biographies appear in the MacTutor History of Mathematics Archive, together with some present day mathematicians. The list also gives their date of their election to the Society.\n\nMacTutor links:\n\nOther Web site:"}]}