{"Paul Y. R. Waddington is a philosopher and professor of philosophy at the University of Victoria in British Columbia, Canada.": [{"url": "https://philosophy.fas.harvard.edu/faculty-1", "page_content": "Regular Faculty\n\nJeff Behrends\n\nSenior Research Scholar and Associate Senior Lecturer on Philosophy\n\nResearch Interests: Practical Normativity, Moral Epistemology, Ethics of AI\n\nSelim Berker\n\nAlford Professor of Natural Religion, Moral Philosophy, and Civil Polity\n\nResearch Interests: Ethics, Epistemology, Metaphysics\n\nCheryl Chen\n\nDirector of Undergraduate Studies\n\nSenior Lecturer on Philosophy\n\nFaculty Dean, Dunster House\n\nResearch Interests: Epistemology, Philosophy of Mind, Metaphysics, and Philosophy of Religion\n\nJames Doyle\n\nSenior Lecturer on Philosophy\n\nResearch Interests: History of Philosophy, Plato, Philosophy of Action, and Philosophy of Mind\n\nWarren Goldfarb\n\nWalter Beverly Pearson Professor of Modern Mathematics and Mathematical Logic\n\nResearch Interests: Mathematical Logic, Development of Analytic Philosophy, Philosophical Logic, and Metaphysics\n\nEdward J. Hall\n\nNorman E. Vuilleumier Professor of Philosophy\n\nResearch Interests: Metaphysics, Epistemology, and Philosophy of Science\n\nZoë Johnson King\n\nAssistant Professor of Philosophy\n\nResearch Interests: Ethics, Epistemology, Metaethics (esp. Moral Psychology)\n\nSean Kelly\n\nTeresa G. and Ferdinand F. Martignetti Professor of Philosophy\n\nHarvard College Professor\n\nFaculty Dean, Dunster House\n\nResearch Interests: Post-Kantian European philosophy (esp. Phenomenology and Existentialism), Philosophy of Mind, Philosophy of Perception, Philosophy of Literature\n\nPeter Koellner\n\nProfessor of Philosophy\n\nResearch Interests: Mathematical Logic, Set Theory, and the Philosophy of Mathematics\n\nSamantha Matherne\n\nAssistant Professor of Philosophy\n\nResearch Interests: Kant, Phenomenology, Neo-Kantianism, Aesthetics, Perception\n\nJeffrey McDonough\n\nProfessor of Philosophy\n\nResearch Interests: Early Modern Philosophy, Medieval Philosophy, Philosophy of Science, Philosophy of Religion\n\nRichard Moran\n\nBrian D. Young Professor of Philosophy\n\nResearch Interests: Philosophy of Mind, Moral Psychology, Aesthetics, Philosophy of Literature, later Wittgenstein\n\nBernhard Nickel\n\nDepartment Chair\n\nProfessor of Philosophy\n\nResearch Interests: Philosophy of Language, Philosophy of Science, Philosophy of Mind, Metaphysics\n\nMark Richard\n\nDirector of Graduate Studies\n\nProfessor of Philosophy\n\nResearch Interests: Philosophy of Language, Philosophical Logic, Metaphysics, and Epistemology\n\nSusanna Rinard\n\nProfessor of Philosophy\n\nResearch Interests: Epistemology, Philosophy of Science, and Formal Epistemology\n\nGina Schouten\n\nProfessor of Philosophy\n\nResearch Interests: Political Philosophy, Ethics, Feminist Philosophy, Philosophy of Education\n\nAmartya Sen\n\nThomas W. Lamont University Professor\n\nResearch Interests: Economics and Economic Theory, Ethics, Political Philosophy, Philosophy of Law\n\nTommie Shelby\n\nCaldwell Titcomb Professor of African and African American Studies and of Philosophy\n\nResearch Interests: Social and Political Philosophy, History of Black Political Thought, Philosophy of Race, and Social Theory\n\nSusanna Siegel\n\nPlacement Director\n\nEdgar Pierce Professor of Philosophy\n\nResearch Interests: Philosophy of Mind, Epistemology, Philosophy of Language\n\nAlison Simmons\n\nSamuel H. Wolcott Professor of Philosophy\n\nResearch Interests: Philosophy of Mind, Philosophy of Perception, Early Modern Philosophy\n\nLucas Stanczyk\n\nAssistant Professor of Philosophy\n\nResearch Interests: Political Philosophy and Political Economy, Ethics, Inequality\n\nQuinn White\n\nAssistant Professor of Philosophy\n\nResearch Interests: Ethics, Metaethics, Applied Ethics, Metaphysics"}, {"url": "https://philosophy.columbia.edu/node/265", "page_content": "photo of Robert J Gooding-Williams\n\nRegular\n\nRobert J Gooding-Williams\n\nM. Moran Weston/Black Alumni Council Professor of African American Studies, and Professor of Philosophy and of African American and African Diaspora Studies, Department of Philosophy\n\nResearch Interest"}, {"url": "https://hawaii.edu/phil/people/current-faculty/", "page_content": "TAMARA ALBERTINI\n\n\n\nProfessor & Department Chair\n\nSakamaki Hall D-303/D-301A\n\nt: 808.956.6030\n\ne: tamaraa@hawaii.edu\n\nPersonal Website\n\nDr.phil. Ludwig-Maximilians-Universität, Munich (Germany)\n\nLic.phil. University of Basel (Switzerland)\n\nRenaissance and Early Modern Philosophy, Islamic Philosophy, Contemporary Arab Philosophy, Feminist Issues in Philosophy\n\nProfessor Albertini’s research in Renaissance philosophy focuses on Nicholas of Cusa (mathematics, cosmology), Marsilio Ficino (metaphysics, aesthetics) and Charles de Bovelles (sapientia, ars oppositorum, analogia) in whose works she detects an alternative type of rationality: inclusive and reconciliatory. She is also interested in the innovative use of mathematical figures and other visual means in Renaissance works as “philosophical language.” Her most recent paper is entitled “‘Methodic Foundering’ or ‘Methodic Overcoming of Rationality?’ Metaphysics of Liberation in Karl Jaspers and Nicholas of Cusa”(2021). She is also the co-founder and President of The International Charles de Bovelles Society.\n\nWithin Islamic philosophy, Professor Tamara Albertini’s publications aim at reintroducing the vigor and vision of Muslim intellectual contributions from the classical period. More recently, she guest-edited Politics, Nature, and Society: The Actuality of North African Philosopher Ibn Khaldūn. Special issue of Philosophy East and West 69, 3 (2019). Her seminal article “The Seductiveness of Certainty. Fundamentalists’ Destruction of Islam’s Intellectual Legacy,” Philosophy East and West (2003) has been quoted in multiple annual Congress reports. Currently, she is completing her book on Rābi‘a al-‘Adawiyya, the famous Sufi from Basra.\n\nProfessor Albertini has been awarded many national and international fellowships and grants, including a NEH Travel Grant for Iran and Central Asia. She was honored with the Excellence in Teaching Award (2016), a Fulbright Scholar Award (2018/19, Bulgaria), and the Distinguished Scholar Award from Cairo University (2019).\n\nARINDAM CHAKRABARTI\n\nLenney Distinguished Professor\n\nSakamaki Hall C-305\n\nt: 808.956.7990\n\ne: arindam@hawaii.edu\n\nD.Phil., Oxford University\n\nDirector, EPOCH Project\n\nIndian Philosophy, Philosophy of Language, Metaphysics, Comparative Philosophy\n\nArindam Chakrabarti earned a D.Phil from Oxford University. Philosophy of language and logic, metaphysics, philosophy of mind, and Indian philosophy are his major areas of specialization. He has been a Visiting Professor at Institute of Advanced Studies in Edinburgh, UK, the Sanskrit University in Tirupati, India, at Trinity College Cambridge, and at the National Institute of Advanced Study, Bangalore, India. In his teaching and research Professor Chakrabarti has been trying to combine analytic, classical Indian (especially Nyāya and Kashmir Shaivism) and continental philosophies. Besides numerous papers in journals and anthologies, his major publications include his book on negative existentials and fictional discourse Denying Existence, an introduction to 20th century Western epistemology in Sanskrit, and five books in Bangla, the latest on the philosophy of food and clothing. His co-edited volumes include Knowing from Words (with B.K.Matilal), Universals, Concepts and Qualities (with P.F. Strawson), Apoha: Buddhist Nominalism (with Mark Siderits and Tom Tillemans), and Mahabharata Now (with Sibaji Bandyopadhyay). The Eastern Philosophy of Consciousness and the Humanities Project (EPOCH Project) with its focus areas on imagination, concepts and emotion, has recently taken off under his direction.\n\nCHUNG-YING CHENG\n\nProfessor & Editor of Journal of Chinese Philosophy\n\nSakamaki Hall C-303\n\nt: 808.956.6081\n\ne: ccheng@hawaii.edu\n\nON LEAVE\n\nPh.D., Harvard University\n\nChinese Philosophy (Classical and Neo-Confucianism), Comparative Philosophy\n\nA senior member of the Department since 1963, Professor Cheng has become an internationally well-known scholar-philosopher in Chinese philosophy and comparative philosophy. With a broad and deep background in the traditions of classical Chinese philosophy and Neo-Confucianism, he received his doctorate from Harvard University in the field of analytical philosophy and logic. He has received fellowships and grants from the National Science Foundation, the Pacific Cultural Foundation, the Stanford Institute in the Philosophy of Science, and the Fulbright Foundation. He has lectured worldwide in both Europe (Oxford, Berlin TU, and Scandavian countries) and China (Beida, Tsinghua and Renda) and has received numerous honorary titles. He is the founding president and now also the honorary president of the International Society of Chinese Philosophy. He also founded and serves as president of the International Society for Yijing Studies. Cheng founded the Journal of Chinese Philosophy in 1972 and has edited the Journal since then. For his important work in modernization and globalization of Chinese philosophy, he has received an Honorary Doctorate from the Far Eastern Institute of the Russian Academy of Sciences in 1995. Professor Cheng has authored and edited 21 books and over 250 articles in Western, Chinese, and comparative philosophy. He is currently working on a book on ontology in relation to onto-hermeneutics and a book on Kant and Confucianism.\n\nVRINDA DALMIYA\n\nProfessor\n\nSakamaki Hall B-303\n\nt: 808.956.5981\n\ne: vrinda@hawaii.edu\n\nPh.D., Brown University\n\nEpistemology, Feminist Philosophy, Environmental Philosophy\n\nVrinda Dalmiya received a M.Phil from Jadavpur University, India and a Ph.D. from Brown University. She has been a Fellow at the Indian Institute of Advanced Studies in Shimla, India, where she worked on a comparative project involving feminist care ethics, virtue epistemology and the Sanskrit epic, the Mahabharata. Dr. Dalmiya is mainly interested in analytic feminism. Her areas of research include care ethics, epistemology, gender and environmental philosophy, gender and disability and comparative philosophy. She has published in numerous anthologies and journals like Hypatia, Environmental Ethics, Journal of Social Philosophy and Sophia.\n\nJONATHAN D. FINE\n\nAssistant Professor\n\nSakamaki Hall C-304\n\nt: 808.956.8649\n\ne: jdfine@hawaii.edu\n\nPersonal Website\n\nPh.D., Columbia University\n\nAncient Greek and Roman Philosophy; History of Aesthetics; Ethics\n\nJonathan Fine received his PhD from Columbia University and has been a Postdoctoral Fellow in Philosophy and the Humanities at Yale University. His research and teaching focus on ancient Greek and Roman philosophy and issues between aesthetics and ethics. Professor Fine is working on a monograph, Virtues of Appearance: Plato and the Pursuit of Beauty, examining how beauty for Plato steers who we aspire to be. Some related work is published or forthcoming in such venues as Phronesis, Classical Quarterly, Journal of Aesthetics and Art Criticism, and A Cultural History of Beauty in Antiquity (Bloomsbury). Interested also in medieval and early modern philosophy, he asks in his work and courses how concepts, including freedom, the self, and emotions, change within cultures over time and what we might learn from this today.\n\nMASATO ISHIDA\n\nAssociate Professor & Director of the UHM Center for Okinawan Studies\n\nSakamaki Hall B-305\n\nt: 808.956.8250\n\ne: masatoi@hawaii.edu\n\nPh.D., The Pennsylvania State University\n\nClassical American Philosophy, Japanese Philosophy, Process Philosophy, History and Philosophy of Mathematical Logic\n\nMasato Ishida received his academic training in Japan, Canada, and the United States. He joined the department in 2009 after completing his PhD in philosophy at the Pennsylvania State University. He specializes in classical American philosophy, history and philosophy of logic, and traditional Japanese philosophy. Recent works include “The Sense of Symmetry: Comparative Reflections on Whitehead, Nishida, and Dōgen” (Process Studies, Vol. 43, No. 1, pp. 4-34, 2014) ; “The Metaphysics of Pluralistic Manifestations in James and East Asian Buddhism” (William James Studies, Vol. 10, pp. 1-7, 2014) ; “A Peircean Reply to Quine’s Two Problems” (Transactions of the Charles S. Peirce Society, Vol. 49, No. 3, pp. 322-347, 2013). He is a member of the Center for Japanese Studies and the Center for Okinawan Studies at the University of Hawai‘i at Mānoa. He was honored with the Excellence in Teaching Award (2021).\n\nTHOMAS E. JACKSON\n\nSpecialist & Director of UHM Uehiro Academy\n\nSakamaki Hall C-307\n\nt: 808.956.7287\n\ne: tjackson@hawaii.edu\n\nPh.D., University of Hawai‘i at Mānoa\n\nExecutive Director, UHM Uehiro Academy for Philosophy and Ethics in Education\n\nPhilosophy for Children\n\nThomas E. Jackson earned his doctorate in Comparative Philosophy from the University of Hawai‘i in 1979. In 1980 he became a co-founder of the Hawai‘i International Film Festival. In 1984 he trained in “Philosophy for Children” (P4C) at Montclair State University in New Jersey with other scholars from around the world. There he learned from P4C’s creator, Matthew Lipman, an inspiring approach to working with children, a provocative new way of thinking about philosophy, and an exciting development in education. Since 1984 he has been passionately committed to the development of P4C in Hawai‘i and around the world. He is currently serving as Executive Director of the newly established UHM Uehiro Academy for Philosophy and Ethics in Education. Dr. Jackson received a Chancellor’s Citation for Meritorious Teaching (2012) and the Robert W. Clopton Award for Distinguished Community Service (2021). His ongoing research interests focus on demonstrating the impact of doing philosophy with children in grades K-12. His publications include “Home Grown”, “Educational Perspectives: Journal of the College of Education/University of Hawai`i at Mānoa”, “Philosophical Rules of Engagement”, Philosophy in Schools: An Introduction for Philosophers and Teachers, “Philosophy for Children Hawaiian Style—“On Not Being in a Rush…” “Thinking: The Journal of Philosophy for Children”, “The Art and Craft of ‘Gently Socratic’ Inquiry”, Developing Minds: A Resource for Teaching Thinking, (3rd edition), Freiheit in interkultureller Perspective, by Thomas E. Jackson and Ramakrishna Puligandla.\n\nSTEVE ODIN\n\nProfessor\n\nSakamaki Hall B-307\n\nt: 808.956.8172\n\ne: steveo@hawaii.edu\n\nPh.D., State University of New York at Stony Brook\n\nJapanese Philosophy, Comparative Philosophy, American Philosophy, Metaphysics, Phenomenology, Aesthetics\n\nSteve Odin joined the department in 1982 after completing his PhD degree in philosophy from State University of New York at Stony Brook. He has taught as a visiting professor at Boston University (1989), Tohoko University (1994-95) and the University of Tokyo (2003-04). His research and teaching areas include Japanese philosophy, East-West comparative philosophy, American philosophy, Whitehead’s process metaphysics, phenomenology, existentialism, environmental ethics, and aesthetics. Among his publications are Process Metaphysics and Hua-Yen Buddhism (1982), The Social Self in Zen and American Pragmatism (1994), Artistic Detachment in Japan and the West: Psychic Distance in Comparative Aesthetics (2001), and Tragic Beauty in Whitehead and Japanese Aesthetics (2016). Among his awards are one-year grants for teaching and research in Japan, including two Fulbright Awards (1994-95 and 2003-04), Japan Foundation Award (2001-02) and National Endowment for the Humanities (1987-88), as well as the Presidential Award for Excellence in Teaching at the University of Hawaii (1986), the Association of Asian Studies /Northeast Council for Asian Studies Award (1998), the Templeton Foundation Award (2000) and the Niwano Peace Foundation Award (2001). He is a member of the UH Center for Japanese Studies.\n\nFRANKLIN PERKINS\n\nProfessor & Editor of Philosophy East and West\n\nSakamaki Hall B-302B\n\ne: perkinsf@hawaii.edu\n\nPh.D. Pennsylvania State University\n\nClassical Chinese Philosophy, Early Modern European Philosophy, Comparative Philosophy\n\nFranklin Perkins received his Ph.D. from Pennsylvania State University and has been a professor at Nanyang Technological University (Singapore) and at DePaul University (Chicago), where he was also director of the Chinese Studies Program. His main teaching and research interests are in classical Chinese philosophy, early modern European philosophy, and in the challenges of doing philosophy in a comparative or intercultural context. In the past few years, he has been focused particularly on the philosophical significance of recently excavated Chinese texts that were buried around 300 BCE. He is the author of Heaven and Earth are not Humane: The Problem of Evil in Classical Chinese Philosophy (Indiana, 2014), Leibniz: A Guide for the Perplexed (Bloomsbury, 2007), and Leibniz and China: A Commerce of Light (Cambridge, 2004), and he was co-editor (with Chenyang Li) of Chinese Metaphysics and Its Problems (Cambridge, 2015). His books have been translated into Portuguese, Chinese, and Japanese.\n\nSEAN M. SMITH\n\nAssistant Professor & Undergraduate Chair\n\nSakamaki Hall B-313\n\nt: 808.956.8954\n\ne: sean.smith@hawaii.edu\n\nPersonal Website\n\nYouTube Channel\n\nPh.D., University of Toronto\n\nIndian Buddhism, Philosophy of Mind, Phenomenology, Cognitive Science\n\nProf. Smith earned both a B.A. (hons) and Ph.D. from the Department of Philosophy at the University of Toronto. His research is focused on the intersection of Indian Buddhist philosophy (with a particular emphasis on the Pāli tradition) and contemporary philosophy of mind, cognitive science, and moral psychology. Specifically, his work addresses the connection between embodied affect, consciousness, and attention. In particular, he is trying to understand how affective biases shape perceptual salience and what kind of normative obligations we might be under in light of that shaping process. Other related interests include pain and suffering, animal consciousness, and the nature of the self. His research has been published in the Journal of Indian Philosophy, Sophia, Review of Philosophy and Psychology, and Philosopher’s Imprint. Professor Smith was the recipient of the 2022 College of Arts, Languages & Letters Excellence in Teaching Award at UH Mānoa.\n\nJOSEPH TANKE\n\nProfessor\n\nSakamaki Hall D-307\n\nt: 808.956.7001\n\ne: tanke@hawaii.edu\n\nPh.D., Boston College\n\nContinental Philosophy, Aesthetics, Historical Ontology, Social and Political Philosophy\n\nJoseph Tanke earned his Ph.D. at Boston College. He has lectured and published extensively on issues and figures in Continental philosophy, aesthetics, and the history of philosophy. His major publications include Foucault’s Philosophy of Art: A Genealogy of Modernity (Continuum, 2009) and Jacques Rancière: An Introduction—Philosophy, Politics, and Aesthetics (Continuum, 2011). Professor Tanke recently completed (with Colin McQuillan) The Bloomsbury Anthology of Aesthetics (Bloomsbury, 2012), a new textbook for use in courses dedicated to aesthetics, the philosophy of art, and literary theory. Additionally, Professor Tanke is interested in comparative aesthetics, social and political philosophy, and the historical ontology of pain within Western thought and medicine.\n\nGEORGE TSAI\n\nAssociate Professor & Graduate Chair\n\nSakamaki Hall B-306\n\nt: 808.956.8734\n\ne: gtsai@hawaii.edu\n\nPersonal Website\n\nPh.D., University of California, Berkeley\n\nB.A., summa cum laude, Amherst College\n\nEthics, Political Philosophy, Moral Psychology\n\nGeorge Tsai joined the Department in 2012, and is an affiliated member of the Center for Chinese Studies. From 2013-2014, he was a Postdoctoral Research Fellow in the School of Philosophy at the Australian National University. His research interests are in moral and political philosophy, broadly understood to encompass contemporary and comparative perspectives on these subjects, as well as such related areas as moral psychology and philosophy of law. He has written on rational persuasion, blame, being supportive, intimate relationships, paternalism, exploitation, and the state’s taxation and expressive powers. He has published or forthcoming articles in venues including Philosophy and Public Affairs, Journal of Political Philosophy, Pacific Philosophical Quarterly, Social Theory and Practice, and Oxford Studies in Agency and Responsibility."}, {"url": "https://www.wgtn.ac.nz/hppi/philosophy", "page_content": "Philosophy\n\nThe Philosophy programme examines the nature of reality and the mind, ethical and artistic value, the structure of logical arguments—and the meaning of life.\n\nMajor in thinking—study Philosophy\n\nSome of our courses are of particular interest to students studying psychology, politics, law, science, or media studies.\n\nPhilosophy students develop critical thinking skills—they learn to analyse arguments, write clearly, solve problems, and think creatively. These add value to other areas of study and are skills that are sought after by employers.\n\nWhy you should study with us See a presentation prepared by Prof Simon Keller and AProf Justin Sytsma about how and why to study Philosophy at Te Herenga Waka—Victoria University of Wellington. View the presentation (PDF)\n\nStudying Philosophy in Wellington\n\nPhilosophers explore the nature of argument and justification and examine the rational basis of belief in all areas of enquiry. Philosophers seek to answer questions like “What things exist?”, “Is there a single truth about what's right and wrong?”, “What can we know for sure?”, and \"Is there a god?\"\n\nThe literal meaning of the word ‘philosopher’ is ‘lover of wisdom’. However, Philosophy is also about the love of critical and creative thinking, intelligent discussion, and cogent argument. These are skills that can be applied to almost any issue in almost any context.\n\nCreative, critical, and cogent thinking\n\nPhilosophy courses are an important component of any degree at our university. Since creative, critical, and cogent thinking is fundamental to every subject, the concepts and methods of contemporary philosophy can be useful for students majoring in most other fields. Philosophy gives you a competitive academic edge and enhances the overall quality of your degree.\n\nLinks to other disciplines\n\nThe Philosophy programme at the University has strong links to other disciplines outside the School, including connections with computing and mathematics through logic; with science through the philosophy of biology, and ethics and genetics; and with art and art history through the philosophy of art.\n\nResearch strengths\n\nPhilosophy staff at the University are engaged in research across a large range of topics within Philosophy. We have particular strengths in logic, ethics, metaphysics, aesthetics, and philosophy of biology. Logic is reflected in a range of Philosophy postgraduate offerings: BA(Hons), MA, and PhD degrees in Logic or Logic and Computation."}, {"url": "https://www.sydney.edu.au/arts/schools/school-of-humanities/philosophy.html", "page_content": "Philosophy is about learning to think rigorously for yourself so you can defend your positions with considered reasons and cogent arguments. The study of philosophy improves an individual's ability to speak and write clearly, logically and convincingly. These broad skills, along with capacity for independent thought, are highly transferable, powerful aids to success in any profession.\n\nIn philosophy we ask deep, often counter-intuitive questions, and don’t mind if they lead to further, even more difficult questions. We encourage critical reflection and debate.\n\nWe are highly regarded for our research and teaching as well as our breadth and diversity. Philosophy at the University of Sydney is home to leading thinkers in a wide range of areas of philosophy, and we offer a rich and varied array of units taught by dedicated and enthusiastic scholars whose outstanding research informs their teaching at every level."}, {"url": "https://www.britannica.com/biography/C-H-Waddington", "page_content": "C.H. Waddington, in full Conrad Hal Waddington, (born Nov. 8, 1905, Evesham, Worcestershire, Eng.—died Sept. 26, 1975, Edinburgh, Scot.), British embryologist, geneticist, and philosopher of science.\n\nWaddington graduated in geology from the University of Cambridge (1926), and it was only after studying paleontology that he turned to biology. Before World War II he taught zoology and embryology at Strangeways Research Laboratory, Cambridge. From 1947 until his death he was professor of animal genetics at the University of Edinburgh.\n\nBritannica Quiz Faces of Science\n\nWaddington performed his first notable work in biology on the development of the embryos of birds and mammals. He showed in 1933 that chemical messengers from certain tissues induce other tissues to develop. These studies of embryonic development led him to investigate the regulatory effects of genes on tissue and organ development. Waddington then attempted, in Organisers and Genes (1940), to relate Mendelian genetics to the new findings of experimental embryology.\n\nDuring World War II, Waddington engaged in operations research for the military. After the war he established for the British Agricultural Research Council the Unit of Animal Genetics, a research organization that studied the genetics and scientific breeding of livestock. He afterward served as chief geneticist for this endeavour.\n\nWaddington published many books on embryology, genetics, and the philosophy of science; his Principles of Embryology (1956) is considered a standard textbook, while The Ethical Animal (1960) and Biology for the Modern World (1962) are leading works of popularized science."}, {"url": "https://plato.stanford.edu/entries/ricoeur/", "page_content": "First published Mon Nov 11, 2002; substantive revision Thu Dec 15, 2022\n\nIn the course of developing this anthropology, Ricoeur made several major methodological shifts, partly in response to changes in his intellectual setting as new developments came to speak to the topics he was dealing with, sometimes in ways that challenged his own approach, partly as he pursued questions that had arisen as a result of his published work or that had not yet been considered there. His early academic training was in the tradition of French reflexive philosophy, a tradition that seeks to understand how the “I” comes to be aware of itself and of its thought and action starting from the lived experience of reflexive consciousness, our being aware of ourselves as existing, thinking, and acting. This focus on reflexive consciousness always played a role in organizing Ricoeur’s thinking. His first major publications after World War II, though, were written using existential phenomenology and the French tradition of reflexive philosophy, reflecting not just his study of Husserl, which had begun prior to World War II but also of Karl Jaspers, Gabriel Marcel, Jean-Paul Sartre, and Maurice Merleau-Ponty. By 1960, however, Ricoeur had concluded that to study human reality properly, particularly given the existence of evil, he had to combine phenomenological description and analysis with hermeneutic interpretation. This shift led to an increasing focus on a theory of interpretation that could be grafted to phenomenology, an approach which he came to see was in fact called for by phenomenology. For this hermeneutic phenomenology, whatever is intelligible comes to us in and through our use of language to talk about our lived experience. While philosophical language and the categories it uses always aim at being founded on univocal concepts, as actually used language is always polysemic; it can have more than one meaning, more than one translation, so all uses of language necessarily call for interpretation. This hermeneutic or linguistic turn in Ricoeur’s thought did not require him to disavow the basic results of his earlier investigations. It did, however, lead him not only to revisit that work but also to see more clearly its broader implications, particularly in relation to and in response to the development of structuralism which he saw as a challenge to such a hermeneutic approach. In his later work, this led to an increasing emphasis on the fact that we live in time and in history. He took up this insight through the philosophy of discourse that he developed on the basis of the increased emphasis on language in his philosophy. His late writings also reflect a more direct concern for making sense of selfhood and personal identity as something that goes beyond the epistemological subject, and for ethics at the individual as well as the societal and political levels, leading to his essays on the idea of the just and his last book on the possibility of mutual recognition and states of peace.\n\nA major theme that runs through Ricoeur’s writings is that of a philosophical anthropology. Ricoeur came to formulate this as the idea of the “capable human being”. With it he seeks to give an account of the fundamental capabilities and vulnerabilities that human beings display in the activities that make up their lives, and to show how these capabilities enable responsible human action and life together. Though the accent is always on the possibility of understanding human beings as agents responsible for their actions, Ricoeur consistently rejects any claim that the self is immediately transparent to itself or fully master of itself. Self-knowledge only comes through our understanding of our relation to the world and of our life with and among others in time in the world.\n\nPaul Ricoeur (1913–2005) is a distinguished French philosopher of the twentieth century, one whose work has been widely translated and discussed across the world. In addition to his academic work, his public presence as a social and political commentator, particularly in France, led to a square in Paris being named in his honor on the centenary of his birth in 2013. In the course of his long career he wrote on a broad range of issues. In addition to his many books, Ricoeur published more than 500 essays, many of which appear in collections in English. The Ricoeur Archive in Paris has made many of those originally published in French available online through its website.\n\n1. Biographical Sketch\n\nPaul Ricoeur was born on February 27, 1913 in Valence, France. His mother died shortly thereafter and his father was killed in the Battle of the Marne in 1915, so Ricoeur and his sister were reared by their paternal grandparents and an unmarried aunt in Rennes. They were devout members of the French Reformed Protestant tradition. He was later to speak of the role of faith in his life as “an accident transformed into a destiny through an ongoing choice, while scrupulously respecting other choices.” As a war orphan his schooling was paid for by the French government. He studied philosophy first at the University of Rennes and then at the Sorbonne. From the earliest years of his academic life he was convinced that there is a basic, irreducible difference between things and human beings as persons and as agents. Unlike things, persons can engage in free, thoughtful action. But Ricoeur never accepted any version of a substance dualism in the person as the Cartesian cogito and the Kantian transcendental subject can be read to require. He did, however, accept Kant’s doctrine regarding the antinomies of reason and the necessary distinction between theoretical and practical reason. Ricoeur was studying in Germany when World War II broke out. Soon after being called up for service in the French army in 1939 he was captured and spent the rest of the war in prison camps in Germany. There he was able to study the work of Karl Jaspers and to prepare a translation of Husserl’s Ideas I in the margins of the book which he had to conceal from his jailers. After the war, he completed his doctorate and was appointed lecturer, then professor of the history of philosophy at the University of Strasbourg, where he succeeded Jean Hyppolite. He remained there until 1956, when he was named to the chair of general philosophy at the Sorbonne. In 1965, he joined the faculty of the new University of Paris at Nanterre, now Paris X, whose establishment he had supported in light of the rapid growth in the number of university students at that time. He served a difficult year as Dean of the faculty of letters following the student uprising of 1968. Except for three years he then spent at Louvain, he continued to teach a seminar at the Husserl Archive in Paris until he reached the mandatory retirement age in 1980. From 1954 on, Ricoeur also lectured regularly in the United States and Canada. In 1970 he was named to succeed Paul Tillich as the John Nuveen professor of philosophical theology at the University of Chicago, with a joint appointment in the Divinity School, the Philosophy Department, and the Committee on Social Thought. He taught there regularly for a portion of each year until 1992. In 1986 he gave the Gifford Lectures in Edinburgh, Scotland. Ricoeur’s work has been translated into more than twenty-five languages and he was honored by a volume in the Library of Living Philosophers series. Among his many honorary doctorates are ones from Chicago (1967), Northwestern (1977), Columbia (1981), Göttingen (1987), and McGill (1992). He was the recipient of numerous awards, among them the Hegel Prize (Stuttgart, 1985), the Dante Prize (Florence, 1988), the Karl Jaspers Prize (Heidelberg, 1989), the Leopold Lucas Prize (Tübingen, 1990), the French Academy Grand Prize for Philosophy (1991), the Kyoto Prize (2000), and the Pope Paul VI International Prize (2003). In 2004, he was co-recipient of the John W. Kluge Prize in the Human Sciences awarded by the Kluge Center at the Library of Congress.\n\n2. Pre-hermeneutic Anthropology\n\nRicoeur’s first major work was meant to appear in three volumes that would lay out a philosophy of the will starting from an eidetic phenomenology of the voluntary and the involuntary. The second volume would then turn to questions dealing with the empirical reality of the will. The third volume would address the misuse of the will and the existence of evil which cannot be explained through either a pure phenomenology of the will or its empirical existence. The projected third volume was announced as intending to present what Ricoeur called a poetics of the will and a vision of innocence in light of what Ricoeur, following Karl Jaspers, called Transcendence. This latter volume never appeared. It was delayed, then set aside when Ricoeur discovered new problems he had not foreseen and when he sought to respond to new challenges to philosophy coming especially from structuralism.\n\nThe first volume of this projected trilogy, Freedom and Nature: The Voluntary and the Involuntary (1950), proposes a phenomenology of the will, while bracketing the reality of evil. It draws on the method of phenomenology developed by Edmund Husserl. In it one finds an expression of a theme central to Ricoeur’s anthropology, namely, the polar subjective/objective character of the constituent features of lived human existence. Contrary to Sartre’s claim that there is radical difference between consciousness (or the for-itself) and materiality (or the in-itself), a difference that pits the freedom of the for-itself against the sheer facticity of the in-itself, Ricoeur argues that the voluntary and involuntary dimensions of human existence are complementary. This can be seen through a phenomenological description of the three structures that constitute the voluntary pole of human existence: deciding, choosing and moving to action, and our necessary consent to the involuntary as that which is acted upon through our will, whose organ is our body. There is no seamless harmony between these dimensions of what is finally a finite freedom. Human beings have to struggle with the tension between them and ultimately to consent to their embodied lives and the world as something they do not fully create. It is the always fragile resolution of this conflict that ultimately makes human freedom genuinely human, and that gives us our distinctive identities both as individuals and as members of larger historical communities and ultimately of humanity.\n\nRicoeur extends his account of freedom to take up the topic of evil in Fallible Man and The Symbolism of Evil, both published in 1960. In these works he addresses the question of how to account for the fact that it is possible for us to misuse our freedom, a question that had been bracketed in the initial phenomenological volume. In Fallible Man he argues through a transcendental analysis that this possibility is grounded in the basic disproportion that characterizes human existence as located between the finite, perspectival nature of experience and the infinite, rational dimensions of taking up that experience in perception, practice, and feeling, leading to the concept of fallibility. This disproportion shows up in every aspect of human existence, from perceiving to feeling to thinking. It is evident in the human desire for possessions, power, and prestige. By reason of this disproportion, we are never wholly at one with ourselves and hence we can go wrong. We are fallible, yet evil, the misuse of our freedom, is neither original nor necessary, only always possible.\n\nNor does this disproportion render our existence meaningless. Rather, the very disproportion that makes us fallible and makes human evil doing possible is also what makes goodness, knowledge, and achievement possible. It is what distinguishes us from one another—each one of us has his or her unique spatiotemporal location and perspective but we can know ourselves as one human among many and we can seek to know the world beyond our individual perspective on it. Our fallibility also makes it necessary and possible for us to communicate with each other through our use of the logos which seeks to transcend our localized points of view.\n\nThough the unity of humanity is never more than a unity founded on communication, precisely because we can communicate, the differences among us are never absolute. Furthermore, no one of us alone could be a person. Though each of us has an individual identity, our identities show that we are bound up with others: “Man is this plural and collective unity in which the unity of destination and the differences of destinies are to be understood through each other” (Fallible Man, 138).\n\nThe kind of unity that binds people to one another even though they differ is found in their desire for esteem and recognition. This desire seeks genuine mutuality that expresses esteem for the worth that each of us has by reason of both our common humanity and our individual uniqueness. This esteem positively values the disproportion constitutive of every person. This theme of mutual recognition is developed more fully in Ricoeur’s final book The Course of Recognition, where he argues that it goes beyond mere reciprocal recognition, like that found in commercial or other transactions reducible to an exchange of goods with no regard for who the other party involved might be.\n\nThe study of history which acknowledges the temporality of our existence confirms our desire for such mutual esteem. Such attention to history, in turn, further clarifies the finite nature of human freedom. For Ricoeur, there is an order and structure to history conveyed through the narrating of history. Otherwise history would be unintelligible. But this narrated history also recounts events and deeds that disrupt the prevailing order and reorder it, leading to the question whether forgiveness for the wrongs that have occurred and debts that have been incurred might be possible, however difficult to achieve.\n\nThese reflections reinforced Ricoeur’s conviction that what humans say and do presupposes both a finite freedom that allows us to intervene in natural processes and a dependence on these same processes for the efficacy of such actions. What we say and do would be meaningless if it did not fit into some antecedent structure or pattern established by natural processes, on the one hand, and into what we say about such doings which intervene in those processes, on the other. Our words and deeds are intended to express the meaning of what exists, if only because they give meaning to things as they now stand. In this sense, our words and deeds get their significance from being responses to contexts not wholly of our own making. What we say and do in such contexts can also aim beyond things as they now stand and sometimes does give expression to new meanings and values, as well as to unintended and as yet unrealized possibilities. In a word, our exercising of our finite freedom has worth and efficacy only by reason of our embodiment in a natural and cultural setting that is largely not of our own making, but this is a world that we seek to appropriate through our words and deeds—and our use of a productive imagination.\n\nRicoeur saw that this conception of the disproportion that characterizes human beings was insufficient to account for actual occurrence of a bad will and evil deeds. No direct, unmediated inspection of the cogito, like that he saw in Descartes and Husserl, can show why these evils, contingent as each of them is, in fact came to be. Recognizing the opacity of the cogito in this respect confirmed his belief that all self-understanding comes about only through “signs deposited in memory and imagination by the great literary traditions” (Ricoeur, “Intellectual Autobiography”, in Hahn 1995: 16). This conclusion was a major motivator for his hermeneutic and, at the same time, “linguistic turn”.\n\nRicoeur next explored the problem of how then to account for the existence of evil and its possible solution in The Symbolism of Evil. There, he argued that we should consider how people have sought to come to terms with their inability to make sense of the existence of evil by using language that draws on the great symbols and myths that speak of its origin and end. This is language that conveys more than a single meaning, language that can always be understood in more than one way; hence it needs always to be interpreted. This study concluded by saying that philosophy must learn to make sense of such language and learn to think starting from it, something Ricoeur summed up in a famous phrase: “the symbol gives rise to thought” (The Symbolism of Evil, 1967: 247–57). If philosophy is to take seriously this lesson taught by reflection on the symbolism of evil, it has to take up the problem of the “fullness of language”. This means considering those uses of language that extend beyond a single word or sentence, as well as those which cannot be interpreted as simple logical propositions that say S is P. Like the primary symbols of evil‐stain, sin, and guilt—these are forms of discourse that can have more than one meaning. To make sense of the fullness of language, therefore, philosophy has to develop a theory of interpretation since actual discourse is not always, if ever univocal and its meanings do change over time when acts of discourse outlive the speakers and situations in which they were originally produced.\n\nIn working out this theory of interpretation in terms of a theory of language as discourse, Ricoeur saw that what he now called the hermeneutic field to which interpretations applied was itself divided internally between an approach such as that used in The Symbolism of Evil which sought to recover meaning that was assumed to be already there and what he now called a hermeneutics of suspicion, like that found in Marx, Nietzsche and Freud, which held that nothing ultimately means what it first seems to say. The rise of structuralism in the 1960s and 70s, drawing on developments in linguistics, contributed to this emphasis on suspicion by holding that it was an underlying impersonal structure or structures that gave rise to the apparent surface meaning. Structuralism also introduced the idea that the identifying of such underlying structures could count as a reductive explanation of any surface-level meaning. Ricoeur’s philosophical project therefore turned to showing that while structuralism could be incorporated as a method of inquiry—look for and learn from the proposed generative structures—it went astray when it proposed itself as a theory of objectivity without subjectivity, what Ricoeur called a transcendental philosophy without a transcendental subject. Over time, he came to see that this limiting of structural analysis to a method of interpretation can be shown to follow from the fact that structuralists always presupposed the surface meaning they were trying to explain away. Moreover, because they ignored time and discarded any notion of change, because the deep structures they discovered were understood to be static and atemporal, they could not really account for how structures generated surface meanings, that is, how one structure could change into a different structure.\n\nThis critique is found in the essays collected in The Conflict of Interpretations (1969) and in Ricoeur’s detailed philosophical reading of Freud, Freud and Philosophy (1970). Freud’s own philosophy, according to Ricoeur, turns out to be an archaeology of the subject meant to provide at a theory of culture (civilization and its discontents), but it lacks the required corresponding teleology of the subject that would allow for human creativity and a capable human being. These investigations reinforced Ricoeur’s view that there is no unmediated self-understanding, leading to a turn to a more dialectical method in his work. This is an approach through which he seeks to find the middle term that can mediate between two polar terms and allow us to move back and forth between them. Locating such a mediating term leads to enhanced understanding. This understanding always comes about through interpretation but is also itself open to critique. In other words, for Ricoeur hermeneutics works with a method that mediates and negotiates rather than removes the conflict of interpretations.\n\nBesides recognizing the fruitfulness of structural analyses of particular well-defined fields of experience, Ricoeur resisted those structuralists and post-structuralists who sought to reduce language itself to a closed system of signs having no reference to anything outside itself. Following clues found in the works of Emile Benveniste and Roman Jakobson, he defined discourse as the use of such sign systems by someone to say something about something to someone, using existing but malleable phonetic, lexical, syntactic, and stylistic rules. That is, discourse always involves a speaker or writer and a hearer or reader as well as something said in some situation about some reality, ultimately a world that we might inhabit. It follows that any interpretation of a form of discourse requires both the objective sort of analysis for which structuralism provides a tool and an acknowledgment that there is always a surplus of meaning that goes beyond what such objective techniques seek to explain. There is a surplus of meaning because we apply objective techniques to things we already understand as having a possible meaning without fully exhausting that meaning. The meaning of acts of discourse is moreover always open to new interpretations, particularly as time passes and the very context in which interpretation occurs itself changes.\n\n3. Interpretation and the Fullness of Language\n\nOn this basis Ricoeur’s work after The Conflict of Interpretations addressed a number of related topics. On one level, he explored the practice of methods of interpretation as an arc leading from an initial situation and understanding to broadened understanding, both of the interpreter and the world as a world we can imagine ourselves as inhabiting. On a second level, he explored the broader notion of the fullness of language through investigation of different forms of extended discourse. These are uses of language that are longer than a single sentence and whose truth and meaning is not simply reducible to the sum of the truth values of the individual sentences which make up such extended discourse. On the basis of these two interwoven levels, he could also take up the questions of selfhood and responsible human action, allowing him to spell out in greater detail the ethical theory that had always been implicit in his philosophy. His discussion of ethics starts from a focus on person to person relations, the self and just one or only a few nearby others, characterized in the best case by solicitude for the other person and the possibility of friendship, then subsequently moved on to the question of justice and living with others beyond those we may meet every day or face to face. Here the question of rights and respect for the faceless other arises. The specific question what is a just relation in such situations (The Just, 2000; Reflections on the Just, 2007), developed out of Ricoeur’s participation in a seminar for judges, and led to his reflections in the last work published during his lifetime on the idea of mutual recognition (The Course of Recognition, 2005). In those final years, he also continued to explore other dimensions of the fullness of language, for example, through some significant essays on the notion of translation as occurring not just between languages but also within them (On Translation, 2006).\n\nRicoeur’s investigation of practices of interpretation did not propose a single general theory applicable in each and every case. His approach was rather to formulate his theory of discourse as a use of language meant to say something to someone about something using examples of such discourse and their interpretation. But language as spoken is ephemeral, it disappears. Ricoeur’s genial insight was to turn to examples that fixed such discourse by inscribing it in texts or what might be treated as analogous to a text. The event of speaking might disappear but the text remains for anyone who knows how to read. Hence it is the meaning of the text rather than the original author’s intention or the originating situation that becomes the object of interpretation. Structuralism was correct that texts have a structure. But this structure varies depending on the kind of discourse inscribed in the text, so discerning that structure and how it contributes to shaping that discourse helps one identify the discourse as being of a certain type or genre. Initially recognizing this genre is something like a guess that has to be confirmed through interpreting the text, but a good reading also opens interpreters to being questioned about their initial assumptions by the text in question. What one discovers through such investigations, Ricoeur believed, is that there is something like a world of the text that lies not behind the text but metaphorically in front of it as something to be explored by the interpreter’s imagination. This is a world that we can think of ourselves as inhabiting. Interpretations, of course, need to be checked against and challenged by other interpretations and they will sooner or later need to be redone as situations change over time. So there is a possibility of both internal and external critique: is a text coherent in terms of its generic form, can it be confirmed or falsified by other similar documents or subsequent data? Explanatory techniques also play a role, particularly when understanding breaks down. In a nice turn of phrase, Ricoeur liked to say one then seeks to explain more in order to understand better. He also agreed with Hans-Georg Gadamer’s theory of hermeneutics that what is finally at stake in interpretation is a kind of appropriation, although Ricoeur saw this as more oriented to action in the present than to what Gadamer called the appropriation of tradition, although tradition always did have a role to play, even when criticized or rejected. He agreed with Gadamer, moreover, that the goal of interpretation was to enable us to make sense of our embodied existence with others including our predecessors and successors in the world.\n\nRicoeur did not produce a general theory of interpretation. His reflections on hermeneutics were themselves an instance of the philosophical practice of interpretation leading to insight into what ultimately underlies and enables such activity: the need to interpret in order to make sense of human life; the move from an initial understanding to greater understanding on the basis of critical reflection and an appeal to the imagination; interpolating explanatory techniques and procedures where understanding breaks down; appropriation of the meaning of discourse in terms of the world it projects, as a world one might inhabit. And finally: increased self-understanding.\n\n4. Forms of Extended Discourse\n\nRicoeur examined a number of different forms of extended discourse, beginning with metaphorical discourse. Like the talk about symbols he had explored earlier a live metaphor is a kind of discourse that says more than one thing at the same time. Live metaphors are the product of sentences, not the result of substituting one word for another for decorative or rhetorical effect. They presuppose a kind of odd predication, a “metaphorical twist”. Unlike propositions which say something is or is not the case, a live metaphor says “is” and “is not” at the same time, leading possibly to a redescription of reality. As creative instances of the use of language, live metaphors can die and be absorbed into the dictionary (a watch runs). Live metaphors can also extend beyond a single sentence as in the case of poetic discourse. Poetic discourse is thus a use of language that redescribes reality. Its truth is more a matter of manifestation than of coherence or correspondence with what is assumed to be external reality. In an important sense, this experienced truth is the basis for talk about coherence and correspondence, yet paradoxically metaphorical discourse always presupposes an already existing language that it can make use of. In this sense, we are never at the origin of language. We can question back toward this origin but never reach it, since we always must begin by making use of existing language to question language. Philosophers of the fullness of language therefore always begin as having already begun.\n\nNarrative discourse is another form of extended discourse investigated by Ricoeur. It is a use language that allows us to make practical sense of human action and time. Ordinary language already contains concepts that apply to action—those of intentions, motives, causes, reasons, acts, consequences, agents and patients, for example—just as it contains concepts applicable to time: past, present, future, now, then, when. Narrative discourse configures such heterogeneous concepts into a discourse that locates actions in a time where one thing happens not just after something else but because of something else in a followable story or history. It refigures physical events as narrative events, events which make sense because they tell what happens in a story or history. But because narratives have endings or must end, they never fully exhaust time or the possible long-term meaning of action. Through their plots they are always a synthesis of heterogeneous concepts into a kind of discordant concordance which configures the episodes of the story into a told story. In so doing they resolve practically if not theoretically the conflict between time understood as a lived now—this present which has a past and a future—and cosmic time conceived of as a sequence of points, where any point can be a now point defined not in terms of its past and future but merely in terms of points that come before and after it. Narrative interweaves these two perspectives on time into human time without ever fully resolving the aporias raised by thinking about time in time.\n\nReligious discourse, at least as found in the Hebrew and Christian biblical tradition takes many forms: hymns, laws, narratives, parables, prophecy, wisdom sayings. What they have in common that specifies them as religious discourse is that they are all forms of poetic discourse and they all in their own way “name” God. Within their setting within the biblical canon they do so through their constituting a polyphony that enables the religious traditions that use these texts both to identify and to legitimate themselves through a kind of hermeneutic circle. That is, such texts are sacred to traditions which take them as legitimating the tradition founded on these texts, through their reading and interpreting of such texts.\n\nPolitical discourse is a particularly fragile form of extended discourse since the political dimension of human existence is one realm among others like commerce or the arts and also the one that contains all the others. It is an especially rhetorical form of discourse in the sense of being discourse that aims at persuasion. Persuasion is necessary because there is no final resolution of the conflicts that can arise over questions about the best form of government or whether there should be, say, a law, what that law ought to be, or whether laws are required in this case at all. That politics also is about power, the power to make decisions and command others adds to the fragility of such discourse in that politics is always based on a revocable willingness to live together. This leads to a dialectic of ideology and utopia in Ricoeur’s political philosophy. Ideologies both claim to legitimate the positions of those in power or those seeking power and cover the gap between what they assert and the way things actually are. Utopian thinking, in return, imagines a world without or beyond ideology. It sometimes enables people to overthrow particularly ruinous forms of ideology, only to fall back into a dependence on ideology since utopia exists “nowhere”. Yet politics is necessary because it makes possible life together. That it always takes place between these two poles of ideology and utopia is another example of a mediating term between opposed poles in Ricoeur’s hermeneutics.\n\n5. Narrative Identity and the Turn to Selfhood\n\nAt the end of his three volume study of narrative (Time and Narrative, 1984–88) Ricoeur realized that what was said there pointed to the importance of the idea of a narrative identity. This has to do not just with the identity of the characters in a story or history, but with the larger claim that personal identity in every case can be considered in terms of a narrative identity: what story does a person tell about his or her life, or what story do others tell about it? In effect, narrative identity is one of the ways in which we answer the question “who?” Who is this? Who said that? Did that? Who is that? Who are we? In his 1986 Gifford Lectures (published as Oneself as Another, 1992) Ricoeur expanded this investigation to the broader question of what it is to be a self. This discussion was meant to reply to interpretations of the Cartesian cogito which either made it too strong (one can immediately be in touch with the self as certain of itself) or too weak (a merely abstract truth) or even said the self does not exist. Against this latter idea of a “shattered cogito” Ricoeur proposed a hermeneutics of selfhood and a “wounded cogito”. This was the idea and reality of a person capable of attesting to his or her own existence and acting in the world, a self that both acted and was acted upon who could recount and take responsibility for its actions. Insofar as we can speak metaphysically of such a self it has to be in terms of act and potentiality rather than substance.\n\nRicoeur’s argument regarding selfhood proceeds through a sequence of stages. He begins from the philosophy of language and the question of an identifying reference to persons as selves, not simply things. This leads to consideration of the speaking subject as an agent, passing through the semantics of action Ricoeur had learned from analytic philosophy during his time in North America. Next comes the idea of the self as having a narrative identity which is then is followed by the question of the ethical aim of being such a self. This hermeneutics of selfhood culminates in the conclusion that one is a self as one self among other selves, something that can only be attested to through personal testimony or the testimony of others. Selfhood is thus closely tied to a kind of discourse that says “I believe-in”. Its certainty is a lived conviction rather than a logical or scientific certainty.\n\nAlong the way Ricoeur to this conclusion introduces a key distinction between two kinds of identity in relation to selfhood. Idem identity is the identity of something that is always the same which never changes, ipse identity is sameness across and through change. Self-identity involves both dimensions: I am and am not the person I was ten years ago. It is the existence of ipse identity that indicates that a self is better thought of in terms of the question “who?” than in terms of the question “what” is a self.\n\nSince the self is an agent the question of its ethical aim arises, allowing Ricoeur to introduce what he calls his “little ethics”. This introduces new predicates for the self and another path toward the self, one that shifts the argument from description toward prescription. Ricoeur presents this little ethics through what he calls its ethical intention: “aiming at a good life lived with and for others in just institutions” (Oneself as Another, 1992: 172). This formula indicates that there is a priority of ethics (understood as teleological) over morality (understood as normative practice). In fact, the structure is threefold: the ethical aim has to pass through the sieve of the norm, which is meant to realize the ethical intention, to be applied in specific situations on the basis of phronesis or practical wisdom that will apply the norm appropriately. It is also possible to read the sequence backwards: for example, when a disaster, say a new disease, leads to new normative practices growing out of the response to it, thereby throwing new light in turn on the ethical intention. At the level of relations between a self and nearby or intimate others, the ideal of reciprocity entailed here is best expressed as solicitude that enables both self-esteem and self-respect on the parts of those involved. At the level of the distant other or others, the question of justice arises and with it new notions of respect and of institutions such as the rule of law that establish and help maintain or restore a just distance between those involved in them. Underlying both levels is the idea expressed by the golden rule that one ought not do to others what one does not want done to him- or herself. And beyond every institutionalized system of rules lies the transformative possibility of love which transcends the fragile and provisory practical meditations established by every ethical system through applying and, if necessary, reinterpreting the golden rule. Love is a way of responding not just to the limits of any such system but to the tragic dimension Ricoeur sees as inherent in all human action, which never fully achieves what it intends, another reminder that human freedom is always a finite freedom.\n\n6. Memory, History, Forgetting\n\nAll these threads in Ricoeur’s philosophy come together in Ricoeur’s last big book (Memory, History, Forgetting, 2004) pointing to the final revised lectures on recognition. This three part work first takes up the question of memory and recollection in response to questions about uses and abuses of memory in contemporary society. Ricoeur lists these as occurring on a pathological-therapeutic level as the problem of blocked memory; on a practical level as manipulated memory, and on an ethical-political level as obligated memory. He then asks whether history is a remedy for or a hindrance to these problems. This leads him back to the question of the epistemology of historical research and writing, a topic he already had addressed in History and Truth (1965) and Time and Narrative. Now the question is to what extent history depends on memory. Historians know more about the past than individuals remember, but can history completely break with an appeal to memory as a kind of testimony? I was there, believe me. The problem here is suspicion not simply falsification. What is new to Ricoeur’s account is that he sees at work a closer tie between explanation and understanding than he had considered in his earlier work where explanation aids understanding. He now speaks of what he calls explanatory understanding. It runs through what, following the French historian Michel de Certeau, he now calls the historiographical operation that characterizes the whole process of historical documentation, research, and writing. This shift in Ricoeur’s thinking leads him to consider the question of historical representation as an image based on both narration and rhetoric. History as written, he suggests, “stands for” the past as “having been”.\n\nOn this basis, he can again ask about human existence as historical, as being within time and ultimately uncanny. He seeks particularly to address the problem of forgetting in relation to the three problems listed earlier. Traces of the past can be lost, and that past will be forgotten in the sense of being beyond memory. But what of forgetting where the traces remain? Here is where the problems of blocked, manipulated, or commanded memory remain, especially in the latter case with attempts to order forgetting either through amnesty or censorship. This problem leads to an epilogue on the possibility of forgiveness, something Ricoeur admits is left incomplete. Along the way though, he shows that the idea of guilt, historical guilt necessarily runs up against the limit of the imprescriptible and that forgiveness, which is difficult but not impossible, is something like a gift, one that unbinds the agent from the act. Beyond the distinction of a happy memory and an unhappy one in other words lies the possibility of a forgetting held in reserve. To forgive is not to forget. It is this idea of forgiveness as a gift, but not one requiring or expecting a gift in return but as something received and passed on as a second gift that leads the discussion of mutual recognition and states of peace in Ricoeur’s last book, The Course of Recognition.\n\nRicoeur’s argument there starts from the surprising fact that there has been no recognized theory of recognition similar to what exists for theories of knowledge. In fact, when he looks in the dictionary he finds that the word (which in French carries as strong a sense of gratitude as of what English calls recognition), the word has numerous lexical senses. Ricoeur therefore proposes to construct a chain of conceptual meanings that runs from recognition in the active voice to its use in the passive voice, to being recognized. The demand for recognition that runs through this sequence can only be answered, he claims, by mutual recognition, “where this mutual recognition either remains an unfulfilled dream or requires procedures and institutions that elevate recognition beyond the friendship of face-to-face relations to the political plane” (The Course of Recognition, 19). This sequence of concepts of recognition runs from identifying something to identifying oneself to recognizing and being recognized by others. In the process the concept moves away from simply being identified with knowledge. Instead it opens the way to knowledge as it relates to self-knowledge and genuine community for which one is and can be grateful in that recognition “lightens the weight of obligation to give in return and reorients this toward a generosity equal to the one that led to the first gift [of being recognized]” (243)."}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-3-319-32979-6_30", "page_content": "Early Studies\n\nAs mentioned above, Waddington did not have the chance to pursue a career in genetics and instead turned to embryology. Nonetheless, Waddington did not approach embryology merely for reasons of employability. His dissatisfaction with the standard view that posed “preexisting forms of organization” (Waddington 1959a: 2) as explanatory of the regularity of developmental patterns, along with his previous experience with J.B.S Haldane, brought him more closely to the study of the chemical conditions behind the processes of differentiation and organization that characterize the development of an organism (see Speybroeck 2002). Given that developmental processes apparently “[emerge] from an initially homogeneous material in which no pattern is present to begin with” (1959a: 2) – and that Waddington had discarded as questionable the hypothesis of an order “imposed from the outside” (1959a: 16) – he moved to examine the hypothesis that organisms do, in fact, possess the resources to direct the differentiation and organization of their own development. It is this hypothesis that set the guidelines for his first decade of research in experimental embryology, and that led to his well-known collaborations with Spemann, and subsequently with the Needhams and Brachet.\n\nBy the time Waddington approached Spemann, in 1931 (Waddington 1961: 58), the foundations for the mechanics of development had already been sketched by the German embryologists during the previous decades. Spemann was convinced that the emergence of developmental patterns could be traced back to particular physical regions of the embryo which he labelled “organization centers.” According to Spemann, these regions acted as chemical inducers, causing a change in other physical regions in their proximity and thus influencing the development of the undifferentiated egg. As Waddington later reported, “the organiser was named as such because it appeared the mesoderm imposed on the reacting ectoderm a certain pattern; the mesoderm appears to determine that the forebrain appears here, the hindbrain there and the neural tube in a certain position. You get a complete orderliness in the body, which appears to be imposed on the ectoderm by the mesoderm” (1959a: 18). In the years that followed, Waddington’s experimental work at Spemann Lab did, in fact, confirm Spemann’s hypothesis, generalizing his findings beyond amphibians, to chick and rabbit embryos. These experiments led Waddington to extend the mechanics previously sketched by Spemann toward a “less superficial examination” (1959a: 18) and eventually to provide a novel and richer interpretation of the interplay between the inducing role of the organizer and the resultant effect in the cytoplasmic environment.\n\nAs mentioned before, Waddington received primary education in philosophy at an early age, focusing in particular on the works of Whitehead. He did not fall prey to the obscurities of the metaphysics in Process and Reality (1929). He instead came to the realization that scientific work could not be taken apart and interpreted in isolation from a scientist’s metaphysical beliefs; these were not “mere epiphenomena but (things that) have a definite and ascertainable influence on the work he produces” (Waddington 1969: 72). As he himself later reported, “I am quite sure that many of the two hundred or so experimental papers I produced have been definitely affected by consciously held metaphysical beliefs, both in the types of problems I set myself and the manner in which I tried to solve them” (1969: 72). In fact, anticipating trends in the metaphysics of science that only very recently emerged in the philosophical literature, Waddington adopted a toolbox approach to metaphysics (French 2018), shaping Whiteheadian insights to fit the relevant embryology.\n\nWaddington’s experimental results obtained at the Spemann Lab, and through his collaboration with Brachet, Joseph and Dorothy Needham (1932–38), suggested that differentiation could not be a matter of chemical induction only, because the relevant processes bringing the embryo from an undifferentiated homogeneous lump of matter to a differentiated whole often involve the causal role of the organizer combining with the products of its inducing action. While Spemann focused on the biological property of organization as a capacity to induce differentiated stages, Waddington focused on organization as the complex result of the inner capacity of organic matter in the cell to both act and react to specific (inducing) signals. The organizer was not, according to the young embryologist, the only causal condition for the emergence of developmental patterns. Instead, ready-to-be-induced biological regions possessed specific competences, or potentials, to react to inducing signals – dubbed evocation (Waddington 1961: 58–59) – by dynamically exhibiting phases in which a region “switches into one or other of alternative pathways of further change” (1961: 62–63). Nevertheless, at the time, there were no explored theoretical alternatives in biology to the causal reductionism adopted wholeheartedly by Spemann, among others. Waddington remedied this by performing one of the most exciting syntheses between science and metaphysics in the history of science – a synthesis that rightfully places him among the forefathers of contemporary works in metaphysics and biology (Nicholson and Dupré 2018). He put forward an explanation of development in interactionist terms, where causation was understood in terms of mutual, simultaneous interaction – rather than an asymmetrical, linear relation – and where its products were to be interpreted as the result of co-constructive processes between networks of genes and their cytoplasmic environment (see Fabris 2018).\n\nThe insertion of Whiteheadian metaphysics was revealing of his experimental results and eventually led to a renovated formulation of the classical embryological notions of competence, induction, individuation, and determination, in terms of a broader theoretical framework connecting genetics and embryology (Gilbert 2000). This framework contained the germs of early cybernetic theory, and anticipated, by almost a century, novel insights in the metaphysics of causation (see, e.g., Mumford and Anjum 2018) and niche construction theory (see chapter “Evo-Devo and Niche Construction”). This revolutionary investigation kept Waddington busy for many years beyond the decade mentioned above, during which he deepened and articulated his new Diachronic Biology, in which embryology, genetics, and evolution “formed a group whose interconnections are obvious and unavoidable” (in Wilson 1925: 1056) and that culminated with the publication of Organisers and Genes (1940). From the early 1940s onwards, Waddington relentlessly pushed biology to the verge of an intellectual revolution so far-reaching that it ended up shaping the future of the discipline. It was the birth of epigenetics.\n\nThe Rise of Epigenetics\n\nIt is tempting, from a contemporary perspective at least, to read into Waddington the intention to provide a fully formed new theory of biology right from the start. This would be misguided. The intellectual route that led to the formation of epigenetics was, like Waddington’s career, varied and eclectic, and yet not random. It was paved by his work on the notions of canalization of development and genetic assimilation which, in turn, built upon the interactionist framework cultivated during his doctoral studies. Waddingtonian epigenetics can be understood on the basis of these two main theoretical components.\n\nThe canalization of development is first and foremost an explanatory account of developmental change. According to the orthodox view of the time, mainly advanced by the architects of the Modern Synthesis, developmental changes were to be explained in preformationist terms: the organism was thought to change through time by unfolding and manifesting features already codified in the genome (Oyama 2000; Lewontin 2000). The biological whole that was the organism was thus reduced to a mere epiphenomenon of its genes (Gilbert and Sarkar 2000). On the contrary, Waddington’s early interactionism centered on the reactive role of the genetic products, in relation to both the external and the internal environment (see also Peterson 2016).\n\nBuilding on his renovated embryological notion of competence, Waddington suggested that at each stage of development, the organism’s competences progressively undergo modification, restricting the possible differentiation outcomes, that is, the possible phenotypes. In Organisers and Genes (1940), Waddington referred to this phenomenon of the constraint of competences as the canalization of development. We now know that the term is much older than Waddington, as it is rooted in the metaphysics of Bergson (1911) and Whitehead (1929: 129; see Peterson 2016). Waddington’s usage of the term, however, is an exquisite example of the toolkit approach to metaphysics recently discussed by French (2018).\n\nAlso in Organisers and Genes (1940), he put the notion of canalization to work in the explanation of the stability of developmental patterns in the face of atypical perturbative conditions. Although Waddington’s experimental results suggested evidence of the reactive role of genetic products, these reactions were clearly not running amok; they instead seemed to be characterized by constancy of some kind. To explain how an organism in the course of its development produces stabilized, repeated phenotypic end-states across a population, Waddington offered a novel model for developmental compensation. This model firstly took the form of a pictorial representation – with the help of his friend and artist John Piper – and secondly – with the help of his friend and topologist René Thom – in mathematical terms, as a multidimensional vector field with time-extended attractors (Waddington 1968: 166–169). The model in question is the famous epigenetic landscape. The landscape is depicted as a system of valleys and pits where the formed pathways represent the connections between a cell in its undifferentiated cytoplasmic state, and its final, fully differentiated state (Waddington 1961: 64). Each route, dubbed a chreod (Waddington 1957, 1977: 105), represents one possible course for the manifestation of a developmental potentiality, achieved by the restriction of competences, the full range of which dubbed the chreodic profile (Waddington 1957, 1961).\n\nBy the time Waddington coined the term “canalization” in 1942, the idea of mutual causation in biology was already getting a foothold in the field, mainly thanks to a new theoretical movement now well-known as organicism, whose members, like Waddington, sought to promote a nonreductive, post-Darwinian understanding of development (Nicholson and Gawne 2015). Unsurprisingly, Waddington was active in the movement and contributed to its expansion, strengthening the conviction that organismic persistence was inherently and irreducibly adaptive. The epigenetic landscape model served its purpose in sparking debate, becoming a popular topic of discussion both within and to some extent outside the movement. However, what was meant to be, at least initially, a heuristic for understanding the complex interplay between networks of genes and their products, developed into a more complete, and contentious, theory as it started to spread outside the den of neo-Darwinian thinking.\n\nIt was only by bringing evolution into the picture that Waddington’s theory developed into a more mature and unified form, and yet it was met with some resistance. The idea of development exerting a directing control over evolution and inheritance was a natural extension of Waddington’s previous work, yet the general principles of neo-Darwinism famously opposed any active role of the organism in creating novel mutations. Mutations were understood in terms of random variation, the appearance of which was best explained by the causal action of natural selection affecting the frequencies of genes in a population with different types of mating systems. This view – also called the Mendelist-Morganist view of heredity (Jablonka and Lamb 2005: 28) – took genes as the units of selection, and interpreted evolution as a change in the genetic composition of populations (Dobzhansky 1951: 11).\n\nWaddington expressed his dissatisfaction with the Modern Synthesis in his Paradigm for an Evolutionary Process (1969), among other works. To see how development exerted a directive influence on both inheritance and evolution, one had to overcome the “simplistic” synthetic interpretation of the genome as the only instructor of development (1969: 107). The manifestation of new traits was instead rooted in the whole, time-extended, developmental system that, as a unit of development, actively reads and interprets the genome (Waddington 1968, 1969; see also Wilkins 2008). Waddington extended his notion of canalization to indicate the general capacity of all developmental systems to produce normal phenotypes despite genetic and environmental perturbations (Waddington 1940, 1975). Phenotypes, according to Waddington, are not the mere display of genetic information but rather the result of a compensatory epigenetic process, dubbed homeorhesis (1977), that guarantees “continual change along certain pathways” (1977: 195). While canalization – now understood as a developmental property of the organism as a whole – “acts to ensure that the system goes on altering in the same sort of way that it has been altering in the past, [homeorhesis] ensures the persistence of a given type of modification” (Waddington 1977: 105). It is this balance between the robustness and the plasticity of the system that instructs development and explains the process of the assimilation of acquired characters in a post-Darwinian way. The process by which “phenotypes’ responses to environmental stimuli can be incorporated into the genotype through a process of selection” (1975: 59), Waddington labeled genetic assimilation (see chapter “Canalization: A Central but Controversial Concept in Evo-Devo”). Critical for the confirmation of his novel view were Waddington’s experiments on Drosophila melanogaster, whose results are discussed at length in “Genetic Assimilation of an Acquired Character” (1953), “Genetic Assimilation of the Bythorax Phenotype” (1956), and “Canalization of Development and Genetic Assimilation of an Acquired Character” (1959b). By inducing stress on Drosophilae, first in the form of heat shock on pupae (1953), then in the form of ether on larvae (1956), and finally using salt (1959b), he was able to observe phenotypic variation in heterogeneous lines. He then demonstrated that these phenotypic traits, if selected for a certain number of generations in the presence of the same stress, could be inherited through the germline (Piacentini et al. 2014), and therefore could appear again even in the absence of the original environmental inducer (1975: 59). Waddington interpreted acquired characters – in line with the Modern Synthesis – as concealed or hidden behind the robustness of canalized paths (1977). However, in contrast with the Synthesis, he interpreted the acquired characters as adaptive resources that the developmental system uses to control phenotypic changes. The organism is then active in changing the epigenetic landscape toward the formation of new chreods, thereby fostering new developmental possibilities (1975: 73). According to Waddington the developmental system selects genes from a highly variegated gene pool: it develops under their influence, expressed together with a heterogeneous environment. At any given stage of its life history, the ways its genes and its previous environment have acted up to that point have considerable effect on which inducing signals can further affect the system (1961).\n\nThe Modern Synthesis views on the extreme reduction of phenotype to genotype, and the complete randomness of evolutionary novelties, were, for Waddington, at the root of its theoretical limitations. And indeed, the Waddingtonian theory of the complex genetic regulation of developmental potentiality was at odds with the idea, promulgated by the architects of the Synthesis, of context-independent randomly generated mutations. In particular, it offended against the strict Weismannian separation between the soma and the germ-line (Jablonka and Lamb 2005). However, the critique that Waddington presented against the dominant scholarship of his time should not be interpreted as a radical fracture with it, but more mildly, as an extension of it.\n\nFirst, Waddington was not aiming to replace the orthodoxy but rather to extend and enrich its explanatory power. As he nicely puts it, “supposing that at any time we become possessed of a complete scientific explanation of the process of evolution, as that is brought about by natural selection acting on gene mutations, for instance: we shall not then be justified in taking this as a complete general explanation of evolution” (Waddington 1929: 66). Second, Waddington’s view on inheritance was in fact significantly different from other scholars, such as Lamarck and Baldwin. Lamarck, more than a century before Waddington, proposed an explanation of evolutionary novelties in terms of acquired characters. However, Lamarck insisted that the environment exerts a direct causal action on the phenotype. By contrast, Waddington maintained that selective pressures only contribute to, instead of exclusively determine, heritable modifications (1959a, 1975). Phenotypes are not in fact reshaped continuously by environmental stimuli, as the Lamarckian approach would entail, but exhibit an invariance whose explanation could not be satisfactorily provided by modelling inheritance as a solely gene-environment affair (1961). On the other hand, neither was Waddington in agreement with Baldwin. According to Baldwin’s theory of Organic Selection, the capacity of the organism to respond to environmental stimuli was not under genetic control (Baldwin 1896; see also Loison 2018). However, Waddington was not looking to reject the role of the genome in inheritance. Instead, according to his theory, the network in which genes are organized plays a prominent role in the regulation of the effects of the local inducing signals on the developmental system (1957).\n\nIt is also important to stress that Waddington’s aforementioned synthesis between embryology, genetics, and evolution was also simultaneously and independently developed by Schmalhausen (see chapter “Ivan I. Schmalhausen (1884–1963)”). In his Factors of Evolution (1949), Shmalhausen attempted to reincorporate embryology within the Modern Synthesis and to stress the relevance of embryology and the role of the interactions between heredity and environment in producing the phenotype. Like Waddington, the Russian zoologist and evolutionary biologist proposed a similar concept of canalization that he called “autoregulation” (1949) and hypothesized a mechanism that explained the process of genetic stabilization, that is, how physiological induction could be transferred to embryological induction. However, despite the superficial similarities, in Waddington’s own admission, Schmalhausen “did not formulate in any precise form the process which has been referred to genetic assimilation” (Waddington 1975: 75). According to Waddington, the type of explanation of the inheritance of acquired characters provided by Schmalhausen was in no way different from the Baldwin Effect and rather far-off his novel approach. The fundamental difference among the two syntheses was recognized by Dobzhansky, who favored Shmalhausen’s work over Waddington’s one because he considered the former “more suitable and better able to be integrated into the Modern Synthesis” (see Gilbert 1994: 153).\n\nWaddington cannot be legitimately grouped together with Lamarck, Baldwin, or Shmalhausen; nor with Dobzhansky and Morgan. His unique understanding of the organism brought to attention the importance of the phenotype as a core explanatory element of the evolution of developmental systems. It laid the foundation for a renovated version of his earlier Diachronic Biology, a cutting-edge new field of research “that studies the causal interactions between genes and their products which bring the phenotype into being” (1968: 10). It was during the experiments that led to this novel view that Waddington coined the term epigenetics, “the causal study of embryological development” (1957:13). Under this theory, the canalization of development provided the ground for the contemporary understanding of robustness as the organismic ability to actively restore stabilized developmental pathways in the face of perturbations. Waddington’s epigenetics provided a pioneering understanding of organisms as active agents capable of modifying their adaptive responses by adjusting their reactivity to external and internal inducing signals, again anticipating by almost a century later trends in evolvability studies (see chapter “Variational Approaches to Evolvability: Short- and Long-Term Perspectives”)."}, {"url": "https://plato.stanford.edu/entries/cudworth/", "page_content": "First published Fri May 7, 2021\n\nCudworth’s written output was substantial, but much of it was never published and his philosophical system is incomplete. Broadly, his philosophy combines Platonist ethics and metaphysics with an atomist natural philosophy. He is chiefly remembered for his epistemological nativism, and his ethical idealism. Distinctive elements of his philosophy include his theory of consciousness and unconsciousness, his conception of freewill as a power of self-determination, and his causal hypothesis of what he called the “plastic power of nature”. The immense humanist learning which fills his published writings has tended to obscure his achievements as a philosopher in post-humanist times, but it did not prevent him from having a considerable legacy in eighteenth and nineteenth-century philosophy.\n\nThe English philosopher, Ralph Cudworth (1618–1688) defies classification within customary categories of the history of philosophy. At a time when mainstream philosophers announced their modernity by breaking with the past, Cudworth is a figure of continuity, steeped in ancient philosophy, yet abreast of contemporary philosophy and science. He shared the anti-scholastic agenda of self-styled modernisers like Bacon, Hobbes and Descartes, with whose philosophy he engaged, but framed his most original ideas by recourse to antiquity. Cudworth is usually regarded as a Cambridge Platonist, though he himself would not have recognised the label. Although he is normally classified as a rationalist, it has become increasingly apparent that this designation is based on too limited a view of his philosophical writings.\n\n1. Life and Works\n\nBorn in Aller, Somerset, Cudworth was educated at Emmanuel College, Cambridge, where he was elected to a fellowship in 1639. His academic career at the University of Cambridge advanced during the upheavals of the English Civil War: he was appointed as Master of Clare College (1645), Regius Professor of Hebrew (1645), and Master of Christ’s College (1654). Although associated with the interregnum regime, he retained both his college and university appointments at the restoration of the monarchy in 1660, remaining in post in Cambridge until his death in 1688 (Pailin 2020). His daughter, Damaris, Lady Masham, who became a close friend of John Locke, was the only one of his children to follow in his footsteps as a philosopher.\n\nThe only philosophical work which Cudworth published in his lifetime was The True Intellectual System of the Universe (1678) (hereafter TISU). Two works were published posthumously: A Treatise Concerning Eternal and Immutable Morality (hereafter TEIM) in 1731 and Of Freewill (hereafter FW) in 1838. A substantial body of manuscripts on “Liberty and Necessity”, remain unpublished to this day, though these may have circulated in the seventeenth century. Prior to the publication of TISU, Cudworth’s philosophical ideas were known primarily through a handful of sermons, the most notable of which was the sermon preached before Parliament in 1647, which anticipates the Platonising outlook of his philosophical writings, and has come to be considered a classic for its message of peace and reconciliation.\n\nCudworth’s philosophical project was planned to be a tripartite work entitled The True Intellectual System of the Universe, of which only the first part was published. The constituent books of this never-completed project were to be\n\n“Against Atheism”, “Natural Justice and Morality founded in the Deity” and “Liberty from Necessity and a Distributive Justice of Rewards and Punishments” (TISU, Sig A34)\n\nThis division of the subject-matter corresponds to what he regarded as the essentials of both true philosophy and true religion, namely, the existence of God (that there is “an omnipotent, understanding being presiding over all…[which is] essentially good and just”), the real existence of the principles of morality which are grounded in divine goodness rather than divine will (that there is, “something in its own nature, immutably and eternally just, and unjust; and not by arbitrary will, law, and command only”), and the moral autonomy of human beings (“that we are so far forth principles or masters of our own actions, as to be accountable to justice for them”) (TISU A45). Cudworth explains the term “intellectual” in the title of this system as being intended distinguish it from astronomical theories or systems of the world. The term also indicates that his “system” is conceived along Platonist lines as the eternal, unchanging model or paradigm, of all things, the “intellectual system” being the intelligible realm which reveals the metaphysical framework of all existence. (In all likelihood Plato’s Timaeus, was the inspiration here). For Cudworth the system of nature is the intelligible product of divine intellect. His system is true both in the sense that it is philosophically true, and also because its philosophical principles are compatible with religious truth.\n\nTISU as published in 1678 is only the first of three volumes which Cudworth had planned to write with the same over-all title, but he defends it as a self-standing work. In it he seeks to provide an anti-determinist defence of theism against scepticism, atheism and materialism, and to demonstrate the compatibility of true philosophy with true religion. In so arguing, he probably had in mind the anti-atheist arguments of book X of Plato’s Laws. The last chapter, in particular, contains many, often extensive, arguments with his philosophical contemporaries (Descartes, Hobbes and Spinoza). TISU also broaches a number of epistemological and ethical themes which are more fully treated in the manuscript writings unpublished at the time of his death.\n\nTEIM (1731) was the first of Cudworth’s works to be published posthumously. It was probably originally intended as a propaedeutic to his unpublished writings on ethics. Although its title suggests otherwise, it is in large part a work of epistemology, containing the fullest treatment of nativist epistemology by any British philosopher of the seventeenth century. Following Plato, Cudworth argues that ideas and moral principles “are eternal and self-subsistent things”, pitching his arguments against the moral relativism and sense-based epistemology of Protagoras and Hobbes. Cudworth's enduring legacy in moral philosophy, and as a moral rationalist derives from this work (Raphael 1969, Schneewind 2003).\n\nFW (1838) is the only one of the three manuscripts on the subject of “Of Liberty and Necessity”, which were unpublished when Cudworth died. These are drafts for the planned third part of his system. Although these are by no means a complete draft of this, they show that Cudworth was attempting something new, by developing an anti-determinist moral psychology, the key features of which are his conception of free will as self-determination, his idea of the hegemonikon or ruling principle of the soul, and his conception of consciousness.\n\n2. Cudworth and the Philosophers\n\nCudworth’s legacy of bulky and incomplete writings, testifies to his comprehensive knowledge of both ancient, and contemporary philosophy. He subscribed to the Renaissance view of philosophy as philosophia perennis (perennial philosophy), which presupposes a single timeless core of philosophical truth, which is the shared goal of both ancient and modern philosophical enquiry. Heir to the Renaissance Humanist recovery of almost the entire corpus of ancient philosophy known today, his recourse to antique learning, especially the philosophy of Plato and Plotinus, but also Stoicism, is in many ways a typically Humanist move to ground authority in the tried and tested wisdom of ancient philosophers (Aspelin 1942, Sellars 2011). However, he turned to ancient philosophy, especially Greek philosophy, as a fund of pre-scholastic philosophical ideas and the source for a new conceptual vocabulary. As one of the first to write philosophy entirely in English, he coined many new terms, many of them adapted from Greek. Some (e.g., autexousion, antitypous) have not stood the test of time, while others (e.g., “Cartesianism”, “self-determinism”, “consciousness”) are common currency in English philosophy to this today. At the same time, his philosophy was deeply influenced by contemporary philosophy, especially Cartesianism (Passmore 1951, Sailor 1962). He had high regard for Descartes as “an acute philosopher” and his philosophy registers the impact of Descartes in multifarious ways. He admired Cartesianism as system of philosophy combining physics with metaphysics, which posited both corporeal and incorporeal substance. He accepted clear and distinct perception as the criterion of epistemological certainty, and the Cartesian account of sense perception. Sensation, for Cudworth, as for Descartes, is a “passion” of the soul, at best a confused perception (TEIM, 85). He embraced both the idea of consciousness and the idea of God as a fully perfect, self-existing being, and adopted Descartes’s conception of body as inert extension. However, he was highly critical of Descartes on many counts. He denied that mechanical rules of impact were sufficient to explain natural causality and criticised Descartes’ repudiation of final causes. He critiques Descartes’s proof of the existence God “from his idea” as circular (TISU, 717) and his voluntarist conception of God as conducive to scepticism. He rejected Descartes’ machine-model of animals and denied that conscious cogitation exhausted the properties of immaterial substance.\n\nCudworth’s critique of Hobbes is the most extensive and philosophical of contemporary responses to Hobbes, whom he attacks as an atheist materialist (Mintz 1962, Zarka 1997). He accuses Hobbes of “villanizing of human nature”, and treating morality is a matter of convention. He attacks his natural law theory as merely “artificiall justice” without foundation in natural goodness, charging that Hobbes’s negative conception of human nature renders civil government a necessary evil, void of true justice. He regarded Hobbes’s natural philosophy as a paradigm case of deterministic materialism. And he attacked Hobbes’s mechanistic account of mental operations, arguing that if all mental activity reduces to matter in motion, we could never stop the flow of thoughts, focus our minds on anything, or direct our attention. The fact that we can do so tells against Hobbesian psychology and confirms the agency non-material powers.\n\n3. Atheism & Materialism\n\nCudworth’s main published work, TISU, consists in large part of a critical survey of philosophy, in which the philosophers of antiquity and some moderns (principally Descartes and Hobbes), are classified according to the degree to which their philosophy correlates with theism or atheism. As such it constitutes a consensus gentium defence of the naturality of the idea of God to all mankind, in which pagan polytheism is presented as corrupt forms of monotheism, and atheism explained as a failure in philosophical reason. Cudworth identifies four categories of atheist: Hylopathian (materialism), “Atomical or Democritical” atheism, Cosmo-plastic atheism (according to which the world-soul is the highest power), and Hylozoist atheism (which attributes life to matter) (TISU, 165). These have their latter-day manifestations in philosophers such as Hobbes (an example of a Hylopathian atheist) and Spinoza (a latter-day Hylozoist). The final chapter of TISU, which takes up a third of its almost 900 pages, attempts a comprehensive survey and refutation of atheistic arguments, which are grouped under fifteen subsections. Cudworth also targets what he sees erroneous forms of monotheism which misconceive the deity by emphasising divine power and will at the expense of divine goodness and justice. Such voluntaristic conceptions of God have far-reaching and destructive implications for both philosophy and religion, since such a God could, by arbitrary fiat, decree falsity to be true, and wrong to be right, resulting in false philosophy with atheistic implications.\n\nThe taxonomical structure of TISU, is such that it may be regarded as a history of philosophy, or compendium of the arguments of the philosophers of antiquity—which is one reason why Locke recommended it (Locke 1693 [1989: 247]). But to interpret the book merely as a compendium of the arguments of other philosophers is to miss the essentials of Cudworth’s metaphysics and natural philosophy embedded in its heavily annotated pages, which reveal the Platonist core of his philosophy. Central to Cudworth’s metaphysics is the Platonist principle that mind is “first in the order of nature”. Thus mind precedes the world and stands in causal relation to it: “knowledge is older than all sensible things; mind senior to the world, and the architect thereof” (TISU, 847–8). The mind in question is the mind of God, which “containeth its immediate intelligibles within it self” as “the paradigm or platform according to which this sensible world was made” (TISU, 734). The intellectual is ontologically prior to the physical, as form to copy, “archetype” to “ectype”. The sensible world, or nature, is therefore “a living stamp or signature of the divine wisdom” (TISU, 155). The ontological relation of intellectual to physical structures his dualistic view of all being as a descending hierarchy of entities, from angels and human beings, to animals, plants and plastic nature.\n\nThe operative principles which distinguish immaterial from material substances are activity and passivity (Passmore 1951, Lähteenmäki 2010). The active principle is energeia or energy, which is the principle of life (Hutton 2017). This is an internal principle, or “self activity”, capable of initiating movement or thought. Minds, souls and mental powers are all forms of energy, as is Plastic Nature (see below). All energies are in some sense cogitative, but different energies have different the powers such as “the power of moving matter”. Life may be either conscious or unconscious (“Life or internal self-activity, is to be subdivided into such as either acts with express consciousness and synaesthesis, or such as is without it”, TISU, 159). Energy is furthermore necessarily incorporeal and non-extended, since body, as inert extension, is by definition incapable of originating movement, life or thought.\n\nCudworth’s conception of body as passive extension differentiated only by size, shape, position and motion, is drawn largely from the new mechanical physics of Descartes. Cudworth also attributes solidity or resistance to body, modifying the definition to “resisting or antitypous extension”, TISU, 159). The attraction of this new philosophy according to Cudworth is its intelligibility, its explanatory simplicity, and the fact that it presupposes the existence of an active, immaterial agency, since body cannot initiate movement. He regarded it as a revival of ancient atomist matter theory which he believed derived ultimately from Pythagoras and Moses. Further attractions of the new physics for Cudworth were that it dispensed with what he regarded as the nonsensical clutter of Scholastic forms and qualities, and was consistent with the observable phenomena of the physical universe.\n\n5. Plastic Nature\n\nA signature feature of Cudworth’s system is his hypothesis of “Plastic Nature”, which he posits as an intermediary causal entity between God and the natural world (Lähteenmäki 2010, Allen 2014). This is contained in a long section of TISU entitled “Digression concerning the Plastick Life of Nature”. Cudworth formulated his hypothesis in the light of the inadequacies, as he saw them, of the mechanical philosophy, which, he thought, could not explain movement and change, the union of soul and body or life itself or the order and harmony of nature. Against the Cartesian view that the essence of the soul is cogitation, Cudworth objects that the operations of the soul include life-processes which cannot be accounted for in terms of cogitation, or referred to corporeal explanation. He argues that Descartes’ equation of cogitation with consciousness, is absurd since on such a view we would be permanently conscious, even when asleep.\n\nAccordingly, Cudworth posits Plastic Nature as the instrument of God for maintaining the mundane operations of the physical universe in an orderly fashion, regulating the processes of life, in order to sustain a conception of the natural world as an harmonious, unified and purposive system which reflects the goodness and wisdom of the architect. Plastic Nature is a kind of force or energy which infuses material things, and combines efficient, final and formal causality, while, at the same time allowing for contingency and the possibility of error. By virtue of its imperfections Plastic Nature is liable to error (“bungles”): although it is a copy of the divine mind, it is only a faint one (“the mere umbrage of intellectuality, a faint and shadowy imitation of mind and understanding”, TISU, 172), and it operates without awareness of its actions. (A major difference between the human mind and Plastic Nature is that Plastic Nature operates unconsciously). In this way Cudworth attempted to navigate a course between occasionalism (which requires the direct intervention of God in the minutiae of day-to-day operations of nature), determinism and chance.\n\nCudworth invokes other philosophers in support of his hypothesis, including Aristotle whose conception of nature as art (techne—Physics, 2.8) he interpreted as a version of it. But his most important debt is to Plotinus, especially for his idea of unconscious living nature, and his conception of sympathy as a kind of bonding agent in the universe (see Enneads 4.4)(Hutton 2021). The notion of an intermediary causal agency in nature was not unprecedented in the seventeenth century, especially in medical thought. There are strong affinities between Plastic Nature and Henry More’s concept of the Spirit of Nature. However, a main difference from More is that Plastic Nature is not extended—for Cudworth extension is a property of body, not immaterial entities\n\n6. Epistemology\n\nFor Cudworth, the mind is active, and “formative of its own cogitations”. The mind is not the passive recipient of knowledge from outside itself, but actively engaged in cognition:\n\nknowledge is not a passion from anything without [i.e. outside] the mind, but an active exertion of the inward strength, vigour, and power of the mind, displaying itself from within. (TEIM, 74)\n\nHe posits two kinds of cognition: sense perception and intellection. Sense perception receives corporeal impressions passively, yielding only a confused kind of knowledge. Intellection is a higher “energy” of “noetical” part of the soul which is independent of the body and yields true knowledge.\n\nAs the ectype of God’s wisdom, the human mind is an intellectual microcosm,\n\na kind of notional or representative world, as it were a diaphanous and crystalline sphere, in which the ideas and images of all things existing in the real universe may be reflected or represented. (TEIM, 77)\n\nThese “ideas and images” are not “the actual ideas of all things”, but are contained “virtually and potentially” by the mind, from which it is able to frame “intelligible ideas or conceptions within itself of whatsoever hath any entity or cogitability” (TEIM, 77). For Cudworth ideas of things pre-exist their objects. These pre-existing ideas of things are “anticipations” (for which Cudworth uses the Stoic term prolepsis). Knowledge “descends” from intellect to object, from universals to particulars, and not the reverse, “as it were looking downward” (TEIM, 58, 114).\n\nAlthough knowledge can be generated by the intellect without reference to the world outside, sense perception does have a role in cognition. But it is only a secondary one, since, without the input of mind, sense perceptions are unintelligible, rather as the shape of writing on a page make no sense except to someone who knows how to read. Cudworth explains our capacity to understand the external world by means of correspondence, between the mind and nature, since both bear the imprint (ectype) of God’s wisdom. It is this “stamp of intellectuality”, manifest in the order and relations of its constituent parts, which renders the external world intelligible. Cognition is therefore is an act of recognition akin to the process by which we recognise the portrait of a friend because we have a prior idea of what he looks like (TEIM 106–7). Thus recollection and reflection are also elements in the process of cognition. In comprehending the external world, the mind focuses not on the external appearance of things but the relational constants which reveal their immutable essences. Cudworth illustrates this with the example of a watch held up to a mirror (TEIM 85–6). The difference between an observing eye and the mirror is that the former is conscious of what is reflected in it. To the human mind, however, the watch is not simply an assemblage of discrete metal shapes (“different colours, figures, protuberencies, cavities, sculptures, local motions”), but a unified whole, the constituent parts of which these are designed and arranged for a particular purpose. By comparing these elements in relation to each other and in the light of the ideas it raises from within itself (e.g., ideas of cause and effect), the mind is able to understand how it works, and to recognise that the object is a time-piece (Passmore 1951, Hutton 2019b).\n\n7. Free will\n\nCudworth’s moral philosophy reflects his concerns about the moral implications of theological voluntarism, the doctrine of liberty of indifference, Hobbesian command morality, and scholastic faculty psychology. He repudiates moral conventionalism and denies that the principles of morality can be deduced from sense knowledge, arguing that moral principles are modifications of mind and therefore more “real and substantial things than the modifications of mere senseless matter” (TISU, 248. Cudworth grounds the eternal unchanging nature of moral principles in the goodness and justice in God. As “a being absolutely perfect”, God is “the very idea or essence of good” (TISU, 204), whose essential goodness is manifest in all things. Like Socrates in Plato’s Euthyphro (10a) he argues that things are not good because God wills them, but God wills them because they are good. So “the goodness, or justice, or righteousness is intrinsecall to the thing itself” (TISU, 897). Moral principles are discernible by reason and available to all by virtue of the mind’s “participation” in God. However, he recognises that mere knowledge of the good is insufficient to guarantee virtuous behaviour, and that account must be taken of moral fallibility. Cudworth also argues that we are motivated by desire for the good (“that which first moveth in us, and is the spring and principle of all deliberative action, can be no other than a constant, restless, uninterrupted desire, or love of good as such, and happiness”, FW, 173). And we apprehend the good by sensing it, that it is something which “touches and is felt in us” (Cudworth MS, 4979, fol. 243). Of key importance in his moral philosophy is the attention he gives to moral psychology, in particular, his theory of moral autonomy grounded in his conception of free will (Darwall 1995, Irwin 2008, Leisinger 2019).\n\nThe main discussion of Cudworth’s conception of free will is contained in FW and the unpublished manuscripts on “Liberty and Necessity”. A central the concern for Cudworth is that to act morally, we must be accountable for our actions. This would not be possible if we were not free to act, since we are not accountable for actions determined by factors outside our control—such as divine decrees, the dictates of tyrants, or physical circumstances like illness or imprisonment. For Cudworth, an essential pre-condition for moral accountability, and therefore for virtuous behaviour, is the freedom to choose between one course of action rather than another. At a minimum that means not being constrained by external impediments from pursuing a particular course of action. However, freedom of action requires more than absence of constraint, and mere knowledge of the good is no guarantee of the pursuit of virtue. To act virtuously requires that we are able to pursue the course of action which we choose to follow. Accordingly, Cudworth re-conceives the idea of freedom of the will as a power of self-determination (Chappell, 2005). This “self-power” is a ruling principle of the soul for which he adopts such Greek terms as the autexousion or the eph hemin or the hegemonikon. This ruling principle is self-power both in the sense that it is a principle of action internal to the soul which governs the whole composite of body and soul (“the whole man”), and in the sense that it is the individual human being who determines how it is exercised.\n\nCudworth’s conception of free will is an essential element of the new moral psychology adumbrated in his unpublished manuscripts. Dispensing with the traditional scholastic faculties of the mind, he proposes a unitary conception of the soul, the operations of which involve a complex interplay of active and passive powers associated with. This conglomerate of powers or energies includes both rational powers (intellection, deliberation and practical reason) along with sense perception, desires, and appetites (FW, 193–4) (Hutton 2017). Like Plato’s Phaedran charioteer (Phaedrus 246a–254e) the hegemonikon acts to co-ordinate these various powers to make them work together. As the unifying power of the soul (“the soul as comprehending itself, all its concerns and interests, its abilities and capacities”), the hegemonikon is the whole person—“that which is properly we ourselves” (FW, 178). However, given the complex interplay of active and passive powers, the scope free will as self-determination is markedly circumscribed. It is therefore wrong to consider Cudworth a libertarian. And the combination of both reason and emotion in Cudworth’s account of moral action means that he can’t be unproblematically classified as an ethical rationalist.\n\n8. Consciousness\n\nCrucially, the exercise of freewill requires that the hegemonikon has cognisance of the various powers of the soul and awareness of its own operations, “comprehending all the other powers, energies, and capacities of our soul”—in other words, consciousness (see especially Thiel 2011, Lähteenmäki 2010, Pécharman 2014, Leisinger forthcoming). Cudworth conceives consciousness to be a state of inner awareness, or inward sense whereby the soul is\n\npresent with itself, attentive to its own actions, or animadversive of them, to perceive itself to do or suffer, and to have a fruition or enjoyment of itself. (TISU, 159)\n\nHe agrees with Descartes, that when we think we are conscious of our thoughts, and like Descartes, he construes cogitation broadly to include all the operations of sense, imagination, intellect, and the will (TISU, 831). Unlike Descartes, he does not accept that the soul or mind is always conscious—as already noted, he argues that many activities of the soul (e.g., those performed by Plastic Nature) are performed unconsciously. Furthermore, even when conscious, the soul does not always have clear and distinct awareness of its thoughts. For Cudworth, there are different grades of consciousness, appropriate to the different types of cogitative activity, from the clear perception of “express consciousness” involved in intellection, to the “drowsy and somnolent perception” of the senses (TEIM, 56), to states of semi-consciousness (“half asleep and half-awake”), or when we do things without concentrating (“non-attendingly” or “by Half a Cogitation”) (TISU, 160). Cudworth’s theory of consciousness in fact owes more to Plotinus than Descartes (Enneads 4.4). It is Plotinus who is the source of his view of consciousness as inner perception or inward sense—for which he adopts Plotinus’ term synaesthesis or “con-sense” (as he translates it). Synaesthesis is the highest form of consciousness, which involves what Cudworth calls “duplication” or doubling—a term which derives from his conception of the soul as having “duplicity”, that is having upper and lower regions corresponding respectively to its intellectual and sensible or plastic powers. Synaesthesis is the act of self-reflection, in which the hegemonikon overlooks the whole soul, by as it were, bending the higher powers of the soul over the lower. The soul “redoubled upon itself” in this way is “the soul as comprehending itself, all its concerns and interests”, exercising deliberation, “self-recollection and attention” (FW, 178). In fact, Cudworth holds that only “freewilled-beings” have this kind of consciousness, because it is only the hegemonikon which is able to direct attention and have a comprehensive over-view of the capacities of the soul. Appropriately Cudworth describes the hegemonikon as the “watchman” of the soul. The hegemonikon’s awareness of its own operations which makes it “present with itself” and able “to perceive itself” may reasonably be called self-consciousness because the object of its awareness are the powers that constitute it as the “whole person”. By contrast, the powers and capacities of the lower soul are simple energies with a correspondingly lower level of awareness.\n\n9. Legacy/Influence\n\nAssessing the full extent of Cudworth’s influence is problematic because very little of his epistemology and ethics was published in his lifetime, and it is difficult to be sure whether his unpublished writings circulated. Manuscript circulation of his philosophy would certainly explain the intriguing echoes of some of Cudworth’s ideas in both Locke and Shaftesbury—in particular Locke’s ideas on consciousness and power, and Shaftesbury’s moral sentimentalism.\n\nCudworth’s place in the history of philosophy is complicated by the fact that prior to the publication of A Treatise of Freewill in 1838, he was considered a rationalist in the manner of Samuel Clarke, largely on the basis of TEIM—this is how Hume viewed him, for instance. Since John Passmore’s seminal study of his unpublished manuscript writings (Passmore 1951), such a classification is no longer tenable. It is increasingly recognised that Cudworth anticipates later developments in moral philosophy, especially moral sentimentalism (Gill 2004, Hutton 2012). Nevertheless Passmore’s insights have still not fed through fully to assessments of Cudworth today, and he has also been mis-characterised as primarily a theologian, as a libertarian, and even as a mystic. Latterly Cudworth’s immense learning and baroque wordiness tend to be viewed as obstructive encumbrances, and modern readers are out of sympathy with the syncretic conception of a perennial philosophy which frames his thinking. Nevertheless, from the seventeenth through the nineteenth century, Cudworth’s philosophy has attracted a distinguished array of philosophical readers, among them Locke, Shaftesbury, Leibniz, Reid, Hume and other philosophers of the Scottish Enlightenment. Newton made extensive notes on Cudworth, preserved in his MS “Out of Cudworth” (Newton, q.v.). Richard Price’s Review of the Principal Questions and Difficulties in Morals (Price 1758) is indebted to Cudworth’s posthumous TEIM. Cudworth’s admirers also included Alexander Pope, Samuel Taylor Coleridge and the American Transcendentalists. He was held in high regard by the Scottish historian of philosophy, Dugald Stewart. His hypothesis of Plastic Nature had a lengthy afterlife: it was the subject of a dispute between Pierre Bayle and Jean Le Clerc (Rosa 1994, Simonutti 1993), who defended Cudworth at the instigation of his daughter, Damaris. It was taken up by the botanist, John Ray, included by Denis Diderot in the Encyclopédie and defended by Paul Janet in the mid nineteenth century.\n\nAlthough never a best-seller, TISU was re-published periodically across the centuries. Thomas Birch’s edition of TISU in 1743, incorporated TEIM, and was reprinted in 1820 and 1829. An edition was published in New York 1837–8, and by John Harrison in 1845 (with Mosheim’s notes). Cudworth’s philosophy was translated into Latin, French, and Italian thereby ensuring his philosophy a European readership. The Latin translation by German scholar Johan Lorenz Mosheim published in Jena in 1733 (reprinted Leiden 1773) also included a translation of TEIM. (A possible link to Kant through the Jena connection remains to be explored). An abridged Italian translation of TISU appeared in 1823/4. Extracts of TISU were published in French by Jean Le Clerc in his Bibliothèque choisie (1703–6). (It was probably this version which Leibniz knew, although he also possessed a copy of the original given to him by Cudworth’s daughter, Damaris Masham). In the eighteenth-century Cudworth’s philosophy was also disseminated in shortened form. Thomas Wise’s abridged version, A Confutation of the Reason and Philosophy of Atheism was reprinted three times between 1706 and 1732. It was only in 1838 when FW was published that any of his unpublished manuscripts was printed."}, {"url": "https://www.york.ac.uk/chemistry/staff/academic/t-z/pwalton/", "page_content": "Professor Paul Walton\n\nEmail: paul.walton@york.ac.uk\n\nResearch: Bioinorganic chemistry\n\nLytic Polysaccharide Monooxygenases (LPMOs) and the histidine brace\n\nLPMOs, along with other enzymes, have a copper-containing active site in an N-terminal histidine (Proc. Nat. Acad. Sci., 2011) coordinates to the copper. The active site was discovered in 2011 and is known as the histidine brace. LPMOs catalyse the oxidation of recalcitrant polysaccharides such as cellulose. Our current research interests involve understanding the catalytic mechanisms of these enzymes using a combination of structure, spectroscopy and theory, Nature Catalysis 2018, and also revealing the wider role of LPMOs in biology, Science 2021, 774-779.\n\nLPMOs identified as virulence factors in potato late blight\n\nWorking with colleagues in the Department of Biology here in York, the James Hutton Institute, CNRS Université Aix-Marseille and Syngenta, we characterised a new class of LPMOs which act as major virulence factors in potato blight. The structure and EPR spectroscopy studies of the new enzymes show that they contain a canonical copper histidine brace active site, where the Cu is the site of O 2 activation. This work is published in Science.\n\nFigure. Structure of an AA17 LPMO: a virulence factor in Phytophora infestans\n\nO 2 -substrate coupling mechanism in chitin-active LPMOs\n\nA combined NMR/EPR study unravels the mechanism by which the activation of oxygen is coupled to the binding of substrates in LPMOs. We use an analysis of EPR hyperfine constants to show that the binding of chitin by LPMOs is accompanied by a shift in the coordination geometry at the copper ion. This work is published in PNAS.\n\nFigure: Changes in the active site structure of chitin-active LPMOs upon binding of substrate.\n\nRecent publications\n\nBiography\n\nPaul Walton obtained his PhD in 1990 (University of Nottingham, UK), followed by two years as a NATO/SERC postdoctoral fellow at the University of California, Berkeley, USA. He joined the Department of Chemistry at York as a faculty member in 1993. Between 2004 and 2010 he was chair of department. His main research area is bioinorganic chemistry, in which he has made contributions to the understanding of copper oxidases, including the discovery of the histidine brace.\n\nHe is the recipient of multiple national* and international** awards, including:\n\nTeaching: RSC's Higher Education Teaching Award,** Vice-Chancellor's Teaching Award.\n\nResearch: Gertrude Cropper Award, RSC's Joseph Chatt Award,** IChemE's Global Energy Award,** RSC's Rita and John Cornforth Award,** University of Chalmers Jubilee professor.**\n\nEquality: Royal Society's inaugural Athena Prize* (runner up). WISE man of the year shorlist.*\n\nHe has also been Editor of Dalton Transactions (2004-2008), chair of Heads of Chemistry UK, chair of the Royal Society of Chemistry's Diversity Committee, was named as a 'Person of Influence' by the University of Toronto's Women in Chemistry Group and is one the RSC's 175 Faces of Chemistry. Paul is an internationally-known advocate of equality in sciences and lectures widely on the subject."}], "Paul Y. R. Waddington was educated at the University of Oxford.": [{"url": "https://peoplepill.com/people/paul-y-r-waddington/", "page_content": "Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917. He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917. A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa154 (which operated Spads), on 6 March 1918. Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine. On 19 September 1918, he was transferred to his final wartime post, with Escadrille Spa31. He scored his final triumph solo ten days later. On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II."}, {"url": "https://en.unionpedia.org/i/Paul_Y._R._Waddington", "page_content": "Paul Y. R. Waddington Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories. [1]\n\n6 relations: Balloon buster, List of World War I aces credited with 11–14 victories, List of World War I flying aces from France, Louis Prosper Gros, Paul Barbreau, Théophile Henri Condemine.\n\nBalloon busters were military pilots known for destroying enemy observation balloons.\n\nNew!!: Paul Y. R. Waddington and Balloon buster · See more »\n\nThis list is complete.\n\nNew!!: Paul Y. R. Waddington and List of World War I aces credited with 11–14 victories · See more »\n\nThis is a complete list of French flying aces of World War I. It may be of interest to note, that Roland Garros is often called the first French Ace, but in fact he has only 4 confirmed victories.\n\nNew!!: Paul Y. R. Waddington and List of World War I flying aces from France · See more »\n\nSous Lieutenant Louis Prosper Gros (24 July 1893 – 3 March 1973) became a flying ace during World War I, scoring eight confirmed aerial victories, and possibly a ninth.\n\nNew!!: Paul Y. R. Waddington and Louis Prosper Gros · See more »\n\nCaptain Paul Augustin Edouard Barbreau (16 September 1894 – 2 June 1976) was an Algerian-born French World War I flying ace credited with eight aerial victories.\n\nNew!!: Paul Y. R. Waddington and Paul Barbreau · See more »\n\nLieutenant Colonel Théophile Henri Condemine, or Henri Théophile Condemine, was a French soldier and fighter pilot who began his military career during World War I. He became a flying ace credited with nine confirmed aerial victories, all against observation balloons.\n\nNew!!: Paul Y. R. Waddington and Théophile Henri Condemine · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Paul_Y._R._Waddington"}, {"url": "https://journals.biologists.com/jeb/article/218/6/816/14495/Conrad-Waddington-and-the-origin-of-epigenetics", "page_content": "In 1956, the British developmental biologist, Conrad Waddington, published a paper in the journal Evolution (Waddington, 1956) in which he succeeded in demonstrating the inheritance of a characteristic acquired in a population in response to an environmental stimulus. Much earlier, in 1890, August Weismann had tried and failed to achieve this. He amputated the tails of five successive generations of mice and showed absolutely no evidence for an effect on subsequent generations. Weismann's discovery that the effects of an environmental stimulus (tail amputation) cannot be transmitted to subsequent generations, together with his assumption that genetic change is random, formed the foundations of the Modern Synthesis (Neo-Darwinism) of our understanding of genetic inheritance.\n\nWaddington's approach, however, was much more subtle and more likely to be successful because he realised that the way to test for the inheritance of acquired characteristics is first to discover what forms of developmental plasticity already exist in a population, or that the population could be persuaded to demonstrate with a little nudging from the environment. By exploiting plasticity that already existed he was much more likely to mimic a path that evolution itself could have taken.\n\nHe used the word ‘canalised’ for this kind of persuasion since he represented the developmental process as a series of ‘decisions’ that could be represented as ‘valleys’ and ‘forks’ in a developmental landscape (Fig. 1). He knew from his developmental studies that embryo fruit flies could be persuaded to show different thorax and wing structures, simply by changing the environmental temperature or by a chemical stimulus. In his landscape diagram, this could be represented as a small manipulation in slope that would lead to one channel in the landscape being favoured over another, so that the adult could show a different phenotype starting from the same genotype.\n\nFig. 1. View largeDownload slide Waddington's developmental landscape diagram. The landscape itself and the ball at the top are from his original diagram. The subsequent positions of the ball have been added to illustrate his point that development can be canalised to follow different routes (A and B). The plasticity to enable this to happen already exists in the wild population of organisms (modified diagram by K. Mitchell). Fig. 1. View largeDownload slide Waddington's developmental landscape diagram. The landscape itself and the ball at the top are from his original diagram. The subsequent positions of the ball have been added to illustrate his point that development can be canalised to follow different routes (A and B). The plasticity to enable this to happen already exists in the wild population of organisms (modified diagram by K. Mitchell).\n\nThe next step in his experiment was to select for and breed from the animals that displayed the new characteristic. Exposed to the same environmental stimulus, these gave rise to progeny with an even higher proportion of adults displaying the new character. After a relatively small number of generations, he found that he could then breed from the animals and obtain robust inheritance of the new character even without applying the environmental stimulus. The characteristic had therefore become locked into the genetics of the animal. He called this process genetic assimilation. What he had succeeded in showing was that an acquired characteristic could first be inherited as what we would now call ‘soft’ inheritance, and that it could then be assimilated into becoming standard ‘hard’ genetic inheritance. Today, we call ‘soft’ inheritance epigenetic inheritance, and of course, we know many more mechanisms by which the same genome can be controlled to produce different epigenetic effects.\n\nWhat was happening at the gene level in Waddington's experiments? A standard Neo-Darwinist explanation might be that some mutations occurred. That is possible, but extremely unlikely on the time scale of the experiment, which was only a few generations. Moreover, random mutations would occur in individuals, not in a whole group. Single small mutations would have taken very many generations to spread through whole populations, and many such mutations would have been required.\n\nBut I think there is a much simpler explanation. Recall that the experiment exploited plasticity that is already present in the population. That strongly suggests that all the alleles (gene variants) necessary for the inheritance of the characteristic were already present in the population, but not initially in any particular individuals in the correct combination. The experiment simply brings them together. This is a modification of the pattern of the genome in response to the environmental change, but not in a way that requires any new mutations. I came to this conclusion before reading Waddington's (1957) book, The Strategy of the Genes. But it is in fact one of Waddington's own ideas! He writes ‘There is no … reason which would prevent us from imagining that all the genes which eventually make up the assimilated genotype were already present in the population before the selection began, and only required bringing together’ (p. 176). Not only does he clearly see this possibility, he also tests it. He continues (p. 178) ‘Attempts to carry out genetic assimilation starting from inbred lines have remained quite unsuccessful. This provides further evidence that the process depends on the utilisation of genetic variability in the foundation stock with which the experiment begins’. His text could not be clearer.\n\nOrthodox Neo-Darwinists dismissed Waddington's findings as merely an example of the evolution of phenotype plasticity. That is what you will find in many of the biology textbooks even today (e.g. Arthur, 2010). I think that Waddington showed more than that. Of course, plasticity can evolve, and that itself could be by a Neo-Darwinist or any other mechanism. But Waddington was not simply showing the evolution of plasticity in general; he was showing how it could be exploited to enable a particular acquired characteristic in response to an environmental change to be inherited and be assimilated into the genome. Moreover, he departed from the strict Neo-Darwinist view by showing that this could happen even if no new mutations occur (Fig. 2).\n\nFig. 2. View largeDownload slide Waddington's diagram to show how the developmental landscape relates to individual genes (bottom pegs) through networks of interactions in the organism. Since he also showed the influence of the external environment on canalisation of development, I have extended the diagram by adding the top part to represent the environmental influences. It is the combination of these influences that can lead to an evolutionary change without mutations (modified from Waddington, 1957). Fig. 2. View largeDownload slide Waddington's diagram to show how the developmental landscape relates to individual genes (bottom pegs) through networks of interactions in the organism. Since he also showed the influence of the external environment on canalisation of development, I have extended the diagram by adding the top part to represent the environmental influences. It is the combination of these influences that can lead to an evolutionary change without mutations (modified from Waddington, 1957).\n\nEpigenetics means ‘above genetics’ and it was originally conceived by Waddington himself to describe the existence of mechanisms of inheritance in addition to (over and above) standard genetics (Bard, 2008). Waddington regarded himself as a Darwinist since Darwin also, in The Origin of Species, included the inheritance of acquired characteristics. But significantly, Waddington was not a Neo-Darwinist since Neo-Darwinism, following Weismann, specifically excludes such inheritance. Waddington was a profound thinker about biology, and much else too. The Strategy of the Genes is a masterly account of the many reasons why he dissented from Neo-Darwinism, and it has stood the test of time. It was reprinted over half a century later, in 2014. He did not describe himself as a Lamarckian, but by revealing mechanisms of inheritance of acquired characteristics, I think he should be regarded as such. The reason he did not do so is that Lamarck could not have conceived of the processes that Waddington revealed. Incidentally, it is also true to say that Lamarck did not invent the idea of the inheritance of acquired characteristics. But, whether historically correct or not, we are stuck today with the term ‘Lamarckian’ for inheritance of a characteristic acquired through an environmental influence.\n\nWaddington's concepts of plasticity and epigenetics have been very influential in my own thinking about experiments on cardiac rhythm. We found that the heart's pacemaker is very robust, so much so that protein mechanisms normally responsible for a large part of the rhythm could be completely blocked or deleted (Noble et al., 1992). Only very small changes in rhythm occur, because other mechanisms come into play to ensure that pacemaker activity continues. The relation between individual genes and the phenotype is therefore mediated through networks of interactions that can buffer individual gene variation, just as Waddington envisaged in his diagrams of epigenetic effects and canalisation. This is one of the reasons why I became interested in evolutionary biology many years ago, and why I have also explored ways in which evolutionary theory can be integrated with recent discoveries in molecular and physiological biology (Noble et al., 2014).\n\nWaddington's concepts are also highly relevant to biologists interested in the ways in which organisms adapt to their environment, and to comparative biologists interested in how this varies between species. Many of the ways in which modern epigenetics plays an essential role in these fields have been described in a special issue of this journal (see overview by Knight, 2015). The discovery of epigenetic marking of DNA and its associated chromatin proteins has opened up new vistas for experimental biology.\n\nI conclude this article with a warning: if you are inspired to try to repeat Waddington's 1956 experiment, do remember that you will fail if you try to do it on a cloned laboratory population. The mechanism depends on using a wild population with natural genetic diversity. In this respect it resembles a phenomenon first noted by James Baldwin (1896). This is that individuals in a population with the ‘correct’ allele combinations could choose a new environment and so permanently change the evolutionary development in that environment. It resembles Waddington's idea, as he himself recognised, because it does not require new mutations. More recently, Karl Popper, the great logician of science, also noted the possible importance of genetic assimilation without mutations in evolutionary theory (Niemann, 2014; Noble, 2014). Popper and Waddington had both taken part in discussions on evolutionary biology during the 1930s and 1940s when the field of molecular biology was still developing (Niemann, 2014).\n\nWhile celebrating the recent rapid rise in epigenetics research (see Hoppeler, 2015; Knight, 2015), let's also celebrate the father of epigenetics, Conrad Waddington, who opened our eyes to the rich opportunities of adaptation through epigenetic regulation.\n\nReferences\n\nArthur , W. 2010 ). Evolution, A Developmental Approach . Oxford, UK : Wiley Blackwell . ). Baldwin , J. M. 1896 ). A new factor in evolution . Am. Nat. 30 , 441 - 451 . https://doi.org/10.1086/276408 ). Bard , J. B. L. 2008 ). Waddington's legacy to developmental and theoretical biology . Biol. Theory 3 , 188 - 197 . https://doi.org/10.1162/biot.2008.3.3.188 ). Hoppeler , H. H. 2015 ). Epigenetics in comparative physiology . J. Exp. Biol. 218 , 6 . https://doi.org/10.1242/jeb.117754 ). Knight , K. 2015 ). A comparative perspective on epigenetics . J. Exp. Biol. 218 , 1 - 5 . https://doi.org/10.1242/jeb.118075 ). Niemann , H.-J. 2014 ). Karl Popper and The Two New Secrets of Life . Tübingen : Mohr Siebeck . ). Noble , D. 2014 ). Secrets of life from beyond the grave . Physiol. News 97 , 34 - 35 . ). Noble , D. Denyer , J. C. Brown , H. F. DiFrancesco , D. and 1992 ). Reciprocal role of the inward currents i b,Na and i f in controlling and stabilizing pacemaker frequency of rabbit Sino-atrial node cells . Proc. R. Soc. B. Biol. Sci. 250 , 199 - 207 . https://doi.org/10.1098/rspb.1992.0150 ). Noble , D. Jablonka , E. Joyner , M. J. Müller , G. B. Omholt , S. W. and 2014 ). Evolution evolves: physiology returns to centre stage . J. Physiol. 592 , 2237 - 2244 . https://doi.org/10.1113/jphysiol.2014.273151 ). Waddington , C. H. 1956 ). The genetic assimilation of the bithorax phenotype . Evolution 10 , 1 - 13 . https://doi.org/10.2307/2406091 ). Waddington , C. H. 1957 ). The Strategy of the Genes . London : Allen and Unwin . . ).. ."}, {"url": "https://www.ox.ac.uk/about/international-oxford/europe/france", "page_content": "France studies at Oxford\n\nStudy and teaching about France takes place in departments throughout the University’s academic divisions. There are also several units with a strong concentration on France.\n\nThe French department of the Faculty of Medieval and Modern Languages is one of the major centres at Oxford for French studies, and one of the major centres for it in the UK. The department covers all aspects and periods of French literature, culture and language.\n\nOxford’s Voltaire Foundation is a world leader in 18th century scholarship. It is producing the definitive edition of the Complete Works of Voltaire, with a digital edition also in active preparation. The foundation also publishes a major series of works devoted to Enlightenment studies, the Oxford University Studies in the Enlightenment series, as well as editions of the correspondences of key French Enlightenment thinkers. It has also created Electronic Enlightenment, an online repository of correspondence from the Enlightenment period.\n\nOxford’s Faculty of Law offers degrees that include studying a European legal system abroad, including French law.\n\nLibraries and Museums\n\nThe Ashmolean Museum’s holdings include the world’s largest collection of paintings by Camille Pissarro, as well as works by other French artists such as Manet, Renoir and Degas.\n\nThe Faculty of Music’s Bate Collection of musical instruments is the most comprehensive collection in Britain of European musical instruments, and includes instruments by the most important French makers.\n\nA highlight of the Bodleian Libraries’ collections is the oldest surviving manuscript of the French epic poem La Chanson de Roland (The Song of Roland)."}, {"url": "https://www.waikato.ac.nz/foundation/pre-2020/news/waddington-family-gift-benefits-students", "page_content": "Waddington Family Gift Benefits Students\n\n\n\nStudents living in College Hall have a new Leisure Centre thanks to a generous gift from Jill Waddington and her family made in memory of husband and father, Richard Waddington.\n\nThe Waddington Family has had more than 50 years association with the University of Waikato. Richard Waddington was part of the group of business leaders who worked on the plan to establish the university, and travelled to Wellington to meet with Robert Muldoon to discuss the passing of the Waikato University Bill. He received an Honorary Doctorate in 1971 for significant services to the University and served on Council under Don Llewellyn from 1976-1986. Mr. Waddington was an avid fundraiser, particularly for the Halls of residence.\n\nWaddington Family siblings, Paul and Mary Jane, are both graduates of the University of Waikato. Mary Jane is also the University's Manager of Postgraduate Student Assessment and Graduation.\n\nCollege Hall serves approximately 330 students at the University each year. The formal opening of the Hall's new Richard Waddington Leisure Centre was held in June and included a tour of the computer labs, study rooms, media centre and social spaces.\n\n\n\nThree generations of the Waddington Family attended the formal opening of the Richard Waddington Leisure Centre in College Hall.\n\nFrom left to right: Zachary, Mary Jane, Jill, Paul and Moira."}, {"url": "https://www.britannica.com/topic/University-of-Oxford", "page_content": "Take a quick lesson in University of Oxford history and tour its collection of colleges and schools See all videos for this article\n\nUniversity of Oxford, English autonomous institution of higher learning at Oxford, Oxfordshire, England, one of the world’s great universities. It lies along the upper course of the River Thames (called by Oxonians the Isis), 50 miles (80 km) north-northwest of London.\n\nSketchy evidence indicates that schools existed at Oxford by the early 12th century. By the end of that century, a university was well established, perhaps resulting from the barring of English students from the University of Paris around 1167. Oxford was modeled on the University of Paris, with initial faculties of theology, law, medicine, and the liberal arts.\n\nIn the 13th century the university gained added strength, particularly in theology, with the establishment of several religious orders, principally Dominicans and Franciscans, in the town of Oxford. The university had no buildings in its early years; lectures were given in hired halls or churches. The various colleges of Oxford were originally merely endowed boardinghouses for impoverished scholars. They were intended primarily for masters or bachelors of arts who needed financial assistance to enable them to continue study for a higher degree. The earliest of these colleges, University College, was founded in 1249. Balliol College was founded about 1263, and Merton College in 1264.\n\nDuring the early history of Oxford, its reputation was based on theology and the liberal arts. But it also gave more-serious treatment to the physical sciences than did the University of Paris: Roger Bacon, after leaving Paris, conducted his scientific experiments and lectured at Oxford from 1247 to 1257. Bacon was one of several influential Franciscans at the university during the 13th and 14th centuries. Among the others were Duns Scotus and William of Ockham. John Wycliffe (c. 1330–84) spent most of his life as a resident Oxford doctor.\n\nBeginning in the 13th century, the university gained charters from the crown, but the religious foundations in Oxford town were suppressed during the Protestant Reformation. In 1571 an act of Parliament led to the incorporation of the university. The university’s statutes were codified by its chancellor, Archbishop William Laud, in 1636. In the early 16th century, professorships began to be endowed. And in the latter part of the 17th century, interest in scientific studies increased substantially. During the Renaissance, Desiderius Erasmus carried the new learning to Oxford, and such scholars as William Grocyn, John Colet, and Sir Thomas More enhanced the university’s reputation. Since that time Oxford has traditionally held the highest reputation for scholarship and instruction in the classics, theology, and political science.\n\nIn the 19th century the university’s enrollment and its professorial staff were greatly expanded. The first women’s college at Oxford, Lady Margaret Hall, was founded in 1878, and women were first admitted to full membership in the university in 1920. In the 20th century Oxford’s curriculum was modernized. Science came to be taken much more seriously and professionally, and many new faculties were added, including ones for modern languages and economics. Postgraduate studies also expanded greatly in the 20th century.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nOxford houses two renowned scholarly institutions, the Bodleian Library and the Ashmolean Museum of Art and Archaeology, as well as the Museum of the History of Science (established 1924). The Oxford University Press, established in 1478, is one of the largest and most prestigious university publishers in the world.\n\nOxford has been associated with many of the greatest names in British history, from John Wesley and Cardinal Wolsey to Oscar Wilde and Sir Richard Burton and Cecil Rhodes and Sir Walter Raleigh. The astronomer Edmond Halley studied at Oxford, and the physicist Robert Boyle performed his most important research there. Prime ministers who studied at Oxford include William Pitt the Elder, George Canning, Sir Robert Peel, William Gladstone, Lord Salisbury, H.H. Asquith, Clement Atlee, Anthony Eden, Harold Macmillan, Edward Heath, Harold Wilson, and Margaret Thatcher. Among the many notable writers associated with the university are Lewis Carroll, C.S. Lewis, and J.R.R. Tolkien; the latter two were members of the Inklings, an informal Oxford literary group in the mid-20th century.\n\nThe colleges and collegial institutions of the University of Oxford include All Souls (1438), Balliol (1263–68), Brasenose (1509), Christ Church (1546), Corpus Christi (1517), Exeter (1314), Green (1979), Harris Manchester (founded 1786; inc. 1996), Hertford (founded 1740; inc. 1874), Jesus (1571), Keble (founded 1868; inc. 1870), Kellogg (1990), Lady Margaret Hall (founded 1878; inc. 1926), Linacre (1962), Lincoln (1427), Magdalen (1458), Mansfield (founded 1886; inc. 1995), Merton (1264), New (1379), Nuffield (founded 1937; inc. 1958), Oriel (1326), Pembroke (1624), Queen’s (1341), St. Anne’s (founded 1879; inc. 1952), St. Antony’s (1950), St. Catherine’s (1962), St. Cross (1965), St. Edmund Hall (1278), St. Hilda’s (founded 1893; inc. 1926), St. Hugh’s (founded 1886; inc. 1926), St. John’s (1555), St. Peter’s (founded 1929; inc. 1961), Somerville (founded 1879; inc. 1926), Templeton (founded 1965; inc. 1995), Trinity (1554–55), University (1249), Wadham (1612), Wolfson (founded 1966; inc. 1981), and Worcester (founded 1283; inc. 1714). Among the university’s private halls are Blackfriars (founded 1921; inc. 1994), Campion (founded 1896; inc. 1918), Greyfriars (founded 1910; inc. 1957), Regent’s Park College (founded 1810; inc. 1957), St. Benet’s (founded 1897; inc. 1918), and Wycliffe (founded 1877; inc. 1996)."}, {"url": "https://www.ox.ac.uk/about/organisation/university-officers/chancellor", "page_content": "The Rt Hon the Lord Patten of Barnes, KG, CH, PC\n\nChristopher Francis Patten was born in 1944. He was educated at St Benedict's School, Ealing and Balliol College, Oxford, where he read Modern History and was elected a Domus Exhibitioner. In 1965 he won a Coolidge Travelling Scholarship to the USA.\n\nHe joined the Conservative Research Department in 1966. He was seconded to the Cabinet Office in 1970 and was personal assistant and political secretary to Lord Carrington and Lord Whitelaw when they were Chairmen of the Conservative Party from 1972-1974. In 1974 he was appointed the youngest ever Director of the Conservative Research Department, a post which he held until 1979.\n\nLord Patten was elected as Member of Parliament for Bath in May 1979, a seat he held until April 1992. In 1983 he wrote The Tory Case, a study of Conservatism.\n\nFollowing the General Election of June 1983, Lord Patten was appointed Parliamentary Under Secretary of State, Northern Ireland Office and in September 1985 Minister of State at the Department of Education and Science. In September 1986 he became Minister for Overseas Development at the Foreign & Commonwealth Office. He was appointed to the Privy Council in 1989 and was appointed a Companion of Honour in 1998. In July 1989 he became Secretary of State for the Environment. In November 1990 he was appointed Chancellor of the Duchy of Lancaster and Chairman of the Conservative Party.\n\nLord Patten was appointed Governor of Hong Kong in April 1992, a position he held until 1997, overseeing the return of Hong Kong to China. He was Chairman of the Independent Commission on Policing for Northern Ireland set up under the Good Friday Peace Agreement, which reported in 1999.\n\nFrom 1999 to 2004 he was European Commissioner for External Relations, and in January 2005 he took his seat in the House of Lords. In 2006 he was appointed Co-Chair of the UK-India Round Table. He was Chairman of the BBC Trust from 2011 to 2014.\n\nHe is an Honorary Fellow of the Royal College of Physicians, Edinburgh, and Honorary Fellow of Balliol College, Oxford. He served as Chancellor of Newcastle University from 1999 to 2009, and was elected Chancellor of the University of Oxford in 2003.\n\nIn April 2023, His Majesty King Charles III appointed him a Knight Companion of the Most Noble Order of the Garter – Britain’s highest order of chivalry and a mark of the country’s respect for Lord Patten’s work in the UK and abroad.\n\nHis publications include What Next? Surviving the 21st Century (2008); Not Quite the Diplomat: Home Truths About World Affairs (2005) and East and West (1998), about Asia and its relations with the rest of the world.\n\nLord Patten married Lavender Thornton in 1971. They have three daughters, Kate (born in 1973), Laura (1974) and Alice (1979). He reads a lot and is keen on tennis and gardening."}, {"url": "https://en.wikisource.org/wiki/Dictionary_of_National_Biography,_1885-1900/Shirley,_Walter_Waddington", "page_content": "​SHIRLEY, WALTER WADDINGTON (1828–1866), ecclesiastical historian and divine, the only son of Walter Augustus Shirley [q. v.], bishop of Sodor and Man, was born at Shirley, Derbyshire, on 24 July 1828. He was educated at Rugby under Dr. Arnold. His most intimate friend at school and throughout his life was his cousin, William Henry Waddington, who afterwards won for himself a high position in French politics. In June 1846 Shirley matriculated at University College, Oxford, but in the following year he migrated to Wadham College, where he had gained a scholarship. He obtained a first class in the honour school of mathematics in 1851, and in 1852 was elected a fellow of his college. He was compelled to vacate his fellowship three years later, in consequence of his entrance on his mother's death into possession of a small landed property. From 1855 to 1863 he was tutor and mathematical lecturer of Wadham. It was during this period that he began to devote his best energies to historical study. Patient in research, possessing to an extraordinary degree the rare quality of fair-mindedness, the master of a clear and dignified style, he came to be regarded by many competent judges, both in England and in Germany, as one of the most brilliant of the new school of Oxford historians. In 1858 his edition of ‘Fasciculi Zizaniorum Magistri Johannis Wyclif’ was published in the Rolls Series. His admirable introduction attracted the attention of historical students (but cf. Athenæum, 1858, ii. 415, 454), and he commenced the preparation of a life of Wiclif which he did not live to complete. In 1865, however, he published ‘Catalogue of the Original Works of John Wiclif,’ Oxford, 8vo. In 1862 he edited for the Rolls Series ‘Royal and other Historical Letters illustrative of the Reign of Henry III.’\n\nDuring this period his theological views underwent considerable change. Having been in his early days a disciple of Arnold, he ultimately came to regard ‘undogmatic Christianity’ as a contradiction in terms. Finally, in May 1863, he preached in the university church a closely reasoned sermon—which created a profound impression at the time of its delivery and has often been quoted since—wherein he sought to demonstrate the unreasonableness of Arnold's teaching. Two or three months after the delivery of this sermon he was made regius professor of ecclesiastical history and canon of Christ Church. His scrupulous fairness in controversy, his freedom from party spirit, the mingled strength and simplicity of his character, had won for him the esteem of men of widely divergent views, and his appointment to the professorship met with general approval. He was one of the pioneers of the university extension movement, and played a prominent part in the early history of the founding of Keble College. His promising career was cut short at the age of thirty-eight. He died on 20 Nov. 1866. By his wife Philippa, daughter of Samuel Knight, esq., of Impington, Cambridgeshire, whom he married on 4 July 1855, Shirley had issue three daughters and two sons, of whom the elder, Walter Knight, is heir-presumptive to the earldom of Ferrers.\n\nThe theological position which Shirley occupied at the time of his death was still a provisional one. He always regarded as ‘the most treacherous of all fallacies the assumption that the general position, moral or intellectual, which a man has taken up can never require to be reconsidered.’ In addition to the works already mentioned, he published a lecture on ‘Scholasticism,’ delivered before the university of Oxford, 1866. After his death a small volume by him, entitled ‘Some Account of the Church in the Apostolic Age,’ was published by the Clarendon Press.\n\n[Gardiner's Registers of Wadham College, 1719–1871; Foster's Alumni Oxon. 1715–1886; Burgon's Twelve Good Men; Archdeacon Hill's Letters and Memoir of W. A. Shirley, D.D., Bishop of Sodor and Man; Burke's Peerage; unpublished letters of Madame Bunsen, W. H. Waddington, Canon J. C. Robertson, Dr. Buddensieg of Dresden, and others; private information.]"}, {"url": "https://www.ox.ac.uk/welcome.html", "page_content": "We hope that our site on iTunes U helps to bring this activity to life, and that you enjoy viewing the wealth of material available on it. We will be keeping this site regularly updated with new audio and video podcasts so please do visit again.\n\nTo find out more about applying to the University, our opportunities for continuing education or our fundraising Campaign, please visit the links below.\n\n\n\nUndergraduate Admissions\n\nVisit our admissions pages to find out more about studying an undergraduate degree at the University of Oxford. Read about the world-renowned tutorial system at the heart of learning here, and the wealth of resources available to students. Find out about the different courses available, the entrance requirements and how you can apply. There is specific information for international students and mature students, guidance for parents and teachers, and details about funding, including generous financial support.\n\nLifelong Learning\n\nJoin the thousands of people who participate each year in our range of face-to-face and online programmes for professional development and personal enrichment.\n\niTunes U and the Department's media webpage offer unique access to an increasing number of our presentations, programmes, research interests and guest lectures. You can listen and view online or download to a mobile device.\n\nWe are committed to extending the global reach of the University of Oxford, working with colleagues across the University. Global audiences engage with the University through the Department's rich diversity of web-based programmes, summer schools, short courses, evening and weekend classes, and part-time undergraduate and postgraduate-level programmes. Courses are taught flexibly, often with short periods of intensive study, thereby attracting students who might not otherwise be able to study full-time at Oxford. To learn more visit our website: Department for Continuing Education\n\nThe Campaign for the University of Oxford\n\nIn May 2008, the University of Oxford launched the biggest fundraising campaign in European history. It is a high profile international effort centred on Oxford’s overall academic priorities to transform the University for many generations to come, with three main goals:\n\nTo attract and support the very best students, irrespective of their financial situation.\n\nTo invest in academic posts and programmes, securing permanent posts and research funding to attract and retain the world’s finest academics.\n\nTo provide the buildings and infrastructure to support some of the world’s most advanced research centres and teaching facilities and to preserve the unique spirit of the Colleges and University of Oxford.\n\nVisit the Campaign website\n\nAlumni\n\nOxford has an alumni body consisting of more than 170,000 individuals around the world, from Azerbaijan to Zimbabwe. Our alumni relations programme aims to foster alumni involvement with Oxford by encouraging intellectual and emotional ties between this community and their institution by providing a range of events, benefits and services from exclusive academic speaker events to professional development opportunities.\n\nVisit the Alumni website\n\niTunes U\n\nThe University's site on iTunes U features free audio and video podcasts about all aspects of the University. These podcasts can be listened to or viewed online or downloaded to a mobile device such as an mp3 player. Highlights include lectures by, and interviews with, senior academics, and podcasts about how to apply to the University. New podcasts will be added regularly; so keep visiting!\n\nFind out more about our iTunes U channel\n\nGet involved\n\nYou don't have to be a student to get involved with the University of Oxford. Find out more about helping our research, visiting our beautiful buildings and world-famous museums, and attending some of our lectures and other events.\n\nFind out how to get involved\n\nNews Office\n\nVisit our news page to read about the latest discoveries, research and developments at Oxford University."}, {"url": "https://www.britannica.com/biography/C-H-Waddington", "page_content": "C.H. Waddington, in full Conrad Hal Waddington, (born Nov. 8, 1905, Evesham, Worcestershire, Eng.—died Sept. 26, 1975, Edinburgh, Scot.), British embryologist, geneticist, and philosopher of science.\n\nWaddington graduated in geology from the University of Cambridge (1926), and it was only after studying paleontology that he turned to biology. Before World War II he taught zoology and embryology at Strangeways Research Laboratory, Cambridge. From 1947 until his death he was professor of animal genetics at the University of Edinburgh.\n\nBritannica Quiz Genetics Quiz\n\nWaddington performed his first notable work in biology on the development of the embryos of birds and mammals. He showed in 1933 that chemical messengers from certain tissues induce other tissues to develop. These studies of embryonic development led him to investigate the regulatory effects of genes on tissue and organ development. Waddington then attempted, in Organisers and Genes (1940), to relate Mendelian genetics to the new findings of experimental embryology.\n\nDuring World War II, Waddington engaged in operations research for the military. After the war he established for the British Agricultural Research Council the Unit of Animal Genetics, a research organization that studied the genetics and scientific breeding of livestock. He afterward served as chief geneticist for this endeavour.\n\nWaddington published many books on embryology, genetics, and the philosophy of science; his Principles of Embryology (1956) is considered a standard textbook, while The Ethical Animal (1960) and Biology for the Modern World (1962) are leading works of popularized science."}], "Paul Y. R. Waddington then moved to Canada.": [{"url": "https://peoplepill.com/people/paul-y-r-waddington/", "page_content": "Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917. He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917. A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa154 (which operated Spads), on 6 March 1918. Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine. On 19 September 1918, he was transferred to his final wartime post, with Escadrille Spa31. He scored his final triumph solo ten days later. On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II."}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/miriam-waddington", "page_content": "Waddington, Miriam\n\nMiriam Waddington, née Dworkin, poet, essayist (b at Winnipeg, Man 23 Dec 1917; d at Vancouver 3 Mar 2004). Born to Russian-Jewish immigrants, she was raised in Winnipeg and Ottawa and attended the Universities of Toronto (BA 1939; MA 1968) and Pennsylvania (MSW 1945). She moved to Montréal in 1945 and worked as a caseworker and teacher of social work throughout the 1940s and 1950s, and was professor of English at York University from 1964 until her retirement in 1983.\n\nHer first works, Green World (1945) and The Second Silence (1955), are series of lyrics that celebrate the natural world as an antidote to the fragmentation and ugliness of the modern city. She also concentrates on the city life of Montréal and on her experiences as a social worker in The Season's Lovers (1958), which concludes with a section of varied poems on love. In The Glass Trumpet (1966), her poetry shifts into a short, lightly punctuated line and simpler language, reflecting the rhythms of the speaking voice. The poems explore her Winnipeg and prairie childhood, while Say Yes (1969) broadens her subject matter to include Europe and the Mideast. The Price of Gold (1972), Mister Never (1978) and The Visitants (1981) reflect on love, aging and death, and the poet's literal and emotional travels, with clarity and precision.\n\nWaddington has also written a volume of fiction, Summer at Lonely Beach and Other Stories (1982), a critical study of A.M. KLEIN (1970), and numerous essays and reviews; and edited John Sutherland: Essays, Controversies and Poems (1972), Klein's Collected Poems (1974) and Canadian Jewish Short Stories (1990). In Apartment Seven: Essays New and Selected (1989), she examines the nature of poetry as the supreme synthesis and amalgam of all the resources of language. In all her poems Waddington strove for a directness and simplicity of expression. The Last Landscape (1992) was her most recent collection of poems."}, {"url": "https://www.waddingtons.ca/about-us/our-history/", "page_content": "Waddington’s is Canada’s Auction & Appraisal Company\n\nproviding expert advice to Canadian and international clients for 173 successful years.\n\n1850\n\nCanada was still 17 years away from Confederation and Toronto’s population was less than 20,000 when Andrew Henderson originally of Paisley, Scotland opened auction rooms on Toronto’s lower Yonge Street.\n\n1863\n\nIn 1863, the company which now also included Henderson’s son Charles, moved to 128 King Street East where the “C. M. Henderson & Co. Auctioneers” sign would hang over the entrance for the next 75 years, establishing Henderson’s as the auction house of Toronto.\n\n“Charlie” Henderson was one of Toronto’s great Victorians keeping company with Toronto notables Ned Hanlan, Canada’s first international sports hero and world-class rowing champion, and Goldwin Smith, noted author and historian. Recognized by everyone as he drove his horse and buggy around town ready to conduct an auction at the drop of his top hat, he conducted many auctions directly on the Toronto docks, deftly taking bids from the crowd as containers of fruit and dry goods were unloaded.\n\n1928\n\nWhen Charles Henderson died at age 81 in 1928, the media paid tribute to the veteran auctioneer:\n\n“Elegantly silk-hatted, spatted and cravatted, he was this city’s most famous glass of fashion and mold of form, as well as its most persuasive orator and most original character. He never sold any article with a guarantee of uniqueness so genuine as his own”. “A composite of civic history could be gathered from beneath Charlie Henderson’s hammer. His office was the scene of the making of many a political career…He has auctioned everything auctioned in Toronto”. Toronto Telegram, Dec. 7, 1928.\n\n1939\n\nThe business passed on to Charles’ son Douglas, and in 1939, ownership of the company was transferred to Douglas’ partner Frank Waddington. As the new proprietors, the Waddington family re-named the auction house ‘Waddington’s’, and ran the successful business for the next four decades.\n\n1960\n\nIn 1960 British auctioneer Ronald Mclean arrived in Toronto to work for Ward-Price Auctioneers on College Street near Yonge. By 1962, McLean bought Waddington’s from Frank’s two sons “on a handshake”. Waddington’s continued to develop its reputation as a Toronto institution, and in 1969, expanding business necessitated a move from 128 King Street East to larger facilities at 189 Queen Street East.\n\nRon McLean brought his own style to the auctioneer’s podium, always keen to share amusing anecdotes from his experiences in both Canada and the U.K. With a style reminiscent of Charlie Henderson’s, Ron is considered an institution of the Canadian auction business.\n\n1970\n\nWaddington, McLean & Co., Ltd. was incorporated in 1970 employing over 35 full-time staff and a roster of specialists to support all aspects of the auction and appraisal business.\n\n1998\n\nAgain, growth of the business required a move and in June 1998, Waddington’s moved to 111 Bathurst Street, an exciting neighbourhood developing a strong arts and design identity.\n\n2000\n\nWaddington’s celebrated its 150th anniversary.\n\n2001\n\nA significant expansion of the business was realized with the creation of Joyner Waddington’s Canadian Art – a partnership of Canada’s most successful Canadian Fine Art auctioneer, Geoffrey Joyner, and Waddington’s Auctioneers.\n\n2007\n\nCapitalizing on the booming growth and power of the internet, Waddington’s conducted its first online auction. Online auctions have since become an important component for all our departments.\n\n2011\n\nAfter several successful years of growth, change and many exciting auctions, Waddington’s returned to its east end roots. Our new home is a sleek, concrete and glass facility in Toronto’s busy King Street East Design District.\n\n2013\n\nLinda Rodeck, one of Canada’s most respected Canadian art specialists, re-joined Waddington’s to lead our Canadian Art department, renamed Waddington’s Canadian Fine Art.\n\n2015\n\nTo fully round out our fine arts and luxury goods portfolio, we added Fine Wine & Spirits under the authority of the LCBO to our offerings in the fall of 2015.\n\n2020\n\nWaddington’s celebrates its 170th anniversary.\n\nToday and looking forward – Waddington’s is committed and energized by the challenge to adapt to the changing demands of the business and to continuously look for opportunities to expand our horizons. Whether conducting unique auctions such as the contents of Maple Leaf Gardens, or the many estate, specialty and fundraising events, we’re proud that as Toronto has become an international business and arts force – so have we."}, {"url": "https://thecanadianencyclopedia.ca/en/article/geoffrey-waddington-emc", "page_content": "Waddington, Geoffrey\n\nGeoffrey Waddington. Conductor, administrator, violinist, b Leicester, England, 23 Sep 1904, d Toronto 3 Jan 1966; honorary LL D (Dalhousie) 1956. His mother, Elizabeth, was a pianist, and his father, Frank, appeared in light opera in England. The family moved to Canada in 1907 and settled in Lethbridge, Alta, where the young Waddington began playing violin at 7. He had his first conducting experience before he was 12, when the conductor of a local theatre orchestra fell ill. In 1921 Waddington won a scholarship to the TCM (RCMT). While studying there with Ferdinand Fillion, Luigi von Kunits, Leo Smith, and Healey Willan he toured 1921-5 as a violinist and was a member 1922-6 of the TCM faculty. At the TCM he met his future wife, the concert pianist Mildred Baker. He also played 1925-8 in the TSO.\n\nWaddington began his radio career in 1922 on CKNC and served 1926-33 as music director of that station and 1933-5 as music director of the CRBC (which took over CKNC's facilities in 1933). On CKNC he conducted orchestras for many sponsored programs, including 'The Neilson Hour' (some 460 broadcasts, 1926-33), which in 1929 became the first variety program to be heard across Canada. He also conducted CKNC's Canadian Eveready Concert Orchestra, which recorded for Victor in 1928. For several years he worked as a freelance conductor, first (1935-6) with an orchestra at the Royal York Hotel in Toronto, then (1939, 1940) with the Winnipeg Summer Symphony for a while (1943) with The Army Show. He was music director 1938-43 at CBC Winnipeg (responsible for 'Geoffrey Waddington Conducts') and at All-Canada Radio Facilities (Alberta) in 1944. In 1945 he began conducting CBC Toronto radio shows - 'The Geoffrey Waddington Show,' 'The Edmund Hockridge Show' (both 1946-7), and others. In 1947 he was appointed to a casual position (made official in mid-1948) as music adviser and consultant to the CBC English network. He was a co-founder in 1948 of the CBC Opera Company and won acclaim for broadcasts of Peter Grimes, Albert Herring, Così fan tutte, and Deirdre. Appointed CBC music director in 1952, he was founder and music director 1952-64 of the CBC Symphony Orchestra and was that distinguished orchestra's most frequent conductor. He led it in some 50 concerts, including its broadcast debut 29 Sep 1952, its public debut 16 May 1955, and its concert 23 Oct 1961 in Washington at the Inter-American Music Festival celebrating the 16th anniversary of the United Nations.\n\nOther highlights of Waddington's conducting career include appearances with the Promenade Symphony Concerts (1940s) and the TSO (1940s and 1950s), BBC broadcasts of Canadian music from Glasgow and Manchester in 1953, and a concert (29 Jul 1957) and, later, a recording of music for organ (Gordon Jeffery) and strings presented at Westminster Abbey before the International Congress of Organists. He conducted the first symphonic concerts sponsored by the CLComp in Toronto (26 Mar 1952) and in Montreal (3 Feb 1954). Waddington also conducted other CBC special broadcasts and series in the 1950s (eg, 'Music for Strings' and a selection of Gilbert & Sullivan operettas). However, he rarely appeared on TV (The Marriage of Figaro in 1956, 'Portrait of an Orchestra' in 1962, and several episodes of 'L'Heure du concert' were exceptions) or in public concert. He was an adjudicator in many of the CBC's contests for performers and composers. In 1959 he received the University of Alberta National Award in Music. With the demise of the CBC SO in 1964 he was appointed music consultant and director of symphonic services, a largely inactive position.\n\nWaddington's experience as one of the first radio conductors in Canada (and probably the most active in his day) shaped his personality on the podium. He was thoroughly professional in his recognition of the practical demands of time slots and studio facilities and in his subordination of personal taste to programming requirements. A shy person, he spoke little at rehearsals. Though he expressed few aesthetic preconceptions about the music at hand, he was able to establish with his players a rapport based on mutual respect and confidence. Despite his conservatory training, his early career was mostly in light music. Nevertheless, he adapted well to the symphonic repertoire. His workmanlike objectivity and trust in his players enabled him to prepare himself to conduct contemporary works in two or three days. From the beginning Waddington's orchestras served as training grounds for musicians who did well on their own later, including Percy Faith (as an arranger), Robert Farnon, Samuel Hersenhoren, Zara Nelsova, Albert Pratz, and Paul Scherman.\n\nIn the late 1940s and 1950s, when Canada experienced a cultural expansion which embodied an upsurge of musical talent in performance and composition, Waddington - as the musician with the greatest employment power and programming responsibility in Canada - was able to channel this talent into broadcasting and thus to give it national and international exposure. During this period program series organized by Waddington served as vehicles and outlets for performers and composers alike. Under his direction the CBC's policy of commissioning Canadian composers became a regular practice. He conducted the premieres of many new works, including Murray Adaskin'sAlgonquin Symphony (1958), Freedman'sNocturne (1952) and Symphony (1961), Matton'sL'Horoscope (1958), Papineau-Couture'sViolin Concerto (1954), Somers'North Country (1948), Suite for Harp and Chamber Orchestra (1949), and Five Concepts (1962), Weinzweig'sEdge of the World (1946) and Divertimento No. 3 (first complete performance, 1961), and Willan's Coronation Suite, B57 (1953).\n\nWritings\n\n'Music and radio,' Music in Canada (Toronto 1955)\n\n'Music will serve you well!' CBC Times, 15-21 Jul 1956"}, {"url": "https://globalnews.ca/news/4445635/doug-davidson-leaving-young-and-the-restless/", "page_content": "Send this page to someone via email\n\nAfter 40 years, Doug Davidson will not be returning to The Young and the Restless.\n\nOn Wednesday, Soaps.com reported that Davidson was leaving the CBS soap opera after a four-decade run as Det. Paul Williams.\n\nThe actor confirmed the news in a statement, saying, “My contract was not renewed in January. I went on recurring, but just until they had new people in place.”\n\nREAD MORE: Eileen Davidson leaving ‘Young and the Restless’ after 36 years\n\n“I have only 2 shows that haven’t aired and no dates. So, as far as I know, I am gone,” he added. No word yet on when his episodes will air.\n\nDavidson, who earned five Daytime Emmy Award nominations for the role of Paul Williams, claimed that he received “no information and no communication” from the network.\n\nStory continues below advertisement\n\n“It feels as diminishing my role was the plan all along, which is their prerogative,” he said.\n\nREAD MORE: Alberta-born actor makes Young and the Restless debut\n\nThe 63-year-old actor addressed his exit from the soap opera on Twitter.\n\n“Honestly Doug, what is going on at Y&R? I have been a faithful viewer since the ‘70’s, but I hardly recognize the show. When are you going to be on again? What’s with all the new people and our beloved characters leaving?” a fan wrote to Davidson.\n\n“They are doing away with history,” Davidson responded.\n\nThey are doing away with history. https://t.co/I5jOYeATCb — Doug Davidson (@DougDavidsonYR) September 11, 2018\n\nIn response to another fan’s question, “They haven’t let you go, have they?” Davidson wrote: “It seems so.”\n\nIt seems so https://t.co/JGHl1xLMwD — Doug Davidson (@DougDavidsonYR) September 11, 2018\n\nREAD MORE: Toronto’s Mishael Morgan On ‘Y&R’ Wedding\n\nAnother fan asked the actor if he had been fired, to which Davidson responded: “That sounds so harsh, but yes.”\n\nThat sounds so harsh, but yes. — Doug Davidson (@DougDavidsonYR) September 11, 2018\n\nWhen another fan asked for clarification on if he would be returning to The Young and the Restless, Davidson wrote, “I have no dates scheduled. Not sure what you want me to say.”\n\nStory continues below advertisement\n\nI have no dates scheduled. Not sure what you want me to say. — Doug Davidson (@DougDavidsonYR) September 11, 2018\n\nDavidson also thanked his fans for their “support and kindness and love.”\n\n“You all are so wonderful. I so appreciate your support and kindness and love. Thanks for a fabulous career,” he wrote.\n\nYou all are so wonderful. I so appreciate your support and kindness and love. Thanks for a fabulous career. — Doug Davidson (@DougDavidsonYR) September 11, 2018\n\nREAD MORE: ‘Y&R’ star Kristoff St. John sues mental health facility over son’s suicide\n\nDavidson first appeared on The Young and the Restless in 1978 as Paul who would later become Det. Paul Williams.\n\nHe won the Emmy award for outstanding lead actor in a drama series in 2013 for his role as Paul Williams.\n\n—\n\nYou can watch ‘Young and the Restless’ on Global at 4:30 p.m. ET/PT."}, {"url": "https://www.waddingtons.ca/discover-five-20th-century-canadian-artists/", "page_content": "a few of the gems in our December 2020 Canadian art auction\n\nAssembling an art auction can be like curating a gallery exhibition. It’s a balance of gathering works by artists that consistently perform well, that the market is hungry for, and a commitment to find and present sometimes lesser known, but equally compelling works by artists who are beginning to realize their potential in the market.\n\nWe’d like to shine a spotlight on five works selected for this auction, offered online December 5 – 10, by artists who we have come to appreciate and are delighted to bring to your attention. While all five of these “hidden gems” created work that defies encapsulation in a short blurb, we hope that you will enjoy these biographies in miniature.\n\nALEXANDRA LUKE (1901-1967)\n\nBorn Margaret Alexandra Luke in Montreal to a prominent Westmount family, the path to a career in abstract art would be a long one, taking her through the unexpected death of her first husband just months after their marriage in 1925, followed by the birth of her first child. Three years later she married Clarence Ewart McLaughlin, grandson of Robert McLaughlin, founder of the McLaughlin Carriage Company which was sold to General Motors in 1918. Ewart’s brother Robert was the first president of General Motors Canada. The family lived in Oshawa, and Luke contributed to the local art community in many important ways.\n\nArt and painting remained central to her life as she had her own large painting studio on the third floor of her estate, “Greenbriar,” and organized many exhibitions locally. She travelled often with like-minded friends to see museum shows in Toronto, Ottawa and likely Montreal and New York, where she would have seen early modernists.\n\nBy the 1930s Luke was publicly advocating for the importance of abstract art, although still painting mainly figurative work at the time. In 1945, at the age of 44, she enrolled in the Banff School of Fine Arts, where she studied under A.Y. Jackson and Jock Macdonald.\n\nHer early work had been influenced by the Group of Seven, a style which began to shift towards abstraction under Macdonald’s tutelage. Further study under Hans Hofmann in Provincetown, Massachusetts, pushed Luke further into non-figurative work. In 1952, Luke organized the first Canadian Abstract Exhibition, where she would meet the members with whom she would form the Painters Eleven group. At the time, abstraction was seen as either subversive and strange, with much controversy surrounding its acquisition by public galleries and organizations. Quebecois artists had been promoting the style since the early 1940s through the Automatiste group that included Paul-Émile Borduas, Marcel Barbeau, Jean Paul Riopelle and others. However, this modernist push had not yet penetrated English Canada.\n\nThe Painters Eleven group was formed in 1953 to remedy the paucity of abstraction in the public eye. Members included Luke, Jack Bush, Oscar Cahén, Hortense Gordon, Tom Hodgson, Jock Macdonald, Ray Mead, Kazuo Nakamura, William Ronald, Harold Town and Walter Yarwood. Other than a strong commitment to abstraction, these artists shared no common artistic vision. By 1960, the group disbanded, and while they had only been together for a short period, had indeed managed to shape Canada’s artistic landscape. In the words of Luke’s granddaughter, Wendy Moses, “barely eight years after [Luke] began painting seriously, this Ontario housewife had become a leading spirit in the dynamic avant-garde of Canadian art.”\n\nLuke’s painting Untitled, above, lot 12 in our December 5 – 10 auction, comes from the seminal period of abstract work in her oeuvre.\n\nGEORGE douglas PEPPER (1903-1962)\n\nEducated at the Ontario College of Art in Toronto, Pepper studied with J.W. Beatty and J.E.H. MacDonald.\n\nThe influence of the Group of Seven can be felt in Pepper’s work, echoed in the undulating forms and lively palette. Pepper continued his studies in Italy and France, notably in Paris at the Académie de la Grande Chaumière. Returning to his hometown of Ottawa, Pepper married artist Kathleen Daly in 1929, with whom he would later travel to the Arctic to study Inuit Art. Pepper and his wife moved back to Toronto so that Pepper could take a job teaching at his alma mater, a career interrupted by a stint as a war artist from 1943-1946. By 1950, Pepper was promoted to vice-principal of OCA.\n\nPepper is also noted as one of the founding members of the Canadian Group of Painters. Following the Group of Seven’s disbandment in the early 1930s, this new group was formed in 1933 so as to include modern artists and a wider variety of styles. The Canadian Group of Painters included several members of the Group of Seven, including A.J. Casson, Arthur Lismer, A.Y. Jackson, F.H. Varley and Franklin Carmichael, with a total of 28 English-speaking founding members. The new group had no formal manifesto, but operated under the objective to foster closer bonds between Canadian artists and to encourage Canadian artistic expression.\n\nLot 45, Boathouses on the Ottawa River, is dated to 1930, the year Pepper would move from Ottawa to Toronto to begin working at the OCA. It is a very rare occasion to have the opportunity to acquire a canvas of this size and quality by the artist.\n\nHENRIETTA MABEL MAY (1877-1971)\n\nBorn in Montreal, Mabel May displayed an early interest in art, though it was only in her mid-twenties that she enrolled at the Art Association of Montreal, where she would study with William Brymner. Travels in Europe introduced the young artist to the work of the Impressionists, which enthralled her—particularly the work of Monet and Renoir.\n\nMabel May was a founding member of two important artistic groups, the Beaver Hall Group and the Canadian Group of Painters. The former was organized in 1920, when Mabel May and Randolph Hewton, Edwin Holgate and Lilias Newton, fellow graduates of the Art Association of Montreal, were looking for affordable studio space. They rented a three-story house at 305 Beaver Hall Hill, and invited several colleagues to join them in the space. This group soon included eleven men and eight women, which would be led by their elected president A.Y. Jackson. Jackson displayed his own work alongside that of the Beaver Hall Group, while also inviting members to show work in broader circles including Group of Seven exhibitions. The Beaver Hall Group would disband after only two years, though many of the relationships forged between the female artists endured over the subsequent years.\n\nAlongside George Pepper, Prudence Heward and many others, Mabel May was a founding member of the Canadian Group of Painters in 1933. Her work was exhibited widely in local, national and international venues, as well as being acquired by important institutions. The Depression brought challenges, and to make ends meet, Mabel May began to teach art classes to children at an Ottawa girls’ private school as well as at the National Gallery of Canada. Mabel May returned to Montreal in 1947, where she would stay for three years before retiring to Vancouver to be closer to members of her family.\n\nPETER CLAPHAM SHEPPARD (1879-1965)\n\nLouis Gagliardi, an expert on the artist, notes that Peter Clapham Sheppard’s works “offer us a fresh and dynamic alternative to the Group [of Seven].” Sheppard began his career apprenticing as an engraver and lithographer, subsequently studying more formally at the Central Ontario School of Art and Design and the Ontario College of Art. His work was exhibited extensively alongside that of members of the future Group of Seven, with Sheppard rising to the top of the Toronto art scene in the early 1900s. A modernist, Sheppard’s work centred on the urban and northern landscape as well as the figure. Influenced both by Impressionism and the Ashcan School, Sheppard would travel extensively throughout Europe and the United States.\n\nSheppard’s career was soon eclipsed when the Group of Seven came into being. Tom Smart, in a biography of the artist, notes that Sheppard “did not seek out or describe nationalistic symbols or utopias in the northern landscape. His was a very different source of inspiration, articulated in a form of urban pastoral and in scenes of economic growth embodied in civil engineering projects and in the rail yards.” Sheppard’s compositions are thoughtful, but tip towards the human rather than the romantic or grand. Overshadowed by the grand objectives of the Group of Seven and the encroachment of abstraction, Sheppard died in near obscurity.\n\nIn his rich telling of the artist’s biography, Gagliardi notes that perhaps the most important relationship of Sheppard’s life was with Bernice Martin, an artist whom he met at the funeral of J.W. Beatty in 1941. The two maintained a friendship for the next 24 years, with Martin tending to Sheppard in his old age. Martin inherited the artist’s estate, and a chance encounter of her own with Gagliardi helped to reignite Sheppard’s legacy. It is a heartwarming story, and best told by Gagliardi himself—to read more about Sheppard’s path from fame to obscurity and back again, please click here.\n\nWe are pleased to offer three works by Sheppard in this auction: lot 41, lot 44 (pictured above) and lot 58.\n\nSTANLEY FRANCIS TURNER (1883-1953)\n\nTurner was born in Aylesbury, England in 1883, immigrating to Canada at the age of 20. He began farming in Saskatchewan while continuing to make art. In 1911, Turner moved to Toronto to work in the advertising department of the Timothy Eaton Company. Seven years later, he would switch firms, joining Rous and Mann Press Ltd, where he would work under Franklin H. Carmichael, one of the founding members of the Group of Seven. (A.J. Casson, who would join the Group in 1926 at the invitation of Carmichael, was also working at Rous and Mann at the time.)\n\nTurner also studied at the Ontario College of Art in Toronto, where he was taught by George Reid and J.W. Beatty. These influences, combined with an interest in Japanese prints, can be felt in his work. During World War II, Turner was twice commissioned by The Globe and Mail to illustrate war maps.\n\nPlease note the two paintings by Turner in this auction, lot 46 (pictured here) and lot 47.\n\nAUCTION INFORMATION\n\nThe auction is offered online from December 5 – 10.\n\nWe invite you to browse the full catalogue for the Canadian Art auction.\n\nShould you have any questions or require additional photographs or condition reports, please do not hesitate to contact us at [email protected].\n\nSign up for our newsletters\n\nFind out about all our auctions and events by signing up for our e-newsletters."}, {"url": "https://www.monstersandcritics.com/tv/soaps/what-happened-to-paul-on-the-young-and-the-restless/", "page_content": "What happened to Paul on The Young and the Restless? That’s the question on fans’ minds as the character remains off-screen despite storylines that could use his Paul Williams (Doug Davidson) detective touch.\n\nToday’s episode of Y&R brought even more curiosity about Paul as his wife, Christine (Lauralee Bell), had a reunion with her ex-husband Danny (Michael Damian).\n\nWhile Christine mentioned Paul, he was nowhere to be found as she simply spoke of their trip and the couple seeing Danny in concert.\n\nThat’s been par for the course for the veteran character, which debuted on the hit CBS soap opera back in 1978.\n\nSo why has Paul remained off the canvas for so long, and will he ever return?\n\nSign up for our newsletter!\n\nLet’s take a look.\n\nWhat happened to Paul on The Young and the Restless?\n\nIn 2018 Doug revealed that The Young and the Restless had opted not to renew his contract and instead put him on recurring status, which means he would be used sporadically.\n\nAfter Doug’s initial run ended, Paul was occasionally seen in 2019 but was used as a secondary character appearing in less than 30 episodes that year.\n\nThe character was used briefly in 2020 as he was part of Eric Braeden’s (Victor) 40th-anniversary special. Paul was also featured in a storyline where Billy (Jason Thompson) was a suspect in the accidental shooting of Chance (then Donny Boaz).\n\nIn fact, the last time Paul was on-screen was in Lily’s office in 2020 to question him about the case.\n\nActually, it was Lily’s office and not explained. ?‍♂️ I am tired of fighting for the obvious https://t.co/59bY2xGRWV — Doug Davidson (@DougDavidsonYR) March 6, 2021\n\nSince then, Paul has been mentioned, but as other vets like Christine, Lauren (Tracey E. Bregman), and Michael (Christian LeBlanc) pop up from time to time, Paul only gets an honorable mention.\n\nWill Paul return to Y&R?\n\nSadly, the odds of Paul and the talented Doug Davidson returning to the hit daytime drama are slim to none. Doug took to social media in the spring of 2021 to thank fans for all their support and to share he was done with the CBS show.\n\nPic credit: @DougDavidsonYR/Twitter\n\nDoug doubled down on his desire not to reprise the role of Paul this past summer after a fan took to Twitter to praise the actor and character while also hoping they would both return to Genoa City.\n\n“You are so incredibly kind writing such a sweet tweet. I truly appreciate it, but I can’t see things changing,” the actor tweeted.\n\nPic credit: @DougDavidsonYR/Twitter\n\nPaul Williams and Doug Davidson will forever be cemented in The Young and the Restless history. It’s too bad that behind-the-scenes drama impacted this legacy, especially since Paul’s cop skills could definitely be used these days.\n\nThe Young and the Restless airs weekdays on CBS."}, {"url": "http://www.billgladstone.ca/obit-miriam-waddington-2004/", "page_content": "To the many friends and critics who feel that Canadian-Jewish poet and writer Miriam Waddington did not get the recognition she deserved in life, her recent death in Vancouver seems especially sad and ironic because it occurred only weeks before she would have gained what may very well be her largest popular reading audience and her most widely-circulated stanza of poetry.\n\nAmong a multitude of other poems, she is the author of the poem “Jacques Cartier in Toronto,” which has been excerpted on the back of the new $100 bill due to go into general circulation later this month.\n\nWaddington, who died on March 3 at the age of 86, is remembered for her varied and wide-ranging literary output that includes nearly a dozen volumes of poetry, critical studies of A.M. Klein and other writers, short stories, translations of Yiddish storiesand poems into English, and a series of semi-autobiographical essays on literature and life published under the title Apartment Seven.\n\n“Her writing is what she would want us to remember — or better still, to read, and read again,” William Toye, her long-time editor at the Toronto office of the Oxford University Press, was to have said at a memorial service scheduled for last Saturday in Vancouver.\n\nBorn in 1917 to Russian-Jewish parents who arrived in Winnipeg before WWI, Miriam Dworkin grew up in the city’s immigrant north end in a home in which only Yiddish was allowed to be spoken, and in which a formidable portrait of writer Y.L. Peretz looked down at the family from the dining-room wall. She was raised in a secular, socialist milieu filled with lively dinners, meetings, lectures, picnics, outings and other social events.\n\nEducated in Yiddish at the local Peretz school, she developed an enduring affection for the works of Sholom Aleichem and other Yiddish writers and poets, some of whom she would later translated into English. “I could have found my way around Kasrilevke blindfolded and I readily identified with Sholom Aleichem’s juvenile heroes,” she would write.\n\nWhen she was 12, the family moved to Ottawa and made new connections with like-minded Jews in Ottawa and in nearby Montreal. The budding young poet was soon introduced into the salon of Yiddish poet Ida Maza and an effervescent sphere of writers, artists and socialist thinkers.\n\nShe attained a B.A. in English from the University of Toronto in 1939 and an M.A. in social work from the University of Pennsylvania. She and her new husband, Patrick Waddington, then settled in Toronto, where she took a job in social work and immersed herself in the city’s literary circles.\n\nMoving to Montreal about 1945, she was drawn into the heart of what Ruth Panofsky, associate director of Com-Cult at Ryerson University, describes as “the cultural flowering that took place in Montreal in the 1940s.”\n\nAccording to Panofsky, who studied with and became a close friend to Waddington, “She was at the centre of that movement but she’s been forgotten because she was participating beside Irving Layton, Louis Dudek and others. . . .”\n\nA first volume of poems, Green World, appeared in 1945. Others would include The Second Silence (1955), The Season’s Lovers (1958), The Glass Trumpet (1966), Say Yes (1969), The Price of Gold (1976), Mister Never (1978), The Visitants (1981) and The Last Landscape (1992).\n\nA divorced and single mother of two sons, Waddington returned to Toronto and joined York University’s English department in 1964, where she taught a trailblazing course dealing with the social voice in Canadian writing.\n\nIn 1970 she published a scholarly book on A. M. Klein and edited an anthology of his poems that appeared two years after his death, in 1974. Many regard her as a pioneer in the burgeoning field of Klein studies.\n\nHer book “was the first really important book on Klein,” according to Trent University Professor and Klein scholar, Zailig Pollock.\n\n“She tended to see Klein from her own very particular point of view and to emphasize the secular-reformist quality of Klein rather than the orthodox aspect of his work. She tended to see him much more as a secular enlightened Jew rather than an upholder of orthodoxy.\n\n“Not everybody agreed with this view, but she presented it very elegantly and compellingly, and she had a real influence on people’s view of Klein and his place in Canadian literature.”\n\nRetiring from York in 1983, Waddington edited Canadian Jewish Short Stories, an anthology published by Oxford in 1990. Within a few years she moved to Vancouver to be near her son Jonathan. She soon joined a Yiddish reading group and remained active in it until only last December.\n\nThree years ago, she was honoured at a large tribute dinner organized by Richard Menkis, a member of the Association of Canadian Jewish Studies, and held in Vancouver’s Beth Israel synagogue.\n\n“We decided to honour Miriam for her contribution to Canadian Jewish life,” Menkis, an associate professor at UBC, recalled. “We wanted to celebrate her contribution as a poet. She dealt with a wide variety of themes, including some that were explicitly Jewish. She was a unique and wonderful and powerful voice.”\n\nWhile even her friends acknowledge she could be strongly opinionated at times, most saw through her ironic veneer to the heart of gold that lay beneath.\n\n“She was lovable, bubbly, adorable and just delightful,” said her longtime friend, Frances Blugerman of Toronto. “She was a wonderful hostess, a great cook, and a very warm and devoted friend to hundreds of people, if that’s possible.”\n\nA recipient of the J.J. Segal award in 1972, she published a short story collection, Summer at Lonely Beach, and contributed articles and reviews to Canadian Forum, the Globe and Mail and many other publications.\n\nShe leaves son Jonathan in Vancouver and son Marcus in Nova Scotia. She also leaves nearly 11 linear metres of her papers and other materials in the custody of the National Archives of Canada.\n\n“She’s part of the canon of Canadian poets, and in a week or two, one of her poems will be on the Canadian $100 bill,” Menkis remarked. “Still, it would have been nice to see her get wider recognition.” (2004)\n\n* * *"}, {"url": "https://imprintingcanada.library.torontomu.ca/chapters/chapter-3/case-studies/miriam-waddington/", "page_content": "Ryerson Press helped launch the career of Miriam Waddington (née Dworkin) (1917-2004), who is regarded today as one of Canada’s groundbreaking modernist poets. In the 1950s, Ryerson published two volumes of Waddington’s socially conscious verse, The Second Silence (1955) and The Season’s Lovers (1958) — in editions of 500 copies each — setting the stage for a career that spanned the latter half of the twentieth century.\n\nWaddington was born in Winnipeg to Russian Jewish immigrants. Her parents were secular Jews “deeply involved in the vivid intellectual life of Winnipeg’s Russian Jewish community,”1 which was concentrated in the city’s North End, a vibrant enclave of Jewish, Polish, and Ukrainian immigrants and one-time centre of Jewish life in the West. Today, Winnipeg’s North End enjoys the same legendary status as St. Urbain Street in Montreal, immortalized in large part by novelist Mordecai Richler as the former Jewish heart of that city. The Dworkins may not have attended synagogue, but their circle of friends and acquaintances included Jewish and Yiddish writers and poets, lecturers, musicians, and actors, some of whom were Zionists, socialists, and anarchists.2\n\nThe language spoken at home was Yiddish and Waddington absorbed its familiar tone and “conversational directness,”3 qualities that would come to characterize her own verse in English. She learned the value of Yiddish from her parents who signaled its cultural significance: “My parents made a conscious effort that we should speak only Yiddish at home, because they felt like many secular Jews that a language was a culture … a spiritual home … and since they were not religious they perhaps transferred their religious feelings to the language and literature and to the Yiddish culture.”4\n\nWaddington’s formative years were characterized by tension between her inner and outer lives. She recalled that her “inner life, my really freer life was the one I had in the Jewish parochial school,”5 the I.L. Peretz Folk School, which she attended until grade four. In 1927, she left the liberal atmosphere of the socialist-oriented parochial school and transferred to a public school. Much “more authoritative”6 than the Peretz Folk School, Machray School served students from diverse cultural backgrounds. Students were of Jewish, Polish, Galician, English, and Scottish heritage and the majority of the teachers were of Scottish origin. Although Waddington had fond memories of her teachers — they “were very nice, [and] I think they had a strong moral sense”7 — her fellow students were less congenial. During her years at Machray, she regularly heard the racist slur “dirty Jew.”8 She quickly learned that “it wasn’t good to be Jewish, but … it was really good to be English.”9 As a result, she developed ambivalent feelings for her Yiddish-speaking parents and their friends. Her ambivalence ran deep: “The injustice of being excluded from certain things because I was Jewish often embittered my life.”10\n\nIt was as a grade six student at Machray School, however, that Waddington first tried her hand at poetry. Poetry soon became her “refuge”11 and the “act of writing that relocates the inner feelings and outer experience”12 became a source of pleasure, too.\n\nIn 1930, Waddington’s family moved to Ottawa, where she attended Lisgar Collegiate Institute. Six years later, she entered the University of Toronto. She earned a BA in English in 1939 and a diploma in social work in 1942, and for the next two years was a case worker with Jewish Family and Child. In 1944, Waddington enrolled in the University of Pennsylvania’s School of Social Work as a Master’s student and was a case worker with the Philadelphia Child Guidance Clinic while she studied toward her degree.\n\nWaddington once described herself as a “divided person … I have this side of me that is practical, that is realist, rational and is interested in ideas. And I have a social side and … an individual side. I feel guilty, if I don’t do something in a societal way.”13 Although she completed an undergraduate degree in English, Waddington chose a career in social work. Her firm belief in social responsibility and community — that to “love humanity takes courage, daring, and faith”14 and that “one should [not] be too individual”15 — drove her altruism. Her rational side, however, responded to the theories of psychoanalyst Otto Rank, who argued for a balance between “creative and cognitive processes” and believed that the artist unconsciously “searches out and finds … the experiences he needs for his art.”16 Rank’s view that the artistic impulse is an attempt to reconcile individual and collective tendencies held great meaning for Waddington.\n\nWaddington’s experience at the University of Pennsylvania was “liberating, painful, and growth-producing”17 and had a lasting effect on her life and work. In fact, her earliest verse was concerned explicitly with the social conditions of urban life and invoked the experiences of actual individuals she had counseled. As she recalled, in “poetry the relation between myself and the client somehow became closer and more intimate, and I could not help writing many poems about my experiences in child-guidance clinics, adoption and family agencies, hospitals, courts, and prisons.”18\n\nWaddington earned an MSW in 1945 and that summer moved to Montreal with her husband, Patrick Waddington, who had accepted a job with the International Service of the CBC. Between 1945 and 1960, she pursued a career in social work, balancing part-time case worker positions and lecturing at McGill University’s School of Social Work while she raised her two sons, Marcus (born in 1946) and Jonathan (born in 1951). Although “the physiological and social demands of being mother, wife, and household manager dominated”19 her life, Waddington continued to write in the evenings. Her writerly ambitions were further roused when she joined Montreal’s vibrant literary community, which had formed in the early 1940s around John Sutherland, the writer, critic, and founder of the literary magazine First Statement and First Statement Press. In fact, Waddington once confessed to having “always been a poet, before I was anything else and more truly than I was anything else.”20\n\nWaddington had hoped to place her first volume with Ryerson Press, but was twice rebuffed by Lorne Pierce in 1943 and 1945. As a result, First Statement Press, a small literary publisher, issued Waddington’s first book of poems, Green World, in 1945.21 It was, however, the more established and influential Ryerson Press, which published her next two books — The Second Silence in 1955 and The Season’s Lovers in 1958 — that eventually generated the critical attention Waddington deserved.\n\nWaddington believed that content and form were inseparable and that each poem was an “organic” structure with “its own existence and integrity … part of a particular time, place, and person.”22 Her approach to the act of writing was often intellectual, but her verse was never cerebral and her language was consistently “transparent and simple so that it could say something that others would recognize and respond to.”23 Her poetic persona — the outsider who is allied with the marginalized and feels sympathy for the vulnerable — and lyric voice — direct, questioning, often troubled — were distinguishing features of her verse. In addition, attention to poetic form regularly lent her work a playful, open quality.\n\nAlthough she often resisted “getting started … once I do … I write and scratch out a lot … I start out with an image or a line, one thing leads to another, and then I have a rough draft.”24 It was Waddington’s practice “to write the whole poem out in a sketchy form; and then if I have two or three unbroken days, I work on that same poem for maybe four or five hours a day … I revise and revise and revise while I’m working on a poem … the essence of writing is in the revisions.”25 Initial drafts were composed by hand and then revised on a typewriter; Waddington never used a computer. When she did not “have time to finish a poem, and I usually don’t, I put it away. Though I always plan to, I seldom go back to a poem after several weeks or months. As a result I have many folders of unfinished poems.”26 Waddington mourned these unfinished efforts as “orphan” poems.\n\nWaddington was always a voracious reader of verse and her two collections of the 1950s issued by Ryerson deployed traditional poetic conventions — formal stanzaic structure, long lines, and “occasional flamboyant language”27 — the marked influence of Dylan Thomas and W.B. Yeats, whose work she knew and admired. Initially, she aimed for “formality, measure, lucidity, spaciousness, and proportion”28 in her poetry. Peter Stevens, in his 1985 profile of Waddington, notes that she read the English poets of the 1930s, and critic L.R. Ricou has traced her poetic affinity with the American writer Theodore Roethke.29\n\nAmong Jewish contemporaries, Waddington’s compassionate humanism aligned more closely with the reflective and literate tenor of A.M. Klein’s verse than the flamboyant and rousing quality of Irving Layton’s poems, and the intimate tone of much Yiddish poetry. Waddington, like Klein and Layton, gradually turned away from conventional verse forms in favour of modernist experimentation, but her perspective as a secular Jew differentiated her poetry from that of the more traditional Klein and her sentience diverged from the hyper-masculinist ethos embraced by Layton.\n\nWaddington’s earliest verse received a mixed reception from the coterie of critics who reviewed her work. A critical bias against Waddington’s poetry was especially evident in the 1940s and 1950s, a period of intense self-scrutiny among Canadian critics who sought to articulate a modernist literary practice that excluded much writing by women. Like their British and American counterparts, Canadian modernist critics — the majority of whom were male — valued “an implicitly masculine aesthetic of hard, abstract, learned verse that is opposed to the aesthetic of soft, effusive, personal verse supposedly written by women.”30 Critic Carole Gerson identifies “the critical canon-forming decades between the wars” as favouring women’s writing that conformed “to a Romantic/sentimental/domestic model.”31 Such writing was easily dismissed by male critics, as were attempts by female authors to engage “with modernist methods.”32 Hence, women writers were doubly disadvantaged, but Waddington was determined to leave her mark as a socially engaged poet with a focus on the quotidian and she continued to write.\n\nNorthrop Frye and Eli Mandel were two prominent critics who offered balanced assessments of Waddington’s first publications. For Frye, The Second Silence revealed Waddington’s “own distinctive quality: a gentle intimacy and an unmediated, though by no means naïve, contact between herself and her world.”33 He singled out “Morning until Night” as a poem of striking originality, which turns on an irresolvable conflict of identity: “Two crows have I harboured long in me, / Because I love doves I imprisoned crows, / Forced them to silence; at night they wakened me / With constant clamour.” Frye later observed that the poet’s “two gifts, one for spontaneous lyricism and one for precise observation” were “better integrated”34 in The Season’s Lovers.\n\nMandel — who was himself a poet — observed that Waddington was an accomplished urban poet: “No one else knows [the city] … like she does or tolerates it so completely.”35 Mandel was moved particularly by “the stunning conclusion … horrifying in its ambiguities”36 to “My Lessons in the Jail”: “For moments in the hallway, compose your face / To false good humor, conceal your sex: / Smile at the brute who runs the place / And memorize the banner, Christus Rex.”\n\nIn 1986, Waddington claimed that “an artist shouldn’t exploit his/her personality. The work should speak for itself and the personality should remain in the background.”37 Although she struggled to divorce personality from artistic expression, life experience nonetheless informed Waddington’s verse, gave it its distinct shape and colour, dimension and depth — precisely those facets of her poetry that resonate still with today’s readers. The Ryerson Press must be credited with recognizing Waddington’s artistry and encouraging her poetic development. Moreover, in publishing the work of Waddington and other Jewish poets — A.M. Klein, Norman Levine, and Eli Mandel, for example38 — Ryerson Press, whose roots lay in the Methodist Church, showed a striking openness and commitment to showcasing Canada’s diversity."}, {"url": "https://en.unionpedia.org/i/Paul_Y._R._Waddington", "page_content": "Paul Y. R. Waddington Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories. [1]\n\n6 relations: Balloon buster, List of World War I aces credited with 11–14 victories, List of World War I flying aces from France, Louis Prosper Gros, Paul Barbreau, Théophile Henri Condemine.\n\nBalloon busters were military pilots known for destroying enemy observation balloons.\n\nNew!!: Paul Y. R. Waddington and Balloon buster · See more »\n\nThis list is complete.\n\nNew!!: Paul Y. R. Waddington and List of World War I aces credited with 11–14 victories · See more »\n\nThis is a complete list of French flying aces of World War I. It may be of interest to note, that Roland Garros is often called the first French Ace, but in fact he has only 4 confirmed victories.\n\nNew!!: Paul Y. R. Waddington and List of World War I flying aces from France · See more »\n\nSous Lieutenant Louis Prosper Gros (24 July 1893 – 3 March 1973) became a flying ace during World War I, scoring eight confirmed aerial victories, and possibly a ninth.\n\nNew!!: Paul Y. R. Waddington and Louis Prosper Gros · See more »\n\nCaptain Paul Augustin Edouard Barbreau (16 September 1894 – 2 June 1976) was an Algerian-born French World War I flying ace credited with eight aerial victories.\n\nNew!!: Paul Y. R. Waddington and Paul Barbreau · See more »\n\nLieutenant Colonel Théophile Henri Condemine, or Henri Théophile Condemine, was a French soldier and fighter pilot who began his military career during World War I. He became a flying ace credited with nine confirmed aerial victories, all against observation balloons.\n\nNew!!: Paul Y. R. Waddington and Théophile Henri Condemine · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Paul_Y._R._Waddington"}]}