{"Paul Y. R. Waddington has held visiting positions at the University of California, Berkeley, the University of Pittsburgh, and the University of Toronto.": [{"url": "https://www.biographies.net/biography/paul_y._r._waddington/m/0cmc2mc", "page_content": "Who was Paul Y. R. Waddington?\n\nSous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N12 on 28 March 1917. He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917. A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa154, on 6 March 1918."}, {"url": "https://wiki2.org/en/Paul_Y._R._Waddington", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nSous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.[1]\n\nEarly life\n\nPaul Yvan Robert Waddington was born in Lyon, France, on 28 October 1893.[1]\n\nWorld War I military service\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.[1]\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N.12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917.[1] He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917.[2] A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa.154 (which operated Spads), on 6 March 1918.[1] Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine.[2] On 19 September 1918, he was transferred to his final wartime post, with Escadrille SPA.31.[1] He scored his final triumph solo ten days later.[2] On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.[1]\n\nPostwar career\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II.[3]\n\nReferences\n\nOver the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914–1918 Norman L. R. Franks, Frank W. Bailey. Grub Street, 1992. ISBN 0-948817-54-2, ISBN 978-0-948817-54-0.\n\nEndnotes\n\na b c d e f g Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914–1918 . p. 220. a b c The Aerodrome [1] Retrieved on 23 July 2010. ^ Over the Front: A Complete Record of the Fighter Aces and Units of the United States and French Air Services, 1914–1918 . p. 221."}, {"url": "https://alchetron.com/Paul-Y-R-Waddington", "page_content": "Sous Lieutenant Paul Yvan Robert Waddington was a French World War I flying ace credited with twelve aerial victories.\n\nWaddington joined the 141e Regiment d'Infanterie on 15 December 1914 as a Soldat de 2e classe. He was promoted to Corporal on 21 June 1915; exactly a month later, he was forwarded to the 2e Groupe d'Aviation. On 27 September, he was assigned to Escadrille 67. He was promoted to Sergeant while with this unit, on 11 March 1916.\n\nWaddington reported for pilot's training at Buc on 3 September 1916. He was awarded Military Pilot's Brevet No. 5254 on 26 January 1917, and forwarded for advanced training at Avord, and then Pau. He was then posted as a pilot with Escadrille N12 (the \"N\" denoting the unit's use of Nieuports) on 28 March 1917. He teamed with Alfred Auger and Joseph M. X. de Sévin for his first victory on 11 May 1917. A promotion to Adjutant followed on 20 July 1917, with a further promotion to Sous lieutenant on 25 January 1918. He transferred to Escadrille Spa154 (which operated Spads), on 6 March 1918. Between 12 April and 22 August 1918, he ran off a string of five victories each over enemy airplanes and observation balloons, with all but one of the wins being shared with such fellow French aces as Xavier Moissinac, Paul Barbreau, Louis Prosper Gros, Michel Coiffard, Jacques Ehrlich, and balloon buster Theophile Condemine. On 19 September 1918, he was transferred to his final wartime post, with Escadrille Spa31. He scored his final triumph solo ten days later. On 9 November 1918, he was awarded the Légion d'honneur to accompany his prior awards of the Croix de Guerre with five palmes, one étoile de vermeil, one étoile d'argent, and another étoile de bronze. He had also won a Belgian Croix de guerre and a Serbian decoration.\n\nWaddington would later rise to lieutenant colonel and command a school for fighter pilots before World War II."}, {"url": "https://linguistics.berkeley.edu/~hyman/", "page_content": "Distinguished Professor of the Graduate School\n\nDirector, France-Berkeley Fund\n\nUniversity of California, Berkeley\n\nCurriculum vitae [PDF]\n\n(lastname) @ berkeley.edu\n\nPh.D., Linguistics, University of California, Los Angeles, 1972. Except for a two-year leave with a Postdoctoral Fellowship from the Miller Institute for Basic Research in Science (U.C. Berkeley, 1973-1975), he taught at the University of Southern California from 1971 to 1988. He came to Berkeley's Department of Linguistics in 1988, which he chaired from 1991 to 2002. He has worked extensively on phonological theory and other aspects of language structure - particularly as concerns the history, typology, and description of the Niger-Congo languages of Africa, especially Bantu. He has published several books (e.g. Phonology Theory and Analysis, A Theory of Phonological Weight) and numerous theoretical articles in such journals as Language, Linguistic Inquiry, Natural Language and Linguistic Theory, Phonology, Studies in African Linguistics and Journal of African Languages and Linguistics.\n\nHis current interests center around phonological theory, tone systems, and the comparative and historical study of the Bantu language family (of about 500 languages) for which he founded the Comparative Bantu On-Line Dictionary (CBOLD), originally funded by the National Science Foundation and in collaboration with the Laboratoire Dynamique du Langage (CNRS / Université Lyon 2). He is also currently Director of the France-Berkeley Fund and has held several visiting positions in Lyon, Paris and Toulouse.\n\nLarry Hyman receiving award of Chevalier de l'Ordre des Palmes Académiques from Consul General of France Frédéric Jung in San Francisco, May 25, 2022:"}, {"url": "https://www.cityofhope.org/thomas-waddington", "page_content": "I love to educate people. I enjoy working with my patients and teaching them about what the disease is they may have and what we are going to do about it.\n\nThomas Waddington, M.D., has known since age 5 that he was going to be a doctor.\n\nA native Southern Californian, he specializes in the relatively new field of interventional pulmonology, using the most advanced tools to diagnose and treat lung cancer and other diseases. \"I want to help those people who are fighting back or even those who've chosen hospice care and need help with their quality of life,\" he says.\n\nDr. Waddington received his medical degree from St. Louis University School of Medicine and continued his training at University of California Irvine and Virginia Mason Medical Center in Seattle. He completed a diverse series of fellowships in pulmonary and critical care, as well as interventional pulmonology.\n\nDr. Waddington has held a number of pulmonary care positions at prestigious facilities in San Diego, Phoenix and State College, Pennsylvania. He is excited to return to City of Hope where he spent part of 2005-2006 as a young trainee, and he welcomes the opportunity to focus on cancer care medicine within City of Hope's unique environment."}, {"url": "https://melc.berkeley.edu/faculty/ahmed.html", "page_content": "Asad Q. Ahmed, Ph.D. (Princeton University, 2007)\n\nMagistretti Distinguished Professor of Middle Eastern Languages and Cultures.\n\nProfessor of Arabic and Islamic Studies.\n\nDirector, Center for Middle Eastern Studies\n\n\n\nResearch Interests\n\nArabo-Islamic philosophy and theology, with a special focus on logic and epistemology; classical Arabic poetry and poetics; Hadith studies; Tafsir; and Graeco-Arabic\n\nasad.ahmed@berkeley.edu 250 Social Sciences Bld\n\nDepartment of Middle Eastern Languages and Cultures\n\nAbout Asad Q. Ahmed:\n\nAsad Q. Ahmed is Magistretti Distinguished Professor of Middle Eastern Languages and Cultures, Professor of Arabic and Islamic Studies, Affiliate Professor in the Department of Philosophy, and the Director of the Center for Middle Eastern Studies at the University of California, Berkeley. He received his B.A. in 2000 from Yale University, majoring from the Department of Philosophy and the Department of Literature. He was awarded a Ph.D. in 2007 from the Department of Near Eastern Studies, Princeton University.\n\n\n\nProfessor Ahmed specializes in early Islamic social history and pre-modern Islamic intellectual history, with a special focus on the rationalist disciplines, such as philosophy, logic, legal theories, and astronomy. Although he has worked extensively on Islamic intellectual history of the so-called classical period (ca. 800-1200 CE), his current focus is the period ca. 1200-1900 CE, especially with reference to the Indian subcontinent. He is the author of The Religious Elite of the Early Islamic Hijaz (University of Oxford, 2011), Avicenna’s Deliverance: Logic (Oxford University Press, 2011), and Palimpsests of Themselves: Logic and Commentary in Muslim India (University of California Press, 2022). He is also the co-editor of several collected volumes, including The Islamic Scholarly Tradition (Brill, 2010), Islamic Cultures, Islamic Contexts (Brill, 2015), The Hashiya and Islamic Intellectual History (Oriens, special issue, 2013), and Rationalist Disciplines and Postclassical Islamic Legal Theories (Oriens, special issue, 2018). He has also published several articles in the aforementioned fields. His general training includes Graeco-Arabica, classical Arabic poetry and poetics, and hadith and Qur'anic Studies.\n\n\n\nProfessor Ahmed is the co-editor of the Berkeley Series in Postclassical Islamic Scholarship (UC Press), The Cambridge Series in South Asian Intellectual History (Cambridge University Press) and of the journals Oriens (Brill) and The Journal of South Asian Intellectual History (Brill). He also serves on the advisory board of several international journals and book series. His awards include fellowships from the Institute for Advanced Study, Princeton, the Stanford Humanities Center, and the National Endowment for the Humanities. He has also held visiting appointments as a Term Chair at the EHESS, Paris, and a Leverhulme Visiting Professor at the University of Cambridge.\n\n\n\nProfessor Ahmed is very happy to receive queries and applications from students wishing to pursue doctoral studies in his fields of interest and expertise, and he welcomes manuscripts of books and articles for publication in the venues noted above.\n\n\n\n"}, {"url": "https://www.cambridge.org/core/journals/history-of-education-quarterly/article/abs/becoming-the-rolling-quads-disability-politics-at-the-university-of-california-berkeley-in-the-1960s/1E1E662519CA9D4D53C0A3081E469033", "page_content": "“We're organized and we're taking over,” Ed Roberts announced triumphantly. A group of University of California at Berkeley (UCB) students, quadriplegics housed in the university's Cowell Hospital, had summoned Medical Director Henry Bruyn to an impromptu meeting. They conversed in a double-sized hospital room that served as Roberts's campus housing. It was the only billet on campus that had enough space for the enormous iron lung where he slept. But the room seemed small that day with almost a dozen students in electric wheelchairs crammed in for the urgent session. It was late September, 1969. The disabled students were angry because the California Department of Rehabilitation (DOR) had suddenly withdrawn the housing, medical, and academic assistance funding from two students for violating a stringent set of new rules. Confronted with a challenge the students experienced as personal and political, they rallied in solidarity to fight for greater control over services and support supplied by the DOR. As Roberts ambitiously declared, living in an era when most quadriplegics were assumed to be unable to attend college or hold a job, they wanted to take control of their own lives.Footnote 1\n\nSeven years earlier, in 1962, Roberts was the first UCB student housed on the third floor of Cowell Hospital. The campus medical facility had an empty floor that Bruyn offered to Roberts, a post-polio quadriplegic, as makeshift student housing. There was no way his wheelchair or iron lung could enter the campus dormitories. The following year, Roberts was joined by John Hessler, a tall, physically imposing figure who had suffered a broken neck in a swimming accident in the San Joaquin River Delta at age sixteen. Warehoused for over five years at the Martinez County Hospital, he enrolled in UCB in 1963.\n\nHessler's biography of escaping a dead-end existence in a hospital or nursing home was common among the disabled young people who inhabited Cowell Hospital in the intervening years. Cowell became the unofficial dormitory for a small number of physically disabled students, accommodating wheelchair-using men. Meals were brought up on trays from the hospital cafeteria. Financed by the DOR plus an uncoordinated patchwork of welfare funds, the disabled students hired, trained, and supervised their own personal care attendants. Nursing care, focusing on issues related to catheter hygiene, bladder irrigations, and bedsore prevention, was provided by reluctant ward nurses and orderlies borrowed from the traditional hospital wards on the lower floors.\n\nFor most of the 1960s, the Cowell residents could not be mistaken for an activist coalition. Roberts, Hessler, and nondisabled ally Mike Fuss had built strategic alliances with administrators and staff members across campus in order to develop the first curb cuts and accessibility ramps. But the congenial work lacked political energy and intent. When UCB student Linda Perotti first started doing laundry and typing term papers for the disabled students during the summer of 1968, she found the third floor of Cowell to be politically bucolic.\n\nIt was very quiet, a very quiet atmosphere. … (T)here was no political organization on that floor whatsoever. It was just a place where severely disabled people lived so that they could go to school.Footnote 2\n\nThe two leaders of the early advocacy work on campus were partially out of the picture that summer. Roberts was living off-campus, working on his doctoral dissertation and making preparations to launch an experimental junior college in East Palo Alto. Hessler was completing his master's degree in French literature in Paris.\n\nChange began in fall quarter 1968. Perotti took a job as personal attendant for Cathy Caulfield, the first woman resident on Cowell's third floor. From her perspective as a daily participant in the small disability community, Perotti saw transformation.\n\nThings completely changed that year … they started getting politically active and making demands on the hospital staff. … As a group, they were getting organized.”Footnote 3\n\nFellow personal care attendant and wheelchair repair specialist Charles Grimes likewise noticed that with the influx of new students, “there was a big change.”Footnote 4\n\nOver the next twelve months, the students cultivated deep friendships over nightly discussions around an enormous dinner table in the ward common area or over beer at a local pizza parlor. Disability studies scholar Rosemarie Garland-Thomson has commented:\n\nDisability is seldom understood in our culture as the kind of experience that would lead to circles of supportive association based on commonality. Because we think of disability as at once individualized and isolating rather than communal and shared, the concept of a disability community in which one might thrive seems counterintuitive.Footnote 5\n\nYet this is precisely what happened among the disabled students in Cowell Hospital. They compared notes on their personal experiences of illness or accident, hospitalization or institutionalization, and the hopeful path to UCB. They shared thoughts and feelings about both the stigma and rejection they experienced and the positive lives of social inclusion they hoped to achieve. At the heart of the group was a series of friendships forged from a commonality of personal experience.\n\nFrom that circle of friendships, the group of disabled UCB students built a highly informed and politically adept activist organization that impacted the University of California, the Berkeley community, and ultimately federal disability policy. Naming themselves the Rolling Quads, they became the influential disability rights political action coalition whose work led to the development of over four hundred independent living centers across the United States and the enactment of the first national disability anti-discrimination law, Section 504 of the Rehabilitation Act of 1973.\n\nThe primary focus of this historical analysis is the initial formation of the Rolling Quads at UCB in the late 1960s. How did a handful of UCB students hanging out together in their odd hospital ward dormitory create a powerful activist coalition that redefined disability in political terms? How did the Rolling Quads coalesce as a disability rights group at a time when disabled persons were not understood as an oppressed political minority group in the United States? This analysis argues that the social and political dimensions of the UCB campus and community, in conjunction with the combined control of UCB and the California DOR over the disabled students’ campus housing and educational experience, served as a crucible for the development of a new political consciousness and solidarity around disability.\n\nA contradictory set of circumstances and institutional arrangements propelled a small group of disabled students who had little political experience and limited connections to campus and community activism of the era into organizing for a new cause of disability rights. The students found themselves positioned at the collision between forces of institutional paternalism and personal freedom, living a tenuous balance between social control and self-determination, simultaneously subdued and uplifted by the bureaucracies of the DOR and UCB. The university and DOR were instrumental in contradictory ways, supplying resources and pathways to opportunities for personal growth and advancement while also exerting paternalistic authority over a population of students who were considered deviant and lesser. When the fierce enforcement of new DOR regulations in late 1969 upset the fragile balance, effectively placing the students in jeopardy of removal from campus, the students rallied together to fight for greater control. They tapped the unique array of political and cultural influences available at UCB and in Berkeley in the late 1960s for the ideological and practical ammunition for their battle. The subsequent students’ defeat of the DOR was a pivotal moment in the development of the political organization, the Rolling Quads, a group that quickly expanded into the foundational alliance behind the American disability rights movement.\n\nAlthough historiography of the student movement of the 1960s as well as the various race/ethnicity-based civil rights projects of the Bay Area document the numerous political strategies and groups involved, little attention is paid to the activism of disabled college students. This study adds to the historical literature on campus activism by examining how disabled students were influenced by the philosophies and strategies of other student and community activists while operating largely in isolation from civil rights organizations. Further, this analysis provides an account of how the managerial interaction of a university and a state disability support agency contributed to the social conditions of student rebellion. Finally, this article provides detail and rigor to prior journalistic accounts that have tended to romanticize the Rolling Quads and the leadership of Roberts. What will perhaps surprise an informed reader of 1960s protest movements is how a vital early cell of the disability rights movement coalesced in the fervent Berkeley campus culture of radical protest.\n\nHistorical Significance Before examining the historical development of the Rolling Quads, a brief outline of the achievements of this disability rights coalition is necessary in order to grasp the significance of the group in the broader narrative of the disability rights movement. In 1970, in their first year as a campus student group, the Rolling Quads secured a five-year United States Department of Education grant funded at over $80,000 per year. They also ran a successful campus campaign that won a student vote creating a student fee of twenty-five cents per quarter. They combined these two substantial financial streams to start the Physically Disabled Students Program (PDSP), an innovative effort to provide a wide range of services and support to disabled students and community members. Hessler was appointed the first director, with Fuss as his assistant. PDSP initiated a self-help model of assistance, asserting the expertise of disabled persons to provide guidance and services to other disabled persons. The extensive array of PDSP services included peer counseling, course pre-enrollment, moving classes to accessible buildings, personal attendant referrals and training, assistance finding accessible housing, wheelchair repair and loaner electric wheelchairs, guidance navigating social service agencies, and local wheelchair-accessible transportation. From the start, the Rolling Quads knew that the PDSP, while ambitious and necessary to assist UCB students with many types of disabilities, was not the end game. It was only a limited stepping stone on the path to the creation of a larger disability advocacy and support organization that would serve the entire Berkeley community. Although the program was formally funded to aid only disabled UCB students, a small office in the PDSP headquarters on Durant Avenue was allocated to serving disabled community members and planning the launch of the Center for Independent Living (CIL).Footnote 6 In 1972, the CIL was spun off as an independent extension of the PDSP in the Berkeley community. When Governor Jerry Brown named Rolling Quads leader Roberts as the first disabled person to lead the California DOR in 1975, Roberts used DOR funds to establish a statewide network of ten independent living centers. Reauthorizations of the federal Rehabilitation Act, beginning in 1978, funded the development of hundreds of independent living centers across the country, each based on the Berkeley CIL central idea that assistance with housing, employment, health care, transportation, and education should be provided by disabled persons and not rehabilitation professionals.Footnote 7 The Berkeley CIL quickly became the political think tank and practical hub of the West Coast branch of the disability rights movement. Most notably, the leadership and staff of the CIL organized and carried out the successful 1977 Section 504 protest action that brought the Carter administration to its knees, winning the three-and-a-half-year fight that forced Carter to issue the federal guidelines that enacted the Rehabilitation Act of 1973. Richard Scotch has described Section 504 as “the first major civil rights legislation for disabled people” in the United States, a statute that effectively outlawed discrimination against disabled persons in any programs receiving federal funds.Footnote 8 It was the first time that the federal government formally recognized the social problem of attitudinal and institutional prejudice against disabled persons, dramatically shifting national policy from the correction of deviant individuals toward a civil rights agenda for disabled Americans. The 1990 Americans with Disabilities Act later served as an expansion of Section 504's anti-discrimination injunction into all aspects of public and private life.Footnote 9 Beginning weeks before the April 1977 occupation of the San Francisco federal building, Kitty Cone and Judy Heumann organized the CIL staff into multiple committees to plan for a lengthy sit-in with dozens of disabled occupiers. They built partnerships with numerous community groups and organizations to create detailed contingency plans for meals, hygiene, medical care, communications, and public relations. A small leadership contingent traveled to Washington, DC, to conduct negotiations with federal officials and stage a vigil outside the home of Joseph Califano, secretary of Health, Education, and Welfare. After twenty-five days occupation of the federal building , Califano gave in to the protesters’ demands by signing the regulations implementing the law.Footnote 10\n\nPreliminary Campus Maneuvers While the clash between the disabled students and the California DOR in September, 1969 was momentous in terms of the formation of the Rolling Quads as a disability rights activist group, it certainly was not the first advocacy work engaged in by the disabled students living in Cowell Hospital. The physically disabled students encountered a campus unprepared and greatly opposed to their presence. In their efforts to modify the architectural and attitudinal landscape to facilitate their educational and social opportunities, the disabled students conflicted with and negotiated with two groups, the UCB administration and the medical staff of the hospital. The first residents of Cowell Hospital, Ed Roberts and John Hessler, confronted a campus in the early 1960s designed solely for nondisabled persons. The vast majority of the classroom buildings offered zero access for wheelchair users. Roberts was often carried up front steps and interior staircases of classroom buildings by his personal attendant and classmates. Hessler and Roberts learned which lecture halls were more accessible and pushed UCB administrators to move their classes to those buildings.Footnote 11 Realizing they needed more than course-specific negotiations with individual instructors, the disabled students took strategic action to spread their influence more broadly across the Berkeley campus. Their goal was not merely to navigate themselves through UCB but to change the campus so that other physically disabled students could be successful in the future. In order to encourage greater flexibility from a large and often rigid University, they reached out to two specific constituencies. Ed Roberts enjoyed educating UCB administrators on the needs of the disabled students and their goals of independence. With Roberts targeting the influential top of the organizational hierarchy, Hessler and Fuss aimed for the lower rungs of the college bureaucracy, the departmental staff members. In the eyes of the other disabled students, Hessler was very much the equal of Roberts when it came to leadership. However, he had a different style. While Roberts inspired with uplifting stories and brought people together with potent interpersonal warmth, Hessler was the straight-shooter, the capable “functionary,” the manager who knew what needed to be done and how to achieve results. Exuding a calm strength and confidence, he was “very effective in creating a collegial way” for students and other allies to work together. Hessler worked closely with Mike Fuss, a politically savvy personal care attendant who had spent his teen years organizing protests for the Congress on Racial Equality (CORE) and the Friends of the Student Nonviolent Coordinating Committee (SNCC). He was a seasoned civil rights strategist who applied the lessons of the racial justice organizing to the burgeoning movement for disability equality. Together Hessler and Fuss pursued strategic friendships with the clerical staff members in the academic departments, the influential women who were the administrative backbone of the UCB managerial culture, creating underground networks of supportive allies in pivotal positions across campus.Footnote 12 While Roberts, Hessler, and Fuss made great strides in building relationships with UCB administrators and staff, the doctors and nurses of Cowell Hospital were not so easily won over. They viewed the disabled young people as, in the words of Cowell nurse Edna Brean, “medical failures (whose) disabilities reproach and even embarrass the doctors.”Footnote 13 Eric Dibner, personal attendant for John Hessler, observed a “level of paternalism” among the hospital staff due to the novelty of the concept of independence pursued by the students. “(I)n terms of independence – of course, that concept for a person with a disability was a non-concept at that time.” Similarly, the physicians had little understanding of what quadriplegic young persons who would typically reside in nursing homes were doing on a college campus. For the doctors, “‘independent living’ with ‘major disability’ were mutually exclusive terms.”Footnote 14 A persistent state of antagonism existed between the medical staff and the students. The physicians and nurses expected the Cowell third floor to adhere to the well-ordered, controlled norms of a hospital while the disabled students viewed it as campus housing. As the nurses and orderlies attempted to enforce the procedural protocols that regulate a typical hospital ward, they met with the resistance of young people exploring and flexing their own independence for the first time. The students were thrilled to be liberated from the seemingly endless days of medical routinization that left them feeling hopeless, and they were doubly-thrilled to land in the vibrant, crisis-filled village of Berkeley, where the traditional social norms were threatened by the utopian visions of the adversarial counterculture.Footnote 15\n\n“A crazy, exciting time”: Berkeley's Protest Culture Footnote 16 The September 1969 disabled student rebellion against the DOR's decision to cut funding for two disabled students was informed by and occurred within a distinct culture of radical protest that had developed in Berkeley and on the UCB campus during the 1960s. Cowell personal attendant Grimes observed, “There wasn't a square inch of the University of California at Berkeley that was not political, that was not seething with the potential of being political.”Footnote 17 Many activists from the era and historians have described “The Movement” as a multi-issue, often fragmented, passionate effort to bring about a variety of dramatic political changes. Civil rights activism translated into struggle for campus free speech transmuted into opposition to the Vietnam War morphed into the battle for People's Park in May 1969. These New Left political revolts were entangled with the rise of a hippie counterculture that embraced sexual freedom, psychedelic drugs, rock ‘n’ roll, and communal living arrangements.Footnote 18 The university itself was undergoing significant changes. Enrollment boomed, with the number of UCB undergraduates rising 50 percent between 1958 and 1968. During the same decade, graduate student enrollment jumped 82 percent. Admissions opened up to previously ignored populations, working-class white students, African Americans, and Mexican Americans.Footnote 19 University of California president Clark Kerr described UCB as leading the nation in the shift from college as communal “village … with an intellectual oligarchy” to a cosmopolitan, fragmented “village of infinite variety.”Footnote 20 As large research universities became disjointed but well-funded technocracies of knowledge production that Kerr termed the “multiversity,” they served government, military, and industry needs while placing less emphasis on undergraduate education. Berkeley activist Hal Draper wrote a widely read pamphlet that critiqued Kerr's vision of a university as a factory, an inhumane knowledge machine feeding the greed of defense industries.Footnote 21 The rise of the university as the production plant of scientific and technical knowledge deemphasized the traditional mission of developing young minds and ignored the dialogical and creative role of universities in a democratic society. Undergraduates fed career-oriented academic content by graduate students in large lecture halls left them feeling alienated and undervalued.Footnote 22 The few disabled students coped with this complex, often impersonal campus environment by forming a tightly knit community of support. While the social group in Cowell Hospital provided friendship and opportunities for dialogue, the disabled students were also highly influenced by the heated protest culture that surrounded and informed them. A September 1969 San Francisco Chronicle article about the Rolling Quads described the group of disability rights activists as “outspokenly sympathetic with the People's Park movement.”Footnote 23 The People's Park was a small vacant lot owned by UCB that Berkeley residents, students, and radical activists turned into an impromptu community park. The conflict between UCB administration and the activists over the use of the land climaxed in violent riots in May 1969 in which police with shotguns killed one person and blinded another. The Chronicle’s phrasing accurately cast the disabled students group not as participants in the park protest activities but as adopting the Berkeley trope of oppositional politics to their new cause of disability rights. Nationally, the 1969–1970 school year was the zenith of campus protests, both in terms of number and intensity. There were 9,408 demonstrations: 731 involved arrests, 410 consisted of property damage, and 230 resulted in physical violence. Elite universities such as Harvard, Columbia, Wisconsin, and UCB were the most active, but protests took place across the nation, including community colleges and high schools.Footnote 24 College men were acutely aware that graduation meant they became eligible for forced military service. In 1965, due to increased need for more soldiers to sustain the Vietnam War, the federal government began asking universities to supply class rank lists under a plan to end draft deferrals for undergraduates with low grades. Among other factors, this tipped the scales for many university students. Antiwar protests that had been largely populated by radical students, some liberals, and outsiders now attracted moderates and conservatives who viewed the war as morally bankrupt and feared the possibility of conscription. As historian W. J. Rorabaugh observed, “The real political division in America was no longer between the Right and the Left but between the young and the old.” The old directed the war, and the young, like it not, fought and died in it.Footnote 25 But the Rolling Quads, while generally supportive of the New Left, were not seasoned Berkeley activists. Of the members of the Rolling Quads, only Fuss and Roberts had prior experience planning and carrying out political actions. Fuss had been highly active in civil rights activities in the San Fernando Valley before attending the university. He participated in a series of sit-ins at Van de Kamp restaurants in response to the chain's racially discriminatory hiring practices. As a UCB student, he maintained close ties with the student leaders of the Congress of Racial Equality and the Student Nonviolent Coordinating Committee campus groups. But his primary political focus during his time at Berkeley was the nascent disability rights cause.Footnote 26 Roberts was the only disabled student with a significant level of involvement in Berkeley radical politics. During the Free Speech Movement (FSM), he worked as a teaching assistant for an undergraduate political science course. The Graduate Coordinating Council, a group dominated by teaching assistants and closely linked to the FSM leadership, called a campus strike in early December 1964. It occurred the day after approximately eight hundred FSM protesters were arrested during a sit-in at Sproul Hall. Almost half of the UCB students refused to attend class in support of the FSM cause. Roberts participated in the planning as well as the alternative educational activities held on campus during the strike. He marched in numerous FSM actions, typically taking a position at the front to push his large wheelchair through lines of police.Footnote 27 It must be emphasized, however, that while the disabled students learned from the philosophies and tactics of a variety of New Left political groups, they did not collaborate with the other civil rights efforts active in the San Francisco Bay Area or Berkeley. Recent historiography of the multiple strands of the civil rights movement in California and the Bay Area gives evidence of the frequent conflicts and failed alignments between African American, Mexican American, and Asian American activists. The growing disability rights activism community of Berkeley, starting in the late 1960s and housed in the Berkeley CIL by the mid-1970s, is not mentioned as part of the civil rights panoply of the East Bay area. This occlusion reflects the fact that historians who examine civil rights movements tend to ignore disability rights activism. But it also evidences the lack of communication and coordination between the new disability rights activists and long-standing race or ethnicity-based political projects. Although the Rolling Quads viewed themselves as enacting a modified version of the minority identity civil rights struggle script crafted by African American and other racial minority activists, as well as feminists rising among the New Left, they had no meaningful alliance or working relationship with these activist communities.Footnote 28 While the majority of the disabled students did not take significant roles in the many campus rallies, marches, and sit-ins, they were, quite literally, engulfed by those activities. A lively and often violent politics of civil disobedience was the everyday backdrop of their college experience. Attending UCB during the mid- to late sixties meant being physically inconvenienced and even captured by the widespread protest actions and the police response. Roberts and Herb Willsmore, a student who entered the Cowell residence in 1968 and later served as president of the Rolling Quads, found themselves surrounded by immovable crowds on numerous occasions as throngs of protesters flocked across campus or Telegraph Avenue to outflank the blue jump-suited Alameda County police. Billy Barner plowed his wheelchair through a hallway piled high with trash in the messy aftermath of a protest just to attend class. Caulfield and Roberts outraced the wafting clouds of noxious tear gas as they rolled from class back to the safety of Cowell. Jim Donald so frequently found himself in the middle of the tear gas–soaked scrum between police and protesters that he carried a gas mask on his wheelchair. As Larry Langdon and his fiancé, Carol Billings, were leaving campus, a line of police on Bancroft Way fired tear gas canisters at them. Langdon (the only paraplegic in the group) scooped up a canister and threw it back at the police before the two escaped. While observing one battle between demonstrators and police, Donald was trapped in a police sweep of the campus. When he didn't move quickly enough, an officer smacked him on the back of the head with a baton. A group of protesters pushed the police away and escorted him to safety.Footnote 29\n\nSeeds of Conflict Between Roberts's initial matriculation in September 1962 and fall semester 1967, the campus infirmary residence housed only seven students. In October 1967, Cowell administrator Carl J. Ross asked the California DOR to fund and manage “a formal program” supporting “ten or twelve” students.Footnote 30 Although the students who lived in Cowell received services and financial support from the DOR, the program was off the state agency's radar. The students and their vocational counselor, Catherine Butcher, garnered funds greatly through tricks of bureaucratic manipulation, working a convoluted state system that had little experience or interest in assisting students seeking a college education. The DOR was chiefly dedicated to providing short-term job training programs for persons with relatively mild impairments. Roberts, Hessler, and others had pushed to stretch the functional boundaries of the agency by classifying a college education as a form of employment preparation. Touting the success of the informal program in the first five years, Ross asked the DOR to make a full organizational commitment to operating the campus hospital wing as a state-funded rehabilitation program for college students. Funded 90 percent by a large federal grant, the DOR launched a five-year program in early 1968 to support disabled students at UCB. The vocational rehabilitation view of paralyzed clients was beginning to change. During and immediately after World War II, rapid advances in the medical care and rehabilitation of paralysis made possible longer and more physically active lives. New techniques for avoiding and treating frequent urinary tract infections plus more vigorous rehabilitation regimens opened up the possibility of a paralyzed person living more fully than before. The proliferation of electrified wheelchair technologies in the late 1960s was a development that gave independent mobility to persons who previously relied on assistants and further enhanced the potential for many paralyzed persons to escape nursing homes and institutions for mainstream residences, jobs, and activities.Footnote 31 Moreover, campus-based disability services programs were gaining traction across the country. The University of Illinois and the University of California, Los Angeles, both operated programs in conjunction with local Veterans Administration hospitals to support physically disabled students. A 1957 national survey of universities found that thirty-one had formal programs providing support for disabled students. Another 101 offered no organized program but delivered some kind of assistance. Some colleges specifically supported deaf and hard of hearing students or blind students while others provided greater access to persons with physical or orthopedic impairments. No university disability support programs, however, employed the self-help, student-driven model devised by the students at UCB. University disability programs, then as now, were directed and staffed mostly by nondisabled professionals.Footnote 32 Perhaps what was most appealing in Ross's request came down to the cost-benefit analysis that drove the DOR's organizational and professional logic. The agency viewed quadriplegics as expensive, long-term economic burdens due to the continuous costs of providing hospital or nursing care. Even for those with severe physical disabilities who lived at home with their family, the costs of personal attendant services were significant fiscal encumbrances. Quadriplegics becoming gainfully employed was not traditionally considered a realistic option worthy of the DOR's investment. The collegiate success of Roberts, Hessler, and other early Cowell residents convinced the DOR that some quadriplegics could earn college degrees that would translate into higher income jobs. The DOR's reasoning was that these college graduates could then secure remunerative employment that would allow them to pay for their own personal care attendants, releasing the DOR from many years of agency expenditures.Footnote 33 In this new venture, however, the DOR took two steps that generated an environment of bitter conflict between the students and the rehabilitation counselor who supervised the program, Lucile Withington. First, the agency asserted greater bureaucratic control over the students’ academic lives. An experienced counselor who had been working in the department's San Francisco office, Withington was assigned to the students in Cowell Hospital with specific instructions to safeguard the DOR's substantial financial investment. Armed with a new set of academic standards for all disabled students, Withington enforced a cost-benefit accountability regime designed to efficiently move the students to graduation and employment. This effort involved a careful process of client selection, rigorous program admissions standards, and careful surveillance of the students’ class attendance and grades. Withington worked with Ed Davies, an Oakland psychologist, to develop an admission screening process relying on the verbal section of the Wechsler intelligence test as well as an interview. All applicants were administered standardized measures of occupational interest as well as a personality inventory to identify students with the greatest chance of handling the academic rigors and socio-emotional challengesof the university. . These procedures were carried out in addition to UCB's admissions process.Footnote 34 The new DOR rules adopted in March 1968 placed the students in the unusual position of meeting two sets of academic standards, one maintained by UCB for all students and a second instituted by the DOR for their disabled clients. The latter was far more exacting. The new DOR regulations mandated that the disabled students maintain a minimum B average in their major field of study. At the end of each quarter, students were required to meet with Withington to discuss their grades and choose courses for the next semester. If students wished to withdraw from a course or make course schedule changes, they needed the counselor's approval. The students also had to take at least twelve units per academic quarter. Many had been taking lighter academic loads. The quadriplegic's typical morning routine of bathing, eating, and getting dressed often took hours, making morning classes almost impossible. Additionally, the physical challenges of completing courses in a predigital era—including working with lecture notetakers and term paper typists, dealing with paper course texts and materials—rendered routine study activities extremely time-consuming. As Hessler bitterly complained, “We are not able to complete a course of studies as quickly as the physically able; we have never been ordered to until now.”Footnote 35 All selections of major fields of study now required consultation and approval by Withington. This assured that the students were pursuing studies in fields that the DOR believed would lead directly to professional employment. Roberts grumbled loudly that Withington demanded final approval of the topic for his doctoral dissertation.Footnote 36 Not surprisingly, the students rankled under the system of restriction Withington carried out. They viewed her as a harsh and demeaning taskmaster and vehemently blamed her for the DOR policies that she enforced. Roberts described her as strictly an accountant who took seriously the idea she had to cut costs. … Her job was to go in there and straighten these young people out, and make sure they got good grades and reported to her over and over. She came in and laid down all these rules. But it wasn't just what she asked for, it was how she did it. Because from the beginning, she started threatening: “If you don't give me your grades, I'll cut off your money. If you don't give me this, I'll do that.”Footnote 37 Willsmore observed: Lucile was a very hard and by-the-book kind of counselor, and I think they sent her in there because that's the way she was and maybe she could whip these guys into shape.Footnote 38 Withington became a human symbol of medical and institutional social control, the paternalistic emblem of constriction and limitation at a time when the students were aggressively seeking lives of independence and self-mastery. As the DOR implemented policies and procedures that the students experienced as intrusive and coercive, the program expanded dramatically. Before fall quarter 1968, the Cowell residence typically housed three to five students at a given time. By November 1970, the program rolls had risen to eighteen students. During the time period when the students began to struggle against Withington and the new policies, the DOR was increasing the size of the opposition force she had to contend with.Footnote 39 Not only was the group gaining numbers, it was also becoming more diverse and more unified. The enlarged group in the 1968–1969 academic year included the first three woman Cowell residents, Caulfield, Sue Ward, and Judy Taylor.Footnote 40 The presence of three women and their female personal attendants quickly altered the gender dynamics in the previously all-male residence. Grimes observed that the newest Cowell residents were more fun-loving and adventurous than the older group of disabled students.Footnote 41 Alcohol and marijuana were frequently smuggled into the hospital to fuel late-night parties, and sexual activity increased. Conversations at dinner often lasted for hours after the trays had been cleared away. The group bonded over shared experiences with hospitals, state bureaucracies, medical devices, inaccessible classrooms, and social stigmatization, as well as the common hope of living as quadriplegics had rarely lived before; independent, employed, married with family.\n\n“Quite an Uprising”: The Fight for Control Footnote 42 When the disabled students returned to campus in the fall of 1969, they were met with a harsh slap in the face. Two undergraduate students who lived in Cowell Hospital—Don Lorence and Larry Biscamp—received notifications from the DOR that their state funding had been withdrawn due to a lack of academic progress. The DOR evictions from the university housing and academic support system made their continued college attendance impossible. The students were convinced that the expulsions were political attempts to remove persons viewed as subverting the DOR's authority and control. Lorence fully and theatrically embraced the hippie lifestyle, adopting a countercultural appearance and attitude that many hospital and DOR staff members viewed as disruptive. Fuss described Lorence as unapologetically “flamboyant … he wore wild clothes and let his hair grow frizzy.”Footnote 43 His free-flowing approach to academic study was more Zen than the strategic careerism the DOR encouraged. The oppositional attitude Lorence celebrated in hair and attire was articulated by Biscamp with sharp words. He had spent the prior academic year actively agitating, working like a union organizer among the disabled students, calling for his friends to take a unified and militant political stance against the DOR's social control measures. He wanted the group to act in defiant solidarity against the DOR's regulations and pushy counselor.Footnote 44 The DOR also cut off financial aid to support Roberts's dissertation research. Withington thought Roberts was completing his research too slowly, and she questioned whether his research topic would help him land a faculty job. All three students were in good academic standing with the university, but the DOR regulations held the disabled students to an additional standard. The crux of the matter, to DOR counselor Withington, was the efficient utilization of public funds: The issue that I was dealing with, with Don Lorence and Larry Biscamp … was the fact they had not gone to classes for the previous quarter … it didn't fit the hierarchy of the Department of Rehabilitation, basically—how much room are you given to just use the funds and not perform towards your vocational goal?Footnote 45 She viewed these students as wasting public dollars and unnecessarily holding programs slots that could be assigned to more cost-effective clients. Making matters worse, she believed, they were using their disability status as a pity mechanism to game the system: “Poor me, why shouldn't I do what I want to do?” Their lack of compliance with the DOR's new rules was interpreted as a plea for extra privileges due to their woeful situation.Footnote 46 The three targeted students were beloved figures in the Cowell resident program who were devoted to the new disability rights cause. Roberts was the pioneer and elder statesman of the group, the first to attend the university and the wisest political organizer. Lorence and Biscamp were part of the large influx of new students who entered Cowell in fall quarter 1968. Each was prized as a cherished friend but also as an integral member of the growing disability rights team. Biscamp later dropped out of UCB but remained highly active in Berkeley disability rights activities; he was one of the CIL founders in 1972 and served as its first leader. Lorence was also one of the group's organizational leaders and his peers picked him as the first president of the Rolling Quads. With Fuss and Hessler, he co-authored a grant proposal that raised $10,000 in UCB funds for the establishment of the PDSP in 1970. He was vital to the development of the PDSP, serving as director from 1975 to 1979.Footnote 47 The fifteen disabled students living in Cowell were divided in response to the conflict with Withington. Eleven unified as a solid front, pushing for abrogation of the decisions and for Withington's immediate removal from her position as the rehabilitation counselor assigned to the Cowell residence. Four students, all recent additions to Cowell, did not join the fight. They quietly moved aside, continued their usual academic and social activities, and played no active role in the struggle.Footnote 48 Roberts later commented that “we totally excommunicated them from our group, to the extent we wouldn't talk to them at all.”Footnote 49 Eleanor Smith, the Cowell Hospital nurse assigned to assist the students with hygiene and medical needs, found herself caught in the crossfire. Fuss was working as her assistant, helping to train and supervise the personal attendants in Cowell. Smith became embroiled in bitter arguments with Fuss about the proper social role of a disabled person receiving rehabilitation services. Fuss understood that the new path the student group was seeking was explicitly political, a budding movement toward disability rights and personal independence. Smith viewed her youthful charges as students and patients, but not as political actors, certainly not as revolutionaries. Although she was greatly loved by the students for her expertise and warmth, her opposition to their political cause placed the Cowell nurse in a distressing position. Upset by the radicalization of the students, she abruptly resigned.Footnote 50 The Rolling Quads were not seeking a compromise or concession to maintain social harmony. They understood the conflict with the DOR as a fight for their rights as disabled persons to assert a necessary measure of control over their lives, most notably their education, health, housing, and future. It was also an opportunity to replace the dominant cultural understanding of a disabled person as incompetent, incapable, and requiring supervision by nondisabled persons with the burgeoning, unconventional notion that disabled people were valued and competent citizens who could direct their own affairs. They asserted that disabled persons could plan for and manage the forms of assistance and support that enabled them to live independent lives in the community. The stakes in the battle between eleven college students and one rehabilitation counselor extended beyond the DOR decisions regarding Lorence, Biscamp, and Roberts. The students viewed themselves as pioneering a liberating new interpretation of the meaning of disability in America, a work-in-progress concept of independence with the potential to open doors to more fulfilling lives for people with a wide variety of disabilities. Hessler and Roberts initially took the students’ appeal to Bruyn, their old ally. They summoned him to an afternoon meeting, where Roberts proudly declared the group's intentions. Although the students generally viewed Bruyn as a supportive authority figure, in this case, he silently withheld his approval and promised to relay the students’ concerns to the DOR leaders.Footnote 51 It is noteworthy that other than Bruyn, UCB administrators and faculty remained on the outskirts of the conflict, siding with neither the students nor the DOR. The Cowell residence was jointly managed by UCB and the DOR—the university providing the facilities, the state agency supplying the main funding—and both employed professional staff to support the students. As the students rose up against the DOR, the silence of the university leaders is best understood within the long-standing tradition of in loco parentis, a practice by which the faculty and administration were understood as providing adult supervision for the students. Universities often viewed themselves as responsible for bringing moral character to young people through activity restrictions, behavior prescriptions, and administrative surveillance. As a legal doctrine, in loco parentis meant that students rightfully had little or no power in decisions regarding the curriculum, residential life, extramural activities, and daily operation of the campus. Prior to the 1961 Dixon v. Alabama case, the courts had consistently upheld the university's parental role and responsibility. In Dixon, the court ruled that Alabama State College could not expel students without due process procedures. It was the first of a series of court cases—most involving university attempts to restrict free speech and political activity—that granted students constitutional rights and placed limitations on the powers of universities in relation to their students.Footnote 52 At UCB, this principle was center stage during the 1964 FSM when students demanded the right to participate fully in political activity on campus. Berkeley chancellor Martin Meyerson told an alumni group, “Remember that, when you are a teacher, your students are your charges. They are practically your children.”Footnote 53 In direct contrast, the University of California system president responded to the FSM demands that the activist students be treated as adults by ordering the mass arrest of almost eight hundred protesters who conducted a sit-in of Sproul Hall in December 1964. The victory of students over the administration during the FSM has been interpreted by historians as a crucial blow to the in loco parentis principle at UCB.Footnote 54 In a 1970 speech, Meyerson observed that most American universities had given up the in loco parentis role. As legally sanctioned paternalism waned at UCB after the FSM, it continued in specific application to the disabled residents of Cowell Hospital. Due to their disability, and in light of what was considered a compromised physical and psychological constitution, the disabled UCB students were subsumed in a medical matrix of managerial protection suitable to persons of tender age and body. Each disabled student was, in the words of disability sociologist Wolf Wolfensberger, an “eternal child who never grows up,” stuck in a social role of economic and social dependence.Footnote 55 The continuing placement of the disabled students in Cowell Hospital enacted the UCB administrators’ assumption that the disabled students required around-the-clock medical supervision and behavioral control. In fact, by the end of the 1960s, due to the disabled students’ initiative and the work of nurse Edna Brean, the responsibility for standard medical care routines (such as catheter care) had migrated from hospital personnel to the personal attendants that the students trained and supervised. The health-maintenance tasks had been effectively de-medicalized. Yet the UCB administration gave the students no choices for campus housing except Cowell Hospital. Although the administration ramped many curbs, modified some classroom buildings, and built a new library and performance hall that were largely wheelchair accessible, they made no progress toward adapting dormitories to house students with physical disabilities. The disabled students interpreted the disciplinary actions Withington and the DOR took against the three students from a social position of profound contradiction. Living in an exciting campus culture where students were enacting a range of new political, social, and sexual freedoms, the Rolling Quads were subject to a system of continuing bureaucratic paternalism that effectively limited their autonomy. As students immersed in the campus and local community, they participated in the full variety of personal expressions and communal experimentations that made Berkeley a carnival of creativity and transgression. Simultaneously, they experienced the bureaucratic clampdown that occurred specifically because of their social identity as disabled persons. The clash of restriction experienced in the midst of freedom, of paternalistic control in the space of personal expression and opportunity, supplied the disabled students with a fund of motivational anger that helped them to organize and fight for a specific political purpose. The student group immediately contacted Rod Carter, the DOR supervisor in the Oakland office overseeing Withington and the Cowell residence program. They submitted a series of letters to Carter, one from the entire group plus nine from individuals, spelling out their grievances in detail. They asked the supervisor to reverse Withington's decisions regarding the three students and to replace her with a different, more flexible counselor.Footnote 56 In style and content, the letters demonstrated a high level of organization and planning on the part of the student protesters. At all times, the Rolling Quads clearly communicated that they stood united. There would be no separating the impacted students from the rest of the group as a way of resolving the issue. The three-page group missive and the individual student letters struck the same notes repeatedly, indicating a significant degree of coordination among the authors. As political documents, the letters were bureaucratic and mild. The students’ strategy was not to convince the DOR leaders to embrace a radical, politicized concept of disability. To the contrary, the students’ rhetoric embraced the standard organizational ideology of the DOR by dutifully stating their personal goals of becoming fully employed and economically self-sustaining taxpayers. The students had made a close study of the DOR policy manuals, the organizational codes and rulebooks that dictated the acceptable financial expenditures and authorized services. They ably employed their in-depth knowledge of the DOR system to argue with surprising moderation that a typically effective and greatly valued DOR program had been incapacitated by the overzealous actions of one counselor. The majority of the letters complimented the department for providing high-quality services that were crucial to the students’ success in becoming independent and successful adults. The one anomaly in the students’ highly positive experiences with the DOR was Withington, a counselor whose unprofessional and misguided behavior, they claimed, effectively discouraged the students’ attempts to become economically independent citizens. The message to Carter was to remove Withington so that the DOR's usually commendable and effective operations could continue unhindered. The highly strategic nature of the students’ arguments can be understood in relation to their extensive work in planning the PDSP and, more importantly, the CIL, during the same time period. As the students battled with Withington and the DOR in the first half of the fall quarter 1969, they were also holding lengthy planning meetings and writing multiple drafts of foundational documents for a new kind of disability support organization. Initially, they toyed with the notion of a “halfway house” or a “disabled dorm.” But it quickly became clear that the goal was not merely to move out of the campus hospital into a different congregate living facility but to create opportunities to reside and participate in the Berkeley community. As Caulfield quipped, “I really love all you guys, but I'll be damned if I'll live with you forever.”Footnote 57 Creating a new form of disability segregation was not the goal.Footnote 58 The students worked out the details of this new kind of “community services center” through a group study course, Sociology 198, instructed by graduate student Hessler. This was the first in a series of small, student-run courses focusing on “problems of the severely disabled as they relate to the transition between institutional care and independence.”Footnote 59 Held in Cowell Hospital, the class consisted of a series of projects in conjunction with disabled people and service agencies in the community. One project developed a questionnaire of local disabled residents seeking their input into the design of services to meet their needs. A second project was of the development of a referral guide outlining all the services provided by agencies and organizations in the Berkeley area. By the third class meeting, the students had already identified their goal as the creation of “the Center for Independent Living,” a multifaceted service center operated by disabled people for disabled people, offering services ranging from housing to employment and attendant care referral.Footnote 60 As the students fought the DOR for control over the Cowell program, they were mapping their exit and planning the creation of a social support organization that would replace the DOR. Their reasonable, ingratiating letters to the DOR supervisor offered a tamed version of their primary goal, taking control over the arrays of support and assistance that could help a disabled person live an ordinary life in the community. Carter responded to the students’ phone calls and messages by sponsoring a series of meetings between the students and counselor Withington. The students spoke their minds, reportedly in a full but calm fashion, and the counselor held her ground. As DOR counselor Gerald Belchick observed, “She absolutely was so sure that she had the right answer to everything.”Footnote 61 The students found Withington to be unyielding in her interactions with them, and these attempts at dialogue did nothing to persuade her to reconsider her original decisions. DOR supervisor Carter acceded to her judgment. The meetings ended with no resolution to the matter.Footnote 62 At this point, the student group decided to escalate the conflict. They did what Berkeley students in 1969 did. They scheduled a public protest action. Roberts called reporters at a number of Berkeley and San Francisco newspapers to explain the situation and seek coverage. He also notified state senators and assemblymen, including mental health advocate Nick Petris, of the problem and the actions the students were taking. He asked them to put pressure on the DOR to reverse the expulsions and replace Withington. The chosen location for the first disability rights protest at UCB was Sproul Plaza in front of the administration building. The students selected the location of the demonstration because of the symbolic value of Sproul Hall and Sproul Plaza in the recent history of civil disobedience. It was in Sproul Plaza in October 1964 that hundreds of students sat down on the ground around a police cruiser for thirty-two hours. Mario Savio took off his shoes and climbed up on the roof of the police car to make a speech that first catapulted him into the public eye and propelled the FSM into many months of conflict with the UCB administration. On the Sproul steps, Savio made his famous “put your bodies upon the gears” speech that captured the feelings of many young people in relation to the powerful bureaucracies and systems that treated human beings like nameless IBM cards.Footnote 63 As 1960s Berkeley experienced Vietnam War protests, the Third World Liberation Front, and the battle over People's Park, the Sproul steps and plaza were the places where important political activity often happened.Footnote 64 For this specific group of students, the symbolism had an important added dimension. Sproul Hall was the first building on campus to become accessible through the addition of a wheelchair ramp. Five years earlier, Roberts had worked with Dean Arleigh Williams to convince the administration to install a wheelchair ramp to enter the basement at the side of the building. The protest was planned to take place at the first location of disability access on campus.Footnote 65 A dozen students in electric wheelchairs, followed by an equal number of nondisabled supporters, moved in what Belchick described as a “phalanx” formation—a rolling wall of determined faces, humming electric motors, and gleaming steel—from Cowell Hospital to the base of the steps of Sproul Hall. Many were clad in green fatigue army jackets, the unofficial uniform of Vietnam-era protest and counterculture life. They circled Ludwig's Fountain at the center of the plaza, carrying signs and chanting slogans. Using a megaphone, the students made speeches. Hessler and Roberts took the lead. The visual curiosity of an angry mass of people in wheelchairs, coupled with the echo of the loudspeaker, drew inquisitive UCB students to listen, and Hessler and Roberts used the occasion to educate the Berkeley student body on the daily lives of physically disabled students. They touted their oft-overlooked talents, the intellectual capacity to be excellent students, and the strong desire to earn a degree. They made it clear that these were not pity cases. These were legitimate UCB students much like any other. But then they explained with great patience and detail how they were indeed different, and the kinds of accommodations and assistance they needed in order to attend classes, study, and keep up with assignments.Footnote 66 Central to the lesson that Roberts and Hessler delivered was a portrayal of the DOR as the cold state bureaucracy that was letting the disabled students down. The state agency had promised to supply the necessary support, funding, and arrangements to make the educational opportunity attainable. But the DOR was not fulfilling its promise and its responsibility to the students. Hessler said, “The accommodations will make the opportunity a reality. Without the accommodations, there is no reality or opportunity that can be fulfilled.”Footnote 67 The power and clarity of the message delivered on the steps that day was as strong and compelling as any other spoken at that location in prior years. The cause of disability rights was new and perhaps strange to the students who gathered to listen. Although the quadriplegic orators were unusual to the Sproul Plaza audience, the message that a disenfranchised and youthful group wanted the misunderstanding adults to allow them more control over significant life decisions was well known and appealing. The key to influencing the DOR was not in rallying the UCB students. The primary strategy the students pursued was public shaming, using the local media to sway the opinions of state legislators and concerned citizens against what appeared to be a dysfunctional and unfeeling state bureaucracy. Newspaper coverage in both the San Francisco Chronicle and the Berkeley Daily Gazette depicted the students as rational, good people victimized by an unreasonable counselor and an unresponsive state agency. In sensationalistic fashion, the Daily Gazette splashed the headline “UC Cripples Score Cut of Monies” above the fold of the front page.Footnote 68 Both the Daily Gazette and the Chronicle portrayed Withington's decision to cut off funding to Lorence and Biscamp as cruel and harsh treatment of disadvantaged people doing their best to make it in a challenging world.Footnote 69 The Chronicle described the counselor's actions as “personal and political,” an unprofessional attack on the two students for wearing long hair and embracing a bohemian lifestyle.Footnote 70 Large photos of Lorence and Biscamp displayed their substantial locks to support this claim. Quoted at length in both articles, Roberts told a story of a vindictive counselor harassing disabled students with threats and then demanding the two students remove their belongings from Cowell Hospital within forty-eight hours. Withington was hung out to dry by a DOR spokesperson who issued a statement that she “exceeded her authority in telling them they had to leave Cowell Hospital.”Footnote 71 Out of town at the time, the vilified Withington had no opportunity to rebut the students’ characterization of events. The media strategy orchestrated by Roberts and the Rolling Quads was effective. As Roberts later observed, “We knew that when you shine the light of publicity on a state agency, they can't take it.”Footnote 72 The DOR immediately removed Withington from her position at the Cowell residence. She was replaced with Belchick, an experienced counselor who fully understood that the residents of Cowell Hospital were to be given a significant level of control over the DOR services and funds that they received. With only a mild degree of hyperbole, he later commented, “Essentially, they [the students] got carte blanche. … There wasn't anything they asked for they didn't get.”Footnote 73 Belchick's boast about the funding of the students in the Cowell residence program points to pertinent aspects of the context that Withington did not notice. Typically, Withington's fierce attempts to control costs by weeding out the clients with the least chance of success was a central DOR strategy. At worst, it was the common practice called “creaming,” choosing clients with lesser or temporary bodily impairments because the agency could quickly return them to the workforce. Even the somewhat milder form of cost-benefit accounting Withington applied only made sense in a budgetary environment marked by a scarcity of state dollars. Additionally, given the bureaucratic harshness of the approach, it was more safely carried out when the media and public were paying little attention. What Withington misunderstood that Belchick quickly grasped was that the students in Cowell were well funded by a large federal grant. There was no need to squeeze the state DOR purse with the usual accounting scrutiny of clients’ progress. Further, the students in Cowell, unlike other DOR clients, had received much media coverage. The agency had received positive national attention within the larger vocational rehabilitation profession, including many inquiries from rehabilitation agencies and leaders from other states, for having success with college students with severe mobility impairments. The Cowell program gave California national prominence in working with a population that most state departments of rehabilitation viewed as unemployable. The DOR was benefiting from media and professional kudos for innovative programming that was largely covered by federal funds. Granting the Rolling Quads’ demand to replace Withington was an easy political decision for the DOR. Belchick was sent in to calm the storm and work in collaboration with the Rolling Quads to manage the Cowell residence. In the DOR annual program report of the following year, co-authored by Belchick and DOR analyst Michael Savino, the evaluation contained not only the usual DOR descriptions of activities, outcomes, and a client-by-client cost-benefit analysis. For the first time, the state report included an entire section written by the Rolling Quads: an evaluation of the program's success from the standpoint of the students. The students had quickly achieved the status of equal partners with the DOR in managing the Cowell residence.Footnote 74"}, {"url": "https://www.usnews.com/best-colleges/university-of-california-berkeley-1312", "page_content": "University of California, Berkeley is a public institution that was founded in 1868. It has a total undergraduate enrollment of 32,143 (fall 2021), its setting is city, and the campus size is 1,232 acres. It utilizes a semester-based academic calendar. University of California, Berkeley's ranking in the 2022-2023 edition of Best Colleges is National Universities, #20. Its in-state tuition and fees are $14,226; out-of-state tuition and fees are $43,980.\n\nThe University of California, Berkeley, often referred to as Cal, is situated overlooking the San Francisco Bay. Typically, 95% or more of incoming freshmen at Berkeley choose to live on campus. There are more than 1,000 student organizations, ranging from political groups to a hang gliding club and everything in between. Berkeley also has a thriving Greek life with dozens of fraternity and sorority chapters. The California Golden Bears, Berkeley’s athletic teams, compete in the Pac-12 Conference and are known for their traditional arch rivalry with Stanford University.\n\nBerkeley has 14 schools and colleges, including a number of graduate and professional schools, such as the School of Optometry and the Graduate School of Journalism. Other graduate programs offered include those in the highly ranked Haas School of Business, Graduate School of Education, College of Engineering and School of Law.\n\nBerkeley is well known as a hub of liberal student activism: The Free Speech Movement – a 1964 student protest at Berkeley in response to the administration’s ban on political activity – gained widespread attention. Notable alumni include former U.S. Supreme Court Chief Justice Earl Warren, Olympic gold medalist Jonny Moseley, and actor John Cho, known for his role in the \"Harold and Kumar\" films. Dr. J. Robert Oppenheimer, who worked on the development of the atomic bomb as scientific director of the Manhattan Project during World War II, was a professor at Berkeley."}, {"url": "https://eecs.berkeley.edu/faculty-jobs", "page_content": "The Department of Molecular and Cell Biology (MCB), Division of Immunology and Molecular Medicine (IMM), and the Department of Electrical Engineering and Computer Sciences, Computer Science (CS) Division at the University of California, Berkeley (UCB) invite applications for a tenure-track faculty position at the Assistant Professor level. The candidate will be joining world-class departments in Computer Science and Immunology/Molecular and Cell Biology, providing tremendous opportunities for engagement in interdisciplinary research of the highest quality.\n\nFor more information about the position, including required qualifications and application materials, please go to: https://aprecruit.berkeley.edu/JPF03606.\n\nThe posting will remain open until November 15, 2022. Please direct questions to mcb_ap_assist@berkeley.edu or to eecs-faculty-recruiting@eecs.berkeley.edu. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status."}, {"url": "https://dornsife.usc.edu/labs/msw/", "page_content": "Michael Waterman is University Professor Emeritus at the University of Southern California and Distinguished Research Professor at University of Virginia. He came to USC in 1982 after positions at Los Alamos National Laboratory and Idaho State University. He has a bachelor’s degree in Mathematics from Oregon State University, and a PhD in Statistics and Probability from Michigan State University. He has held visiting positions at the University of Hawaii (1979-80), the University of California at San Francisco (1982), Mt. Sinai Medical School (1988), Chalmers University (2000), and in 2000-2001 he held the Aisenstadt Chair at University of Montreal. At the beginning of 2020, he became University Professor Emeritus at the University of Southern California and was appointed Distinguished Research Professor at University of Virginia.\n\nMichael Waterman was named a Guggenheim Fellow (1995). He is an elected member of the American Academy of Arts and Sciences (1995), the National Academy of Sciences (2001) and the National Academy of Engineering (2012). Also he is a elected Fellow of the American Association for the Advancement of Science (1990), Institute of Mathematical Statistics (1991), Society of Industrial and Applied Mathematics (2009), International Society of Computational Biology (2009) and National Academy of Inventors (2018). In fall 2000 he became the first Fellow of Celera Genomics. Waterman received a Gairdner Foundation International Award (2002), the Friendship Award from the Chinese government (2013) and the Dan David Prize(2015). He is an elected Foreign Member of the French Académie des Sciences (2005) and the Chinese Academy of Sciences (2013). He received Doctor Philosophiae Honors Causia from Tel Aviv University (2011) and Southern Denmark University (2013). In 2020 Waterman was awarded the Walter Benter Prize in Applied Mathematics.\n\n\n\nDuring 2003-2008, Professor Waterman held a 5-year term as Faculty Master of Parkside International Residence College at USC. PIRC is a residential college that is home to over 600 undergraduates and serves as a center for internationally oriented cultural, academic and social events.\n\n\n\nFrom May 2008 to May 2014, in addition to his USC appointment Michael Waterman became Chair Professor at Tsinghua University in Beijing. He led a team of distinguished scientists which collectively worked to enhance Tsinghua's programs in bioinformatics and computational biology. He was Cao Xingcheng Chair Professor at Tsinghua University (2008-2017) and Distinguished Professor at Fudan University in Shanghai (2014-2019). Tsinghua Photos\n\nMichael Waterman is a founding editor of Journal of Computational Biology and is on the editorial board of several journals. He is the author of Introduction to Computational Biology: Maps, Sequences and Genomes and is a co-author of the text Computational Genome Analysis: An Introduction. Also with Istrail and Pevzner in 1997 he began the international conference Research in Computational Biology (RECOMB).\n\nProfessor Waterman works in the area of Computational Biology and Bioinformatics, concentrating on the creation and application of mathematics, statistics and computer science to molecular biology, particularly to DNA, RNA and protein sequence data. He is the co-developer of the Smith-Waterman algorithm for sequence comparison and of the Lander-Waterman formula for physical mapping. His paper with Idury in 1995 introduced the use of Eulerian and De Bruijn graphs for sequence assembly. Beginning in 2002 he took alignment-free sequence analysis in a new direction.\n\n“Nothing in Biology Makes Sense Except in the Light of Evolution.”\n\n(Theodosius Dobzhansky, 1900-1975.)\n\nClick to see Large Image"}]}