{"Andy Hurley founded the heavy metal band The Damned Things.": [{"url": "https://www.wikiwand.com/en/The_Damned_Things", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about The Damned Things?\n\nSummarize this article for a 10 years old"}, {"url": "https://blabbermouth.net/news/the-damned-things-debut-album-to-be-released-in-december", "page_content": "According to Rock Sound and Metal Hammer, THE DAMNED THINGS — the new band featuring members of FALL OUT BOY (Joe Trohman, Andy Hurley),ANTHRAX (Scott Ian, Rob Caggiano) and EVERY TIME I DIE (Keith Buckley, Josh Newton) — will release its debut album in the U.K. on December 13. A U.S. release date for the effort has not yet been announced.\n\nTHE DAMNED THINGS made its live debut on June 1, 2010 at the Knitting Factory in Brooklyn, New York.\n\nThe band's setlist was as follows:\n\n01. Ironiclast\n\n02. Excellent Time\n\n03. Bad Blood\n\n04. A Great Reckoning\n\n05. Handbook For The Recently Deceased\n\n06. Fazer (QUICKSAND cover)\n\n07. Grave Robber\n\n08. We've Got A Situation Here\n\nCheck out a review of the concert at Spin.com.\n\nRough-mix versions of two tracks — \"We've Got a Situation Here\" and \"Ironiclast\" — from THE DAMNED THINGS can be streamed on the group's MySpace page.\n\nWhile each individual in the band has experienced their own successes, THE DAMNED THINGS' debut Island/Def Jam album, which combines their love of classic rock anthems and powerful melodies with a heavy metal intensity, turns out to be much more than the sum of the separate parts.\n\n\"This is an amalgam of three very different bands,\" explains FALL OUT BOY guitarist Joe Trohman, who was first introduced to ANTHRAX's Scott Ian three years ago, when the two became fast friends and immediately began writing together. \"It seemed unlikely, but it turned out we were on the same page musically. We were both interested in putting together a heavy/classic-rock, blues-oriented, riff-based band while trying to stay away from what makes that sound generic and overplayed.\"\n\n\"We're trying not to over-think it,\" chimes in Ian. \"Nobody's arm is being twisted to be here. We're just doing it as we go along, and this is the natural progression. We're able to do things exactly how we want to do them by keeping it simple and comfortable for everyone.\"\n\nWith Trohman and Caggiano handling the production duties, the group began writing and recording songs mostly in Brooklyn, Chicago, and Buffalo (where Buckley resides). The template began to take shape, combining those elements of classic rock with the heavier aspects of ANTHRAX and EVERY TIME I DIE, and the hook-laden choruses of FALL OUT BOY.\n\nAccording to Buckley, THE DAMNED THINGS name was inspired by the lyrics in RAM JAM's '70s version of LEDBELLY's \"Black Betty\".\n\nWhile they've all experienced a degree of success, every member of THE DAMNED THINGS acts like there's something still to prove, and part of the exhilaration of it is starting over, going back to the reasons they first started playing music.\n\n\"I feel like I'm giving birth,\" laughs Trohman. \"It's painful and necessary at the same time for me to get this record made. It's really coming together the way I envisioned it in my head.\"\n\n\"This is still all so new to us,\" says Scott. \"There's no baggage yet. We're still very much in the honeymoon period. I remember what it was like to be in ANTHRAX back in 1984. It's just really exciting to get to do that again. I'm in a new band again. It's a blast.\"\n\nTHE DAMNED THINGS is:\n\nKeith Buckley: Lead Vocals\n\nScott Ian: Rhythm Guitar, Vocals\n\nRob Caggiano: Rhythm, Lead Guitar, Vocals\n\nJoe Trohman: Rhythm, Lead Guitar, Vocals\n\nAndy Hurley: Drums, Percussion\n\nJosh Newton: Bass\n\nFan-filmed video footage of THE DAMNED THINGS' June 6, 2010 concert in Brussels, Belgium can be viewed below."}, {"url": "https://www.thefamouspeople.com/profiles/andy-hurley-33226.php", "page_content": "He studied anthropology and history in college as making a serious career in music wasn’t on his mind at that time. Ever since he was a kid, he followed the belief that humans are supposed to live the way they used to live thousands of years ago, in their primitive state, but as he grew up, most of his beliefs faded.\n\nAndy Hurley was born Andrew John Hurley in Wisconsin on 31st May 1980 and lost his father when he was just 5. His mother took care of him for the rest of his childhood and teenage. Andy had saxophone as his very first musical instrument that he learned playing well and along with that, he also played percussion in his school’s marching band.\n\nRecommended Lists:\n\nCareer\n\nAndy’s introduction to professional music happened back when he was in the high school and was slowly gaining interest in playing drums. The year was 1996 and Andy was searching for opportunities to play with some big bands and in the pursuit of his dreams, he became part of several hardcore punk and heavy metal bands such as Killtheslavemaster, Racetraitor, Project Rocket and The Kill Pill. He was unable to find his true calling and kept trying different bands during this time.\n\nThe hardcore metal was getting popular in the late 90s and Andy’s drumming skills got him gigs here and there but nothing concrete was coming across his way. However, things changed for the best in the year 2003, when one of his best high school friends Pete Wentz invited Andy to be a part of their band which was called the Fall Out Boy as they were in dire need of an additional drummer due to some troubles with their previous one, and it didn’t take Andy much time to become a regular with Fall Out Boy.\n\nHis association with the band was extremely successful and despite the fact that this was the fourth band Andy was in, he got the fame in such a short time which he wasn’t able to achieve through his previous stints in more than 5 years. Andy recorded the album ‘Take This To Your Grave’ with the band Fall Out Boy in 2003 to a mega universal success which helped Andy to become one of the hottest drummers around.\n\nIt was the first album by the band which was considered to be an actual hit and the band was reported by the media outlets to be the next big thing. The success continued with their next album titled ‘From Under the Cork Tree’, which climbed at the 9th spot in the Billboard 200 chart and the band spent the year 2005 touring around with their new found success. The album later went on to earn a Grammy nomination for the best New Artist.\n\nThe next two studio albums by the band titled ‘Infinity on High’ and ‘Folie a Deux’ also went on to achieve mega success in their concerts and digital downloads. However, Wentz faced severe emotional trouble during that time which also included a failed suicide attempt. It was being said that he is unable to handle the new found success the band was having and that, among several other things, led the band to take a break for some time in 2009.\n\nAndy got himself busy with several other projects and played for different bands such as a heavy metal band The Damned Things. The band was mostly a collaborative effort and featured members from Fall Out Boy, Anthrax and Every Time I Die and released their very first album titled ‘Ironiclast’. Enabler, another hard core band, hired Andy and in summer 2012, Enabler released their first album with Andy as a drummer titled ‘All Hail the Void’.\n\nLater in 2012, Andy joined a straight edge hard rock band named FocusedXminds, and during that time, media speculations were ripe about Fall Out Boy making a comeback and it was said that Andy will leave FocusedXminds when that happens. Fall Out Boy made a reappearance onto the musical sky in 2013, but Andy continued his association with FocusedXminds."}, {"url": "https://infofamouspeople.com/famous/andy-hurley.htm", "page_content": "35 years 35 years\n\nAndy Hurley's About ✎]\n\nAndy Hurley was born on May 31, 1980 (age 43) in Menomonee Falls, Wisconsin, United States. According to numerology, Andy Hurley's Life Path Number is 9. He is a celebrity Musician, Drummer, Singer. Drummer who became famous as a member of the rock band Fall Out Boy and has also performed with metal bands like The Damned Things. His full name is Andrew John Hurley. His genres are Pop punk,hardcore punk,alternative rock,pop rock,heavy metal,metalcore,emo. His the best movie is The Young Blood Chronicles. The parents of Andy Hurley are Ann Hurley Beyer. His height is 5′ 5″. He has an estimated net worth of $14 Million More information on Andy Hurley can be found here. This article will clarify Andy Hurley's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of Andy Hurley, tell us more about Him\n\n34 years 34 years\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of Andy Hurley ✎]\n\nHis father passed away when he was five; his mother supported their family by working as a nurse. He grew up with nine half-siblings and has been vegan since he was 16. He has been in a relationship with Meredith Allen.\n\n34 years 34 years\n\nAndy Hurley Before Fame ✎]\n\nOn 5-31-1980, Andy Hurley was born. It indicates that He is on life path 9. His personal year number in 2023 is 7. He attended the University of Wisconsin-Milwaukee and was a member of many hardcore punk bands.\n\nThe Numerology of Andy Hurley ✎]\n\nBeing a Life Path Number 9 means embarking on a lifelong quest to quench an insatiable thirst for growth and new experiences. Life Path Number 9 people like Andy Hurley are always searching for more: more experiences, more education, more deep talks, and the next adventure.\n\nAdvertisement\n\nAndy Hurley's personal year in numerology ✎]\n\nAndy Hurley was born in 1980, that means in 2023, Andy Hurley has personal year number 7. This is the second bottoming phase, there will be many challenges and difficulties for Andy Hurley in this year, especially in His career. He should prepare everything for the 8th year.\n\nSuccess of Andy Hurley ✎]\n\nHe is known for being part of the straight edge subculture and is a vegan, as well as a comic book connoisseur.\n\nAssociated with ✎]\n\nHe and Patrick Stump are longtime collaborators as members of Fall Out Boy. Joe Trohman, James Owen Sullivan, and Bob Bryar were also His acquaintances.\n\nNet Worth ✎]\n\nAndy Hurley's estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let's check, How Rich is He in 2022-2023? According to Forbes, Wikipedia, IMDB, and other reputable online sources, Andy Hurley has an estimated net worth of $14 Million at the age of 43 years old. He has earned most of his wealth from his thriving career as a Musician, Drummer, Singer from United States. It is possible that He makes money from other undiscovered sources\n\nAndy Hurley Height Weight ✎]\n\nAt the age of 43, Andy Hurley height is 5′ 5″.\n\n\n\n33 years 33 years\n\nHouses & Cars & Luxury Brands ✎]\n\nAndy Hurley's house, cars and luxury brand in 2023 will be updated as soon as possible, you can also click edit to let us know about this information."}, {"url": "https://alchetron.com/The-Damned-Things", "page_content": "The Damned Things are a heavy metal supergroup consisting of Joe Trohman and Andy Hurley of Fall Out Boy, Scott Ian of Anthrax, Rob Caggiano of Volbeat (formerly of Anthrax) and Keith Buckley and Josh Newton of Every Time I Die. The band's name is inspired by the lyrics in Ram Jam's 1977 version of \"Black Betty\". The band is currently on an indefinite hiatus; all members are now working with their original bands. Although in December 2016, drummer Andy Hurley revealed in an interview that the band has recently recorded a 5 song EP and might return.\n\nHistory\n\nIn 2008, Joe Trohman and Scott Ian met and began writing music together. They invited Keith Buckley, Rob Caggiano and Andy Hurley soon after. The band played its first show at the Knitting Factory in Brooklyn, New York, on June 1, 2010, and their first UK show in London at Heaven on June 10. They also played on the second stage at the Download Festival on June 13, 2010, and on the Helvíti stage at the Copenhell Festival on June 12, 2010. The first single, \"We've Got a Situation Here\", was released on iTunes on October 25, 2010. The songs \"Ironiclast\" and \"We've Got a Situation Here\" were released together as a 7\" vinyl and CD single on November 26, 2010, through Metal Club stores. On October 21, 2010, the band released the song \"Friday Night (Going Down In Flames)\" via their Facebook and Myspace, as well as their first album's artwork.\n\nOn November 29, 2010, the band released the song \"Little Darling\" for free streaming through AbsolutePunk.net. The band's first album, Ironiclast was released on December 14, 2010, through Island Records. Trohman has mentioned that for the album, the band was aiming for a blues- and riff-oriented heavy/classic rock sound, and combining elements from their own bands, going for a traditional hard rock sound combined with the heavier aspects of Anthrax and Every Time I Die and the hook-laden choruses of Fall Out Boy. Trohman has mentioned such bands as Thin Lizzy and Led Zeppelin as having influences on the record. In an interview in December 2010, Trohman confirmed that Josh Newton (formerly of Every Time I Die and From Autumn to Ashes) had joined the band as a full-time bass guitarist.\n\nIn 2011, the band played the Download Festival and Hellfest 2011, and released a second single, \"Friday Night (Going Down In Flames)\". They were scheduled to also play the Australian Soundwave Revolution festival in September–October 2011, but the festival was cancelled and in its place the band played on the Australian Counter-Revolution mini-festival.\n\nA previously unreleased song by the band, \"Trophy Widow\", was released on the soundtrack of the video game Batman: Arkham City on October 4, 2011, while the game was released two weeks later, on October 18.\n\nFinal lineup\n\nKeith Buckley – lead vocals (2009–2012)\n\nJoe Trohman – lead & rhythm guitars, backing vocals (2009–2012)\n\nRob Caggiano – lead & rhythm guitars, backing vocals (2009–2012) , bass guitar (2009 including the recording of Ironiclast)\n\nScott Ian – rhythm guitar, backing vocals (2009–2012)\n\nAndy Hurley – drums, percussion (2009–2012)\n\nJosh Newton – bass guitar (2010–2012)\n\nDiscography\n\nStudio albums\n\nSingles"}, {"url": "https://www.celebnetworthpost.com/andy-hurley", "page_content": "Andy Hurley\n\nAndy Hurley was born on May 31, 1980 in Menomonee Falls, United States (42 years old). Andy Hurley is a Drummer, zodiac sign: Gemini. Nationality: United States. Approx. Net Worth: $14 Million.\n\nTrivia\n\nHe is known for being part of the straight edge subculture and is a vegan, as well as a comic book connoisseur.\n\nNet Worth 2020 $14 Million Find out more about Andy Hurley net worth here.\n\nPhysique\n\nHeight Weight Hair Colour Eye Colour Blood Type Tattoo(s) 165 cm (5' 5'') N/A N/A N/A N/A N/A\n\nBefore Fame\n\nHe attended the University of Wisconsin-Milwaukee and was a member of many hardcore punk bands.\n\nBiography\n\nBiography Timeline\n\n1999 Hurley played in heavy metal and hardcore punk bands including Racetraitor, Killtheslavemaster, Project Rocket, xFor Death or Gloryx, The Kill Pill, and Arma Angelus. In 1999, he was a guest drummer on Vegan Reich's \"Jihad\" EP. 2003 Hurley joined Fall Out Boy in 2003 after the band's debut mini-LP Fall Out Boy's Evening Out With Your Girlfriend and recorded Take This to Your Grave (2003). Hurley had been friends with bassist Pete Wentz since he was 16, and he first filled in on a touring position as drummer for Fall Out Boy before joining the band as full-time drummer. Fall Out Boy is the fourth band Hurley has been in with Wentz. With Fall Out Boy, Hurley has achieved major commercial success and toured the world. 2012 During Fall Out Boy's hiatus from 2009–2013, Hurley was the drummer for the heavy metal band The Damned Things, which featured members of Anthrax, Fall Out Boy and Every Time I Die and released debut album Ironiclast. He has also played in the Milwaukee hardcore band Enabler. It released a full album entitled All Hail The Void in Summer 2012. Hurley is also part of other rock bands. In late 2012, Hurley began playing drums in Milwaukee-based straight edge hardcore band, FocusedXMinds. It was rumored that the return of Fall Out Boy would end his time with the band, but Hurley confirmed on Twitter on March 12 that \"I am in it for life.\" 2013 On February 4, 2013, Fall Out Boy unexpectedly announced their return, along with an album and single with which all four members, including Hurley, contributed. April 12 of the same year, the band released a new album entitled, Save Rock and Roll, featuring the lead single \"My Songs Know What You Did in the Dark (Light Em Up),\" and dates for a new tour. The band played their first show in over three years on the night of February 4 in Chicago. 'Save Rock and Roll' peaked at No. 1 on the Billboard 200, selling 154,000 copies in its first week, becoming the band's 4th consecutive top 10 album. With Fall Out Boy, Hurley toured heavily throughout 2013 and 2014 on the album, selling out arenas worldwide with bands Paramore on the Monumentour. In October 2013, they released a new EP, PAX AM Days which they recorded in a two-day session with producer Ryan Adams. 2014 Sixth studio album American Beauty/American Psycho was released to become the band's third Billboard 200 No. 1 album, debuting with 192,000 first week sales and 218,000 equivalent album units. The album was preceded by the triple Platinum top 10 single Centuries. Uma Thurman was released to mainstream radio on April 14, 2014 and peaked at 22 on the 'Billboard' Top 100, and were certified as Platinum in August 2015. 2016 In 2016 Hurley started a vegan straight edge hardcore band called SECT composed of Chris Colohan (Cursed, Burning Love, Left for Dead and The Swarm) on vocals, James Chang (Catharsis, Undying) and Scott Crouse (Earth Crisis, Path of Resistance) on guitar, and Steve Hart (Day Of Suffering) on bass. They have released two albums so far. 2017 In April 2017, Fall Out Boy released Young and Menace, the lead single for the seventh studio album. The band's seventh album Mania was officially released January 19, 2018 and debuted at number one on the Billboard 200, making it the band's third consecutive and fourth chart-topping debut overall. 2018 In 2018 Fall Out Boy headlined Wrigley Field in the band's hometown of Chicago, marking a milestone in their career as their first headline show at a stadium.\n\n🎂 Upcoming Birthday\n\nCurrently, Andy Hurley is 43 years, 0 months and 11 days old. Andy Hurley will celebrate 44th birthday on a Friday 31st of May 2024.\n\nFind out about Andy Hurley birthday activities in timeline view here.\n\nFacts\n\nHurley can’t stand when somebody standing next to him smokes. Andy Hurley also performed for Enabler, the punk band in 2012. The FOB member is a huge fan of comic books and is working himself on one of them called “Post Collapse.” The musician has been a vegan since his teenage period being acclaimed as one of the sexiest vegans in 2006 by PETA. One of FOB’s latest albums called “American Beauty/American Psycho” reached the number-one place on the American Billboard chart of top 200 right away after the release. Who are his favourite musicians?\n\nAndy Hurley enjoys listening to Slayer, New Kids on the Block, and Jay-Z. Has he got tattoos?\n\nThere are plenty of them inked on his body, 2600, in particular, but they are very small. What are his beliefs?\n\nHurley is a follower of the anarcho-primitivism, the movement that criticizes all sorts of the progress of civilization. However, Andy Hurley admits that his career contradicts his ideas. What instruments can he play except for drums?\n\nAndy Hurley's first musical instrument he learned how to play was the saxophone. Nevertheless, Andy Hurley started out as a percussionist playing in various small bands.\n\nAndy Hurley trends\n\nFAQs"}, {"url": "https://www.nuclearblast.com/eu/band/the-damned-things", "page_content": "One of the leading heavy metal record labels and online shops in the world\n\nNuclear Blast Records is among the world's leading heavy metal online shops, when it comes to ordering CDs, vinyl records, and Blu-Ray/DVDs, as well as accessories and merchandise such as band T-shirts, hoodies, patches, and a whole lot more from the heavy metal scene. At the Nuclear Blast online metal store, you'll find over 30,000 items from more than 8,000 bands—pieces to add to your music collection, merch to get into for concerts and gigs, and stuff to gift to heavy metal fans you know.\n\nMUSIC\n\nAs the number one heavy metal record label, Nuclear Blast specializes in offering items from metal icons of the following genres: death metal, thrash metal, black metal, gothic, hard rock, doom, hardcore, symphonic metal, power metal, pagan metal, and progressive metal. In our online metal store, you can get your favourite albums on vinyl, including pre-ordering exclusive drops of colored vinyl bundles and other limited-edition pieces. Along with the extensive vinyl selection, you can shop for your favourite bands and all-time heavy metal classics in CDs + DVDs/Blu-Rays and box sets at Nuclear Blast online metal store.\n\nMERCH\n\nIf you're looking for a heavy metal shop to get official merchandise from your favourite bands and artists, Nuclear Blast Records is the place to be. In our metal shop, we sell metal band-related apparel, accessories, and official fan merchandise. From band T-shirts, jackets, and hoodies to patches, pins, and other carefully selected merch and deluxe items, the Nuclear Blast online store has what any fan could ever want and need.\n\nAs soon as the goods you order are in stock or released, your order gets prepared for shipment and will be delivered within 3-5 business days. Shop from a vast range of heavy metal articles at NuclearBlast.com heavy metal online shop. Get the latest and exclusive heavy metal fan artefacts at a fair price for all those interested in T-shirts, CDs, DVDs, vinyl, and more from the leading heavy metal record label around."}, {"url": "https://crypticrock.com/the-damned-things-high-crimes-album-review/", "page_content": "The Damned Things – High Crimes (Album Review)\n\n261 SHARES Share Tweet\n\nWhat do Anthrax and Fall Out Boy have in common? If you said nothing, you, my friend, are so very wrong. Heavy Metal supergroup The Damned Things return with their second opus, and first in nearly nine years, High Crimes, which arrives Friday, April 26, 2019, thanks to Nuclear Blast Records.\n\n\n\nSure, supergroups have a curious history of not always being quite so super, but The Damned Things merely scoff at this notion. The inception of the band began in 2008 when Fall Out Boy’s Joe Trohman and Anthrax’ Scott Ian sat down and began writing music together. With the seeds planted, the project grew to involve Trohman’s bandmate Andy Hurley, Every Time I Die frontman Keith Buckley and his former bandmate Josh Newton, and Ian’s former bandmate Rob Caggiano (of Volbeat). Together, the band released their debut, Ironiclast, in 2010, rocked the festival circuit, and then, most unfortunately, being forced to be super elsewhere got in the way of their collective fun.\n\n\n\nAfter a lengthy hiatus thanks to their pesky day jobs, the boys are back with a slight line-up twist: both Caggiano and Newton have departed, while Alkaline Trio’s Dan Andriano has stepped in on bass — making The Damned Things even more super. For those keeping score, the Heavy Metal supergroup is now comprised of Vocalist Buckley, Guitarists Ian and Trohman, Bassist Andriano, and Drummer Hurley.\n\n\n\nTheir latest, the 10-song High Crimes, is the band’s sophomore disc, produced by Jay Ruston (Anthrax, Stone Sour), and sees the group continuing their Blues and riff-oriented approach to a classic, heavy rocking sound. In the most Punk Rock sense, many of the songs are short suckerpunches that deliver maximum oomph, always with a nod to yesteryear’s bluesier, grittier form of Rock-n-Roll.\n\nHigh Crimes opens to the heavy Nirvana influence of “Cells,” a grungy Alt Rocker with some schnazzy guitar work, moments of melody, and a light-hearted look at the oxymoronic nature of life. Next, they amp up the wit on “Something Good,” which opens to the gang chant “Y-E-L-L / All of my friends are going to hell.” A funktastic beat anchors this catchy rocker about a relationship that has fallen apart.\n\n\n\nThe swagger of “Invincible” parades through some seriously bluesy, hard rockin’ 1970s influences. In fact, the band’s backstory involves a whole lot of Thin Lizzy love, which is apparent on tracks such as this. True to their influences, this classic approach continues into the bass-heavy licks of “Omen,” before Buckley and the boys explode into the raucous licks of “Carry a Brick.” Here, they meander through a multitude of sounds to build into melodic, rocking choruses.\n\nAt nearly six minutes, “Storm Chaser” provides High Crimes’ most epic offering. A sludgy, bluesy stomp, the track sees the band firing on all cylinders to craft an offering that is a delicious nod to a more masterful time in Metal. While it might not be the album’s most catchy or radio-ready offering, it’s certainly a killer representation of what The Damned Things are all about.\n\n\n\nThey amp it back up for the raucous pace of the groovin’ “Young Hearts,” a truly catchy rocker that prepares them to dip back into the sludge for the vicious cycle of “Keep Crawling.” Next, the boys present “Let Me Be (Your Girl).” (Yes, you read that correctly.) An explosion of gritty guitars, The Damned Things go all out for the oft psychedelic licks of the deeply grooving rocker. Ultimately, they end with the suckerpunch of “The Fire Is Cold.”\n\n\n\nIf you step into High Crimes expecting a band that sounds like a schizophrenic cross between the members’ other projects, then you’re going to be seriously disappointed. The Damned Things have a definite classic Metal/Hard Rock vibe that blends with some smoky Psychedelia to author a dirty Punk Rock good time. Certainly, you can’t question their musicianship, particularly the killer guitar antics of Ian and Trohman, and Buckley’s signature vocal swagger. So, now that The Damned Things have put the ‘super’ back into the supergroup, Cryptic Rock give High Crimes 4.5 of 5 stars.\n\nPurchase High Crimes :\n\n[amazon_link asins=’B07NS33MK4′ template=’ProductCarousel’ store=’crypticrock-20′ marketplace=’US’ link_id=’7ebdd88b-76aa-4dbe-9241-c9a7b9b4902d’]\n\nRelated posts: No related posts."}, {"url": "https://www.musicradar.com/news/fall-out-boys-andy-hurley-for-a-long-time-i-had-doubts-that-i-could-play-drums-anymore", "page_content": "Fall Out Boy first emerged from the early 2000s hardcore punk scene in Chicago.\n\nThe band - formed by bassist Pete Wentz, guitarist Joe Trohman and guitarist/singer Patrick Stump - stood head and shoulders above the competition with their extraordinary melodies, gigantic hooks and Stump’s incredible vocal.\n\nPeople really started to take note with the release of debut album Take This To Your Grave in 2003, the first Fall Out Boy music to feature straight-edge, heavy metal-loving Andy Hurley on drums. The album was a pop-punk masterpiece that established Hurley as a force to be reckoned with behind the kit - equal parts Travis Barker and Dave Lombardo.\n\nThe band went on to achieve monumental success with follow-up album From Under The Cork Tree, which spawned mega hit Sugar We’re Goin Down, followed by Infinity On High and Folie à Deux. While shy guy Andy wasn’t a huge fan of the ever-increasing limelight, he let his memorable drum parts do the talking. By 2010 Fall Out Boy were burned out and a three-year hiatus was quickly announced.\n\nAndy fed his passion for heavy metal and hardcore punk, recording and touring with bands including Enabler and Earth Crisis, and forming heavy rock band The Damned Things with Trohman. Andy still uses downtime from Fall Out Boy to play with hardcore band, Sect. Fall Out Boy returned refreshed and fighting fit in 2012, releasing three chart-topping albums in a row, culminating in this year’s Mania.\n\nWhile the band’s sound has evolved through the years, their core DNA remains, and Fall Out Boy continue to sell out arenas around the world. We hooked up with Andy Hurley during the recent UK tour to learn more about the band’s incredible journey.\n\nYou joined Fall Out Boy around 2003. What were the circumstances surrounding that?\n\n“I was in hardcore bands with Pete [Wentz] for years. At the time I was going to college and playing in three bands. That’s why they didn’t ask me to join when they first started, but they needed someone to fill in for a tour and then they were recording some demos.\n\n\"The guy producing it, Sean O’Keefe who also produced Take This To Your Grave, asked if I could play on them. I loved the music they were making. The music being written for the demos, which became Take This To Your Grave, was the best stuff I had ever been a part of.”\n\nHow would you describe your drumming at the time?\n\n“I think I reached my peak back then and I’ve been coasting on that for 15 years! Not really. I think that’s probably when I started coming into my own as a drummer, being in bands and figuring out how to play with a band. Joining Fall Out Boy was the best education for that.”\n\nDid you have much recording experience before Take This To Your Grave?\n\n“I’d recorded with a few projects, but never anything like that. We recorded a lot of it in Madison, at Butch Vig’s studio [Smart Studios]. It was the biggest studio and the biggest thing we’d done. There was a microphone that Kurt Cobain used in that studio! Everything I’d done [before that] was with friends, or in much smaller studios.”\n\nWhat did you learn from the experience?\n\n“Confidence. For a long time, even on From Under The Cork Tree and Infinity On High, I had doubts that I could play anymore. From Under The Cork Tree was the first major label record we did, so that was an even bigger thing than Take This To Your Grave. I guess Take This To Your Grave was the beginning of finding comfort - of knowing what I’m doing and not over thinking it.”\n\nFrom collaborating so much I’m better at hearing what the core DNA rhythm is in a song\n\nBetween Take This To Your Grave and Mania, Fall Out Boy’s sound has evolved. Would you say your drumming has developed in tandem with that?\n\n“Maybe a little. After the hiatus there was a bigger tweak. I think it follows with being in a band with songwriters who have specific ideas. Both Joe [Trohman] and Patrick [Stump] have certain things they want accented on the drums, so every aspect of every song is a collaborative thing.\n\n\"I might have an idea for a kick pattern and it totally goes against the vocal pattern. I think the evolution is just being more subservient to what the song requires. On Mania, it’s the most real drums you’ll hear on songs in the modern Fall Out Boy era. On the last couple of records there’s drums for the whole thing, but a lot of times they’re mixed with drum loops or cut up.”\n\nFrom Under The Cork Tree and Infinity On High are the band’s biggest-selling albums. What do you remember about the writing and recording and did you have an inkling they were going to be hits?\n\n“I think we knew that we’d written some great songs and a great album, but I don’t think we had any idea it would be as big as it was. I think it was just a belief that this is the best work we’ve done to this point. You can rally behind that.\n\n“There was a moment in the recording of Sugar We’re Goin Down where Patrick did a take of a harmony or something and there was just a look when he came into the booth where we were like, ‘This is a hit!’ He’s got an amazing voice and I think that is a big reason for our success. He’s just so talented. Obviously, that’s all bluster and jokes in the studio; you have no idea if anyone will care.”\n\nDid those two albums come together fairly easily?\n\n“Cork Tree... and Infinity... took work. Sugar… went through a lot of different iterations before it became the song that it was. The original verse I remember I hated. The idea for what the verse became happened last minute, right before recording. That saved it for me.\n\n\"There was a lot of stuff that we had to hash out in the rehearsal space for both albums. I don’t really hear the songs until I’m in the studio now. It’s become much more on the fly, which I really love. I think different ideas come to me more than if I had the time to do what I’d normally feel like doing. It’s more instinctive.”\n\nThe drum parts are a key element of Fall Out Boy’s sound. How much input comes from the other guys?\n\n“Patrick is a drummer and so he’s big on specific rhythms and patterns. And Joe, with The Damned Things stuff - there were a lot of specific things he wanted. Other bands I’ve played in recently have had people who were either drummers or really adept at writing drum parts in their demoing.\n\n\"I really like when there’s a specific thing that someone wants to hear. I think that from collaborating so much I’m better at hearing what the core DNA rhythm is in a song to begin with.”\n\nDo you remember a point at which things were getting noticeably bigger for Fall Out Boy?\n\n“I guess it was the Warped Tour in 2005, the year From Under The Cork Tree came out. That was us and My Chem. It was the year where it was getting pretty crazy. Even the year before, we had a show on some really small stage, I think it was in Detroit, and the crowd was too big and they knocked the fence down.\n\n\"There were a few shows like that here and there, but that year of Warped Tour was where every show felt like that.”\n\nThen things went stratospheric! You seem a fairly private guy. How comfortable did you feel with the limelight?\n\n“It was something you get used to. I definitely don’t like photoshoots, but I’m pretty comfortable with it now. For stuff like [drum magazines] it’s just me, but with the full band it’s a little easier because I can be the fourth person in the group and don’t necessarily have to carry it. That’s usually Pete. He’s really photogenic and good at that stuff.”\n\nThe size of gigs changed dramatically too...\n\n“I’ve been doing Sect shows during any off-time from Fall Out Boy. The weekend before we came out here I was in the midwest for three shows. We played a VFW [Veterans of Foreigh Wars] hall, a basement and a small club.\n\n\"To be honest, that actually makes me more nervous than playing an arena. I’m used to [big shows]. I can’t focus on any one person. A basement show, where there’s going to be at most 50 people, I can see everyone and any mistakes are bigger because I’m right in front of them.\n\n\"I’m more comfortable because I feel more plugged into something at a smaller show, but I also feel like I have to play better. Actually, I don’t have to worry about a lot of stuff at a show this size, whereas I worry a lot about the Sect shows because I have to make sure I have a kit, bring a snare and cymbals. I’ll confess, I’ve forgotten sticks once before! That’s all coming from a situation where I don’t have to worry about it.”\n\nWhich drum parts would you say define your playing in Fall Out Boy?\n\n“Take This To Your Grave is the one where I was trying to emulate Travis Barker and guys like that the most. I was playing more beats that go around the kit.\n\n\"I think there’s stuff on Mania in terms of fills or just a stripped-down beat that I’m most proud of. Last year my big inspiration in terms of drumming was Danzig’s Chuck Biscuits. I think he’s just one of the best drummers because he’s so hard hitting. He’s playing exactly what’s needed.\n\n\"His fills, while simple, are better than a fill I would choose to do. I was a Dave Lombardo-influenced drummer growing up, so I tried to call Chuck’s spirit into my playing more on Mania.”\n\nYou’ve played on plenty of hardcore and metal albums too. What do you consider to be your drumming highlights outside of Fall Out Boy?\n\n“I think the Enabler record has a lot of stuff I’m really proud of. Sect is probably the highlight of my musical career. The last record we did, which came out last year, is called No Cure For Death. Stylistically, what’s being played is really fun, it’s fast and fill-y and double bass-y and blast beat-y. But it’s also about the people in it.\n\n\"There’s a guy from Earth Crisis, who were one of my favourite bands growing up. The singer was in Cursed, which is my favourite hardcore band. They’re also a vegan straight-edge band, which is important to me.”\n\nFall Out Boy took a break between 2010 and 2012, during which time you stayed busy with a number of different music projects. Was it important to do things that were completely removed from FoB?\n\n“I don’t think the impetus was that it needed be different, I think it was just about doing stuff. The hiatus was really difficult because you become so institutionalised to having a schedule laid out for a year and a half to two years. When you don’t have anything, at that time it was really difficult for me. It was depressing.\n\n\"You spend all this time on tour being like, ‘I just wish I was home and had nothing to do.’ Then you have nothing to do for two weeks and you’re like, ‘I have no idea what to do with my life.’\n\n“A lot of cool opportunities came. That’s where I met Earth Crisis through a mutual friend who was managing them and I filled in on a tour. Then I did the Enabler record and some tours with that. The Damned Things was the big one. That was awesome. I think that more just speaks to the fact that heavy metal and hardcore is the kind of music I grew up with.”\n\nDid you take time to work on your playing during that period?\n\n“No. I met Tomas Haake from Meshuggah and asked him what he does to warm up or practise at home. He said, ‘Nothing’. When he’s off he goes fishing. He doesn’t touch drums. That’s the case for me.\n\n\"On the hiatus I was playing a lot more with friends’ bands and staying busy with that. Tomas said that he got to a place where he could play what he wants to play and then coasted, I guess.\n\n\"I can play all the kinds of music I want to play and that’s what I love about music. I’ve never been a dude who’s practising every day to play crazier stuff.\n\n“My drum tech, Brandon, plays in this band Misery Signals. He’s the best drummer I know. He’s so technically proficient. He practises every day for two hours. He’s always pushing himself to be better. I’ve just never had that drive. But that’s not to say that when there’s something I want to play in a band and I’m not able to nail it I won’t practise and really work on things.”\n\nDid you return to Fall Out Boy with renewed vigour?\n\n“Totally. We couldn’t come back putting out the same records and we wouldn’t want to. That challenge to evolve with the times is fun and it keeps things interesting. I definitely think the break cleared my palette so I could plug in to the new form that Fall Out Boy existed in easier than if I wasn’t doing these projects that let me loose.\n\n“On the Sect and Enabler records I’d do takes of just fills - just filling through a whole song and figuring out what works best. It’s interesting because coming back from hiatus, that’s what I did for Fall Out Boy. I’d do takes of just the beat that’s going to be mixed with a loop or whatever and then we’d do takes of fills, just to see if something comes out of it.”\n\nA lot of bands that came up at the same time as Fall Out Boy are no longer about. You guys are still releasing Number 1 albums and selling out big venues. What do you think it is that keeps people coming back for more?\n\n“I’m really thankful for the opportunity and the fact that people still care. I don’t really fully understand why. We try to evolve and push our boundaries, because we want to and because it’s a challenge to us to do something different every time while maintaining the DNA that makes us who we are. Maybe that’s something that speaks to people, the fact that we’re still inspired to make music that we love.”\n\nIf you hadn’t joined Fall Out Boy, what would you be doing today?\n\n“I just watched an interview with [Star Wars actor] John Boyega on Desus and Mero’s podcast. It’s called Bodega Boys. They just talk about pop culture stuff. They asked John Boyega what he’d be doing if he wasn’t acting and he said, ‘This is what I’d be doing’. This was his one option, there was no plan B. I feel the same way. If I’m not doing this I’ll be dead. If I wasn’t in this band I’d be in another band, that’s for sure.”"}, {"url": "https://blabbermouth.net/news/the-damned-things-we-ve-got-a-situation-here-video-released", "page_content": "\"We've Got A Situation Here\", the first video from THE DAMNED THINGS — the new band featuring members of FALL OUT BOY (Joe Trohman, Andy Hurley),ANTHRAX (Scott Ian, Rob Caggiano) and EVERY TIME I DIE (Keith Buckley, Josh Newton) — can be viewed below. The clip was written and directed by Brendon Small, the co-creator of Adult Swim's \"Metalocalypse\".\n\nTHE DAMNED THINGS will release its debut album, \"Ironiclast\", in North America on December 14 (one day earlier internationally) via Island/Def Jam.\n\n\"Ironiclast\" track listing:\n\n01. Handbook For The Recently Deceased\n\n02. Bad Blood\n\n03. Friday Night (Going Down In Flames)\n\n04. We've Got A Situation Here\n\n05. Black Heart\n\n06. A Great Reckoning\n\n07. Little Darling\n\n08. Ironiclast\n\n09. Grave Robber\n\n10. Blues Having The Blues\n\nCheck out the song \"Little Darling\" using the audio player below.\n\nRegarding the track, Buckley told AbsolutePunk.net, \"'Little Darling' may have been the most instinctually oriented song on the record as far as the lyric writing was concerned.\n\n\"I remember when Joe and Rob and I sat down to go over possible melodies, the first line was the 'example' we gave as to the vocal cadence of the verse. I remember saying, 'OK, so something that SOUNDS like 'little darling',' and went to the drawing board. After nothing really felt right, I realized that those two words were perfect from the beginning. It set the tone for the entire rest of the song which is essentially just a letter of apology for being so absent from certain people's lives.\"\n\nTHE DAMNED THINGS will perform on the Thursday, January 13 episode of ABC-TV's \"Jimmy Kimmel Live!\" (which will actually air the morning of Friday, January 14).\n\nTHE DAMNED THINGS made its live debut on June 1, 2010 at the Knitting Factory in Brooklyn, New York.\n\nWhile each individual in the band has experienced their own successes, THE DAMNED THINGS' debut CD, which combines their love of classic rock anthems and powerful melodies with a heavy metal intensity, turns out to be much more than the sum of the separate parts.\n\n\"This is an amalgam of three very different bands,\" explained FALL OUT BOY guitarist Joe Trohman, who was first introduced to ANTHRAX's Scott Ian three years ago, when the two became fast friends and immediately began writing together. \"It seemed unlikely, but it turned out we were on the same page musically. We were both interested in putting together a heavy/classic-rock, blues-oriented, riff-based band while trying to stay away from what makes that sound generic and overplayed.\"\n\n\"We're trying not to over-think it,\" chimed in Ian. \"Nobody's arm is being twisted to be here. We're just doing it as we go along, and this is the natural progression. We're able to do things exactly how we want to do them by keeping it simple and comfortable for everyone.\"\n\nWith Trohman and Caggiano handling the production duties, the group began writing and recording songs mostly in Brooklyn, Chicago, and Buffalo (where Buckley resides). The template began to take shape, combining those elements of classic rock with the heavier aspects of ANTHRAX and EVERY TIME I DIE, and the hook-laden choruses of FALL OUT BOY.\n\nTHE DAMNED THINGS is:\n\nKeith Buckley: Lead Vocals\n\nScott Ian: Rhythm Guitar, Vocals\n\nRob Caggiano: Rhythm, Lead Guitar, Vocals\n\nJoe Trohman: Rhythm, Lead Guitar, Vocals\n\nAndy Hurley: Drums, Percussion\n\nJosh Newton: Bass"}]}