{"In 2010, Andy Hurley founded the heavy metal supergroup The Damned": [{"url": "https://www.rollingstone.com/music/music-news/how-fall-out-boy-beat-the-odds-and-rose-again-233869/", "page_content": "When Fall Out Boy announced their reunion earlier this year, they had serious doubts whether anyone would really care. The emo movement is long over, their young fans have grown up and their solo careers were largely dead on arrival. Despite all that, the band is experiencing a rather stunning renaissance. Their single “My Songs Know What You Did In The Dark” has been sitting comfortably in the Top 30 of the Hot 100 for more than two months, earning lots of radio airplay and even a nod from Taylor Swift, who tweeted that she’d listened to the song 43 times in a single day. Concert tickets are selling like crazy, and they’re even moving back to arenas.\n\nFall Out Boy’s new album, Save Rock and Roll – featuring guest appearances by Elton John, Courtney Love and Big Sean – hit stores on Tuesday and is the second best-selling album in the iTunes music store. “The world moves so fast that we didn’t know if people would care,” says Pete Wentz. “So to have people care now and show interest . . . that’s the great part. It proves to us that this band did mean something.”\n\nFour years ago, the band had serious doubts about that. They felt incredibly uncool and unappreciated, not that much different than a hair metal band struggling to survive in the grunge era. It was a little like being Mötley Crüe in 1991. Fall Out Boy’s 2008 LP, Folie à Deux, failed to connect, and band relations were at an all-time low when they hit the road to promote it. “It felt like an out-of-body experience,” says guitarist Joe Trohman. “Some of us were miserable onstage. Some of us were just drunk. The fans were just trudging through the new songs. They didn’t want to hear them.”\n\nEditor’s picks\n\nFolie à Deux was intended to be a commentary about the narcissism of American culture, but frontman Patrick Stump feels it didn’t quite work. “I think a lot of that last record cycle was my fault,” he says. “I had an actual dream about what the record should sound like. I tried to make that happen, but nobody was with me. I was trying to push my agenda, and that was a weird thing to do.”\n\nPete Wentz on His ‘Brutal’ First Tattoo and Hosting ‘Best Ink’\n\nIt was also a very difficult time for Wentz, the bassist and lyricist. “My personal life was whatever at the time,” he says. “It was really rough. I grew a heinous beard and got blackout drunk, smashed my face and cut it open . . . I could feel the backlash against the band. I mean, I was in such a haze of selfishness and pills it was hard to believe I could feel anything.”\n\nWentz was married to Ashlee Simpson at the time, and she had just given birth to their son, Bronx Mowgli. Their photos were constantly in the tabloids. “I was high on being Pete Wentz,” he says. “Now I understand how I was overshadowing the band, especially Patrick. This kid is a fucking genius. He’s probably one of the best melody writers around. In any band that would have been talked about constantly, but I was just overshadowing it. I knew it, but I didn’t know how to stop it. It was a snowball that had just gotten so big.”\n\nAs the tour slogged on, Stump began realizing the band desperately needed a break. “He sat us down and said, ‘If we don’t take a break we’re going to break up,'” recalls drummer Andy Hurley. “He also said, ‘We’ll hate each other and never want to do this again.’ The thing is, I didn’t want to stop.”\n\nWentz was also very resistant to the idea of a hiatus, but Stump knew it had to be done. “Seven years is a long time to never have a weekend,” he says. “Not everybody agreed with me. But the pace we were on was like a gyroscope. It’s the speed that holds it together . . . It’s like the whole Yoko Ono myth. She didn’t break up the Beatles. They were already fractured by the time she came around.”\n\n“I withdrew from things,” says Wentz. “The dynamic of the band had changed. Everyone’s personalities had changed from when we started the band. Patrick didn’t used to be outgoing at all, and then he grew into himself. I don’t know that I gave him room to change. I think that having a kid made me understand myself a lot more. Back then, I didn’t respect people’s time. I would show up to stuff whenever I felt like it. I was a selfish guy that ended up in a position I didn’t even understand. Nobody gave me a rule book or anything.”\n\nRelated\n\nFall Out Boy played their last show at Madison Square Garden on October 4th, 2009. “I was really sad that night,” says Hurley. “I cried a little before we went onstage. I thought to myself, ‘Maybe this is it.'” They closed out the show with “Saturday,” from their 2003 debut LP Take This to Your Grave. Near the end, Mark Hoppus from Blink-182 shaved Wentz’s head. It was a symbolic cleansing of the past, but also the beginning of a very dark chapter for the band.\n\nComing home from the tour without any Fall Out Boy activity in the foreseeable future was quite sobering. “My calendar was empty,” says Hurley. “Touring the way the we did and having a schedule like we did institutionalizes you in a way where you don’t know anything else. I think I went through the darkest depression I’ve ever felt in my life. That winter was horrible.”\n\nWentz had a similar experience. “I called my manager and was like, ‘Do people not email as much?'” he says. “I used to wake up and say, ‘I can’t stand how many emails I’m getting.’ Then I didn’t get them at all anymore . . . I went through a really, really dark, weak period, and then at the same time I didn’t have an outlet to express myself. Patrick was still my best friend. I was in his wedding. At the same time, I felt like he needed to get some of that Pete Wentz stink off of him.”\n\nThe four members of Fall Out Boy ultimately poured their energies into new musical projects. Andy Hurley and Joe Trohman formed the heavy metal supergroup the Damned Things with members of Anthrax and Every Time I Die. They released a well-received album in 2010, but they never got much traction. Wentz formed the dance music act Black Cards with singer Bebe Rexha. They released an EP and toured a bit, but it too failed to take off in any meaningful way, and Rexha quietly left the group last year.\n\nPatrick Stump put resources into his 2011 solo debut Soul Punk. It earned positive reviews, but many Fall Out Boy fans weren’t willing to follow him in a new direction. He went on a club tour, and even opened dates for former FOB proteges Panic! At the Disco. Nothing seemed to work.\n\n“People were calling me a sell-out while I was doing my solo thing,” Stump says. “And I was losing lots of money. I was like, ‘If I were selling out, I hope I could do a little better job at it.’ There are totally valid criticisms to say, like, ‘I don’t like the record,’ or, ‘I don’t like the direction you’ve taken. I miss your band.’ Those are totally valid things to say. Things that aren’t valid to say are, ‘You’re doing this for the money,’ or, ‘You think you’re Michael Jackson.'”\n\nAs his solo tour went on, Stump’s mood continued to darken. “I was doing this as a labor of love, and I’ve never gotten so much shit in my life,” he says. “It’s weird. I don’t think I was bullied until I was 27. It just blew my mind how cruel people can be. They would pay go to the shows just to heckle me. They’d even yell out, ‘I liked you better fat!’ I was like, ‘That has nothing to do with anything. That was for health reasons, jerk.'”\n\nDuring a particularly dark moment in February of 2012, Stump poured his heart out in a long blog entry called “We Liked You Better Fat: Confessions of a Pariah.” “Touring on Folie was like being the last act at the vaudeville show,” he wrote. “We were rotten vegetable targets in Clandestine hoods.” He went on to reveal that he blew his nest egg on his solo tour. “I still have access to enough money to live on in order to avoid bankruptcy for at least a few years as long as I stick to my budget . . . I guess I’m just angry when I’m a 27-year-old has-been . . . It’s as though I’ve received some big cosmic sign that says I should disappear.”\n\nIt was a shocking display of honesty and raw emotion. It’s no longer on Stump’s site, and he winces slightly when it’s brought up. “I think it’s safe to say that pull quotes aren’t my strong suit,” he says. “I’m not very succinct . . . Also, I was not broke. I just meant I’m going to have to work again in my life. It’s not like we were 1980s-cocaine-superstar rich. People were like, ‘Boo-hoo, he can go cry in his pile of money. He can go dive into Uncle Scrooge’s money bin.’ Well, I don’t have that.”\n\nRight around the time Stump posted the letter, Wentz reached out to him. “I was like, ‘Let’s write some songs or something,'” he says. “I was in a dark place and I needed a creative outlet. Patrick is such a nice guy that he wrote the songs with me, but I don’t think his heart was in them. They were kind of ‘meh.’ I’d equate it to some lost weekend thing that only one fan on the planet would care about. It was kind of a wash.”\n\nUndeterred, they tried again not long afterwards. Eventually they came up with the song “Where Did the Party Go.”\n\n“Pete got really excited, and that got me excited,” says Stump. “It gave us a ton of momentum. Then we decided it was time to call everybody else.”\n\nThe group reunited at a secret meeting at their manager’s house in New York. “We had to hammer out the idea that if we were going to do this, it had to be about the future of Fall Out Boy,” says Wentz. “We weren’t just going to be a legacy band.”\n\nSave Rock and Roll was recorded in Venice, California with producer Butch Walker. Keeping it secret was tough, especially for a group so visible on social media. “I definitely stayed away from Twitter,” says Hurley. “I didn’t want to be geotagged or anything.”\n\nFinding a new sound wasn’t as difficult as they feared. “I hear a lot of bands complain as they get older, ‘Oh, the new generation doesn’t get us,'” says Stump. “It’s like, ‘Well, you have to stay relevant by making music that’s relevant to people.’ What’s fascinating to me is that you can’t contrive that. You can’t just make the same record that you made forever ago and expect that be something that will resonate with people. But you also can’t go for radio and that kind of thing. You have to find this zen place when you find something that sounds like you, but also new.”\n\nTrending The FDA Warned Ozempic Users. They Don’t Give a F-ck Right-Wing Media Is Saying the Wildfire Smoke Is Good, Actually Oh-So-Mature Trump Aides Want Him to Focus on DeSantis’ Penis Kimberly Perry on The Band Perry's Breakup: 'Did We Leave or Were We Kicked Out?'\n\nIt’s a difficult mix to find. “We wanted something that was really raw,” says Wentz. “But we still needed something where people felt the same feelings they had when they first listened to Fall Out Boy, but the music couldn’t sound like the same music we’d done before. We’ve never been a band that plays it safe. We could have probably written ‘Sugar, We’re Going Down’ five times, but we never did.”\n\nNot telling a soul about the reunion until everything was in place was extremely important for the band. “Ultimately, we’re fans of Fall Out Boy,” says Wentz. “From a fan’s perspective, we thought about how we’d want it to happen. Bam, it’s on the Internet. You get the song, you get the album, you get the show. The delay would have driven me crazy.”\n\nOn the morning of February 4th, they announced everything: the single, the album and the tour. They played a show that night at a tiny club in Chicago. The next night, they hit the basement Studio at Webster Hall in New York. Fans lined up in the freezing cold about 10 hours before showtime, many clutching handmade signs. It felt like a time warp back to 2006, and when the group took the stage and launched into “Thriller,” the squeals were deafening.\n\nFall Out Boy have nearly 60 dates on the books right now, and in the fall they are headlining arenas in the States. The band claim they had little idea people would care this much.\n\n“We never really cared about that, though,” says Stump. “It’s always been the four of us against the world. When we left, it felt like the world kind of won. It was disheartening, but the irony is I was just reading a review of a recent show. Someone said, ‘Wow, that was really great, but they should really play more songs from Folie à Deux.'”"}, {"url": "https://music.mxdwn.com/2016/12/12/news/the-damned-things-featuring-andy-hurley-of-fall-out-boy-and-scott-ian-of-anthrax-have-recorded-a-new-ep/", "page_content": "Home News Matt Matasci December 12th, 2016 - 10:54 PM\n\nIt has been a while since the eclectic rock supergroup The Damned Things have been active. It would be completely natural to presume the group would have died out with the release of just one full-length release, Ironiclast. The lineup featured busy artists like guitarist Scott Ian of Anthrax, drummer Andy Hurley and guitarist Joe Trohman of Fall Out Boy, vocalist Keith Buckley and bassist Josh Newton of Every Time I Die and guitarist Rob Caggiano of Volbeat (and for a minute, Anthrax).\n\nHowever, Hurley revealed on the 100 Words or Less podcast (which is hosted by Ray Harkins, lead singer of Southern California hardcore band Taken), that he has recorded a five-song EP with the band. At 1:13:25 he discusses The Damned Things.\n\nDespite the fact that there could be a pending release from this impressive and diverse range of metal, hardcore and punk superstars, it does not seem like a tour is in the works. Hurley said, “I don’t think we’ll be playing, Anthrax is still touring on their last record. ETID just put out their new record, uh, who else? Josh Newton I think has been playing lately…So you know, that’s all over the place.”\n\nAs all-star lineups like the one The Damned Things sports can have a bit of a transient nature, there is no indication if all of the members from Ironiclast were involved in the new recording sessions.\n\nEvery Time I Die recently released their eighth album Low Teens and are embarking on a Spring 2017 tour in support of the Epitaph Records-released effort.\n\nAnthrax has also had a busy 2016, releasing another new album, the excellent For All Kings, which spawned singles like “Blood Eagle Wings” and “Monster at the End” and a surprising acoustic rendition of “Breathing Lightning.”. The band also announced a Record Store Day exclusive 7″ for Black Friday, which featured “A Monster at the End” and “Vice of the People.”\n\nEven Caggiano has had a busy 2016, releasing an album with his main gig Volbeat, Seal the Deal & Let’s Boogie in June. Naturally, the single “Seal the Deal” was released from the album with a video being made."}, {"url": "https://metalinsider.net/supergroup-from-hell/members-of-the-damned-things-collaborate-on-new-project", "page_content": "The Damned Things’s debut album Ironicast was arguably one of the best surprises to come out of 2010. Sure, a supergroup featuring members of Anthrax and Every Time I Die sounded promising. But many scratched their heads at the inclusion of Fall Out Boy drummer Andy Hurley and guitarist Joe Trohman. However, what resulted was a kick ass hard rock album.\n\nNow that we’re well into 2012, though, The Damned Things are understandably taking a break for the foreseeable future. However, Trohman revealed that he would be continuing to work with his The Damned Things bandmate Josh Newton in his project With Knives. The Fall Out Boy guitarist gave the following lengthy update via his blog:\n\n“Just filling everyone in on what’s going on with myself and others are working on:\n\n-The Damned Things are most likely not doing anything in 2012. As I’ve mentioned before ETID & Anthrax are very very busy touring their new records and I’d be surprised if anyone pushes for something TDT related this year. This is not to say there won’t be TDT again. I’m confident there will, as we all want to do it again. It just has to fit into everyone’s busy schedules. On top of that all, I’m also gearing up for something.\n\n-Which now brings me to my next, and perhaps most exciting bit of news. Josh Newton, who played with The Damned Things with myself as well as various other rad bands (Every Time I Die, Shiner, Season To Risk to name a few), and I have started a new band called With Knives. With Knives began as a project Josh was working on on his own. When he joined TDT, he asked me to work on it with him, and so I did. It sounded a bit too realized to not turn it into an actual band. That’s what we’re doing with it.\n\nNext month we will set out to Kansas City to record an EP. Then we will play shows and tour on this EP. We plan on putting it out ourselves using our Son Of Man thing as a record label. The plan is to release it as a 10” and download only, considering more people own and use a computer these days than a CD player. SOM will still be making and selling our weird shirts as well.\n\n-And lastly, as I mentioned we plan on using Son Of Man as not just a way to unload some strange t-shirt designs, but also as a way to release music. There are a few other releases in the works that we plan on releasing via SOM, aside from the With Knives EP/10”. In general, the plan with SOM the whole time has been to turn it into a sort of artist collective. Hopefully we will be able to work with other artists and musicians to collaborate and release their stuff in a safe, DIY environment that doesn’t push them to do anything they don’t want to do.\n\nJosh and I are really excited about the new band and continuing to work on Son Of Man. We’ve been slaves to the musical grind in our own respects and we both feel we can finally begin to work on something that feels like who we are, regardless if it’s met with open arms or not.”"}, {"url": "https://www.antimusic.com/news/10/june/02Anthrax,_Fall_Out_Boy,_Every_Time_I_Die_Supergroup_The_Damned_Things_Make_Live_Debut.shtml", "page_content": "Not from New York? You can now check the band online and also see them in Europe this summer. The band launched their MySpace page last Friday and the page picked up more than 25,000 plays over the holiday weekend for the rough mixes of \"We've Got A Situation Here\" and \"Ironiclast,\" two tracks from their upcoming debut album on the Island Records, which was produced by Trohman and Caggianoi, and recorded mostly in Brooklyn, where Anthrax lives, with side trips to Buffalo, NY (Buckley's home), and Chicago (Trohman, Hurley) � will be announced in the weeks ahead.\n\nThe Damned Things will be at Rock Am Ring in Nurburgring, Germany, on June 4th, kicking off a round of European shows. They will be stopping for shows in Denmark (Rock Im Park, June 5th); Brussels (Vk, June 6th); Amsterdam (a free show at Melkweg, June 8th); London (Heaven, June 10th); and Copenhagen (Copenhell, June 12th); before wrapping it up at the Download Festival in Donnington (UK), June 13th.\n\n\"Whoa, black betty (bam-A-lam),\" sang Ram Jam on their 1977 hit single version of the Lead Belly tune. \"Whoa, black betty (bam-A-lam)/ Black betty had a child (bam-A-lam)/ The damn thing gone wild (bam-A-lam)�\" The Damned Things took their name from the song as a means to convey their gutsy intentions, which goes back to Trohman's original hook-up with Scott Ian three years ago. \"We were both interested in putting together a heavy/classic-rock, blues-oriented, riff-based band,\" Trohman says, \"while trying to stay away from what makes that sound generic and overplayed.\"\n\nTrohman and Hurley share roots in pre-Fall Out Boy heavy metal bands; Caggiano soon joined his bandmate Scott in the new venture. The Damned Things were whole when Buckley accepted their invitation to front the group. One listen to \"We've Got A Situation Here\" answers all the questions. \"Musically, it's a good representation of the band,\" says Trohman. \"It has the sludgy riffs, but there's a catchy chorus, a tempo change breakdown, and some leads/solos. There's a real bluesy feel to the verses. [It's] everything the group stands for.\"\n\nMyspace link"}, {"url": "https://wallofsoundau.com/2019/04/22/the-damned-things-high-crimes-album-review/", "page_content": "The Damned Things – High Crimes\n\nReleased: April 26th, 2019\n\nLineup\n\nKeith Buckley // Vocals\n\nScott Ian // Rhythm Guitar\n\nDan Andriano // Bass\n\nJoe Trohman // Lead Guitar\n\nAndy Hurley // Drums\n\nOnline\n\nFacebook\n\nInstagram\n\nWebsite\n\nNever in a million years did I think The Damned Things would get back together again to release a full-length record, which follows up on 2010’s incredible gift upon the world, Ironiclast, an album which I came across during my early infatuation with frontman Keith Buckley and his main band Every Time I Die. It had everything you could want in a side project: sexy clean vocals, groove-inducing riffs, screams, Southern-styled metal… oh and fuckin’ Scott Ian from Anthrax + Joe Trohman and Andy Hurley from Fall Out Boy. The supergroup also featured Volbeat‘s Rob Caggiano and ex-ETID bassist Josh Newton, both of whom have since departed, however in their place comes Alkaline Trio‘s Dan Andriano, so my initial thoughts going into this album are “can they back it up?” and “will the new lineup change the dynamic of the original?” Well, the only way to find out is to jump straight into it…\n\nIt all kicks off with debut single ‘Cells‘ which, upon release, blew me away with how similar it was to the first album. So much so, it could have been a B Side left over from the debut release. Everything you could want from the band is here: groovy riffs, a sing-a-long inducing chorus, heavy undertones, solos and Keith Buckley‘s oozing charisma throughout (especially during a stop down where he’s panting for a break before realising the song is still going). I guarantee you, upon listening to this one for the second or third time you’ll be screaming along to the lyrics “we are stars colliding/we are cells divided/we’ve got all the time in the world/ but never the timing”. The track ends with a brilliant Joe Trohman guitar solo which will make you wonder what the fuck he’s doing with his time in Fall Out Boy when he could be riffing up around the world with these guys.\n\nFollowing on from this us the quirky sounding ‘Something Good‘ which kicks off with clapping and the (cheerleader-esque) chanting lyrics of “Y-E-LL/all of my friends are going to hell” but don’t let that throw you off, once it gets going, the faster-paced rock vibes kick back in and you’ve got yourself a great track, complete with MORE COWBELL than ever imaginable. This’ll be the band’s clap and sing-a-long song at future live shows. It sounds huge like if you blended stadium rock with southern metal, it’d fucking go off in a large outdoor music festival setting (looking at you Good Things Festival). ‘Invincible‘ begins with an almost acapella intro from Buckley’s raspy vocals singing “cut me up I’m on display like a broken mirror you can’t look away”, which quickly turns into an all-in assault from the rest of the band. Its a bit slower compared to the last two songs, but the emphasis is on the guitars with this one, highlighting the sheer talent behind Scott Ian and Joe Trohman. It’s fun, riffy and melodic AF. With an epic sounding opener, ‘Omen’ teases you into thinking you’re about to cop a straight up metal song, before changing direction into a bluesy, southern rock belter you’ll probably wanna listen to in your pick up truck with your trusty pooch beside you. The tempo, screams and ferocity are picked right the fuck up for ‘Carry A Brick‘, as usual Keith shines now only with his beautiful melodic vocals but also his pleasing screams that fit the song perfectly. Andy Hurley on the drums deserves a standing ovation for his stop and start beats throughout. There’s also yet another guitar solo with makes me feel like the guys were just jamming away in the studio, ripped that out of nowhere and said, yeah that fits, leave it in. The change in direction and stop and change did sound a little messy in parts, but not enough to derail the listening experience too much.\n\n‘Storm Charmer‘ is just a big, fucking, sexy chugga-filled slow jam. The type of song that’s playing when a protagonist in a western movie enters a bar to look around for the villain or a potential side-kick. There’s a touch of synth and (once again) a big focus on guitars, especially Dan Andriano‘s bass lines. This track also chops and changes tempo and momentum, but is much easier to listen to than the last. ‘Young Hearts‘ reminds me of a less heavy ETID song in parts (akin to that of ‘Decayin’ With The Boys‘) so that’s an added bonus before this one even gets a minute into it. In place of a breakdown, there’s a ho-down complete with a piano in the background which I just fucking love and the entire piece is what I’d kinda/sorta class as a fast-paced ballad. You can sing along to it, you can nod or bang your head and throw your devil horns in the air, but it’s not fast enough for a circle pit if you get me. It’s a good one, give it a couple of spins and my words will make more sense. ‘Keep Crawling‘ is a heavy, (almost) grunge-infused belter that’ll make you want to sway your hips from side to side in your tight jeans and RM Williams boots combo. There are a few air guitar worthy sections you can get involved with too and a build up to a slow breakdown I can see getting fans rowdy in the pit over towards the song’s finale. At first, I thought I wouldn’t enjoy it, but found myself going back again for more and more streams.\n\n‘Let Me Be (Your Girl)‘ speeds things the fuck up again and (much like first single ‘Cells‘) could have been a leftover from the previous album’s recording session. Do you love slick guitar riffs, thumping drum beats and the background sounds of a tambourine? Well, you’ll be in your goddamn prime with this one. A seductively addictive love song for the mature metal fan who prefers the taste of whiskey, as opposed to beer. Arguably one of the best songs on the album (so far) too. However, all good things must come to an end and luckily for us, The Damned Things have saved a banger of a song for the climax which is fast, furious and full of dirty, stinkin’ rock and roll. The slower sections compliment Keith Buckley‘s melodic vocals, whereas the faster parts really highlight just how distinctively good his screams/yells are. Once again, there are elements of Every Time I Die in this one (definitely ‘We’rewolf‘ according to my ears) but with that unique twang TDT have now grown to produce. There are plenty of guitar solos for even the harshest critic to froth over and a tantalising final few seconds which will get you hot and bothered like a cowboy at a rodeo. A FANTASTIC way to wrap up this latest offering from one of the most illusive fucking bands in the world.\n\nHigh Crimes is an exceptional follow up album that just oozes Sexy Southern Rock/Metal throughout. Each member showcases their musical abilities perfectly with a touch of class that makes you wish you were in the band too. The Damned Things are back and they better not be fucking off again anytime soon because once you cop a taste of this, you’ll be begging for more.\n\nThe Damned Things – High Crimes tracklisting\n\n1. Cells\n\n2. Something Good\n\n3. Invincible\n\n4. Omen\n\n5. Carry A Brick\n\n6. Storm Catcher\n\n7. Young Hearts\n\n8. Keep Crawling\n\n9. Let Me Be (Your Girl)\n\n10. The Fire Is Cold\n\nRating: 9.5/10\n\nHigh Crimes is out April 26th via Nuclear Blast Records. Pre-Order here\n\nReview by Browny @brownypaul\n\nHelp spread the word!\n\nTweet\n\n\n\nMore\n\nWhatsApp\n\nPrint\n\n"}, {"url": "https://www.billboard.com/music/rock/the-damned-things-new-album-interview-8506968/#!", "page_content": "If there was a Venn diagram of fans who follow pop-rock band Fall Out Boy, thrash titans Anthrax and Buffalo hardcore stalwarts Every Time I Die, the circles likely wouldn’t overlap much. However, members of all three bands formed in 2010 to release the album Ironicast as The Damned Things. After an unexpected hiatus, the group has re-formed years later to drop sophomore album High Crimes (April 26, Nuclear Blast). It’s somewhat of a surprise — even to singer Keith Buckley.\n\n“After the last record and the touring cycle was done, we were in a very uncertain place as far as the future went,” he recalls.\n\nSince Ironicast’s release, The Damned Things have been occupied with their primary bands. Fall Out Boy returned from a long break and put out three albums, while Anthrax’s 2010 reunion with singer Joey Belladonna resulted in a career renaissance. Every Time I Die’s profile has also increased, despite numerous lineup changes to its rhythm section. Between those priorities and some members’ dissatisfaction with certain aspects of Ironicast’s album cycle, The Damned Things slipped to the back burner.\n\nFall Out Boy guitarist Joe Trohman was the impetus for the reunion. While he and producer Jay Ruston (Steel Panther, Stone Sour) were writing songs for another artist, Ruston felt the material would fit The Damned Things, says Buckley. “Joe is just a prolific writer, and it dawned on him that it might make sense to put together a new Damned Things single or record or EP. So he sent me the stuff, and we started going back and forth with lyrics and vocals, and the ball started rolling.”\n\nBut before the group reformed, its members — which also had included Anthrax guitarist Scott Ian, Volbeat guitarist Rob Caggiano (who was in Anthrax at the time), Fall Out Boy drummer Andy Hurley and former Every Time I Die bassist Josh Newton — discussed how they wanted to move forward. “I knew that I was going to have to get a lot of things straight from the jump of, ‘This is what happened last time that I didn’t agree with,’ ” says Buckley. “And everything I said, Joe agreed with. When we brought everyone together and broached the subject of doing it again, Josh bowed out, and Rob was MIA. We started working anyway, and a lot of the problems and things we disagreed with the last time weren’t there.” (Alkaline Trio singer-bassist Dan Andriano has since joined the band.)\n\nOne thing that Buckley was previously disappointed with was that the group didn’t tour behind Ironicast as much as he would have liked. “There were so many expectations behind it when it started, and it was just one touring cycle,” he says. “Had I known that, I wouldn’t have gotten my hopes up. I never was in a position where I was like, ‘I’m never going to do that again.’ It was just a nebulous thing where somebody had to make a decision and nobody wanted to talk about it, so we just went on with our lives and hoped it would circle back one day.”\n\nBuckley also observes that Ironicast “was so polished and laminated and precise that it lost a lot of the emotion.” Describing the recording process as “arduous,” he explains, “With me doing take after take after take, I lost any connection and emotional tie to the songs. The performance became so routine that I almost didn’t even like it.” He felt like he was “over the songs before we even got to the stage … Then you get to the stage and they take on a new life, and you learn that and you’re like, ‘Fuck, I wish I had done this before I’d recorded because I feel that part differently now.’ ”\n\nWorking with Ruston helped loosen up the process. “It almost didn’t feel like there was an adult in the room, and I mean that in a good way,” says Buckley of the producer. “He was just so open and encouraging about everything and trying what we wanted to do. There were times where we’d get so carried away doing different stuff and having fun. The energy that he brought to the room was very positive and playful, which is a completely different experience from the last [time], and I think that was good, because it brought our moods up. And when your mood is up, and you end up writing and recording a song like ‘Cells,’ it just feels fun.”\n\n“Fun” is a great summation of High Crimes. Featuring elements of Fall Out Boy’s hooky pop, Anthrax’s chugging guitars and Buckley’s melodic yet impassioned vocals, the result is a high-energy hard rock collection. Cheerleader chants and cowbell are abundant on “Something Good,” and subtle keyboard flourishes decorate “Omen.” The intentionally exaggerated breathing and impassioned “Oh fuck” that Buckley lets out before coming in with a verse on “Cells” captures the frenetic joy of the band’s live show — and performing live is something that The Damned Things will indulge in more this time around.\n\n“We all understand that we’ve got other stuff going on,” says Buckley. “Since the last time, [members have] gotten married and had kids and there’s other aspects to our lives where we can’t do it all the time, but this record needs a shot … The last album, people were asking [that we tour more], and we were saying, ‘No,’ and that was really stupid of us. I feel like it didn’t get the chance that it deserved. So as long as there’s people that are interested in it, we’re going to keep doing it.”\n\nBuckley sees The Damned Things 2.0 lasting longer this time. “The legs are so much stronger beneath it,” he says. “We have so much more experience with each other; we have so much more experience writing songs even as individuals with our other bands. It feels like it’s our time, and we’ve finally hit our stride.” Touring Europe is a goal, as well as Southeast Asia. But Buckley has an even simpler ambition: “I want to see a Damned Things song in a movie. I want to be watching a shitty action movie in a theater, and I want there to be a Damned Things song in it — that’s my specific, ultimate goal for the band.”\n\nThe Damned Things tour dates:\n\nMay 1 Los Angeles@The Whiskey?\n\nMay 4 Jacksonville, Fla.@Welcome to Rockville?\n\nMay 6 Lancaster, Pa.@The Chameleon\n\nMay 7 Brooklyn@Brooklyn Bazaar?\n\nMay 8 Pittsburgh, Pa.@The Rex?\n\nMay 10 Nashville@The Cowan?\n\nMay 11 Rockingham, N.C.@Epicenter Fest?\n\nMay 12 Lexington, Ky.@Manchester Music Hall?\n\nMay 14 Grand Rapids, Mich.@Elevation@The Intersection?\n\nMay 16 Flint, Mich.@Machine Shop\n\nMay 17 Chicago@The Bottom Lounge?\n\nMay 18 Springfield, Mo.@Outland Ballroom?\n\nMay 19 Dallas@Gas Monkey\n\nMay 21 Denver@Oriental Theater?\n\nMay 22 Colorado Springs, Colo.@Black Sheep?\n\nMay 24 Tempe, Ariz.@Tempe Marketplace (KUPD Concert Series)\n\nMay 25 San Diego@Brick by Brick"}, {"url": "https://metalinsider.net/tag/andy-hurley", "page_content": "ICYMI: Rage Against the Machine to be inducted into RNRHOF; Iron Maiden & Soundgarden snubbed once again In case you missed it, in a recent announcement last Wednesday, May 3, the Rock & Roll Hall of Fame revealed its 2023 inductees, including Rage Against the Machine, Kate Bush, Missy Elliott, Sheryl Crow, Willie Nelson, George Michael, and the Spinners. Despite the inclusion of Rage Against the Machine, heavier bands like Iron […] Tweet\n\nNecrofier share “Forbidden Light of the Black Moon” video Texan black metal project Necrofier have shared a video for their new song, “Forbidden Light of the Black Moon.” The track is taken from their upcoming album, Burning Shadows in the Southern Night, which is set to arrive on June 2, 2023, via Season of Mist Underground Activists. Watch the clip below and […] Tweet\n\nBlackbraid share “Moss Covered Bones on the Altar of the Moon” video Blackbraid, the Native American black metal project, has unveiled a video for their latest single, “Moss Covered Bones on the Altar of the Moon.” The track is taken from their upcoming album, Blackbraid II, which is scheduled to arrive on July 7, 2023. Watch the clip below: Tweet\n\nThe Shredderz share self-titled song featuring Testament’s Alex Skolnick The Shredderverse, a new musical project featuring five musicians known as The Shredderz and their manager Lydia, has been unleashed upon the world. After a chance encounter with The Devil Himself, the band made a deal for multi-dimensional superstardom backed by the power of darkness. However, their rocky journey was filled with misadventures, including […] Tweet"}, {"url": "https://www.celebsagewiki.com/andy-hurley", "page_content": "Age, Biography and Wiki\n\nAndy Hurley was born on 31 May, 1980 in Menomonee Falls, Wisconsin, United States, is an American musician. Discover Andy Hurley's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 43 years old?\n\nPopular As N/A Occupation N/A Age 43 years old Zodiac Sign Gemini Born 31 May 1980 Birthday 31 May Birthplace Menomonee Falls, Wisconsin, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 31 May. He is a member of famous Musician with the age 43 years old group.\n\nAndy Hurley Height, Weight & Measurements\n\nAt 43 years old, Andy Hurley height is 1.65 m .\n\nPhysical Status Height 1.65 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nAndy Hurley Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Andy Hurley worth at the age of 43 years old? Andy Hurley’s income source is mostly from being a successful Musician. He is from United States. We have estimated Andy Hurley's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nAndy Hurley Social Network\n\nTimeline"}, {"url": "https://www.altpress.com/supergroup_the_damned_things_fall_out_boy_every_time_i_die_anthrax_have_rec/", "page_content": "Supergroup the Damned Things—comprised of Andy Hurley and Joe Trohman of Fall Out Boy, Keith Buckley of Every Time I Die, Scott Ian of Anthrax, Rob Caggiano of Volbeat and formerly Anthrax and ex-Every Time I Die's Josh Newton—seem to have risen from the dead.\n\nAccording to Hurley, the band recorded a new EP (via the PRP). Check out what he had to say about it below.\n\nRead more: Every Time I Die’s Keith Buckley talks possibility of resurrecting Fall Out Boy, Anthrax supergroup\n\nHurley says, “I recorded five songs for an EP with The Damned Things—I don’t think we’ll be playing, Anthrax is still touring on their last record. ETID just put out their new record, uh, who else? Josh Newton I think has been playing lately. He tech’d for Joe for awhile, I’m not sure if he’ll be back when we’re back. So you know, that’s all over the place.”\n\nDating back to 2008, when Trohman and Ian started writing music together, the supergroup played their first show in 2010. The band's debut album, Ironiclast, was released almost exactly six years ago—Dec. 14, 2010. Afterwards, the band played some shows in 2011.\n\nSince 2012, however, the band has been mostly quiet—until now. Trohman and Hurley have, of course, been active with Fall Out Boy while Every Time I Die released their eighth studio album, Low Teens, in September. Anthrax released their eleventh studio album, For All Kings, in February.\n\nHurley talked about this EP on the 100 Words Or Less podcast. Listen to it here (Hurley talks about the Damned Things at 1:13:25).\n\nWatch more: APMAs 2014—Fall Out Boy close the APMAs with \"The Phoenix\""}, {"url": "https://www.altpress.com/the-damned-things-new-lineup/", "page_content": "The Damned Things have revealed a new lineup via Facebook after teasing possible new music last year.\n\nThe rock supergroup is comprised of Every Time I Die‘s Keith Buckley, Joe Trohman and Andy Hurley of Fall Out Boy, Anthrax guitar god Scott Ian.\n\nRob Caggiano and Josh Newton of Volbeat were formerly a part of the band, but are no longer members. Now, Alkaline Trio bassist Dan Andriano has joined the group.\n\nThe lineup change has been revealed on Facebook with the group sharing two new promo photos. You can check those out below.\n\nHopefully this teaser means that new music is actually on the way.\n\nLast August, Ian teased about the possibility of a new record from the band.\n\n“We always knew with the Damned Things, it was always going to be something that we would get to do schedules permitting because we are all in extremely busy bands. But look, we’re all friends and we’re all in contact with each other on a regular basis and I can say that there is, possibly, a record, but that’s all I’m going to say about it [laughs].”\n\nThis statement was enough to get our hopes up that 2019 is finally the year it will happen.\n\nThe band dates back to 2008, when Trohman and Ian started writing music together, but it wasn’t until 2010 that the band released their debut, and only, album Ironiclast.\n\nSince the release of the heavy metal supergroup’s first release, fans have been waiting for any new releases.\n\nThe Damned Things do have two festival appearances scheduled, which you can check out below.\n\n05/04 — Jacksonville, FL @ Welcome To Rockville\n\n05/11 — Richmond County, NC @ Epicenter Festival\n\nDo you hope that new music from The Damned Things is on the way? Sound off in the comments!\n\nSee more: 30 albums turning 10 in 2019\n\n[envira-gallery id=\"197607\"]"}]}