{"Andy Hurley was born in Menomonee Falls, Wisconsin.": [{"url": "https://genius.com/artists/Andy-hurley", "page_content": "About Andy Hurley\n\nAndrew John Hurley, (born on May 31, 1980 in Menomonee Falls, Wisconsin) is the drummer of the pop punk / emo punk / alternative rock band Fall Out Boy.\n\nHe was brought up by his mother, who worked as a nurse. His father passed away when he was five. Andy attended Menomonee Falls High School and played percussion in bands, though his first instrument was the saxophone. After that he attended the University of Wisconsin–Milwaukee, double-majoring in anthropology and history.\n\nHe didn’t join in Fall Out Boy until 2003 and before he did, he played in several hardcore punk bands, like Arma Angelus. During Fall Out Boy’s hiatus (2009-2012) he and Joe Trohman (lead guitarist of Fall Out Boy) formed the supergroup The Damned Things playing mainly heavy metal music.\n\nAndy was inspired and influenced by his favorite metal bands (Metallica, New Kids on the Block and Slayer).\n\nHe has been vegan and straight-edge since he was 16, and he is currently a CrossFit athlete. He was also listed on PETA’s Sexiest Vegan poll in 2006.\n\nHe has been a comic books / movies lover since forever (Star Wars / Marvel ecc.) as much as a tattoo lover (he has over 2,600 tattoos all over his body). He is working on his own comic book called “Post Collapse”. He got his first tattoo on his chest as a christmas present for his mother.\n\nAndy will cover his mouth and nose or leave the room if people around him smoke, he heartily opposes harmful / unhealthy lifestyles. He identifies himself as an anarcho-primitivist (he believes that people should live the way they lived prior to 10,000 years ago).\n\nHis house has been featured on MTV Cribs.\n\nCurrently single."}, {"url": "https://www.thefamouspeople.com/profiles/andy-hurley-33226.php", "page_content": "He studied anthropology and history in college as making a serious career in music wasn’t on his mind at that time. Ever since he was a kid, he followed the belief that humans are supposed to live the way they used to live thousands of years ago, in their primitive state, but as he grew up, most of his beliefs faded.\n\nAndy Hurley was born Andrew John Hurley in Wisconsin on 31st May 1980 and lost his father when he was just 5. His mother took care of him for the rest of his childhood and teenage. Andy had saxophone as his very first musical instrument that he learned playing well and along with that, he also played percussion in his school’s marching band.\n\nRecommended Lists:\n\nCareer\n\nAndy’s introduction to professional music happened back when he was in the high school and was slowly gaining interest in playing drums. The year was 1996 and Andy was searching for opportunities to play with some big bands and in the pursuit of his dreams, he became part of several hardcore punk and heavy metal bands such as Killtheslavemaster, Racetraitor, Project Rocket and The Kill Pill. He was unable to find his true calling and kept trying different bands during this time.\n\nThe hardcore metal was getting popular in the late 90s and Andy’s drumming skills got him gigs here and there but nothing concrete was coming across his way. However, things changed for the best in the year 2003, when one of his best high school friends Pete Wentz invited Andy to be a part of their band which was called the Fall Out Boy as they were in dire need of an additional drummer due to some troubles with their previous one, and it didn’t take Andy much time to become a regular with Fall Out Boy.\n\nHis association with the band was extremely successful and despite the fact that this was the fourth band Andy was in, he got the fame in such a short time which he wasn’t able to achieve through his previous stints in more than 5 years. Andy recorded the album ‘Take This To Your Grave’ with the band Fall Out Boy in 2003 to a mega universal success which helped Andy to become one of the hottest drummers around.\n\nIt was the first album by the band which was considered to be an actual hit and the band was reported by the media outlets to be the next big thing. The success continued with their next album titled ‘From Under the Cork Tree’, which climbed at the 9th spot in the Billboard 200 chart and the band spent the year 2005 touring around with their new found success. The album later went on to earn a Grammy nomination for the best New Artist.\n\nThe next two studio albums by the band titled ‘Infinity on High’ and ‘Folie a Deux’ also went on to achieve mega success in their concerts and digital downloads. However, Wentz faced severe emotional trouble during that time which also included a failed suicide attempt. It was being said that he is unable to handle the new found success the band was having and that, among several other things, led the band to take a break for some time in 2009.\n\nAndy got himself busy with several other projects and played for different bands such as a heavy metal band The Damned Things. The band was mostly a collaborative effort and featured members from Fall Out Boy, Anthrax and Every Time I Die and released their very first album titled ‘Ironiclast’. Enabler, another hard core band, hired Andy and in summer 2012, Enabler released their first album with Andy as a drummer titled ‘All Hail the Void’.\n\nLater in 2012, Andy joined a straight edge hard rock band named FocusedXminds, and during that time, media speculations were ripe about Fall Out Boy making a comeback and it was said that Andy will leave FocusedXminds when that happens. Fall Out Boy made a reappearance onto the musical sky in 2013, but Andy continued his association with FocusedXminds."}, {"url": "https://www.liquisearch.com/andy_hurley/early_life", "page_content": "Early Life\n\nHurley was born in Menomonee Falls, Wisconsin. He was brought up by his mother, who worked as a nurse; his father died when he was five. Hurley attended Menomonee Falls High School and played percussion in bands, though his first instrument was the saxophone. After high school, he attended University of Wisconsin–Milwaukee, double-majoring in anthropology and history. He identifies himself as an anarcho-primitivist, explaining that this means he believes that humans are supposed to live the way they lived prior to 10,000 years ago. When asked about this in the February 2007 issue of Alternative Press, he said that his career contradicted his beliefs, but at the same time, he had to make a living. Hurley is also vegan and straight edge.\n\nHurley's house in Milwaukee, Wisconsin was featured in an episode of MTV Cribs. He loves comic books and still owns his first drum set from C&C Custom Drums along with his own custom drumsticks from Vic Firth."}, {"url": "https://www.famousdetails.com/andy-hurley/", "page_content": "Andy Hurley (Drummer) was born on the 31st of May, 1980. He was born in 1980s, in Millennials Generation. His birth sign is Gemini and his life path number is 9. Andy’s birth flower is Lily of the valley and birthstone is Emerald. What does this all mean? Let’s find out!\n\nDiscover all the facts that no one tells you about Andy Hurley below ↓\n\nNAME: Andy Hurley REAL NAME: Andrew John Hurley NICKNAME: Andy, Vegan Jesus PROFESSION: Drummer GENDER: Male BIRTHPLACE: Menomonee Falls, Wisconsin, USA ETHNICITY: White NATIONALITY: American RELIGION: Atheist SEXUALITY: Straight\n\n1. Bio\n\nAndy Hurley, best known for being a Drummer, was born in Menomonee Falls, Wisconsin, USA on Saturday, May 31, 1980. Drummer became famous as a member of the rock band Fall Out Boy and has also performed with metal bands like The Damned Things.\n\nFamily: His father passed away when he was five; his mother supported their family by working as a nurse. He grew up with nine half siblings. Andy Hurley father’s name is under review and mother unknown at this time. We will continue to update details on Andy Hurley’s family.\n\nFATHER: MOTHER: unknown at this time BROTHER(S): Not available SISTER(S): Not available\n\nEducation: Andrew John Hurley attended Menomonee Falls High School and University Of Wisconsin.\n\nDating: According to CelebsCouples, Andy Hurley is single .\n\nNet Worth: Online estimates of Andy Hurley’s net worth vary. It’s easy to predict his income, but it’s much harder to know how much he has spent over the years. CelebsMoney and NetWorthStatus does a good job of breaking most of it down.\n\n2. Andy Hurley’s zodiac sign is Gemini\n\nAndy Hurley zodiac sign is a Gemini. Dates of Gemini are May 21 - June 20. Those born under the Gemini zodiac sign enjoy socializing and love surrounding themselves with people. They enjoy chit-chat and tend to have expression and communication very high on their list of priorities. They are intelligent, adaptable, agile, communicative, informative, and connected. Although, they can be too talkative, exaggerating, deceptive, cunning, superficial, and inconsistent.\n\nZODIAC: Gemini BORN IN THE YEAR OF THE: Monkey RULING PLANET: Mercury\n\n3. He is currently 43 years old\n\nThe American drummer has been alive for 15,712 days or 377,088 hours. There were precisely 533 full moons after his birth to this day.\n\nBORN: May 31, 1980 AGE: 43 years old BORN ON: Saturday GENERATION: Millennials Generation DECADE: 1980s\n\nAndy Hurley was born on a Saturday. Saturday's children come courtesy of Saturn, the god of wealth, freedom, and agriculture. People born on Saturdays are modest, studious, wise, practical, and strict. Fun!\n\nCountdown to Andy Hurley’s next birthday.\n\nAndy Hurley will be turning 44.\n\n4. On Andy Hurley’s birthday\n\nThe world’s population was 4,458,411,534 and there were an estimated year babies born throughout the world in 1980, Jimmy Carter (Democratic) was the president of the United States, and the number one song on Billboard 100 was \"Funkytown\" by Lipps, Inc..\n\nOn this day in history:\n\n5. Andy Hurley’s height and weight\n\nWe’re currently in process of confirming all details such as Andy Hurley’s height, weight, and other stats. If there is any information missing, we will be updating this page soon. If you any have tips or corrections, please send them our way.\n\nHeight\n\nHEIGHT (FEET): N/A HEIGHT (METERS): N/A HEIGHT (INCHES) N/A HEIGHT (CM): N/A\n\nWeight\n\nBUILD Average WEIGHT (LBS): Under review WEIGHT (KG) Under review\n\nMisc\n\nEYE COLOR: Dark Brown HAIR COLOR: Dark Brown\n\n6. The Year of the Monkey\n\nAndy Hurley was born in the Year of the Monkey. People with Chinese zodiac Monkey according to Chinese zodiac have are smart, clever and intelligent, especially in their career and wealth. They are lively, flexible, quick-witted and versatile. Their strengths are being enthusiastic, self-assured, sociable, and innovative. But they can also be jealous, suspicious, cunning, selfish, and arrogant. Their lucky numbers are 1, 7, 8 and lucky colors are white, gold, blue.\n\n\n\n\n\n7. Andy Hurley’s life path number is 9\n\n8. Millennials Generation\n\nAndy Hurley was born in the middle of Millennials Generation.\n\n9. Andy Hurley’s birthstone is Emerald\n\n10. Andy Hurley’s birth flower is Lily of the valley\n\nIf you found this page interesting or useful, please share it. We will continue to update this page, so bookmark it and come back often to see new updates."}, {"url": "https://www.celebsagewiki.com/andy-hurley", "page_content": "Age, Biography and Wiki\n\nAndy Hurley was born on 31 May, 1980 in Menomonee Falls, Wisconsin, United States, is an American musician. Discover Andy Hurley's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 43 years old?\n\nPopular As N/A Occupation N/A Age 43 years old Zodiac Sign Gemini Born 31 May 1980 Birthday 31 May Birthplace Menomonee Falls, Wisconsin, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 31 May. He is a member of famous Musician with the age 43 years old group.\n\nAndy Hurley Height, Weight & Measurements\n\nAt 43 years old, Andy Hurley height is 1.65 m .\n\nPhysical Status Height 1.65 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nAndy Hurley Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Andy Hurley worth at the age of 43 years old? Andy Hurley’s income source is mostly from being a successful Musician. He is from United States. We have estimated Andy Hurley's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nAndy Hurley Social Network\n\nTimeline"}, {"url": "https://www.entertainmentwise.com/bio/andy-hurley/", "page_content": "Andy Hurley\n\nBirthday May 31, 1980 Nationality American Name in Passport Andrew John Hurley Ethnicity American (Read: 16 Surprising Celebrity Ethnicities) Ethnic category/Race(?) White Sexuality - Gay or Nay Straight\n\n[mappress width=\"100%\" height=\"300\"]\n\nRead: 19 Celebrity childhood Homes\n\nChildhood Photos - When he was young\n\nFootage of early or first TV Interview or Appearance\n\nMost popular video on Youtube\n\nGet to know the 43-year old musician Andy Hurley, before he got famous (e.g.). IMDB reportswas Andy Hurley's first TV appearance in 2003.His home town is Menomonee Falls, Wisconsin. He is of American ethnicity. Andy Hurley was born on May 31, 1980 on a Saturday.Menomonee Falls High SchoolUniversity Of WisconsinFall Out Boy InterviewFall Out Boy: Sugar, We're Goin Down (LIVE)Views: 522,724"}, {"url": "https://taddlr.com/celebrity/andy-hurley/", "page_content": "Andy Hurley\n\n\n\nOn 31-5-1980 Andy Hurley (nickname: Andy) was born in Menomonee Falls, Wisconsin, United States. He made his 14 million dollar fortune with Fall Out Boy, The Damned Things, Arma Angelus. The is currently single, his starsign is Gemini and he is now 43 years of age.\n\nAndy Hurley Facts & Wiki\n\nBirth Date 31-5-1980 Heritage/origin Ethnicity Religion - believes in God? Residence He in Milwaukee, Wisconsin, United States.\n\nAndy Hurley Net Worth, Salary, Cars & Houses\n\nHouses\n\nCars\n\nAndy Hurley: , Dating, Family & Friends\n\nRelationship status Sexuality Partner Currently in no confirmed relationship Ex-girlfriends or ex-wives Alaina Zieman Has any kids? No\n\nThese Are The 15 Hottest Wives And Girlfriends Of Hollywood!\n\nSkin, Hair & Eye Color\n\nThis originating from Menomonee Falls, Wisconsin, United States has a body & face type.\n\nHair color Eye Color Does Andy Hurley smoke? Caught Smoking: These Are The 60 Most Shocking Celebrity Smokers\n\nHeight, Weight, Body Measurements, Tattoos & Style\n\nHeight 172 cm Weight 73 kilo Clothing style Feet size N/A Does Andy Hurley have a tattoo? YesThese 50 Celebrity Tattoos Went Horribly Wrong\n\nWhere does Andy Hurley live? And how much money does Andy Hurley earn?Who is Andy Hurley dating in 2023?Shall the Andy Hurley find love in 2023?Does Andy Hurley have official Social Media profiles?Follow this page to stay up to date about the latest gossip and rumors (plastic surgery, scandals, new photos or videos and so on) of Andy Hurley!"}, {"url": "https://www.idolbirthdays.net/andy-hurley", "page_content": "Does Andy Hurley Dead or Alive?\n\nAs per our current Database, Andy Hurley is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Andy Hurley - Age, Bio, Faces and Birthday\n\nCurrently, Andy Hurley is 43 years, 0 months and 9 days old. Andy Hurley will celebrate 44rd birthday on a Friday 31st of May 2024. Below we countdown to Andy Hurley upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Andy Hurley Occupation Drummer Age 43 years old Zodiac Sign Gemini Born May 31, 1980 (Menomonee Falls, WI) Birthday May 31 Town/City Menomonee Falls, WI Nationality WI\n\n🌙 Zodiac\n\nAndy Hurley’s zodiac sign is Gemini. According to astrologers, Gemini is expressive and quick-witted, it represents two different personalities in one and you will never be sure which one you will face. They are sociable, communicative and ready for fun, with a tendency to suddenly get serious, thoughtful and restless. They are fascinated with the world itself, extremely curious, with a constant feeling that there is not enough time to experience everything they want to see.\n\n🌙 Chinese Zodiac Signs\n\nAndy Hurley was born in the Year of the Monkey. Those born under the Chinese Zodiac sign of the Monkey thrive on having fun. They’re energetic, upbeat, and good at listening but lack self-control. They like being active and stimulated and enjoy pleasing self before pleasing others. They’re heart-breakers, not good at long-term relationships, morals are weak. Compatible with Rat or Dragon.\n\nSome Andy Hurley images\n\nAbout\n\nDrummer who became famous as a member of the rock band Fall Out Boy and has also performed with metal bands like The Damned Things.\n\nBefore Fame\n\nHe attended the University of Wisconsin-Milwaukee and was a member of many hardcore punk bands.\n\nTrivia\n\nHe is known for being part of the straight edge subculture and is a vegan, as well as a comic book connoisseur.\n\nFamily Life\n\nHis father passed away when he was five; his mother supported their family by working as a nurse. He grew up with nine half-siblings and has been vegan since he was 16. He has dated a girl named Meredith Allen.\n\nAssociated With\n\nHe and Patrick Stump are longtime collaborators as members of Fall Out Boy.\n\nAndy Hurley trend"}, {"url": "https://wikiabio.com/andy-hurley/", "page_content": "Andy Hurley is a well-known Drummer who was born on May 31, 1980 in Menomonee Falls, Wisconsin. With an exceptional talent and skillset, Andy Hurley has established a successful career over the years, earning widespread recognition and acclaim. As of now, Andy Hurley’s estimated net worth stands at around $5 million.\n\nIf you’re interested in learning more about Andy Hurley’s life and career, you can explore their biography, which includes details such as age, height, physical stats, family, dating life, and career updates. Additionally, stick around until the end to uncover some fascinating insider information and little-known trivia about Andy Hurley.\n\nReal Name Andy Hurley Date of Birth May 31, 1980 Age 42 years Place of Birth Menomonee Falls, Wisconsin Birthday May 31, 1980 Profession Drummer Zodiac Sign Gemini\n\nAndy Hurley Biography Drummer who turned well-known as a member of the rock band Fall Out Boy and has additionally carried out with steel bands like The Damned Issues.\n\nFamily Life of Andy Hurley His father handed away when he was 5; his mom supported their family by working as a nurse. He grew up with 9 half-siblings and has been vegan since he was 16. He has been in a relationship with Meredith Allen.\n\nAndy Hurley Net Worth Andy Hurley is one of the wealthiest and most popular Drummer in the industry. In accordance to several reputable sources like Forbes and Business Insider, Andy Hurley’s estimated net worth is around $5 million. Andy Hurley has established a successful career in Drummer, which has become their primary source of income. Through hard work, dedication, and exceptional talent, Andy Hurley has achieved great success and earned a reputation as one of the most skilled professionals in the industry. Their accomplishments in this field have led to significant financial gains and opened up exciting new opportunities for growth and success. While the exact salary and earnings are currently unknown, we are diligently working to obtain this information from reliable sources and will update it as soon as possible. As for Andy Hurley’s living situation, they maintain a low-key lifestyle in a private residence. Sadly, there is currently no information available regarding Andy Hurley’s car collection. Net Worth $5 million Salary Under Review Source of Income Drummer Cars Unavailable House Private House\n\nAndy Hurley Height, Weight, Measurements While Andy Hurley is widely regarded as a person with striking looks, an attractive face, and a dynamic personality, it is their liveliness and rakish demeanor that truly set them apart. Andy Hurley maintains a svelte physique with wonderful body proportions, and their stunning and intriguing eyes add to their unique charm. At this time, the exact measurements of Andy Hurley’s height, weight, shoe size, and dress size are not available. Nevertheless, we are committed to providing accurate and up-to-date information and will update this section as soon as it becomes available. Height Not Available Weight Not Available Measurements Not Available Eye Color Not Available Hair color Not Available\n\nSocial Media Presence With their exceptional talent and skill set, Andy Hurley has garnered widespread attention and admiration from fans around the world. Their immense popularity is reflected in their large following across various social media platforms, including Instagram, Twitter, and Facebook. Andy Hurley is highly active on these popular social media sites, where they engage with fans and share updates on their latest projects and ventures. Instagram Not Available Facebook Not Available Twitter Not Available Wikipedia Not Available Imdb Not Available"}, {"url": "https://biographyscoop.com/andy-hurley/", "page_content": "Andy Hurley Biography, Age, Net Worth, Family, Parents, Drummer , Career\n\nAndy Hurley Biography\n\nAndy Hurley is an American musician who performs music. He plays drums for Fall Out Boy, a rock band. Hurley was a member of several hardcore punk bands before joining Fall Out Boy. He became Fall Out Boy’s full-time drummer in 2003 and remained a member of the group until its breakup in 2009.\n\nAdvertisements\n\nHow old is Andy Hurley?- Age\n\nHe is 42 years old as of May 2022. Hurley was born Andrew John Hurley in the Wisconsin United States of America on 31st May 1980.\n\nAndy Hurley Family\n\nHurley was born in Wisconsin’s Menomonee Falls. His father passed away when he was five, so his mother, a nurse, raised him.\n\nAndy Hurley Career\n\nHurley has performed with bands like Racetraitor, Killtheslavemaster, Project Rocket, xFor Death or Gloryx, The Kill Pill, and Arma Angelus which are hardcore punk and heavy metal. He played drums as a substitute on Vegan Reich’s “Jihad” EP in 1999. Hurley joined Fall Out Boy in 2003 following the recording of Take This to Your Grave and the release of the group’s debut mini-LP Fall Out Boy’s Evening Out With Your Girlfriend (2003). Hurley first filled in on a touring position as drummer for Fall Out Boy before joining the group as a full-time drummer. Hurley and bassist Pete Wentz had been friends since Hurley was 16 years old. Hurley and Wentz are in their fourth band together, Fall Out Boy. Hurley has toured the globe and enjoyed significant commercial success with Fall Out Boy.\n\nMisery Signals, Peregrine, and Auryn have all had music released on Hurley’s record label Fuck City. Hurley served as the drummer for The Damned Things, a heavy metal group that included former members of Anthrax, Fall Out Boy, and Every Time I Die and released its debut album Ironiclast between 2009 and 2013 while Fall Out Boy was on hiatus. Additionally, he was a member of the Milwaukee hardcore group Enabler, which in 2012 released the full album All Hail The Void. Hurley joined the Milwaukee-based straight-edge hardcore band FocusedXMinds in late 2012 and started playing drums. Hurley denied the rumors that the band’s reunion with Fall Out Boy would mark the end of his involvement, writing on Twitter on March 12 that “I am in it for life.”\n\nHurley was one of the four members of Fall Out Boy who unexpectedly announced their comeback on February 4, 2013, along with an album and single. A new album by the group, Save Rock and Roll, was released on April 12 of that year. It included the lead single “My Songs Know What You Did in the Dark (Light Em Up),” as well as information about a new tour. On February 4 in Chicago, the band played their first gig in more than three years. The band’s fourth straight top 10 albums, “Save Rock and Roll,” debuted at No. 1 on the Billboard 200 and sold 154,000 copies in its first week. Hurley extensively toured in support of the album with Fall Out Boy in 2013 and 2014, selling out arenas all over the world.\n\nThey worked with producer Ryan Adams for two days to record their new EP, PAX AM Days, which they released in October 2013. The band’s third Billboard 200 No. 1 album, American Beauty/American Psycho, their sixth studio album, debuted with 192,000 first-week sales and 218,000 equivalent album units. Centuries, a triple Platinum top 10 single, was the album’s lead single. Uma Thurman debuted on mainstream radio on April 14, 2014, reached her ‘Billboard’ Top 100 peak of 22, and received a Platinum certification in August 2015. Scott Crouse, James Chang, Chris Colohan (of Cursed, Burning Love, Left for Dead, and The Swarm), and Hurley formed the vegan straight edge hardcore group SECT in 2016.\n\nThe lead single from Fall Out Boy’s seventh studio album, Young and Menace, was released in April 2017. The band’s seventh album, Mania, was formally released on January 19, 2018, and it made its Billboard 200 debut at the top of the list, marking the group’s third consecutive and fourth overall chart-topping debut. Hurley appeared as himself in the first, third, and fourth parts of “The Night Begins to Shine” in 2017’s Teen Titans Go! on Cartoon Network with his bandmates. Their rendition of the special’s theme song was commercially released. As the band’s first headline performance at a stadium, Fall Out Boy made history in 2018 by headlining Wrigley Field in Chicago.\n\nAndy Hurley’s Net Worth\n\nAndy has an estimated net worth of 14 million dollars as of 2022."}]}