{"Frank A. McLain (1890C1962) was an American lawyer and politician from the state of Florida.": [{"url": "https://www.wikiwand.com/en/Frank_A._McLain", "page_content": "Frank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nAmerican politician\n\nQuick facts: Frank Alexander McLain, Member of the Mississ... ▼\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster on October 11, 1920.[1] He was interred in the City Cemetery."}, {"url": "https://www.howold.co/person/frank-a-mclain/biography", "page_content": "Frank A. McLain Biography\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State cons*utional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster on October 11, 1920.He was interred in the City Cemetery.\n\nReferences"}, {"url": "https://wiki2.org/en/Frank_A._McLain", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster on October 11, 1920.[1] He was interred in the City Cemetery.\n\nYouTube Encyclopedic\n\n1 / 1 Views: 130 921\n\nGangland Detroit Mob documentary part 1: Detroit's Mafia's founding fathers Transcription\n\nReferences"}, {"url": "https://peoplepill.com/people/frank-a-mclain/", "page_content": "\n\n\n\nFrank Alexander McLain (January 29, 1852 – October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster, Mississippi, October 10, 1920. He was interred in the City Cemetery."}, {"url": "https://www.powershow.com/view0/82944a-ZjNkO/Frank_McLain_-_Educational_Achievements_powerpoint_ppt_presentation", "page_content": "PowerShow.com is a leading presentation sharing website. It has millions of presentations already uploaded and available with 1,000s more being uploaded by its users every day. Whatever your area of interest, here you’ll be able to find and view presentations you’ll love and possibly download. And, best of all, it is completely free and easy to use.\n\nYou might even have a presentation you’d like to share with others. If so, just upload it to PowerShow.com. We’ll convert it to an HTML5 slideshow that includes all the media types you’ve already added: audio, video, music, pictures, animations and transition effects. Then you can share it with your target audience as well as PowerShow.com’s millions of monthly visitors. And, again, it’s all free.\n\nAbout the Developers\n\nPowerShow.com is brought to you by CrystalGraphics, the award-winning developer and market-leading publisher of rich-media enhancement products for presentations. Our product offerings include millions of PowerPoint templates, diagrams, animated 3D characters and more."}, {"url": "https://www.ancientfaces.com/person/frank-mclain-birth-1902-death-1974/42948479", "page_content": "Refresh this page to see various historical events that occurred during Frank's lifetime.\n\nIn 1902, in the year that Frank Mclain was born, the modern air conditioner was invented by Willis H. Carrier. The company that he worked for needed to find a way to control humidity and by solving this problem, Carrier created a system that could be used for cooling the rooms of a house. The Sun Belt thanks him!\n\nIn 1935, he was 33 years old when on September 8th, Louisiana Senator Huey Long was shot by Dr. Carl Weiss. Weiss was shot and killed immediately by Long's bodyguards - Long died two days later from his injuries. Long had received many death threats previously, as well as threats against his family. He was a powerful and controversial figure in Louisiana politics (and probably gained power through multiple criminal acts). His opponents became frustrated with their attempts to oust him and Dr. Weiss was the son-in-law of one of those opponents. His funeral was attended by 200,000 mourners.\n\nIn 1954, Frank was 52 years old when from April 22 through June 17th, the Army v. McCarthy hearings were held. The U.S. Army accused Roy Cohn (chief counsel to Senator McCarthy and later trusted mentor of Donald Trump) of blackmail. McCarthy and Cohn accused the U.S. Army of harboring communists. The Army allegations were found to be true. The U.S. Senate later censured McCarthy.\n\nIn 1965, at the age of 63 years old, Frank was alive when the television show \"I Spy\" premiered in the fall season on NBC. The stars were Bill Cosby and Robert Culp, making Cosby the first African American to headline a television show. Four stations - in Georgia, Florida, and Alabama - refused to air the show.\n\nIn 1974, in the year of Frank Mclain's passing, on August 9th, Gerald R. Ford became the 38th President of the United States. He had been Vice President for 8 months when he became President due to the resignation of President Nixon."}, {"url": "https://www.britannica.com/biography/Arlen-Specter", "page_content": "Arlen Specter, (born February 12, 1930, Wichita, Kansas, U.S.—died October 14, 2012, Philadelphia, Pennsylvania), American lawyer and politician who was a U.S. senator from Pennsylvania (1981–2011). Originally a Democrat, he became a Republican in the 1960s before switching back to the Democratic Party in 2009.\n\nSpecter, the son of Russian Jewish immigrants, was raised in Russell, Kansas. In 1951 he received a bachelor’s degree in international relations from the University of Pennsylvania. Specter attained the rank of second lieutenant while serving (1951–53) with the U.S. Air Force Office of Special Investigations during the Korean War. He later attended Yale Law School, graduating in 1956.\n\nSpecter then joined a prominent Philadelphia law firm (1956–66) and in 1959 was appointed assistant district attorney. From 1963 to 1964 he served as assistant counsel on the Warren Commission, the body charged with investigating the assassination of U.S. Pres. John F. Kennedy. Though a registered Democrat, Specter failed to gain support from his party and was elected district attorney of Philadelphia on a Republican ballot in 1965. He soon registered as a Republican. Following his failure to win a third term in 1973, he returned to practicing law.\n\nAfter unsuccessful primary bids for Pennsylvania senator (1976) and governor (1978), Specter claimed victory in the 1980 U.S. Senate race. While he broke ranks with the Republican Party on occasion—notably voicing support for civil unions for gay couples and for abortion rights—Specter (or “Snarlin’ Arlen,” as he was known to colleagues) was sometimes fiercely partisan. His aggressive questioning of Anita Hill, who had accused Supreme Court nominee Clarence Thomas of sexual harassment, during Thomas’s 1991 confirmation hearing was widely seen as an attempt to assure the appointment of the conservative justice. During his tenure as chairman of the Intelligence Committee (1995–97), Specter wrote legislation instituting an inspector general of the Central Intelligence Agency (CIA). Specter also chaired the Veteran’s Affairs Committee (1997–2001; 2003–05). He won a fifth term in the U.S. Senate in 2004, and in 2005 he was elected chairman of the Judiciary Committee.\n\nIn April 2009 Specter returned to the Democratic Party, giving the Democrats a supermajority in the Senate. Though Specter maintained that his shift was ideologically motivated, he acknowledged that his support of U.S. Pres. Barack Obama’s stimulus package rendered him unlikely to win the 2010 primary election as a Republican. Characterized by many observers as a transparent attempt to salvage his political fortunes, the move was ultimately futile. Specter lost the Democratic primary to U.S. Rep. Joe Sestak.\n\nSpecter authored Passion for Truth: From Finding JFK’s Single Bullet to Questioning Anita Hill to Impeaching Clinton (2000; with Charles Robbins), a political autobiography, and Never Give In: Battling Cancer in the Senate (2008; with Frank J. Scaturro), about his battle with lymphoma."}, {"url": "https://www.powershow.com/view0/840a39-OGQzM/Frank_McLain_-_Graduating_Law_School_powerpoint_ppt_presentation", "page_content": "PowerShow.com is a leading presentation sharing website. It has millions of presentations already uploaded and available with 1,000s more being uploaded by its users every day. Whatever your area of interest, here you’ll be able to find and view presentations you’ll love and possibly download. And, best of all, it is completely free and easy to use.\n\nYou might even have a presentation you’d like to share with others. If so, just upload it to PowerShow.com. We’ll convert it to an HTML5 slideshow that includes all the media types you’ve already added: audio, video, music, pictures, animations and transition effects. Then you can share it with your target audience as well as PowerShow.com’s millions of monthly visitors. And, again, it’s all free.\n\nAbout the Developers\n\nPowerShow.com is brought to you by CrystalGraphics, the award-winning developer and market-leading publisher of rich-media enhancement products for presentations. Our product offerings include millions of PowerPoint templates, diagrams, animated 3D characters and more."}, {"url": "https://memim.com/frank-a.-mclain.html", "page_content": "Frank Alexander McLain (* January 29, 1852 in Gloster, Amite County, Mississippi, † October 10, 1920 ) was an American politician. Between 1898 and 1909 he represented the fifth and the seventh consecutive electoral district of the state of Mississippi in the U.S. House of Representatives.\n\nCareer\n\nFrank McLain attended after elementary school until 1874 the University of Mississippi in Oxford. After studying law and qualifying as a lawyer, he began in Liberty to work in his new profession. Politically, McLain member of the Democratic Party. Between 1881 and 1883 he was a delegate in the House of Representatives from Mississippi. From 1883 to 1896 McLain worked as district attorney and then again as a private lawyer. In 1890 he was a delegate at a meeting to revise the constitution of Mississippi.\n\nAfter the death of Congressman William F. Love McLain was elected in the by-election due in the fifth district of Mississippi as his successor in the U.S. House of Representatives in Washington. He finished until March 3, 1897 the opened first legislative period of his predecessor. In the following regular congressional elections McLain was confirmed in each case. Thus he was able to represent the fifth district in Congress until March 3, 1903. Since the elections of 1902 he ran in the seventh district. This he represented until March 3, 1909 Congress. He was since December 12, 1898 to March 3, 1909 for uninterrupted member of the House of Representatives.\n\nAfter the end of his time in Washington was Frank McLain 1910-1912 employed at the Mississippi State Supreme Court ( State Supreme Court Commissioner). He died in October 1920 in his birthplace of Gloster and was also buried there."}, {"url": "http://dictionary.sensagent.com/Frank%20A.%20McLain/en-en/", "page_content": "From Wikipedia\n\n\n\n\n\nFrank Alexander McLain (January 29, 1852 - October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster, Mississippi, October 10, 1920.He was interred in the City Cemetery."}]}