{"Frank A. McLain is remembered as a dedicated public servant.": [{"url": "https://www.wikiwand.com/en/Frank_A._McLain", "page_content": "Frank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nAmerican politician\n\nQuick facts: Frank Alexander McLain, Member of the Mississ... ▼\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster on October 11, 1920.[1] He was interred in the City Cemetery."}, {"url": "https://www.howold.co/person/frank-a-mclain/biography", "page_content": "Frank A. McLain Biography\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State cons*utional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster on October 11, 1920.He was interred in the City Cemetery.\n\nReferences"}, {"url": "http://dictionary.sensagent.com/Frank%20A.%20McLain/en-en/", "page_content": "From Wikipedia\n\n\n\n\n\nFrank Alexander McLain (January 29, 1852 - October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster, Mississippi, October 10, 1920.He was interred in the City Cemetery."}, {"url": "http://dictionary.sensagent.com/frank%20a%20mclain/en-en/", "page_content": "From Wikipedia\n\n\n\n\n\nFrank Alexander McLain (January 29, 1852 - October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster, Mississippi, October 10, 1920.He was interred in the City Cemetery."}, {"url": "https://www.readingeagle.com/2023/01/10/the-late-frank-denbowski-remembered-as-a-dedicated-public-servant/", "page_content": "Finding a more dedicated public servant than Frank Denbowski would have been difficult, City Council members and administrators agreed.\n\nDenbowski, the former interim city managing director, died Sunday in his Reading home after a lengthy illness.\n\nHe was remembered Monday night at a City Council meeting.\n\n“I don’t think you’d find a person more knowledgeable about the city of Reading,” said William Heim, current managing director and a former Reading police chief. “In Reading’s government, he was certainly the go-to person for the answer to a lot of questions.”\n\nDenbowski was thoroughly dedicated to the city, Heim said.\n\nThe 46-year-old Denbowski spent more than 20 years of his professional career working in various city departments and capacities.\n\nHe also worked several years for the state government and spent a year as legislative assistant for former state Rep. Thomas R. Caltagirone, a Democrat, who represented the 127th District.\n\nDenbowski was appointed chief of staff to Mayor Eddie Moran in 2020. He stepped in as interim city managing director in February 2022, after the resignation of Abraham Amoros.\n\nCouncilman O. Christopher Miller also called Denbowski the go-to person in City Hall.\n\nBefore being appointed to council in August, Miller said, he often called Denbowski with issues or questions about the Centre Park Historic District neighborhood.\n\n“He was familiar with the neighborhood,” Miller said of Denbowski, “and he would make sure that we were connected to the right person.”\n\nWhen area residents began planning a revitalization of the park at the heart of the historic district, Denbowski was the one they reached out to first.\n\nThey knew Denbowski would know how to steer the project in the right direction, Miller said.\n\nBecause of Denbowski’s involvement in the planning stage, the project is on target for completion later this year, Miller said.\n\n“I’m grateful and I know the rest of the neighborhood is grateful for all the help that Frank gave over the years,” Miller said.\n\nEven as illness ravaged his body and sapped his strength, Denbowski remained dedicated to the city and available as a resource for council, Councilwoman Marcia Goodman-Hinnershitz said.\n\n“His strength was in his mind and his faith and with his love of the family and his love of the city,” she said. “I’ve never seen anyone go through the pain that he’s gone through over the last several years and always be there with a smiling face.”\n\nEven when Denbowski was no longer able to attend meetings in person, he participated via a virtual meeting platform, the councilwoman said.\n\n“He made sure that he was there for us,” she said.\n\nCouncilman Christopher Daubert said he spoke with Denbowski several times a week.\n\n“It’s pretty obvious that Frank was a skilled public servant,” the councilman said. “He wore so many different hats here.”\n\nDespite the many different titles Denbowski held while employed by the city, Daubert added, husband and father were the two of which he was proudest.\n\nDenbowski is survived by his widow, Raquel Ruiz-Denbowski, and their children, Nicolette F. Denbowski, a student at Lebanon Valley College, and Francisco J. Denbowski, at home.\n\n“He wanted to be remembered as a guy who loves his community, who did his best for his community,” Daubert said, “but mostly as a guy who loved his family.”\n\nDenbowski began working for the city in 1996. He served as chief of staff to former Mayor Tom McMahon, special assistant to former Mayor Vaughn Spencer and held managerial positions in various departments.\n\nAfter being fired as recycling and solid waste coordinator in 2016, he filed a lawsuit seeking over $1.5 million in damages from the city, former Mayor Wally Scott and former Managing Director W. Glenn Steckman III.\n\nIn his suit, Denbowski alleged he was fired in part because he alerted officials to the improper use of city funds. He also alleged Scott made defamatory comments about him.\n\nCity Council in 2020 authorized the city solicitor to negotiate a settlement agreement.\n\nDenbowski returned to city employment that year when he accepted the job of chief of staff to Moran.\n\n“It really doesn’t even feel real yet even though I kind of knew it was coming,” Daubert said of Denbowski’s death. “It’s just, it’s a really big loss for so many.”"}, {"url": "http://dictionary.sensagent.com/Frank_A._McLain/en-en/", "page_content": "From Wikipedia\n\n\n\n\n\nFrank Alexander McLain (January 29, 1852 - October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster, Mississippi, October 10, 1920.He was interred in the City Cemetery."}, {"url": "https://www.wikizero.com/en/Frank_A._McLain", "page_content": "From Wikipedia the free encyclopedia\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster on October 11, 1920.[1] He was interred in the City Cemetery."}, {"url": "http://thehublegal.com/frank-remembered-as-true-public-servant/", "page_content": "\n\n\n\nEAST LIVERPOOL — Only two years after taking the bench, East Liverpool Municipal Court Judge Dominic Frank died early Saturday morning reportedly following a lengthy battle with COVID-19.\n\nHe had been a patient at the East Liverpool City Hospital.\n\nFrank had a lot of ideas for how he wanted to make the legal system even better for the residents in southern Columbiana County, but unexpectedly ended up with limited time to see all of those ideas to fruition.\n\nDuring his long career he had worked on all sides of the legal profession. After working in the local steel industry before the closure of Crucible Steel, Frank started his legal career by working in law enforcement, joining the St. Clair Township police department in 1984. Then after earning his law degree in 1992, he became a respected attorney working on all sides of the legal profession. In the 1990s he ran unsuccessfully for county prosecutor.\n\nHis next attempt at elected office was when he successfully ran for judge in 2019. Along the way, Frank made many friends with law enforcement, at the courthouses where he practiced through the years and throughout the community.\n\n“Judge Frank was a great attorney, and an even better judge, because more importantly, he was a kind and decent person,” said retired Judge Mark Frost. “He grew up in a wonderful family that instilled in him values that are sometimes considered old-fashioned: hard work, loyalty, honesty, compassion, faith, dedication, and a desire to help others.”\n\nFrank was very community oriented and believed in helping people. Retired police officer Kim Nusser, who worked with him during his years at St. Clair Township, said Frank remained a close friend long after he, Charlie Burgess and Frank all left the department for other opportunities.\n\n“He was just an all-around good guy,” Nusser said. “I think he did a lot of things for people, even for those people who could not afford an attorney.”\n\nAlthough Frank had left as a police officer before current St. Clair Police Chief Brian McKenzie came to the department, McKenzie said he still had a great friendship with Frank and did not know if there was a nicer person in the area. He said Frank’s perspective as a law enforcement officer helped him later in his career.\n\n“He always answered his phone no matter what,” McKenzie said. “He was a defense attorney for some of my cases, but he always treated me fairly… He was always there for my guys.”\n\nAttorney Charley Kidder, who also currently serves as the Democrat Chairman for Columbiana County, said his relationship for Frank goes back 30 years before Kidder was an attorney and long before the announcement on snowy courthouse steps of Frank’s decision to run for judge. Kidder remembers Frank as someone who mentored a lot of the younger attorneys. Even though Frank was “tough to beat” in court, Kidder said you always knew Frank would be fair.\n\nThey worked well together in different roles, for instance Kidder serving as a magistrate in Wellsville Municipal Court, when Frank was the village’s solicitor and Christopher Weeda was the public defender at one point. More recently, Kidder served as a public defender with Weeda as the prosecutor in front of Frank in his role as the East Liverpool Municipal Court judge, while another long-time friend of Frank, retired East Liverpool officer Don Fickes, served the court as the bailiff.\n\nJohn Gamble, former chief county prosecuting attorney and current assistant city prosecuting attorney in East Liverpool, also practiced with Frank, against him and in front of him during their long careers.\n\n“Dom was a dear friend,” Gamble said after hearing of Frank’s death. “His only love greater than East Liverpool and the Potters was his family and Hoi Wah. I will miss him. Our community lost a wonderful, dedicated public servant.”\n\n“Dom will be greatly missed. He always treated you with respect, whether you were a new attorney, opposing counsel, or litigant in his courtroom,” said Ryan Weikart, current chief assistant county prosecutor. “He loved his job, his family, and his hometown. My prayers and sympathy go out to his family.”\n\nFrank always talked with pride about his four sons, who in many ways follow the family tradition of serving the public. Frank had followed in his parent’s footsteps and was a public servant who believed in the community where he lived and the people in it. At different times during his career, he served in the villages of Salineville and Wellsville and Liverpool Township. He served as assistant county prosecutor for a time, then was involved in private practice and he managed a local branch office for Betras, Kopp & Harshman LLC.\n\n“He truly loved his hometown and always tried to do right by the people in it,” Frost said. “East Liverpool, Columbiana County and all who knew Dom have lost a truly decent man, and I personally have lost a dear friend.”\n\n“No one loved East Liverpool more than Dom,” Kidder said. “It was fitting he got to serve the community he loved.”\n\n\n\n\n\n\n\n\n\nToday’s breaking news and more in your inbox\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://www.dailyherald.com/news/20221203/he-loved-schaumburg-trustee-frank-kozak-remembered-for-dedication-sense-of-humor", "page_content": "'He loved Schaumburg': Trustee Frank Kozak remembered for dedication, sense of humor\n\nSchaumburg Village Trustee Frank Kozak and his wife Char describe what it was like to survive a tornado near Oklahoma City in 2013. Daily Herald File Photo\n\nSchaumburg Village Trustee Frank Kozak is remembered as a dedicated public servant, volunteer and family man after his death Friday. Daily Herald File Photo\n\nFrank Kozak's list of accomplishments include serving as a Schaumburg trustee, years as a dedicated volunteer for charities and athletics, and -- surviving an EF5 tornado.\n\nKozak's family and community remembered a dedicated public servant with a sense of humor after his death Friday at age 78.\n\nAs a trustee, Kozak was chairman of the public safety committee as well as other committees. He served on the Schaumburg plan commission from 1983 until 2009, when he was elected to the village board.\n\nFlags were lowered at village hall, said Mayor Tom Dailly, who recruited Kozak to take his spot as trustee in 2009. \"He was the perfect candidate,\" Dailly said.\n\nThe zoning board and plan commission are two tough spots, and Kozak was not only well-qualified, but \"he knew the village, he knew the residents and he knew the businesses,\" Dailly said.\n\nIn addition to institutional knowledge about everything from zoning rules to Septemberfest, where he volunteered, Kozak \"knew when to lighten up,\" Dailly recalled.\n\n\"I'd say, 'Frank, stop being such an old curmudgeon,'\" the mayor said, \"and he'd give me a big smile. I'm going to miss those.\"\n\nSon Steve Kozak remembers a dad \"who never missed an event of mine. He made every event, whether it was a practice or a game.\"\n\nAs he plans his father's funeral, Steve Kozak said he's thinking about \"how much he did for everybody. Not just the village but everybody -- neighbors, friends and family.\"\n\n\"He just enjoyed giving back to the community. He loved Schaumburg. It was home for him and he did whatever he could do to make a better place.\"\n\nKozak died after battling several diseases for the last few months, Steve Kozak said.\n\nBut he and his beloved wife, Char, actually had a close call on May 20, 2013, in the Oklahoma City area when an EF5 tornado hit, destroying more than 1,100 homes.\n\nThe couple were visiting Char's brother and took refuge in a closet. A hot water tank fell on the Kozaks but kept them alive as winds ripped off the roof and walls crumbled.\n\nBoth suffered injuries, but three years later in 2016, Frank Kozak told the Daily Herald, \"There are no words that I can say to try to explain what really happens during those minutes that you hang onto your wife when an EF5 tornado is bearing down on you and you have no place to go.\n\n\"To this day, my wife Char and I are thankful for the first responders who were on the scene within five minutes to help rescue us, to those who treated us immediately, for everyone's kind letters and phone calls.\"\n\nKozak, an electrician, helped lead local and state Jaycees organizations, assisted with the Schaumburg Athletic Association and Schaumburg High School's VIP program, and volunteered for Misericordia.\n\nHis term would have expired in May 2025, officials said.\n\nA wake is scheduled from 2 to 8 p.m. Tuesday at Ahlgrim & Sons Funeral and Cremation Services, 330 W. Golf Road in Schaumburg, and a funeral is set for 10:30 a.m. Wednesday at Church of the Holy Spirit, 1451 Bode Road in Schaumburg."}, {"url": "https://medium.com/@frankmclain/frank-mclain-a-local-resource-ed37f4c4d2ba", "page_content": "Frank McLain — A Local Resource Frank McLain · Follow · Jul 28, 2016 2 min read -- Listen Share\n\nFrank McLain is a man who is unambiguous when it comes to his geographical location. He was born in Amarillo, Texas, but when he was eight years old, his family relocated to Dallas. He graduated from Highland Park High School in the top 10 percent, and he subsequently left the city for a while. However, the absence was for a very good reason, and it has led him to where he is today. Frank McLain set off for the state capitol, Austin, where he obtained a bachelor’s degree in Business from the University of Texas. Then he was commissioned as an officer in the U.S. Navy and served for two years. He decided that he wanted to spend his life in the legal arena, so he continued his education in Austin. He obtained a JD (Juris Doctor) degree from the university in 1962. He went back to his hometown of Dallas, and he has been practicing law in the city ever since then.\n\nIn addition to his legal practice, he has always made time for his daughter’s piano recitals, dance recitals and school plays and as a grandfather he hasn’t missed a beat. Even with two daughters living in Austin he makes time to fly down for soccer tournaments and for Tae Kwon Do Tournaments and tests. When you combine his professional career with his personal life in Dallas, you can see that he is a truly local resource that people can draw from. When you practice in the same area for so long, you understand the courts, and you make connections throughout the legal system. This intimate knowledge coupled with an accumulation of legal expertise is a powerful combination, and this is what Frank McLain brings to the table each and every day."}]}