{"In 1923, McLain was elected to the Florida House of Representatives, representing Escambia County.": [{"url": "https://ballotpedia.org/List_of_United_States_Representatives_from_Florida", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://ballotpedia.org/Florida_House_of_Representatives", "page_content": "Email *\n\nFirst Name *\n\nLast Name\n\nPlease complete the Captcha above"}, {"url": "https://www.britannica.com/topic/House-of-Representatives-United-States-government", "page_content": "The House of Representatives originally comprised 59 members. The number rose following the ratification of the Constitution by North Carolina and Rhode Island in 1790; the first Congress (1789–91) adjourned with 65 representatives. By 1912 membership had reached 435. Two additional representatives were added temporarily after the admission of Alaska and Hawaii as states in 1959, but at the next legislative apportionment , membership returned to 435, the number authorized by a law enacted in 1941.\n\nEach state is guaranteed at least one member of the House of Representatives. The allocation of seats is based on the population within the states, and membership is reapportioned every 10 years, following the decennial census . House members are elected for two-year terms from single-member districts of approximately equal population. The constitutional requirements for eligibility for membership of the House of Representatives are a minimum age of 25 years, U.S. citizenship for at least seven years, and residency of the state from which the member is elected, though he need not reside in the constituency that he represents.\n\nThe House of Representatives shares equal responsibility for lawmaking with the U.S. Senate . As conceived by the framers of the Constitution, the House was to represent the popular will, and its members were to be directly elected by the people. In contrast, members of the Senate were appointed by the states until the ratification of the Seventeenth Amendment (1913), which mandated the direct election of senators.\n\nPowers\n\nThe Constitution vests certain exclusive powers in the House of Representatives, including the right to initiate impeachment proceedings and to originate revenue bills. The organization and character of the House of Representatives have evolved under the influence of political parties, which provide a means of controlling proceedings and mobilizing the necessary majorities. Party leaders, such as the speaker of the House and the majority and minority leaders, play a central role in the operations of the institution. However, party discipline (i.e., the tendency of all members of a political party to vote in the same way) has not always been strong, owing to the fact that members, who must face reelection every two years, often vote the interests of their districts rather than their political party when the two diverge.\n\nA further dominating element of House organization is the committee system, under which the membership is divided into specialized groups for purposes such as holding hearings, preparing bills for the consideration of the entire House, and regulating House procedure. Each committee is chaired by a member of the majority party. Almost all bills are first referred to a committee, and ordinarily the full House cannot act on a bill until the committee has “reported” it for floor action. There are approximately 20 standing (permanent) committees, organized mainly around major policy areas, each having staffs, budgets, and subcommittees. They may hold hearings on questions of public interest, propose legislation that has not been formally introduced as a bill or resolution, and conduct investigations. Among important standing committees are those on appropriations, on ways and means (which handles matters related to finance), and on rules. There are also select and special committees, which are usually appointed for a specific project and for a limited period.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nThe committees also play an important role in the control exercised by Congress over governmental agencies. Cabinet officers and other officials are frequently summoned before the committees to explain policy. The Constitution (Article I, section 6) prohibits members of Congress from holding offices in the executive branch of government—a chief distinction between parliamentary and congressional forms of government.\n\nAfter the census of 1920, Northeastern and Midwestern states held 270 House seats and the South and West held 169. Thereafter, the balance between the two regions gradually shifted: following the 2010 census, the Northeast and Midwest accounted for only 172 seats, compared with the South and West’s 263. Most notably, the number of representatives from New York declined from 45 in the 1930s to only 27 in 2012, while the number from California increased from 11 to 53."}, {"url": "https://www.dailymail.co.uk/news/article-11595929/In-1923-Speaker-House-election-took-9-rounds-1856-Congress-shut-2-months.html", "page_content": "The last speaker election to go beyond the first ballot was a century ago, when members took nine tries to vote for Frederick Gillett (R-Mass.) to the position\n\nCurrently, McCarthy doesn't have enough votes and the House can't organize until a leader has been selected\n\nAfter Biden and Harris, the Speaker is next in line to become president\n\nIt didn't go according to plan, at least for GOP leader Kevin McCarthy who became the first majority nominee for speaker in 100 years to fail to win an initial vote for the gavel after not getting 218 votes but rather losing 19 GOP hardliners. He also lost the second and third rounds of voting with no exit (or winning) strategy in sight.\n\nNeeding 218 votes in the full House, the California Republican got just 203 in two rounds — less even than Democrat Hakeem Jeffries of New York in the GOP-controlled chamber.\n\nMcCarthy had pledged a “battle on the floor” for as long as it took to overcome right-flank fellow Republicans who were refusing to give him their votes. After three failed votes, the House adjourned without a leader until Wednesday at 12 noon.\n\nHouse Minority Leader Kevin McCarthy (D-CA) walks to the House Chambers of the U.S. Capitol Building on December 23, 2022 in Washington, DC.\n\nMcCarthy continues to face diehard opposition from a small but vocal number of conservative lawmakers who calls themselves 'the Never Kevin Caucus' in a 222-213 majority could well tank his nomination,\n\nThe NKs are led by Biggs, Matt Gaetz of Florida, Bob Good of Virginia, Matt Rosendale of Montana and Ralph Norman of South Carolina - amongst others.\n\nThe last speaker election to go beyond the first ballot was in 1923, when members took nine tries to name Frederick Gillett (R-Mass.) to the position. The all-time record for duration of a speaker vote was in the mid-1850s — when lawmakers took almost two months and 133 ballots before picking Nathaniel Banks, also of Massachusetts.\n\nIn the House’s 234-year history, 14 speaker votes have required multiple ballots according to the Washington Post. With the rise of the two-party system, only two have come after 1856.\n\nThe House can change the election rules allowing a simple majority of votes to become the speaker, but this could backfire for the Republicans since Jeffries, in theory, could win a majority vote meaning the House and the Senate would both be under Democratic control - a highly unlikely scenario.\n\nFrederick H Gillett of Massachusetts, was re-elected Speaker of the House of Representatives on 5th December, when the Republican insurgents voted for him for the first time after a deadlock two days previously on December 14, 1923\n\nThe last speaker election to go beyond the first ballot was in 1923, when members took nine tries to name Frederick Gillett (R-Mass.)\n\nSince the House leadership election outcome is not a done deal, a speaker could be elected after multiple attempts, delayed for day or weeks, or Congress could change the rules in order to get a simple majority.\n\nUntil a speaker is elected, Cheryl Lynn Johnson, the Clerk of the United States House of Representatives and Pelosi appointee, will preside over the lower chamber.\n\nThe outgoing speaker will usually join the successor at the speaker's chair, where they will pass the gavel as a nod to the peaceful transition of power from one party leader to another. This time around, that will be Pelosi, the California Democrat who held the gavel for the last four years."}, {"url": "https://www.wuft.org/news/2020/10/28/political-newcomer-takes-aim-at-unseating-incumbent-in-floridas-house-district-23/", "page_content": "Democrat Cynthia Dela Rosa, 24, is running to unseat Republican Rep. Stan McClain, 59, on Nov. 3. McClain is seeking reelection for his third term in the State House. Both candidates are separated by age, gender, party and experience.\n\nBut one thing they do share is a love of their community.\n\nDela Rosa, 24, is a fresh face on the political scene. A recent University of Florida graduate, she currently works as a registered behavioral technician with children on the autism spectrum. But she’s leaving behind her degree in neuroscience and goals of becoming a doctor to pursue a life of public service.\n\n“I realized there are a lot of good doctors out there, but we need a lot more good politicians,” Dela Rosa said.\n\nDela Rosa, though enthusiastic, faces a myriad of challenges this election. The first-time candidate is running on a progressive platform in a district that is and has been strongly Republican.\n\nAbout 48% of registered voters in the district are Republican. About 30% are Democrat. And in 2016, over 84% of the vote went to Trump.\n\nBecause of the Republican stronghold in Marion County, Rep. McClain, who according to a social media ad is a “pro-Trump, pro-liberty” candidate, easily won his bid for reelection to the house in 2018.\n\nBut this hasn’t deterred Dela Rosa, who remains cautiously optimistic and on the offense. Her campaign strategy has consisted of strong community involvement.\n\n“What’s been very effective for us, especially in the early days of the campaign, has been sitting down and talking to future constituents. We’ve been knocking on doors for the past few months and I think it has let people know that we’re trying to see past party lines to put people first,” she said.\n\nThis work paid off in the lead up to the primary election. She gained 75.72% of the district’s Democratic votes, beating out opponent Richard Allen Rowe and securing her spot on the general election ballot.\n\nDela Rosa has centered her platform, known as The New Direction, on the local issues most pressing to her community. It consists of six main pillars: senior care, the Ocala National Forest, veterans, small businesses, West Ocala and healthcare.\n\nThese issues are central to Marion County, which Dela Rosa sees as a place with small town feelings but big city opportunities. An Ocala native, she hopes to use her campaign to amplify those in the community who feel that their concerns have been overlooked.\n\nThe topic of healthcare is critical to Dela Rosa, who says expanding access to Medicaid is one of her top priorities. Dela Rosa also supports greater funding of the public education system, a $15 minimum wage, police reform in the form of demilitarization and de-escalation training and a woman’s right to choose.\n\nTo her, accessibility is what makes a good representative.\n\n“It’s about a willingness to listen. As a representative, I wouldn’t know how to represent you if I don’t talk to you,” she said.\n\nShe questions Rep. McClain’s accessibility to his community, claiming that he has declined invitations to past potential candidate forums. McClain’s absence on the campaign field, Dela Rosa says, has disappointed her not only as a candidate but also as his current constituent.\n\nSave for a few mailers sent to Republicans in the district, Rep. McClain does not seem to be campaigning on the ground as actively as his opponent. He has, however, taken to social media to share information about the election and connect with his supporters.\n\nBut in a district so strongly red, McClain’s lack of an on-the-ground campaign may not be such an issue. He faced no challenger in the primaries, and the majority of voters align themselves with the conservative values that he promotes.\n\nHis platform, the only information on his website, focuses on six main concepts: job creation in a free-market environment, water conservation in the area’s springs, low taxation, school choice, faith and family, and preservation of the Second Amendment.\n\nHis daughter, Mandy McClain, says he’s guided by his family values, respect for small business owners and belief in the American dream.\n\n“My dad is the most honest and ethical person that I know. Everything he works hard for is something he believes in,” she said, and added that he’s not above speaking with and listening to those in the community about how he can be a better leader.\n\nMcClain was first elected to the Florida House of Representatives in 2016. Before that, he spent 12 years as a member of the Marion County board of county commissioners. So locals have had time to become acquainted with who Stan McClain is.\n\nHe doesn’t have to demand visibility in the way that Dela Rosa does.\n\nDuring the 2020 legislative session, he supported the passage of a Senate bill requiring minors to get parental consent before having an abortion, a house bill that raised the minimum salary for teachers, and the Clean Waterways Act.\n\nDespite his lack of campaigning in the community, McClain’s fundraising efforts have surpassed Dela Rosa’s. So far, McClain has raised $74,182, of which he has spent $15,779.\n\nDirect donations to Florida legislature candidate campaigns are limited to $1,000, but that hasn’t stopped certain companies from donating multiple times to McClain’s campaign. The majority of his contributions come from political action committees and organizations centered around agriculture, construction, housing and land management, and health care. Outside of politics, McClain is a state-certified residential contractor.\n\nFrequent contributors include Rep. Paul Renner’s (District 24) Conservatives for Principled Leadership PAC as well as HCA Florida’s Good Government Group, part of one of the largest private health systems in the state. Other notable contributors are the Duke Energy Corporation’s Florida PAC, Comcast and the Florida Bankers Association.\n\nSince making the decision to run in June 2019, Dela Rosa has raised $11,800 and spent $8,852 of it. Most of her spending has been for social media, which has been a go-to source of activity since the COVID-19 pandemic started.\n\nHer campaign manager Patrick Miller has helped her run a 100% grassroots campaign built on locally sourced small-dollar donations.\n\n“These are people within our community. Our neighbors. These are the people that we talk to every day,” Miller said.\n\n“Money in politics, for better or for worse, is a dominant force, and it just so happens that politicians and people in government usually do their jobs on behalf of their donors. And so when you have grassroots movements like ours who get their money from members of that community, that’s who we’re there to serve.”\n\nMiller and Dela Rosa also emphasized the size of their volunteer force. At the start of her campaign, Dela Rosa had around three or four volunteers.\n\nThat number has grown to about 40 people over the last couple of months.\n\nAs for the remainder of the campaign, Dela Rosa plans to keep knocking on doors and making phone calls in an effort to encourage voter turnout. Florida has shattered previous early voting records in the days since the early voting period began on Oct. 19.\n\nDela Rosa hopes to keep the momentum going until Election Day.\n\nRead more of WUFT’s coverage of Florida Votes 2020"}, {"url": "https://floridahousegop.com/officials/stan-mcclain/", "page_content": "I have lived in Marion County for over 30 years. My wife of 33 years (Ricki) passed away in 2019. We were blessed with 11 children and 14 grandchildren. Recently I got remarried to Jessica Throckmorton. We reside in Ocala, Marion County, and attend Good News church.\n\nI am a State Certified residential building contractor. This year I celebrated my 20th year in business. I currently serve our local trade organization, the Marion County Building Industry Association as the Executive Officer. I was named Builder of the Year in 2011.\n\nI began my time of public service being elected to the Marion County commission from 2004-2016 and served as Chairman of the Board 3 times. I achieved the designation as a Certified County Commissioner and Advanced County Commissioner from the Florida Association of Counties by completing their education coursework.\n\nI was elected to Florida House of Representatives in November 2016 and subsequently reelected in 2018 and 2020. During my time in the legislature, I have served on numerous committees and had the honor of being the Chairman of the Secondary Education and Career Development Subcommittee this session. In 2017/2018, I was named Legislator of the Year by the Florida Police Chiefs Association. In 2019, the College of Central Florida Advocacy award. I have been honored multiple times by various organizations that include Florida Family Action Council, Florida Chamber of Commerce, Associated Industries of Florida, and Americans for Prosperity for my work advocating for families and small businesses in Florida.\n\nWhen I have time off from work and legislative duties, I like to spend time with my family, fishing, playing golf and exploring “Old” Florida.\n\nThe Florida House Republican Campaign Committee endorses and urges you to vote for Paul Renner, Daniel Perez, and Stan McClain, Republicans, for State Representative. Paid by the Florida House Republican Campaign Committee, 1103 Hays St. Tallahassee, FL 32301. Approved by Paul Renner, Daniel Perez and Stan McClain."}, {"url": "https://www.nytimes.com/2023/01/05/us/politics/house-speaker-1923.html", "page_content": "WASHINGTON — The House was in an uproar, unable to settle on its new speaker, forcing roll call vote after roll call vote. The Senate had quietly slipped out of the city while insurgents in the House demanded more power as the nation watched anxiously.\n\n“Radicals Force Deadlock in House as Congress Opens,” blared one national headline.\n\nThe year was 1923, almost exactly a century ago, the last time the House required multiple days and repeated votes to settle on a new speaker before this week’s continuing stalemate over the candidacy of Representative Kevin McCarthy, Republican of California.\n\nWhile it was long before the dawn of Twitter, super PACs and C-SPAN, things really haven’t changed all that much in Congress. In fact, the parallels between then and now are striking, down to the opponents of 1923’s eventual winner, Frederick H. Gillett, Republican of Massachusetts, angling for basic changes in the rules of the House to give them more influence and more top committee slots, just as hard-right adversaries of Mr. McCarthy are doing today.\n\nUnable to overcome the opposition from a band of progressive Republicans, supporters of Mr. Gillett kept pushing the House into adjournment to allow back-room talks about how to resolve the stalemate, another tactic being employed this time around as the vote tallies remain inconclusive."}, {"url": "https://www.biography.com/political-figures/marco-rubio", "page_content": "(1971-)\n\nWho Is Marco Rubio?\n\nBorn in Miami, Florida, Marco Rubio is the son of Cuban immigrants. After earning a bachelor's degree from the University of Florida in 1993, he went to the University of Miami for his law degree. Rubio's political career began with his election to the West Miami City Commission in 1998. He was elected in the Florida House of Representatives the following year. In 2009, Rubio won his campaign for the U.S. Senate. In 2015, Rubio announced his plans to run for the 2016 Republican presidential nomination. However, his campaign never picked up the momentum he had hoped for and he dropped out of the race after a disappointing defeat in his home state of Florida. He re-entered the race for his previous Senate seat and was re-elected in 2016.\n\nEarly Life\n\nRubio was born in Miami, Florida, on May 28, 1971. He is one of four children born to Cuban immigrants. Both of his parents worked hard to support the family. His father spent many years as a bartender and his mother held a number of service industry and retail jobs. In 1975, his parents became naturalized U.S. citizens. For Rubio, he became interested in public service early on. He has told the press, \"I gained an interest in politics and history from my uncle, who would read books and newspapers out loud to us.\"\n\nRubio spent part of his childhood in Las Vegas, Nevada, but he returned to Florida in the 1980s with his family. A stellar athlete, Rubio was a top football player at South Miami High School. He graduated in 1989 and earned a football scholarship to Tarkio College in Missouri. Rubio left the school after a year and eventually enrolled at the University of Florida. After completing his bachelor's degree there in 1993, he earned a law degree from the University of Miami in 1996.\n\nPolitical Career\n\nRubio began his life in public service in 1998 by winning a seat on the West Miami City Commission. Before long, he made his ascent into state politics. Rubio was victorious in his bid for the Florida House of Representatives in 1999. He quickly established himself as a political force with the legislature, becoming the majority leader in 2003 and then speaker of the House three years later.\n\nAs the speaker, Rubio launched an ambitious campaign to generate ways to improve and reform the state government. He held a series of gatherings around the state to hear and collect ideas from Florida residents. Culling from these suggestions, Rubio put together a proposal called \"100 Innovative Ideas for Florida's Future.\" He presented the proposal to the legislature and more than half of these ideas became laws. One of these reforms, however, didn't survive the political process. The fiscally conservative Rubio had lobbied for property tax reforms and for instituting a sales tax increase.\n\nIn 2009, Rubio surprised many in Florida politics by taking on former Florida governor and Republican Charlie Crist for the Senate seat vacated by Mel Martinez. Analysts initially viewed Rubio as the underdog, and he trailed the better-known Crist in the polls at first. But the well-spoken young politician hammered at Crist for his ties to President Barack Obama and emphasized the state's dire need for economic change. \"I'm in this race to win. Many of the things that make America unique are threatened by politicians in Washington, D.C. We're going to make irreversible decisions over the next four to six years. I want to be a part of correcting the course,\" he said during his campaign.\n\nLate in the campaign, Rubio found himself retracting some of his statements about his family background. He had initially stated that his parents fled Cuba during the revolution. However, they had actually left before Fidel Castro took power. This information had little impact on his campaign. Voters seemed more taken with his pledges to curb federal spending.\n\nWith the help of Tea Party supporters, the reform-minded Rubio managed to win an impressive victory in November 2010. He defeated both Crist, who ran as an independent, and Democratic opponent Kendrick Meek. Since taking office in 2011, Rubio has become a member of several legislative committees, including the Senate Committee on Commerce, Science and Transportation; and the Committee on Foreign Relations.\n\nLess than a year after taking office, Rubio became the subject of intense political speculation. His name was bandied about as a possible running mate for Mitt Romney in his 2012 bid for the presidency. Though Rubio denied that he had any interest in the vice-presidential nomination, political analysts and members of the Republican Party thought he would have a good choice for the vice-presidential spot due to his representation of an important state in the national election and likely support from the Latino community.\n\nInstead of joining the Romney campaign, Rubio focused on his work in the Senate. In 2013, he was part of the “Gang of Eight”, a bi-partisan group of eight U.S. Senators who crafted a comprehensive immigration bill known as the Border Security, Economic Opportunity and Immigration Modernization Act of 2013. The bill provided a pathway to citizenship for undocumented immigrants and made the border more secure. The bill passed the Senate 62-32 but faced stiff resistance in the House. Eventually, Rubio withdrew his support for the bill citing more pressing priorities like repealing Obamacare. The House never took up the bill and it died in committee. Rubio’s participation in the formation of the immigration bill became a major issue during the 2016 Republican Presidential debates.\n\nIn 2014, in an effort to derail the Affordable Care Act, Rubio supported a provision to prevent the Department of Health and Human Services from tapping into other accounts to fund the risk corridors program. The result was several small insurers went out of business and others pulled out of the health care exchanges altogether.\n\nRubio has also been an outspoken pro-life advocate. He introduced legislation in January 2015 to allow states to \"enforce their parental notification and consent laws\" when a minor travels to another state for an abortion, according to Rubio's official website.\n\nPresidential Campaign\n\nIn April 2015, Rubio announced his plans to run for the 2016 Republican presidential nomination. In a speech delivered in Miami, he explained why he decided to seek the country's highest office. \"We've reached a moment now, not just in my career, but the history of our country, where I believe that it needs a Republican Party that is new and vibrant, that understands the future, has an agenda for that future,\" Rubio said. \"And I feel uniquely qualified to offer that.\"\n\nIn his bid for the Republican nomination, Rubio faced competition from fellow senators Ted Cruz and Rand Paul, both of whom had already announced their candidacies. He also had to battle his one-time mentor Jeb Bush. While he was brought into office with Tea Party support, Rubio shifted to a more moderate conservative position.\n\nAs his presidential campaign advanced, Rubio found himself up against real estate magnate and reality TV star Donald Trump, who had emerged as a leading candidate along with Cruz. He did fare better than many of his other Republican opponents in the first contest for delegates: the Iowa Caucus. In February 2016, Cruz won the most votes and 8 delegates, but Rubio managed to come in third. He was nearly tied with Trump, winning 23.1% of the votes to Trump's 24.3%. Both Rubio and Trump won 7 delegates each. Later that month, he received only 24.0% of the vote in Nevada caucuses, where he'd spent much of his childhood years. The next month, Rubio dropped out of the race after a crushing defeat in his home state by Trump, who won every county except for Miami-Dade.\n\nReturn to the Senate\n\nAfter his defeat by Trump, Rubio had asserted that he would not seek re-election for his Senate seat and would be taking a break from politics. In June 2016, however, Rubio announced that he would run for a second Senate term. In November 2016, Rubio defeated his Democratic opponent, Representative Patrick Murphy, and won re-election in the Senate race.\n\nRubio's return to the Senate was aided by veteran Republican operative Clint Reed, who managed the senator's campaign before taking over as his chief of staff in January 2017. However, the following January, Rubio announced he had abruptly fired Reed, following accusations of improper conduct with employees in the senator's office.\n\nIn February 2018, Politico reported that Rubio was collaborating with first daughter Ivanka Trump on ideas for creating maternity-leave coverage that would appeal to Republican supporters. Among the ideas the Florida senator was said to be considering was a program in which parents could draw from Social Security benefits to pay for their time away from the workplace.\n\nLater that month, following the horrific shooting at Marjory Stoneman Douglas High School in Parkland, Florida, that left 17 dead, Rubio agreed to participate in a town hall discussion on the subject that aired live on CNN. Facing tough questions and blistering comments from surviving students and parents who lost loved ones, Rubio endorsed raising the age requirement for buying a rifle and said he was reconsidering his opposition to placing limits on high-capacity magazines. He declined to say whether he would continue receiving donations from the NRA.\n\nMeanwhile, the Florida senator was seeking to push through his Second Amendment Enforcement Act, designed, in part, to curb the assault weapons ban in Washington, D.C. When city Mayor Muriel Bowser asked Rubio to withdraw his bill, he replied with a letter that said they \"share a common goal,\" insisting his legislation was simply meant to ensure that D.C. law was \"in line with federal law.\"\n\nWhen the coronavirus pandemic shut down communities and threatened to torpedo the economy in the early months of 2020, Rubio spearheaded the creation of the Paycheck Protection Program as chairman of the Small Business Committee. In May, he took over as interim chairman of the Senate Intelligence Committee when the incumbent head, Richard Burr, stepped aside during an FBI investigation into his stock trading.\n\nPersonal Life\n\nMarried since 1998, Rubio and his wife, Jeanette, have four children: Amanda, Daniella, Anthony and Dominic. Outside of politics, Rubio is known for his passion for football. He is a die-hard Miami Dolphins fan and his wife was once a cheerleader for the team.\n\nQUICK FACTS\n\nName: Marco Antonio Rubio\n\nBirth Year: 1971\n\nBirth date: May 28, 1971\n\nBirth State: Florida\n\nBirth City: Miami\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: Marco Rubio was elected to the U.S. Senate representing Florida in 2010. After an unsuccessful bid for the Republican presidential nomination, he was re-elected to the Senate in 2016.\n\nIndustries\n\nU.S. Politics\n\nAstrological Sign: Gemini\n\nSchools\n\nUniversity of Florida\n\n\n\nUniversity of Miami\n\n\n\nTarkio College\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Marco Rubio Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/political-figures/marco-rubio\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: March 29, 2021\n\nOriginal Published Date: April 2, 2014\n\nQUOTES"}, {"url": "https://www.nytimes.com/2021/04/06/us/politics/alcee-hastings-dead.html", "page_content": "Representative Alcee Hastings, a former federal judge who, despite being impeached and removed from the bench, was elected to Congress, where he championed civil rights and rose to become dean of the Florida delegation, died on Tuesday. He was 84.\n\nLale Morrison, his chief of staff, confirmed the death. She provided no other details.\n\nMr. Hastings, a Democrat, had announced in early 2019 that he had pancreatic cancer. He continued to make public appearances for a time but was unable to travel to Washington in January to take the oath of office.\n\nHis death reduces his party’s already slim majority in the House of Representatives, which is now 218 to 211, until a special election can be held to fill his seat. His district, which includes Black communities around Fort Lauderdale and West Palm Beach as well as a huge, less populated area around Lake Okeechobee, is reliably Democratic.\n\nA strong liberal voice, Mr. Hastings was a pioneering civil rights lawyer in the 1960s and ’70s in Fort Lauderdale, which at the time was deeply inhospitable to Black people. Throughout his career he crusaded against racial injustice and spoke up for gay people, immigrants, women and the elderly, as well as advocating for better access to health care and higher wages. He was also a champion of Israel."}, {"url": "https://public.lobbytools.com/legislators/660", "page_content": "Highlights:\n\nAmericans For Prosperity, Champion of Economic Freedom Award, 2019\n\nAssociated Industries of Florida, Voting Record A (97%), 2019\n\nCollege of Central Florida, Advocate Award, 2019\n\nFlorida Chamber of Commerce, Legislative Report Card A, 2018, 2019 (100%)\n\nIndependent Colleges and Universities of Florida, ICUF President's A Honor Roll, 2018\n\nThe American Conservative Union Foundation, 100% Rating, Conservative In Excellence Award, 2018\n\nFlorida Family Action, Champion of the Family Award, 2017-2018\n\nFlorida Family Action, Legislative Report Card A+ (100%), 2017-2018\n\nFlorida Police Chiefs Association, Legislator of the Year Award, 2017, 2018\n\nThe American Conservative Union Foundation, Conservative Excellence Award, 2017\n\nFlorida Farm Bureau, Champion for Agriculture Award, 2017\n\nMarion County Sheriff Emery Gainey's Eagle Eye Award, 2016\n\nSouthwest Florida Water Management District, Springs Coast Steering Committee, Restoring Our Springs Award, 2016\n\nLake Weir Kiwanis Club, Restoration of Lake Weir Kiwanis Club Building, 2015\n\nMarion County Board of County Commissioners, Chairman, 2006-2007, 2010-2011, 2014-2015\n\nFlorida Association of Counties, Advanced Leadership Program, Advanced County Commissioner Designation, 2012\n\nOcala/Marion County Economic Development Corporation, Director's Award, 2007, 2011\n\nMarion County Building Industry Association, Builder of the Year Award, 2011\n\nMarion County Veterans of Foreign Wars Retirement Home, Key to Our Home, 2011\n\nMarion County Sheriff's Office, EOC Emergency Management Dedication, 2009\n\nMarion County Fire Rescue, Historic Fire Rescue Award & Key to Ambulance Activation, 2008\n\nFlorida Association of Counties, Certified County Commissioner, 2007\n\nNorth Marion Central Park Association, Commitment & Support by Building Wrigley Fields, 2007"}]}