{"Frank A. McLain served in the House until 1925, when he was elected to the Florida Senate.": [{"url": "https://www.howold.co/person/frank-a-mclain/biography", "page_content": "Frank A. McLain Biography\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State cons*utional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster on October 11, 1920.He was interred in the City Cemetery.\n\nReferences"}, {"url": "https://sites.google.com/a/nevadaiowahistory.org/home2/founding-families/frank-a-mclain", "page_content": "McLains have lived in and around Nevada since 1854 when Frank A. McLain and his uncle John arrived from Rochelle, Illinois. Frank, age 17, began splitting rails for a penny each and saved his money judiciously. His dream was to be a farmer. John\n\nbuilt the second house in Nevada, which was also a hotel. This consisted of an elongated log cabin witha sleeping loft two logs high, a long dining table, and\n\nan adjacent lean-to for cooking.\n\n\n\nIn the late 1850s, the lure of riches in the Colorado gold fields was strong. The McLains and several other Nevada families put other plans on hold and the men headed west to make their fortunes. Most returned without reaching Colorado. Along the way, they met other adventurers returning empty handed. After selling all of his possessions for food, young Frank walked back to Nevada. He saved every penny earned from splitting logs and transporting goods to and from the river in Iowa City.\n\nThese trips took two weeks, for which he earned five dollars. He slept under his wagon and supplemented his diet with game he hunted along the way. He\n\nacquired land as funds were saved from his toil.\n\n\n\nOver the next 10 years, John’s hotel business flourished and “McLain’s Tavern” became a well-known place to spend the evening and obtain good food and drink. East of Nevada, Frank continued to buy, clear, and tile his growing farm. He married\n\nMary Doyle in 1861, and they built a successful farming and livestock business and raised a family. Their children, Clark and Mildred, were local residents for many years. Mildred was a mother and housewife. Clark was a school administrator and\n\nbanker in Maxwell and later became a banker in Pasadena, California, where he was also Postmaster. He loved the land and returned to Iowa each summer\n\nto establish tile lines and farm buildings.\n\n\n\nClark married Sarah Isabel “Belle” French of Maxwell. One of their children, Frank E. McLain, took over the farming business in the early 1900s. Frank E. lived to be 100 years old and many current residents will remember him and his wife, Mabel.\n\nTheir surviving children, Catherine and Fred, live near Nevada. They own parts of the original land settled by Frank A. McLain. When Fred was serving as a flight instructor in Texas during World War II, he married Jonnie Elna Bale. After the war, they moved\n\nback to Iowa where Fred eventually took over the farming business. Fred and Jonnie had four children. Their youngest son, Frank, joined Fred on the farm in the 1970s. Frank took over the business when Fred and Jonnie retired. Frank and his family live on the original farm near the site of the log cabin where Frank A. and Mary (Doyle) McLain lived in the 1800s.\n\n\n\nToday, the Iowa McLains are aware of their rich pioneer heritage, and continue the traditions of the past, working and improving the land.\n\n"}, {"url": "https://www.findagrave.com/memorial/6524605/frank-a-mclain", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.britannica.com/biography/Wassily-Kandinsky/Bauhaus-period", "page_content": "Bauhaus period of Wassily Kandinsky\n\nBy this time Kandinsky had an international reputation as a painter. He had always, however, been interested in teaching, first as a lecturer in law and economics just after getting his university degree, then as the master of a painting school he had organized in Munich, and more recently as a professor at the University of Moscow. He seems not to have hesitated, therefore, when early in 1922 he was offered a teaching post at Weimar in the already famous Bauhaus school of architecture and applied art. At first his duties were a little remote from his personal activity, for the Bauhaus was not concerned with the formation of “painters” in the traditional sense of the word. He lectured on the elements of form, gave a course in colour, and directed the mural workshop. Not until 1925, when the school moved from Weimar to Dessau, did he have a class in “free,” nonapplied painting. In spite of the somewhat routine nature of his work, however, he appears to have found life at the Bauhaus rewarding and pleasant. The climate was one of research and craftsmanship combined with a certain amount of aesthetic puritanism; it was classical, to use the term rather loosely, by comparison with the warm romanticism of his pre-1914 days in Munich.\n\nKandinsky responded to this climate by continuing to evolve in the general direction of geometric abstraction, but with a dynamism and a taste for detail-crowded pictorial space that recall his earlier sweeping-gesture technique. That Kandinsky was keenly interested in theory during these years is evident from his publication in 1926 of his second important treatise, Punkt und Linie zu Fläche (“Point and Line to Plane”). In his first treatise, Concerning the Spiritual in Art, he had emphasized in particular the supposed expressiveness of colours, comparing yellow, for example, to the aggressive, allegedly earthly sound of a trumpet and comparing blue to the allegedly heavenly sound of the pipe organ. Now, in the same spirit, he analyzed the supposed effects of the abstract elements of drawing, interpreting a horizontal line, for example, as cold and a vertical line as hot."}, {"url": "https://www.ancientfaces.com/person/frank-mclain-birth-1902-death-1974/42948479", "page_content": "Refresh this page to see various historical events that occurred during Frank's lifetime.\n\nIn 1902, in the year that Frank Mclain was born, the modern air conditioner was invented by Willis H. Carrier. The company that he worked for needed to find a way to control humidity and by solving this problem, Carrier created a system that could be used for cooling the rooms of a house. The Sun Belt thanks him!\n\nIn 1932, at the age of 30 years old, Frank was alive when on February 27th, actress Elizabeth Taylor was born in London. Her parents were Americans living in London and when she was 7, the family moved to Los Angeles. Her first small part in a movie was in There's One Born Every Minute in 1942 but her first starring role was in National Velvet in 1944. She became as famous for her 8 marriages (to 7 people) as she was for her beauty and films.\n\nIn 1941, Frank was 39 years old when on December 7th, the Japanese attacked the military base at Pearl Harbor, Hawaii. The surprise aerial attack damaged 8 U.S. battleships (6 later returned to service), including the USS Arizona, and destroyed 188 aircraft. 2,402 American citizens died and 1,178 wounded were wounded. On December 8th, the U.S. declared war on Japan and on December 11th, Germany and Italy (allies of Japan) declared war on the United States. World War II was in full swing.\n\nIn 1950, he was 48 years old when on June 25th, the Korean War began when North Korean Communist forces crossed the 38th parallel. The Soviet Union and China backed North Korea and the U.N., primarily the United States backed South Korea.\n\nIn 1974, in the year of Frank Mclain's passing, on August 9th, Gerald R. Ford became the 38th President of the United States. He had been Vice President for 8 months when he became President due to the resignation of President Nixon."}, {"url": "https://www.ksgenweb.org/archives/1919ks/m/mclainfe.html", "page_content": "Transcribed from A Standard History of Kansas and Kansans, written and compiled by William E. Connelley, Secretary of the Kansas State Historical Society, Topeka. [Revised ed.] Chicago: Lewis Publishing Co., 1919, c1918. 5 v. (xlviii, 2530 p., [155] leaves of plates): ill., maps (some fold.), ports.; 27 cm.\n\nFrank E. McLain\n\nFRANK E. McLAIN, now probate judge of Ellis County, is a man of interesting and notable experience and achievement. He is a pioneer of Western Kansas, where he has lived forty years. He is one of the Kansans to whom the word Vicksburg and Appomattox are not mere names in history from start to in the Civil war as a Union soldier from start to finish, and in his present position as probate judge he has been singularly qualified to handle those duties which come to that office in war times.\n\nJudge McLain was born in Canton, Ohio, January 14, 1844. He is of Scotch-Irish ancestry. His father, Charles McLain, was born in 1801 at Ellicott's Mills, Maryland, grew up in Pennsylvania, and was a farmer all his life. He finally left the farm and retired to Canton, Ohio, where he died in 1867. He was a democrat and a member of the Roman Catholic Church. He married in Stark County, Ohio, Catherine Heck. She was born in Lancaster County, Pennsylvania, in 1811 and died at Hays, Kansas, in 1895. Judge McLain was third in a family of seven children, the others being noted as follows: Mary Ann, who died at Canton, Ohio, wife of Patrick Foley, a railroad man now deceased; Miss A. K., who lives at Hays, Kansas; Helen wife of James M. Craig, a bridge builder and carpenter at Hays; Caroline, wife of F. R. Bussard, an architect and wagon maker; Emma, who resides at Hays, widow of Rufus Averil, who for a number of years conducted a summer resort and was boat captain in Vermont; and W. H., a plasterer living in Kansas.\n\nJudge McLain attended the public schools of Canton, including the high school, and was seventeen years of age when the war broke out. In 1861 he enlisted in the Thirty-Second Ohio Infantry and served exactly four years, being mustered out September 2, 1865. His three-year enlistment expired while he was in the midst of a campaign, and he veteranized and proffered his services for three years more or until the close of the war. His first experiences in battle were in the campaign through Western Virginia, where he fought at Greenbrier, McDowell, Cross Keys and at the Siege of Harper's Ferry, where, on September 15, 1862, he was made prisoner. He was soon paroled, and sent to Chicago, later transferred to Cleveland, and was exchanged in January, 1863. He was then assigned to the Army of the Tennessee under General Grant and had the privilege of serving in the advance upon Vicksburg and the siege of that place. He fought at Thompson's Hill, Raymond, Jackson, Champion Hill, Black River Bridge, all engagements leading up to the siege of Vicksburg, and for forty-one days he was in the siege of that city and under fire every day. The latter months of the war he was assigned to raiding duty through Mississippi and Louisiana. Because of special gallantry the company of which he was a member was transferred from the Thirty-Second Ohio Infantry to the Twenty-Sixth Ohio Battery.\n\nAfter the war Judge McLain returned to Canton, Ohio, and was employed as a plasterer for ten years or more. He left there March 4, 1878, and on the 10th of the same month arrived at Hays, Kansas, and thus, for forty years, his career has been identified with this historic section of Western Kansas. He homesteaded 160 acres and also a timber claim, and worked at his trade intermittently until 1887. In that year he was first called into public affairs by his election as sheriff of Ellis County. Judge McLain filled the sheriff's office capably for two terms, four years, and was then appointed by Governor Humphrey to the office of probate judge, and he filled that one year. He resumed farming then, but in 1891, was appointed clerk of the district court by Judge Monroe, serving two years. In 1893 he was the republican nominee for sheriff, but his party was defeated at the election. Following that came another period of activity on his farm until 1897, when he was chosen justice of the peace and police judge of the City of Hays. That office he filled from January, 1898, until January, 1915. In November, 1914, he was elected probate judge, and the care and wisdom with which he has handled that office brought such commendation that he was re-elected in 1916, but was defeated with his ticket in 1918.\n\nJudge McLain is a stalwart republican. He served two terms as commander and for a number of years has been adjutant and quartermaster of Vance Post No. 2, Grand Army of the Republic. He is also affiliated with Hays Lodge, Independent Order of Odd Fellows. The home of Judge McLain is a residence with four acres in grounds, near the court house, and this urban estate provides him the opportunity for work as well as a convenient place of abode. Judge McLain is a stockholder in the Golden Belt Fair Association.\n\nMay 29, 1869, almost half a century ago, Judge McLain married at Canton, Ohio, Miss Elizabeth H. Ulrich. She was born in Canton, and her parents came from Lorraine, France. To Judge McLain and wife six children were born: Howard H., the oldest, died at the age of eight months. Effie L., a graduate of the Hays High School, is the wife of Daniel Folts, a traveling salesman living at Sedalia, Missouri. Grace G., who died in 1913 at Jacksonville, Illinois, married George A. Smith, a traveling salesman of that city. Miss Catherine E., of Hays, Kansas, is a graduate of the Hays High School and of the Fort Hays Normal School, and began teaching in Ellis County at the age of sixteen, but for the past eight years has been librarian at Hays. Charles Francis is a graduate of the Hays High School and is clerk of the draft board at Hays. Alice L. is a graduate of the Fort Hays Normal School and is director of music in the public schools of Hartford, Kansas.\n\nPages 2214-2215."}, {"url": "https://betsysweeny.com/the-history-of-the-house/", "page_content": "One of my favorite things about living in an old house is knowing that I am just a piece of the history of that place. While I don’t live in the McLain house yet, I am constantly struck by the generations that came before me. With each room or space that I work on, I wonder how it was experienced in the 1890s, the 1950s, and beyond. This is not the first pandemic my house has witnessed. It has seen countless presidential elections, births, deaths, holidays, bad days and good days. It has also been home to many vibrant, interesting families.\n\n\n\nNow being an architectural historian, you would think that I would pour over the historic documents and do extensive research about the history of the house. But alas, I am both lazy and busy, and lucky to have a local preservation organization, The Friends of Wheeling, that has done almost all of that work for me. The history that follows is a condensed version of a report compiled by the Friends’ president, Jeanne Finstein.\n\n\n\nThe McLains\n\nThe House was probably built for Thomas B. McLain around 1892. McLain (1842-1924) was born in Warren, Ohio and came to Wheeling with his parents, John G. and Eliza Ellen Baird McLain, when he was 2 years old. His father was a printer and publisher of the Wheeling Argus, one of the first newspapers in the city, from 1844 until his death in 1849. (Thomas would have been about 7 years old at the time of his father’s death.)\n\n\n\nThomas’s brother Robert began the family’s first drug store in 1856 in a building owned by Dr. Robert W. Hazlett at the corner of 38th and Jacob Streets in Ritchietown (South Wheeling). Thomas worked there as a clerk and errand boy. Around 1860 the McLain brothers established a penny post office in their store. This “proved to be quite remunerative to them and a great accommodation to the townspeople who took advantage of it. People who wanted their mail brought down from the city signed an order to the postmaster to have their mail put into the penny post box, and every morning it was carried down to the drug store, distributed into the proper boxes, and delivered when called for at a charge of a penny for each letter or paper. During this time, the younger brother [Thomas] boarded and lodged at the family residence on North Main Street, between 8th and 9th Streets, and walked to and from the little drug store stopping on the way at the post office for the penny post mail.”\n\n\n\nThomas and his three brothers, Henry B., Robert B., and John G. McLain later opened the McLain Brothers Drug Store in Washington Hall, at the northeast corner of Market and 12th Streets. It was described as one of the most up to date in the city. When Washington Hall was torn down, the McLain Drug Store moved across the street.\n\n\n\nBy 1890, the three older McLain brothers had retired from the drug business, and in 1893 Thomas, under his physician’s advice, disposed of the drug business. That was around the same time that the house at 115 14th Street was built. Then Thomas and his son James formed the McLain Dental and Surgical Supply Company, located on the 2nd floor of the “McLain block,” corner of Market and 12th Streets. The company kept a “large and varied stock” of artificial teeth and instruments used in dentistry; surgical instruments; and sick room and hospital supplies such as hot water bottles, ice bags, air pillows, bed pans, syringes, sterilizers, and food warmers. “They also made a specialty of renting rolling chairs, invalid beds, air mattresses, chair commodes, and surgical operating tables. A specialty of the firm was truss fitting…They also supplied appliances for deformities of the body, artificial eyes, limbs, arms, and hands…along with instruments to aid the hearing, such as mohair conversation tubes, London hearing horns, hard rubber audiphones fans, black metal ear trumpets, and invisible ear drums.” Every time I take down a wall or pull up a floorboard, I expect to see a glass eye staring back at me. So far, no eyeballs have been discovered.\n\n\n\nThomas McLain lived at 115 14th Street for about ten years. By 1903-4, Wheeling City Directories show his residence as Echo Point. He later lived at 80 North Front Street (1905-6), then 303 South Penn Street beginning around 1907, followed by 416 Richland Avenue (Warwood) beginning around 1919. When he died in 1924 at age 81, his residence was listed as 127 Edgwood Street. His obituary called him “one of the city’s pioneer businessmen and most highly respected citizens.” He was survived by his wife and three children – Mrs. J. Ralph Boyd, Mrs. D.A. Burt, and James L. McLain. He was buried in Greenwood Cemetery.\n\n​The Horkheimers\n\nBernard Horkheimer and his wife Estella are listed at 115 14th Street in the 1903-4 City Directory. Horkheimer (c. 1853-1906) was a German immigrant who was in the wool-buying and grocery business with his own brothers and the Baer brothers. The Horkheimer family was very prominent in the Wheeling Jewish community at the time, and two of his nieces (daughters of Morris Horkheimer) married local rabbis who went on to some renown in their later lives. Bernard’s death certificate states that he was “accidentally killed by being crushed between [railroad] cars. He is buried in the Jewish section of Mt. Wood Cemetery. Horkheimer’s widow remained in the house until around 1910.\n\n\n\nI have a particular affinity for the Horkheimers for some reason. Estella is one of my favorite names from my favorite classic, Great Expectations, and I get the sense that some of the early design decisions in the house were actually from this time period, not its original construction. I haven’t experienced anything paranormal in the house yet, but I do occasionally ask Estella what she thinks of my choices.\n\nLater Owners\n\nAfter the Horkheimers, the next resident was Frank C. Swift, whose occupation was shown as broker and then as traveling salesman in the 1917 and 1920 City Directories. I think Frank C Swift is the best name for a travelling salesman possibly ever, and for that reason I am also fond of him. Swift was followed by Rev. Pliny Brokan Ferris and his wife Alice. Ferris was the pastor of 2nd Presbyterian Church. Deed records indicate that church trustees owned the property during this period. When the Second Presbyterian church was demolished in the 2010s, windows from the building were salvaged by the Wilsons and installed in the dining room.\n\n\n\nSubsequent residents/owners included veterinarian Leon Reefer (and his wife Josephine), who apparently used the house as both an office and residence from around 1928 until his death from pulmonary tuberculosis on January 1, 1935. Daniel H. and Edna Manners were the next residents (1936-1946). Manners worked as office manager for Hygrade Food Products and later as a purchasing agent for the John Wenzel Company, meat packing.\n\n\n\nThe Antonuccis\n\nThe Antonucci family then lived at this address and 115 ½ (or 115a and 115b) from 1946 until the late 1980s. The split address came from the rooms rented on the second and third floors. Owners Carl and Mary did not have children, and converted the first floor to their living quarters, and rented space upstairs. Carl Antonucci was a millworker at Wheeling Steel. Mary was a talented cook and baker, and worked at a local bakery. They both walked to work, and never owned a car. East Wheeling during this period was heavily populated with Italian immigrants, and the family of Mary Antonucci occupied 113 (next to the McLain House) and 126 ½, just up the street. Mary and Carl were well known throughout the neighborhood for their gardens and Sunday dinners.\n\nThe Vacant Years\n\nFrom the 1980s on, the McLain house appears to have been vacant. The inheritor of the Antonucci’s is not well known, and never lived in the house. Neighbors remember a few owners who never occupied to house, and then a long stretch of vacancy. While much of the historic fabric of the house remains, it was during this time that the stained glass transom windows on the front of the house were removed.\n\n\n\nThe Wilsons\n\nBrian and Stephanie Wilson owned the McLain house from 2013 until I purchased it from them in May 2020. The Wilsons saved the McLain house from demolition, and began the restoration process with extensive structural repairs to the basement, updating systems, and acquiring the lot next door. Both trained at the Belmont Restoration Program, the Wilsons are true preservationists that brought the house back from the brink. They also saved the tiny house from demolition, relocated it to the back yard, and incorporated several pieces of local salvage into the design. I am so grateful for the time and effort they spent on the house, and consider them both friends.\n\n\n\nAnd then there was Me\n\nThe first time I saw the McLain house was Labor Day weekend, 2019. My friend Stephanie was visiting from Virginia, and I was taking her on a walking tour of the architecture of Wheeling, because I am an insufferable host that relentlessly imposes my interests on anyone around me. I had never really noticed this house before, so we stopped in front and I said how much I liked it, and I wonder who owns it. My now neighbor Donna overheard me, and immediately filled me in on the situation. Brian and Stephanie and I had many mutual friends, so a facebook message later we set up a viewing.\n\n\n\nI walked through the house for the first time over Thanksgiving, again over Christmas, and then began a long process of due diligence and financing. Throw in a pandemic to slow things down a bit, it was a long process. I closed on May 28th 2020, and started work in the next month.\n\n\n\nThe longer I own the house, the more people and memories surface. It’s been wonderful to hear the recollections of neighbors and descendants, and I only hope this fountain of knowledge continues."}, {"url": "https://www.espn.com/classic/biography/s/McLain_Denny.html", "page_content": "\"He's the original flim-flam man. Any day I expect him to come riding on a Conestoga wagon selling elixir out the back end as he's leaving town. Probably being run out of town. But that's Denny,\" says former Tigers teammate Jim Northrup about Denny McLain on ESPN Classic's SportsCentury series.\n\nDenny McLain will be remembered for two things: He was the last 30-game winner of the 20th century and that he spent a lot of time in prison. His off-field activities as a player and his post-retirement involvement in a string of felonies have cast long shadows over the Detroit Tigers righthander who dominated the American League in 1968 when he became the first pitcher in 34 years to win 30 games.\n\nRecording a 31-6 record with a 1.96 ERA, he earned MVP and Cy Young honors. His 280 strikeouts - as opposed to only 63 walks - also contributed to Detroit's first pennant since 1945. At 24, McLain seemed to have it all.\n\nBut within 16 months, McLain's image was badly tarnished. In February of 1970, Commissioner Bowie Kuhn suspended him until July 1 for bookmaking activities, one of three suspensions he was hit with that year.\n\nLife after baseball also proved troublesome to McLain. In the mid-eighties, he spent 27 months in prison after convictions on federal racketeering charges involving gambling and cocaine. A decade later, McLain was back in prison for looting a company's pension fund. He's not scheduled for release until 2004.\n\nMcLain was born on March 29, 1944 on Chicago's South Side and was raised with his younger brother Timmy in the Chicago suburb of Markham. Denny played his way onto Little League and Babe Ruth League teams from other towns because Markham didn't have organized leagues. He starred - as both a pitcher and shortstop - at Chicago's Mount Carmel High School, leading the school to back-to-back Catholic League championships in his junior and senior years.\n\nDuring his freshman season in the spring of 1959, perhaps the most traumatic event in McLain's life occurred: the death of his father Tom. His father was his inspiration - both in baseball and in playing the organ.\n\nMcLain signed with the Chicago White Sox for $17,000 after graduating from high school in 1962, but was claimed by the Tigers organization on first-year waivers the following spring. He was brought up late in 1963 and went 2-1 with Detroit. A few days after the season ended, he and Sharyn Boudreau, the daughter of Hall of Famer Lou Boudreau, eloped to New Buffalo, Mich.\n\nIn 1964 McLain was farmed out to Syracuse of the International League but was called up in late May. In an injury-ridden season, he went 4-5. The following year he came into his own, going 16-6 with a 2.61 ERA as he learned to throw a curveball and changeup to go with his outstanding fastball.\n\nDuring this time, McLain also learned another thing. His manager, Charlie Dressen, taught him how to handicap horses, a skill that exacerbated a lifelong obsession with gambling. What McLain picked up on his own was his womanizing, another lifelong obsession. He and Sharyn separated several times before they divorced in 1998.\n\nDespite arm problems, the 6-foot-1, 185-pound McLain soared to the verge of stardom, going 20-14 with a 3.92 ERA in 1966 and 17-16, 3.79 in 1967. During the latter season, McLain raised some eyebrows when he missed the last two weeks in September because of a mysterious foot injury while Detroit was involved in a heated pennant race.\n\nBut it was 1968 that put McLain's name in the record book. By the All-Star break, he was 16-2. Besides his 31 victories, he led the American League by completing 28 of his 41 starts and pitching 336 innings as he became the first 30-game winner in the majors since Dizzy Dean in 1934.\n\nWhile McLain went 1-2 in the World Series, losing twice to the Cardinals' Bob Gibson, the Tigers won in seven games, with Mickey Lolich picking up the slack with three victories. Almost immediately after the Series, McLain accepted a gig playing the organ at a Las Vegas hotel.\n\nIn 1969, McLain again led the AL in victories, going 24-9 with a 2.80 ERA, and shared a second Cy Young prize, with Baltimore's Mike Cuellar. But that season brought trouble in the clubhouse. McLain clashed with manager Mayo Smith over the latter's role in getting pitching coach Johnny Sain fired. McLain showed his displeasure by missing workouts between starts and arriving at the park only shortly before game time.\n\nThe next year, 1970, was an outright disaster for McLain - and the beginning of the end of the road for his baseball career. Kuhn suspended McLain after Sports Illustrated detailed the pitcher's role in a bookmaking operation in Michigan during the 1967 season.\n\nMcLain injured his toes that September; he gave different descriptions of how the accident happened. The Sports Illustrated story offered another possible version: A member of the mob brought his heel down on McLain's toes and told him to pay a $46,000 bookmaking debt.\n\nIn late August 1970, McLain dumped ice water on two reporters and the Tigers suspended him. Then in September Kuhn told McLain he would not be allowed to pitch the rest of the season because the pitcher carried a gun - he waved it in a Chicago restaurant - and violated the terms of his probation.\n\nThat year, McLain also applied for bankruptcy despite his having become the franchise's first $100,000 player after the 1968 season. He had lost not only his money but his fastball as well. Appearing in only 14 games, he could do no better than a 3-5 record.\n\nIt came as no surprise when he was traded after the season, being sent to the last-place Washington Senators. McLain and manager Ted Williams developed a mutual animosity. By losing 22 games (against only 10 wins) in 1971, McLain earned the distinction of falling from the league lead in victories to the league lead in losses in just two seasons.\n\nIn 1972, McLain was traded twice, to the Oakland A's and then the Atlanta Braves. His combined record was 4-7 with a 6.39 ERA.\n\nHe tried to make a comeback the following year, in the minors with Des Moines and Shreveport, but the fastball wasn't there anymore and neither was the desire. McLain finished his major league career with a 131-91 record and 3.39 ERA.\n\nHe tried a number of jobs after leaving baseball. None succeeded for long. Among McLain's other \"careers\" were as promotions director for a minor league hockey team and a plan to buy a South Carolina radio station. The former ended when he was fired over a problem with the team budget, the latter when his partners won a suit to get their money back.\n\nHe played the organ in a variety of cocktail lounges, cut an album, and opened his own place called Gaffner's that failed in a short time. One job was playing synthesizer in a Detroit bar where former heavyweight champion Leon Spinks was a greeter-bartender. McLain's weight shot up to more than 300 pounds.\n\nAfter moving to Lakeland, Fla., he became a partner in First Fidelity Financial Services, rumored to be backed by the Mafia. In 1985, McLain was found guilty of federal charges involving racketeering, extortion and narcotics and sentenced to 23 years. In 1987, his convictions were overturned due to procedural violations. When the government re-indicted him, he pleaded guilty. He received a 12-year sentence, but the feds let him off with five years probation and time served, so he was free.\n\nReturning to Detroit, McLain was a hit as a radio talk-show host. That wasn't good enough for him.\n\nIn 1994, he and some associates bought a Chesaning, Mich., meat-processing company that went bankrupt two years later. He and an associate were indicted for looting the company's pension fund of $12.5 million. Convicted in December 1996 of conspiracy, theft, money laundering and mail fraud, he was sentenced to eight years.\n\nMcLain served more than six years in the McLean Federal Correctional Institution in Bradford, Pa., until he was released in 2003 and transferred to a halfway house in Detroit for six months. During that time, he was employed in a 7-Eleven. He is on supervised release for three years, during which he must remain in regular touch with his probation officer."}, {"url": "https://www.ancientfaces.com/person/frank-e-mclain-birth-1937/105375563", "page_content": "Add Frank's birthday or the date he died to see a list of historic events that occurred during Frank's lifetime. Refresh the page for new events.\n\nIn 1937, in the year that Frank E. Mclain was born, on May 6th, the German zeppelin the Hindenburg caught fire and blew up. The Hindenburg was a passenger ship traveling to Frankfurt Germany. It tried to dock in New Jersey, one of the stops, and something went wrong - it blew up. Thirty-six people were killed out of the 97 on board - 13 passengers, 22 crewmen, and one ground worker. The reasons for the explosion are still disputed.\n\nIn 1943, on March 31st, the Broadway musical Oklahoma! opened. Written by Richard Rodgers and Oscar Hammerstein II (the first of their string of successful collaborations), audiences loved it. The musical ran for 2,212 performances originally and was made into a movie in 1954.\n\nIn 1951, on June 25th, CBS began broadcasting in color. There were well over 10 million televisions by that time. The first show in color was a musical variety special titled \"Premiere\". Hardly anyone had a color TV that could see the show.\n\nIn 1963, the British Secretary of War, 46 year old John Profumo ,was forced to resign when he lied about an affair with 19 year old Christine Keeler. Keeler was also involved with the Soviet naval attaché and charges of espionage were feared. No proof of spying was ever found.\n\nIn 1981, on August 1st, MTV debuted. It was the first music video TV channel. The first music video played was the Buggles' \"Video Killed the Radio Star\" - the second was Pat Benatar's \"You Better Run\"."}, {"url": "https://www.legis.state.pa.us/cfdocs/legis/SpeakerBios/SpeakerBio.cfm?id=55", "page_content": "\n\n\n\nFrancis B. McClain Born: April 14, 1864, Lancaster, Lancaster County, PA. Died: October 11, 1925, Lancaster, Lancaster County, PA. Member of the House: Lancaster County, 1st District, 1895-March 18, 1910. Affiliation: Republican. Francis Bernard McClain was educated in the parochial schools of Lancaster County, Pennsylvania. He graduated from Lancaster High School in 1881. McClain married the former Ellen Bernardine O’Neill on February 14, 1888. They had 1 child who died in infancy. Starting in 1884, McClain became involved in the livestock business, a profession he continued to be engaged in through the remainder of his life. Frank McClain worked as a cattle dealer and later became cofounder of the Lancaster Livestock Exchange. He became the first president of that company shortly after. In November of 1894, McClain was elected to represent the 1st District of Lancaster County in the Pennsylvania House of Representatives. He was re-elected to 7 more consecutive terms. During his time as a legislator, McClain worked to improve the lives of his constituents in Lancaster County. Much of the legislation he sponsored appropriated money to hospitals and homeless shelters in Lancaster. He was the sponsor of legislation, which became Act 473 of 1901, which funded a homeless shelter in his district. McClain also sponsored legislation that would become Act 145 of 1903 that gave more rights to foreign corporations to purchase real estate in Pennsylvania. He also created legislation which became Act 469 of 1907 that helped fund the Lancaster General Hospital. McClain served as chairman of the Municipal Corporations Committee from 1899-1900. In 1901 he was selected chairman of the Corporations Committee and served as its chair until 1906. During his time as Representative, he also served on the Ways and Means Committee and the Railroads Committee. On January 1, 1907, McClain was elected the 104th Speaker of the Pennsylvania House of Representatives by a vote of 157 to 50, beating challenger, Representative John M. Flynn. During McClain’s service as Speaker of the House, Pennsylvania experienced the “Panic of 1907.” This financial crisis hit Pennsylvania hard, and the legislature created new laws to help fill its coffers and prevent future crises. It was during this time that Pennsylvania enacted Act 512 of 1907, the state’s first law that allowed for a company’s capital stock to be taxed. In order to prevent future bank collapses triggered by consumers rushing to withdraw their money, Act 150 of 1907 was enacted which would require banks to maintain a cash reserve that was enough to cover at least 15 percent of all deposits. McClain was elected mayor of Lancaster city on February 15, 1910. Resigning from the House as majority leader on March 18, 1910, McClain was sworn in as mayor on April 4, 1910, and served until he resigned on January 6, 1915. In May of 1914, he became the Republican candidate for Lieutenant Governor. On November 3, 1914, he won the election and was sworn in as the 11th Lieutenant Governor of Pennsylvania on January 20, 1915, and served through January 21, 1919, under Governor Martin Grove Brumbaugh. In 1919 McClain became executive director and treasurer of the newly formed State Welfare Commission. In 1919 he was awarded an Honorary Doctorate of Laws by Villanova College. Socially, McClain was the director of the Lancaster Charity Society, a member of the Lancaster Historical Society, and president of the Philadelphia Terrapin Club for over 20 years. McClain is remembered for the joy he took in enriching the lives of orphaned and disadvantaged children through his work as a trustee of the Home for Friendless Children where he played Santa Clause during the holidays. Frank B. McClain died at his home in Lancaster on October 11, 1925, at the age of 61. His death was attributed to deteriorating health following a stroke he suffered a year prior. He is interred at Saint Mary’s Roman Catholic Cemetery, the city of Lancaster, Lancaster County, Pennsylvania."}]}