{"Frank A. McLain served in the Senate until 1929.": [{"url": "https://www.wikiwand.com/en/Frank_A._McLain", "page_content": "Frank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nAmerican politician\n\nQuick facts: Frank Alexander McLain, Member of the Mississ... ▼\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster on October 11, 1920.[1] He was interred in the City Cemetery."}, {"url": "https://www.howold.co/person/frank-a-mclain/biography", "page_content": "Frank A. McLain Biography\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State cons*utional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster on October 11, 1920.He was interred in the City Cemetery.\n\nReferences"}, {"url": "https://wiki2.org/en/Frank_A._McLain", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican politician\n\nFrank Alexander McLain (January 29, 1852 – October 11, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster on October 11, 1920.[1] He was interred in the City Cemetery.\n\nYouTube Encyclopedic\n\n1 / 1 Views: 130 921\n\nGangland Detroit Mob documentary part 1: Detroit's Mafia's founding fathers Transcription\n\nReferences"}, {"url": "http://dictionary.sensagent.com/Frank_A._McLain/en-en/", "page_content": "From Wikipedia\n\n\n\n\n\nFrank Alexander McLain (January 29, 1852 - October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster, Mississippi, October 10, 1920.He was interred in the City Cemetery."}, {"url": "https://peoplepill.com/people/frank-a-mclain/", "page_content": "\n\n\n\nFrank Alexander McLain (January 29, 1852 – October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster in Amite County, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874. He studied law. He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880. He served as member of the State house of representatives 1881-1883. He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned. He resumed the practice of law in Gloster, Mississippi. He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love. He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909. State supreme court commissioner 1910-1912. He died in Gloster, Mississippi, October 10, 1920. He was interred in the City Cemetery."}, {"url": "https://memim.com/frank-a.-mclain.html", "page_content": "Frank Alexander McLain (* January 29, 1852 in Gloster, Amite County, Mississippi, † October 10, 1920 ) was an American politician. Between 1898 and 1909 he represented the fifth and the seventh consecutive electoral district of the state of Mississippi in the U.S. House of Representatives.\n\nCareer\n\nFrank McLain attended after elementary school until 1874 the University of Mississippi in Oxford. After studying law and qualifying as a lawyer, he began in Liberty to work in his new profession. Politically, McLain member of the Democratic Party. Between 1881 and 1883 he was a delegate in the House of Representatives from Mississippi. From 1883 to 1896 McLain worked as district attorney and then again as a private lawyer. In 1890 he was a delegate at a meeting to revise the constitution of Mississippi.\n\nAfter the death of Congressman William F. Love McLain was elected in the by-election due in the fifth district of Mississippi as his successor in the U.S. House of Representatives in Washington. He finished until March 3, 1897 the opened first legislative period of his predecessor. In the following regular congressional elections McLain was confirmed in each case. Thus he was able to represent the fifth district in Congress until March 3, 1903. Since the elections of 1902 he ran in the seventh district. This he represented until March 3, 1909 Congress. He was since December 12, 1898 to March 3, 1909 for uninterrupted member of the House of Representatives.\n\nAfter the end of his time in Washington was Frank McLain 1910-1912 employed at the Mississippi State Supreme Court ( State Supreme Court Commissioner). He died in October 1920 in his birthplace of Gloster and was also buried there."}, {"url": "https://www.findagrave.com/memorial/55852040/frank-wibert-mclain", "page_content": "Frank Wilbert McLain, son of William H. and Lydia Whitcomb McLain, was born January 3, 1864 in Henderson County, Illinois, and died December 13, 1929 at his home in Emerson, Iowa.\n\nHe came to Iowa and located near Imogene in 1881. He resided in Mills and Fremont counties until after his marriage.\n\nHe was married to Carrie Inez Davis on February 14, 1889 and soon afterward moved to their farm in Montgomery county, near Emerson, Iowa. It was there that they spent thirty years, and where their family of seven children grew up together.\n\nMr. McLain became a member of the Presbyterian church in his early manhood in Illinois and was always a faithful worker in that church. He transferred his letter to Champion Hill Presbyterian church, south of Emerson, and attended services there until his death.\n\nHe was deeply interested in the educational facilities of his community and served as director in his local district for many years. He also served the town of Emerson as councilman.\n\nThose remaining to mourn his departure are his faithful and devoted wife, daughters, Pearl and Velma, residing at home; Mrs. George Gordy, of Bloomfield, Iowa; Mrs. John Parker, Mrs. James Ungry and Mrs. E. K. Birdsall all of Emerson and one son, Roy, of Davenport; also three brothers, Joe of Emerson; Elmer of Red Oak and Clyde of Tabor:four sisters, Mrs. Emma Kellenbarger, of Emerson; Mrs. Lottie McCarty of Aurora, Nebr.; Mrs. Nettie Spears of California and Mrs. Lou Straight of Western, Nebr. There are seven grandchildren, other relatives and a host of friends that will miss him more than words can tell.\n\nFuneral services were held at the Presbyterian church, Sunday afternoon, at 2:30, with Rev. Paul Holland in charge of the service, with Rev. E. A. Kieser of Council Bluffs assisting him. Rev. C. W. McCullan of Coin, a close friend of the family gave a few remarks.\n\nBurial was made in the Emerson cemetery.\n\nMalvern Leader, December 19, 1929, page 8\n\nFrank Wilbert McLain, son of William H. and Lydia Whitcomb McLain, was born January 3, 1864 in Henderson County, Illinois, and died December 13, 1929 at his home in Emerson, Iowa.\n\nHe came to Iowa and located near Imogene in 1881. He resided in Mills and Fremont counties until after his marriage.\n\nHe was married to Carrie Inez Davis on February 14, 1889 and soon afterward moved to their farm in Montgomery county, near Emerson, Iowa. It was there that they spent thirty years, and where their family of seven children grew up together.\n\nMr. McLain became a member of the Presbyterian church in his early manhood in Illinois and was always a faithful worker in that church. He transferred his letter to Champion Hill Presbyterian church, south of Emerson, and attended services there until his death.\n\nHe was deeply interested in the educational facilities of his community and served as director in his local district for many years. He also served the town of Emerson as councilman.\n\nThose remaining to mourn his departure are his faithful and devoted wife, daughters, Pearl and Velma, residing at home; Mrs. George Gordy, of Bloomfield, Iowa; Mrs. John Parker, Mrs. James Ungry and Mrs. E. K. Birdsall all of Emerson and one son, Roy, of Davenport; also three brothers, Joe of Emerson; Elmer of Red Oak and Clyde of Tabor:four sisters, Mrs. Emma Kellenbarger, of Emerson; Mrs. Lottie McCarty of Aurora, Nebr.; Mrs. Nettie Spears of California and Mrs. Lou Straight of Western, Nebr. There are seven grandchildren, other relatives and a host of friends that will miss him more than words can tell.\n\nFuneral services were held at the Presbyterian church, Sunday afternoon, at 2:30, with Rev. Paul Holland in charge of the service, with Rev. E. A. Kieser of Council Bluffs assisting him. Rev. C. W. McCullan of Coin, a close friend of the family gave a few remarks.\n\nBurial was made in the Emerson cemetery.\n\nMalvern Leader, December 19, 1929, page 8"}, {"url": "http://dictionary.sensagent.com/frank%20a%20mclain/en-en/", "page_content": "From Wikipedia\n\n\n\n\n\nFrank Alexander McLain (January 29, 1852 - October 10, 1920) was a U.S. Representative from Mississippi.\n\nBorn near Gloster, Mississippi, McLain attended the public schools, and was graduated from the University of Mississippi at Oxford in 1874.He studied law.He was admitted to the bar and commenced practice in Liberty, Mississippi, in 1880.He served as member of the State house of representatives 1881-1883.He served as district attorney for the judicial district from 1883 until January 1, 1896, when he resigned.He resumed the practice of law in Gloster, Mississippi.He served as member of the State constitutional convention in 1890.\n\nMcLain was elected as a Democrat to the Fifty-fifth Congress to fill the vacancy caused by the death of William F. Love.He was reelected to the Fifty-sixth and to the four succeeding Congresses and served from December 12, 1898, to March 3, 1909.State supreme court commissioner 1910-1912.He died in Gloster, Mississippi, October 10, 1920.He was interred in the City Cemetery."}, {"url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/hawes-cooper-act", "page_content": "Hawes-Cooper Act\n\nUnited States 1929\n\nSynopsis\n\nIn the early 1900s, most prisons were involved in selling on the open market products made by inmates. The money earned from these sales was most often used to finance the prison itself. However, manufacturers, employers, and labor leaders in the open market argued that they could not compete with the prisons, which had a free labor force that could not strike. State governments could outlaw the sale of convict-made goods from their own state, but they had no control over the sale of prison-made goods imported from other states. The passage of the Hawes-Cooper Convict Labor Act in 1929 allowed states to remove the interstate commerce nature of prison-made goods and to prohibit the sale of such goods in their state, even if the goods were produced in another state.\n\nTimeline\n\nEvent and Its Context\n\nPassed on 19 January 1929, with an effective date of 1934, the Hawes-Cooper Act stated that all goods produced wholly or in part by convict labor \"transported into any State or Territory of the United States and remaining therein for use, consumption, sale, or storage, shall upon arrival and delivery in such State or Territory be subject to the operation and effect of the laws of such State or Territory,\" thus allowing individual states to prohibit the sale of goods made by convicts on the open market whether those goods had been made within or outside of their state. The Hawes-Cooper Act was the product of cooperation between organized labor and business, and stemmed from the competition between the prisons and the free market.\n\nPrisons used five different systems of labor: the lease system, contract system, piece-price system, public account system, and state use or state account system. In the lease system, prisoners were literally leased to another party who paid the prison for the use of the prisoners. A number of prisons supported themselves using the contract system, which took the revenue made by selling convict-manufactured goods to pay the prison's operating costs. The piece-price system was similar to the contract system, except the contractors provided the raw materials while the prisons provided the labor. The public account system was like the piece-price system, except the state provided the raw materials. Finally, in the state use or state account system, the goods produced were only sold to the manufacturing institution of other state institutions.\n\nWith each of these labor systems, the production and sale of convict-produced goods proved a serious competitor in the open market. Prison-made goods were cheaper to produce and sold for less. Prisons were in a unique position to cheaply and efficiently produce such items as brooms, brushes, shoes, iron moldings, and cigars. Besides the free labor, prisons also had low overhead. For instance, taxes paid for lighting, heating, and water whether the prisoners were working or sleeping. Free-market employers felt they had few options for competing with prison labor. Their choices included lowering the quality of work or abandoning the area of competition.\n\nState governments could control the products made in their home state, but they had a harder time controlling the items brought in from other states. Before the passage of the Hawes-Cooper Act, individual states could not prevent the sale of convict-made goods from other states. Hawes-Cooper made convict-produced goods subject to the laws of the state in which the items were sold. Thus, if an individual state outlawed the sale of prison goods in their state, then the sale of prison-produced goods imported from neighboring states also would be prohibited. This feature made the Hawes-Cooper Act an enabling act: it let individual states decide whether to permit the sale of prison goods on the open market.\n\nIn 1932, two years before the Hawes-Cooper Act went into effect, a Department of Labor study found that of 158,947 convicts in 104 prisons, 82,276 (or 52 percent) were involved in some sort of manufacturing. The majority of the 104 prisons (42 percent) used the state-use labor system. About 38 percent of the goods, worth more than $28 million, were destined for the open market: 40 percent of these products were sold in the state where the goods were manufactured, while the remaining 60 percent were sent to markets out of the state where the goods were made.\n\nMost of the convicts involved in making goods received no wages; for inmates who were paid, the wage was approximately 2 to 15 cents per day. The Department of Labor study also produced a list of the industries most affected by prison labor; the top prison industries included making shirts, pants, binding twine, chairs, and farm, garden, and dairy items. In the open market, businesses suffered not only because of the volume of items prisons produced but also because their specialization in making a particular item could threaten a regular business.\n\nMost prison officials opposed the Hawes-Cooper Act. One of the most cited arguments against Hawes-Cooper was that its passage would leave prisoners idle. The American Prison Association stated that idleness destroyed the inmates' physical, mental, moral, and spiritual well-being. Others pointed out that some prisons used the proceeds from their manufacturing to support themselves, thus lessening the tax burden on citizens.\n\nThe enforcement of the Hawes-Cooper Act caused a financial crisis in a number of prisons. The cost of supervising and disciplining idle prisoners proved more expensive and many prisons lost a valuable source of income for the prisons' upkeep and staffing. In 1935 President Franklin D. Roosevelt created the Prison Industries Reorganizing Administration to foster state cooperation through a national program to give inmates meaningful work.\n\nThe constitutionality of the Hawes-Cooper Act was challenged in Whitfield v. Ohio (1936), but the U.S. Supreme Court upheld Hawes-Cooper by stating that free labor could not compete \"with enforced and unpaid or underpaid convict labor.\" Other legislative acts followed Hawes-Cooper, including the Ashurst-Sumners Act (1935), Walsh-Healey Act (1936), Sumners-Ashurst Act (1940), and Comprehensive Crime Control Act (1984), which encouraged prison manufacturing to help control the cost of incarceration.\n\nKey Players\n\nCooper, John Gordon (1872-1955): Cooper immigrated to the United States from England in 1880 and settled in Youngstown, Ohio. He attended public schools and worked in steel mills and for the Pennsylvania Railroad Company. A Republican, Cooper served as a member of the Ohio State House of Representatives from 1910 until 1912. In 1915 he was elected to Congress, where he served until 1937.\n\nHawes, Harry Bartow (1869-1947): Hawes was born in Kentucky and attended Washington University School of Law in St. Louis, Missouri. He represented Hawaii during its annexation and served as the president of the St. Louis police board from 1898 until 1904. Hawes also served as a state representative for Missouri (1916-1917). During World War I he served with the Military Intelligence Department of the General Staff and later was assigned to the U.S. embassy in Madrid. A Democrat, in 1921 he was elected to Congress and served until 1926, when he resigned to take a Senate seat. He served in the Senate until his retirement in 1933.\n\nBibliography\n\nBooks\n\nCommons, John R., and John B. Andrews. Principles of Labor Legislation. New York: Augustus M. Kelley, 1967.\n\nConvict Labor: Model Amendments to Solve Prison Labor Competition. Washington, DC: American Federation of Labor, 1930.\n\nHallett, Michael A. \"Hawes-Cooper Act.\" In Encyclopedia of American Prisons, edited by Marilyn D. McShane and Frank P. Williams III. New York: Garland Publishing, 1996.\n\n—Lisa A. Ennis"}, {"url": "https://www.thepaper.cn/newsDetail_forward_6048584", "page_content": "图溯上海 上海老底子\n\n上海之名始于宋代，得名于吴淞江支流上海浦。1292年，上海改镇为县。\n\n1927年7月7日，上海特别市成立，标志着上海建市之始。\n\n1949年5月27日，上海解放。次日，上海市人民政府成立，上海市列为中央直辖市。上海市时辖20个市区和10个郊区，共30个区。\n\n1950年，各区人民政府成立后，党和政府对城市地区和农业地区实行不同的政策。经过对一些辖区不均的区进行合并调整，1956年上海市时辖18个区。\n\nTraced back to the Song Dynasty, Shanghai was named after a tributary of Wusong River called Shanghai Pu. In 1292, Shanghai was transformed from a town into a county.\n\nOn July 7, 1927, Shanghai Special Municipality was established, marking the beginning of Shanghai Municipality.\n\nOn May 27, 1949, Shanghai was liberated. The next day, Shanghai Municipal People's Government was established, and Shanghai was listed as a municipality directly under the central government. Shanghai had jurisdiction over 20 urban districts and 10 suburban districts at that time.\n\nIn 1950, the people's government of all districts got established, the party and the government adopted different policies for urban and agricultural areas. After some adjustment, Shanghai’s jurisdictional districts turned into 18 in 1956.\n\n1927年\n\n上海特别市成立\n\nShanghai Special Municipality established in 1927\n\n1927年7月7日，正式宣布建立“上海特别市”，直属国民政府。这是第一次把“市”作为行政区域单位确定下来，标志着上海建市之始。\n\n上海特别市拟划入上海县全境和宝山、松江、青浦、南汇四县的部分地区，共计30个区。到1928年，实际划入17个区。\n\nOn July 7, 1927, it was officially declared to establish \"Shanghai Special Municipality\", directly under the national government. This was the first time to identify the \"Municipality\" as an administrative unit, marking the beginning of Shanghai Municipality.\n\nShanghai Special Municipality planned to acquire administrative region from 30 districts，including the whole area of Shanghai County and parts of Baoshan, Songjiang, Qingpu and Nanhui County. By 1928, there were actually 17 districts.\n\n1946年\n\n按警区划分政区\n\nAdministrative districts were divided according to police regions in 1946\n\n1945年，抗日战争胜利后，市政府将南汇、奉贤、川沙、嘉定、宝山、崇明县复归江苏省，市区按警察管区来划区，以序数字将市境划分为从一到三十二共32个区，其中从一到二十为市区区，二十一到三十二为郊区区。1946年1月，由于序数字不方便记忆和使用，又以地名重新命名。\n\nIn 1945, after the victory of the war of resistance against Japan, the municipal government returned Nanhui, Fengxian, Chuansha, Jiading, Baoshan and Chongming Counties to Jiangsu Province, Shanghai’s administrative districts were divided according to police regions with numbers representing districts, 1 to 20 for the urban districts, 21 to 32 for the suburban districts. In January 1946, due to the inconvenience of the numbers to remember and use, Shanghai’s districts were renamed after their geographic names.\n\n1949年\n\n上海市人民政府成立\n\nShanghai Municipal People's Government established in 1949\n\n1950年上海市全图\n\n1950年上海市行政区划图\n\n1949年5月，上海市人民政府成立，辖20个市区和10个郊区，总人口约为540万人，其中市区人口约为450万人。\n\n1950年1月，为华东行政区代管的中央直辖市，华东军政委员会驻地。\n\n1950年上海分区街道图\n\nIn May 1949, the Shanghai Municipal People's Government was established, with 20 urban districts and 10 suburban districts under its jurisdiction. The total population is about 5.4 million, of which the urban population is about 4.5 million.\n\nIn January 1950, Shanghai was the central municipality under the administration of East China Administrative Region and the resident of East China Military and Political Commission.\n\n1952年\n\n洋泾区拆分·新市区并入江湾区\n\nYangjing District split and Xinshi District merged into Jiangwan District in 1952\n\n1951—1955年上海市行政区划图\n\n1952年9月23日，因洋泾区所辖区域较大，决定将洋泾区划分为两个区：东昌区和洋泾区。江湾、新市两郊区，决定合并为一个行政区，定名为江湾区。上海市时辖30个区（21个市区，9个郊区）。\n\nOn September 23, 1952, Yangjing District was split into two districts, Dongchang and Yangjing, due to its large jurisdiction. Two suburban districts, Jiangwan and Xinshi, got merged into an administrative region, named Jiangwan District. Shanghai had jurisdiction over 30 districts at that time (21 urban districts, 9 suburban districts).\n\n1953年\n\n共设31个区\n\n31 districts in 1953\n\n1954年上海市行政区域简图\n\n1953年11月，全市水域面积24.5平方公里，各种船只16655条，共有船民74437人，大多以船为家。为加强上海水域的民主建政，故建立水上区。管辖范围为上海市地区的主要河流包括黄浦江、苏州河及其支港。上海市时辖31个区。\n\n1954年上海市市区地图\n\nIn November 1953, Shanghai had a water area of 24.5 square kilometers, 16,655 boats and 74,437 water-side population, most of whom took boats as their residences. In order to strengthen the democratic construction of Shanghai waters, Water District was established with jurisdiction over Shanghai’s major rivers including Huangpu River, Suzhou Creek and their branches. Shanghai had jurisdiction over 31 districts at that time.\n\n1956年\n\n撤并为18个区\n\n18 districts in 1956\n\n1957年上海市全图\n\n1954年6月，撤销华东行政区，上海市由中央人民政府直辖。\n\n1956年2月，经国务院批准调整行政区划。合并调整后，全市有15个市区、3个郊区、1个水上区，共有19个区。\n\n1956年6月，水上区撤销，水上地区工作划归黄浦区暂时负责，1957年4月，水上地区分别划入邻近的陆上区管辖。上海市时辖18个区。\n\n1957年上海市区图\n\nIn June 1954, East China Administrative Region was withdrawn and Shanghai was directly under the Central People's Government.\n\nIn February 1956, the state council approved the adjustment of administrative divisions. After amalgamative adjustment, the whole city had jurisdiction over 15 urban districts, 3 suburban districts and 1 Water District.\n\nIn June 1956, Water District was withdrawn, and the administrative work on the water area was temporarily transferred to Huangpu District. In April 1957, the water area was allocated to the jurisdiction of adjacent land area. Shanghai had jurisdiction over 18 districts at that time.\n\n上海设市以来，管辖区域以城市化地区为主，兼有近郊农村地区。辖区面积狭小、人口众多，成为上海发展经济、改善民生的瓶颈。\n\n1958年1月和11月，国务院批准将历史上与上海关系密切的上海等10个县，从江苏省相继划入上海市。这是上海建市以来规模最大的一次行政区划调整，奠定了今天上海市行政区域范围的基础。\n\n1964年，通过行政区划调整，上海市时辖10个市区和10个郊县，共20个区县，这种状况一直保持到1979年。\n\nSince the establishment of Shanghai Municipality, the jurisdiction regions were mainly urban areas, and also some suburban areas. Its small area and large population made it a bottleneck for Shanghai to develop economy and improve people's livelihood.\n\nIn January and November 1958, the state council approved the transfer of 10 counties, including Shanghai County, which had close relations with Shanghai in history, to Shanghai Municipality from Jiangsu Province. This was the largest administrative division adjustment since the establishment of Shanghai Municipality, laying the foundation of Shanghai’s administrative area in today.\n\nIn 1964, through the adjustment of administrative divisions, Shanghai had jurisdiction over 10 urban districts and 10 suburban districts. This remained the case until 1979.\n\n1958年\n\n江苏10县划归上海\n\n10 counties in Jiangsu Province transferred to Shanghai in 1958\n\n1958年上海市全图\n\n1958年1月17日，国务院批准将江苏省的嘉定、宝山、上海3县划归上海市。\n\n1958年11月21日，国务院批准将江苏省的川沙、青浦、南汇、松江、奉贤、金山、崇明7县划归上海市。\n\nOn January 17, 1958, the State Council approved the transfer of Jiading, Baoshan and Shanghai Counties in Jiangsu Province to Shanghai Municipality.\n\nOn November 21, 1958, the State Council approved the transfer of Chuansha, Qingpu, Nanhui, Songjiang, Fengxian, Jinshan and Chongming Counties in Jiangsu Province to Shanghai Municipality.\n\n1958年\n\n浦东县设立\n\nPudong County established in 1958\n\n1958年浦东县全图\n\n1958年10月，经国务院批准，撤销西郊区、北郊区、东昌区、东郊区，设立浦东县。1958年底，全市有14个区，139个街道；11个县，175个乡，33个县属镇。\n\n1958年上海市地图\n\nIn October 1958, with the approval of the State Council, Pudong County was established by withdrawing the Xijiao District, Beijiao District, Dongchang District and Dongjiao District. By the end of 1958, Shanghai had 14 districts and 139 subdistricts, 11 counties, 175 townships and 33 county-affiliated towns.\n\n1960年\n\n市区撤并·闵行区、吴淞区设立\n\nMinhang District and Wusong District established in 1960\n\n1960年上海市市区简图\n\n1960年上海市市区图\n\n1960年1月，撤销蓬莱、邑庙2区，设立南市区。撤销江宁、新成2区，重建静安区。撤销提篮桥区，并入虹口区。撤销榆林区，并入杨浦区。析上海县闵行、吴泾地区置闵行区；析宝山县吴淞地区置吴淞区。上海市时辖12个区和11个县，共23个区县。\n\nIn January 1960, the district of Penglai and Yimiao were withdrawn and Nanshi District was established, the district of Jiangning and Xincheng were withdrawn to reestablish Jing 'an District. Tilanqiao District was merged into Hongkou District, and Yulin District into Yangpu District. Minhang and Wujing area in Shanghai County were allocated to establish Minhang District, Wusong area in Baoshan County was allocated to establish Wusong District. Shanghai had jurisdiction over 12 districts and 11 counties at that time.\n\n1961年\n\n浦东县撤销·嵊泗短期划入\n\nPudong County withdrawn and Shengsi People's Commune included in 1961\n\n1961年上海市地图\n\n1961年1月，经国务院批准，撤销浦东县，其城市化地区并入黄浦、南市、杨浦3区，农村地区并入川沙县。上海市时辖12个区、10个县，共22个区县。\n\n1961年3月，浙江省舟山县的嵊泗人民公社划归上海，第二年5月又复划归浙江省。\n\nIn January 1961, with the approval of the State Council, Pudong County was withdrawn with the urbanized areas were merged into Huangpu, Nanshi and Yangpu Districts, and the rural areas were merged into Chuansha County. Shanghai had jurisdiction over 12 districts and 10 counties at that time.\n\nIn March 1961, Shengsi People's Commune in Zhoushan County, Zhejiang Province was transferred to Shanghai, while in May of the following year to Zhejiang Province again.\n\n1964年\n\n吴淞区、闵行区撤销·10区10县格局形成\n\nWusong District and Minhang District withdrawn in 1964\n\n1964年上海市市区图\n\n1964年5月，经国务院批准，撤销吴淞、闵行区，其行政区域分别并入杨浦区和徐汇区。至此，全市共有10个市区和10个郊县，共20个区县。这样的行政建制在以后16年中保持相对的稳定。这一年上半年，全市共有111个街道，197个人民公社，2822个生产大队。年底，街道调整为103个。\n\n1965年上海市全图\n\nIn May 1964, with the approval of the State Council, Wusong District and Minhang District were withdrawn, and their administrative areas were merged into Yangpu District and Xuhui District respectively. So far, Shanghai had jurisdiction over 10 districts and 10 counties, and this remained the case for the following 16 years. In the first half of this year, Shanghai had 111 subdistricts, 197 people's communes and 2,822 production brigades. By the end of the year, the number of subdistricts was adjusted to 103.\n\n1966年\n\n松江、金山、奉贤部分公社、大队调整\n\nAdjustments in communes and brigades in 1966\n\n1969年松江县泖港公社图\n\n1966年10月，松江县山阳、漕泾、朱行、亭新、枫围5个公社和枫泾、亭林2个镇，以及张泽公社南部的金明、津星2个大队划归金山县；金山县泖港公社划归松江县；松江县漕泾公社黄沙、花园、南迎龙3个大队划归奉贤县。\n\n1972年上海市地图\n\nIn October 1966, five communes including Shanyang, Caojing, Zhuhang, Tingxin and Fengwei in Songjiang County, Fengjing Town and Tinglin Town, and two brigades including Jinming and Jinxing in the south of Zhangze Commune were allocated to Jinshan County. Maogang Commune in Jinshan County was allocated to Songjiang County. Three brigades including Huangsha, Huayuan and Nanyinglong in Caojing Commune, Songjiang County were allocated to Fengxian County.\n\n1978年改革开放后，工作重心转移到经济建设。为理顺城乡管理体制，加快区域经济发展，于1980年和1981年先后恢复设立吴淞区和闵行区。\n\n随着城乡一体化进程加快，郊县开始撤县设区，吴淞区、宝山县于1988年合并为宝山区，闵行区和上海县于1992年合并为新的闵行区，嘉定区也于同年设立。\n\n为深化改革，进一步实行对外开放的重大部署，1990年4月，党中央、国务院宣布开发开放浦东的战略决策。国务院于1992年10月批复撤销川沙县建制，将其与黄浦、南市、杨浦3个区的浦东部分和原上海县三林乡合并，设立浦东新区。1993年1月1日，浦东新区管理委员会揭牌成立。\n\nAfter the reform and opening up in 1978, the focus of our work shifted to economic construction. In order to straighten out the urban and rural management system and speed up the regional economic development, Wusong District and Minhang District were restored in 1980 and 1981 respectively.\n\nWith the acceleration of the process of urban-rural integration, suburban counties began to be transfromed into districts. Wusong District and Baoshan County were merged into Baoshan District in 1988, Minhang District and Shanghai County were merged into a new Minhang District in 1992, and Jiading District was established at the same year.\n\nIn order to deepen reform and further implement the opening up strategy, in April 1990, the Party Central Committee and the State Council announced the strategic decision of opening up Pudong. In October 1992, the State Council approved the withdrawal of Chuansha County and merging it with the area east of Huangpu River in Huangpu, Nanshi, Yangpu Districts and Sanlin Township of Shanghai County to establish Pudong New Area. On January 1, 1993, Pudong New Area Management Committee was inaugurated.\n\n1980年\n\n吴淞区恢复\n\nWusong District restored in 1980\n\n1981年上海市市区图和吴淞区附图\n\n1980年10月，经国务院批准，恢复吴淞区建制。将宝钢地区办事处行政区域和宝山县部分行政区域为其行政区域。1984年9月，又将石洞口发电厂厂区划归吴淞区。上海市时辖11个区、10个县，共21个区县。\n\n1981年吴淞区地图\n\nIn October 1980, the State Council approved the restoration of Wusong District with the administrative region of Baosteel office and part of the administrative region of Baoshan County as its administrative region. In September 1984, the area of Shidongkou power plant was allocated to Wusong District. Shanghai had jurisdiction over 11 districts and 10 counties at that time.\n\n1981年\n\n闵行区恢复\n\nMinhang District restored in 1981\n\n1982年闵行区地图\n\n1981年2月，经国务院批准，恢复闵行区建制。其行政区域包括闵行、吴泾地区和原上海县的15个大队。上海市时辖12个区、10个县，共22个区县。\n\n1987年上海政区图\n\nIn February 1981, the State Council approved the restoration of Minhang District with the areas of Minhang, Wujing and 15 brigades in the former Shanghai County as its the administrative region. Shanghai had jurisdiction over 12 districts and 10 counties at that time.\n\n1988年\n\n吴淞区、宝山县“撤二建一”\n\nBaoshan District established in 1988\n\n1987年宝山县政区图\n\n1988年1月21日，为统一规划建设，促进城乡一体化，经国务院批准，撤销吴淞区、宝山县，建立宝山区。上海市时辖12个区、9个县，共21个区县。\n\n宝山县区划变迁示意图（1724—1988年）\n\nOn January 21, 1988, in order to unify the planning and construction and promote the integration of urban and rural areas, the State Council approved the withdrawal of Wusong District and Baoshan County and the establishment of Baoshan District. Shanghai had jurisdiction over 12 districts and 9 counties at that time.\n\n1992年\n\n上海县、闵行区“撤二建一”\n\nMinhang District enlarged in 1992\n\n1988年上海县政区图\n\n1992年9月26日，为理顺城乡管理体制，加快区域经济发展，逐步形成城市中心区、郊区和县三个管理层次，经国务院批准，撤销上海县、闵行区，建立新的闵行区。上海市时辖12个区、8个县，共20个区县。\n\n1994年上海市闵行区地图\n\nOn September 26, 1992, in order to straighten out the urban and rural management system, speed up the regional economic development, and gradually form three administrative levels of urban center, suburb and county, the State Council approved the withdrawal of Shanghai County and Minhang District and the establishment of a new Minhang District. Shanghai had jurisdiction over 12 districts and 8 counties at that time.\n\n1992年\n\n嘉定撤县设区\n\nJiading transformed from county to district in 1992\n\n1986年嘉定县地图\n\n1992年10月11日，随着嘉定县城市化进程的加快，已形成既有城市又有农村的新格局，需要建立一个兼具城市和农村两种管理职能的新区体制与之适应。经国务院批准，撤销嘉定县，建立嘉定区。上海市时辖13个区、7个县，共20个区县。\n\n1995年嘉定区地图\n\nOn October 11, 1992, with the acceleration of the urbanization in Jiading County, a new pattern with both urban and rural features had been formed, it was necessary to establish a new district system with both urban and rural management functions. With the approval of the State Council, Jiading County was transformed to Jiading District. Shanghai had jurisdiction over 13 districts and 7 counties at that time.\n\n1992年\n\n浦东新区设立\n\nPudong New Area established in 1992\n\n1985年川沙县行政区划图\n\n随着浦东开发开放进入实质性启动阶段，1992年10月11日，经国务院批准，撤销川沙县，将黄浦、南市、杨浦三区的浦东部分和上海县三林乡，从原所属区、县中划出，与原川沙县全境合并，设立浦东新区。1993年1月1日，浦东新区管理委员会揭牌成立。上海市时辖14个区、6个县，共20个区县。\n\n1994年上海浦东新区图\n\nWith the development and opening up of Pudong, on October 11, 1992, the State Council approved the withdrawal of Chuansha County, merging it with the area east of Huangpu River in Huangpu, Nanshi, Yangpu Districts and Sanlin Township of Shanghai County to establish Pudong New Area. On January 1, 1993, Pudong New Area Management Committee was inaugurated. Shanghai had jurisdiction over 14 districts and 6 counties at that time.\n\n在浦东开发的带动下，上海经济快速发展，城市化率不断提高，城市布局结构继续调整。为促进市区和郊区经济社会同步发展，金山、松江、青浦、奉贤、南汇和崇明先后于1997年至2016年间撤县设区，县级行政建制在上海成为历史，上海城市发展进入新阶段。\n\n为进一步提升和完善中心城区的城市功能，提高行政效能，黄浦区在2000年和2011年两次“撤二建一”，成为新的黄浦区，行政区域覆盖原南市区和卢湾区范围。静安区和闸北区也于2015年实现强强联合、优势互补，通过“撤二建一”成为新的静安区。\n\n2009年，为提升浦东开发国家战略的承载能力，提供转型发展新空间，国务院批准撤销南汇区，将其行政区域并入浦东新区。\n\n至2019年，上海市辖有浦东新区和黄浦、徐汇、长宁、静安、普陀、虹口、杨浦、闵行、宝山、嘉定、金山、松江、青浦、奉贤、崇明16个区。\n\nDriven by the development of Pudong, Shanghai has witnessed rapid economic development and increasing urbanization rate, so the urban layout structure keeps adjusting continuously. In order to promote the synchronous economic and social development of the urban and suburban areas, Jinshan, Songjiang, Qingpu, Fengxian, Nanhui and Chongming were successively transformed from counties to districts from 1997 to 2016. The county-level administrative system has become a history in Shanghai, and Shanghai's urban development has entered a new stage.\n\nIn order to further improve the urban function of the central urban area and improve the administrative efficiency, Huangpu District went through twice area adjustment in 2000 and 2011, and became a new Huangpu District with the administrative area covering the former Nanshi District and Luwan District. A new Jing 'an District was also established by merging the former Jing 'an District and Zhabei District.\n\nIn 2009, in order to enhance the capacity of Pudong to fulfill the national strategy and provide new space for transformation and development, the State Council approved to withdraw Nanhui District and merge its administrative area into Pudong New Area.\n\nBy 2019, Shanghai has jurisdiction over 16 districts including Pudong New Area, Huangpu, Xuhui, Changning, Jing 'an, Putuo, Hongkou, Yangpu, Minhang, Baoshan, Jiading, Jinshan, Songjiang, Qingpu, Fengxian and Chongming.\n\n1997年\n\n金山撤县设区\n\nJinshan transformed from county to district in 1997\n\n2005年金山区政区图\n\n20世纪90年代后期，为促进市区和郊区经济社会同步发展，也为上海南翼发展，从体制上打下一个很好的基础，经国务院批准，1997年4月29日，撤销金山县，设立金山区。上海市时辖15个区、5个县，共20个区县。\n\n1988年上海市金山县行政区划图\n\nIn the late 1990s, with the approval of the State Council, Jinshan transformed from county to district on April 29, 1997 in order to promote the synchronous economic and social development of the urban and suburban areas and the development of the southern wing of Shanghai. Shanghai had jurisdiction over 15 districts and 5 counties at that time.\n\n1998年\n\n松江撤县设区\n\nSongjiang transformed from county to district in 1998\n\n2005年松江区政区图\n\n1998年2月27日，国务院批准撤销松江县，设立松江区，以原松江县的行政区域为松江区的行政区域。上海市时辖16个区、4个县，共20个区县。\n\n1995年松江县地图\n\nOn February 27, 1998, the State Council approved the withdrawal of Songjiang County and the establishment of Songjiang District with the former administrative region of Songjiang County as the administrative region of Songjiang District. Shanghai had jurisdiction over 16 districts and 4 counties at that time.\n\n1999年\n\n青浦撤县设区\n\nQingpu transformed from county to district in 1999\n\n2005年青浦区政区图\n\n1999年9月16日，经国务院批准，撤销青浦县，设立青浦区。上海市时辖17个区、3个县，共20个区县。\n\n1999年青浦县政区图\n\nOn September 16, 1999, the State Council approved the withdrawal of Qingpu County and the establishment of Qingpu District. Shanghai had jurisdiction over 17 districts and 3 counties at that time.\n\n2000年\n\n黄浦区、南市区“撤二建一”\n\nNanshi District merged into Huangpu District in 2000\n\n2005年黄浦区政区图\n\n2000年6月13日，为改善中心城区的区域布局，推进建设具有世界一流水平的现代化城市格局，经国务院批准，撤销黄浦区和南市区，设立新的黄浦区。上海市时辖16个区、3个县，共19个区县。\n\n1999年上海市黄浦区地图\n\nOn June 13, 2000, in order to improve the regional layout of the central urban area and promote the construction of a world-class modern urban layout, Huangpu District and Nanshi District were withdrawn and a new Huangpu District was established with the approval of the State Council. Shanghai had jurisdiction over 16 districts and 3 counties at that time.\n\n2001年\n\n奉贤撤县设区\n\nFengxian transformed from county to district in 2001\n\n2005年奉贤区政区图\n\n2001年1月9日，经国务院批准，撤销奉贤县，设立奉贤区。奉贤撤县设区，标志着奉贤经济建设和城市建设将进入一个新的发展阶段。上海市时辖17个区、2个县，共19个区县。\n\n1999年奉贤县地图\n\nOn January 9, 2001, the State Council approved the withdrawal of Fengxian County and the establishment of Fengxian District, which marked that the economic and urban construction in Fengxian would enter into a new stage. Shanghai had jurisdiction over 17 districts and 2 counties at that time.\n\n2001年\n\n南汇撤县设区\n\nNanhui transformed from county to district in 2001\n\n2005年南汇区政区图\n\n2001年1月9日，经国务院批准，撤销南汇县，设立南汇区。南汇撤县设区，标志着南汇的历史揭开了新的一页，南汇的发展拉开了新的序幕。上海市时辖18个区、1个县，共19个区县。\n\n1985年南汇县政区图\n\nOn January 9, 2001, the State Council approved the withdrawal of Nanhui County and the establishment of Nanhui District, which symbolized that Nanhui would open a new page in its history. Shanghai had jurisdiction over 18 districts and 1 county at that time.\n\n2005年\n\n长兴乡、横沙乡划入崇明县\n\nChongming County enlarged in 2005\n\n2005年崇明县政区图\n\n2005年5月18日，为实现“三岛”统一规划、资源整合、优势互补、联动发展，充分发挥区位优势，经国务院批准，将宝山区的长兴乡、横沙乡划入崇明县管辖。\n\n1986年崇明县行政区划图\n\n1999年宝山区地图\n\nOn May 18, 2005, in order to realize the unified planning of \"three islands\", resource integration, advantage complementation and interactive development, and give full play to the geographical advantages, Changxing Township and Hengsha Township in Baoshan District were allocated to Chongming County with the approval of the State Council.\n\n2009年\n\n南汇区并入浦东新区\n\nNanhui District merged into Pudong New Area in 2009\n\n2005年浦东新区政区图\n\n2009年4月24日，为进一步加大区域资源整合力度，为浦东经济转型、产业升级提供容量和平台，打造上海承载国家战略目标建设的核心区，经国务院批准，撤销南汇区，将其行政区域并入浦东新区。上海市时辖17个区、1个县，共18个区县。\n\n2008年浦东新区行政区划图和2008年南汇区地图\n\nOn April 24, 2009, in order to further strengthen the integration of regional resources, provide capacity and platform for Pudong's economic transformation and industrial upgrading, and create a core area for Shanghai to fulfill national strategic goals, Nanhui District was withdrawn and its administrative region was merged into Pudong New Area with the approval of the State Council. Shanghai had jurisdiction over 17 districts and 1 county at that time.\n\n2011年\n\n黄浦区、卢湾区“撤二建一”\n\nLuwan District merged into Huangpu District in 2011\n\n2012年黄浦区行政区划图\n\n2011年5月20日，为开拓中心城区发展空间，使沿江规划的实施更加整体划一，并提高行政效能，经国务院批准，撤销黄浦区和卢湾区，设立新的黄浦区。上海市时辖16个区、1个县，共17个区县。\n\n2011年黄浦区地图和2004年卢湾区地图\n\nOn May 20, 2011, in order to open up the development space of the central urban area, make the implementation of the plan along the river more integrated, and improve the administrative efficiency, Huangpu District and Luwan District were withdrawn and a new Huangpu District was established with the approval of the State Council. Shanghai had jurisdiction over 16 districts and 1 county at that time.\n\n2015年\n\n静安区、闸北区“撤二建一”\n\nZhabei District merged into Jing’an District in 2015\n\n2015年静安区行政区划图\n\n2015年10月13日，为进一步优化城市布局，更好的提升城市功能，促进区域协调可持续发展，实现强强联合、优势互补，经国务院批准，撤销静安区和闸北区，设立新的静安区。上海市时辖15个区、1个县，共16个区县。\n\n2014年闸北区行政区划图和2013年静安区行政区划图\n\nOn October 13, 2015, in order to further optimize the urban layout, better improve the urban function, promote the coordinated and sustainable development, and realize advantage complementation, Jing 'an District and Zhabei District were withdrawn and a new Jing 'an District was established with the approval of the State Council. Shanghai had jurisdiction over 15 districts and 1 county at that time.\n\n2016年\n\n崇明撤县设区\n\nChongming transformed from county to district in 2016\n\n2017年崇明区政区图\n\n2016年7月22日，为更好的落实国家发展战略，推动长三角和长江经济带加快发展，加快崇明生态岛建设，经国务院批准，撤销崇明县，设立崇明区。上海市时辖16个区。崇明撤县设区标志着县级行政建制在上海成为历史，上海城市发展进入新阶段。\n\n2009年崇明县行政区划图\n\nOn July 22, 2016, in order to better implement the national development strategy, accelerate the development of the Yangtze River Delta and Yangtze River Economic Belt, and accelerate the construction of Chongming ecological island, Chongming was transformed from county to district with the approval of the State Council. So Shanghai had jurisdiction over 16 districts at that time, and it symbolized that the county-level administrative system being a history in Shanghai, and Shanghai's urban development entering a new stage.\n\n2019年\n\n上海市行政区划\n\nShanghai administrative districts in 2019\n\n2019年上海市行政区划图\n\n2019年，上海市时辖黄浦区、徐汇区、长宁区、静安区、普陀区、虹口区、杨浦区、闵行区、宝山区、嘉定区、浦东新区、金山区、松江区、青浦区、奉贤区、崇明区，共计16个区。\n\n上海将继续优化城市空间布局，落实主体功能区战略，扩大生态空间、保障农业空间、优化城镇空间。上海将努力建设成为卓越的全球城市、具有世界影响力的社会主义现代化国际大都市。\n\n2019年上海市中心城区行政区划图\n\nIn 2019, Shanghai has jurisdiction over 16 districts, including Huangpu, Xuhui, Changning, Jing 'an, Putuo, Hongkou, Yangpu, Minhang, Baoshan, Jiading, Pudong, Jinshan, Songjiang, Qingpu, Fengxian and Chongming.\n\nShanghai will continue to optimize urban spatial layout, implement the strategy of functional zones, expand ecological space, guarantee agricultural space and optimize urban space. Shanghai will strive to become an outstanding global city and a modern socialist metropolis with global influence.\n\n编辑丨张渊源\n\n审核丨吕艳红\n\n来源：图溯上海\n\n上海老底子\n\n每天为侬送上精彩文章一组\n\n打开尘封的记忆，寻觅往昔的岁月\n\n叙上海老底子事\n\n忆上海老底子人\n\n诉上海老底子情\n\n以史明志，以启未来\n\n原标题：《地图文化之旅——上海市行政区划的变迁（中英对照）》\n\n阅读原文"}]}