{"Dara Grace Torres competed in the 50-meter freestyle event at the 2008 Olympics.": [{"url": "https://olympics.com/en/athletes/dara-torres", "page_content": "Biography\n\nDara Torres had the longest successful career of any Olympic swimmer, one which saw her win 12 Olympic medals and four gold medals. Torres began her career in 1984, winning a gold medal in the 4×100 freestyle relay. She added a silver and bronze in relays in 1988, and seemingly ended her swimming career with another gold in the 4×100 free relay in 1992. Tall and strikingly attractive, Torres then began a career as a model, becoming the first athlete to appear in Sports Illustrated’s swimsuit issue. She also achieved notice as a commercial spokeswoman on an infomercial for a fitness training method. But in late 1998, she elected to return to competitive swimming. With little time to prepare, she returned to the Olympic pool at Sydney, and won five medals, including two golds in relays. She won three individual bronze medals at Sydney – in the 50 free, the 100 free, and the 100 fly.\n\nAgain retiring after the 2000 Olympics, Torres did not compete in Athina. But in 2006 she began training to make another Olympic team and made the US team for Beijing, winning the Olympic Trials in both the 50 and 100 metre freestyle. But she elected to compete in Beijing only in the 50 and the 4×100 freestyle and medley relays. Aged 41, the oldest ever female Olympic swimmer, Torres won a silver medal in the 50 free, defeated by only 1/100th of a second. She added silver medals in both relays. Torres finished her Olympic career lacking only an individual gold medal. She swam through 2012, but just missed out making the US Olympic team for the London Olympics. Torres won four Olympic medals of each color, one of only three Olympians to have won four or more medals of each type (Takashi Ono of Japan, and Larisa Latynina in gymnastics are the others)."}, {"url": "https://www.wbur.org/hereandnow/2021/02/22/dara-torres-olympic-swimmer", "page_content": "Swimmer Dara Torres won 12 Olympic medals over a nearly 25-year span from age 17 to 41.\n\nBut success in the pool early on in her career hid struggles with a serious eating disorder. Torres talks about that in-depth for the first time in a documentary that airs on the SEC Network on Monday called “Once Upon A Comeback.”\n\nAs a swimmer at the University of Florida during the ‘80s, Torres says she faced pressure from coaches, particularly Randy Reese, to lose weight. At the time, the coaches didn’t know a lot about eating disorders, she says.\n\nOne coach wanted the team to look intimidating to competitors on the starting blocks and set a weight goal for the swimmers to meet, she says. If someone didn’t make weight, they had to do extra workouts.\n\n“For me personally, having come from a background where I've never trained like that before in my life, to have to do extra workouts was just, that wasn't going to happen for me,” she says. “And one thing led to another. I sort of got in this habit of bingeing and purging in my freshman year, and that's kind of how it all started and just sort of snowballed from there.”\n\nThe coaches weighed the girls right on the pool deck, as Torres describes in the film, and sometimes the swimmers would break down in tears if they didn't make weight. The intense pressure to make weight came from an inner desire to please her coaches, she says.\n\nThe cycle of bingeing and purging took over Torres’ life and psyche — but now she views the difficult experience as a lesson.\n\n“It was obviously a very dark time in my life and I wouldn't wish that upon my worst enemy,” she says. “But yet I learned a lot from it and it made me the person who I am today.”\n\nTorres says she tried talking to a male team doctor at the university about her struggles, but the conversation ended with him handing her information on eating disorders.\n\nAfter she graduated college, she went to get a physical and the doctor asked her if she’s ever binged and purged. Torres said no, but later called the doctor back and admitted she had a problem.\n\nThe first step to recovery was opening up about her disorder, she says. Her advice to people struggling with eating disorders is to talk about it.\n\n“I knew I had a lot of work to do after that but it was a huge relief to get it off my shoulders after four years of only me knowing that I had this issue,” she says.\n\nTorres swam in the Olympics in Seoul in 1988, Barcelona in 1992, Sydney in 2000 and Beijing in 2008. When the time to train for Beijing arrived, Torres was pregnant, in her 40s and swimming for exercise.\n\nShe says she received invitations to swim in a few meets, and then people started to ask, “Wouldn't it be great to see a middle-aged person in the Olympic Games?” Since she loves a challenge, Torres decided to go for gold once again.\n\nThe swimmer ended up winning three silver medals in Beijing. As she trained, Torres kept the goal of winning a gold medal in her head.\n\n“I kept that thought with me every single day for the almost two years after that I trained for the Olympic trials and Olympic Games,” she says. “And I really think the power of positive thinking can play a role in what you do in your life.”\n\nInterview Highlights\n\nOn how she started swimming\n\n“Well, I have four older brothers, and I was very competitive the minute I was born. It's like, who could be the first one in the car? Who could be the first one done at the dinner table? Just always competing with them. Whatever they would do, I would do. So the minute they started on a swim team, my mom had me in the stands. That didn't go very well because I had a lot of energy. And I think back then they called it hyperactivity, but I'm sure I had ADD. And she put me in the pool just to get the energy out and not have it all around her and just focus it somewhere. So I started swimming and just fell in love with the sport.”\n\nOn whether swimming came easy to her\n\n“It really did. I really could just get up on the starting blocks and do the start into the water and swim fast and no big deal. And I think that all changed when I started to notice changes in my body, started to become more of a woman, and realized that I actually have to work hard to be fast. It just doesn't come easy anymore. “\n\nOn if she left the sport satisfied after she didn’t qualify for a sixth Olympic team in 2012\n\n“I really did. It's funny because when I got out of the pool after those Olympic trials and I missed the team by nine one-hundredths of a second, I looked in the stands. I saw my daughter crying and I saw my mom crying. I'm like, ‘Oh, my gosh, I have to go over and console them.’ And, you know, my mom, obviously, she was upset because she's my mom and she wanted to see me make another Olympic team, but my daughter, I'm like, ‘Tessa, What's wrong? Are you OK?’ She's like, ‘Now I don't get to go to London and see Michael Phelps and Ryan Lochte.’ I'm like, oh, my gosh, she's starting way too early, you know? So it was kind of funny. It was a little bit of a role reversal of, you know, me having to console my mom. But I was OK. I knew that the time that I did Olympic trials, my sixth Olympic trials, was the second-fastest time I've ever done at trials. But the girls are getting faster and I couldn't give it anything else. I gave it all I had.”\n\nOn what she tells her daughter about body image and her experience with eating disorders\n\n“I continuously tell her how beautiful she is on the inside and out and not to base everything off of food. And just to make sure that when you want to eat stuff that, you know, you're maybe not supposed to have, eat it in smaller portions and you'll be fine.”\n\nAlex Ashlock produced and edited this interview for broadcast with Todd Mundt. Allison Hagan adapted it for the web."}, {"url": "https://kids.britannica.com/students/article/Dara-Torres/633680", "page_content": "Tony Duffy—Allsport/Getty Images\n\n(born 1967). American swimmer Dara Torres won 12 career Olympic medals, 4 of which were gold. Her 12 medals tied a record for the most won by a female Olympian from the United States. Celebrated for her longevity in swimming, Torres was the first American swimmer to compete at five Olympic Games. In 2008, at the age of 41, she became the oldest swimming medalist in Olympic history.\n\nTorres was born on April 15, 1967, in Beverly Hills, California. She was Cuban American. When she was growing up, her older brothers swam at their local YMCA, and at age seven she followed them into the sport. A prodigy in the pool, she began setting national age-group records when she was 12 years old. At age 14 she claimed her first senior national title, winning the 50-yard freestyle race at the Senior Short Course Nationals. In 1983 she twice set world records in the long-course 50-meter freestyle event. The following year she lowered the world record once more, to 25.61 seconds, and qualified for her first Olympics. At the 1984 Games in Los Angeles, California, she helped the U.S. 4 × 100-meter freestyle relay team win the gold medal and establish a new American record with a time of 3 minutes, 43.43 seconds.\n\nAfter graduating from high school in 1985, Torres attended the University of Florida. As a collegiate swimmer she garnered 28 National Collegiate Athletic Association (NCAA) All-American honors. She was named the NCAA Swimmer of the Year in 1988. That year she competed at the Olympics in Seoul, South Korea, where she earned a silver medal in the 4 × 100-meter medley relay and a bronze medal in the 4 × 100-meter freestyle relay. She returned to the Olympics four years later. At the 1992 Games in Barcelona, Spain, she captured gold again in the 4 × 100-meter freestyle relay. This time Torres and her teammates set a world record in the event, finishing in 3 minutes, 39.46 seconds.\n\nFollowing the Barcelona Games, Torres took a long break from competitive swimming. She worked in television broadcasting for a number of years. In 1999, however, she resumed training, with an eye toward qualifying for the 2000 Olympics in Sydney, Australia. At the 2000 U.S. Olympic Trials she proved that she remained a force, winning the 50-meter freestyle and finishing second behind Jenny Thompson in both the 100-meter freestyle and the 100-meter butterfly. At the Sydney Games, the following month, Torres enjoyed her most successful Olympics, securing five medals. She won gold in the 4 × 100-meter freestyle relay and the 4 × 100-meter medley relay. In individual competition she took home the bronze in the 50-meter freestyle and the 100-meter butterfly. She also tied Thompson for the bronze in the 100-meter freestyle.\n\nTorres again stepped away from competition after the Sydney Games. She resumed her broadcasting career, and in 2006 she gave birth to a daughter, Tessa. Following her pregnancy she took part in a couple of masters swimming events (for older competitive swimmers). Her impressive performances at those meets convinced her to make a bid for her fifth Olympic Games. At the 2008 Olympic Trials she won the 50-meter freestyle, thus becoming the oldest swimmer ever to qualify for the U.S. Olympic team. Torres went on to win three silver medals at the 2008 Games in Beijing, China (50-meter freestyle, 4 × 100-meter freestyle relay, 4 × 100-meter medley relay). In addition to becoming the oldest swimmer to medal at an Olympics, Torres moved into a tie with Thompson as the most decorated female American Olympian (their record of 12 career Olympic medals was later equaled by American swimmer Natalie Coughlin).\n\nIn 2012 Torres placed fourth in the 50-meter freestyle at the U.S. Olympic Trials, coming up short in her attempt to make her sixth Olympic team. She announced her retirement from swimming after the trials. Torres was inducted into the International Swimming Hall of Fame in 2016 and the U.S. Olympic & Paralympic Committee Hall of Fame in 2019."}, {"url": "https://www.ishof.org/honoree/honoree-dara-torres/", "page_content": "Dara Torres (USA) Honor Swimmer (2016)\n\nThe information on this page was written the year of their induction.\n\nFOR THE RECORD: 1984 OLYMPIC GAMES: gold (4×100 m freestyle); 1988 OLYMPIC GAMES: silver (4×100 m medley), bronze (4×100 m freestyle); 1992 OLYMPIC GAMES: gold (4×100 m freestyle); 2000 OLYMPIC GAMES: gold (4×100 m freestyle, 4×100 m medley), bronze (50 m freestyle, 100 m freestyle, 100 m butterfly); 2008 OLYMPIC GAMES: silver (50 m freestyle, 4×100 m freestyle, 4×100 m medley); 1986WORLD CHAMPIONSHIPS (LC): silver (4×100 m freestyle); 1987 PAN PACIFIC CHAMPIONSHIPS: gold (100 m freestyle, 4×100 m freestyle, 4×100 m medley); 1983 PAN AMERICAN GAMES: gold (4×100 m freestyle); SIX WORLD RECORDS: three individual (50m free), three relays (4x100m free, 4x100m medley)\n\nDara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4×100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time – an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}, {"url": "https://www.swimmingworldmagazine.com/hall-of-fame/bio/swimmer/dara-torres", "page_content": "Dara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4x100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\n\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time - an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}, {"url": "https://www.nytimes.com/2008/08/17/sports/olympics/17pool.html", "page_content": "BEIJING \u0097 Dara Torres had just become the oldest swimmer to win an Olympic silver medal, but her body language was still apologetic as she climbed out of the pool Sunday alongside rivals young enough to be her daughters.\n\n“One hundredth,” Torres said, shrugging her broad shoulders as she smiled at a group of supporters in the stands at the Water Cube. She later cried in a news conference.\n\nIt was testimony to how driven Torres was in her unlikely and ultimately successful quest to return to the Olympics. At 41, she did not just believe in her chances to take part in the Games, she believed in her chances to win.\n\nShe had concentrated the bulk of her energy on this 50-meter freestyle, withdrawing from the 100 freestyle before the Games to focus on what she perceived as her best chance. She had qualified for the final with the fastest time and earned the right to start in Lane 4."}, {"url": "https://cubansinamerica.us/web/prominent-cuban-americans/sports/dara-torres/", "page_content": "Dara Torres was born on April 15, 1967, the daughter of Edward Torres (originally from Cuba) and Marylu Kauder.\n\nShe is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women’s swimming medals.\n\nTorres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network. She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition.\n\nShe is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years. She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick). Torres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors."}, {"url": "https://www.jewage.org/wiki/en/Article:Dara_Torres_-_Biography", "page_content": "Dara Grace Torres (born April 15, 1967) is an American international swimmer and a twelve-time Olympic medalist. Torres was the first swimmer from the United States to compete in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, the oldest swimmer ever to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4x100-meter medley relay, and 4x100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won twelve Olympic medals (four gold, four silver, four bronze), five of which she won in the 2000 Summer Olympics, when at age 33, she was the oldest member of the 2000 U.S. Olympic Swim Team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nOn August 1, 2007, at age 40 (just 15 months after giving birth to her first child), she won gold in the 100-meter freestyle at the U.S. Nationals in Indianapolis, her 14th national championship. On August 4, she broke her own American record in the 50-meter freestyle, 26 years after she first set the American record at just 15 years old.\n\nEarly life and education\n\nTorres was born in Beverly Hills, California, the daughter of Edward Torres and Marylu Kauder. She grew up in Los Angeles, California, the fifth of six children and the older of two girls. At age 7, Torres started following her brothers to swim practice at the local Y.M.C.A. and later joined the Culver City swim team.\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School), and swam for the Westlake swim team under coach Darlene Bible, where she set California Interscholastic Federation records that remain to this day. As a teenager in the 1980s, she swam for the Mission Viejo Nadadores, in Mission Viejo, California, under coach Mark Schubert, the 2008 Olympic swimming coach.\n\nTorres received an athletic scholarship to attend the University of Florida in Gainesville, Florida, where she swam for the Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) competition under coach Randy Reese from 1985 to 1989. In her four years as a Gator swimmer, Torres won nine Southeastern Conference (SEC) championships and nine NCAA championships, including the 400-meter freestyle relay in 1986; the 50-meter freestyle, 100-meter freestyle, 100-meter butterfly, 200-meter medley relay, 400-meter medley relay and 400-meter freestyle relay in 1988; and the 200-meter medley relay and 400-meter medley relay in 1989. At Florida, she was named the SEC Athlete of the Year in 1988, and earned twenty-eight All-American swimming honors—the maximum number possible during a college career.\n\nTorres graduated from Florida with a bachelor's degree in telecommunications in 1990, and was inducted into the University of Florida Athletic Hall of Fame as a \"Gator Great\" in 1999.\n\nOlympic career\n\n1984 Summer Olympics\n\nAt the 1984 Summer Olympics in Los Angeles, California, Torres was a member of the winning U.S. women's 4x100-meter relay team, earning a gold medal for swimming in the first-round qualifying heat as well the event final. Her winning teammates in the final event included Nancy Hogshead, Jenna Johnson and Carrie Steinseifer; Jill Sterkel and Mary Wayte also swam in the event's second-round qualifying heat.\n\n1988 Summer Olympics\n\nFor the 1988 Summer Olympics in Seoul, Korea, Torres qualified for the U.S. women's team in one individual event and two relay events. Torres earned a bronze medal for swimming for the third-place U.S. women's team in the 4x100-meter freestyle relay final together with Mitzi Kremer, Laura Walker and Mary Wayte; and won a silver medal for swimming the freestyle leg of the 4x100-meter medley relay in the third heat of the qualifying round for the second-place U.S. team. Torres also placed seventh in the final of the 100-meter freestyle event.\n\n1992 Summer Olympics\n\nTorres qualified for the U.S. Olympic women's team in a single event for the 1992 Summer Olympics in Barcelona, Spain. She swam the second leg of the 4x100-meter freestyle relay for the winning U.S. team that included Nicole Haislett, Angel Martino and Jenny Thompson, and earned a gold medal for her efforts in the final event and first-round qualifying heat. Ashley Tappin and Chrissy Ahmann also swam for the team in the qualifying heats of the event.\n\n2000 Summer Olympics\n\nTorres won five medals at the 2000 Summer Olympics in Sydney, Australia, but, as usual, saved her best for two of the major relay events of the U.S. Olympic women's team. She swam the second leg for the winning U.S. women's team in final of the 4x100-meter freestyle team that included Amy Van Dyken, Courtney Shealy and Jenny Thompson, with Erin Phenix and Ashley Tappin also swimming in the qualifying rounds. Torres won a second gold medal for anchoring the winning U.S. team in the 4x100-meter medley relay, together with teammates B.J. Bedford, Megan Quann and Jenny Thompson in the final, and Courtney Shealy, Staciana Stitts, Ashley Tappin and Amy Van Dyken in the qualifying rounds. Torres also earned three individual bronze medals in each of the 50-meter freestyle, the 100-meter butterfly and the 100-meter freestyle—tying teammate Jenny Thompson for third place in the last event. At 33 years old, Torres was already the oldest member of the U.S. Olympic swim team, but won more medals (5) than any other team member.\n\n2008 Summer Olympics\n\nAt age 41, Torres returned to the pool to obtain a spot in her fifth Olympic Games, unprecedented for an American female swimmer, especially given the fact that she sat out the 1996 and 2004 Olympic games. In fact, she is the first woman in history to swim in the Olympics past the age of 40. Her Olympic career spans twenty-four years.\n\nOn July 5, 2008, she qualified for the finals in the 50-meter freestyle that were held on July 6. In that semi-final, she broke the American record with a time of 24.38 seconds. On July 6, in the finals she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women's spot in the 50-meter freestyle. On July 7, Torres confirmed that she would be pulling out of 100-meter freestyle swim for her time at the Beijing Olympics to focus her efforts on the 50-meter freestyle. Lacey Nymeyer took over the position from Torres. On July 30, at the U.S. swim team's final training in Singapore, Torres, together with Amanda Beard and Natalie Coughlin were elected captains of the U.S. Olympic women's swimming team.\n\nIn order to pre-empt any speculation that she might be taking performance-enhancing drugs, Torres volunteered for an enhanced drug-testing program. According to her, when people ask if she is on performance-enhancing drugs, she takes it as a compliment. Torres uses resistance stretching with trainers Anne Tierney and Steve Sierra from Innovative Body Solutions and refers to this training as her \"secret weapon\" for continued success.\n\nTorres won silver on August 10, 2008, at the 2008 Olympic Games in Beijing as the anchor swimmer of the U.S. 4x100-meter freestyle relay. This was the fifth time in five tries she has earned an Olympic medal in that event.\n\nOn August 17, 2008, at the age of 41 years and 125 days, she won the silver medal in the women's 50-meter freestyle, finishing in a new American record time of 24.07, 0.01 of a second behind the winner, Britta Steffen. About thirty-five minutes later, she won another silver medal as part of the U.S. 4x100-meter medley relay team. Torres' split on the 4x100 medley relay (52.27) is the fastest 100-meter freestyle split in relay history. The American record for the women's 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres' time a full second faster—fast even for a relay split.\n\nTorres' twelve Olympic medals tie the all-time medal record for a female Olympic swimmer with fellow American Jenny Thompson. Eight of Thompson's medals were gold, compared with Torres' four. However, Torres has won twice as many individual medals (4) as Thompson (2), Thompson having won ten medals in relay team events.\n\n2009 National and World Championships\n\nAt the U.S. National Championships, Torres won the 50-meter freestyle and placed in the 50-met butterfly to qualify to swim at the 2009 World Championships in Rome, Italy. This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.\n\n2012 Summer Olympics\n\nFollowing reconstructive surgery of one of her knees, Torres stated in September 2010 that she had begun training with the goal of competing in the 2012 Summer Olympics in London, England.\n\nPersonal life\n\nTorres has worked in television as a reporter and announcer for American networks such as NBC, ESPN, TNT, OLN and Fox News Channel. She now hosts the golf show The Clubhouse, on the Resort Sports Network. She is also an occasional model, having appeared in the Sports Illustrated 1994 Swimsuit Issue. In 2005, she was elected to the International Jewish Sports Hall of Fame.\n\nIn the mid-1990s, she married and subsequently divorced sports producer Jeff Gowen. Her second marriage was also brief from June 2003 to December 2004, to Israeli-born surgeon Itzhak Shasha. Prior to marrying Shasha, Torres officially converted to Judaism (her late father was Jewish) to formalise her status under Halacha.\n\nTorres is no longer dating her reproductive endocrinologist, David Hoffman, but the two remain close friends. Hoffman was the fertility doctor who treated Torres. When Torres and Shasha separated, Torres and Hoffman began dating. Torres and Hoffman are the parents of Tessa Grace Torres-Hoffman, born in April 2006.\n\nBP Products North America engaged Torres in 2009 to be part of its \"Team Invigorate\" advertising campaign to inspire others to live \"younger for longer.\" She is the author of the inspirational memoir, Age is Just a Number, published in April 2009, and Gold Medal Fitness, published in May 2010.\n\nIn December 2009, The New York Times reported that a sports medicine doctor, Anthony Galea, with whom Torres had previously consulted, was under investigation by the Federal Bureau of Investigation for allegedly distributing human growth hormone and the drug Actovegin to professional athletes. Torres said that Dr. Galea's work was limited to draining fluid from her knee and diagnosing a muscle tear.\n\nTorres is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research, in which she has participated for several years.\n\nSee also\n\nFlorida Gators\n\nList of notable Jewish swimmers\n\nList of multiple Olympic gold medalists\n\nList of multiple Olympic gold medalists in one event\n\nList of multiple Olympic medalists in one event\n\nList of United States records in swimming\n\nList of University of Florida alumni\n\nList of University of Florida Olympians\n\nWorld record progression 50 metres freestyle\n\n\n\n\n\nBibliography\n\nTorres, Dara, & Elizabeth Weil, Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life , Broadway Books, New York, New York (2009). ISBN 978-0-7679-3190-8.\n\n, Broadway Books, New York, New York (2009). ISBN 978-0-7679-3190-8. Torres, Dara, & Billie Fitzpatrick, Gold Medal Fitness: A Revolutionary 5-Week Program, Broadway Books, New York, New York (2010). ISBN 978-0-7679-3194-6.\n\nExternal links\n\n\n\n"}, {"url": "https://www.geni.com/people/Dara-Torres/6000000138916707868", "page_content": "About Dara Torres\n\nhttps://en.wikipedia.org/wiki/Dara_Torres\n\nDara Grace Torres (born April 15, 1967) is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women's swimming medals. The others are fellow Americans Jenny Thompson and Natalie Coughlin. Torres won five medals at the 2000 Summer Olympics, when at age 33, she was the oldest member of the 2000 U.S. Olympic swim team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nContents Early years Torres was born on April 15, 1967, to a family in Los Angeles, California, the daughter of Edward Torres, and Marylu Kauder.[1] Her father was a real estate developer and casino owner, originally from Cuba; her mother Marylu was a former American model.[1][2] Torres grew up in Beverly Hills, California, the fifth of six children and the older of two girls.[2] As a seven-year-old, she followed in the footsteps of her older brothers by joining their community YMCA for swimming practice; afterward, she signed up for the swimming club in Culver City to train.[2] At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel, a college junior.[3]\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School),[1] and competed for the Westlake swim team under coach Darlene Bible from the seventh grade through her sophomore year in high school.[4] She was also a member of the Westlake basketball, gymnastics, and volleyball teams.[4] During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California, while training for her first Olympics under coach Mark Schubert.[3] After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.[4]\n\nCollege swimming career Torres accepted an athletic scholarship to attend the University of Florida in Gainesville, Florida, where she swam for the Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) ion under coach Randy Reese from 1986 to 1989.[5] In her four years as a Gator swimmer, Torres won nine Southeastern Conference (SEC) individual championships, including the 50-yard freestyle (1987, 1988, 1989), 100-yard freestyle (1987, 1988, 1989), 200-yard freestyle (1987), and 100-yard butterfly (1988, 1989); she was also a member of 12 of the Gators' SEC championship relay teams.[6] Torres won three NCAA individual national championships (50-yard freestyle, 100-yard freestyle, 100-yard butterfly) in 1988; and was a member of six of the Gators' NCAA championship relay teams, including the 400-yard freestyle relay in 1986; the 200-yard and 400-yard medley relays, and the 400-yard freestyle relay in 1988; and the 200-yard and 400-yard medley relays in 1989.[6] She was named the SEC Athlete of the Year in 1988, SEC Female Swimmer of the Year in 1987 and 1989, and earned 28 All-American swimming honors—the maximum number possible during a college career.[2][6] Torres also lettered in volleyball at Florida, playing the sport in her fifth year after having exhausted her NCAA eligibility in swimming.[7]\n\nTorres graduated from the university with a bachelor's degree in telecommunications in 1990 and was inducted into the University of Florida Athletic Hall of Fame as a \"Gator Great\" in 1999.[8][9] In November 2013, she was named as a recipient of the 2014 NCAA Silver Anniversary Award, presented annually to six distinguished former student-athletes on the 25th anniversary of their final school year of athletic eligibility.[7]\n\nInternational swimming career 1984, 1988 and 1992 Olympics At the 1984 Summer Olympics in Los Angeles, Torres was a member of the winning U.S. women's 4×100-meter freestyle relay team, swimming in the first-round qualifying heat and earning a gold medal in the event final.[10] Her winning teammates in that final included Nancy Hogshead, Jenna Johnson, and Carrie Steinseifer; Jill Sterkel and Mary Wayte also swam in the event's second-round qualifying heat.[11]\n\nFor the 1988 Summer Olympics in Seoul, South Korea, Torres qualified for the U.S. Olympic women's team in one individual event and two relay events. Torres earned a bronze medal for swimming for the third-place U.S. women's team in the 4×100-meter freestyle relay final, together with teammates Mitzi Kremer, Laura Walker, and Mary Wayte.[10][12] She also earned a silver medal for swimming the freestyle leg of the 4×100-meter medley relay for the second-place U.S. team in the preliminary heats, but not the final.[10] Individually, Torres also placed seventh in the final of the 100-meter freestyle event.[10]\n\nTorres qualified for the U.S. Olympic women's team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay for the winning U.S. team that included Nicole Haislett, Angel Martino, and Jenny Thompson, and earned a gold medal for her efforts in the event final and first-round qualifying heat.[10][13]\n\nFirst comeback: 2000 Olympics After seven years out of competitive swimming, Torres began to train for an Olympic comeback in 1999 under the guidance of coach Richard Quick.[14] She won five medals at the 2000 Summer Olympics in Sydney, but saved her best for two of the major relay events of the U.S. Olympic women's team.[10][15] She swam the second leg for the winning U.S. women's team in final of the 4×100-meter freestyle relay that included Amy Van Dyken, Courtney Shealy, and Jenny Thompson.[15] Torres won a second gold medal for anchoring the winning U.S. team in the 4×100-meter medley relay, together with teammates B.J. Bedford, Megan Quann, and Jenny Thompson in the final.[15] Individually, Torres also earned bronze medals – her first Olympic medals in individual events – in each of the 50-meter freestyle, the 100-meter butterfly and the 100-meter freestyle,[10][15] tying teammate and rival Jenny Thompson for third place in the last event.[16][17] At 33 years old, Torres became the oldest woman to win an Olympic medal in swimming.[18] She was the oldest member of the U.S. Olympic swim team, but won more medals (five) than any other U.S. team member.[19][20]\n\nSecond comeback: 2008 Olympics\n\nTorres at the Missouri Grand Prix in 2008 On August 1, 2007, at age 40 and just 16 months after giving birth to her first child, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis.[21] On August 4, she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics.[22] She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle 10 times, which is the most by any American swimmer in any event.[23]\n\nAt the 2008 U.S. Olympic Trials, Torres returned to the pool and qualified for a spot in her fifth Olympic Games at the age of 41, a first for an American female swimmer.[24] She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games.[14]\n\nAt the trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal.[25] In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women's spot in the event.[26] Torres also qualified in the 100-meter freestyle,[27] but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4×100-meter relay events.[28] On July 30, at the U.S. swim team's final training in Singapore, Torres, Amanda Beard, and Natalie Coughlin were elected captains of the U.S. Olympic women's swimming team.[29]\n\nIn order to pre-empt any speculation that she might be taking performance-enhancing drugs, Torres volunteered for a new enhanced drug-testing program by the U.S. Anti-Doping Agency.[30] \"I want to be an open book\", she said. \"I want people to know that I'm 41, and I'm doing this right. I'm clean.\"[31] In addition to employing her training team of coach Michael Lohberg, a sprint coach, a chiropractor, and two masseuses, Torres used resistance-stretching trainers, calling it her \"secret weapon\" for continued success.[14][32] Her $100,000-per-year training costs were partially subsidized by her corporate sponsors Speedo, Toyota, and Bloomberg L.P.[14]\n\n\"I think this performance ranks up there with the biggest performances in sports ever ... It puts Dara in the ranks of Michael Phelps, Michael Jordan, Tiger Woods. What she has done is really not measurable.\" Michael Lohberg, Torres' coach, discussing her winning three Olympic silver medals at the age of 41.[33]\n\nAt the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the second-place U.S. team in the 4×100-meter freestyle relay.[10] It was the fifth time in five tries she earned an Olympic medal in the 4×100-meter freestyle relay.[10] With the American relay team's second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson, who was 38 at the time of the 1908 Summer Olympics.[34]\n\nOn August 17, 2008, she won the silver medal in the 50-meter freestyle, finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner, Britta Steffen.[35] Her second-place time was a new American record, and 0.18 of a second faster than she swam at the U.S. Olympic Trials.[35] Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg for the second-place U.S. team in the 4×100-meter medley relay.[36] Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history.[36] The American record for the women's 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres' time more than a full second faster.[36]\n\nTorres' 12 Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.[37]\n\nAftermath and retirement At the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships.[38] This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.[citation needed]\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics.[39] At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce.[40][41] Only the top-two finishers in each trials event qualified for the 2012 U.S. Olympic team, and as a result, Torres concluded her Olympic career.[40] After the 2012 Trials, Torres announced her retirement from competitive swimming, concluding her career with 12 Olympic medals.[41] Her Olympic career spanned 24 years from 1984 to 2008 and five Olympic Games (1984, 1988, 1992, 2000, 2008).[10]\n\nLife outside swimming\n\nTorres in the 2010 Heart Truth fashion show Torres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network.[42] She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition.[32] She was inducted into the International Jewish Sports Hall of Fame in 2005.[43]\n\nAfter 1992, she married and subsequently divorced sports producer Jeff Gowen.[2] After 2000, she converted to Judaism fully (she was already half Jewish) before marrying the Israeli surgeon Itzhak Shasha (her own father had been Jewish).[2] Torres and Shasha later divorced.[2] Torres and reproductive endocrinologist David Hoffman began dating after her break-up with Shasha, and they became the parents of Tessa Grace Torres-Hoffman, born in 2006.[14] After the birth of their daughter, Hoffman, a masters swimmer, persuaded her to begin training again.[28]\n\nTorres is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years.[44] She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick).[45]\n\nTorres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors.[46]\n\nWorld records Women's 50-meter freestyle\n\nTime Date Event Location 25.69 January 29, 1983 Speedo International swim meet Amersfoort, Netherlands[3] 25.62 August 5, 1983 U.S. national championships Clovis, California[3] 25.61 July 21, 1984 Pre-Olympic swim meet Mission Viejo, California[47] Women's 4×100-meter freestyle relay\n\nTime Date Event Location 3:39.46 July 28, 1992 1992 Summer Olympics Barcelona, Spain[citation needed] 3:36.61 September 16, 2000 2000 Summer Olympics Sydney, Australia[citation needed] Women's 4×100-meter medley relay\n\nTime Date Event Location 3:58.30 September 23, 2000 2000 Summer Olympics Sydney, Australia[48]"}, {"url": "https://www.celebsagewiki.com/dara-torres", "page_content": "Age, Biography and Wiki\n\nDara Torres was born on 15 April, 1967 in Beverly Hills, California, United States, is an American swimmer. Discover Dara Torres's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 56 years old?\n\nPopular As N/A Occupation N/A Age 56 years old Zodiac Sign Aries Born 15 April 1967 Birthday 15 April Birthplace Beverly Hills, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 15 April. She is a member of famous Swimmer with the age 56 years old group.\n\nDara Torres Height, Weight & Measurements\n\nAt 56 years old, Dara Torres height is 1.8 m and Weight 150 lb (68 kg).\n\nPhysical Status Height 1.8 m Weight 150 lb (68 kg) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Dara Torres's Husband?\n\nHer husband is Itzhak Shasha (m. 2003–2004)\n\nFamily Parents Not Available Husband Itzhak Shasha (m. 2003–2004) Sibling Not Available Children Tessa Grace Torres-Hoffman\n\nDara Torres Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Dara Torres worth at the age of 56 years old? Dara Torres’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Dara Torres's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nDara Torres Social Network\n\nTimeline"}], "Dara Grace Torres competed in the 4×100-meter medley relay event at the 2008 Olympics.": [{"url": "https://kids.britannica.com/students/article/Dara-Torres/633680", "page_content": "Tony Duffy—Allsport/Getty Images\n\n(born 1967). American swimmer Dara Torres won 12 career Olympic medals, 4 of which were gold. Her 12 medals tied a record for the most won by a female Olympian from the United States. Celebrated for her longevity in swimming, Torres was the first American swimmer to compete at five Olympic Games. In 2008, at the age of 41, she became the oldest swimming medalist in Olympic history.\n\nTorres was born on April 15, 1967, in Beverly Hills, California. She was Cuban American. When she was growing up, her older brothers swam at their local YMCA, and at age seven she followed them into the sport. A prodigy in the pool, she began setting national age-group records when she was 12 years old. At age 14 she claimed her first senior national title, winning the 50-yard freestyle race at the Senior Short Course Nationals. In 1983 she twice set world records in the long-course 50-meter freestyle event. The following year she lowered the world record once more, to 25.61 seconds, and qualified for her first Olympics. At the 1984 Games in Los Angeles, California, she helped the U.S. 4 × 100-meter freestyle relay team win the gold medal and establish a new American record with a time of 3 minutes, 43.43 seconds.\n\nAfter graduating from high school in 1985, Torres attended the University of Florida. As a collegiate swimmer she garnered 28 National Collegiate Athletic Association (NCAA) All-American honors. She was named the NCAA Swimmer of the Year in 1988. That year she competed at the Olympics in Seoul, South Korea, where she earned a silver medal in the 4 × 100-meter medley relay and a bronze medal in the 4 × 100-meter freestyle relay. She returned to the Olympics four years later. At the 1992 Games in Barcelona, Spain, she captured gold again in the 4 × 100-meter freestyle relay. This time Torres and her teammates set a world record in the event, finishing in 3 minutes, 39.46 seconds.\n\nFollowing the Barcelona Games, Torres took a long break from competitive swimming. She worked in television broadcasting for a number of years. In 1999, however, she resumed training, with an eye toward qualifying for the 2000 Olympics in Sydney, Australia. At the 2000 U.S. Olympic Trials she proved that she remained a force, winning the 50-meter freestyle and finishing second behind Jenny Thompson in both the 100-meter freestyle and the 100-meter butterfly. At the Sydney Games, the following month, Torres enjoyed her most successful Olympics, securing five medals. She won gold in the 4 × 100-meter freestyle relay and the 4 × 100-meter medley relay. In individual competition she took home the bronze in the 50-meter freestyle and the 100-meter butterfly. She also tied Thompson for the bronze in the 100-meter freestyle.\n\nTorres again stepped away from competition after the Sydney Games. She resumed her broadcasting career, and in 2006 she gave birth to a daughter, Tessa. Following her pregnancy she took part in a couple of masters swimming events (for older competitive swimmers). Her impressive performances at those meets convinced her to make a bid for her fifth Olympic Games. At the 2008 Olympic Trials she won the 50-meter freestyle, thus becoming the oldest swimmer ever to qualify for the U.S. Olympic team. Torres went on to win three silver medals at the 2008 Games in Beijing, China (50-meter freestyle, 4 × 100-meter freestyle relay, 4 × 100-meter medley relay). In addition to becoming the oldest swimmer to medal at an Olympics, Torres moved into a tie with Thompson as the most decorated female American Olympian (their record of 12 career Olympic medals was later equaled by American swimmer Natalie Coughlin).\n\nIn 2012 Torres placed fourth in the 50-meter freestyle at the U.S. Olympic Trials, coming up short in her attempt to make her sixth Olympic team. She announced her retirement from swimming after the trials. Torres was inducted into the International Swimming Hall of Fame in 2016 and the U.S. Olympic & Paralympic Committee Hall of Fame in 2019."}, {"url": "https://olympics.com/en/athletes/dara-torres", "page_content": "Biography\n\nDara Torres had the longest successful career of any Olympic swimmer, one which saw her win 12 Olympic medals and four gold medals. Torres began her career in 1984, winning a gold medal in the 4×100 freestyle relay. She added a silver and bronze in relays in 1988, and seemingly ended her swimming career with another gold in the 4×100 free relay in 1992. Tall and strikingly attractive, Torres then began a career as a model, becoming the first athlete to appear in Sports Illustrated’s swimsuit issue. She also achieved notice as a commercial spokeswoman on an infomercial for a fitness training method. But in late 1998, she elected to return to competitive swimming. With little time to prepare, she returned to the Olympic pool at Sydney, and won five medals, including two golds in relays. She won three individual bronze medals at Sydney – in the 50 free, the 100 free, and the 100 fly.\n\nAgain retiring after the 2000 Olympics, Torres did not compete in Athina. But in 2006 she began training to make another Olympic team and made the US team for Beijing, winning the Olympic Trials in both the 50 and 100 metre freestyle. But she elected to compete in Beijing only in the 50 and the 4×100 freestyle and medley relays. Aged 41, the oldest ever female Olympic swimmer, Torres won a silver medal in the 50 free, defeated by only 1/100th of a second. She added silver medals in both relays. Torres finished her Olympic career lacking only an individual gold medal. She swam through 2012, but just missed out making the US Olympic team for the London Olympics. Torres won four Olympic medals of each color, one of only three Olympians to have won four or more medals of each type (Takashi Ono of Japan, and Larisa Latynina in gymnastics are the others)."}, {"url": "https://swimoregon.org/dara-torres/", "page_content": "“I think this performance ranks up there with the biggest performances in sports ever … It puts Dara in the ranks of Michael Phelps, Michael Jordan, and Tiger Woods.” — Michael Lohberg, Torres’ coach\n\nEarly years\n\nDara Torres was born in Los Angeles, California, on April 15, 1967, and grew up in Beverly Hills, California, the fifth of six children and the older of two girls. As a seven-year-old, she joined her older brothers at the community YMCA for swimming practice; afterward, she signed up for the swimming club in Culver City to train. At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel*, a college junior.\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School), and competed for their swim team under Coach Darlene Bible from the seventh grade through her sophomore year in high school. During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California, while training for her first Olympics under Coach Mark Schubert. After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.\n\nDara is a 12-time Olympic medalist (four gold, four silver, four bronze), and former world record-holder in three events. She is the first swimmer to represent the United States in five Olympic Games (Los Angeles 1984 Olympic Games, Seoul 1988 Olympic Games, Barcelona 1992 Olympic Games, Sydney 2000 Olympic Games, Beijing 2008 Olympic Games), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. She won at least one medal in each of the five Olympics in which she competed, making her one of only a handful of Olympians to earn medals in five different Games. Torres’ 12 Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.\n\nTorres attended the University of Florida in Gainesville, on an athletic scholarship, where she swam under Coach Randy Reese.\n\nInternational swimming career\n\nAt the 1984 Summer Olympics in Los Angeles, Dara Torres was a member of the U.S. women’s 4×100-meter freestyle relay team, earning a gold medal in the event final. She was just 17 years old, and had not yet enrolled in college when she won her first Olympic medal. Although Torres burst onto the international swimming stage at a young age, her career was most notable for its incredible longevity.\n\nFor the 1988 Summer Olympics in Seoul, South Korea, Torres earned a bronze medal for swimming in the 4×100-meter freestyle relay. Individually, Torres also placed seventh in the final of the 100-meter freestyle event.\n\nTorres qualified for the U.S. Olympic women’s team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay and earned a gold medal for her efforts.\n\nFirst comeback: 2000 Olympics\n\nAfter seven years out of competitive swimming, Torres came out of retirement at age 33 to become the oldest woman to win an Olympic swimming medal. She began to train for an Olympic comeback in 1999 under the guidance of Coach Richard Quick.\n\nShe won five medals at the 2000 Summer Olympics in Sydney. Although she was the oldest member of the U.S. Olympic swim team, she won more medals (five) than any other U.S. team member.\n\nSecond comeback: 2008 Olympics\n\nOn August 1, 2007, at age 40, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Then she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics. She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle 10 times, which is the most by any American swimmer in any event.\n\nAt the 2008 U.S. Olympic Trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal. In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women’s spot in the event. Torres also qualified in the 100-meter freestyle, but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4×100-meter relay events.\n\nTorres qualified for a spot in the Olympic Games in 2008 at the age of 41, a first for an American female swimmer. She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games. Having given birth two years earlier, her Olympic teammates jokingly referred to her as “Mom.”\n\nTorres captured three silver medals. Michael Lohberg, Torres’ coach, when discussing her winning three Olympic silver medals at the age of 41 said, “I think this performance ranks up there with the biggest performances in sports ever … It puts Dara in the ranks of Michael Phelps, Michael Jordan, and Tiger Woods. What she has done is really not measurable.”\n\nTorres says, “After I got out of college I was someone who loved to do extra. My mentality was the more you do, the better you do. Starting my second to last Olympics, in 2000, it all changed. I had a hard Friday practice once and my coach told me ‘go home, go to a movie if you want, but you’re doing absolutely nothing until Monday.’ “I thought that was going to kill me. But when I came back Monday I had one of the best workouts ever.\n\n“So, by the time I was getting ready for Beijing 2008, I knew I couldn’t do just what everyone else was doing. I was in my late thirties but got my head around recovery being different (for older athletes). You have to listen to your body.”\n\nAt the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the 4×100-meter freestyle relay. It was the fifth time in five tries she earned an Olympic medal in the 4×100-meter freestyle relay. With the American relay team’s second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson, who was 38 at the time of the 1908 Summer Olympics.\n\nAlso at the 2008 Olympics she won the silver medal in the 50-meter freestyle, finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner. Her second-place time was a new American record and 0.18 of a second faster than she swam at the U.S. Olympic Trials. Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg in the 4×100-meter medley relay. Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history. The American record for the women’s 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres’ time more than a full second faster.\n\nAftermath and final retirement\n\n“There are a lot of middle-aged women and men I know that contacted me, emailed or stopped me in the street to tell me that I am an inspiration to them and (they) are now doing things that they thought they couldn’t do,” Torres said.\n\nHer memoir, Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life, became a top-selling business book upon its publication. “Age is really just a number and I’m hoping that my age paves the way for other athletes, who maybe think they are too old to do something, to get back in or continue in the sport.” Dara’s journey has inspired millions of women to pursue their dreams, she embodies the “Yes I Can!” approach to life.\n\nAt the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships. This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics. At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce. Only the top-two finishers in each trials event qualified for the 2012 U.S. Olympic team, and as a result, Torres concluded her Olympic career. After the 2012 Trials, Torres announced her retirement from competitive swimming.\n\nLife outside swimming\n\n*Jill Sterkel was on the U.S. Olympic team in 1976 when the Germans [systematically and state-sponsored] were given anabolic steroids. Jill, along with Shirley Babashoff, Kim Peyton [Portland, Oregon’s swimmer] and Wendy Boglioli won the 4 x 100-meter freestyle relay against great odds from the doped German girls. The 1976 US Olympic girls’ swim team, was the greatest US Olympic team in the world. They were cheated out of gold medals by those who were illegally doped. The documentary describing that Olympics can be found at https://www.youtube.com/watch?v=_J6EJNSNKjw."}, {"url": "https://kids.kiddle.co/Dara_Torres", "page_content": "Dara Grace Torres (born April 15, 1967) is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women's swimming medals. The others are fellow Americans Jenny Thompson and Natalie Coughlin. Torres won five medals at the 2000 Summer Olympics, when at age 33, she was the oldest member of the 2000 U.S. Olympic swim team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nEarly years\n\nTorres was born on April 15, 1967, to a family in Los Angeles, California, the daughter of Edward Torres, and Marylu Kauder. Her father was a real estate developer and casino owner, originally from Cuba; her mother Marylu was a former American model. Torres grew up in Beverly Hills, California, the fifth of six children and the older of two girls. As a seven-year-old, she followed in the footsteps of her older brothers by joining their community YMCA for swimming practice; afterward, she signed up for the swimming club in Culver City to train. At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel, a college junior.\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School), and competed for the Westlake swim team under coach Darlene Bible from the seventh grade through her sophomore year in high school. She was also a member of the Westlake basketball, gymnastics, and volleyball teams. During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California, while training for her first Olympics under coach Mark Schubert. After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.\n\nCollege swimming career\n\nTorres accepted an athletic scholarship to attend the University of Florida in Gainesville, Florida, where she swam for the Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) under coach Randy Reese from 1986 to 1989. In her four years as a Gator swimmer, Torres won nine Southeastern Conference (SEC) individual championships, including the 50-yard freestyle (1987, 1988, 1989), 100-yard freestyle (1987, 1988, 1989), 200-yard freestyle (1987), and 100-yard butterfly (1988, 1989); she was also a member of 12 of the Gators' SEC championship relay teams. Torres won three NCAA individual national championships (50-yard freestyle, 100-yard freestyle, 100-yard butterfly) in 1988; and was a member of six of the Gators' NCAA championship relay teams, including the 400-yard freestyle relay in 1986; the 200-yard and 400-yard medley relays, and the 400-yard freestyle relay in 1988; and the 200-yard and 400-yard medley relays in 1989. She was named the SEC Athlete of the Year in 1988, SEC Female Swimmer of the Year in 1987 and 1989, and earned 28 All-American swimming honors—the maximum number possible during a college career. Torres also lettered in volleyball at Florida, playing the sport in her fifth year after having exhausted her NCAA eligibility in swimming.\n\nTorres graduated from the university with a bachelor's degree in telecommunications in 1990 and was inducted into the University of Florida Athletic Hall of Fame as a \"Gator Great\" in 1999. In November 2013, she was named as a recipient of the 2014 NCAA Silver Anniversary Award, presented annually to six distinguished former student-athletes on the 25th anniversary of their final school year of athletic eligibility.\n\nInternational swimming career\n\n1984, 1988 and 1992 Olympics\n\nTorres in 1984\n\nAt the 1984 Summer Olympics in Los Angeles, Torres was a member of the winning U.S. women's 4×100-meter freestyle relay team, swimming in the first-round qualifying heat and earning a gold medal in the event final. Her winning teammates in that final included Nancy Hogshead, Jenna Johnson, and Carrie Steinseifer; Jill Sterkel and Mary Wayte also swam in the event's second-round qualifying heat.\n\nFor the 1988 Summer Olympics in Seoul, South Korea, Torres qualified for the U.S. Olympic women's team in one individual event and two relay events. Torres earned a bronze medal for swimming for the third-place U.S. women's team in the 4×100-meter freestyle relay final, together with teammates Mitzi Kremer, Laura Walker, and Mary Wayte. She also earned a silver medal for swimming the freestyle leg of the 4×100-meter medley relay for the second-place U.S. team in the preliminary heats, but not the final. Individually, Torres also placed seventh in the final of the 100-meter freestyle event.\n\nTorres qualified for the U.S. Olympic women's team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay for the winning U.S. team that included Nicole Haislett, Angel Martino, and Jenny Thompson, and earned a gold medal for her efforts in the event final and first-round qualifying heat.\n\nFirst comeback: 2000 Olympics\n\nAfter seven years out of competitive swimming, Torres began to train for an Olympic comeback in 1999 under the guidance of coach Richard Quick. She won five medals at the 2000 Summer Olympics in Sydney, but saved her best for two of the major relay events of the U.S. Olympic women's team. She swam the second leg for the winning U.S. women's team in final of the 4×100-meter freestyle relay that included Amy Van Dyken, Courtney Shealy, and Jenny Thompson. Torres won a second gold medal for anchoring the winning U.S. team in the 4×100-meter medley relay, together with teammates B.J. Bedford, Megan Quann, and Jenny Thompson in the final. Individually, Torres also earned bronze medals – her first Olympic medals in individual events – in each of the 50-meter freestyle, the 100-meter butterfly and the 100-meter freestyle, tying teammate and rival Jenny Thompson for third place in the last event. At 33 years old, Torres became the oldest woman to win an Olympic medal in swimming. She was the oldest member of the U.S. Olympic swim team, but won more medals (five) than any other U.S. team member.\n\nSecond comeback: 2008 Olympics\n\nTorres at the Missouri Grand Prix in 2008\n\nOn August 1, 2007, at age 40 and just 16 months after giving birth to her first child, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis. On August 4, she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics. She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle 10 times, which is the most by any American swimmer in any event.\n\nAt the 2008 U.S. Olympic Trials, Torres returned to the pool and qualified for a spot in her fifth Olympic Games at the age of 41, a first for an American female swimmer. She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games.\n\nAt the trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal. In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women's spot in the event. Torres also qualified in the 100-meter freestyle, but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4×100-meter relay events. On July 30, at the U.S. swim team's final training in Singapore, Torres, Amanda Beard, and Natalie Coughlin were elected captains of the U.S. Olympic women's swimming team.\n\nIn order to pre-empt any speculation that she might be taking performance-enhancing drugs, Torres volunteered for a new enhanced drug-testing program by the U.S. Anti-Doping Agency. \"I want to be an open book\", she said. \"I want people to know that I'm 41, and I'm doing this right. I'm clean.\" In addition to employing her training team of coach Michael Lohberg, a sprint coach, a chiropractor, and two masseuses, Torres used resistance-stretching trainers, calling it her \"secret weapon\" for continued success. Her $100,000-per-year training costs were partially subsidized by her corporate sponsors Speedo, Toyota, and Bloomberg L.P.\n\n\"I think this performance ranks up there with the biggest performances in sports ever ... It puts Dara in the ranks of Michael Phelps, Michael Jordan, Tiger Woods. What she has done is really not measurable.\" Michael Lohberg, Torres's coach, discussing her winning three Olympic silver medals at the age of 41.\n\nAt the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the second-place U.S. team in the 4×100-meter freestyle relay. It was the fifth time in five tries she earned an Olympic medal in the 4×100-meter freestyle relay. With the American relay team's second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson, who was 38 at the time of the 1908 Summer Olympics.\n\nOn August 17, 2008, she won the silver medal in the 50-meter freestyle, finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner, Britta Steffen. Her second-place time was a new American record, and 0.18 of a second faster than she swam at the U.S. Olympic Trials. Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg for the second-place U.S. team in the 4×100-meter medley relay. Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history. The American record for the women's 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres's time more than a full second faster.\n\nTorres's 12 Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.\n\nAftermath and retirement\n\nAt the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships. This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics. At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce. Only the top-two finishers in each trials event qualified for the 2012 U.S. Olympic team, and as a result, Torres concluded her Olympic career. After the 2012 Trials, Torres announced her retirement from competitive swimming, concluding her career with 12 Olympic medals. Her Olympic career spanned 24 years from 1984 to 2008 and five Olympic Games (1984, 1988, 1992, 2000, 2008).\n\nIn 2004 she was inducted into the Southern California Jewish Sports Hall of Fame.\n\nLife outside swimming\n\nTorres in the 2010 Heart Truth fashion show\n\nTorres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network. She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition. She was inducted into the International Jewish Sports Hall of Fame in 2005.\n\nAfter 1992, she married and subsequently divorced sports producer Jeff Gowen. After 2000, she converted to Judaism fully (she was already half Jewish through her father) before marrying the Israeli surgeon Itzhak Shasha. Torres and Shasha later divorced. Torres and reproductive endocrinologist David Hoffman began dating after her break-up with Shasha, and they became the parents of Tessa Grace Torres-Hoffman, born in 2006. After the birth of their daughter, Hoffman, a masters swimmer, persuaded her to begin training again.\n\nTorres is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years. She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick).\n\nTorres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors.\n\nIn August 2019, Torres joined CaniBrands, a CBD health and wellness company, as its Chief Wellness and Lifestyle Officer.\n\nWorld records\n\n50 Meter Freestyle\n\nTime Date Event Location 25.69 January 29, 1983 Speedo International swim meet Amersfoort, Netherlands 25.62 August 5, 1983 U.S. national championships Clovis, California 25.61 July 21, 1984 Pre-Olympic swim meet Mission Viejo, California\n\nWomen's 4×100-meter freestyle relay\n\nWomen's 4×100-meter medley relay\n\nTime Date Event Location 3:58.30 September 23, 2000 2000 Summer Olympics Sydney, Australia\n\nSee also\n\nIn Spanish: Dara Torres"}, {"url": "https://www.jou.ufl.edu/current-students/current-undergraduate/cjc-sports/dara-torres-2/", "page_content": "Dara Torres\n\nB.S. Telecommunication, 1990\n\nDara is a twelve-time Olympic medalist and former world record-holder in three swimming events. Torres is the first and only swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, was the oldest swimmer ever to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won a total of twelve Olympic medals (four gold, four silver, four bronze). She won five medals at the 2000 Summer Olympics when, at age 33, she was the oldest member of the 2000 U.S. Olympic Swim Team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nTorres has worked in television as a reporter and announcer for networks NBC, ESPN, TNT, OLN and Fox News Channel, and hosted the golf show The Clubhouse on the Resort Sports Network. She has also worked as a model and was the first elite swimmer to model swimwear in the 1994 Sports Illustrated Swimsuit Issue. She was elected to the International Jewish Sports Hall of Fame in 2005."}, {"url": "https://cubansinamerica.us/web/prominent-cuban-americans/sports/dara-torres/", "page_content": "Dara Torres was born on April 15, 1967, the daughter of Edward Torres (originally from Cuba) and Marylu Kauder.\n\nShe is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women’s swimming medals.\n\nTorres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network. She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition.\n\nShe is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years. She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick). Torres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors."}, {"url": "https://www.celebsagewiki.com/dara-torres", "page_content": "Age, Biography and Wiki\n\nDara Torres was born on 15 April, 1967 in Beverly Hills, California, United States, is an American swimmer. Discover Dara Torres's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 56 years old?\n\nPopular As N/A Occupation N/A Age 56 years old Zodiac Sign Aries Born 15 April 1967 Birthday 15 April Birthplace Beverly Hills, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 15 April. She is a member of famous Swimmer with the age 56 years old group.\n\nDara Torres Height, Weight & Measurements\n\nAt 56 years old, Dara Torres height is 1.8 m and Weight 150 lb (68 kg).\n\nPhysical Status Height 1.8 m Weight 150 lb (68 kg) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Dara Torres's Husband?\n\nHer husband is Itzhak Shasha (m. 2003–2004)\n\nFamily Parents Not Available Husband Itzhak Shasha (m. 2003–2004) Sibling Not Available Children Tessa Grace Torres-Hoffman\n\nDara Torres Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Dara Torres worth at the age of 56 years old? Dara Torres’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Dara Torres's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nDara Torres Social Network\n\nTimeline"}, {"url": "https://www.openwaterpedia.com/wiki/Dara_Torres", "page_content": "Error creating thumbnail: Unable to save thumbnail to destination Olympian Dara Torres\n\nDara Grace Torres (born 15 April 1967) is a 12-time Olympic medalist (4 gold, 4 silver, 4 bronze) who competed in five Olympic Games (1984, 1988, 1992, 2000 and 2008). The 5-time Olympic swimmer is a mother, model, TV personality, and motivational speaker. At age 41, is the oldest swimmer ever to earn a place on the USA Olympic Swim team. At the 2008 Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nOlympic Games\n\nThe Stanford graduate won five medals at the 2000 Summer Olympics when, at age 33, she was the oldest member of the 2000 U.S. Olympic Swim Team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nNCAA\n\nTorres earned twenty-eight All-American swimming honors during her illustrious career at the University of Florida, the maximum number possible during a college career.\n\nMost Influential\n\nTorres was named one of the 30 Most Influential People in Swimming over the Past 30 Years by USA Swimming and Speedo USA."}, {"url": "https://www.celebsdetails.com/stats/dara-torres-height-weight-body/", "page_content": "Dara Torres is best known for being a Swimmer. She was born in Beverly Hills, California, USA on April 15, 1967. Dara is turning 57 this year. Legendary women’s swimmer for team USA who competed in five consecutive Summer Olympic games, an all-time record. Dara Grace Torres is an American former competition swimmer who is a twelve-time Olympic medalist and former world record-holder in three events. Torres is the first and only swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, was the oldest swimmer ever to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events. Continue below to see how tall Dara Torres really is, plus her weight, body measurements and stats. Facts Real Name: Dara Grace Torres Profession: Swimmer Nationality: American Date Of Birth: April 15, 1967 Age (as of 2023) : 56 years old Birth Place: Beverly Hills, California, USA Born In: Generation X Zodiac Sign: Aries Chinese Zodiac: Goat Dara Torres was born in 1960s. - Advertisement -\n\nPersonal\n\nShe started swimming after following her brothers to the YMCA. The education details are not available at this time. Please check back soon for updates. You can also learn about Dara Torres’s dating history at CelebsCouples.\n\nEye Color: Light Brown Hair Color: Blonde Shoe Size: N/A\n\nHeight\n\nAt the age of 56, Dara Torres’s height is 5 feet 11 inches (180 cm cm) or approximately 1.80 m meters or 71 inches inches.\n\nHeight: 5 ft, 11 in Height (meters): 1.80 m m Height (centimeters): 180 cm cm Height (inches): 71 inches in\n\nAccording to CDC, the average American height for men is 5′ 9″ inches (175 cm or 69 inches) and 5′ 4″ inches (162 cm or 64 inches) for women.\n\nFact: People lose a total of 1-3 inches (2.5 to 7.5 cm) in height as they age, and women generally losing more than men. Height loss is more rapid after age 70.\n\nWeight\n\nBody Build: Athletic Weight (pounds): 150 lb lbs Weight (kilograms): 68 kg kg Weight (stone): 10.7 stone\n\nDara Torres is a member of famous people who are known for being a famous 56 year old, Swimmer, born in April, in the year 1967, with zodiac sign of Aries.\n\nNow that you know how tall is Dara Torres, find out dara torres net worth, check out the countdown to Dara Torres’s birthday celebration, and discover related celebrities below."}, {"url": "https://www.ishof.org/honoree/honoree-dara-torres/", "page_content": "Dara Torres (USA) Honor Swimmer (2016)\n\nThe information on this page was written the year of their induction.\n\nFOR THE RECORD: 1984 OLYMPIC GAMES: gold (4×100 m freestyle); 1988 OLYMPIC GAMES: silver (4×100 m medley), bronze (4×100 m freestyle); 1992 OLYMPIC GAMES: gold (4×100 m freestyle); 2000 OLYMPIC GAMES: gold (4×100 m freestyle, 4×100 m medley), bronze (50 m freestyle, 100 m freestyle, 100 m butterfly); 2008 OLYMPIC GAMES: silver (50 m freestyle, 4×100 m freestyle, 4×100 m medley); 1986WORLD CHAMPIONSHIPS (LC): silver (4×100 m freestyle); 1987 PAN PACIFIC CHAMPIONSHIPS: gold (100 m freestyle, 4×100 m freestyle, 4×100 m medley); 1983 PAN AMERICAN GAMES: gold (4×100 m freestyle); SIX WORLD RECORDS: three individual (50m free), three relays (4x100m free, 4x100m medley)\n\nDara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4×100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time – an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}], "Dara Grace Torres competed in the 4×100-meter freestyle relay event at the 2008 Olympics.": [{"url": "https://kids.britannica.com/students/article/Dara-Torres/633680", "page_content": "Tony Duffy—Allsport/Getty Images\n\n(born 1967). American swimmer Dara Torres won 12 career Olympic medals, 4 of which were gold. Her 12 medals tied a record for the most won by a female Olympian from the United States. Celebrated for her longevity in swimming, Torres was the first American swimmer to compete at five Olympic Games. In 2008, at the age of 41, she became the oldest swimming medalist in Olympic history.\n\nTorres was born on April 15, 1967, in Beverly Hills, California. She was Cuban American. When she was growing up, her older brothers swam at their local YMCA, and at age seven she followed them into the sport. A prodigy in the pool, she began setting national age-group records when she was 12 years old. At age 14 she claimed her first senior national title, winning the 50-yard freestyle race at the Senior Short Course Nationals. In 1983 she twice set world records in the long-course 50-meter freestyle event. The following year she lowered the world record once more, to 25.61 seconds, and qualified for her first Olympics. At the 1984 Games in Los Angeles, California, she helped the U.S. 4 × 100-meter freestyle relay team win the gold medal and establish a new American record with a time of 3 minutes, 43.43 seconds.\n\nAfter graduating from high school in 1985, Torres attended the University of Florida. As a collegiate swimmer she garnered 28 National Collegiate Athletic Association (NCAA) All-American honors. She was named the NCAA Swimmer of the Year in 1988. That year she competed at the Olympics in Seoul, South Korea, where she earned a silver medal in the 4 × 100-meter medley relay and a bronze medal in the 4 × 100-meter freestyle relay. She returned to the Olympics four years later. At the 1992 Games in Barcelona, Spain, she captured gold again in the 4 × 100-meter freestyle relay. This time Torres and her teammates set a world record in the event, finishing in 3 minutes, 39.46 seconds.\n\nFollowing the Barcelona Games, Torres took a long break from competitive swimming. She worked in television broadcasting for a number of years. In 1999, however, she resumed training, with an eye toward qualifying for the 2000 Olympics in Sydney, Australia. At the 2000 U.S. Olympic Trials she proved that she remained a force, winning the 50-meter freestyle and finishing second behind Jenny Thompson in both the 100-meter freestyle and the 100-meter butterfly. At the Sydney Games, the following month, Torres enjoyed her most successful Olympics, securing five medals. She won gold in the 4 × 100-meter freestyle relay and the 4 × 100-meter medley relay. In individual competition she took home the bronze in the 50-meter freestyle and the 100-meter butterfly. She also tied Thompson for the bronze in the 100-meter freestyle.\n\nTorres again stepped away from competition after the Sydney Games. She resumed her broadcasting career, and in 2006 she gave birth to a daughter, Tessa. Following her pregnancy she took part in a couple of masters swimming events (for older competitive swimmers). Her impressive performances at those meets convinced her to make a bid for her fifth Olympic Games. At the 2008 Olympic Trials she won the 50-meter freestyle, thus becoming the oldest swimmer ever to qualify for the U.S. Olympic team. Torres went on to win three silver medals at the 2008 Games in Beijing, China (50-meter freestyle, 4 × 100-meter freestyle relay, 4 × 100-meter medley relay). In addition to becoming the oldest swimmer to medal at an Olympics, Torres moved into a tie with Thompson as the most decorated female American Olympian (their record of 12 career Olympic medals was later equaled by American swimmer Natalie Coughlin).\n\nIn 2012 Torres placed fourth in the 50-meter freestyle at the U.S. Olympic Trials, coming up short in her attempt to make her sixth Olympic team. She announced her retirement from swimming after the trials. Torres was inducted into the International Swimming Hall of Fame in 2016 and the U.S. Olympic & Paralympic Committee Hall of Fame in 2019."}, {"url": "https://www.swimmingworldmagazine.com/hall-of-fame/bio/swimmer/dara-torres", "page_content": "Dara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4x100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\n\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time - an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}, {"url": "https://www.ishof.org/honoree/honoree-dara-torres/", "page_content": "Dara Torres (USA) Honor Swimmer (2016)\n\nThe information on this page was written the year of their induction.\n\nFOR THE RECORD: 1984 OLYMPIC GAMES: gold (4×100 m freestyle); 1988 OLYMPIC GAMES: silver (4×100 m medley), bronze (4×100 m freestyle); 1992 OLYMPIC GAMES: gold (4×100 m freestyle); 2000 OLYMPIC GAMES: gold (4×100 m freestyle, 4×100 m medley), bronze (50 m freestyle, 100 m freestyle, 100 m butterfly); 2008 OLYMPIC GAMES: silver (50 m freestyle, 4×100 m freestyle, 4×100 m medley); 1986WORLD CHAMPIONSHIPS (LC): silver (4×100 m freestyle); 1987 PAN PACIFIC CHAMPIONSHIPS: gold (100 m freestyle, 4×100 m freestyle, 4×100 m medley); 1983 PAN AMERICAN GAMES: gold (4×100 m freestyle); SIX WORLD RECORDS: three individual (50m free), three relays (4x100m free, 4x100m medley)\n\nDara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4×100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time – an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}, {"url": "https://swimoregon.org/dara-torres/", "page_content": "“I think this performance ranks up there with the biggest performances in sports ever … It puts Dara in the ranks of Michael Phelps, Michael Jordan, and Tiger Woods.” — Michael Lohberg, Torres’ coach\n\nEarly years\n\nDara Torres was born in Los Angeles, California, on April 15, 1967, and grew up in Beverly Hills, California, the fifth of six children and the older of two girls. As a seven-year-old, she joined her older brothers at the community YMCA for swimming practice; afterward, she signed up for the swimming club in Culver City to train. At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel*, a college junior.\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School), and competed for their swim team under Coach Darlene Bible from the seventh grade through her sophomore year in high school. During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California, while training for her first Olympics under Coach Mark Schubert. After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.\n\nDara is a 12-time Olympic medalist (four gold, four silver, four bronze), and former world record-holder in three events. She is the first swimmer to represent the United States in five Olympic Games (Los Angeles 1984 Olympic Games, Seoul 1988 Olympic Games, Barcelona 1992 Olympic Games, Sydney 2000 Olympic Games, Beijing 2008 Olympic Games), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. She won at least one medal in each of the five Olympics in which she competed, making her one of only a handful of Olympians to earn medals in five different Games. Torres’ 12 Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.\n\nTorres attended the University of Florida in Gainesville, on an athletic scholarship, where she swam under Coach Randy Reese.\n\nInternational swimming career\n\nAt the 1984 Summer Olympics in Los Angeles, Dara Torres was a member of the U.S. women’s 4×100-meter freestyle relay team, earning a gold medal in the event final. She was just 17 years old, and had not yet enrolled in college when she won her first Olympic medal. Although Torres burst onto the international swimming stage at a young age, her career was most notable for its incredible longevity.\n\nFor the 1988 Summer Olympics in Seoul, South Korea, Torres earned a bronze medal for swimming in the 4×100-meter freestyle relay. Individually, Torres also placed seventh in the final of the 100-meter freestyle event.\n\nTorres qualified for the U.S. Olympic women’s team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay and earned a gold medal for her efforts.\n\nFirst comeback: 2000 Olympics\n\nAfter seven years out of competitive swimming, Torres came out of retirement at age 33 to become the oldest woman to win an Olympic swimming medal. She began to train for an Olympic comeback in 1999 under the guidance of Coach Richard Quick.\n\nShe won five medals at the 2000 Summer Olympics in Sydney. Although she was the oldest member of the U.S. Olympic swim team, she won more medals (five) than any other U.S. team member.\n\nSecond comeback: 2008 Olympics\n\nOn August 1, 2007, at age 40, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Then she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics. She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle 10 times, which is the most by any American swimmer in any event.\n\nAt the 2008 U.S. Olympic Trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal. In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women’s spot in the event. Torres also qualified in the 100-meter freestyle, but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4×100-meter relay events.\n\nTorres qualified for a spot in the Olympic Games in 2008 at the age of 41, a first for an American female swimmer. She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games. Having given birth two years earlier, her Olympic teammates jokingly referred to her as “Mom.”\n\nTorres captured three silver medals. Michael Lohberg, Torres’ coach, when discussing her winning three Olympic silver medals at the age of 41 said, “I think this performance ranks up there with the biggest performances in sports ever … It puts Dara in the ranks of Michael Phelps, Michael Jordan, and Tiger Woods. What she has done is really not measurable.”\n\nTorres says, “After I got out of college I was someone who loved to do extra. My mentality was the more you do, the better you do. Starting my second to last Olympics, in 2000, it all changed. I had a hard Friday practice once and my coach told me ‘go home, go to a movie if you want, but you’re doing absolutely nothing until Monday.’ “I thought that was going to kill me. But when I came back Monday I had one of the best workouts ever.\n\n“So, by the time I was getting ready for Beijing 2008, I knew I couldn’t do just what everyone else was doing. I was in my late thirties but got my head around recovery being different (for older athletes). You have to listen to your body.”\n\nAt the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the 4×100-meter freestyle relay. It was the fifth time in five tries she earned an Olympic medal in the 4×100-meter freestyle relay. With the American relay team’s second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson, who was 38 at the time of the 1908 Summer Olympics.\n\nAlso at the 2008 Olympics she won the silver medal in the 50-meter freestyle, finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner. Her second-place time was a new American record and 0.18 of a second faster than she swam at the U.S. Olympic Trials. Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg in the 4×100-meter medley relay. Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history. The American record for the women’s 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres’ time more than a full second faster.\n\nAftermath and final retirement\n\n“There are a lot of middle-aged women and men I know that contacted me, emailed or stopped me in the street to tell me that I am an inspiration to them and (they) are now doing things that they thought they couldn’t do,” Torres said.\n\nHer memoir, Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life, became a top-selling business book upon its publication. “Age is really just a number and I’m hoping that my age paves the way for other athletes, who maybe think they are too old to do something, to get back in or continue in the sport.” Dara’s journey has inspired millions of women to pursue their dreams, she embodies the “Yes I Can!” approach to life.\n\nAt the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships. This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics. At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce. Only the top-two finishers in each trials event qualified for the 2012 U.S. Olympic team, and as a result, Torres concluded her Olympic career. After the 2012 Trials, Torres announced her retirement from competitive swimming.\n\nLife outside swimming\n\n*Jill Sterkel was on the U.S. Olympic team in 1976 when the Germans [systematically and state-sponsored] were given anabolic steroids. Jill, along with Shirley Babashoff, Kim Peyton [Portland, Oregon’s swimmer] and Wendy Boglioli won the 4 x 100-meter freestyle relay against great odds from the doped German girls. The 1976 US Olympic girls’ swim team, was the greatest US Olympic team in the world. They were cheated out of gold medals by those who were illegally doped. The documentary describing that Olympics can be found at https://www.youtube.com/watch?v=_J6EJNSNKjw."}, {"url": "https://www.celebsagewiki.com/dara-torres", "page_content": "Age, Biography and Wiki\n\nDara Torres was born on 15 April, 1967 in Beverly Hills, California, United States, is an American swimmer. Discover Dara Torres's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 56 years old?\n\nPopular As N/A Occupation N/A Age 56 years old Zodiac Sign Aries Born 15 April 1967 Birthday 15 April Birthplace Beverly Hills, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 15 April. She is a member of famous Swimmer with the age 56 years old group.\n\nDara Torres Height, Weight & Measurements\n\nAt 56 years old, Dara Torres height is 1.8 m and Weight 150 lb (68 kg).\n\nPhysical Status Height 1.8 m Weight 150 lb (68 kg) Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Dara Torres's Husband?\n\nHer husband is Itzhak Shasha (m. 2003–2004)\n\nFamily Parents Not Available Husband Itzhak Shasha (m. 2003–2004) Sibling Not Available Children Tessa Grace Torres-Hoffman\n\nDara Torres Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Dara Torres worth at the age of 56 years old? Dara Torres’s income source is mostly from being a successful Swimmer. She is from United States. We have estimated Dara Torres's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Swimmer\n\nDara Torres Social Network\n\nTimeline"}, {"url": "https://cubansinamerica.us/web/prominent-cuban-americans/sports/dara-torres/", "page_content": "Dara Torres was born on April 15, 1967, the daughter of Edward Torres (originally from Cuba) and Marylu Kauder.\n\nShe is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women’s swimming medals.\n\nTorres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network. She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition.\n\nShe is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years. She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick). Torres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors."}, {"url": "https://www.jou.ufl.edu/current-students/current-undergraduate/cjc-sports/dara-torres-2/", "page_content": "Dara Torres\n\nB.S. Telecommunication, 1990\n\nDara is a twelve-time Olympic medalist and former world record-holder in three swimming events. Torres is the first and only swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, was the oldest swimmer ever to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won a total of twelve Olympic medals (four gold, four silver, four bronze). She won five medals at the 2000 Summer Olympics when, at age 33, she was the oldest member of the 2000 U.S. Olympic Swim Team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nTorres has worked in television as a reporter and announcer for networks NBC, ESPN, TNT, OLN and Fox News Channel, and hosted the golf show The Clubhouse on the Resort Sports Network. She has also worked as a model and was the first elite swimmer to model swimwear in the 1994 Sports Illustrated Swimsuit Issue. She was elected to the International Jewish Sports Hall of Fame in 2005."}, {"url": "https://www.geni.com/people/Dara-Torres/6000000138916707868", "page_content": "About Dara Torres\n\nhttps://en.wikipedia.org/wiki/Dara_Torres\n\nDara Grace Torres (born April 15, 1967) is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women's swimming medals. The others are fellow Americans Jenny Thompson and Natalie Coughlin. Torres won five medals at the 2000 Summer Olympics, when at age 33, she was the oldest member of the 2000 U.S. Olympic swim team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nContents Early years Torres was born on April 15, 1967, to a family in Los Angeles, California, the daughter of Edward Torres, and Marylu Kauder.[1] Her father was a real estate developer and casino owner, originally from Cuba; her mother Marylu was a former American model.[1][2] Torres grew up in Beverly Hills, California, the fifth of six children and the older of two girls.[2] As a seven-year-old, she followed in the footsteps of her older brothers by joining their community YMCA for swimming practice; afterward, she signed up for the swimming club in Culver City to train.[2] At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel, a college junior.[3]\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School),[1] and competed for the Westlake swim team under coach Darlene Bible from the seventh grade through her sophomore year in high school.[4] She was also a member of the Westlake basketball, gymnastics, and volleyball teams.[4] During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California, while training for her first Olympics under coach Mark Schubert.[3] After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.[4]\n\nCollege swimming career Torres accepted an athletic scholarship to attend the University of Florida in Gainesville, Florida, where she swam for the Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) ion under coach Randy Reese from 1986 to 1989.[5] In her four years as a Gator swimmer, Torres won nine Southeastern Conference (SEC) individual championships, including the 50-yard freestyle (1987, 1988, 1989), 100-yard freestyle (1987, 1988, 1989), 200-yard freestyle (1987), and 100-yard butterfly (1988, 1989); she was also a member of 12 of the Gators' SEC championship relay teams.[6] Torres won three NCAA individual national championships (50-yard freestyle, 100-yard freestyle, 100-yard butterfly) in 1988; and was a member of six of the Gators' NCAA championship relay teams, including the 400-yard freestyle relay in 1986; the 200-yard and 400-yard medley relays, and the 400-yard freestyle relay in 1988; and the 200-yard and 400-yard medley relays in 1989.[6] She was named the SEC Athlete of the Year in 1988, SEC Female Swimmer of the Year in 1987 and 1989, and earned 28 All-American swimming honors—the maximum number possible during a college career.[2][6] Torres also lettered in volleyball at Florida, playing the sport in her fifth year after having exhausted her NCAA eligibility in swimming.[7]\n\nTorres graduated from the university with a bachelor's degree in telecommunications in 1990 and was inducted into the University of Florida Athletic Hall of Fame as a \"Gator Great\" in 1999.[8][9] In November 2013, she was named as a recipient of the 2014 NCAA Silver Anniversary Award, presented annually to six distinguished former student-athletes on the 25th anniversary of their final school year of athletic eligibility.[7]\n\nInternational swimming career 1984, 1988 and 1992 Olympics At the 1984 Summer Olympics in Los Angeles, Torres was a member of the winning U.S. women's 4×100-meter freestyle relay team, swimming in the first-round qualifying heat and earning a gold medal in the event final.[10] Her winning teammates in that final included Nancy Hogshead, Jenna Johnson, and Carrie Steinseifer; Jill Sterkel and Mary Wayte also swam in the event's second-round qualifying heat.[11]\n\nFor the 1988 Summer Olympics in Seoul, South Korea, Torres qualified for the U.S. Olympic women's team in one individual event and two relay events. Torres earned a bronze medal for swimming for the third-place U.S. women's team in the 4×100-meter freestyle relay final, together with teammates Mitzi Kremer, Laura Walker, and Mary Wayte.[10][12] She also earned a silver medal for swimming the freestyle leg of the 4×100-meter medley relay for the second-place U.S. team in the preliminary heats, but not the final.[10] Individually, Torres also placed seventh in the final of the 100-meter freestyle event.[10]\n\nTorres qualified for the U.S. Olympic women's team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay for the winning U.S. team that included Nicole Haislett, Angel Martino, and Jenny Thompson, and earned a gold medal for her efforts in the event final and first-round qualifying heat.[10][13]\n\nFirst comeback: 2000 Olympics After seven years out of competitive swimming, Torres began to train for an Olympic comeback in 1999 under the guidance of coach Richard Quick.[14] She won five medals at the 2000 Summer Olympics in Sydney, but saved her best for two of the major relay events of the U.S. Olympic women's team.[10][15] She swam the second leg for the winning U.S. women's team in final of the 4×100-meter freestyle relay that included Amy Van Dyken, Courtney Shealy, and Jenny Thompson.[15] Torres won a second gold medal for anchoring the winning U.S. team in the 4×100-meter medley relay, together with teammates B.J. Bedford, Megan Quann, and Jenny Thompson in the final.[15] Individually, Torres also earned bronze medals – her first Olympic medals in individual events – in each of the 50-meter freestyle, the 100-meter butterfly and the 100-meter freestyle,[10][15] tying teammate and rival Jenny Thompson for third place in the last event.[16][17] At 33 years old, Torres became the oldest woman to win an Olympic medal in swimming.[18] She was the oldest member of the U.S. Olympic swim team, but won more medals (five) than any other U.S. team member.[19][20]\n\nSecond comeback: 2008 Olympics\n\nTorres at the Missouri Grand Prix in 2008 On August 1, 2007, at age 40 and just 16 months after giving birth to her first child, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis.[21] On August 4, she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics.[22] She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle 10 times, which is the most by any American swimmer in any event.[23]\n\nAt the 2008 U.S. Olympic Trials, Torres returned to the pool and qualified for a spot in her fifth Olympic Games at the age of 41, a first for an American female swimmer.[24] She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games.[14]\n\nAt the trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal.[25] In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women's spot in the event.[26] Torres also qualified in the 100-meter freestyle,[27] but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4×100-meter relay events.[28] On July 30, at the U.S. swim team's final training in Singapore, Torres, Amanda Beard, and Natalie Coughlin were elected captains of the U.S. Olympic women's swimming team.[29]\n\nIn order to pre-empt any speculation that she might be taking performance-enhancing drugs, Torres volunteered for a new enhanced drug-testing program by the U.S. Anti-Doping Agency.[30] \"I want to be an open book\", she said. \"I want people to know that I'm 41, and I'm doing this right. I'm clean.\"[31] In addition to employing her training team of coach Michael Lohberg, a sprint coach, a chiropractor, and two masseuses, Torres used resistance-stretching trainers, calling it her \"secret weapon\" for continued success.[14][32] Her $100,000-per-year training costs were partially subsidized by her corporate sponsors Speedo, Toyota, and Bloomberg L.P.[14]\n\n\"I think this performance ranks up there with the biggest performances in sports ever ... It puts Dara in the ranks of Michael Phelps, Michael Jordan, Tiger Woods. What she has done is really not measurable.\" Michael Lohberg, Torres' coach, discussing her winning three Olympic silver medals at the age of 41.[33]\n\nAt the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the second-place U.S. team in the 4×100-meter freestyle relay.[10] It was the fifth time in five tries she earned an Olympic medal in the 4×100-meter freestyle relay.[10] With the American relay team's second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson, who was 38 at the time of the 1908 Summer Olympics.[34]\n\nOn August 17, 2008, she won the silver medal in the 50-meter freestyle, finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner, Britta Steffen.[35] Her second-place time was a new American record, and 0.18 of a second faster than she swam at the U.S. Olympic Trials.[35] Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg for the second-place U.S. team in the 4×100-meter medley relay.[36] Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history.[36] The American record for the women's 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres' time more than a full second faster.[36]\n\nTorres' 12 Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.[37]\n\nAftermath and retirement At the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships.[38] This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.[citation needed]\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics.[39] At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce.[40][41] Only the top-two finishers in each trials event qualified for the 2012 U.S. Olympic team, and as a result, Torres concluded her Olympic career.[40] After the 2012 Trials, Torres announced her retirement from competitive swimming, concluding her career with 12 Olympic medals.[41] Her Olympic career spanned 24 years from 1984 to 2008 and five Olympic Games (1984, 1988, 1992, 2000, 2008).[10]\n\nLife outside swimming\n\nTorres in the 2010 Heart Truth fashion show Torres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network.[42] She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition.[32] She was inducted into the International Jewish Sports Hall of Fame in 2005.[43]\n\nAfter 1992, she married and subsequently divorced sports producer Jeff Gowen.[2] After 2000, she converted to Judaism fully (she was already half Jewish) before marrying the Israeli surgeon Itzhak Shasha (her own father had been Jewish).[2] Torres and Shasha later divorced.[2] Torres and reproductive endocrinologist David Hoffman began dating after her break-up with Shasha, and they became the parents of Tessa Grace Torres-Hoffman, born in 2006.[14] After the birth of their daughter, Hoffman, a masters swimmer, persuaded her to begin training again.[28]\n\nTorres is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years.[44] She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick).[45]\n\nTorres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors.[46]\n\nWorld records Women's 50-meter freestyle\n\nTime Date Event Location 25.69 January 29, 1983 Speedo International swim meet Amersfoort, Netherlands[3] 25.62 August 5, 1983 U.S. national championships Clovis, California[3] 25.61 July 21, 1984 Pre-Olympic swim meet Mission Viejo, California[47] Women's 4×100-meter freestyle relay\n\nTime Date Event Location 3:39.46 July 28, 1992 1992 Summer Olympics Barcelona, Spain[citation needed] 3:36.61 September 16, 2000 2000 Summer Olympics Sydney, Australia[citation needed] Women's 4×100-meter medley relay\n\nTime Date Event Location 3:58.30 September 23, 2000 2000 Summer Olympics Sydney, Australia[48]"}, {"url": "https://www.wbur.org/hereandnow/2021/02/22/dara-torres-olympic-swimmer", "page_content": "Swimmer Dara Torres won 12 Olympic medals over a nearly 25-year span from age 17 to 41.\n\nBut success in the pool early on in her career hid struggles with a serious eating disorder. Torres talks about that in-depth for the first time in a documentary that airs on the SEC Network on Monday called “Once Upon A Comeback.”\n\nAs a swimmer at the University of Florida during the ‘80s, Torres says she faced pressure from coaches, particularly Randy Reese, to lose weight. At the time, the coaches didn’t know a lot about eating disorders, she says.\n\nOne coach wanted the team to look intimidating to competitors on the starting blocks and set a weight goal for the swimmers to meet, she says. If someone didn’t make weight, they had to do extra workouts.\n\n“For me personally, having come from a background where I've never trained like that before in my life, to have to do extra workouts was just, that wasn't going to happen for me,” she says. “And one thing led to another. I sort of got in this habit of bingeing and purging in my freshman year, and that's kind of how it all started and just sort of snowballed from there.”\n\nThe coaches weighed the girls right on the pool deck, as Torres describes in the film, and sometimes the swimmers would break down in tears if they didn't make weight. The intense pressure to make weight came from an inner desire to please her coaches, she says.\n\nThe cycle of bingeing and purging took over Torres’ life and psyche — but now she views the difficult experience as a lesson.\n\n“It was obviously a very dark time in my life and I wouldn't wish that upon my worst enemy,” she says. “But yet I learned a lot from it and it made me the person who I am today.”\n\nTorres says she tried talking to a male team doctor at the university about her struggles, but the conversation ended with him handing her information on eating disorders.\n\nAfter she graduated college, she went to get a physical and the doctor asked her if she’s ever binged and purged. Torres said no, but later called the doctor back and admitted she had a problem.\n\nThe first step to recovery was opening up about her disorder, she says. Her advice to people struggling with eating disorders is to talk about it.\n\n“I knew I had a lot of work to do after that but it was a huge relief to get it off my shoulders after four years of only me knowing that I had this issue,” she says.\n\nTorres swam in the Olympics in Seoul in 1988, Barcelona in 1992, Sydney in 2000 and Beijing in 2008. When the time to train for Beijing arrived, Torres was pregnant, in her 40s and swimming for exercise.\n\nShe says she received invitations to swim in a few meets, and then people started to ask, “Wouldn't it be great to see a middle-aged person in the Olympic Games?” Since she loves a challenge, Torres decided to go for gold once again.\n\nThe swimmer ended up winning three silver medals in Beijing. As she trained, Torres kept the goal of winning a gold medal in her head.\n\n“I kept that thought with me every single day for the almost two years after that I trained for the Olympic trials and Olympic Games,” she says. “And I really think the power of positive thinking can play a role in what you do in your life.”\n\nInterview Highlights\n\nOn how she started swimming\n\n“Well, I have four older brothers, and I was very competitive the minute I was born. It's like, who could be the first one in the car? Who could be the first one done at the dinner table? Just always competing with them. Whatever they would do, I would do. So the minute they started on a swim team, my mom had me in the stands. That didn't go very well because I had a lot of energy. And I think back then they called it hyperactivity, but I'm sure I had ADD. And she put me in the pool just to get the energy out and not have it all around her and just focus it somewhere. So I started swimming and just fell in love with the sport.”\n\nOn whether swimming came easy to her\n\n“It really did. I really could just get up on the starting blocks and do the start into the water and swim fast and no big deal. And I think that all changed when I started to notice changes in my body, started to become more of a woman, and realized that I actually have to work hard to be fast. It just doesn't come easy anymore. “\n\nOn if she left the sport satisfied after she didn’t qualify for a sixth Olympic team in 2012\n\n“I really did. It's funny because when I got out of the pool after those Olympic trials and I missed the team by nine one-hundredths of a second, I looked in the stands. I saw my daughter crying and I saw my mom crying. I'm like, ‘Oh, my gosh, I have to go over and console them.’ And, you know, my mom, obviously, she was upset because she's my mom and she wanted to see me make another Olympic team, but my daughter, I'm like, ‘Tessa, What's wrong? Are you OK?’ She's like, ‘Now I don't get to go to London and see Michael Phelps and Ryan Lochte.’ I'm like, oh, my gosh, she's starting way too early, you know? So it was kind of funny. It was a little bit of a role reversal of, you know, me having to console my mom. But I was OK. I knew that the time that I did Olympic trials, my sixth Olympic trials, was the second-fastest time I've ever done at trials. But the girls are getting faster and I couldn't give it anything else. I gave it all I had.”\n\nOn what she tells her daughter about body image and her experience with eating disorders\n\n“I continuously tell her how beautiful she is on the inside and out and not to base everything off of food. And just to make sure that when you want to eat stuff that, you know, you're maybe not supposed to have, eat it in smaller portions and you'll be fine.”\n\nAlex Ashlock produced and edited this interview for broadcast with Todd Mundt. Allison Hagan adapted it for the web."}, {"url": "https://deadorkicking.com/dara-torres-dead-or-alive/", "page_content": "How Old Is Dara Torres? Dara Torres Birthday\n\nDara Torres was born on April 15, 1967 and is 56 years old now.\n\nBirthday: April 15, 1967\n\nHow Old - Age: 56\n\nDara Torres Death Fact Check\n\nDara is alive and kicking and is currently 56 years old.\n\nPlease ignore rumors and hoaxes.\n\nIf you have any unfortunate news that this page should be update with, please let us know using this form .\n\nDara Torres - Biography\n\nDara Grace Torres (born April 15, 1967) is an American former competition swimmer who is a twelve-time Olympic medalist and former world record-holder in three events. Torres is the first and only swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and, at age 41, was the oldest swimmer ever to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won twelve Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women's swimming medals. The others are fellow Americans Jenny Thompson and Natalie Coughlin. Torres won five medals at the 2000 Summer Olympics when, at age 33, she was the oldest member of the 2000 U.S. Olympic Swim Team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics. At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce. Only the top two finishers in each trials event qualified for the 2012 U.S. Olympic Team, and as a result, Torres concluded her Olympic career. After the 2012 Trials, Torres announced her retirement from competitive swimming, concluding her career with 12 Olympic medals. Her Olympic career spanned twenty-four years from 1984 to 2008 and five Olympic Games (1984, 1988, 1992, 2000, 2008).\n\nAfter 1992, she married and subsequently divorced sports producer Jeff Gowen. After 2000, she converted to Judaism fully (she was already half jewish) before marrying the Israeli surgeon Itzhak Shasha (her own father had been Jewish). Torres and Shasha later divorced. Torres and reproductive endocrinologist David Hoffman began dating after her break-up with Shasha, and they became the parents of Tessa Grace Torres-Hoffman, born in 2006. After the birth of their daughter, Hoffman, a masters swimmer, persuaded her to begin training again."}], "Dara Grace Torres won silver medals in 50-meter freestyle event 4×100-meter medley relay event 4×100-meter freestyle relay event at the 2008 Olympics.": [{"url": "https://olympics.com/en/athletes/dara-torres", "page_content": "Biography\n\nDara Torres had the longest successful career of any Olympic swimmer, one which saw her win 12 Olympic medals and four gold medals. Torres began her career in 1984, winning a gold medal in the 4×100 freestyle relay. She added a silver and bronze in relays in 1988, and seemingly ended her swimming career with another gold in the 4×100 free relay in 1992. Tall and strikingly attractive, Torres then began a career as a model, becoming the first athlete to appear in Sports Illustrated’s swimsuit issue. She also achieved notice as a commercial spokeswoman on an infomercial for a fitness training method. But in late 1998, she elected to return to competitive swimming. With little time to prepare, she returned to the Olympic pool at Sydney, and won five medals, including two golds in relays. She won three individual bronze medals at Sydney – in the 50 free, the 100 free, and the 100 fly.\n\nAgain retiring after the 2000 Olympics, Torres did not compete in Athina. But in 2006 she began training to make another Olympic team and made the US team for Beijing, winning the Olympic Trials in both the 50 and 100 metre freestyle. But she elected to compete in Beijing only in the 50 and the 4×100 freestyle and medley relays. Aged 41, the oldest ever female Olympic swimmer, Torres won a silver medal in the 50 free, defeated by only 1/100th of a second. She added silver medals in both relays. Torres finished her Olympic career lacking only an individual gold medal. She swam through 2012, but just missed out making the US Olympic team for the London Olympics. Torres won four Olympic medals of each color, one of only three Olympians to have won four or more medals of each type (Takashi Ono of Japan, and Larisa Latynina in gymnastics are the others)."}, {"url": "https://kids.britannica.com/students/article/Dara-Torres/633680", "page_content": "Tony Duffy—Allsport/Getty Images\n\n(born 1967). American swimmer Dara Torres won 12 career Olympic medals, 4 of which were gold. Her 12 medals tied a record for the most won by a female Olympian from the United States. Celebrated for her longevity in swimming, Torres was the first American swimmer to compete at five Olympic Games. In 2008, at the age of 41, she became the oldest swimming medalist in Olympic history.\n\nTorres was born on April 15, 1967, in Beverly Hills, California. She was Cuban American. When she was growing up, her older brothers swam at their local YMCA, and at age seven she followed them into the sport. A prodigy in the pool, she began setting national age-group records when she was 12 years old. At age 14 she claimed her first senior national title, winning the 50-yard freestyle race at the Senior Short Course Nationals. In 1983 she twice set world records in the long-course 50-meter freestyle event. The following year she lowered the world record once more, to 25.61 seconds, and qualified for her first Olympics. At the 1984 Games in Los Angeles, California, she helped the U.S. 4 × 100-meter freestyle relay team win the gold medal and establish a new American record with a time of 3 minutes, 43.43 seconds.\n\nAfter graduating from high school in 1985, Torres attended the University of Florida. As a collegiate swimmer she garnered 28 National Collegiate Athletic Association (NCAA) All-American honors. She was named the NCAA Swimmer of the Year in 1988. That year she competed at the Olympics in Seoul, South Korea, where she earned a silver medal in the 4 × 100-meter medley relay and a bronze medal in the 4 × 100-meter freestyle relay. She returned to the Olympics four years later. At the 1992 Games in Barcelona, Spain, she captured gold again in the 4 × 100-meter freestyle relay. This time Torres and her teammates set a world record in the event, finishing in 3 minutes, 39.46 seconds.\n\nFollowing the Barcelona Games, Torres took a long break from competitive swimming. She worked in television broadcasting for a number of years. In 1999, however, she resumed training, with an eye toward qualifying for the 2000 Olympics in Sydney, Australia. At the 2000 U.S. Olympic Trials she proved that she remained a force, winning the 50-meter freestyle and finishing second behind Jenny Thompson in both the 100-meter freestyle and the 100-meter butterfly. At the Sydney Games, the following month, Torres enjoyed her most successful Olympics, securing five medals. She won gold in the 4 × 100-meter freestyle relay and the 4 × 100-meter medley relay. In individual competition she took home the bronze in the 50-meter freestyle and the 100-meter butterfly. She also tied Thompson for the bronze in the 100-meter freestyle.\n\nTorres again stepped away from competition after the Sydney Games. She resumed her broadcasting career, and in 2006 she gave birth to a daughter, Tessa. Following her pregnancy she took part in a couple of masters swimming events (for older competitive swimmers). Her impressive performances at those meets convinced her to make a bid for her fifth Olympic Games. At the 2008 Olympic Trials she won the 50-meter freestyle, thus becoming the oldest swimmer ever to qualify for the U.S. Olympic team. Torres went on to win three silver medals at the 2008 Games in Beijing, China (50-meter freestyle, 4 × 100-meter freestyle relay, 4 × 100-meter medley relay). In addition to becoming the oldest swimmer to medal at an Olympics, Torres moved into a tie with Thompson as the most decorated female American Olympian (their record of 12 career Olympic medals was later equaled by American swimmer Natalie Coughlin).\n\nIn 2012 Torres placed fourth in the 50-meter freestyle at the U.S. Olympic Trials, coming up short in her attempt to make her sixth Olympic team. She announced her retirement from swimming after the trials. Torres was inducted into the International Swimming Hall of Fame in 2016 and the U.S. Olympic & Paralympic Committee Hall of Fame in 2019."}, {"url": "https://www.nytimes.com/2008/08/17/sports/olympics/17pool.html", "page_content": "BEIJING \u0097 Dara Torres had just become the oldest swimmer to win an Olympic silver medal, but her body language was still apologetic as she climbed out of the pool Sunday alongside rivals young enough to be her daughters.\n\n“One hundredth,” Torres said, shrugging her broad shoulders as she smiled at a group of supporters in the stands at the Water Cube. She later cried in a news conference.\n\nIt was testimony to how driven Torres was in her unlikely and ultimately successful quest to return to the Olympics. At 41, she did not just believe in her chances to take part in the Games, she believed in her chances to win.\n\nShe had concentrated the bulk of her energy on this 50-meter freestyle, withdrawing from the 100 freestyle before the Games to focus on what she perceived as her best chance. She had qualified for the final with the fastest time and earned the right to start in Lane 4."}, {"url": "https://www.swimmingworldmagazine.com/hall-of-fame/bio/swimmer/dara-torres", "page_content": "Dara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4x100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\n\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time - an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}, {"url": "https://www.ishof.org/honoree/honoree-dara-torres/", "page_content": "Dara Torres (USA) Honor Swimmer (2016)\n\nThe information on this page was written the year of their induction.\n\nFOR THE RECORD: 1984 OLYMPIC GAMES: gold (4×100 m freestyle); 1988 OLYMPIC GAMES: silver (4×100 m medley), bronze (4×100 m freestyle); 1992 OLYMPIC GAMES: gold (4×100 m freestyle); 2000 OLYMPIC GAMES: gold (4×100 m freestyle, 4×100 m medley), bronze (50 m freestyle, 100 m freestyle, 100 m butterfly); 2008 OLYMPIC GAMES: silver (50 m freestyle, 4×100 m freestyle, 4×100 m medley); 1986WORLD CHAMPIONSHIPS (LC): silver (4×100 m freestyle); 1987 PAN PACIFIC CHAMPIONSHIPS: gold (100 m freestyle, 4×100 m freestyle, 4×100 m medley); 1983 PAN AMERICAN GAMES: gold (4×100 m freestyle); SIX WORLD RECORDS: three individual (50m free), three relays (4x100m free, 4x100m medley)\n\nDara Grace Torres grew up in Beverly Hills, California, where she learned to swim in her family’s backyard pool. At the age of seven, she followed her brothers to swim practice at the local YMCA. During her junior year of high school, Torres moved to Mission Viejo, CA, to train with Hall of Fame Coach Mark Schubert, and in 1983 she broke the world record in the 50-meter freestyle. The next year, while not yet a senior in high school, she won her first Olympic gold medal as a member of the USA’s 4×100 freestyle relay team.\n\nSwimming for Randy Reece at the University of Florida, Torres earned 28 NCAA All-American swimming awards and at the 1988 Olympic Games, she won two silver medals swimming on relays. She finished her collegiate athletic career playing volleyball and took two years off before returning to win her second Olympic relay gold medal in Barcelona, Spain during the summer of 1992.\n\nAfter 1992, Torres lived what appeared to be a glamorous life. She moved to New York City, worked in television, and as a Wilhelmina model she became the first athlete model in the Sports Illustrated swimsuit issue. Then in the spring of 1999, despite not having trained in a pool for seven years, she decided to give the Olympics one more try.\n\nTraining with coach Richard Quick in Palo Alto and Santa Clara, Dara made the Olympic team for the fourth time, at the age of 33. She returned home with five medals, more than any other member of the team, including three in individual events, and retired.\n\nIn 2005, while pregnant with her first child, Dara began swimming three or four times a week at the Coral Springs Aquatic Complex, to keep fit. After giving birth to her daughter, Tessa Grace, in April 2006, she entered two Masters meets and posted times that emboldened her to try another comeback. She asked Coral Springs coach Michael Lohberg if he would coach her, and a little over a year later, she won the 100-meter freestyle at the U.S. Nationals in Indianapolis. Three days later, she broke the American record in the 50-meter freestyle for the tenth time – an amazing 24 years after setting it for the very first time. In 2008, Dara qualified for her fifth Olympic team and at the 2008 Beijing Games, she became the oldest swimmer to compete in the Olympics. Dara returned home with three silver medals, including the heartbreaking 50-meter freestyle race where she missed the gold by 1/100th of a second.\n\nIn 2009, Dara won the ESPY award for “Best Comeback,” was named one of the “Top Female Athletes of the Decade” by Sports Illustrated magazine and became a best selling author with the release of her inspirational memoir, Age is Just a Number.\n\nDara continued swimming after recovering from reconstructive knee surgery and with the encouragement of coach Lohberg, she set her sights on making a record sixth U.S. Olympic swim team. When she just missed making the London Olympics by nine-hundredths of a second in the 50-meter freestyle at the 2012 US Swimming Olympic Trials, she announced her retirement with a smile on her face and her six-year old daughter Tessa in her arms.\n\nOlympian, television personality, fitness guru, Queen of the Comeback, best-selling author and mother. Dara Torres is many things to many people, but above all, she is an inspiration."}, {"url": "https://olympics.com/es/atletas/dara-torres", "page_content": "Biografía\n\nDara Torres had the longest successful career of any Olympic swimmer, one which saw her win 12 Olympic medals and four gold medals. Torres began her career in 1984, winning a gold medal in the 4×100 freestyle relay. She added a silver and bronze in relays in 1988, and seemingly ended her swimming career with another gold in the 4×100 free relay in 1992. Tall and strikingly attractive, Torres then began a career as a model, becoming the first athlete to appear in Sports Illustrated’s swimsuit issue. She also achieved notice as a commercial spokeswoman on an infomercial for a fitness training method. But in late 1998, she elected to return to competitive swimming. With little time to prepare, she returned to the Olympic pool at Sydney, and won five medals, including two golds in relays. She won three individual bronze medals at Sydney – in the 50 free, the 100 free, and the 100 fly.\n\nAgain retiring after the 2000 Olympics, Torres did not compete in Athina. But in 2006 she began training to make another Olympic team and made the US team for Beijing, winning the Olympic Trials in both the 50 and 100 metre freestyle. But she elected to compete in Beijing only in the 50 and the 4×100 freestyle and medley relays. Aged 41, the oldest ever female Olympic swimmer, Torres won a silver medal in the 50 free, defeated by only 1/100th of a second. She added silver medals in both relays. Torres finished her Olympic career lacking only an individual gold medal. She swam through 2012, but just missed out making the US Olympic team for the London Olympics. Torres won four Olympic medals of each color, one of only three Olympians to have won four or more medals of each type (Takashi Ono of Japan, and Larisa Latynina in gymnastics are the others)."}, {"url": "https://www.jns.org/olympics-swimmer-dara-torres-inducted-into-jewish-american-hall-of-fame/", "page_content": "(May 6, 2020 / JNS)\n\nThe Jewish-American Hall of Fame has announced its 51st inductee, former Olympic swimmer Dara Torres.\n\nTorres competed in five Olympic Games, winning 12 medals and overtaking American swimmer Mark Spitz, who’s also Jewish, with 11 Olympic medals. Spitz earned most of his in the 1972 summer games in Munich, when 11 Israeli Olympic team members were taken hostage and killed, along with a West German police officer.\n\nIn her first Olympic games in 1984, Torres won a gold medal for the 100-meter relay. She went on to compete in the 1988, 1992, 2000 and 2008 Olympics, winning five medals in 2000, more than anyone else on her team.\n\nIn 2008, the oldest-ever Olympic swimmer at age 41 (having given birth only a year earlier), won two silver medals for 100-meter medley relay and 50-meter freestyle, breaking the American freestyle record she had set at the age of 15.\n\nOver the course of her career, Torres won four gold, four silver and four bronze medals at the Olympics, and broke the American record speeds for 50-meter freestyle 10 times, more than any American swimmer in any event.\n\nHer memoir, Age Is Just a Number: Achieve Your Dreams at Any Stage in Your Life, was published in April 2009 and listed as one of the top 25 best-selling business books later that year. Her second book, Gold Medal Fitness: A Revolutionary 5-Week Program hit stands this month.\n\nLater this year, the Jewish-American Hall of Fame division of the American Jewish Historical Society will issue a limited number of medals honoring Torres, which will be given to contributors. The hall of fame is a project and institution created by the Judah L. Magnes Museum in Berkeley, Calif."}, {"url": "https://www.geni.com/people/Dara-Torres/6000000138916707868", "page_content": "About Dara Torres\n\nhttps://en.wikipedia.org/wiki/Dara_Torres\n\nDara Grace Torres (born April 15, 1967) is an American former competitive swimmer, who is a 12-time Olympic medalist and former world record-holder in three events. Torres is the first swimmer to represent the United States in five Olympic Games (1984, 1988, 1992, 2000 and 2008), and at age 41, the oldest swimmer to earn a place on the U.S. Olympic team. At the 2008 Summer Olympics, she competed in the 50-meter freestyle, 4×100-meter medley relay, and 4×100-meter freestyle relay, and won silver medals in all three events.\n\nTorres has won 12 Olympic medals (four gold, four silver, four bronze), one of three women with the most Olympic women's swimming medals. The others are fellow Americans Jenny Thompson and Natalie Coughlin. Torres won five medals at the 2000 Summer Olympics, when at age 33, she was the oldest member of the 2000 U.S. Olympic swim team. She has also won at least one medal in each of the five Olympics in which she has competed, making her one of only a handful of Olympians to earn medals in five different Games.\n\nContents Early years Torres was born on April 15, 1967, to a family in Los Angeles, California, the daughter of Edward Torres, and Marylu Kauder.[1] Her father was a real estate developer and casino owner, originally from Cuba; her mother Marylu was a former American model.[1][2] Torres grew up in Beverly Hills, California, the fifth of six children and the older of two girls.[2] As a seven-year-old, she followed in the footsteps of her older brothers by joining their community YMCA for swimming practice; afterward, she signed up for the swimming club in Culver City to train.[2] At 14, she won the national open championship in the 50-yard freestyle by defeating the then-current champion, Jill Sterkel, a college junior.[3]\n\nShe attended the Westlake School for Girls (now Harvard-Westlake School),[1] and competed for the Westlake swim team under coach Darlene Bible from the seventh grade through her sophomore year in high school.[4] She was also a member of the Westlake basketball, gymnastics, and volleyball teams.[4] During her 1983–84 high school junior year, she left home to swim for the Mission Viejo Nadadores in Mission Viejo, California, while training for her first Olympics under coach Mark Schubert.[3] After the 1984 Olympics, Torres returned to the Westlake School to graduate in 1985.[4]\n\nCollege swimming career Torres accepted an athletic scholarship to attend the University of Florida in Gainesville, Florida, where she swam for the Florida Gators swimming and diving team in National Collegiate Athletic Association (NCAA) ion under coach Randy Reese from 1986 to 1989.[5] In her four years as a Gator swimmer, Torres won nine Southeastern Conference (SEC) individual championships, including the 50-yard freestyle (1987, 1988, 1989), 100-yard freestyle (1987, 1988, 1989), 200-yard freestyle (1987), and 100-yard butterfly (1988, 1989); she was also a member of 12 of the Gators' SEC championship relay teams.[6] Torres won three NCAA individual national championships (50-yard freestyle, 100-yard freestyle, 100-yard butterfly) in 1988; and was a member of six of the Gators' NCAA championship relay teams, including the 400-yard freestyle relay in 1986; the 200-yard and 400-yard medley relays, and the 400-yard freestyle relay in 1988; and the 200-yard and 400-yard medley relays in 1989.[6] She was named the SEC Athlete of the Year in 1988, SEC Female Swimmer of the Year in 1987 and 1989, and earned 28 All-American swimming honors—the maximum number possible during a college career.[2][6] Torres also lettered in volleyball at Florida, playing the sport in her fifth year after having exhausted her NCAA eligibility in swimming.[7]\n\nTorres graduated from the university with a bachelor's degree in telecommunications in 1990 and was inducted into the University of Florida Athletic Hall of Fame as a \"Gator Great\" in 1999.[8][9] In November 2013, she was named as a recipient of the 2014 NCAA Silver Anniversary Award, presented annually to six distinguished former student-athletes on the 25th anniversary of their final school year of athletic eligibility.[7]\n\nInternational swimming career 1984, 1988 and 1992 Olympics At the 1984 Summer Olympics in Los Angeles, Torres was a member of the winning U.S. women's 4×100-meter freestyle relay team, swimming in the first-round qualifying heat and earning a gold medal in the event final.[10] Her winning teammates in that final included Nancy Hogshead, Jenna Johnson, and Carrie Steinseifer; Jill Sterkel and Mary Wayte also swam in the event's second-round qualifying heat.[11]\n\nFor the 1988 Summer Olympics in Seoul, South Korea, Torres qualified for the U.S. Olympic women's team in one individual event and two relay events. Torres earned a bronze medal for swimming for the third-place U.S. women's team in the 4×100-meter freestyle relay final, together with teammates Mitzi Kremer, Laura Walker, and Mary Wayte.[10][12] She also earned a silver medal for swimming the freestyle leg of the 4×100-meter medley relay for the second-place U.S. team in the preliminary heats, but not the final.[10] Individually, Torres also placed seventh in the final of the 100-meter freestyle event.[10]\n\nTorres qualified for the U.S. Olympic women's team in a single event for the 1992 Summer Olympics in Barcelona. She swam the second leg of the 4×100-meter freestyle relay for the winning U.S. team that included Nicole Haislett, Angel Martino, and Jenny Thompson, and earned a gold medal for her efforts in the event final and first-round qualifying heat.[10][13]\n\nFirst comeback: 2000 Olympics After seven years out of competitive swimming, Torres began to train for an Olympic comeback in 1999 under the guidance of coach Richard Quick.[14] She won five medals at the 2000 Summer Olympics in Sydney, but saved her best for two of the major relay events of the U.S. Olympic women's team.[10][15] She swam the second leg for the winning U.S. women's team in final of the 4×100-meter freestyle relay that included Amy Van Dyken, Courtney Shealy, and Jenny Thompson.[15] Torres won a second gold medal for anchoring the winning U.S. team in the 4×100-meter medley relay, together with teammates B.J. Bedford, Megan Quann, and Jenny Thompson in the final.[15] Individually, Torres also earned bronze medals – her first Olympic medals in individual events – in each of the 50-meter freestyle, the 100-meter butterfly and the 100-meter freestyle,[10][15] tying teammate and rival Jenny Thompson for third place in the last event.[16][17] At 33 years old, Torres became the oldest woman to win an Olympic medal in swimming.[18] She was the oldest member of the U.S. Olympic swim team, but won more medals (five) than any other U.S. team member.[19][20]\n\nSecond comeback: 2008 Olympics\n\nTorres at the Missouri Grand Prix in 2008 On August 1, 2007, at age 40 and just 16 months after giving birth to her first child, Torres won the 100-meter freestyle at the U.S. Nationals in Indianapolis.[21] On August 4, she set a new American record in the 50-meter freestyle of 24.53 seconds, breaking her own record of 24.63 seconds set at the 2000 Summer Olympics.[22] She lowered her initial American record by 1.62 seconds. Torres has broken or lowered her own American record in the 50-meter freestyle 10 times, which is the most by any American swimmer in any event.[23]\n\nAt the 2008 U.S. Olympic Trials, Torres returned to the pool and qualified for a spot in her fifth Olympic Games at the age of 41, a first for an American female swimmer.[24] She became the oldest U.S. Olympic swimmer in history and the first American swimmer to appear in five Olympic Games.[14]\n\nAt the trials, she qualified for the event finals in the 50-meter freestyle and broke the American record with a time of 24.38 seconds in the semifinal.[25] In the 50-meter finals, she broke that record for the ninth time, setting it at 24.25 seconds and winning the top American women's spot in the event.[26] Torres also qualified in the 100-meter freestyle,[27] but later withdrew from the individual 100-meter freestyle event to focus her efforts on the 50-meter freestyle and 4×100-meter relay events.[28] On July 30, at the U.S. swim team's final training in Singapore, Torres, Amanda Beard, and Natalie Coughlin were elected captains of the U.S. Olympic women's swimming team.[29]\n\nIn order to pre-empt any speculation that she might be taking performance-enhancing drugs, Torres volunteered for a new enhanced drug-testing program by the U.S. Anti-Doping Agency.[30] \"I want to be an open book\", she said. \"I want people to know that I'm 41, and I'm doing this right. I'm clean.\"[31] In addition to employing her training team of coach Michael Lohberg, a sprint coach, a chiropractor, and two masseuses, Torres used resistance-stretching trainers, calling it her \"secret weapon\" for continued success.[14][32] Her $100,000-per-year training costs were partially subsidized by her corporate sponsors Speedo, Toyota, and Bloomberg L.P.[14]\n\n\"I think this performance ranks up there with the biggest performances in sports ever ... It puts Dara in the ranks of Michael Phelps, Michael Jordan, Tiger Woods. What she has done is really not measurable.\" Michael Lohberg, Torres' coach, discussing her winning three Olympic silver medals at the age of 41.[33]\n\nAt the 2008 Summer Olympics in Beijing, Torres won a silver medal as the anchor swimmer of the second-place U.S. team in the 4×100-meter freestyle relay.[10] It was the fifth time in five tries she earned an Olympic medal in the 4×100-meter freestyle relay.[10] With the American relay team's second-place finish, she became the oldest swimmer to win a medal in Olympic history, surpassing British swimmer William Robinson, who was 38 at the time of the 1908 Summer Olympics.[34]\n\nOn August 17, 2008, she won the silver medal in the 50-meter freestyle, finishing in a new American record time of 24.07 seconds, one one-hundredth (0.01) of a second behind the winner, Britta Steffen.[35] Her second-place time was a new American record, and 0.18 of a second faster than she swam at the U.S. Olympic Trials.[35] Thirty-five minutes later, she won another silver medal swimming the freestyle anchor leg for the second-place U.S. team in the 4×100-meter medley relay.[36] Her split on the 4×100 medley relay (52.27 seconds) was the fastest 100-meter freestyle split in relay history.[36] The American record for the women's 100-meter freestyle as an individual event was 53.39 seconds as of August 2008, making Torres' time more than a full second faster.[36]\n\nTorres' 12 Olympic medals tied the all-time medal record for a female Olympic swimmer set by fellow American Jenny Thompson in 2004; American Natalie Coughlin subsequently equaled the record in 2012.[37]\n\nAftermath and retirement At the U.S. National Championships in 2009, Torres won the 50-meter freestyle with the fourth-best time in the world for the year (24.42), and she also placed in the 50-meter butterfly, qualifying her to compete in those events at the 2009 World Championships.[38] This was the first time since 1986 that Torres competed in the World Championships; she placed eighth in the 50-meter freestyle and she did not advance beyond the qualifying heats in the 50-meter butterfly.[citation needed]\n\nFollowing reconstructive surgery of one of her knees, she began training with the goal of competing in the 2012 Summer Olympics.[39] At the 2012 United States Olympic Trials, she placed fourth in the finals of the 50-meter freestyle, 0.32 of a second behind the winner, Jessica Hardy, and 0.09 of a second behind the second qualifier, Kara Lynn Joyce.[40][41] Only the top-two finishers in each trials event qualified for the 2012 U.S. Olympic team, and as a result, Torres concluded her Olympic career.[40] After the 2012 Trials, Torres announced her retirement from competitive swimming, concluding her career with 12 Olympic medals.[41] Her Olympic career spanned 24 years from 1984 to 2008 and five Olympic Games (1984, 1988, 1992, 2000, 2008).[10]\n\nLife outside swimming\n\nTorres in the 2010 Heart Truth fashion show Torres has worked in television as a reporter and announcer for American networks NBC, ESPN, TNT, OLN, and Fox News Channel, and hosted the golf show, The Clubhouse on the Resort Sports Network.[42] She has also worked as a model, and was the first elite swimmer to model swimwear in the Sports Illustrated Swimsuit Issue, appearing in the 1994 edition.[32] She was inducted into the International Jewish Sports Hall of Fame in 2005.[43]\n\nAfter 1992, she married and subsequently divorced sports producer Jeff Gowen.[2] After 2000, she converted to Judaism fully (she was already half Jewish) before marrying the Israeli surgeon Itzhak Shasha (her own father had been Jewish).[2] Torres and Shasha later divorced.[2] Torres and reproductive endocrinologist David Hoffman began dating after her break-up with Shasha, and they became the parents of Tessa Grace Torres-Hoffman, born in 2006.[14] After the birth of their daughter, Hoffman, a masters swimmer, persuaded her to begin training again.[28]\n\nTorres is a veteran celebrity swimmer for Swim Across America, a charitable organization that raises funds for cancer research in which she has participated for several years.[44] She is the author of two books: Age is Just a Number: Achieve Your Dreams at Any Stage in Your Life (with Elizabeth Weil), and Gold Medal Fitness: A Revolutionary 5-Week Program (with Billie Fitzpatrick).[45]\n\nTorres is also involved with the American chapter of the foundation of Princess Charlene of Monaco, a charitable organization at which she sits, as Vice-President, on the board of directors.[46]\n\nWorld records Women's 50-meter freestyle\n\nTime Date Event Location 25.69 January 29, 1983 Speedo International swim meet Amersfoort, Netherlands[3] 25.62 August 5, 1983 U.S. national championships Clovis, California[3] 25.61 July 21, 1984 Pre-Olympic swim meet Mission Viejo, California[47] Women's 4×100-meter freestyle relay\n\nTime Date Event Location 3:39.46 July 28, 1992 1992 Summer Olympics Barcelona, Spain[citation needed] 3:36.61 September 16, 2000 2000 Summer Olympics Sydney, Australia[citation needed] Women's 4×100-meter medley relay\n\nTime Date Event Location 3:58.30 September 23, 2000 2000 Summer Olympics Sydney, Australia[48]"}, {"url": "https://olympics.com/pt/atletas/dara-torres", "page_content": "Biografia\n\nDara Torres had the longest successful career of any Olympic swimmer, one which saw her win 12 Olympic medals and four gold medals. Torres began her career in 1984, winning a gold medal in the 4×100 freestyle relay. She added a silver and bronze in relays in 1988, and seemingly ended her swimming career with another gold in the 4×100 free relay in 1992. Tall and strikingly attractive, Torres then began a career as a model, becoming the first athlete to appear in Sports Illustrated’s swimsuit issue. She also achieved notice as a commercial spokeswoman on an infomercial for a fitness training method. But in late 1998, she elected to return to competitive swimming. With little time to prepare, she returned to the Olympic pool at Sydney, and won five medals, including two golds in relays. She won three individual bronze medals at Sydney – in the 50 free, the 100 free, and the 100 fly.\n\nAgain retiring after the 2000 Olympics, Torres did not compete in Athina. But in 2006 she began training to make another Olympic team and made the US team for Beijing, winning the Olympic Trials in both the 50 and 100 metre freestyle. But she elected to compete in Beijing only in the 50 and the 4×100 freestyle and medley relays. Aged 41, the oldest ever female Olympic swimmer, Torres won a silver medal in the 50 free, defeated by only 1/100th of a second. She added silver medals in both relays. Torres finished her Olympic career lacking only an individual gold medal. She swam through 2012, but just missed out making the US Olympic team for the London Olympics. Torres won four Olympic medals of each color, one of only three Olympians to have won four or more medals of each type (Takashi Ono of Japan, and Larisa Latynina in gymnastics are the others)."}, {"url": "https://www.nydailynews.com/sports/dara-torres-settles-silver-medal-50-meter-freestyle-article-1.317916", "page_content": "BEIJING - It was over in about the time it takes for a 24-second clock to start buzzing, the length of one NBA possession.\n\nDara Torres, 41, swam her personal best time of 24.07 seconds in the 50-meter freestyle Sunday, but was out-touched in a heartbreaker by Britta Steffen of Germany. She lost by the same tiny margin that Michael Phelps won by a day earlier - one-hundredth of a second. Torres played the role of Milorad Cavic this time, leading the race until the final reach for the wall.\n\nAdvertisement\n\nSo it was not a fairy-tale ending for Torres, who never got her individual gold. But it was a statement nonetheless. She outswam six other women in this final, including Cate Campbell of Australia, at 16 young enough to be her daughter. Torres kicked and stroked all the way to the wall, fighting both age and her competition.\n\nShe won her 11th medal, won her 12th later in the 4x100 medley relay, capping a career that has spanned more than two decades.\n\nAdvertisement\n\n\"It feels pretty good,\" Torres said. \"I'm competitive, so I wanted to win gold in the 50. I gave it my best shot and I'm thinking, 'Maybe I shouldn't have filed my nails last night.'\"\n\nWe go way back to 1986 with Torres, when she was a promising teenager on the freestyle relay team at the world championships in Madrid. She won a bronze at Seoul in 1988, then disappeared after Barcelona in 1992 before returning to the pool for the Sydney Games. Nobody was making a living in this sport back then. Even Mark Spitz was slowly leaking endorsements. She occasionally would pop up on the radar screen. In 1994, Torres became the first athlete to appear alongside the professional models in the Sports Illustrated swimsuit issue. But at the time, it seemed she was more an ex-athlete than an athlete.\n\nTorres came back, captured five medals in 2000, then retired again. She was going to be a mother and had little to prove, she figured. But then her daughter, Tessa, was born and she thought about it again and started swimming toward Beijing. \"About a week and a half after I delivered I had to do something,\" Torres told the magazine Women's Health. \"I went to the gym to work on my triceps and biceps. Then around the corner, I saw my doctor. When he spotted me, I think he just gave up. He said, 'Go ahead and swim.'\"\n\nHer aging body rebelled at this thought. She needed shoulder surgery in November 2007, to remove a bone spur that caused a partial rotator cuff tear. This wasn't her first setback and she had overcome worse. Since she started swimming at age 7, Torres had battled eating disorders and knee injuries. She kept going, hoping to prove that 41 was the new 20. Her times were so good, eyebrows were understandably raised about the possibility of performance-enhancing drugs.\n\nTorres said she has been on a perfectly legal regimen of extensive training and amino acids. She volunteered for a blood-testing program that was stringent, though not foolproof. \"DNA test, blood test, urine test, whatever you want to do, just test me,\" she told Travis Tygart, chief executive of the U.S. Anti-doping Agency. Torres offered samples to be stored for future testing, when the technology becomes more foolproof. \"There's nothing more I can do,\" she said. \"People are going to think what they think.\"\n\nTorres came to the pool in Beijing and anchored the silver medalists in the 4x100 freestyle relay. She swam a faster 50-meter freestyle preliminary heat than all her competitors. The second-fastest time belonged to Campbell of Australia. And there Torres was in Lane 4 for the start of the big race Sunday morning, going for her 11th Olympic medal, suddenly a favorite to win her first individual gold. It didn't quite happen. Then minutes later, she went out and helped to win a silver medal in the 4x100 medley relay that gave her a collection of 12 career medals, tying Jenny Thompson.\n\nAt age 41, the night was a statement in itself."}]}