{"John Joseph Hughes was educated at the Royal College of St. Patrick in Maynooth.": [{"url": "https://www.dib.ie/biography/hughes-john-joseph-a4146", "page_content": "Hughes, John Joseph (1797–1864), third resident catholic bishop and first archbishop of New York, was probably born 23 June 1797 (being baptised on 24 June) at Annaloghan, near Clogher, Co. Tyrone, third son among seven children of Patrick Hughes, farmer and weaver from Dernaved, and his wife Margaret (née McKenna). A parish and hedge school contemporary was the novelist William Carleton (qv) (whom Hughes later aided when visiting Dublin in 1862); Carleton's better work depicts their earlier shared background. After 1800 the family moved to a farmhouse in Dernaved townland, nearby in Co. Monaghan (since rebuilt at the Ulster American Folk Park). Unusually Hughes stayed in a chapel school there until 16 (or 17) to prepare for priesthood. A bad farming year then caused his withdrawal and training as a gardener (1814). Two of his siblings died around this time. His father went (1816) to Chambersburg, Pennsylvania, to prepare a life for the remaining family; John himself went out in 1817, and the rest followed in 1818. John worked as a labourer in Maryland, then as a gardener at St Joseph's school, Emmitsburg, which shared a campus with Mount St Mary's, a secondary school with a senior seminary stream. Its Parisian-born rector Fr John Dubois thwarted Hughes's desire to become a seminarian until St Joseph's superior, Mother (later St) Elizabeth Seton, stressed his merit. Dubois then hired him as overseer of his farm and slaves until he saw for himself the Tyrone man's capacities, and allowed him to enter the school by age 23. On 15 October 1826 Hughes was ordained for Philadelphia, a month before Fr Dubois was himself installed as bishop of New York.\n\nEarly career, 1826–38 Hughes had thus already observed the command of others and practised it as a foreman, a local controversialist, and a funds collector. Two cultured European priests, Dubois and Simon Bruté, formed him; two American converts, Mother Seton and Fr Samuel Cooper, influenced him. As a seminarian he was sponsored by Philadelphia's bishop, who liked him – the aged Ulster churchman Henry Conwell, sent there in 1820 when already 75. Hughes witnessed the bishop's loss of power to the fractious (and briefly schismatic) local lay trustees of St Mary's, the city's premier (and cathedral) church, to which Hughes was himself appointed pastor in spring 1827. There he decided that clear hierarchy was the way forward, and mobilised the ‘new’ Irish against the trustees. In 1830 Francis Kenrick (qv), a Dubliner educated in Rome and there ordained in April 1821, was put in with some control as coadjutor bishop to Conwell. Hughes's exact contemporary, they differed markedly. Hughes held that the morale of the poorer Irish required a forceful counter-attack on the anti-catholicism then spreading as a result of the convergence of new mass Irish immigration and America's evangelical revival. Both Dublin and Rome had shaped Kenrick's more irenic approach, which was not dissimilar to that religiously usual in Philadelphia's older catholic community. Hughes acted boldly on each front. He rejected the claim that substantial lay power in church matters was appropriate to the new nation's civic or ‘republican’ culture, and linked it to wider anti-catholic propaganda. Instead he shaped a relevant apologetics and a joint political argumentation. American religious and civil freedoms required that catholics sustain their position, not that they hide or negate it. Religious prejudice against them was both anti-American, and all too reminiscent of the position but recently endured in Ireland. But his own initially abusive polemics marred his case. As Dubois once disciplined him for bullying students when a prefect, Kenrick now rebuked his uncharity. Hughes learned to modify his methods as he matured his insights. Gradually he transformed the thrust of ‘Americanisation’ among many catholics to one that accommodated a robust group-assertion, rather than cultivated the pieties of otherness quietly, or adjusted more or less to socio-political secularity.\n\nCoadjutor and archbishop of New York, 1838–64 Leadership of catholic New York, the epicentre of catholic immigration, offered him a wider context. Hughes was consecrated coadjutor there on 7 January 1838, taking effective command when Dubois suffered a stroke within the month. Dubois had been consecrated at 62 for New York. Lay factions rode roughshod over him. Within ten years he was exhausted, and died on 20 December 1842. Hughes had right of immediate succession. In 1850 New York was made an archdiocese; on 3 October 1850 Hughes received the documents (issued 19 July) confirming this and appointing him archbishop. He was given the pallium personally by Pius IX on 3 April 1851.\n\nThus from February 1838 until his final incapacity (from Bright's disease) in autumn 1863, the Irish-born prelate effectively ruled the diocese and then archdiocese. Within state and nation, he sought to change ‘an apologetic people . . . into a militant people’ (R. J. Purcell, DAB, ix (v, pt 1), 353). Gradually he won acceptance of this by official (but not popular) America, perhaps because in his archdiocese he harmonised massive catholic growth with the city's secular expansion. While he could not provide fully for the huge increases of his people, he provided New York's model ecclesial and school structures for a century. He pioneered and focused its metropolitan character. Twice he cut his jurisdiction's extent, to one-eleventh its original size, carving off almost all upstate New York in 1847, and Long Island and northern New Jersey in 1853. Hughes opened twenty-three parishes during 1840–63 within the city, and a further thirty-seven in the lower Hudson valley outside it. Manhattan's population more than doubled to 805,358 by 1860, its Irish-born then 203,730. Despite such increase, practising catholics for each city parish grew only slightly (10 per cent) from 1840 to 1865, vindicating his new creations. About one-half of catholics practised in the city itself, partly as the provision of parochial schools for their offspring remained very inadequate, with only 5,000 children covered in 1840 and 12,000 in 1860.\n\nIn 1840 Hughes sought to overthrow the city's Public School Society (wholly protestant) and its curricula, and to gain New York state recognition and funding for parochial schools. The state then created a secular public school system for the city, run on district lines. Hughes thus triggered the emergence of exclusively secular public schools, and thereby turned many moderate protestants toward nativism, as express Christian education was driven from their schools of choice. Yet he failed to win the funding that could have held his own poor more fully to their church. In 1857 he said: ‘In our age, the question of education is the question of the church’ (Cohalan, 56). His delivery was thus plainly unequal to his vision. His strategy of exclusive and defensive concentration, however understandable, left many unprovided for, with results later modified only by the rising and more politic affluence of many catholics. Through informal ‘Tammany’ links his successor John McCloskey wisely gained catholic teachers in the new district schools educating most catholic children. Hughes did, however, create the formative free parochial school system in the city.\n\nHughes gradually squeezed lay trusteeism out of New York. Despite a Know-Nothing law to prop it up (1855), he won a state law guaranteeing episcopal title to church properties (1863). He often co-opted trustees onto replacement boards of management. He won informal approval for a catholic chaplaincy in the US military by 1847, and its expansion in 1861 through William Seward, a friend since 1840.\n\nGaining major funding for New York from various missionary societies in Europe, he convinced Rome that his archdiocese must be a chief priority of the missionary church. He relied on a seasoned inner circle of pre-1835 fellow immigrants active in business (with whom he set up the Emigrant Savings Bank) to fund major projects, including the start of St Patrick's cathedral. He introduced many religious orders, including the Redemptorists (1841), the Irish Sisters of Mercy (May 1846), the Jesuits (also 1846) (granting them control of the nascent Fordham), and the Christian [D. L. Salle] Brothers in two stages (1848, 1853). Oddly, he split Mother Seton's original order by his drive to control their local work; those accepting this (including his sister, Ellen) created a new order based in the city (1846), while – fearing further such pressures elsewhere – the original American Sisters of Charity affiliated to the French Daughters of Charity (St Vincent de Paul) in 1850. Hughes was no ‘devotionalist’ in the by-then-current French or Italian styles. Critics of most Irish clergy, such as George Templeton Strong and John Blake Dillon (qv), excepted him as a man of doctrine, clarity, and intelligence. In 1846 he introduced the choice of the Blessed Virgin as patroness of the US at the sixth provincial council in Baltimore. Though he disliked ‘national’ parishes, Hughes did accept German and French ones, though he distanced Italian claims. He also accepted the creation both of ‘select’ (fee-paying) schools, and of up-market parishes (St Ann's, St Francis Xavier). His view of an urban American church was thus realist and comprehensive. He was certainly no Irish-ghetto builder. To Bishop John England (qv), Hughes was an ‘emphatically self-made man’ (Shaw, Dagger John, 91). He advanced many American-born and convert catholics as vital to his church's future.\n\nHe famously faced off public authority when nativist riots impended in April 1844. But this obscures a deeper change. His early and continued counter-polemics with anti-catholic partisans (e.g., Controversy between Rev. Messrs Hughes and Breckenridge (1834); Kirwan unmasked (1848)) gave way to the realisation that in an emergent metropolis with a bare majority then catholic (if problematically so), the analogous problems had shifted to those posed by the attractions of secularity, the indifference of elites, and the irresolute commitment of many formal adherents. The Know-Nothings of 1854–5 did not worry him as much as had their 1840s forerunners. His later battles were with secular spokesmen who respected him, notably Horace Greeley of the New York Tribune, and James G. Bennett, editor of the New York Herald, both highly political men. All three sought rival definitions of a culture, variously to sustain, exclude, contain, or modify Hughes's insistence that American liberty accept the spiritual obediences of catholics as fully licit, and their culture as a public contribution to urban and national vitality and order. His disputes with immigrant Young Ireland and Confederation leaders of 1848 had similar roots (except in the breaches with Thomas D'Arcy McGee (qv), who was less sanguine about both America and its Irish than was Hughes). A supporter of Daniel O'Connell (qv), and very active in famine relief, Hughes showed initial sympathy for both 1848 goals and later the Fenians, unsurprisingly given the trend to an overlap of Defender and United Irish interests in his childhood townlands.\n\nPolitically, and unlike most Irish, Hughes disliked the Democrats (despite many Democratic associates) for their assertive secularity, regretted Irish captivity to them, and preferred the orderly Whigs. Like most Irish, he distrusted the anti-slavery enthusiasms of the new Republicans. Having tried a ‘catholic’ slate in 1841 during the schools battle, thereafter he held that catholics as such ought to be non-partisan. This precedent became a tradition and was upheld by most Irish American bishops and laity (notably in 1901).\n\nYet Hughes had not forgotten the youthful anti-slavery reactions of his own Maryland years. His reform patriotism was deepened by many trips to Europe (October 1839–February 1840, summer 1843, December 1845, December 1850–July 1851), on which he was scandalised by Old World inequities. The shock of southern secession elicited a mature loyalty to the US, made contentious in his city in that many of his people's editors and leaders were Democrats wishing a ‘moderate’ and short war and a negotiated peace. The Lincoln administration sent him to France and Rome on the union's behalf in late 1861. He stayed in Rome until summer 1862.The anti-draft riots of July 1863 shadowed his last year, but his standing curbed their divisive impact.\n\nIt is as flexible planner of a metropolitan catholicism in a culture of multiple freedoms that he is most admirable. He disciplined his ‘tough’ and combative sides to that task. A rural Irishman seasoned to a rural America, Hughes tamed an urban-ward flood. His opposition to mass westward colonisation by the Irish newcomers reflected his close experience of farming in both Ireland and America; he did not oppose migration by stages to the land. Through it all he sustained a quiet and exhausting charity into the decline of his later years (c.1858–63), which drove him to live with his sister's family and move in a very limited circle. He died 3 January 1864.\n\nPapers The papers of John Hughes are principally in the archdiocesan archives at St Joseph's, Dunwoodie, Yonkers, New York. The collections include the diaries of two of his secretaries, Fr James R. Bayley and Fr Thomas Preston, and photocopies and microfilms of many of his letters in other archives, starting with those first made by his would-be biographer Peter Guilday. As the American church was under the jurisdiction of Rome's Congregation of Propaganda Fide until 1908, key papers went through it; these are catalogued and calendared by Anton Debevec and Finbar Kenneally, United States documents in the Propaganda Fide archives: a calendar, 1st ser. (5 vols, Washington, DC, 1966–74). Copies of the relevant ones are now in the above archives. So too are copies of his correspondence with the Society for the Propagation of the Faith (Lyon and Paris, its papers housed at its archives in Lyon). Photocopies were sent to the relevant American dioceses (United States) from 1987 to 1992: see a summary list by diocese in Jean-Marie Jammes in Catholic Historical Review, lxxv (Apr. 1989), 264–7. Henry J. Browne, another would-be biographer, also amassed collections on Hughes and his times. His unpublished biography is in the archives at Columbia University in the H. J. Browne papers there. Various sermons, articles, and pamphlets of Hughes are in Lawrence Kehoe (ed.), Complete works of the Most Rev. John Hughes, D.D. (2 vols, 1865); it is very incomplete and there has never been a collected works. The counter-view was closely provided and documented by James Gordon Bennett in his New York Herald. There is no published full scholarly biography."}, {"url": "https://www.fordham.edu/about/living-the-mission/jesuit-and-catholic/archbishop-john-hughes-founder-of-fordham/", "page_content": "John Joseph Hughes was born on June 24, 1797 in County Tyrone, Ireland. He was raised there until immigrating to the United States in 1817. Once settled with his family in Chambersburg, Penn., Hughes made several unsuccessful applications to be admitted to Mount St. Mary's College in Emmitsburg, Md. He was eventually hired by its rector, the Abbé John Dubois, S.S., as a gardener. During this time, he befriended Mother Elizabeth Ann Seton. Seton was favorably impressed by Hughes and persuaded Dubois to reconsider his admission. Hughes was subsequently admitted as a regular student of Mount St. Mary's in September 1820.\n\nIn his time as a seminarian, Hughes devotedly served his home diocese of Philadelphia. On October 15, 1826, he was ordained to the priesthood by Bishop Henry Conwell at St. Joseph's Church in Philadelphia. During his early years as a priest, Hughes faithfully carried out his ministerial duties but also succeeded in bringing new life and an air of vibrancy to the Church he so deeply cared for in Philadelphia. Hughes founded St. John's Orphan Asylum in 1829 and was responsible for the structuring of a new church, St. John the Evangelist, in 1832. St. John the Evangelist became regarded as one of the finest and most impressive churches in the country at that time.\n\nHughes' passion for the welfare of the Church and his innate sense of initiative was soon recognized by the Catholic Church far beyond the confines of the Diocese of Philadelphia. On August 7, 1837, Pope Gregory XVI called upon Hughes to serve as the coadjutor bishop for the then Diocese of New York.\n\nConsistent with his desire to educate people on the Word of God, Hughes began searching in 1838 for a suitable location to establish a new seminary and college. It was not long before Hughes resolved that the 100 acres of Rose Hill Manor bordering the Bronx River was the perfect spot. After three short but productive years, St. John's College (now Fordham University), the first Catholic institution of higher learning in the northeast, was established. In 1846, St. John's College was sold to the Jesuit Order and Archbishop Hughes recruited five Jesuit priests from St. Mary's College in Kentucky to staff the College. On April 10th of the same year, the governor of the State of New York granted the College a university charter. Then, in 1907, after the recent addition of a law school and medical school, the name was changed to Fordham University, and St. John's College became Fordham College. After remaining a men's college for 133 years, Fordham College merged with Thomas More College for women in 1974, becoming coeducational.\n\nAfter his thoughtful work founding what we now call Fordham University, Hughes went on to succeed his predecessor and former rector, Bishop John Dubois, in late December of 1842. In becoming the bishop of the Diocese of New York, Hughes assumed responsibility for a diocese that stretched across the entire state of New York and northern New Jersey. Always a man eager to spread God's holy Word, he embraced this new position with both courage and conviction. He worked zealously to uphold the dignity of each human being and the integrity of the Catholic faith, standing in unique solidarity with the Irish immigrants of his time and giving careful consideration to the ways by which young children were being educated on the foundations of the Catholic faith. And when the Diocese of New York was elevated to the status of an Archdiocese by Pope Pius IX, so, too, was Hughes' own status elevated to that of an Archbishop.\n\nThe vision of \"Dagger John,\" as Archbishop Hughes became known due to his aggressive and determined personality, remains actively alive at Fordham today. We know this because the men and women of Fordham emerge from their Jesuit experiences and are guided by conscience, empowered by competence, and fortified by a sincere sense of compassion. These are the characteristics of men and women who live with and for others."}, {"url": "https://www.irishtimes.com/opinion/from-tyrone-to-new-york-an-irishman-s-diary-about-archbishop-john-joseph-hughes-1.3124029", "page_content": "Born in Tyrone to a poor farming family on June 24th, 1797, John Joseph Hughes grew up to become the leading cleric of his day in the United States. The third son of seven children, Hughes began his life in the townland of Annaloughan near Augher.\n\nA hedge school contemporary was the novelist William Carleton, whose later works depict their early shared childhood. Hughes’s family suffered religious persecution, and his late sister was denied a Catholic burial conducted by a priest.\n\nAll of this played on his youthful mind, and in 1817, a year after his father had left for a new life in America, he emigrated there at the age of 20, working as a gardener in Mount St Mary’s seminary in Emmitsburg, Maryland.\n\nIn 1826 Hughes was ordained to the priesthood, serving as curate at St Augustine's Church in Philadelphia, where he founded the Catholic Herald newspaper. Twelve years later he arrived in New York and was appointed administrator of the diocese before being consecrated bishop in the old cathedral of St Patrick's in 1842. When New York was made an archdiocese in 1850, he became archbishop.\n\nREAD MORE\n\nA pugnacious orator, Hughes was a crusader against bigotry and slavery. During the third decade of the 19th century, the Catholic immigrant population had increased by 60 per cent to 600,000. Many were impoverished and ill-educated, and Hughes was determined they should not be treated as second-class citizens.\n\nHe was, he said, an American by choice, not by chance.\n\nThroughout his busy life he was involved in numerous projects. On his 44th birthday in 1841, he founded St John’s College (now Fordham University), the first Catholic institution of higher education in the northeastern US. Partly because of a lack of funds, he described it as a “daring and dangerous undertaking” but it thrived. Within a few years it became a Jesuit institution and in 2016 celebrated its dodransbicentennial (175th anniversary).\n\nTo this day, the founder’s illustrious memory lives on in Hughes Hall at Fordham’s business school, and in a Hughes statue at Rose Hill campus in the Bronx, where students can meet at Dagger John’s Pub. The pub’s name comes from a moniker applied to Hughes, who became known as “Dagger John”. This was derived from the fact that his episcopal signature was followed by the mark of a Christian cross in the appearance of a dagger; other theories suggest it was also because of his reputation for being short-tempered.\n\nIn between his work in America, Hughes found time to return to his native Ireland. He preached at St Macartan’s Church near his homeland of Augher in January 1846, six months before the building was dedicated. More than anything, he is best known for his work in founding St Patrick’s Cathedral in New York. On August 15th, 1858, he laid the cornerstone of the new uptown cathedral on Fifth Avenue before a crowd of 100,000. In those days, this was still a rural part of Manhattan and due to its remote location, the building was dubbed the “Hughes folly” by the press.\n\nDespite the put-downs that he experienced in his lifetime, his legacy lives on and he has been immortalized in a bronze bust and a blue plaque. In 2015, a bust of “Dagger John”, sculpted by Rowan Gillespie, was dedicated and blessed by Cardinal Timothy Dolan of New York.\n\nIt was produced as part of the Irish Giants series and stands on top of a four-metre column in Lower Manhattan near the old cathedral. Aside from his name and dates, it simply states: “Immigrant”.\n\nThree thousand miles across the Atlantic, Hughes’s name is held in esteem. And in his native country, the Ulster History Circle, which erects blue plaques to men and women of achievement, has honoured him at St Macartan’s. Amongst the dignitaries at the event was the Archbishop of Armagh and Primate of All Ireland, Eamon Martin, who unveiled the plaque outside the church set amidst the rolling Clogher Valley countryside looking across to the Monaghan drumlins.\n\nHughes died at 66 from Bright’s disease on January 3rd, 1864. His remains were initially interred in the old cathedral, but 19 years later they were transferred to their final resting place under the altar of the new cathedral on Fifth Avenue, which he never lived to see completed. His death brought many expressions of sympathy and a tribute from President Abraham Lincoln, for whom he had served as special envoy to Europe.\n\nPeople from across south Ulster reflect with pride on his achievements and of how a rural boy from humble beginnings rose to such dizzy ecclesiastical heights. Not only was he instrumental in founding St Patrick’s Cathedral, he also became one of the most influential men of his time and won the respect of many."}, {"url": "https://aoh.com/2021/03/16/archbishop-dagger-john-hughes/", "page_content": "John Joseph Hughes was born on 24 June 1797 in Annaloghan, Co. Tyrone, to a poor farmer. As a Catholic in English-ruled Ireland, he couldn’t even receive a Catholic education. When John was 15, his younger sister, Mary, died and British law barred a Catholic priest from presiding at her burial; the best he could do was to scoop up a handful of dirt, bless it, and hand it to John to sprinkle on her grave. Hughes never forgot that and dreamed of ‘a country in which no stigma of inferiority would be impressed on my brow, simply because I professed one creed or another.’ Fleeing poverty and persecution, John’s father brought the family to America in 1817 and settled in Chambersburg, PA. John made unsuccessful applications to study at Mount St. Mary’s College in Emmitsburg, MD, but was hired by its rector as a gardener. Working there rekindled his childhood dream of becoming a priest; he asked again if he could enroll as a student and was turned down because of his lack of education. John befriended Mother Elizabeth Ann Seton who persuaded the college to reconsider and Hughes was admitted in September 1820.\n\nAfter graduation, he served the diocese of Philadelphia as a seminarian until 5 October 1826 when he was ordained a priest by Bishop Henry Conwell. During his early years as a priest, Hughes founded St. John’s Orphan Asylum in 1829 and in 1832 was responsible for building the new church of St. John the Evangelist – one of the most impressive churches in the country at that time. His initiative was recognized and on 7 August 1837, Pope Gregory XVI made 40-year old Hughes coadjutor Bishop for the Diocese of New York, which then included all of New York State and northern New Jersey. He was consecrated in old St. Patrick’s Cathedral on 7 January 1838. Between 1820 and 1830, immigration had swelled the U.S. Catholic population to 600,000 with no end in sight. The new immigrants were mostly Irish: impoverished, uneducated and unskilled, with little to prepare them for New York’s urban environs. Hughes believed that the barrage of Nativist anti-Catholic prejudice at the time was demoralizing the already disadvantaged immigrants and holding back their progress.\n\nRecalling his own difficulties with a lack of education, he believed that the future of the Irish in America depended on secular education. At the time, the city’s schools were run by the Public School Society which received state funding. However, that society was a private Protestant group that taught that ‘emigration from Ireland of annually increasing numbers, extremely needy, and in many cases drunken and depraved, has become a subject for all our grave and fearful reflection.’ To get his flock educated, Hughes wanted an end to biased sectarian education. He contacted representative of New York’s Jewish community and allied with them to end all religious teaching in schools and through their efforts, the Maclay Bill of 1842 was enacted to bar all religious instruction from schools receiving state funds. On the night the bill was passed, a nativist mob attacked Hughes’s residence and members of the AOH were called to protect the city’s Catholic churches as they had done in 1841 and would do again in 1844.\n\nHaving reformed the public schools to help those non-protestant children who attended them, Hughes threw his energies into building a Catholic school system. ‘We have to build the schools first and the church after’ he said. In 1838 he felt that 100 acres bordering the Bronx River was the perfect spot for a new seminary and college and three years later, St. John’s College, the first Catholic institution of higher learning in the northeast, was established. On 10 April 1846, the State of New York granted the College a university charter and in 1907, after adding a law school and medical school, the name was changed to Fordham University.\n\nIn 1844, James Harper, was elected Mayor of New York supported by the anti-immigrant American Republican Party consisting mainly of Nativists. A highly organized group of anti-Catholic Protestant fundamentalists, they saw the Catholic Church as incompatible with democracy and believed the United States should be a land for Anglo-Saxon Protestants only. At the time, nativist riots in Philadelphia claimed the lives of 30 Irishmen and burned Catholic churches and convents. Bishop Hughes defending the rights of Irish Catholics against such bigotry and bloodshed, sent a letter to Mayor Harper warning that if any harm came to a single Catholic church, he would turn New York into another Moscow, referring to the burning of Moscow during Napoleon’s invasion in 1812. He then called on the AOH to defend the Cathedral. As a massive Nativist torchlight parade gathered in City Hall Park, ready to march up the Bowery to the Cathedral, he stationed the Hibernians on the protective walls around the Cathedral. The Nativists backed down and Hughes’ powerful message and forceful actions are credited with averting the same anti-Catholic violence in New York that had plagued Philadelphia. Hughes won the nickname of “Dagger John,” not only for the cross he penned beside his signature but also for being a man not to be trifled with!\n\nIn 1850, New York was elevated to the status of an Archdiocese by Pope Pius IX, so, too, was Hughes’ own status elevated to that of Archbishop. He continued a vigorous mission of building churches, schools, and hospitals. Future American President James Buchanan called him, ‘one of the ablest and most accomplished and energetic men I had ever known. In a far-seeing move that many ridiculed at the time as Hughes’ Folly, the Archbishop proposed the construction of a new Cathedral in an undeveloped area far uptown on Fifth Avenue between 50th and 51st streets. The property was purchased in 1810 for the sum of $11,000. Archbishop Hughes laid the cornerstone for the new Saint Patrick’s Cathedral on 15 August 1858.\n\nDuring the Civil War, Archbishop Hughes served as an envoy for President Lincoln on a successful overseas mission to dissuade European countries from supporting the Confederacy and in securing several officers of former Papal Army for the Union Army. In gratitude, Lincoln petitioned Pope Pius IX to name Archbishop Hughes as America’s first Cardinal. But the death took this indomitable leader in January 1864 before that honor could come to pass. His memory was honored by tributes from President Lincoln and other statesmen and his body viewed by over 200,000 people who solemnly came to worship in the old Cathedral where he was entombed in the crypts below. His body remained there until the new Cathedral was completed uptown and his remains were then removed to a crypt there in 1883. The new Cathedral holds the remains of all of the archbishops and cardinals that have served the Archdiocese since the death of Archbishop Hughes.\n\nA statue of Archbishop Hughes stands on Fordham campus and a bust on a pedestal was erected by AOH Div 9 NY and the Friendly Sons of St Patrick at the old Cathedral with 3 bronze plaques on the fence.\n\nMike McCormack, National Historian\n\nTHIS IRISH AMERICAN HERITAGE MONTH PROFILE IS PRESENTED BY THE ANCIENT ORDER OF HIBERNIANS (AOH.COM)\n\n#IrishAmericanHeritageMonth #EmbraceYourIrishHeritageAOH"}, {"url": "https://www.encyclopedia.com/people/philosophy-and-religion/roman-catholic-and-orthodox-churches-general-biographies/john-joseph-hughes", "page_content": "HUGHES, JOHN JOSEPH\n\nFirst archbishop of New York; b. County Tyrone, Ireland, June 24, 1797; d. New York, N.Y., Jan. 3, 1864. John was the third of seven children of Patrick and Margaret (McKenna) Hughes, small farmers who avoided involvement in Ireland's political disturbances. John attended the local schools, and soon showed an interest in the priesthood. In 1816 the father and an older son immigrated to the U. S., sending for John the following year, and for the rest of the family in 1818. They settled in Chambersburg, Pennsylvania, where John worked in the quarries, at mending roads, and as a gardener. He made several applications for admission to Mt. St. Mary's Seminary, Emmitsburg, Md., only to learn that there was no room. When, however, Rev. John dubois offered to take him as a gardener until a vacancy occurred, Hughes went to Mt. St. Mary's on Nov. 10, 1819, and a year later was received in the seminary. He was accepted by Bp. Henry conwell for the Diocese of phila delphia, Pa., and ordained in St. Joseph's Church, Philadelphia, on Oct. 15, 1826; arrangements were made for him to continue his studies under Michael Hurley, OSA, who was assigned to St. Augustine's parish in that city.\n\nCareer in Philadelphia. When Hughes arrived, the trustees of St. Mary's Cathedral were in open conflict with Conwell as a result of the Hogan schism, which dated from 1821. After about a year at St. Augustine's, where he had a chance to watch developments at St. Mary's, Hughes spent a few weeks as pastor of Bedford, Pa.; he was then recalled to Philadelphia to become, successively, pastor at St. Joseph's (January 1827) and at St. Mary's (April 1827). When the trustees of St. Mary's refused to pay his salary, he returned in July to St. Joseph's, where he remained until St. John's Church was built and dedicated in April 1832. The new church had no lay incorporators and Hughes administered his parish with a firm hand.\n\nAlthough highly successful in his pastoral activities, he attracted more attention by his controversial writings and speeches. His first published sermon, which enhanced his reputation as a preacher, was on Catholic emancipation, then recently granted in Ireland, and was dedicated to Daniel O'Connell, whom he greatly admired. Anti-Catholicism, then strong in Philadelphia, was expressed freely in sermons, lectures, and the bitterly polemical Protestant weeklies. There was no Catholic paper, since many Catholics, including Bp. Francis Kenrick, who had been appointed coadjutor with full jurisdiction in 1830, thought the best policy was to suffer in silence. Hughes, on the contrary, believed in a vigorous defense. He founded the Catholic Herald, a newspaper that he later turned over to the diocese. Earlier he had established a Catholic Tract Society to distribute free pamphlets. In 1830, using the pseudonym \"Cranmer,\" he wrote letters to the Protestant, a New York weekly specializing in anti-Catholic propaganda. When, however, his wildly improbable accounts of Catholic plots and progress failed to strain the credulity of the editors and readers, he exposed the hoax. His best known controversy in Philadelphia was with Dr. John Breckinridge, a Presbyterian clergyman, with whom he debated in writing (1833) and orally (1835) on the Rule of Faith, and Catholicism as an obstacle to civil and religious liberty.\n\nHughes did not overestimate the value of controversy, but used it to make the enemies of the Church more cautious and to raise the morale of the sorely tried Catholic masses. His talents and his achievements attracted attention, and his promotion to the episcopate was generally expected. He had been recommended as coadjutor of Philadelphia by Conwell in 1829, and for Cincinnati in 1833. In 1836 the Holy See designated Hughes as coadjutor of Philadelphia and Kenrick as bishop of a new see to be erected at Pittsburgh, but Gregory XVI delayed formal approval. In 1837 when the Third Provincial Council of Baltimore asked that the division of Philadelphia be postponed, Hughes was preconized titular bishop of Basileopolis and coadjutor, with the right of succession, of New York. He was consecrated there on Jan. 7, 1838, in old St. Patrick's Cathedral.\n\nNew York. The diocese then consisted of all of New York State and about one-half of New Jersey, an area of about 55,000 square miles. Hughes found 22 churches, 10 of which had been erected in 1837, and 40 priests, to serve the needs of 200,000 Catholics, in a total population of about 2,700,000. The Emmitsburg Sisters of Charity were the only religious community in the diocese. Seven parochial schools, all in New York City, and four orphan asylums, two of which were in the city, made up the total of Catholic charitable and educational institutions. The population of the U.S. was increasing rapidly; in New York City the increase was five times the national rate. Moreover, the churches of the city were burdened with a heavy debt, $300,000. When, in January 1838, Dubois suffered a stroke, responsibilty for the diocese devolved upon Hughes, who was named apostolic administrator in August 1839 and succeeded to the see on Dec. 20, 1842. He became archbishop of New York on July 19, 1850, when it was made an archdiocese.\n\nHughes's authority was challenged in February 1839, when the cathedral trustees had a catechist appointed by Dubois ejected from the Sunday school by the police. A pastoral, written by Hughes and signed by Dubois, threatened the parishoners with an interdict unless they repudiated the trustees. This was done promptly, at a meeting summoned, addressed, and presided over, by Hughes. Except for the parish of St. Louis in Buffalo, where the trustees held out for years, New York had no further difficulty with trusteeism.\n\nAfter a preliminary visitation of the diocese, Hughes went to Europe in October 1839, seeking aid in Paris, Rome, Munich, Vienna, and Dublin. On his return in 1840, he engaged in his greatest contest over the question of religion and the public schools. The Public School Society, a private organization, practically monopolized public funds for education in New York City from 1825 to 1840. Professedly nonsectarian, it provided religious training that was offensive to Catholics, who wanted state aid for denominational schools and a proportionate share of public funds. Governor William Seward agreed with the Catholics, but the city aldermen and the state legislature were hostile. The resultant controversy, which destroyed the Public School Society, led to two quite unexpected developments—the total secularization of U.S. public education on all levels, and the creation of the parochial school system in the U. S.\n\nThe growth of political nativism had led, in 1844, to the burning of Catholic churches and widespread riots in Philadelphia. Hughes's success in arousing his people to defend the churches against mob violence, while exhorting them to give no provocation, prevented similar disorders in New York. His firm stand on this and on the school question made him known throughout the country. Although attacked and misrepresented in the press, he was, nevertheless, highly respected in both Catholic and non-Catholic circles.\n\nHis achievements in the diocese included the erection of four new sees; the beginning of the new St. Patrick's Cathedral; the founding of a seminary, and of a college at Fordham, New York City, which he later transferred to the Jesuits; the introduction of many religions communities; and the development of charitable and educational works. He was instrumental in separating a group of Sisters of Charity from Emmitsburg, Md., thus founding the independent Mt. St. Vincent community in New York City.\n\nNational and International Affairs. Hughes was a vigorous defender of the temporal power of the pope, and sponsored more than one special collection to help Pius IX. He took a leading part in the founding of the North American College at Rome in 1859. Thoroughly unsym-pathetic to the abolitionist movement in the U. S., he believed that sudden emancipation would injure the slaves. He opposed plans to settle Irish immigrants on farm lands in the West, fearing they would be lost to the Church because of the shortage of priests. Although he endorsed Irish nationalism, he disapproved of risings that he thought could not succeed, and condemned Irish antislavery sentiment as an intrusion into U. S. politics. Because he was convinced of the basic harmony between American political institutions and Catholicism, he urged Catholic support of the U. S. Constitution and was friendly with officials of the national government. When President James Polk tried to send him to Mexico in 1847, he refused the mission because of its unofficial character. A visit to Europe in support of the Union, 1861–62, was undertaken at the request of President Lincoln and Secretary Seward. He was recommended to Rome for the red hat by Lincoln's government; when no action was taken, some believed the time was not ripe for an American cardinal, while others thought Hughes was not the best choice. His last public appearance was made in July 1863, at the request of New York Gov. Horatio Seymour, who was attempting to stop the draft riots that were then occurring in the City of New York.\n\nCharacter and Personality. Archbishop Hughes was a born leader and fighter. Prompt and vigorous in action, and unyielding in conflict, he believed he had the duty and the ability to lead and defend his people, and to prove that American Catholics were not second-class citizens. If he was autocratic and at times fought harder than was necessary, he merely displayed the defects of his virtues.\n\nAlthough Hughes became increasingly intolerant of disagreement, he nevertheless rendered valuable service to both Church and country. As his successor, Abp. John McCloskey, said: \"… if ever there was a man who in the whole history and character of his life impressed upon us the sense and conviction that he had been raised up by God, was chosen as His instrument to do an appointed work … that man was Archbishop Hughes.\" Hughes died of Bright's disease, after a long illness, and was buried in the old cathedral. His remains were translated to the new St. Patrick's Cathedral in 1883.\n\nBibliography: Complete Works, comp. and ed. l. kehoe, 2v. (New York 1865). j. r. hassard, Life of the Most Reverend John Hughes, D.D., First Archbishop of New York (New York 1866). h.a. brann, Most Reverend John Hughes: First Archbishop of New York (2d ed. New York 1912). e. m. connors, Church-State Relationships in Education in the State of New York (Washington 1951). f. d. cohalan, A Popular History of the Archdiocese of New York (Yonkers, N.Y. 1983). r. shaw, Dagger John: The Unquiet Life and Times of Archbishop John Hughes of New York (New York 1977).\n\n[f. d. cohalan]"}, {"url": "https://www.biblicaltraining.org/library/john-joseph-hughes", "page_content": ". Roman Catholic archbishop of New York. Born in Annalogham, Ireland, he went to the USA in 1817, was educated in Mount St. Mary Catholic College in Maryland, and was ordained in 1826. He served two parishes in Philadelphia until 1837, when he became coadjutor bishop of New York. He founded St. John's College (now Fordham University) in 1841. He became bishop of New York in 1842 and archbishop in 1850. He organized the parochial school system of New York and freed it from public and lay control. He began the building of St. Patrick's Cathedral in 1858 and led in the establishment of the North American College in Rome. Early in the Civil War he was successful as an envoy of the United States government in winning sympathy for the Union cause in France, Ireland, and Italy.\n\n\n\n"}, {"url": "https://www.fordhamprep.org/alumni/hall-of-honor/inductees-h-p/john-j-hughes", "page_content": "Founder, Fordham Prep & University\n\nFirst Archbishop of New York\n\n\n\nIt took a saint to find the priest in John Hughes.\n\nJohn Joseph Hughes was born on the Feast of the Nativity of St. John the Baptist, Midsummer's Day, June 24, 1797, in Annalogan, County Tyrone, in the north of Ireland. John was the third of seven children of Patrick Hughes and Margaret McKenna Hughes, who earned their living by working the land. Michael, Patrick, Mary, Peter, Ellen and Margaret were John's brothers and sisters, two of whom, Peter and Ellen died in childhood.\n\nThe early 19th century was a difficult time for Irish Catholics living under Protestant rule. For the Hughes family, the low point came when the family priest was barred by law from entering the cemetery where John’s sister was being interred. Within months, John’s parents decided to abandon Ireland and move their family to America.\n\n\n\nBy 1817, a 20-year-old John Hughes was working as a gardener and stonemason at Mount St. Mary’s College in Emmitsburg, Maryland. John had been given an opportunity to study horticulture there while he worked at Mount St. Mary’s, but he had his eye on another goal: being in America now seemed like the portal to his lifelong dream of becoming a priest. He was stung, however, by his failure to gain admission to the local seminary where the rector could not overlook his lack of education. Luckily for Hughes, he often met a visitor to Mount St. Mary’s — Mother Elizabeth Bayley Seton, a widow and convert to Catholicism who had started her own religious order, the Sisters of Charity.\n\nMother Seton, who would later become the first native-born American to be canonized (and, interestingly enough, a Prep grandparent: her grandson, William Seton was a member of the Class of 1848), would be John’s advocate for admission to the seminary. With the help of her considerable influence, John Joseph Hughes was ordained in Philadelphia in 1826.\n\nFrom his first days as a priest, he gained notoriety as a figure who stood against bigotry in its many forms. He wrote and preached on the shamefulness of slavery (though it is true that later in his career, he would be careful to sidestep the political implications of a full-out endorsement of the Abolitionists). And he became a crusader against the persecution of newly arrived Irish immigrants, who sometimes found their new lives in America nearly as bad as they had been in Ireland, if in a different way. Nativism was a crushing burden to Catholics of the time, and Hughes feared that as they had been in their homeland, Catholics in America would forever be considered second-class citizens.\n\n\n\nHis response to the hydra-headed Nativist movement — which included Protestant ministers, intellectuals and religious fundamentalists — was fierce and very public. As described by historians, when a Protestant newspaper ran an editorial focused on “traitorous Popery,” Hughes responded with a letter to the editorial board in which he called the authors the “clerical scum of the country.”\n\n\n\nIn 1834, Nativists put the blame for a cholera outbreak in Philadelphia squarely on the Irish. Hughes, risking his own life, worked to the breaking point to nurse and console the sick and dying. In contrast, a large percentage of the most notables among the Protestant clergy had fled the city. Afterwards, Hughes wrote a letter to the Gazette, which included this stinging remark about the absentee ministers: “[They are] remarkable for their pastoral solicitude so long as the flock is healthy, the pastures pleasant, and the fleece lubricant, abandoning their post when disease begins to spread dissolution in the fold.”\n\n\n\nThe year 1835 was a watershed for Hughes, still serving in Pennsylvania at the time. A socially eminent Princeton graduate and Presbyterian minister from New York named John Breckenridge challenged him to a public debate. Hughes, knowing that he might not be able to hold his own against the better-educated Breckenridge in a live, oral debate, instead suggested that it be conducted in the respective church newspapers. There was no Catholic newspaper in Philadelphia at the time, so Hughes had to start one. Week after week for nine months, the two clergymen battled it out in print, and the newspapers grew thicker and thicker. This publicly aggressive side of Hughes, along with the dagger-like cross with which he preceded signature, gave rise to his nickname, \"Dagger John.\"\n\nIt is unlikely that either man won many converts among their readership, but the drama turned Hughes into a hero for the immigrant Irish population.\n\nIn 1838, when he was just 40 years old, John Hughes was appointed coadjutor-bishop of New York to administrate the diocese for an aging Bishop John Dubois — coincidentally the very priest who had rebuffed his initial attempts to enter the seminary in Maryland. Almost immediately, Bishop Hughes was caught in a battle with New York City over its schools, which were essentially sectarian Protestant institutions where students read books describing Irish immigrants as “drunken” and “depraved” and were given Protestant religious instruction. Among his allies in this push to end sectarianism in the public schools were the city’s Jews and Unitarians. His efforts would eventually lead to the passage in of the Maclay Bill, which forbade religious instruction in public schools. The city’s Catholic churches were threatened the night the bill passed, and old Bishop Dubois, who was still living in the same residence with Hughes, was rescued by the police when mobs tried to burn down the building.\n\nDubois passed away later that year, and Hughes succeeded him as the fourth bishop of the Diocese of New York.\n\n\n\nBesides his battle against the New York City Public School Society, Hughes had also begun to establish a parallel Catholic school system, saying “We shall have to build the schoolhouse first and the church afterward.” Eventually, John Hughes would oversee the opening of scores of privately funded Catholic schools throughout the New York area.\n\n\n\nSchoolchildren were not Hughes’ only educational priority, for he turned his sights on higher education as well, an enterprise which he acknowledged to be a “daring and dangerous undertaking.” In an age when anti-Catholic sentiment was rife, Dagger John’s daring in the face of danger was the very stuff of which Fordham Prep and Fordham University were together born.\n\nMaking the journey to Westchester, of which the Bronx was still then a part, Bishop Hughes purchased Rose Hill Manor in the farming village of Fordham in 1839. In 1840, he established the first institution on the site: St. Joseph’s Seminary. A year later in 1841, on the Feast of the Nativity of St. John the Baptist, Midsummer’s Day, June 24th — Hughes’ 44th birthday — St. Joseph’s Seminary would share the land with Hughes' second Rose Hill endeavor: St. John’s College. The College would soon be organized into levels, or divisions. First Division would become Fordham University and Second Division would become what is today Fordham Prep.\n\nHughes would have a hand in Fordham’s Jesuit tradition as well. A few years later, his persistence would convince a band of Jesuits from a struggling college in Kentucky to take over operation of his new school.\n\nJohn Hughes lived a remarkable life. After founding St. John’s he also played a part in founding Manhattan College, Manhattanville College and the College of Mount St. Vincent. In July of 1850, when the Diocese of New York was elevated to an archdiocese, John Hughes became the first archbishop of New York. He would lay the cornerstone for St. Patrick’s Cathedral in 1858, one of the architects of which was none other than William Rodrigue, the architect of the University Church, the Prep’s first art teacher, and Hughes’ brother-in-law, the husband of his sister Margaret.\n\nIn 1861, at the personal request of President Lincoln, Hughes traveled to France to help win support for the Union cause in Europe.\n\n\n\nSome scholars credit Hughes with saving the Irish in America, his herculean efforts on their behalf pulling the community up from extreme poverty and the violence, illiteracy and despair that it bred. Many credit him as being one of the great builders of the Church in America. All agree that he was a man of forceful personality and indomitable spirit. For Fordham, he was all of these — and more — but he is first and foremost our Founder.\n\n\n\nAfter months of illness, His Excellency, the Most Reverend Archbishop John J. Hughes died on January 3, 1864. At the time of his death, he was being cared for by his two sisters, Margaret Hughes Rodrigue and Mother Mary Angelica Hughes, SC, mother general of the Sisters of Charity of New York. An estimated 100,000 people gatherered around the cathedral during his funeral. Initially interred at Old St. Patrick’s, his body was eventually moved to rest under the main altar at St. Patrick’s on Fifth Avenue.\n\n\n\nIn the words of his biographer, John Rose Greene Hassard, Class of 1855:"}, {"url": "https://news.fordham.edu/university-news/celebrating-the-180th-anniversary-of-fordhams-founding/", "page_content": "The elm-lined paths of the Rose Hill campus lead to a bronze statue of Fordham’s founder, Archbishop John Hughes, dedicated on June 24, 1891.\n\nOn June 24, 1841, Bishop John Hughes opened St. John’s College in the village of Fordham with just six students. It was the first Catholic institution of higher education in the Northeast. Five years later, the Jesuits took over the fledgling college, fulfilling the ardent hopes of Bishop Hughes, who’d always wanted the school to be in Jesuit hands. In 1907, having achieved university status, St. John’s College officially changed its name to Fordham University.\n\nToday, as we celebrate Fordham’s auspicious founding, we reflect on the story of an Irish immigrant who sought to elevate his people—and all immigrants—with the promise of higher education. Below is a 2016 homily delivered by Monsignor Thomas J. Shelley, Ph.D., GSAS ’66, professor emeritus of theology at Fordham.\n\nFounding Father: Archbishop John Hughes\n\nLady Chapel, St. Patrick’s Cathedral, June 24, 2016\n\n219 years ago today, on June 24, 1797, St. John’s Day, Fordham’s founding father, John Joseph Hughes, was born in the little village of Annalogan in County Tyrone, Ireland. “They told me when I was a boy,” he said, “that for the first five days I was on a social and civil equality with the most favored subject of the British Empire. These five days would be the interval between my birth and my baptism.” Once John Hughes was baptized a Catholic, however, like every Catholic in eighteenth-century Ireland, he immediately became a second-class citizen in the land of his birth.\n\nJohn Hughes also preserved another vivid childhood memory. When his younger sister died, after the funeral Mass, the parish priest led the funeral procession to the local cemetery, which was the property of the Protestant Church of Ireland. Catholic priests were forbidden by law from entering these cemeteries. And so, outside the gate of the cemetery, the parish priest bent down, scooped up a clump of earth in his hands, blessed it, and handed it to Hughes’s father to sprinkle it over his daughter’s coffin as it was lowered into the grave. Childhood memories of this kind are not easily erased, and John Hughes never forgot this example of the prejudice suffered by Catholics in his native land.\n\nJohn Hughes spent the first twenty years of his life in Ireland as the son of a poor Ulster farmer where he experienced not only prejudice but also the grinding poverty that prevented him from obtaining more than a rudimentary education. When he emigrated to America in 1817, he worked in the only occupations for which he was qualified, as a laborer in the construction trades and in quarries. When he applied for admission to a seminary to study for the priesthood, he had to spend his first year in remedial studies in order to qualify for the entrance requirements.\n\nExposure to prejudice and poverty was not limited to John Hughes. It was the common experience of Irish Catholics both in their homeland and in America. However, the difference was that America was the land of opportunity for immigrants, if they had the education to take advantage of these opportunities. This was one of the primary motives that led Bishop Hughes to establish St. John’s College at Fordham in 1841. He considered education the indispensable means for the members of his immigrant flock to break loose from the cycle of poverty that ensnared them and that prevented them from participating in what today we would call the American dream. John Hughes’s first biographer, John Hassard, a graduate of St. John’s College, Fordham, in 1855, and Hughes’s former secretary who knew him well, said, “The subject that of all others that [Hughes] had nearest his heart was education.”\n\nA public official who saw what Hughes was doing and came to admire him greatly was William Seward, the politically astute governor of New York State. Later, as secretary of state during the Civil War, Seward became the indispensable man in Lincoln’s cabinet. Governor Seward told Hughes, “You have begun a great work in the elevation of the rejected immigrant, a work auspicious to the destiny of that class and still more beneficial to our common country.” Incidentally Hughes never made a distinction between Catholic and non-Catholic immigrants. He framed the issue this way, that foreign-born American citizens should enjoy the same legal rights as native-born American citizens.\n\nBishop Hughes became the effective leader of New York Catholics in June 1839. Only two months later he made his first major decision when he purchased 106 acres at Rose Hill for a college, which confirms the statement of John Hassard that “the subject of all others that [Hughes] had nearest his heart was education.” The price of the real estate was $30,000 ($29,750) and Hughes needed an additional $10,000 to renovate the two buildings on the property. “I had not, when I purchased the site of this new college, St. John’s, Fordham,” Bishop Hughes said, “so much as a penny wherewith to commence the payment for it.” He immediately launched a fund-raising campaign among New York’s impoverished Catholics. After nine months the campaign netted a paltry $10,000. Hughes then went to Europe on a ten-month begging trip, and generous Catholics in France and Austria contributed the money that he needed to start St. John’s College at Fordham.\n\nJohn Hughes’s new college opened its doors 175 years ago today, on St. John’s Day, June 24, 1841, with a grand total of six students. The faculty was larger than the student body. For the next five years Hughes struggled to maintain his college as a diocesan institution with a faculty of New York diocesan priests, but it was a losing battle. There were four presidents in five years. One president became a cardinal, another became an archbishop, but neither of them was a professional educator.\n\nThen there was a third diocesan priest as president, the ineffable and eminently forgettable Ambrose Manahan, a scatterbrain cleric whom Hughes dismissed for incompetence. When Hughes gave him his walking papers, he sent him this priceless letter, “I advise you to resign . . . in the almost extinguished hope that, on a new scene where your future character will be determined by your future conduct, you may disappoint the melancholy anticipations that the past is too well calculated to inspire.” Fordham’s founding father may not have had much formal education, but he certainly possessed the innate Irish gift of eloquence.\n\nFordham’s fourth and most capable diocesan president was a young cleric named Father John Harley, but he died at the age of twenty-nine, a not uncommon occurrence at that time because of the rigors of seminary education. Hughes had no one among his own diocesan clergy to replace Harley, and so in 1845 he turned to the Society of Jesus, an international order of scholars with a reputation as professional educators, to take charge of his fledgling college. The Jesuits in turn were happy to establish a foothold in the largest city in the United States.\n\nAlthough St. John’s College remained a diocesan college for only five years, we rightly honor Archbishop John Hughes today as our founding father. It was he who purchased the property at Rose Hill, raised the funds to pay for it, recruited the original faculty and administration, obtained the state charter and left to the Jesuits a flourishing little college whose ownership they were happy to obtain. It was no mean accomplishment even for a man of the stature of John Joseph Hughes.\n\nI do not think that the influence of John Hughes on Fordham University is limited to the past. In many respects he remains an inspiration for us today. For example, you are all familiar with the statue of Archbishop Hughes outside Cunniffe House on the Rose Hill campus. That statue was the gift of the alumni on the occasion of the fiftieth anniversary of St. John’s College, Fordham, in 1891. Many of the alumni would have known Hughes when they were students. Hughes had only been dead for 27 years.\n\nThe alumni wanted these words of John Hughes to be engraved on the pedestal of the statue: “I have always preached that every denomination, Jews, Christians, Catholics, Protestants—of every shade and sex—were all entitled to entire freedom of conscience, without let or hindrance from any sect or number of sects, no matter how small their number or how unpopular the doctrine that they profess.”\n\nUnfortunately those words of John Hughes were not engraved on the pedestal of his statue perhaps, perhaps—and here I am only guessing—because the theologically conservative Jesuit Fathers at Fordham considered John Hughes’s words to be too bold and radical. They certainly would have set off alarm bells in the Vatican. However, in 1965, the Second Vatican Council effectively if posthumously endorsed those words of Archbishop Hughes in its Declaration on Religious Liberty and in Nostra Aetate, the council’s document on the relationship between the Catholic Church and the Jewish people. Isn’t it inspiring to know that, at least in this all-important area of freedom of conscience, our founding father anticipated the work of the Second Vatican Council by a whole century?\n\nJohn Hughes was no Mother Theresa. He will never be canonized because, among his many other qualities, he was a tough and feisty street fighter who gave no quarter and asked no quarter in an often hostile environment. In 1844 a Nativist mob unleashed several days of rioting and violence on the Catholic community in Philadelphia. They then threatened to do the same thing in New York City. Bishop Hughes told the Nativist mayor of New York City, James Harper, that, if any harm came to his churches, he would turn the city into “a second Moscow,” a reference to the destruction of Moscow by the Russians in 1812 when Napoleon attacked the city.\n\nThat does not sound like Mother Theresa. To be honest, it is also far removed from the spirit of the Sermon on the Mount. But it worked and may be justified on the grounds that it preserved peace and law and order. The Nativist leaders backed down and disbanded their mob and spared New York City from the violence that only days earlier had engulfed the city of Philadelphia.\n\nMany historians have criticized Archbishop Hughes for his bellicose style of leadership, but at least one distinguished historian of American Catholicism, Monsignor John Tracy Ellis, offered a more nuanced appraisal of John Hughes’s leadership. Ellis said that “there were times when [Hughes’s’] very aggressiveness was about the only approach that would serve the end that he was seeking, viz., justice for his people.” An integral element in his quest to obtain justice for his people and to give them economic and social equality in American society was to give them access to higher education. That is why he went to such great pains to establish the university whose 175th anniversary we celebrate today.\n\nIt is difficult to envision anyone else in the Catholic community in nineteenth-century New York City who could have accomplished what Archbishop John Hughes did for “the elevation of the rejected immigrant” (to quote again Governor William Seward). A key element in Archbishop Hughes’s plan to elevate the rejected immigrant was to give them the opportunity for a college education. We all owe him a great debt of gratitude for establishing St. John’s College at Rose Hill, the future Fordham University. It is a debt that we gladly acknowledge today and will continue to acknowledge and repeat in many different ways over the course of the next twelve months.\n\nThomas J. Shelley"}, {"url": "https://www.infoplease.com/encyclopedia/people/religion-phil/catholic-orthodox/hughes-john-joseph", "page_content": "See his works (ed. by L. Kehoe, 1864); biographies by J. R. G. Hassard (1866, repr. 1969) and J. Loughery (2018); study by V. P. Lannie (1968).\n\n1797–1864, American Roman Catholic churchman, b. Co. Tyrone, Ireland. He joined his family in the United States in 1817 and on graduating from Mt. St. Mary's College, Emmitsburg, Md., was ordained (1826). He served mostly in Philadelphia until 1838, when he was consecrated bishop and became coadjutor to Bishop John Dubois in New York. In 1842, Hughes was made bishop, and in 1850 the first archbishop of New York. He obtained for the church complete control of its property by the clergy. A resolute and ardent defender of Catholicism, he engaged in debates, worked actively in behalf of Irish immigrants, and strongly urged the obliteration of European national affiliations in American Catholicism. His vigorous but unsuccessful attempt to secure state support for religious schools carried him into politics and led to the establishment of the independent Catholic school system. In the Civil War, Abraham Lincoln sent him to France to promote a friendly attitude toward the Union cause. He founded (1841) St. John's College (now Fordham Univ.) and laid (1858) the cornerstone of St. Patrick's Cathedral, New York City.\n\nThe Columbia Electronic Encyclopedia, 6th ed. Copyright © 2023, Columbia University Press. All rights reserved.\n\nSee more Encyclopedia articles on: Roman Catholic and Orthodox churches: General Biographies"}, {"url": "https://adb.anu.edu.au/biography/hughes-john-12995", "page_content": "by Chris Cunneen\n\nJohn Hughes (1825-1885), grocer, property developer and Catholic benefactor, was born on 24 June 1825 at Drumshambo, Leitrim, Ireland, eldest son of six children of Thomas Hughes, grocer, and his wife Maria, née Cogan. The family arrived in Sydney as bounty immigrants in the Crusader on 15 January 1840. Educated from July to December that year at Sydney College under W. T. Cape, John was apprenticed to John Stirling, a grocer. After working for T. & R. Coveny, of Market Street, he obtained a position with Samuel Peek in George Street before going into business on his own about 1851 on the corner of Market and George streets. Prospering, he married Irish-born Susan Sharkey at St Mary's Catholic Cathedral on 2 July 1856. They were to have eight children.\n\nSelling out his retail grocery in 1862 Hughes began as a wholesale merchant and importer, first in Clarence, later in York, Street. Again he was successful and in 1871 retired to attend to pastoral pursuits, purchasing Narromine station, near Dubbo, and other properties. He also invested in land and developed city business sites such as the warehouse he erected for Messrs Young & Lark in Castlereagh Street. In 1866 and 1871 he had been defeated in elections for the Fitzroy Ward in the Sydney Municipal Council. Selling his pastoral interests, in 1879-81 he and his family travelled in the United States of America and Europe.\n\nAppointed a justice of the peace in 1867, Hughes attended zealously to his duties, sitting for many years as magistrate in the police courts of Sydney. He was both a pillar of the Catholic Church and a loyal citizen, in 1868 refusing to serve on the St Patrick's Day regatta committee with a man who had declined to toast the Queen's health. Hughes generously supported Catholic charities and was notable for his contribution, both as a committee-member and benefactor, to the rebuilding of St Mary's Cathedral, where he worshipped. The new building was dedicated in 1882. In addition he was largely responsible for bringing the Sisters of the Society of the Sacred Heart of Jesus to Sydney that year, funding their establishment of a convent at Rose Bay. He also donated the site for St Canice's Church, Elizabeth Bay; marble altars for St Ignatius' College, Riverview, and St Columbkille's Church, Woolloomooloo; the baptismal font at St Patrick's Church and marble fonts in St Mary's Cathedral; and helped to establish scholarships in honour of Archbishop Vaughan at St Ignatius'.\n\nHaving purchased land at Elizabeth Bay in 1869, over the next five years Hughes built an elegant residence, which he named Kincoppal (Erse for sea-horse) after a rock formation in the harbour nearby. In 1882 the Pope appointed him knight of the Order of St Gregory; he was later promoted knight commander but before receiving the brief died at his home on 29 June 1885. Hughes was buried in Waverley cemetery after a requiem mass at St Mary's Cathedral. He was survived by his wife, two sons and four daughters, two of whom became Sisters of the Sacred Heart; Kincoppal was bequeathed to the elder, Maria (1858-1951). There in 1909 the order set up a school of which she became superior. Hughes's sons (Sir) Thomas and John and their descendants were prominent in law and politics in Sydney in the next century. After the Elizabeth Bay property was redeveloped, Kincoppal and Rose Bay convents of the Sacred Heart were amalgamated at Rose Bay in 1971."}], "John Joseph Hughes was ordained a priest in 1819.": [{"url": "https://www.encyclopedia.com/people/philosophy-and-religion/roman-catholic-and-orthodox-churches-general-biographies/john-joseph-hughes", "page_content": "HUGHES, JOHN JOSEPH\n\nFirst archbishop of New York; b. County Tyrone, Ireland, June 24, 1797; d. New York, N.Y., Jan. 3, 1864. John was the third of seven children of Patrick and Margaret (McKenna) Hughes, small farmers who avoided involvement in Ireland's political disturbances. John attended the local schools, and soon showed an interest in the priesthood. In 1816 the father and an older son immigrated to the U. S., sending for John the following year, and for the rest of the family in 1818. They settled in Chambersburg, Pennsylvania, where John worked in the quarries, at mending roads, and as a gardener. He made several applications for admission to Mt. St. Mary's Seminary, Emmitsburg, Md., only to learn that there was no room. When, however, Rev. John dubois offered to take him as a gardener until a vacancy occurred, Hughes went to Mt. St. Mary's on Nov. 10, 1819, and a year later was received in the seminary. He was accepted by Bp. Henry conwell for the Diocese of phila delphia, Pa., and ordained in St. Joseph's Church, Philadelphia, on Oct. 15, 1826; arrangements were made for him to continue his studies under Michael Hurley, OSA, who was assigned to St. Augustine's parish in that city.\n\nCareer in Philadelphia. When Hughes arrived, the trustees of St. Mary's Cathedral were in open conflict with Conwell as a result of the Hogan schism, which dated from 1821. After about a year at St. Augustine's, where he had a chance to watch developments at St. Mary's, Hughes spent a few weeks as pastor of Bedford, Pa.; he was then recalled to Philadelphia to become, successively, pastor at St. Joseph's (January 1827) and at St. Mary's (April 1827). When the trustees of St. Mary's refused to pay his salary, he returned in July to St. Joseph's, where he remained until St. John's Church was built and dedicated in April 1832. The new church had no lay incorporators and Hughes administered his parish with a firm hand.\n\nAlthough highly successful in his pastoral activities, he attracted more attention by his controversial writings and speeches. His first published sermon, which enhanced his reputation as a preacher, was on Catholic emancipation, then recently granted in Ireland, and was dedicated to Daniel O'Connell, whom he greatly admired. Anti-Catholicism, then strong in Philadelphia, was expressed freely in sermons, lectures, and the bitterly polemical Protestant weeklies. There was no Catholic paper, since many Catholics, including Bp. Francis Kenrick, who had been appointed coadjutor with full jurisdiction in 1830, thought the best policy was to suffer in silence. Hughes, on the contrary, believed in a vigorous defense. He founded the Catholic Herald, a newspaper that he later turned over to the diocese. Earlier he had established a Catholic Tract Society to distribute free pamphlets. In 1830, using the pseudonym \"Cranmer,\" he wrote letters to the Protestant, a New York weekly specializing in anti-Catholic propaganda. When, however, his wildly improbable accounts of Catholic plots and progress failed to strain the credulity of the editors and readers, he exposed the hoax. His best known controversy in Philadelphia was with Dr. John Breckinridge, a Presbyterian clergyman, with whom he debated in writing (1833) and orally (1835) on the Rule of Faith, and Catholicism as an obstacle to civil and religious liberty.\n\nHughes did not overestimate the value of controversy, but used it to make the enemies of the Church more cautious and to raise the morale of the sorely tried Catholic masses. His talents and his achievements attracted attention, and his promotion to the episcopate was generally expected. He had been recommended as coadjutor of Philadelphia by Conwell in 1829, and for Cincinnati in 1833. In 1836 the Holy See designated Hughes as coadjutor of Philadelphia and Kenrick as bishop of a new see to be erected at Pittsburgh, but Gregory XVI delayed formal approval. In 1837 when the Third Provincial Council of Baltimore asked that the division of Philadelphia be postponed, Hughes was preconized titular bishop of Basileopolis and coadjutor, with the right of succession, of New York. He was consecrated there on Jan. 7, 1838, in old St. Patrick's Cathedral.\n\nNew York. The diocese then consisted of all of New York State and about one-half of New Jersey, an area of about 55,000 square miles. Hughes found 22 churches, 10 of which had been erected in 1837, and 40 priests, to serve the needs of 200,000 Catholics, in a total population of about 2,700,000. The Emmitsburg Sisters of Charity were the only religious community in the diocese. Seven parochial schools, all in New York City, and four orphan asylums, two of which were in the city, made up the total of Catholic charitable and educational institutions. The population of the U.S. was increasing rapidly; in New York City the increase was five times the national rate. Moreover, the churches of the city were burdened with a heavy debt, $300,000. When, in January 1838, Dubois suffered a stroke, responsibilty for the diocese devolved upon Hughes, who was named apostolic administrator in August 1839 and succeeded to the see on Dec. 20, 1842. He became archbishop of New York on July 19, 1850, when it was made an archdiocese.\n\nHughes's authority was challenged in February 1839, when the cathedral trustees had a catechist appointed by Dubois ejected from the Sunday school by the police. A pastoral, written by Hughes and signed by Dubois, threatened the parishoners with an interdict unless they repudiated the trustees. This was done promptly, at a meeting summoned, addressed, and presided over, by Hughes. Except for the parish of St. Louis in Buffalo, where the trustees held out for years, New York had no further difficulty with trusteeism.\n\nAfter a preliminary visitation of the diocese, Hughes went to Europe in October 1839, seeking aid in Paris, Rome, Munich, Vienna, and Dublin. On his return in 1840, he engaged in his greatest contest over the question of religion and the public schools. The Public School Society, a private organization, practically monopolized public funds for education in New York City from 1825 to 1840. Professedly nonsectarian, it provided religious training that was offensive to Catholics, who wanted state aid for denominational schools and a proportionate share of public funds. Governor William Seward agreed with the Catholics, but the city aldermen and the state legislature were hostile. The resultant controversy, which destroyed the Public School Society, led to two quite unexpected developments—the total secularization of U.S. public education on all levels, and the creation of the parochial school system in the U. S.\n\nThe growth of political nativism had led, in 1844, to the burning of Catholic churches and widespread riots in Philadelphia. Hughes's success in arousing his people to defend the churches against mob violence, while exhorting them to give no provocation, prevented similar disorders in New York. His firm stand on this and on the school question made him known throughout the country. Although attacked and misrepresented in the press, he was, nevertheless, highly respected in both Catholic and non-Catholic circles.\n\nHis achievements in the diocese included the erection of four new sees; the beginning of the new St. Patrick's Cathedral; the founding of a seminary, and of a college at Fordham, New York City, which he later transferred to the Jesuits; the introduction of many religions communities; and the development of charitable and educational works. He was instrumental in separating a group of Sisters of Charity from Emmitsburg, Md., thus founding the independent Mt. St. Vincent community in New York City.\n\nNational and International Affairs. Hughes was a vigorous defender of the temporal power of the pope, and sponsored more than one special collection to help Pius IX. He took a leading part in the founding of the North American College at Rome in 1859. Thoroughly unsym-pathetic to the abolitionist movement in the U. S., he believed that sudden emancipation would injure the slaves. He opposed plans to settle Irish immigrants on farm lands in the West, fearing they would be lost to the Church because of the shortage of priests. Although he endorsed Irish nationalism, he disapproved of risings that he thought could not succeed, and condemned Irish antislavery sentiment as an intrusion into U. S. politics. Because he was convinced of the basic harmony between American political institutions and Catholicism, he urged Catholic support of the U. S. Constitution and was friendly with officials of the national government. When President James Polk tried to send him to Mexico in 1847, he refused the mission because of its unofficial character. A visit to Europe in support of the Union, 1861–62, was undertaken at the request of President Lincoln and Secretary Seward. He was recommended to Rome for the red hat by Lincoln's government; when no action was taken, some believed the time was not ripe for an American cardinal, while others thought Hughes was not the best choice. His last public appearance was made in July 1863, at the request of New York Gov. Horatio Seymour, who was attempting to stop the draft riots that were then occurring in the City of New York.\n\nCharacter and Personality. Archbishop Hughes was a born leader and fighter. Prompt and vigorous in action, and unyielding in conflict, he believed he had the duty and the ability to lead and defend his people, and to prove that American Catholics were not second-class citizens. If he was autocratic and at times fought harder than was necessary, he merely displayed the defects of his virtues.\n\nAlthough Hughes became increasingly intolerant of disagreement, he nevertheless rendered valuable service to both Church and country. As his successor, Abp. John McCloskey, said: \"… if ever there was a man who in the whole history and character of his life impressed upon us the sense and conviction that he had been raised up by God, was chosen as His instrument to do an appointed work … that man was Archbishop Hughes.\" Hughes died of Bright's disease, after a long illness, and was buried in the old cathedral. His remains were translated to the new St. Patrick's Cathedral in 1883.\n\nBibliography: Complete Works, comp. and ed. l. kehoe, 2v. (New York 1865). j. r. hassard, Life of the Most Reverend John Hughes, D.D., First Archbishop of New York (New York 1866). h.a. brann, Most Reverend John Hughes: First Archbishop of New York (2d ed. New York 1912). e. m. connors, Church-State Relationships in Education in the State of New York (Washington 1951). f. d. cohalan, A Popular History of the Archdiocese of New York (Yonkers, N.Y. 1983). r. shaw, Dagger John: The Unquiet Life and Times of Archbishop John Hughes of New York (New York 1977).\n\n[f. d. cohalan]"}, {"url": "https://www.dib.ie/biography/hughes-john-joseph-a4146", "page_content": "Hughes, John Joseph (1797–1864), third resident catholic bishop and first archbishop of New York, was probably born 23 June 1797 (being baptised on 24 June) at Annaloghan, near Clogher, Co. Tyrone, third son among seven children of Patrick Hughes, farmer and weaver from Dernaved, and his wife Margaret (née McKenna). A parish and hedge school contemporary was the novelist William Carleton (qv) (whom Hughes later aided when visiting Dublin in 1862); Carleton's better work depicts their earlier shared background. After 1800 the family moved to a farmhouse in Dernaved townland, nearby in Co. Monaghan (since rebuilt at the Ulster American Folk Park). Unusually Hughes stayed in a chapel school there until 16 (or 17) to prepare for priesthood. A bad farming year then caused his withdrawal and training as a gardener (1814). Two of his siblings died around this time. His father went (1816) to Chambersburg, Pennsylvania, to prepare a life for the remaining family; John himself went out in 1817, and the rest followed in 1818. John worked as a labourer in Maryland, then as a gardener at St Joseph's school, Emmitsburg, which shared a campus with Mount St Mary's, a secondary school with a senior seminary stream. Its Parisian-born rector Fr John Dubois thwarted Hughes's desire to become a seminarian until St Joseph's superior, Mother (later St) Elizabeth Seton, stressed his merit. Dubois then hired him as overseer of his farm and slaves until he saw for himself the Tyrone man's capacities, and allowed him to enter the school by age 23. On 15 October 1826 Hughes was ordained for Philadelphia, a month before Fr Dubois was himself installed as bishop of New York.\n\nEarly career, 1826–38 Hughes had thus already observed the command of others and practised it as a foreman, a local controversialist, and a funds collector. Two cultured European priests, Dubois and Simon Bruté, formed him; two American converts, Mother Seton and Fr Samuel Cooper, influenced him. As a seminarian he was sponsored by Philadelphia's bishop, who liked him – the aged Ulster churchman Henry Conwell, sent there in 1820 when already 75. Hughes witnessed the bishop's loss of power to the fractious (and briefly schismatic) local lay trustees of St Mary's, the city's premier (and cathedral) church, to which Hughes was himself appointed pastor in spring 1827. There he decided that clear hierarchy was the way forward, and mobilised the ‘new’ Irish against the trustees. In 1830 Francis Kenrick (qv), a Dubliner educated in Rome and there ordained in April 1821, was put in with some control as coadjutor bishop to Conwell. Hughes's exact contemporary, they differed markedly. Hughes held that the morale of the poorer Irish required a forceful counter-attack on the anti-catholicism then spreading as a result of the convergence of new mass Irish immigration and America's evangelical revival. Both Dublin and Rome had shaped Kenrick's more irenic approach, which was not dissimilar to that religiously usual in Philadelphia's older catholic community. Hughes acted boldly on each front. He rejected the claim that substantial lay power in church matters was appropriate to the new nation's civic or ‘republican’ culture, and linked it to wider anti-catholic propaganda. Instead he shaped a relevant apologetics and a joint political argumentation. American religious and civil freedoms required that catholics sustain their position, not that they hide or negate it. Religious prejudice against them was both anti-American, and all too reminiscent of the position but recently endured in Ireland. But his own initially abusive polemics marred his case. As Dubois once disciplined him for bullying students when a prefect, Kenrick now rebuked his uncharity. Hughes learned to modify his methods as he matured his insights. Gradually he transformed the thrust of ‘Americanisation’ among many catholics to one that accommodated a robust group-assertion, rather than cultivated the pieties of otherness quietly, or adjusted more or less to socio-political secularity.\n\nCoadjutor and archbishop of New York, 1838–64 Leadership of catholic New York, the epicentre of catholic immigration, offered him a wider context. Hughes was consecrated coadjutor there on 7 January 1838, taking effective command when Dubois suffered a stroke within the month. Dubois had been consecrated at 62 for New York. Lay factions rode roughshod over him. Within ten years he was exhausted, and died on 20 December 1842. Hughes had right of immediate succession. In 1850 New York was made an archdiocese; on 3 October 1850 Hughes received the documents (issued 19 July) confirming this and appointing him archbishop. He was given the pallium personally by Pius IX on 3 April 1851.\n\nThus from February 1838 until his final incapacity (from Bright's disease) in autumn 1863, the Irish-born prelate effectively ruled the diocese and then archdiocese. Within state and nation, he sought to change ‘an apologetic people . . . into a militant people’ (R. J. Purcell, DAB, ix (v, pt 1), 353). Gradually he won acceptance of this by official (but not popular) America, perhaps because in his archdiocese he harmonised massive catholic growth with the city's secular expansion. While he could not provide fully for the huge increases of his people, he provided New York's model ecclesial and school structures for a century. He pioneered and focused its metropolitan character. Twice he cut his jurisdiction's extent, to one-eleventh its original size, carving off almost all upstate New York in 1847, and Long Island and northern New Jersey in 1853. Hughes opened twenty-three parishes during 1840–63 within the city, and a further thirty-seven in the lower Hudson valley outside it. Manhattan's population more than doubled to 805,358 by 1860, its Irish-born then 203,730. Despite such increase, practising catholics for each city parish grew only slightly (10 per cent) from 1840 to 1865, vindicating his new creations. About one-half of catholics practised in the city itself, partly as the provision of parochial schools for their offspring remained very inadequate, with only 5,000 children covered in 1840 and 12,000 in 1860.\n\nIn 1840 Hughes sought to overthrow the city's Public School Society (wholly protestant) and its curricula, and to gain New York state recognition and funding for parochial schools. The state then created a secular public school system for the city, run on district lines. Hughes thus triggered the emergence of exclusively secular public schools, and thereby turned many moderate protestants toward nativism, as express Christian education was driven from their schools of choice. Yet he failed to win the funding that could have held his own poor more fully to their church. In 1857 he said: ‘In our age, the question of education is the question of the church’ (Cohalan, 56). His delivery was thus plainly unequal to his vision. His strategy of exclusive and defensive concentration, however understandable, left many unprovided for, with results later modified only by the rising and more politic affluence of many catholics. Through informal ‘Tammany’ links his successor John McCloskey wisely gained catholic teachers in the new district schools educating most catholic children. Hughes did, however, create the formative free parochial school system in the city.\n\nHughes gradually squeezed lay trusteeism out of New York. Despite a Know-Nothing law to prop it up (1855), he won a state law guaranteeing episcopal title to church properties (1863). He often co-opted trustees onto replacement boards of management. He won informal approval for a catholic chaplaincy in the US military by 1847, and its expansion in 1861 through William Seward, a friend since 1840.\n\nGaining major funding for New York from various missionary societies in Europe, he convinced Rome that his archdiocese must be a chief priority of the missionary church. He relied on a seasoned inner circle of pre-1835 fellow immigrants active in business (with whom he set up the Emigrant Savings Bank) to fund major projects, including the start of St Patrick's cathedral. He introduced many religious orders, including the Redemptorists (1841), the Irish Sisters of Mercy (May 1846), the Jesuits (also 1846) (granting them control of the nascent Fordham), and the Christian [D. L. Salle] Brothers in two stages (1848, 1853). Oddly, he split Mother Seton's original order by his drive to control their local work; those accepting this (including his sister, Ellen) created a new order based in the city (1846), while – fearing further such pressures elsewhere – the original American Sisters of Charity affiliated to the French Daughters of Charity (St Vincent de Paul) in 1850. Hughes was no ‘devotionalist’ in the by-then-current French or Italian styles. Critics of most Irish clergy, such as George Templeton Strong and John Blake Dillon (qv), excepted him as a man of doctrine, clarity, and intelligence. In 1846 he introduced the choice of the Blessed Virgin as patroness of the US at the sixth provincial council in Baltimore. Though he disliked ‘national’ parishes, Hughes did accept German and French ones, though he distanced Italian claims. He also accepted the creation both of ‘select’ (fee-paying) schools, and of up-market parishes (St Ann's, St Francis Xavier). His view of an urban American church was thus realist and comprehensive. He was certainly no Irish-ghetto builder. To Bishop John England (qv), Hughes was an ‘emphatically self-made man’ (Shaw, Dagger John, 91). He advanced many American-born and convert catholics as vital to his church's future.\n\nHe famously faced off public authority when nativist riots impended in April 1844. But this obscures a deeper change. His early and continued counter-polemics with anti-catholic partisans (e.g., Controversy between Rev. Messrs Hughes and Breckenridge (1834); Kirwan unmasked (1848)) gave way to the realisation that in an emergent metropolis with a bare majority then catholic (if problematically so), the analogous problems had shifted to those posed by the attractions of secularity, the indifference of elites, and the irresolute commitment of many formal adherents. The Know-Nothings of 1854–5 did not worry him as much as had their 1840s forerunners. His later battles were with secular spokesmen who respected him, notably Horace Greeley of the New York Tribune, and James G. Bennett, editor of the New York Herald, both highly political men. All three sought rival definitions of a culture, variously to sustain, exclude, contain, or modify Hughes's insistence that American liberty accept the spiritual obediences of catholics as fully licit, and their culture as a public contribution to urban and national vitality and order. His disputes with immigrant Young Ireland and Confederation leaders of 1848 had similar roots (except in the breaches with Thomas D'Arcy McGee (qv), who was less sanguine about both America and its Irish than was Hughes). A supporter of Daniel O'Connell (qv), and very active in famine relief, Hughes showed initial sympathy for both 1848 goals and later the Fenians, unsurprisingly given the trend to an overlap of Defender and United Irish interests in his childhood townlands.\n\nPolitically, and unlike most Irish, Hughes disliked the Democrats (despite many Democratic associates) for their assertive secularity, regretted Irish captivity to them, and preferred the orderly Whigs. Like most Irish, he distrusted the anti-slavery enthusiasms of the new Republicans. Having tried a ‘catholic’ slate in 1841 during the schools battle, thereafter he held that catholics as such ought to be non-partisan. This precedent became a tradition and was upheld by most Irish American bishops and laity (notably in 1901).\n\nYet Hughes had not forgotten the youthful anti-slavery reactions of his own Maryland years. His reform patriotism was deepened by many trips to Europe (October 1839–February 1840, summer 1843, December 1845, December 1850–July 1851), on which he was scandalised by Old World inequities. The shock of southern secession elicited a mature loyalty to the US, made contentious in his city in that many of his people's editors and leaders were Democrats wishing a ‘moderate’ and short war and a negotiated peace. The Lincoln administration sent him to France and Rome on the union's behalf in late 1861. He stayed in Rome until summer 1862.The anti-draft riots of July 1863 shadowed his last year, but his standing curbed their divisive impact.\n\nIt is as flexible planner of a metropolitan catholicism in a culture of multiple freedoms that he is most admirable. He disciplined his ‘tough’ and combative sides to that task. A rural Irishman seasoned to a rural America, Hughes tamed an urban-ward flood. His opposition to mass westward colonisation by the Irish newcomers reflected his close experience of farming in both Ireland and America; he did not oppose migration by stages to the land. Through it all he sustained a quiet and exhausting charity into the decline of his later years (c.1858–63), which drove him to live with his sister's family and move in a very limited circle. He died 3 January 1864.\n\nPapers The papers of John Hughes are principally in the archdiocesan archives at St Joseph's, Dunwoodie, Yonkers, New York. The collections include the diaries of two of his secretaries, Fr James R. Bayley and Fr Thomas Preston, and photocopies and microfilms of many of his letters in other archives, starting with those first made by his would-be biographer Peter Guilday. As the American church was under the jurisdiction of Rome's Congregation of Propaganda Fide until 1908, key papers went through it; these are catalogued and calendared by Anton Debevec and Finbar Kenneally, United States documents in the Propaganda Fide archives: a calendar, 1st ser. (5 vols, Washington, DC, 1966–74). Copies of the relevant ones are now in the above archives. So too are copies of his correspondence with the Society for the Propagation of the Faith (Lyon and Paris, its papers housed at its archives in Lyon). Photocopies were sent to the relevant American dioceses (United States) from 1987 to 1992: see a summary list by diocese in Jean-Marie Jammes in Catholic Historical Review, lxxv (Apr. 1989), 264–7. Henry J. Browne, another would-be biographer, also amassed collections on Hughes and his times. His unpublished biography is in the archives at Columbia University in the H. J. Browne papers there. Various sermons, articles, and pamphlets of Hughes are in Lawrence Kehoe (ed.), Complete works of the Most Rev. John Hughes, D.D. (2 vols, 1865); it is very incomplete and there has never been a collected works. The counter-view was closely provided and documented by James Gordon Bennett in his New York Herald. There is no published full scholarly biography."}, {"url": "https://www.catholic.org/encyclopedia/view.php?id=5948", "page_content": "Hi readers, it seems you use Catholic Online a lot; that's great! It's a little awkward to ask, but we need your help. If you have already donated, we sincerely thank you. We're not salespeople, but we depend on donations averaging $14.76 and fewer than 1% of readers give. If you donate just $5.00, the price of your coffee, Catholic Online School could keep thriving. Thank you.\n\nFourth bishop and first Archbishop of New York, born at Annaloghan, Co. Tyrone, Ireland, 24 June, 1797 of Patrick Hughes and Margaret McKenna: died in New York, 3 January, 1864. His father, a farmer of limited means, emigrated to the United States in 1816, and settled in Chambersberg, Pa. Johns's early education was received at Aligher, and later at Auchnacloy, near his native village. Though he felt called to the priesthood, circumstances did not permit him to continue his studies: being disinclined to farm life, he was placed with a friend of his father to study horticulture. He followed his father to America in 1817, landed at Baltimore, and soon after went to Chambersburg where he aided his family for a year or more. His ardent desire to become a priest brought him in 1819 to Mount St. Mary's College , Emmitsburg. Md., which he entered as an employee, being received a year later as a student. Ordained to the priesthood 15 October, 1826, by Bishop Conwell, in St. Joseph's Church, Philadelphia, he laboured first at St. Augustine's, Philadelphia, later at Bedford, Pa., finally returning to Philadelphia to become pastor of St. Joseph's, and afterwards of St. Mary's whose trustees were in open revolt against the bishop, and were subdued by Father Hughes only when he built St. Joseph's church, 1832, then considered one of the finest in the country. Previous to this, in 1829, he founded St. John's Orphan Asylum. About this period he was engaged in a religious controversy with Rev. John A. Brekenridge, a distinguished Presbyterian clergyman, with the result that Father Hughes's remarkable ability attracted widespread attention and admiration. His name was mentioned for the vacant see of Cincinnati and for the Coadjutorship of Philadelphia. On 7 Jan, 1838, however, Father Hughes was consecrated Bishop of Basileopolis and Coadjutor of New York, by Bishop Dubois, in St. Patrick's Cathedral, Mott Street, New York. In 1839 he became administrator-Apostolic of New York, and on the death of Bishop Dubois succeeded to the vacant see, 20 Dec. 1842. He was raised to the dignity of first Archbishop of New York, 19 July, 1850, receiving the pallium personally from Pius IX at Rome, 3 April 1851.\n\nThe abolition of trusteeism in New York marked the beginning of his episcopate. He confronted a critical diocesan condition arising from differences between Bishop Dubois and the lay trustees whose control of the church revenues was working injury to religion, and had encumbered the 10 churches then in the city with a debt of $300,000, a crushing burden in those days. Bishop Hughes's in Philadelphia with trusteeism served him well in taking up the defense of Bishop Dubois. He appealed directly to the people, before whom he forcefully defended the Divine authority to govern granted by Christ to the hierarchy, and clearly exposed the viciousness of lay domination in administration of church matters. The people readily passed a resolution condemning the cathedral trustees who gave way to a new board well disposed to obey ecclesiastical authority. The bishop convoked in 1841 the first Diocesan Synod of New York, which enacted timely legislation affecting spiritual matters, and advised for tenure and administration of church property wise regulations which placed the rector of the church in control of temporals as well as spirituals. His triumph over the trustee System would have been complete and final at the very outset had the trustees of St. Louis's church, Buffalo, been as prompt to submit as all others. Their attitude brought the archbishop, as late as 1855, into a controversy with Erasmus Brooks, editor and state senator, who assailed in the Legislature the archbishop's plan of holding church property. Unfavorable legislation followed, but was soon repealed, and prepared the way for the present satisfactory religious corporation law of the State of New York\n\nReturning from Europe, whither he had gone in 1839 to seek aid for his diocese, Bishop Hughes found his flock involved in a movement to modify the existing common school system, which, professing to be non-sectarian, was undermining, in fact, the religious beliefs of Catholic children. The bishop immediately placed himself at the head of the movement, and deemed it incumbent on him to oppose the Public School Society, a private corporation controlling the management of schools and the distribution of the school fund provided by the municipality. He based his objection to this society on the ground that it violated a fundamental American principle, namely freedom of conscience. Catholics could not accept any system of education which ignored, undermined, or opposed the religious faith their conscience dictated to be true. After two years' unceasing contest, he finally brought about the overthrow of the Public School Society. He had hoped, and Governor Seward was kindly disposed, that the Legislature might be so truly American as to sanction and support Catholic schools. Religious animosity proved too bitter. The bishop's hopes were not realized. The establishment of the present public school system followed, which likewise, failing to satisfy Catholic conscience, led the bishop to lay the foundation, on a firm basis, of the existing Catholic school system in New York. An anti-Catholic outbreak of the \"Native American\" political party occurred in 1844, in Philadelphia, where churches and convents were destroyed. A meeting of this party was announced to take place in New York City. Apprehensive that the result would be riot and bloodshed, the bishop called personally on the mayor of the city to prevent the meeting. Warning him of the consequences if any anti-Catholic outrage were attempted. He at the same time solemnly cautioned his flock against violence, but took measures to resist any attack against church property. His fearless determined attitude prevented the holding of the meeting and averted disturbance of the peace. Ten years later the \"Know-nothing\" faction became active. He again advised his people to keep aloof from the centres of trouble. He was deeply convinced that all such movements, being as anti-American as they were anti-Catholic, could not possible thrive in the United States.\n\nFew public men of his day possessed a more statesmanlike grasp of the genius of the American Republic. He had unbounded confidence in its institutions, when their very existence was precarious. He looked upon America as a land of promise opened by a beneficent xxyyyk.htm\">Providence to the oppressed of the nations. No one would question his own abiding love of his native soil; but he would not permit this love to make him lament as an exile of Erin when he might rejoice as an American citizen. Thus he taught his people. So far-seeing was he in this respect that he looked with disfavor upon national churches, lest they might perpetrate racial differences and foreign customs. All must be formed into a common people; and no influence could do this better for the American people, he contended, than the Catholic Church sent by Christ to teach all nations. Archbishop Hughes will ever rank among America's foremost citizens. His towering character, genius for government, and intense patriotism won for him the respect and often the admiration of his opponents, the esteem and even the lifelong friendship of distinguished statesmen. President Polk, through Secretary Buchanan, in 1846, proffered him a diplomatic mission to Mexico, which he was unable to accept. On invitation of John Quincy Adams, Stephen A. Douglas, and John C. Calhoun, he lectured before Congress in the Capitol, Washington, his topic being \"Christianity, the Only Source of Moral Social and Political Regeneration\". At the outbreak of the Civil War, although not an abolitionist, he boldly sustained the Union cause, and was in frequent communication with William H. Seward, Secretary of State, to whom he offered useful suggestions on the conduct of the war. President Lincoln, in an autograph letter, expressed his appreciation of the counsel given. Secretary Seward, desiring to hold France in a friendly attitude towards the Federal Government, entrusted the archbishop with an important mission to the court of Napoleon III, who received him most graciously, and was dissuaded by him from recognizing the Confederacy. On this visit to Europe, wherever he went, he left nothing undone to create sympathy for the Union side. During the Draft Riots of 1863 in New York City, Governor Seymour invoked the aid of the archbishop to suppress disorder, to which invitation, though he was fatally broken in health, he willingly responded, addressing a large assemblage from the balcony of his residence.\n\nWe ask you, humbly: don't scroll away. Hi readers, it seems you use Catholic Online a lot; that's great! It's a little awkward to ask, but we need your help. If you have already donated, we sincerely thank you. We're not salespeople, but we depend on donations averaging $14.76 and fewer than 1% of readers give. If you donate just $5.00, the price of your coffee, Catholic Online School could keep thriving. Thank you.\n\n\n\nHelp Now >\n\n\n\n\n\nHis loyalty to his adopted country was well balanced and finely adjusted to the duties and responsibilities of his sacred office. He exercised the strictest vigilance lest American liberty might engender liberal influence tending to minimize the doctrine and discipline of the Catholic Church. He unsparingly condemned those who, through fear of anti-Catholic feeling, were disposed to conciliate their opponents by seemingly harmless concessions. He was intolerant of the slightest modification or innovation in religion unless sanctioned by the Supreme Head of the Church. He believed that the adherence to Catholic faith should be bold, fearless, outspoken and uncompromising in the extreme, and especially so in the face of opposition. Pius IX, exiled in 1848, and again threatened in 1860, found the archbishop one of his staunchest defenders of the Holy See. Strong agencies of power and influence were conspiring against the temporal sovereignty of the pope, and this condition intimidated not a few Catholics into a policy of silent and ineffective sympathy; others somewhat less timid favored action, but of a conservative character. The archbishop approved of no such methods, and boldly proclaimed himself an uncompromising supporter of the Vicar of Christ and his lawful patrimony. By appeal, sermon, lecture, and pastoral letter he aroused his flock at home to unbounded enthusiasm, and stirred Christendom abroad in a masterly vindication of the temporal independence of the sovereign pontiff. He raised in 1860 the princely sum of $53,000, as an offering from his diocese to the Holy Father; and his pastoral letter, circulated throughout Europe and translated in Italian, afforded solace to the afflicted soul of Pius IX.\n\nConjointly with all this prominence and activity demanded by public and vital interests of Church and nation, the archbishop followed faithfully and zealously the exacting life of a hardworking missionary bishop in the upbuilding of a rapidly growing diocese. In 1842 there were some forty priests, fifty churches and 200,000 Catholics scattered over his jurisdiction, which embraced the State of New York and eastern part of New Jersey. Bishop McClosky, later the first bishop of Albany, was Coadjutor of New York from 1844 to 1847. Albany and Buffalo were erected into episcopal sees in 1847; Brooklyn and Newark in 1853. Besides these four separate dioceses made up within the original territory of the diocese of New York, the archbishop before his death in 1864 ruled 150 priests, 85 churches, 3 colleges, 50 schools and academies and over 400,000 people. He stated in 1858 that he had dedicated his 99th church. As metropolitan, created in 1850, he presided over New York, New Jersey and all New England, with suffragan sees at Albany, Buffalo, Brooklyn, Newark, Boston, Burlington, Hartford and Portland. The First Provincial Council of New York was convened in September, 1854, after which the archbishop journeyed to Rome and he was present at the proclamation of the dogma of the Immaculate Conception.\n\nDuring his administration institutions of charity and higher learning grew apace with churches and schools. The seminary was moved in 1840 from Largerville to Fordham, where a college was opened a year later. The Jesuits assumed charge of it in 1846, but in 1855 the archbishop withdrew the seminary from Fordham, and in 1862 secured property at Troy, New York, for the establishment of St. Joseph's Provincial Seminary. He also proved to be one of the warmest supporters of the North American College, Rome, projected by Pius IX in 1855, and successfully opened in 1859. To meet diocesan needs he introduced into New York the Christian Brothers , the Religious of the Sacred Heart, the Sisters of Mercy, the Ursulines, the Sisters of Notre Dame, and the Sisters of the Good Shepherd. Finding the Sisters of Charity of Emmitsburg, Maryland, who were labouring in New York, restricted by their rule to a limited field and refrained from undertaking certain good works which the archbishop desired, he organized an independent diocesan community of Sisters of Charity, who today, are managing a variety of educational, charitable, protective and industrial institutions, and form one of the most flourishing and successful sisterhoods in the United States . Foreseeing the future greatness of his diocese and cathedral city, he planned the erection of a cathedral which would be commensurate with the importance of the city and See of New York, and would express in enduring stone the faith of his flock. He laid the cornerstone of St. Patrick's Cathedral, Fifth Avenue, 15 August 1858; this lofty and inspiring pile stands as a monument to his genius and prevision.\n\nHe lived and passed away amid stirring times; it was providential for church and country that he lived when he did. His natural gifts of mind and heart, independent of his education, were of a high order and made him pre-eminent in leadership; not only was he a great ruler of an important diocese in a hierarchy remarkable for distinguished bishops, but also a master-builder of the Church in the United States and one of the most helpful and sagacious of the makers of America. Church and nation are indebted forever to the prelate and citizen whose strong personality, and indomitable courage and invaluable service constituted him the man needed in his day to meet critical conditions. He was resolute, fearless, far-sighted and full of practical wisdom based on the sanest and soundest principles. To bring out the innate powers within him required but the opportunity presented by the Church struggling for a footing in a rather hostile community, and by the nation endeavoring to cope with harassing questions at home and impending trouble abroad. His failures were few; his achievements many and lasting. He was feared and loved ; misunderstood and idolized; misrepresented even to his ecclesiastical superiors in Rome, whose confidence in him, however, remained unshaken. Severe of manner, kindly of heart, he was not aggressive until assailed.\n\nHe was a forceful, impressive and convincing speaker; an able, resourceful and talented controversialist, a clear, logical and direct writer. His writing were usually hastily done, as occasion required, but commanded general attention from friend and opponent His works are published in two volumes, which contain lectures, sermons, and pamphlets on historical and doctrinal subjects; open letters to men like Horace Greeley, General Cass, Mayor Harper, Senator Brooks and \"Kirwin Unmasked\", a series of six letters to a Presbyterian minister, writing under the assumed name of Kirwin; these letters are considered models of good English and are among the best written by the archbishop. His mortal remains were interred in the old St. Patrick's but were transferred 30 January, 1883 to their final resting place under the sanctuary of the cathedral in Fifth Avenue. His death elicited a general expression of sympathy and respect, and his memory was honored by tributes from President Lincoln and Secretary Seward, Governor Seymour and the Common Council of New York."}, {"url": "https://aoh.com/2021/03/16/archbishop-dagger-john-hughes/", "page_content": "John Joseph Hughes was born on 24 June 1797 in Annaloghan, Co. Tyrone, to a poor farmer. As a Catholic in English-ruled Ireland, he couldn’t even receive a Catholic education. When John was 15, his younger sister, Mary, died and British law barred a Catholic priest from presiding at her burial; the best he could do was to scoop up a handful of dirt, bless it, and hand it to John to sprinkle on her grave. Hughes never forgot that and dreamed of ‘a country in which no stigma of inferiority would be impressed on my brow, simply because I professed one creed or another.’ Fleeing poverty and persecution, John’s father brought the family to America in 1817 and settled in Chambersburg, PA. John made unsuccessful applications to study at Mount St. Mary’s College in Emmitsburg, MD, but was hired by its rector as a gardener. Working there rekindled his childhood dream of becoming a priest; he asked again if he could enroll as a student and was turned down because of his lack of education. John befriended Mother Elizabeth Ann Seton who persuaded the college to reconsider and Hughes was admitted in September 1820.\n\nAfter graduation, he served the diocese of Philadelphia as a seminarian until 5 October 1826 when he was ordained a priest by Bishop Henry Conwell. During his early years as a priest, Hughes founded St. John’s Orphan Asylum in 1829 and in 1832 was responsible for building the new church of St. John the Evangelist – one of the most impressive churches in the country at that time. His initiative was recognized and on 7 August 1837, Pope Gregory XVI made 40-year old Hughes coadjutor Bishop for the Diocese of New York, which then included all of New York State and northern New Jersey. He was consecrated in old St. Patrick’s Cathedral on 7 January 1838. Between 1820 and 1830, immigration had swelled the U.S. Catholic population to 600,000 with no end in sight. The new immigrants were mostly Irish: impoverished, uneducated and unskilled, with little to prepare them for New York’s urban environs. Hughes believed that the barrage of Nativist anti-Catholic prejudice at the time was demoralizing the already disadvantaged immigrants and holding back their progress.\n\nRecalling his own difficulties with a lack of education, he believed that the future of the Irish in America depended on secular education. At the time, the city’s schools were run by the Public School Society which received state funding. However, that society was a private Protestant group that taught that ‘emigration from Ireland of annually increasing numbers, extremely needy, and in many cases drunken and depraved, has become a subject for all our grave and fearful reflection.’ To get his flock educated, Hughes wanted an end to biased sectarian education. He contacted representative of New York’s Jewish community and allied with them to end all religious teaching in schools and through their efforts, the Maclay Bill of 1842 was enacted to bar all religious instruction from schools receiving state funds. On the night the bill was passed, a nativist mob attacked Hughes’s residence and members of the AOH were called to protect the city’s Catholic churches as they had done in 1841 and would do again in 1844.\n\nHaving reformed the public schools to help those non-protestant children who attended them, Hughes threw his energies into building a Catholic school system. ‘We have to build the schools first and the church after’ he said. In 1838 he felt that 100 acres bordering the Bronx River was the perfect spot for a new seminary and college and three years later, St. John’s College, the first Catholic institution of higher learning in the northeast, was established. On 10 April 1846, the State of New York granted the College a university charter and in 1907, after adding a law school and medical school, the name was changed to Fordham University.\n\nIn 1844, James Harper, was elected Mayor of New York supported by the anti-immigrant American Republican Party consisting mainly of Nativists. A highly organized group of anti-Catholic Protestant fundamentalists, they saw the Catholic Church as incompatible with democracy and believed the United States should be a land for Anglo-Saxon Protestants only. At the time, nativist riots in Philadelphia claimed the lives of 30 Irishmen and burned Catholic churches and convents. Bishop Hughes defending the rights of Irish Catholics against such bigotry and bloodshed, sent a letter to Mayor Harper warning that if any harm came to a single Catholic church, he would turn New York into another Moscow, referring to the burning of Moscow during Napoleon’s invasion in 1812. He then called on the AOH to defend the Cathedral. As a massive Nativist torchlight parade gathered in City Hall Park, ready to march up the Bowery to the Cathedral, he stationed the Hibernians on the protective walls around the Cathedral. The Nativists backed down and Hughes’ powerful message and forceful actions are credited with averting the same anti-Catholic violence in New York that had plagued Philadelphia. Hughes won the nickname of “Dagger John,” not only for the cross he penned beside his signature but also for being a man not to be trifled with!\n\nIn 1850, New York was elevated to the status of an Archdiocese by Pope Pius IX, so, too, was Hughes’ own status elevated to that of Archbishop. He continued a vigorous mission of building churches, schools, and hospitals. Future American President James Buchanan called him, ‘one of the ablest and most accomplished and energetic men I had ever known. In a far-seeing move that many ridiculed at the time as Hughes’ Folly, the Archbishop proposed the construction of a new Cathedral in an undeveloped area far uptown on Fifth Avenue between 50th and 51st streets. The property was purchased in 1810 for the sum of $11,000. Archbishop Hughes laid the cornerstone for the new Saint Patrick’s Cathedral on 15 August 1858.\n\nDuring the Civil War, Archbishop Hughes served as an envoy for President Lincoln on a successful overseas mission to dissuade European countries from supporting the Confederacy and in securing several officers of former Papal Army for the Union Army. In gratitude, Lincoln petitioned Pope Pius IX to name Archbishop Hughes as America’s first Cardinal. But the death took this indomitable leader in January 1864 before that honor could come to pass. His memory was honored by tributes from President Lincoln and other statesmen and his body viewed by over 200,000 people who solemnly came to worship in the old Cathedral where he was entombed in the crypts below. His body remained there until the new Cathedral was completed uptown and his remains were then removed to a crypt there in 1883. The new Cathedral holds the remains of all of the archbishops and cardinals that have served the Archdiocese since the death of Archbishop Hughes.\n\nA statue of Archbishop Hughes stands on Fordham campus and a bust on a pedestal was erected by AOH Div 9 NY and the Friendly Sons of St Patrick at the old Cathedral with 3 bronze plaques on the fence.\n\nMike McCormack, National Historian\n\nTHIS IRISH AMERICAN HERITAGE MONTH PROFILE IS PRESENTED BY THE ANCIENT ORDER OF HIBERNIANS (AOH.COM)\n\n#IrishAmericanHeritageMonth #EmbraceYourIrishHeritageAOH"}, {"url": "https://www.newadvent.org/cathen/07516a.htm", "page_content": "John Hughes\n\nPlease help support the mission of New Advent and get the full contents of this website as an instant download. Includes the Catholic Encyclopedia, Church Fathers, Summa, Bible and more \u0097 all for only $19.99...\n\nFourth bishop and first Archbishop of New York, born at Annaloghan, Co. Tyrone, Ireland, 24 June, 1797 of Patrick Hughes and Margaret McKenna: died in New York, 3 January, 1864. His father, a farmer of limited means, emigrated to the United States in 1816, and settled in Chambersberg, Pa. Johns's early education was received at Aligher, and later at Auchnacloy, near his native village. Though he felt called to the priesthood, circumstances did not permit him to continue his studies: being disinclined to farm life, he was placed with a friend of his father to study horticulture. He followed his father to America in 1817, landed at Baltimore, and soon after went to Chambersburg where he aided his family for a year or more. His ardent desire to become a priest brought him in 1819 to Mount St. Mary's College, Emmitsburg. Md., which he entered as an employee, being received a year later as a student. Ordained to the priesthood 15 October, 1826, by Bishop Conwell, in St. Joseph's Church, Philadelphia, he laboured first at St. Augustine's, Philadelphia, later at Bedford, Pa., finally returning to Philadelphia to become pastor of St. Joseph's, and afterwards of St. Mary's whose trustees were in open revolt against the bishop, and were subdued by Father Hughes only when he built St. John the Evangelist church, 1832, then considered one of the finest in the country. Previous to this, in 1829, he founded St. John's Orphan Asylum. About this period he was engaged in a religious controversy with Rev. John A. Brekenridge, a distinguished Presbyterian clergyman, with the result that Father Hughes's remarkable ability attracted widespread attention and admiration. His name was mentioned for the vacant see of Cincinnati and for the Coadjutorship of Philadelphia. On 7 Jan, 1838, however, Father Hughes was consecrated Bishop of Basileopolis and Coadjutor of New York, by Bishop Dubois, in St. Patrick's Cathedral, Mott Street, New York. In 1839 he became administrator-Apostolic of New York, and on the death of Bishop Dubois succeeded to the vacant see, 20 Dec. 1842. He was raised to the dignity of first Archbishop of New York, 19 July, 1850, receiving the pallium personally from Pius IX at Rome, 3 April 1851.\n\nThe abolition of trusteeism in New York marked the beginning of his episcopate. He confronted a critical diocesan condition arising from differences between Bishop Dubois and the lay trustees whose control of the church revenues was working injury to religion, and had encumbered the 10 churches then in the city with a debt of $300,000, a crushing burden in those days. Bishop Hughes's in Philadelphia with trusteeism served him well in taking up the defense of Bishop Dubois. He appealed directly to the people, before whom he forcefully defended the Divine authority to govern granted by Christ to the hierarchy, and clearly exposed the viciousness of lay domination in administration of church matters. The people readily passed a resolution condemning the cathedral trustees who gave way to a new board well disposed to obey ecclesiastical authority. The bishop convoked in 1841 the first Diocesan Synod of New York, which enacted timely legislation affecting spiritual matters, and advised for tenure and administration of church property wise regulations which placed the rector of the church in control of temporals as well as spirituals. His triumph over the trustee System would have been complete and final at the very outset had the trustees of St. Louis's church, Buffalo, been as prompt to submit as all others. Their attitude brought the archbishop, as late as 1855, into a controversy with Erasmus Brooks, editor and state senator, who assailed in the Legislature the archbishop's plan of holding church property. Unfavorable legislation followed, but was soon repealed, and prepared the way for the present satisfactory religious corporation law of the State of New York\n\nReturning from Europe, whither he had gone in 1839 to seek aid for his diocese, Bishop Hughes found his flock involved in a movement to modify the existing common school system, which, professing to be non-sectarian, was undermining, in fact, the religious beliefs of Catholic children. The bishop immediately placed himself at the head of the movement, and deemed it incumbent on him to oppose the Public School Society, a private corporation controlling the management of schools and the distribution of the school fund provided by the municipality. He based his objection to this society on the ground that it violated a fundamental American principle, namely freedom of conscience. Catholics could not accept any system of education which ignored, undermined, or opposed the religious faith their conscience dictated to be true. After two years' unceasing contest, he finally brought about the overthrow of the Public School Society. He had hoped, and Governor Seward was kindly disposed, that the Legislature might be so truly American as to sanction and support Catholic schools. Religious animosity proved too bitter. The bishop's hopes were not realized. The establishment of the present public school system followed, which likewise, failing to satisfy Catholic conscience, led the bishop to lay the foundation, on a firm basis, of the existing Catholic school system in New York. An anti-Catholic outbreak of the \"Native American\" political party occurred in 1844, in Philadelphia, where churches and convents were destroyed. A meeting of this party was announced to take place in New York City. Apprehensive that the result would be riot and bloodshed, the bishop called personally on the mayor of the city to prevent the meeting. Warning him of the consequences if any anti-Catholic outrage were attempted. He at the same time solemnly cautioned his flock against violence, but took measures to resist any attack against church property. His fearless determined attitude prevented the holding of the meeting and averted disturbance of the peace. Ten years later the \"Know-nothing\" faction became active. He again advised his people to keep aloof from the centres of trouble. He was deeply convinced that all such movements, being as anti-American as they were anti-Catholic, could not possible thrive in the United States.\n\nFew public men of his day possessed a more statesmanlike grasp of the genius of the American Republic. He had unbounded confidence in its institutions, when their very existence was precarious. He looked upon America as a land of promise opened by a beneficent Providence to the oppressed of the nations. No one would question his own abiding love of his native soil; but he would not permit this love to make him lament as an exile of Erin when he might rejoice as an American citizen. Thus he taught his people. So far-seeing was he in this respect that he looked with disfavor upon national churches, lest they might perpetrate racial differences and foreign customs. All must be formed into a common people; and no influence could do this better for the American people, he contended, than the Catholic Church sent by Christ to teach all nations. Archbishop Hughes will ever rank among America's foremost citizens. His towering character, genius for government, and intense patriotism won for him the respect and often the admiration of his opponents, the esteem and even the lifelong friendship of distinguished statesmen. President Polk, through Secretary Buchanan, in 1846, proffered him a diplomatic mission to Mexico, which he was unable to accept. On invitation of John Quincy Adams, Stephen A. Douglas, and John C. Calhoun, he lectured before Congress in the Capitol, Washington, his topic being \"Christianity, the Only Source of Moral Social and Political Regeneration\". At the outbreak of the Civil War, although not an abolitionist, he boldly sustained the Union cause, and was in frequent communication with William H. Seward, Secretary of State, to whom he offered useful suggestions on the conduct of the war. President Lincoln, in an autograph letter, expressed his appreciation of the counsel given. Secretary Seward, desiring to hold France in a friendly attitude towards the Federal Government, entrusted the archbishop with an important mission to the court of Napoleon III, who received him most graciously, and was dissuaded by him from recognizing the Confederacy. On this visit to Europe, wherever he went, he left nothing undone to create sympathy for the Union side. During the Draft Riots of 1863 in New York City, Governor Seymour invoked the aid of the archbishop to suppress disorder, to which invitation, though he was fatally broken in health, he willingly responded, addressing a large assemblage from the balcony of his residence.\n\nHis loyalty to his adopted country was well balanced and finely adjusted to the duties and responsibilities of his sacred office. He exercised the strictest vigilance lest American liberty might engender liberal influence tending to minimize the doctrine and discipline of the Catholic Church. He unsparingly condemned those who, through fear of anti-Catholic feeling, were disposed to conciliate their opponents by seemingly harmless concessions. He was intolerant of the slightest modification or innovation in religion unless sanctioned by the Supreme Head of the Church. He believed that the adherence to Catholic faith should be bold, fearless, outspoken and uncompromising in the extreme, and especially so in the face of opposition. Pius IX, exiled in 1848, and again threatened in 1860, found the archbishop one of his staunchest defenders of the Holy See. Strong agencies of power and influence were conspiring against the temporal sovereignty of the pope, and this condition intimidated not a few Catholics into a policy of silent and ineffective sympathy; others somewhat less timid favored action, but of a conservative character. The archbishop approved of no such methods, and boldly proclaimed himself an uncompromising supporter of the Vicar of Christ and his lawful patrimony. By appeal, sermon, lecture, and pastoral letter he aroused his flock at home to unbounded enthusiasm, and stirred Christendom abroad in a masterly vindication of the temporal independence of the sovereign pontiff. He raised in 1860 the princely sum of $53,000, as an offering from his diocese to the Holy Father; and his pastoral letter, circulated throughout Europe and translated in Italian, afforded solace to the afflicted soul of Pius IX.\n\nConjointly with all this prominence and activity demanded by public and vital interests of Church and nation, the archbishop followed faithfully and zealously the exacting life of a hardworking missionary bishop in the upbuilding of a rapidly growing diocese. In 1842 there were some forty priests, fifty churches and 200,000 Catholics scattered over his jurisdiction, which embraced the State of New York and eastern part of New Jersey. Bishop McClosky, later the first bishop of Albany, was Coadjutor of New York from 1844 to 1847. Albany and Buffalo were erected into episcopal sees in 1847; Brooklyn and Newark in 1853. Besides these four separate dioceses made up within the original territory of the diocese of New York, the archbishop before his death in 1864 ruled 150 priests, 85 churches, 3 colleges, 50 schools and academies and over 400,000 people. He stated in 1858 that he had dedicated his 99th church. As metropolitan, created in 1850, he presided over New York, New Jersey and all New England, with suffragan sees at Albany, Buffalo, Brooklyn, Newark, Boston, Burlington, Hartford and Portland. The First Provincial Council of New York was convened in September, 1854, after which the archbishop journeyed to Rome and he was present at the proclamation of the dogma of the Immaculate Conception.\n\nDuring his administration institutions of charity and higher learning grew apace with churches and schools. The seminary was moved in 1840 from Largerville to Fordham, where a college was opened a year later. The Jesuits assumed charge of it in 1846, but in 1855 the archbishop withdrew the seminary from Fordham, and in 1862 secured property at Troy, New York, for the establishment of St. Joseph's Provincial Seminary. He also proved to be one of the warmest supporters of the North American College, Rome, projected by Pius IX in 1855, and successfully opened in 1859. To meet diocesan needs he introduced into New York the Christian Brothers, the Religious of the Sacred Heart, the Sisters of Mercy, the Ursulines, the Sisters of Notre Dame, and the Sisters of the Good Shepherd. Finding the Sisters of Charity of Emmitsburg, Maryland, who were labouring in New York, restricted by their rule to a limited field and refrained from undertaking certain good works which the archbishop desired, he organized an independent diocesan community of Sisters of Charity, who today, are managing a variety of educational, charitable, protective and industrial institutions, and form one of the most flourishing and successful sisterhoods in the United States. Foreseeing the future greatness of his diocese and cathedral city, he planned the erection of a cathedral which would be commensurate with the importance of the city and See of New York, and would express in enduring stone the faith of his flock. He laid the cornerstone of St. Patrick's Cathedral, Fifth Avenue, 15 August 1858; this lofty and inspiring pile stands as a monument to his genius and prevision.\n\nHe lived and passed away amid stirring times; it was providential for church and country that he lived when he did. His natural gifts of mind and heart, independent of his education, were of a high order and made him pre-eminent in leadership; not only was he a great ruler of an important diocese in a hierarchy remarkable for distinguished bishops, but also a master-builder of the Church in the United States and one of the most helpful and sagacious of the makers of America. Church and nation are indebted forever to the prelate and citizen whose strong personality, and indomitable courage and invaluable service constituted him the man needed in his day to meet critical conditions. He was resolute, fearless, far-sighted and full of practical wisdom based on the sanest and soundest principles. To bring out the innate powers within him required but the opportunity presented by the Church struggling for a footing in a rather hostile community, and by the nation endeavoring to cope with harassing questions at home and impending trouble abroad. His failures were few; his achievements many and lasting. He was feared and loved; misunderstood and idolized; misrepresented even to his ecclesiastical superiors in Rome, whose confidence in him, however, remained unshaken. Severe of manner, kindly of heart, he was not aggressive until assailed.\n\nHe was a forceful, impressive and convincing speaker; an able, resourceful and talented controversialist, a clear, logical and direct writer. His writing were usually hastily done, as occasion required, but commanded general attention from friend and opponent His works are published in two volumes, which contain lectures, sermons, and pamphlets on historical and doctrinal subjects; open letters to men like Horace Greeley, General Cass, Mayor Harper, Senator Brooks and \"Kirwin Unmasked\", a series of six letters to a Presbyterian minister, writing under the assumed name of Kirwin; these letters are considered models of good English and are among the best written by the archbishop. His mortal remains were interred in the old St. Patrick's but were transferred 30 January, 1883 to their final resting place under the sanctuary of the cathedral in Fifth Avenue. His death elicited a general expression of sympathy and respect, and his memory was honored by tributes from President Lincoln and Secretary Seward, Governor Seymour and the Common Council of New York.\n\nSources HASSARD, Life of Most Rev. John Hughes (New York 1866):BRANN, Most Rev. John Hughes (New York 1892); KEHOE, Works of the Most Rev. John Hughes D.D. (2 vols. New York, 1864); CLARKE, Lives of the Deceased Bishops (New York 1888); FARLEY, History of St. Patrick's Cathedral (New York 1908); SMITH, History of the Catholic Church in New York, I (New York 1905); SHEA, History of the Catholic Church in the United States (New York 1892); U.S. Catholic Hist. Soc., Hist Records and Studies, CORRIGAN, II, 227, MEEHAN, I, 171, THEBAUD, III, 282; BROWNSON, Works (Detroit, 1887), XIV, 485, XVII, 197, XX, 50; MAURY, Statesmen in America in 1846 (London 1847); Autobiography of Thurlow Weed (Boston, 1883); BAKER, Works of William H. Seward, III (New York 1853), 482."}, {"url": "https://news.fordham.edu/university-news/celebrating-the-180th-anniversary-of-fordhams-founding/", "page_content": "The elm-lined paths of the Rose Hill campus lead to a bronze statue of Fordham’s founder, Archbishop John Hughes, dedicated on June 24, 1891.\n\nOn June 24, 1841, Bishop John Hughes opened St. John’s College in the village of Fordham with just six students. It was the first Catholic institution of higher education in the Northeast. Five years later, the Jesuits took over the fledgling college, fulfilling the ardent hopes of Bishop Hughes, who’d always wanted the school to be in Jesuit hands. In 1907, having achieved university status, St. John’s College officially changed its name to Fordham University.\n\nToday, as we celebrate Fordham’s auspicious founding, we reflect on the story of an Irish immigrant who sought to elevate his people—and all immigrants—with the promise of higher education. Below is a 2016 homily delivered by Monsignor Thomas J. Shelley, Ph.D., GSAS ’66, professor emeritus of theology at Fordham.\n\nFounding Father: Archbishop John Hughes\n\nLady Chapel, St. Patrick’s Cathedral, June 24, 2016\n\n219 years ago today, on June 24, 1797, St. John’s Day, Fordham’s founding father, John Joseph Hughes, was born in the little village of Annalogan in County Tyrone, Ireland. “They told me when I was a boy,” he said, “that for the first five days I was on a social and civil equality with the most favored subject of the British Empire. These five days would be the interval between my birth and my baptism.” Once John Hughes was baptized a Catholic, however, like every Catholic in eighteenth-century Ireland, he immediately became a second-class citizen in the land of his birth.\n\nJohn Hughes also preserved another vivid childhood memory. When his younger sister died, after the funeral Mass, the parish priest led the funeral procession to the local cemetery, which was the property of the Protestant Church of Ireland. Catholic priests were forbidden by law from entering these cemeteries. And so, outside the gate of the cemetery, the parish priest bent down, scooped up a clump of earth in his hands, blessed it, and handed it to Hughes’s father to sprinkle it over his daughter’s coffin as it was lowered into the grave. Childhood memories of this kind are not easily erased, and John Hughes never forgot this example of the prejudice suffered by Catholics in his native land.\n\nJohn Hughes spent the first twenty years of his life in Ireland as the son of a poor Ulster farmer where he experienced not only prejudice but also the grinding poverty that prevented him from obtaining more than a rudimentary education. When he emigrated to America in 1817, he worked in the only occupations for which he was qualified, as a laborer in the construction trades and in quarries. When he applied for admission to a seminary to study for the priesthood, he had to spend his first year in remedial studies in order to qualify for the entrance requirements.\n\nExposure to prejudice and poverty was not limited to John Hughes. It was the common experience of Irish Catholics both in their homeland and in America. However, the difference was that America was the land of opportunity for immigrants, if they had the education to take advantage of these opportunities. This was one of the primary motives that led Bishop Hughes to establish St. John’s College at Fordham in 1841. He considered education the indispensable means for the members of his immigrant flock to break loose from the cycle of poverty that ensnared them and that prevented them from participating in what today we would call the American dream. John Hughes’s first biographer, John Hassard, a graduate of St. John’s College, Fordham, in 1855, and Hughes’s former secretary who knew him well, said, “The subject that of all others that [Hughes] had nearest his heart was education.”\n\nA public official who saw what Hughes was doing and came to admire him greatly was William Seward, the politically astute governor of New York State. Later, as secretary of state during the Civil War, Seward became the indispensable man in Lincoln’s cabinet. Governor Seward told Hughes, “You have begun a great work in the elevation of the rejected immigrant, a work auspicious to the destiny of that class and still more beneficial to our common country.” Incidentally Hughes never made a distinction between Catholic and non-Catholic immigrants. He framed the issue this way, that foreign-born American citizens should enjoy the same legal rights as native-born American citizens.\n\nBishop Hughes became the effective leader of New York Catholics in June 1839. Only two months later he made his first major decision when he purchased 106 acres at Rose Hill for a college, which confirms the statement of John Hassard that “the subject of all others that [Hughes] had nearest his heart was education.” The price of the real estate was $30,000 ($29,750) and Hughes needed an additional $10,000 to renovate the two buildings on the property. “I had not, when I purchased the site of this new college, St. John’s, Fordham,” Bishop Hughes said, “so much as a penny wherewith to commence the payment for it.” He immediately launched a fund-raising campaign among New York’s impoverished Catholics. After nine months the campaign netted a paltry $10,000. Hughes then went to Europe on a ten-month begging trip, and generous Catholics in France and Austria contributed the money that he needed to start St. John’s College at Fordham.\n\nJohn Hughes’s new college opened its doors 175 years ago today, on St. John’s Day, June 24, 1841, with a grand total of six students. The faculty was larger than the student body. For the next five years Hughes struggled to maintain his college as a diocesan institution with a faculty of New York diocesan priests, but it was a losing battle. There were four presidents in five years. One president became a cardinal, another became an archbishop, but neither of them was a professional educator.\n\nThen there was a third diocesan priest as president, the ineffable and eminently forgettable Ambrose Manahan, a scatterbrain cleric whom Hughes dismissed for incompetence. When Hughes gave him his walking papers, he sent him this priceless letter, “I advise you to resign . . . in the almost extinguished hope that, on a new scene where your future character will be determined by your future conduct, you may disappoint the melancholy anticipations that the past is too well calculated to inspire.” Fordham’s founding father may not have had much formal education, but he certainly possessed the innate Irish gift of eloquence.\n\nFordham’s fourth and most capable diocesan president was a young cleric named Father John Harley, but he died at the age of twenty-nine, a not uncommon occurrence at that time because of the rigors of seminary education. Hughes had no one among his own diocesan clergy to replace Harley, and so in 1845 he turned to the Society of Jesus, an international order of scholars with a reputation as professional educators, to take charge of his fledgling college. The Jesuits in turn were happy to establish a foothold in the largest city in the United States.\n\nAlthough St. John’s College remained a diocesan college for only five years, we rightly honor Archbishop John Hughes today as our founding father. It was he who purchased the property at Rose Hill, raised the funds to pay for it, recruited the original faculty and administration, obtained the state charter and left to the Jesuits a flourishing little college whose ownership they were happy to obtain. It was no mean accomplishment even for a man of the stature of John Joseph Hughes.\n\nI do not think that the influence of John Hughes on Fordham University is limited to the past. In many respects he remains an inspiration for us today. For example, you are all familiar with the statue of Archbishop Hughes outside Cunniffe House on the Rose Hill campus. That statue was the gift of the alumni on the occasion of the fiftieth anniversary of St. John’s College, Fordham, in 1891. Many of the alumni would have known Hughes when they were students. Hughes had only been dead for 27 years.\n\nThe alumni wanted these words of John Hughes to be engraved on the pedestal of the statue: “I have always preached that every denomination, Jews, Christians, Catholics, Protestants—of every shade and sex—were all entitled to entire freedom of conscience, without let or hindrance from any sect or number of sects, no matter how small their number or how unpopular the doctrine that they profess.”\n\nUnfortunately those words of John Hughes were not engraved on the pedestal of his statue perhaps, perhaps—and here I am only guessing—because the theologically conservative Jesuit Fathers at Fordham considered John Hughes’s words to be too bold and radical. They certainly would have set off alarm bells in the Vatican. However, in 1965, the Second Vatican Council effectively if posthumously endorsed those words of Archbishop Hughes in its Declaration on Religious Liberty and in Nostra Aetate, the council’s document on the relationship between the Catholic Church and the Jewish people. Isn’t it inspiring to know that, at least in this all-important area of freedom of conscience, our founding father anticipated the work of the Second Vatican Council by a whole century?\n\nJohn Hughes was no Mother Theresa. He will never be canonized because, among his many other qualities, he was a tough and feisty street fighter who gave no quarter and asked no quarter in an often hostile environment. In 1844 a Nativist mob unleashed several days of rioting and violence on the Catholic community in Philadelphia. They then threatened to do the same thing in New York City. Bishop Hughes told the Nativist mayor of New York City, James Harper, that, if any harm came to his churches, he would turn the city into “a second Moscow,” a reference to the destruction of Moscow by the Russians in 1812 when Napoleon attacked the city.\n\nThat does not sound like Mother Theresa. To be honest, it is also far removed from the spirit of the Sermon on the Mount. But it worked and may be justified on the grounds that it preserved peace and law and order. The Nativist leaders backed down and disbanded their mob and spared New York City from the violence that only days earlier had engulfed the city of Philadelphia.\n\nMany historians have criticized Archbishop Hughes for his bellicose style of leadership, but at least one distinguished historian of American Catholicism, Monsignor John Tracy Ellis, offered a more nuanced appraisal of John Hughes’s leadership. Ellis said that “there were times when [Hughes’s’] very aggressiveness was about the only approach that would serve the end that he was seeking, viz., justice for his people.” An integral element in his quest to obtain justice for his people and to give them economic and social equality in American society was to give them access to higher education. That is why he went to such great pains to establish the university whose 175th anniversary we celebrate today.\n\nIt is difficult to envision anyone else in the Catholic community in nineteenth-century New York City who could have accomplished what Archbishop John Hughes did for “the elevation of the rejected immigrant” (to quote again Governor William Seward). A key element in Archbishop Hughes’s plan to elevate the rejected immigrant was to give them the opportunity for a college education. We all owe him a great debt of gratitude for establishing St. John’s College at Rose Hill, the future Fordham University. It is a debt that we gladly acknowledge today and will continue to acknowledge and repeat in many different ways over the course of the next twelve months.\n\nThomas J. Shelley"}, {"url": "https://www.libraryireland.com/biography/ArchbishopJohnHughes.php", "page_content": "Archbishop John Hughes\n\nAlfred Webb A Compendium of Irish Biography\n\nHughes, John, Archbishop of New York, was born in the parish of Errigal Trough, County of Monaghan, in 1798. He has written of his boyhood: \"My schoolboy days were spent among my neighbours who were not Catholics; but I think if I had been reared in the most Catholic portion of the island, I could not have been surrounded with kinder or more gallant friends than the scholars, of whom there were not a dozen Catholics.\" His father, a respectable farmer, emigrated to the United States in 1817, and John was placed with a florist. He devoted his spare time to study, entered a Catholic seminary in Maryland, and in 1825 was ordained a priest. As a preacher he soon distinguished himself, and was elected a member of various literary societies. In 1838 he was consecrated Coadjutor Bishop of New York, and in 1842, upon the death of Bishop Dubois, was confirmed in the see. Already he had made a tour through France, Austria, and Italy, to collect funds for the spread of his faith in the United States. In 1850 New York was made an archbishopric, and he was created the first Archbishop, as his countryman Archbishop Kenrick had been created first Primate of the United States.\n\nHe was a bitter opponent of the abolitionists, and a strenuous apologist for slavery. Drake says: \"He was prominent in the effort made by the Catholics to modify the existing school-system in their favour, and was successful.\" In 1847 he delivered, by request, before Congress an address — \"Christianity the only source of moral, social, and political regeneration.\" The organization and extension of Catholicism through the United States was largely due to his statesmanlike abilities. He was ever devoted to the cause of Irish nationality, and when the report reached New York in 1848 that Ireland was in insurrection, a public meeting was held to subscribe funds. \"I attended,\" says Bishop Hughes, \"to show, that in my conscience I have no scruple in aiding this cause in every way worthy a patriot and a Christian.\" \"My contribution shall be for a shield, not for a sword,\" he added, \"but you can contribute for what you choose.\" After the breaking out of the Civil War in 1861, he was by the United States government sent on a mission to Europe to counteract the intrigues of the Confederates. He does not appear to have been the author of any works beyond lectures and pamphlets. Archbishop Hughes died in New York, 3rd January 1864, aged 66. His sister Ellen (Mother Angela), who died two years after him, was for many years superioress of a New York hospital, and during the war was active in aiding the Sanitary Commission.\n\nSources\n\n37a. Biographical Dictionary—American Biography: Francis S. Drake. Boston, 1876.\n\n233. Manuscript and Special Information, and Current Periodicals."}, {"url": "https://www.fordhamprep.org/alumni/hall-of-honor/inductees-h-p/john-j-hughes", "page_content": "Founder, Fordham Prep & University\n\nFirst Archbishop of New York\n\n\n\nIt took a saint to find the priest in John Hughes.\n\nJohn Joseph Hughes was born on the Feast of the Nativity of St. John the Baptist, Midsummer's Day, June 24, 1797, in Annalogan, County Tyrone, in the north of Ireland. John was the third of seven children of Patrick Hughes and Margaret McKenna Hughes, who earned their living by working the land. Michael, Patrick, Mary, Peter, Ellen and Margaret were John's brothers and sisters, two of whom, Peter and Ellen died in childhood.\n\nThe early 19th century was a difficult time for Irish Catholics living under Protestant rule. For the Hughes family, the low point came when the family priest was barred by law from entering the cemetery where John’s sister was being interred. Within months, John’s parents decided to abandon Ireland and move their family to America.\n\n\n\nBy 1817, a 20-year-old John Hughes was working as a gardener and stonemason at Mount St. Mary’s College in Emmitsburg, Maryland. John had been given an opportunity to study horticulture there while he worked at Mount St. Mary’s, but he had his eye on another goal: being in America now seemed like the portal to his lifelong dream of becoming a priest. He was stung, however, by his failure to gain admission to the local seminary where the rector could not overlook his lack of education. Luckily for Hughes, he often met a visitor to Mount St. Mary’s — Mother Elizabeth Bayley Seton, a widow and convert to Catholicism who had started her own religious order, the Sisters of Charity.\n\nMother Seton, who would later become the first native-born American to be canonized (and, interestingly enough, a Prep grandparent: her grandson, William Seton was a member of the Class of 1848), would be John’s advocate for admission to the seminary. With the help of her considerable influence, John Joseph Hughes was ordained in Philadelphia in 1826.\n\nFrom his first days as a priest, he gained notoriety as a figure who stood against bigotry in its many forms. He wrote and preached on the shamefulness of slavery (though it is true that later in his career, he would be careful to sidestep the political implications of a full-out endorsement of the Abolitionists). And he became a crusader against the persecution of newly arrived Irish immigrants, who sometimes found their new lives in America nearly as bad as they had been in Ireland, if in a different way. Nativism was a crushing burden to Catholics of the time, and Hughes feared that as they had been in their homeland, Catholics in America would forever be considered second-class citizens.\n\n\n\nHis response to the hydra-headed Nativist movement — which included Protestant ministers, intellectuals and religious fundamentalists — was fierce and very public. As described by historians, when a Protestant newspaper ran an editorial focused on “traitorous Popery,” Hughes responded with a letter to the editorial board in which he called the authors the “clerical scum of the country.”\n\n\n\nIn 1834, Nativists put the blame for a cholera outbreak in Philadelphia squarely on the Irish. Hughes, risking his own life, worked to the breaking point to nurse and console the sick and dying. In contrast, a large percentage of the most notables among the Protestant clergy had fled the city. Afterwards, Hughes wrote a letter to the Gazette, which included this stinging remark about the absentee ministers: “[They are] remarkable for their pastoral solicitude so long as the flock is healthy, the pastures pleasant, and the fleece lubricant, abandoning their post when disease begins to spread dissolution in the fold.”\n\n\n\nThe year 1835 was a watershed for Hughes, still serving in Pennsylvania at the time. A socially eminent Princeton graduate and Presbyterian minister from New York named John Breckenridge challenged him to a public debate. Hughes, knowing that he might not be able to hold his own against the better-educated Breckenridge in a live, oral debate, instead suggested that it be conducted in the respective church newspapers. There was no Catholic newspaper in Philadelphia at the time, so Hughes had to start one. Week after week for nine months, the two clergymen battled it out in print, and the newspapers grew thicker and thicker. This publicly aggressive side of Hughes, along with the dagger-like cross with which he preceded signature, gave rise to his nickname, \"Dagger John.\"\n\nIt is unlikely that either man won many converts among their readership, but the drama turned Hughes into a hero for the immigrant Irish population.\n\nIn 1838, when he was just 40 years old, John Hughes was appointed coadjutor-bishop of New York to administrate the diocese for an aging Bishop John Dubois — coincidentally the very priest who had rebuffed his initial attempts to enter the seminary in Maryland. Almost immediately, Bishop Hughes was caught in a battle with New York City over its schools, which were essentially sectarian Protestant institutions where students read books describing Irish immigrants as “drunken” and “depraved” and were given Protestant religious instruction. Among his allies in this push to end sectarianism in the public schools were the city’s Jews and Unitarians. His efforts would eventually lead to the passage in of the Maclay Bill, which forbade religious instruction in public schools. The city’s Catholic churches were threatened the night the bill passed, and old Bishop Dubois, who was still living in the same residence with Hughes, was rescued by the police when mobs tried to burn down the building.\n\nDubois passed away later that year, and Hughes succeeded him as the fourth bishop of the Diocese of New York.\n\n\n\nBesides his battle against the New York City Public School Society, Hughes had also begun to establish a parallel Catholic school system, saying “We shall have to build the schoolhouse first and the church afterward.” Eventually, John Hughes would oversee the opening of scores of privately funded Catholic schools throughout the New York area.\n\n\n\nSchoolchildren were not Hughes’ only educational priority, for he turned his sights on higher education as well, an enterprise which he acknowledged to be a “daring and dangerous undertaking.” In an age when anti-Catholic sentiment was rife, Dagger John’s daring in the face of danger was the very stuff of which Fordham Prep and Fordham University were together born.\n\nMaking the journey to Westchester, of which the Bronx was still then a part, Bishop Hughes purchased Rose Hill Manor in the farming village of Fordham in 1839. In 1840, he established the first institution on the site: St. Joseph’s Seminary. A year later in 1841, on the Feast of the Nativity of St. John the Baptist, Midsummer’s Day, June 24th — Hughes’ 44th birthday — St. Joseph’s Seminary would share the land with Hughes' second Rose Hill endeavor: St. John’s College. The College would soon be organized into levels, or divisions. First Division would become Fordham University and Second Division would become what is today Fordham Prep.\n\nHughes would have a hand in Fordham’s Jesuit tradition as well. A few years later, his persistence would convince a band of Jesuits from a struggling college in Kentucky to take over operation of his new school.\n\nJohn Hughes lived a remarkable life. After founding St. John’s he also played a part in founding Manhattan College, Manhattanville College and the College of Mount St. Vincent. In July of 1850, when the Diocese of New York was elevated to an archdiocese, John Hughes became the first archbishop of New York. He would lay the cornerstone for St. Patrick’s Cathedral in 1858, one of the architects of which was none other than William Rodrigue, the architect of the University Church, the Prep’s first art teacher, and Hughes’ brother-in-law, the husband of his sister Margaret.\n\nIn 1861, at the personal request of President Lincoln, Hughes traveled to France to help win support for the Union cause in Europe.\n\n\n\nSome scholars credit Hughes with saving the Irish in America, his herculean efforts on their behalf pulling the community up from extreme poverty and the violence, illiteracy and despair that it bred. Many credit him as being one of the great builders of the Church in America. All agree that he was a man of forceful personality and indomitable spirit. For Fordham, he was all of these — and more — but he is first and foremost our Founder.\n\n\n\nAfter months of illness, His Excellency, the Most Reverend Archbishop John J. Hughes died on January 3, 1864. At the time of his death, he was being cared for by his two sisters, Margaret Hughes Rodrigue and Mother Mary Angelica Hughes, SC, mother general of the Sisters of Charity of New York. An estimated 100,000 people gatherered around the cathedral during his funeral. Initially interred at Old St. Patrick’s, his body was eventually moved to rest under the main altar at St. Patrick’s on Fifth Avenue.\n\n\n\nIn the words of his biographer, John Rose Greene Hassard, Class of 1855:"}, {"url": "https://www.findagrave.com/memorial/44547730/john-joseph-hughes", "page_content": "Born in New York City, John Joseph Hughes attended St. Paul the Apostle parish as a boy and sang in the choir. After graduating from St. Charles College in Maryland and St. Francis Xavier College in New York, he entered the Paulists in 1878 and was professed on February 1, 1884. He was ordained a priest on June 3 of the same year.\n\n\n\nHe joined the missions with Fr. Walter Elliott after ordination, but was soon assigned to parish work due to his poor speaking voice. He shined as a curate at St. Paul the Apostle parish, as he was an excellent administrator and organized many parish activities. He was a leader in the temperance movement as well as openly supporting the women's suffrage movement.\n\n\n\nIn recognition of his talents he served as assistant superior under both Deshon and Searle. In 1909 he was chosen as Searle's successor as the 5th Superior General of the Paulists in a bitter election in which charges of electioneering were made against Elliott. Canon lawyers ruled in favor of Hughes but the controversy caused him much pain and embarrassment.\n\n\n\nDuring his tenure the Paulists experienced enormous expansion opening foundations in northern Manhattan (Good Shepherd), Portland, Toronto, Minneapolis and St. Paul's College in Washington, D.C.\n\n\n\nAlthough thought by many to be indecisive – he wrote to a friend once, \"I dislike changing men\" – he was widely respected in the Paulists and especially by parishioners at St. Paul the Apostle parish.\n\n\n\nShortly after leaving office in 1919 he suffered a cerebral hemorrhage and died. He was remembered as a premier parish organizer, a champion of progressive causes and a charitable priest. He died at the age of 63 in his 35th year as a Paulist priest.\n\n\n\n\n\nBorn in New York City, John Joseph Hughes attended St. Paul the Apostle parish as a boy and sang in the choir. After graduating from St. Charles College in Maryland and St. Francis Xavier College in New York, he entered the Paulists in 1878 and was professed on February 1, 1884. He was ordained a priest on June 3 of the same year.\n\n\n\nHe joined the missions with Fr. Walter Elliott after ordination, but was soon assigned to parish work due to his poor speaking voice. He shined as a curate at St. Paul the Apostle parish, as he was an excellent administrator and organized many parish activities. He was a leader in the temperance movement as well as openly supporting the women's suffrage movement.\n\n\n\nIn recognition of his talents he served as assistant superior under both Deshon and Searle. In 1909 he was chosen as Searle's successor as the 5th Superior General of the Paulists in a bitter election in which charges of electioneering were made against Elliott. Canon lawyers ruled in favor of Hughes but the controversy caused him much pain and embarrassment.\n\n\n\nDuring his tenure the Paulists experienced enormous expansion opening foundations in northern Manhattan (Good Shepherd), Portland, Toronto, Minneapolis and St. Paul's College in Washington, D.C.\n\n\n\nAlthough thought by many to be indecisive – he wrote to a friend once, \"I dislike changing men\" – he was widely respected in the Paulists and especially by parishioners at St. Paul the Apostle parish.\n\n\n\nShortly after leaving office in 1919 he suffered a cerebral hemorrhage and died. He was remembered as a premier parish organizer, a champion of progressive causes and a charitable priest. He died at the age of 63 in his 35th year as a Paulist priest.\n\n\n\n"}, {"url": "https://thedeaconsbench.com/the-world-has-lost-a-great-priest-father-john-jay-hughes/", "page_content": "The world has lost a great priest: Father John Jay Hughes\n\nSomehow, I missed this news when it broke earlier this week.\n\nAnother redwood in the forest has fallen. Dawn Eden Goldstein took note of it in Where Peter Is:\n\nSomewhere in what we have come to call the cloud, a joyful ninety-two-year-old priest is blogging from the dead. Father John Jay Hughes, who died June 3 after a brief illness, lived a remarkable life. Descended from John Jay (the first Chief Justice of the US Supreme Court) on his mother’s side and from two generations of Episcopalian priests on his father’s side, the native New Yorker was ordained an Anglican priest in 1954. Six years later, he entered the Catholic Church and began to undertake doctoral research that would ultimately change the way the Catholic Church understood the theology of ordination as it applied to Anglican priests. Among his professors was the young Joseph Ratzinger, the future Pope Benedict XVI. Through his research, Hughes was able to provide evidence that his Anglican ordination could be accepted as valid in the Catholic Church. Although his findings weren’t enough to give Church authorities absolute certainty of the validity of his Anglican orders, in 1968 he became the first Anglican priest in history to be conditionally ordained a Catholic priest—receiving ordination only “on the condition” his Anglican orders weren’t valid. Eventually Hughes became a priest of the Archdiocese of St. Louis, where he spent many years pastoring parishes as well as writing books and articles. In 2013, at the age of eighty-one, he started a blog, Proclaiming the Good News, where he would post daily homilies. He continued to do so even when age and infirmity prevented him from preaching publicly on a regular basis.\n\nRead more, including part of his homily from the day he died.\n\nI first encountered Father Hughes a few months after I was ordained a deacon in 2007, when Rocco Palmo wrote of him:\n\nFew aspects of church life join the rubber to the road more than preaching. And as an advance Christmas gift, one of the pulpit’s great artisans has begun beaming his work to a wider stage. Week after week, not a few have gotten a good deal of nourishment and encouragement from the Sunday homilies of St Louis’ Fr John Jay Hughes, the eminent theologian, church historian and, being oft-published across the gamut from America to Crisis (on top of 12 books), a truly Catholic communicator in both senses of the word.\n\nI started reading his stuff, and even exchanged emails with him a few times. Father Hughes’ homilies never failed to impress. (You can find a lot of them right here.) Three years ago, he brought his characteristic joy and clear-eyed wisdom to an essay in America magazine, reflecting on 63 years as a priest. He concluded:\n\nThe greatest joy is the privilege, beyond any man’s deserving, of standing at the altar day by day to obey Jesus’ command at the Last Supper to “Do this in my memory.” Celebrating Mass was wonderful the first time I did it 63 years ago. It is, if possible, even more wonderful today. My prayer today, which I have repeated every day since my 75th birthday, 14 years ago, is twofold: that the years which remain to me may belong ever more completely to the Lord God and for a happy and a holy death. I close with a prayer composed by the great 19th-century English convert, Blessed John Henry Newman, at the end of his long life as a cardinal, which has been dear to me since childhood: Support us, O Lord, all the day long; until the shadows lengthen, and the evening comes, and the busy world is hushed, and the fever of life is over, and our work is done. Then in your mercy grant us a safe lodging, and a holy rest, and peace at the last. We ask this through Christ our Lord. Amen.\n\nEternal rest grant unto him, O Lord, and let perpetual light shine upon him…"}]}