{"John Joseph Hughes was a vocal opponent of anti-Catholicism.": [{"url": "https://www.encyclopedia.com/people/philosophy-and-religion/roman-catholic-and-orthodox-churches-general-biographies/john-joseph-hughes", "page_content": "HUGHES, JOHN JOSEPH\n\nFirst archbishop of New York; b. County Tyrone, Ireland, June 24, 1797; d. New York, N.Y., Jan. 3, 1864. John was the third of seven children of Patrick and Margaret (McKenna) Hughes, small farmers who avoided involvement in Ireland's political disturbances. John attended the local schools, and soon showed an interest in the priesthood. In 1816 the father and an older son immigrated to the U. S., sending for John the following year, and for the rest of the family in 1818. They settled in Chambersburg, Pennsylvania, where John worked in the quarries, at mending roads, and as a gardener. He made several applications for admission to Mt. St. Mary's Seminary, Emmitsburg, Md., only to learn that there was no room. When, however, Rev. John dubois offered to take him as a gardener until a vacancy occurred, Hughes went to Mt. St. Mary's on Nov. 10, 1819, and a year later was received in the seminary. He was accepted by Bp. Henry conwell for the Diocese of phila delphia, Pa., and ordained in St. Joseph's Church, Philadelphia, on Oct. 15, 1826; arrangements were made for him to continue his studies under Michael Hurley, OSA, who was assigned to St. Augustine's parish in that city.\n\nCareer in Philadelphia. When Hughes arrived, the trustees of St. Mary's Cathedral were in open conflict with Conwell as a result of the Hogan schism, which dated from 1821. After about a year at St. Augustine's, where he had a chance to watch developments at St. Mary's, Hughes spent a few weeks as pastor of Bedford, Pa.; he was then recalled to Philadelphia to become, successively, pastor at St. Joseph's (January 1827) and at St. Mary's (April 1827). When the trustees of St. Mary's refused to pay his salary, he returned in July to St. Joseph's, where he remained until St. John's Church was built and dedicated in April 1832. The new church had no lay incorporators and Hughes administered his parish with a firm hand.\n\nAlthough highly successful in his pastoral activities, he attracted more attention by his controversial writings and speeches. His first published sermon, which enhanced his reputation as a preacher, was on Catholic emancipation, then recently granted in Ireland, and was dedicated to Daniel O'Connell, whom he greatly admired. Anti-Catholicism, then strong in Philadelphia, was expressed freely in sermons, lectures, and the bitterly polemical Protestant weeklies. There was no Catholic paper, since many Catholics, including Bp. Francis Kenrick, who had been appointed coadjutor with full jurisdiction in 1830, thought the best policy was to suffer in silence. Hughes, on the contrary, believed in a vigorous defense. He founded the Catholic Herald, a newspaper that he later turned over to the diocese. Earlier he had established a Catholic Tract Society to distribute free pamphlets. In 1830, using the pseudonym \"Cranmer,\" he wrote letters to the Protestant, a New York weekly specializing in anti-Catholic propaganda. When, however, his wildly improbable accounts of Catholic plots and progress failed to strain the credulity of the editors and readers, he exposed the hoax. His best known controversy in Philadelphia was with Dr. John Breckinridge, a Presbyterian clergyman, with whom he debated in writing (1833) and orally (1835) on the Rule of Faith, and Catholicism as an obstacle to civil and religious liberty.\n\nHughes did not overestimate the value of controversy, but used it to make the enemies of the Church more cautious and to raise the morale of the sorely tried Catholic masses. His talents and his achievements attracted attention, and his promotion to the episcopate was generally expected. He had been recommended as coadjutor of Philadelphia by Conwell in 1829, and for Cincinnati in 1833. In 1836 the Holy See designated Hughes as coadjutor of Philadelphia and Kenrick as bishop of a new see to be erected at Pittsburgh, but Gregory XVI delayed formal approval. In 1837 when the Third Provincial Council of Baltimore asked that the division of Philadelphia be postponed, Hughes was preconized titular bishop of Basileopolis and coadjutor, with the right of succession, of New York. He was consecrated there on Jan. 7, 1838, in old St. Patrick's Cathedral.\n\nNew York. The diocese then consisted of all of New York State and about one-half of New Jersey, an area of about 55,000 square miles. Hughes found 22 churches, 10 of which had been erected in 1837, and 40 priests, to serve the needs of 200,000 Catholics, in a total population of about 2,700,000. The Emmitsburg Sisters of Charity were the only religious community in the diocese. Seven parochial schools, all in New York City, and four orphan asylums, two of which were in the city, made up the total of Catholic charitable and educational institutions. The population of the U.S. was increasing rapidly; in New York City the increase was five times the national rate. Moreover, the churches of the city were burdened with a heavy debt, $300,000. When, in January 1838, Dubois suffered a stroke, responsibilty for the diocese devolved upon Hughes, who was named apostolic administrator in August 1839 and succeeded to the see on Dec. 20, 1842. He became archbishop of New York on July 19, 1850, when it was made an archdiocese.\n\nHughes's authority was challenged in February 1839, when the cathedral trustees had a catechist appointed by Dubois ejected from the Sunday school by the police. A pastoral, written by Hughes and signed by Dubois, threatened the parishoners with an interdict unless they repudiated the trustees. This was done promptly, at a meeting summoned, addressed, and presided over, by Hughes. Except for the parish of St. Louis in Buffalo, where the trustees held out for years, New York had no further difficulty with trusteeism.\n\nAfter a preliminary visitation of the diocese, Hughes went to Europe in October 1839, seeking aid in Paris, Rome, Munich, Vienna, and Dublin. On his return in 1840, he engaged in his greatest contest over the question of religion and the public schools. The Public School Society, a private organization, practically monopolized public funds for education in New York City from 1825 to 1840. Professedly nonsectarian, it provided religious training that was offensive to Catholics, who wanted state aid for denominational schools and a proportionate share of public funds. Governor William Seward agreed with the Catholics, but the city aldermen and the state legislature were hostile. The resultant controversy, which destroyed the Public School Society, led to two quite unexpected developments—the total secularization of U.S. public education on all levels, and the creation of the parochial school system in the U. S.\n\nThe growth of political nativism had led, in 1844, to the burning of Catholic churches and widespread riots in Philadelphia. Hughes's success in arousing his people to defend the churches against mob violence, while exhorting them to give no provocation, prevented similar disorders in New York. His firm stand on this and on the school question made him known throughout the country. Although attacked and misrepresented in the press, he was, nevertheless, highly respected in both Catholic and non-Catholic circles.\n\nHis achievements in the diocese included the erection of four new sees; the beginning of the new St. Patrick's Cathedral; the founding of a seminary, and of a college at Fordham, New York City, which he later transferred to the Jesuits; the introduction of many religions communities; and the development of charitable and educational works. He was instrumental in separating a group of Sisters of Charity from Emmitsburg, Md., thus founding the independent Mt. St. Vincent community in New York City.\n\nNational and International Affairs. Hughes was a vigorous defender of the temporal power of the pope, and sponsored more than one special collection to help Pius IX. He took a leading part in the founding of the North American College at Rome in 1859. Thoroughly unsym-pathetic to the abolitionist movement in the U. S., he believed that sudden emancipation would injure the slaves. He opposed plans to settle Irish immigrants on farm lands in the West, fearing they would be lost to the Church because of the shortage of priests. Although he endorsed Irish nationalism, he disapproved of risings that he thought could not succeed, and condemned Irish antislavery sentiment as an intrusion into U. S. politics. Because he was convinced of the basic harmony between American political institutions and Catholicism, he urged Catholic support of the U. S. Constitution and was friendly with officials of the national government. When President James Polk tried to send him to Mexico in 1847, he refused the mission because of its unofficial character. A visit to Europe in support of the Union, 1861–62, was undertaken at the request of President Lincoln and Secretary Seward. He was recommended to Rome for the red hat by Lincoln's government; when no action was taken, some believed the time was not ripe for an American cardinal, while others thought Hughes was not the best choice. His last public appearance was made in July 1863, at the request of New York Gov. Horatio Seymour, who was attempting to stop the draft riots that were then occurring in the City of New York.\n\nCharacter and Personality. Archbishop Hughes was a born leader and fighter. Prompt and vigorous in action, and unyielding in conflict, he believed he had the duty and the ability to lead and defend his people, and to prove that American Catholics were not second-class citizens. If he was autocratic and at times fought harder than was necessary, he merely displayed the defects of his virtues.\n\nAlthough Hughes became increasingly intolerant of disagreement, he nevertheless rendered valuable service to both Church and country. As his successor, Abp. John McCloskey, said: \"… if ever there was a man who in the whole history and character of his life impressed upon us the sense and conviction that he had been raised up by God, was chosen as His instrument to do an appointed work … that man was Archbishop Hughes.\" Hughes died of Bright's disease, after a long illness, and was buried in the old cathedral. His remains were translated to the new St. Patrick's Cathedral in 1883.\n\nBibliography: Complete Works, comp. and ed. l. kehoe, 2v. (New York 1865). j. r. hassard, Life of the Most Reverend John Hughes, D.D., First Archbishop of New York (New York 1866). h.a. brann, Most Reverend John Hughes: First Archbishop of New York (2d ed. New York 1912). e. m. connors, Church-State Relationships in Education in the State of New York (Washington 1951). f. d. cohalan, A Popular History of the Archdiocese of New York (Yonkers, N.Y. 1983). r. shaw, Dagger John: The Unquiet Life and Times of Archbishop John Hughes of New York (New York 1977).\n\n[f. d. cohalan]"}, {"url": "https://www.swiftpapers.com/biographies/John-Joseph-Hughes-31019.html", "page_content": "Name: John Joseph Hughes\n\nBith Date: 1797\n\nDeath Date: January 3, 1864\n\nPlace of Birth: Ireland\n\nNationality: American\n\nGender: Male\n\nOccupations: archbishop\n\n\n\nIrish-born American John Joseph Hughes (1797-1864) was the first Catholic archbishop of New York and an outspoken defender of American Catholicism against Protestant attacks.\n\nJohn Hughes emigrated from Ireland to the United States in 1817. Denied admission to Mount Saint Mary's Seminary, he served as that institution's gardener. After diligent study he finally matriculated as a regular student and in 1826 received ordination. As a young priest in Philadelphia, he soon was embroiled in a dispute over lay trusteeism. Throughout the history of Catholicism the administration of Church property had been the bishop's responsibility; in America, however, laymen claimed the right to manage the Philadelphia Cathedral, as well as the authority to name their own pastor. The clergy's efforts to establish their traditional prerogatives angered Protestants, who regarded the Catholic hierarchy as somehow subversive and the principle of lay control as more consonant with American democracy. Hughes's newspaper debates with Protestant critics soon made him famous.\n\nIn 1838 Hughes became coadjutor bishop of New York and the following year was made administrator in his own right. Once again he was involved in an episode of anti-Catholic sentiment--the struggle over the New York City public schools. Hughes objected to the Protestant religious practices required of Catholic students in the supposedly nonsectarian educational system. The ensuing turmoil resulted in complete reorganization of the school system, although Hughes's demand for tax money for parochial schools went unheeded. Soon the Native American party began attacking Hughes for allegedly having driven the Bible out of the classroom.\n\nIn 1850 Rome elevated New York to a province and made Hughes its first archbishop. He opposed a bill pending in the state legislature that would prevent bishops from holding Church property in their own name; although the bill passed, the state never enforced it. He also carried the burden of defending his Church against the attacks of the Know-Nothing party, while reflecting the conservatism of New York City in his stand on slavery. He rejected abolition, fearing that African Americans would not be prepared for freedom. But when the South seceded, he remained a staunch unionist. During the Civil War he undertook a diplomatic mission to France for President Abraham Lincoln and, in July 1863, helped New York's governor put down the draft riots. Hughes died on Jan. 3, 1864.\n\nFurther Reading"}, {"url": "https://prabook.com/web/john.hughes/3731635", "page_content": "John Joseph Hughes Edit Profile\n\nclergyman\n\nJohn Joseph Hughes was the first Irish-born Catholic archbishop of New York.\n\nBackground Hughes was born on June 24, 1797 in Annaloghan, near Aughnacloy, in County Tyrone, part of the Province of Ulster in the north of Ireland. He was the third of seven children of Patrick and Margaret (née McKenna) Hughes.\n\nEducation Hughes was subsequently admitted as a regular student of Mount St. Mary's in September 1820.\n\nCareer John Hughes emigrated from Ireland to the United States in 1817. He served as that institution's gardener. As a young priest in Philadelphia, he soon was embroiled in a dispute over lay trusteeism. Hughes's newspaper debates with Protestant critics soon made him famous.\n\n\n\nIn 1838 Hughes became coadjutor bishop of New York and the following year was made administrator in his own right. Once again he was involved in an episode of anti-Catholic sentiment - the struggle over the New York City public schools.\n\n\n\nSoon the Native American party began attacking Hughes for allegedly having driven the Bible out of the classroom. In 1850 Rome elevated New York to a province and made Hughes its first archbishop.\n\n\n\nDuring the Civil War he undertook a diplomatic mission to France for President Abraham Lincoln and, in July 1863, helped New York's governor put down the draft riots. Hughes died on Jan. 3, 1864.\n\nAchievements He was an outspoken defender of American Catholicism against Protestant attacks. A figure of national prominence, he exercised great moral and social influence, and presided over a period of explosive growth for Catholicism in New York. Under his administration, he invited many religious congregations to staff schools in New York, among them members of the Society of Jesus, the Brothers of the Christian Schools and others. He founded Fordham University, the Ultramontane newspaper the New York Freeman.\n\nReligion Hughes objected to the Protestant religious practices required of Catholic students in the supposedly nonsectarian educational system.\n\nPolitics He opposed a bill pending in the state legislature that would prevent bishops from holding Church property in their own name; although the bill passed, the state never enforced it. He also carried the burden of defending his Church against the attacks of the Know-Nothing party, while reflecting the conservatism of New York City in his stand on slavery. He rejected abolition, fearing that African Americans would not be prepared for freedom. But when the South seceded, he remained a staunch unionist.\n\nViews Hughes held a strong commitment to the cause of Irish freedom but also felt that immigrants, particularly his fellow Irish immigrants, should demonstrate their unswerving loyalty to their adopted land.\n\nPersonality Quotes from others about the person Historian Daniel Walker Howe is more laudatory, suggesting that Hughes \"labored to bring a largely working-class Irish community into a meaningful relationship with Catholic Christianity, to conciliate middle-class Catholics and Protestant well-wishers whose financial support he needed for his amazingly ambitious program of building. \"\n\n\n\nHughes has been described as \"impetuous and authoritarian, a poor administrator and worse financial manager, indifferent to the non-Irish members of his flock, and prone to invent reality when it suited the purposes of his rhetoric. \""}, {"url": "https://www.newadvent.org/cathen/07516a.htm", "page_content": "John Hughes\n\nPlease help support the mission of New Advent and get the full contents of this website as an instant download. Includes the Catholic Encyclopedia, Church Fathers, Summa, Bible and more \u0097 all for only $19.99...\n\nFourth bishop and first Archbishop of New York, born at Annaloghan, Co. Tyrone, Ireland, 24 June, 1797 of Patrick Hughes and Margaret McKenna: died in New York, 3 January, 1864. His father, a farmer of limited means, emigrated to the United States in 1816, and settled in Chambersberg, Pa. Johns's early education was received at Aligher, and later at Auchnacloy, near his native village. Though he felt called to the priesthood, circumstances did not permit him to continue his studies: being disinclined to farm life, he was placed with a friend of his father to study horticulture. He followed his father to America in 1817, landed at Baltimore, and soon after went to Chambersburg where he aided his family for a year or more. His ardent desire to become a priest brought him in 1819 to Mount St. Mary's College, Emmitsburg. Md., which he entered as an employee, being received a year later as a student. Ordained to the priesthood 15 October, 1826, by Bishop Conwell, in St. Joseph's Church, Philadelphia, he laboured first at St. Augustine's, Philadelphia, later at Bedford, Pa., finally returning to Philadelphia to become pastor of St. Joseph's, and afterwards of St. Mary's whose trustees were in open revolt against the bishop, and were subdued by Father Hughes only when he built St. John the Evangelist church, 1832, then considered one of the finest in the country. Previous to this, in 1829, he founded St. John's Orphan Asylum. About this period he was engaged in a religious controversy with Rev. John A. Brekenridge, a distinguished Presbyterian clergyman, with the result that Father Hughes's remarkable ability attracted widespread attention and admiration. His name was mentioned for the vacant see of Cincinnati and for the Coadjutorship of Philadelphia. On 7 Jan, 1838, however, Father Hughes was consecrated Bishop of Basileopolis and Coadjutor of New York, by Bishop Dubois, in St. Patrick's Cathedral, Mott Street, New York. In 1839 he became administrator-Apostolic of New York, and on the death of Bishop Dubois succeeded to the vacant see, 20 Dec. 1842. He was raised to the dignity of first Archbishop of New York, 19 July, 1850, receiving the pallium personally from Pius IX at Rome, 3 April 1851.\n\nThe abolition of trusteeism in New York marked the beginning of his episcopate. He confronted a critical diocesan condition arising from differences between Bishop Dubois and the lay trustees whose control of the church revenues was working injury to religion, and had encumbered the 10 churches then in the city with a debt of $300,000, a crushing burden in those days. Bishop Hughes's in Philadelphia with trusteeism served him well in taking up the defense of Bishop Dubois. He appealed directly to the people, before whom he forcefully defended the Divine authority to govern granted by Christ to the hierarchy, and clearly exposed the viciousness of lay domination in administration of church matters. The people readily passed a resolution condemning the cathedral trustees who gave way to a new board well disposed to obey ecclesiastical authority. The bishop convoked in 1841 the first Diocesan Synod of New York, which enacted timely legislation affecting spiritual matters, and advised for tenure and administration of church property wise regulations which placed the rector of the church in control of temporals as well as spirituals. His triumph over the trustee System would have been complete and final at the very outset had the trustees of St. Louis's church, Buffalo, been as prompt to submit as all others. Their attitude brought the archbishop, as late as 1855, into a controversy with Erasmus Brooks, editor and state senator, who assailed in the Legislature the archbishop's plan of holding church property. Unfavorable legislation followed, but was soon repealed, and prepared the way for the present satisfactory religious corporation law of the State of New York\n\nReturning from Europe, whither he had gone in 1839 to seek aid for his diocese, Bishop Hughes found his flock involved in a movement to modify the existing common school system, which, professing to be non-sectarian, was undermining, in fact, the religious beliefs of Catholic children. The bishop immediately placed himself at the head of the movement, and deemed it incumbent on him to oppose the Public School Society, a private corporation controlling the management of schools and the distribution of the school fund provided by the municipality. He based his objection to this society on the ground that it violated a fundamental American principle, namely freedom of conscience. Catholics could not accept any system of education which ignored, undermined, or opposed the religious faith their conscience dictated to be true. After two years' unceasing contest, he finally brought about the overthrow of the Public School Society. He had hoped, and Governor Seward was kindly disposed, that the Legislature might be so truly American as to sanction and support Catholic schools. Religious animosity proved too bitter. The bishop's hopes were not realized. The establishment of the present public school system followed, which likewise, failing to satisfy Catholic conscience, led the bishop to lay the foundation, on a firm basis, of the existing Catholic school system in New York. An anti-Catholic outbreak of the \"Native American\" political party occurred in 1844, in Philadelphia, where churches and convents were destroyed. A meeting of this party was announced to take place in New York City. Apprehensive that the result would be riot and bloodshed, the bishop called personally on the mayor of the city to prevent the meeting. Warning him of the consequences if any anti-Catholic outrage were attempted. He at the same time solemnly cautioned his flock against violence, but took measures to resist any attack against church property. His fearless determined attitude prevented the holding of the meeting and averted disturbance of the peace. Ten years later the \"Know-nothing\" faction became active. He again advised his people to keep aloof from the centres of trouble. He was deeply convinced that all such movements, being as anti-American as they were anti-Catholic, could not possible thrive in the United States.\n\nFew public men of his day possessed a more statesmanlike grasp of the genius of the American Republic. He had unbounded confidence in its institutions, when their very existence was precarious. He looked upon America as a land of promise opened by a beneficent Providence to the oppressed of the nations. No one would question his own abiding love of his native soil; but he would not permit this love to make him lament as an exile of Erin when he might rejoice as an American citizen. Thus he taught his people. So far-seeing was he in this respect that he looked with disfavor upon national churches, lest they might perpetrate racial differences and foreign customs. All must be formed into a common people; and no influence could do this better for the American people, he contended, than the Catholic Church sent by Christ to teach all nations. Archbishop Hughes will ever rank among America's foremost citizens. His towering character, genius for government, and intense patriotism won for him the respect and often the admiration of his opponents, the esteem and even the lifelong friendship of distinguished statesmen. President Polk, through Secretary Buchanan, in 1846, proffered him a diplomatic mission to Mexico, which he was unable to accept. On invitation of John Quincy Adams, Stephen A. Douglas, and John C. Calhoun, he lectured before Congress in the Capitol, Washington, his topic being \"Christianity, the Only Source of Moral Social and Political Regeneration\". At the outbreak of the Civil War, although not an abolitionist, he boldly sustained the Union cause, and was in frequent communication with William H. Seward, Secretary of State, to whom he offered useful suggestions on the conduct of the war. President Lincoln, in an autograph letter, expressed his appreciation of the counsel given. Secretary Seward, desiring to hold France in a friendly attitude towards the Federal Government, entrusted the archbishop with an important mission to the court of Napoleon III, who received him most graciously, and was dissuaded by him from recognizing the Confederacy. On this visit to Europe, wherever he went, he left nothing undone to create sympathy for the Union side. During the Draft Riots of 1863 in New York City, Governor Seymour invoked the aid of the archbishop to suppress disorder, to which invitation, though he was fatally broken in health, he willingly responded, addressing a large assemblage from the balcony of his residence.\n\nHis loyalty to his adopted country was well balanced and finely adjusted to the duties and responsibilities of his sacred office. He exercised the strictest vigilance lest American liberty might engender liberal influence tending to minimize the doctrine and discipline of the Catholic Church. He unsparingly condemned those who, through fear of anti-Catholic feeling, were disposed to conciliate their opponents by seemingly harmless concessions. He was intolerant of the slightest modification or innovation in religion unless sanctioned by the Supreme Head of the Church. He believed that the adherence to Catholic faith should be bold, fearless, outspoken and uncompromising in the extreme, and especially so in the face of opposition. Pius IX, exiled in 1848, and again threatened in 1860, found the archbishop one of his staunchest defenders of the Holy See. Strong agencies of power and influence were conspiring against the temporal sovereignty of the pope, and this condition intimidated not a few Catholics into a policy of silent and ineffective sympathy; others somewhat less timid favored action, but of a conservative character. The archbishop approved of no such methods, and boldly proclaimed himself an uncompromising supporter of the Vicar of Christ and his lawful patrimony. By appeal, sermon, lecture, and pastoral letter he aroused his flock at home to unbounded enthusiasm, and stirred Christendom abroad in a masterly vindication of the temporal independence of the sovereign pontiff. He raised in 1860 the princely sum of $53,000, as an offering from his diocese to the Holy Father; and his pastoral letter, circulated throughout Europe and translated in Italian, afforded solace to the afflicted soul of Pius IX.\n\nConjointly with all this prominence and activity demanded by public and vital interests of Church and nation, the archbishop followed faithfully and zealously the exacting life of a hardworking missionary bishop in the upbuilding of a rapidly growing diocese. In 1842 there were some forty priests, fifty churches and 200,000 Catholics scattered over his jurisdiction, which embraced the State of New York and eastern part of New Jersey. Bishop McClosky, later the first bishop of Albany, was Coadjutor of New York from 1844 to 1847. Albany and Buffalo were erected into episcopal sees in 1847; Brooklyn and Newark in 1853. Besides these four separate dioceses made up within the original territory of the diocese of New York, the archbishop before his death in 1864 ruled 150 priests, 85 churches, 3 colleges, 50 schools and academies and over 400,000 people. He stated in 1858 that he had dedicated his 99th church. As metropolitan, created in 1850, he presided over New York, New Jersey and all New England, with suffragan sees at Albany, Buffalo, Brooklyn, Newark, Boston, Burlington, Hartford and Portland. The First Provincial Council of New York was convened in September, 1854, after which the archbishop journeyed to Rome and he was present at the proclamation of the dogma of the Immaculate Conception.\n\nDuring his administration institutions of charity and higher learning grew apace with churches and schools. The seminary was moved in 1840 from Largerville to Fordham, where a college was opened a year later. The Jesuits assumed charge of it in 1846, but in 1855 the archbishop withdrew the seminary from Fordham, and in 1862 secured property at Troy, New York, for the establishment of St. Joseph's Provincial Seminary. He also proved to be one of the warmest supporters of the North American College, Rome, projected by Pius IX in 1855, and successfully opened in 1859. To meet diocesan needs he introduced into New York the Christian Brothers, the Religious of the Sacred Heart, the Sisters of Mercy, the Ursulines, the Sisters of Notre Dame, and the Sisters of the Good Shepherd. Finding the Sisters of Charity of Emmitsburg, Maryland, who were labouring in New York, restricted by their rule to a limited field and refrained from undertaking certain good works which the archbishop desired, he organized an independent diocesan community of Sisters of Charity, who today, are managing a variety of educational, charitable, protective and industrial institutions, and form one of the most flourishing and successful sisterhoods in the United States. Foreseeing the future greatness of his diocese and cathedral city, he planned the erection of a cathedral which would be commensurate with the importance of the city and See of New York, and would express in enduring stone the faith of his flock. He laid the cornerstone of St. Patrick's Cathedral, Fifth Avenue, 15 August 1858; this lofty and inspiring pile stands as a monument to his genius and prevision.\n\nHe lived and passed away amid stirring times; it was providential for church and country that he lived when he did. His natural gifts of mind and heart, independent of his education, were of a high order and made him pre-eminent in leadership; not only was he a great ruler of an important diocese in a hierarchy remarkable for distinguished bishops, but also a master-builder of the Church in the United States and one of the most helpful and sagacious of the makers of America. Church and nation are indebted forever to the prelate and citizen whose strong personality, and indomitable courage and invaluable service constituted him the man needed in his day to meet critical conditions. He was resolute, fearless, far-sighted and full of practical wisdom based on the sanest and soundest principles. To bring out the innate powers within him required but the opportunity presented by the Church struggling for a footing in a rather hostile community, and by the nation endeavoring to cope with harassing questions at home and impending trouble abroad. His failures were few; his achievements many and lasting. He was feared and loved; misunderstood and idolized; misrepresented even to his ecclesiastical superiors in Rome, whose confidence in him, however, remained unshaken. Severe of manner, kindly of heart, he was not aggressive until assailed.\n\nHe was a forceful, impressive and convincing speaker; an able, resourceful and talented controversialist, a clear, logical and direct writer. His writing were usually hastily done, as occasion required, but commanded general attention from friend and opponent His works are published in two volumes, which contain lectures, sermons, and pamphlets on historical and doctrinal subjects; open letters to men like Horace Greeley, General Cass, Mayor Harper, Senator Brooks and \"Kirwin Unmasked\", a series of six letters to a Presbyterian minister, writing under the assumed name of Kirwin; these letters are considered models of good English and are among the best written by the archbishop. His mortal remains were interred in the old St. Patrick's but were transferred 30 January, 1883 to their final resting place under the sanctuary of the cathedral in Fifth Avenue. His death elicited a general expression of sympathy and respect, and his memory was honored by tributes from President Lincoln and Secretary Seward, Governor Seymour and the Common Council of New York.\n\nSources HASSARD, Life of Most Rev. John Hughes (New York 1866):BRANN, Most Rev. John Hughes (New York 1892); KEHOE, Works of the Most Rev. John Hughes D.D. (2 vols. New York, 1864); CLARKE, Lives of the Deceased Bishops (New York 1888); FARLEY, History of St. Patrick's Cathedral (New York 1908); SMITH, History of the Catholic Church in New York, I (New York 1905); SHEA, History of the Catholic Church in the United States (New York 1892); U.S. Catholic Hist. Soc., Hist Records and Studies, CORRIGAN, II, 227, MEEHAN, I, 171, THEBAUD, III, 282; BROWNSON, Works (Detroit, 1887), XIV, 485, XVII, 197, XX, 50; MAURY, Statesmen in America in 1846 (London 1847); Autobiography of Thurlow Weed (Boston, 1883); BAKER, Works of William H. Seward, III (New York 1853), 482."}, {"url": "https://www.dib.ie/biography/hughes-john-joseph-a4146", "page_content": "Hughes, John Joseph (1797–1864), third resident catholic bishop and first archbishop of New York, was probably born 23 June 1797 (being baptised on 24 June) at Annaloghan, near Clogher, Co. Tyrone, third son among seven children of Patrick Hughes, farmer and weaver from Dernaved, and his wife Margaret (née McKenna). A parish and hedge school contemporary was the novelist William Carleton (qv) (whom Hughes later aided when visiting Dublin in 1862); Carleton's better work depicts their earlier shared background. After 1800 the family moved to a farmhouse in Dernaved townland, nearby in Co. Monaghan (since rebuilt at the Ulster American Folk Park). Unusually Hughes stayed in a chapel school there until 16 (or 17) to prepare for priesthood. A bad farming year then caused his withdrawal and training as a gardener (1814). Two of his siblings died around this time. His father went (1816) to Chambersburg, Pennsylvania, to prepare a life for the remaining family; John himself went out in 1817, and the rest followed in 1818. John worked as a labourer in Maryland, then as a gardener at St Joseph's school, Emmitsburg, which shared a campus with Mount St Mary's, a secondary school with a senior seminary stream. Its Parisian-born rector Fr John Dubois thwarted Hughes's desire to become a seminarian until St Joseph's superior, Mother (later St) Elizabeth Seton, stressed his merit. Dubois then hired him as overseer of his farm and slaves until he saw for himself the Tyrone man's capacities, and allowed him to enter the school by age 23. On 15 October 1826 Hughes was ordained for Philadelphia, a month before Fr Dubois was himself installed as bishop of New York.\n\nEarly career, 1826–38 Hughes had thus already observed the command of others and practised it as a foreman, a local controversialist, and a funds collector. Two cultured European priests, Dubois and Simon Bruté, formed him; two American converts, Mother Seton and Fr Samuel Cooper, influenced him. As a seminarian he was sponsored by Philadelphia's bishop, who liked him – the aged Ulster churchman Henry Conwell, sent there in 1820 when already 75. Hughes witnessed the bishop's loss of power to the fractious (and briefly schismatic) local lay trustees of St Mary's, the city's premier (and cathedral) church, to which Hughes was himself appointed pastor in spring 1827. There he decided that clear hierarchy was the way forward, and mobilised the ‘new’ Irish against the trustees. In 1830 Francis Kenrick (qv), a Dubliner educated in Rome and there ordained in April 1821, was put in with some control as coadjutor bishop to Conwell. Hughes's exact contemporary, they differed markedly. Hughes held that the morale of the poorer Irish required a forceful counter-attack on the anti-catholicism then spreading as a result of the convergence of new mass Irish immigration and America's evangelical revival. Both Dublin and Rome had shaped Kenrick's more irenic approach, which was not dissimilar to that religiously usual in Philadelphia's older catholic community. Hughes acted boldly on each front. He rejected the claim that substantial lay power in church matters was appropriate to the new nation's civic or ‘republican’ culture, and linked it to wider anti-catholic propaganda. Instead he shaped a relevant apologetics and a joint political argumentation. American religious and civil freedoms required that catholics sustain their position, not that they hide or negate it. Religious prejudice against them was both anti-American, and all too reminiscent of the position but recently endured in Ireland. But his own initially abusive polemics marred his case. As Dubois once disciplined him for bullying students when a prefect, Kenrick now rebuked his uncharity. Hughes learned to modify his methods as he matured his insights. Gradually he transformed the thrust of ‘Americanisation’ among many catholics to one that accommodated a robust group-assertion, rather than cultivated the pieties of otherness quietly, or adjusted more or less to socio-political secularity.\n\nCoadjutor and archbishop of New York, 1838–64 Leadership of catholic New York, the epicentre of catholic immigration, offered him a wider context. Hughes was consecrated coadjutor there on 7 January 1838, taking effective command when Dubois suffered a stroke within the month. Dubois had been consecrated at 62 for New York. Lay factions rode roughshod over him. Within ten years he was exhausted, and died on 20 December 1842. Hughes had right of immediate succession. In 1850 New York was made an archdiocese; on 3 October 1850 Hughes received the documents (issued 19 July) confirming this and appointing him archbishop. He was given the pallium personally by Pius IX on 3 April 1851.\n\nThus from February 1838 until his final incapacity (from Bright's disease) in autumn 1863, the Irish-born prelate effectively ruled the diocese and then archdiocese. Within state and nation, he sought to change ‘an apologetic people . . . into a militant people’ (R. J. Purcell, DAB, ix (v, pt 1), 353). Gradually he won acceptance of this by official (but not popular) America, perhaps because in his archdiocese he harmonised massive catholic growth with the city's secular expansion. While he could not provide fully for the huge increases of his people, he provided New York's model ecclesial and school structures for a century. He pioneered and focused its metropolitan character. Twice he cut his jurisdiction's extent, to one-eleventh its original size, carving off almost all upstate New York in 1847, and Long Island and northern New Jersey in 1853. Hughes opened twenty-three parishes during 1840–63 within the city, and a further thirty-seven in the lower Hudson valley outside it. Manhattan's population more than doubled to 805,358 by 1860, its Irish-born then 203,730. Despite such increase, practising catholics for each city parish grew only slightly (10 per cent) from 1840 to 1865, vindicating his new creations. About one-half of catholics practised in the city itself, partly as the provision of parochial schools for their offspring remained very inadequate, with only 5,000 children covered in 1840 and 12,000 in 1860.\n\nIn 1840 Hughes sought to overthrow the city's Public School Society (wholly protestant) and its curricula, and to gain New York state recognition and funding for parochial schools. The state then created a secular public school system for the city, run on district lines. Hughes thus triggered the emergence of exclusively secular public schools, and thereby turned many moderate protestants toward nativism, as express Christian education was driven from their schools of choice. Yet he failed to win the funding that could have held his own poor more fully to their church. In 1857 he said: ‘In our age, the question of education is the question of the church’ (Cohalan, 56). His delivery was thus plainly unequal to his vision. His strategy of exclusive and defensive concentration, however understandable, left many unprovided for, with results later modified only by the rising and more politic affluence of many catholics. Through informal ‘Tammany’ links his successor John McCloskey wisely gained catholic teachers in the new district schools educating most catholic children. Hughes did, however, create the formative free parochial school system in the city.\n\nHughes gradually squeezed lay trusteeism out of New York. Despite a Know-Nothing law to prop it up (1855), he won a state law guaranteeing episcopal title to church properties (1863). He often co-opted trustees onto replacement boards of management. He won informal approval for a catholic chaplaincy in the US military by 1847, and its expansion in 1861 through William Seward, a friend since 1840.\n\nGaining major funding for New York from various missionary societies in Europe, he convinced Rome that his archdiocese must be a chief priority of the missionary church. He relied on a seasoned inner circle of pre-1835 fellow immigrants active in business (with whom he set up the Emigrant Savings Bank) to fund major projects, including the start of St Patrick's cathedral. He introduced many religious orders, including the Redemptorists (1841), the Irish Sisters of Mercy (May 1846), the Jesuits (also 1846) (granting them control of the nascent Fordham), and the Christian [D. L. Salle] Brothers in two stages (1848, 1853). Oddly, he split Mother Seton's original order by his drive to control their local work; those accepting this (including his sister, Ellen) created a new order based in the city (1846), while – fearing further such pressures elsewhere – the original American Sisters of Charity affiliated to the French Daughters of Charity (St Vincent de Paul) in 1850. Hughes was no ‘devotionalist’ in the by-then-current French or Italian styles. Critics of most Irish clergy, such as George Templeton Strong and John Blake Dillon (qv), excepted him as a man of doctrine, clarity, and intelligence. In 1846 he introduced the choice of the Blessed Virgin as patroness of the US at the sixth provincial council in Baltimore. Though he disliked ‘national’ parishes, Hughes did accept German and French ones, though he distanced Italian claims. He also accepted the creation both of ‘select’ (fee-paying) schools, and of up-market parishes (St Ann's, St Francis Xavier). His view of an urban American church was thus realist and comprehensive. He was certainly no Irish-ghetto builder. To Bishop John England (qv), Hughes was an ‘emphatically self-made man’ (Shaw, Dagger John, 91). He advanced many American-born and convert catholics as vital to his church's future.\n\nHe famously faced off public authority when nativist riots impended in April 1844. But this obscures a deeper change. His early and continued counter-polemics with anti-catholic partisans (e.g., Controversy between Rev. Messrs Hughes and Breckenridge (1834); Kirwan unmasked (1848)) gave way to the realisation that in an emergent metropolis with a bare majority then catholic (if problematically so), the analogous problems had shifted to those posed by the attractions of secularity, the indifference of elites, and the irresolute commitment of many formal adherents. The Know-Nothings of 1854–5 did not worry him as much as had their 1840s forerunners. His later battles were with secular spokesmen who respected him, notably Horace Greeley of the New York Tribune, and James G. Bennett, editor of the New York Herald, both highly political men. All three sought rival definitions of a culture, variously to sustain, exclude, contain, or modify Hughes's insistence that American liberty accept the spiritual obediences of catholics as fully licit, and their culture as a public contribution to urban and national vitality and order. His disputes with immigrant Young Ireland and Confederation leaders of 1848 had similar roots (except in the breaches with Thomas D'Arcy McGee (qv), who was less sanguine about both America and its Irish than was Hughes). A supporter of Daniel O'Connell (qv), and very active in famine relief, Hughes showed initial sympathy for both 1848 goals and later the Fenians, unsurprisingly given the trend to an overlap of Defender and United Irish interests in his childhood townlands.\n\nPolitically, and unlike most Irish, Hughes disliked the Democrats (despite many Democratic associates) for their assertive secularity, regretted Irish captivity to them, and preferred the orderly Whigs. Like most Irish, he distrusted the anti-slavery enthusiasms of the new Republicans. Having tried a ‘catholic’ slate in 1841 during the schools battle, thereafter he held that catholics as such ought to be non-partisan. This precedent became a tradition and was upheld by most Irish American bishops and laity (notably in 1901).\n\nYet Hughes had not forgotten the youthful anti-slavery reactions of his own Maryland years. His reform patriotism was deepened by many trips to Europe (October 1839–February 1840, summer 1843, December 1845, December 1850–July 1851), on which he was scandalised by Old World inequities. The shock of southern secession elicited a mature loyalty to the US, made contentious in his city in that many of his people's editors and leaders were Democrats wishing a ‘moderate’ and short war and a negotiated peace. The Lincoln administration sent him to France and Rome on the union's behalf in late 1861. He stayed in Rome until summer 1862.The anti-draft riots of July 1863 shadowed his last year, but his standing curbed their divisive impact.\n\nIt is as flexible planner of a metropolitan catholicism in a culture of multiple freedoms that he is most admirable. He disciplined his ‘tough’ and combative sides to that task. A rural Irishman seasoned to a rural America, Hughes tamed an urban-ward flood. His opposition to mass westward colonisation by the Irish newcomers reflected his close experience of farming in both Ireland and America; he did not oppose migration by stages to the land. Through it all he sustained a quiet and exhausting charity into the decline of his later years (c.1858–63), which drove him to live with his sister's family and move in a very limited circle. He died 3 January 1864.\n\nPapers The papers of John Hughes are principally in the archdiocesan archives at St Joseph's, Dunwoodie, Yonkers, New York. The collections include the diaries of two of his secretaries, Fr James R. Bayley and Fr Thomas Preston, and photocopies and microfilms of many of his letters in other archives, starting with those first made by his would-be biographer Peter Guilday. As the American church was under the jurisdiction of Rome's Congregation of Propaganda Fide until 1908, key papers went through it; these are catalogued and calendared by Anton Debevec and Finbar Kenneally, United States documents in the Propaganda Fide archives: a calendar, 1st ser. (5 vols, Washington, DC, 1966–74). Copies of the relevant ones are now in the above archives. So too are copies of his correspondence with the Society for the Propagation of the Faith (Lyon and Paris, its papers housed at its archives in Lyon). Photocopies were sent to the relevant American dioceses (United States) from 1987 to 1992: see a summary list by diocese in Jean-Marie Jammes in Catholic Historical Review, lxxv (Apr. 1989), 264–7. Henry J. Browne, another would-be biographer, also amassed collections on Hughes and his times. His unpublished biography is in the archives at Columbia University in the H. J. Browne papers there. Various sermons, articles, and pamphlets of Hughes are in Lawrence Kehoe (ed.), Complete works of the Most Rev. John Hughes, D.D. (2 vols, 1865); it is very incomplete and there has never been a collected works. The counter-view was closely provided and documented by James Gordon Bennett in his New York Herald. There is no published full scholarly biography."}, {"url": "https://exhibits.lib.unc.edu/exhibits/show/academic_freedom/19th-century/archbishop-controversy", "page_content": "Archbishop Controversy The clamor raised over a speaker invitation indicates that controversy about who should speak on campus goes back to UNC's early decades. In 1854 the senior class invited Archbishop John Hughes, a Roman Catholic clergyman, to deliver the baccalaureate sermon at commencement. Their invitation provoked the charge by some Protestants that the University was falling under the influence of the Catholic Church. Theoretically, this should not have been a problem for a secular institution that stood against religious intolerance; however, because of the dominant anti-Catholic feeling in North Carolina and in the U.S., faculty and trustees feared the consequences of what even a slight recognition of the Catholic faith would do to the University. Ultimately, the Archbishop declined the invitation, but accepted a later request to give the address in 1860.\n\nThe young men pictured here comprised part of the student body during the Archbishop controversy. This is the earliest known image of a group of students at UNC.\n\nArchbishop Hughes accepted an invitation from the senior class to deliver the baccalaureate address at the 1860 commencement. This excerpt of a much longer article addresses the writer’s disapproval of the students’ selection; however, the author later acknowledges that Hughes’ speech \"gave no offence,\" and that none of the audience \"was in danger of perversion.\"\n\nThe University Magazine staff reprinted an editorial written by UNC students and published in the Louisville Journal in answer to an article that appeared in the Tennessee Baptist. The article criticized the students' invitation to Hughes and accused the University of falling under the influence of the Catholic Church. The students' editorial reacts to remarks which they believe \"inflict an incalculable injury on the trustees, faculty and students of the institution...\"\n\nA social reformer and founder of Fordham University, Roman Catholic clergyman John Joseph Hughes of New York was considered by many North Carolinians a startling choice to give the baccalaureate sermon at southern university where the majority of the students and faculty were Protestant.\n\nThe comments made about the Catholic religion by UNC alumnus Robert Allison reflect the fears and prejudices of many mid-nineteenth-century Protestants. Allison predicts that if the Archbishop is allowed to speak it will cause the University to \"sink into Catholicism\" and potentially result in the withdrawal of students from the University."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-030-42882-2_10", "page_content": "One flaw Addison was particularly eager to eradicate was “this unaccountable Humour in Woman-kind, of being smitten with everything that is showy and superficial.”Footnote 26 According to him, women’s faculty of seeing was defective because they did not see through appearances and could be dazzled by show. Conversely, to be admired and to attract the gaze of men was often depicted by Addison as a form of female vanity and folly that he, like many a Protestant divines before him, wished to cure.Footnote 27\n\nThis is what he did in The Spectator, in which he depicted young women whose ambition was “to appear in all public Places and Assemblies, in order to seduce Men to their Worship.” Significantly, Addison called this group of ladies “Idols” and he compared their tactics to the pageantry of Catholic rituals: “Several of them are carried in Procession every Evening about the Ring, and several of them set up their Worship even in Churches. They are to be accosted in the Language proper to the Deity.” Indeed, Clarinda, “one of the greatest Idols among the Moderns” is “worshipped once a Week by Candle-Light in the midst of a large Congregation generally called an Assembly. Some of the gayest Youths in the Nation endeavour to plant themselves in her Eye, while she sits in form with Multitudes of Tapers burning about her.”Footnote 28\n\nAs the worship of saints was not allowed in the Church of England and as going public for a woman was akin to prostitution, the implicit conclusion was that such women were not only immoral creatures governed by vanity, but they were also bad Anglicans flirting with Catholic rituals. They thus became “whores of Babylon.” Moreover they did not only proselytize, making their lovers idolaters in their turn, but they became crypto-Jacobites because they relied on the same methods as the Pretender who capitalized on his glamourous good looks and on a visual propaganda, summed up in his motto “look, love and follow,” to raise new followers.Footnote 29\n\nThus, what appeared to be gentle mockery of manners was in fact loaded with politico-religious meaning. Indeed Addison assumed that to tax a group of women with idolatrous and crypto-Catholic manners would ridicule them to the extent that it would prompt women into reforming their behaviour.Footnote 30 As this essay was the first of severalFootnote 31 associating the character of the idol to vanity as well as to false religion, to conquest and to arbitrary power, one must consider this social criticism as “a religious act”Footnote 32 and as militant anti-Catholic propaganda.\n\nMoreover, to drive his point home, Addison conversely condemned the Catholic love of rituals and the importance of visual elements in the Catholic Church as feminine idolatry. He ridiculed the Pope himself, comparing him to a coquette who relied on clothing to dazzle his audience, and making him the embodiment of error and frailty. In essay 201, after condemning the Pope who, “officiate[s] at Saint Peters, where for two Hours together, he was busied in putting on or off his different Accoutrements, according to the different Parts he was to act in them,” Addison declared that “Nothing is so glorious in the Eyes of Mankind, and ornamental to Human Nature, … as a strong steady masculine Piety.”Footnote 33 He thus opposed an internalized Protestant and well-poised masculine faith to an excessive Catholic feminine and foreign outward show, concluding: “Idolatry may be looked upon as another Error arising from mistaken devotion.”Footnote 34\n\nAddison therefore killed two birds with one stone. He extended anti-Catholic propaganda to the realms of fashion and manners: his irony was meant to teach his readers how to avoid the traps of lay and religious false appearances and to show that to be truly agreeable, one could not adopt Catholic manners and religion. At the same time, he attempted to eradicate all sorts of Catholic leanings by entertaining the readers through humour and politeness. As Lawrence Klein explains, a light tone was essential to achieve moral reform and a reformation in manners: “by being agreeable, social actors establish a trust that allows them to tell the truth, to criticize, without offending them.”Footnote 35 Addison’s anti-Catholic remarks were therefore polite because they made for both useful and pleasant reading.\n\nHowever, Addison goes a step further by stating that anti-Catholic remarks were a hallmark of English politeness because anti-Catholicism stemmed from the same principles as English politeness. In The Spectator 119, Addison explains how politeness became distinctively English:\n\na very great Revolution … has happenend in this Article of Good Breeding. Conversation, like the Romish Religion, was so encumbered with Show and Ceremony, that it stood in need of a Reformation to retrench its superfluities and restore it to its natural good sense and Beauty. At present therefore an unconstrained Carriage, and a certain Openness of Behaviour are the Height of Good Breeding. The Fashionable World is grown free and easie … In a word, Good Breeding shows it self most, where to an ordinary Eye it appears the least.Footnote 36\n\nIt is striking that Addison should describe the birth of English politeness in the same terms as that of Protestantism: a rejection of ceremonies and artificiality of the “Romish Religion” through a “reformation,” a rejection of a foreign influence (the essay targets French politesse as old fashioned and excessive), a discarding of gaudy show and a return to reason and to natural Protestant piety, which is to be felt and not seen. He thus presented this new form of natural politeness as inherently moderate, anti-Catholic, anti-French and therefore Protestant and English.\n\nTo weave together English politeness and a rejection of Catholicism was astute not only because it turned politeness and anti-Catholicism into a patriotic tool—polite English people being naturally Anglican and well-mannered—but also because it paradoxically distinguished moderation from toleration: the English nature was naturally Anglican and politely anti-Catholic. This idea was expressed at a time when toleration was at the heart of religious bickering between High Church men, Low Church men and Dissenters, and at a time when politeness and moderation were also denounced as a Whig form of hypocrisy, naiveté and flirting with Catholicism.Footnote 37 So to suggest that a mild form of anti-Catholicism was inherently part of the British character, was a way of reconciling all religious factions over the Protestant principles of the Glorious Revolution (which incidentally excluded the Catholics from the Act of Toleration) at the expense of Catholics. Yet promoting a moderate anti-Catholic quintessential British politeness also dispelled the spectre of anti-Catholic fanaticism which levelled Protestantism down to a persecuting faith.Footnote 38 Provided it was guided by reason and transcribed with elegance, intolerance against Catholicism could also be polite and tolerable. Thus politeness served the welfare and protection of the country.\n\nThis explains why Addison rarely embarked into aggressive forms of anti-Catholic writings in most of his works. Already in his Remarks, Addison promoted anti-Catholicism through politeness. He combined a light ironical tone to deflate the anti-British attacks he met in the Catholic institutions he visited with the flat statement of facts which, if correctly understood by the reader, pointed to the treachery of the Catholics: “I saw the Ambrosian Library where, to show the Italian Genius, they have spent more Money on Pictures than on Books. Among the Heads of several learned Men, I met with no Englishman, except Bishop Fisher, whom Henry the Eighth put to Death for not owning his Supremacy.”Footnote 39 It is also significant that in his travelogue, Addison always depicted the Catholics in a neutral way, using the word “Catholics” rather than the derogatory term “Popish.” At the same time, as was noted by historian Morgan Strawn, Addison’s use of classical poetry was also a means to hammer in the idea that the Catholic religion was as outdated as ancient poetry.Footnote 40 Morgan Strawn indeed rightly observes that Addison often compared Catholic with pagan rituals and that 20% of the classical quotations used by Addison “redound to the Ancients’ discredit.”Footnote 41 Thus Addison promoted politeness in both meanings of good manners and culture, making it already inherently anti-Catholic and patriotic.\n\nThis stress on the necessity to stick to a moderate anti-Catholic language in order to entertain and therefore to promote reform is best exemplified by essay 116 of The Guardian, in which Addison remonstrates against the female fashion of showing their naked bosoms. To reform women, Addison published a letter supposedly written by a Quaker who urged the editor of The Guardian to entreat ladies “not to expose their fleshly Temptations,” arguing that even the Pope forbade such a fashion.\n\nNestor Ironside,\n\nOUR FRIENDS like thee … Thy Lion … is heard a great way, even unto the Sink of Babylon; for the Scarlet Whore is governed by the Voice of thy Lion. Look on his Order Rome , July 8, 1713, “A Placard is published here, forbidding Women, of whatsoever quality to go with naked Breasts; and the Priests are ordered not to admit the Transgressors of this Law to Confession, nor to Communion; neither are they to enter the Cathedrals under severe Penalties.” These Lines are faithfully copied from the nightly Paper, with this Title written over it, The Evening Post.Footnote 42\n\nThis essay illustrates well the subtlety of Addison’s method. Addison seemed to take position on lay matters—here women’s fashion—rather than on religious ones. Yet, he reintroduced a religious discourse that sounded moderate because it seemed to reconcile Anglicans , Dissenters and Catholics on the same detestation of female misdemeanours. However, one notices that parodying the plain Quaker style of writing, the essay both mocked the Dissenters’ extremist and abusive anti-Catholic language (“the Scarlet Whore”) as well as the excessive reaction of the Catholic Church to women’s indecency (excluding transgressors from the sacraments). By contrast, Addison made it plain in the introduction to this Guardian essay, that the periodical was coming to the rescue of the Anglican Church because, unlike parsons who lost their dignity by railing against female fashions, it could reform the audience through humorous and lay papers.\n\nMoreover, Nestor Ironside, the journal’s editor, concluded his essay humorously by finally targeting the excessive anti-Catholic and hypocritical reaction some zealous Anglican women could adopt: “I am only afraid that our Ladies will take an Occasion from hence to show their Zeal for the Protestant Religion, and pretend to expose their naked Bosoms only in Opposition to Popery.”Footnote 43 What he worried about was not that his female readers might be anti-Catholic. It was rather that they might be zealously and therefore excessively anti-Catholic, a mistake that in the end would bring them back to their original sin—attracting the gaze of men and seducing in the same manner as Catholic idols did, and therefore becoming “Scarlet whores.” Reforming women’s manners, namely teaching English ladies how to be polite, was not therefore a way of teaching toleration, it was a way of teaching moderation as an anti-Catholic preservative and way of life. Consequently, Addison conceived politeness as both the means and the ends of anti-Catholicism. By being polite, Englishmen and women were being truly English.\n\nAddison’s promotion of an anti-Catholic politeness was certainly progressive when compared to some of the travelogues, sermons, or satires thundering against the Catholics. Yet one should not ignore the fact that it was also highly pervasive because it was moderate. Anti-Catholic moderation became at once the hallmark of politeness and of Englishness. And as propaganda is more efficient when it appears subdued, such distinctively English mild anti-Catholic intolerance was seductive. The success of the periodicals and of The RemarksFootnote 44 as well as the many comments made by British grand tourists on Addison’s book leave no doubt about the extent to which his anti-Catholic remarks strengthened their opinion that England was the land of freedom and religious toleration.Footnote 45 Conyers Middleton, an Anglican divine who was in Italy in 1723–1724, even took up Addison’s programme and dissected the pagan elements in the Catholic practice in A Letter from Rome, which he published in 1729 in order to show the vacuity of the Catholic religion.Footnote 46\n\nAddison’s successful propaganda also partly explains why his ideas and methods were resented in Catholic countries. While Le Journal des Scavans favourably reviewed the Remarks praising the book for being an attractive literary and learned exercise appealing to the polite reader, it attempted to tone down the religious bias of the book: “Mr Addison is merelyFootnote 47 carried away by his satyrism, and does not manifest the full-blown hatred ordinarily shown by non-Catholics travelling across Italy.”Footnote 48 By contrast, the Vatican censored and banned the book and its French translation in 1729.Footnote 49\n\nSimilarly, in 1726, the reviewer of the French translation of the Freeholder in La Bibliothèque française was sarcastic about Addison’s view that English ladies should reject Catholicism because it tyrannically sent women to convents and prevented them from marrying. The reviewer showed the absurdity of such caricatural reasoning, concluding “When standing against Papism and arbitrary power (as they go hand in hand), nothing should seem more abject to English ladies than the sacrifice of thousands fine ladies being sent into convents. There those unfortunate girls, destined to perpetual virginity, become useless to the outside world.”Footnote 50\n\nAddison’s anti-Catholic point of view and methods were to affect his reputation on the continent for a long time. In 1777, even after Addison’s apologetics was translated into French,Footnote 51 the abbé François Xavier de Feller, a famously learned Jesuit hostile to Protestants and Encyclopaedists, still vindicated his resentment by revengefully portraying Addison in his Dictionnaire as a man “whose preventions against the Catholics marred his judgment and his philosophy.”Footnote 52"}, {"url": "https://www.encyclopedia.com/history/encyclopedias-almanacs-transcripts-and-maps/anti-catholicism", "page_content": "ANTI-CATHOLICISM\n\nAnti-Catholic prejudices were carried from Reformation England to the New World, taking root in the colonies where actually very few Catholics lived. Anti-Catholicism helped transplanted Britons retain some tenuous cultural connection to a distant mother country in a strange and often hostile world. Because of their diverse origins, purposes, composition, and location, virtually the only trait these colonies shared was their traditional hatred and fear of Catholicism. In the absence of any organic unity, or any other organizing ideology like nationalism, Catholicism helped to define for most colonials what was \"other\" or \"foreign.\"\n\nAlthough the most virulent anti-Catholicism would have been found in Massachusetts and in the Chesapeake colonies, nearly all British colonies imposed restrictions on Catholic settlement, landholding, political participation, and religious liberty. Only in Rhode Island, Connecticut, and Pennsylvania were Catholics safe from persecution; but even in tolerant Pennsylvania, Catholics were not allowed to hold public office.\n\nIn all of the colonies, regardless of the official position of the government, hatred of Catholicism was contained in everyday popular expressions, folktales, songs, and popular amusements. However, outbursts of real anti-Catholic persecution could, at any time, be generated in time of war or revolution.\n\nIn the long period of wars between England and Catholic France and Spain (1689–1763), anti-Catholic action was strongest in those colonies most exposed to potential attack. In the newly founded frontier province of Georgia, Catholics were not allowed to enter the colony. Even in Virginia, with less vulnerability to attack, all Catholics were disarmed during the French and Indian War, and they were not allowed to own horses. The Carolinas prohibited Catholics from holding any public office, and North Carolina forbade the employment of Catholics as guardians after 1755. Only political disunity in Maryland prevented much overt anti-Catholic legislation in Virginia before 1755; but, in that year, Maryland began double-taxation of Catholics.\n\nNo actual anti-Catholic legislation was passed in Pennsylvania until the outbreak of the French and Indian War, when prejudicial laws flowed from the formerly tolerant Quaker legislature. All Catholics were disarmed, forbidden from serving in the militia, double-taxed, and prohibited from settling in the western part of the colony most vulnerable to French attack. Even in formerly tolerant Connecticut, Catholics were denied any protection of their religion after 1743. New Hampshire instituted an oath of allegiance in 1752 requiring Catholics to renounce their allegiance to the pope.\n\nFear of a Catholic invasion died out with the defeat of France and Spain in 1763. The American colonies had other, more pressing, issues to divert their attention from anti-Catholicism. Resistance to new British regulations and taxes filled the space once occupied by fear of a Catholic foreign enemy. When this resistance movement began to develop momentum, however, anti-Catholicism provided demagogues with a handy tool for arousing popular sentiment.\n\nThe Quebec Act of 1774, designed to treat fairly the French Catholics now in the British Empire, stirred up a flurry of anti-Catholic outbursts. Preachers and politicians claimed that Great Britain was actually threatening Protestant religious liberty in the colonies by establishing Catholicism on their western frontier. And for those interested in destroying any residual loyalty to the British Crown, labeling George III as an ally or a puppet of the pope aided the cause considerably. Contemporaries testified later that the anti-Catholicism caused by the Quebec Act was a major unifying element in the American Revolution.\n\nThe Quebec Act led to a short revival in the colonies of the English celebration of Guy Fawkes Day, renamed Pope Day in the colonies, on 5 November each year. Involving the lower-class practice of burning an effigy of the pope, the celebration quickly spread from its home in New England to all the colonies in 1774. As far south as South Carolina, the pope was burned in a bonfire of English tea. When such celebrations threatened to destroy the unity among the recruits in the Continental Army, George Washington condemned the practice. Throughout the colonies after 1775, Pope Day foundered because of the desire to attract Catholic Canadians to the Revolutionary cause.\n\nAttempts to use anti-Catholicism in the war against Great Britain also faced impediments once it became apparent that a French alliance was in the best interests of the Revolution. Even so, some states disarmed Catholics as they had during the French and Indian War, and many an anti-Catholic commentator expounded on the sinister presence of Catholic Irish soldiers in the British Army. Assistance from Catholic France after the Alliance of 1778 was always looked on by some with suspicion. The Alliance also gave Loyalists an opportunity to pillory the Patriots with the seeming incompatibility between Catholic hierarchy and British freedom.\n\nOf the constitutions drawn up by the Revolutionary states, only those in Pennsylvania, Delaware, Maryland, and Virginia accorded Catholics full equality with other Christians. For a hundred years after 1776, New Hampshire upheld its seventeenthcentury test oath, its funding for only Protestant teachers, and its requirement that all members of the state government be Protestants. Similarly, in its 1779 constitution, Congregational Massachusetts supported only Protestant institutions and teachers and required all officeholders to take an oath rejecting any loyalty to foreign ecclesiastical powers. These restrictions were not removed until 1833. Congregationalism remained the established church in Connecticut as well until 1818.\n\nIn New York, John Jay strove unsuccessfully to have the constitution of 1777 prohibit Catholics from holding land or participating in state politics until they had abjured their beliefs in Catholic teachings and their loyalty to the pope. Yet the milder form ratified still refused naturalization to anyone holding \"foreign\" religious allegiance. This prohibition was removed in 1806. Although New Jersey proclaimed religious freedom in its 1776 constitution, Catholics were forbidden until 1844 from holding political office.\n\nIn 1776 North Carolina restricted officeholding to Protestants, as did South Carolina in its 1778 constitution. These restrictions were lifted in the latter in 1790 and in the former in 1835. Georgia kept its pre-independence anti-Catholic statutes on the books until 1798.\n\nEven the new Constitution of the United States was attacked by North Carolina because it did not contain the anti-Catholic test oath to which so many Americans were accustomed. The tolerant spirit of the Constitution, however, was infectious, as is evidenced by the removal of anti-Catholic laws in the states after 1790.\n\nGiven such a dispensation, American Catholic clergymen were quite wary of doing anything to resurrect the old fears of their religion. An appearance of foreign attachment had to be avoided at all costs. For that reason, they petitioned for, and obtained, the appointment of an American, John Carroll of Maryland, as the first Catholic bishop in the United States in 1789. He and his successors were at pains to defuse Protestant hostility by reinforcing the idea of Catholics as loyal Americans and not the puppets of a \"foreign\" leader.\n\nThe type of anti-Catholicism that emerged with the formation of the Federalist Party was more political than anything else. That party formed around an antipathy for the French during the French Revolutionary and Napoleonic Wars, and by their understanding that renewed immigration from Ireland largely benefited their opponents, the Democratic Republicans. The fact that the French and the Irish were Catholics was important but incidental. Nevertheless, it could be used to political advantage to justify persecution of political rivals under the Alien and Sedition Acts in the 1790s. Irish Catholic, Mathew Lyon, was the first person prosecuted under John Adams's Sedition Act, but Adams had no qualms about appointing British Catholic William Kilty to the highest judicial post in the District of Columbia.\n\nAfter the Democratic victory in 1800, anti-Catholic sentiments once again went underground except among Federalist holdouts in New England. Renewed immigration of Catholics from Ireland in the 1820s, however, increased Protestant fears that their beliefs and institutions were again in jeopardy. An attempt by the American Catholic hierarchy to calm Protestant fears by calling the First Provincial Council of Catholicity in America in 1829 actually backfired. Certain decrees of the council, like those warning against non-Catholic interpretations of the Bible, calling for the creation of separate Catholic schools, and urging baptism of Protestant children if there was a chance they could be raised Catholic, all stirred up ancient fears of a powerful, aggressive Catholicism. In a divided society experiencing unprecedented geographic growth and socioeconomic change, the monolith of Catholicism was very frightening.\n\nThe trusteeism controversy in several Catholic churches only served to catalyze these fears for the next thirty years. At issue here was whether or not lay trustees, who often had been instrumental in purchasing land and funding the construction of Catholic church buildings, should also have the right to select their religious ministers. To the trustees, and to most Protestant Americans, such a power seemed most in keeping with American customs. When, however, the Catholic bishop of Philadelphia, in a long, ugly confrontation that lasted from 1820 to 1830, was able to defeat the trustees, and when the state legislature refused to intervene, it seemed to many that foreign authoritarianism had triumphed.\n\nAnti-Catholic responses to this threat merged with the growing reform mania in the United States. Immigration restriction became popular, as did appeals to rediscover the true Protestant Bible. Thirty religious newspapers with a definite anti-Catholic agenda were founded by 1827, warning Americans of the evils of the Catholic Church. These and other examples of anti-Catholic propaganda were so troubling that formerly diffident Catholic church leaders felt compelled to respond to attacks in speeches, public debates with Protestant clergy, and apologetic publications of their own. Bishop John England of Charleston was an especially aggressive leader, founding the United States Catholic Miscellany in 1822. Reverend John Hughes of Philadelphia, later to become the bishop of New York when anti-Catholicism had progressed from mere words to brickbats and guns, established a Catholic Tract Society in 1827 to defend the beliefs of Catholics. In the end, Catholic attempts to explain themselves fell on deaf ears, and probably only added fuel to a fire that was about to engulf America in the nativist and Know-Nothing era.\n\nSee alsoCatholicism and Catholics; Constitutionalism: State Constitution Making; European Influences: The French Revolution; European Influences: Napoleon and Napoleonic Rule; Religion: The Founders and Religion; Religious Tests for Officeholding; Theology .\n\nbibliography\n\nBillington, Ray Allen. The Protestant Crusade, 1800–1860: A Study of the Origins of American Nativism. New York: Rinehart, 1952.\n\nCurry, Thomas J. The First Freedoms: Church and State in America to the Passage of the First Amendment. New York: Oxford University Press, 1986.\n\nLee, Francis Graham, ed. All Imaginable Liberty: The Religious Liberty Clauses of the First Amendment. Lanham, Md.: University Press of America, 1995.\n\nSmith, Elwyn A. Religious Liberty in the United States: The Development of Church-State Thought since the Revolutionary Era. Philadelphia: Fortress Press, 1972.\n\nJoseph J. Casino"}, {"url": "https://aoh-seattle.tripod.com/id19.htm", "page_content": "For who we are named\n\n\n\n\n\nArchbishop John Joseph Hughes (1787-1864) Born in Annaloghan, County Tyrone, Ireland. He immigrated to the United States in 1817 following his father Patrick Hughes. Working in quarries, mending roads and as a gardener in Chambersburg, PA. After several unsuccessful applications for admission to Mount Saint Mary\u0092s Seminary in Emmitsburg, Maryland, young Hughes was given a job as seminary gardener until a vacancy came open. After ordination, Father John Hughes served in a number of churches in Philadelphia and gradually emerged as a leader and fighter. He attracted attention by his controversial writings and speeches. At a time when many Catholics thought it best to suffer the bitter anti-Catholicism of the day in silence, Father Hughes believed in outspoken vigorous defense. He used controversy to make the critics of Catholicism more cautious and to give a much needed morale boost to Catholics. He was a man of deep convictions. He consistently opposed any suggestion that Catholicism was an obstacle to civil and religious liberty and vigorously defended the basic harmony between Catholicism and American political institutions. He felt it his duty to prove that American Catholics were in sense second-class citizens. He was the fourth Bishop of New York City and it\u0092s first Archbishop. His works included the founding of Fordham University, the current St. Patrick\u0092s Cathedral, the paper\u0092s Freeman\u0092s Journal and Catholic Herald, the Immigrant Bank for new Irish and Catholic\u0092s in New York and the formation of the Catholic parochial school system in America. He publicly defended the Church during the \u0093Know \u0096Nothing\u0094 movement of 1800\u0092s and was President Abraham Lincoln\u0092s personal agent to France-Rome and Ireland during the Civil War. An example of Archbishops courage and defense of Church is seen in the anti-catholic riots in Philadelphia in which \u0093know-nothing\u0094 followers had burned churches, schools, and assaulted priests and catholic. Archbishop Hughes called surrounded the churches of New York City with a contingent of one to two thousand Irishman, members of the Ancient Order of Hibernians ALL. To the anti-catholic mayor of New York James Harper the admonition \u0093that if one Catholic Church in New York is attacked or burned, the city would become a second Moscow\u0094 Not a church was touched. Archbishop Hughes passed away in 1864 after a long illness and is currently buried in St. Patrick\u0092s Cathedral New York City. As Archbishop Hughes praised the men of the AOH \u0093 who feel no consciousness of inferiority to any portion of their fellow citizens, but who are, in every sense of the word thoroughly American.\u0094 We honor his name and spirit with the naming of our division in his honor.\n\n\n\n\n\nThe first Washington division of the Ancient Order of Hiberniansin America, was organized in 1890 in Tacoma. In 1900 Washington sent it's first delegate, a member of Spokane's Division No.1 to a national convention, and during that period of time the state had six divisions with a membership of approximately 200. In 1904, the national Hibernian organizer, stated that Spokane was the bright spot of Washington with several divisions in good order. Two other towns had AOH units, one in Bellingham Whatcom, county and Tacoma where again a few individuals kept the division going. The Ancient Order of Hibernians with the Ladies Ancient Order of Hibernians was active in Seattle until the 1950's. Seattle had four divisions. There was also divisions of the Ladies Ancient Order of Hibernians throughout the state. Meetings were held the First Monday and the third Sunday of each month at the Hibernian Hall at the corner of 9th and Yessler Way. During the St. Patrick's Day event held by the Seattle Divisions of the Ancient Order of Hibernians, members along with City of Seattle Officials and the Seattle Chamber of Commerce celbrated the day and the Golden Jubilee of Washington State. The event was entertained by the Glee Club of Seattle College (now Seattle University). In an article from the Seattle Times of March 1939, it announced the AOH's St. Patrick's day event along with a listing of new officers. These were, Michael McDonough-vice-president; Leo McCulloch, secretary; Jmaes L. Dougherty Jr, treasurer; Joseph Wall, sergeant at arms and\n\n\n\nKevin G. Henehan as Prseident. (above photo) Mr. Henehan lead a distinguished career during his lifetime. First as plant superindendent of the Seattle Frog & Switch Company, Pacific NW Manager of de Frenery & Co. Investment Firm, Claim agent King County King County District Attorney Ofice, Senior Examiner King County Auditors Office. He was also the campaign manager for future Govenor Warren Magnuson in his 1934 for district attorney.\n\nMr. Henehan himslf (photo above) was State Senator for the 37th district 1943 to 1947.\n\nThus the Ancient Order of Hibernians held a long heritage in the Irish community of Seattle and Washington from the late 1800s until somewhere around the 1940s or late 1950s. From a meeting at a local pub a few individuals gathered and from there to October 23 1998 when the Seattle Division was reborn.\n\nFrom the National Historian of the AOH are documents concerning state, county and division officers are from 1905 to 1910. These were sent to the national board of the AOH during that era.Below are the names and address of those individuals.\n\nAOH King County J.L. Fitzpatrick, Pioneer Bldg. Seattle William Curtin, 1123 Franklin Ave. Seattle Michael Harrington 1109 Washington St. Seattle John Keenan Seattle Rev. J.E. O'Brien, Seattle\n\nRichard Slattery 506 21st Ave. Seattle Edward Doran, 2016 Dearborn St. Seattle Michael O'Hara, 826 20th Ave. Seattle Michael Harrington, 1100 Washington Ave. Seattle Jerry Barry, Bishop Court Seattle\n\nJohn J. Doran 2016 Dearborn St. Seattle John Rea Seattle\n\nL.M. Gaffney 945 Tacoma Ave. Tacoma Thomas Gorman 610 23rd St. Tacoma Jerry O'Connor 1623 So. J. St. Tacoma John J. Hopkins 2923 N. 30th St. Tacoma William Walsh 1130 E. 28th St. Tacoma James Martin 382 Chase Ave. Walla Walla W.D. Gleason 626 S. Anderson St. Tacoma P. Fitzpatrick 923 E. Marion St. Seattle Thomas Golden RFD 2 Vancouver Frank Day RFD 1 Camas Terrence Nolan RFD 2 Vancouver Martin Farrell R.F. D. 2 Camas Michael O'Hara 1510 Sanders Pl. Seattle James Clynch 905 4th Ave. N. Seattle J.J. Wood 10071/2 Main St. Seattle Chas. Gallagher 947 23rd Ave.S.Seattle John J. Hayes 1315 5th Ave. Seattle James Boyle 1312 7th Ave. Seattle John McGuire 1623 Bellevue Ave. Seattle John Coffey Rainer Club Seattle Andrew Donohue 1315 6th Ave. Seattle P.B. Kearney Spokane Jeremiah O'Connor 1623 J St. Tacoma A.A. Collins 1407 First Ave. Seattle Father O'Brien Church of our Lady of Good Help Seattle E.J. Flaherty 1519 College Ave. Spokane Bishop O'Dea Terry Ave. Seattle\n\nLadies AOH Mary A. Cummings 415 10th Ave. Seattle Jane E. Kuepferle Cor.Yessler and 28th Ave. Seattle Margaret Cleary 2719 Pine St. Everett Katherine Hays 727 Catherine St. Walla Walla Miss Teresa McHoney 1215 3rd Ave. Seattle Miss Margaret Dunn 1626 7th Ave. Seattle Mrs. Celia Hunt 1213 E.Alder St. Seattle Mrs. Catherine McArdle 412 8th Ave.S. Seattle Miss Kittie Lloyd 3105 S. K. St. Tacoma Mrs. Anna Schilling 6208 S. Alder St. Tacoma Mrs. Carolina O'Leary 10141/3 Tacoma Ave Tacoma Mrs. Agnes Dockery 2931 Maple St. Everett\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://rationalwiki.org/wiki/Anti-Catholicism", "page_content": "Note that this page is about conspiracy theories, pseudohistory , and other crank ideas about the Church. For legitimate criticism of the Roman Catholic Church, see relevant articles in the category Catholicism\n\n“ ” A penny loaf to feed ol' Pope. A farthing cheese to choke him. —[1] [note 1]\n\nAnti-Catholicism refers to staunch opposition to the Roman Catholic Church and to its members, usually grounded in conspiracy theory, nativism, and misrepresentation of Catholic theology (usually by Protestants and, often, copious amounts of tangentially related wingnuttery). Some brands of the anti-Catholic conspiracy theory paint the Catholic Church as a lone conspirator seeking world domination, though others depict the Church as being in bed with the Illuminati or Freemasons. In truth, the Vatican suppressed the Illuminati, and staunchly opposed Freemasonry from its very origins.\n\nWhile anti-Catholic bigotry was once rampant among Protestants, recent political re-alignments have strengthened ties between conservative Protestants and the Catholic hierarchy. Increasingly, so-called \"anti-Catholicism\" is merely whining about criticism of the Church or carping about coverage being insufficiently pro-Catholic, especially when this criticism or coverage concerns disagreement with the Church's positions on issues such as birth control, divorce, abortion, gay rights, and (most understandably of the bunch) the Church's handling of pedophile priests.[2][3]\n\nThe Reformation and England [ edit ]\n\n“ ” Anti-Catholicism has always been the Anti-Catholicism has always been the pornography of the Puritan —Richard Hofstadter[4]\n\nThe idea of the pope as Antichrist plays a central role in the anti-Catholic conspiracy theories. This idea dates back to the Protestant Reformation, when Martin Luther (1483-1546), whose complaints about financial and theological improprieties the Church had ignored, set off a schism within Western Christianity. (Eastern Christianity already had its own gripes with the popes - Eastern Orthodox Christians disliked the Vatican sponsoring military crusades against them (as in 1204[5] or 1242[6]), quite apart from any theological issues.) Following a popular conception of his day, Luther believed that during the End Times, Satan would work to corrupt the Church. Luther believed that the institution of the papacy was that corrupting influence, and, borrowing the term from the first and second letters of John, he called it \"antichrist\".[note 2] Luther produced a series of woodcarvings with side-by-side depictions of the Pope (labeled as \"antichristus\") and Jesus in which the pope was doing the opposite of Jesus (for example: in one carving, Jesus is washing the feet of the poor while the pope is having his feet washed by the poor).[7]\n\nConspiracy theories about the Catholic Church found especially fertile ground in England from the 16th century onwards with the English Reformation and creat evolution of the Church of England. The persecutions of Protestants launched by \"Bloody\" Mary (reigned 1553-1558), in which the English authorities put more people to death for heresy in five years than had been executed during the previous fifty, did nothing to improve the image of Roman Catholicism in England. The threatened invasion of England courtesy of the Spanish Armada in 1588, with its implied threat of reviving Marian-style persecutions, also didn't help. The Gunpowder Plot of 1605, an actual conspiracy by Catholics to assassinate King James I, also helped to fuel anti-Catholicism in England. Probably the most famous anti-Catholic theory involved the so-called \"Popish Plot\", a conspiracy theory cooked up by one Titus Oates that implicated the Catholic Church in a conspiracy to assassinate King Charles II[8] (who personally tended towards leniency to Catholics and allegedly converted to Catholicism on his deathbed in 1685). This led to a moral panic in the 1670s and 1680s that canny political operators used to justify the execution of at least fifteen alleged conspirators and the introduction in 1679 of the Exclusion Bill, which sought to de-legitimize James, Duke of York (later King James II, reigned 1685-1688), as heir to the throne due to his Catholic faith.[9] The idea that the Jesuits were foot-soldiers in the vast Catholic conspiracy, another common theme in anti-Catholicism, also played a role in Popish Plot theories.[10]\n\nBeginning in the mid-17th century, the English parliament passed a number of penal laws with the intent of suppressing Catholicism and re-asserting the authority of the Church of England. The Clarendon Code, four acts passed between 1661 and 1665, targeted the political and religious \"perversions\" of Catholics and other non-Anglican heretics.[11]\n\nAmerica and Know Nothingism [ edit ]\n\nThe US into the mid-19th century [ edit ]\n\nProtestant settlers in America often took with them the anti-Catholic sentiment found in Europe. However, due to the overwhelmingly Protestant religious make-up of the nascent United States, anti-Catholicism did not become a major political issue until the 19th century. Anti-Catholic sentiment in the 1800s arose in large part as a response to the large influx of Roman Catholic immigrants from Ireland and Germany. One of the most popular early anti-Catholic tracts was written by none other than the inventor of the telegraph himself: Samuel Morse. In 1835, Morse published a book called Foreign Conspiracies Against the Liberties of the United States,[12] which alleged the Catholics were part of a larger conspiracy based in Austria to install a member of the House of Habsburg as the imperial ruler of the US.[4] During this period, anti-Catholicism began to become intertwined with early versions of the Freemason and Illuminati conspiracy theories, all of which played into nativist ideas about a European monarchical takeover of the US.\n\nWhile Irish immigrants were most frequently targeted by nativists, Germans were also victimized, especially in the Midwest, while Hispanics were targeted in western states and territories. Expansionists like Sam Houston often employed anti-Catholic rhetoric to justify America's conquest of Texas and California, liberating the west from the tyranny of Catholic Mexico.\n\nNumerous \"exposés\" of the Catholic Church gained popularity, invariably alleging debauchery and torture among nuns and priests. The testimony of Rebecca Reed, who was alleged to have been held captive by the Ursuline convent in Charlestown, Massachusetts, inspired an anti-Catholic mob to destroy the convent in August 1834.[13] The Awful Disclosures of Maria Monk, published in 1836, detailed the debaucheries of the Hôtel Dieu monastery in Montreal, Canada, including orgies, beating and murder of nuns, and the sacrifice of illegitimate infants. Though Monk proved to have been a mentally ill prostitute coached by Protestant evangelicals, her book became a best-seller and inflamed anti-Catholic sentiments throughout America.[14]\n\nThese attitudes frequently brimmed over into violence, with riots erupting in New York, Boston, Baltimore, New Orleans, and other cities throughout the 1830s, 1840s, and 1850s. Some of the most destructive were Philadelphia's Bible Riots in May and July of 1844, where arguments over the use of Catholic Bibles in public schools led to armed clashes between Catholic and Protestant mobs in Kensington and other Irish neighborhoods.[15] Fifteen people were killed and dozens of Catholic churches and homes were destroyed in the course of these riots.[16] Louisville, Kentucky suffered an even worse riot in August 1855, dubbed \"Bloody Monday\", where attacks on the city's German-American population left twenty-two dead.[17]\n\nKnow Nothingism [ edit ]\n\nThomas Nast expressing a common anti-Catholic sentiment of the era, that Catholics would attempt to subvert children\n\nSee the main article on this topic: Know Nothing Party\n\nIn the mid-19th century up until the American Civil War, the nativist Know Nothing movement represented the high-water mark of anti-Catholicism in American politics. The Know Nothings believed in an imminent papal takeover of the US via the \"political Romanism\" of newly arrived immigrants and attempted to have Catholics banned from public office. They also managed to field Millard Fillmore as a candidate on the Know Nothing ticket in the election of 1856.\n\nPost-bellum America into the 20th century [ edit ]\n\nSmaller Know Nothing-esque movements, however, persisted in American politics. The Panic of 1893 was latched onto by the newly formed American Protective Association as \"proof\" of a Catholic conspiracy to destroy the financial institutions of the US. This fringe political movement spawned a host of new conspiracy theories, including allegations that agents of the Church had assassinated Abraham Lincoln.[18]\n\nAnti-Catholic animus often targeted Italians as they began arriving in greater numbers in the 1880s. The most notorious incident occurred in New Orleans in March 1891, where the murder of Police Chief David Hennessey led to the lynching of eleven Italian immigrants. At least fifty Italians were lynched in the United States between 1890 and 1920.[19]\n\nAnti-Catholic conspiracy theories continued to incubate on the fringe right until the revival of the Ku Klux Klan in the early 20th century. The KKK promoted Protestant white supremacism, leading them to target not just blacks, but basically all minorities. The Klan worked at the local level to shut down Roman Catholic churches and schools largely in the 1920s.[20][21]\n\nAnti-Catholicism became a major issue once again during the presidential campaign of 1928, which pitted the Irish Catholic Governor of New York Al Smith, the first major-party Roman Catholic candidate in a presidential election, against Herbert Hoover. Smith's opponents used the phrase \"Rum and Romanism\" (Smith was also a \"wet\" opposed to Prohibition) as a pejorative reference to his campaign,[22] echoing an earlier description of the Democrats as the party of \"Rum, Romanism and Rebellion.\"\n\nThe so-called \"Catholic Question\" once again became an issue in the 1960 campaign of John F. Kennedy. Prominent Protestant ministers, such as Billy Graham, distrusted Kennedy's Catholicism and tried to derail his campaign.[23] The more extreme, paranoid wing of the American conservative movement dredged up the old anti-Catholic conspiracy theories in response to Kennedy's candidacy and subsequent presidential administration as he became the first Roman Catholic president of the US.[24][25]\n\nGermany, Bismarck, and \"Ultra-Montanism\" [ edit ]\n\nOtto von Bismarck famously hated the Catholic Church, especially when organized politically, and questioned whether those with \"ultra-montan\" (beyond the mountain, i.e. South of the Alps) loyalties could have German loyalties and be good citizens. Ultramontanism was both a slur employed by anti-Catholics and used by Catholics themselves to show just how hardcore they were in their loyalty to the Pope.\n\nModern variants [ edit ]\n\nAnti-Catholicism as a political movement has mostly dropped off the radar in the current American political landscape. Most major criticisms of the Church originate in more secular issues like the child sex abuse scandal and the Vatican establishment's social conservatism, and come from lay Catholics themselves as often as not. However, hardcore anti-Catholic wingnuttery still finds a home in many fringe movements and subcultures. The following conspiracy theories often cross-pollinate into unholy alliances of crankery as well, just like in the good old days.\n\nNew World Order conspiracists [ edit ]\n\nSee the main article on this topic: New World Order\n\nConspiracy theorists pushing \"New World Order\" theories alleging a vast global conspiracy made up of the (Jews/Illuminati/Communists/Freemasons/Jesuits insert your favored conspiratorial bogeyman here) will often throw anti-Catholicism into the mix, mining the conspiracist literature of yesteryear for ever more pseudohistory to shoehorn into the New World Order framework. Current conspiracy theories include that those which claim that Pope Francis is the head of the New World Order government and has plans to create a One World Religion to bring about the reign of the antichrist, this despite them holding the contradictory belief that he is the antichrist.[citation needed]\n\nWingnut fundamentalist Protestants [ edit ]\n\nHardline fundamentalists still continue to claim that the pope is the antichrist and that Roman Catholics engage in Satanic, demonic, occult, or otherwise un-Christian practices,[26] plus equating the Church with the Whore of Babylon, worship of Mary and the Saints with idolatry (see further down \"The Two Babylons\"), and considering Catholicism a (false) religion (read: basically paganism in disguise). Of course, all of that comes mixed in with claims of them not practicing a religion and other similar apologetics' nonsense, even if Protestantism is an off-shoot of it that uses a number of conventions and ideas established by Catholicism.\n\nChick tracts are replete with Evangelical hatred for the Church. One tract argues that the Church created Islam, Communism, Nazism, Freemasonry, and more[27] (never mind that all of those were their enemies to differing degrees). In fact, there are more Chick tracts that condemn the Catholic Church than there are Chick tracts which condemn Mormonism, Islam, and the Jehovah's Witnesses combined. One particularly odd theory begun in the 1800s which Chick endorsed claimed that Catholicism is based on ancient Babylon's religion (The Two Babylons, a long-debunked claim), with this later corrupting \"true\" (Protestant) Christianity. His online store still offers it.[28]\n\nThe antichrist theory inevitably leads to a round of crankery every time a new Pope is selected, i.e. \"This time, he really is the antichrist and the end is surely nigh!\"[note 3] Wash, rinse, repeat.[29] Pope Francis is due to be the very last according to some predictions,[30] so mass hysteria may follow.\n\nReligious anti-Catholicism often merges into New World Order conspiracism. Pat Robertson's 1991 screed The New World Order is such an instance.[31] That makes these theories a staple among the religious element of the hard right black helicopter set.\n\nThe Da Vinci Code [ edit ]\n\nSee the main article on this topic: The Da Vinci Code\n\nDan Brown's publication of The Da Vinci Code in 2004 made anti-Catholic conspiracy theories cool again by popularizing and ripping off the pseudo-scholarship of the 1982 book Holy Blood, Holy Grail. The ideas about a cover-up of Jesus' relationship with Mary Magdalene and the true nature of the Holy Grail are sometimes subsumed into the wider anti-Catholic conspiratorial framework or, alternately, open up those with the inclination toward crankery to a vast wealth of anti-Catholic pseudo-scholarship. The secretive Opus Dei sect of the Church often plays a big role in these theories. Brown has admitted, however, that he does not believe in these conspiracy theories but only adapted them to suit his novels and write fiction.\n\nNorthern Ireland [ edit ]\n\nSee the main article on this topic: Northern Ireland\n\nAnti-Catholicism was cross-pollinated with Unionist (pro-British) extremism during The Troubles in Northern Ireland, with gruesome results. While the IRA are remembered as the main terrorist group of the conflict, Protestant extremists like the Ulster Volunteer Force and the Ulster Defense Association had a major hand in the fighting. Ian Paisley, the ideological godfather of Protestant extremism in Northern Ireland, earned notoriety during his time in the European Parliament for denouncing Pope John Paul II as the antichrist. The Troubles are perhaps the most recent case in the Western world of anti-Catholicism contributing to actual bloodshed.\n\nLUCIFER telescope [ edit ]\n\nSee the main article on this topic: LUCIFER telescope\n\nThe Vatican maintains the Vatican Advanced Technology Telescope at Mount Graham International Observatory in Arizona. Some Wingnut Fundamentalists have reported incorrectly, conflated the shared geographic location of the Vatican Advanced Technology Telescope (VATT) with the nearby Large Binocular Telescope's (LBT) module known by the LUCIFER acronym (Large Binocular Telescope Near-infrared Spectroscopic Utility with Camera and Integral Field Unit for Extragalactic Research, later renamed LUCI). This has led to some erroneous reporting of Vatican hidden agendas being circulated.[32][33][34]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n↑ Up till the 19th or early 20th centuries, people could choke on cheese, especially if cheese vats were left open so foreign bodies could fall in. ↑ The term \"Antichrist\" is found nowhere in the Book of Revelation. ↑ In some cases, this is even claimed by Catholics themselves."}], "John Joseph Hughes was instrumental in the establishment of the first Catholic schools and orphanages in New York.": [{"url": "https://www.nytimes.com/2018/03/07/nyregion/dont-mess-with-dagger-john.html", "page_content": "In his St. Patrick’s Day sermon in 1852, John J. Hughes, the newly minted first Roman Catholic archbishop of New York, raised a discomfiting cautionary flag.\n\n“There is reason to fear,” Hughes admonished the congregants at Old St. Patrick’s Cathedral on Mulberry Street, “that when God permits men or nations to prosper to the extent of their desires, it is a mark of his disfavor.”\n\nHis warning that the worldly lure of America’s Manifest Destiny was already threatening his parishioners’ spiritual bonds suggested just how far Irish-Americans had progressed in the more than three decades since Hughes himself had immigrated from County Tyrone.\n\nLast year, in their “Sons of Saint Patrick: A History of the Archbishops of New York From Dagger John to Timmytown” (Ignatius Press), George J. Marlin and Brad Miner traced the evolution of the archdiocese. Now, just in time for St. Patrick’s Day, in “Dagger John: Archbishop John Hughes and the Making of Irish America” (Three Hills, Cornell University Press), John Loughery prodigiously profiles the most transformative archbishop of them all."}, {"url": "https://www.encyclopedia.com/people/philosophy-and-religion/roman-catholic-and-orthodox-churches-general-biographies/john-joseph-hughes", "page_content": "HUGHES, JOHN JOSEPH\n\nFirst archbishop of New York; b. County Tyrone, Ireland, June 24, 1797; d. New York, N.Y., Jan. 3, 1864. John was the third of seven children of Patrick and Margaret (McKenna) Hughes, small farmers who avoided involvement in Ireland's political disturbances. John attended the local schools, and soon showed an interest in the priesthood. In 1816 the father and an older son immigrated to the U. S., sending for John the following year, and for the rest of the family in 1818. They settled in Chambersburg, Pennsylvania, where John worked in the quarries, at mending roads, and as a gardener. He made several applications for admission to Mt. St. Mary's Seminary, Emmitsburg, Md., only to learn that there was no room. When, however, Rev. John dubois offered to take him as a gardener until a vacancy occurred, Hughes went to Mt. St. Mary's on Nov. 10, 1819, and a year later was received in the seminary. He was accepted by Bp. Henry conwell for the Diocese of phila delphia, Pa., and ordained in St. Joseph's Church, Philadelphia, on Oct. 15, 1826; arrangements were made for him to continue his studies under Michael Hurley, OSA, who was assigned to St. Augustine's parish in that city.\n\nCareer in Philadelphia. When Hughes arrived, the trustees of St. Mary's Cathedral were in open conflict with Conwell as a result of the Hogan schism, which dated from 1821. After about a year at St. Augustine's, where he had a chance to watch developments at St. Mary's, Hughes spent a few weeks as pastor of Bedford, Pa.; he was then recalled to Philadelphia to become, successively, pastor at St. Joseph's (January 1827) and at St. Mary's (April 1827). When the trustees of St. Mary's refused to pay his salary, he returned in July to St. Joseph's, where he remained until St. John's Church was built and dedicated in April 1832. The new church had no lay incorporators and Hughes administered his parish with a firm hand.\n\nAlthough highly successful in his pastoral activities, he attracted more attention by his controversial writings and speeches. His first published sermon, which enhanced his reputation as a preacher, was on Catholic emancipation, then recently granted in Ireland, and was dedicated to Daniel O'Connell, whom he greatly admired. Anti-Catholicism, then strong in Philadelphia, was expressed freely in sermons, lectures, and the bitterly polemical Protestant weeklies. There was no Catholic paper, since many Catholics, including Bp. Francis Kenrick, who had been appointed coadjutor with full jurisdiction in 1830, thought the best policy was to suffer in silence. Hughes, on the contrary, believed in a vigorous defense. He founded the Catholic Herald, a newspaper that he later turned over to the diocese. Earlier he had established a Catholic Tract Society to distribute free pamphlets. In 1830, using the pseudonym \"Cranmer,\" he wrote letters to the Protestant, a New York weekly specializing in anti-Catholic propaganda. When, however, his wildly improbable accounts of Catholic plots and progress failed to strain the credulity of the editors and readers, he exposed the hoax. His best known controversy in Philadelphia was with Dr. John Breckinridge, a Presbyterian clergyman, with whom he debated in writing (1833) and orally (1835) on the Rule of Faith, and Catholicism as an obstacle to civil and religious liberty.\n\nHughes did not overestimate the value of controversy, but used it to make the enemies of the Church more cautious and to raise the morale of the sorely tried Catholic masses. His talents and his achievements attracted attention, and his promotion to the episcopate was generally expected. He had been recommended as coadjutor of Philadelphia by Conwell in 1829, and for Cincinnati in 1833. In 1836 the Holy See designated Hughes as coadjutor of Philadelphia and Kenrick as bishop of a new see to be erected at Pittsburgh, but Gregory XVI delayed formal approval. In 1837 when the Third Provincial Council of Baltimore asked that the division of Philadelphia be postponed, Hughes was preconized titular bishop of Basileopolis and coadjutor, with the right of succession, of New York. He was consecrated there on Jan. 7, 1838, in old St. Patrick's Cathedral.\n\nNew York. The diocese then consisted of all of New York State and about one-half of New Jersey, an area of about 55,000 square miles. Hughes found 22 churches, 10 of which had been erected in 1837, and 40 priests, to serve the needs of 200,000 Catholics, in a total population of about 2,700,000. The Emmitsburg Sisters of Charity were the only religious community in the diocese. Seven parochial schools, all in New York City, and four orphan asylums, two of which were in the city, made up the total of Catholic charitable and educational institutions. The population of the U.S. was increasing rapidly; in New York City the increase was five times the national rate. Moreover, the churches of the city were burdened with a heavy debt, $300,000. When, in January 1838, Dubois suffered a stroke, responsibilty for the diocese devolved upon Hughes, who was named apostolic administrator in August 1839 and succeeded to the see on Dec. 20, 1842. He became archbishop of New York on July 19, 1850, when it was made an archdiocese.\n\nHughes's authority was challenged in February 1839, when the cathedral trustees had a catechist appointed by Dubois ejected from the Sunday school by the police. A pastoral, written by Hughes and signed by Dubois, threatened the parishoners with an interdict unless they repudiated the trustees. This was done promptly, at a meeting summoned, addressed, and presided over, by Hughes. Except for the parish of St. Louis in Buffalo, where the trustees held out for years, New York had no further difficulty with trusteeism.\n\nAfter a preliminary visitation of the diocese, Hughes went to Europe in October 1839, seeking aid in Paris, Rome, Munich, Vienna, and Dublin. On his return in 1840, he engaged in his greatest contest over the question of religion and the public schools. The Public School Society, a private organization, practically monopolized public funds for education in New York City from 1825 to 1840. Professedly nonsectarian, it provided religious training that was offensive to Catholics, who wanted state aid for denominational schools and a proportionate share of public funds. Governor William Seward agreed with the Catholics, but the city aldermen and the state legislature were hostile. The resultant controversy, which destroyed the Public School Society, led to two quite unexpected developments—the total secularization of U.S. public education on all levels, and the creation of the parochial school system in the U. S.\n\nThe growth of political nativism had led, in 1844, to the burning of Catholic churches and widespread riots in Philadelphia. Hughes's success in arousing his people to defend the churches against mob violence, while exhorting them to give no provocation, prevented similar disorders in New York. His firm stand on this and on the school question made him known throughout the country. Although attacked and misrepresented in the press, he was, nevertheless, highly respected in both Catholic and non-Catholic circles.\n\nHis achievements in the diocese included the erection of four new sees; the beginning of the new St. Patrick's Cathedral; the founding of a seminary, and of a college at Fordham, New York City, which he later transferred to the Jesuits; the introduction of many religions communities; and the development of charitable and educational works. He was instrumental in separating a group of Sisters of Charity from Emmitsburg, Md., thus founding the independent Mt. St. Vincent community in New York City.\n\nNational and International Affairs. Hughes was a vigorous defender of the temporal power of the pope, and sponsored more than one special collection to help Pius IX. He took a leading part in the founding of the North American College at Rome in 1859. Thoroughly unsym-pathetic to the abolitionist movement in the U. S., he believed that sudden emancipation would injure the slaves. He opposed plans to settle Irish immigrants on farm lands in the West, fearing they would be lost to the Church because of the shortage of priests. Although he endorsed Irish nationalism, he disapproved of risings that he thought could not succeed, and condemned Irish antislavery sentiment as an intrusion into U. S. politics. Because he was convinced of the basic harmony between American political institutions and Catholicism, he urged Catholic support of the U. S. Constitution and was friendly with officials of the national government. When President James Polk tried to send him to Mexico in 1847, he refused the mission because of its unofficial character. A visit to Europe in support of the Union, 1861–62, was undertaken at the request of President Lincoln and Secretary Seward. He was recommended to Rome for the red hat by Lincoln's government; when no action was taken, some believed the time was not ripe for an American cardinal, while others thought Hughes was not the best choice. His last public appearance was made in July 1863, at the request of New York Gov. Horatio Seymour, who was attempting to stop the draft riots that were then occurring in the City of New York.\n\nCharacter and Personality. Archbishop Hughes was a born leader and fighter. Prompt and vigorous in action, and unyielding in conflict, he believed he had the duty and the ability to lead and defend his people, and to prove that American Catholics were not second-class citizens. If he was autocratic and at times fought harder than was necessary, he merely displayed the defects of his virtues.\n\nAlthough Hughes became increasingly intolerant of disagreement, he nevertheless rendered valuable service to both Church and country. As his successor, Abp. John McCloskey, said: \"… if ever there was a man who in the whole history and character of his life impressed upon us the sense and conviction that he had been raised up by God, was chosen as His instrument to do an appointed work … that man was Archbishop Hughes.\" Hughes died of Bright's disease, after a long illness, and was buried in the old cathedral. His remains were translated to the new St. Patrick's Cathedral in 1883.\n\nBibliography: Complete Works, comp. and ed. l. kehoe, 2v. (New York 1865). j. r. hassard, Life of the Most Reverend John Hughes, D.D., First Archbishop of New York (New York 1866). h.a. brann, Most Reverend John Hughes: First Archbishop of New York (2d ed. New York 1912). e. m. connors, Church-State Relationships in Education in the State of New York (Washington 1951). f. d. cohalan, A Popular History of the Archdiocese of New York (Yonkers, N.Y. 1983). r. shaw, Dagger John: The Unquiet Life and Times of Archbishop John Hughes of New York (New York 1977).\n\n[f. d. cohalan]"}, {"url": "https://catholicschoolsny.org/about-us/history-of-schools/", "page_content": "Two Centuries of Transforming Lives\n\nIn 1800, six years before the first public school was established in New York, Irish and German immigrants at St. Peter’s Parish founded a school for 100 students on Barclay Street in lower Manhattan. St. Peter’s School was the only Catholic school in Manhattan until St. Patrick’s (Old) Cathedral School opened in 1817 on Mott Street.\n\nArchbishop John Hughes, who served New York from 1842 to 1864, is considered by some the grand architect of what would become the Catholic school system. Responding to the widespread anti-Catholicism of his time, particularly in the existing public schools, Archbishop Hughes built a parallel Catholic school system in New York. The schools were staffed by dedicated members of numerous religious orders, including the Sisters of Charity, the Ursuline Sisters, the Jesuits, the Dominicans, the De La Salle Christian Brothers and the Sisters of Mercy.\n\nMore than two dozen parochial schools opened during his tenure, and by 1870, more than 22,000 children – some 19 percent of the school-age children in New York City – were enrolled in Catholic schools.\n\nIn 1884, the American Catholic bishops decreed that every parish should have a school, and that it should be the first building constructed in the parish. By the end of the century, Catholic schools had become a major component of what American Catholic bishops considered “an Empire of Charity.” In New York, by 1900 there were more than 55,000 students enrolled in parochial elementary schools and in Catholic secondary schools.\n\nAs Catholic New Yorkers began to move outside the city during the 20th Century, parishes across the seven counties of the Hudson Valley responded by opening schools to advance the Church’s mission to educate the mind, body and spirit of its people. Catholic school enrollment throughout the Archdiocese peaked in 1965, at the end of the Baby Boom.\n\nIn 2017-18, more than 67,000 children were enrolled in 211 Catholic elementary and secondary schools across the nine Catholic school regions of the Archdiocese of New York, from Staten Island to Kingston.\n\nThe Catholic schools of Archdiocese grew and evolved to meet the changing needs of the families they served. And they have a long and successful history. Graduates have included the first Catholic to run for president, Al Smith, and the first Latina on the Supreme Court, Sonia Sotomayor. Catholic school students in New York have been personally inspired by saints, including Elizabeth Anne Seton and Mother Frances Cabrini, who have taught in our classrooms.\n\nFrom their founding more than 200 years ago, Catholic schools in the Archdiocese have placed special emphasis on providing educational opportunities for immigrants, a mission which continues today.\n\nInspired by our rich past and building on that tradition of excellence, we continue our mission to educate students intellectually, spiritually, morally and physically in an environment infused with the Gospel message; and we remain steadfast in our commitment to provide a Catholic education to every child who seeks it.\n\nIn 2013, the Department of Education of the Archdiocese of New York launched Regionalization, a key component of Pathways to Excellence, our strategic plan designed to ensure a vibrant, sustainable Catholic elementary school system in the Archdiocese of New York, both now and in the future.\n\nWhat is Regionalization?\n\nRegionalization involved the coming together of most parish elementary schools into geographic regions. Every parish is responsible for, contributes to, and has a voice in Catholic education in the Archdiocese. Given the importance of Catholic education to the community and to the Church, the laity and religious are called on to have an expanded leadership role in school governance with clergy.\n\nAn essential component of regionalization is reinvestment, which includes reallocating current resources back into Catholic education while identifying and securing additional funding. The goal is a system of strong, accessible, affordable Catholic schools, owned by every parish, supported by every Catholic, available to every child.\n\nClick on the links below to download these Regionalization fact sheets:\n\nFact Sheet 1: Regionalization\n\nFact Sheet 2: Governance\n\nFact Sheet 3: Board Duties\n\nFact Sheet 4: Pastor Role"}, {"url": "https://aoh.com/2021/03/16/archbishop-dagger-john-hughes/", "page_content": "John Joseph Hughes was born on 24 June 1797 in Annaloghan, Co. Tyrone, to a poor farmer. As a Catholic in English-ruled Ireland, he couldn’t even receive a Catholic education. When John was 15, his younger sister, Mary, died and British law barred a Catholic priest from presiding at her burial; the best he could do was to scoop up a handful of dirt, bless it, and hand it to John to sprinkle on her grave. Hughes never forgot that and dreamed of ‘a country in which no stigma of inferiority would be impressed on my brow, simply because I professed one creed or another.’ Fleeing poverty and persecution, John’s father brought the family to America in 1817 and settled in Chambersburg, PA. John made unsuccessful applications to study at Mount St. Mary’s College in Emmitsburg, MD, but was hired by its rector as a gardener. Working there rekindled his childhood dream of becoming a priest; he asked again if he could enroll as a student and was turned down because of his lack of education. John befriended Mother Elizabeth Ann Seton who persuaded the college to reconsider and Hughes was admitted in September 1820.\n\nAfter graduation, he served the diocese of Philadelphia as a seminarian until 5 October 1826 when he was ordained a priest by Bishop Henry Conwell. During his early years as a priest, Hughes founded St. John’s Orphan Asylum in 1829 and in 1832 was responsible for building the new church of St. John the Evangelist – one of the most impressive churches in the country at that time. His initiative was recognized and on 7 August 1837, Pope Gregory XVI made 40-year old Hughes coadjutor Bishop for the Diocese of New York, which then included all of New York State and northern New Jersey. He was consecrated in old St. Patrick’s Cathedral on 7 January 1838. Between 1820 and 1830, immigration had swelled the U.S. Catholic population to 600,000 with no end in sight. The new immigrants were mostly Irish: impoverished, uneducated and unskilled, with little to prepare them for New York’s urban environs. Hughes believed that the barrage of Nativist anti-Catholic prejudice at the time was demoralizing the already disadvantaged immigrants and holding back their progress.\n\nRecalling his own difficulties with a lack of education, he believed that the future of the Irish in America depended on secular education. At the time, the city’s schools were run by the Public School Society which received state funding. However, that society was a private Protestant group that taught that ‘emigration from Ireland of annually increasing numbers, extremely needy, and in many cases drunken and depraved, has become a subject for all our grave and fearful reflection.’ To get his flock educated, Hughes wanted an end to biased sectarian education. He contacted representative of New York’s Jewish community and allied with them to end all religious teaching in schools and through their efforts, the Maclay Bill of 1842 was enacted to bar all religious instruction from schools receiving state funds. On the night the bill was passed, a nativist mob attacked Hughes’s residence and members of the AOH were called to protect the city’s Catholic churches as they had done in 1841 and would do again in 1844.\n\nHaving reformed the public schools to help those non-protestant children who attended them, Hughes threw his energies into building a Catholic school system. ‘We have to build the schools first and the church after’ he said. In 1838 he felt that 100 acres bordering the Bronx River was the perfect spot for a new seminary and college and three years later, St. John’s College, the first Catholic institution of higher learning in the northeast, was established. On 10 April 1846, the State of New York granted the College a university charter and in 1907, after adding a law school and medical school, the name was changed to Fordham University.\n\nIn 1844, James Harper, was elected Mayor of New York supported by the anti-immigrant American Republican Party consisting mainly of Nativists. A highly organized group of anti-Catholic Protestant fundamentalists, they saw the Catholic Church as incompatible with democracy and believed the United States should be a land for Anglo-Saxon Protestants only. At the time, nativist riots in Philadelphia claimed the lives of 30 Irishmen and burned Catholic churches and convents. Bishop Hughes defending the rights of Irish Catholics against such bigotry and bloodshed, sent a letter to Mayor Harper warning that if any harm came to a single Catholic church, he would turn New York into another Moscow, referring to the burning of Moscow during Napoleon’s invasion in 1812. He then called on the AOH to defend the Cathedral. As a massive Nativist torchlight parade gathered in City Hall Park, ready to march up the Bowery to the Cathedral, he stationed the Hibernians on the protective walls around the Cathedral. The Nativists backed down and Hughes’ powerful message and forceful actions are credited with averting the same anti-Catholic violence in New York that had plagued Philadelphia. Hughes won the nickname of “Dagger John,” not only for the cross he penned beside his signature but also for being a man not to be trifled with!\n\nIn 1850, New York was elevated to the status of an Archdiocese by Pope Pius IX, so, too, was Hughes’ own status elevated to that of Archbishop. He continued a vigorous mission of building churches, schools, and hospitals. Future American President James Buchanan called him, ‘one of the ablest and most accomplished and energetic men I had ever known. In a far-seeing move that many ridiculed at the time as Hughes’ Folly, the Archbishop proposed the construction of a new Cathedral in an undeveloped area far uptown on Fifth Avenue between 50th and 51st streets. The property was purchased in 1810 for the sum of $11,000. Archbishop Hughes laid the cornerstone for the new Saint Patrick’s Cathedral on 15 August 1858.\n\nDuring the Civil War, Archbishop Hughes served as an envoy for President Lincoln on a successful overseas mission to dissuade European countries from supporting the Confederacy and in securing several officers of former Papal Army for the Union Army. In gratitude, Lincoln petitioned Pope Pius IX to name Archbishop Hughes as America’s first Cardinal. But the death took this indomitable leader in January 1864 before that honor could come to pass. His memory was honored by tributes from President Lincoln and other statesmen and his body viewed by over 200,000 people who solemnly came to worship in the old Cathedral where he was entombed in the crypts below. His body remained there until the new Cathedral was completed uptown and his remains were then removed to a crypt there in 1883. The new Cathedral holds the remains of all of the archbishops and cardinals that have served the Archdiocese since the death of Archbishop Hughes.\n\nA statue of Archbishop Hughes stands on Fordham campus and a bust on a pedestal was erected by AOH Div 9 NY and the Friendly Sons of St Patrick at the old Cathedral with 3 bronze plaques on the fence.\n\nMike McCormack, National Historian\n\nTHIS IRISH AMERICAN HERITAGE MONTH PROFILE IS PRESENTED BY THE ANCIENT ORDER OF HIBERNIANS (AOH.COM)\n\n#IrishAmericanHeritageMonth #EmbraceYourIrishHeritageAOH"}, {"url": "https://www.dib.ie/biography/hughes-john-joseph-a4146", "page_content": "Hughes, John Joseph (1797–1864), third resident catholic bishop and first archbishop of New York, was probably born 23 June 1797 (being baptised on 24 June) at Annaloghan, near Clogher, Co. Tyrone, third son among seven children of Patrick Hughes, farmer and weaver from Dernaved, and his wife Margaret (née McKenna). A parish and hedge school contemporary was the novelist William Carleton (qv) (whom Hughes later aided when visiting Dublin in 1862); Carleton's better work depicts their earlier shared background. After 1800 the family moved to a farmhouse in Dernaved townland, nearby in Co. Monaghan (since rebuilt at the Ulster American Folk Park). Unusually Hughes stayed in a chapel school there until 16 (or 17) to prepare for priesthood. A bad farming year then caused his withdrawal and training as a gardener (1814). Two of his siblings died around this time. His father went (1816) to Chambersburg, Pennsylvania, to prepare a life for the remaining family; John himself went out in 1817, and the rest followed in 1818. John worked as a labourer in Maryland, then as a gardener at St Joseph's school, Emmitsburg, which shared a campus with Mount St Mary's, a secondary school with a senior seminary stream. Its Parisian-born rector Fr John Dubois thwarted Hughes's desire to become a seminarian until St Joseph's superior, Mother (later St) Elizabeth Seton, stressed his merit. Dubois then hired him as overseer of his farm and slaves until he saw for himself the Tyrone man's capacities, and allowed him to enter the school by age 23. On 15 October 1826 Hughes was ordained for Philadelphia, a month before Fr Dubois was himself installed as bishop of New York.\n\nEarly career, 1826–38 Hughes had thus already observed the command of others and practised it as a foreman, a local controversialist, and a funds collector. Two cultured European priests, Dubois and Simon Bruté, formed him; two American converts, Mother Seton and Fr Samuel Cooper, influenced him. As a seminarian he was sponsored by Philadelphia's bishop, who liked him – the aged Ulster churchman Henry Conwell, sent there in 1820 when already 75. Hughes witnessed the bishop's loss of power to the fractious (and briefly schismatic) local lay trustees of St Mary's, the city's premier (and cathedral) church, to which Hughes was himself appointed pastor in spring 1827. There he decided that clear hierarchy was the way forward, and mobilised the ‘new’ Irish against the trustees. In 1830 Francis Kenrick (qv), a Dubliner educated in Rome and there ordained in April 1821, was put in with some control as coadjutor bishop to Conwell. Hughes's exact contemporary, they differed markedly. Hughes held that the morale of the poorer Irish required a forceful counter-attack on the anti-catholicism then spreading as a result of the convergence of new mass Irish immigration and America's evangelical revival. Both Dublin and Rome had shaped Kenrick's more irenic approach, which was not dissimilar to that religiously usual in Philadelphia's older catholic community. Hughes acted boldly on each front. He rejected the claim that substantial lay power in church matters was appropriate to the new nation's civic or ‘republican’ culture, and linked it to wider anti-catholic propaganda. Instead he shaped a relevant apologetics and a joint political argumentation. American religious and civil freedoms required that catholics sustain their position, not that they hide or negate it. Religious prejudice against them was both anti-American, and all too reminiscent of the position but recently endured in Ireland. But his own initially abusive polemics marred his case. As Dubois once disciplined him for bullying students when a prefect, Kenrick now rebuked his uncharity. Hughes learned to modify his methods as he matured his insights. Gradually he transformed the thrust of ‘Americanisation’ among many catholics to one that accommodated a robust group-assertion, rather than cultivated the pieties of otherness quietly, or adjusted more or less to socio-political secularity.\n\nCoadjutor and archbishop of New York, 1838–64 Leadership of catholic New York, the epicentre of catholic immigration, offered him a wider context. Hughes was consecrated coadjutor there on 7 January 1838, taking effective command when Dubois suffered a stroke within the month. Dubois had been consecrated at 62 for New York. Lay factions rode roughshod over him. Within ten years he was exhausted, and died on 20 December 1842. Hughes had right of immediate succession. In 1850 New York was made an archdiocese; on 3 October 1850 Hughes received the documents (issued 19 July) confirming this and appointing him archbishop. He was given the pallium personally by Pius IX on 3 April 1851.\n\nThus from February 1838 until his final incapacity (from Bright's disease) in autumn 1863, the Irish-born prelate effectively ruled the diocese and then archdiocese. Within state and nation, he sought to change ‘an apologetic people . . . into a militant people’ (R. J. Purcell, DAB, ix (v, pt 1), 353). Gradually he won acceptance of this by official (but not popular) America, perhaps because in his archdiocese he harmonised massive catholic growth with the city's secular expansion. While he could not provide fully for the huge increases of his people, he provided New York's model ecclesial and school structures for a century. He pioneered and focused its metropolitan character. Twice he cut his jurisdiction's extent, to one-eleventh its original size, carving off almost all upstate New York in 1847, and Long Island and northern New Jersey in 1853. Hughes opened twenty-three parishes during 1840–63 within the city, and a further thirty-seven in the lower Hudson valley outside it. Manhattan's population more than doubled to 805,358 by 1860, its Irish-born then 203,730. Despite such increase, practising catholics for each city parish grew only slightly (10 per cent) from 1840 to 1865, vindicating his new creations. About one-half of catholics practised in the city itself, partly as the provision of parochial schools for their offspring remained very inadequate, with only 5,000 children covered in 1840 and 12,000 in 1860.\n\nIn 1840 Hughes sought to overthrow the city's Public School Society (wholly protestant) and its curricula, and to gain New York state recognition and funding for parochial schools. The state then created a secular public school system for the city, run on district lines. Hughes thus triggered the emergence of exclusively secular public schools, and thereby turned many moderate protestants toward nativism, as express Christian education was driven from their schools of choice. Yet he failed to win the funding that could have held his own poor more fully to their church. In 1857 he said: ‘In our age, the question of education is the question of the church’ (Cohalan, 56). His delivery was thus plainly unequal to his vision. His strategy of exclusive and defensive concentration, however understandable, left many unprovided for, with results later modified only by the rising and more politic affluence of many catholics. Through informal ‘Tammany’ links his successor John McCloskey wisely gained catholic teachers in the new district schools educating most catholic children. Hughes did, however, create the formative free parochial school system in the city.\n\nHughes gradually squeezed lay trusteeism out of New York. Despite a Know-Nothing law to prop it up (1855), he won a state law guaranteeing episcopal title to church properties (1863). He often co-opted trustees onto replacement boards of management. He won informal approval for a catholic chaplaincy in the US military by 1847, and its expansion in 1861 through William Seward, a friend since 1840.\n\nGaining major funding for New York from various missionary societies in Europe, he convinced Rome that his archdiocese must be a chief priority of the missionary church. He relied on a seasoned inner circle of pre-1835 fellow immigrants active in business (with whom he set up the Emigrant Savings Bank) to fund major projects, including the start of St Patrick's cathedral. He introduced many religious orders, including the Redemptorists (1841), the Irish Sisters of Mercy (May 1846), the Jesuits (also 1846) (granting them control of the nascent Fordham), and the Christian [D. L. Salle] Brothers in two stages (1848, 1853). Oddly, he split Mother Seton's original order by his drive to control their local work; those accepting this (including his sister, Ellen) created a new order based in the city (1846), while – fearing further such pressures elsewhere – the original American Sisters of Charity affiliated to the French Daughters of Charity (St Vincent de Paul) in 1850. Hughes was no ‘devotionalist’ in the by-then-current French or Italian styles. Critics of most Irish clergy, such as George Templeton Strong and John Blake Dillon (qv), excepted him as a man of doctrine, clarity, and intelligence. In 1846 he introduced the choice of the Blessed Virgin as patroness of the US at the sixth provincial council in Baltimore. Though he disliked ‘national’ parishes, Hughes did accept German and French ones, though he distanced Italian claims. He also accepted the creation both of ‘select’ (fee-paying) schools, and of up-market parishes (St Ann's, St Francis Xavier). His view of an urban American church was thus realist and comprehensive. He was certainly no Irish-ghetto builder. To Bishop John England (qv), Hughes was an ‘emphatically self-made man’ (Shaw, Dagger John, 91). He advanced many American-born and convert catholics as vital to his church's future.\n\nHe famously faced off public authority when nativist riots impended in April 1844. But this obscures a deeper change. His early and continued counter-polemics with anti-catholic partisans (e.g., Controversy between Rev. Messrs Hughes and Breckenridge (1834); Kirwan unmasked (1848)) gave way to the realisation that in an emergent metropolis with a bare majority then catholic (if problematically so), the analogous problems had shifted to those posed by the attractions of secularity, the indifference of elites, and the irresolute commitment of many formal adherents. The Know-Nothings of 1854–5 did not worry him as much as had their 1840s forerunners. His later battles were with secular spokesmen who respected him, notably Horace Greeley of the New York Tribune, and James G. Bennett, editor of the New York Herald, both highly political men. All three sought rival definitions of a culture, variously to sustain, exclude, contain, or modify Hughes's insistence that American liberty accept the spiritual obediences of catholics as fully licit, and their culture as a public contribution to urban and national vitality and order. His disputes with immigrant Young Ireland and Confederation leaders of 1848 had similar roots (except in the breaches with Thomas D'Arcy McGee (qv), who was less sanguine about both America and its Irish than was Hughes). A supporter of Daniel O'Connell (qv), and very active in famine relief, Hughes showed initial sympathy for both 1848 goals and later the Fenians, unsurprisingly given the trend to an overlap of Defender and United Irish interests in his childhood townlands.\n\nPolitically, and unlike most Irish, Hughes disliked the Democrats (despite many Democratic associates) for their assertive secularity, regretted Irish captivity to them, and preferred the orderly Whigs. Like most Irish, he distrusted the anti-slavery enthusiasms of the new Republicans. Having tried a ‘catholic’ slate in 1841 during the schools battle, thereafter he held that catholics as such ought to be non-partisan. This precedent became a tradition and was upheld by most Irish American bishops and laity (notably in 1901).\n\nYet Hughes had not forgotten the youthful anti-slavery reactions of his own Maryland years. His reform patriotism was deepened by many trips to Europe (October 1839–February 1840, summer 1843, December 1845, December 1850–July 1851), on which he was scandalised by Old World inequities. The shock of southern secession elicited a mature loyalty to the US, made contentious in his city in that many of his people's editors and leaders were Democrats wishing a ‘moderate’ and short war and a negotiated peace. The Lincoln administration sent him to France and Rome on the union's behalf in late 1861. He stayed in Rome until summer 1862.The anti-draft riots of July 1863 shadowed his last year, but his standing curbed their divisive impact.\n\nIt is as flexible planner of a metropolitan catholicism in a culture of multiple freedoms that he is most admirable. He disciplined his ‘tough’ and combative sides to that task. A rural Irishman seasoned to a rural America, Hughes tamed an urban-ward flood. His opposition to mass westward colonisation by the Irish newcomers reflected his close experience of farming in both Ireland and America; he did not oppose migration by stages to the land. Through it all he sustained a quiet and exhausting charity into the decline of his later years (c.1858–63), which drove him to live with his sister's family and move in a very limited circle. He died 3 January 1864.\n\nPapers The papers of John Hughes are principally in the archdiocesan archives at St Joseph's, Dunwoodie, Yonkers, New York. The collections include the diaries of two of his secretaries, Fr James R. Bayley and Fr Thomas Preston, and photocopies and microfilms of many of his letters in other archives, starting with those first made by his would-be biographer Peter Guilday. As the American church was under the jurisdiction of Rome's Congregation of Propaganda Fide until 1908, key papers went through it; these are catalogued and calendared by Anton Debevec and Finbar Kenneally, United States documents in the Propaganda Fide archives: a calendar, 1st ser. (5 vols, Washington, DC, 1966–74). Copies of the relevant ones are now in the above archives. So too are copies of his correspondence with the Society for the Propagation of the Faith (Lyon and Paris, its papers housed at its archives in Lyon). Photocopies were sent to the relevant American dioceses (United States) from 1987 to 1992: see a summary list by diocese in Jean-Marie Jammes in Catholic Historical Review, lxxv (Apr. 1989), 264–7. Henry J. Browne, another would-be biographer, also amassed collections on Hughes and his times. His unpublished biography is in the archives at Columbia University in the H. J. Browne papers there. Various sermons, articles, and pamphlets of Hughes are in Lawrence Kehoe (ed.), Complete works of the Most Rev. John Hughes, D.D. (2 vols, 1865); it is very incomplete and there has never been a collected works. The counter-view was closely provided and documented by James Gordon Bennett in his New York Herald. There is no published full scholarly biography."}, {"url": "https://www.newadvent.org/cathen/07516a.htm", "page_content": "John Hughes\n\nPlease help support the mission of New Advent and get the full contents of this website as an instant download. Includes the Catholic Encyclopedia, Church Fathers, Summa, Bible and more \u0097 all for only $19.99...\n\nFourth bishop and first Archbishop of New York, born at Annaloghan, Co. Tyrone, Ireland, 24 June, 1797 of Patrick Hughes and Margaret McKenna: died in New York, 3 January, 1864. His father, a farmer of limited means, emigrated to the United States in 1816, and settled in Chambersberg, Pa. Johns's early education was received at Aligher, and later at Auchnacloy, near his native village. Though he felt called to the priesthood, circumstances did not permit him to continue his studies: being disinclined to farm life, he was placed with a friend of his father to study horticulture. He followed his father to America in 1817, landed at Baltimore, and soon after went to Chambersburg where he aided his family for a year or more. His ardent desire to become a priest brought him in 1819 to Mount St. Mary's College, Emmitsburg. Md., which he entered as an employee, being received a year later as a student. Ordained to the priesthood 15 October, 1826, by Bishop Conwell, in St. Joseph's Church, Philadelphia, he laboured first at St. Augustine's, Philadelphia, later at Bedford, Pa., finally returning to Philadelphia to become pastor of St. Joseph's, and afterwards of St. Mary's whose trustees were in open revolt against the bishop, and were subdued by Father Hughes only when he built St. John the Evangelist church, 1832, then considered one of the finest in the country. Previous to this, in 1829, he founded St. John's Orphan Asylum. About this period he was engaged in a religious controversy with Rev. John A. Brekenridge, a distinguished Presbyterian clergyman, with the result that Father Hughes's remarkable ability attracted widespread attention and admiration. His name was mentioned for the vacant see of Cincinnati and for the Coadjutorship of Philadelphia. On 7 Jan, 1838, however, Father Hughes was consecrated Bishop of Basileopolis and Coadjutor of New York, by Bishop Dubois, in St. Patrick's Cathedral, Mott Street, New York. In 1839 he became administrator-Apostolic of New York, and on the death of Bishop Dubois succeeded to the vacant see, 20 Dec. 1842. He was raised to the dignity of first Archbishop of New York, 19 July, 1850, receiving the pallium personally from Pius IX at Rome, 3 April 1851.\n\nThe abolition of trusteeism in New York marked the beginning of his episcopate. He confronted a critical diocesan condition arising from differences between Bishop Dubois and the lay trustees whose control of the church revenues was working injury to religion, and had encumbered the 10 churches then in the city with a debt of $300,000, a crushing burden in those days. Bishop Hughes's in Philadelphia with trusteeism served him well in taking up the defense of Bishop Dubois. He appealed directly to the people, before whom he forcefully defended the Divine authority to govern granted by Christ to the hierarchy, and clearly exposed the viciousness of lay domination in administration of church matters. The people readily passed a resolution condemning the cathedral trustees who gave way to a new board well disposed to obey ecclesiastical authority. The bishop convoked in 1841 the first Diocesan Synod of New York, which enacted timely legislation affecting spiritual matters, and advised for tenure and administration of church property wise regulations which placed the rector of the church in control of temporals as well as spirituals. His triumph over the trustee System would have been complete and final at the very outset had the trustees of St. Louis's church, Buffalo, been as prompt to submit as all others. Their attitude brought the archbishop, as late as 1855, into a controversy with Erasmus Brooks, editor and state senator, who assailed in the Legislature the archbishop's plan of holding church property. Unfavorable legislation followed, but was soon repealed, and prepared the way for the present satisfactory religious corporation law of the State of New York\n\nReturning from Europe, whither he had gone in 1839 to seek aid for his diocese, Bishop Hughes found his flock involved in a movement to modify the existing common school system, which, professing to be non-sectarian, was undermining, in fact, the religious beliefs of Catholic children. The bishop immediately placed himself at the head of the movement, and deemed it incumbent on him to oppose the Public School Society, a private corporation controlling the management of schools and the distribution of the school fund provided by the municipality. He based his objection to this society on the ground that it violated a fundamental American principle, namely freedom of conscience. Catholics could not accept any system of education which ignored, undermined, or opposed the religious faith their conscience dictated to be true. After two years' unceasing contest, he finally brought about the overthrow of the Public School Society. He had hoped, and Governor Seward was kindly disposed, that the Legislature might be so truly American as to sanction and support Catholic schools. Religious animosity proved too bitter. The bishop's hopes were not realized. The establishment of the present public school system followed, which likewise, failing to satisfy Catholic conscience, led the bishop to lay the foundation, on a firm basis, of the existing Catholic school system in New York. An anti-Catholic outbreak of the \"Native American\" political party occurred in 1844, in Philadelphia, where churches and convents were destroyed. A meeting of this party was announced to take place in New York City. Apprehensive that the result would be riot and bloodshed, the bishop called personally on the mayor of the city to prevent the meeting. Warning him of the consequences if any anti-Catholic outrage were attempted. He at the same time solemnly cautioned his flock against violence, but took measures to resist any attack against church property. His fearless determined attitude prevented the holding of the meeting and averted disturbance of the peace. Ten years later the \"Know-nothing\" faction became active. He again advised his people to keep aloof from the centres of trouble. He was deeply convinced that all such movements, being as anti-American as they were anti-Catholic, could not possible thrive in the United States.\n\nFew public men of his day possessed a more statesmanlike grasp of the genius of the American Republic. He had unbounded confidence in its institutions, when their very existence was precarious. He looked upon America as a land of promise opened by a beneficent Providence to the oppressed of the nations. No one would question his own abiding love of his native soil; but he would not permit this love to make him lament as an exile of Erin when he might rejoice as an American citizen. Thus he taught his people. So far-seeing was he in this respect that he looked with disfavor upon national churches, lest they might perpetrate racial differences and foreign customs. All must be formed into a common people; and no influence could do this better for the American people, he contended, than the Catholic Church sent by Christ to teach all nations. Archbishop Hughes will ever rank among America's foremost citizens. His towering character, genius for government, and intense patriotism won for him the respect and often the admiration of his opponents, the esteem and even the lifelong friendship of distinguished statesmen. President Polk, through Secretary Buchanan, in 1846, proffered him a diplomatic mission to Mexico, which he was unable to accept. On invitation of John Quincy Adams, Stephen A. Douglas, and John C. Calhoun, he lectured before Congress in the Capitol, Washington, his topic being \"Christianity, the Only Source of Moral Social and Political Regeneration\". At the outbreak of the Civil War, although not an abolitionist, he boldly sustained the Union cause, and was in frequent communication with William H. Seward, Secretary of State, to whom he offered useful suggestions on the conduct of the war. President Lincoln, in an autograph letter, expressed his appreciation of the counsel given. Secretary Seward, desiring to hold France in a friendly attitude towards the Federal Government, entrusted the archbishop with an important mission to the court of Napoleon III, who received him most graciously, and was dissuaded by him from recognizing the Confederacy. On this visit to Europe, wherever he went, he left nothing undone to create sympathy for the Union side. During the Draft Riots of 1863 in New York City, Governor Seymour invoked the aid of the archbishop to suppress disorder, to which invitation, though he was fatally broken in health, he willingly responded, addressing a large assemblage from the balcony of his residence.\n\nHis loyalty to his adopted country was well balanced and finely adjusted to the duties and responsibilities of his sacred office. He exercised the strictest vigilance lest American liberty might engender liberal influence tending to minimize the doctrine and discipline of the Catholic Church. He unsparingly condemned those who, through fear of anti-Catholic feeling, were disposed to conciliate their opponents by seemingly harmless concessions. He was intolerant of the slightest modification or innovation in religion unless sanctioned by the Supreme Head of the Church. He believed that the adherence to Catholic faith should be bold, fearless, outspoken and uncompromising in the extreme, and especially so in the face of opposition. Pius IX, exiled in 1848, and again threatened in 1860, found the archbishop one of his staunchest defenders of the Holy See. Strong agencies of power and influence were conspiring against the temporal sovereignty of the pope, and this condition intimidated not a few Catholics into a policy of silent and ineffective sympathy; others somewhat less timid favored action, but of a conservative character. The archbishop approved of no such methods, and boldly proclaimed himself an uncompromising supporter of the Vicar of Christ and his lawful patrimony. By appeal, sermon, lecture, and pastoral letter he aroused his flock at home to unbounded enthusiasm, and stirred Christendom abroad in a masterly vindication of the temporal independence of the sovereign pontiff. He raised in 1860 the princely sum of $53,000, as an offering from his diocese to the Holy Father; and his pastoral letter, circulated throughout Europe and translated in Italian, afforded solace to the afflicted soul of Pius IX.\n\nConjointly with all this prominence and activity demanded by public and vital interests of Church and nation, the archbishop followed faithfully and zealously the exacting life of a hardworking missionary bishop in the upbuilding of a rapidly growing diocese. In 1842 there were some forty priests, fifty churches and 200,000 Catholics scattered over his jurisdiction, which embraced the State of New York and eastern part of New Jersey. Bishop McClosky, later the first bishop of Albany, was Coadjutor of New York from 1844 to 1847. Albany and Buffalo were erected into episcopal sees in 1847; Brooklyn and Newark in 1853. Besides these four separate dioceses made up within the original territory of the diocese of New York, the archbishop before his death in 1864 ruled 150 priests, 85 churches, 3 colleges, 50 schools and academies and over 400,000 people. He stated in 1858 that he had dedicated his 99th church. As metropolitan, created in 1850, he presided over New York, New Jersey and all New England, with suffragan sees at Albany, Buffalo, Brooklyn, Newark, Boston, Burlington, Hartford and Portland. The First Provincial Council of New York was convened in September, 1854, after which the archbishop journeyed to Rome and he was present at the proclamation of the dogma of the Immaculate Conception.\n\nDuring his administration institutions of charity and higher learning grew apace with churches and schools. The seminary was moved in 1840 from Largerville to Fordham, where a college was opened a year later. The Jesuits assumed charge of it in 1846, but in 1855 the archbishop withdrew the seminary from Fordham, and in 1862 secured property at Troy, New York, for the establishment of St. Joseph's Provincial Seminary. He also proved to be one of the warmest supporters of the North American College, Rome, projected by Pius IX in 1855, and successfully opened in 1859. To meet diocesan needs he introduced into New York the Christian Brothers, the Religious of the Sacred Heart, the Sisters of Mercy, the Ursulines, the Sisters of Notre Dame, and the Sisters of the Good Shepherd. Finding the Sisters of Charity of Emmitsburg, Maryland, who were labouring in New York, restricted by their rule to a limited field and refrained from undertaking certain good works which the archbishop desired, he organized an independent diocesan community of Sisters of Charity, who today, are managing a variety of educational, charitable, protective and industrial institutions, and form one of the most flourishing and successful sisterhoods in the United States. Foreseeing the future greatness of his diocese and cathedral city, he planned the erection of a cathedral which would be commensurate with the importance of the city and See of New York, and would express in enduring stone the faith of his flock. He laid the cornerstone of St. Patrick's Cathedral, Fifth Avenue, 15 August 1858; this lofty and inspiring pile stands as a monument to his genius and prevision.\n\nHe lived and passed away amid stirring times; it was providential for church and country that he lived when he did. His natural gifts of mind and heart, independent of his education, were of a high order and made him pre-eminent in leadership; not only was he a great ruler of an important diocese in a hierarchy remarkable for distinguished bishops, but also a master-builder of the Church in the United States and one of the most helpful and sagacious of the makers of America. Church and nation are indebted forever to the prelate and citizen whose strong personality, and indomitable courage and invaluable service constituted him the man needed in his day to meet critical conditions. He was resolute, fearless, far-sighted and full of practical wisdom based on the sanest and soundest principles. To bring out the innate powers within him required but the opportunity presented by the Church struggling for a footing in a rather hostile community, and by the nation endeavoring to cope with harassing questions at home and impending trouble abroad. His failures were few; his achievements many and lasting. He was feared and loved; misunderstood and idolized; misrepresented even to his ecclesiastical superiors in Rome, whose confidence in him, however, remained unshaken. Severe of manner, kindly of heart, he was not aggressive until assailed.\n\nHe was a forceful, impressive and convincing speaker; an able, resourceful and talented controversialist, a clear, logical and direct writer. His writing were usually hastily done, as occasion required, but commanded general attention from friend and opponent His works are published in two volumes, which contain lectures, sermons, and pamphlets on historical and doctrinal subjects; open letters to men like Horace Greeley, General Cass, Mayor Harper, Senator Brooks and \"Kirwin Unmasked\", a series of six letters to a Presbyterian minister, writing under the assumed name of Kirwin; these letters are considered models of good English and are among the best written by the archbishop. His mortal remains were interred in the old St. Patrick's but were transferred 30 January, 1883 to their final resting place under the sanctuary of the cathedral in Fifth Avenue. His death elicited a general expression of sympathy and respect, and his memory was honored by tributes from President Lincoln and Secretary Seward, Governor Seymour and the Common Council of New York.\n\nSources HASSARD, Life of Most Rev. John Hughes (New York 1866):BRANN, Most Rev. John Hughes (New York 1892); KEHOE, Works of the Most Rev. John Hughes D.D. (2 vols. New York, 1864); CLARKE, Lives of the Deceased Bishops (New York 1888); FARLEY, History of St. Patrick's Cathedral (New York 1908); SMITH, History of the Catholic Church in New York, I (New York 1905); SHEA, History of the Catholic Church in the United States (New York 1892); U.S. Catholic Hist. Soc., Hist Records and Studies, CORRIGAN, II, 227, MEEHAN, I, 171, THEBAUD, III, 282; BROWNSON, Works (Detroit, 1887), XIV, 485, XVII, 197, XX, 50; MAURY, Statesmen in America in 1846 (London 1847); Autobiography of Thurlow Weed (Boston, 1883); BAKER, Works of William H. Seward, III (New York 1853), 482."}, {"url": "https://www.catholic.com/encyclopedia/john-hughes", "page_content": "Returning from Europe , whither he had gone in 1839 to seek aid for his diocese, Bishop Hughes found his flock involved in a movement to modify the existing common school system, which, professing to be non-sectarian, was undermining, in fact, the religious belief of Catholic children. The bishop immediately placed himself at the head of the movement, and deemed it incumbent on him to oppose the Public School Society , a private corporation controlling the management of the schools and the distribution of the school fund provided by the municipality. He based his objection to this society on the ground that it violated a fundamental American principle, namely, freedom of conscience. Catholics could not accept any system of education which ignored, undermined, or opposed the religious faith their conscience dictated to be true. After a two years’ unceasing contest, he finally brought about the overthrow of the Public School Society . He had hoped, and Governor Seward was kindly disposed, that the Legislature might be so truly American as to sanction and support separate Catholic schools. Religious animosity proved too bitter. The bishop’s hopes were not realized. The establishment of the present public schools followed, which, likewise failing to satisfy Catholic conscience, led the bishop to lay the foundation, on a firm basis, of the existing Catholic school system in New York . An anti- Catholic outbreak of the “Native American” political party occurred in 1844, in Philadelphia , where churches and convents were destroyed. A meeting of this party was announced to take place in New York City. Apprehensive that the result would be riot and bloodshed, the bishop called personally on the mayor of the city to prevent the meeting, warning him of the consequences if any anti- Catholic outrage were attempted. He at the same time solemnly cautioned his flock against violence, but took measures to resist any possible attacks against church property. His fearless and determined attitude prevented the holding of the meeting and averted disturbance of the peace. Ten years later the “Know-nothing” faction became active. He again advised his people to keep aloof from centers of trouble. He was deeply convinced that all such movements, being as anti-American as they were anti- Catholic , could not possibly thrive in the United States.\n\nThe abolition of trusteeism in New York marked the beginning of his episcopate. He confronted a critical diocesan condition arising from differences between Bishop Dubois (q.v.) and the lay trustees whose control of church revenues was working injury to religion, and had encumbered the ten churches then in the city with a debt of $300,000, a crushing burden in those days. Bishop Hughes’s experience in Philadelphia with trusteeism served him well in taking up the defense of Bishop Dubois. He appealed directly to the people, before whom he forcefully defended the Divine authority to govern granted by Christ to the hierarchy, and clearly exposed the viciousness of lay domination in the administration of church matters. The people readily passed a resolution condemning the cathedral trustees who gave way to a new board well disposed to obey ecclesiastical authority. The bishop convoked in 1841 the first Diocesan Synod of New York , which enacted timely legislation affecting spiritual matters, and devised for the tenure and administration of church property wise regulations which placed the rector of the church in control of temporals as well as spirituals. His triumph over the trustee system would have been complete and final at the very outset had the trustees of St. Louis’s church, Buffalo, been as prompt to submit as all others. Their attitude brought the archbishop, as late as 1855, into a controversy with Erastus Brooks, editor and state senator, who assailed in the Legislature the archbishop’s plan of holding church property. Unfavorable legislation followed, but was soon repealed, and prepared the way for the present satisfactory religious corporation law of the State of New York .\n\nHughes, JOHN, fourth Bishop and first Archbishop of New York , b. at Annaloghan, Co. Tyrone, Ireland , June 24, 1797, of Patrick Hughes and Margaret McKenna; d. in New York , January 3, 1864. His father, a farmer of limited means, immigrated to the United States in 1816, and settled at Chambersburg, Pa. John’s early education was received at a school in Augher, and later in Auchnacloy, near his native village. Though he felt called to the priesthood, circumstances did not permit him to continue his studies; being disinclined to farm life, he was placed with a friend of his father to study horticulture. He followed his father to America in 1817, landed at Baltimore, and soon after went to Chambersburg, where he aided his family for a year or more. His ardent desire to become a priest brought him in 1819 to Mount St. Mary’s College , Emmitsburg, Md—which he entered as an employee, being received a year later as a student. Ordained to the priesthood October 15, 1826, by Bishop Conwell, in St. Joseph ‘s Church , Philadelphia , he labored first at St. Augustine’s, Philadelphia , later at Bedford, Pa—finally returning to Philadelphia to become pastor of St. Joseph ‘s, and afterwards of St. Mary’s, whose trustees were in open revolt against the bishop, and were subdued by Father Hughes only when he built St. Joseph ‘s church, 1832, then considered one of the finest in the country. Previous to this, in 1829, he founded St. John’s Orphan Asylum. About this period he was engaged in a religious controversy with Rev. John A. Breckenridge, a distinguished Presbyterian clergyman, with the result that Father Hughes’s remarkable ability attracted widespread attention and admiration. His name was mentioned for the vacant See of Cincinnati and for the Coadjutorship of Philadelphia . On January 7, 1838, however, Father Hughes was consecrated Bishop of Basileopolis and Coadjutor of New York , by Bishop Dubois, in St. Patrick’s Cathedral , Mott Street, New York . In 1839 he became administrator Apostolic of New York , and on the death of Bishop Dubois succeeded to the vacant see, December 20, 1842. He was raised to the dignity of first Archbishop of New York , July 19, 1850, receiving the pallium personally from Pius IX at Rome , April 3, 1851.\n\nFew public men of his day possessed a more statesmanlike grasp of the genius of the American Republic. He had unbounded confidence in its institutions, when their very existence was precarious. He looked upon America as a land of promise opened by a beneficent Providence to the oppressed of the nations. No one could question his own abiding love of his native soil; but he would not permit this love to make him lament as an exile of Erin when he might rejoice as an American citizen. Thus he taught his people. So far-seeing was he in this respect that he looked with disfavor on national churches, lest they might perpetuate racial differences and foreign customs. All must be formed into a common people; and no influence could do this better for the American people, he contended, than the Catholic Church sent by Christ to teach all nations. Archbishop Hughes will ever rank among America‘s foremost citizens. His towering character, genius for government, and intense patriotism won for him the respect and often the admiration of his opponents, the esteem and even the life-long friendship of distinguished statesmen. President Polk, through Secretary Buchanan, in 1846, proffered him a diplomatic mission to Mexico, which he was unable to accept. On invitation of John Quincy Adams, Stephen A. Douglas, and John C. Calhoun, he lectured in 1847 before Congress in the Capitol, Washington, his topic being “Christianity the only Source of Moral, Social, and Political Regeneration“. At the outbreak of the Civil War, although not an abolitionist, he boldly sustained the Union cause, and was in frequent communication with William H. Seward, Secretary of State, to whom he offered useful suggestions on the conduct of the war. President Lincoln, in an auto-graph letter, expressed his appreciation of the counsel given. Secretary Seward, desiring to hold France in a friendly attitude towards the Federal Government, entrusted the archbishop with an important mission to the Court of Napoleon III, who received him most graciously, and was dissuaded by him from recognizing the Confederacy. On this visit to Europe, wherever he went, he left nothing undone to create sympathy for the Union side. During the Draft Riots of 1863 in New York City, Governor Seymour invoked the aid of the archbishop to suppress disorder, to which invitation, though he was fatally broken in health, he willingly responded, addressing a large assemblage from the balcony of his residence.\n\nHis loyalty to his adopted country was well balanced and finely adjusted to the duties and responsibilities of his sacred office. He exercised the strictest vigilance lest American liberty might engender liberal influences tending to minimize the doctrine and discipline of the Catholic Church. He unsparingly condemned those who, through fear of anti-Catholic feeling, were disposed to conciliate their opponents by seemingly harm-less concessions. He was intolerant of the slightest modification or innovation in religion unless sanctioned by the Supreme Head of the Church. He believed that adherence to Catholic faith should be bold, fearless, out-spoken, and uncompromising in the extreme, and especially so in the face of opposition. Pius IX, exiled in 1848, and again threatened in 1860, found the archbishop one of the stanchest defenders of the Holy See. Strong agencies of power and influence were conspiring against the temporal sovereignty of the pope, and this alarming condition intimidated not a few Catholics into a policy of silent and ineffective sympathy; others somewhat less timid favored action, but of a conservative character. The archbishop approved of no such methods, and boldly proclaimed himself an uncompromising supporter of the Vicar of Christ and his lawful patrimony. By appeal, sermon, lecture, and pastoral letter he aroused his flock at home to unbounded enthusiasm, and stirred Christendom abroad in a masterly vindication of the temporal independence of the sovereign pontiff. He raised in 1860 the princely sum of $53,000, as an offering from his diocese to the Holy Father; and his pastoral letter, circulated throughout Europe and translated into Italian, afforded solace to the afflicted soul of Pius IX.\n\nConjointly with all this prominence and activity demanded by public and vital interests of Church and nation, the archbishop followed faithfully and zealously the exacting life of a hardworking missionary bishop in the upbuilding of a rapidly growing diocese. In 1842 there were some forty priests, fifty churches, and 200,000 Catholics scattered over his jurisdiction, which embraced the State of New York and the eastern part of New Jersey. Bishop McCloskey, later the first Bishop of Albany, was Coadjutor of New York from 1844 to 1847. Albany and Buffalo were erected into episcopal sees in 1847; Brooklyn and Newark in 1853. Besides these four separate dioceses made within the original territory of the Diocese of New York, the archbishop before his death in 1864 ruled 150 priests, 85 churches, 3 colleges, 50 schools and academies, and over 400,000 people. He stated in 1858 that he had dedicated his ninety-ninth church. As metropolitan, created in 1850, he presided over New York, New Jersey, and all New England, with suffragan sees at Albany, Buffalo, Brooklyn, Newark, Boston, Burlington, Hartford, and Portland. The First Provincial Council of New York was convened in September, 1854, after which the archbishop journeyed to Rome and he was present at the proclamation of the dogma of the Immaculate Conception.\n\nDuring his administration institutions of charity and higher learning grew apace with churches and schools. The seminary was moved in 1840 from Lafargeville to Fordham, where a college also was opened a year later. The Jesuits assumed charge of it in 1846, but in 1855 the archbishop withdrew the seminary from Fordham, and in 1862 secured property at Troy, New York, for the establishment of St. Joseph‘s Provincial Seminary. He also proved to be one of the warmest supporters of the North American College, Rome, projected by Pius IX in 1855, and successfully opened in 1859. To meet diocesan needs he introduced into New York the Christian Brothers, the Religious of the Sacred Heart, the Sisters of Mercy, the Ursulines, the Sisters of Notre Dame, and the Sisters of the Good Shepherd. Finding the Sisters of Charity of Emmitsburg, Maryland, who were laboring in New York, restricted by their rule to a limited field and restrained from undertaking certain good works which the archbishop desired, he organized an independent diocesan community of the Sisters of Charity, who, today, are managing a variety of educational, charitable, protective, and industrial institutions, and form one of the most flourishing and successful sisterhoods in the United States. Foreseeing the future greatness of his diocese and cathedral city, he planned the erection of a cathedral which would be commensurate with the importance of the city and See of New York, and would express in enduring stone the faith of his flock. He laid the cornerstone of St. Patrick’s Cathedral, Fifth Avenue, August 15, 1858; this lofty and inspiring pile stands a monument to his genius and prevision.\n\nHe lived and passed away amid stirring times; it was providential for Church and country that he lived when he did. His natural gifts of mind and heart, independent of his education, were of a high order and made him pre-eminent in leadership; not only was he a great ruler of an important diocese in a hierarchy remarkable for distinguished bishops, but also a master-builder of the Church in the United States and one of the most helpful and sagacious of the makers of America. Church and nation are indebted forever to the prelate and citizen whose strong personality, indomitable courage, and invaluable service constituted him the man needed in his day to meet critical conditions. He was resolute, fearless, far-sighted, and full of practical wisdom based on the sanest and soundest principles. To bring out the innate power within him required but the opportunity presented by the Church struggling for a footing in a rather hostile community, and by the nation endeavoring to cope with harassing questions at home and impending trouble abroad. His failures were few; his achievements many and lasting. He was feared and loved; misunderstood and idolized; misrepresented even to his ecclesiastical superiors in Rome, whose confidence in him, however, remained unshaken. Severe of manner, kindly of heart, he was not aggressive until assailed.\n\nHe was a forceful, impressive, and convincing speaker, an able, resourceful, and talented controversialist, a clear, logical, and direct writer. His writings were usually hastily done, as occasion required, but commanded general attention from friend and opponent. His works are published in two volumes, which contain lectures, sermons, and pamphlets on historical and doctrinal subjects; open letters to public men like Horace Greeley, General Cass, Mayor Harper, Senator Brooks; and “Kirwan Unmasked”, a series of six letters to a Presbyterian minister, writing under the assumed name of Kirwan; these letters are considered models of good English and are among the best written by the archbishop. His mortal remains were interred in old St. Patrick’s, but were transferred, January 30, 1883, to their final resting-place under the sanctuary of the cathedral in Fifth Avenue. His death elicited a general expression of sympathy and respect, and his memory was honored by tributes from President Lincoln, Secretary Seward, Governor Seymour, and the Common Council of New York.\n\nP. J. HAYES"}, {"url": "https://www.infoplease.com/encyclopedia/people/religion-phil/catholic-orthodox/hughes-john-joseph", "page_content": "See his works (ed. by L. Kehoe, 1864); biographies by J. R. G. Hassard (1866, repr. 1969) and J. Loughery (2018); study by V. P. Lannie (1968).\n\n1797–1864, American Roman Catholic churchman, b. Co. Tyrone, Ireland. He joined his family in the United States in 1817 and on graduating from Mt. St. Mary's College, Emmitsburg, Md., was ordained (1826). He served mostly in Philadelphia until 1838, when he was consecrated bishop and became coadjutor to Bishop John Dubois in New York. In 1842, Hughes was made bishop, and in 1850 the first archbishop of New York. He obtained for the church complete control of its property by the clergy. A resolute and ardent defender of Catholicism, he engaged in debates, worked actively in behalf of Irish immigrants, and strongly urged the obliteration of European national affiliations in American Catholicism. His vigorous but unsuccessful attempt to secure state support for religious schools carried him into politics and led to the establishment of the independent Catholic school system. In the Civil War, Abraham Lincoln sent him to France to promote a friendly attitude toward the Union cause. He founded (1841) St. John's College (now Fordham Univ.) and laid (1858) the cornerstone of St. Patrick's Cathedral, New York City.\n\nThe Columbia Electronic Encyclopedia, 6th ed. Copyright © 2023, Columbia University Press. All rights reserved.\n\nSee more Encyclopedia articles on: Roman Catholic and Orthodox churches: General Biographies"}, {"url": "https://www.irishtimes.com/opinion/from-tyrone-to-new-york-an-irishman-s-diary-about-archbishop-john-joseph-hughes-1.3124029", "page_content": "Born in Tyrone to a poor farming family on June 24th, 1797, John Joseph Hughes grew up to become the leading cleric of his day in the United States. The third son of seven children, Hughes began his life in the townland of Annaloughan near Augher.\n\nA hedge school contemporary was the novelist William Carleton, whose later works depict their early shared childhood. Hughes’s family suffered religious persecution, and his late sister was denied a Catholic burial conducted by a priest.\n\nAll of this played on his youthful mind, and in 1817, a year after his father had left for a new life in America, he emigrated there at the age of 20, working as a gardener in Mount St Mary’s seminary in Emmitsburg, Maryland.\n\nIn 1826 Hughes was ordained to the priesthood, serving as curate at St Augustine's Church in Philadelphia, where he founded the Catholic Herald newspaper. Twelve years later he arrived in New York and was appointed administrator of the diocese before being consecrated bishop in the old cathedral of St Patrick's in 1842. When New York was made an archdiocese in 1850, he became archbishop.\n\nREAD MORE\n\nA pugnacious orator, Hughes was a crusader against bigotry and slavery. During the third decade of the 19th century, the Catholic immigrant population had increased by 60 per cent to 600,000. Many were impoverished and ill-educated, and Hughes was determined they should not be treated as second-class citizens.\n\nHe was, he said, an American by choice, not by chance.\n\nThroughout his busy life he was involved in numerous projects. On his 44th birthday in 1841, he founded St John’s College (now Fordham University), the first Catholic institution of higher education in the northeastern US. Partly because of a lack of funds, he described it as a “daring and dangerous undertaking” but it thrived. Within a few years it became a Jesuit institution and in 2016 celebrated its dodransbicentennial (175th anniversary).\n\nTo this day, the founder’s illustrious memory lives on in Hughes Hall at Fordham’s business school, and in a Hughes statue at Rose Hill campus in the Bronx, where students can meet at Dagger John’s Pub. The pub’s name comes from a moniker applied to Hughes, who became known as “Dagger John”. This was derived from the fact that his episcopal signature was followed by the mark of a Christian cross in the appearance of a dagger; other theories suggest it was also because of his reputation for being short-tempered.\n\nIn between his work in America, Hughes found time to return to his native Ireland. He preached at St Macartan’s Church near his homeland of Augher in January 1846, six months before the building was dedicated. More than anything, he is best known for his work in founding St Patrick’s Cathedral in New York. On August 15th, 1858, he laid the cornerstone of the new uptown cathedral on Fifth Avenue before a crowd of 100,000. In those days, this was still a rural part of Manhattan and due to its remote location, the building was dubbed the “Hughes folly” by the press.\n\nDespite the put-downs that he experienced in his lifetime, his legacy lives on and he has been immortalized in a bronze bust and a blue plaque. In 2015, a bust of “Dagger John”, sculpted by Rowan Gillespie, was dedicated and blessed by Cardinal Timothy Dolan of New York.\n\nIt was produced as part of the Irish Giants series and stands on top of a four-metre column in Lower Manhattan near the old cathedral. Aside from his name and dates, it simply states: “Immigrant”.\n\nThree thousand miles across the Atlantic, Hughes’s name is held in esteem. And in his native country, the Ulster History Circle, which erects blue plaques to men and women of achievement, has honoured him at St Macartan’s. Amongst the dignitaries at the event was the Archbishop of Armagh and Primate of All Ireland, Eamon Martin, who unveiled the plaque outside the church set amidst the rolling Clogher Valley countryside looking across to the Monaghan drumlins.\n\nHughes died at 66 from Bright’s disease on January 3rd, 1864. His remains were initially interred in the old cathedral, but 19 years later they were transferred to their final resting place under the altar of the new cathedral on Fifth Avenue, which he never lived to see completed. His death brought many expressions of sympathy and a tribute from President Abraham Lincoln, for whom he had served as special envoy to Europe.\n\nPeople from across south Ulster reflect with pride on his achievements and of how a rural boy from humble beginnings rose to such dizzy ecclesiastical heights. Not only was he instrumental in founding St Patrick’s Cathedral, he also became one of the most influential men of his time and won the respect of many."}, {"url": "https://encyclopedia2.thefreedictionary.com/Hughes%2c+John+Joseph", "page_content": "Hughes, John Joseph\n\nHughes, John Joseph, 1797–1864, American Roman Catholic churchman, b. Co. Tyrone, Ireland. He joined his family in the United States in 1817 and on graduating from Mt. St. Mary's College, Emmitsburg, Md., was ordained (1826). He served mostly in Philadelphia until 1838, when he was consecrated bishop and became coadjutor to Bishop John Dubois in New York. In 1842, Hughes was made bishop, and in 1850 the first archbishop of New York. He obtained for the church complete control of its property by the clergy. A resolute and ardent defender of Catholicism, he engaged in debates, worked actively in behalf of Irish immigrants, and strongly urged the obliteration of European national affiliations in American Catholicism. His vigorous but unsuccessful attempt to secure state support for religious schools carried him into politics and led to the establishment of the independent Catholic school system. In the Civil War, Abraham Lincoln sent him to France to promote a friendly attitude toward the Union cause. He founded (1841) St. John's College (now Fordham Univ.) and laid (1858) the cornerstone of St. Patrick's Cathedral, New York City.\n\nBibliography\n\nSee his works (ed. by L. Kehoe, 1864); biographies by J. R. G. Hassard (1866, repr. 1969) and J. Loughery (2018); study by V. P. Lannie (1968).\n\nThe Columbia Electronic Encyclopedia™ Copyright © 2022, Columbia University Press. Licensed from Columbia University Press. All rights reserved."}]}