{"Millicent Shelton worked as an assistant director.": [{"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.awardsdaily.com/2022/09/12/end-of-the-road-director-millicent-shelton-on-working-with-queen-latifah-and-the-importance-of-inclusion-in-storytelling/", "page_content": "Millicent Shelton started her career as a wardrobe production assistant on Spike Lee’s 1989 classic Do the Right Thing. That opportunity served as a springboard to a directing career of her own across music videos, television, and film. Her direction of the 30 Rock episode “Apollo, Apollo” would make her the first Black woman to receive an Emmy nomination for Outstanding Directing for a Comedy Series.\n\nWith Netflix’s End of the Road (currently streaming), Shelton again works with star and producer Queen Latifah. In the film, Latifah plays Brenda, a recently widowed mother who loses her home in Los Angeles. After deciding to move home to Houston, Brenda travels across the Southwest with her brother (Ludacris) and two children (Mychala Lee, Shaun Dixon). On the journey, they run afoul of a major crime boss thanks to a bag of money that holds the potential to change their lives. The film asks viewers to experience the world through the eyes of this troubled Black family as they hold together in the face of traumatic danger.\n\nHere, in an interview with Awards Daily, Millicent Shelton talks about what drew her to the project and what it’s like to work with Queen Latifah both in front of and behind the camera. She talks about the film’s vivid color palate and the joyous luck in finding four actors who held so much natural chemistry together. Finally, she talks about the importance of inclusivity and the recent conversation around two major television series — HBO’s House of the Dragon and Amazon Studio’s The Lord of the Rings: The Rings of Power — who cast Black actors in major roles within the series.\n\nAwards Daily: I’d like to start with recent controversies related to specific audiences rejecting inclusive efforts on such major projects as Rings of Power and House of the Dragon. How do you as a filmmaker react to that in a modern filmmaking environment? Does it make you even more determined to pursue inclusive projects?\n\nMillicent Shelton: It does. I tend to be a little bit of a rebel. I like to push against what people perceive as the norm. So the perception we have had in television and cinematically has been very Caucasian. Not only are white Americans used to that, but so are Black Americans or Asian Americans or Latino Americans. That’s how a lot of body dysmorphia happens to Black girls and Latino girls and Asian girls. They don’t see people like them represented as images of beauty. There’s a movement now to change that.\n\nI honestly think that’s what our country fought for — to have representation and freedom. If we’re going to truly embrace what we say this country is about which is about embracing diversity and about the melting pot, then we should embrace that in front of and behind the camera as well. I honestly believe that we are stronger when we are like that. To me, diversity is not making an all Black film, not that I’m against that. I think diversity is a mix of everybody, and it’s not just different colors. It’s also different religions. It’s different sexual preferences. It’s diversity of all, and that’s what makes us as a country stronger because we get to experience a lot of different people’s perspectives. I think that our creativity is better that way.\n\nIn this film, we had a mix of everyone in all key positions. We really functioned that way. I like to say that we were a crew that went through a lot of strenuous situations. We survived it as a team, and we survived it as a family. We were a very diverse family, but we survived it as a family.\n\nAD: So you have a Brazilian production designer and an Asian American cinematographer. The film has a very international visual flair. The roadside motel, in particular, doesn’t look like any I’ve ever seen. In fact, the entire color palate for the film is incredibly vibrant and bursting with deep, vivid colors.\n\nMS: [The motel room] is my Brazilian production designer. It’s interesting because we kept looking for motel rooms, and we could not find them. They’re all too little. So we decided to build it, but we had seen a reference for this one in a motel that doesn’t exist anymore. It had cherubs on the wall, and that was it — Lucio’s [Seixas, production designer] brain started to go. Our whole vision for this film was exaggerated reality. I wanted to push it outside of the realm of just playing on normal. So the idea of making these rooms a little over the top I embraced. We embraced the color too because we wanted extreme colors. That was kind of tough because we were shooting in Albuquerque, New Mexico, and a lot of the buildings there are beige. So, we found a gas station with a lot of color and a motel with a lot of color. Then, we added the neon tubes all around. Some people are freaked out by the color palette in this movie, but as an artist, I think sometimes we should push the boundaries of what people find to be regular.\n\nAD: The film offers this theme of the lack of connectivity, that lack of civilization, where the characters are left to their wits that have been dulled by modern technology. What was it about End of the Road that attracted you as a director?\n\nMS: What originally attracted me was the opportunity to work with Queen Latifah again. We’ve sort of known each other from music videos in New York for a while, worked together on Star, and then the opportunity to work with her again… I just love working with her. Since this movie, we’ve worked together on an episode of Equalizer. She’s a wonderful talent. I read the script because she was attached to it. When I read it, I could relate to this woman who was reeling from the loss. The family was torn apart and found their way back to each other. From adversity, the family actually becomes stronger, and I could relate to that story. I wanted to tell that story, particularly about a Black family but it’s not a story that’s unique to a Black family. However, what they face going through these desolate areas with the racism that happens, both covert and overt, is something that Black people experience in the United States whether anybody wants to admit it or not. That’s something that’s our reality, and I wanted to be able to show that.\n\nAD: As you’ve mentioned, you have worked with Queen Latifah multiple times. What was it like working with her as both an actress and as a producer on this film?\n\nMS: She functions primarily as an actress. She doesn’t throw the weight of the producer title on you. She comes in with a pure heart, and she really is in the state of mind of an actress. When we got into post-production, then she went into producer mode and was really helpful in supporting me through getting this film done. So, it actually worked really well. But as an actress, she shows up prepared, and she’s willing to get feedback. She’s willing to give feedback, which I think is great. I love to get feedback from actors because I really admire what actors bring to the table as they bring a different sensibility than even the writers or the director brings because they live through the spirit of a character. When I hear what their thoughts are about the words and what’s happening to that character, I really take that to heart. I find that it makes all the scenes better.\n\nAll the times in the movie where she makes reference to her dead husband, that’s all Latifah. I lost my mother a month before we went into prep on this movie, and so I was reeling from that loss. She said, ‘You know, when you lose somebody, you talk to them. They stay with you.’ And so we talked about it. We picked moments in the film when Brenda would say something to her husband. That’s how those moments came alive. That’s all from the actor having a thought about the spirit of the character.\n\nAD: The film rises on those moments of that core family group. How did you work with those four actors to build that incredible chemistry that really comes across on screen?\n\nMS: The chemistry actually was there naturally. It’s interesting. Queen Latifah actually recommended Ludacris for the role of Reggie. After the first time I talked to him, I was like he’s Reggie. He’s not really Reggie in real life, but when we were talking about it, he understood Reggie. The next person that we cast was Mikayla, who plays the daughter, and she just stood out amongst everybody. She’s a wonderful actress. I just actually got to work with her again on a couple of episodes of Truth Be Told for Apple. We did a lot of chemistry test reads with her and the potentials for the brother, and Shawn read and it was just immediately chemistry. You just saw brother and sister. They went at it. They were ad libbing, and they just went at it. It was just like another brother and sister. Then, we had a cast dinner a few nights before the first day of shooting. It was just those four characters, and we had a really lovely long dinner. We just were all talking about our lives and our dreams and kind of where we came from. They started to bond as a family, and the rest was just magic. They really felt like a real family. They had nicknames for each other and everything.\n\nAD: Last question for you: let’s say you have the keys to the kingdom. You’ve worked in television, you’ve worked in streaming, you’ve worked in film, and you’ve worked in music videos. You’ve done a little bit of everything. If there were no barriers and budget wasn’t a concern, then what would be your dream project?\n\nMS: I have a dream project right now I want to do. I want to do a limited series about Josephine Baker starring Ruth Negga. That’s what I want to do.\n\nEnd of the Road is now streaming exclusively on Netflix."}, {"url": "https://www.allamericanspeakers.com/celebritytalentbios/Millicent+Shelton/409890", "page_content": "Millicent B. Shelton is an American music video, television, and film director.\n\nShelton began her career as a wardrobe production assistant on the Spike Lee film Do the Right Thing. She went on to direct music videos for artists such as Mary J. Blige, R. Kelly, Aaliyah, CeCe Peniston, and Salt-n-Pepa.\n\nHer other directing credits include the motion picture Ride and episodes of Everybody Hates Chris, The Bernie Mac Show, Girlfriends, Castle, Californication, My Name Is Earl, 90210, Men of a Certain Age, Pan Am, Leverage, and 30 Rock, for which she became the first African-American woman to earn a Primetime Emmy Award nomination for Outstanding Directing for a Comedy Series."}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://www.filmbug.com/db/36848", "page_content": "makes her feature debut with, a Hip Hop road comedy with heart. Shelton, herself a sought after music video director, based the story on a real­life, out­ofcontrol bus ride bringing young Harlem talent to a video shoot in Florida.\n\nA native of St. Louis and graduate of Princeton University, Shelton got her start in 1988 when she became a production assistant on Spike Lee's Do The Right Thing. She moved on to be a production assistant on The Cosby Show, before starting classes in the prestigious graduate film program at NYU. While at NYU, she began assisting on music videos as a way of getting paid experience ­­ and because she loved the whole Hip Hop culture. Eventually, producer Hurby Luv Bug Azor let her direct her own video ­­ Expression, for the platinum­selling female rap trio Salt­n­Pepa.\n\nShe has gone on to direct videos for Mary J. Blige, MC Lyte, R. Kelly, Aaliyah, Heavy D and Ce Ce Peniston among others."}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://medium.com/authority-magazine/millicent-shelton-5-things-i-wish-someone-told-me-when-i-first-became-a-filmmaker-894dd50dc40a", "page_content": "Thank you so much for joining us in this interview series! Our readers would love to get to know you a bit better. Can you tell us a bit of the ‘backstory’ of how you grew up?\n\nI grew up in St. Louis way out in the suburbs. I went to college at Princeton university in new jersey and every weekend I’d ride the train to New York City to hang out. It only made sense for me to move to new york after graduation and eventually earn my master's in film from NYU while directing music videos to pay the bills.\n\nCan you share a story with us about what brought you to this specific career path?\n\nI had to decide what I was going to major in at Princeton. I grew up believing that I wanted to be a lawyer but after interning for a summer at a law firm, I knew that was not the job for me. My mother told me to select a field that I loved but I had no clue what that was. It took me a while to do some soul searching. I remembered that I enjoyed creative writing. I took a summer course at NYU to explore what it was like to create a short film from a writer’s perspective and ended up loving being a director. By the end of the summer, i knew that there was no other job but directing for me.\n\nCan you share the funniest or most interesting story that occurred to you in the course of your filmmaking career?\n\nOne of my craziest experiences on set came during the filming of “end of the road.” I had just called cut on a scene with beau bridges outside of our motel location and we started to set up for the next scene when suddenly the blue sky turned brown, and we were hit with high winds mixed with sand so thick that you couldn’t see 3 feet in front of you. It’s called a ‘haboob’ which is a crazy intense dust storm. It lasted for 45 minutes then suddenly stopped and the most breathtaking sunset appeared. We filmed the SUV driving up to the motel in that light.\n\nWho are some of the most interesting people you have interacted with? What was that like? Do you have any stories?\n\nI have worked with so many brilliantly talented people. It was a dream of a lifetime to work with Al Pacino on “Hunters’. Every time I search for a visual film reference, one of his films appears! He’s been in so many iconic movies, its mind-blowing. He was a truly lovely actor who was collaborative and giving. There was a moment the first day that we worked together that I thought maybe I shouldn’t give Al Pacino a note, but that’s my job as a director. I gave him notes but I made sure that they were smart notes that I could back up and notes that would further enhance the magic that he naturally creates. He gave me a big hug on his last day and said, “I’d like to work with you again, kid.” I liked that he called me kid. It would be a blessing to work with Al again.\n\nNone of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are? Can you share a story about that?\n\nMy favorite professor at NYU was Nick Tanis. He taught me how to transform my daydreams into filmable images. Paris Barclay has been my mentor for years. I shadowed him off and on for 3 years trying to get my first break as a director in episodic television. On the first episode that I was hired on, Paris promised the producers that he would guide me through it and be there if I froze up then privately he told me that I could handle the job on my own which I did. Until covid, I was having an annual breakfast with David Nutter who is also a mentor to me. He was instrumental in helping me to move into action television and was a sounding board for me during my first pilot. There are countless other people that have helped me, but it would take up pages and pages! I am a driven person but have had lots of help along the way.\n\nCan you please give us your favorite “life lesson quote”? Can you share how that was relevant to you in your life?\n\n‘Never give up’ is my favorite quote. I started directing during a time when women and especially women of color were not welcomed with open arms as Hollywood television directors. There were lots of doors that were not open. I wanted to give up a lot, but that quote would ring through my head. My testimony is that I am here today because I had blind faith and perseverance and did not give up on my dream.\n\nI am very interested in diversity in the entertainment industry. Can you share three reasons with our readers about why you think it’s important to have diversity represented in film and television? How can that potentially affect our culture?\n\nI wholeheartedly believe in diversity. To me, diversity is a little bit of everyone, inclusive of all races, gender, and LGBTIQQ+. It’s important because cinema should be reflective of real life and our world is diverse. The more we have diverse voices behind the screen, the more our stories will ring true and have realistic characters, dialogue, and actions. The more that we explore diverse stories, the more that we realize that despite our ethnic or socio-economic differences, we are all very much the same. Family is family. Fear is fear. Love is love.\n\nWhat are some of the most interesting or exciting projects you are working on now?\n\nBeing able to shepherd ‘end of the road’ has been a wonderful experience that I am very proud of. It was great to collaborate with queen Latifah again. We worked together to create a black family with a female matriarch who is a smart, strong, mama bear willing to do whatever is necessary to protect her family. After this, I am in development on a Josephine Baker limited series with Ruth Negga attached in the leading role. I am super excited about that. We’re looking to delve deeper into Josephine than ever before. I can’t wait to see what ruth does with this part. She’s amazing!\n\nWhich aspect of your work makes you most proud? Can you explain or give a story?\n\nI am most proud of my ability to collaborate with actors. They are the conduit for the soul of the characters and I respect their position. I love hearing their point of view and then working to make sure that the feeling that they desire to convey is truly coming through. Both queen Latifah and Chris ‘Ludacris’ bridges were laser-focused on representing their characters in their truest light. They trusted me to give them feedback in order to make their performances stronger. Another actor that I’ve worked with is Forest Whitaker. He is the king of nuanced performances. When I worked with him on ‘empire’, I noticed that he would subtly change his performance with each take. We’d discuss it after each take and then land on the read that we both felt sold the story and character best.\n\nOk super. Here is the main question of our interview. What are your “5 things I wish someone told me when I first started” and why? Please share a story or example for each.\n\nGet sleep because production will seep into your dreams, and you will never have a sound sleep again. Trust your gut because you must stand up or fall down based on your own thoughts not because someone told you to do it. Be fearless. A healthy amount of fear is normal but don’t be too scared that it limits your ability to dream outside of the box. Listen to everyone. This doesn’t mean doing everything that everyone suggests but be smart enough and open enough to hear thoughts that may lead you to something great. Learn to say ‘no.’ it’s actually a secret power.\n\nWhen you create a film, which stakeholders have the greatest impact on the artistic and cinematic choices you make? Is it the viewers, the critics, the financiers, or your own personal artistic vision? Can you share a story with us or give an example of what you mean?\n\nWhen I create, I can’t think about what critics will say or it would make my mind spin. I read the material, daydream about it, and try to stay true to it. My goal is to take the 2-dimensional words off the page and breathe life into their 3-dimensional existence with the help of actors and amazing crew members. I like to say that as a director, ‘i service script.’\n\nYou are a person of great influence. If you could start a movement that would bring the most amount of good to the most amount of people, what would that be? You never know what your idea can trigger. :-)\n\nMy movement would be for equality and parity for all. In particular, a woman’s right to choose how she uses her body.\n\nWe are very blessed that some of the biggest names in business, vc funding, sports, and entertainment read this column. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this. :-)\n\nI would like to sit down and have a quiet lunch with president Barrack Obama. I can’t imagine the stories he has to share but I know they are deep.\n\nHow can our readers further follow you online?\n\nThey can follow me on instagram at @shelton9mil. I try to keep it updated!\n\nThis was very meaningful, thank you so much! We wish you continued success!"}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}], "Millicent Shelton worked on The Fresh Prince of Bel-Air.": [{"url": "https://www.latimes.com/entertainment-arts/tv/story/2022-02-13/bel-air-peacock-the-fresh-prince-characters-compared", "page_content": "Will Smith, left, and Jabari Banks. (NBC; Peacock)\n\nThe sitcom’s titular character, though loosely based on the experiences of music executive Benny Medina, leaned heavily on the real-life personality of Will Smith: a charismatic, streetwise teen with an aptitude for music, talent on the basketball court and skills with the ladies. Its theme song explained why Will moved across the country, while showing him being spun around in the air by a local bully.\n\n“Bel-Air” ups the stakes to justify the drastic relocation: One night, after finishing a game, Will’s best friend Tray is wrongfully accused of hitting a gang leader in the face with a basketball. To interrupt the resulting beatdown, Will pulls a gun from Tray’s backpack and shoots it in the air, then aims it at the gang leader until the cops pull up and arrest him. While Will spends the night in jail, his mother gets help from Will’s Uncle Phil, a high-powered lawyer who pulls strings to ensure his release and offers to keep him safe in Los Angeles, far from the gang leader’s revenge. (Or is it?)\n\nMaking his onscreen debut, Jabari Banks — who had the “Fresh Prince” boxed set as a child and is actually from West Philadelphia! — says his version of Will is “a little grittier. He’s very prideful, he doesn’t like getting his toes stepped on and, any chance he gets to prove someone wrong, he will do that. He don’t take no s—, and sometimes that gets him into trouble. But I’m excited for people to see what’s been bubbling up inside him as that’s all going down.”\n\nAdvertisement\n\nAnd as in the original, Will and his cousin Carlton do not initially get along — not only because Will wears his school blazer inside-out, but also because “they have two different ideas about how the world works, but they have to figure out how to coexist in the same house and the same school, which is Carlton’s world,” says Banks."}, {"url": "https://www.usatoday.com/story/entertainment/tv/2022/02/12/peacock-bel-air-series-fresh-prince-drama-will-smith/6726444001/", "page_content": "We'd like to take a minute, just sit right there. We'll tell you how \"Fresh Prince\" was rebooted for a drama called \"Bel-Air.\"\n\nPeacock, the streaming service that premieres the first three episodes of the weekly series Sunday, and producers recognized elements of a drama in the hit 1990-96 NBC sitcom that launched Will Smith's acting career.\n\nThe theme song of \"The Fresh Prince of Bel-Air\" helpfully explains the premise: A young Will is sent to live with his well-to-do Uncle Phil, Aunt Viv, and their three children – Hilary, Carlton and Ashley – after getting into a fight in his West Philly neighborhood.\n\n\"You just ask the question, 'Why are Will and his mother living in Philadelphia and struggling to get by, at times, (when) they have these relatives living in Bel-Air in luxury?'\" says co-executive producer T.J. Brady of turning the show into a drama for Peacock. \"It's just looking deeper at the actual premise and asking, 'OK, if this was real, what would that look like?'\"\n\n'Excited' Will Smith reveals dramatic 'Fresh Prince of Bel-Air' reboot coming to NBC's Peacock\n\nWill Smith talks abuse and Tupac Shakur: 5 surprising revelations from his new memoir\n\nAlthough \"Fresh Prince\" had drama of its own – Will was shot during a robbery, and broken-hearted when his absent father abandoned him once more – the show was generally light and showcased Smith's knack for physical comedy. \"Bel-Air,\" in contrast, mirrors the seriousness of film director Morgan Cooper's speculative trailer that went viral in 2019. (Cooper is a director, co-writer and executive producer for the new series.) Brady says the short served as \"a very good North star\" for the new show's aesthetic and tone.\n\nBut who would the \"Fresh Prince\" characters be in today's world? \"What would a three-dimensional version of that character look like? What would they want? What would their dreams be? What would their flaws be?\" Brady wondered.\n\nRasheed Newson, another co-executive producer, says \"Bel-Air\" \"nods to the original and character traits\": the new Will borrows from the \"Fresh Prince\" theme song to explain his scuffle in Philly. But the remake avoids borrowing storylines, he says, \"because that felt a bit disrespectful. We didn't feel like we could do that better than they did it.\"\n\n'Fresh Prince' reunion:Will Smith and Janet Hubert extinguish ugly, decades-long feud\n\nPeacock, NBC's streaming service, will have all Universal films starting in 2022\n\n\"Bel-Air\" also side-stepped the Carlton dance, Alfonso Ribeiro's memorable move of snapping and swinging his arms. (Ribeiro created the dance by marrying Courteney Cox's appearance in Bruce Springsteen's \"Dancing in the Dark\" music video and Eddie Murphy's impression of white people dancing in his comedy special \"Raw,\" the actor told HuffPost in 2015.)\n\n\"We're trying very hard to establish our own world,\" says Newson \"We don't want to take people out of the reality of our show, and, boy, the Carlton dance feels like maybe a step too far.\"\n\nMeet the series' re-imagined characters:\n\nAlfonso Ribeiro drops 'Carlton Dance' suit against 'Fortnite' video game creators\n\nWill Smith (Jabari Banks)\n\nFor the role of the new Will, Brady envisioned \"someone with swagger\" and \"maybe a little bit more of a street edge.\" Will is now a bright student with hopes of playing basketball at a Division 1 school. He's shipped to Bel-Air after cops break up a brawl on the court in which Will pulls a gun on a notorious criminal in his neighborhood. \"I’m not gonna bury my son,\" Will's mom Viola (April Parker Jones) says while driving her son to the airport. \"You got a second chance, baby. Don’t waste it.”\n\nAs Newson explains, swapping a sitcom for a drama means the \"Bel-Air\" Will's actions would follow him after at an episode's end. \"Will would do something rash or dangerous, and it would all be worked out in 28 minutes. Here, Will has to live with his bad decisions. He has to live with his mistakes. That opens him up to being more vulnerable,\" he says. \"It also means at times he can be angry, he can be upset. He just gets a fuller spectrum of emotions.\"\n\nCarlton Banks (Olly Sholotan)\n\nCarlton 2.0 is well-liked at Bel-Air Academy, in contrast to the dorkier depiction in the original series. Older sister Hilary dubs him \"the Jackie Robinson\" of lacrosse.\n\n\"In the sitcom, they made fun of him because he did well in school and had assimilated to what could be thought of as a white culture,\" Newson says. \"But when we looked at that today, and we said, 'OK, this kid is rich. He's attractive. He's an athlete. He makes good grades, and he's of this rarified world,' it dawned on us, this Carlton would be popular. He'd be one of the leaders of the school, and that was refreshing because it made him more of an equal to Will when Will arrives. And it made a clash inevitable.\"\n\nThis Carlton also dabbles in drugs. In the premiere, Will finds Carlton snorting what he says is Xanax when Will walks into his room unannounced. Later in the episode, Carlton sniffs more white powder at a party. Brady says Carlton's drug usage adds authenticity: \"If you look at the realism of the situation, of privileged young people in rich areas of Los Angeles, it's just a reality. And for us not to acknowledge that would be a disservice to what we're trying to do with the show.\"\n\nBut \"it's tied to his anxiety disorder, and it helped him have confidence and be the person who's outgoing,\" Newson says.\n\nUncle Phil Banks (Adrian Holmes)\n\nIn the debut episode Will arrives as the Bankses are hosting a fundraiser for Uncle Phil's bid for district attorney. Phil (originally portrayed by the late James Avery) tells attendees he’s “tired of watching this broken system discard young Black men into the for-profit school to prison pipeline.”\n\nBrady says the campaign allows \"the show to examine some of the larger issues, especially when it comes to the legal system as it relates to families of color.\" It also spurs an internal conflict for the character, says Newson. \"This Uncle Phil, he still has his own ambitions, and he's trying to do right by Will without letting Will complicate and ruin those ambitions,\" says Newson. \"What is he going to choose? The well-being of his family or his own personal goal?\"\n\nAunt Viv Banks (Cassandra Freeman)\n\nBrady describes Will's re-imagined Aunt Viv as \"a brilliant artist who had to put her pursuit of an art career on hold when life got a little overwhelming.\" He also notes that when Viv (a role shared by Janet Hubert and Daphne Reid in the original series) was aspiring to become an artist, \"the world was in a different place at that time and not necessarily as open to artists of color as it is now.\"\n\nThe original premise allowed producers to draw parallels between Will and Viv, who made her own journey to Bel-Air from Philadelphia decades earlier. \"We realized these two are kindred spirits,\" Newson says. \"It also got us thinking about who was Viv before she had children, before she met Phil. What we're going to see in this new version is Will's arrival really reawakens Viv's artistic side and her early ambitions that she let slip away.\"\n\nHilary Banks (Coco Jones)\n\nBrady says the new version of Hilary (originated by Karyn Parsons) is inspired by the shopaholic. Still fashionable, the new Hilary helps Will dress for Phil's fundraiser.\n\n\"Hilary, in the original, was often very concerned about appearances and how she looked, and she had a hunger for attention,\" says Newson. For \"Bel-Air,\" she becomes an influencer with 75,000 followers. Newson says the team also \"wanted to give her a skill that would translate and have value outside of social media.\" They decided this Hilary can cook. (The first Hilary at least learned to make toast.)\n\nAshley Banks (Akira Akbar)\n\nViewers briefly meet Ashley, the youngest Banks child, in the \"Bel-Air\" premiere. She's a 12-year-old who's concerned about climate change and a \"polarized political climate.”\n\n“Ashley is still an adorable sweetheart,\" Newson says, \"but in this re-imagining we will have her tackling some of the issues about identity and privilege that preteens face today.\"\n\nThe role was originally played by Tatyana Ali.\n\nGeoffrey (Jimmy Akingbola)\n\nThe \"Bel-Air\" Geoffrey has the title of house manager, rather than butler-like \"G\" (Joseph Marcell) in \"Fresh Prince.\" And he doesn't wear a uniform.\n\n\"We didn't just want him to feel like an employee or a servant,\" says Newson. \"We try to elevate him more to the role of confidant\" to Phil. He says the switch also \"gave the show someone who could speak truth to power. Geoffrey isn't just some employee who's like, 'Yes, boss.' 'OK, boss.' He can really challenge Phil in ways that almost no one else on the board can.\"\n\nLisa Wilkes (Simone Joy Jones)\n\nLisa, introduced in the penultimate season of \"Fresh Prince\" (and played by Nia Long), helps illustrate \"what was the Banks family doing before Will knocked at their door?\" Newson says. The new version of Lisa is still a love interest for Will, but just to add to the drama, she's now Carlton's ex. Lisa is also a dedicated swimmer with dreams of going to the Olympics.\n\nJazz (Jordan L. Jones)\n\nJazz, first played by Smith's friend and collaborator DJ Jazzy Jeff, has several hustles. His business card calls him a vinyl expert, DJ, flower deliverer and private transportation provider, which is how Jazz meets Will, during a ride to the Bankses' from the Los Angeles airport.\n\n\"He's great, in part because he's a good confidant to Will,\" says Newson, before sharing something worthy of a celebration with a Jazz and Will handshake. \"But also – and this goes back to the original – there is an ongoing flirtation between Jazz and Hilary, which we explore later in this season.\""}, {"url": "https://tvline.com/lists/the-fresh-prince-of-bel-air-reboot-cast-uncle-phil-carlton-photos/", "page_content": "Prepare to meet Aunt Viv No. 3!\n\nPeacock on Tuesday unveiled the full cast for Bel-Air, the highly anticipated, dramatic reboot of the beloved ’90s sitcom The Fresh Prince of Bel-Air. The ensemble includes Adrian Holmes (Arrow, 19-2) as Phillip Banks, Cassandra Freeman (The Enemy Within) as Vivian Banks, Olly Sholotan as Carlton Banks, Coco Jones (Good Luck Charlie) as Hilary Banks and Akira Akbar (Captain Marvel) as Ashley Banks.\n\nAdditionally, Jimmy Akingbola (Holby City) will assume the role of Geoffrey, while Jordan L. Jones (Rel) will play Will’s frequently tossed BFF Jazz.\n\nWhile there’s no Little Nicky in sight, the reboot has gone ahead and cast Simone Joy Jones (The Chair) as Lisa — who, in the original series, was introduced in Season 5 as Will’s girlfriend and eventual bride (though they eventually called off the wedding).\n\n“Set in modern-day America, Bel-Air is a serialized one-hour dramatic analogue of the ’90s sitcom The Fresh Prince of Bel-Air that leans into the original premise: Will’s complicated journey from the streets of West Philadelphia to the gated mansions of Bel-Air,” reads the show’s official logline. “With a reimagined vision, Bel-Air will dive deeper into the inherent conflicts, emotions and biases that were impossible to fully explore in a 30-minute sitcom format, while still delivering swagger and nods to the original show.”\n\nThe series, which has already received a two-season order, is inspired by writer-director Morgan Cooper’s 2019 spec trailer, which went viral enough to catch Will Smith’s attention. T.J. Brady and Rasheed Newson will serve as co-showrunners, executive-producing alongside Smith, Terence Carter, James Lassiter, Miguel Melendez, Malcolm Spellman, Quincy Jones, Benny Medina, Andy and Susan Borowitz, and director/co-writer Cooper.\n\nScroll down to see the new cast alongside their sitcom counterparts, then hit the comments with your reactions to the ensemble."}, {"url": "https://www.looper.com/1144764/the-ending-of-fresh-prince-of-bel-air-explained/", "page_content": "As the youngest daughter in the Banks family, Ashley (Tatyana Ali) grew up a lot over the course of the show. She was very close to Will and looked up to him, leading to some heartwarming and hilarious moments, but also influencing her to act in rebellious ways.\n\nBy Season 6, Ashley was more than ready to make her own decisions, but her family still had trouble seeing her as anything other than a sweet, adorable little girl. Phil (James Avery) and Will were particularly overprotective of her, especially when she started dating.\n\nAt one point, Will and Carlton (Alfonso Ribeiro) were shocked to overhear her talking about having sex with her boyfriend, and she was infuriated when she found out they were eavesdropping. Will and Ashley weren't as close as they used to be because of moments like this, but they still had a special bond that never went away.\n\nThroughout the show, Ashley didn't have a clear idea of what she wanted to do as a career, but she was starting to figure it out by Season 6. She got discovered by an agency and decided she wanted to become a fashion model.\n\nPhil wasn't thrilled about this, especially when she got an opportunity to be in a lingerie commercial, but Ashley was no longer letting her father call the shots. She also wasn't making hasty decisions out of teenage angst. By this point, she was capable of deciding what direction she wanted her life to go, whether or not her family completely approved.\n\nBy the end of Season 6, she decided to move to New York with Hilary to attend performing arts school. Even though Phil wasn't happy about his daughters moving out, they were definitely excited about living together in the Big Apple. It would've been easy for Ashley to keep living with her parents in California, but her choice to move across the country showed that she wasn't afraid of change: She was ready to switch things up and live on her own terms."}, {"url": "https://www.washingtonpost.com/arts-entertainment/2020/09/11/fresh-prince-bel-air-hug-father-scene/", "page_content": "Comment on this story Comment Gift Article Share\n\nThis week marks the 30th anniversary of the premiere of “The Fresh Prince of Bel-Air,” the classic 1990s sitcom that transformed a buoyant (and broke) young rapper into Will Smith, blockbuster movie star. In its six seasons on NBC, the series — a grittier version of “The Cosby Show” that juxtaposed hip-hop culture with Black upper-class ethos — tackled everything from racism to sexism to a two-step dubbed “the Carlton.”\n\nThe show retains an important place in pop culture. What millennial doesn’t jump to finish the theme song’s lyrics when prompted by “Innnn West Philadelphia, born and raised”? Or remember that time Aunt Viv just really wanted to dance? Ashley’s first date with R&B princeling Tevin Campbell? Or Hillary’s Playboy spread?\n\nBut there is one episode that stands head and shoulders above the rest. It is “Fresh Prince’s” most iconic half-hour — the moment in which Will, the goof who plays it cool, became human, and Smith became an actor.\n\nAdvertisement\n\n“Papa’s Got a Brand New Excuse” was a watershed 23 minutes for the situational comedy, which, until that moment, hadn’t fully explored the emotional depths of Smith’s character. The episode featured the man-hug loved (and memed) around the world as Uncle Phil (James Avery) doesn’t so much embrace as completely envelop his nephew, who is coming to grips with the loss of his absentee father for a second time.\n\nThe scene almost didn’t happen.\n\nThere had been a lot of interest in an episode about Will’s dad, according to “Fresh Prince” writer David Zuckerman, given that the entire premise of the show was based on Will being sent to live with his rich aunt and uncle because his mother, raising him alone, wants him out of their rough neighborhood. His father was a question mark, or, as cousin Hillary puts it in the episode, “a deadbeat who left him and his mom flat.”\n\nAdvertisement\n\nBut it wasn’t until the fourth season, with its characters deeply established, that the show decided to tackle the subject in depth. Behind the scenes, the episode was also meant to showcase Smith’s dramatic acting chops. It was 1994, and he had just come off “Six Degrees of Separation,” a dramedy about a young con man who charms his way into a rich White family. The reviews were solid for the then-25-year-old’s first dramatic movie role, so Smith was ready to do something that “had a little bite to it,” Zuckerman said.\n\nThe idea was to have Will’s father come back and leave again, disappointing his only son for a second time. “We tried to make him not a bad guy — sympathetic,” explained Zuckerman, who wrote “Papa’s Got a Brand New Excuse” with veteran TV writer Bill Boulware after an initially disastrous table read of a different script had cast Will’s father, Lou (to be played by Broadway alum Ben Vereen), as a pool shark who breezes into town.\n\n“Will did not like it at all. It was not one of our best moments,” said Zuckerman. His and Boulware’s new script recast Lou as a troubled trucker and “a guy that just wasn’t cut out to be a father.”\n\nAdvertisement\n\nVereen, who was “overjoyed” to join the cast for May sweeps week, remembers feeling something special. “Up until that point, they were thinking of [Smith] as a TV actor,” Vereen said of the young man’s burgeoning film career. “I was honored to be there at the launch.”\n\nEpisode director Shelley Jensen worked on the series for all six seasons and watched Smith, who started the show at 21, go from novice to supernova.\n\n“When we started the series, Will was definitely not there, but he grew as a man and as an actor,” he said. The fatherhood episode was pivotal, Jensen added, because it marked Smith’s arrival as a force to be reckoned with.\n\n“It was that specific episode for me as a director [that] I saw him connect and make it work. His acting from that moment on improved dramatically. You saw the light bulb go off,” he said.\n\nAdvertisement\n\nIn that final scene, when Lou disappoints Will for the final time, Vereen himself broke down off-camera. His character was contending with all the things he’d never be and Vereen was deep in that moment.\n\n“When Will calls him ‘Lou’, oh my God, his whole frame just shrunk because he realized at that point that he’d lost his son. Whew, that was deep,” Vereen said. “We were all in the moment. It was almost like time stood still.”\n\nBoulware, who also wrote the episode of “227“ in which a character’s father pops back into the picture, drew from his own life experience for the script. “I had always been interested in shows with fathers, because I grew up with a single parent,” he said.\n\nIn the episode, Will’s father shows up unexpectedly after a 14-year absence. Instead of reading him the riot act, Will is understandably enchanted. Uncle Phil, his character’s influential father figure, is concerned and makes his disgust with Lou known.\n\nAdvertisement\n\n“James Avery was relentless on me to elevate. [He] wouldn’t give me a damn inch,” said Smith in a 2018 interview with podcast Rap Radar. “He was the model for me … of an actor. He just had that acting power that I wanted to have.”\n\nJensen said Avery, who died in 2013, was a driving force on set. Smith, whose most emotional scenes in the episode are opposite Avery, had to cry on camera for the first time. This wasn’t the physical comedy at which Smith the rapper excelled.\n\nDuring the episode’s final scene, Smith was struggling to bring it all home. “I’m messing up the lines because I wanted it so bad,” Smith said in the podcast interview. It was Avery, always the steady influence, that centered him, giving the rapper turned movie star memorable advice. “Relax. It’s already in there, you know what it is. Look at me. Use me. Don’t act around me, act with me,” Smith recalled Avery saying. The young actor would go on to deliver one of the biggest emotional punches in “Fresh Prince” history.\n\nAdvertisement\n\n“How come he don’t want me, man?” Will asks, lip quivering as he starts to break down and cry. Uncle Phil grabs Will and hugs him fiercely, as he wished his father would. The two were locked in that epic embrace when Avery doled out even more encouragement.\n\n“While he’s hugging me, he whispers in my ear, 'That’s f---ing acting right there,” recalled Smith, who also revealed the motivation behind that performance. “I wanted him to want me. I wanted him to approve of me.”\n\nFans of the show have long believed that Smith improvised that final scene in which his character builds to an emotional crescendo, loudly proclaiming all the milestones he got through without Lou, but “every word was written by Bill and I,” Zuckerman said. “Will’s delivery was so perfect it seems like it was in the moment.”\n\nDuring filming, the studio was completely silent — a rarity for a comedy with a live audience.\n\nAdvertisement\n\nDuring an average taping, “The Fresh Prince” set was like a raucous football stadium. Smith would even come out himself and hype up the audience. But during filming of this episode, director Jensen likened the mood of the normally “wild show” to “being in church.”\n\n“It was also so unexpected. ‘Fresh Prince’ wasn’t a show that had done serious moments. This was the first time the show just went there and stayed there and let it resonate,” Zuckerman said of the episode’s lasting impact.\n\nHaving three Black male actors in an intensely dramatic scene on a comedic series only added to the power of the moment.\n\n“The three of them were like a range of Black manhood,” Boulware said. Avery, a trained Shakespearean actor, represented the strong father figure; Smith, four years into his first acting gig, the young man coming into his own manhood; and Vereen, a theater vet, was a man lost. “We didn’t realize it had affected that many people until years later.”\n\nAdvertisement\n\nJensen echoed Boulware’s surprise.\n\n“Did any of us know this show would become what it has become in the last 30 years? No,” he said. “We all knew we were having a great time. But that specific episode? I knew it was good, good television and it was really special.”\n\nRead more:\n\nWatch more:\n\nThe Post's Candace Buckner, David Betancourt and Tramel Raggs explore how current demonstrations against racial inequality are echoing memorable sports movies. (Video: The Washington Post)\n\nGiftOutline Gift Article"}, {"url": "https://www.polygon.com/tv/2018/5/12/17347826/will-smith-fresh-prince-of-bel-air-origin-story", "page_content": "Now, this is a story all about how Will Smith’s life got flipped, turned upside down. In 1989, a year after he and DJ Jazzy Jeff unloaded their breakout hit “Parents Just Don’t Understand,” he was in serious debt to the United States Treasury, Bureau of Internal Revenue. Smith had no flow and needed a gig. Bad.\n\nThis video retells how The Fresh Prince of Bel Air got started. It’s a delightful five minutes, but very real. Anyone who’s had a 1099 filed on them knows the bad feeling, crawling up your back like a spider, when you get to April and remember you gotta pay the tax man. It is painful as shit. Ask Wesley Snipes or Willie Nelson. Smith was nearly bankrupted by his $2.8 million obligation to the government. His income was garnished, which is kind of like withholding, except a lot worse.\n\nSmith, according to this video, dug himself out with old-fashioned hustle. He went over to Stage 29, Paramount Studios Los Angeles, and hung around at The Arsenio Hall Show. That’s where he got introduced to Quincy Jones, the entertainment impresario most recently in the public eye for a bizarre Q&A with Vulture back in February.\n\nJones eventually arranged a meeting with Brandon Tartikoff, the man who greenlit The A-Team, raising NBC from the dead in the 1980s, creating Must-See-TV and marking Thursday nights for appointment television. By Smith’s retelling, Tartikoff had almost no say in the matter. “Did you like it?” Jones asked Tartikoff. “Good!” And that’s how he became the Fresh Prince of Bel Air.\n\nWill Smith, Alfonso Ribeiro, James Avery, Karen Parsons and Joseph Marcell became pop culture icons for their roles as Will, Carlton, Mr. Banks, Hilary and Geoffrey the butler, respectively. Smith moved on to a tremendously successful film career, winning two Oscar nominations in the process. His production company, Overbrook Entertainment, is behind Cobra Kai, which premiered on YouTube Red May 2."}, {"url": "https://www.theverge.com/22906769/bel-air-peacock-review-fresh-prince", "page_content": "NBC’s Fresh Prince of Bel-Air was always a comedy with a pointed focus on celebrating Blackness while also illustrating how there is no singular way to be Black. Bel-Air, Peacock’s new single-cam reimagining of the series from filmmaker Morgan Cooper and Will Smith, exists in a similar narrative space as its predecessor with an updated story about a young knucklehead from West Philly whose mom ships him off to Los Angeles for his own good. But where the original show often felt like a fresh journey you were meant to be embarking on alongside a fictionalized Will Smith, the new series often plays like an uneven mythologization of its central figure that gets bogged down by the weight of its own presumed greatness.\n\nBefore Bel-Air’s Will (Jabari Banks) has a chance to properly introduce himself, the series first presents you with a kind of prophetic dream sequence about the high school basketball player that wordlessly conveys some of the same premise described in The Fresh Prince’s theme song. Though this Will isn’t a storytelling rapper detailing the major beats of his origin story every episode, the premiere opens on him sitting on a throne in a great hall tagged up with glowing glyphs pulsing in time to J.Cole’s “No Role Modelz.”\n\nJust how much Will remembers these recurring dreams when he’s awake isn’t especially clear. But what he, his mom Vy (April Parker Jones), and seemingly everyone in Philadelphia knows is that he’s destined for untold levels of success — some of it basketball-related — so long as he manages to keep himself out of trouble. Trouble, of course, has a way of finding Will, and Bel-Air’s first few episodes spend a significant amount of time trying to unpack what that means for him and his family.\n\nLike Cooper’s Bel-Air short film/fan trailer from 2019 that first put him on the radar of Smith’s Westbrook Studios, Peacock’s series firmly roots Will in a working-class, predominantly-Black chunk of Philadelphia in order to give you a sense of the culture shock he experiences once he’s in California. Will loves Philly, and the city loves him back, but his reputation as a rising basketball star with dreams of going pro put him at odds with people like neighborhood corner boy Darnell (Sloan “D4M $loan” Morgan), and Darnell’s drug-pushing boss, Rashad (Philly rapper Eazy the Block Captain), who also wants Will working for him.\n\nJust how much Will remembers of these recurring dreams isn’t especially clear\n\nWhen a pickup game ends with guns being drawn, the police arriving, and Will leaving the scene in handcuffs, Bel-Air shifts into the familiar, foreboding tones of prestige dramas about people making it out of the inner city. It’s all meant to highlight the sharp contrast between Will’s hometown and the new world he ends up being spirited away to, and it works to a certain extent. But by the time Bel-Air actually drops Will off with his aunt Viv (Cassandra Freeman) and uncle Phil (Adrian Holmes), the series is already so deep into a story about a kid basically going into the witness protection program to save his life that it’s easy to forget that this is a reboot of a sitcom.\n\nIt’s once Will touches down at LAX and crosses paths with cab driver Jazz (Jordan L. Jones) that Bel-Air starts to find its rhythm and feel confident in its ability to make you take it seriously without having to try so hard. At times, like when Bel-Air’s hammering home how important Will and Jazz’s burgeoning friendship is to their feeling a sense of community in LA, that confidence is warranted. When it comes to Bel-Air’s approach to class commentary and its new take on the Banks family, though, the show struggles in large part because of its tendency to conflate overwrought seriousness with quality storytelling.\n\nTo Bel-Air’s credit, all of its characters are given new levels of depth and interior complexity that The Fresh Prince’s half-hour, multi-cam format didn’t quite lend itself to. Here, Phil’s a powerful lawyer running for district attorney who worries that his financial success might alienate him from voters living paycheck to paycheck. Viv’s a respected art history teacher and Phil’s better half who rightfully sees his campaign as part of their shared political ambitions, all the while keeping just enough of an eye on their three children to be present, but not overbearing.\n\nCompared to Will, Viv, and Phil whose characterizations Bel-Air only changes up but so much, the series updates Hillary (Coco Jones), Carlton (Olly Sholotan), and Ashley (Akira Akbar) in ways that speak to both Bel-Air’s strengths and its weaknesses. It makes sense that the Hillary Banks of 2022 would be an up-and-coming influencer who hasn’t quite figured out how to capitalize on her digital popularity — much to the consternation of her mother and her mother’s influential group of sorors. Because Bel-Air doesn’t frame the Banks family as being so ensconced in wealth that Will is almost foreign to them, you can see why it’s easy for Ashley and her older sister to welcome him into their home.\n\nBel-Air reimagines Carlton as a Candace Owens-like villain\n\nIt’s for that same reason, though, that Bel-Air’s characterization of Carlton, a popular lacrosse player with a reputation for surrounding himself with white people, feels like such a misfire, even though it’s very much trying to build on ideas about Black conservatism that were present in the original series. Every series needs a villain, and Will and Carlton’s rivalry-turned-camaraderie is a beloved part of this franchise. But rather than simply depicting its Carlton as being uncomfortable with his cool cousin moving in, Bel-Air reimagines him as a Candace Owens type, whose internalized anti-Blackness borders on the kind of absurdity you usually only see in Tyler Perry’s more heavy-handed productions.\n\nPhil Banks speaking at at an event alongside his children. Peacock\n\nIt’s hard, at times, to imagine Bel-Air’s Carlton actually growing up alongside his siblings, or that neither of his parents seem to know about their son’s frequent and voluntary trips to the Sunken Place. That’s the sort of ugly, heavy thing that Will’s meant to draw attention to as his presence has an influence on his family. But because the show plays up the antagonism between the cousins so intensely, it’s not exactly clear what Bel-Air is building to or what it’s trying to say about its subject matter.\n\nWhat is clear is that Bel-Air was crafted with fans in mind — not simply fans of The Fresh Prince, but fans of the figure that the real Will Smith has become over the course of his decades-long career. For every clever callback to its predecessor, Bel-Air finds a way to remind you that it’s also the Will Smith Show™ as if there’s any room for doubt as to who the main character here is. Based just on Bel-Air’s first three episodes that were provided to press, it’s difficult to say whether the series is going to end up comfortably settling into its tendency to feel like a Smith-centric vanity project, or if it can manage to rise above that. The potential’s all there, but Bel-Air just has to figure out how to fully tap into it."}, {"url": "https://www.theverge.com/2020/9/9/21428647/fresh-prince-of-bel-air-will-smith-reboot", "page_content": "Classic 90s sitcom The Fresh Prince of Bel-Air is being rebooted as a drama for streaming service Peacock, its original star Will Smith has announced on YouTube. The new version, titled Bel-Air, is based on a viral trailer released last year which was a dramatic reimagining of Will’s journey from the streets of West Philadelphia to the mansions of Bel-Air. The series is coming in 2021, according to its announcement video.\n\nDeadline reports that Bel-Air became the focus of a bidding war last month, with Netflix and Peacock emerging as the two frontrunners. Peacock has ordered two seasons of the reboot, in a deal that Will Smith called “unprecedented.”\n\n“I’ve been in this business for thirty years and that does not happen,” Smith said. The Bel-Air trailer has amassed over six million views on YouTube since its release in March last year.\n\nMorgan Cooper, who wrote and directed last year’s trailer, will co-write and direct Bel-Air, which NBC Universal is billing as a “one-hour dramatic analogue of the 90’s sitcom.” Chris Collins, who previously worked on The Wire and The Man in the High Castle is attached as a showrunner, and will co-write the show with Cooper as well as serving as an executive producer alongside Will Smith."}, {"url": "https://movies.stackexchange.com/questions/102588/was-there-any-productional-reason-for-the-set-change-in-the-fresh-prince", "page_content": "In the first episode of the second season of The Fresh Prince of Bel-Air, we can see an almost completely redesigned set when compared to the first season.\n\nS01E01 - The Fresh Prince Project (1990) Still from episode\n\nS02E01 - Did The Earth Move For You? (1991) Still from episode\n\nFather Phillip Banks (actor James Avery) even mentions the changes during the episode and speaks out to his wife Vivian Banks (actress Janet Hubert-Whitten).\n\nVivian Banks: [walking downstairs] I'm Ready.\n\nPhillip Banks: Ah, finally. What took you so long?\n\nVivian Banks: Oh I just spent an hour chasing my outfit on the new rotating dressrack.\n\nPhillip Banks: Why didn't you set the variable speed adjustment?\n\nVivian Banks: Phillip, these gadgets are making my life miserable.\n\nPhillip Banks: Well honey, you're the one who said we should redecorate.\n\nVivian Banks: Well yeah! I said we should keep up with the Joneses, honey, not the Jetsons!\n\nIMDb Quotes, Did The Earth Move For You? (1991)\n\nThey mention that it was done to keep up with their neighbours, but was there any productional reason (e.g. better camera angles, more light) for this change in set? Did the producers give any reason for these changes?"}, {"url": "https://www.teenvogue.com/story/bel-air-everything-you-need-to-know", "page_content": "Bel-Air season 2 just premiered on February 23, but Peacock just delivered a major mid-season surprise: Bel-Air season 3 is officially on the way.\n\nOn March 17, the official Twitter account for Bel-Air tweeted a video slideshow of the show's cast members holding up the number three with their fingers. “We're halfway through the season and decided why not bless the fans with some more good news?” read the tweet. “#BelAirPeacock is coming back for another season! Don't call it a comeback cuz the kings (and queens) never left!”\n\nTwitter content This content can also be viewed on the site it originates from.\n\nICYMI: Bel-Air is a reimagining of the beloved ‘90s sitcom The Fresh Prince of Bel-Air, which starred Will Smith as a fictionalized version of himself. While Fresh Prince was a half-hour family sitcom, Bel-Air is an hour-long drama.\n\nThe dramatic concept of the series is a result of filmmaker and Fresh Prince fan Morgan Cooper’s question of what the seminal sitcom would look like if it were made today. In 2019, Cooper created his answer: a four-minute short film titled Bel-Air that depicted all the characters we know and love in dramatic setting with darker conflict. After the short film-slash-trailer went viral, it caught the eye of Will Smith — and the rest is pretty much history.\n\n“Working with partners that have been so supportive of that vision while bringing their own sensibilities and talent to the project, we were able to create something that we were ultimately all really proud of,\" Cooper said to Teen Vogue last year of the show's creative journey. \"This show came from a place of passion and wanting to make something meaningful to the culture. It's been quite a journey, but I wouldn't change anything about it.”"}], "Millicent Shelton worked on Martin.": [{"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://www.rollingstone.com/music/music-lists/george-martin-20-great-non-beatles-productions-80553/", "page_content": "The tirelessly experimental, gorgeously grandiose production of George Martin is synonymous with the Beatles — and understandably so. His studio stewardship of the group for most of their existence went far beyond the traditional producer role and, together, they pushed the limits of what pop music could sound like. But Martin’s career predated the Fab Four and would continue long after they broke up. He lent his formidable, innovative production and arranging talents to a variety of pop, novelty and soundtrack sessions in the early days; and his work with a panoply of top-name rock artists from the Fifties through the Nineties solidified a legacy that didn’t even need it.\n\n“That’s part of my background, the catholic world of music that has no limits, no blinkers.” Martin told Mojo in 2007. “And when you achieve something that you know hasn’t been done before, and know that people will love it, it’s an enormous feeling of elation, to have done something really worthwhile.”\n\nFrom passing along Beatles rejects to Gerry and the Pacemakers to fostering Seventies jazz fusion with Mahavishnu Orchestra to helping Elton John’s tribute to Princess Diana became the second best-selling single of all time, here are some examples of why Martin was so much more than the Fifth Beatle."}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}, {"url": "https://medium.com/authority-magazine/millicent-shelton-5-things-i-wish-someone-told-me-when-i-first-became-a-filmmaker-894dd50dc40a", "page_content": "Thank you so much for joining us in this interview series! Our readers would love to get to know you a bit better. Can you tell us a bit of the ‘backstory’ of how you grew up?\n\nI grew up in St. Louis way out in the suburbs. I went to college at Princeton university in new jersey and every weekend I’d ride the train to New York City to hang out. It only made sense for me to move to new york after graduation and eventually earn my master's in film from NYU while directing music videos to pay the bills.\n\nCan you share a story with us about what brought you to this specific career path?\n\nI had to decide what I was going to major in at Princeton. I grew up believing that I wanted to be a lawyer but after interning for a summer at a law firm, I knew that was not the job for me. My mother told me to select a field that I loved but I had no clue what that was. It took me a while to do some soul searching. I remembered that I enjoyed creative writing. I took a summer course at NYU to explore what it was like to create a short film from a writer’s perspective and ended up loving being a director. By the end of the summer, i knew that there was no other job but directing for me.\n\nCan you share the funniest or most interesting story that occurred to you in the course of your filmmaking career?\n\nOne of my craziest experiences on set came during the filming of “end of the road.” I had just called cut on a scene with beau bridges outside of our motel location and we started to set up for the next scene when suddenly the blue sky turned brown, and we were hit with high winds mixed with sand so thick that you couldn’t see 3 feet in front of you. It’s called a ‘haboob’ which is a crazy intense dust storm. It lasted for 45 minutes then suddenly stopped and the most breathtaking sunset appeared. We filmed the SUV driving up to the motel in that light.\n\nWho are some of the most interesting people you have interacted with? What was that like? Do you have any stories?\n\nI have worked with so many brilliantly talented people. It was a dream of a lifetime to work with Al Pacino on “Hunters’. Every time I search for a visual film reference, one of his films appears! He’s been in so many iconic movies, its mind-blowing. He was a truly lovely actor who was collaborative and giving. There was a moment the first day that we worked together that I thought maybe I shouldn’t give Al Pacino a note, but that’s my job as a director. I gave him notes but I made sure that they were smart notes that I could back up and notes that would further enhance the magic that he naturally creates. He gave me a big hug on his last day and said, “I’d like to work with you again, kid.” I liked that he called me kid. It would be a blessing to work with Al again.\n\nNone of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are? Can you share a story about that?\n\nMy favorite professor at NYU was Nick Tanis. He taught me how to transform my daydreams into filmable images. Paris Barclay has been my mentor for years. I shadowed him off and on for 3 years trying to get my first break as a director in episodic television. On the first episode that I was hired on, Paris promised the producers that he would guide me through it and be there if I froze up then privately he told me that I could handle the job on my own which I did. Until covid, I was having an annual breakfast with David Nutter who is also a mentor to me. He was instrumental in helping me to move into action television and was a sounding board for me during my first pilot. There are countless other people that have helped me, but it would take up pages and pages! I am a driven person but have had lots of help along the way.\n\nCan you please give us your favorite “life lesson quote”? Can you share how that was relevant to you in your life?\n\n‘Never give up’ is my favorite quote. I started directing during a time when women and especially women of color were not welcomed with open arms as Hollywood television directors. There were lots of doors that were not open. I wanted to give up a lot, but that quote would ring through my head. My testimony is that I am here today because I had blind faith and perseverance and did not give up on my dream.\n\nI am very interested in diversity in the entertainment industry. Can you share three reasons with our readers about why you think it’s important to have diversity represented in film and television? How can that potentially affect our culture?\n\nI wholeheartedly believe in diversity. To me, diversity is a little bit of everyone, inclusive of all races, gender, and LGBTIQQ+. It’s important because cinema should be reflective of real life and our world is diverse. The more we have diverse voices behind the screen, the more our stories will ring true and have realistic characters, dialogue, and actions. The more that we explore diverse stories, the more that we realize that despite our ethnic or socio-economic differences, we are all very much the same. Family is family. Fear is fear. Love is love.\n\nWhat are some of the most interesting or exciting projects you are working on now?\n\nBeing able to shepherd ‘end of the road’ has been a wonderful experience that I am very proud of. It was great to collaborate with queen Latifah again. We worked together to create a black family with a female matriarch who is a smart, strong, mama bear willing to do whatever is necessary to protect her family. After this, I am in development on a Josephine Baker limited series with Ruth Negga attached in the leading role. I am super excited about that. We’re looking to delve deeper into Josephine than ever before. I can’t wait to see what ruth does with this part. She’s amazing!\n\nWhich aspect of your work makes you most proud? Can you explain or give a story?\n\nI am most proud of my ability to collaborate with actors. They are the conduit for the soul of the characters and I respect their position. I love hearing their point of view and then working to make sure that the feeling that they desire to convey is truly coming through. Both queen Latifah and Chris ‘Ludacris’ bridges were laser-focused on representing their characters in their truest light. They trusted me to give them feedback in order to make their performances stronger. Another actor that I’ve worked with is Forest Whitaker. He is the king of nuanced performances. When I worked with him on ‘empire’, I noticed that he would subtly change his performance with each take. We’d discuss it after each take and then land on the read that we both felt sold the story and character best.\n\nOk super. Here is the main question of our interview. What are your “5 things I wish someone told me when I first started” and why? Please share a story or example for each.\n\nGet sleep because production will seep into your dreams, and you will never have a sound sleep again. Trust your gut because you must stand up or fall down based on your own thoughts not because someone told you to do it. Be fearless. A healthy amount of fear is normal but don’t be too scared that it limits your ability to dream outside of the box. Listen to everyone. This doesn’t mean doing everything that everyone suggests but be smart enough and open enough to hear thoughts that may lead you to something great. Learn to say ‘no.’ it’s actually a secret power.\n\nWhen you create a film, which stakeholders have the greatest impact on the artistic and cinematic choices you make? Is it the viewers, the critics, the financiers, or your own personal artistic vision? Can you share a story with us or give an example of what you mean?\n\nWhen I create, I can’t think about what critics will say or it would make my mind spin. I read the material, daydream about it, and try to stay true to it. My goal is to take the 2-dimensional words off the page and breathe life into their 3-dimensional existence with the help of actors and amazing crew members. I like to say that as a director, ‘i service script.’\n\nYou are a person of great influence. If you could start a movement that would bring the most amount of good to the most amount of people, what would that be? You never know what your idea can trigger. :-)\n\nMy movement would be for equality and parity for all. In particular, a woman’s right to choose how she uses her body.\n\nWe are very blessed that some of the biggest names in business, vc funding, sports, and entertainment read this column. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this. :-)\n\nI would like to sit down and have a quiet lunch with president Barrack Obama. I can’t imagine the stories he has to share but I know they are deep.\n\nHow can our readers further follow you online?\n\nThey can follow me on instagram at @shelton9mil. I try to keep it updated!\n\nThis was very meaningful, thank you so much! We wish you continued success!"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.awardsdaily.com/2022/09/12/end-of-the-road-director-millicent-shelton-on-working-with-queen-latifah-and-the-importance-of-inclusion-in-storytelling/", "page_content": "Millicent Shelton started her career as a wardrobe production assistant on Spike Lee’s 1989 classic Do the Right Thing. That opportunity served as a springboard to a directing career of her own across music videos, television, and film. Her direction of the 30 Rock episode “Apollo, Apollo” would make her the first Black woman to receive an Emmy nomination for Outstanding Directing for a Comedy Series.\n\nWith Netflix’s End of the Road (currently streaming), Shelton again works with star and producer Queen Latifah. In the film, Latifah plays Brenda, a recently widowed mother who loses her home in Los Angeles. After deciding to move home to Houston, Brenda travels across the Southwest with her brother (Ludacris) and two children (Mychala Lee, Shaun Dixon). On the journey, they run afoul of a major crime boss thanks to a bag of money that holds the potential to change their lives. The film asks viewers to experience the world through the eyes of this troubled Black family as they hold together in the face of traumatic danger.\n\nHere, in an interview with Awards Daily, Millicent Shelton talks about what drew her to the project and what it’s like to work with Queen Latifah both in front of and behind the camera. She talks about the film’s vivid color palate and the joyous luck in finding four actors who held so much natural chemistry together. Finally, she talks about the importance of inclusivity and the recent conversation around two major television series — HBO’s House of the Dragon and Amazon Studio’s The Lord of the Rings: The Rings of Power — who cast Black actors in major roles within the series.\n\nAwards Daily: I’d like to start with recent controversies related to specific audiences rejecting inclusive efforts on such major projects as Rings of Power and House of the Dragon. How do you as a filmmaker react to that in a modern filmmaking environment? Does it make you even more determined to pursue inclusive projects?\n\nMillicent Shelton: It does. I tend to be a little bit of a rebel. I like to push against what people perceive as the norm. So the perception we have had in television and cinematically has been very Caucasian. Not only are white Americans used to that, but so are Black Americans or Asian Americans or Latino Americans. That’s how a lot of body dysmorphia happens to Black girls and Latino girls and Asian girls. They don’t see people like them represented as images of beauty. There’s a movement now to change that.\n\nI honestly think that’s what our country fought for — to have representation and freedom. If we’re going to truly embrace what we say this country is about which is about embracing diversity and about the melting pot, then we should embrace that in front of and behind the camera as well. I honestly believe that we are stronger when we are like that. To me, diversity is not making an all Black film, not that I’m against that. I think diversity is a mix of everybody, and it’s not just different colors. It’s also different religions. It’s different sexual preferences. It’s diversity of all, and that’s what makes us as a country stronger because we get to experience a lot of different people’s perspectives. I think that our creativity is better that way.\n\nIn this film, we had a mix of everyone in all key positions. We really functioned that way. I like to say that we were a crew that went through a lot of strenuous situations. We survived it as a team, and we survived it as a family. We were a very diverse family, but we survived it as a family.\n\nAD: So you have a Brazilian production designer and an Asian American cinematographer. The film has a very international visual flair. The roadside motel, in particular, doesn’t look like any I’ve ever seen. In fact, the entire color palate for the film is incredibly vibrant and bursting with deep, vivid colors.\n\nMS: [The motel room] is my Brazilian production designer. It’s interesting because we kept looking for motel rooms, and we could not find them. They’re all too little. So we decided to build it, but we had seen a reference for this one in a motel that doesn’t exist anymore. It had cherubs on the wall, and that was it — Lucio’s [Seixas, production designer] brain started to go. Our whole vision for this film was exaggerated reality. I wanted to push it outside of the realm of just playing on normal. So the idea of making these rooms a little over the top I embraced. We embraced the color too because we wanted extreme colors. That was kind of tough because we were shooting in Albuquerque, New Mexico, and a lot of the buildings there are beige. So, we found a gas station with a lot of color and a motel with a lot of color. Then, we added the neon tubes all around. Some people are freaked out by the color palette in this movie, but as an artist, I think sometimes we should push the boundaries of what people find to be regular.\n\nAD: The film offers this theme of the lack of connectivity, that lack of civilization, where the characters are left to their wits that have been dulled by modern technology. What was it about End of the Road that attracted you as a director?\n\nMS: What originally attracted me was the opportunity to work with Queen Latifah again. We’ve sort of known each other from music videos in New York for a while, worked together on Star, and then the opportunity to work with her again… I just love working with her. Since this movie, we’ve worked together on an episode of Equalizer. She’s a wonderful talent. I read the script because she was attached to it. When I read it, I could relate to this woman who was reeling from the loss. The family was torn apart and found their way back to each other. From adversity, the family actually becomes stronger, and I could relate to that story. I wanted to tell that story, particularly about a Black family but it’s not a story that’s unique to a Black family. However, what they face going through these desolate areas with the racism that happens, both covert and overt, is something that Black people experience in the United States whether anybody wants to admit it or not. That’s something that’s our reality, and I wanted to be able to show that.\n\nAD: As you’ve mentioned, you have worked with Queen Latifah multiple times. What was it like working with her as both an actress and as a producer on this film?\n\nMS: She functions primarily as an actress. She doesn’t throw the weight of the producer title on you. She comes in with a pure heart, and she really is in the state of mind of an actress. When we got into post-production, then she went into producer mode and was really helpful in supporting me through getting this film done. So, it actually worked really well. But as an actress, she shows up prepared, and she’s willing to get feedback. She’s willing to give feedback, which I think is great. I love to get feedback from actors because I really admire what actors bring to the table as they bring a different sensibility than even the writers or the director brings because they live through the spirit of a character. When I hear what their thoughts are about the words and what’s happening to that character, I really take that to heart. I find that it makes all the scenes better.\n\nAll the times in the movie where she makes reference to her dead husband, that’s all Latifah. I lost my mother a month before we went into prep on this movie, and so I was reeling from that loss. She said, ‘You know, when you lose somebody, you talk to them. They stay with you.’ And so we talked about it. We picked moments in the film when Brenda would say something to her husband. That’s how those moments came alive. That’s all from the actor having a thought about the spirit of the character.\n\nAD: The film rises on those moments of that core family group. How did you work with those four actors to build that incredible chemistry that really comes across on screen?\n\nMS: The chemistry actually was there naturally. It’s interesting. Queen Latifah actually recommended Ludacris for the role of Reggie. After the first time I talked to him, I was like he’s Reggie. He’s not really Reggie in real life, but when we were talking about it, he understood Reggie. The next person that we cast was Mikayla, who plays the daughter, and she just stood out amongst everybody. She’s a wonderful actress. I just actually got to work with her again on a couple of episodes of Truth Be Told for Apple. We did a lot of chemistry test reads with her and the potentials for the brother, and Shawn read and it was just immediately chemistry. You just saw brother and sister. They went at it. They were ad libbing, and they just went at it. It was just like another brother and sister. Then, we had a cast dinner a few nights before the first day of shooting. It was just those four characters, and we had a really lovely long dinner. We just were all talking about our lives and our dreams and kind of where we came from. They started to bond as a family, and the rest was just magic. They really felt like a real family. They had nicknames for each other and everything.\n\nAD: Last question for you: let’s say you have the keys to the kingdom. You’ve worked in television, you’ve worked in streaming, you’ve worked in film, and you’ve worked in music videos. You’ve done a little bit of everything. If there were no barriers and budget wasn’t a concern, then what would be your dream project?\n\nMS: I have a dream project right now I want to do. I want to do a limited series about Josephine Baker starring Ruth Negga. That’s what I want to do.\n\nEnd of the Road is now streaming exclusively on Netflix."}, {"url": "https://deadline.com/2021/02/ruth-negga-star-josephine-baker-limited-series-abc-signature-from-dee-harris-lawrence-lebron-james-springhill-1234693005/", "page_content": "EXCLUSIVE: The remarkable story of Josephine Baker, one of the most influential female entertainers of the 20th century, will be the subject of Josephine, a limited drama series in development at ABC Signature, with Ruth Negga attached to star as the legendary Jazz Age performer and civil rights activist.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nNegga also executive produces the project, which hails from David Makes Man showrunner Dee Harris-Lawrence, Emmy-nominated director Millicent Shelton (30 Rock), LeBron James and Maverick Carter’s The Springhill Company and ABC Signature. Josephine stems from The Springhill Company’s overall deal with ABC Signature.\n\nDee Harris-Lawrence\n\nWritten by Harris-Lawrence and to be directed by Shelton, Josephine is a raw and unflinching look at the force of nature that was Josephine Baker, the biggest Black female artist of her time. From international superstar and decorated WWII spy, to civil rights activist and flawed mother, Josephine delves into the raw talent, sexual fluidity, struggles and bold life of an icon.\n\nNegga, Harris-Lawrence and Shelton executive produce with The Springhill Company.\n\nBorn in Missouri in 1906, Baker started her career at 15 when she appeared onstage in several New York shows. At 19, she moved to France, which would become her adopted home country.\n\nCourtesy photo\n\nThere, she almost immediately found success as one of Europe’s most popular and highest-paid performers. Early on, she was renowned as a dancer, and was among the most celebrated performers to headline the revues of the Folies Bergère in Paris. She won admiration of cultural figures such as Pablo Picasso, Ernest Hemingway and E.E. Cummings, earning herself nicknames like “Black Venus” and “Black Pearl.” Baker sang professionally for the first time in 1930, and several years later landed film roles as a singer in Zou-Zou and Princesse Tam-Tam.\n\nBaker worked for the French Resistance during World War II, and during the 1950s and ’60s devoted herself to fighting segregation and racism in the United States. Baker refused to perform for segregated audiences in the U.S. and had an active role in the civil rights movement. She was a speaker at the 1963 March on Washington, and in 1968, she was offered unofficial leadership in the movement in the U.S. by Coretta Scott King, following Martin Luther King Jr.’s assassination, but declined the offer out of concern for the welfare of her children. Just two years after making a comeback to the stage, Baker died of a cerebral hemorrhage on April 12, 1975, and was buried with military honors.\n\nDecades later, Baker’s life and work continues to influence top entertainment figures such as Beyoncé, who has portrayed her on various occasions. Baker also was portrayed by Diana Ross on Broadway and television in An Evening with Diana Ross, by Karine Plantadit in the biopic Frida and by Cush Jumbo in her debut play Josephine and I. In HBO’s 1991 biopic, The Josephine Baker Story, Baker was played by Lynn Whitfield, who won an Emmy Award for Outstanding Lead Actress in a Miniseries or a Special, becoming the first Black actress to win the category.\n\nBaker was recently discovered by a new generation through HBO’s very influential 2020 series Lovecraft Country, which featured the American-born French entertainer, played by Carra Patterson. Also last year, Studiocanal, CPB Films and Leyland Films announced that they are developing an English-language drama series about Baker.\n\nNegga, best known for her starring roles in the film Loving and the AMC series Preacher, is repped by ICM Partners, Principal Entertainment and Markham Froggat and Irwin.\n\nFor Harris-Lawrence, Josephine falls outside of the big overall deal she recently signed with Warner Bros. TV, where she serves an exec producer/co-showrunner on All Rise and exec producer/showrunner on David Makes Man. Prior to that, she was co-executive producer on Unsolved: The Murders of Tupac and the Notorious B.I.G., Shots Fired and Star as well as Zoo, the ABC Signature-produced Detroit 1-8-7 and Saving Grace. She is repped by Rain Management Group and Gordon M. Bobb at Del Shaw Moonves.\n\nShelton, who has played a key role in putting Josephine together, landed an Emmy nomination for 30 Rock, becoming the first African-American woman to be nominated in the directing for a comedy series category. The prolific music video and TV helmer has been one of ABC Signature’s go-to directors for Black-ish. She has also directed episodes of P-Valley, Insecure, The Walking Dead, Titans and the Starz comedy pilot Run the World, which was picked up to series. Shelton’s has TV directing work has earned her 10 NAACP Image Award nominations and three wins. She recently signed on to direct Netflix’s feature thriller End of the Road starring Queen Latifah. Shelton is repped by ICM Partners, Rain Management Group and Del Shaw Moonves."}]}