{"Millicent Shelton directed Jumping the Broom.": [{"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.nytimes.com/2022/02/26/style/jumping-the-broom-wedding-tradition.html", "page_content": "The tradition of jumping the broom at weddings has a long history that encompasses different cultures and continents.\n\nBut it has “always been a practice, from its inception, used by people who are ostracized and oppressed by the broader nation, state or kingdom,” said Tyler D. Parry, an assistant professor of African American and African diaspora studies at the University of Nevada, Las Vegas.\n\nDr. Parry, the author of “Jumping the Broom: The Surprising Multicultural Origins of a Black Wedding Ritual,” traced the tradition back to at least the 18th century, when it was largely practiced by marginalized populations in Europe, he said, “such as traveling communities like the British Romani, rural Welsh communities, Irish individuals and various other people who lived on the margins of the British Isles.”\n\nAs Europeans who had jumped over brooms at their weddings came to the United States, so too did the ritual. It was soon adopted by another marginalized population: enslaved people in the American South. “While broomsticks were used in some West African ceremonies,” Dr. Parry said the earliest documented examples of people of African descent jumping over a broom in the U.S. are from the 1800s."}, {"url": "https://www.brides.com/jumping-the-broom-5071336", "page_content": "Many cultures have traditions that are integrated into wedding ceremonies as a way to pass down customs throughout generations. For the Black community, jumping the broom is one that is steep in decades of history. As many Black couples may already know, in contemporary nuptials, jumping the broom happens after exchanging vows and saying “I do.\" According to wedding planner Nicole Harris of Dreams in Details, the officiant will either provide a prayer, poem, or a brief explanation of the meaning of the tradition, and the broom will be placed on the ground for the newlyweds to jump over it. Anyone can place the broom on the ground, as there is no traditional person who bears this role, but a couple may choose a significant person to take on this responsibility.\n\nWhile jumping the broom has become a familiar practice within many Black nuptials, the origins of the tradition are often unknown. That's why we consulted with Harris to help explain the rich history and meaning of jumping the broom, and why this custom has become an important wedding day practice within the Black community today.\n\n\n\nMeet the Expert Nicole Harris is the owner and creative director of Dreams in Details based in Los Angeles. She plans luxury events and weddings, several of which have involved couples jumping the broom.\n\nThe History of Jumping the Broom\n\nThe history of jumping the broom is a bit complex, with several conflicting accounts about the origin of the ritual. Some argue that it originated in West Africa, as brooms were used as a way to ward off evil spirits. Specifically, family members or members of the community would wave a broom over the couple's head, and then place it on the ground for the couple to jump over it. It's even said that a good-natured joke was whoever jumped the broom the highest was designated as the household decision-maker.\n\nAlternatively, others claim that it originated in Wales. In Wales, Roma people’s marriages were not recognized by the church, so they would have “Besom Weddings,” referring to a type of broom. At these weddings, couples would jump over the broom without touching it to get married; and to annul the marriage, couples would jump over the broom backward as a way to end their partnership. Some accounts even note that brooms were placed as a hurdle for couples to jump over separately, and if the broom fell—or if either party did not make it over the broom—the union was considered \"not meant to be\" and the wedding was canceled.\n\nAs it pertains to jumping the broom within the African American community, brooms were used during slavery in the United States as a way for enslaved people to get married since they could not legally wed in the country. However, it's important to note that there are two accounts for this origin. It's generally reported that people who were enslaved decided to jump the broom themselves since brooms were typically available. On the contrary, others argue that enslavers would force enslaved people to get married in this manner. Once slavery ended, though, some Black people decided that they would continue to jump the broom if an officiate was not readily available, and make their marriage legal at a later date. This was due to the fact that formerly enslaved people did not feel the need to get legally married and believed jumping the broom years prior was valid enough.\n\nLastly, in regards to the non-secular significance of this tradition, within Christian ceremonies, the broom handle represents God, the straw bristles signify the couple’s families, and a ribbon around the broom symbolizes the ties that bind the couple. In Pagan ceremonies, it is said that the broom handle represents the male phallus and the bristles represent female energy.\n\n\n\nModern-Day Practices and Meanings\n\nA resurgence of jumping the broom occurred after it was featured in Alex Haley’s novel about slavery, Roots: The Saga of an American Family, in 1976, and in the television mini-series in 1977. While there are different feelings about the tradition, today, many Black people incorporate jumping the broom into their ceremony. “When African Americans incorporate jumping the broom, it is to pay homage to their culture and legacy,” says Harris. “It is a tradition of the ancestors of African Americans and they want to keep it going because ‘jumping the broom’ is a major part of their heritage. They also decide to jump the broom to bless the marriage.”\n\nWhat's more, the broom can be a family heirloom that is passed down through generations, allowing for an even more personal touch to a wedding ceremony. And while the broom is not the typical household tool that you have in your home (it is usually three feet long and has a wooden handle with natural bristles), according to Harris, most brides customize their brooms. The broom typically has silk ribbons, flowers, intricate beading, or lace, and several online retailers, like Etsy, even sell pre-made or customizable pieces for couples. It's also a popular practice to have guests write their names on decorative paper to attach to the broom before being used in the ceremony. This symbolizes the guests and their well-wishes for the couple entering a marriage.\n\nNonetheless, even though the tradition comes from a robust history, there are various reasons why couples may decide not to jump the broom. Some people believe that it's archaic and don't like its ties to slavery, while others simply don't want to jump the broom at their ceremony. Ultimately, it's a personal choice.\n\n"}, {"url": "https://medium.com/authority-magazine/millicent-shelton-5-things-i-wish-someone-told-me-when-i-first-became-a-filmmaker-894dd50dc40a", "page_content": "Thank you so much for joining us in this interview series! Our readers would love to get to know you a bit better. Can you tell us a bit of the ‘backstory’ of how you grew up?\n\nI grew up in St. Louis way out in the suburbs. I went to college at Princeton university in new jersey and every weekend I’d ride the train to New York City to hang out. It only made sense for me to move to new york after graduation and eventually earn my master's in film from NYU while directing music videos to pay the bills.\n\nCan you share a story with us about what brought you to this specific career path?\n\nI had to decide what I was going to major in at Princeton. I grew up believing that I wanted to be a lawyer but after interning for a summer at a law firm, I knew that was not the job for me. My mother told me to select a field that I loved but I had no clue what that was. It took me a while to do some soul searching. I remembered that I enjoyed creative writing. I took a summer course at NYU to explore what it was like to create a short film from a writer’s perspective and ended up loving being a director. By the end of the summer, i knew that there was no other job but directing for me.\n\nCan you share the funniest or most interesting story that occurred to you in the course of your filmmaking career?\n\nOne of my craziest experiences on set came during the filming of “end of the road.” I had just called cut on a scene with beau bridges outside of our motel location and we started to set up for the next scene when suddenly the blue sky turned brown, and we were hit with high winds mixed with sand so thick that you couldn’t see 3 feet in front of you. It’s called a ‘haboob’ which is a crazy intense dust storm. It lasted for 45 minutes then suddenly stopped and the most breathtaking sunset appeared. We filmed the SUV driving up to the motel in that light.\n\nWho are some of the most interesting people you have interacted with? What was that like? Do you have any stories?\n\nI have worked with so many brilliantly talented people. It was a dream of a lifetime to work with Al Pacino on “Hunters’. Every time I search for a visual film reference, one of his films appears! He’s been in so many iconic movies, its mind-blowing. He was a truly lovely actor who was collaborative and giving. There was a moment the first day that we worked together that I thought maybe I shouldn’t give Al Pacino a note, but that’s my job as a director. I gave him notes but I made sure that they were smart notes that I could back up and notes that would further enhance the magic that he naturally creates. He gave me a big hug on his last day and said, “I’d like to work with you again, kid.” I liked that he called me kid. It would be a blessing to work with Al again.\n\nNone of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are? Can you share a story about that?\n\nMy favorite professor at NYU was Nick Tanis. He taught me how to transform my daydreams into filmable images. Paris Barclay has been my mentor for years. I shadowed him off and on for 3 years trying to get my first break as a director in episodic television. On the first episode that I was hired on, Paris promised the producers that he would guide me through it and be there if I froze up then privately he told me that I could handle the job on my own which I did. Until covid, I was having an annual breakfast with David Nutter who is also a mentor to me. He was instrumental in helping me to move into action television and was a sounding board for me during my first pilot. There are countless other people that have helped me, but it would take up pages and pages! I am a driven person but have had lots of help along the way.\n\nCan you please give us your favorite “life lesson quote”? Can you share how that was relevant to you in your life?\n\n‘Never give up’ is my favorite quote. I started directing during a time when women and especially women of color were not welcomed with open arms as Hollywood television directors. There were lots of doors that were not open. I wanted to give up a lot, but that quote would ring through my head. My testimony is that I am here today because I had blind faith and perseverance and did not give up on my dream.\n\nI am very interested in diversity in the entertainment industry. Can you share three reasons with our readers about why you think it’s important to have diversity represented in film and television? How can that potentially affect our culture?\n\nI wholeheartedly believe in diversity. To me, diversity is a little bit of everyone, inclusive of all races, gender, and LGBTIQQ+. It’s important because cinema should be reflective of real life and our world is diverse. The more we have diverse voices behind the screen, the more our stories will ring true and have realistic characters, dialogue, and actions. The more that we explore diverse stories, the more that we realize that despite our ethnic or socio-economic differences, we are all very much the same. Family is family. Fear is fear. Love is love.\n\nWhat are some of the most interesting or exciting projects you are working on now?\n\nBeing able to shepherd ‘end of the road’ has been a wonderful experience that I am very proud of. It was great to collaborate with queen Latifah again. We worked together to create a black family with a female matriarch who is a smart, strong, mama bear willing to do whatever is necessary to protect her family. After this, I am in development on a Josephine Baker limited series with Ruth Negga attached in the leading role. I am super excited about that. We’re looking to delve deeper into Josephine than ever before. I can’t wait to see what ruth does with this part. She’s amazing!\n\nWhich aspect of your work makes you most proud? Can you explain or give a story?\n\nI am most proud of my ability to collaborate with actors. They are the conduit for the soul of the characters and I respect their position. I love hearing their point of view and then working to make sure that the feeling that they desire to convey is truly coming through. Both queen Latifah and Chris ‘Ludacris’ bridges were laser-focused on representing their characters in their truest light. They trusted me to give them feedback in order to make their performances stronger. Another actor that I’ve worked with is Forest Whitaker. He is the king of nuanced performances. When I worked with him on ‘empire’, I noticed that he would subtly change his performance with each take. We’d discuss it after each take and then land on the read that we both felt sold the story and character best.\n\nOk super. Here is the main question of our interview. What are your “5 things I wish someone told me when I first started” and why? Please share a story or example for each.\n\nGet sleep because production will seep into your dreams, and you will never have a sound sleep again. Trust your gut because you must stand up or fall down based on your own thoughts not because someone told you to do it. Be fearless. A healthy amount of fear is normal but don’t be too scared that it limits your ability to dream outside of the box. Listen to everyone. This doesn’t mean doing everything that everyone suggests but be smart enough and open enough to hear thoughts that may lead you to something great. Learn to say ‘no.’ it’s actually a secret power.\n\nWhen you create a film, which stakeholders have the greatest impact on the artistic and cinematic choices you make? Is it the viewers, the critics, the financiers, or your own personal artistic vision? Can you share a story with us or give an example of what you mean?\n\nWhen I create, I can’t think about what critics will say or it would make my mind spin. I read the material, daydream about it, and try to stay true to it. My goal is to take the 2-dimensional words off the page and breathe life into their 3-dimensional existence with the help of actors and amazing crew members. I like to say that as a director, ‘i service script.’\n\nYou are a person of great influence. If you could start a movement that would bring the most amount of good to the most amount of people, what would that be? You never know what your idea can trigger. :-)\n\nMy movement would be for equality and parity for all. In particular, a woman’s right to choose how she uses her body.\n\nWe are very blessed that some of the biggest names in business, vc funding, sports, and entertainment read this column. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this. :-)\n\nI would like to sit down and have a quiet lunch with president Barrack Obama. I can’t imagine the stories he has to share but I know they are deep.\n\nHow can our readers further follow you online?\n\nThey can follow me on instagram at @shelton9mil. I try to keep it updated!\n\nThis was very meaningful, thank you so much! We wish you continued success!"}, {"url": "https://undeadwalking.com/2019/03/17/director-millicent-shelton-breaks-walking-dead-scars/", "page_content": "LOS ANGELES, CA - MARCH 04: Director Millicent Shelton accepts the award for Outstanding Directing in a Dramatic Series for \"Men of A Certain Age\" onstage at the 42nd NAACP Image Awards held at The Shrine Auditorium on March 4, 2011 in Los Angeles, California. (Photo by Kevin Winter/Getty Images for NAACP Image Awards)\n\nDirector Millicent Shelton steered the ship on one of the most powerful episodes of The Walking Dead ever. We had a chance to break down “Scars” with her.\n\nTake one look at Millicent Shelton’s profile on IMDB and you’ll see that she has directed episodes of many of the top shows on television. From Empire to Manifest, 9-1-1 to The Flash and so many more, Shelton is already a legendary television director and a powerful woman in Hollywood. She’s also a fan of The Walking Dead, and she’ll be forever known as the director who brought “Scars” to life.\n\nWe had a chance to speak with Millicent Shelton about her experience directing “Scars” and she shared some keen insight into her process in crafting the episode, along with the great lengths that production took to prepare everyone for such challenging scenes.\n\n(Sarabeth Pollock): What went through your head when you read the script for “Scars?”\n\n(Millicent Shelton): Well, I’ve seen all of the episodes leading up to season 9, and then I read the scripts for the episodes leading up to mine. But as you can see mine doesn’t really have lots to do with the Whisperers. I had to read it a couple of times to really see how it moved through times. I like working on tough episodes and this was a tough episode. I really liked having this challenge.\n\nOne of the questions I’ve heard around the fandom is why this episode came at this point in the season. From a narrative perspective, do you think it had to come now, rather than sooner in the season?\n\nMy guess is that the whole arc of the Whisperers had to be established in order to make it payoff at the end [of “Scars”]. To jump in during the middle of that might have jeopardized what was going on with the bigger arc of the season. This is giving the history of why the walls are up, and why Michonne is so guarded and why the scars are there. When you see someone has a scar you don’t usually talk to them about it and you don’t know the effect of it. That’s what this episode is about, the physical and emotional scars ever since Jocelyn came back into her life.\n\nHaving an actress like Rutina Wesley in this episode was so key, because the former True Blood star plays straight so well and doesn’t reveal a lot of emotion, so for Michonne to be so excited to see her and then have her betray her was so powerful.\n\nFor us, it was really important that they came across as old friends. It’s like you grow up with someone and go off to different colleges and move to different cities and then you see each other and pick things right where you left off, like time hasn’t passed. When you see that scene in the kitchen you see that, and there’s no indication that something is going to happen. It’s authentic. So when the turn does happen you’re just shocked and heartbroken.\n\nShelton continued by talking about how the authenticity of Michonne’s friendship with Jocelyn played heavily into the scene where they were being branded.\n\nFor me, the most powerful thing was to be in the room with them when she was getting branded. When Michonne was getting branded Danai leaned into it. The camera operator was actually standing right next to Ru and Danai leaned so far forward that [Rutina] took a step back. She wasn’t supposed to be in the shot but he got that profile show of Danai screaming in her face, and it was so powerful. I just let it go. You could see the energy in the room. Ru just took it all, and then after I said cut she was just a wreck because all of that energy went right into her body.\n\nThat scene, I said to Danai, was my homage to Scarface. That scene when he’s being cut with the chainsaw. And even in Scarface you don’t see that he’s being cut into pieces because it’s all in his face. The horror of the moment plays on Michonne’s face and that was just the most amazing moment being in the room for that.\n\nPeople will be talking about the powerful emotions in this episode, and you had to do it all with so many children around. Are they aware of how big the scene is? How did you make it all happen?\n\nWe were really conscious of [what was happening in this episode] and wanted to make sure we did no damage to these young actors. In the casting process the parents we made aware of what this episode was about. Once they were cast, each one of them had to sit down with a psychologist individually to go through the scenes and the script to make sure they understood that these stories aren’t real.\n\nBefore we shot we had a meeting in a conference room with the parents, the kids, the AD, myself and the actors and producers and we talked them through every single thing. All of the choreography was discussed with the stunt coordinator. Everybody knew everything so that when we were on set there were no concerns or issues.\n\nWhen we were on set they were all comfortable, we had rubber knives and they knew the stunts so it was fine.\n\nWhat was it like having so many kids on set?\n\nThat was crazy. Matthew Goodwin is an amazing AD and he scheduled all of it. There were lots of body doubles.\n\n“Scars” is really an amazing episode because it’s gory but you don’t see it. So much of what happens is implied but you don’t actually see a lot of actual gore, which really serves to highlight things like the blood on Michonne’s stomach. It’s such a masterfully crafted episode.\n\nThank you! It was always written to be the juxtaposition between the kids and the walkers. I augmented it a bit when we were storyboarding, but I do think it was smart that that was the way to show it. One of my main concerns was that Michonne is not a monster and she wasn’t just just killing kids. She had no choice. She did it to save her daughter and to save her unborn child and to save herself. We had to make sure that the kids were totally feral, and that they were no going to give up so she had no choice. Danai kept saying “please stop, please stop” but on set we kept telling the kids not to stop. And we wanted to make sure the audience saw that she had no choice and she was definitely not enjoying this.\n\nIt’s interesting, too, because Daryl had no part in killing the children. He came into it seeing the aftermath.\n\nRight. The episode is called “Scars” but it’s not just about the physical scars. It’s about the emotional scars. Even though Daryl didn’t have to physically do anything to the kids, he was scarred emotionally.\n\nNegan revealed to Michonne that he has told Judith everything he did, including killing Glenn and Abraham. Knowing that Michonne has been keeping secrets from Judith to protect her, was this scene something that had to happen to trigger Michonne and show her that Judith might be able to look past whatever she’s hiding?\n\nYeah, and it also shows that a wound is still a wound. That psychological wound is still there. There’s a moment at the end of the scene where Negan looks at Michonne and goes “Oh, you don’t know where your daughter is” and that opens the wound right there. She’s good at covering her pain up but he sees right through it. And you can see it in her eyes, you know she’s in pain.\n\nDo you think it was important for the story that it was her worst enemy who managed to see right through her?\n\nYes. And he’s the one who’s behind bars but she’s the one who is trapped.\n\nYou’re going to go down as the director who worked with two Judiths in this episode, which was huge story for Cailey Fleming’s Judith because up until now we’ve only ever seen her as a total badass. We see her vulnerability for the first time.\n\nShe’s an amazing young actor, I have to say. And when we see her on that rock when she’s talking about when they stopped caring about Carol, there were so many tender moments. When she’s on the lake with Daryl, and he’s imitating how she’s sitting. She’s just so amazing, I mean, she went toe to toe with Danai. She’s just a very advanced actress for her age.\n\nI talked to her like I talk to the other actors. I don’t talk down to kids, so we just talked about what was going on with the scene and she was just so good.\n\nFrom a technical standpoint there were so many moving pieces to this episode. Most shows don’t deal with multiple realities or timelines. You’ve directed an episode of The Flash with multiple universes, and now this episode of The Walking Dead has different timelines. Can you talk about the challenge of moving between timelines?\n\nThe hair and makeup and wardrobe were important, and again Assistant Director Matthew Goodwin was so helpful in dealing with the timelines. The biggest thing that I wanted to focus on was that the transitions between timelines were clear, so no one would be sitting there wondering what was happening. I wanted it to be clear.\n\nWhen we jump around, back and forth, we use something to show the change in time. I tried to ground people in something that was familiar.\n\nOne of the biggest tells was Michonne’s pregnancy. What was it like for her to be so pregnant on set?\n\nI know that thing was heavy! There was a fake belly when she was smaller, like one of those pillow things. But when she had to be cut Greg Nicotero had to build her something and it had the texture of chicken cutlets, like a really soft fabric. It went over her head and arms like a glove, so that you could see her skin because it was a pregnancy belly.\n\nThis is going to go down as one of the most powerful episodes of The Walking Dead ever.\n\nThis is a character study of Michonne. She has been one of the strongest characters on television that I’ve seen. She’s always been impenetrable but this episode does show her psychological wounds and being able to be broken like we’ve never seen before. It gives us great insight into her character, and I think it’s a very positive thing.\n\nIt was such a pleasure to talk with Millicent Shelton about her episode of The Walking Dead. You’ll be able to see her work again soon soon on the hit FOX show 9-1-1, where she directed an upcoming episode titled “Fight or Flight.”"}, {"url": "https://www.flickeringmyth.com/2022/09/movie-review-end-of-the-road-2022/", "page_content": "End of the Road, 2022.\n\nDirected by Millicent Shelton.\n\nStarring Queen Latifah, Chris Bridges, Beau Bridges, Mychala Lee, Keith Jardine, Jesse Luken, Frances Lee McCain, Tabatha Shaun, Aaron Valentine, Shaun Dixon, Efrain Villa, and Amie MacKenzie.\n\nSYNOPSIS:\n\nRecently widowed mom Brenda fights to protect her family during a harrowing road trip when a murder and a missing bag of cash plunge them into danger.\n\nThere is a point in director Millicent Shelton’s (who has mostly worked on TV shows up until this point) End of the Road where teenage daughter Kelly (Mychala Lee) remarks to her uncle Reggie (musician Ludacris, only credited as Chris Bridges here) that lately, it feels like life is relentlessly taking turns for worse. She’s not wrong; screenwriter David Loughery (with Christopher J. Moore attached to the original version of this script) seems determined to toss as many obstacles as humanly possible into the path of the Freeman family, whether the story makes sense or not.\n\nEnd of the Road might have worked if its tone was less serious and more willing to embrace the plot’s absurdities from the beginning. This is an action-thriller (and sometimes a comedy, although possibly not by design) that eventually jumps more sharks than Evil Knievel, which is fine, except the journey there is far too fixated on clunky dramatic dialogue involving a distant family grieving the loss of their father/brother-in-law from cancer, attempting to start a new life moving to Arizona.\n\nBrenda (Queen Latifah in what starts as her second dramatic role of the year, having recently impressed alongside Adam Sandler in Hustle, before spinning into family protector action heroics) is now in debt after spending a fortune on her now deceased husband’s chemotherapy. She is taking her two children and screwup brother to Arizona, although the drive has plenty of chaotic surprises in store.\n\nThrough a chain of convenient events (to the point of insultingly stupid writing), the Freeman family finds themselves caught in the middle of a drug lord and his botched attempt at recovering hefty cash. Gunshots erupt in the motel room adjacent to theirs, where Brenda (who just so happens to be a nurse) tries to keep the man alive (unaware that he is a thief) even though he has been shot in the neck. It’s a noble effort but to no avail.\n\nIt also turns out that Reggie found the stolen money that the killer didn’t have time to search for and took it upon himself to snatch it and place it in the back of the family vehicle. Brenda has her ways of figuring out that Reggie is being secretive and not telling her something, eventually finding out about the money and justifiably becoming freaked out considering a man just called (using a distorted manipulated voice) threatening her family if she doesn’t return the money. There’s also an Arizona state trooper (Beau Bridges) trying to chase the family down to protect them, aware that this drove this career criminal will stop at nothing to harm them.\n\nThe characters here are astonishingly dumb, and that’s putting it nicely. After a back-and-forth argument about whether or not they should return the money or take their chances defending themselves. Brenda wins the debate and chooses to leave the money in a different motel, subsequently dialing the phone number and explaining where the money is sitting. Naturally, this is not good enough for the drug kingpin as the family can still identify his voice from the murder. Bafflingly, they decide to visit a western-themed amusement park during this, where shit really hits the fan as Brenda’s youngest son Cam (Shaun Dixon) is kidnapped.\n\nAfter some more stilted dialogue, a rescue plan is put into motion as the family also looks to work with the Arizona state troopers. Along the way, Brenda encounters many proud racists (there’s an arc here that she needs to stand up for herself against this horrific white supremacy, which does come to fruition with thematic juxtaposition), at one point beating the crap out of several white supremacists using anything in her vicinity as a weapon (including firing a shotgun).\n\nWhen End of the Road gives up trying to be a mushy drama about loss, a dysfunctional family trying to reconnect, and the ethics of taking this blood money to start a new life, it swerves into a much-needed dose of demented insanity that is more fitting alongside the narrative’s ridiculousness and predictability. There are still several blindingly moronic character decisions and an abandonment of all logic (Ludacris can’t kick down a door, but someone else I won’t spoil hilariously can), but some trashy and bonkers joy within.\n\nQueen Latifah going out on a vengeful, defensive rampage and murdering racists to save her family is quality entertainment and Chris “Ludacris” Bridges getting into a knife fight with a psychotic elderly woman is fun. Unfortunately, it takes until the end of the road to get on the movie’s wavelength.\n\nFlickering Myth Rating – Film: ★ ★ / Movie: ★ ★\n\nRobert Kojder is a member of the Chicago Film Critics Association and the Critics Choice Association. He is also the Flickering Myth Reviews Editor. Check here for new reviews, follow my Twitter or Letterboxd, or email me at MetalGearSolid719@gmail.com8"}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.nytimes.com/2022/02/26/style/jumping-the-broom-wedding-tradition.html", "page_content": "The tradition of jumping the broom at weddings has a long history that encompasses different cultures and continents.\n\nBut it has “always been a practice, from its inception, used by people who are ostracized and oppressed by the broader nation, state or kingdom,” said Tyler D. Parry, an assistant professor of African American and African diaspora studies at the University of Nevada, Las Vegas.\n\nDr. Parry, the author of “Jumping the Broom: The Surprising Multicultural Origins of a Black Wedding Ritual,” traced the tradition back to at least the 18th century, when it was largely practiced by marginalized populations in Europe, he said, “such as traveling communities like the British Romani, rural Welsh communities, Irish individuals and various other people who lived on the margins of the British Isles.”\n\nAs Europeans who had jumped over brooms at their weddings came to the United States, so too did the ritual. It was soon adopted by another marginalized population: enslaved people in the American South. “While broomsticks were used in some West African ceremonies,” Dr. Parry said the earliest documented examples of people of African descent jumping over a broom in the U.S. are from the 1800s."}], "Millicent Shelton directed The Perfect Guy.": [{"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://www.starz.com/us/en/browse/artist/millicent-shelton/57423", "page_content": "Watch Millicent Shelton TV shows on STARZ\n\nBrowse and watch Millicent Shelton's TV shows on STARZ, including Run The World\n\nClaim Special Offer"}, {"url": "https://medium.com/authority-magazine/millicent-shelton-5-things-i-wish-someone-told-me-when-i-first-became-a-filmmaker-894dd50dc40a", "page_content": "Thank you so much for joining us in this interview series! Our readers would love to get to know you a bit better. Can you tell us a bit of the ‘backstory’ of how you grew up?\n\nI grew up in St. Louis way out in the suburbs. I went to college at Princeton university in new jersey and every weekend I’d ride the train to New York City to hang out. It only made sense for me to move to new york after graduation and eventually earn my master's in film from NYU while directing music videos to pay the bills.\n\nCan you share a story with us about what brought you to this specific career path?\n\nI had to decide what I was going to major in at Princeton. I grew up believing that I wanted to be a lawyer but after interning for a summer at a law firm, I knew that was not the job for me. My mother told me to select a field that I loved but I had no clue what that was. It took me a while to do some soul searching. I remembered that I enjoyed creative writing. I took a summer course at NYU to explore what it was like to create a short film from a writer’s perspective and ended up loving being a director. By the end of the summer, i knew that there was no other job but directing for me.\n\nCan you share the funniest or most interesting story that occurred to you in the course of your filmmaking career?\n\nOne of my craziest experiences on set came during the filming of “end of the road.” I had just called cut on a scene with beau bridges outside of our motel location and we started to set up for the next scene when suddenly the blue sky turned brown, and we were hit with high winds mixed with sand so thick that you couldn’t see 3 feet in front of you. It’s called a ‘haboob’ which is a crazy intense dust storm. It lasted for 45 minutes then suddenly stopped and the most breathtaking sunset appeared. We filmed the SUV driving up to the motel in that light.\n\nWho are some of the most interesting people you have interacted with? What was that like? Do you have any stories?\n\nI have worked with so many brilliantly talented people. It was a dream of a lifetime to work with Al Pacino on “Hunters’. Every time I search for a visual film reference, one of his films appears! He’s been in so many iconic movies, its mind-blowing. He was a truly lovely actor who was collaborative and giving. There was a moment the first day that we worked together that I thought maybe I shouldn’t give Al Pacino a note, but that’s my job as a director. I gave him notes but I made sure that they were smart notes that I could back up and notes that would further enhance the magic that he naturally creates. He gave me a big hug on his last day and said, “I’d like to work with you again, kid.” I liked that he called me kid. It would be a blessing to work with Al again.\n\nNone of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are? Can you share a story about that?\n\nMy favorite professor at NYU was Nick Tanis. He taught me how to transform my daydreams into filmable images. Paris Barclay has been my mentor for years. I shadowed him off and on for 3 years trying to get my first break as a director in episodic television. On the first episode that I was hired on, Paris promised the producers that he would guide me through it and be there if I froze up then privately he told me that I could handle the job on my own which I did. Until covid, I was having an annual breakfast with David Nutter who is also a mentor to me. He was instrumental in helping me to move into action television and was a sounding board for me during my first pilot. There are countless other people that have helped me, but it would take up pages and pages! I am a driven person but have had lots of help along the way.\n\nCan you please give us your favorite “life lesson quote”? Can you share how that was relevant to you in your life?\n\n‘Never give up’ is my favorite quote. I started directing during a time when women and especially women of color were not welcomed with open arms as Hollywood television directors. There were lots of doors that were not open. I wanted to give up a lot, but that quote would ring through my head. My testimony is that I am here today because I had blind faith and perseverance and did not give up on my dream.\n\nI am very interested in diversity in the entertainment industry. Can you share three reasons with our readers about why you think it’s important to have diversity represented in film and television? How can that potentially affect our culture?\n\nI wholeheartedly believe in diversity. To me, diversity is a little bit of everyone, inclusive of all races, gender, and LGBTIQQ+. It’s important because cinema should be reflective of real life and our world is diverse. The more we have diverse voices behind the screen, the more our stories will ring true and have realistic characters, dialogue, and actions. The more that we explore diverse stories, the more that we realize that despite our ethnic or socio-economic differences, we are all very much the same. Family is family. Fear is fear. Love is love.\n\nWhat are some of the most interesting or exciting projects you are working on now?\n\nBeing able to shepherd ‘end of the road’ has been a wonderful experience that I am very proud of. It was great to collaborate with queen Latifah again. We worked together to create a black family with a female matriarch who is a smart, strong, mama bear willing to do whatever is necessary to protect her family. After this, I am in development on a Josephine Baker limited series with Ruth Negga attached in the leading role. I am super excited about that. We’re looking to delve deeper into Josephine than ever before. I can’t wait to see what ruth does with this part. She’s amazing!\n\nWhich aspect of your work makes you most proud? Can you explain or give a story?\n\nI am most proud of my ability to collaborate with actors. They are the conduit for the soul of the characters and I respect their position. I love hearing their point of view and then working to make sure that the feeling that they desire to convey is truly coming through. Both queen Latifah and Chris ‘Ludacris’ bridges were laser-focused on representing their characters in their truest light. They trusted me to give them feedback in order to make their performances stronger. Another actor that I’ve worked with is Forest Whitaker. He is the king of nuanced performances. When I worked with him on ‘empire’, I noticed that he would subtly change his performance with each take. We’d discuss it after each take and then land on the read that we both felt sold the story and character best.\n\nOk super. Here is the main question of our interview. What are your “5 things I wish someone told me when I first started” and why? Please share a story or example for each.\n\nGet sleep because production will seep into your dreams, and you will never have a sound sleep again. Trust your gut because you must stand up or fall down based on your own thoughts not because someone told you to do it. Be fearless. A healthy amount of fear is normal but don’t be too scared that it limits your ability to dream outside of the box. Listen to everyone. This doesn’t mean doing everything that everyone suggests but be smart enough and open enough to hear thoughts that may lead you to something great. Learn to say ‘no.’ it’s actually a secret power.\n\nWhen you create a film, which stakeholders have the greatest impact on the artistic and cinematic choices you make? Is it the viewers, the critics, the financiers, or your own personal artistic vision? Can you share a story with us or give an example of what you mean?\n\nWhen I create, I can’t think about what critics will say or it would make my mind spin. I read the material, daydream about it, and try to stay true to it. My goal is to take the 2-dimensional words off the page and breathe life into their 3-dimensional existence with the help of actors and amazing crew members. I like to say that as a director, ‘i service script.’\n\nYou are a person of great influence. If you could start a movement that would bring the most amount of good to the most amount of people, what would that be? You never know what your idea can trigger. :-)\n\nMy movement would be for equality and parity for all. In particular, a woman’s right to choose how she uses her body.\n\nWe are very blessed that some of the biggest names in business, vc funding, sports, and entertainment read this column. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this. :-)\n\nI would like to sit down and have a quiet lunch with president Barrack Obama. I can’t imagine the stories he has to share but I know they are deep.\n\nHow can our readers further follow you online?\n\nThey can follow me on instagram at @shelton9mil. I try to keep it updated!\n\nThis was very meaningful, thank you so much! We wish you continued success!"}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}, {"url": "https://ew.com/article/2013/12/01/dallas-larry-hagmans-j-r-death-final-scene/", "page_content": "On March 4, 2013, Dallas fans once again found themselves asking, “Who shot J.R.?” But this time, they knew he wouldn’t survive. How did exec producers Cynthia Cidre and Michael R. Robin orchestrate J.R. Ewing’s final scene without their beloved star, the late Larry Hagman? How did they decide to alter the show’s iconic theme song for the following episode to honor both the character and the actor? They revealed all to EW.com last winter. Revisit the conversation below.\n\nClick here for more of EW.com’s Best of 2013 coverage.\n\nENTERTAINMENT WEEKLY: What was the actual last scene that Larry Hagman shot?\n\nMichael R. Robin: The last scene that Larry shot was in the [courthouse] bathroom with John Ross [Josh Henderson] in show 5, an episode that Millicent Shelton directed. It’s funny, there was a little sort of extension of the scene from what ended up in the cut, where J.R. walks over and looks in the mirror and he’s having a conversation with Bum [Kevin Page]. In one of the takes, Millicent said “Cut!” and Larry was looking in the mirror and he just said (dreamily), “Larry, I love you.” [They laugh] And the whole crew just broke up. And that was it.\n\nCynthia Cidre: That was it.\n\nMR: That was the last moment on camera that was photographed of him. And it was a really stunning thing to go back and look at that moment. He was so full of life that day and fantastic. None of us had any sense of what was going to take place, you know, five days later.\n\nSo Larry was last on set for episode 5, but J.R. wasn’t shot until the end of episode 7. How did you pull off that final phone call with John Ross?\n\nMR: When Larry passed [in November 2012], we weren’t ready for that on a story-level. We had all these things set up through show 5, and show 6 was written, and show 7 was written for J.R. to be doing something else. So Cynthia said to the editors, “Okay, what scenes have been cut from something that Larry did photograph? And also, find for me all the different lines that he has said,” because we were thinking along the lines of what kind of phone calls could we create. So we got to the phone call where he’s being shot, and she had the list of the different things Larry’s said and basically reverse-engineered the other side of the scene to be able to get J.R. to answer in the way that we needed him to. We looked at the cut, and three of the lines that we had cobbled together were from the same scene from episode 4 earlier this year. And our editor, Adam Bluming, cut those lines in against the phone call with John Ross. And then interestingly enough, there was a take [in episode 4, when J.R. hears from Frank that John Ross is in bed with Pamela], where Larry put the phone down and just looked straight ahead and had this horrified look on his face. When Adam put those things together [with a new background behind J.R. and the sound of footsteps], all the sudden we had a scene where it looks like Larry was participating in this character’s demise. So we had that [scene] but it kinda felt like we just had a little tag on the end of the hour where J.R. just showed up, and we needed a whole story. So we tried the same thing again and created a three-beat story [for episode 7] with other footage that we had. We went back and reshot the other side of scenes, reverse engineering the dialogue that made sense plot-wise for the actors that we did have so they could move it along, and we tied it in to the dialogue that we did have of Larry.\n\nCC: A lot of reverse-engineering there.\n\nHow did you decide J.R. would be shot again, which is obviously a nice nod to the original series and the start of a new mystery? Did you consider other scenarios?\n\nCC: Let me walk you through two weeks of thinking in 30 seconds. How does J.R. die? Not an easy question to answer. I tend to be mathematical: So there’s an A solution and a B solution. The A solution was of natural causes that are later revealed to be unnatural, and it seemed that until it were revealed to be unnatural that the audience would be bored and it was not appropriate to the character. So then you go to unnatural causes, which could be anything from a helicopter exploding, a plane crash, drowning, being eaten by a shark, an endless list. And then you circle around after thinking about it for a week to you can’t get away from J.R. was shot. So you do an homage to it. You do it again, and then you try to do it one better: Hopefully by the time we reveal the mystery [see: EW’s recap of the season finale], you’ll go, “Oh, cool.” I’m telling you, it was really complicated to get to that place and to make people not say, “How can you shoot him again?”\n\nWas there resistance to the idea from the network?\n\nCC: No. I assumed there would be resistance, but once it was explained, they were like, “That’s the perfect solution.”\n\nEveryone I’ve talked to who’s seen these opening credits has teared up. Whose idea was it to change them for this episode?\n\nCC: It was Mike’s idea. He heard that and was like, “No! No! No! No! That is so wrong!”\n\nMR: What happened was, we were screening [the episode], and we went through the moment in the morgue when it’s yes, he’s dead, and then on came the big happy main title for Dallas, and it was like, “Okay, that has to change. We cannot do that this time.” So we called our composer, Rob Cairns, and I said, “This needs to be a remembrance.” And he was like, “Got it.” And then two hours later, he sent us that track.\n\nCC: It was kind of unbelievable. I remember that track was in my email, and I played it, and I said, “How does he do this in two hours?” It was so good.\n\nMR: And then we put it under the picture with cowboys racing around, and we said, “No, this isn’t it.”\n\nCC: [Laughs] “No, that’s not right.”\n\nMR: So we sent it back to the editor, Leah Breuer, who cut our main title for us. She sent back a piece about a day later, and it was perfect, too. So they both just emotionally understood what needed to happen and out came that really lovely title."}, {"url": "https://undeadwalking.com/2019/03/17/director-millicent-shelton-breaks-walking-dead-scars/", "page_content": "LOS ANGELES, CA - MARCH 04: Director Millicent Shelton accepts the award for Outstanding Directing in a Dramatic Series for \"Men of A Certain Age\" onstage at the 42nd NAACP Image Awards held at The Shrine Auditorium on March 4, 2011 in Los Angeles, California. (Photo by Kevin Winter/Getty Images for NAACP Image Awards)\n\nDirector Millicent Shelton steered the ship on one of the most powerful episodes of The Walking Dead ever. We had a chance to break down “Scars” with her.\n\nTake one look at Millicent Shelton’s profile on IMDB and you’ll see that she has directed episodes of many of the top shows on television. From Empire to Manifest, 9-1-1 to The Flash and so many more, Shelton is already a legendary television director and a powerful woman in Hollywood. She’s also a fan of The Walking Dead, and she’ll be forever known as the director who brought “Scars” to life.\n\nWe had a chance to speak with Millicent Shelton about her experience directing “Scars” and she shared some keen insight into her process in crafting the episode, along with the great lengths that production took to prepare everyone for such challenging scenes.\n\n(Sarabeth Pollock): What went through your head when you read the script for “Scars?”\n\n(Millicent Shelton): Well, I’ve seen all of the episodes leading up to season 9, and then I read the scripts for the episodes leading up to mine. But as you can see mine doesn’t really have lots to do with the Whisperers. I had to read it a couple of times to really see how it moved through times. I like working on tough episodes and this was a tough episode. I really liked having this challenge.\n\nOne of the questions I’ve heard around the fandom is why this episode came at this point in the season. From a narrative perspective, do you think it had to come now, rather than sooner in the season?\n\nMy guess is that the whole arc of the Whisperers had to be established in order to make it payoff at the end [of “Scars”]. To jump in during the middle of that might have jeopardized what was going on with the bigger arc of the season. This is giving the history of why the walls are up, and why Michonne is so guarded and why the scars are there. When you see someone has a scar you don’t usually talk to them about it and you don’t know the effect of it. That’s what this episode is about, the physical and emotional scars ever since Jocelyn came back into her life.\n\nHaving an actress like Rutina Wesley in this episode was so key, because the former True Blood star plays straight so well and doesn’t reveal a lot of emotion, so for Michonne to be so excited to see her and then have her betray her was so powerful.\n\nFor us, it was really important that they came across as old friends. It’s like you grow up with someone and go off to different colleges and move to different cities and then you see each other and pick things right where you left off, like time hasn’t passed. When you see that scene in the kitchen you see that, and there’s no indication that something is going to happen. It’s authentic. So when the turn does happen you’re just shocked and heartbroken.\n\nShelton continued by talking about how the authenticity of Michonne’s friendship with Jocelyn played heavily into the scene where they were being branded.\n\nFor me, the most powerful thing was to be in the room with them when she was getting branded. When Michonne was getting branded Danai leaned into it. The camera operator was actually standing right next to Ru and Danai leaned so far forward that [Rutina] took a step back. She wasn’t supposed to be in the shot but he got that profile show of Danai screaming in her face, and it was so powerful. I just let it go. You could see the energy in the room. Ru just took it all, and then after I said cut she was just a wreck because all of that energy went right into her body.\n\nThat scene, I said to Danai, was my homage to Scarface. That scene when he’s being cut with the chainsaw. And even in Scarface you don’t see that he’s being cut into pieces because it’s all in his face. The horror of the moment plays on Michonne’s face and that was just the most amazing moment being in the room for that.\n\nPeople will be talking about the powerful emotions in this episode, and you had to do it all with so many children around. Are they aware of how big the scene is? How did you make it all happen?\n\nWe were really conscious of [what was happening in this episode] and wanted to make sure we did no damage to these young actors. In the casting process the parents we made aware of what this episode was about. Once they were cast, each one of them had to sit down with a psychologist individually to go through the scenes and the script to make sure they understood that these stories aren’t real.\n\nBefore we shot we had a meeting in a conference room with the parents, the kids, the AD, myself and the actors and producers and we talked them through every single thing. All of the choreography was discussed with the stunt coordinator. Everybody knew everything so that when we were on set there were no concerns or issues.\n\nWhen we were on set they were all comfortable, we had rubber knives and they knew the stunts so it was fine.\n\nWhat was it like having so many kids on set?\n\nThat was crazy. Matthew Goodwin is an amazing AD and he scheduled all of it. There were lots of body doubles.\n\n“Scars” is really an amazing episode because it’s gory but you don’t see it. So much of what happens is implied but you don’t actually see a lot of actual gore, which really serves to highlight things like the blood on Michonne’s stomach. It’s such a masterfully crafted episode.\n\nThank you! It was always written to be the juxtaposition between the kids and the walkers. I augmented it a bit when we were storyboarding, but I do think it was smart that that was the way to show it. One of my main concerns was that Michonne is not a monster and she wasn’t just just killing kids. She had no choice. She did it to save her daughter and to save her unborn child and to save herself. We had to make sure that the kids were totally feral, and that they were no going to give up so she had no choice. Danai kept saying “please stop, please stop” but on set we kept telling the kids not to stop. And we wanted to make sure the audience saw that she had no choice and she was definitely not enjoying this.\n\nIt’s interesting, too, because Daryl had no part in killing the children. He came into it seeing the aftermath.\n\nRight. The episode is called “Scars” but it’s not just about the physical scars. It’s about the emotional scars. Even though Daryl didn’t have to physically do anything to the kids, he was scarred emotionally.\n\nNegan revealed to Michonne that he has told Judith everything he did, including killing Glenn and Abraham. Knowing that Michonne has been keeping secrets from Judith to protect her, was this scene something that had to happen to trigger Michonne and show her that Judith might be able to look past whatever she’s hiding?\n\nYeah, and it also shows that a wound is still a wound. That psychological wound is still there. There’s a moment at the end of the scene where Negan looks at Michonne and goes “Oh, you don’t know where your daughter is” and that opens the wound right there. She’s good at covering her pain up but he sees right through it. And you can see it in her eyes, you know she’s in pain.\n\nDo you think it was important for the story that it was her worst enemy who managed to see right through her?\n\nYes. And he’s the one who’s behind bars but she’s the one who is trapped.\n\nYou’re going to go down as the director who worked with two Judiths in this episode, which was huge story for Cailey Fleming’s Judith because up until now we’ve only ever seen her as a total badass. We see her vulnerability for the first time.\n\nShe’s an amazing young actor, I have to say. And when we see her on that rock when she’s talking about when they stopped caring about Carol, there were so many tender moments. When she’s on the lake with Daryl, and he’s imitating how she’s sitting. She’s just so amazing, I mean, she went toe to toe with Danai. She’s just a very advanced actress for her age.\n\nI talked to her like I talk to the other actors. I don’t talk down to kids, so we just talked about what was going on with the scene and she was just so good.\n\nFrom a technical standpoint there were so many moving pieces to this episode. Most shows don’t deal with multiple realities or timelines. You’ve directed an episode of The Flash with multiple universes, and now this episode of The Walking Dead has different timelines. Can you talk about the challenge of moving between timelines?\n\nThe hair and makeup and wardrobe were important, and again Assistant Director Matthew Goodwin was so helpful in dealing with the timelines. The biggest thing that I wanted to focus on was that the transitions between timelines were clear, so no one would be sitting there wondering what was happening. I wanted it to be clear.\n\nWhen we jump around, back and forth, we use something to show the change in time. I tried to ground people in something that was familiar.\n\nOne of the biggest tells was Michonne’s pregnancy. What was it like for her to be so pregnant on set?\n\nI know that thing was heavy! There was a fake belly when she was smaller, like one of those pillow things. But when she had to be cut Greg Nicotero had to build her something and it had the texture of chicken cutlets, like a really soft fabric. It went over her head and arms like a glove, so that you could see her skin because it was a pregnancy belly.\n\nThis is going to go down as one of the most powerful episodes of The Walking Dead ever.\n\nThis is a character study of Michonne. She has been one of the strongest characters on television that I’ve seen. She’s always been impenetrable but this episode does show her psychological wounds and being able to be broken like we’ve never seen before. It gives us great insight into her character, and I think it’s a very positive thing.\n\nIt was such a pleasure to talk with Millicent Shelton about her episode of The Walking Dead. You’ll be able to see her work again soon soon on the hit FOX show 9-1-1, where she directed an upcoming episode titled “Fight or Flight.”"}]}