{"Millicent Shelton directed The Game.": [{"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://medium.com/authority-magazine/millicent-shelton-5-things-i-wish-someone-told-me-when-i-first-became-a-filmmaker-894dd50dc40a", "page_content": "Thank you so much for joining us in this interview series! Our readers would love to get to know you a bit better. Can you tell us a bit of the ‘backstory’ of how you grew up?\n\nI grew up in St. Louis way out in the suburbs. I went to college at Princeton university in new jersey and every weekend I’d ride the train to New York City to hang out. It only made sense for me to move to new york after graduation and eventually earn my master's in film from NYU while directing music videos to pay the bills.\n\nCan you share a story with us about what brought you to this specific career path?\n\nI had to decide what I was going to major in at Princeton. I grew up believing that I wanted to be a lawyer but after interning for a summer at a law firm, I knew that was not the job for me. My mother told me to select a field that I loved but I had no clue what that was. It took me a while to do some soul searching. I remembered that I enjoyed creative writing. I took a summer course at NYU to explore what it was like to create a short film from a writer’s perspective and ended up loving being a director. By the end of the summer, i knew that there was no other job but directing for me.\n\nCan you share the funniest or most interesting story that occurred to you in the course of your filmmaking career?\n\nOne of my craziest experiences on set came during the filming of “end of the road.” I had just called cut on a scene with beau bridges outside of our motel location and we started to set up for the next scene when suddenly the blue sky turned brown, and we were hit with high winds mixed with sand so thick that you couldn’t see 3 feet in front of you. It’s called a ‘haboob’ which is a crazy intense dust storm. It lasted for 45 minutes then suddenly stopped and the most breathtaking sunset appeared. We filmed the SUV driving up to the motel in that light.\n\nWho are some of the most interesting people you have interacted with? What was that like? Do you have any stories?\n\nI have worked with so many brilliantly talented people. It was a dream of a lifetime to work with Al Pacino on “Hunters’. Every time I search for a visual film reference, one of his films appears! He’s been in so many iconic movies, its mind-blowing. He was a truly lovely actor who was collaborative and giving. There was a moment the first day that we worked together that I thought maybe I shouldn’t give Al Pacino a note, but that’s my job as a director. I gave him notes but I made sure that they were smart notes that I could back up and notes that would further enhance the magic that he naturally creates. He gave me a big hug on his last day and said, “I’d like to work with you again, kid.” I liked that he called me kid. It would be a blessing to work with Al again.\n\nNone of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are? Can you share a story about that?\n\nMy favorite professor at NYU was Nick Tanis. He taught me how to transform my daydreams into filmable images. Paris Barclay has been my mentor for years. I shadowed him off and on for 3 years trying to get my first break as a director in episodic television. On the first episode that I was hired on, Paris promised the producers that he would guide me through it and be there if I froze up then privately he told me that I could handle the job on my own which I did. Until covid, I was having an annual breakfast with David Nutter who is also a mentor to me. He was instrumental in helping me to move into action television and was a sounding board for me during my first pilot. There are countless other people that have helped me, but it would take up pages and pages! I am a driven person but have had lots of help along the way.\n\nCan you please give us your favorite “life lesson quote”? Can you share how that was relevant to you in your life?\n\n‘Never give up’ is my favorite quote. I started directing during a time when women and especially women of color were not welcomed with open arms as Hollywood television directors. There were lots of doors that were not open. I wanted to give up a lot, but that quote would ring through my head. My testimony is that I am here today because I had blind faith and perseverance and did not give up on my dream.\n\nI am very interested in diversity in the entertainment industry. Can you share three reasons with our readers about why you think it’s important to have diversity represented in film and television? How can that potentially affect our culture?\n\nI wholeheartedly believe in diversity. To me, diversity is a little bit of everyone, inclusive of all races, gender, and LGBTIQQ+. It’s important because cinema should be reflective of real life and our world is diverse. The more we have diverse voices behind the screen, the more our stories will ring true and have realistic characters, dialogue, and actions. The more that we explore diverse stories, the more that we realize that despite our ethnic or socio-economic differences, we are all very much the same. Family is family. Fear is fear. Love is love.\n\nWhat are some of the most interesting or exciting projects you are working on now?\n\nBeing able to shepherd ‘end of the road’ has been a wonderful experience that I am very proud of. It was great to collaborate with queen Latifah again. We worked together to create a black family with a female matriarch who is a smart, strong, mama bear willing to do whatever is necessary to protect her family. After this, I am in development on a Josephine Baker limited series with Ruth Negga attached in the leading role. I am super excited about that. We’re looking to delve deeper into Josephine than ever before. I can’t wait to see what ruth does with this part. She’s amazing!\n\nWhich aspect of your work makes you most proud? Can you explain or give a story?\n\nI am most proud of my ability to collaborate with actors. They are the conduit for the soul of the characters and I respect their position. I love hearing their point of view and then working to make sure that the feeling that they desire to convey is truly coming through. Both queen Latifah and Chris ‘Ludacris’ bridges were laser-focused on representing their characters in their truest light. They trusted me to give them feedback in order to make their performances stronger. Another actor that I’ve worked with is Forest Whitaker. He is the king of nuanced performances. When I worked with him on ‘empire’, I noticed that he would subtly change his performance with each take. We’d discuss it after each take and then land on the read that we both felt sold the story and character best.\n\nOk super. Here is the main question of our interview. What are your “5 things I wish someone told me when I first started” and why? Please share a story or example for each.\n\nGet sleep because production will seep into your dreams, and you will never have a sound sleep again. Trust your gut because you must stand up or fall down based on your own thoughts not because someone told you to do it. Be fearless. A healthy amount of fear is normal but don’t be too scared that it limits your ability to dream outside of the box. Listen to everyone. This doesn’t mean doing everything that everyone suggests but be smart enough and open enough to hear thoughts that may lead you to something great. Learn to say ‘no.’ it’s actually a secret power.\n\nWhen you create a film, which stakeholders have the greatest impact on the artistic and cinematic choices you make? Is it the viewers, the critics, the financiers, or your own personal artistic vision? Can you share a story with us or give an example of what you mean?\n\nWhen I create, I can’t think about what critics will say or it would make my mind spin. I read the material, daydream about it, and try to stay true to it. My goal is to take the 2-dimensional words off the page and breathe life into their 3-dimensional existence with the help of actors and amazing crew members. I like to say that as a director, ‘i service script.’\n\nYou are a person of great influence. If you could start a movement that would bring the most amount of good to the most amount of people, what would that be? You never know what your idea can trigger. :-)\n\nMy movement would be for equality and parity for all. In particular, a woman’s right to choose how she uses her body.\n\nWe are very blessed that some of the biggest names in business, vc funding, sports, and entertainment read this column. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this. :-)\n\nI would like to sit down and have a quiet lunch with president Barrack Obama. I can’t imagine the stories he has to share but I know they are deep.\n\nHow can our readers further follow you online?\n\nThey can follow me on instagram at @shelton9mil. I try to keep it updated!\n\nThis was very meaningful, thank you so much! We wish you continued success!"}, {"url": "https://www.starz.com/us/en/browse/artist/millicent-shelton/57423", "page_content": "Watch Millicent Shelton TV shows on STARZ\n\nBrowse and watch Millicent Shelton's TV shows on STARZ, including Run The World\n\nClaim Special Offer"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://showzupdate.com/highway-to-hell-end-of-the-road-director-millicent-shelton-takes-us-on-a-thrilling-ride/", "page_content": "Millicent Shelton knows what it’s like to be on the road, and she uses that experience to bring us End of the Road, one of the year’s most thrilling action movies. This movie isn’t just about cars and roads, though; it’s also about the relationships and other bonds that tie us together with our loved ones, even when death seems imminent. In this exclusive interview, we talked with director Millicent Shelton about how she translated these themes into her powerful movie. Highway to Hell: End of the Road Director Millicent Shelton Takes Us on a Thrilling Ride\n\nAn Interview with director Millicent Shelton\n\nMillicent Shelton is the writer, director and producer of Highway to Hell. The film’s executive producers are Frances Lee McCain Val, Beau Bridges Hammers, Shaun Dixon Cam, Mychala Lee Kelly(as Mychala Faith Lee), Ludacris Reggie(as Chris Bridges), Queen Latifah Brenda. It was filmed in New Mexico, California, Illinois and Washington D.C., by photography company Company Productions Inc., . It was made with financing from RatPac Entertainment (RatPac-Dune Entertainment LLC) and production funding from Riverstone Pictures. What led you to make this particular story?\n\nThe Movie Facts\n\nDirector By Millicent Shelton’s Highway to Hell: End of the Road stars Queen Latifah as Brenda, Mychala Lee Kelly as Mychala Faith Lee, Shaun Dixon Cam as Malcolm and Frances Lee McCain Val as Young Lettie. Meanwhile, Beau Bridges and Ludacris play Hammers and Reggie respectively. Set in the New Mexico desert, we follow Brenda (Queen Latifah) and her family as they travel across country in search of a better life. Alone in the middle of nowhere with no cell service, their journey becomes an odyssey when they are forced to fight for their lives when they become targets for an unknown killer.\n\nThis high-octane action thriller takes us on a wild ride that never lets up, says director Millicent Shelton.\n\nThe Cast\n\nIn this high-octane action thriller, a cross-country road trip becomes a highway to hell for Brenda and her family. The film was directed by Millicent Shelton and stars Beau Bridges, Mychala Lee Kelly (as Mychala Faith Lee), and Ludacris Reggie (as Chris Bridges). Beau Bridges plays Sheriff John Kane with graying hair and glasses that give him an intellectual, elderly look. He is a true expert in his field and takes his job very seriously. Mychala Lee Kelly(as Mychala Faith Lee) is Brenda’s daughter who wants nothing more than to live in peace after all she has been through, but when they are attacked once again while taking the long drive home from visiting their grandchild, she takes up arms with her father.\n\nHighway to Hell: End of the Road Director Millicent Shelton Takes Us on a Thrilling Ride\n\nHow can we keep our loved ones safe?\n\nIf you know Beau Bridges, Ludacris Reggie, and Mychala Lee Kelly from their roles in TV’s Southland or movies like Bring It On, then buckle up for a wild ride. They star as an ordinary family on vacation who get caught up in an international spy game with deadly consequences.\n\nHow did you get into filmmaking?\n\nMillicent Shelton has been an integral part of Hollywood for many years and is considered by many as a true genius behind-the-scenes. She’s made appearances in various television and film productions, including Ferris Bueller’s Day Off, Too Fast Too Furious, and Collateral Beauty. Originally born in Brazil but raised in Detroit, she attended Wayne State University where she studied psychology and theater with minors in Spanish and German.\n\nWhat drew you to horror?\n\nBefore I got into horror, I used to watch quite a bit of cheesy movies. One day my friend lent me Bram Stoker’s Dracula and I was hooked! That led me down the rabbit hole so to speak and that was all it took for me to start following horror directors as closely as actors and actresses.\n\nNowadays, when I get bored or need something new, I search for new directors to check out.\n\nWhat was it like working with James Furlong?\n\nJames was such an amazing actor to work with, and I think that the film would not have been as successful without him. It is always so hard when filming your last day with someone you’ve grown close to. After so many hours together, it feels like your own family has left you for a long time. I was also very fortunate because James had spent a lot of time in New Mexico before our movie started shooting there.\n\nHighway to Hell: End of the Road Director Millicent Shelton Takes Us on a Thrilling Ride\n\nWho was your inspiration growing up?\n\nI grew up in a very small town and my hero growing up was Ludacris Reggie. My mom introduced me to Ludacris when I was 9 years old, and I immediately loved his music. He was very talented, had natural talent as an actor and singer, and he seemed like an all-around cool guy. His lyrics were inspiring and uplifting. When I saw him do standup comedy, it made me want to pursue comedy myself.\n\nIs End of the Road on netflix?\n\nA cross-country road trip becomes a highway to hell for Brenda and her family. Alone in the New Mexico desert, they have to fight for their lives when they become the targets of a mysterious killer. Beau Bridges hammers as Larry, Mychala Lee Kelly(as Mychala Faith Lee) as Julia Brenda’s mom, Ludacris Reggie(as Chris Bridges) as Thomas Brenda’s father, followed by Storm Reid\n\nWhat is the End of the Road about?\n\nIn this high-octane action thriller, a cross-country road trip becomes a highway to hell for Brenda and her family. Alone in the New Mexico desert, they have to fight for their lives when they become the targets of a mysterious killer. Directed by award-winning filmmaker and actor, Mychala Lee Kelly(as Mychala Faith Lee), director By Millicent Shelton takes us on an intense and thrilling ride filled with twists and turns that will keep you guessing until its very surprising end.\n\nWhat is Boyz II Men’s most famous song?\n\nOne of Boyz II Men’s most famous songs is End of the Road. End of the Road was released in 1994, from their second album II. The song is about a man who’s falling out of love with his girlfriend, and it wasn’t just popular for being romantic. It also became really famous for being sampled as part of Hip-Hop/Rap artist Kanye West’s song Bound 2, which was on his 2013 album Yeezus.\n\nHighway to Hell: End of the Road Director Millicent Shelton Takes Us on a Thrilling Ride\n\nWhat movie is End of the Road from?\n\nIn this high-octane action thriller, a cross-country road trip becomes a highway to hell for Brenda and her family. Alone in the New Mexico desert, they have to fight for their lives when they become the targets of a mysterious killer. Director By Millicent Shelton takes us on an unpredictable ride with this suspenseful story based on true events.\n\nFrequently asked questions\n\nWho does Ludacris play in End of the Road?\n\nActor Ludacris is known for taking challenging roles that explore his range as an actor. He has notably played characters in films such as Crash, Hustle and Flow, Get Out, and Selma. His most recent role will see him play Reggie in new action thriller End of the Road. The film follows Brenda and her family during their road trip across country which goes wrong when they are attacked by a masked killer.\n\nHow it will end movie?\n\nIn End of the Road 2022, we follow Brenda and her family as they’re driving across country. Suddenly, their car breaks down and they are stranded in New Mexico. All alone, they are faced with a killer that wants them dead at any cost. Will Brenda be able to protect her kids from death? Will she find some hope for the future? We can’t say for sure yet but we can assure you that this is going to be one thrilling movie!\n\nHow much is Boyz II Men worth?\n\nMychala Lee Kelly, Ludacris Reggie, and Ryan Christopher Jones star in director Millicent Shelton’s newest film Highway to Hell. This high-octane action thriller follows Brenda and her family as they set out on a cross-country road trip in an RV. Just when it seems like things couldn’t get any worse for this group, they become the targets of an unknown killer.\n\nWhy did Michael leave Boyz to Men?\n\nBeing an actor and musical artist was Michael’s lifelong dream. He finally attained his goal when he was offered a role in Boyz II Men’s backup dancer position. His life is even more complete when he met Mimi, the love of his life. Unfortunately, due to circumstances that are out of their control, Mimi gets pregnant and she leaves for her home country with her family. The only thing keeping him from chasing after Mimi was his career as an actor and dancer with Boyz II Men.\n\nHow many number one hits does Backstreet Boys have?\n\nOne point for each number one hit.\n\n1. I Want It That Way 10pts\n\n2. Everybody (Backstreet’s Back) 10pts\n\n3. As Long as You Love Me 10pts\n\n4. I’ll Never Break Your Heart 10pts\n\n5. More Than That 5 pts\n\nRelated"}, {"url": "https://subtitlevid.com/shows/129552/the-night-agent/season/1", "page_content": "S1 Episode1 The Night Agent S1 E1 is called The Call and was aired in March 2023. It was written by Shawn Ryan and directed by Seth Gordon. While working the night action desk, FBI agent Peter receives a distress call and is soon put in charge of protecting cybersecurity expert Rose.. The Night Agent (S1 E1) has a rating of 7.5/10 and has received 10 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode2 The Night Agent S1 E2 is called Redial and was aired in March 2023. It was written by Shawn Ryan and directed by Seth Gordon. After looking for a link between the Campbells and the FBI, Peter is forced to go on the run with Rose in search of a hard drive — and more answers.. The Night Agent (S1 E2) has a rating of 6.5/10 and has received 4 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode3 The Night Agent S1 E3 is called The Zookeeper and was aired in March 2023. It was written by Guy Ferland and directed by Shawn Ryan. Peter teams up with Rose for a risky mission at the White House.. The Night Agent (S1 E3) has a rating of 7.8/10 and has received 4 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode4 The Night Agent S1 E4 is called Eyes Only and was aired in March 2023. It was written by Seth Fisher and directed by Ramaa Mosley. Rose and Peter seek out one of the Campbells' recent contacts and uncover new intel.. The Night Agent (S1 E4) has a rating of 7.5/10 and has received 2 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode5 The Night Agent S1 E5 is called The Marionette and was aired in March 2023. It was written by Corey Deshon and directed by Guy Ferland. Peter visits someone close to Hawkins.. The Night Agent (S1 E5) has a rating of 7.3/10 and has received 3 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode6 The Night Agent S1 E6 is called Fathoms and was aired in March 2023. It was written by Imogen Browder and directed by Ramaa Mosley. With assassins hot on their trail, Peter and Rose split up en route to the White House.. The Night Agent (S1 E6) has a rating of 7/10 and has received 3 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode7 The Night Agent S1 E7 is called Best Served Cold and was aired in March 2023. It was written by Tiffany Shaw Ho and directed by Adam Arkin. Now in hiding, Peter and Rose grow closer and investigate a potential bombing suspect.. The Night Agent (S1 E7) has a rating of 7.5/10 and has received 2 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode8 The Night Agent S1 E8 is called Redux and was aired in March 2023. It was written by Rachel Wolf and directed by Adam Arkin. More truths emerge about the bombing suspect's identity.. The Night Agent (S1 E8) has a rating of 7.5/10 and has received 2 votes. download subtitles below\n\nDownload Subtitles\n\nS1 Episode9 The Night Agent S1 E9 is called The Devil We Know and was aired in March 2023. It was written by Millicent Shelton and directed by Munis Rashid. After new revelations surface, Peter and Rose scramble to find more evidence with help from Chelsea and Maddie.. The Night Agent (S1 E9) has a rating of 7.5/10 and has received 2 votes. download subtitles below\n\nDownload Subtitles"}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.denofgeek.com/comics/the-flash-season-2-the-caitlin-snow-to-killer-frost-transformation/", "page_content": "Check out the trailer…\n\nhttps://www.youtube.com/watch?v=_9UnnTMvBug\n\nAnd here’s the official synopsis:\n\nBARRY VISITS EARTH-2 – Barry (Grant Gustin), Wells (Tom Cavanagh) and Cisco (Carlos Valdes) journey to Earth-2 to rescue Wells’ daughter, Jesse (guest star) from Zoom. Barry is stunned when he runs into Earth-2 Iris (Candice Patton) and Joe (Jesse L. Martin), but nothing prepares him for meeting Killer Frost (Danielle Panabaker) and Deathstorm (guest star Robbie Amell). Meanwhile, back on Earth-1, Jay (guest star Teddy Sears) has to take over the Flash’s responsibilities when a meta-human nicknamed Geomancer (guest star Adam Stafford) attacks Central City. Millicent Shelton directed the episode written by Greg Berlanti & Andrew Kreisberg and Katherine Walczak (#213).\n\nYou can read more about what went into the Killer Frost design in original story from July 27th down below…\n\nIf you aren’t completely charmed by Danielle Panabaker as Caitlin Snow on The Flash, well, you probably just aren’t a fan of that show in the first place. While it’s easy to get caught up in her banter with the rest of the cast, her romance with Ronnie “Firestorm” Raymond, and even the occasional (well, OK…once) bit of karaoke, since Caitlin’s name was first announced, fans have had two words on the brain: Killer Frost. We sat down at an SDCC roundtable with Ms. Panabaker to discuss her transformation into Killer Frost.\n\nThe cold-wielding supervillain has been kicking around the DC Comics universe since 1978, and she’s primarily been known as a Firestorm antagonist. Earlier incarnations bore names like “Crystal Frost” and “Louise Lincoln” before Caitlin Snow came around in 2013 as part of the DC New 52. But the connection to Firestorm has always been a strong one, so the decision of The Flash producers to pair Caitlin up with Ronnie Raymond helped tie things to the character’s larger history.\n\nWe got the briefest glimpse of Danielle as Killer Frost in The Flash season one finale, and even though she admits “that was a little bit of a tease,” it sounds like that is pretty close to Killer Frost’s final look.\n\nIn case you haven’t seen it…"}], "Millicent Shelton was nominated for NAACP Image Awards.": [{"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.hollywoodreporter.com/movies/movie-news/naacp-image-awards-2023-nominations-list-nominees-1235297888/", "page_content": "The 2023 NAACP Image Awards nominees have been revealed.\n\nBlack Panther: Wakanda Forever and The Woman King were among the leading film nominees with 12 and nine nominations, respectively. Black Panther star Angela Bassett and Woman King star Viola Davis were each nominated for the NAACP Images Awards’ top prize of entertainer of the year.\n\nOther films that scored multiple nominations include Till, which landed six nods, and Emancipation, with five nods.\n\nBlack Panther, The Woman King, Till and Emancipation are all nominated for best motion picture alongside A Jazzman’s Blues, which landed four nominations.\n\nABC’s Abbott Elementary received the most nominations in the TV and streaming categories with nine nods. Star Quinta Brunson is also up for entertainer of the year. Fellow ABC series Black-ish landed seven nominations for its eighth and final season. From Scratch, P-Valley and Queen Sugar landed six nominations each, with Atlanta picking up four nods.\n\nBeyoncé and Kendrick Lamar scored the most nominations in the music recording categories with five each.\n\n“This year’s nominees have conveyed a wide range of authentic stories and diverse experiences that have resonated with many in our community, and we’re proud to recognize their outstanding achievements and performances,” said NAACP president and CEO Derrick Johnson said in a statement.\n\n\n\nBET executive vp, specials, music programming and music strategy Connie Orlando added, “We take pride in recognizing the trailblazing achievements and artistry of this year’s esteemed nominees and celebrating the powerful legacy of the NAACP. We look forward to bringing the Image Awards back to Pasadena in front of a live audience and delivering unforgettable moments that epitomize the brilliance of the Black community.”\n\nIn terms of nominations by company, ABC leads with 28 followed by Netflix with 15, RCA Records/RCA Inspiration with 11 and Penguin Random House and Harper Collins with nine nominations each.\n\nThe NAACP Image Awards is set to take place live, in front of an audience for the first time in three years, on Saturday, Feb. 25 at 8 p.m. ET on BET.\n\nVoting by the public on this year’s winners is available through Feb. 10 on the Image Awards’ website.\n\nThe NAACP will also recognize winners in non-televised categories from Feb. 20-24 in streamed presentations on the Image Awards’ site.\n\nA complete list of this year’s nominees follows.\n\nENTERTAINER OF THE YEAR\n\nAngela Bassett\n\nMary J. Blige\n\nQuinta Brunson\n\nViola Davis\n\nZendaya\n\n\n\nMOTION PICTURE CATEGORIES\n\nOutstanding Motion Picture\n\nA Jazzman’s Blues (Netflix)\n\nBlack Panther: Wakanda Forever (Marvel Studios)\n\nEmancipation (Apple TV)\n\nThe Woman King (Sony Pictures Releasing)\n\nTill (United Artists Releasing/Orion Pictures)\n\n\n\nOutstanding Actor in a Motion Picture\n\nDaniel Kaluuya – Nope (Universal Pictures)\n\nJonathan Majors – Devotion (Sony Pictures Entertainment)\n\nJoshua Boone – A Jazzman’s Blues (Netflix)\n\nSterling K. Brown – Honk for Jesus. Save Your Soul (Focus Features)\n\nWill Smith – Emancipation (Apple)\n\n\n\nOutstanding Actress in a Motion Picture\n\nDanielle Deadwyler – Till (United Artists Releasing/Orion Pictures)\n\nKeke Palmer – Alice (Vertical Entertainment)\n\nLetitia Wright – Black Panther: Wakanda Forever (Marvel Studios)\n\nRegina Hall – Honk for Jesus. Save Your Soul (Focus Features)\n\nViola Davis – The Woman King (Sony Pictures Releasing)\n\n\n\nOutstanding Supporting Actor in a Motion Picture\n\nAldis Hodge – Black Adam (Warner Bros. Pictures / New Line Cinema)\n\nCliff “Method Man” Smith – On The Come Up (Paramount Pictures)\n\nJalyn Hall – Till (United Artists Releasing/Orion Pictures)\n\nJohn Boyega – The Woman King (Sony Pictures Releasing)\n\nTenoch Huerta – Black Panther: Wakanda Forever (Marvel Studios)\n\n\n\nOutstanding Supporting Actress in a Motion Picture\n\nAngela Bassett – Black Panther: Wakanda Forever (Marvel Studios)\n\nDanai Gurira – Black Panther: Wakanda Forever (Marvel Studios)\n\nJanelle Monáe – Glass Onion: A Knives Out Mystery (Netflix)\n\nLashana Lynch – The Woman King (Sony Pictures Releasing)\n\nLupita Nyong’o – Black Panther: Wakanda Forever (Marvel Studios)\n\n\n\nOutstanding Independent Motion Picture\n\nBreaking (Bleecker Street)\n\nCauseway (Apple TV)\n\nMr. Malcolm’s List (Bleecker Street)\n\nRemember Me: The Mahalia Jackson Story (Hulu)\n\nThe Inspection (A24)\n\n\n\nOutstanding International Motion Picture\n\nAthena (Netflix)\n\nBantú Mama (ARRAY)\n\nBroker (NEON)\n\nLearn to Swim (ARRAY)\n\nThe Silent Twins (Focus Features)\n\n\n\nOutstanding Breakthrough Performance in a Motion Picture\n\nJalyn Hall – Till (United Artists Releasing/Orion Pictures)\n\nJoshua Boone – A Jazzman’s Blues (Netflix)\n\nLedisi – Remember Me: The Mahalia Jackson Story (Hulu)\n\nY’lan Noel – A Lot of Nothing (RLJE)\n\nYola – Elvis (Warner Bros. Pictures)\n\n\n\nOutstanding Ensemble Cast in a Motion Picture\n\nA Jazzman’s Blues (Netflix)\n\nBlack Panther: Wakanda Forever (Marvel Studios)\n\nEmancipation (Apple TV)\n\nThe Woman King (Sony Pictures Entertainment)\n\nTill (United Artists Releasing/Orion Pictures)\n\n\n\nOutstanding Animated Motion Picture\n\nDC League of Super-Pets (Warner Bros. Pictures / WAG / DC)\n\nGuillermo del Toro’s Pinocchio (Netflix)\n\nPuss in Boots: The Last Wish (Universal Pictures)\n\nTurning Red (Pixar Animation Studios)\n\nWendell & Wild (Netflix)\n\n\n\nOutstanding Character Voice-Over Performance – Motion Picture\n\nAngela Bassett – Wendell & Wild (Netflix)\n\nKeke Palmer – Lightyear (Walt Disney Studios)\n\nKevin Hart – DC League of Super-Pets (Warner Bros. Pictures / WAG / DC)\n\nLyric Ross – Wendell & Wild (Netflix)\n\nTaraji P. Henson – Minions: The Rise of Gru (Universal Pictures)\n\n\n\nOutstanding Short-Form (Live Action)\n\nDear Mama… (Film Independent)\n\nFannie (Chromatic Black)\n\nFathead (University of Southern California)\n\nIncomplete (20th Century Digital, Hulu)\n\nPens & Pencils (Wavelength Productions/Black TV & Film Collective)\n\n\n\nOutstanding Short-Form (Animated)\n\nI Knew Superman (Houghtonville Animation)\n\nMore Than I Want To Remember (MTV Entertainment Studios)\n\nSupercilious (York Cinemas)\n\nThe Boy, the Mole, the Fox and the Horse (Apple Studios)\n\nWe Are Here (271 Films)\n\n\n\nOutstanding Breakthrough Creative (Motion Picture)\n\nElvis Mitchell – Is That Black Enough For You?!? (Netflix)\n\nEricka Nicole Malone – Remember Me: The Mahalia Jackson Story (Hulu)\n\nKrystin Ver Linden – Alice (Vertical Entertainment)\n\nMo McRae – A Lot of Nothing (RLJE)\n\nStephen Adetumbi, Jarrett Roseborough – This Is My Black (Campus of Pine Forge Academy)\n\n\n\nTELEVISION + STREAMING CATEGORIES\n\n\n\nOutstanding Comedy Series\n\nAbbott Elementary (ABC)\n\nAtlanta (FX)\n\nblack-ish (ABC)\n\nRap Sh!t (HBO Max)\n\nThe Wonder Years (ABC)\n\n\n\nOutstanding Actor in a Comedy Series\n\nAnthony Anderson – black-ish (ABC)\n\nCedric The Entertainer – The Neighborhood (CBS)\n\nDonald Glover – Atlanta (FX)\n\nDulé Hill – The Wonder Years (ABC)\n\nMike Epps – The Upshaws (Netflix)\n\n\n\nOutstanding Actress in a Comedy Series\n\nLoretta Devine – Family Reunion (Netflix)\n\nMaya Rudolph – Loot (Apple TV+)\n\nQuinta Brunson – Abbott Elementary (ABC)\n\nTichina Arnold – The Neighborhood (CBS)\n\nTracee Ellis Ross – black-ish (ABC)\n\n\n\nOutstanding Supporting Actor in a Comedy Series\n\nBrian Tyree Henry – Atlanta (FX)\n\nDeon Cole – black-ish (ABC)\n\nKenan Thompson – Saturday Night Live (NBC)\n\nTyler James Williams – Abbott Elementary (ABC)\n\nWilliam Stanford Davis – Abbott Elementary (ABC)\n\n\n\nOutstanding Supporting Actress in a Comedy Series\n\nJanelle James – Abbott Elementary (ABC)\n\nJenifer Lewis – black-ish (ABC)\n\nMarsai Martin – black-ish (ABC)\n\nSheryl Lee Ralph – Abbott Elementary (ABC)\n\nWanda Sykes – The Upshaws (Netflix)\n\n\n\nOutstanding Drama Series\n\nBel-Air (Peacock)\n\nBridgerton (Netflix)\n\nEuphoria (HBO Max)\n\nP-Valley (Starz)\n\nQueen Sugar (OWN: Oprah Winfrey Network)\n\n\n\nOutstanding Actor in a Drama Series\n\nDamson Idris – Snowfall (FX)\n\nJabari Banks – Bel-Air (Peacock)\n\nKofi Siriboe – Queen Sugar (OWN: Oprah Winfrey Network)\n\nNicco Annan – P-Valley (Starz)\n\nSterling K. Brown – This Is Us (NBC)\n\n\n\nOutstanding Actress in a Drama Series\n\nAngela Bassett – 9-1-1 (FOX)\n\nBrandee Evans – P-Valley (Starz)\n\nQueen Latifah – The Equalizer (CBS)\n\nRutina Wesley – Queen Sugar (OWN: Oprah Winfrey Network)\n\nZendaya – Euphoria (HBO Max)\n\n\n\nOutstanding Supporting Actor in a Drama Series\n\nAdrian Holmes – Bel-Air (Peacock)\n\nAmin Joseph – Snowfall (FX)\n\nCaleb McLaughlin – Stranger Things (Netflix)\n\nCliff “Method Man” Smith – Power Book II: Ghost (Starz)\n\nJ. Alphonse Nicholson – P-Valley (Starz)\n\n\n\nOutstanding Supporting Actress in a Drama Series\n\nAdjoa Andoh – Bridgerton (Netflix)\n\nBianca Lawson – Queen Sugar (OWN: Oprah Winfrey Network)\n\nLoretta Devine – P-Valley (Starz)\n\nSusan Kelechi Watson – This Is Us (NBC)\n\nTina Lifford – Queen Sugar (OWN: Oprah Winfrey Network)\n\n\n\nOutstanding Television Movie, Limited-Series or Dramatic Special\n\nCarl Weber’s The Black Hamptons (BET Networks)\n\nFrom Scratch (Netflix)\n\nThe Best Man: The Final Chapters (Peacock)\n\nThe Last Days of Ptolemy Grey (Apple TV+)\n\nWomen of the Movement (ABC)\n\n\n\nOutstanding Actor in a Television Movie, Limited-Series or Dramatic Special\n\nMorris Chestnut – The Best Man: The Final Chapters (Peacock)\n\nSamuel L. Jackson – The Last Days of Ptolemy Grey (Apple TV+)\n\nTerrence Howard – The Best Man: The Final Chapters (Peacock)\n\nTrevante Rhodes – Mike (Hulu)\n\nWendell Pierce – Don’t Hang Up (Bounce TV)\n\n\n\nOutstanding Actress in a Television Movie, Limited-Series or Dramatic Special\n\nNiecy Nash-Betts – Dahmer – Monster: The Jeffrey Dahmer Story (Netflix)\n\nRegina Hall – The Best Man: The Final Chapters (Peacock)\n\nSanaa Lathan – The Best Man: The Final Chapters (Peacock)\n\nViola Davis – The First Lady (Showtime)\n\nZoe Saldaña – From Scratch (Netflix)\n\n\n\nOutstanding Supporting Actor in a Television Movie, Limited-Series or Dramatic Special\n\nGlynn Turman – Women of the Movement (ABC)\n\nKeith David – From Scratch (Netflix)\n\nOmar Benson Miller – The Last Days of Ptolemy Grey (Apple TV+)\n\nRussell Hornsby – Mike (Hulu)\n\nTerrence “TC” Carson – A Wesley Christmas (AMC)\n\n\n\nOutstanding Supporting Actress in a Television Movie, Limited-Series or Dramatic Special\n\nAlexis Floyd – Inventing Anna (Netflix)\n\nDanielle Deadwyler – From Scratch (Netflix)\n\nMelissa De Sousa – The Best Man: The Final Chapters (Peacock)\n\nNia Long – The Best Man: The Final Chapters (Peacock)\n\nPhylicia Rashad – Little America (Apple TV+)\n\n\n\nOutstanding News/Information (Series or Special)\n\n#RolandMartinUnfiltered: Black Votes Matter Election Night 2022 Coverage (Black Star Network/YouTube)\n\nABC News 20/20 Michelle Obama: The Light We Carry, A Conversation with Robin Roberts (ABC)\n\nFinding Your Roots with Henry Louis Gates, Jr. (PBS)\n\nOWN Spotlight: Viola Davis – The Woman King (OWN: Oprah Winfrey Network)\n\nThe Hair Tales (Hulu)\n\n\n\nOutstanding Talk Series\n\nHart to Heart (Peacock)\n\nRed Table Talk (Facebook Watch)\n\nSherri (Syndicated)\n\nTamron Hall (ABC)\n\nUninterrupted: The Shop (YouTube)\n\n\n\nOutstanding Reality Program, Reality Competition or Game Show (Series)\n\nLegendary (HBO Max)\n\nLizzo’s Watch Out for the Big Grrrls (Amazon Studios)\n\nShark Tank (ABC)\n\nSweet Life: Los Angeles (HBO Max)\n\nThe Real Housewives of Atlanta (Bravo)\n\n\n\nOutstanding Variety Show (Series or Special)\n\nA Black Lady Sketch Show (HBO Max)\n\nBET Awards 2022 (BET Networks)\n\nDeon Cole: Charleen’s Boy (Netflix)\n\nMartin: The Reunion (BET Networks)\n\nThe Daily Show with Trevor Noah (Comedy Central)\n\n\n\nOutstanding Children’s Program\n\nFamily Reunion (Netflix)\n\nRaising Dion (Netflix)\n\nRaven’s Home (Disney+)\n\nTab Time (YouTube Originals)\n\nWaffles + Mochi’s Restaurant (Netflix)\n\n\n\nOutstanding Performance by a Youth (Series, Special, Television Movie or Limited-Series)\n\nAlaya “That Girl Lay Lay” High – That Girl Lay Lay (Nickelodeon)\n\nCameron J. Wright – Family Reunion (Netflix)\n\nElisha Williams – The Wonder Years (ABC)\n\nKhali Spraggins – The Upshaws (Netflix)\n\nJa’Siah Young – Raising Dion (Netflix)\n\n\n\nOutstanding Host in a Talk or News/Information (Series or Special) – Individual or Ensemble\n\nJada Pinkett-Smith, Adrienne Banfield-Norris, Willow Smith – Red Table Talk (Facebook Watch)\n\nJennifer Hudson – The Jennifer Hudson Show (Syndicated)\n\nKevin Hart – Hart to Heart (Peacock)\n\nLester Holt – NBC Nightly News (NBC)\n\nTracee Ellis Ross – The Hair Tales (Hulu)\n\n\n\nOutstanding Host in a Reality/Reality Competition, Game Show or Variety (Series or Special) – Individual or Ensemble\n\nKeke Palmer – Password (NBC)\n\nLizzo – Lizzo’s Watch Out for the Big Grrrls (Amazon Studios)\n\nTabitha Brown – Tab Time (YouTube Originals)\n\nTaraji P. Henson – BET Awards 2022 (BET Networks)\n\nTrevor Noah – The Daily Show with Trevor Noah (Comedy Central)\n\n\n\nOutstanding Guest Performance\n\nAmanda Gorman – Sesame Street (HBO Max)\n\nChance the Rapper – South Side (HBO Max)\n\nColman Domingo – Euphoria (HBO Max)\n\nGlynn Turman – Queen Sugar (OWN: Oprah Winfrey Network)\n\nGabourey Sidibe – American Horror Stories (FX)\n\n\n\nOutstanding Animated Series\n\nCentral Park (Apple TV+)\n\nEureka! (Disney Junior)\n\nGracie’s Corner (YouTube)\n\nThe Proud Family: Louder and Prouder (Disney+)\n\nZootopia+ (Disney+)\n\n\n\nOutstanding Character Voice-Over Performance (Television)\n\nBilly Porter – The Proud Family: Louder and Prouder (Disney+)\n\nCedric the Entertainer – The Proud Family: Louder and Prouder (Disney+)\n\nChris Bridges – Karma’s World (Netflix)\n\nCree Summer – Rugrats (Nickelodeon)\n\nKyla Pratt – The Proud Family: Louder and Prouder (Disney+)\n\n\n\nOutstanding Short Form Series – Comedy or Drama\n\nBetween The Scenes – The Daily Show (Comedy Central)\n\nOh Hell No! With Marlon Wayans (Facebook Watch)\n\nRise Up, Sing Out (Disney+)\n\nSunday Dinner (YouTube)\n\nZootopia+ (Disney+)\n\n\n\nOutstanding Short Form Series or Special – Reality/Nonfiction\n\nBlack Independent Films: A Brief History (Turner Classic Movies)\n\nDaring Simone Biles (Snap)\n\nHistorian’s Take (PBS)\n\nNFL 360 (NFL Network)\n\nOmitted: The Black Cowboy (ESPN)\n\n\n\nOutstanding Breakthrough Creative (Television)\n\nAmy Wang – From Scratch (Netflix)\n\nBranden Jacobs-Jenkins – Kindred (FX)\n\nHannah Cope – Karma’s World (Netflix)\n\nQuinta Brunson – Abbott Elementary (ABC)\n\nSyreeta Singleton – Rap Sh!t (HBO Max)\n\n\n\nRECORDING CATEGORIES\n\n\n\nOutstanding New Artist\n\nAdam Blackstone – Legacy (BASSic Black Entertainment Records/Anderson Music Group/Empire)\n\nArmani White – Billie Eilish (Def Jam Recordings)\n\nCoco Jones – ICU (Def Jam Recordings)\n\nFivio Foreign – B.I.B.L.E (Columbia Records)\n\nSteve Lacy – Gemini Rights (RCA Records)\n\n\n\nOutstanding Male Artist\n\nBrent Faiyaz – Wasteland (Lost Kids)\n\nBurna Boy – Love, Damini (Atlantic Records)\n\nChris Brown – Breezy (Deluxe) (RCA Records/Chris Brown Entertainment)\n\nDrake – Honestly, Nevermind (OVO/Republic Records)\n\nKendrick Lamar – Mr. Morale & the Big Steppers (pgLang/Top Dawg Entertainment/Aftermath/Interscope Records)\n\n\n\nOutstanding Female Artist\n\nAri Lennox – age/sex/location (Dreamville/Interscope Records)\n\nBeyoncé – Renaissance (Columbia Records/Parkwood Entertainment)\n\nChlöe – Surprise (Columbia Records/Parkwood Entertainment)\n\nJazmine Sullivan – Hurt Me So Good (RCA Records)\n\nSZA – S.O.S. (RCA Records/Top Dawg Entertainment)\n\n\n\nOutstanding Gospel/Christian Album\n\nAll Things New – Tye Tribbett (Motown Gospel)\n\nHymns – Tasha Cobbs Leonard (Motown Gospel)\n\nKingdom Book One – Maverick City Music & Kirk Franklin (Tribl Records, Fo Yo Soul Recordings and RCA Inspiration)\n\nMy Life – James Fortune (FIYA World/MNRK Music Group)\n\nThe Urban Hymnal – Tennessee State University (TSU/Tymple)\n\n\n\nOutstanding International Song\n\nBad To Me – Wizkid (RCA Records/Starboy/Sony Music International)\n\nDiana feat. Shenseea – Fireboy DML, Chris Brown (YBNL Nation / EMPIRE)\n\nLast Last – Burna Boy (Atlantic Records)\n\nNo Woman No Cry – Tems (Def Jam Recordings)\n\nStand Strong – Davido feat. Sunday Service Choir (RCA Records/Sony Music UK)\n\n\n\nOutstanding Music Video/Visual Album\n\nAbout Damn Time – Lizzo (Atlantic Records)\n\nBe Alive – Beyoncé (Columbia Records/ Parkwood Entertainment)\n\nLift Me Up – Rihanna (Def Jam Recordings)\n\nLORD FORGIVE ME feat. FAT, Pharrell and OLU of EARTHGANG – TOBE NWIGWE (THE GOOD STEWARDS COLLECTIVE)\n\nThe Heart Part 5 – Kendrick Lamar (pgLang/Top Dawg Entertainment/Aftermath/Interscope Records)\n\n\n\nOutstanding Album\n\nage/sex/location – Ari Lennox (Dreamville/Interscope Records)\n\nBreezy (Deluxe) – Chris Brown (RCA Records/Chris Brown Entertainment)\n\nMr. Morale & the Big Steppers – Kendrick Lamar (pgLang/Top Dawg Entertainment/Aftermath/Interscope Records)\n\nRenaissance – Beyoncé (Parkwood/Columbia Records)\n\nWatch the Sun – PJ Morton (Morton Records)\n\n\n\nOutstanding Soundtrack/Compilation Album\n\nBlack Panther: Wakanda Forever – Music From and Inspired By – Ryan Coogler, Ludwig Göransson, Archie Davis and Dave Jordan (Hollywood Records)\n\nBridgerton Season Two (Soundtrack from the Netflix Series) – Kris Bowers (Capitol Records)\n\nEntergalactic – Kid Cudi (Republic Records)\n\nP-Valley: Season 2 (Music From the Original TV Series) – Various Artists (Lions Gate Records)\n\nThe Woman King – Terence Blanchard (Milan Records)\n\n\n\nOutstanding Gospel/Christian Song\n\nAll in Your Hands – Marvin Sapp (Elev8 Media & Entertainment LLC)\n\nFly (Y.M.M.F.) – Tennessee State University (TSU/Tymple)\n\nPositive – Erica Campbell (My Block Inc.)\n\nWhole World In His Hands – MAJOR. (MNRK Music Group)\n\nYour World – Jonathan McReynolds (MNRK Music Group)\n\n\n\nOutstanding Jazz Album – Instrumental\n\nDetour – Boney James (Concord Records)\n\nHenry Franklin: Jazz Is Dead 014 – Henry Franklin, Ali Shaheed Muhammad, Adrian Younge\n\nThe Funk Will Prevail – Kaelin Ellis (NCH Music)\n\nThe Gospel According to Nikki Giovanni – Javon Jackson (Solid Jackson Records)\n\nThrill Ride – Ragan Whiteside (Randis Music)\n\n\n\nOutstanding Jazz Album – Vocal\n\nLegacy – Adam Blackstone (BASSic Black Entertainment Records / Anderson Music Group / Empire)\n\nLinger Awhile – Samara Joy (Verve Records)\n\nLove and the Catalyst – Aimée Allen (Azuline)\n\nNew Standards Vol. 1 – Terri Lyne Carrington (Candid Records)\n\nThe Evening : Live at Apparatus – The Baylor Project (Be A Light)\n\n\n\nOutstanding Soul/R&B Song\n\nAbout Damn Time – Lizzo (Atlantic Records)\n\nCuff It – Beyoncé (Columbia Record/Parkwood Entertainment)\n\nGood Morning Gorgeous Remix feat. H.E.R. – Mary J. Blige (300)\n\nHurt Me So Good – Jazmine Sullivan (RCA Records)\n\nLift Me Up – Rihanna (Def Jam Recordings)\n\n\n\nOutstanding Hip Hop/Rap Song\n\nBillie Eilish – Armani White (Def Jam Recordings)\n\nCity of Gods – Fivio Foreign (Columbia Records)\n\nHotel Lobby – Quavo, Takeoff (Motown Records/Quality Control Music)\n\nThe Heart Part 5 – Kendrick Lamar (pgLang/Top Dawg Entertainment/Aftermath/Interscope Records)\n\nWait for U – Future feat. Drake and Tems (Epic Records)\n\n\n\nOutstanding Duo, Group or Collaboration (Traditional)\n\nKendrick Lamar feat. Blxst & Amanda Reifer – Die Hard (pgLang/Top Dawg Entertainment/Aftermath/Interscope Records)\n\nMary J. Blige feat. H.E.R. – Good Morning Gorgeous Remix (300)\n\nPJ Morton feat. Alex Isley and Jill Scott – Still Believe (Morton Records)\n\nSilk Sonic – Love’s Train (Atlantic Records)\n\nSummer Walker, Cardi B, and SZA – No Love (LVRN/Interscope Records)\n\n\n\nOutstanding Duo, Group or Collaboration (Contemporary)\n\nBeyoncé feat. Grace Jones and Tems – MOVE (Columbia Records/Parkwood Entertainment)\n\nChris Brown feat. Wizkid – Call Me Every Day (RCA Records/Chris Brown Entertainment)\n\nCity Girls feat. Usher – Good Love (Motown Records/Quality Control Music)\n\nFuture feat. Drake and Tems – Wait For U (Epic Records)\n\nLatto feat. Mariah Carey and DJ Khaled – Big Energy (Remix) (RCA Records)\n\n\n\n\n\nDOCUMENTARY CATEGORIES\n\n\n\nOutstanding Documentary (Film)\n\nCivil (Netflix)\n\nDescendant (Netflix)\n\nIs That Black Enough For You?!? (Netflix)\n\nLouis Armstrong’s Black & Blues (Apple TV+)\n\nSidney (Apple TV+)\n\n\n\nOutstanding Documentary (Television)\n\nBlack Love (OWN: Oprah Winfrey Network)\n\nEverything’s Gonna be All White (Showtime)\n\nFrontline (PBS)\n\nRace: Bubba Wallace (Netflix)\n\nShaq (HBO Max)\n\n\n\nWRITING CATEGORIES\n\n\n\nOutstanding Writing in a Comedy Series\n\nAisha Muharrar – Hacks – “Episode 206” (HBO Max)\n\nAyo Edebiri, Shana Gohd – What We do in the Shadows – “Episode 405” (FX)\n\nBrittani Nichols – Abbott Elementary – “Student Transfer” (ABC)\n\nKaren Joseph Adcock – The Bear – “Episode 105” (FX)\n\nQuinta Brunson – Abbott Elementary – “Development Day” (ABC)\n\n\n\nOutstanding Writing in a Drama Series\n\nAurin Squire – The Good Fight – “Episode 603” (Paramount+)\n\nBranden Jacobs-Jenkins – Kindred – “Episode 101” (FX)\n\nDavita Scarlett – The Good Fight – “Episode 604” (Paramount+)\n\nJoshua Allen – From Scratch – “Episode 105” (Netflix)\n\nMarissa Jo Cerar – Women of the Movement – “Episode 101” (ABC)\n\n\n\nOutstanding Writing in a Television Movie or Special\n\nBree West – A Wesley Christmas (BET Networks)\n\nIan Edelman, Maurice Williams – Entergalactic (Netflix)\n\nJerrod Carmichael – Jerrod Carmichael: Rothaniel (HBO Max)\n\nLil Rel Howery – Lil Rel Howery: I Said it. Y’all Thinking it (HBO Max)\n\nMatt Lopez – Father of the Bride (HBO Max)\n\n\n\nOutstanding Writing in a Motion Picture\n\nCharles Murray – The Devil You Know (Lionsgate)\n\nDana Stevens, Maria Bello – The Woman King (Sony Pictures Releasing)\n\nJordan Peele – Nope (Universal Pictures)\n\nKrystin Ver Linden – Alice (Vertical Entertainment)\n\nRyan Coogler – Black Panther: Wakanda Forever (Marvel Studios)\n\n\n\n\n\nDIRECTING CATEGORIES\n\n\n\nOutstanding Directing in a Comedy Series\n\nAngela Barnes – Atlanta – “The Homeliest Little Horse” (FX)\n\nBridget Stokes – A Black Lady Sketch Show – “Save My Edges, I’m a Donor!” (HBO Max)\n\nDee Rees – Upload – “Hamoodi” (Amazon Studios)\n\nIona Morris Jackson – black-ish – “If A Black Man Cries in the Woods” (ABC)\n\nPete Chatmon – The Flight Attendant – “Drowning Women” (HBO Max)\n\n\n\nOutstanding Directing in a Drama Series\n\nDebbie Allen – The Last Days of Ptolemy Grey – “Robyn” (Apple TV+)\n\nGiancarlo Esposito – Better Call Saul – “Axe and Grind” (AMC)\n\nGina Prince-Bythewood – Women of the Movement – “Mother and Son” (ABC)\n\nHanelle Culpepper – The Last Days of Ptolemy Grey – “Sensia” (Apple TV+)\n\nKasi Lemmons – Women of the Movement – “Episode 106” (ABC)\n\n\n\nOutstanding Directing in a Television Movie or Special\n\nAnton Cropper – Fantasy Football (Paramount+)\n\nMarta Cunningham – 61st Street (AMC)\n\nSujata Day – Definition Please (Netflix)\n\nTailiah Breon – Kirk Franklin’s The Night Before Christmas (Lifetime)\n\nTine Fields – Soul of a Nation: Screen Queens Rising (ABC)\n\n\n\nOutstanding Directing in a Motion Picture\n\nAntoine Fuqua – Emancipation (Apple)\n\nChinonye Chukwu – Till (United Artists Releasing/Orion Pictures)\n\nGina Prince-Bythewood – The Woman King (Sony Pictures Releasing)\n\nKasi Lemmons – I Wanna Dance With Somebody (Sony Pictures Releasing)\n\nRyan Coogler – Black Panther: Wakanda Forever (Marvel Studios)\n\n\n\nOutstanding Directing in a Documentary (Television or Motion Picture)\n\nNadia Hallgren – Civil (Netflix)\n\nReginald Hudlin – Sidney (Apple TV+)\n\nSacha Jenkins – Everything’s Gonna Be All White (Showtime)\n\nSacha Jenkins – Louis Armstrong’s Black & Blues (Apple TV+)\n\nW. Kamau Bell – We Need to Talk About Cosby (Showtime)\n\n\n\nLITERARY CATEGORIES\n\n\n\nOutstanding Literary Work – Fiction\n\nAfrica Risen: A New Era of Speculative Fiction – Sheree Renée Thomas (Macmillan)\n\nLight Skin Gone to Waste – Toni Ann Johnson (University of Georgia Press)\n\nTake My Hand – Dolen Perkins-Valdez (Penguin Random House)\n\nThe Keeper – Tananarive Due, Steven Barnes (Abrams Books)\n\nYou Made a Fool of Death with Your Beauty – Akwaeke Emezi (Simon & Schuster)\n\n\n\nOutstanding Literary Work – Nonfiction\n\nFinding Me – Viola Davis (HarperCollins Publishers)\n\nGrace: President Obama and Ten Days in the Battle for America – Cody Keenan (HarperCollins Publishers)\n\nRequiem for the Massacre – RJ Young (Counterpoint)\n\nUnder the Skin – Linda Villarosa (Knopf Doubleday Publishing Group)\n\nWho’s Black and Why? A Hidden Chapter from the Eighteenth-Century Invention of Race – Henry Louis Gates, Andrew S. Curran (The Belknap Press of Harvard University Press)\n\n\n\nOutstanding Literary Work – Debut Author\n\nAmerica Made Me a Black Man – Boyah Farah (HarperCollins Publishers)\n\nIllustrated Black History: Honoring the Iconic and the Unseen – George McCalman (HarperCollins)\n\nMarriage Be Hard – Kevin Fredericks, Melissa Fredericks (Penguin Random House)\n\nTruth’s Table: Black Women’s Musings on Life, Love, and Liberation – Ekemini Uwan, Christina Edmondson, Michelle Higgins (Penguin Random House Convergent Imprint)\n\nWhat the Fireflies Knew – Kai Harris (Penguin Random House)\n\n\n\nOutstanding Literary Work – Biography/Autobiography\n\nA Way Out of No Way: A Memoir of Truth, Transformation, and the New American Story – Raphael G. Warnock (Penguin Random House)\n\nScenes from My Life – Raphael G. Warnock (Penguin Random House)\n\nThe Light We Carry – Michelle Obama (Penguin Random House)\n\nWalking In My Joy: In These Streets – Jenifer Lewis (HarperCollins Publishers)\n\nYou’ve Been Chosen – Cynt Marshall (Ballantine Books)\n\n\n\nOutstanding Literary Work – Instructional\n\nBlack Joy: Stories of Resistance, Resilience, and Restoration – Tracey Lewis-Giggetts (Gallery/Simon and Schuster)\n\nCooking from the Spirit – Tabitha Brown (William Morrow, an imprint of HarperCollins Publishers)\n\nEat Plants, B*tch: 91 Vegan Recipes That Will Blow Your Meat-Loving Mind – Pinky Cole (Simon & Schuster)\n\nHomecoming: Overcome Fear and Trauma to Reclaim Your Whole Authentic Self – Thema Bryant (Penguin Random House/TarcherPerigee)\n\nThe Five Principles: A Revolutionary Path to Health, Inner Wealth, and Knowledge of Self – Khnum Ibomu (Hachette Book Group)\n\n\n\nOutstanding Literary Work – Poetry\n\nBest Barbarian – Roger Reeves (Norton)\n\nBluest Nude – Ama Codjoe (Milkweed Editions)\n\nConcentrate – Courtney Faye Taylor (Graywolf Press)\n\nMuse Found in a Colonized Body – Yesenia Montilla (Four Way Books)\n\nTo the Realization of Perfect Helplessness – Robin Coste Lewis (Alfred A. Knopf)\n\n\n\nOutstanding Literary Work – Children\n\nAblaze with Color: A Story of Painter Alma Thomas – Jeanne Walker Harvey, Loveis Wise (HarperCollins)\n\nBlack Gold – Laura Obuobi, London Ladd (HarperCollins)\n\nBlue: A History of the Color as Deep as the Sea and as Wide as the Sky – Nana Brew-Hammond, Daniel Minter (Alfred A. Knopf Books for Young Readers)\n\nStacey’s Remarkable Books – Stacey Abrams, Kitt Thomas (HarperCollins – Balzer + Bray)\n\nThe Year We Learned to Fly – Jacqueline Woodson, Rafael Lopez (Penguin Random House)\n\n\n\nOutstanding Literary Work – Youth/Teens\n\nCookies & Milk – Shawn Amos (Little, Brown Books for Young Readers)\n\nInheritance: A Visual Poem – Elizabeth Acevedo (HarperCollins – Quill Tree Books)\n\nMaybe An Artist, A Graphic Memoir – Liz Montague (Random House Studio)\n\nMe and White Supremacy: Young Readers’ Edition – Layla F. Saad (Sourcebooks)\n\nOpening My Eyes Underwater: Essays on Hope, Humanity, and Our Hero Michelle Obama – Ashley Woodfolk (Feiwel & Friends, Macmillan)\n\n\n\n\n\nPODCAST CATEGORIES\n\n\n\nOutstanding News and Information Podcast\n\n#SundayCivics (LJW Community Strategies)\n\nBeyond the Scenes – The Daily Show (Central Productions, LLC)\n\nBlack Tech Green Money (The Black Effect Podcast Network)\n\nHolding Court with Eboni K. Williams (Interval Presents & Uppity Productions)\n\nInto America with Trymaine Lee (MSNBC)\n\n\n\nOutstanding Lifestyle/Self-Help Podcast\n\nChile, Please (Honey Chile)\n\nGoOD Mornings with CurlyNikki (Walton Media, LLC)\n\nMan to Man: A Black Love Wellness Series (Black Love Inc.)\n\nMaejor Frequency (Audible)\n\nTherapy for Black Girls (Therapy for Black Girls)\n\n\n\nOutstanding Society and Culture Podcast\n\nComeback with Erica Cobb (Erica Cobb LLC/One Street Studios)\n\nHigher Learning with Van Lathan and Rachel Lindsay (Spotify & The Ringer)\n\nInto America with Trymaine Lee (MSNBC)\n\nLeVar Burton Reads (SiriusXM’s Stitcher Studios)\n\nThe Sum of Us (Higher Ground)\n\n\n\nOutstanding Arts and Entertainment Podcast\n\nAngie Martinez IRL (Media Noche Productions)\n\nBlack Girl Songbook (Spotify & The Ringer)\n\nJemele Hill is Unbothered (Unbothered Inc, Spotify, Lodge Freeway Media, Exit 39)\n\nThe Read (Loud Speakers Network)\n\nTwo Funny Mamas (Mocha Podcasts Network)\n\n\n\nCOSTUME DESIGN, MAKE-UP & HAIRSTYLING CATEGORIES\n\nOutstanding Costume Design (Television or Film)\n\nFrancine Jamison-Tanchuck – Emancipation (Apple Studios)\n\nGersha Phillips, Carly Nicodemo, Heather Constable, Christina Cattle, Sheryl Willock, Becky MacKinnon – Star Trek: Discovery (Paramount+)\n\nGersha Phillips, Carly Nicodemo, Lieze Van Tonder, Lynn Paulsen, Tova Harrison – The Woman King (Tristar Pictures)\n\nRuth E. Carter – Black Panther: Wakanda Forever (Marvel Studios)\n\nTrayce Gigi Field – A League of Their Own (Prime Video)\n\n\n\nOutstanding Make-up (Television or Film)\n\nAngie Wells – Cheaper by the Dozen (Disney+)\n\nDebi Young, Sandra Linn, Ngozi Olandu Young, Gina Bateman – We Own This City (HBO Max)\n\nMichele Lewis – The Last Days of Ptolemy Grey (Apple Studios)\n\nRen Rohling, Teresa Vest, Megan Areford – Emergency (Amazon Studios)\n\nZabrina Matiru – Surface (Apple Studios)\n\n\n\nOutstanding Hairstyling (Television or Film)\n\nCamille Friend – Black Panther: Wakanda Forever (Marvel Studios)\n\nCurtis Foreman, Ryan Randall – RuPaul’s Drag Race All Stars (Paramount+)\n\nLouisa V. Anthony, Deaundra Metzger, Maurice Beaman – TILL (United Artists Releasing/Orion Pictures)\n\nMary Daniels, Kalin Spooner, Darrin Lyons, Eric Gonzalez – All American (The CW)\n\nTracey Moss, Jerome Allen, Tamika Dixon, Lawrence “Jigga” Simmons, Jason Simmons – Fantasy Football (Paramount+)\n\n\n\nOUTSTANDING SOCIAL MEDIA PERSONALITY OF THE YEAR NOMINEES\n\n@Theconsciousless- George Lee\n\n@thechristishow – Christianee Porter\n\n@earnyourleisure – Troy Millings & Rashad Bilal\n\n@KevOnStage – Kevin Fredericks\n\n@lynaevanee – Lynae Vanee"}, {"url": "https://www.hollywoodreporter.com/news/general-news/2015-naacp-image-awards-nominations-755479/#!", "page_content": "Selma, Get On Up, Black-ish, How to Get Away With Murder and Scandal are among the top nominees for the 46th annual NAACP Image Awards, announced Tuesday.\n\nParamount’s Martin Luther King Jr. drama Selma landed eight nominations, including outstanding motion picture, outstanding actor in a motion picture (David Oyelowo), three supporting actor noms, two supporting actress noms (including one for Oprah Winfrey) and a best director nomination for helmer Ava DuVernay. Selma distributor Paramount scored 10 nominations in total, including two mentions for Chris Rock‘s Top Five. Universal’s James Brown biopic Get On Up scored five mentions, including outstanding motion picture, outstanding actor in a motion picture (Chadwick Boseman) and three supporting actress noms. Fox Searchlight’s Belle also scored five noms, including outstanding motion picture, outstanding actress in a motion picture (Gugu Mbatha-Raw), outstanding independent motion picture and outstanding writing and directing in a motion picture (theatrical).\n\nSee more NAACP Image Awards: Lupita Nyong’o, Kerry Washington Shine on the Red Carpet\n\nRelativity’s Beyond the Lights and Lionsgate/Roadside Attractions’ Dear White People round out the outstanding motion picture nominees, with both films landing noms in the acting, writing and directing categories as well.\n\nIn the TV categories, Black-ish, Orange Is the New Black and Scandal all scored six noms each. Black-ish and Orange will face off in the best comedy series, best comedy actress and best comedy supporting actress categories. Black-ish also scored a best comedy actor nom for star Anthony Anderson and two best comedy supporting actor noms. House of Lies, Key & Peele and Real Husbands of Hollywood, which scored four NAACP Image Award nominations, round out the best comedy series category. Scandal was nominated for best drama series, best drama actress (Kerry Washington), best drama supporting actor (two nominations), best drama supporting actress and outstanding writing in a drama series. Fellow ABC Thursday night drama How to Get Away With Murder landed five nominations, including outstanding drama series, best drama actress (Viola Davis), best drama supporting actor and outstanding writing in a drama series. In the best drama series category, Scandal and HTGAWM will face off against BET’s Being Mary Jane, which scored a total of four noms, Grey’s Anatomy (3 noms) and House of Cards (2 noms). In the TV movie, miniseries or dramatic special categories, Lifetime’s The Trip to Bountiful reigned supreme with six nominations, followed by fellow Lifetime projects A Day Late and a Dollar Short and The Gabby Douglas Story. ABC scored a leading 25 TV nominations, followed by Lifetime with 16 and BET with 14.\n\nSee more Shonda Rhimes’ Career in Pictures\n\nPharrell Williams and Beyonce scored the most music nominations, with four each, including in the outstanding album and outstanding male and female artist categories, respectively. Columbia Records landed a leading 10 nominations, followed by RCA with eight and Interscope with five.\n\nJane the Virgin star Gina Rodriguez, Black-ish‘s Tracee Ellis Ross, How to Get Away With Murder‘s Alfred Enoch and Aja Naomi King, and Dear White People‘s Tessa Thompson were on hand to announce the nominations in major categories at the Paley Center for Media in Beverly Hills.\n\nThe 46th annual NAACP Image Awards will take place on Friday, Feb. 6, 2015, with the show set to air live on TV One. The NAACP Image Awards honors the accomplishments of people of color in TV, music, literature and film as well as those who promote social justice through creative endeavors. Winners will be voted upon by NAACP members.\n\nRead more Benedict Cumberbatch, Channing Tatum and Actor A-List on Hollywood Fame, Embarrassing Moments and Stage Poop\n\nA full list of the nominees follows.\n\nOutstanding Comedy Series\n\n“Orange is the New Black” (Netflix)\n\n“black-ish” (ABC)\n\n“House of Lies” (Showtime)\n\n“Key & Peele” (Comedy Central)\n\n“Real Husbands of Hollywood” (BET)\n\nOutstanding Actor in a Comedy Series\n\nAndre Braugher – “Brooklyn Nine-Nine” (FOX)\n\nAnthony Anderson – “‘black-ish” (ABC)\n\nDon Cheadle – “House of Lies” (Showtime)\n\nKeegan-Michael Key – “Key & Peele” (Comedy Central)\n\nKevin Hart – “Real Husbands of Hollywood” (BET)\n\nOutstanding Actress in a Comedy Series\n\nMindy Kaling – “The Mindy Project” (FOX)\n\nNiecy Nash – “The Soul Man” (TV Land)\n\nTracee Ellis Ross – “black-ish” (ABC)\n\nUzo Aduba – “Orange is the New Black” (Netflix)\n\nWendy Raquel Robinson – “The Game” (BET)\n\nRead more Chris Rock Pens Blistering Essay on Hollywood’s Race Problem: “It’s a White Industry”\n\nOutstanding Supporting Actor in a Comedy Series\n\nBoris Kodjoe – “Real Husbands of Hollywood” (BET)\n\nGlynn Turman – “House of Lies” (Showtime)\n\nLaurence Fishburne – “black-ish” (ABC)\n\nMarcus Scribner – “black-ish” (ABC)\n\nTerry Crews – “Brooklyn Nine-Nine” (FOX)\n\nOutstanding Supporting Actress in a Comedy Series\n\nAdrienne C. Moore – “Orange is the New Black” (Netflix)\n\nLaverne Cox – “Orange is the New Black” (Netflix)\n\nLorraine Toussaint – “Orange is the New Black” (Netflix)\n\nSofia Vergara – “Modern Family” (ABC)\n\nYara Shahidi – “black-ish” (ABC)\n\nOutstanding Drama Series\n\n“Being Mary Jane” (BET)\n\n“Grey’s Anatomy” (ABC)\n\n“House of Cards” (Netflix)\n\n“How to Get Away with Murder” (ABC)\n\n“Scandal” (ABC)\n\nRead more Reese Witherspoon, Julianne Moore and Actress A-List on Nude Photo Hack, Renee Zellweger’s “Cruel” Treatment, Hollywood’s Female Problem\n\nOutstanding Actor in a Drama Series\n\nLL Cool J – “NCIS: LA” (CBS)\n\nOmar Epps – “Resurrection” (ABC)\n\nOmari Hardwick – “Being Mary Jane” (BET)\n\nShemar Moore – “Criminal Minds” (CBS)\n\nTaye Diggs – “Murder in the First” (TNT)\n\nOutstanding Actress in a Drama Series\n\nGabrielle Union – “Being Mary Jane” (BET)\n\nKerry Washington – “Scandal” (ABC)\n\nNicole Beharie – “Sleepy Hollow” (FOX)\n\nOctavia Spencer – “Red Band Society” (FOX)\n\nViola Davis – “How to Get Away with Murder” (ABC)\n\nOutstanding Supporting Actor in a Drama Series\n\nAlfred Enoch – “How to Get Away with Murder” (ABC)\n\nCourtney B. Vance – “Masters of Sex” (Showtime)\n\nGuillermo Diaz – “Scandal” (ABC)\n\nJeffrey Wright – “Boardwalk Empire” (HBO)\n\nJoe Morton – “Scandal” (ABC)\n\nRead more Comedy Actress Roundtable: Taylor Schilling, Zooey Deschanel, Mindy Kaling on Fake-Peeing, Showering With Co-Stars and Rude Fans\n\nOutstanding Supporting Actress in a Drama Series\n\nAja Naomi King – “How to Get Away with Murder” (ABC)\n\nAlfre Woodard – “State of Affairs” (NBC)\n\nChandra Wilson – “Grey’s Anatomy” (ABC)\n\nKhandi Alexander – “Scandal” (ABC)\n\nJada Pinkett Smith – “Gotham” (FOX)\n\nOutstanding Television Movie, Mini-Series or Dramatic Special\n\n“A Day Late and a Dollar Short” (Lifetime Networks)\n\n“American Horror Story: Freak Show” (FX)\n\n“Drumline: A New Beat” (VH1)\n\n“The Gabby Douglas Story” (Lifetime Networks)\n\n“The Trip to Bountiful” (Lifetime Networks)\n\nOutstanding Actor in a Television Movie, Mini-Series or Dramatic Special\n\nBlair Underwood – “The Trip to Bountiful” (Lifetime Networks)\n\nCharles S. Dutton – “Comeback Dad” (UP Entertainment)\n\nLarenz Tate – “Gun Hill” (BET)\n\nMekhi Phifer – “A Day Late and a Dollar Short” (Lifetime Networks)\n\nVing Rhames – “A Day Late and a Dollar Short” (Lifetime Networks)\n\nRead more Drama Actor Roundtable: Jon Hamm, Josh Charles, Mark Ruffalo on Character Deaths, Twitter’s Merits and Typecasting Fears\n\nOutstanding Actress in a Television Movie, Mini-Series or Dramatic Special\n\nAngela Bassett – “American Horror Story: Freak Show” (FX)\n\nCicely Tyson – “The Trip to Bountiful” (Lifetime Networks)\n\nKeke Palmer – “The Trip to Bountiful” (Lifetime Networks)\n\nRegina King – “The Gabby Douglas Story” (Lifetime Networks)\n\nVanessa Williams – “The Trip to Bountiful” (Lifetime Networks)\n\nOutstanding News/ Information (Series or Special)\n\n“America After Ferguson” (PBS)\n\n“Finding Your Roots with Henry Louis Gates, Jr.” (PBS)\n\n“Melissa Harris Perry” (MSNBC)\n\n“Oprah’s Lifeclass” (OWN)\n\n“Unsung” (TV One)\n\nOutstanding Talk Series\n\n“Oprah Prime” (OWN)\n\n“Steve Harvey” (Syndicated)\n\n“The Queen Latifah Show” (Syndicated)\n\n“The View” (ABC)\n\n“The Wendy Williams Show” (Syndicated)\n\nRead more Reality Roundtable: Jeff Probst, Tim Gunn, Carson Daly on ‘Duck Dynasty’ Furor, Pushing Contestants Too Far\n\nOutstanding Reality Series\n\n“Shark Tank” (ABC)\n\n“Iyanla: Fix My Life” (OWN)\n\n“Dancing with the Stars” (ABC)\n\n“The Voice” (NBC)\n\n“Welcome to Sweetie Pie’s” (OWN)\n\nOutstanding Variety (Series or Special)\n\n“BET Awards” (BET)\n\n“Family Feud” (Syndicated)\n\n“On the Run: Beyoncé and Jay Z” (HBO)\n\n“Oprah’s Master Class” (OWN)\n\n“UNCF An Evening of Stars” (NBC, CBS, ABC, FOX, The CW, BET, Centric)\n\nOutstanding Children’s Program\n\n“Doc McStuffins” (Disney Junior)\n\n“Anna Deavere Smith: A Youngarts Masterclass” (HBO)\n\n“HALO Awards” (Nickelodeon)\n\n“Dora and Friends: Into The City!” (Nickelodeon)\n\n“Kid President: Declaration of Awesome” (HUB)\n\nRead more Comedy Showrunners Roundtable: Chuck Lorre, Jenji Kohan, Mike Judge on Ejaculation Shots, Awful Pitch Meetings and Salary Negotiations\n\nOutstanding Performance by a Youth in a Youth/Children’s Program (Series or Special)\n\nAmber Montana – “Haunted Hathaways” (Nickelodeon)\n\nChina Anne McClain – “How to Build a Better Boy” (Disney Channel)\n\nCurtis Harris – “Haunted Hathaways” (Nickelodeon)\n\nFatima Ptacek – “Dora and Friends: Into The City!” (Nickelodeon)\n\nTaliyah Whitaker – “Wallykazam!” (Nickelodeon)\n\nOutstanding Host in a Talk, Reality, News/ Information or Variety\n\nSteve Harvey – “Steve Harvey” (Syndicated)\n\nQueen Latifah – “The Queen Latifah Show” (Syndicated)\n\nChris Rock – “BET Awards” (BET)\n\nGwen Ifill – “America After Ferguson” (PBS)\n\nMelissa Harris Perry – “Melissa Harris Perry” (MSNBC)\n\nOutstanding New Artist\n\nAloe Blacc (XIX Recordings/Interscope Records)\n\nErica Campbell (My Block Inc./eOne Music)\n\nJhene Aiko (Def Jam Recordings)\n\nLiv Warfield (Kobalt Label Services)\n\n3 Winans Brothers (BMG)\n\nRead more Comedy Actor Roundtable: Andy Samberg, Matt LeBlanc, Tony Hale Talk Crazy Auditions, Typecasting Fears and Mortifying Moments\n\nOutstanding Male Artist\n\nJohn Legend (Columbia Records)\n\nKem (Motown – Capitol)\n\nKendrick Lamar (Interscope Records)\n\nMichael Jackson (Epic Records)\n\nPharrell Williams (Columbia Records)\n\nOutstanding Female Artist\n\nAlicia Keys (RCA Records)\n\nBeyoncé (Columbia Records)\n\nJennifer Hudson (RCA Records)\n\nLedisi (Verve Records)\n\nMary J Blige (Capitol)\n\nOutstanding Duo, Group or Collaboration\n\n“Being With You” – Smokey Robinson feat. Mary J Blige (Verve)\n\n“Brand New” – Pharrell Williams feat. Justin Timberlake (Columbia Records)\n\n“Gust of Wind” – Pharrell Williams feat. Daft Punk (Columbia Records)\n\n“Love, Marriage & Divorce” – Toni Braxton & Babyface (Def Jam Recordings)\n\n“Stay with Me” – Sam Smith feat. Mary J Blige (Capitol)\n\nRead more Drama Showrunner Roundtable: Watch the Full, Uncensored Conversation With Aaron Sorkin, Vince Gilligan, Matthew Weiner\n\nOutstanding Jazz Album\n\n“My Old Friend: Celebrating George Duke” – Al Jarreau (Concord)\n\n“Dave Koz and Friends: The 25th of December” – Dave Koz (Concord Records)\n\n“Beautiful Life” – Dianne Reeves (Concord)\n\n“Living My Dream” – Jonathan Butler (Rendezvous Music)\n\n“Up” – Stanley Clarke (Mack Avenue Records)\n\nOutstanding Gospel Album (Traditional or Contemporary)\n\n“Duets” – Donnie McClurkin (RCA Inspiration)\n\n“Help” – Erica Campbell (My Block Inc./eOne Music)\n\n“I Will Trust” – Fred Hammond (RCA Inspiration)\n\n“Where My Heart Belongs” – Gladys Knight (Shadow Mountain Records)\n\n“Journey To Freedom” – Michelle Williams (eOne Music)\n\nOutstanding Music Video\n\n“Pretty Hurts” – Beyoncé (Columbia Records)\n\n“You & I (Nobody in the World)” – John Legend (Columbia Records)\n\n“It’s You” – KEM (Motown – Capitol)\n\n“i” – Kendrick Lamar (TDE/Interscope)\n\n“Love Never Felt So Good” – Michael Jackson feat. Justin Timberlake (Epic Records)\n\nRead more THR Roundtable: Claire Danes, Julianna Margulies, Keri Russell on Explicit Sex Scenes, Crazy Fans and Lactating on George Clooney\n\nOutstanding Song\n\n“We Are Here” – Alicia Keys (RCA Records)\n\n“The Man” – Aloe Blacc (Interscope Records)\n\n“Pretty Hurts” – Beyoncé (Columbia Records)\n\n“i” – Kendrick Lamar (TDE/Interscope)\n\n“Good Kisser” – Usher (RCA Records)\n\nOutstanding Album\n\n“Aretha Franklin Sings the Great Diva Classics” – Aretha Franklin (RCA Records)\n\n“Beyoncé Platinum Edition” – Beyoncé (Columbia Records)\n\n“JHUD” – Jennifer Hudson (RCA Records)\n\n“G I R L” – Pharrell Williams (Columbia Records)\n\n“Love, Marriage & Divorce” – Toni Braxton & Babyface (Def Jam Recordings)\n\nOutstanding Literary Work – Fiction\n\n“A Wanted Woman” – Eric Jerome Dickey (Penguin Random House)\n\n“An Untamed State” – Roxane Gay (Grove/Atlantic – Black Cat)\n\n“Another Woman’s Man” – Shelly Ellis (Kensington Publishing Corp.)\n\n“Momma: Gone” – Nina Foxx (Brown Girls Publishing)\n\n“The Prodigal Son” – Kimberla Lawson Roby (Grand Central Publishing/Hachette Book Group)\n\nOutstanding Literary Work – Non-Fiction\n\n“Bad Feminist” – Roxane Gay (Harper Perennial/HarperCollins)\n\n“Just Mercy: A Story of Justice and Redemption” – Bryan Stevenson (Spiegel & Grau)\n\n“Place not Race: A New Vision of Opportunity in America” – Sheryll Cashin (Beacon Press)\n\n“The Bill of the Century: The Epic Battle for the Civil Rights Act” – Clay Risen (Bloomsbury Press)\n\n“Who We Be: The Colorization of America” – Jeff Chang (St. Martin’s Press)\n\nRead more African-American Film Critics Association Lauds ‘Selma’\n\nOutstanding Literary Work – Debut Author\n\n“Forty Acres” – Dwayne Alexander Smith (Atria Books)\n\n“Queen Sugar” – Natalie Baszile (Pamela Dorman Books/Penguin Random House)\n\n“Remedy For A Broken Angel” – Toni Ann Johnson (Nortia Press)\n\n“The 16th Minute of Fame: An Insider’s Guide for Maintaining Success Beyond 15 Minutes of Fame” – Darrell Miller (Dunham Books)\n\n“Time of the Locust” – Morowa Yejide (Atria Books)\n\nOutstanding Literary Work – Biography/ Auto Biography\n\n“Breaking Ground: My Life in Medicine” – Louis Sullivan with David Chanoff (University of Georgia Press)\n\n“Handbook for an Unpredictable Life: How I Survived Sister Renata and My Crazy Mother, and Still Came Out Smiling (with Great Hair)” – Rosie Perez (Crown Archetype)\n\n“Life In Motion” – Misty Copeland (Touchstone)\n\n“Mayor for Life” – Marion Barry, Omar Tyree (Strebor Books)\n\n“Stand Up Straight and Sing!” – Jessye Norman (Houghton Mifflin Harcourt)\n\nOutstanding Literary Work – Instructional\n\n“101 Scholarship Applications: What It Takes to Obtain a Debt-Free College Education” – Gwen Richardson (Cushcity Communications)\n\n“10-Day Green Smoothie Cleanse” – JJ Smith (Atria Books/Simon & Schuster)\n\n“Afro-Vegan: Farm-Fresh African, Caribbean, and Southern Flavors Remixed” – Bryant Terry (Ten Speed Press)\n\n“Justice While Black: Helping African-American Families Navigate and Survive the Criminal Justice System” – Robbin Shipp, Nick Chiles (Agate Bolden)\n\n“Promises Kept: Raising Black Boys to Succeed in School and in Life” – Joe Brewster, Michele Stephenson, Hilary Beard (Spiegel & Grau)\n\nRead more Chris Rock’s Best ‘Saturday Night Live’ Moments\n\nOutstanding Literary Work – Poetry\n\n“Citizen: An American Lyric” – Claudia Rankine (Graywolf Press)\n\n“Digest” – Gregory Pardlo (Four Way Books)\n\n“The New Testament” – Jericho Brown (Copper Canyon Press)\n\n“The Poetry of Derek Walcott 1948-2013″ – Derek Walcott, Selected by Glyn Maxwell (Farrar, Straus and Giroux)\n\n“We Didn’t Know Any Gangsters” – Brian Gilmore (Cherry Castle Publishing, LLC)\n\nOutstanding Literary Work – Children\n\n“Beautiful Moon” – Tonya Bolden (Author), Eric Velasquez (Illustrator) (Abrams/Abrams Books for Young Readers)\n\n“Little Melba and Her Big Trombone” – Katheryn Russell-Brown (Author), Frank Morrison (Illustrator) (Lee & Low Books)\n\n“Malcolm Little” – Ilyasah Shabazz (Author), AG Ford (Illustrator) (Simon & Schuster)\n\n“Searching for Sarah Rector” – Tonya Bolden (Abrams/Abrams Books for Young Readers)\n\n“Dork Diaries 8: Tales From A Note-So-Happily Ever After” – Rachel Renee Russell with Nikki Russell and Erin Russell (Simon & Schuster)\n\nOutstanding Literary Work – Youth/Teens\n\n“Because They Marched: The People’s Campaign for Voting Rights That Changed America” – Russell Freedman (Holiday House)\n\n“Brown Girl Dreaming” – Jacqueline Woodson (Nancy Paulsen Books)\n\n“Revolution” – Deborah Wiles (Scholastic Press)\n\n“The Freedom Summer Murders” – Don Mitchell (Scholastic Press)\n\n“The Red Pencil” – Andrea Davis Pinkney (Author), Shane Evans (Illustrator) (Little, Brown Books for Young Readers)\n\nOutstanding Motion Picture\n\n“Belle” (Fox Searchlight Pictures/ DJ Films)\n\n“Beyond The Lights” (Relativity Media)\n\n“Dear White People” (Lionsgate and Roadside Attractions)\n\n“Get On Up” (Universal Pictures)\n\n“Selma” (Paramount Pictures)\n\nRead more ‘Dear White People’ Director on Making a Comedy About Race and Spike Lee’s Heroism\n\nOutstanding Actor in a Motion Picture\n\nChadwick Boseman – “Get On Up” (Universal Pictures)\n\nDavid Oyelowo – “Selma” (Paramount Pictures)\n\nDenzel Washington – “The Equalizer” (Columbia Pictures)\n\nIdris Elba – “No Good Deed” (Screen Gems)\n\nNate Parker – “Beyond The Lights” (Relativity Media)\n\nOutstanding Actress in a Motion Picture\n\nGugu Mbatha-Raw – “Belle” (Fox Searchlight Pictures/ DJ Films)\n\nQuvenzhané Wallis – “Annie” (Columbia Pictures)\n\nTaraji P. Henson – “No Good Deed” (Screen Gems)\n\nTessa Thompson – “Dear White People” (Lionsgate and Roadside Attractions)\n\nViola Davis – “The Disappearance of Eleanor Rigby” (The Weinstein Company)\n\nOutstanding Supporting Actor in a Motion Picture\n\nAndré Holland – “Selma” (Paramount Pictures)\n\nCedric the Entertainer – “Top Five” (Paramount Pictures)\n\nCommon – “Selma” (Paramount Pictures)\n\nDanny Glover – “Beyond The Lights” (Relativity Media)\n\nWendell Pierce – “Selma” (Paramount Pictures)\n\nRead more Critic’s Notebook: Shonda Rhimes and the Elusive Power of Diversity\n\nOutstanding Supporting Actress in a Motion Picture\n\nCarmen Ejogo – “Selma” (Paramount Pictures)\n\nJill Scott – “Get On Up” (Universal Pictures)\n\nOctavia Spencer – “Get On Up” (Universal Pictures)\n\nOprah Winfrey – “Selma” (Paramount Pictures)\n\nViola Davis – “Get On Up” (Universal Pictures)\n\nOutstanding Independent Motion Picture\n\n“Belle” (Fox Searchlight Pictures/ DJ Films)\n\n“Dear White People” (Lionsgate and Roadside Attractions)\n\n“Half of a Yellow Sun” (monterey media inc.)\n\n“Life of a King” (Animus Films/Serena Films)\n\n“JIMI: All Is By My Side” (XLrator Media)\n\nOutstanding Documentary (Theatrical)\n\n“Documented” (Apo Anak Productions)\n\n“Finding Fela” (Jigsaw Productions)\n\n“I Am Ali” (Focus World/Fisheye Films)\n\n“Keep On Keepin On” (RADiUS)\n\n“Through A Lens Darkly: Black Photographers and the Emergence of a People” (Chimpanzee Productions, Inc.)\n\nRead more ‘Being Mary Jane’s’ Gabrielle Union Grills Her Bosses About Writing for a Black Audience: “We Actually Do Black on Purpose”\n\nOutstanding Documentary (Television)\n\n“American Experience: Freedom Summer” (PBS)\n\n“Bad Boys” (ESPN)\n\n“Mr. Dynamite: The Rise of James Brown” (HBO)\n\n“Rand University” (ESPN)\n\n“The War Comes Home: Soledad O’Brien Reports” (CNN)\n\nOutstanding Writing in a Comedy Series\n\nBrigette Munoz-Liebowitz – “Brooklyn Nine-Nine” – Road Trip (FOX)\n\nAisha Muharrar – “Parks and Recreation” – Ann & Chris (NBC)\n\nRegina Hicks – “Instant Mom” – A Kids’s Choice (Nickelodeon and Nick@Nite)\n\nSara Hess – “Orange is the New Black” – It Was the Change (Netflix)\n\nMindy Kaling – “The Mindy Project” – Danny and Mindy (FOX)\n\nOutstanding Writing in a Dramatic Series\n\nZahir McGhee – “Scandal” – Mama Said Knock You Out (ABC)\n\nErika Green Swafford – “How to Get Away with Murder” – Let’s Get To Scooping (ABC)\n\nMara Brock Akil – “Being Mary Jane” – Uber Love (BET)\n\nWarren Leight, Julie Martin – “Law & Order: SVU” – American Disgrace (NBC)\n\nZoanne Clack – “Grey’s Anatomy” – You Be Illin’ (ABC)\n\nRead more Shonda Rhimes Opens Up About ‘Angry Black Woman’ Flap, Messy ‘Grey’s Anatomy’ Chapter and the ‘Scandal’ Impact\n\nOutstanding Writing in a Motion Picture (Television)\n\nKarin Gist, Regina Hicks – “Drumline: A New Beat” (VH1)\n\nReggie Bythewood – “Gun Hill” (BET)\n\nShernold Edwards – “A Day Late and a Dollar Short” (Lifetime Networks)\n\nSterling Anderson, Maria Nation – “The Gabby Douglas Story” (Lifetime Networks)\n\nSharon Brathwaite, Peres Owino – “Seasons of Love” (Lifetime Networks)\n\nOutstanding Writing in a Motion Picture (Theatrical)\n\nChris Rock – “Top Five” (Paramount Pictures)\n\nRichard Wenk – “The Equalizer” (Columbia Pictures)\n\nMisan Sagay – “Belle” (Fox Searchlight Pictures/ DJ Films)\n\nJustin Simien – “Dear White People” (Roadside Attractions and Lionsgate)\n\nMargaret Nagle – “The Good Lie” (Alcon Entertainment)\n\nOutstanding Directing in a Comedy Series\n\nKen Whittingham – “Parks and Recreation” – Prom (NBC)\n\nKen Whittingham – “The Mindy Project” – Think Like a Peter (FOX)\n\nReginald Hudlin – “Bad Judge” – Knife to a Gunfight (NBC)\n\nLinda Mendoza – “Bad Judge” – One Brave Waitress (NBC)\n\nStan Lathan – “Real Husbands of Hollywood” – No New Friends (BET)\n\nRead more Michael B. Jordan on Playing the Human Torch: “A Reflection of the Times We Live in”\n\nOutstanding Directing in a Dramatic Series\n\nAnton Cropper – “Suits” – One-Two-Three Go… (USA)\n\nCarl Franklin – “House of Cards” – Chapter 14 (Netflix)\n\nCary Joji Fukunaga – “True Detective” – Who Goes There (HBO)\n\nHanelle Culpepper – “Criminal Minds” – The Edge of Winter (CBS)\n\nMillicent Shelton – “The Divide” – And the Little Ones Get Caught (WE tv)\n\nOutstanding Directing in a Motion Picture(Television)\n\nBille Woodruff – “Drumline: A New Beat” (VH1)\n\nGreg Champion – “The Gabby Douglas Story” (Lifetime Networks)\n\nMichael Wilson – “The Trip to Bountiful” (Lifetime Networks)\n\nReggie Bythewood – “Gun Hill” (BET)\n\nStephen Tolkin – “A Day Late and a Dollar Short” (Lifetime Networks)\n\nOutstanding Directing in a Motion Picture (Theatrical)\n\nAmma Asante – “Belle” (Fox Searchlight Pictures/ DJ Films)\n\nAntoine Fuqua – “The Equalizer” (Columbia Pictures)\n\nAva DuVernay – “Selma” (Paramount Pictures)\n\nJohn Ridley – “JIMI: All Is By My Side” (XLrator Media)\n\nGina Prince-Bythewood – “Beyond The Lights” (Relativity Media)\n\nOutstanding Character Voice-Over Performance\n\nJamie Foxx – “Rio 2″ (20th Century Fox)\n\nLoretta Devine – “Doc McStuffins” (Disney Junior)\n\nMorgan Freeman – “The Lego Movie” (Warner Bros. Pictures/Village Roadshow Pictures/Ratpac-Dune Entertainment/Lego System A/S/Vertigo Entertainment/Lin Pictures)\n\nTracy Morgan – “The Boxtrolls” (Focus Features)\n\nZoe Saldana – “The Book of Life” (20th Century Fox)"}, {"url": "https://variety.com/2008/biz/awards/the-39th-naacp-image-award-nominations-1117978663/", "page_content": "THE 39th NAACP IMAGE AWARDS NOMINATIONS\n\nMOTION PICTURE CATEGORIES\n\nMotion Picture\n\n“American Gangster” (Universal)\n\n“The Great Debaters” (The Weinstein Co.)\n\n“I Am Legend” (Warner Bros.)\n\n“Talk To Me” (Focus Features)\n\n“Tyler Perry’s Why Did I Get Married?” (Lionsgate Films)\n\nIndependent or Foreign Film\n\n“A Mighty Heart” (Paramount Vantage)\n\n“Dirty Laundry” (Codeblack Entertainment)\n\n“Honeydripper” (Emerging Pictures)\n\n“My Brother” (Codeblack Entertainment)\n\n“Persepolis” (Sony Pictures Classics)\n\nActor in a Motion Picture\n\nColumbus Short – “Stomp The Yard” (Screen Gems)\n\nDenzel Washington – “The Great Debaters” (The Weinstein Co.)\n\nDon Cheadle – “Talk To Me” (Focus Features)\n\nTerrence Howard – “Pride” (Lionsgate Films)\n\nWill Smith – “I Am Legend” (Warner Bros.)\n\nActress in a Motion Picture\n\nAngelina Jolie – “A Mighty Heart” (Paramount Vantage)\n\nHalle Berry – “Things We Lost In the Fire” (Dreamworks)\n\nJill Scott – “Tyler Perry’s Why Did I Get Married?” (Lionsgate Films)\n\nJurnee Smollett – “The Great Debaters” (The Weinstein Co.)\n\nTaraji P. Henson – “Talk To Me” (Focus Features)\n\nSupporting Actor in a Motion Picture\n\nChiwetel Ejiofor – “Talk To Me” (Focus Features)\n\nDenzel Whitaker – “The Great Debaters” (The Weinstein Co.)\n\nForest Whitaker – “The Great Debaters” (The Weinstein Co.)\n\nNate Parker – “The Great Debaters” (The Weinstein Co.)\n\nTyler Perry – “Tyler Perry’s Why Did I Get Married?” (Lionsgate Films)\n\nSupporting Actress in a Motion Picture\n\nJanet Jackson – “Tyler Perry’s Why Did I Get Married?” (Lionsgate Films)\n\nLoretta Devine – “This Christmas” (Screen Gems)\n\nMeagan Good – “Stomp The Yard” (Screen Gems)\n\nQueen Latifah – “Hairspray” (New Line)\n\nRuby Dee – “American Gangster” (Universal)\n\nDocumentary\n\n“Bastards of the Party” (HBO)\n\n“Darfur Now” (Warner Independent Pictures)\n\n“Desert Bayou” (Cinema Libre Productions)\n\n“Price of Sugar” (Mitropolous Films)\n\n“Sicko” (The Weinstein Co.)\n\nTELEVISION CATEGORIES\n\nComedy Series\n\n“30 Rock” (NBC)\n\n“Everybody Hates Chris” (CW)\n\n“Girlfriends” (CW)\n\nTyler Perry’s “House of Payne” (TBS)\n\n“Ugly Betty” (ABC)\n\nActor in a Comedy Series\n\nDonald Faison – “Scrubs” (NBC)\n\nDulé Hill – “Psych” (USA Network)\n\nLaVan Davis – “Tyler Perry’s House of Payne” (TBS)\n\nReggie Hayes – “Girlfriends” (CW)\n\nTyler James Williams – “Everybody Hates Chris” (CW)\n\nActress in a Comedy Series\n\nAmerica Ferrera – “Ugly Betty” (ABC)\n\nGolden Brooks – “Girlfriends” (CW)\n\nTia Mowry – “The Game” (CW)\n\nTichina Arnold – “Everybody Hates Chris” (CW)\n\nTracee Ellis Ross – “Girlfriends” (CW)\n\nSupporting Actor in a Comedy Series\n\nBlair Underwood – “New Adventures of Old Christine” (CBS)\n\nLance Gross – “Tyler Perry’s House of Payne” (TBS)\n\nRomany Malco – “Weeds” (Showtime)\n\nTerry Crews – “Everybody Hates Chris” (CW)\n\nTracy Morgan – “30 Rock” (NBC)\n\nSupporting Actress in a Comedy Series\n\nKeesha Sharp – “Girlfriends” (CW)\n\nTonye Patano – “Weeds” (Showtime)\n\nVanessa L. Williams – “Ugly Betty” (ABC)\n\nVivica A. Fox – “Curb Your Enthusiasm” (HBO)\n\nWendy Raquel Robinson – “The Game” (CW)\n\nDrama Series\n\n“Grey’s Anatomy” (ABC)\n\n“House” (FOX)\n\n“K-Ville” (FOX)\n\n“Lincoln Heights” (ABC Family)\n\n“The Unit” (CBS)\n\nActor in a Drama Series\n\nAnthony Anderson – “K-Ville” (FOX)\n\nDennis Haysbert – “The Unit” (CBS)\n\nHill Harper – “CSI: NY” (CBS)\n\nJesse L. Martin – “Law & Order” (NBC)\n\nJimmy Smits – “Cane” (CBS)\n\nActress in a Drama Series\n\nCCH Pounder – “The Shield” (FX)\n\nJennifer Beals – “The L Word” (Showtime)\n\nNicki Micheaux – “Lincoln Heights” (ABC Family)\n\nRegina Taylor – “The Unit” (CBS)\n\nWendy Davis – “Army Wives” (Lifetime)\n\nSupporting Actor in a Drama Series\n\nBlair Underwood – “Dirty Sexy Money” (ABC)\n\nJames Pickens, Jr. – “Grey’s Anatomy” (ABC)\n\nMekhi Phifer – “ER” (NBC)\n\nOmar Epps – “House” (FOX)\n\nTaye Diggs – “Private Practice” (ABC)\n\nSupporting Actress in a Drama Series\n\nAudra McDonald – “Private Practice” (ABC)\n\nChandra Wilson – “Grey’s Anatomy” (ABC)\n\nMarianne Jean-Baptiste – “Without A Trace”(CBS)\n\nPam Grier – “The L Word” (Showtime)\n\nS. Epatha Merkerson – “Law & Order” (NBC)\n\nTelevision Movie, Mini-Series or Dramatic Special\n\n“The Bronx is Burning” (ESPN)\n\n“Bury My Heart at Wounded Knee” (HBO)\n\n“Five Days” (HBO)\n\n“Life Support” (HBO)\n\n“The List” (ABC Family)\n\nActor in a Television Movie, Mini-Series or Dramatic Special\n\nAdam Beach – “Bury My Heart at Wounded Knee” (HBO)\n\nDaniel Sunjata – “The Bronx is Burning” (ESPN)\n\nEvan Ross – “Life Support” (HBO)\n\nWayne Brady – “The List” (ABC Family)\n\nWendell Pierce – “Life Support” (HBO)\n\nActress in a Television Movie, Mini-Series or Dramatic Special\n\nAnika Noni Rose – “The Starter Wife” (USA Network)\n\nHolly Robinson Peete – “Matters of Life & Dating” (Lifetime)\n\nQueen Latifah – “Life Support” (HBO)\n\nS. Epatha Merkerson – “Girl, Positive” (Lifetime)\n\nSydney Tamiia Poitier – “The List” (ABC Family)\n\nActor in a Daytime Drama Series\n\nBryton McClure – “The Young And The Restless” (CBS)\n\nKamar de los Reyes – “One Life to Live” (ABC)\n\nKristoff St. John – “The Young And The Restless” (CBS)\n\nMykel Shannon Jenkins – “The Bold and the Beautiful” (CBS)\n\nTobias Truvillion – “One Life to Live” (ABC)\n\nActress in a Daytime Drama Series\n\nBrook Kerr – “Passions” (NBC)\n\nChristel Khalil – “The Young And The Restless” (CBS)\n\nNazanin Boniadi – “General Hospital” (ABC)\n\nTika Sumpter – “One Life to Live” (ABC)\n\nTracey Ross – “Passions” (NBC)\n\nNews/ Information – (Series or Special)\n\n“American Gangster” (BET)\n\n“American Morning Series: MLK Papers” (CNN)\n\n“Dr. Sonja Gupta: Saving Your Life” (CNN)\n\n“Good Morning America-Breast Cancer Mission” (ABC)\n\n“In Conversation: The Senator Barack Obama Interview” (TVOne)\n\nTalk – (Series)\n\n“Judge Mathis” (Syndicated)\n\n“Our World with Black Enterprise” (Syndicated)\n\n“Real Time with Bill Maher” (HBO)\n\n“Tavis Smiley ‘Crisis in Darfur’” (PBS)\n\n“The Tyra Banks Show” (Syndicated)\n\nReality – (Series)\n\n“American Idol” (FOX)\n\n“America’s Next Top Model” (CW)\n\n“Dancing with the Stars” (ABC)\n\n“Extreme Makeover: Home Edition” (ABC)\n\n“Run’s House 4” (MTV)\n\nVariety – (Series or Special)\n\n“2007 VH1 Hip-Hop Honors” (VH1)\n\n“An Evening of Stars: Tribute to Aretha Franklin” (Syndicated)\n\n“BET Awards” (BET)\n\n“Celebration of Gospel ‘07” (BET)\n\n“Russell Simmons Presents Def Poetry” (HBO)\n\nChildren’s Program\n\n“Cory in the House” (Disney Channel)\n\n“Dora The Explorer” (Nickelodeon)\n\n“Go, Diego, Go” (Nickelodeon)\n\n“High School Musical 2” (Disney Channel)\n\n“That’s So Raven” (Disney Channel)\n\nPerformance in a Youth/Children’s Program – Series or Special\n\nAndre Benjamin – “Class of 3000” (Cartoon Network)\n\nKathleen Herles – “Dora the Explorer” (Nickelodeon)\n\nKyle Massey – “Cory in the House” (Disney Channel)\n\nLil’ JJ – “Just Jordan” (Nickelodeon)\n\nRaven-Symoné – “That’s So Raven” (Disney Channel)\n\nDIRECTING CATEGORIES\n\nDirecting in a Comedy Series\n\nAli LeRoi – “Everybody Hates Chris: Everybody Hates Baseball” (CW)\n\nKen Whittingham – “The Office: Phyllis’s Wedding” (NBC)\n\nMillicent Shelton – “Everybody Hates Chris: Everybody Hates the Substitute” (CW)\n\nSalim Akil – “Girlfriends: To Be Determined…It’s Been Determined” (CW)\n\nSeith Mann – “Entourage: The Dream Team” (HBO)\n\nDirecting in a Dramatic Series\n\nDarnell Martin – “Law & Order: CI: Bombshell” (NBC)\n\nKevin Hooks – “Lincoln Heights: Pilot” (ABC Family)\n\nParis Barclay – “CSI: Meet Market” (CBS)\n\nRoxanne Dawson – “Heroes: Run” (NBC)\n\nSeith Mann – “Friday Night Lights: Are You Ready For Friday Night?” (NBC)\n\nDirecting in a Motion Picture (Theatrical or Television)Denzel Washington – “The Great Debaters” (The Weinstein Co.)\n\nKasi Lemmons – “Talk To Me” (Focus Features)\n\nPreston Whitmore – “This Christmas” (Screen Gems)\n\nSunu Gonera – ” Pride” (Lionsgate Films)\n\nSylvain White – “Stomp the Yard” (Screen Gems)\n\nWRITING CATEGORIES\n\nWriting in a Comedy Series\n\nAli LeRoi – “Everybody Hates Chris: Everybody Hates Guidance Counselor” (CW)\n\nKaren Gist – “Girlfriends: Spree To Be Free” (CW)\n\nMindy Kaling – “The Office: Branch Wars” (NBC)\n\nSara Finney-Johnson – “The Game: The Big Chill” (CW)\n\nSilvio Horta – “Ugly Betty: A Nice Day For A Posh Wedding” (ABC)\n\nWriting in a Dramatic Series\n\nJanine Sherman Barrois – “ER: Breach of Trust” (NBC)\n\nKathleen McGhee-Anderson and Anthony Sparks – “Lincoln Heights: The Vision” (ABC Family)\n\nNatalie Chaidez – “Heroes: The Fix” (NBC)\n\nShonda Rhimes – “Private Practice: In Which We Meet Addison, A Nice Girl From Somewhere Else” (ABC)\n\nShonda Rhimes and Krista Vernoff – “Grey’s Anatomy: A Change is Gonna Come” (ABC)\n\nWriting in a Motion Picture (Theatrical or Television)\n\nJohn Sayles – “Honeydripper” (Emerging Pictures)\n\nMichael Genet and Rick Famuyiwa – “Talk To Me” (Focus Features)\n\nRichard LaGravenese – “Freedom Writers” (Paramount Pictures)\n\nRobert Eisele – “The Great Debaters” (The Weinstein Co.)\n\nSteve Zaillian – “American Gangster” (Universal)\n\nRECORDING CATEGORIES\n\nNew Artist\n\nChrisette Michele (Island Def Jam)\n\nCorbin Bleu (Walt Disney Records)\n\nJ. Holiday (Capitol)\n\nJordin Sparks (Jive/Zomba)\n\nSean Kingston (Sony)\n\nMale Artist\n\nChris Brown (Jive)\n\nCommon (Geffen)\n\nKanye West (Island Def Jam)\n\nPrince (Columbia Records)\n\nSeal (Warner Bros. Records)\n\nFemale Artist\n\nAlicia Keys (J Records)\n\nAretha Franklin (Arista Records/Sony BMG)\n\nBeyoncé (Columbia Records)\n\nJill Scott (Hidden Beach Recordings)\n\nMary J. Blige (Geffen)\n\nDuo or Group\n\nAretha Franklin (feat. Fantasia) (Arista Records/Sony BMG)\n\nBow Wow & Omarion (Columbia Records)\n\nEddie & Gerald Levert (Atlantic)\n\nSounds of Blackness (Sounds of Blackness Records)\n\nStephen Marley & Damian “Jr. Gong” Marley (Universal Republic)\n\nJazz Artist\n\nDee Dee Bridgewater (DDB Records (UMG))\n\nHerbie Hancock (Verve)\n\nKirk Whalum (Rendezvous Entertainment)\n\nPatti Austin (Rendezvous Entertainment)\n\nRandy Crawford & Joe Sample (PRA Records)\n\nGospel Artist – (Traditional or Contemporary)\n\nKirk Franklin (Gospocentric)\n\nMarvin Winans (Pure Springs/EMI Gospel)\n\nMavis Staples (Epitaph)\n\nSounds of Blackness (Sounds of Blackness Records)\n\nYolanda Adams (Columbia Records)\n\nWorld Music Album\n\nAngelique Kidjo – “Djin Djin” (Razor & Tie)\n\nHabib Koité – “Afriki” (Cumbancha)\n\nVarious Artists – “Putumayo Presents: World Hits” (Putumayo)\n\nShiko Mawatu – “Kimbanda Nzila” (Sterns)\n\nYoussou N’Dour – “Rokku Mi Rokka” (Atlantic)\n\nMusic Video\n\n“Beautiful Liar” – Beyoncé (Columbia Records)\n\n“Just Fine” – Mary J. Blige(Geffen)\n\n“Like You’ll Never See Me Again” – Alicia Keys (J Records)\n\n“Show Me” – John Legend (Columbia Records)\n\n“Stronger” – Kanye West (Island Def Jam)\n\nSong\n\n“Beautiful Flower” – India Arie (Universal Republic)\n\n“Just Fine” – Mary J. Blige (Geffen)\n\n“Like You’ll Never See Me Again” – Alicia Keys (J Records)\n\n“Stronger” – Kanye West (Island Def Jam)\n\n“Umbrella” – Rihanna feat. Jay-Z (Island Def Jam)\n\nAlbum\n\nAlicia Keys – “As I Am” (J Records)\n\nChris Brown – “Exclusive” (Jive)\n\nKanye West – “Graduation” (Island Def Jam)\n\nMary J. Blige – “Growing Pains” (Geffen)\n\nSeal – “System” (Warner Bros. Records)\n\nLITERATURE CATEGORIES\n\nLiterary Work – Fiction\n\n“Blonde Faith” – Walter Mosley (Little, Brown & Company)\n\n“The Brief Wondrous Life of Oscar Wao” – Junot Diaz (Penguin/Riverhead)\n\n“Cion: A Novel” – Zakes Mda (Picador)\n\n“Knots” – Nuruddin Farah (Penguin/Riverhead)\n\n“New England White: A Novel” – Stephen L. Carter (Alfred A. Knopf/RH)\n\nLiterary Work – Non-Fiction\n\n“An Unbroken Agony” – Randall Robinson (Basic Civitas Books/Perseus)\n\n“Brother, I’m Dying” – Edwidge Danticat (Alfred A. Knopf/RH)\n\n“Know What I Mean?: Reflections on Hip-Hop” – Michael Eric Dyson (Basic Civitas Books/Perseus)\n\n“Not on Our Watch: The Mission to End Genocide in Darfur and Beyond” – Don Cheadle, John Prendergast (Hyperion)\n\n“Race and Racism in the Chinas: Chinese Racial Attitudes Toward Africans and African- Americans” – M. Dujon Johnson (Authorhouse)\n\nLiterary Work – Debut Author\n\n“The Beautiful Things That Heaven Bears” – Dinaw Mengestu (Penguin/Riverhead)\n\n“Grace Will Lead Me Home” – Robin Givens (Hyperion)\n\n“Like Trees, Walking” Ravi Howard (Harper Collins/ Amistad)\n\n“A Long Way Gone: Memoirs of a Boy Soldier” – Ishmael Beah (Farrar, Straus and Giroux)\n\n“The Women Who Raised Me: A Memoir” – Victoria Rowell (Harper Collins)\n\nLiterary Work – Biography/Auto-Biography\n\n“I Got Your Back: A Father and Son Keep it Real About Love, Fatherhood, Family, and Friendship” – Eddie Levert Sr., Gerald Levert, Lyah Leflore (Broadway Books)\n\n“My Grandfather’s Son” – Clarence Thomas (Harper Collins)\n\n“Obama: From Promise to Power” – David Mendell (Harper Collins/Amistad)\n\n“Silent Gesture: The Autobiography of Tommie Smith” – Tommie Smith, David Steele (Temple University Press)\n\n“The Women Who Raised Me: A Memoir” – Victoria Rowell (Harper Collins/William Morrow)\n\nLiterary Work – Instructional\n\n“The Covenant in Action” – Tavis Smiley (Smiley Books)\n\n“Do You!: 12 Laws to Access the Power in You to Achieve Happiness and Success” – Russell Simmons (Penguin/Gotham)\n\n“Get Yours!: The Girlfriends’ Guide to Having Everything You Ever Dreamed of and More” – Amy Dubois Barnett (Random House/Broadway)\n\n“Reposition Yourself: Living Life Without Limits” – T. D. Jakes (Simon & Schuster/Atria Books)\n\n“This Year You Write Your Novel” – Walter Mosley (Little, Brown & Company)\n\nLiterary Work – Poetry\n\n“Acolytes: Poems” – Nikki Giovanni (Harper Collins/William Morrow)\n\n“Duende” – Tracy K. Smith (Gray Wolf Press)\n\n“Eloquence: Rhythm and Renaissance” – Usi Ku (UsiKu.net)\n\n“Quiver of Arrows” – Carl Phillips (Farrar, Straus and Giroux)\n\n“Selected Poems” – Derek Walcott (Farrar, Straus and Giroux)\n\nLiterary Work – Children\n\n“A Friendship For Today” – Patricia C. McKissack (Scholastic Inc.)\n\n“Elijah of Buxton” – Christopher Paul Curtis (Scholastic Inc.)\n\n“Let it Shine: Three Favorite Spirituals” – Ashley Bryan (Simon & Schuster Children’s Publishing/Atheneum)\n\n“Nothing but Trouble: The Story of Althea Gibson” – Sue Stauffacher,Author; Greg Couch, Illustrator (Random House)\n\n“Young Pele: Soccer’s First Star – Lesa Cline-Ransome, Author; James Ransome, Illustrator (Random House)\n\nLiterary Work – Youth/Teens\n\n“Body Drama” – Nancy Redd (Penguin/Gotham)\n\n“Center for Cartoon Studies Presents: Satchel Paige: Striking Out Jim Crow” – James Sturm, Author; Rich Tommaso, Illustrator (Hyperion Books for Children/Disney Publishing)\n\n“Divine Confidential” – Jacquelin Thomas (Pocketbooks/Simon & Schuster)\n\n“More Than Entertainers: An Inspirational Black Career Guide” – Charles B. Schooler, Author; Gary Young, Illustrator (Zenith Publishing)\n\n“Shadow Speaker” – Nnedi Okorafor-Mbachu (Hyperion Books for Children/Disney Publishing)"}, {"url": "http://www.awardsandwinners.com/category/naacp-image-award/naacp-image-award-for-outstanding-directing-in-a-comedy-series/", "page_content": "2014 Millicent Shelton Honored for : The Hustle (Rule 4080) Nominations 2014 » Nominee Nominated Work Millicent Shelton The Hustle\n\nRule 4080 Eric Dean Seaton Mighty Med\n\nSaving the People Who Save People Anton Cropper House of Lies\n\nSincerity Is an Easy Disguise in This Business Paris Barclay Glee\n\nDiva Stan Lathan Real Husbands of Hollywood\n\nRock, Paper, Stealers\n\n2013 Ken Whittingham Honored for : Parks and Recreation (How a Bill Becomes Law) Nominations 2013 » Nominee Nominated Work Ken Whittingham Parks and Recreation\n\nHow a Bill Becomes Law Stan Lathan The Soul Man\n\nPilot Millicent Shelton Go On\n\nBig League Chew Ken Whittingham 30 Rock\n\nQueen of Jordan 2: The Mystery of the Phantom Pooper Bentley Kyle Evans Love That Girl!\n\nRight or Right Now\n\n2012 Leonard R. Garner, Jr. Honored for : Rules of Engagement (The Set Up) Nominations 2012 » Nominee Nominated Work Leonard R. Garner, Jr. Rules of Engagement\n\nThe Set Up Jay Chandrasekhar Happy Endings\n\nThe Girl with the David Tattoo Kevin Hooks Drop Dead Diva\n\nMother's Day Miguel Arteta How to Make It in America\n\nMofongo Salim Akil The Game\n\nParachutes...Beach Chairs\n\n2011 Kevin Rodney Sullivan Honored for : Modern Family (Game Changer) Nominations 2011 » Nominee Nominated Work Joe Morton Eureka\n\nStoned Justin Lin Community\n\nModern Warfare Ken Whittingham 30 Rock\n\nAnna Howard Shaw Day Kevin Rodney Sullivan Modern Family\n\nGame Changer Michael Schultz Chuck\n\nChuck vs. \\u201CThe Couch Lock\\u201D\n\n2010 Ken Whittingham Honored for : 30 Rock Nominations 2010 » Nominee Nominated Work Ken Whittingham 30 Rock\n\nJustin Lin Community\n\nMichael Schultz Drop Dead Diva\n\nAli LeRoi Everybody Hates Chris\n\nReginald Hudlin The Office\n\n\n\n2009 Kevin Rodney Sullivan Honored for : 30 Rock (MILF Island) Nominations 2009 » Nominee Nominated Work Kevin Sullivan 30 Rock\n\nMILF Island Ken Whittingham Entourage\n\nSeth Green Day Ali LeRoi Everybody Hates Chris\n\nEverybody Hates Port Authority Tracee Ellis Ross Girlfriends\n\nWhat's Black-A-Lackin Victor Nelli Jr. Ugly Betty\n\nCrush'd\n\n2008 Ken Whittingham Honored for : The Office (Phyllis's Wedding) Nominations 2008 » Nominee Nominated Work Ken Whittingham The Office\n\nPhyllis's Wedding Seith Mann Entourage\n\nDream Team Ali LeRoi Everybody Hates Chris\n\nEverybody Hates Baseball Millicent Shelton Everybody Hates Chris\n\nEverybody Hates the Substitute Salim Akil Girlfriends\n\nTo Be Determined...It's Been Determined\n\n2007 Ken Whittingham Honored for : The Office (Michael's Birthday) Nominations 2007 » Nominee Nominated Work Ken Whittingham The Office\n\nMichael's Birthday Lauren Breiting According to Jim\n\nThe Stick Ali LeRoi Everybody Hates Chris\n\nEverybody Hates Elections Millicent Shelton Everybody Hates Chris\n\nEverybody Hates Valentine's Day Salim Akil Girlfriends\n\nThe Game"}, {"url": "https://redcarpetreporttv.com/2011/02/13/millicent-shelton-at-42nd-naacp-image-awards-nominees-luncheon/", "page_content": "Mingle Media TV was invited to cover the 42nd NAACP IMAGE AWARDS Nominees? Luncheon red carpet at the Beverly Hills Hotel. The event honors those nominated for their outstanding achievements in television, recording, literature, and motion picture. Hosted by Host Affion Crockett (Actor/Comedian) and joined by Antwone Fisher (Director/Screenwriter),Chandra Wilson (Actress), Craig Robinson (Actor/Comedian), Debra Martin Chase (Producer),George Tillman (Director/Producer), James Pickens, Jr. (Actor), Jason Derulo (Singer/Songwriter),LaVan Davis (Singer/Actor), Louis Gossett Jr. (Actor), Millicent Shelton (Director), Paris Barclay(Director/Producer), Sara Ramirez (Actress), Tatyana Ali (Actress/ Singer) and other fellow nominees. Founded on Feb. 12, 1909, the National Association for the Advancement of Colored People (NAACP) is the nation?s oldest and largest civil rights organization. Its half-million adult and youth members throughout the United States and the world are the premier advocates for civil rights in their communities, and monitor equal opportunity in the public and private sectors. For more information on the NAACP IMAGE AWARDS, please visit www.naacpimageawards.net. This year’s 42nd NAACP IMAGE AWARDS will be broadcast live on Friday, March 4, 2011 on FOX. Thanks to the Lippin Group for inviting us to come out and cover this event. For more information visit www.lippingroup.com. For more red carpet coverage, visit Mingle Media TV at http://www.minglemediatv.com/redcarpetreport.html.\n\nShare this: Facebook\n\nTwitter\n\nReddit\n\nLinkedIn\n\nPinterest\n\nTumblr\n\nPinterest\n\nWhatsApp\n\n\n\nLike this: Like Loading..."}, {"url": "https://www.hollywoodreporter.com/lists/2016-naacp-image-award-nominees-862135/", "page_content": "The nominations for the 47th annual NAACP Image Awards were announced on Tuesday, with Ryan Coogler's Rocky spinoff Creed scoring six mentions, the most among motion pictures. Star Michael B. Jordan is also up for entertainer of the year, nominated alongside Misty Copeland, Pharrell Williams, Shonda Rhimes and Viola Davis.\n\nUniversal's Straight Outta Compton earned five noms, with Netflix's first original feature film, Beasts of No Nation, landing four, as did Amazon's first feature film, Spike Lee's Chi-Raq, which is being distributed by Roadside Attractions. Creed, Compton and Beasts will all face off in the category of outstanding motion picture, alongside Sony's Concussion and Open Road's Dope. Concussion scored three mentions, including one for best actor (Will Smith) and best supporting actress (Gugu Mbatha-Raw). Concussion's recognition marks the first major award nominations for the film about Dr. Bennet Omalu's discovery of a head-trauma disease and his struggle to get the NFL to acknowledge his findings.\n\nIn the best actor category, Smith, Jordan and Beasts' young star Abraham Attah will compete against Chiwetel Ejiofor (Secret in Their Eyes) and Michael Ealy (The Perfect Guy). The best movie actress nominees include Keke Palmer (Brotherly Love), Sanaa Lathan (Perfect Guy), Teyonah Parris (Chi-Raq), Viola Davis (Lila and Eve) and Zoe Saldana (Infinitely Polar Bear).\n\nOn the TV side, Fox drama Empire scored a leading 12 nominations, the most for any TV series, followed by ABC comedy Black-ish with 10. ABC led all networks with a total of 28 noms, including five each for How to Get Away With Murder and American Crime and four for Scandal. BET, meanwhile, received 13 mentions, including four each for Being Mary Jane and Book of Negroes.\n\nHBO's Bessie earned five nominations, while Netflix's TV series also collected several noms, with Orange Is the New Black picking up four mentions and Aziz Ansari's Master of None scoring two for the show that recently debuted on the streaming service. NBC's recently aired live musical, The Wiz Live!, landed two noms, as did Comedy Central's The Daily Show With Trevor Noah and The Nightly Show With Larry Wilmore.\n\nNominations were announced in the categories of motion pictures, TV, recording and literature. The NAACP Image Awards celebrates the accomplishments of people of color in TV, music, literature and film and honors individuals and groups that promote social justice through creative endeavors. The awards will be handed out on Friday, Feb. 5, during a two-hour ceremony that will be broadcast live on TV One at 9 p.m. ET (PT tape-delayed)."}, {"url": "https://www.hollywoodreporter.com/movies/movie-news/naacp-image-awards-nominations-announced-669689/", "page_content": "Lee Daniels’ The Butler and Scandal are among the top nominees for the 45th annual NAACP Image Awards, announced Thursday afternoon during the winter Television Critics Association press tour in Pasadena, Calif.\n\nDavid Oyelowo, Joe Morton, Keke Palmer, Bresha Webb and Gina Torres were on hand to announce the nominations in the major categories. The NAACP Image Awards will kick off Saturday, Feb. 22 at 9 p.m. on TV One, with a red carpet show at 8 p.m.\n\nThe Weinstein Company leads with 17 film nominations, followed by Fox Searchlight with seven. BET and CBS were the top networks in the television categories with 19 and 16 nominations, respectively. ABC followed with 15 and HBO with 13.\n\nSTORY: NAACP Image Awards: Winners Announced\n\nIn the music categories, RCA led with 10 boosted by Justin Timberlake‘s multiple nominations, Atlantic followed with eight and Columbia with seven.\n\n“This has been an incredible year from the artistic community, with phenomenal contributions across the board from the music, television, motion picture, and literature genres that have the power and impact to drive social change,” said Roslyn M. Brock, chairman of the NAACP. “The NAACP Image Awards provides an excellent venue to recognize those who make a difference through art and activism, and we are excited to honor and celebrate this caliber of talent.”\n\n\n\n“The Image Awards recognize the best that communities of color have to offer and is an exciting addition to our programming line-up — TV One is pleased to showcase all of these achievements on our network,” said Alfred Liggins, president and CEO of TV One.\n\nThe NAACP Image Awards honors the accomplishments of people of color in the fields of television, music, literature and film, and honors those who promote social justice through creative endeavors. Winners will be voted upon by NAACP members. Winners of the non-televised categories will be announced Friday, Feb. 21.\n\nThe NAACP Image Awards are presented by the National Association for the Advancement of Colored People, the country’s oldest and largest civil rights organization with about 500,000 members.\n\nTELEVISION\n\nOutstanding Comedy Series\n\n“House of Lies” (Showtime)\n\n“Modern Family” (ABC)\n\n“Real Husbands of Hollywood” (BET)\n\n“The Game” (BET)\n\n“The Soul Man” (TV Land)\n\nOutstanding Actor in a Comedy Series\n\nAndre Braugher – “Brooklyn Nine-Nine” (FOX)\n\nCedric The Entertainer – “The Soul Man” (TV Land)\n\nDon Cheadle – “House of Lies” (Showtime)\n\nDulé Hill – “Psych” (USA Network)\n\nKevin Hart – “Real Husbands of Hollywood” (BET)\n\nOutstanding Actress in a Comedy Series\n\nAisha Tyler – “Archer” (FX Networks)\n\nMindy Kaling – “The Mindy Project” (FOX)\n\nNiecy Nash – “The Soul Man” (TV Land)\n\nTasha Smith – “Tyler Perry’s For Better or Worse” (OWN)\n\nWendy Raquel Robinson – “The Game” (BET)\n\nOutstanding Supporting Actor in a Comedy Series\n\nBoris Kodjoe – “Real Husbands of Hollywood” (BET)\n\nJerry “J B Smoove” Brooks – “Real Husbands of Hollywood” (BET)\n\nMorris Chestnut – “Nurse Jackie” (Showtime)\n\nNick Cannon – “Real Husbands of Hollywood” (BET)\n\nTracy Morgan – “30 Rock” (NBC)\n\nOutstanding Supporting Actress in a Comedy Series\n\nAnna Deavere Smith – “Nurse Jackie” (Showtime)\n\nBrandy Norwood – “The Game” (BET)\n\nNia Long – “House of Lies” (Showtime)\n\nRashida Jones – “Parks and Recreation” (NBC)\n\nSofia Vergara – “Modern Family” (ABC)\n\nOutstanding Drama Series\n\n“Boardwalk Empire” (HBO)\n\n“Grey’s Anatomy” (ABC)\n\n“Scandal” (ABC)\n\n“The Good Wife” (CBS)\n\n“Treme” (HBO)\n\nOutstanding Actor in a Drama Series\n\nJames Pickens, Jr. – “Grey’s Anatomy” (ABC)\n\nLL Cool J – “NCIS: Los Angeles” (CBS)\n\nMichael Ealy – “Almost Human” (FOX)\n\nShemar Moore – “Criminal Minds” (CBS)\n\nWendell Pierce – “Treme” (HBO)\n\nOutstanding Actress in a Drama Series\n\nChandra Wilson – “Grey’s Anatomy” (ABC)\n\nKerry Washington – “Scandal” (ABC)\n\nKhandi Alexander – “Treme” (HBO)\n\nNicole Beharie – “Sleepy Hollow” (FOX)\n\nRegina King – “SouthLAnd” (TNT)\n\nOutstanding Supporting Actor in a Drama Series\n\nColumbus Short – “Scandal” (ABC)\n\nGuillermo Diaz – “Scandal” (ABC)\n\nJeffrey Wright – “Boardwalk Empire” (HBO)\n\nJoe Morton – “Scandal” (ABC)\n\nMichael Kenneth Williams – “Boardwalk Empire” (HBO)\n\n\n\nOutstanding Supporting Actress in a Drama Series\n\nArchie Panjabi – “The Good Wife” (CBS)\n\nDebbie Allen – “Grey’s Anatomy” (ABC)\n\nDiahann Carroll – “White Collar” (USA)\n\nTaraji P. Henson – “Person of Interest” (CBS)\n\nVanessa L. Williams – “666 Park Avenue” (ABC)\n\n\n\nOutstanding Television Movie, Mini-Series or Dramatic Special\n\n“Being Mary Jane” (BET)\n\n“Betty & Coretta” (Lifetime)\n\n“CrazySexyCool: The TLC Story” (VH1)\n\n“Luther” (BBC America)\n\n“Muhammad Ali’s Greatest Fight” (HBO)\n\n\n\nOutstanding Actor in a Television Movie, Mini-Series or Dramatic Special\n\nChiwetel Ejiofor – “Dancing on the Edge” (Starz)\n\nDanny Glover – “Muhammad Ali’s Greatest (HBO)\n\nIdris Elba – “Luther” (BBC America)\n\nMalik Yoba – “Betty & Coretta” (Lifetime)\n\nOmari Hardwick – “Being Mary Jane” (BET)\n\n\n\nOutstanding Actress in a Television Movie, Mini-Series or Dramatic Special\n\nAngela Bassett – “American Horror Story: Coven” (FX Networks)\n\nAngela Bassett – “Betty & Coretta” (Lifetime)\n\nGabourey Sidibe – “American Horror Story: Coven” (FX Networks)\n\nGabrielle Union – “Being Mary Jane” (BET)\n\nKeke Palmer – “CrazySexyCool: The TLC Story” (VH1)\n\n\n\nOutstanding Actor in a Daytime Drama Series\n\nAaron D. Spears – “The Bold and the Beautiful” (CBS)\n\nKristoff St. John – “The Young and the Restless” (CBS)\n\nLawrence Saint Victor – “The Bold and the Beautiful” (CBS)\n\nRedaric Williams – “The Young and the Restless” (CBS)\n\nTequan Richmond – “General Hospital” (ABC)\n\n\n\nOutstanding Actress in a Daytime Drama Series\n\nAngell Conwell – “The Young and the Restless” (CBS)\n\nChristel Khalil – “The Young and the Restless” (CBS)\n\nKarla Mosley – “The Bold and the Beautiful” (CBS)\n\nKristolyn Lloyd – “The Bold and the Beautiful” (CBS)\n\nTatyana Ali – “The Young and the Restless” (CBS)\n\n\n\nOutstanding News/ Information – (Series or Special)\n\n“Justice for Trayvon” (BET)\n\n“Mandela: Freedom’s Father” (BET)\n\n“Oprah: Where Are They Now?” (OWN)\n\n“The African Americans: Many Rivers to Cross with Henry Louis Gates, Jr.” (PBS)\n\n“Unsung” (TV One)\n\n\n\nOutstanding Talk Series\n\n“Oprah’s Lifeclass” (OWN)\n\n“Oprah’s Next Chapter” (OWN)\n\n“Steve Harvey” (Syndicated)\n\n“The Arsenio Hall Show” (Syndicated)\n\n“The Queen Latifah Show” (Syndicated)\n\n\n\nOutstanding Reality Series\n\n“Iyanla: Fix My Life” (OWN)\n\n“Shark Tank” (ABC)\n\n“Sunday Best” (BET)\n\n“The Voice” (NBC)\n\n“Welcome to Sweetie Pie’s” (OWN)\n\n\n\nOutstanding Variety Series or Special\n\n“12 Years A Slave: A TV One Special with Cathy Hughes” (TV One)\n\n“Black Girls Rock!” (BET)\n\n“Key & Peele” (Comedy Central)\n\n“Mike Tyson: Undisputed Truth” (HBO)\n\n“Oprah’s Master Class” (OWN)\n\n\n\nOutstanding Children’s Program\n\n“2013 HALO Awards” (Nickelodeon/TeenNick)\n\n“A.N.T. Farm” (Disney Channel)\n\n“Dora the Explorer” (Nickelodeon)\n\n“Postcards: Mandela” (The Africa Channel)\n\n“Wynton Marsalis: A YoungArts MasterClass” (HBO)\n\n\n\nOutstanding Performance in a Youth/ Children’s Program – (Series or Special)\n\nChina Anne McClain – “A.N.T. Farm” (Disney Channel)\n\nEric I. Keyes, III – “Live Life and Win!” (Syndicated)\n\nFatima Ptacek – “Dora the Explorer” (Nickelodeon)\n\nKaran Brar – “Jessie” (Disney Channel)\n\nZendaya – “Shake It Up” (Disney Channel)\n\nMUSIC\n\nOutstanding New Artist\n\nAriana Grande (Republic Records)\n\nCandice Glover (19 Recordings/Interscope Records)\n\nK. Michelle (Atlantic Records)\n\nRaVaughn Brown (Columbia Records)\n\nZendaya (Hollywood Records)\n\n\n\nOutstanding Male Artist\n\nBruno Mars (Atlantic Records)\n\nCharlie Wilson (RCA Records)\n\nJohn Legend (Columbia Records)\n\nJustin Timberlake (RCA Records)\n\nRobin Thicke (Star Trak/Interscope)\n\n\n\nOutstanding Female Artist\n\nBeyoncé (Columbia Records)\n\nIndia.Arie (Motown Records)\n\nJanelle Monáe (Bad Boy/Atlantic)\n\nLedisi (Verve Records)\n\nMary J Blige (Verve Records/Interscope)\n\n\n\nOutstanding Duo, Group or Collaboration\n\n“#Beautiful” – Mariah Carey feat. Miguel (Island Def Jam)\n\n“Blurred Lines” – Robin Thicke feat. T.I. & Pharrell (Star Trak/Interscope)\n\n“Fire We Make” – Alicia Keys feat. Maxwell (RCA Records)\n\n“Hurt You” – Toni Braxton feat. Babyface (Motown Records)\n\n“Suit & Tie” – Justin Timberlake feat. Jay-Z (RCA Records)\n\n\n\nOutstanding Jazz Album\n\n“Summer Horns” – Dave Koz, Gerald Albright, Mindi Abair, Richard Elliot (Concord Records)\n\n“The Beat” – Boney James (Concord Records)\n\n“The Messenger” – Kevin Eubanks (Mack Avenue Records)\n\n“The Morning After: A Musical Love Journey” – Najee (Shanachie)\n\n“The Songs of Stevie Wonder” – SFJAZZ Collective (SFJAZZ Records)\n\n\n\nOutstanding Gospel Album – (Traditional or Contemporary)\n\n“20 Year Celebration Volume 1 – Best For Last” – Donald Lawrence (Quietwater Entertainment/eOne Music)\n\n“Azusa: The Next Generation” – Hezekiah Walker (RCA Inspiration)\n\n“Best Days Deluxe Edition” – Tamela Mann (Tillymann Music)\n\n“Good God” – Shirley Caesar (eOne Music)\n\n“Music From the Motion Picture Black Nativity” – Various (RCA Inspiration)\n\n\n\nOutstanding World Music Album\n\n“Coming from a Lady” – Lady Ele (13 Black Records)\n\n“Live At The Royal Albert Hall” – Emeli Sande (Capitol)\n\n“Natalie Cole en Español” – Natalie Cole (Verve Records)\n\n“Sing To The Moon” – Laura Mvula (Columbia Records)\n\n“The Standards” – Gloria Estefan (Masterworks)\n\n\n\nOutstanding Music Video\n\n“Cocoa Butter” – India.Arie (Motown Records)\n\n“Fire We Make” – Alicia Keys feat. Maxwell (RCA Records)\n\n“Made To Love” – John Legend (Columbia Records)\n\n“Q.U.E.E.N.” – Janelle Monáe feat. Erykah Badu (Bad Boy/Atlantic)\n\n“Treasure” – Bruno Mars (Atlantic Records)\n\n\n\nOutstanding Song\n\n“All Of Me” – John Legend (Columbia Records)\n\n“Blurred Lines ” – Robin Thicke feat. T.I. & Pharrell (Star Trak/Interscope)\n\n“Fire We Make” – Alicia Keys feat. Maxwell (RCA Records)\n\n“Q.U.E.E.N.” – Janelle Monáe feat. Erykah Badu (Bad Boy/Atlantic)\n\n“Treasure” – Bruno Mars (Atlantic Records)\n\n\n\nOutstanding Album\n\n“20/20 Experience – The Complete Experience” – Justin Timberlake (RCA Records)\n\n“Blurred Lines” – Robin Thicke (Star Trak/Interscope)\n\n“Love In The Future” – John Legend (Columbia Records)\n\n“Love, Charlie” – Charlie Wilson (RCA Records)\n\n“The Electric Lady” – Janelle Monáe (Bad Boy/Atlantic)\n\n\n\nLITERATURE\n\n\n\nOutstanding Literary Work – Fiction\n\n“A Deeper Love Inside: The Porscha Santiaga Story” – Sister Souljah (Atria/Emily Bestler Books)\n\n“Anybody’s Daughter” – Pamela Samuels Young (Goldman House Publishing)\n\n“Little Green: An Easy Rawlins Mystery” – Walter Mosley (Doubleday)\n\n“Never Say Never: A Novel” – Victoria Christopher Murray (Touchstone/Simon & Schuster)\n\n“Who Asked You?” – Terry McMillan (Viking)\n\n\n\nOutstanding Literary Work – Non-Fiction\n\n“Bartlett’s Familiar Black Quotations: 5,000 Years of Literature, Lyrics, Poems, Passages, Phrases, and Proverbs from Voices Around the World” – Retha Powers (Little, Brown and Company)\n\n“Envisioning Emancipation: Black Americans and the End of Slavery” – Deborah Willis, Barbara Krauthamer (Temple University Press)\n\n“High Price: A Neuroscientist’s Journey of Self-Discovery That Challenges Everything You Know About Drugs and Society” – Carl Hart (HarperCollins, Harper)\n\n“Letters to an Incarcerated Brother: Encouragement, Hope, and Healing for Inmates and Their Loved Ones” – Hill Harper (Gotham Books)\n\n“The African Americans: Many Rivers to Cross” – Henry Louis Gates, Jr., Donald Yacovone (SmileyBooks)\n\n\n\nOutstanding Literary Work – Debut Author\n\n“Better Than Good Hair – The Curly Girl Guide to Healthy Gorgeous Natural Hair!” – Nikki Walton with Ernessa T. Carter (Harper Collins- Amistad)\n\n“Ghana Must Go” – Taiye Selasi (The Penguin Press)\n\n“Nine Years Under” – Sheri Booker (Gotham Books)\n\n“On The Come Up” – Hannah Weyer (Nan A. Talese/Doubleday)\n\n“The Returned” – Jason Mott (Harlequin MIRA)\n\n\n\nOutstanding Literary Work – Biography/ Auto-Biography\n\n“Buck: A Memoir” – MK Asante (Spiegel & Grau)\n\n“Duke: A Life of Duke Ellington” – Terry Teachout (Gotham Books)\n\n“Kansas City Lightning: The Rise and Times of Charlie Parker” – Stanley Crouch (HarperCollins, Harper)\n\n“Mom & Me & Mom” – Maya Angelou (Random House)\n\n“The Rebellious Life of Mrs. Rosa Parks” – Jeanne Theoharis (Beacon Press)\n\n\n\nOutstanding Literary Work – Instructional\n\n“Do I Look Like An ATM? A Parent’s Guide to Raising Financially Responsible African American Children” – Sabrina Lamb (Chicago Review Press)\n\n“Plan D: How to Lose Weight and Beat Diabetes (Even If You Don’t Have It)” – Sherri Shepherd with Billie Fitzpatrick (HarperCollins, It Books)\n\n“Recruiting and Retaining Culturally Different Students in Gifted Education” – Donna Y. Ford, Ph.D. (Prufrock Press Inc.)\n\n“The Entrepreneur Mind: 100 Essential Beliefs, Characteristics, and Habits of Elite Entrepreneurs” – Kevin D. Johnson (Johnson Media Inc.)\n\n“The Vegucation of Robin: How Real Food Saved My Life” – Robin Quivers (Avery)\n\n\n\nOutstanding Literary Work – Poetry\n\n“Chasing Utopia: A Hybrid” – Nikki Giovanni (HarperCollins, William Morrow)\n\n“Hum” – Jamaal May (Alice James Books)\n\n“The Cineaste: Poems” – A. Van Jordan (W.W. Norton & Company, Inc.)\n\n“The Collected Poems of Ai” – Ai (W.W. Norton & Company, Inc.)\n\n“Turn Me Loose: The Unghosting of Medgar Evers” – Frank X Walker (University of Georgia Press)\n\n\n\nOutstanding Literary Work – Children\n\n“I’m A Pretty Little Black Girl!” – Betty K. Bynum (Author), Claire Armstrong-Parod (Illustrator) (Dream Title Publishing)\n\n“Knock Knock: My Dad’s Dream for Me” – Daniel Beaty (Author), Bryan Collier (Illustrator) (Little, Brown Books for Young Readers)\n\n“Martin & Mahalia: His Words, Her Song” – Andrea Davis Pinkney (Author), Brian Pinkney (Illustrator) (Little, Brown Books for Young Readers)\n\n“Nelson Mandela” – Kadir Nelson (HarperCollins Children’s Books/Katherine Tegen Books)\n\n“You Never Heard of Willie Mays?!” – Jonah Winter (Author), Terry Widener (Illustrator) (RH Childrens Books; Schwartz & Wade)\n\n\n\nOutstanding Literary Work – Youth/Teens\n\n“Courage Has No Color, The True Story of the Triple Nickles: America’s First Black Paratroopers” – Tanya Lee\n\nStone (Candlewick Press)\n\n“God’s Graffiti: Inspiring Stories for Teens” – Romal Tune (Judson Press)\n\n“Invasion” – Walter Dean Myers (Scholastic Press/Scholastic)\n\n“Raising the Bar” – Gabrielle Douglas (Zondervan)\n\n“Serafina’s Promise: A Novel In Verse” – Ann E. Burg (Scholastic Press/Scholastic)\n\n\n\nMOTION PICTURE\n\nOutstanding Motion Picture\n\n“12 Years A Slave” (River Road/Plan B/New Regency/Fox Searchlight Pictures)\n\n“Fruitvale Station” (The Weinstein Company/Forest Whitaker’s Significant Productions, OG Project)\n\n“Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\n“Mandela: Long Walk to Freedom” (The Weinstein Company/Distant Horizon, Origin Pictures, Pathé, Videovision Entertainment)\n\n“The Best Man Holiday” (Universal Pictures)\n\n\n\nOutstanding Actor in a Motion Picture\n\nChadwick Boseman – “42” (Warner Bros. Pictures/Legendary Pictures)\n\nChiwetel Ejiofor – “12 Years A Slave” (River Road/Plan B/New Regency/Fox Searchlight Pictures)\n\nForest Whitaker – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nIdris Elba – “Mandela: Long Walk To Freedom” (The Weinstein Company/Distant Horizon, Origin Pictures, Pathé, Videovision Entertainment)\n\nMichael B. Jordan – “Fruitvale Station” (The Weinstein Company/Forest Whitaker’s Significant Productions, OG Project)\n\nOutstanding Actress in a Motion Picture\n\nAngela Bassett – “Black Nativity” (Fox Searchlight Pictures/Mavin Pictures/Wonderful Films)\n\nHalle Berry – “The Call” (TriStar Pictures)\n\nJennifer Hudson – “Winnie Mandela” (Ma-Afrika Films (PTY) LTD and Equinoxe Films Inc.)\n\nKerry Washington – “Tyler Perry Presents Peeples” (Lionsgate)\n\nNicole Beharie – “42” (Warner Bros. Pictures/Legendary Pictures)\n\nOutstanding Supporting Actor in a Motion Picture\n\nCuba Gooding Jr. – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nDavid Oyelowo – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nMorris Chestnut – “The Best Man Holiday” (Universal Pictures)\n\nTerrence Howard – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nTerrence Howard – “The Best Man Holiday” (Universal Pictures)\n\nOutstanding Supporting Actress in a Motion Picture\n\nAlfre Woodard – “12 Years A Slave” (River Road/Plan B/New Regency/Fox Searchlight Pictures)\n\nLupita Nyong’o – “12 Years A Slave ” (River Road/Plan B/New Regency/Fox Searchlight Pictures)\n\nNaomie Harris – “Mandela: Long Walk to Freedom” (The Weinstein Company/Distant Horizon, Origin Pictures, Pathé, Videovision Entertainment)\n\nOctavia Spencer – “Fruitvale Station” (The Weinstein Company/Forest Whitaker’s Significant Productions, OG Project)\n\nOprah Winfrey – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nOutstanding Independent Motion Picture\n\n“Blue Caprice” (Sundance Selects)\n\n“Dallas Buyers Club” (Focus Features)\n\n“Fruitvale Station” (The Weinstein Company/Forest Whitaker’s Significant Productions, OG Project)\n\n“The Inevitable Defeat of Mister & Pete” (Codeblack Films/Lionsgate/iDeal Partners/State Street)\n\n“The Trials of Muhammad Ali” (Kartemquin Films)\n\nOutstanding International Motion Picture\n\n“Call Me Kuchu” (Lindy Hop Pictures LLC)\n\n“High Tech, Low Life” (Argot Pictures)\n\n“La Playa D.C.” (Burning Blue)\n\n“Lion Ark” (ADI Films)\n\n“War Witch” (Item 7)\n\n\n\nOutstanding Documentary – (Theatrical)\n\n“20 Feet from Stardom” (Tremolo & Gil Friesen Productions)\n\n“Call Me Kuchu” (Lindy Hop Pictures LLC)\n\n“Free Angela and All Political Prisoners” (Codeblack Films/Lionsgate)\n\n“Girl Rising” (The Documentary Group)\n\n“The New Black” (Promised Land Film)\n\nOutstanding Documentary – (Television)\n\n“Beyoncé: Life Is But a Dream” (HBO)\n\n“Dark Girls” (OWN)\n\n“Richard Pryor: Omit the Logic ” (Showtime)\n\n“Venus Vs.” (ESPN)\n\n“Whoopi Goldberg Presents Moms Mabley” (HBO)\n\nWRITING\n\nOutstanding Writing in a Comedy Series\n\nErica Montolfo-Bura – “The Game” – In Treatment (BET)\n\nKarin Gist – “House of Lies” – Sincerity is an Easy Disguise in This Business (Showtime)\n\nMara Brock Akil – “The Game” – The Blueprint I & II (BET)\n\nRalph Farquhar, Chris Spencer – “Real Husbands of Hollywood” – Rock, Paper, Stealers (BET)\n\nVincent Brown – “A.N.T. Farm” – influANTces (Disney Channel)\n\n\n\nOutstanding Writing in a Dramatic Series\n\nAaron Rahsaan Thomas – “SouthLAnd” – Babel (TNT)\n\nChitra Elizabeth Sampath, Damian Kindler – “Sleepy Hollow” – Sanctuary (FOX)\n\nJanine Sherman Barrois – “Criminal Minds” – Strange Fruit (CBS)\n\nKarin Gist – “Revenge” – Mercy (ABC)\n\nSara Hess – “Orange is the New Black” – Blood Donut (Netflix)\n\n\n\nOutstanding Writing in a Motion Picture – (Theatrical or Television)\n\nAlfonso Cuarón, Jonás Cuarón – “Gravity” (Warner Bros. Pictures)\n\nBrian Helgeland – “42” (Warner Bros. Pictures/Legendary Pictures)\n\nDanny Strong – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nJohn Ridley – “12 Years A Slave” (River Road/Plan B/New Regency/Fox Searchlight Pictures)\n\nRyan Coogler – “Fruitvale Station” (The Weinstein Company/Forest Whitaker’s Significant Productions, OG Project)\n\nDIRECTING\n\nOutstanding Directing in a Comedy Series\n\nAnton Cropper – “House of Lies” – Sincerity Is an Easy Disguise in This Business (Showtime)\n\nEric Dean Seaton – “Mighty Med” – Saving The People Who Save People (Disney XD)\n\nMillicent Shelton – “The Hustle” – Rule 4080 (FUSE)\n\nParis Barclay – “Glee” – Diva (FOX)\n\nStan Lathan – “Real Husbands of Hollywood” – Rock, Paper, Stealers (BET)\n\n\n\nOutstanding Directing in a Dramatic Series\n\nCarl Franklin – “House of Cards” – Chapter 11 (Netflix)\n\nErnest Dickerson – “Treme” – Dippermouth Blues (HBO)\n\nMillicent Shelton – “The Fosters” – Clean (ABC Family)\n\nRegina King – “SouthLAnd” – Off Duty (TNT)\n\nRob Hardy – “Criminal Minds” – Carbon Copy (CBS)\n\n\n\nOutstanding Directing in a Motion Picture – (Theatrical or Television)\n\nJono Oliver – “Home” (The Home Film Group)\n\nJustin Chadwick – “Mandela: Long Walk to Freedom” (The Weinstein Company/Distant Horizon, Origin Pictures, Pathé, Videovision Entertainment)\n\nLee Daniels – “Lee Daniels’ The Butler” (The Weinstein Company/Lee Daniels Entertainment, Laura Ziskin Productions, Windy Hill Pictures, Follow Through Productions, Salamander Pictures, Pam Williams Productions)\n\nMalcolm D. Lee – “The Best Man Holiday” (Universal Pictures)\n\nSteve McQueen – “12 Years A Slave” (River Road/Plan B/New Regency/Fox Searchlight Pictures)"}, {"url": "https://www.apple.com/tv-pr/news/2023/01/apples-groundbreaking-film-emancipation-scores-five-naacp-image-award-nominations-including-outstanding-motion-picture-driving-a-record-21-nods-for-apple-originals/", "page_content": "Today the NAACP announced that Apple has been recognized with a record 21 nominations for the 54th Annual NAACP Image Awards across 10 critically acclaimed Apple Original films and series, with major category nominations including Outstanding Motion Picture for groundbreaking film “Emancipation”; Outstanding Television Movie, Limited-Series or Dramatic Special “The Last Days of Ptolemy Grey”; Outstanding Independent Motion Picture “Causeway”; Outstanding Documentary “Louis Armstrong’s Black & Blues” and “Sidney”; Outstanding Animated Series “Central Park”; and Outstanding Short-Form (Animated) “The Boy, the Mole, the Fox and the Horse.”\n\n“Emancipation” also landed honors for Outstanding Actor in a Motion Picture for star Will Smith, Outstanding Ensemble Cast in a Motion Picture, Outstanding Directing in a Motion Picture for Antoine Fuqua and Outstanding Costume Design (Television or Film) for Francine Jamison-Tanchuck. In addition to the nominations for Outstanding Documentary (Film) for “Louis Armstrong’s Black & Blues” and “Sidney,” directors Sacha Jenkins and Reginald Hudlin each received nods for Outstanding Directing in a Documentary (Television or Motion Picture), respectively.\n\nAcclaimed limited series “The Last Days of Ptolemy Grey” also received nominations for Outstanding Actor in a Television Movie, Limited-Series or Dramatic Special for star Samuel L. Jackson and Outstanding Supporting Actor in a Television Movie, Limited-Series or Dramatic Special for Omar Benson Miller, alongside Outstanding Directing in a Drama Series nods for Debbie Allen and Hanelle Culpepper, and Outstanding Make-up (Television or Film) for Michele Lewis.\n\nAcross its television slate, Apple TV+ earned first-time nominations for Outstanding Actress in a Comedy Series for “Loot” star and executive producer Maya Rudolph; Outstanding Supporting Actress in a Television Movie, Limited-Series or Dramatic Special for Phylicia Rashad in “Little America”; and Outstanding Make-Up (Television or Film) on “Surface” for Zabrina Matiru.\n\nThe winners will be announced during the 54th NAACP Image Awards broadcast on BET on Saturday, February 25, 2023.\n\nApple received 21 NAACP Image Award nominations, including:\n\n“Emancipation”\n\nOutstanding Motion Picture\n\nOutstanding Actor in a Motion Picture — Will Smith\n\nOutstanding Ensemble Cast in a Motion Picture\n\nOutstanding Directing in a Motion Picture — Antoine Fuqua\n\nOutstanding Costume Design (Television or Film) — Francine Jamison-Tanchuck\n\n“The Last Days of Ptolemy Grey”\n\nOutstanding Television Movie, Limited-Series or Dramatic Special\n\nOutstanding Actor in a Television Movie, Limited-Series or Dramatic Special — Samuel L. Jackson\n\nOutstanding Supporting Actor in a Television Movie, Limited-Series or Dramatic Special — Omar Benson Miller\n\nOutstanding Directing in a Drama Series — Debbie Allen, “Robyn”\n\nOutstanding Directing in a Drama Series — Hanelle Culpepper, “Sensia”\n\nOutstanding Make-Up (Television or Film) — Michele Lewis\n\n“Causeway”\n\nOutstanding Independent Motion Picture\n\n“Louis Armstrong’s Black & Blues”\n\nOutstanding Documentary (Film)\n\nOutstanding Directing in a Documentary (Television or Motion Picture) — Sacha Jenkins\n\n“Sidney”\n\nOutstanding Documentary (Film)\n\nOutstanding Directing in a Documentary (Television or Motion Picture) — Reginald Hudlin\n\n“Central Park”\n\nOutstanding Animated Series\n\n“The Boy, the Mole, the Fox and the Horse”\n\nOutstanding Short-Form (Animated)\n\n“Loot”\n\nOutstanding Actress in a Comedy Series — Maya Rudolph\n\n“Little America”\n\nOutstanding Supporting Actress in a Television Movie, Limited-Series or Dramatic Special — Phylicia Rashad\n\n“Surface”\n\nOutstanding Make-up (Television or Film) — Zabrina Matiru\n\nRecognized as the nation’s preeminent multicultural awards show from an African American perspective, the NAACP Image Awards celebrate the outstanding achievements and performances of people of color in the arts and those who promote social justice through their creative work.\n\nTo date, Apple Original films, documentaries and series have earned 310 wins and 1,363 award nominations and counting, including multi-Emmy Award-winning comedy “Ted Lasso” and Oscar Best Picture winner “CODA.”\n\nApple TV+ offers premium, compelling drama and comedy series, feature films, groundbreaking documentaries, and kids and family entertainment, and is available to watch across all your favorite screens. After its launch on November 1, 2019, Apple TV+ became the first all-original streaming service to launch around the world, and has premiered more original hits and received more award recognitions faster than any other streaming service in its debut."}, {"url": "https://www.etonline.com/2019-naacp-image-awards-the-complete-list-of-winners-122326", "page_content": "It was a night filled with many winners at the 50th annual NAACP Image Awards.\n\nHosted by Anthony Anderson, the stars stepped out to attend the annual celebration at the Dolby Theatre in Hollywood on Saturday, and to also take home some trophies.\n\nLeading the pack was Black Panther with a total of 14 nominations, including Outstanding Motion Picture, Outstanding Actor in a Motion Picture and Outstanding Ensemble Cast in a Motion Picture, among many others. BlacKkKlansman, Crazy Rich Asians, If Beale Street Could Talk, Widows and The Hate U Give were also up for multiple awards.\n\nOn the TV side, Black-ish, Insecure, Seven Seconds, Atlanta and How to Get Away With Murder were among the most celebrated series at this year's event.JAY-Z received the President’s Award during the ceremony, and Beyonce won Entertainer of the Year.\n\nThe NAACP Image Awards is a multicultural awards show that celebrates the accomplishments of people of color in television, music, literature and film, as well as honors individuals or groups who promote social justice through creative endeavors.\n\nFILM\n\nOutstanding Motion Picture\n\nBlack Panther (Marvel Studios) -- WINNER\n\nBlacKkKlansman (Focus Features)\n\nCrazy Rich Asians (Warner Bros. Pictures)\n\nIf Beale Street Could Talk (Annapurna Pictures)\n\nThe Hate U Give (20th Century Fox)\n\nOutstanding Actor in a Motion Picture\n\nChadwick Boseman – Black Panther (Marvel Studios) -- WINNER\n\nMichael B Jordan – Creed II (Metro-Goldwyn-Mayer Studios)\n\nDenzel Washington – The Equalizer 2 (Columbia Pictures)\n\nJohn David Washington – BlacKkKlansman (Focus Features)\n\nStephan James – If Beale Street Could Talk (Annapurna Pictures)\n\nOutstanding Actress in a Motion Picture\n\nAmandla Stenberg – The Hate U Give (20th Century Fox) -- WINNER\n\nConstance Wu – Crazy Rich Asians (Warner Bros. Pictures)\n\nKiKi Layne – If Beale Street Could Talk (Annapurna Pictures)\n\nSanaa Lathan – Nappily Ever After (Marc Platt Production/Badabing Pictures Production for Netflix)\n\nViola Davis – Widows (20th Century Fox)\n\nOutstanding Supporting Actor in a Motion Picture\n\nBrian Tyree Henry – If Beale Street Could Talk (Annapurna Pictures)\n\nMahershala Ali – Green Book (Universal Pictures, Participant Media, DreamWorks)\n\nMichael B. Jordan – Black Panther (Marvel Studios) -- WINNER\n\nRussell Hornsby – The Hate U Give (20th Century Fox)\n\nWinston Duke – Black Panther (Marvel Studios)\n\nOutstanding Supporting Actress in a Motion Picture\n\nDanai Gurira – Black Panther (Marvel Studios) -- WINNER\n\nLetitia Wright – Black Panther (Marvel Studios)\n\nLupita Nyong’o – Black Panther (Marvel Studios)\n\nRegina Hall – The Hate U Give (20th Century Fox)\n\nRegina King – If Beale Street Could Talk (Annapurna Pictures)\n\nOutstanding Independent Motion Picture\n\nBlacKkKlansman (Focus Features)\n\nIf Beale Street Could Talk (Annapurna Pictures) -- WINNER\n\nNappily Ever After (Marc Platt Production/Badabing Pictures Production for Netflix)\n\nSorry To Bother You (Annapurna Pictures)\n\nTraffik (Codeblack Films/Lionsgate Entertainment)\n\nOutstanding Breakthrough Performance in a Motion Picture\n\nStorm Reid – A Wrinkle In Time (Walt Disney Studios)\n\nLetitia Wright – Black Panther (Marvel Studios) -- WINNER\n\nWinston Duke – Black Panther (Marvel Studios)\n\nJohn David Washington – BlacKkKlansman (Focus Features)\n\nKiKi Layne – If Beale Street Could Talk (Annapurna Pictures)\n\nOutstanding Ensemble Cast in a Motion Picture\n\nBlack Panther (Marvel Studios) -- WINNER\n\nBlacKkKlansman (Focus Features)\n\nCrazy Rich Asians (Warner Bros. Pictures)\n\nThe Hate U Give (20th Century Fox)\n\nWidows (20th Century Fox)\n\nTELEVISION\n\nOutstanding Comedy Series\n\nAtlanta (FX Networks)\n\nBlack-ish (ABC) -- WINNER\n\nDear White People (Netflix)\n\nGrown-ish (Freeform)\n\nInsecure (HBO)\n\nOutstanding Actor in a Comedy Series\n\nAnthony Anderson, Black-ish (ABC) -- WINNER\n\nCedric the Entertainer, The Neighborhood (CBS)\n\nDonald Glover, Atlanta (FX Networks)\n\nDwayne Johnson, Ballers (HBO)\n\nTracy Morgan, The Last O.G. (TBS)\n\nOutstanding Actress in a Comedy Series\n\nDanielle Brooks, Orange Is the New Black (Netflix)\n\nIssa Rae, Insecure (HBO)\n\nLogan Browning, Dear White People (Netflix)\n\nTracee Ellis Ross, Black-ish (ABC) -- WINNER\n\nYara Shahidi, Grown-ish (Freeform)\n\nOutstanding Supporting Actor in a Comedy Series\n\nJay Ellis, Insecure (HBO)\n\nJohn David Washington, Ballers (HBO)\n\nLaurence Fishburne, Black-ish (ABC)\n\nMarcus Scribner, Black-ish (ABC) -- WINNER\n\nTituss Burgess, Unbreakable Kimmy Schmidt (Netflix)\n\nOutstanding Supporting Actress in a Comedy Series\n\nEssence Atkins, Marlon (NBC)\n\nMarsai Martin, Black-ish (ABC) -- WINNER\n\nNatasha Rothwell, Insecure (HBO)\n\nUzo Aduba, Orange Is the New Black (Netflix)\n\nYvonne Orji, Insecure (HBO)\n\nOutstanding Drama Series\n\nHow To Get Away With Murder (ABC)\n\nPower (Starz) -- WINNER\n\nQueen Sugar (OWN)\n\nThe Chi (Showtime)\n\nThis Is Us (NBC)\n\nOutstanding Actor in a Drama Series\n\nJason Mitchell, The Chi (Showtime)\n\nKeith David, Greenleaf (OWN)\n\nKofi Siriboe, Queen Sugar (OWN)\n\nOmari Hardwick, Power (Starz) -- WINNER\n\nSterling K. Brown, This Is Us (NBC)\n\nOutstanding Actress in a Drama Series\n\nAlfre Woodard, Marvel’s Luke Cage (Netflix)\n\nNaturi Naughton, Power (Starz)\n\nRutina Wesley, Queen Sugar (OWN)\n\nTaraji P. Henson, Empire (FOX) -- WINNNER\n\nViola Davis, How to Get Away with Murder (ABC)\n\nOutstanding Supporting Actor in a Drama Series\n\nJesse Williams, Grey’s Anatomy (ABC) -- WINNER\n\nJoe Morton, Scandal (ABC)\n\nJussie Smollett, Empire (FOX)\n\nRomany Malco, A Million Little Things (ABC)\n\nWendell Pierce, Tom Clancy’s Jack Ryan (Prime Video)\n\nOutstanding Supporting Actress in a Drama Series\n\nCCH Pounder, NCIS: New Orleans (CBS)\n\nLynn Whitfield, Greenleaf (OWN) -- WINNER\n\nSanaa Lathan, The Affair (Showtime)\n\nSusan Kelechi Watson, This Is Us (NBC)\n\nThandie Newton, Westworld (HBO)\n\nOutstanding Guest Performance in a Comedy or Drama Series\n\nErika Alexander – Black Lightning – \"Book of Consequences: Chapter Three: Master Lowery\" (CW)\n\nKendrick Lamar – Power – \"Happy Birthday\" (Starz)\n\nKerry Washington – How to Get Away with Murder – \"Lahey v. Commonwealth of Pennsylvania\" (ABC) -- WINNER\n\nLoretta Devine – Love Is_ – \"Rose (Going Home)\" (OWN)\n\nTisha Campbell-Martin – Empire – \"Without Apology\" (Fox)\n\nOutstanding Television Movie, Limited-Series or Dramatic Special\n\nBehind The Movement (TV One)\n\nJesus Christ Superstar Live in Concert (NBC)\n\nSeven Seconds (Netflix)\n\nThe Bobby Brown Story (BET) -- WINNER\n\nThe Simone Biles Story: Courage to Soar (Lifetime)\n\nOutstanding Actor in a Television Movie, Limited-Series or Dramatic Special\n\nBrandon Victor Dixon, Jesus Christ Superstar Live in Concert (NBC)\n\nJohn Legend, Jesus Christ Superstar Live in Concert (NBC)\n\nMichael B. Jordan, Fahrenheit 451 (HBO) -- WINNER\n\nRussell Hornsby, Seven Seconds (Netflix)\n\nWoody McClain, The Bobby Brown Story (BET)\n\nOutstanding Actress in a Television Movie, Limited-Series or Dramatic Special\n\nAnna Deavere Smith, Notes From the Field (HBO)\n\nGabrielle Dennis, The Bobby Brown Story (BET)\n\nJeanté Godlock, The Simone Biles Story: Courage to Soar (Lifetime)\n\nRegina King, Seven Seconds (Netflix) -- WINNER\n\nToni Braxton, Faith Under Fire: The Antoinette Tuff Story (Lifetime)\n\nOutstanding News/Information (Series or Special)\n\nA Thousand Words With Michelle Obama (BET)\n\nAM Joy (MSNBC)\n\nAngela Rye’s State of the Union (BET)\n\nOprah Winfrey Presents: Becoming Michelle Obama (OWN) -- WINNER\n\nUnsung (TV One)\n\nOutstanding Talk Series\n\nESPN’s First Take (ESPN)\n\nRed Table Talk (Facebook Watch)\n\nThe Daily Show with Trevor Noah (Comedy Central)\n\nThe Real (Syndicated) -- WINNER\n\nThe View (ABC)\n\nOutstanding Reality Program, Reality Competition or Game Show (Series)\n\nIyanla: Fix My Life (OWN) -- WINNER\n\nLip Sync Battle (Paramount Network)\n\nRuPaul’s Drag Race (VH1)\n\nShark Tank (ABC)\n\nThe Voice (NBC)\n\nOutstanding Variety Show (Series or Special)\n\n2 Dope Queens (HBO)\n\nBlack Girls Rock! (BET) -- WINNER\n\nBruno Mars: 24K Magic Live at the Apollo (CBS)\n\nSaturday Night Live (NBC)\n\nTrevor Noah: Son of Patricia (Netflix)\n\nOutstanding Children’s Program\n\nDoc McStuffins (Disney Junior) -- WINNER\n\nMarvel’s Avengers: Black Panther’s Quest (Disney XD)\n\nMotown Magic (Netflix)\n\nSesame Street (HBO)\n\nTop Chef Junior (Universal Kids)\n\nOutstanding Performance by a Youth (Series, Special, Television Movie or Limited-Series)\n\nAlex R. Hibbert, The Chi (Showtime)\n\nLonnie Chavis, This Is Us (NBC)\n\nLyric Ross, This Is Us (NBC)\n\nMarsai Martin, Black-ish (ABC) -- WINNER\n\nMiles Brown, Black-ish (ABC)\n\nOutstanding Host in a Talk or News/Information (Series or Special) – Individual or Ensemble\n\nJada Pinkett Smith, Adrienne Banfield Norris, Willow Smith – Red Table Talk(Facebook Watch) -- WINNER\n\nJoy Reid – AM Joy (MSNBC)\n\nLeBron James – The Shop (HBO)\n\nLester Holt – NBC Nightly News with Lester Holt (NBC)\n\nTrevor Noah – The Daily Show with Trevor Noah (Comedy Central)\n\nOutstanding Host in a Reality/Reality Competition, Game Show or Variety (Series or Special) – Individual or Ensemble\n\nIyanla Vanzant – Iyanla: Fix My Life (OWN)\n\nLL Cool J – Lip Sync Battle (Paramount Network)\n\nQueen Latifah – Black Girls Rock (BET)\n\nRuPaul – RuPaul’s Drag Race (VH1)\n\nSteve Harvey – Family Feud (Syndication) -- WINNER\n\nSPECIAL AWARD\n\nEntertainer of the Year\n\nBeyoncé -- WINNER\n\nChadwick Boseman\n\nLeBron James\n\nRegina King\n\nRyan Coogler\n\nDOCUMENTARY\n\nOutstanding Documentary (Film)\n\nAmazing Grace (Sundial Pictures/Neon) -- WINNER\n\nMaking The Five Heartbeats(Green Lighthouse)\n\nQuincy (Netflix)\n\nRBG (CNN)\n\nWhitney (Roadside Attractions/Miramax)\n\nOutstanding Documentary (Television)\n\nHope & Fury: MLK, The Movement and the Media (NBC)\n\nKing in the Wilderness (HBO)\n\nSay Her Name: The Life and Death of Sandra Bland (HBO) -- WINNER\n\nShut Up & Dribble (Showtime)\n\nTime For Ilhan (Fuse)\n\nWRITING\n\nOutstanding Writing in a Comedy Series\n\nJustin Simien – Dear White People – \"Chapter 1\" (Netflix)\n\nMarquita J. Robinson – GLOW – \"Work the Leg\" (Netflix)\n\nPeter H. Saji – Black-ish – \"Purple Rain\" (ABC)\n\nRegina Y. Hicks – Insecure – \"High-Like\" (HBO)\n\nTrevor Noah, Steve Budow, David Kibuuka, Zhubin Parang, Dan Amira, Lauren Sarver Means, Mr. Daniel Radosh, David Angelo, Devin Trey Delliquanti, Zachary DiLanzo – The Daily Show with Trevor Noah – \"23087 Alex Wagner\"(Comedy Central)\n\nOutstanding Writing in a Drama Series\n\nJanine Sherman Barrois – Claws – Cracker Casserole (TNT)\n\nKay Oyegun This Is Us – This Big, Amazing, Beautiful Life (NBC) -- WINNER\n\nLena Waithe – The Chi – Pilot (Showtime)\n\nPatrick Joseph Charles – Black Lightning – Sins of the Father: The Book of Redemption (The CW/Netflix)\n\nLena Waithe, Dime Davis, – The Chi – The Whistle (Showtime)\n\nOutstanding Writing in a Motion Picture (Television)\n\nAnna Deavere Smith – Notes From the Field (HBO)\n\nJ. David Shanks – Seven Seconds: Matters of Life and Death (Netflix) -- WINNER\n\nKatrina M. O’Gilvie – Behind the Movement (TV One)\n\nRamin Bahrani, Amir Naderi – Fahrenheit 451 (HBO)\n\nShalisha Francis – Seven Seconds: Of Gods and Men (Netflix)\n\nOutstanding Writing in a Motion Picture (Film)\n\nBarry Jenkins – If Beale Street Could Talk (Annapurna Pictures)\n\nBoots Riley – Sorry To Bother You (Annapurna Pictures)\n\nCharlie Wachtel, David Rabinowitz, Kevin Willmott, Spike Lee – BlacKkKlansman (Focus Features)\n\nPeter Chiarelli, Adele Lim – Crazy Rich Asians (Warner Bros. Pictures)\n\nRyan Coogler, Joe Robert Cole – Black Panther (Marvel Studios) -- WINNER\n\nDIRECTING\n\nOutstanding Directing in a Comedy Series\n\nDonald Glover – Atlanta – \"FUBU\" (FX Networks) -- WINNER\n\nGina Rodriguez – Jane the Virgin – \"Chapter Seventy-Four\" (CW)\n\nHiro Murai – Atlanta – \"Teddy Perkins\" (FX Networks)\n\nKen Whittingham – Atypical – “Ernest Shackleton’s Rules for Survival” (Netflix)\n\nMillicent Shelton – Insecure – \"High-Like\" (HBO)\n\nOutstanding Directing in a Drama Series\n\nAyoka Chenzira – Queen Sugar – \"Here Beside the River\" (OWN)\n\nDeborah Ann Chow – Better Call Saul – \"Something Stupid\" (AMC) -- WINNER\n\nDee Rees – Philip K. Dick’s Electric Dreams – \"Kill All Others\" (Prime Video)\n\nSalli Richardson-Whitfield – Marvel’s Luke Cage – \"I Get Physical\" (Netflix)\n\nZetna Fuentes – How To Get Away With Murder – \"Lahey v. Commonwealth of Pennsylvania' (ABC)\n\nOutstanding Directing in a Motion Picture (Television)\n\nErnest Dickerson – Seven Seconds: Until It Do (Netflix)\n\nRamin Bahrani – Fahrenheit 451 (HBO)\n\nTanya Hamilton – Seven Seconds: That What Follows (Netflix)\n\nTracy Heather Strai – Lorraine Hansberry: Sighted Eyes/Feeling Heart (PBS) -- WINNER\n\nVictoria Mahoney – Seven Seconds: Witness for the Prosecution (Netflix)\n\nOutstanding Directing in a Motion Picture (Film)\n\nBarry Jenkins – If Beale Street Could Talk (Annapurna Pictures)\n\nSpike Lee – BlacKkKlansman (Focus Features)\n\nSteve McQueen – Widows (20th Century Fox)\n\nRyan Coogler – Black Panther (Marvel Studios) -- WINNER\n\nAlan Hicks, Rashida Jones – Quincy (A Le Train Train\\Bob’s Your Uncle\\Tribeca Production for Netflix)\n\nANIMATED/CGI\n\nOutstanding Character Voice-Over Performance (Television or Film)\n\nIssa Rae – Bojack Horseman (Netflix)\n\nLaya Deleon Hayes – Doc McStuffins (Disney Junior)\n\nMahershala Ali – Spider-Man: Into the Spider-Verse (Columbia Pictures/Sony Pictures Animation in association with Marvel)\n\nSamuel L. Jackson – Incredibles 2 (Disney and Pixar Animation Studios) -- WINNER\n\nShameik Moore – Spider-Man: Into the Spider-Verse (Columbia Pictures/Sony Pictures Animation in association with Marvel)\n\nMUSIC/RECORDING\n\nOutstanding New Artist\n\nElla Mai (10 Summers/Interscope Records) -- WINNER\n\nJade Novah (EMPIRE)\n\nKoryn Hawthorne (RCA Inspiration)\n\nOmar Wilson (BSE Recordings)\n\nTory Lanez (Mad Love/Interscope Records)\n\nOutstanding Male Artist\n\nBruno Mars (Atlantic Records) -- WINNER\n\nChildish Gambino (RCA Records)\n\nJohn Legend (Columbia Records)\n\nMAJOR. (BOE/Empire)\n\nRaheem DeVaughn (BMG)\n\nOutstanding Female Artist\n\nAndra Day (Warner Bros. Records)\n\nElla Mai (10 Summers/Interscope Records)\n\nH.E.R. (RCA Records) -- WINNER\n\nJanelle Monáe (Atlantic Records)\n\nJanet Jackson (Rhythm Nation)\n\nOutstanding Duo, Group or Collaboration\n\n“A Good Night” – John Legend feat. BloodPop (Columbia Records)\n\n“All The Stars” – Black Panther – Kendrick Lamar, SZA (Top Dawg Entertainment/Aftermath/Interscope Records) -- WINNER\n\n“Could’ve Been” – H.E.R., Bryson Tiller (RCA Records)\n\n“Finesse (Remix)” – Bruno Mars feat. Cardi B (Atlantic Records)\n\n“Everything Is Love” – The Carters (Roc Nation)\n\nOutstanding Jazz Album\n\nFacing Dragons – Christian Sands (Mack Avenue)\n\nHollywood Africans – Jon Batiste (Verve)\n\nRISE! – Ben Tankard feat. Marion Meadows, Kirk Whalum, Paul Jackson Jr. (Ben-Jamin’ Universal Music)\n\nThe Story of Jaz – Jazmin Ghent feat. Jeff Lorber, James P. Lloyd, Kim Scott, Philippe Saisse (Jazmin Ghent Music) -- WINNER\n\nWaiting for the Sunrise – Camille Thurman (Chesky Records)\n\nOutstanding Gospel Album (Traditional or Contemporary)\n\nHeart. Passion. Pursuit. Live at Passion City Church – Tasha Cobbs Leonard (Motown Gospel)\n\nHiding Place – Tori Kelly (Capitol Records)\n\nMake Room – Jonathan McReynolds (Entertainment One)\n\nOne Nation Under God – Jekalyn Carr (LMG)\n\nUnstoppable – Koryn Hawthorne (RCA Inspirational) WINNER\n\nOutstanding Music Video/Visual Album\n\nAPES**T – The Carters (Roc Nation)\n\nCould’ve Been – H.E.R. feat. Bryson Tiller (RCA Records)\n\nFinesse (Remix) – Bruno Mars feat. Cardi B (Atlantic Records)\n\nThis Is America – Childish Gambino (RCA Records) -- WINNER\n\nAll The Stars – Kendrick Lamar, SZA (Top Dawg Entertainment/Aftermath/Interscope Records)\n\nOutstanding Song – Traditional\n\n\"Amen\" – Andra Day (Warner Bros. Records)\n\n\"Better With You In It\" – MAJOR. (BOE/Empire)\n\n\"Beyond\" – Leon Bridges (Columbia Records)\n\n\"Long As I Live\" – Toni Braxton (Def Jam Recordings) -- WINNER\n\n\"Never Alone\" – Tori Kelly feat. Kirk Franklin (Capital Records)\n\nOutstanding Song – Contemporary\n\n“A Good Night” – John Legend feat. BloodPop (Columbia Records)\n\n“As I Am” – H.E.R. (RCA Records)\n\n“Boo’d Up” – Ella Mai (10 Summers/Interscope Records) -- WINNER\n\n“Finesse (Remix)” – Bruno Mars feat. Cardi B (Atlantic Records)\n\n“This Is America” – Childish Gambino (RCA Records)\n\nOutstanding Soundtrack/Compilation\n\nBlack Panther: The Album, Music From and Inspired By – Kendrick Lamar, SZA feat. 2Chainz, ScHoolboy Q, Saudi, Khalid, Swae Lee, Vince Staples, Yugen Blakrok, SOB x RBE, Jorja Smith, Anderson Paak, Ab Soul, Reason, Zacari, Babes Wudumo, Sjava, Travis Scott (Interscope Records) -- WINNER\n\nGreenleaf, Season 3 (Music from the Original TV series)” – Various Artists (Lions Gate Entertainment)\n\nMarvel’s Luke CageSeason Two – Adrian Younge & Ali Shaheed Muhammad (Mondo Music)\n\nInsecure Music From The HBO Original Series, Season 3 – Various Artists (RCA Records)\n\nSpider-Man: Into the Spider-Verse (Soundtrack From & Inspired by the Motion Picture) – Various Artists (Republic Records)\n\nOutstanding Album\n\nDirty Computer – Janelle Monáe (Atlantic Records)\n\nElla Mai – Ella Mai (10 Summers/Interscope Records) -- WINNER\n\nEven More – MAJOR. (BOE/Empire)\n\nEverything Is Love – The Carters (Roc Nation)\n\nI Used To Know Her: The Prelude – H.E.R. (RCA Records)\n\nLITERARY\n\nOutstanding Literary Work – Fiction\n\nAn American Marriage – Tayari Jones (Algonquin Books of Chapel Hill) -- WINNER\n\nBetter Late Than Never – Kimberla Lawson Roby (Grand Central Publishing)\n\nBlack Panther: Who Is The Black Panther? Prose Novel – Jesse James Holland Jr (Titan Books)\n\nEnvy – Victoria Christopher Murray (Touchstone)\n\nThey Come in All Colors: A Novel – Malcolm Hansen (Atria Books)\n\nOutstanding Literary Work – Nonfiction\n\nBarracoon – Zora Neale Hurston (Amistad HarperCollins Publishers)\n\nBlack Girls Rock! Owning Our Magic. Rocking Our Truth – Beverly Bond (37 Ink, A Division of Atria Books)\n\nFor Colored Girls Who Have Considered Politics – Donna Brazile (Author), Yolanda Caraway (Author), Leah Daughtry (Author), Minyon Moore (Author), Veronica Chambers (With), (St. Martin’s Press) -- WINNER\n\nMay We Forever Stand: A History of the Black National Anthem – Imani Perry (University of North Carolina Press)\n\nThe Sun Does Shine: How I Found Life and Freedom on Death Row – Anthony Ray Hinton (Author), Lara Love Hardin (With), (St. Martin’s Press)\n\nOutstanding Literary Work – Debut Author\n\nHeads of the Colored People: Stories – Nafissa Thompson-Spires (37 Ink, A Division of Atria Books)\n\nLighting the Fires of Freedom: African American Women in the Civil Rights Movement – Janet Dewart Bell (The New Press)\n\nLucile H. Bluford and the Kansas City Call: Activist Voice for Social Justice – Dr. Sheila D. Brooks (Author), Clinton C. Wilson II (Author), (Rowman & Littlefield)\n\nSmall Country: A Novel – Gaël Faye (Hogarth)\n\nUs Against The World: Our Secrets to Love, Marriage, and Family – David Mann (Author), Tamela Mann (Author), Shaun Saunders (With), (W Publishing) -- WINNER\n\nOutstanding Literary Work – Biography/Autobiography\n\nBarracoon – Zora Neale Hurston (Amistad HarperCollins Publishers)\n\nBecoming – Michelle Obama (Crown) -- WINNER\n\nThe New Negro: The Life of Alain Locke – Jeffrey C. Stewart (Oxford University Press)\n\nThe Prison Letters of Nelson Mandela – Nelson Mandela (Author), Sahm Venter (Editor) (Liveright Publishing)\n\nWell, That Escalated Quickly: Memoirs and Mistakes of an Accidental Activist – Franchesa Ramsey (Grand Central Publishing)\n\nOutstanding Literary Work – Instructional\n\nCarla Hall’s Soul Food: Everyday and Celebration – Carla Hall (Author) Genevive Ko (With) (Harper Wave)\n\nFor Colored Girls Who Have Considered Politics – Donna Brazile (Author), Yolanda Caraway (Author), Leah Daughtry (Author), Minyon Moore (Author), Veronica Chambers (With), (St. Martin’s Press)\n\nPoised For Excellence: Fundamental Principles of Effective Leadership in the Boardroom and Beyond – Karima Mariam-Arthur (Palgrave Macmillan)\n\nRise and Grind: Outperform, Outwork, and Outhustle Your Way to a More Successful and Rewarding Life – Daymond John (Author), Daniel Paisner (With), (Currency) -- WINNER\n\nWell-Read Black Girl: Finding Our Stories, Discovering Ourselves – Glory Edim (Ballantine Books)\n\nOutstanding Literary Work – Poetry\n\nConfessions of a Barefaced Woman – Allison Elaine Joseph (Red Hen Press)\n\nGhost, Like a Place – Iain Haley Pollock (Alice James Books)\n\nRefuse – Julian Randall (University of Pittsburgh Press)\n\nTaking the Arrow Out of the Heart – Alice Walker (Author) (37 Ink/Atria Books) -- WINNER\n\nThe Gospel According to Wild Indigo – Cyrus Cassells (Crab Orchard Review & Southern Illinois University Press)\n\nOutstanding Literary Work – Children\n\nFacing Frederick: The Life of Frederick Douglass, A Monumental American Man – Tonya Bolden (Abrams For Young Readers)\n\nHidden Figures: The True Story of Four Black Women and the Space Race – Margot Lee Shetterly (Author), Laura Freeman (Illustrator), (Harper) -- WINNER\n\nI Can Be Anything! Don’t Tell Me I Can’t – Diane Dillon (The Blue Sky Press)\n\nThe 5 O’Clock Band – Troy “Trombone Shorty” Andrews (Author), Bryan Collier (Illustrator), (Abrams For Young Readers)\n\nThe Word Collector – Peter H. Reynolds (Orchard Books)\n\nOutstanding Literary Work – Youth/Teens\n\nA Very Large Expanse of Sea – Tahereh Mafi (Harper)\n\nChasing King’s Killer: The Hunt for Martin Luther King, Jr.’s Assassin – James L. Swanson (Scholastic Press)\n\nHarbor Me – Jacqueline Woodson (Nancy M. Paulsen) -- WINNER\n\nThe Journey of Little Charlie – Christopher Paul Curtis (Scholastic Press)\n\nWe Are Not Yet Equal: Understanding our Racial Divide – Carol Anderson (Author), Tonya Bolden (With), (Bloomsbury YA)\n\nFor more of ET's NAACP Image Awards coverage, see below.\n\nGET THE ET NEWSLETTER Email By signing up, you agree to our Terms of Use and Privacy Policy\n\nRELATED CONTENT:\n\nJussie Smollett Skips NAACP Image Awards Dinner, Loses in Nominated Category\n\nAnthony Anderson Hopes Jussie Smollett 'Speaks His Truth' at NAACP Image Awards After Legal Drama (Exclusive)\n\nHalle Berry Stuns in Sheer Lace Dress at NAACP Image Awards\n\nAnthony Anderson Weighs In on Where Jussie Smollett Goes From Here (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Up Next\n\nRelated Gallery"}], "Millicent Shelton was nominated for her work on The Game.": [{"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://www.awardsdaily.com/2022/09/12/end-of-the-road-director-millicent-shelton-on-working-with-queen-latifah-and-the-importance-of-inclusion-in-storytelling/", "page_content": "Millicent Shelton started her career as a wardrobe production assistant on Spike Lee’s 1989 classic Do the Right Thing. That opportunity served as a springboard to a directing career of her own across music videos, television, and film. Her direction of the 30 Rock episode “Apollo, Apollo” would make her the first Black woman to receive an Emmy nomination for Outstanding Directing for a Comedy Series.\n\nWith Netflix’s End of the Road (currently streaming), Shelton again works with star and producer Queen Latifah. In the film, Latifah plays Brenda, a recently widowed mother who loses her home in Los Angeles. After deciding to move home to Houston, Brenda travels across the Southwest with her brother (Ludacris) and two children (Mychala Lee, Shaun Dixon). On the journey, they run afoul of a major crime boss thanks to a bag of money that holds the potential to change their lives. The film asks viewers to experience the world through the eyes of this troubled Black family as they hold together in the face of traumatic danger.\n\nHere, in an interview with Awards Daily, Millicent Shelton talks about what drew her to the project and what it’s like to work with Queen Latifah both in front of and behind the camera. She talks about the film’s vivid color palate and the joyous luck in finding four actors who held so much natural chemistry together. Finally, she talks about the importance of inclusivity and the recent conversation around two major television series — HBO’s House of the Dragon and Amazon Studio’s The Lord of the Rings: The Rings of Power — who cast Black actors in major roles within the series.\n\nAwards Daily: I’d like to start with recent controversies related to specific audiences rejecting inclusive efforts on such major projects as Rings of Power and House of the Dragon. How do you as a filmmaker react to that in a modern filmmaking environment? Does it make you even more determined to pursue inclusive projects?\n\nMillicent Shelton: It does. I tend to be a little bit of a rebel. I like to push against what people perceive as the norm. So the perception we have had in television and cinematically has been very Caucasian. Not only are white Americans used to that, but so are Black Americans or Asian Americans or Latino Americans. That’s how a lot of body dysmorphia happens to Black girls and Latino girls and Asian girls. They don’t see people like them represented as images of beauty. There’s a movement now to change that.\n\nI honestly think that’s what our country fought for — to have representation and freedom. If we’re going to truly embrace what we say this country is about which is about embracing diversity and about the melting pot, then we should embrace that in front of and behind the camera as well. I honestly believe that we are stronger when we are like that. To me, diversity is not making an all Black film, not that I’m against that. I think diversity is a mix of everybody, and it’s not just different colors. It’s also different religions. It’s different sexual preferences. It’s diversity of all, and that’s what makes us as a country stronger because we get to experience a lot of different people’s perspectives. I think that our creativity is better that way.\n\nIn this film, we had a mix of everyone in all key positions. We really functioned that way. I like to say that we were a crew that went through a lot of strenuous situations. We survived it as a team, and we survived it as a family. We were a very diverse family, but we survived it as a family.\n\nAD: So you have a Brazilian production designer and an Asian American cinematographer. The film has a very international visual flair. The roadside motel, in particular, doesn’t look like any I’ve ever seen. In fact, the entire color palate for the film is incredibly vibrant and bursting with deep, vivid colors.\n\nMS: [The motel room] is my Brazilian production designer. It’s interesting because we kept looking for motel rooms, and we could not find them. They’re all too little. So we decided to build it, but we had seen a reference for this one in a motel that doesn’t exist anymore. It had cherubs on the wall, and that was it — Lucio’s [Seixas, production designer] brain started to go. Our whole vision for this film was exaggerated reality. I wanted to push it outside of the realm of just playing on normal. So the idea of making these rooms a little over the top I embraced. We embraced the color too because we wanted extreme colors. That was kind of tough because we were shooting in Albuquerque, New Mexico, and a lot of the buildings there are beige. So, we found a gas station with a lot of color and a motel with a lot of color. Then, we added the neon tubes all around. Some people are freaked out by the color palette in this movie, but as an artist, I think sometimes we should push the boundaries of what people find to be regular.\n\nAD: The film offers this theme of the lack of connectivity, that lack of civilization, where the characters are left to their wits that have been dulled by modern technology. What was it about End of the Road that attracted you as a director?\n\nMS: What originally attracted me was the opportunity to work with Queen Latifah again. We’ve sort of known each other from music videos in New York for a while, worked together on Star, and then the opportunity to work with her again… I just love working with her. Since this movie, we’ve worked together on an episode of Equalizer. She’s a wonderful talent. I read the script because she was attached to it. When I read it, I could relate to this woman who was reeling from the loss. The family was torn apart and found their way back to each other. From adversity, the family actually becomes stronger, and I could relate to that story. I wanted to tell that story, particularly about a Black family but it’s not a story that’s unique to a Black family. However, what they face going through these desolate areas with the racism that happens, both covert and overt, is something that Black people experience in the United States whether anybody wants to admit it or not. That’s something that’s our reality, and I wanted to be able to show that.\n\nAD: As you’ve mentioned, you have worked with Queen Latifah multiple times. What was it like working with her as both an actress and as a producer on this film?\n\nMS: She functions primarily as an actress. She doesn’t throw the weight of the producer title on you. She comes in with a pure heart, and she really is in the state of mind of an actress. When we got into post-production, then she went into producer mode and was really helpful in supporting me through getting this film done. So, it actually worked really well. But as an actress, she shows up prepared, and she’s willing to get feedback. She’s willing to give feedback, which I think is great. I love to get feedback from actors because I really admire what actors bring to the table as they bring a different sensibility than even the writers or the director brings because they live through the spirit of a character. When I hear what their thoughts are about the words and what’s happening to that character, I really take that to heart. I find that it makes all the scenes better.\n\nAll the times in the movie where she makes reference to her dead husband, that’s all Latifah. I lost my mother a month before we went into prep on this movie, and so I was reeling from that loss. She said, ‘You know, when you lose somebody, you talk to them. They stay with you.’ And so we talked about it. We picked moments in the film when Brenda would say something to her husband. That’s how those moments came alive. That’s all from the actor having a thought about the spirit of the character.\n\nAD: The film rises on those moments of that core family group. How did you work with those four actors to build that incredible chemistry that really comes across on screen?\n\nMS: The chemistry actually was there naturally. It’s interesting. Queen Latifah actually recommended Ludacris for the role of Reggie. After the first time I talked to him, I was like he’s Reggie. He’s not really Reggie in real life, but when we were talking about it, he understood Reggie. The next person that we cast was Mikayla, who plays the daughter, and she just stood out amongst everybody. She’s a wonderful actress. I just actually got to work with her again on a couple of episodes of Truth Be Told for Apple. We did a lot of chemistry test reads with her and the potentials for the brother, and Shawn read and it was just immediately chemistry. You just saw brother and sister. They went at it. They were ad libbing, and they just went at it. It was just like another brother and sister. Then, we had a cast dinner a few nights before the first day of shooting. It was just those four characters, and we had a really lovely long dinner. We just were all talking about our lives and our dreams and kind of where we came from. They started to bond as a family, and the rest was just magic. They really felt like a real family. They had nicknames for each other and everything.\n\nAD: Last question for you: let’s say you have the keys to the kingdom. You’ve worked in television, you’ve worked in streaming, you’ve worked in film, and you’ve worked in music videos. You’ve done a little bit of everything. If there were no barriers and budget wasn’t a concern, then what would be your dream project?\n\nMS: I have a dream project right now I want to do. I want to do a limited series about Josephine Baker starring Ruth Negga. That’s what I want to do.\n\nEnd of the Road is now streaming exclusively on Netflix."}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}, {"url": "https://rollingout.com/2007/08/09/millicent-shelton-deconstructing-hollywood/", "page_content": "millicent shelton – deconstructing hollywood\n\nphoto by steed media service\n\nTV Director\n\nAward-winning writer/director Millicent Shelton is still on top of her\n\ngame. Having originally wowed the world with her impressive producing\n\nand directing skills in over 100 music videos, her second act has been\n\nall the more impressive. Now as a television director, Shelton has\n\ndirected episodes for hit shows like “Everybody Hates Chris,” “My Name\n\nis Earl” and “The Bernie Mac Show”- the last of which earned her an\n\nNAACP Image Award for Outstanding Directing in a Comedy Series.\n\nAs\n\nShelton looks back over her extraordinary career, she can’t help but\n\nreflect on the mindset that allowed her to make it in Hollywood.\n\n“I think that this job is just like any other job,” Shelton says. “You\n\nreally have to enjoy what you do, because at the end of the day it’s\n\nwork. On the outside, I think a lot of people fantasize about working\n\nin the entertainment industry, and they think that it’s all glitz and\n\nglamour. But it’s not easy. If it were, then everyone would be doing\n\nit. It takes hard work, it takes perseverance and it takes a lot of\n\nskill.”\n\nThe skill department is where Shelton has never\n\nsuffered a deficiency as evidenced by her superior résumé. But that\n\nhasn’t stopped her from constantly working at her craft, and pushing\n\nherself to even higher heights of greatness. “I never want to stop\n\nlearning,” she explains. “No matter how much I accomplish, I still feel\n\nlike there’s so much more to learn.”\n\n-g. mcclaren forde\n\n\n\n\n\n"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://medium.com/authority-magazine/millicent-shelton-5-things-i-wish-someone-told-me-when-i-first-became-a-filmmaker-894dd50dc40a", "page_content": "Thank you so much for joining us in this interview series! Our readers would love to get to know you a bit better. Can you tell us a bit of the ‘backstory’ of how you grew up?\n\nI grew up in St. Louis way out in the suburbs. I went to college at Princeton university in new jersey and every weekend I’d ride the train to New York City to hang out. It only made sense for me to move to new york after graduation and eventually earn my master's in film from NYU while directing music videos to pay the bills.\n\nCan you share a story with us about what brought you to this specific career path?\n\nI had to decide what I was going to major in at Princeton. I grew up believing that I wanted to be a lawyer but after interning for a summer at a law firm, I knew that was not the job for me. My mother told me to select a field that I loved but I had no clue what that was. It took me a while to do some soul searching. I remembered that I enjoyed creative writing. I took a summer course at NYU to explore what it was like to create a short film from a writer’s perspective and ended up loving being a director. By the end of the summer, i knew that there was no other job but directing for me.\n\nCan you share the funniest or most interesting story that occurred to you in the course of your filmmaking career?\n\nOne of my craziest experiences on set came during the filming of “end of the road.” I had just called cut on a scene with beau bridges outside of our motel location and we started to set up for the next scene when suddenly the blue sky turned brown, and we were hit with high winds mixed with sand so thick that you couldn’t see 3 feet in front of you. It’s called a ‘haboob’ which is a crazy intense dust storm. It lasted for 45 minutes then suddenly stopped and the most breathtaking sunset appeared. We filmed the SUV driving up to the motel in that light.\n\nWho are some of the most interesting people you have interacted with? What was that like? Do you have any stories?\n\nI have worked with so many brilliantly talented people. It was a dream of a lifetime to work with Al Pacino on “Hunters’. Every time I search for a visual film reference, one of his films appears! He’s been in so many iconic movies, its mind-blowing. He was a truly lovely actor who was collaborative and giving. There was a moment the first day that we worked together that I thought maybe I shouldn’t give Al Pacino a note, but that’s my job as a director. I gave him notes but I made sure that they were smart notes that I could back up and notes that would further enhance the magic that he naturally creates. He gave me a big hug on his last day and said, “I’d like to work with you again, kid.” I liked that he called me kid. It would be a blessing to work with Al again.\n\nNone of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are? Can you share a story about that?\n\nMy favorite professor at NYU was Nick Tanis. He taught me how to transform my daydreams into filmable images. Paris Barclay has been my mentor for years. I shadowed him off and on for 3 years trying to get my first break as a director in episodic television. On the first episode that I was hired on, Paris promised the producers that he would guide me through it and be there if I froze up then privately he told me that I could handle the job on my own which I did. Until covid, I was having an annual breakfast with David Nutter who is also a mentor to me. He was instrumental in helping me to move into action television and was a sounding board for me during my first pilot. There are countless other people that have helped me, but it would take up pages and pages! I am a driven person but have had lots of help along the way.\n\nCan you please give us your favorite “life lesson quote”? Can you share how that was relevant to you in your life?\n\n‘Never give up’ is my favorite quote. I started directing during a time when women and especially women of color were not welcomed with open arms as Hollywood television directors. There were lots of doors that were not open. I wanted to give up a lot, but that quote would ring through my head. My testimony is that I am here today because I had blind faith and perseverance and did not give up on my dream.\n\nI am very interested in diversity in the entertainment industry. Can you share three reasons with our readers about why you think it’s important to have diversity represented in film and television? How can that potentially affect our culture?\n\nI wholeheartedly believe in diversity. To me, diversity is a little bit of everyone, inclusive of all races, gender, and LGBTIQQ+. It’s important because cinema should be reflective of real life and our world is diverse. The more we have diverse voices behind the screen, the more our stories will ring true and have realistic characters, dialogue, and actions. The more that we explore diverse stories, the more that we realize that despite our ethnic or socio-economic differences, we are all very much the same. Family is family. Fear is fear. Love is love.\n\nWhat are some of the most interesting or exciting projects you are working on now?\n\nBeing able to shepherd ‘end of the road’ has been a wonderful experience that I am very proud of. It was great to collaborate with queen Latifah again. We worked together to create a black family with a female matriarch who is a smart, strong, mama bear willing to do whatever is necessary to protect her family. After this, I am in development on a Josephine Baker limited series with Ruth Negga attached in the leading role. I am super excited about that. We’re looking to delve deeper into Josephine than ever before. I can’t wait to see what ruth does with this part. She’s amazing!\n\nWhich aspect of your work makes you most proud? Can you explain or give a story?\n\nI am most proud of my ability to collaborate with actors. They are the conduit for the soul of the characters and I respect their position. I love hearing their point of view and then working to make sure that the feeling that they desire to convey is truly coming through. Both queen Latifah and Chris ‘Ludacris’ bridges were laser-focused on representing their characters in their truest light. They trusted me to give them feedback in order to make their performances stronger. Another actor that I’ve worked with is Forest Whitaker. He is the king of nuanced performances. When I worked with him on ‘empire’, I noticed that he would subtly change his performance with each take. We’d discuss it after each take and then land on the read that we both felt sold the story and character best.\n\nOk super. Here is the main question of our interview. What are your “5 things I wish someone told me when I first started” and why? Please share a story or example for each.\n\nGet sleep because production will seep into your dreams, and you will never have a sound sleep again. Trust your gut because you must stand up or fall down based on your own thoughts not because someone told you to do it. Be fearless. A healthy amount of fear is normal but don’t be too scared that it limits your ability to dream outside of the box. Listen to everyone. This doesn’t mean doing everything that everyone suggests but be smart enough and open enough to hear thoughts that may lead you to something great. Learn to say ‘no.’ it’s actually a secret power.\n\nWhen you create a film, which stakeholders have the greatest impact on the artistic and cinematic choices you make? Is it the viewers, the critics, the financiers, or your own personal artistic vision? Can you share a story with us or give an example of what you mean?\n\nWhen I create, I can’t think about what critics will say or it would make my mind spin. I read the material, daydream about it, and try to stay true to it. My goal is to take the 2-dimensional words off the page and breathe life into their 3-dimensional existence with the help of actors and amazing crew members. I like to say that as a director, ‘i service script.’\n\nYou are a person of great influence. If you could start a movement that would bring the most amount of good to the most amount of people, what would that be? You never know what your idea can trigger. :-)\n\nMy movement would be for equality and parity for all. In particular, a woman’s right to choose how she uses her body.\n\nWe are very blessed that some of the biggest names in business, vc funding, sports, and entertainment read this column. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this. :-)\n\nI would like to sit down and have a quiet lunch with president Barrack Obama. I can’t imagine the stories he has to share but I know they are deep.\n\nHow can our readers further follow you online?\n\nThey can follow me on instagram at @shelton9mil. I try to keep it updated!\n\nThis was very meaningful, thank you so much! We wish you continued success!"}, {"url": "https://deadline.com/2021/02/ruth-negga-star-josephine-baker-limited-series-abc-signature-from-dee-harris-lawrence-lebron-james-springhill-1234693005/", "page_content": "EXCLUSIVE: The remarkable story of Josephine Baker, one of the most influential female entertainers of the 20th century, will be the subject of Josephine, a limited drama series in development at ABC Signature, with Ruth Negga attached to star as the legendary Jazz Age performer and civil rights activist.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nNegga also executive produces the project, which hails from David Makes Man showrunner Dee Harris-Lawrence, Emmy-nominated director Millicent Shelton (30 Rock), LeBron James and Maverick Carter’s The Springhill Company and ABC Signature. Josephine stems from The Springhill Company’s overall deal with ABC Signature.\n\nDee Harris-Lawrence\n\nWritten by Harris-Lawrence and to be directed by Shelton, Josephine is a raw and unflinching look at the force of nature that was Josephine Baker, the biggest Black female artist of her time. From international superstar and decorated WWII spy, to civil rights activist and flawed mother, Josephine delves into the raw talent, sexual fluidity, struggles and bold life of an icon.\n\nNegga, Harris-Lawrence and Shelton executive produce with The Springhill Company.\n\nBorn in Missouri in 1906, Baker started her career at 15 when she appeared onstage in several New York shows. At 19, she moved to France, which would become her adopted home country.\n\nCourtesy photo\n\nThere, she almost immediately found success as one of Europe’s most popular and highest-paid performers. Early on, she was renowned as a dancer, and was among the most celebrated performers to headline the revues of the Folies Bergère in Paris. She won admiration of cultural figures such as Pablo Picasso, Ernest Hemingway and E.E. Cummings, earning herself nicknames like “Black Venus” and “Black Pearl.” Baker sang professionally for the first time in 1930, and several years later landed film roles as a singer in Zou-Zou and Princesse Tam-Tam.\n\nBaker worked for the French Resistance during World War II, and during the 1950s and ’60s devoted herself to fighting segregation and racism in the United States. Baker refused to perform for segregated audiences in the U.S. and had an active role in the civil rights movement. She was a speaker at the 1963 March on Washington, and in 1968, she was offered unofficial leadership in the movement in the U.S. by Coretta Scott King, following Martin Luther King Jr.’s assassination, but declined the offer out of concern for the welfare of her children. Just two years after making a comeback to the stage, Baker died of a cerebral hemorrhage on April 12, 1975, and was buried with military honors.\n\nDecades later, Baker’s life and work continues to influence top entertainment figures such as Beyoncé, who has portrayed her on various occasions. Baker also was portrayed by Diana Ross on Broadway and television in An Evening with Diana Ross, by Karine Plantadit in the biopic Frida and by Cush Jumbo in her debut play Josephine and I. In HBO’s 1991 biopic, The Josephine Baker Story, Baker was played by Lynn Whitfield, who won an Emmy Award for Outstanding Lead Actress in a Miniseries or a Special, becoming the first Black actress to win the category.\n\nBaker was recently discovered by a new generation through HBO’s very influential 2020 series Lovecraft Country, which featured the American-born French entertainer, played by Carra Patterson. Also last year, Studiocanal, CPB Films and Leyland Films announced that they are developing an English-language drama series about Baker.\n\nNegga, best known for her starring roles in the film Loving and the AMC series Preacher, is repped by ICM Partners, Principal Entertainment and Markham Froggat and Irwin.\n\nFor Harris-Lawrence, Josephine falls outside of the big overall deal she recently signed with Warner Bros. TV, where she serves an exec producer/co-showrunner on All Rise and exec producer/showrunner on David Makes Man. Prior to that, she was co-executive producer on Unsolved: The Murders of Tupac and the Notorious B.I.G., Shots Fired and Star as well as Zoo, the ABC Signature-produced Detroit 1-8-7 and Saving Grace. She is repped by Rain Management Group and Gordon M. Bobb at Del Shaw Moonves.\n\nShelton, who has played a key role in putting Josephine together, landed an Emmy nomination for 30 Rock, becoming the first African-American woman to be nominated in the directing for a comedy series category. The prolific music video and TV helmer has been one of ABC Signature’s go-to directors for Black-ish. She has also directed episodes of P-Valley, Insecure, The Walking Dead, Titans and the Starz comedy pilot Run the World, which was picked up to series. Shelton’s has TV directing work has earned her 10 NAACP Image Award nominations and three wins. She recently signed on to direct Netflix’s feature thriller End of the Road starring Queen Latifah. Shelton is repped by ICM Partners, Rain Management Group and Del Shaw Moonves."}, {"url": "https://networthpost.org/net-worth/millicent-shelton-net-worth/", "page_content": "Millicent Shelton net worth is\n\n$1.3 Million\n\nMillicent Shelton Wiki: Salary, Married, Wedding, Spouse, Family\n\nStructural Info\n\nFacts\n\nPictures\n\nFilmography\n\nAwards Net Worth $1.3 Million Place Of Birth St. Louis, Missouri, U.S. Occupation Film director, music video director and television director Profession Director, Writer, Costume Department Nicknames Millicent Shelton, Shelton, Millicent # Fact 1 Graduated from Princeton University in 1988. Director Title Year Status Character American Crime 2015 TV Series 1 episode Dig 2015 TV Series 2 episodes The Mysteries of Laura 2014 TV Series 1 episode Dallas 2013-2014 TV Series 5 episodes The Divide 2014 TV Series 1 episode Hit the Floor 2013-2014 TV Series 3 episodes The Fosters 2013-2014 TV Series 2 episodes Things You Shouldn't Say Past Midnight 2014 TV Series 2 episodes Parenthood 2012-2013 TV Series 2 episodes The Hustle 2013 TV Series 2 episodes Warehouse 13 2011-2013 TV Series 2 episodes Go On 2012 TV Series 1 episode Jane by Design 2012 TV Series 1 episode Harry's Law 2012 TV Series 1 episode Hornet's Nest 2012 TV Movie Californication 2012 TV Series 1 episode 90210 2010-2011 TV Series 5 episodes Pan Am 2011 TV Series 1 episode Free Agents 2011 TV Series 1 episode Single Ladies 2011 TV Series 2 episodes Awkward. 2011 TV Series 1 episode Men of a Certain Age 2009-2011 TV Series 3 episodes Castle 2011 TV Series 1 episode Leverage 2010 TV Series 1 episode Zeke and Luther 2010 TV Series 2 episodes My Boys 2010 TV Series 1 episode 30 Rock 2009-2010 TV Series 2 episodes Cougar Town 2010 TV Series 1 episode Parks and Recreation 2009 TV Series 1 episode Ruby & the Rockits 2009 TV Series 1 episode Saving Grace 2009 TV Series 1 episode Everybody Hates Chris 2006-2009 TV Series 4 episodes Cavemen 2007 TV Series 1 episode Girlfriends 2007 TV Series 4 episodes Lincoln Heights 2007 TV Series 1 episode The Loop 2007 TV Series 1 episode Big Day 2006 TV Series 1 episode My Name Is Earl 2006 TV Series 1 episode Dance Like We Do 2005 The Bernie Mac Show 2005 TV Series 2 episodes Barbershop 2005 TV Series 1 episode Dirty and Dirtier 2004 TV Mini-Series ABC/TTV Micro-Mini Series 2004 TV Mini-Series short episode \"Dirty and Dirtier\" R. Kelly: The R. in R&B - The Video Collection 2003 Video video \"Your Body's Calling\" Ride 1998 Growing Up in the Age of AIDS: An ABC News Town Meeting for the Family - With Peter Jennings 1992 TV Movie Shots Fired 2017 TV Series 1 episode post-production Scandal 2017 TV Series 1 episode The Flash 2014-2017 TV Series 3 episodes Black-ish 2015-2017 TV Series 4 episodes Empire 2016 TV Series 2 episodes Survivor's Remorse 2016 TV Series 1 episode The Originals 2016 TV Series 1 episode Shades of Blue 2016 TV Series 2 episodes Girlfriends' Guide to Divorce 2015 TV Series 2 episodes Rosewood 2015 TV Series 1 episode Dominion 2015 TV Series 2 episodes Switched at Birth 2014-2015 TV Series 2 episodes Proof 2015 TV Series 1 episode Writer Title Year Status Character Ride 1998 written by Costume Department Title Year Status Character Do the Right Thing 1989 wardrobe production assistant Self Title Year Status Character The 61st Primetime Emmy Awards 2009 TV Special Herself - Nominated: Outstanding Directing for a Comedy Series Won Awards Year Award Ceremony Nomination Movie 2014 Image Award Image Awards Outstanding Directing in a Comedy Series The Hustle (2013) 2011 Image Award Image Awards Outstanding Directing in a Drama Series Men of a Certain Age (2009) 2006 Image Award Image Awards Outstanding Directing in a Comedy Series The Bernie Mac Show (2001) Nominated Awards Year Award Ceremony Nomination Movie 2016 Image Award Image Awards Outstanding Directing in a Dramatic Series American Crime (2015) 2015 Image Award Image Awards Outstanding Directing in a Drama Series The Divide (2014) 2014 Image Award Image Awards Outstanding Directing in a Drama Series The Fosters (2013) 2013 Image Award Image Awards Outstanding Directing in a Comedy Series Go On (2012) 2009 Primetime Emmy Primetime Emmy Awards Outstanding Directing for a Comedy Series 30 Rock (2006) 2009 Gold Derby TV Award Gold Derby Awards Comedy Episode of the Year 30 Rock (2006) 2008 Image Award Image Awards Outstanding Directing in a Comedy Series Everybody Hates Chris (2005) 2007 Image Award Image Awards Outstanding Directing in a Comedy Series Everybody Hates Chris (2005)\n\nKnown for movies\n\nRide (1998)\n\nas Director R. Kelly: The R. in R&B - The Video Collection (2003)\n\nas Director Hornet's Nest (2012)\n\nas Director Dance Like We Do (2005)\n\nas Director\n\nMillicent B. Shelton is an American music video, television and film director.Shelton began her career as a wardrobe production assistant on the Spike Lee film Do the Right Thing (1989). She went to direct music videos for artists such as Mary J. Blige, R. Kelly, Aaliyah, CeCe Peniston and Salt-n-Pepa.Her other directing credits include the motion picture Ride (1998) and episodes of Everybody Hates Chris, The Bernie Mac Show, Girlfriends, Castle, Californication, My Name Is Earl, 90210, Men of a Certain Age, Pan Am, Leverage, and 30 Rock, for which she became the first African-American women to earn a Primetime Emmy Award nomination for Outstanding Directing for a Comedy Series for the episode \"Apollo, Apollo\".She is an alumna of Princeton University and New York University’s Tisch School of the Arts.﻿﻿﻿﻿﻿﻿"}], "Millicent Shelton was nominated for her work on Girlfriends.": [{"url": "https://www.awardsdaily.com/2022/09/12/end-of-the-road-director-millicent-shelton-on-working-with-queen-latifah-and-the-importance-of-inclusion-in-storytelling/", "page_content": "Millicent Shelton started her career as a wardrobe production assistant on Spike Lee’s 1989 classic Do the Right Thing. That opportunity served as a springboard to a directing career of her own across music videos, television, and film. Her direction of the 30 Rock episode “Apollo, Apollo” would make her the first Black woman to receive an Emmy nomination for Outstanding Directing for a Comedy Series.\n\nWith Netflix’s End of the Road (currently streaming), Shelton again works with star and producer Queen Latifah. In the film, Latifah plays Brenda, a recently widowed mother who loses her home in Los Angeles. After deciding to move home to Houston, Brenda travels across the Southwest with her brother (Ludacris) and two children (Mychala Lee, Shaun Dixon). On the journey, they run afoul of a major crime boss thanks to a bag of money that holds the potential to change their lives. The film asks viewers to experience the world through the eyes of this troubled Black family as they hold together in the face of traumatic danger.\n\nHere, in an interview with Awards Daily, Millicent Shelton talks about what drew her to the project and what it’s like to work with Queen Latifah both in front of and behind the camera. She talks about the film’s vivid color palate and the joyous luck in finding four actors who held so much natural chemistry together. Finally, she talks about the importance of inclusivity and the recent conversation around two major television series — HBO’s House of the Dragon and Amazon Studio’s The Lord of the Rings: The Rings of Power — who cast Black actors in major roles within the series.\n\nAwards Daily: I’d like to start with recent controversies related to specific audiences rejecting inclusive efforts on such major projects as Rings of Power and House of the Dragon. How do you as a filmmaker react to that in a modern filmmaking environment? Does it make you even more determined to pursue inclusive projects?\n\nMillicent Shelton: It does. I tend to be a little bit of a rebel. I like to push against what people perceive as the norm. So the perception we have had in television and cinematically has been very Caucasian. Not only are white Americans used to that, but so are Black Americans or Asian Americans or Latino Americans. That’s how a lot of body dysmorphia happens to Black girls and Latino girls and Asian girls. They don’t see people like them represented as images of beauty. There’s a movement now to change that.\n\nI honestly think that’s what our country fought for — to have representation and freedom. If we’re going to truly embrace what we say this country is about which is about embracing diversity and about the melting pot, then we should embrace that in front of and behind the camera as well. I honestly believe that we are stronger when we are like that. To me, diversity is not making an all Black film, not that I’m against that. I think diversity is a mix of everybody, and it’s not just different colors. It’s also different religions. It’s different sexual preferences. It’s diversity of all, and that’s what makes us as a country stronger because we get to experience a lot of different people’s perspectives. I think that our creativity is better that way.\n\nIn this film, we had a mix of everyone in all key positions. We really functioned that way. I like to say that we were a crew that went through a lot of strenuous situations. We survived it as a team, and we survived it as a family. We were a very diverse family, but we survived it as a family.\n\nAD: So you have a Brazilian production designer and an Asian American cinematographer. The film has a very international visual flair. The roadside motel, in particular, doesn’t look like any I’ve ever seen. In fact, the entire color palate for the film is incredibly vibrant and bursting with deep, vivid colors.\n\nMS: [The motel room] is my Brazilian production designer. It’s interesting because we kept looking for motel rooms, and we could not find them. They’re all too little. So we decided to build it, but we had seen a reference for this one in a motel that doesn’t exist anymore. It had cherubs on the wall, and that was it — Lucio’s [Seixas, production designer] brain started to go. Our whole vision for this film was exaggerated reality. I wanted to push it outside of the realm of just playing on normal. So the idea of making these rooms a little over the top I embraced. We embraced the color too because we wanted extreme colors. That was kind of tough because we were shooting in Albuquerque, New Mexico, and a lot of the buildings there are beige. So, we found a gas station with a lot of color and a motel with a lot of color. Then, we added the neon tubes all around. Some people are freaked out by the color palette in this movie, but as an artist, I think sometimes we should push the boundaries of what people find to be regular.\n\nAD: The film offers this theme of the lack of connectivity, that lack of civilization, where the characters are left to their wits that have been dulled by modern technology. What was it about End of the Road that attracted you as a director?\n\nMS: What originally attracted me was the opportunity to work with Queen Latifah again. We’ve sort of known each other from music videos in New York for a while, worked together on Star, and then the opportunity to work with her again… I just love working with her. Since this movie, we’ve worked together on an episode of Equalizer. She’s a wonderful talent. I read the script because she was attached to it. When I read it, I could relate to this woman who was reeling from the loss. The family was torn apart and found their way back to each other. From adversity, the family actually becomes stronger, and I could relate to that story. I wanted to tell that story, particularly about a Black family but it’s not a story that’s unique to a Black family. However, what they face going through these desolate areas with the racism that happens, both covert and overt, is something that Black people experience in the United States whether anybody wants to admit it or not. That’s something that’s our reality, and I wanted to be able to show that.\n\nAD: As you’ve mentioned, you have worked with Queen Latifah multiple times. What was it like working with her as both an actress and as a producer on this film?\n\nMS: She functions primarily as an actress. She doesn’t throw the weight of the producer title on you. She comes in with a pure heart, and she really is in the state of mind of an actress. When we got into post-production, then she went into producer mode and was really helpful in supporting me through getting this film done. So, it actually worked really well. But as an actress, she shows up prepared, and she’s willing to get feedback. She’s willing to give feedback, which I think is great. I love to get feedback from actors because I really admire what actors bring to the table as they bring a different sensibility than even the writers or the director brings because they live through the spirit of a character. When I hear what their thoughts are about the words and what’s happening to that character, I really take that to heart. I find that it makes all the scenes better.\n\nAll the times in the movie where she makes reference to her dead husband, that’s all Latifah. I lost my mother a month before we went into prep on this movie, and so I was reeling from that loss. She said, ‘You know, when you lose somebody, you talk to them. They stay with you.’ And so we talked about it. We picked moments in the film when Brenda would say something to her husband. That’s how those moments came alive. That’s all from the actor having a thought about the spirit of the character.\n\nAD: The film rises on those moments of that core family group. How did you work with those four actors to build that incredible chemistry that really comes across on screen?\n\nMS: The chemistry actually was there naturally. It’s interesting. Queen Latifah actually recommended Ludacris for the role of Reggie. After the first time I talked to him, I was like he’s Reggie. He’s not really Reggie in real life, but when we were talking about it, he understood Reggie. The next person that we cast was Mikayla, who plays the daughter, and she just stood out amongst everybody. She’s a wonderful actress. I just actually got to work with her again on a couple of episodes of Truth Be Told for Apple. We did a lot of chemistry test reads with her and the potentials for the brother, and Shawn read and it was just immediately chemistry. You just saw brother and sister. They went at it. They were ad libbing, and they just went at it. It was just like another brother and sister. Then, we had a cast dinner a few nights before the first day of shooting. It was just those four characters, and we had a really lovely long dinner. We just were all talking about our lives and our dreams and kind of where we came from. They started to bond as a family, and the rest was just magic. They really felt like a real family. They had nicknames for each other and everything.\n\nAD: Last question for you: let’s say you have the keys to the kingdom. You’ve worked in television, you’ve worked in streaming, you’ve worked in film, and you’ve worked in music videos. You’ve done a little bit of everything. If there were no barriers and budget wasn’t a concern, then what would be your dream project?\n\nMS: I have a dream project right now I want to do. I want to do a limited series about Josephine Baker starring Ruth Negga. That’s what I want to do.\n\nEnd of the Road is now streaming exclusively on Netflix."}, {"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.allamericanspeakers.com/celebritytalentbios/Millicent+Shelton/409890", "page_content": "Millicent B. Shelton is an American music video, television, and film director.\n\nShelton began her career as a wardrobe production assistant on the Spike Lee film Do the Right Thing. She went on to direct music videos for artists such as Mary J. Blige, R. Kelly, Aaliyah, CeCe Peniston, and Salt-n-Pepa.\n\nHer other directing credits include the motion picture Ride and episodes of Everybody Hates Chris, The Bernie Mac Show, Girlfriends, Castle, Californication, My Name Is Earl, 90210, Men of a Certain Age, Pan Am, Leverage, and 30 Rock, for which she became the first African-American woman to earn a Primetime Emmy Award nomination for Outstanding Directing for a Comedy Series."}, {"url": "https://celebritynetworthwiki.org/richest-directors/millicent-shelton-net-worth/", "page_content": "Millicent Shelton Net Worth is\n\n$5 Million\n\nMillicent Shelton Bio/Wiki, Net Worth, Married 2018\n\nStructural Info\n\nFacts\n\nPictures\n\nFilmography\n\nAwards Place Of Birth St. Louis, Missouri, U.S. Profession Director, Writer, Costume Department # Fact 1 Graduated from Princeton University in 1988. Director Title Year Status Character American Crime 2015 TV Series 1 episode Dig 2015 TV Series 2 episodes The Mysteries of Laura 2014 TV Series 1 episode Dallas 2013-2014 TV Series 5 episodes The Divide 2014 TV Series 1 episode Hit the Floor 2013-2014 TV Series 3 episodes The Fosters 2013-2014 TV Series 2 episodes Things You Shouldn't Say Past Midnight 2014 TV Series 2 episodes Parenthood 2012-2013 TV Series 2 episodes The Hustle 2013 TV Series 2 episodes Warehouse 13 2011-2013 TV Series 2 episodes Go On 2012 TV Series 1 episode Jane by Design 2012 TV Series 1 episode Harry's Law 2012 TV Series 1 episode Hornet's Nest 2012 TV Movie Californication 2012 TV Series 1 episode 90210 2010-2011 TV Series 5 episodes Pan Am 2011 TV Series 1 episode Free Agents 2011 TV Series 1 episode Single Ladies 2011 TV Series 2 episodes Awkward. 2011 TV Series 1 episode Men of a Certain Age 2009-2011 TV Series 3 episodes Castle 2011 TV Series 1 episode Leverage 2010 TV Series 1 episode Zeke and Luther 2010 TV Series 2 episodes My Boys 2010 TV Series 1 episode 30 Rock 2009-2010 TV Series 2 episodes Cougar Town 2010 TV Series 1 episode Parks and Recreation 2009 TV Series 1 episode Ruby & the Rockits 2009 TV Series 1 episode Saving Grace 2009 TV Series 1 episode Everybody Hates Chris 2006-2009 TV Series 4 episodes Cavemen 2007 TV Series 1 episode Girlfriends 2007 TV Series 4 episodes Lincoln Heights 2007 TV Series 1 episode The Loop 2007 TV Series 1 episode Big Day 2006 TV Series 1 episode My Name Is Earl 2006 TV Series 1 episode Dance Like We Do 2005 The Bernie Mac Show 2005 TV Series 2 episodes Barbershop 2005 TV Series 1 episode Dirty and Dirtier 2004 TV Mini-Series ABC/TTV Micro-Mini Series 2004 TV Mini-Series short episode \"Dirty and Dirtier\" R. Kelly: The R. in R&B - The Video Collection 2003 Video video \"Your Body's Calling\" Ride 1998 Growing Up in the Age of AIDS: An ABC News Town Meeting for the Family - With Peter Jennings 1992 TV Movie Shots Fired 2017 TV Series 1 episode post-production Scandal 2017 TV Series 1 episode The Flash 2014-2017 TV Series 3 episodes Black-ish 2015-2017 TV Series 4 episodes Empire 2016 TV Series 2 episodes Survivor's Remorse 2016 TV Series 1 episode The Originals 2016 TV Series 1 episode Shades of Blue 2016 TV Series 2 episodes Girlfriends' Guide to Divorce 2015 TV Series 2 episodes Rosewood 2015 TV Series 1 episode Dominion 2015 TV Series 2 episodes Switched at Birth 2014-2015 TV Series 2 episodes Proof 2015 TV Series 1 episode Writer Title Year Status Character Ride 1998 written by Costume Department Title Year Status Character Do the Right Thing 1989 wardrobe production assistant Self Title Year Status Character The 61st Primetime Emmy Awards 2009 TV Special Herself - Nominated: Outstanding Directing for a Comedy Series Won Awards Year Award Ceremony Nomination Movie 2014 Image Award Image Awards Outstanding Directing in a Comedy Series The Hustle (2013) 2011 Image Award Image Awards Outstanding Directing in a Drama Series Men of a Certain Age (2009) 2006 Image Award Image Awards Outstanding Directing in a Comedy Series The Bernie Mac Show (2001) Nominated Awards Year Award Ceremony Nomination Movie 2016 Image Award Image Awards Outstanding Directing in a Dramatic Series American Crime (2015) 2015 Image Award Image Awards Outstanding Directing in a Drama Series The Divide (2014) 2014 Image Award Image Awards Outstanding Directing in a Drama Series The Fosters (2013) 2013 Image Award Image Awards Outstanding Directing in a Comedy Series Go On (2012) 2009 Primetime Emmy Primetime Emmy Awards Outstanding Directing for a Comedy Series 30 Rock (2006) 2009 Gold Derby TV Award Gold Derby Awards Comedy Episode of the Year 30 Rock (2006) 2008 Image Award Image Awards Outstanding Directing in a Comedy Series Everybody Hates Chris (2005) 2007 Image Award Image Awards Outstanding Directing in a Comedy Series Everybody Hates Chris (2005)\n\nKnown for movies\n\nRide (1998)\n\nas Director R. Kelly: The R. in R&B - The Video Collection (2003)\n\nas Director Hornet's Nest (2012)\n\nas Director Dance Like We Do (2005)\n\nas Director\n\nTags\n\nMillicent B. Shelton is an American music video, television and film director.Shelton began her career as a wardrobe production assistant on the Spike Lee film Do the Right Thing (1989). She went to direct music videos for artists such as Mary J. Blige, R. Kelly, Aaliyah, CeCe Peniston and Salt-n-Pepa.Her other directing credits include the motion picture Ride (1998) and episodes of Everybody Hates Chris, The Bernie Mac Show, Girlfriends, Castle, Californication, My Name Is Earl, 90210, Men of a Certain Age, Pan Am, Leverage, and 30 Rock, for which she became the first African-American women to earn a Primetime Emmy Award nomination for Outstanding Directing for a Comedy Series for the episode \"Apollo, Apollo\".She is an alumna of Princeton University and New York University’s Tisch School of the Arts.﻿﻿﻿﻿﻿﻿"}, {"url": "https://www.latimes.com/entertainment/tv/la-ca-st-female-directors-main-story-20180309-htmlstory.html", "page_content": "Every episode of the season of \"Marvel's Jessica Jones\" is directed by a woman (Myung J. Chun / Los Angeles Times)\n\nMelissa Rosenberg had a modest goal: For the second season of her Netflix series “Marvel’s Jessica Jones,” which premiered Thursday, at least 50% of the directors would be female.\n\nBut in conversations with Allie Goss, vice president of original series at Netflix, they established a new mandate: All 13 directors would be women.\n\n“I've been on 25 years of shows, and nine times out of 10, those directing staffs are all white men,” said the showrunner, whose long list of credits dates back to “Party of Five.” “So why not all women?”\n\nHad she simply turned to the usual industry gatekeepers — typically agents with a tried-and-true Rolodex of names — the task might have seemed daunting: “You're always handed a list with all the white guys,” Rosenberg said.\n\nInstead, she reached out to fellow showrunners, did a lot of Googling and quickly discovered that “it was really not at all difficult to find 13 terrific female directors.”\n\nRELATED: 'Jessica Jones' regroups for Season 2 »\n\n(L.A. Times Graphics)\n\nThe Netflix drama, which puts a feminist spin on the typically male-dominated superhero genre, is the latest television series to make the hiring of female directors a priority. For two seasons now, Ava DuVernay's \"Queen Sugar\" (OWN) has been directed entirely by women, while on shows as disparate as \"The Deuce“ (HBO), “Feud” (FX), “Jane the Virgin” (CW), “Transparent” (Amazon) and “The Handmaid’s Tale” (Hulu), at least half of all episodes have been directed by women.\n\nWhile a recent study by the USC Annenberg Inclusion Initiative found that women directed only 7.3% of the top 100 movies in 2017, 21% of all episodes in the 2016-17 television season were directed by women, according to the Directors Guild of America, up from 17% the year before. TV may still be far from achieving gender parity, but it is trending that way; women also accounted for 32% of first-time episodic directors in 2016-17, an 8% increase from the year before.\n\nThese gains coincide with a rising awareness of systemic discrimination and abuse within the business, and a growing willingness to speak out against Hollywood’s power imbalance. (See Frances McDormand’s push for an inclusion rider onstage at last week’s Oscars.)\n\nMORE: From big screen to small and back again, these ladies have made the journey »\n\nBut they are also the result of changes within television specifically. Individual A-list producers like Rosenberg, DuVernay, Shonda Rhimes, Jill Soloway and Ryan Murphy, increasingly recruit women and people of color. Meanwhile, in response to media scrutiny, guild pressure and, perhaps more important, the success of the folks listed above, networks and studios are realizing the value of inclusive storytelling and investing in initiatives and mentorship programs.\n\nIt took a while but we’re seeing this normalization that it’s not only OK to hire a female, it’s necessary.” — Gail Mancuso, director\n\nAnd of course, the sheer number of shows being produced in the age of “Peak TV” has led to greater demand for talent.\n\n“I feel like the times are definitely changing,” said Gail Mancuso, a two-time Emmy winner for her work on “Modern Family.” “It took a while but we’re seeing this normalization that it’s not only OK to hire a female, it’s necessary.\"\n\nGail Mancuso on the set for “Modern Family” in 2012. (Peter “Hopper” Stone / ABC)\n\nTV in the lead\n\nIf awards are any indication, TV has long had the edge on film. Twenty-five years before Kathryn Bigelow became the first — and so far, only — woman to win a directing Oscar, Karen Arthur picked up an Emmy for directing “Cagney & Lacey.” Numerous women have since repeated the feat, including Reed Morano for her work last year on “The Handmaid’s Tale.”\n\nBut for many years, women who wanted to direct were dependent on powerful producers and stars willing to buck tradition and give them a shot.\n\nMancuso came up through the ranks as a script supervisor, eventually becoming an assistant director on “Roseanne” learning the ropes from male mentors: “I say male because they were all male at the time,” she said.\n\nWhen a directing slot became available during the fourth season, however, Mancuso approached the show’s star, Roseanne Barr.\n\n“I said, ‘Hey, look, he’s leaving and I’d like to direct that spot.’ And she said, ‘Well, go ahead.’ After I directed that episode, she whispered in my ear at curtain call: ‘I’m going to give you the whole next season.’”\n\nJamie Babbit had similar support from a big female star; she was hired as a director in the fifth season of “Alias” after star Jennifer Garner voiced frustration that only six out of 105 episodes were directed by women.\n\n“The producer I met with was like, ‘Hey, I decided to meet with you because Jennifer Garner keeps complaining that we’re not hiring any women,’” Babbit recalled. “And I thought, ‘Good for her. Good for her for ‘complaining.’ Her being persistent is the reason I got hired.”\n\nMORE: Tips from directors for the next generation of women looking to break in »\n\nFollowing escalating complaints about Hollywood’s diversity problem and bolstered by reports detailing the consistently grim statistics, more recent progress has come thanks in part to the concerted efforts of influential showrunners like Rosenberg, an Emmy-nominated producer who wrote all five blockbuster “Twilight” movies. Two years ago, Ryan Murphy launched the Half Initiative with the goal of providing more opportunities for women and people of color behind the camera. DuVernay, an Oscar nominee and forceful advocate for industry change, has turned “Queen Sugar” into a launching pad for untapped talent.\n\nDeMane Davis had made two independent features before DuVernay hired her as a director on the second season of the family drama. The success of shows like “Queen Sugar,” she said, has not only altered the course of her career, it’s also forced the industry to break out of old habits.\n\n“If you usually get a salad for lunch, the people around you are going to assume you want a salad for lunch,” said Davis. “You have to say, ‘I want quinoa.’ Suddenly the whole world has opened up and the person next to you is like, ‘What’s that?’ Now everyone’s eating quinoa.”\n\nGetting star showrunners and executive producers on board is one thing. But in a fast-paced business with short turnover time and millions of dollars at stake, network and studio executives also have approval power. And they can often turn a string of “yeses” — particularly for newcomers — into a dead end.\n\nNow they really are responsive. They're saying, ‘Give us lists of directors that you know.’” — Bethany Rooney, TV director\n\nBethany Rooney is a veteran TV director (“NCIS”) who got her first break on “St. Elsewhere” from producer Bruce Paltrow. As co-chair of the Directors Guild of America’s Diversity Task Force, she’s spent years meeting with studios and networks to encourage them to do better.\n\nWhile Rooney said they once “had a big chip on their shoulder,” she has witnessed “a huge attitudinal shift.”\n\n“Now they really are responsive. They're saying, ‘Give us lists of directors that you know. Give us lists of people who've been through the program and we will hire them,’” she said.\n\nIn 2014, the guild secured an industry first: an agreement that all the major TV studios would establish or maintain training programs for diverse directors. (Despite DGA efforts, the studios have not agreed to implement inclusion efforts on the film side.)\n\nNBC, for example, recently launched Female Forward to increase the pool of female directors in episodic television. Spearheaded by the network’s then-President Jennifer Salke and Emmy-nominated director Lesli Linka Glatter (“Mad Men,” “Homeland”), the initiative allows 10 female directors to shadow a director on an NBC series and then direct at least one episode on her own.\n\nMore than 1,000 women applied for its inaugural class.\n\n“We’re not trying to put men out of work, we’re just trying to make an extreme statement to turbocharge change,” said Salke, who recently became head of Amazon Studios.\n\nMORE: Kerry Washington takes the director's chair on 'Scandal' »\n\nTwo years ago, a Variety report spotlighting the lack of diversity among TV directors found that only 5% of episodes at FX were directed by women, making FX dead last among top-tier cable, streaming and broadcast networks.\n\nSobered by the statistics, Chief Executive John Landgraf wrote a letter to all the network’s showrunners asking for help. “It’s not as if this is like the law of gravity and cannot be controlled,” he said in an interview with The Times. “This must clearly be a matter of will.” By the end of 2017, women directed 37% of episodes.\n\n(L.A. Times Graphics)\n\n“We have built a better meritocracy by doing this, and any of our competitors who want to compete with us better get their butts in gear,” said Landgraf. “We’re going to find, promote, hire and enjoy the benefits of a deeper, broader and better talent pool.”\n\nThe sheer volume of television programming— 4,500 episodes were produced in the 2016-17 season, according to the DGA — has certainly created an unprecedented opportunity, and women directed 955 of those episodes, 253 more than in the previous season. Whereas the total number of episodes increased by 10% from the previous season, the total number of them directed by women increased by 36%, indicating that women are benefiting substantially more from Peak TV.\n\nThe statistics also show “how many qualified women there are who are ready and willing to step into that leadership position,” said Karyn Kusama, who began directing TV after frustrating experiences on studio films. “It’s the question of giving them the chair to sit in and the set to command, and television just has more opportunities for that.”\n\nThe rise of female-driven narratives is also a factor, she said, citing her experience on the AMC tech drama, “Halt and Catch Fire,” which focused on two pioneering women in the ’80s personal computing boom.\n\n“My sense of closeness to them was part of why I kept going back and getting asked back,” she said.\n\nFor cast and crew, having women in a leadership position on set can also feel revelatory.\n\nThe title role in “Jessica Jones” includes filming a lot of technical sex scenes and star Krysten Ritter says she feels “more comfortable being very raw and vulnerable with a female director.” “There’s just a shorthand with another woman when you’re talking about where you’re going to put your leg so they can see this much of your butt,” she said.\n\n“Jessica Jones” directors from left: Neasa Hardiman, Jennifer Getzinger, Jennifer Lynch and Uta Briesewitz. (Myung J. Chun / Los Angeles Times)\n\nReview: 'Jessica Jones' is back with second season »\n\nObstacles to progress\n\nStill, it’s hard to shatter a glass ceiling when the industry operates on a Must Have Experience loop. The biggest hurdle female filmmakers face is a reluctance to provide the so-called “first” credit in an episodic directing career.\n\nAs simple and obvious as it may seem, part of the solution lies in eliminating what “Jane the Virgin” creator and showrunner Jennie Snyder Urman described as the “Can a woman do this?” filter.\n\n“I have the opposite filter,” she said. “I apply the one that says: ‘Of course women can — women do everything.’”\n\nFor Lisa Demaine, a longtime first assistant director whose credits include “Seabiscuit” and “Westworld,” it’s taken nearly three decades to land a directorial debut. She’ll make her bow with an episode in the third season of Fox’s “Lucifer,” which begins filming later this month.\n\nOver the course of four years, Demaine logged more than 100 meetings with studio and network executives, showrunners and executive producers. Despite positive feedback and early greenlights, none of the meetings resulted in an actual gig.\n\n“They all say, ‘yes!,’ they all say, ‘we love you’ and ‘you’re amazing,’” said Demaine.” “But at the end of the day, they don’t want to be your first. That Catch-22 is really, really big. If no one gives you the break, how do you get in the door?”\n\nWomen also still face a stereotypical view about the types of projects they are considered capable of directing.\n\n“People decide ‘you’re going to do the softer material, you’re going to do the romance,” said Julie-Anne Robinson, whose credits include “The Good Place” and “Scandal.” “You’re not going to [get] something like ‘Vikings.’ I love shooting action. I just did an episode of ‘Castle Rock,’ which is horror. But it’s a constant fight.”\n\nOthers spoke of the way women are lumped together, hearing things like, “Oh, we had a woman, she wasn’t so good.”\n\nALSO: Ava DuVernay doubles down on women directors for ‘Queen Sugar’: Meet the new crew »\n\n“If a guy comes and directs a bad episode of television,” said Beth McCarthy-Miller whose credits include “30 Rock” and “Veep,” they’re like, ‘Oh, God, that guy kind of stinks.’ But he’ll keep getting hired. If a woman comes and directs a bad episode of television, they’re like, ‘See, women can’t direct.’ All of us. It’s absurd.”\n\nTelevision is currently in the throes of pilot season — a time when experience and familiarity tend to win out. Even as their numbers increase, it’s only a small group of female directors who swim in the pilot season pool.\n\n“It’s the same group of six or seven experienced women directors who have opportunities to direct on 450 things,” Salke said.\n\nThere is a wealth of directors out there and a lot of the great ones are women.” — Jennifer Lynch, \"Jessica Jones\" director\n\nThis year moved the needle. Last pilot season, four women were hired to direct 10 of the 70 broadcast pilots in 2017. This season, 18 women directed 23 of 75 broadcast pilots — several are first-time pilot directors.\n\nAs television has gained prestige, so too has the role of director, once viewed as a hired gun in a writer’s world. TV’s creative renaissance has led to a rise in cinematic storytelling and inventive visuals and increasingly entire seasons of a series helmed by a single filmmaker.\n\nThe trend began with men like Cary Fukunaga on “True Detective” and Steven Soderbergh on “The Knick.” But lately, women such as Mary Harron (“Alias Grace”), Pamela Adlon (“Better Things”) and Andrea Arnold (Season 2 of “Big Little Lies”) are also being viewed as auteurs.\n\nStill, for every “Queen Sugar” or “Jessica Jones” there are far more examples of shows like “Game of Thrones” or “Kevin Can Wait” where the women directors are scarce or non-existent.\n\nMartha Lauzen, a professor at San Diego State University who has been monitoring women in Hollywood for more than 20 years, said what we’re seeing today is a “piecemeal approach.”\n\n“We have pockets of progress due to the individual efforts from people like Ava DuVernay or Ryan Murphy or whomever,” Lauzen said. “That’s great. But again, it’s a handful of individuals. We would need to see an industry-wide commitment to move the numbers significantly.”\n\nIn the end, said many of the women who spoke to The Times, the goal is for gender to be immaterial.\n\n“There is a wealth of directors out there and a lot of the great ones are women,” said “Jessica Jones” director Jennifer Lynch. “But you don't walk up to Spielberg and say ‘You are a great male film director.’”\n\nmeredith.blake@latimes.com\n\nFollow me @MeredithBlake\n\nyvonne.villarreal@latimes.com\n\nFollow me @Villarrealy"}]}