{"Millicent Shelton attended the University of Southern California.": [{"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://trojanswire.usatoday.com/lists/famous-usc-alumni-and-celebrities/", "page_content": "The University of Southern California, located not that far away from Hollywood itself, is and has been a natural home for iconic performers in stage, screen, television, and music.\n\nThe school’s location in Los Angeles, America’s second-biggest city, has also made USC a top producer of scholars, scientists, and highly influential figures in numerous other disciplines.\n\n“Famous alumni” can be a relative term, to the extent that a public figure might own present-day celebrity status, but might not own a resume or collection of achievements that are nearly as towering as deceased or aging figures from decades past.\n\nIn this collection of famous USC alumni and celebrities, we tried to focus on instantly recognizable names — “Oh, I know him! Oh, I know her!” — due to accumulated achievement or depth of influence on American culture. This doesn’t mean people left off the list didn’t make a big imprint in film or the arts and sciences, only that the names chosen are clear home-run hitters in their respective fields.\n\nOne other note: Several people on this list attended classes at USC … but as teachers, not students. A number of people established themselves as world-class performers and then brought their expertise to USC, passing their wisdom and knowledge on to generations of future students.\n\nOne such example: Jerry Lewis, the iconic American actor, taught filmmaking to a student named George Lucas at USC. One of Lucas’s friends — though not enrolled as a USC student — sat in with Lucas at Lewis’s classes in the late 1960s. That man was Steven Spielberg, who went to college at Long Beach.\n\nEnjoy this collection of famous USC alumni and celebrities, and feel free to debate in the comments section at the end of the list.\n\nMore famous alumni from the College Wires Network:\n\nAla / Ark / Aub / Fla / LSU / Tenn / TX A&M / UGA // Iowa / Mich / Mich St. / Neb / Ohio St. / Penn St. / Rut / Wisc // Okla / Texas // ND // Colo / Ore / USC // Clem / UNC /"}, {"url": "https://moneyinc.com/most-notable-usc-alumni-in-the-business-world/", "page_content": "The University of Southern California is also known as USC. It’s a private institution of higher education which is the alma mater of some very notable professionals in the business world. Many graduated from its prestigious USC Marshall School of Business. USC is the oldest functioning research university in the state of California, founded in 1880. The undergraduate enrollment ranges between 18,500 to 20,000 with an acceptance rate of 18 percent of applicants and a 91 percent graduation rate. Here are 20 of the most notable USC alumni in the business world.\n\n1. Richard Knerr\n\nRichard Knerr graduated from USC in 1947 with his bachelor’s of science degree. He went on to become the co-founder of the famous American toy brand Wham-O. He also served as the president of the very large and successful company.\n\n2. Marc Benioff\n\nMarc Benioff is another notable USC alumni who graduated with his bachelor’s degree in 1986. He went on to spend 13 years working under the mentorship of Oracle’s Larry Ellison, as his protege, befor moning on to found his own company. Benioff co-founded Salesforce.com in 1999. He also served as the CEO and after the company sold, he is still owner of 5 percent of the cloud computing software giant with a current net worth of an estimated $6.8 billion.\n\n3. Terrence Lanni\n\nTerrence Lanni graduated with his BA in speech from USC and continued to earn his BS in general management in 1965. He had a successful career in business as the Treasurer, then Senior VP, advancing to the Executive VP or Ceasar’s World, Inc. He became the Chairman and CEO of MGM Mirage and served from 1995 though 2008. He was also a board member of MGM Mirage, KB Home, the Jim Pattison Group and Del Mar Thoroughbred Club. He was also a Trustee of Santa Clara University, on the board of the Keck School of Medicine, the Marshall School of Business and trustee of the Ronald Reagan Presidential Library Foundation. He was inducted into the Gaming Hall of Fame in 2000.\n\n4. Kevin Tsujihara\n\nKevin Tsujihara graduated from the University of Southern California with his bachelor’s of science degree in 1986. He became a highly successful business man in recent years. After earning is degree, he joined the Warner Brothers company in 1994. He served in a variety of position leaning about the home video division, digital distribution, video games and the new technology which was beginning to emerge. He picked up a lot of experience along with way, working his way up to progressively more responsible positions within the company, becoming a vice president and eventually, the CEO of Warner Brothers.\n\n5. Edward P. Roski\n\nEdward P. Roski graduated from the University of Southern California with his bachelor’s of science degree in 1962. He is the Chairman of the Board of the Majestic Realty company as well as the President of the company. Mr. Roski is also a co-owner of the Los Angeles Lakers and the Los Angeles Kings ball teams, as well as co-owner of the Staples Center. He is an avid sports fan who assisted in the development of the Los Angeles Staples Center, as well as being a highly respected philanthropist who gives freely of his time and money to support cultural and other civic causes. Mr. Roski is among the most successful alumni of USC who have gone out to carve a niche in the business world and make a fortune in the process.\n\n6. Ronald N. Tutor\n\nRonald N. Tutor graduated with his bachelor’s of science degree from the University of Southern California in 1963. He became the Chief Executive Officer of the Tutor-Perini Corporation in 2008, which is a privately held California company within the construction industry. The business merged with the Tutor Saliba company in 2008 and now serves as the CEO of this company as well s their Chairman of the Board and the President. He is also a member of USC’s Board of Trustees.\n\n7. Sri Manchala\n\nSri Manchala earned his MBA from the University of Southern California and went on to become one of their most distinguished alumni. He worked at India’s largest paint and chemical manufacturer for a short period of time in 1994, for Asian Paints. He went on to join the Silicon VAlley KPMG Consulting firm in high tech consulting services. He also worked for the tech division of Cisco Systems and continued to build his impressive career history. He founded the Trianz company and serves as the chairman and the CEO with more than 25 years of experience in the industry.\n\n8. Henry Caruso\n\nHenry Caruso was a distinguished alumni of USC, earning his bachelor’s of science degree. He went on to forge an impressive career in the automobile industry by building a portfolio of several new car dealerships with the Chrysler, Ford and General Motors backing. He is the founder of Dollar Rent A Car, which business he developed in 1966, calling it Dollar A Day Rent A Car.\n\n9. Timothy O. Johnson\n\nTimothy Johnson attended USC and he earned his bachelor’s of science degree in 1988 from the Marshall School of Business. He joined the university’s Entertainment Management Association and became the president of the program. Mr. Johnson had an obvious passion for the entertainment industry, and a flair for running the business side of it. He learned a lot about the television and film industries and served in many of the major studios in a variety of positions. He was actively involved in the production of several hit television series and his is currently the Chairman and CEO of the Johnson Production Group.\n\n10. Bradley Wayne Hughes\n\nBradley Wayne Hughes graduated from USC with his bachelor’s of science degree in 1957. He went on to become the co-founder of Public Storage which was established in 1972 and he also served as their CEO. The company was a huge success and opened up a more than two thousand locations throughout the United States and Europe. Mr. Hughes’ current net worth is estimated at $3 billion, making him one of the most successful entrepreneurs to graduate from the university.\n\n11. Dan Bane\n\nDan Bane earned his bachelor’s of Science degree in accounting in 1969. He developed a successful career in the grocery retail industry. In 2001, he became the chief executive officer a well as the chairman of Trader Joes, which is a specialty grocer. Under his leadership, the California based business has become a huge success, turning the private label into a brand with a large mass of consumer followers.\n\n12. Ivan Glasenberg\n\nIvan Glasenberg attended the University of Southern California in the graduate program and earned his Master of Business Administration degree in 1983. The native of Johannesburg, South Africa joined the Glencore International company and worked at their Australia location for two years. He was made manager of the Hong Kong and Beijing Offices of Glencore International in 1988. In 2002, he was appointed as the CEO of the company.\n\n13. Robert M. Fomon\n\nRobert M. Fomon attended the University of Southern California and graduated with his bachelor’s of science degree in 1951. He would go on from there to become highly successful in the business world, although there were ups and downs in his career in finance. He was appointed as the governor of the New York Stock Exchange. He also served as the chairman as well as the CEO of E.F. Hutton and Company.\n\n14. Frank Fertitta III\n\nFrank Fertitta III graduated from USC with his bachelor’s of science degree in 1984. He is one of the most notable alumni who has gone out into the business world and become tremendously successful. He came from a family who owned and operated businesses in the Casino and gambling industry. He and his brother Lorenzo were also involved with promoting UFC mixed martial arts events and the two sold their interest in UFC and made billions. He is also the CEO of Station Casinos and has an estimated net worth of $2 billion. Although he comes from a very wealthy family, he and his brother take full credit for making their fortune through the business that they developed together.\n\n15. Chris DeWolfe\n\nChris DeWolfe earned his Masters in Business Administration degree from the University of Southern California in 1997. He went on to become a co-founder of the mobile entertainment company called Jam City, which is a global leader in the industry which is an international provider of social media games. He also serves as the CEO of the company. In addition to this, he also co-founded MySpace, as well as serving as the CEO of the company. He has been recognized in Time magazine’s list of the most 100 influential people in the world in 2006.\n\n16. Preston Martin\n\nPreston Martin is a highly successful alumni of the University of Southern California who earned his master’s in business administration in 1948 after receiving his bachelor’s of science degree the year before from USC. He went on to serve as the vice chair on the board of governors for the Federal Reserve Board. In addition to this, he founded the PMI Mortgange Insurance company showing his tremendous versatility and effectiveness in the business world.\n\n17. Yang Ho Cho\n\nYang Ho Cho earned his master’s of business administration degree from the University of Southern California in 1979. He went on to become the CEO and president of Korean Airlines as well as the Chairman of the Hanjin Group. Mr. Cho was a notable alumni who recently passed away from illness, but leaves behind his legacy.\n\n18. Paul Orfalea\n\nPaul Orfalea attended the University of Southern California as a graduate student. He earned his master’s of business administration in 1971. He went on to become the founder of the largely successful printing business Kinko’s. The company was so successful under his leadership that he became wealthy, and was able to help to make the world a better place for himself as well as for others. He is also a well respected philanthropist who is the Orfalea College of Business benefactor.\n\n19. Armen Margarian\n\nArmen Margarian was an undergraduate student at the University of Southern California who earned his bachelor’s of science degree in 2001. He continued with his education at USC in the graduate program and received his master’s of business administration in 2006. He went on to become the co-founder of NexusLab, Inc. This company was so successful that it was included in the category of Inc.5000 Companies. He also served as the CEO of the company he founded to become one of the most notable alumni of the current decade to have attended and graduated from USC. He even earned two degrees from the institution.\n\n20. Charles Elachi\n\nCharles Elachi is another distinguished alumni from the University of Southern California. He earned his master’s of business administration from the school in 1978. He went on to become the director of the Jet Propulsion Laboratory, also known as JPL. Mr. Elachi has been intimately involved with the building of an earth science satellite to be used for a NASA mission to Mars as a part of a joint mission with the European Space Agency."}, {"url": "https://about.usc.edu/facts/", "page_content": "Facts and Figures\n\nStudents (2022-2023 academic year)\n\nRounded to the nearest 500 Undergraduates 21,000 Graduate and professional 28,000 Total 49,000\n\nStudent Demographics (Fall 2022)\n\nAsians 19.3% Black/African-American 5.8% Hispanic 15.3% White/Caucasian 24.8% International 26.6% Other 8.2%\n\nInternational Students (Fall 2022)\n\nRegularly Enrolled International Students 13,056\n\nAll International Students by Places of Origin\n\nFreshman Class (Fall 2022)\n\nApplicants 69,062 Admits 8,304 (12 percent) Matriculants 3,420 Middle 50-percent Average GPA 3.82-4.00 (unweighted) First-generation college students 22%\n\nFreshman Profile and Admission Information 2022-2023\n\nStudent Retention Rate (Fall 2022)\n\nFall 2021 (% enrolled Fall 2022) 97% Fall 2020 (% enrolled Fall 2021) 96% Fall 2019 (% enrolled Fall 2020) 91% Fall 2018 (% enrolled Fall 2019) 96% Fall 2017 (% enrolled Fall 2018) 97%\n\n*USC’s retention rate is based on full-time, first-time freshmen.\n\nDegrees Awarded (June 2022)\n\nBachelor’s degrees 5,424 Advanced degrees 12,393 Six-Year Graduation Rate (Student Right-to-Know*) 2022 (Fall 2016 freshman class) 92% 2021 (Fall 2015 freshman class) 92% 2020 (Fall 2014 freshman class) 92% 2019 (Fall 2013 freshman class) 91% 2018 (Fall 2012 freshman class) 92% 2017 (Fall 2011 freshman class) 92%\n\n*Student Right-to-Know refers to a federally mandated disclosure of a college’s graduation rate. Its intent is to provide prospective students and their parents with a statistic of comparable effectiveness that can be used in determining college choice. USC’s current graduation rate is based on full-time, first-time, degree-seeking undergraduates who entered the university in the fall semester and graduated within six years of attendance (150% of the normal completion time). Graduation rates do not include students who left school to serve in the armed forces or on official church missions or with a foreign aid service of the federal government, or students who died or were totally and permanently disabled.\n\nUSC’s U-CAN Profile\n\nThe University and College Accountability Network (U-CAN) Web site provides profiles of hundreds of private institutions of higher learning, in a common format, with the goal of helping parents and prospective students make an informed college choice. U-CAN Profile\n\nUndergraduate Tuition\n\n$63,468 (2022-23 undergraduate estimate of costs)\n\nFinancial Aid awarded, all sources (2021-22 fiscal year)\n\n$773.4 million\n\nFaculty and Staff (2021-22)\n\nFaculty (full-time) 4,674 Staff (50 percent time or more) 16,581 Student workers (does not include teaching/research assistants) 6,864 Total 28,119\n\nFaculty and Staff 2021-2022\n\nAlumni\n\nThere are more than 450,000 living alumni in the Trojan Family. USC alumni can be found in positions of leadership all over the world, with more than half of them living in California.\n\nAcademic Units\n\nUSC Dana and David Dornsife College of Letters, Arts and Sciences\n\n22 schools and units\n\nEndowment (as of June 30, 2021)\n\n$8.1 billion\n\nUniversity Budget (2021-22 fiscal year)\n\n$6.2 billion\n\nEconomic Impact\n\n$8 billion, economic impact analysis\n\nSponsored Research (2020-21 fiscal year)\n\n$955.6 million\n\nUniversity Annual Financial Reports"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://www.emmys.com/bios/millicent-shelton-0", "page_content": "The TelevisionAcademy.com sites look and perform best when using a modern browser.\n\nWe suggest you use the latest version of any of these browsers:\n\nChrome Firefox Safari\n\n\n\nVisiting the site with Internet Explorer or other browsers may not provide the best viewing experience."}, {"url": "https://www.britannica.com/topic/University-of-Southern-California", "page_content": "University of Southern California, private coeducational institution of higher education in Los Angeles, California, U.S. It comprises the College of Letters, Arts, and Sciences, the Graduate School, and 19 professional schools. The university offers undergraduate degrees in about 75 fields and graduate and professional degrees in about 125 disciplines. It is especially well known for its degree programs in film, law, music, public administration, physical therapy, business, engineering, and social work. Total enrollment is approximately 45,500.\n\nUSC is one of the largest and best-funded research universities in the country. It operates some 100 research institutes, including the Southern California Earthquake Center and the Institute for Robotics and Intelligent Systems. The university contains about 20 libraries, and its holdings include a notable cinema and television collection. In addition to the main University Park campus, the university includes a health sciences campus in northeastern Los Angeles and satellite campuses at Sacramento and Washington, D.C. A marine science centre is located on Santa Catalina Island.\n\nThe University of Southern California was incorporated by the Methodist Episcopal church in 1880; it opened the same year. After his arrival in 1917, philosopher Ralph Tyler Flewelling established USC as a bastion of personalism. In the 1920s the university created one of the country’s first schools of international relations and of public administration, as well as a pioneer program in cinematography. The first doctoral degree was awarded in 1923. The university officially became nonsectarian in 1926. Architect Konrad Wachsmann joined the faculty in 1963 and initiated a doctoral program in building science.\n\nThe university has a distinguished history of athletic programs and has produced more Olympic athletes than any other school in the country. Among the athletes who attended USC are sprinter Charlie Paddock, shot-putter Parry O’Brien, and gridiron football player O.J. Simpson. Other alumni include Gen. H. Norman Schwarzkopf, composer Charles Wakefield Cadman, architect Frank Gehry, actor John Wayne, director José Quintero, and filmmaker George Lucas."}, {"url": "https://www.usc.cn/", "page_content": "USC 南加州大学国际学院中文官方网站\n\n发掘潜能，成就非凡\n\n南加州大学 (University of Southern California，以下简称：USC) ——全球领先私立研究型大学，美国最具多元化学府之一，广受全球博才智杰推崇。依托南加州大学雄厚的学术研究实力，南加州大学国际学院 (USC International Academy) 开设三种课程，向全球的优秀学子发出邀请，克服地域语言障碍，追逐名校梦想。\n\n在这里，通过我们的帮助，你将用成熟有效的学习方法武装自己的头脑，在感受南加州大学强大变革力量的同时，勇敢有力地表达观点，挣脱语言地域束缚，自主引领在美国的生活。"}, {"url": "https://www.usnews.com/best-colleges/university-of-southern-california-1328", "page_content": "University of Southern California is a private institution that was founded in 1880. It has a total undergraduate enrollment of 20,790 (fall 2021), its setting is urban, and the campus size is 226 acres. It utilizes a semester-based academic calendar. University of Southern California's ranking in the 2022-2023 edition of Best Colleges is National Universities, #25. Its tuition and fees are $64,726.\n\nThe University of Southern California’s central campus, referred to as the University Park campus, is located in Los Angeles’s Downtown Arts and Education Corridor. USC has other campuses in L.A. in addition to sites around Southern California and in Sacramento, Calif., and Washington, D.C. Students can participate in the more than 1,000 on-campus organizations, ranging from religious groups to club sports. USC students are not required to live on campus, but the university offers housing in its 40 or so residence halls and apartment buildings. A thriving Greek life comprises more than 50 chapters representing about 20 percent of undergraduate students. The USC Trojans compete in the Pac-12 Conference and are known for their legendary football program.\n\nUSC is comprised of the USC Dana and David Dornsife College of Letters, Arts and Sciences, and 22 graduate and professional schools. The number of graduate students exceeds the number of undergraduates at USC, with students enrolled in such programs as the highly ranked Marshall School of Business, Rossier School of Education, Andrew and Erna Viterbi School of Engineering, Gould School of Law, Keck School of Medicine and School of Social Work. USC is also well known for its Annenberg School for Communication and Journalism and its highly esteemed School of Cinematic Arts, which has graduated students such as directors Judd Apatow and George Lucas. Films including \"The Graduate,\" \"Legally Blonde\" and \"Forrest Gump\" all filmed scenes on USC’s campus."}], "Millicent Shelton earned a degree in film production.": [{"url": "https://millicentshelton.com/bio/", "page_content": "Millicent Shelton is an award-winning Director. In a very short time, she has established herself a noteworthy director in Television having directed an array of comedies and dramas, including, Empire, American Crime, The Flash, Black-ish, Ballers, Scandal, 30 Rock, Parenthood, and the pilot episode of Awkward. Originally the St. Louis native enrolled in Princeton University to become a lawyer. In her junior year, Shelton signed up for a “hands on summer film course at NYU, where she quickly discovered her passion for directing. While at NYU, Shelton received the Willard T.C. Johnson fellow award for her outstanding student work, which landed Shelton her first music video directing job for the Salt-N-Peps hit, “Expressions.” That groundbreaking video led to a decorated music video producing and directing career creating over 100 music videos.\n\nIn 2009, Shelton was the first African American woman to receive a primetime EMMY nomination for Outstanding Directing in a Comedy Series for the “Apollo Apollo” episode of NBC’s 30 Rock. She was also the first recipient of the NAACP Image Awards for Outstanding Directing in a Comedy Series for The Bernie Mac Show. In 2010, Ms. Shelton won a Peabody award and a second NAACP Image Award for Outstanding Directing in a Dramatic Series for an episode of Men Of A Certain Age. In 2014, she won a third NAACP Image Award for Outstanding Directing in a Comedy Series for The Hustle.\n\nRepresentation:\n\nICM – Dan Norton 310.550.4471\n\nRain Management – Anne Damato 310.954.9520\n\nDel, Shaw, Moonves, Tanaka & Finkelstein – Nina Shaw 310.979.7920"}, {"url": "https://www.dga.org/Craft/DGAQ/All-Articles/1202-Spring-2012/Close-Up-Millicent-Shelton.aspx", "page_content": "Spring 2012\n\n\n\nMillicent Shelton\n\nBalancing Act\n\nAs an active episodic TV director going from show to show, Millicent Shelton has a sometimes crazy schedule. She wouldn’t have it any other way.\n\nBy Margy Rochlin\n\n\n\nKEEPING HER COOL: Shelton tries to find comedy in the chaos and defuse tension with laughter.\n\nMillicent Shelton found herself walking onto the Warner Bros. lot in Burbank and wondering for a second, “Where am I again?” For Shelton, this sort of momentary geographic disconnect means that business is booming. Over the past seven years, Shelton has directed a far-flung variety of episodic TV shows, from her Emmy-nominated installment of NBC’s 30 Rock to TNT’s now-defunct rumination on the male midlife crisis, Men of a Certain Age, to 90210, the CW’s glossy update of the classic Aaron Spelling teen soap.\n\n“I love being a guest director. I love it,” Shelton says sitting in the dining room of her spacious townhouse seizing a quiet moment for dinner while her 4-year-old twins are asleep upstairs. “I have director’s [attention deficit disorder],” says Shelton who possesses the perfect attributes for someone whose occupation involves only occasionally returning to the same set twice: an upbeat outlook, bottomless reserves of energy, a restless mind, and a love of prepping. “I get bored if I have to do the same thing over and over again. I love jumping around to different shows and different styles of shooting.”\n\nBut back in 2005, Shelton—whose earliest credits include writing and directing music videos for chart-toppers such as Salt-N-Pepa, R. Kelly, and Aaliyah—didn’t immediately grasp the rich possibilities of what a helmer-for-hire could contribute to an established, long-running television series. “In music videos it was all about being original, it was all about me, my vision,” says Shelton. “When I started doing television I thought my job was to disappear. I thought it was about doing their show the way they’d always done it. Then I learned that’s not what they want. They want me to stay within the box of their show but to give it the Millicent twist.”\n\nWhat Shelton quickly found was that by throwing herself into full-bore research mode—meticulously watching as many previous episodes as she could and poring over old scripts—when she hit the set she could easily discern when to shoot a scene in the pre- ordained style of the show and where she could insert a creative flourish. Whenever possible, Shelton worked with actors who might have gone on autopilot to help bring nuances to a performance. Often without anyone noticing, she’d slip in what she considers her signature—a cinematic wide shot such as the one featured in an episode of Californication. “It was sort of an homage to Beverly Hills Cop,” says Shelton, referring to a fleeting bit of footage in an exchange at a firing range between David Duchovny’s dissipated Hollywood screenwriter character and a bonkers rap magnate.\n\nIt was on her second episodic gig ever—The Bernie Mac Show—when it dawned on Shelton that she also had the right upbringing for someone who would often find herself face to face with the behavioral unpredictability of talent. From Day One until the Martini Shot, Mac, the sitcom’s creator and star, found reasons to carp at Shelton. “I thought, ‘Oh my God. He hates me.’ But I got through it. On the last day, Bernie took me aside and said, ‘You have thick skin. I like you.’ It was a test,” says Shelton. She passed, crediting both her internal grit and tendency to see humor in pandemonium, something she learned from being the youngest of four children in her St. Louis household. “I got picked on a lot. I can deal with an actor who’s having a bad day, missing their kids, being in a bad mood. It isn’t personal. I try to defuse things with laughter. I find comedy in a lot of chaos. Things are going crazy and everybody else is freaking out, and I’m like, ‘This is kind of funny.’ ”\n\nThe way Shelton tells the story of how she ended up in show business definitely has its elements of slapstick. After getting her undergraduate degree in English from Princeton and at occupational loose ends, Shelton’s older sister urged her to send a resume to her friend David Lee’s brother, Spike. The next thing she knew, Shelton was the most overly educated production assistant in the wardrobe department of Lee’s 1989 race relations drama, Do the Right Thing. When that wrapped, she landed a spot in wardrobe at The Cosby Show. In the hopes of using a short film she was making to get into film school, she solicited her blunt-speaking boss as a test audience of one. “[Bill Cosby] gave me some really harsh criticism,” says Shelton with a weak smile, “which I needed to hear, but I recut it and submitted it to Tisch [School of the Arts at NYU] and I got in.”\n\n\n\nShelton working with Virginia Madsen on the cable movie Hornet's Nest.\n\nNo one can say it has always been easy. After her 1998 hip-hop road trip feature debut, Ride, which she wrote and directed, performed weakly at the box office, Shelton found it a struggle to get work. But instead of complaining she went back to the drawing board and shadowed veteran director and Guild first vice president Paris Barclay (NYPD Blue, Sons of Anarchy) for three years. “A lot of people—black, white, and other, men and women—don’t succeed because they give up. I didn’t give up,” says Shelton, a member of the DGA’s African American Steering Committee, which, in addition to tributes and educational events, actively explores ways to assist the Guild in improving employment opportunities for members of color. “Opening your show up to different vantage points actually can be a really good thing,” says Shelton, who when confronted by doubters uses herself as a case in point. “I’m an African-American female. You wouldn’t think I’d do so well on a show called Men of a Certain Age. You wouldn’t think that would be a match. But it was a great match.”\n\nOver the past several months, Shelton has directed the pilot episode from MTV’s Awkward and a TV movie of best-selling crime novelist Patricia Cornwell’s Hornet’s Nest for TNT. In 12 hours or so, she’ll be directing an episode of Harry’s Law. But it’s 8 p.m. now and she still has prep work to attend to.\n\nSuddenly, a loud thumping noise can be heard as Shelton’s husband sprints up the stairs: one of her twins is out of bed and apparently practicing Gymboree moves. Meanwhile, Wookie, her fluffy white Shih Tzu, begins, for reasons unknown, excitedly racing around in circles. “You should see it here at breakfast,” jokes Shelton, who makes mornings at the Sheltons’ sound like a night at Chuck E. Cheese’s.\n\n“It’s a juggling act. But I love my kids and I love what I do,” says Shelton who’d like to get 10 minutes or so with some other female directors with young kids and swap tips on time-management and motherhood. “Everyone always asks me, ‘How do you do it?’” she laughs. “And I always say, ‘I drink a lot of espresso and I don’t sleep much.’”"}, {"url": "https://www.awardsdaily.com/2022/09/12/end-of-the-road-director-millicent-shelton-on-working-with-queen-latifah-and-the-importance-of-inclusion-in-storytelling/", "page_content": "Millicent Shelton started her career as a wardrobe production assistant on Spike Lee’s 1989 classic Do the Right Thing. That opportunity served as a springboard to a directing career of her own across music videos, television, and film. Her direction of the 30 Rock episode “Apollo, Apollo” would make her the first Black woman to receive an Emmy nomination for Outstanding Directing for a Comedy Series.\n\nWith Netflix’s End of the Road (currently streaming), Shelton again works with star and producer Queen Latifah. In the film, Latifah plays Brenda, a recently widowed mother who loses her home in Los Angeles. After deciding to move home to Houston, Brenda travels across the Southwest with her brother (Ludacris) and two children (Mychala Lee, Shaun Dixon). On the journey, they run afoul of a major crime boss thanks to a bag of money that holds the potential to change their lives. The film asks viewers to experience the world through the eyes of this troubled Black family as they hold together in the face of traumatic danger.\n\nHere, in an interview with Awards Daily, Millicent Shelton talks about what drew her to the project and what it’s like to work with Queen Latifah both in front of and behind the camera. She talks about the film’s vivid color palate and the joyous luck in finding four actors who held so much natural chemistry together. Finally, she talks about the importance of inclusivity and the recent conversation around two major television series — HBO’s House of the Dragon and Amazon Studio’s The Lord of the Rings: The Rings of Power — who cast Black actors in major roles within the series.\n\nAwards Daily: I’d like to start with recent controversies related to specific audiences rejecting inclusive efforts on such major projects as Rings of Power and House of the Dragon. How do you as a filmmaker react to that in a modern filmmaking environment? Does it make you even more determined to pursue inclusive projects?\n\nMillicent Shelton: It does. I tend to be a little bit of a rebel. I like to push against what people perceive as the norm. So the perception we have had in television and cinematically has been very Caucasian. Not only are white Americans used to that, but so are Black Americans or Asian Americans or Latino Americans. That’s how a lot of body dysmorphia happens to Black girls and Latino girls and Asian girls. They don’t see people like them represented as images of beauty. There’s a movement now to change that.\n\nI honestly think that’s what our country fought for — to have representation and freedom. If we’re going to truly embrace what we say this country is about which is about embracing diversity and about the melting pot, then we should embrace that in front of and behind the camera as well. I honestly believe that we are stronger when we are like that. To me, diversity is not making an all Black film, not that I’m against that. I think diversity is a mix of everybody, and it’s not just different colors. It’s also different religions. It’s different sexual preferences. It’s diversity of all, and that’s what makes us as a country stronger because we get to experience a lot of different people’s perspectives. I think that our creativity is better that way.\n\nIn this film, we had a mix of everyone in all key positions. We really functioned that way. I like to say that we were a crew that went through a lot of strenuous situations. We survived it as a team, and we survived it as a family. We were a very diverse family, but we survived it as a family.\n\nAD: So you have a Brazilian production designer and an Asian American cinematographer. The film has a very international visual flair. The roadside motel, in particular, doesn’t look like any I’ve ever seen. In fact, the entire color palate for the film is incredibly vibrant and bursting with deep, vivid colors.\n\nMS: [The motel room] is my Brazilian production designer. It’s interesting because we kept looking for motel rooms, and we could not find them. They’re all too little. So we decided to build it, but we had seen a reference for this one in a motel that doesn’t exist anymore. It had cherubs on the wall, and that was it — Lucio’s [Seixas, production designer] brain started to go. Our whole vision for this film was exaggerated reality. I wanted to push it outside of the realm of just playing on normal. So the idea of making these rooms a little over the top I embraced. We embraced the color too because we wanted extreme colors. That was kind of tough because we were shooting in Albuquerque, New Mexico, and a lot of the buildings there are beige. So, we found a gas station with a lot of color and a motel with a lot of color. Then, we added the neon tubes all around. Some people are freaked out by the color palette in this movie, but as an artist, I think sometimes we should push the boundaries of what people find to be regular.\n\nAD: The film offers this theme of the lack of connectivity, that lack of civilization, where the characters are left to their wits that have been dulled by modern technology. What was it about End of the Road that attracted you as a director?\n\nMS: What originally attracted me was the opportunity to work with Queen Latifah again. We’ve sort of known each other from music videos in New York for a while, worked together on Star, and then the opportunity to work with her again… I just love working with her. Since this movie, we’ve worked together on an episode of Equalizer. She’s a wonderful talent. I read the script because she was attached to it. When I read it, I could relate to this woman who was reeling from the loss. The family was torn apart and found their way back to each other. From adversity, the family actually becomes stronger, and I could relate to that story. I wanted to tell that story, particularly about a Black family but it’s not a story that’s unique to a Black family. However, what they face going through these desolate areas with the racism that happens, both covert and overt, is something that Black people experience in the United States whether anybody wants to admit it or not. That’s something that’s our reality, and I wanted to be able to show that.\n\nAD: As you’ve mentioned, you have worked with Queen Latifah multiple times. What was it like working with her as both an actress and as a producer on this film?\n\nMS: She functions primarily as an actress. She doesn’t throw the weight of the producer title on you. She comes in with a pure heart, and she really is in the state of mind of an actress. When we got into post-production, then she went into producer mode and was really helpful in supporting me through getting this film done. So, it actually worked really well. But as an actress, she shows up prepared, and she’s willing to get feedback. She’s willing to give feedback, which I think is great. I love to get feedback from actors because I really admire what actors bring to the table as they bring a different sensibility than even the writers or the director brings because they live through the spirit of a character. When I hear what their thoughts are about the words and what’s happening to that character, I really take that to heart. I find that it makes all the scenes better.\n\nAll the times in the movie where she makes reference to her dead husband, that’s all Latifah. I lost my mother a month before we went into prep on this movie, and so I was reeling from that loss. She said, ‘You know, when you lose somebody, you talk to them. They stay with you.’ And so we talked about it. We picked moments in the film when Brenda would say something to her husband. That’s how those moments came alive. That’s all from the actor having a thought about the spirit of the character.\n\nAD: The film rises on those moments of that core family group. How did you work with those four actors to build that incredible chemistry that really comes across on screen?\n\nMS: The chemistry actually was there naturally. It’s interesting. Queen Latifah actually recommended Ludacris for the role of Reggie. After the first time I talked to him, I was like he’s Reggie. He’s not really Reggie in real life, but when we were talking about it, he understood Reggie. The next person that we cast was Mikayla, who plays the daughter, and she just stood out amongst everybody. She’s a wonderful actress. I just actually got to work with her again on a couple of episodes of Truth Be Told for Apple. We did a lot of chemistry test reads with her and the potentials for the brother, and Shawn read and it was just immediately chemistry. You just saw brother and sister. They went at it. They were ad libbing, and they just went at it. It was just like another brother and sister. Then, we had a cast dinner a few nights before the first day of shooting. It was just those four characters, and we had a really lovely long dinner. We just were all talking about our lives and our dreams and kind of where we came from. They started to bond as a family, and the rest was just magic. They really felt like a real family. They had nicknames for each other and everything.\n\nAD: Last question for you: let’s say you have the keys to the kingdom. You’ve worked in television, you’ve worked in streaming, you’ve worked in film, and you’ve worked in music videos. You’ve done a little bit of everything. If there were no barriers and budget wasn’t a concern, then what would be your dream project?\n\nMS: I have a dream project right now I want to do. I want to do a limited series about Josephine Baker starring Ruth Negga. That’s what I want to do.\n\nEnd of the Road is now streaming exclusively on Netflix."}, {"url": "https://www.filmbug.com/db/36848&lang=en", "page_content": "makes her feature debut with, a Hip Hop road comedy with heart. Shelton, herself a sought after music video director, based the story on a real­life, out­ofcontrol bus ride bringing young Harlem talent to a video shoot in Florida.\n\nA native of St. Louis and graduate of Princeton University, Shelton got her start in 1988 when she became a production assistant on Spike Lee's Do The Right Thing. She moved on to be a production assistant on The Cosby Show, before starting classes in the prestigious graduate film program at NYU. While at NYU, she began assisting on music videos as a way of getting paid experience ­­ and because she loved the whole Hip Hop culture. Eventually, producer Hurby Luv Bug Azor let her direct her own video ­­ Expression, for the platinum­selling female rap trio Salt­n­Pepa.\n\nShe has gone on to direct videos for Mary J. Blige, MC Lyte, R. Kelly, Aaliyah, Heavy D and Ce Ce Peniston among others."}, {"url": "https://paw.princeton.edu/article/millicent-shelton-88-excels-directors-chair", "page_content": "Courtesy Millicent Shelton\n\nEmmy-nominated writer and director Millicent Shelton ’88 has directed music videos for the likes of R. Kelly and Mary J. Blige, along with episodes of The Flash, 30 Rock, Ballers, Scandal, Black-ish, and several other TV shows. But she doesn’t have a single body of work that’s her favorite.\n\n“I see fault in everything I direct,” Shelton explains. “When I don’t, then I will retire.”\n\nA few do stand out, including American Crime, The Flash, Black-ish, and Men of a Certain Age. One of the highlights of Shelton’s career was being the first African-American woman to earn a Primetime Emmy nomination for Outstanding Directing in a Comedy Series with 2009’s 30 Rock episode “Apollo, Apollo.” The plot revolved around Jack Donaghy (Alec Baldwin) turning 50 and featured the Muppets and Adam West.\n\n“I’m still bummed that I didn’t win! I honestly don’t think about being one of the few African-American female directors while I’m on-set. I think it would be too depressing. I focus on the job and the craft. I want to be the best director possible — period,” Shelton says. “It was an honor to be nominated but very sobering to realize that I was the first one and it was 2009! One day, I plan to win that damn Emmy.”\n\nShelton with Dwayne “The Rock” Johnson on the set of Ballers. Courtesy Millicent Shelton\n\n“When I returned to Princeton, [Sitney] taught me almost everything I know to this day about film theory,” Shelton says.\n\nHer first job in the film industry was as a wardrobe production assistant on 1989’s Do the Right Thing, written and directed by Spike Lee, who was nominated for an Oscar for Best Original Screenplay.\n\nWorking on the film was a transformative experience. Shelton slept on the floor of her sister’s Brooklyn brownstone and worked for nothing until earning a promotion to production assistant (“a very small paycheck, but it at least put food in my mouth,” she says). “I had never been on a film set before or with ‘real’ actors. It was amazing to see Ossie Davis transform into Da Mayor as he walked down the street to the set,” she recalls. “I learned so much — and it was the hottest summer in New York City!”\n\nAfterward, Shelton co-wrote a script with music producer Hurby Azor for hip-hop duo Kid ’n Play. Although it was never completed, the project led to her directing the videos for two Salt-n-Pepa songs, “Expressions” and “Let’s Talk About Sex.” She eventually founded her own production company and directed almost 100 music videos.\n\nShelton wrote and directed the 1998 comedy feature Ride. However, the script was changed in pre-production without her knowledge, souring her experience on the project and disillusioning her with the film industry. Actor Dean Cain ’88, a friend and classmate, encouraged her to try directing television.\n\nSince then, she’s directed more than 60 TV episodes, spanning drama, comedy, and action. “I think the knowledge of all three has made me a better director,” she says. “I can bring heart to a comedy, momentary lightness to a drama, and both to an action show. It keeps everything fresh for me.”"}, {"url": "https://www.huffpost.com/entry/30-rock-director-millicen_n_303837", "page_content": "Director Millicent Shelton, 43, became an African-American first when she received an Emmy nomination for Outstanding Directing in a Comedy Series for NBC's \"30 Rock.\" The award show may be over, but Shelton breaks down barriers and Hollywood's tough lessons.\n\nESSENCE.COM: Congratulations on your nomination. I was completely surprised to learn that you're the first Black woman to get a nod in this category.\n\nMILLICENT SHELTON: I was surprised too! I was told that pretty early on and I thought that can't be the truth, there has to be somebody else. I had a lot of people do some fact checking; the Director's Guild and the Academy checked then confirmed the news. It's a dilemma on how to feel about being the first one because although it's a great honor, at the same time it's depressing and sad that it took until 2009 for an African-American female to be nominated.\n\nAdvertisement\n\nESSENCE.COM: Is there not enough of us in these roles, what's the deal?\n\nSHELTON: Yeah, there's a small pool of women in these positions. Only five percent of directors in film and TV are women. So can you only imagine the percentage of women that are African-American, it's probably one percent or less.\n\nESSENCE.COM: What advice can you give to Black women who are trying to break into this field?\n\nSHELTON: Don't pay attention to statistics. I think the reason why I've been able to do what I do is because I stick my head in the sand and move forward. I always believed my mother who said I could do whatever I wanted as long as I believed and worked hard enough. It's a naiveté that works on my behalf. It didn't occur to me that it was difficult; if I thought about that all the time I went in to interview for a job people would smell that fear and nervousness and I probably wouldn't get hired.\n\nESSENCE.COM: What's the best advice you've ever received?\n\nSHELTON: Lavar Burton told me to \"just do you\" and that stuck. I try to do me, have a good time and be genuine. I'm also actively working on my craft trying to do the best work every time I get an opportunity.\n\nESSENCE.COM: Before you started in TV, you directed and wrote the movie \"Ride.\" Will you ever go back to the big screen?\n\nAdvertisement"}, {"url": "https://www.rottentomatoes.com/celebrity/millicent_shelton", "page_content": "Highest Rated: 31% End of the Road (2022)\n\nLowest Rated: 31% End of the Road (2022)\n\nBirthday: Not Available\n\nBirthplace: St. Louis, Missouri, USA\n\nHaving already made her career as a prolific director of music videos, in the mid-2000s Millicent Shelton turned her attention to television directing. She went on to become one of the most successful TV directors of the decade, directing multiple episodes of \"90210\" (The CW 2008-2013), \"Men of a Certain Age\" (TNT 2009-2011), and \"Everybody Hates Chris\" (UPN/The CW 2005-09), while also becoming the first African-American woman to be nominated for a Primetime Emmy Award for Outstanding Directing of a Comedy Series. She may have started out her career in the music world, but by the 2010s Millicent Shelton had already established herself as one of the most important female directors of her generation."}, {"url": "https://variety.com/2013/biz/news/l-a-tv-film-production-exodus-affects-bizzers-tv-director-millicent-shelton-1200590065/", "page_content": "Millicent Shelton, 47, is worried about the impact that runaway production is having on her twins, a boy and a girl.\n\n“They are 5½ years old, and one of them is already having separation anxiety, because when I’m gone, it’s often for six months at a time,” Shelton muses.\n\nIt wasn’t always like this for the episodic TV director.\n\n“I started working in 2005, and the only time I left town was for ‘30 Rock,’ until a few years ago,” she recalls. “Then things started changing. I had to leave town in 2010 for ‘Leverage’ and for “Pan Am.’ ”\n\nNow, leaving town is the norm.\n\n“My husband works out of the home, and he takes wonderful care of my kids while I work out of town,” notes Shelton, whose recent credits include “Parenthood,” “Dallas” and “The Fosters.”\n\nShelton says that at a recent meeting at the DGA “everyone said that they are outside L.A. from August to Christmas. When I get work in L.A. now, I feel super-fortunate.”\n\nIt’s not just missing her family that makes it rough to leave town.\n\n“Working in Atlanta is a logistical nightmare,” Shelton says. “You have to wait for the wardrobe to come from Los Angeles; they don’t have cranes you need. It’s a real pain in the ass. The crews can be really infuriating. You’ll have the first two crews that will be OK, but then you’ll get novices on the next crew.”"}]}