{"Whitey Kurowski was selected to the All-Star team five times in 1941, 1942, 1943, 1945, and 1947.": [{"url": "https://www.baseball-reference.com/players/k/kurowwh01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Whitey Kurowski born?\n\nWhitey Kurowski was born on April 19, 1918.\n\nWhere was Whitey Kurowski born?\n\nWhitey Kurowski was born in Reading, PA.\n\nHow tall was Whitey Kurowski?\n\nWhitey Kurowski was 5-11 (180 cm) tall.\n\nHow much did Whitey Kurowski weigh when playing?\n\nWhitey Kurowski weighed 193 lbs (87 kg) when playing.\n\nHow many seasons did Whitey Kurowski play?\n\nWhitey Kurowski played 9 seasons.\n\nIs Whitey Kurowski in the Hall of Fame?\n\nWhitey Kurowski has not been elected into the Hall of Fame.\n\nWhat position did Whitey Kurowski play?\n\nWhitey Kurowski was a Third Baseman.\n\nHow many hits did Whitey Kurowski have?\n\nWhitey Kurowski had 925 hits over his career.\n\nHow many home runs did Whitey Kurowski have?\n\nWhitey Kurowski had 106 home runs over his career.\n\nWhat was Whitey Kurowski's average?\n\nWhitey Kurowski had a .286 average over his career.\n\nHow many teams has Whitey Kurowski played for?\n\nWhitey Kurowski played for 1 team, the St. Louis Cardinals.\n\nHow many World Series has Whitey Kurowski won?\n\nWhitey Kurowski won 3 World Series.\n\nWhen did Whitey Kurowski retire?\n\nWhitey Kurowski last played in 1949."}, {"url": "https://www.historyofcardinals.com/whitey-kurowski/", "page_content": "Whitey Kurowski, known for his white hair, debuted with the St. Louis Cardinals on Sept. 22, 1941 and played for eight seasons before an elbow problem curtailed his career in 1949.\n\nHis best season was likely in 1947 when he batted .310 and swatted 27 home runs, scored 108 runs, knocked in 104 RBI’s, which included 27 doubles and a .544 SLG%.\n\nHe was a 5-time All Star (1943-1947) that finished with .286 average and 106 home runs and 529 runs batted in while playing 916 games. He was a key part in 3 World Championships (1942, 1944, 1946) with the Cardinals.\n\nSABR article\n\nIn four World Series appearances, Kurowski hit .253 (21-for-83) with one home run and nine RBI in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only home run in the Series, in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for St. Louis over the New York Yankees. He also appeared five times in the MVP ballot, in 1942 and from 1944 through 1947."}, {"url": "https://www.nytimes.com/1999/12/13/sports/whitey-kurowski-81-dies-beat-yankees-in-world-series.html", "page_content": "Whitey Kurowski, who surmounted a severe arm injury as a youngster and became one of the major leagues' top third basemen of the 1940's and a World Series hero for the St. Louis Cardinals, died last Thursday at a physical rehabilitation center in Shillington, Pa. He was 81.\n\nKurowski, who lived in Shillington, had been in failing health since suffering a stroke after heart bypass surgery in July, according to his wife, Joan.\n\nOn the afternoon of Oct. 5, 1942, a remarkable stretch of World Series success for the Yankees came to an end with one swing by a rookie infielder. George (Whitey) Kurowski's two-run home run off Red Ruffing into the left-field stands at Yankee Stadium in the ninth inning of Game 5 propelled the Cardinals to a 4-2 victory and a Series title, the first time the Yankees had been beaten in nine trips to the Series since they were defeated by the Cards in 1926.\n\nThat Kurowski was even in a major league uniform defied the odds. When he was growing up in Reading, Pa., he fell off a fence and landed in broken glass, severely cutting his right arm. Two years later, he began suffering severe pain and was found to have developed osteomyelitis, a bone inflammation. Three inches of bone above his wrist were surgically removed, leaving the arm weakened and with an unnatural bend. He strengthened his arm muscles as he embarked on a baseball career, but his right arm, his throwing arm, had become shorter than his left."}, {"url": "https://www.baseballplayerfacts.com/facts-kurowwh01/Whitey-Kurowski.html", "page_content": "Facts\n\nWhen was Whitey Kurowski born?\n\nWhitey Kurowski was born on April 19, 1918 in Reading, Pennsylvania, United States of America.\n\nWhere was Whitey Kurowski from?\n\nWhitey Kurowski was born in Reading, Pennsylvania, United States of America.\n\nIs Whitey Kurowski alive or dead?\n\nWhitey Kurowski is dead. He passed away on December 9, 1999. He was 81 years old at the time of his death\n\nWhat team(s) did Whitey Kurowski play for?\n\nWhitey Kurowski played for the following teams over the course of his career: St. Louis Cardinals (1941 - 1949)\n\nWhat college baseball team(s) did Whitey Kurowski play for?\n\nWhitey Kurowski did not play college baseball.\n\nHas Whitey Kurowski ever been named an All Star?\n\nWhitey Kurowski was voted in or selected to play in the following MLB All Star games: 1943 - NL reserve 1944 - NL reserve 1945 - NL reserve 1946 - NL starting Third Baseman 1947 - NL reserve\n\nIs Whitey Kurowski in the Baseball Hall of Fame?"}, {"url": "https://www.stlredbirds.com/2022/06/19/whitey-kurowski-ninth-inning-home-run-lifts-cardinals-to-the-1942-world-series-title/", "page_content": "On October 5, 1942, third baseman Whitey Kurowski struck the deciding blow in Game 5 of the World Series to beat the New York Yankees and begin a five-year run of dominance in which the St. Louis Cardinals won three world championships.\n\nThe heavily favored Yankees entered the 1942 Fall Classic as the defending world champions and winners of five of the past six World Series. Led by Joe Gordon, Charlie Keller, and Joe DiMaggio, they easily won the American League pennant that season, winning 103 games and outpacing the second-place Boston Red Sox by nine games.\n\nThe Cardinals had not had nearly as easy a time in winning the National League flag. As late as August 5 they trailed the Brooklyn Dodgers by 10 games. It wasn’t until they swept a two-game series against the Dodgers on September 11 and 12 that they moved into a tie for the league lead. The following day, after dropping the first game of a doubleheader against the Phillies, St. Louis began a six-game win streak that gave them the lead for good. They finished with 106 wins, two games ahead of the Dodgers, to win their sixth National League pennant.\n\nThough the Cardinals started National League MVP Mort Cooper in Game 1, they committed four errors and lost the opener, 7-4. From that point forward, however, the World Series belonged to the Cardinals.\n\nAfter winning Game 2 at Sportsman’s Park, 4-3, the Cardinals went to Yankee Stadium and picked up 2-0 and 9-6 wins. As a result, Game 5 presented the opportunity to conclude the series and hoist the championship.\n\nThe Cardinals started 24-year-old right-hander Johnny Beazley, who had gone 21-6 with a 2.13 ERA during the regular season. Beazley had been the winning pitcher in Game 2, scattering 10 Yankees hits and allowing three runs in a complete-game effort.\n\nTo oppose Beazley, the Cardinals sent 37-year-old Red Ruffing to the mound. A 19-season major-league veteran, Ruffing was a six-time all-star who had received American League MVP votes in four of the previous five seasons. He went 14-7 with a 3.21 ERA in the regular season and was the winning pitcher in Game 1 of the World Series, allowing four runs over 8 2/3 innings.\n\nRuffing opened Game 5 with a scoreless first inning before Phil Rizzuto gave him a one-run lead with a solo home run to lead off the bottom of the inning. Ruffing held that lead until the top of the fourth, when Enos Slaughter hit a solo home run to right field.\n\nThe Yankees regained the lead in the bottom of the fourth when Red Rolfe laid down a bunt single and advanced to second on a throwing error by Beazley. After Rolfe advanced to third on a fly ball, DiMaggio drove him home with a single to left.\n\nNew York threatened again in the fifth as Ruffing singled and the Cardinals committed two more errors. With the bases loaded, DiMaggio grounded out to Kurowski at third base to end the inning.\n\nThe Cardinals carried that momentum into their next at-bat, as Terry Moore and Slaughter opened the inning with singles. With runners on first and third, Walker Cooper hit a sacrifice fly to right field that tied the game once more.\n\nNeither side threatened again until the top of the ninth, when Walker Cooper hit a leadoff single up the middle. After Johnny Hopp laid down a sacrifice bunt to advance Walker Cooper to second, Ruffing faced off with Kurowski, who had struck out three times against Rudding in Game 1 and was 0-for-3 with three fly balls heading into the ninth inning of Game 5.\n\nAs a 7-year-old in Reading, Pennsylvania, Kurowski had climbed a fence and fallen, landing in broken glass. When the injury turned into osteomyelitis, an infection of the bone, doctors removed four inches of his ulna, one of two bones in the forearm.\n\nOn this occasion, however, neither Kurowski’s misshapen right arm nor Rudding’s previous success against him made any difference. His fly ball sailed over the left-field wall to give the Cardinals a 4-2 lead heading into the bottom of the ninth.\n\nThe Yankees made things tense in the final frame when Joe Gordon led off with a single and Bill Dickey reached on the Cardinals’ fourth error of the game. However, Walker Cooper picked Gordon off second base and Beazley got pinch-hitter Jerry Priddy to pop up for the second out. The Yankees called upon George Selkirk to bat in place of Rudding, but Selkirk grounded out to second baseman Jimmy Brown to end the game and the series.\n\nFor the fourth time in franchise history, the Cardinals were world champions. Bookmakers and scalpers who expected the powerhouse Yankees to win the series reportedly lost up to $100,000.[1] It was the first World Series the Yankees had lost in seven trips since 1926, when Rogers Hornsby’s Cardinals won the first championship in franchise history.\n\n“Baseball’s domination by the New York Yankees folded up and passed out of existence before 69,052 spectators here this afternoon as the St. Louis National League Cardinals, fighting uphill in the vast Yankee Stadium, became the new world champions of the green diamond,” wrote St. Louis Globe-Democrat sports editor Martin J. Haley.[2]\n\n“Any time you can beat a ball club like the Yanks … well, I just feel wonderful,” Cardinals manager Billy Southworth said. “If I felt any better I wouldn’t be able to stand it.”[3]\n\nFor bringing the championship back home to St. Louis, each player received a $6,192.50 share of the World Series purse.[4] For many of the Cardinals, that doubled their salary for the season.\n\n“Gosh, I can buy that farm now,” pitcher Howie Krist said. “It’s 150 acres and it’s a good producing piece of land. Money may shrink, but 150 acres will be 150 acres five years from now, just as it is today.”[5]\n\nKurowski, who was down to his last bat after breaking all of his others during the season, kept it nearby throughout the postgame celebration, showing it to teammates, visitors, and anyone who showed interest.\n\n“I hope my brother Ray was listening on the radio,” Kurowski said. “He’s a Marine down in Parris Island, South Carolina. I got a letter from him this afternoon congratulating me on getting into the World Series, but telling me I made him look silly by fanning my first three times at bat. I got even with him today.”[6]\n\nAfter the 1942 season, Kurowski made five consecutive all-star appearances. In 1945, he hit .323 with 21 homers and 102 RBIs and placed fifth in the National League MVP voting. In 1947, he again finished in the top 10 in the MVP vote after batting .310 with a career-high 27 homers and 104 RBIs. Shortly thereafter, arm injuries ended his career and he went on to become a minor-league coach and manager for 18 seasons.\n\nAfter his breakout 1942 season, Beazley’s career was interrupted by World War II. Before the World Series, he had announced his intention to return home to Nashville, Tennessee, and enlist in the Marine Corps. After he beat the Yankees in Game 5, the Marines recruiting office sent him a telegram: “If you can toss hand grenades like you pitch for them Cards, hurry up.”[7]\n\nAfter three years of military service, Beazley finally returned in 1946 and went 7-5 with a 4.46 ERA. Ahead of the 1947 season, the Cardinals sold him to the Boston Braves, where he won just two games the remainder of his career.\n\nBeazley’s counterpart in Game 5, Ruffing, missed the next two seasons due to military service, returning in 1945 at age 40. He pitched three more seasons in the majors, making his final appearance with the White Sox in 1947.\n\nThe 1942 championship marked the beginning of a five-year stretch in which the Cardinals made four World Series appearances and won three. In 1943, the Yankees returned the favor, beating St. Louis in a five-game World Series, but the Cardinals bounced back and won the 1944 title over the cross-town Browns. In 1946, the Cardinals won the World Series again, this time defeating the Red Sox in seven games."}, {"url": "https://www.baseball-almanac.com/players/playerpost.php?p=kurowwh01&ps=asg", "page_content": "\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that in the Whitey Kurowski Miscellaneous All-Star Items of Interest section seen above you can click the Stats link under the All-Star label and a truly comprehensive history of that All-Star Game will appear on your screen?\n\nHow comprehensive is our All-Star section? We have box scores from every All-Star Game in history, line scores, accurate rosters, play-by-play data, trivia, a sample program, and a detailed written account of each Midsummer Classic.\n\nThe World Series label/link in the final section only shows whether or not Whitey Kurowski was in the World Series during the season where he appeared in the All-Star Game (Dash=Not in the Series | Stats=In the Series and the link leads to the World Series Game). Visit the main page for Whitey Kurowski for his comprehensive regular season statistics and World Series data."}, {"url": "https://www.baseball-almanac.com/players/player.php?p=kurowwh01", "page_content": "Whitey Kurowski was born on Friday, April 19, 1918, in Reading, Pennsylvania. Kurowski was 23 years old when he broke into the big leagues on September 23, 1941, with the St. Louis Cardinals. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Whitey Kurowski baseball stats page.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that you can compare Whitey Kurowski to other rookies who also had their Major League debut during the 1941 National League season?\n\nYou can follow the team links in the chart above to locate common statistics (singles), advanced statistics (WHIP Ratio & Isolated Power), and unique statistics (plate appearances & times on bases) not found on any other website.\n\nIf you find this type of \"free\" data useful please consider making a donation to Baseball Almanac : a privately run / non-commercial site in need of financial assistance."}, {"url": "https://www.findagrave.com/memorial/8391/george-john-kurowski", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.baseball-reference.com/bullpen/Whitey_Kurowski", "page_content": "George John Kurowski\n\nBR page\n\nBiographical Information [ edit ]\n\nWhitey Kurowski played nine seasons in the major leagues, all for the St. Louis Cardinals in the 1940's. He hit over .300 several times and posted a career Adjusted OPS+ of 125, equal to that of Ron Santo and Bobby Grich. He was a third baseman who appeared in four World Series and five All Star games in his relatively short career.\n\nIn 1945 he was fifth in the league in batting average and also fifth in the MVP voting and second in slugging percentage. In 1947 he was second in the league in OBP. He was once third in the league in doubles, once fourth in the league in RBI and twice fourth in the league in homers. He led the league in hit-by-pitch in 1947.\n\nNone of the most similar players (by the similarity scores method) has as high an Adjusted OPS+ as Kurowski does.\n\nHis minor league playing career ran from 1937 to 1949 with some appearances after that as a player-manager through 1959.\n\nAfter retiring, Kurowski became a minor league manager in the St. Louis Cardinals chain from 1950 to 1962. He also managed the Buffalo Bisons for the New York Mets in 1964, the Cleveland Indians with the Reading Indians in 1965, and for the Washington Senators from 1970 to 1971 with the Denver Bears in 1970 and Burlington Senators in 1970 and 1971. Overall his teams were 983-916 in 15 years.\n\nNotable Achievements [ edit ]\n\n5-time NL All-Star (1943-1947)\n\n20-Home Run Seasons: 3 (1944, 1945 & 1947)\n\n100 RBI Seasons: 2 (1945 & 1947)\n\n100 Runs Scored Seasons: 1 (1947)\n\nWon three World Series with the St. Louis Cardinals (1942, 1944 & 1946)\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nRick Swaine: \"Whitey Kurowski\", in Bill Nowlin, ed.: Van Lingle Mungo: The Man, The Song, The Players, SABR, Phoenix, AZ, 2014, pp. 55-58. ISBN 978-1-933599-76-2"}, {"url": "http://historicbaseball.com/players/k/kurowski_whitey.html", "page_content": "\n\nHistory Players Teams Obituaries Site search Contact Us Sponsor a page on Historic Baseball! Click here for details Whitey Kurowski George John Kurowski\n\nBorn: April 19, 1918 in Reading, Penn.\n\nDied: Dec. 9, 1999 in Sinking Springs, Penn.\n\nDebut: 1941 | Pos: 3B\n\nH: 5'11\" | W: 193 | B: R | T: R YR G AB R H HR RBI SB BA 9 916 3229 518 925 106 529 19 .286 >> Visit the Whitey Kurowski biography on Baseball Almanac for complete statistics. Wally Kurowski, who hit a home run in the 1942 World Series, died on Dec. 9, 1999 in Sinking Springs, Tenn. The third baseman spent nine seasons in the major leagues and compiled a .286 career average with 106 home runs and 529 RBI. His career inclued the 1942, 1943, 1944 and 1946 World Series and he hit .253 in 83 career World Series at-bats. In 1942, he collected four hits for the Cardinals in the World Series victory over the Yankees. He hit a home run in the ninth inning of Game 5 off the Yankees' Red Ruffing to clinch the title for St. Louis. During his career, the Cardinals won the 1942, 1944 and 1946 World Series. He was named to four All-Star rosters -- 1943, 1944, 1946 and 1947 -- and he led the National League in putouts three times, in fielding twice and once in double plays. He finished in the top 10 in MVP voting in 1945 (5th) and 1947 (9th). One of his best seasons came in 1947 when he hit .310 in 513 at-bats with 27 home runs and 104 RBI. He also drove in 102 runs in 1945. His playing career came to an end in 1949 due to an arm problem. Following his career as a player, he coached and managed in the minor leagues for 18 years. He also worked for the Berks County Bureau of Weights and Measures until his retirement in 1980."}]}