{"Whitey Kurowski played in Major League Baseball as a third baseman for the St. Louis Cardinals (1938\\u20131948) and Philadelphia Phillies (1949\\u20131951).": [{"url": "https://www.baseball-reference.com/players/k/kurowwh01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Whitey Kurowski born?\n\nWhitey Kurowski was born on April 19, 1918.\n\nWhere was Whitey Kurowski born?\n\nWhitey Kurowski was born in Reading, PA.\n\nHow tall was Whitey Kurowski?\n\nWhitey Kurowski was 5-11 (180 cm) tall.\n\nHow much did Whitey Kurowski weigh when playing?\n\nWhitey Kurowski weighed 193 lbs (87 kg) when playing.\n\nHow many seasons did Whitey Kurowski play?\n\nWhitey Kurowski played 9 seasons.\n\nIs Whitey Kurowski in the Hall of Fame?\n\nWhitey Kurowski has not been elected into the Hall of Fame.\n\nWhat position did Whitey Kurowski play?\n\nWhitey Kurowski was a Third Baseman.\n\nHow many hits did Whitey Kurowski have?\n\nWhitey Kurowski had 925 hits over his career.\n\nHow many home runs did Whitey Kurowski have?\n\nWhitey Kurowski had 106 home runs over his career.\n\nWhat was Whitey Kurowski's average?\n\nWhitey Kurowski had a .286 average over his career.\n\nHow many teams has Whitey Kurowski played for?\n\nWhitey Kurowski played for 1 team, the St. Louis Cardinals.\n\nHow many World Series has Whitey Kurowski won?\n\nWhitey Kurowski won 3 World Series.\n\nWhen did Whitey Kurowski retire?\n\nWhitey Kurowski last played in 1949."}, {"url": "https://www.baseball-reference.com/bullpen/Whitey_Kurowski", "page_content": "George John Kurowski\n\nBR page\n\nBiographical Information [ edit ]\n\nWhitey Kurowski played nine seasons in the major leagues, all for the St. Louis Cardinals in the 1940's. He hit over .300 several times and posted a career Adjusted OPS+ of 125, equal to that of Ron Santo and Bobby Grich. He was a third baseman who appeared in four World Series and five All Star games in his relatively short career.\n\nIn 1945 he was fifth in the league in batting average and also fifth in the MVP voting and second in slugging percentage. In 1947 he was second in the league in OBP. He was once third in the league in doubles, once fourth in the league in RBI and twice fourth in the league in homers. He led the league in hit-by-pitch in 1947.\n\nNone of the most similar players (by the similarity scores method) has as high an Adjusted OPS+ as Kurowski does.\n\nHis minor league playing career ran from 1937 to 1949 with some appearances after that as a player-manager through 1959.\n\nAfter retiring, Kurowski became a minor league manager in the St. Louis Cardinals chain from 1950 to 1962. He also managed the Buffalo Bisons for the New York Mets in 1964, the Cleveland Indians with the Reading Indians in 1965, and for the Washington Senators from 1970 to 1971 with the Denver Bears in 1970 and Burlington Senators in 1970 and 1971. Overall his teams were 983-916 in 15 years.\n\nNotable Achievements [ edit ]\n\n5-time NL All-Star (1943-1947)\n\n20-Home Run Seasons: 3 (1944, 1945 & 1947)\n\n100 RBI Seasons: 2 (1945 & 1947)\n\n100 Runs Scored Seasons: 1 (1947)\n\nWon three World Series with the St. Louis Cardinals (1942, 1944 & 1946)\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nRick Swaine: \"Whitey Kurowski\", in Bill Nowlin, ed.: Van Lingle Mungo: The Man, The Song, The Players, SABR, Phoenix, AZ, 2014, pp. 55-58. ISBN 978-1-933599-76-2"}, {"url": "https://www.baseball-almanac.com/players/player.php?p=kurowwh01", "page_content": "Whitey Kurowski was born on Friday, April 19, 1918, in Reading, Pennsylvania. Kurowski was 23 years old when he broke into the big leagues on September 23, 1941, with the St. Louis Cardinals. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Whitey Kurowski baseball stats page.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that you can compare Whitey Kurowski to other rookies who also had their Major League debut during the 1941 National League season?\n\nYou can follow the team links in the chart above to locate common statistics (singles), advanced statistics (WHIP Ratio & Isolated Power), and unique statistics (plate appearances & times on bases) not found on any other website.\n\nIf you find this type of \"free\" data useful please consider making a donation to Baseball Almanac : a privately run / non-commercial site in need of financial assistance."}, {"url": "https://wiki.alquds.edu/?query=Whitey_Kurowski", "page_content": "American baseball player\n\nBaseball player\n\nGeorge John Kurowski (April 19, 1918 – December 9, 1999) was a third baseman in Major League Baseball who played his entire career for the St. Louis Cardinals (1941–49).\n\nKurowski's childhood nickname came from his already white hair.[1]\n\nChildhood [ edit ]\n\nA native of Reading, Pennsylvania, Kurowski overcame several personal problems, including a bout with childhood osteomyelitis[2] that eventually forced the removal of part of a bone on his right forearm.[1] Before he started his baseball career, his older brother died in a mine accident, and his father died from a heart attack during spring training in 1942.[1][3]\n\nPlaying Career [ edit ]\n\nKurowski batted and threw right-handed, and debuted as Major Leaguer on September 23, 1941.\n\nHis most productive season came in 1947, when he posted career-highs in average (.310), home runs (27), RBI (104), runs (108), doubles (27), slugging % (.544) and on-base % (.420).\n\nAn All-Star during five consecutive seasons (1943–47), Kurowski exceeded the 20 home run mark three times to set a major league record for a third baseman (1944–45, 1947), and hit over .300 three times (1945–47). He also led the National League three times in putouts, twice in fielding %, and once in double plays.[2]\n\nIn four World Series appearances, Kurowski hit .253 (21-for-83) with one home run and nine RBI in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only postseason homer came in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for St. Louis over the New York Yankees.[2]\n\nIn 1949, he developed arm and elbow problems and his playing career ended, with his final game taking place on October 1, 1949[2]\n\nAcross a nine-season career, Kurowski posted a .286 batting average with 106 home runs and 529 RBI in 916 games played.\n\nMinor League Manager [ edit ]\n\nAfter retiring as a player, Kurowski coached and managed in the minor leagues for 18 years until 1972.[1] Additionally, he made rare appearances on the field as a player, working in both the Cardinal and Cleveland Indians organizations. In his final professional at-bat in 1959, he recorded a base hit with Billings Mustangs of the Pioneer League.[4]\n\nLegacy [ edit ]\n\nKurowski was a huge contributor for the Cardinals during their most successful run as a franchise, winning the World Series in 1942, 1944 and 1946 and adding another National League pennant in 1943. In games that Kurowski played, the Cardinals had a winning percentage of .620, finishing in second place or higher in every season of his career and winning 90+ games in all but two seasons. After retiring, the Redbirds wouldn't finish as high as second place again until 1957, and wouldn't claim another National League pennant until 1964.\n\nThe five time National League All-Star started the 1946 All-Star Game at third base. But Kurowski's impact each season was felt long after the Midsummer Classic, as he proved to be a consistent player as the dog days of an often unforgiving baseball summer wore on. For instance, his slugging percentage increased by 15 points in the second half of the season, and he maintained his career .286 batting average across both halves of the season. Moreover, he hit 47% more home runs (and 15% more extra-base hits) in the second half of the season.[5]\n\nSuch was his consistency that Kurowski appeared five times in the National League MVP ballot, in 1942 and from 1944 through 1947.\n\nHe gained induction into the National Polish-American Hall of Fame in 1988.[1]\n\nIn an article in 1976 in Esquire magazine, sportswriter Harry Stein published an \"All Time All-Star Argument Starter,\" consisting of five ethnic baseball teams. Kurowski was the third baseman on Stein's Polish team.[6]\n\nKurowski died in Sinking Spring, Pennsylvania, at age 81.\n\nSee also [ edit ]"}, {"url": "https://www.findagrave.com/memorial/8391/george-john-kurowski", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://prabook.com/web/whitey.kurowski/2303081", "page_content": "Whitey Kurowski\n\nbaseball player\n\nApril 19, 1918 (age 81)\n\nKurowski batted and threw right-handed. He debuted on September 23, 1941, and played his final game on October 1, 1949. In a nine-season career, Kurowski posted a.286 batting average with 106 home runs and 529 Reserve Bank of India in 916 games played. Kurowski\"s childhood nickname came from his already white hair. A native of Reading, Pennsylvania, Kurowski overcame several personal problems. Kurowski overcame childhood osteomyelitis, which made him miss a part of a bone on his right forearm. His most productive season came in 1947, when he posted career-highs in average (310), home runs (27), Reserve Bank of India (104), runs (108), doubles (27), slugging % (544) and on-base % (420). An All-Star during five consecutive seasons (1943-1947), Kurowski exceeded the 20 home run mark three times to set a major league record for a third baseman (1944-1945, 1947), and hit over.300 three times (1945-1947). He also led the National League three times in putouts, twice in fielding %, and once in double plays. In four World Series appearances, Kurowski hit.253 (21-for-83) with one home run and nine Reserve Bank of India in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only home run in the Series, in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for Saint Louis over the New York Yankees. He also appeared five times in the Most Valuable Player ballot, in 1942 and from 1944 through 1947. In 1949, Kurowski developed arm and elbow problems and his playing career ended. After that, he coached and managed in the minor leagues for 18 years until 1972. He gained induction into the National Polish-American Hall of Fame in 1988. In an article in 1976 in Esquire magazine, sportswriter Harry Stein published an \"All Time All-Star Argument Starter,\" consisting of five ethnic baseball teams. Kurowski was the third baseman on Stein\"s Polish team Kurowski died in Sinking Spring, Pennsylvania, at age 81."}, {"url": "https://en.unionpedia.org/i/Whitey_Kurowski", "page_content": "Whitey Kurowski George John Kurowski (April 19, 1918 – December 9, 1999) was a third baseman in Major League Baseball who played his entire career for the St. Louis Cardinals (-49). [1]\n\n63 relations: Billy Southworth, Bob Elliott (baseball), Bob Klinger, Don Lang (third baseman), Dugout to Foxhole, History of the St. Louis Cardinals (1920–52), Howie Haak, Johnny Lindell, Kurowski, List of kidney stone formers, List of Major League Baseball career putouts as a third baseman leaders, List of Major League Baseball players (Kj–Kz), List of Polish Americans, List of St. Louis Cardinals team records, National Polish-American Sports Hall of Fame, Pennsylvania Sports Hall of Fame, Ray Sanders, Reading, Pennsylvania, Sheriff Robinson, Slaughter's Mad Dash, St. Louis Cardinals, St. Louis Cardinals all-time roster, St. Louis Cardinals award winners and league leaders, The Victory Season, Tulsa Oilers (baseball), Van Lingle Mungo (song), Walker Cooper, Whitey, 1918 in baseball, 1941 St. Louis Cardinals season, 1942 St. Louis Cardinals season, 1942 World Series, 1943 St. Louis Cardinals season, 1943 World Series, 1944 Major League Baseball All-Star Game, 1944 St. Louis Cardinals season, 1945 Major League Baseball All-Star Game, 1945 St. Louis Cardinals season, 1946 Major League Baseball All-Star Game, 1946 National League tie-breaker series, 1946 St. Louis Cardinals season, 1946 World Series, 1947 Major League Baseball All-Star Game, 1947 St. Louis Cardinals season, 1948 St. Louis Cardinals season, 1949 St. Louis Cardinals season, 1950 St. Louis Cardinals season, 1951 St. Louis Cardinals season, 1952 St. Louis Cardinals season, 1953 St. Louis Cardinals season, ..., 1954 St. Louis Cardinals season, 1955 St. Louis Cardinals season, 1958 St. Louis Cardinals season, 1959 St. Louis Cardinals season, 1960 St. Louis Cardinals season, 1961 St. Louis Cardinals season, 1962 St. Louis Cardinals season, 1964 New York Mets season, 1965 Cleveland Indians season, 1970 Washington Senators season, 1971 Washington Senators season, 1999 in baseball, 1999 Major League Baseball season. Expand index (13 more) » « Shrink index\n\nWilliam Harold Southworth (March 9, 1893 – November 15, 1969) was an American right fielder, center fielder and manager in Major League Baseball (MLB).\n\nNew!!: Whitey Kurowski and Billy Southworth · See more »\n\nRobert Irving Elliott (November 26, 1916May 4, 1966) was an American third baseman and right fielder in Major League Baseball who played most of his career with the Pittsburgh Pirates and Boston Braves.\n\nNew!!: Whitey Kurowski and Bob Elliott (baseball) · See more »\n\nRobert Harold \"Bob\" Klinger (June 4, 1908 – August 19, 1977) was a professional baseball player who was a right-handed pitcher in Major League Baseball over parts of eight seasons from 1938 through 1947.\n\nNew!!: Whitey Kurowski and Bob Klinger · See more »\n\nDonald Charles (Don) Lang (March 15, 1915 – September 1, 2010) was a third baseman in Major League Baseball who played for the Cincinnati Reds (1938) and St. Louis Cardinals(1948).\n\nNew!!: Whitey Kurowski and Don Lang (third baseman) · See more »\n\nDugout to Foxhole: Interviews with Baseball Players Whose Careers Were Affected by World War II is a 1994 book written by Rick Van Blair.\n\nNew!!: Whitey Kurowski and Dugout to Foxhole · See more »\n\nThe St. Louis Cardinals, a professional baseball franchise based in St. Louis, Missouri, compete in the National League (NL) of Major League Baseball (MLB).\n\nNew!!: Whitey Kurowski and History of the St. Louis Cardinals (1920–52) · See more »\n\nHoward Frederick Haak (August 28, 1911 — February 22, 1999;; rhymes with \"take\") was an American professional baseball scout for almost 50 years, from the end of World War II through his retirement.\n\nNew!!: Whitey Kurowski and Howie Haak · See more »\n\nJohn Harlan Lindell (August 30, 1916 – August 27, 1985) was an American professional baseball player who was an outfielder and pitcher in Major League Baseball from to and from to for the New York Yankees, St. Louis Cardinals, Philadelphia Phillies and Pittsburgh Pirates.\n\nNew!!: Whitey Kurowski and Johnny Lindell · See more »\n\nKurowski (feminine: Kurowska; plural: Kurowscy) is a Polish surname.\n\nNew!!: Whitey Kurowski and Kurowski · See more »\n\nThere are a number of documented cases of historical figures and distinguished members of society who were kidney stone formers.\n\nNew!!: Whitey Kurowski and List of kidney stone formers · See more »\n\nIn baseball statistics, a putout (denoted by PO or fly out when appropriate) is given to a defensive player who records an out by a Tagging a runner with the ball when he is not touching a base (a tagout), catching a batted or thrown ball and tagging a base to put out a batter or runner (a Force out), catching a thrown ball and tagging a base to record an out on an appeal play, catching a third strike (a strikeout), catching a batted ball on the fly (a flyout), or being positioned closest to a runner called out for interference.\n\nNew!!: Whitey Kurowski and List of Major League Baseball career putouts as a third baseman leaders · See more »\n\nThe following is a list of Major League Baseball players, retired or active.\n\nNew!!: Whitey Kurowski and List of Major League Baseball players (Kj–Kz) · See more »\n\nThis is a list of notable Polish Americans, including both original immigrants who obtained American citizenship and their American descendants.\n\nNew!!: Whitey Kurowski and List of Polish Americans · See more »\n\nThe St. Louis Cardinals, a professional baseball franchise based in St. Louis, Missouri, compete in the National League (NL) of Major League Baseball (MLB).\n\nNew!!: Whitey Kurowski and List of St. Louis Cardinals team records · See more »\n\nThe National Polish-American Sports Hall of Fame and Museum was founded in 1973 to honor and recognize outstanding American athletes, both amateur and professional, of Polish descent.\n\nNew!!: Whitey Kurowski and National Polish-American Sports Hall of Fame · See more »\n\nThe Pennsylvania Sports Hall of Fame (PSHF) is a nonprofit organization established in 1962.\n\nNew!!: Whitey Kurowski and Pennsylvania Sports Hall of Fame · See more »\n\nRaymond Floyd Sanders (December 4, 1916 – October 28, 1983) was a professional baseball player.\n\nNew!!: Whitey Kurowski and Ray Sanders · See more »\n\nReading (Pennsylvania German: Reddin) is a city in and the county seat of Berks County, Pennsylvania, United States.\n\nNew!!: Whitey Kurowski and Reading, Pennsylvania · See more »\n\nWarren Grant \"Sheriff\" Robinson (September 8, 1921 – April 5, 2002) was an American catcher and manager in minor league baseball and a coach and scout for the New York Mets of Major League Baseball.\n\nNew!!: Whitey Kurowski and Sheriff Robinson · See more »\n\nThe Mad Dash, or Slaughter's Mad Dash, refers to an event in the eighth inning of the seventh game of the 1946 World Series between the St. Louis Cardinals and the Boston Red Sox.\n\nNew!!: Whitey Kurowski and Slaughter's Mad Dash · See more »\n\nThe St.\n\nNew!!: Whitey Kurowski and St. Louis Cardinals · See more »\n\nThe St. Louis Cardinals are a Major League Baseball team based in St. Louis, Missouri.\n\nNew!!: Whitey Kurowski and St. Louis Cardinals all-time roster · See more »\n\nThe St. Louis Cardinals, a professional baseball franchise based in St. Louis, Missouri, compete in the National League (NL) of Major League Baseball (MLB).\n\nNew!!: Whitey Kurowski and St. Louis Cardinals award winners and league leaders · See more »\n\nThe Victory Season: The End of World War II and the Birth of Baseball’s Golden Age is a 2013 book written by Robert Weintraub whose previous work includes the New York Times best-seller The House That Ruth Built.\n\nNew!!: Whitey Kurowski and The Victory Season · See more »\n\nThe Tulsa Oilers, located in Tulsa, Oklahoma, were a minor league baseball team that existed on-and-off in multiple leagues from 1905 to 1976.\n\nNew!!: Whitey Kurowski and Tulsa Oilers (baseball) · See more »\n\n\"Van Lingle Mungo\" is a song composed and performed by jazz pianist Dave Frishberg.\n\nNew!!: Whitey Kurowski and Van Lingle Mungo (song) · See more »\n\nWilliam Walker Cooper (January 8, 1915 – April 11, 1991) was an American professional baseball player.\n\nNew!!: Whitey Kurowski and Walker Cooper · See more »\n\nWhitey can refer to.\n\nNew!!: Whitey Kurowski and Whitey · See more »\n\nNo description.\n\nNew!!: Whitey Kurowski and 1918 in baseball · See more »\n\nThe 1941 St. Louis Cardinals season was the team's 60th season in St. Louis, Missouri and the 50th season in the National League.\n\nNew!!: Whitey Kurowski and 1941 St. Louis Cardinals season · See more »\n\nThe 1942 St. Louis Cardinals season was the team's 61st season in St. Louis, Missouri and its 51st season in the National League.\n\nNew!!: Whitey Kurowski and 1942 St. Louis Cardinals season · See more »\n\nThe 1942 World Series featured the defending champion New York Yankees against the St. Louis Cardinals, with the Cardinals winning the Series in five games for their first championship since and their fourth overall.\n\nNew!!: Whitey Kurowski and 1942 World Series · See more »\n\nThe 1943 St. Louis Cardinals season was the team's 62nd season in St. Louis, Missouri and the 52nd season in the National League.\n\nNew!!: Whitey Kurowski and 1943 St. Louis Cardinals season · See more »\n\nThe 1943 World Series matched the defending champion St. Louis Cardinals against the New York Yankees, in a rematch of the 1942 Series.\n\nNew!!: Whitey Kurowski and 1943 World Series · See more »\n\nThe 1944 Major League Baseball All-Star Game was the 12th playing of the \"Midsummer Classic\" between Major League Baseball's American League (AL) and National League (NL) All-Star teams.\n\nNew!!: Whitey Kurowski and 1944 Major League Baseball All-Star Game · See more »\n\nThe 1944 St. Louis Cardinals season was the team's 63rd season in St. Louis, Missouri and the 53rd season in the National League.\n\nNew!!: Whitey Kurowski and 1944 St. Louis Cardinals season · See more »\n\nThe 1945 Major League Baseball All-Star Game was cancelled on April 24 after the Major League Baseball (MLB) season began on April 17. The July 10 game was cancelled due to wartime travel restrictions in World War II. 1945 is the only year since 1933 when the first official All-Star Game was played, that an All-Star Game was cancelled and All-Stars were not officially selected. This was to have been the 13th annual playing of the \"Midsummer Classic\" by MLB's American League (AL) and National League (NL) All-Star teams. The game was to be played at Fenway Park, home of the AL's Boston Red Sox. Fenway Park was chosen for the 1946 Major League Baseball All-Star Game (13th \"Midsummer Classic\") which was played on July 9 of that year. On July 9 and 10, 1945, seven out of eight scheduled interleague night games were advertised and played as \"All-Star\" games in place of the official All-Star Game during the three-day All-Star break to help support the American Red Cross and the National War Fund. Four of the exhibition games were played on July 10 in Washington, D.C., St. Louis, Philadelphia, and Boston. Germany had surrendered in May 1945. Mike Todd, a Broadway producer, had passed on the idea of holding the 1945 All-Star Game in Nuremberg, Germany, at a stadium renamed \"Soldier Field\" where U.S. Troops stationed in the European Theater played baseball. Although baseball's new commissioner, Happy Chandler was reportedly \"intrigued\" by the idea, it was ultimately dismissed as impractical by military advisors.\n\nNew!!: Whitey Kurowski and 1945 Major League Baseball All-Star Game · See more »\n\nThe 1945 St. Louis Cardinals season was the team's 64th season in St. Louis, Missouri and the 54th season in the National League.\n\nNew!!: Whitey Kurowski and 1945 St. Louis Cardinals season · See more »\n\nThe 1946 Major League Baseball All-Star Game was the 13th playing of the \"Midsummer Classic\" by Major League Baseball's (MLB) American League (AL) and National League (NL) All-Star teams.\n\nNew!!: Whitey Kurowski and 1946 Major League Baseball All-Star Game · See more »\n\nThe 1946 National League tie-breaker series was a best-of-three playoff series at the conclusion of Major League Baseball's (MLB) 1946 regular season to decide the winner of the National League (NL) pennant.\n\nNew!!: Whitey Kurowski and 1946 National League tie-breaker series · See more »\n\nThe 1946 St. Louis Cardinals season was a season in American baseball.\n\nNew!!: Whitey Kurowski and 1946 St. Louis Cardinals season · See more »\n\nThe 1946 World Series was played in October 1946 between the St. Louis Cardinals (representing the National League) and the Boston Red Sox (representing the American League).\n\nNew!!: Whitey Kurowski and 1946 World Series · See more »\n\nThe 1947 Major League Baseball All-Star Game was the 14th playing of the \"Midsummer Classic\" between Major League Baseball's (MLB) American League (AL) and National League (NL) All-Star teams.\n\nNew!!: Whitey Kurowski and 1947 Major League Baseball All-Star Game · See more »\n\nThe 1947 St. Louis Cardinals season was the team's 66th season in St. Louis, Missouri and the 56th season in the National League.\n\nNew!!: Whitey Kurowski and 1947 St. Louis Cardinals season · See more »\n\nThe 1948 St. Louis Cardinals season was the team's 67th season in St. Louis, Missouri and the 57th season in the National League.\n\nNew!!: Whitey Kurowski and 1948 St. Louis Cardinals season · See more »\n\nThe 1949 St. Louis Cardinals season was the team's 68th season in St. Louis, Missouri and its 58th season in the National League.\n\nNew!!: Whitey Kurowski and 1949 St. Louis Cardinals season · See more »\n\nThe 1950 St. Louis Cardinals season was the team's 69th season in St. Louis, Missouri and its 59th season in the National League.\n\nNew!!: Whitey Kurowski and 1950 St. Louis Cardinals season · See more »\n\nThe 1951 St. Louis Cardinals season was the team's 70th season in St. Louis, Missouri and the 60th season in the National League.\n\nNew!!: Whitey Kurowski and 1951 St. Louis Cardinals season · See more »\n\nThe 1952 St. Louis Cardinals season was the team's 71st season in St. Louis, Missouri and the 61st season in the National League.\n\nNew!!: Whitey Kurowski and 1952 St. Louis Cardinals season · See more »\n\nThe 1953 St. Louis Cardinals season was the team's 72nd season in St. Louis, Missouri and the 62nd season in the National League.\n\nNew!!: Whitey Kurowski and 1953 St. Louis Cardinals season · See more »\n\nThe 1954 St. Louis Cardinals season was the team's 73rd season in St. Louis, Missouri and its 63rd season in the National League.\n\nNew!!: Whitey Kurowski and 1954 St. Louis Cardinals season · See more »\n\nThe 1955 St. Louis Cardinals season was the team's 74th season in St. Louis, Missouri and the 64th season in the National League.\n\nNew!!: Whitey Kurowski and 1955 St. Louis Cardinals season · See more »\n\nThe 1958 St. Louis Cardinals season was the team's 77th season in St. Louis, Missouri and its 67th season in the National League.\n\nNew!!: Whitey Kurowski and 1958 St. Louis Cardinals season · See more »\n\nThe 1959 St. Louis Cardinals season was the team's 78th season in St. Louis, Missouri and its 68th season in the National League.\n\nNew!!: Whitey Kurowski and 1959 St. Louis Cardinals season · See more »\n\nThe 1960 St. Louis Cardinals season was the team's 79th season in St. Louis, Missouri and its 69th season in the National League.\n\nNew!!: Whitey Kurowski and 1960 St. Louis Cardinals season · See more »\n\nThe 1961 St. Louis Cardinals season was the team's 80th season in St. Louis, Missouri and its 70th season in the National League.\n\nNew!!: Whitey Kurowski and 1961 St. Louis Cardinals season · See more »\n\nThe 1962 St. Louis Cardinals season was the team's 81st season in St. Louis, Missouri and its 71st season in the National League.\n\nNew!!: Whitey Kurowski and 1962 St. Louis Cardinals season · See more »\n\nThe 1964 New York Mets season was the third regular season for the Mets.\n\nNew!!: Whitey Kurowski and 1964 New York Mets season · See more »\n\nThe 1965 Cleveland Indians season was a season in American baseball.\n\nNew!!: Whitey Kurowski and 1965 Cleveland Indians season · See more »\n\nThe 1970 Washington Senators season involved the Senators finishing sixth in the American League East with a record of 70 wins and 92 losses.\n\nNew!!: Whitey Kurowski and 1970 Washington Senators season · See more »\n\nThe 1971 Washington Senators season involved the Senators finishing fifth in the American League East with a record of 63 wins and 96 losses.\n\nNew!!: Whitey Kurowski and 1971 Washington Senators season · See more »\n\nNo description.\n\nNew!!: Whitey Kurowski and 1999 in baseball · See more »\n\nThe 1999 Major League Baseball season ended with the New York Yankees sweeping the Atlanta Braves in the World Series.\n\nNew!!: Whitey Kurowski and 1999 Major League Baseball season · See more »\n\nRedirects here:\n\nGeorge Kurowski.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Whitey_Kurowski"}, {"url": "https://www.mlb.com/news/best-third-basemen-in-cardinals-history", "page_content": "\n\n\",\"providerName\":\"Twitter\",\"providerUrl\":\"https://twitter.com\",\"type\":\"oembed\",\"width\":550,\"contentType\":\"rich\"},{\"__typename\":\"Markdown\",\"content\":\"_Here is Anne Rogers’ ranking of the top 5 third basemen in Cardinals history. Next week: Shortstop._\n\n\n\n• **Cardinals All-Time Around the Horn Team:** Catchers | First basemen | Second basemen\",\"type\":\"text\"},{\"__typename\":\"Markdown\",\"content\":\"**1.** Ken Boyer **, 1955-65**\n\n_Key fact: 1964 NL MVP Award winner hitting .295 with 100 runs scored, 24 home runs and an MLB-leading 119 RBIs_\n\n\n\nBoyer’s place in Cardinals history is best described by his nickname: \\\"The Captain.\\\" The cornerstone, key contributor and steady presence of the 1960s Cardinals, Boyer accumulated a 58.1 bWAR in 11 seasons with St. Louis, was the starting third baseman on the '64 World Series championship team, winning the National League MVP Award that season. He won all five of his Gold Glove Awards with the Cardinals and is often considered one of the finest gloves ever at third base.\n\n\n\nBoyer was born in Liberty, Mo., and became a high school star in Alba. He signed with the Cardinals in 1949 as a pitcher, but during one game in his second Minor League season, the club's third baseman got injured. Boyer took over at the position, showed his hitting talent and never pitched again. He debuted in '55 and made his first of 11 All-Star teams in '56. He’s the only Cardinal in history to have hit for the cycle twice ('61 and '64). In '58, he hit .307, the first of four consecutive seasons with at least a .300 average.\n\n\n\nIn Game 4 of the 1964 World Series against the Yankees, Boyer hit a sixth-inning grand slam to rally the Cardinals from a 3-0 deficit to a 4-3 win. Boyer and the Cardinals beat the Yankees and their third baseman, Ken’s brother, Clete, in seven games that year.\n\n\n\nBoyer was traded to the Mets in 1965, but he returned to the Cardinals as a coach and Minor League manager in the 1970s, taking over the big league club from '78 until part way through '80. He died of lung cancer at age 51 in '82, and when the Cardinals retired his No. 14 two years later, Boyer became the only non-Hall of Famer to have his number hanging on the left-field wall of Busch Stadium. Fifty-five years after he left the Cardinals, Boyer still ranks third in home runs (255), sixth in RBIs (1,001) and ninth in hits (1,855) in the franchise’s record books.\n\n\n\n\\\"\\\\[Boyer\\\\] wasn't a guy for show, at all,\\\" Mike Shannon, Boyer’s eventual successor at third base, told Rick Hummel of the St. Louis Post-Dispatch in 2009. \\\"He wasn't flashy. Everything he did, he did smooth. He just did the job. And if you look up his stats, those are pretty good stats. He was like the Clydesdale of third basemen. He was a great big, strong guy who had a lot of grace. He was the prototype third baseman.\\\"\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"1964-10-11T07:33:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/mp4/2016/11/02/1210854883/1478109747553/asset_450K.mp4\",\"type\":\"video\",\"description\":\"10/11/64: Ken Boyer's grand slam in the top of the 6th inning gives the Cardinals a 4-3 lead over the Yankees in Game 4 of the World Series\",\"displayAsVideoGif\":false,\"duration\":\"00:00:41\",\"slug\":\"boyer-s-grand-slam-c1210854883\",\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-138\",\"title\":\"HBmig away_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-147\",\"title\":\"HBmig home_team_id: 147\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-111321\",\"title\":\"Ken Boyer\",\"person\":{\"__ref\":\"Person:111321\"},\"type\":\"player\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"GameTag\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-rbi\",\"title\":\"HBmig 2013/03/19/sfnmlb-seamlb-1\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-top-play\",\"title\":\"HBmig MLBCOM_TOP_PLAY\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbmobile-application-highlight\",\"title\":\"HBmig MLBMOBILE_APPLICATION_HIGHLIGHT\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-vtp-1960\",\"title\":\"HBmig 1960s\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"home-run\",\"title\":\"home run\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"classic\",\"title\":\"classic\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"world-series\",\"title\":\"World Series\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"postseason\",\"title\":\"postseason\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"highlight\",\"title\":\"highlight\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/nhs0t08evxif1tecehqs\"},\"title\":\"Boyer's grand slam\",\"relativeSiteUrl\":\"/video/boyer-s-grand-slam-c1210854883\"},{\"__typename\":\"Markdown\",\"content\":\"**2.** Scott Rolen **, 2002-07**\n\n_Key fact: Accumulated 25.9 WAR in five and a half seasons with the Cardinals_\n\n\n\nRolen was part of the backbone of one of the most successful eras in team history, from the juggernaut teams of 2004-05 that won 205 total games to the '06 World Series team. After the Cardinals acquired the slugger and elite defender from the Phillies during the '02 season, Rolen went on to be a four-time Gold Glove Award winner, four-time All-Star, Silver Slugger Award winner alongside a .286/.370/.510 slash line as a Cardinal. He was elected to the Cardinals Hall of Fame last summer and received 35.3 percent of votes cast on this year’s BBWAA Hall of Fame ballot in his third year of eligibility.\n\n\n\nIn 2004, Rolen slashed .314/.409/.598 with 34 home runs and 124 RBIs. He was part of the “MV3” with Albert Pujols and Jim Edmonds that year, when all three finished top five in the NL MVP Award voting. Rolen finished fourth in voting, the highest mark of his 17-year career.\n\n\n\nRolen solidified his place in team history with his pennant-clinching, two-run home run in Game 7 of the 2004 NL Championship Series against the Astros. After Edmonds’ incredible run-saving catch in the second inning to stay within striking distance, Pujols tied the game with a double off seven-time Cy Young winner Roger Clemens in the sixth. One pitch later, Rolen delivered the winning runs off Clemens that sent the Cardinals to their first World Series in 17 years.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"2004-10-22T00:00:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/2013/10/22/mlbtv_housln_31169643_3gpp_128K.3gp\",\"type\":\"video\",\"description\":\"10/21/04: The Cardinals take a 4-2 lead in the bottom of the sixth on Scott Rolen's two-out, two-run home run off of Roger Clemens\",\"displayAsVideoGif\":false,\"duration\":\"00:01:18\",\"slug\":\"rolen-s-go-ahead-two-run-homer-c31169643\",\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbmobile-application-highlight\",\"title\":\"HBmig MLBMOBILE_APPLICATION_HIGHLIGHT\",\"type\":\"unsupported\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-121409\",\"title\":\"Scott Rolen\",\"person\":{\"__ref\":\"Person:121409\"},\"type\":\"player\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-vtp-2000\",\"title\":\"HBmig 2000s\",\"type\":\"unsupported\"},{\"__typename\":\"GameTag\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-embeddable\",\"title\":\"HBmig Blog embeddable\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-no-transcode\",\"title\":\"HBmig MLBCOM_NO_TRANSCODE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-117\",\"title\":\"HBmig away_team_id: 117\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-shareable\",\"title\":\"HBmig FB shareable (internal)\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-top-play\",\"title\":\"HBmig MLBCOM_TOP_PLAY\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-138\",\"title\":\"HBmig home_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"home-run\",\"title\":\"home run\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"classic\",\"title\":\"classic\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"highlight\",\"title\":\"highlight\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/rwedmj2quue3bhqcvbmq\"},\"title\":\"Rolen's clutch Game 7 homer\",\"relativeSiteUrl\":\"/video/rolen-s-go-ahead-two-run-homer-c31169643\"},{\"__typename\":\"Markdown\",\"content\":\"**3.** Matt Carpenter **, 2011-present**\n\n_Key fact: Had one of the best single-game performances in franchise history on July 20, 2018, against the Cubs_\n\n\n\nIn nine years so far with St. Louis, Carpenter has hit .269/.372/.462 and accumulated 28.3 WAR, second only to Boyer among Cards third basemen. Drafted in the 13th round of the 2009 MLB Draft out of Texas Christian University, Carpenter emerged in the Majors as a utility man, playing first, second, third base and the outfield. A three-time All-Star, Carpenter has had three top-15 finishes in NL MVP Award voting, finishing as high as fourth in '13, when he hit .318/.392/.481 and led baseball in runs (126), hits (199) and doubles (55). Carpenter finished ninth in '18 MVP voting after a second-half surge.\n\n\n\nThe peak of that surge in 2018 came in late July at Wrigley Field. Carpenter became the first player in Cardinals history \\\\-\\\\- and only the second in Major League history -- to hit three home runs and two doubles in a game. He started that game by tying Lou Brock’s franchise record with his 21st career leadoff home run, and his 16 total bases that day were a record for a leadoff batter. Carpenter is the 11th player in the past 115 years to tally five extra-base hits in a game (the first Cardinal to do it) and the first to do so from the leadoff spot.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"2018-07-20T18:20:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/mp4/2018/07/21/2288685783/1532134001544/asset_450K.mp4\",\"type\":\"video\",\"description\":\"Matt Carpenter becomes the second player in history to record three homers and two doubles in his seven-RBI performance against the Cubs\",\"displayAsVideoGif\":false,\"duration\":\"00:01:21\",\"slug\":\"carpenter-s-milestone-5-hit-game-c2288685783\",\"tags\":[{\"__typename\":\"GameTag\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-mlbcomwatermark\",\"title\":\"HBmig MLB.com Watermark\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-2018\",\"title\":\"HBmig 2018\",\"type\":\"unsupported\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-embeddable\",\"title\":\"HBmig Blog embeddable\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-mm-hightlight-reel\",\"title\":\"HBmig Highlight Reel\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-rbi\",\"title\":\"HBmig 2013/03/19/sfnmlb-seamlb-1\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-138\",\"title\":\"HBmig away_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-shareable\",\"title\":\"HBmig FB shareable (internal)\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-112\",\"title\":\"HBmig home_team_id: 112\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-572761\",\"title\":\"Matt Carpenter\",\"person\":{\"__ref\":\"Person:572761\"},\"type\":\"player\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"home-run\",\"title\":\"home run\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"milestone\",\"title\":\"milestone\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/vguvaobflbirujxkziwa\"},\"title\":\"Carpenter's milestone 5-hit game\",\"relativeSiteUrl\":\"/video/carpenter-s-milestone-5-hit-game-c2288685783\"},{\"__typename\":\"Markdown\",\"content\":\"**4.** Whitey Kurowski**, 1941-49**\n\n_Key fact: Three-time World Series champ and five-time All-Star_\n\n\n\nKurowski was integral to a Cardinals dynasty that brought World Series titles to St. Louis in 1942, '44 and '46. Part of the wave of young stars who emerged from the organization’s farm system in the early 1940s, Kurowski had his first full season in '42 with Stan Musial. The two helped drive the Cardinals to an NL pennant and World Series triumph over the Yankees.\n\n\n\nIn the deciding Game 5, Kurowski hit a home run off future Hall of Famer Red Ruffing in the top of the ninth to break the 2-2 tie and win the World Series.\n\n\n\nKurowski -- who played his entire nine-year career with the Cardinals and accumulated a 24.5 WAR -- quickly established himself as one of the finest third basemen in baseball. He’s often underrated because he played during World War II -- he was ineligible for military service -- but he had his best season when players returned in 1947: a .310/.420/.544 slash line with a career-high 27 home runs and 104 RBIs. From '43-47, Kurowski finished among the top 10 in the league in home runs each season, and from '45-47, he finished in the top 10 in batting average, on-base percentage, slugging percentage, total bases and RBIs each season. His 24.5 WAR ranks fourth on the Cardinals’ all-time third basemen list.\",\"type\":\"text\"},{\"__typename\":\"Image\",\"caption\":null,\"contextualCaption\":null,\"contextualAspectRatio\":null,\"credit\":null,\"contentType\":\"Photography\",\"format\":\"jpg\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/cevb5hmxcp76gimze9md\",\"type\":\"image\"},{\"__typename\":\"Markdown\",\"content\":\"**5.** Ken Oberkfell**, 1977-84**\n\n_Key fact: Led the NL in fielding percentage at third base in 1982 (.972) and '83 (.960)_\n\n\n\nOberkfell produced at the plate with such a steady cadence that his average ranged from no lower than .289 to no higher than .303 in the five full seasons he spent with the Cardinals. He walked more than he struck out, and his defense was solid, too, sharing the infield with Ozzie Smith, Tom Herr and Keith Hernandez. Oberkfell was often criticized for not having power -- he only hit 11 home runs over eight years in St. Louis -- but his contact-oriented approach fit right in with the philosophy of the 1980s Cardinals and manager Whitey Herzog.\n\n\n\nOberkfell hit .292 in the 1982 World Series, which the Cardinals won over Milwaukee in a thrilling seven-game series. He accumulated a 17.1 WAR in St. Louis, ranking fifth among third basemen on the Cardinals' all-time list.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"1982-10-09T20:05:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/2013/06/25/mlbtv_atlsln_28325111_300K.mp4\",\"type\":\"video\",\"description\":\"10/9/82: Ken Oberkfell's single in the bottom of the ninth gives the Cardinals a 4-3 win over the Braves in Game 2 of the NLCS\",\"displayAsVideoGif\":false,\"duration\":\"00:01:52\",\"slug\":\"oberkfell-s-walk-off-single-c28325111\",\"tags\":[{\"__typename\":\"PersonTag\",\"slug\":\"playerid-119884\",\"title\":\"Ken Oberkfell\",\"person\":{\"__ref\":\"Person:119884\"},\"type\":\"player\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-138\",\"title\":\"HBmig home_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"GameTag\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-144\",\"title\":\"HBmig away_team_id: 144\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"classic\",\"title\":\"classic\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"walk-off\",\"title\":\"walk off\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"highlight\",\"title\":\"highlight\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/y7ekpfproyei3quaoikf\"},\"title\":\"Oberkfell's walk-off single\",\"relativeSiteUrl\":\"/video/oberkfell-s-walk-off-single-c28325111\"},{\"__typename\":\"Markdown\",\"content\":\"**Honorable mentions**\n\n• With Boyer manning third, Mike Shannon arrived in the Majors as an outfielder in his first full season in 1964 and was a rookie sparkplug for the team, with 43 RBIs and nine home runs in 88 games. He homered off Yankees great Whitey Ford in the World Series to help the Cardinals to victory. Later becoming the starting third baseman, Shannon, a native of St. Louis and local high school star, started every game in the three World Series he played, and he homered in each series.\n\n\n\n• Terry Pendleton succeeded Oberkfell at third base in 1984 and finished seventh in Rookie of the Year Award voting that year. He was on the '85 and '87 NL pennant-winning teams, and he hit .259/.308/.356 and won two Gold Glove Awards in his seven seasons with the Cardinals.\n\n\n\n• No list would be complete without October hero David Freese . After all, Game 6 of the 2011 World Series is simply referred to as, “The David Freese Game” after he hit the game-tying triple in the bottom of the ninth and the walk-off home run in the 11th against the Rangers. He was the NLCS and World Series MVP, and in five years with his hometown Cardinals, Freese hit .286/.356/.427 and made one All-Star team.\",\"type\":\"text\"}],\"contentType\":\"news\",\"subHeadline\":null,\"summary\":\"No one loves a good debate quite like baseball fans, and with that in mind, we asked each of our beat reporters to rank the top five players by position in the history of their franchise, based on their career while playing for that club. These rankings are for fun\",\"tagline({\\\"formatString\\\":\\\"none\\\"})\":null,\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"season-2020\",\"title\":\"Season 2020\",\"type\":\"season\"},{\"__typename\":\"InternalTag\",\"slug\":\"storytype-article\",\"title\":\"Article\",\"type\":\"article\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"ContributorTag\",\"slug\":\"anne-rogers\",\"title\":\"Anne Rogers\",\"type\":\"contributor\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-111321\",\"title\":\"Ken Boyer\",\"person\":{\"__ref\":\"Person:111321\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-121409\",\"title\":\"Scott Rolen\",\"person\":{\"__ref\":\"Person:121409\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-572761\",\"title\":\"Matt Carpenter\",\"person\":{\"__ref\":\"Person:572761\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-117369\",\"title\":\"Whitey Kurowski\",\"person\":{\"__ref\":\"Person:117369\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-119884\",\"title\":\"Ken Oberkfell\",\"person\":{\"__ref\":\"Person:119884\"},\"type\":\"player\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"evergreen\",\"title\":\"evergreen\",\"type\":\"taxonomy\"}],\"type\":\"story\",\"thumbnail\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/shtmj17jc37ppnuvy45m\",\"title\":\"Best third basemen in Cardinals history\"}},\"Person:111321\":{\"__typename\":\"Person\",\"id\":111321},\"Team:138\":{\"__typename\":\"Team\",\"id\":138},\"Person:121409\":{\"__typename\":\"Person\",\"id\":121409},\"Person:572761\":{\"__typename\":\"Person\",\"id\":572761},\"Person:119884\":{\"__typename\":\"Person\",\"id\":119884},\"Person:117369\":{\"__typename\":\"Person\",\"id\":117369}}} window.adobeAnalytics = {\"reportingSuiteId\":\"mlbglobal08,mlbcom08\",\"linkInternalFilters\":\"mlb\"} window.globalState = {\"tracking_title\":\"Major League Baseball\",\"lang\":\"en\"} window.appId = '' /*-->*/"}, {"url": "https://www.nytimes.com/1999/12/13/sports/whitey-kurowski-81-dies-beat-yankees-in-world-series.html", "page_content": "Whitey Kurowski, who surmounted a severe arm injury as a youngster and became one of the major leagues' top third basemen of the 1940's and a World Series hero for the St. Louis Cardinals, died last Thursday at a physical rehabilitation center in Shillington, Pa. He was 81.\n\nKurowski, who lived in Shillington, had been in failing health since suffering a stroke after heart bypass surgery in July, according to his wife, Joan.\n\nOn the afternoon of Oct. 5, 1942, a remarkable stretch of World Series success for the Yankees came to an end with one swing by a rookie infielder. George (Whitey) Kurowski's two-run home run off Red Ruffing into the left-field stands at Yankee Stadium in the ninth inning of Game 5 propelled the Cardinals to a 4-2 victory and a Series title, the first time the Yankees had been beaten in nine trips to the Series since they were defeated by the Cards in 1926.\n\nThat Kurowski was even in a major league uniform defied the odds. When he was growing up in Reading, Pa., he fell off a fence and landed in broken glass, severely cutting his right arm. Two years later, he began suffering severe pain and was found to have developed osteomyelitis, a bone inflammation. Three inches of bone above his wrist were surgically removed, leaving the arm weakened and with an unnatural bend. He strengthened his arm muscles as he embarked on a baseball career, but his right arm, his throwing arm, had become shorter than his left."}]}