{"Whitey Kurowski was traded to the Philadelphia Phillies.": [{"url": "https://www.baseball-reference.com/players/k/kurowwh01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Whitey Kurowski born?\n\nWhitey Kurowski was born on April 19, 1918.\n\nWhere was Whitey Kurowski born?\n\nWhitey Kurowski was born in Reading, PA.\n\nHow tall was Whitey Kurowski?\n\nWhitey Kurowski was 5-11 (180 cm) tall.\n\nHow much did Whitey Kurowski weigh when playing?\n\nWhitey Kurowski weighed 193 lbs (87 kg) when playing.\n\nHow many seasons did Whitey Kurowski play?\n\nWhitey Kurowski played 9 seasons.\n\nIs Whitey Kurowski in the Hall of Fame?\n\nWhitey Kurowski has not been elected into the Hall of Fame.\n\nWhat position did Whitey Kurowski play?\n\nWhitey Kurowski was a Third Baseman.\n\nHow many hits did Whitey Kurowski have?\n\nWhitey Kurowski had 925 hits over his career.\n\nHow many home runs did Whitey Kurowski have?\n\nWhitey Kurowski had 106 home runs over his career.\n\nWhat was Whitey Kurowski's average?\n\nWhitey Kurowski had a .286 average over his career.\n\nHow many teams has Whitey Kurowski played for?\n\nWhitey Kurowski played for 1 team, the St. Louis Cardinals.\n\nHow many World Series has Whitey Kurowski won?\n\nWhitey Kurowski won 3 World Series.\n\nWhen did Whitey Kurowski retire?\n\nWhitey Kurowski last played in 1949."}, {"url": "https://thisgreatgame.com/1944-baseball-history/", "page_content": "On the other side of prime time were the elders. Players approaching or beyond 40 years of age were able to stick around when a full-strength, peacetime major league roster wouldn’t have given them the time of day. Others came back out of retirement, hoping they might have some competitive fight left against a handicapped supply of baseball talent. Former Pittsburgh star Lloyd Waner returned and joined his 41-year-old brother Paul at Brooklyn, while 1931 World Series hero Pepper Martin came back to the Cardinals four years after having last played in the majors, batting a respectable .279 in 40 games for the NL champs.\n\nIn between the teenagers and the elderly, many of those with a more common playing age were sticking around the majors because of various physical imperfections—flat feet, allergies, previous injuries—that made them ineligible for military service. Labeled as “4Fs,” these players were good enough to play 154 games a year in the majors, yet were not ideal material for the Armed Forces. In 1944 the average major league team had 10 4Fs on its roster.\n\nThe 4F classification would be a godsend for the St. Louis Browns, who just happened to have 18 such players on their team in 1944.\n\nThe general makeup of the Browns’ roster was a classic reflection on the state of the game during World War II. There were pitchers Nels Potter and Jack Kramer, considered washed up after subpar stints during the late 1930s, but now making good on a second chance. Infielders Don Gutteridge and Mark Christman, both out of the majors after 1940, were back in simply because they were available. Outfielder Milt Byrnes was playing full-time in the second of what would be his only three years of big league ball, all during the war. Pitcher Denny Galehouse, a mediocre pitcher before the war who looked better during, was available on Sundays since it was his day off from wartime employment at nearby Akron, Ohio. And there was shortstop Vern Stephens, a genuine talent who was hanging around because he had been classified 4F with a bad knee.\n\nLast and once least was pitcher Sid Jakucki. His only major league experience came eight years earlier when he struggled to a 0-3 record and an 8.71 ERA for the 1936 Browns. Nonetheless, Jakucki was given a new lease on big league life after he was found playing semipro ball in Houston.\n\nWhen this ragtag batch of once-and-current major leaguers won their first nine games on the year, people joked that the standings were being printed upside down. Remaining near or at the top throughout the year, the Browns watched as the competition within the AL began to wither away to mid-season military deferment. The Boston Red Sox came on strong, only to be sapped by the draft—laying claim to productive hitters in Bobby Doerr and Jim Tabor, as well as pitcher Tex Hughson, who left late in the year with an 18-5 record and 2.26 ERA.\n\nOne team that stayed tight with the Browns to the very finish was the Detroit Tigers—blessed with the double-barreled pitching sensation of Hal Newhouser and Dizzy Trout, a pair of 4F cases who between them won a stunning 56 games. The midseason loss of outfielder Dick Wakefield—on his way to a possible triple crown—likely deprived the Tigers of taking control of the AL, forcing them into a dogfight with the Browns.\n\nTrailing the Tigers by a game going into the season’s final weekend—and with the New York Yankees coming to St. Louis for the year’s last four games—the Browns capitalized on their rare case of pennant fever. While Detroit split the first two games in a doubleheader against Washington, the Browns swept the Yankees in a twinbill as the two former rejects, Jack Kramer and Nels Potter, each earned a win by allowing a combined total of one run. After the Browns and Tigers both won the next day to remain tied for first, it was Detroit who lost its final game to the Senators—leaving the Browns’ destiny in their own hands as they took the field against the Yankees for their last game.\n\nA rare opportunity called for a rare sellout at Sportsman’s Park, the first in 20 years for the Browns; 15,000 were turned away. St. Louis starter Sid Jakucki, known to be more than a recreational drinker, was literally locked away in his hotel room the night before to keep from loosening up at the bar.\n\nAfter trailing early, 2-0, the Browns evened the score with the help of a home run from Chet Laabs—another player who split his time between the Browns and war-related employment. Laabs then broke the tie with another blast—just his fifth of the year—and aided with Vern Stephens’ late insurance homer, Jakucki did his part in silencing the Yankees the rest of the way. The Browns won the game—and the only AL flag they would ever conquer.\n\nEven in triumph, there was a tinge of shame placed upon the Browns’ pennant-winning performance for the record book; their 89-65 effort would go down as the worst by an AL champion to date."}, {"url": "https://www.geni.com/discussions/99211", "page_content": "After 4 games of the 1942 World Series between the St. Louis Cardinals and the New York Yankees, the Cardinals enjoyed a 3 games to 1 lead. With Game 5 tied at 2 in the top of the 9th, George \"Whitey\" Kurowski hit a 2-run home run that put the Cardinals ahead, ultimately winning the game and the '42 Series for the Cards.\n\n\n\nUncle Carl, who was 8 years old at the time, was listening on the radio. Because of Kurowski's feat, and the fact that Kurowski, too, was of Polish descent, Uncle Carl became a Cardinals fan.\n\n\n\nOn July 25, 2009 (Mom's 60th birthday celebration), some 67 years later, we went to a Cardinals-Phillies game in Philadelphia and we tailgated before the game.\n\n\n\nUncle Carl was wearing a retro Cardinals jersey and ran into a young man wearing an identical shirt. They got to talking and the young man turned out to be the grandson of George Kurowski! We all got to meet not only the grandson of George Kurowski, but his sons as well! (Sadly, George Kurowski had passed away around 10 years prior).\n\n\n\nUncle Carl was truly in his glory in this magical moment!"}, {"url": "https://www.historyofcardinals.com/trading-history-with-philadelphia-phillies/", "page_content": "September 6, 2017. The Philadelphia Phillies traded Juan Nicasio to the St. Louis Cardinals for Eliezer Alvarez (minors).\n\nAugust 31, 2007: The Philadelphia Phillies sent Russell Branyan to the St. Louis Cardinals as part of a conditional deal.\n\nJuly 29, 2002: The Philadelphia Phillies traded Doug Nickle, Scott Rolen and cash to the St. Louis Cardinals for Placido Polanco, Bud Smith and Mike Timlin.\n\nNovember 19, 1998: The St. Louis Cardinals traded Jeff Brantley, Ron Gant and Cliff Politte to the Philadelphia Phillies for Ricky Bottalico and Garrett Stephenson.\n\nDecember 16, 1988: The St. Louis Cardinals traded Curt Ford and Steve Lake to the Philadelphia Phillies for Milt Thompson.\n\nApril 6, 1985: The Philadelphia Phillies traded Bill Campbell and Ivan de Jesus to the St. Louis Cardinals for Dave Rucker.\n\nJanuary 23, 1985: The Philadelphia Phillies purchased Ralph Citarella from the St. Louis Cardinals.\n\nDecember 13, 1984: The St. Louis Cardinals returned Mike LaValliere to the Philadelphia Phillies as part of a conditional deal.\n\nDecember 3, 1984: The Philadelphia Phillies sent Mike LaValliere to the St. Louis Cardinals as part of a conditional deal.\n\nNovember 20, 1981: As part of a 3-team trade: The Cleveland Indians sent Bo Diaz to the Philadelphia Phillies. The Philadelphia Phillies sent a player to be named later to the Cleveland Indians. The Philadelphia Phillies sent Lonnie Smith to the St. Louis Cardinals. The St. Louis Cardinals sent Silvio Martinez and Lary Sorensen to the Cleveland Indians. The Philadelphia Phillies sent Scott Munninghoff (December 9, 1981) to the Cleveland Indians to complete the trade.\n\nJune 15, 1977: The St. Louis Cardinals traded Bake McBride and Steve Waterbury to the Philadelphia Phillies for Rick Bosetti, Dane Iorg and Tom Underwood.\n\nApril 9, 1976: The Philadelphia Phillies purchased Wayne Nordhagen from the St. Louis Cardinals.\n\nDecember 9, 1975: The St. Louis Cardinals traded Ron Reed to the Philadelphia Phillies for Mike Anderson.\n\nJune 21, 1974: The Philadelphia Phillies purchased Pete Richert from the St. Louis Cardinals.\n\nMarch 29, 1974: The St. Louis Cardinals purchased Ed Crosby from the Philadelphia Phillies.\n\nDecember 18, 1972: The Philadelphia Phillies traded Byron Browne to the St. Louis Cardinals for Keith Lampard.\n\nFebruary 25, 1972: The Philadelphia Phillies traded Rick Wise to the St. Louis Cardinals for Steve Carlton\n\nApril 3, 1969: The St. Louis Cardinals traded Jerry Buchek and Jim Hutto to the Philadelphia Phillies for Bill White.\n\nApril 10, 1967: The Philadelphia Phillies purchased Tito Francona from the St. Louis Cardinals.\n\nOctober 27, 1965: The St. Louis Cardinals traded Dick Groat, Bob Uecker and Bill White to the Philadelphia Phillies forPat Corrales, Alex Johnson and Art Mahaffey.\n\nApril 28, 1962: The St. Louis Cardinals traded Bobby Locke and cash to the Philadelphia Phillies for Don Ferrarese.\n\nSeptember 19, 1960: The Philadelphia Phillies traded Don Landrum to the St. Louis Cardinals for Bob Sadowski.\n\nDecember 4, 1959: The St. Louis Cardinals traded Bill Smith and Bobby Smith to the Philadelphia Phillies for Carl Sawatski.\n\nApril, 1959: The St. Louis Cardinals returned Bob Miller to the Philadelphia Phillies as part of a conditional deal. (Date given is approximate. Exact date is uncertain.)\n\nFebruary 4, 1959: The Philadelphia Phillies sent Bob Miller to the St. Louis Cardinals as part of a conditional deal.\n\nDecember 3, 1958: The St. Louis Cardinals traded Ruben Amaro to the Philadelphia Phillies for Chuck Essegian.\n\nSeptember 29, 1958: The Philadelphia Phillies traded Solly Hemus to the St. Louis Cardinals for Gene Freese.\n\nMay 10, 1957: The Philadelphia Phillies traded Glen Gorbous to the St. Louis Cardinals for Chuck Harmon.\n\nNovember 19, 1956: The Philadelphia Phillies traded Del Ennis to the St. Louis Cardinals for Bobby Morgan and Rip Repulski.\n\nJuly 4, 1956: The Philadelphia Phillies purchased Toby Atwell from the St. Louis Cardinals. (Date given is approximate. Exact date is uncertain.)\n\nMay 14, 1956: The Philadelphia Phillies traded Bobby Morgan to the St. Louis Cardinals for Solly Hemus.\n\nMay 11, 1956: The Philadelphia Phillies traded Murry Dickson and Herm Wehmeier to the St. Louis Cardinals for Ben Flowers, Harvey Haddix and Stu Miller.\n\nApril 27, 1950: The St. Louis Cardinals traded Ken Johnson to the Philadelphia Phillies for Johnny Blatnik.\n\nApril 7, 1948: The Philadelphia Phillies traded Ralph LaPointe and $30,000 to the St. Louis Cardinals for Dick Sisler.\n\nMay 3, 1947: The St. Louis Cardinals traded Freddy Schmidt and Harry Walker to the Philadelphia Phillies for Ron Northey.\n\nMarch 21, 1947: The Philadelphia Phillies purchased Buster Adams from the St. Louis Cardinals.\n\nJuly 8, 1946: The Philadelphia Phillies purchased Blix Donnelly from the St. Louis Cardinals.\n\nMay 2, 1946: The St. Louis Cardinals purchased Danny Murtaugh from the Philadelphia Phillies.\n\nMay 1, 1946: The St. Louis Cardinals traded Emil Verban to the Philadelphia Phillies for Clyde Kluttz.\n\nFebruary 4, 1946: The Philadelphia Phillies purchased Al Jurisich from the St. Louis Cardinals.\n\nMay 8, 1945: The St. Louis Cardinals traded John Antonelli and Glenn Crawford to the Philadelphia Phillies for Buster Adams.\n\nJune 1, 1943: The St. Louis Cardinals traded Buster Adams, Dain Clay and Coaker Triplett to the Philadelphia Philliesfor Danny Litwhiler and Earl Naylor.\n\nFebruary 19, 1942: The Philadelphia Phillies purchased Sam Nahem from the St. Louis Cardinals.\n\nJune 28, 1941: The Philadelphia Phillies purchased Danny Murtaugh from the St. Louis Cardinals.\n\nApril 2, 1940: The St. Louis Cardinals purchased Jack Bolling from the Philadelphia Phillies.\n\nMay 25, 1939: The Philadelphia Phillies purchased Johnny Watwood from the St. Louis Cardinals.\n\nMay 26, 1938: The St. Louis Cardinals purchased Earl Browne from the Philadelphia Phillies.\n\nMay 26, 1938: The St. Louis Cardinals purchased Hal Kelleher from the Philadelphia Phillies.\n\nDecember 8, 1937: The Philadelphia Phillies traded Earl Grace to the St. Louis Cardinals for Cap Clark.\n\nDecember 3, 1937: The Philadelphia Phillies purchased Heinie Mueller from the St. Louis Cardinals.\n\nMay 24, 1936: The St. Louis Cardinals purchased Johnny Vergez from the Philadelphia Phillies.\n\nMay 7, 1935: The St. Louis Cardinals purchased Phil Collins from the Philadelphia Phillies.\n\nJune 15, 1934: The St. Louis Cardinals traded Kiddo Davis to the Philadelphia Phillies for Chick Fullis.\n\nFebruary 16, 1934: The St. Louis Cardinals purchased Jack Berly from the Philadelphia Phillies.\n\nFebruary 11, 1934: The St. Louis Cardinals purchased Flint Rhem from the Philadelphia Phillies.\n\nFebruary 5, 1934: The Philadelphia Phillies purchased Ethan Allen from the St. Louis Cardinals.\n\nNovember 15, 1933: The St. Louis Cardinals traded Jimmie Wilson to the Philadelphia Phillies for Spud Davis andEddie Delker.\n\nJune 4, 1932: The Philadelphia Phillies purchased Eddie Delker from the St. Louis Cardinals.\n\nDecember 11, 1929: The St. Louis Cardinals traded Pete Alexander and Harry McCurdy to the Philadelphia Phillies forBob McGraw and Homer Peel.\n\nDecember 13, 1928: The Philadelphia Phillies traded Heinie Sand and $10,000 to the St. Louis Cardinals for Tommy Thevenow.\n\nMay 11, 1928: The St. Louis Cardinals traded Spud Davis, Don Hurst and Homer Peel to the Philadelphia Phillies for a player to be named later, Art Decatur and Jimmie Wilson. The Philadelphia Phillies sent Bill Kelly (May 12, 1928) to theSt. Louis Cardinals to complete the trade.\n\nDecember 13, 1927: The St. Louis Cardinals traded Jimmy Ring and Johnny Schulte to the Philadelphia Phillies forJimmy Cooney, Bubber Jonnard and Johnny Mokan.\n\nDecember, 1927: The Philadelphia Phillies purchased Bob McGraw from the St. Louis Cardinals.\n\nSeptember 10, 1927: The St. Louis Cardinals purchased Tony Kaufmann from the Philadelphia Phillies.\n\nJune 6, 1924: The Philadelphia Phillies purchased Joe Schultz from the St. Louis Cardinals.\n\nJanuary, 1920: The Philadelphia Phillies purchased Dots Miller from the St. Louis Cardinals.\n\nOctober, 1919: The Philadelphia Phillies returned Red Ames to the St. Louis Cardinals following previous purchase.\n\nSeptember 5, 1919: The Philadelphia Phillies purchased Red Ames from the St. Louis Cardinals.\n\nJuly 14, 1919: The St. Louis Cardinals traded Lee Meadows and Gene Paulette to the Philadelphia Phillies for Doug Baird, Elmer Jacobs and Frank Woodward.\n\nJanuary 21, 1919: The St. Louis Cardinals traded Doug Baird, Gene Packard and Stuffy Stewart to the Philadelphia Phillies for Dixie Davis, Pickles Dillhoefer and Milt Stock.\n\nApril 4, 1918: The Philadelphia Phillies traded Bert Niehoff and $500 to the St. Louis Cardinals for Milt Watson.\n\nJuly 16, 1913: The St. Louis Cardinals purchased Earl Moore from the Philadelphia Phillies."}, {"url": "https://www.baseball-reference.com/bullpen/Whitey_Kurowski", "page_content": "George John Kurowski\n\nBR page\n\nBiographical Information [ edit ]\n\nWhitey Kurowski played nine seasons in the major leagues, all for the St. Louis Cardinals in the 1940's. He hit over .300 several times and posted a career Adjusted OPS+ of 125, equal to that of Ron Santo and Bobby Grich. He was a third baseman who appeared in four World Series and five All Star games in his relatively short career.\n\nIn 1945 he was fifth in the league in batting average and also fifth in the MVP voting and second in slugging percentage. In 1947 he was second in the league in OBP. He was once third in the league in doubles, once fourth in the league in RBI and twice fourth in the league in homers. He led the league in hit-by-pitch in 1947.\n\nNone of the most similar players (by the similarity scores method) has as high an Adjusted OPS+ as Kurowski does.\n\nHis minor league playing career ran from 1937 to 1949 with some appearances after that as a player-manager through 1959.\n\nAfter retiring, Kurowski became a minor league manager in the St. Louis Cardinals chain from 1950 to 1962. He also managed the Buffalo Bisons for the New York Mets in 1964, the Cleveland Indians with the Reading Indians in 1965, and for the Washington Senators from 1970 to 1971 with the Denver Bears in 1970 and Burlington Senators in 1970 and 1971. Overall his teams were 983-916 in 15 years.\n\nNotable Achievements [ edit ]\n\n5-time NL All-Star (1943-1947)\n\n20-Home Run Seasons: 3 (1944, 1945 & 1947)\n\n100 RBI Seasons: 2 (1945 & 1947)\n\n100 Runs Scored Seasons: 1 (1947)\n\nWon three World Series with the St. Louis Cardinals (1942, 1944 & 1946)\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nRick Swaine: \"Whitey Kurowski\", in Bill Nowlin, ed.: Van Lingle Mungo: The Man, The Song, The Players, SABR, Phoenix, AZ, 2014, pp. 55-58. ISBN 978-1-933599-76-2"}, {"url": "https://www.baseball-almanac.com/players/player.php?p=kurowwh01", "page_content": "Whitey Kurowski was born on Friday, April 19, 1918, in Reading, Pennsylvania. Kurowski was 23 years old when he broke into the big leagues on September 23, 1941, with the St. Louis Cardinals. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Whitey Kurowski baseball stats page.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that you can compare Whitey Kurowski to other rookies who also had their Major League debut during the 1941 National League season?\n\nYou can follow the team links in the chart above to locate common statistics (singles), advanced statistics (WHIP Ratio & Isolated Power), and unique statistics (plate appearances & times on bases) not found on any other website.\n\nIf you find this type of \"free\" data useful please consider making a donation to Baseball Almanac : a privately run / non-commercial site in need of financial assistance."}, {"url": "https://www.mlb.com/news/best-third-basemen-in-cardinals-history", "page_content": "\n\n\",\"providerName\":\"Twitter\",\"providerUrl\":\"https://twitter.com\",\"type\":\"oembed\",\"width\":550,\"contentType\":\"rich\"},{\"__typename\":\"Markdown\",\"content\":\"_Here is Anne Rogers’ ranking of the top 5 third basemen in Cardinals history. Next week: Shortstop._\n\n\n\n• **Cardinals All-Time Around the Horn Team:** Catchers | First basemen | Second basemen\",\"type\":\"text\"},{\"__typename\":\"Markdown\",\"content\":\"**1.** Ken Boyer **, 1955-65**\n\n_Key fact: 1964 NL MVP Award winner hitting .295 with 100 runs scored, 24 home runs and an MLB-leading 119 RBIs_\n\n\n\nBoyer’s place in Cardinals history is best described by his nickname: \\\"The Captain.\\\" The cornerstone, key contributor and steady presence of the 1960s Cardinals, Boyer accumulated a 58.1 bWAR in 11 seasons with St. Louis, was the starting third baseman on the '64 World Series championship team, winning the National League MVP Award that season. He won all five of his Gold Glove Awards with the Cardinals and is often considered one of the finest gloves ever at third base.\n\n\n\nBoyer was born in Liberty, Mo., and became a high school star in Alba. He signed with the Cardinals in 1949 as a pitcher, but during one game in his second Minor League season, the club's third baseman got injured. Boyer took over at the position, showed his hitting talent and never pitched again. He debuted in '55 and made his first of 11 All-Star teams in '56. He’s the only Cardinal in history to have hit for the cycle twice ('61 and '64). In '58, he hit .307, the first of four consecutive seasons with at least a .300 average.\n\n\n\nIn Game 4 of the 1964 World Series against the Yankees, Boyer hit a sixth-inning grand slam to rally the Cardinals from a 3-0 deficit to a 4-3 win. Boyer and the Cardinals beat the Yankees and their third baseman, Ken’s brother, Clete, in seven games that year.\n\n\n\nBoyer was traded to the Mets in 1965, but he returned to the Cardinals as a coach and Minor League manager in the 1970s, taking over the big league club from '78 until part way through '80. He died of lung cancer at age 51 in '82, and when the Cardinals retired his No. 14 two years later, Boyer became the only non-Hall of Famer to have his number hanging on the left-field wall of Busch Stadium. Fifty-five years after he left the Cardinals, Boyer still ranks third in home runs (255), sixth in RBIs (1,001) and ninth in hits (1,855) in the franchise’s record books.\n\n\n\n\\\"\\\\[Boyer\\\\] wasn't a guy for show, at all,\\\" Mike Shannon, Boyer’s eventual successor at third base, told Rick Hummel of the St. Louis Post-Dispatch in 2009. \\\"He wasn't flashy. Everything he did, he did smooth. He just did the job. And if you look up his stats, those are pretty good stats. He was like the Clydesdale of third basemen. He was a great big, strong guy who had a lot of grace. He was the prototype third baseman.\\\"\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"1964-10-11T07:33:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/mp4/2016/11/02/1210854883/1478109747553/asset_450K.mp4\",\"type\":\"video\",\"description\":\"10/11/64: Ken Boyer's grand slam in the top of the 6th inning gives the Cardinals a 4-3 lead over the Yankees in Game 4 of the World Series\",\"displayAsVideoGif\":false,\"duration\":\"00:00:41\",\"slug\":\"boyer-s-grand-slam-c1210854883\",\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-138\",\"title\":\"HBmig away_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-147\",\"title\":\"HBmig home_team_id: 147\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-111321\",\"title\":\"Ken Boyer\",\"person\":{\"__ref\":\"Person:111321\"},\"type\":\"player\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"GameTag\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-rbi\",\"title\":\"HBmig 2013/03/19/sfnmlb-seamlb-1\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-top-play\",\"title\":\"HBmig MLBCOM_TOP_PLAY\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbmobile-application-highlight\",\"title\":\"HBmig MLBMOBILE_APPLICATION_HIGHLIGHT\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-vtp-1960\",\"title\":\"HBmig 1960s\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"home-run\",\"title\":\"home run\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"classic\",\"title\":\"classic\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"world-series\",\"title\":\"World Series\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"postseason\",\"title\":\"postseason\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"highlight\",\"title\":\"highlight\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/nhs0t08evxif1tecehqs\"},\"title\":\"Boyer's grand slam\",\"relativeSiteUrl\":\"/video/boyer-s-grand-slam-c1210854883\"},{\"__typename\":\"Markdown\",\"content\":\"**2.** Scott Rolen **, 2002-07**\n\n_Key fact: Accumulated 25.9 WAR in five and a half seasons with the Cardinals_\n\n\n\nRolen was part of the backbone of one of the most successful eras in team history, from the juggernaut teams of 2004-05 that won 205 total games to the '06 World Series team. After the Cardinals acquired the slugger and elite defender from the Phillies during the '02 season, Rolen went on to be a four-time Gold Glove Award winner, four-time All-Star, Silver Slugger Award winner alongside a .286/.370/.510 slash line as a Cardinal. He was elected to the Cardinals Hall of Fame last summer and received 35.3 percent of votes cast on this year’s BBWAA Hall of Fame ballot in his third year of eligibility.\n\n\n\nIn 2004, Rolen slashed .314/.409/.598 with 34 home runs and 124 RBIs. He was part of the “MV3” with Albert Pujols and Jim Edmonds that year, when all three finished top five in the NL MVP Award voting. Rolen finished fourth in voting, the highest mark of his 17-year career.\n\n\n\nRolen solidified his place in team history with his pennant-clinching, two-run home run in Game 7 of the 2004 NL Championship Series against the Astros. After Edmonds’ incredible run-saving catch in the second inning to stay within striking distance, Pujols tied the game with a double off seven-time Cy Young winner Roger Clemens in the sixth. One pitch later, Rolen delivered the winning runs off Clemens that sent the Cardinals to their first World Series in 17 years.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"2004-10-22T00:00:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/2013/10/22/mlbtv_housln_31169643_3gpp_128K.3gp\",\"type\":\"video\",\"description\":\"10/21/04: The Cardinals take a 4-2 lead in the bottom of the sixth on Scott Rolen's two-out, two-run home run off of Roger Clemens\",\"displayAsVideoGif\":false,\"duration\":\"00:01:18\",\"slug\":\"rolen-s-go-ahead-two-run-homer-c31169643\",\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbmobile-application-highlight\",\"title\":\"HBmig MLBMOBILE_APPLICATION_HIGHLIGHT\",\"type\":\"unsupported\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-121409\",\"title\":\"Scott Rolen\",\"person\":{\"__ref\":\"Person:121409\"},\"type\":\"player\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-vtp-2000\",\"title\":\"HBmig 2000s\",\"type\":\"unsupported\"},{\"__typename\":\"GameTag\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-embeddable\",\"title\":\"HBmig Blog embeddable\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-no-transcode\",\"title\":\"HBmig MLBCOM_NO_TRANSCODE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-117\",\"title\":\"HBmig away_team_id: 117\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-shareable\",\"title\":\"HBmig FB shareable (internal)\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-top-play\",\"title\":\"HBmig MLBCOM_TOP_PLAY\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-138\",\"title\":\"HBmig home_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"home-run\",\"title\":\"home run\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"classic\",\"title\":\"classic\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"highlight\",\"title\":\"highlight\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/rwedmj2quue3bhqcvbmq\"},\"title\":\"Rolen's clutch Game 7 homer\",\"relativeSiteUrl\":\"/video/rolen-s-go-ahead-two-run-homer-c31169643\"},{\"__typename\":\"Markdown\",\"content\":\"**3.** Matt Carpenter **, 2011-present**\n\n_Key fact: Had one of the best single-game performances in franchise history on July 20, 2018, against the Cubs_\n\n\n\nIn nine years so far with St. Louis, Carpenter has hit .269/.372/.462 and accumulated 28.3 WAR, second only to Boyer among Cards third basemen. Drafted in the 13th round of the 2009 MLB Draft out of Texas Christian University, Carpenter emerged in the Majors as a utility man, playing first, second, third base and the outfield. A three-time All-Star, Carpenter has had three top-15 finishes in NL MVP Award voting, finishing as high as fourth in '13, when he hit .318/.392/.481 and led baseball in runs (126), hits (199) and doubles (55). Carpenter finished ninth in '18 MVP voting after a second-half surge.\n\n\n\nThe peak of that surge in 2018 came in late July at Wrigley Field. Carpenter became the first player in Cardinals history \\\\-\\\\- and only the second in Major League history -- to hit three home runs and two doubles in a game. He started that game by tying Lou Brock’s franchise record with his 21st career leadoff home run, and his 16 total bases that day were a record for a leadoff batter. Carpenter is the 11th player in the past 115 years to tally five extra-base hits in a game (the first Cardinal to do it) and the first to do so from the leadoff spot.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"2018-07-20T18:20:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/mp4/2018/07/21/2288685783/1532134001544/asset_450K.mp4\",\"type\":\"video\",\"description\":\"Matt Carpenter becomes the second player in history to record three homers and two doubles in his seven-RBI performance against the Cubs\",\"displayAsVideoGif\":false,\"duration\":\"00:01:21\",\"slug\":\"carpenter-s-milestone-5-hit-game-c2288685783\",\"tags\":[{\"__typename\":\"GameTag\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-mlbcomwatermark\",\"title\":\"HBmig MLB.com Watermark\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-2018\",\"title\":\"HBmig 2018\",\"type\":\"unsupported\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-embeddable\",\"title\":\"HBmig Blog embeddable\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-mm-hightlight-reel\",\"title\":\"HBmig Highlight Reel\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mlbtax-rbi\",\"title\":\"HBmig 2013/03/19/sfnmlb-seamlb-1\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-138\",\"title\":\"HBmig away_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-mmtax-shareable\",\"title\":\"HBmig FB shareable (internal)\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-112\",\"title\":\"HBmig home_team_id: 112\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-572761\",\"title\":\"Matt Carpenter\",\"person\":{\"__ref\":\"Person:572761\"},\"type\":\"player\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"home-run\",\"title\":\"home run\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"milestone\",\"title\":\"milestone\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/vguvaobflbirujxkziwa\"},\"title\":\"Carpenter's milestone 5-hit game\",\"relativeSiteUrl\":\"/video/carpenter-s-milestone-5-hit-game-c2288685783\"},{\"__typename\":\"Markdown\",\"content\":\"**4.** Whitey Kurowski**, 1941-49**\n\n_Key fact: Three-time World Series champ and five-time All-Star_\n\n\n\nKurowski was integral to a Cardinals dynasty that brought World Series titles to St. Louis in 1942, '44 and '46. Part of the wave of young stars who emerged from the organization’s farm system in the early 1940s, Kurowski had his first full season in '42 with Stan Musial. The two helped drive the Cardinals to an NL pennant and World Series triumph over the Yankees.\n\n\n\nIn the deciding Game 5, Kurowski hit a home run off future Hall of Famer Red Ruffing in the top of the ninth to break the 2-2 tie and win the World Series.\n\n\n\nKurowski -- who played his entire nine-year career with the Cardinals and accumulated a 24.5 WAR -- quickly established himself as one of the finest third basemen in baseball. He’s often underrated because he played during World War II -- he was ineligible for military service -- but he had his best season when players returned in 1947: a .310/.420/.544 slash line with a career-high 27 home runs and 104 RBIs. From '43-47, Kurowski finished among the top 10 in the league in home runs each season, and from '45-47, he finished in the top 10 in batting average, on-base percentage, slugging percentage, total bases and RBIs each season. His 24.5 WAR ranks fourth on the Cardinals’ all-time third basemen list.\",\"type\":\"text\"},{\"__typename\":\"Image\",\"caption\":null,\"contextualCaption\":null,\"contextualAspectRatio\":null,\"credit\":null,\"contentType\":\"Photography\",\"format\":\"jpg\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/cevb5hmxcp76gimze9md\",\"type\":\"image\"},{\"__typename\":\"Markdown\",\"content\":\"**5.** Ken Oberkfell**, 1977-84**\n\n_Key fact: Led the NL in fielding percentage at third base in 1982 (.972) and '83 (.960)_\n\n\n\nOberkfell produced at the plate with such a steady cadence that his average ranged from no lower than .289 to no higher than .303 in the five full seasons he spent with the Cardinals. He walked more than he struck out, and his defense was solid, too, sharing the infield with Ozzie Smith, Tom Herr and Keith Hernandez. Oberkfell was often criticized for not having power -- he only hit 11 home runs over eight years in St. Louis -- but his contact-oriented approach fit right in with the philosophy of the 1980s Cardinals and manager Whitey Herzog.\n\n\n\nOberkfell hit .292 in the 1982 World Series, which the Cardinals won over Milwaukee in a thrilling seven-game series. He accumulated a 17.1 WAR in St. Louis, ranking fifth among third basemen on the Cardinals' all-time list.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"1982-10-09T20:05:00Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/2013/06/25/mlbtv_atlsln_28325111_300K.mp4\",\"type\":\"video\",\"description\":\"10/9/82: Ken Oberkfell's single in the bottom of the ninth gives the Cardinals a 4-3 win over the Braves in Game 2 of the NLCS\",\"displayAsVideoGif\":false,\"duration\":\"00:01:52\",\"slug\":\"oberkfell-s-walk-off-single-c28325111\",\"tags\":[{\"__typename\":\"PersonTag\",\"slug\":\"playerid-119884\",\"title\":\"Ken Oberkfell\",\"person\":{\"__ref\":\"Person:119884\"},\"type\":\"player\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-home-team-id-138\",\"title\":\"HBmig home_team_id: 138\",\"type\":\"unsupported\"},{\"__typename\":\"GameTag\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-team-id-138\",\"title\":\"HBmig 138\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-away-team-id-144\",\"title\":\"HBmig away_team_id: 144\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"classic\",\"title\":\"classic\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"walk-off\",\"title\":\"walk off\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"hitting\",\"title\":\"hitting\",\"type\":\"taxonomy\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"highlight\",\"title\":\"highlight\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/y7ekpfproyei3quaoikf\"},\"title\":\"Oberkfell's walk-off single\",\"relativeSiteUrl\":\"/video/oberkfell-s-walk-off-single-c28325111\"},{\"__typename\":\"Markdown\",\"content\":\"**Honorable mentions**\n\n• With Boyer manning third, Mike Shannon arrived in the Majors as an outfielder in his first full season in 1964 and was a rookie sparkplug for the team, with 43 RBIs and nine home runs in 88 games. He homered off Yankees great Whitey Ford in the World Series to help the Cardinals to victory. Later becoming the starting third baseman, Shannon, a native of St. Louis and local high school star, started every game in the three World Series he played, and he homered in each series.\n\n\n\n• Terry Pendleton succeeded Oberkfell at third base in 1984 and finished seventh in Rookie of the Year Award voting that year. He was on the '85 and '87 NL pennant-winning teams, and he hit .259/.308/.356 and won two Gold Glove Awards in his seven seasons with the Cardinals.\n\n\n\n• No list would be complete without October hero David Freese . After all, Game 6 of the 2011 World Series is simply referred to as, “The David Freese Game” after he hit the game-tying triple in the bottom of the ninth and the walk-off home run in the 11th against the Rangers. He was the NLCS and World Series MVP, and in five years with his hometown Cardinals, Freese hit .286/.356/.427 and made one All-Star team.\",\"type\":\"text\"}],\"contentType\":\"news\",\"subHeadline\":null,\"summary\":\"No one loves a good debate quite like baseball fans, and with that in mind, we asked each of our beat reporters to rank the top five players by position in the history of their franchise, based on their career while playing for that club. These rankings are for fun\",\"tagline({\\\"formatString\\\":\\\"none\\\"})\":null,\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"season-2020\",\"title\":\"Season 2020\",\"type\":\"season\"},{\"__typename\":\"InternalTag\",\"slug\":\"storytype-article\",\"title\":\"Article\",\"type\":\"article\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-138\",\"title\":\"St. Louis Cardinals\",\"team\":{\"__ref\":\"Team:138\"},\"type\":\"team\"},{\"__typename\":\"ContributorTag\",\"slug\":\"anne-rogers\",\"title\":\"Anne Rogers\",\"type\":\"contributor\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-111321\",\"title\":\"Ken Boyer\",\"person\":{\"__ref\":\"Person:111321\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-121409\",\"title\":\"Scott Rolen\",\"person\":{\"__ref\":\"Person:121409\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-572761\",\"title\":\"Matt Carpenter\",\"person\":{\"__ref\":\"Person:572761\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-117369\",\"title\":\"Whitey Kurowski\",\"person\":{\"__ref\":\"Person:117369\"},\"type\":\"player\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-119884\",\"title\":\"Ken Oberkfell\",\"person\":{\"__ref\":\"Person:119884\"},\"type\":\"player\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"evergreen\",\"title\":\"evergreen\",\"type\":\"taxonomy\"}],\"type\":\"story\",\"thumbnail\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/shtmj17jc37ppnuvy45m\",\"title\":\"Best third basemen in Cardinals history\"}},\"Person:111321\":{\"__typename\":\"Person\",\"id\":111321},\"Team:138\":{\"__typename\":\"Team\",\"id\":138},\"Person:121409\":{\"__typename\":\"Person\",\"id\":121409},\"Person:572761\":{\"__typename\":\"Person\",\"id\":572761},\"Person:119884\":{\"__typename\":\"Person\",\"id\":119884},\"Person:117369\":{\"__typename\":\"Person\",\"id\":117369}}} window.adobeAnalytics = {\"reportingSuiteId\":\"mlbglobal08,mlbcom08\",\"linkInternalFilters\":\"mlb\"} window.globalState = {\"tracking_title\":\"Major League Baseball\",\"lang\":\"en\"} window.appId = '' /*-->*/"}, {"url": "https://section215.com/2020/07/26/philadelphia-phillies-trade-schilling/", "page_content": "Twenty years ago today, the Philadelphia Phillies dealt ace Curt Schilling for a return package that underwhelmed.\n\nWhen you tell the tale of the 2000 Philadelphia Phillies like I’ve been doing for months now, you come across some seminal moments, ranging from Pat Burrell’s MLB debut to Terry Francona finally being fired. But one transaction they made during the season stands out as altering the landscape of the franchise: the trade of pitcher Curt Schilling to the Arizona Diamondbacks on July 26, 2000.\n\nClearly, Schilling’s fate was sealed in Philadelphia. The team had to trade him for the best possible package, something that was easier said than done because Schilling was limiting the places to which he’d agree to be traded. So even though I don’t have fond memories of GM Ed Wade, I can’t exactly put all of the blame on him for what transpired. Still…\n\nTo refresh your memory, the Phillies received pitchers Omar Daal, Nelson Figueroa, and Vicente Padilla, along with first baseman Travis Lee in exchange for their ace. They were not going to get “equal value” from Arizona in any way, shape, or form, but the hope was that a couple of the players would turn into serviceable pieces for a rebuilding club like the Phillies. Let’s see how that worked out.\n\nOmar Daal had won 16 games for the D-Backs in 1999 but had struggled mightily in 2000, posting a 2-10 record with a 7.22 ERA at the time of the trade. He actually pitched halfway decently for the Phils once he came over, but that didn’t stop him from racking up the losses since the team was so bad. From August 13 through September 16, he lost seven straight STARTS, not just decisions, which is extremely difficult to do. What makes it even sadder is that the last five of them were actually quality starts (6+ innings pitched with 3 earned runs or less). That put Daal at 19 losses with two more starts left to go in the season.\n\nThere was big-time drama over whether or not he would become the majors’ first 20-game loser in two decades, but he didn’t get there. He actually could have pitched again on the season’s final day, but the Phillies didn’t want to take any chances at embarrassing the guy, so they sat him. He’d follow that up with a surprisingly good 2001, going 13-7 with a 4.46 ERA, after which he was traded to the Dodgers.\n\nAs for Nelson Figueroa, he seemed like the proverbial “throw-in” of the trade, having just three games of major league experience under his belt. He wouldn’t debut for the Phils until 2001, and he actually pitched quite well, going 4-5 with a 3.94 ERA in 19 games (13 starts) for the club. But the Phillies decided not to roster him at the start of the 2002 season, and he was lost to waivers. He would randomly resurface with the Phillies for a few months in 2010, which nobody remembers.\n\nWe’ll skip to Travis Lee, the only position player in the trade, next. Lee had a nice start to his MLB career in 1998, finishing third in NL Rookie of the Year voting (well behind Kerry Wood and Todd Helton). After a step back in 1999, he was plodding along again in 2000 at the time of the trade. Once he came to the Phils, he would stick through the 2002 season. He played a slick first base, but the bat never really materialized. In 366 games, he batted .258 with just 34 home runs and 174 RBI. The Phillies would slightly upgrade their offense at first base when they let him leave and signed Jim Thome.\n\nFinally, the “crown jewel” of the Schilling trade, Vicente Padilla. Just 22 at the time of the trade (even though he looked 50 already), Padilla seemed like he had the raw talent to develop into a good starter. The Phillies played it slow with him, though, giving him 28 games out of the bullpen over the rest of 2000, followed by 23 games in 2001.\n\nHe did get some good time in the rotation at AAA that year, however, and so the decision was made to plug him in as a starter for the Phillies in 2002. He did not disappoint, delivering an all-star campaign, and it was at that All-Star Game that Padilla became an interesting footnote of baseball history. He was not expected to pitch in the game, being withheld just in case it went long. And that’s exactly what happened, with the contest going to extra innings.\n\nPadilla pitched the 10th and 11th innings, and he even got an at bat. (Why did we ever let pitchers hit in All-Star Games?) At any rate, Padilla was unable to take the mound for a third inning, forcing the game to end in a tie since he was the last pitcher for the National League. You can hardly blame the guy, and it was definitely in the Phillies’ best interest to not have their pitcher risk injury in an exhibition, but it was still embarrassing.\n\nPadilla was good again for the Phils in 2003, but he struggled for much of 2004 and 2005 before he was shipped out to Texas that offseason as the last remnant of the Curt Schilling trade. As for Schilling himself, he’d pitch seven more seasons, including THREE seasons of 20-plus wins for Arizona and Boston. He also collected three World Series rings and cemented himself as one of the most clutch pitchers in major league history. Despite all this, Schilling remains outside the Hall of Fame for now, which can only be attributed to his personality and all of the enemies he’s made because the guy was clearly an amazing player.\n\nThe Phillies and their fans were treated to nine years of Schilling, an era that ended 20 years ago today. He was one of the greatest pitchers in franchise history, which is why it’s such a shame that he couldn’t be part of a World Series winner here and that the organization could only get pennies on the dollar for him when they ultimately parted ways.\n\nThe return for Schilling wasn’t as bad as you probably remember it being, it just seems worse because of all of the success that he had after he left. But Schilling wasn’t going to be in Philly for long, as he clearly wanted out, so the team just had to take what they could get. Maybe that’s why he’s not remembered all too fondly around here, despite what he did in a Philadelphia Phillies uniform."}, {"url": "https://www.espn.com/mlb/story/_/id/35399985/phillies-acquire-reliever-gregory-soto-infielder-kody-clemens-tigers", "page_content": "The Philadelphia Phillies have acquired hard-throwing lefty reliever Gregory Soto and infielder Kody Clemens from the Detroit Tigers, the team announced Saturday.\n\nIn return, Detroit received infielder Nick Maton, outfielder Matt Vierling and catcher Donny Sands.\n\nSoto, 27, was an All-Star the past two seasons, including 2022, when he went 2-11 for the fourth-place Tigers. Despite that record, he had a respectable 3.28 ERA, although his command has been an issue the past couple of seasons. He walked 34 batters in 60⅓ innings last season while producing a career-high 14.5% walk percentage in 2021.\n\nSoto joins an evolving, formidable bullpen in Philadelphia. The Phillies also added veteran Craig Kimbrel to the mix this offseason, and holdovers Seranthony Dominguez and Jose Alvarado helped the organization to the World Series last year.\n\nClemens, 26, is a son of former pitching great Roger Clemens. He made his debut in 2022. The Tigers received a couple of players in Vierling and Maton who also helped the Phillies in their march to the Fall Classic last year. Sands spent the majority of 2022 in Triple-A."}, {"url": "https://mlb.nbcsports.com/2020/06/02/this-day-in-transaction-history-phillies-acquire-john-kruk-from-padres/", "page_content": "John Kruk is one of the more underrated hitters in baseball history. Kruk, who is currently a broadcaster for the Phillies, had a 10-year career during which he hit exactly 100 homers, batted exactly .300, and posted an excellent .397 on-base percentage. In baseball history, there are only 32 members of the admittedly arbitrary 100/.300/.395+ club. Kruk is one of only 10 members of the club that played after 1963. The others: Mike Trout, Joey Votto, Todd Helton, Chipper Jones, Manny Ramírez, Frank Thomas, Larry Walker, Edgar Martinez, and Wade Boggs. Of them, five are Hall of Famers. Trout and Votto will be, and Helton and Ramírez should be.\n\nOn this day in 1989, the Phillies made a franchise-altering trade, acquiring Kruk along with infielder Randy Ready from the Padres in exchange for outfielder Chris James. The Padres had just swept the Phillies at home and were hoping to jump into the playoff race. They immediately went into a losing skid, but caught fire at the end of the season, finishing 89-73. However, that wasn’t good enough as the Giants won the NL West with a 92-70 record. James was solid for the Padres, posting a .743 OPS with 11 homers and 46 RBI in 87 games.\n\nKruk had an interesting but brief major league career with the Padres. His roommate, Roy Plummer, was an armed robber. Kruk was completely unaware of this. In spring training of 1988, the FBI informed Kruk of his roommates’ activities. Kruk feared retribution from Plummer and said that the anxiety affected his baseball performance. In 1988, Kruk batted what was for him a poor .241/.369/.362 with nine homers and 44 RBI over 466 plate appearances.\n\nThe Phillies didn’t enjoy immediate success upon Kruk’s arrival in 1989. The club finished the season with a losing record and would do the same in the ensuing three seasons. None of it was Kruk’s fault, though: in aggregate, from 1990-92, he hit .303/.393/.459, earning two All-Star nominations. In this span of time, the only other first basemen to hit above .300 were Frank Thomas, Paul Molitor, Hal Morris, and Rafael Palmeiro. The Padres had used Kruk both in the corner outfield and at first base, but the Phillies made him a full-time first baseman, which turned out to be a good move.\n\nIn 1993, everything came together for the Phillies and Kruk had what was arguably the greatest season of his career. He hit .316, which was actually seven points below his average the previous year, but he drew 111 walks to push his on-base percentage up to .430. Kruk hit third in the lineup, creating plenty of RBI opportunities for Dave Hollins in the clean-up spot, Darren Daulton at No. 5, and the trio of Jim Eisenreich, Pete Incaviglia, and Wes Chamberlain in the No. 6 spot. The Phillies shocked the world in ’93, winning the NL East by three games over the Expos with a 97-65 record. They then dispatched the Braves in six games in the NLCS to advance to the World Series against the Blue Jays.\n\nKruk was productive in the NLCS, contributing six hits including a pair of doubles, a triple, a home run, four walks, five RBI, and four runs scored. But he turned things up a notch in the World Series, registering multi-hit performances in the first three games. He would finish the World Series with eight hits in 23 at-bats along with seven walks, four RBI, and four runs scored. The World Series was winnable for the Phillies as they lost a barnburner Game 4 15-14, and of course, dropped the deciding Game 6 on a World Series-clinching walk-off three-run home run by Joe Carter off of Mitch Williams.\n\n1994 was tough on Kruk in many ways. He was diagnosed with testicular cancer in spring training. Knee issues continued to bother him, and then Major League Baseball had a work stoppage. In an abbreviated season, Kruk hit a still-productive .823 OPS. He became a free agent and, when baseball came back, he signed with the White Sox. In the first inning of a July 30 game against the Orioles in ’95, Kruk singled to left field off of Scott Erickson. He reached first base, bowed to the fans, and walked off the field into retirement. Kruk told the media, “The desire to compete at this level is gone. When that happens, it’s time to go.”\n\nKruk has spent his post-playing days working in sports media as both a broadcaster (Phillies, ESPN nationally) and as a commentator (The Best Damn Sports Show Period, Baseball Tonight). The Phillies inducted him into their Wall of Fame in August 2011. One wonders if Kruk hadn’t been bit by the injury bug, and if there hadn’t been a work stoppage, if he might have been able to accrue some more numbers to have a borderline Hall of Fame case. Regardless, he’ll go down as one of the games’ quietly great hitters.\n\nFollow @Baer_Bill"}], "Whitey Kurowski played two seasons in Philadelphia Phillies.": [{"url": "https://www.baseball-reference.com/players/k/kurowwh01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Whitey Kurowski born?\n\nWhitey Kurowski was born on April 19, 1918.\n\nWhere was Whitey Kurowski born?\n\nWhitey Kurowski was born in Reading, PA.\n\nHow tall was Whitey Kurowski?\n\nWhitey Kurowski was 5-11 (180 cm) tall.\n\nHow much did Whitey Kurowski weigh when playing?\n\nWhitey Kurowski weighed 193 lbs (87 kg) when playing.\n\nHow many seasons did Whitey Kurowski play?\n\nWhitey Kurowski played 9 seasons.\n\nIs Whitey Kurowski in the Hall of Fame?\n\nWhitey Kurowski has not been elected into the Hall of Fame.\n\nWhat position did Whitey Kurowski play?\n\nWhitey Kurowski was a Third Baseman.\n\nHow many hits did Whitey Kurowski have?\n\nWhitey Kurowski had 925 hits over his career.\n\nHow many home runs did Whitey Kurowski have?\n\nWhitey Kurowski had 106 home runs over his career.\n\nWhat was Whitey Kurowski's average?\n\nWhitey Kurowski had a .286 average over his career.\n\nHow many teams has Whitey Kurowski played for?\n\nWhitey Kurowski played for 1 team, the St. Louis Cardinals.\n\nHow many World Series has Whitey Kurowski won?\n\nWhitey Kurowski won 3 World Series.\n\nWhen did Whitey Kurowski retire?\n\nWhitey Kurowski last played in 1949."}, {"url": "https://www.baseball-reference.com/bullpen/Whitey_Kurowski", "page_content": "George John Kurowski\n\nBR page\n\nBiographical Information [ edit ]\n\nWhitey Kurowski played nine seasons in the major leagues, all for the St. Louis Cardinals in the 1940's. He hit over .300 several times and posted a career Adjusted OPS+ of 125, equal to that of Ron Santo and Bobby Grich. He was a third baseman who appeared in four World Series and five All Star games in his relatively short career.\n\nIn 1945 he was fifth in the league in batting average and also fifth in the MVP voting and second in slugging percentage. In 1947 he was second in the league in OBP. He was once third in the league in doubles, once fourth in the league in RBI and twice fourth in the league in homers. He led the league in hit-by-pitch in 1947.\n\nNone of the most similar players (by the similarity scores method) has as high an Adjusted OPS+ as Kurowski does.\n\nHis minor league playing career ran from 1937 to 1949 with some appearances after that as a player-manager through 1959.\n\nAfter retiring, Kurowski became a minor league manager in the St. Louis Cardinals chain from 1950 to 1962. He also managed the Buffalo Bisons for the New York Mets in 1964, the Cleveland Indians with the Reading Indians in 1965, and for the Washington Senators from 1970 to 1971 with the Denver Bears in 1970 and Burlington Senators in 1970 and 1971. Overall his teams were 983-916 in 15 years.\n\nNotable Achievements [ edit ]\n\n5-time NL All-Star (1943-1947)\n\n20-Home Run Seasons: 3 (1944, 1945 & 1947)\n\n100 RBI Seasons: 2 (1945 & 1947)\n\n100 Runs Scored Seasons: 1 (1947)\n\nWon three World Series with the St. Louis Cardinals (1942, 1944 & 1946)\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nRick Swaine: \"Whitey Kurowski\", in Bill Nowlin, ed.: Van Lingle Mungo: The Man, The Song, The Players, SABR, Phoenix, AZ, 2014, pp. 55-58. ISBN 978-1-933599-76-2"}, {"url": "https://www.statscrew.com/minorbaseball/stats/p-2c2e4e20", "page_content": "Whitey Kurowski\n\nGeorge John Kurowski\n\nBorn: April 19, 1918\n\nReading, PA US\n\nDeceased: December 9, 1999\n\nSinking Spring, PA US\n\nPrimary Position: Third base\n\nAll Position(s) Played: 2B\n\nBats: Right\n\nThrows: Right\n\nHeight: 5'11\"\n\nWeight: 193\n\nCareer: 1937-1959\n\nMajor League Statistics\n\n\n\nWhitey Kurowski compiled a career batting average of .313 with 59 home runs and 94 RBI in his 714-game career with the Caruthersville Pilots, Portsmouth Red Birds, Rochester Red Wings, Columbus Senators, Houston Buffalos, Lynchburg Cardinals, Allentown Cardinals, Peoria Chiefs and Billings Mustangs. He began playing during the 1937 season and last took the field during the 1959 campaign.\n\nClick on column headings to sort.\n\nBatting:\n\nFielding:\n\nMinor League Service:"}, {"url": "https://www.findagrave.com/memorial/8391/george-john-kurowski", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.historyofcardinals.com/whitey-kurowski/", "page_content": "Whitey Kurowski, known for his white hair, debuted with the St. Louis Cardinals on Sept. 22, 1941 and played for eight seasons before an elbow problem curtailed his career in 1949.\n\nHis best season was likely in 1947 when he batted .310 and swatted 27 home runs, scored 108 runs, knocked in 104 RBI’s, which included 27 doubles and a .544 SLG%.\n\nHe was a 5-time All Star (1943-1947) that finished with .286 average and 106 home runs and 529 runs batted in while playing 916 games. He was a key part in 3 World Championships (1942, 1944, 1946) with the Cardinals.\n\nSABR article\n\nIn four World Series appearances, Kurowski hit .253 (21-for-83) with one home run and nine RBI in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only home run in the Series, in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for St. Louis over the New York Yankees. He also appeared five times in the MVP ballot, in 1942 and from 1944 through 1947."}, {"url": "https://prabook.com/web/whitey.kurowski/2303081", "page_content": "Whitey Kurowski\n\nbaseball player\n\nApril 19, 1918 (age 81)\n\nKurowski batted and threw right-handed. He debuted on September 23, 1941, and played his final game on October 1, 1949. In a nine-season career, Kurowski posted a.286 batting average with 106 home runs and 529 Reserve Bank of India in 916 games played. Kurowski\"s childhood nickname came from his already white hair. A native of Reading, Pennsylvania, Kurowski overcame several personal problems. Kurowski overcame childhood osteomyelitis, which made him miss a part of a bone on his right forearm. His most productive season came in 1947, when he posted career-highs in average (310), home runs (27), Reserve Bank of India (104), runs (108), doubles (27), slugging % (544) and on-base % (420). An All-Star during five consecutive seasons (1943-1947), Kurowski exceeded the 20 home run mark three times to set a major league record for a third baseman (1944-1945, 1947), and hit over.300 three times (1945-1947). He also led the National League three times in putouts, twice in fielding %, and once in double plays. In four World Series appearances, Kurowski hit.253 (21-for-83) with one home run and nine Reserve Bank of India in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only home run in the Series, in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for Saint Louis over the New York Yankees. He also appeared five times in the Most Valuable Player ballot, in 1942 and from 1944 through 1947. In 1949, Kurowski developed arm and elbow problems and his playing career ended. After that, he coached and managed in the minor leagues for 18 years until 1972. He gained induction into the National Polish-American Hall of Fame in 1988. In an article in 1976 in Esquire magazine, sportswriter Harry Stein published an \"All Time All-Star Argument Starter,\" consisting of five ethnic baseball teams. Kurowski was the third baseman on Stein\"s Polish team Kurowski died in Sinking Spring, Pennsylvania, at age 81."}, {"url": "https://www.nytimes.com/1999/12/13/sports/whitey-kurowski-81-dies-beat-yankees-in-world-series.html", "page_content": "Whitey Kurowski, who surmounted a severe arm injury as a youngster and became one of the major leagues' top third basemen of the 1940's and a World Series hero for the St. Louis Cardinals, died last Thursday at a physical rehabilitation center in Shillington, Pa. He was 81.\n\nKurowski, who lived in Shillington, had been in failing health since suffering a stroke after heart bypass surgery in July, according to his wife, Joan.\n\nOn the afternoon of Oct. 5, 1942, a remarkable stretch of World Series success for the Yankees came to an end with one swing by a rookie infielder. George (Whitey) Kurowski's two-run home run off Red Ruffing into the left-field stands at Yankee Stadium in the ninth inning of Game 5 propelled the Cardinals to a 4-2 victory and a Series title, the first time the Yankees had been beaten in nine trips to the Series since they were defeated by the Cards in 1926.\n\nThat Kurowski was even in a major league uniform defied the odds. When he was growing up in Reading, Pa., he fell off a fence and landed in broken glass, severely cutting his right arm. Two years later, he began suffering severe pain and was found to have developed osteomyelitis, a bone inflammation. Three inches of bone above his wrist were surgically removed, leaving the arm weakened and with an unnatural bend. He strengthened his arm muscles as he embarked on a baseball career, but his right arm, his throwing arm, had become shorter than his left."}, {"url": "https://baseballroundtable.com/baseball-roundtables-all-polish-american-team/", "page_content": "by\n\nIf are Milwaukee-born (particularly into the Karpinski family), you are very likely to be a baseball fan and proud of your Polish heritage. (I learned a great deal about both from my Aunt Irene.) With that in mind, this post will be dedicated to my personally selected Polish-American MLB All Star squad – one player at each position in the field, two starting pitchers (a lefty and a righty) and two relievers (again, a right-hander and a southpaw).\n\nThe team I came up with looks pretty competitive. The twelve players played a combined 204 major leagues seasons (none fewer than nine). The lineup includes six MLB Hall of Famers. Together, this dozen major leaguers garnered 79 All Star selections, 24 Gold Gloves and 12 batting titles. They also can point to four Most Valuable Player Awards and one Triple Crown. In addition, eleven of the twelve have been inducted into the National Polish-American Sports Hall of Fame in Orchard Lake Village, Michigan.\n\nNote: For a look at an All Star squad picked on the basis of the ability to handle Nolan Ryan’s heat, click here.\n\nWe’ll go through the All Star Squad first, but there are a couple of special mentions (detailed at the end of the post): 1) Moe Drabowsky – The best-ever major leaguer actually born in Poland; and Art “Pinky” Deras – the Polish-American youngster acknowledged as the Best Little League Player Ever (there’s even a documentary about him). So, let’s get to it.\n\n—–THE BASEBALL ROUNDTABLE POLISH-AMERICAN ALL STAR TEAM—–\n\nCatcher – A.J. Pierzynski\n\nI’ve got a special spot in my heart for the catcher on my All Polish-American squad – a hard-nosed player who started his MLB career with my Minnesota Twins. A.J. Pierzynski was a consistent and quality performer who always came to win\n\n_______________________________________\n\nIf you played against him, you hated him. If you played with him, you hated him a little less …. He’s worth the work because he always shows up for you.”\n\nOzzie Guillen, Manager, Chicago White Sox\n\n__________________________________\n\nPierzynski, signed by the Twins out of high school in 1994, made his MLB debut with Minnesota (as a 21-year-old) in 1998. The 6’3”/250-pound, left-handed hitter (right-handed thrower) played in 19 MLB seasons – for the Twins (1998-2003); Giants (2004); White Sox (2005-2012); Rangers (2013); Red Sox (2014); Cardinals (2014); and Braves (2015-16).\n\nPierzynski was a two-time All Star. He collected 2,043 hits in 2,059 games (for a .280 career average), hit 188 home runs and drove in 909. His best season came with the Twins in 2003, when he hit .312, with 11 home runs and 74 RBI (although he did hit a career-high 27 home runs for the White Sox in 2012). He ranks eighth all time in games played at catcher. He holds the AL record for most consecutive games (by a catcher) in a season without an error at 117 in 2005 (tied with Buddy Rosar, Athletics, 1946). Pierzynski was about as steady at the plate as you can get. For his career, he hit .280:\n\n.283 at home – .277 on the road\n\n.282 in the first-half of the season; .278 in the second half.\n\n.287 with runners on base; .287 with runners in scoring position; .275 with the bases empty.\n\n______________________________________________________\n\nFirst Base – Ted Kluszewski\n\nTed “Big Klu” Kluszewski was a rare breed – a true power hitter who also practiced exceptional plate discipline. In 1954, for example, Kluszewski hit .326, with 49 home runs and 141 RBI – a season made even more remarkable by the fact he struck out only 35 times (versus 78 walks). I doubt if we’ll ever see another player top 40 home runs without reaching 40 whiffs. Kluszewski, in fact, had a streak of four seasons (1953-56) when he hit over .300, drove in 100+ runs, bashed 35+ home runs – and struck out no more than 40 times in any season. In those four seasons, Kluszewski hit 171 home runs – and fanned 140 times (average 43 HR’s and 35 whiffs a season). It should also be noted that Kluszewski led NL first baseman in fielding percentage every year from 1951 through 1955. Unfortunately, a back injury in 1956 hampered his performance in the later years of his career (he played until 1961). He played for the Reds (1947-1957); Pirates (1958-59); White Sox (1959-60); and Angels (1961).\n\nKluszewski – a big man for his time at 6’2”/225-pounds – is also noted for adding a bit of flair to the game, making his own intimidating fashion statement. Big Klu complained that his uniform jersey was too tight for his large and powerful biceps. He went on to have the sleeves cut from his jersey – exposing his bare arms from the shoulder. (This was considered a bold move at that very conforming time in the game’s history.)\n\nKluszewski only appeared in one post-season – hitting .391, with three homers and ten RBI in the 1958 World Series (for the White Sox). True to his form – Big Klu did not strike out even once (25 plate appearance) in the Series.\n\nBig Klu was an Angel Taken by the Angels in the 1960 expansion draft, Kluszewski hit the first-ever home run for the expansion team (a two-run shot in the first inning of the Angels’ first game – April 11 versus the Orioles). He added a punctuation mark, by hitting the Angels’ second–ever home run (a three-run shot) the very next inning. The Angels won 7-2 and, of course, Kluszewski did not strikeout.\n\nThe big left-hander hit .298 over his 15-season MLB career, with 279 home runs and 1,028 RBI. The four-time All Star topped .300 in seven seasons, drove in 100+ runs in four seasons and hit 40 or more long balls in three campaigns. His best season was 1954, when he hit .326-49-141. Ultimately, however, Big Klu is best remembered for those sleeveless jerseys, muscular arms and exceptional bat control.\n\n_________________________________________\n\nSecond Base – Bill Mazeroski\n\nConsidered the best fielding second baseman of all time by many, Bill Mazeroski was inducted into the Baseball Hall of Fame in 2001.He played 17 MLB seasons – all with the Pirates – hitting .260, with 138 home runs and 853 RBI. It was, however, his glove the earned him a spot on this squad. “Maz” was a seven-time All Star and an eight-time Gold Glover at the keystone sack. He led NL second baseman in assists nine times, putouts five times and double plays turned eight times. (He is the all-time career leader in double plays by a second baseman, fifth in assists, seventh in puts and tenth in games played at the two-bag. The 5’11”/183-pound right-hander’s best season at the plate was probably 1962, when he hit .271, with 14 home runs and 81 RBI.\n\nBill Mazeroski is best remembered for two things – his unmatched skill at turning the double play and his walk-off home run in the bottom of the ninth inning of Game Seven of the 1960 World Series – which gave the Pirates a 10-9 win and an unlikely World Championship. In the Series, the Yankees outhit the Pirates .338 to .256, out-homered the Pirates 10 to four and outscored Pittsburgh 55 to 27. Mazeroski hit .320 in the seven-game set, smacked two of the Pirates’ four home runs and drove in five tallies. Bobby Richardson of the losing Yankees hit .367 and drove in 12 runs to win the Series MVP Award – still the only player on a losing team to take home the World Series MVP Trophy.\n\n____________________________________________________\n\nThird Base – George Kurowksi\n\nGeorge “Whitey” Kurowski played in nine MLB seasons (1941-49), all for the Cardinals. In the six seasons that he played at least 100 games, he was an All Star four times. In the three seasons from 1945 to 1947, Kurowski hit .311, with 62 home runs and 295 RBI. For his career, he hit .286 (in 916 games), with 106 home runs and 529 RBI. He led NL third baseman in putouts in three seasons, as well as in assists and doubles plays once each. He finished in the top ten in home runs in the league five times, RBI four times and batting average three times. His best season was 1947, when he hit .310, with 27 home runs, 104 RBI and 108 runs scored.\n\nWhitey Kurowski had to overcome the effects of a childhood injury and osteomyelitis in his right (throwing) arm in his quest to reach the major leagues. The surgery required to save his arm left his right wing about three inches inches shorter than his left. His determination is reflected in the fact that he made the major leagues as a third basemen – a position the demands a strong throwing arm. Arm problems most likely shortened his career. (The Society for American baseball Research reports Kurowski “underwent 13 operations on the arm so he could continue playing.)\n\n_________________________________________________\n\nShortstop – Alan Trammell\n\nThe shortstop selection for this team – Alan Trammell – was inducted into the Baseball Hall of Fame in 2019. The 6’/165-pound Trammell (a right-hander) was a Tigers’ second round draft pick right out of high school in 1976. He made his MLB debut in September of 1977 and went on to play 20 MLB seasons – all for the Tigers.\n\nTrammell was a six-time All Star and a four-time Gold Glover. Over his career, he collected 2,365 hits (.285 average), with 185 home runs, 1,003 RBI, 1,231 runs scored and 236 stolen bases. He hit over .300 seven times (a high of .343 in 1987), hit 20 or more home runs twice, scored 100+ runs in three seasons and stole 20 or more bases three times. His best season was 1987, when Trammell hit .343, collected 205 hits, knocked 28 home runs, drove in 105 and scored 109.\n\nAllen Trammell (SS) and Lou Whitaker (2B) played together for 19 seasons – MLB’s longest every SS-2B teammates run.\n\n______________________________________________________________\n\nHonorable Mention at Shortstop – Troy Tulowitzki Troy Trevor Tulowitzki earns honorable mention here with his glove (a two-time gold Glover) and bat (topping 20 home runs in seven of 12 MLB seasons). Still active, “Tulo” may someday take Alan Trammell’s spot in this lineup. Tulowitzki has played for the Rockies (2006-2015) and Blue Jays (2016-17). He missed the 2018 season (ankle surgery) and signed with the Yankees for 2019. Tulowitzki is a five-time All Star, whose best season was 2014, when he hit .340 with 30 home runs and 105 RBI for the Rockies. For his career, he is .290 (in 1,286 games), with 224 home runs and 779 RBI. His numbers would be even stronger if not for the injury bug. His past injuries include: a torn left quadriceps, fractured wrist, groin surgery, fractured rib, hip surgery, cracked shoulder blade. Troy Tulowitzki … Rare Feats Troy Tulowitzki is one of only two players to both hit for the cycle and turn an unassisted triple play (the other is John Valentin).\n\n____________________________________________________\n\nOutfield – Stan Musial\n\nYou can’t go wrong with Stan “The Man” Musial on your team. One of the greatest players in MLB history (inducted into the Hall of Fame in 1960), Musial played 22 MLB seasons (all for the Cardinals) between 1941 and 1963 (he missed 1945 to military service).\n\nMusial was an All Star in 20 of his 22 seasons and a three-time NL Most Valuable Player. He won seven batting titles and led the NL in hits six times, runs scored five times, RBI two times, doubles eight times and triples five times. He also topped the NL in total bases, on base percentage and slugging percentage six times each.\n\nStan Musial hit .347 in 1944 – missed the 1945 season due to military service – and came back to hit .365 in 1946.\n\nMusial hit over .300 in 17 full seasons and over .350 in five campaigns (a high of .376 in 1948). He topped 20 home runs ten times, with a high of 39 in 1948. He also hit 50 or more doubles twice, 20 triples twice, had 200 or more hits in six seasons, 100+ RBI in ten seasons and 100+ runs scored in 11. For his career, Musial had 3,630 hits (.331 average), 475 home runs and 1,951 RBI. and 1,949 runs scored. He is in MLB’s top ten all time in games played, hits, runs scored, runs batted in, doubles and total bases.\n\nHow good was Stan Musial? He was good enough to take your breath away. Vin Scully\n\n_____________________________________________\n\nOutfield – Al Simmons (Szymanski)\n\nAl Simmons is the second Hall of Famer in our Polish-American All Star outfield – and he put up Musial-like numbers (Musial-lite?). However, Simmons did not enjoy as notable a nickname as “Stan the Man.” Due to his unusual batting style (front foot pointed toward third base), he became known as “Bucketfoot Al.” (Note: It’s reported Simmons went with Simmons over Szymanski because of the difficulty people had pronouncing Szymanski.)\n\nSimmons played 20 MLB seasons (1924-41, 1943-44) and ended just 73 hits shy of 3,000 – with a .334 career average and 307 home runs. Simmons played for the Athletics (1924-32, 1940-41, 1944), White Sox (1933-35); Tigers (1936), Senators (1937-38), Braves (1939), Reds (1939) Red Sox 1943)\n\nSimmons was a two-time batting champ, who hit over .300 in 13 seasons – and over .380 in four campaigns. The 5’11”/190-pound righty also led his league in hits twice, and had 200 or more hits six times. In addition, he led his league in runs scored once, and RBI once. He hit 30 or more home runs in three seasons, drove in 100+ runs in 12 and scored 100 or more runs in six. Simmons’ best season was 1930, when he hit .381, with 36 home runs, 165 RBI and 152 runs scored.In the seven seasons from 1925 through 1931, Simmons averaged .372 (never hitting below .341).\n\nAl Simmons holds the MLB record for hits in a season by a right-handed batter – 253 in 1925, when he hit .387 at age 23, in (in just his second MLB season.)\n\n__________________________________________________________\n\nOutfield – Carl Yastrzemski\n\nCarl Yastrzemski enjoyed a 23-season MLB career (1961-83) – all with the Boston Red Sox. The Baseball Hall of Famer was an All Star in 18 seasons, a seven-time Gold Glover and the 1967 AL Most Valuable Player (when he won the batter’s Triple Crown – Avg.-HR-RBI).\n\nYastrzemski was a three-time batting champ and topped .300 in six seasons. He had 100+ RBI in five campaigns, 100+ runs scored in three and 40 or more home runs in three. He led the AL in runs scored three times, doubles three times, hits twice and home runs and RBI once each. His best year was 1967, when he won the AL Triple Crown with a .326-44-121 stat line. Yaz finished his career with 3,419 hits (.285 average), 452 long balls and 1,944 RBI. He also hit .369-4-11 in 17 post-season contests. He is among MLB’s top ten (career) in games played, at bats, hits, total bases, doubles and walks. In 1968 – known in baseball lore as “The Year of the Pitcher” – Carl Yastrzemski won the American League batting title with a .301 average – the lowest ever for a league leaders.\n\nSide Note:\n\nI have my own memories of Yaz. With two games left in the 1967 season, my Twins went into Boston with a one-game lead over the Red Sox and lost two games (and the pennant) to Boston by scores of 6-4 and 5-3. All Yaz did was go 7-for-8 with a double, a home run, two runs scored and six RBI. Ouch-ski!\n\n_____________________________________________________\n\nRH Starting Pitcher – Phil Niekro\n\nPhil Niekro spent 24 seasons on the MLB mound: Braves (1964-83, 1987); Yankees (1984-85); Indians (1986-87); Blue Jays (1987). During that time, Niekro earned 318 wins (16th all time) versus 274 losses – and put up a 3.35 ERA. The 6’1”/180-pound knuckleballer won 20 or more games three times and 15 or more in 13 seasons. His nickname was “Knucksie,” but I would have preferred “Knuck-ski.”\n\nNiekro led the National League in wins in 1974 (20) and 1979 (21) He was also the league leader once each in earned run average (1.87), winning percentage (17-4, .810 in 1982 – at age 43) and strikeouts (262 in 1977). Working with the tireless ease of a knuckleballer, he also led the NL four times each in games started, complete games and inning pitched. Niekro’s best season was 1974, when he went 20-13, 2.38 – leading the NL in wins, complete games (18) and innings pitched 302 1/3.\n\nPhil Niekro Trivia … Phil Niekro is the last MLB pitcher to lead his league in both wins and losses in the same season – going 21-20, 3.39 in 1979. That season, he also led the league in starts (44), complete games (23) and innings pitched (342). Phil Niekro and his brother Joe Niekro hold the record for the most MLB wins by brothers, with 539. Phil went 318-274, while Joe went 221-204. In 1979, Phil and Joe Niekro tied to the NL lead in victories with 21 each. On May 29, 1976, Joe Niekro hit the only home run of his 22-season (1,165 plate appearances) MLB career. The opposing pitcher? His brother Phil. On August 5, 1973, Phil Niekro threw the first no hitter for the “Atlanta” Braves – defeating the San Diego Padres 9-0.\n\n____________________________________________\n\nLH Starting Pitcher – Ed Lopat (Lopatynski)\n\nEddie Lopat pitched in 12 MLB seasons – for the White Sox (1944-47), Yankees (1948-55) and Orioles (1955). He went 166-112, with a 3.21 earned run average. It’s reported that Eddie used Lopat over Lopatynski because the latter did not fit into a box score. Lopat also picked up the nickname “The Junkman,” because of his ability to both change speeds and deliver a wide range of breaking pitches.\n\nThe 5’10’/180-pound southpaw was an All Star with the Yankees in 1933, when he went 21-9, 2.91 (his only 20-win season – although from 1947 through 1953, he won 15 or more games in six of seven seasons). In 1953, again with the Yankees, Lopat went 16-4 and led the American League in winning percentage (.800) and ERA (2.42).\n\nIn seven World Series starts, all with the Yankees, Lopat went 4-1, 2.60 with three complete games.\n\n______________________________________________________\n\nRH Reliever – Jim Konstanty\n\nJim Konstanty has the distinction of being the first MLB relief pitcher to win a league MVP Award. He accomplished the feat in 1950, when he was called on in relief a league-leading 74 times by the Phillies. Konstanty won 16 games (seven losses) and led the league with 22 saves. That season, the Phillies won the NL pennant with a 91-63 record – which means Konstanty won or saved 42 percent of Philadelphia’s wins.\n\nIn his eleven MLB seasons, the 6’1”/202-pound righty went 66-48, 3.46 and saved 76 games (152 innings pitched in relief). By the way, James was Konstanty’s middle name – his first name was Casimir.\n\nA Man for All Seasons … In his senior year in high school, Jim Konstanty was captain of the Arcade High School basketball, baseball and football teams. Then, at Syracuse University, he lettered in baseball, basketball, soccer and boxing.\n\n_______________________________________________\n\nLH Reliever – Ron Perranoski\n\nRon Perranoski – a 6’/180-pound southpaw – went 79-74, 2.79 with 178 saves in 13 MLB seasons. He played for the Dodgers (1961-67, 1972); Twins (1968-71); Tigers (1971-72); and Angels (1973).\n\nPerranoski led his league in games pitched in three seasons and games saved twice (with a high of 34 saves for the 1974 Twins). In 1963, he led the NL in winning percentage at .842 – picking up 16 wins (three losses) and 21 saves, all in relief. Add in his 1.67 earned run average and it is clearly his best season.\n\n————————-A COUPLE OF SPECIAL MENTIONS ———————\n\nMoe Drabowsky – Best Polish-Born Major Leaguer\n\nMiroslav Drabowsky was born in Ozano, Poland on July 21, 1935, to a Jewish (American citizen) mother and a Polish father. His family moved to the United Stars in the late 1930’s, as Adolf Hitler was gaining momentum in Eastern Europe. Growing up in Connecticut, Drabowsky played high school baseball at Loomis Chaffee School and college baseball at Trinity College in Hartford. He signed with the Cubs in July of 1956 and made his MLB debut on August 7 of that year (at age 21).\n\nThe 6’3”/190-pound righty was a starter his first four seasons, going 29-40, 3.81, with 22 complete games in 83 starts. Drabowsky switched to the bullpen in 1960 (seven starts in 32 appearances) and made a name for himself coming in from the pen. From 1960-72, he went 59-65, 3.66, with 54 saves (421 appearances in relief, 71 starts).\n\nIn 17 MLB seasons, Drabowsky went 88-105, 3.71 with 54 saves. He struck out 1,162 batters (702 walks) in 1,641 innings. Drabowsky pitched for the Cubs (1956-60); Braves (1961); Reds (1962); Athletics (1962-65); Orioles (1966-68, 1970); Royals (1969-70); Cardinals (1971-72); and White Sox (1972).\n\nMoe Drabowsky, a member of the National Polish-American Sports Hall of Fame (NPASHOF), gave up the 3,000th hit of Stan Musial (another NPASHOF inductee).\n\n____________________________________________\n\nArt “Pinky Deras – Best-Ever Little Leaguer\n\nArt “Pinky” Deras was inducted into the National Polish-American Sports Hall of Fame in 2011 – recognizing his exploits as a 12-year-old Little Leaguer – leading the Hamtramck, Michigan team to the 1958 Little League National Championship. Now, Deras was big for his age, six-feet tall and 135 pounds as a 12-year-old. He was also a dominant force – going 18-0 on the mound (16 shutouts and ten no-hitters) and whiffing 298 batters in 108 innings. That means 92 percent of his outs came via the strikeout. He also hit a resounding .641, with 33 home runs and 112 RBI.\n\nDeras signed a contract with the Cardinals right out of high school, declining of football scholarship to Michigan State. He played five minor league seasons, hitting .243, with 32 home runs in 518 games. He did not pitch in professionally ranks.\n\n______________________________________________________\n\nPrimary resources: Baseball-Reference.com; Society for American Baseball Research; National Polish-American Sports Hall of Fame.\n\nBASEBALL ROUNDTABLE ON THE TOP 100 BASEBALL BLOG LIST\n\nBaseball Roundtable is on the Feedspot list of the Top 1oo Baseball Blogs. To see the full list, click here.\n\nI tweet baseball @DavidBBRT\n\nFollow/Like Baseball Roundtable’s Facebook Page here. More baseball commentary; blog post notifications; PRIZES.\n\nMember: Society for American Baseball Research (SABR); The Baseball Reliquary; The Negro Leagues Baseball Museum."}, {"url": "https://www.stlredbirds.com/2022/06/19/whitey-kurowski-ninth-inning-home-run-lifts-cardinals-to-the-1942-world-series-title/", "page_content": "On October 5, 1942, third baseman Whitey Kurowski struck the deciding blow in Game 5 of the World Series to beat the New York Yankees and begin a five-year run of dominance in which the St. Louis Cardinals won three world championships.\n\nThe heavily favored Yankees entered the 1942 Fall Classic as the defending world champions and winners of five of the past six World Series. Led by Joe Gordon, Charlie Keller, and Joe DiMaggio, they easily won the American League pennant that season, winning 103 games and outpacing the second-place Boston Red Sox by nine games.\n\nThe Cardinals had not had nearly as easy a time in winning the National League flag. As late as August 5 they trailed the Brooklyn Dodgers by 10 games. It wasn’t until they swept a two-game series against the Dodgers on September 11 and 12 that they moved into a tie for the league lead. The following day, after dropping the first game of a doubleheader against the Phillies, St. Louis began a six-game win streak that gave them the lead for good. They finished with 106 wins, two games ahead of the Dodgers, to win their sixth National League pennant.\n\nThough the Cardinals started National League MVP Mort Cooper in Game 1, they committed four errors and lost the opener, 7-4. From that point forward, however, the World Series belonged to the Cardinals.\n\nAfter winning Game 2 at Sportsman’s Park, 4-3, the Cardinals went to Yankee Stadium and picked up 2-0 and 9-6 wins. As a result, Game 5 presented the opportunity to conclude the series and hoist the championship.\n\nThe Cardinals started 24-year-old right-hander Johnny Beazley, who had gone 21-6 with a 2.13 ERA during the regular season. Beazley had been the winning pitcher in Game 2, scattering 10 Yankees hits and allowing three runs in a complete-game effort.\n\nTo oppose Beazley, the Cardinals sent 37-year-old Red Ruffing to the mound. A 19-season major-league veteran, Ruffing was a six-time all-star who had received American League MVP votes in four of the previous five seasons. He went 14-7 with a 3.21 ERA in the regular season and was the winning pitcher in Game 1 of the World Series, allowing four runs over 8 2/3 innings.\n\nRuffing opened Game 5 with a scoreless first inning before Phil Rizzuto gave him a one-run lead with a solo home run to lead off the bottom of the inning. Ruffing held that lead until the top of the fourth, when Enos Slaughter hit a solo home run to right field.\n\nThe Yankees regained the lead in the bottom of the fourth when Red Rolfe laid down a bunt single and advanced to second on a throwing error by Beazley. After Rolfe advanced to third on a fly ball, DiMaggio drove him home with a single to left.\n\nNew York threatened again in the fifth as Ruffing singled and the Cardinals committed two more errors. With the bases loaded, DiMaggio grounded out to Kurowski at third base to end the inning.\n\nThe Cardinals carried that momentum into their next at-bat, as Terry Moore and Slaughter opened the inning with singles. With runners on first and third, Walker Cooper hit a sacrifice fly to right field that tied the game once more.\n\nNeither side threatened again until the top of the ninth, when Walker Cooper hit a leadoff single up the middle. After Johnny Hopp laid down a sacrifice bunt to advance Walker Cooper to second, Ruffing faced off with Kurowski, who had struck out three times against Rudding in Game 1 and was 0-for-3 with three fly balls heading into the ninth inning of Game 5.\n\nAs a 7-year-old in Reading, Pennsylvania, Kurowski had climbed a fence and fallen, landing in broken glass. When the injury turned into osteomyelitis, an infection of the bone, doctors removed four inches of his ulna, one of two bones in the forearm.\n\nOn this occasion, however, neither Kurowski’s misshapen right arm nor Rudding’s previous success against him made any difference. His fly ball sailed over the left-field wall to give the Cardinals a 4-2 lead heading into the bottom of the ninth.\n\nThe Yankees made things tense in the final frame when Joe Gordon led off with a single and Bill Dickey reached on the Cardinals’ fourth error of the game. However, Walker Cooper picked Gordon off second base and Beazley got pinch-hitter Jerry Priddy to pop up for the second out. The Yankees called upon George Selkirk to bat in place of Rudding, but Selkirk grounded out to second baseman Jimmy Brown to end the game and the series.\n\nFor the fourth time in franchise history, the Cardinals were world champions. Bookmakers and scalpers who expected the powerhouse Yankees to win the series reportedly lost up to $100,000.[1] It was the first World Series the Yankees had lost in seven trips since 1926, when Rogers Hornsby’s Cardinals won the first championship in franchise history.\n\n“Baseball’s domination by the New York Yankees folded up and passed out of existence before 69,052 spectators here this afternoon as the St. Louis National League Cardinals, fighting uphill in the vast Yankee Stadium, became the new world champions of the green diamond,” wrote St. Louis Globe-Democrat sports editor Martin J. Haley.[2]\n\n“Any time you can beat a ball club like the Yanks … well, I just feel wonderful,” Cardinals manager Billy Southworth said. “If I felt any better I wouldn’t be able to stand it.”[3]\n\nFor bringing the championship back home to St. Louis, each player received a $6,192.50 share of the World Series purse.[4] For many of the Cardinals, that doubled their salary for the season.\n\n“Gosh, I can buy that farm now,” pitcher Howie Krist said. “It’s 150 acres and it’s a good producing piece of land. Money may shrink, but 150 acres will be 150 acres five years from now, just as it is today.”[5]\n\nKurowski, who was down to his last bat after breaking all of his others during the season, kept it nearby throughout the postgame celebration, showing it to teammates, visitors, and anyone who showed interest.\n\n“I hope my brother Ray was listening on the radio,” Kurowski said. “He’s a Marine down in Parris Island, South Carolina. I got a letter from him this afternoon congratulating me on getting into the World Series, but telling me I made him look silly by fanning my first three times at bat. I got even with him today.”[6]\n\nAfter the 1942 season, Kurowski made five consecutive all-star appearances. In 1945, he hit .323 with 21 homers and 102 RBIs and placed fifth in the National League MVP voting. In 1947, he again finished in the top 10 in the MVP vote after batting .310 with a career-high 27 homers and 104 RBIs. Shortly thereafter, arm injuries ended his career and he went on to become a minor-league coach and manager for 18 seasons.\n\nAfter his breakout 1942 season, Beazley’s career was interrupted by World War II. Before the World Series, he had announced his intention to return home to Nashville, Tennessee, and enlist in the Marine Corps. After he beat the Yankees in Game 5, the Marines recruiting office sent him a telegram: “If you can toss hand grenades like you pitch for them Cards, hurry up.”[7]\n\nAfter three years of military service, Beazley finally returned in 1946 and went 7-5 with a 4.46 ERA. Ahead of the 1947 season, the Cardinals sold him to the Boston Braves, where he won just two games the remainder of his career.\n\nBeazley’s counterpart in Game 5, Ruffing, missed the next two seasons due to military service, returning in 1945 at age 40. He pitched three more seasons in the majors, making his final appearance with the White Sox in 1947.\n\nThe 1942 championship marked the beginning of a five-year stretch in which the Cardinals made four World Series appearances and won three. In 1943, the Yankees returned the favor, beating St. Louis in a five-game World Series, but the Cardinals bounced back and won the 1944 title over the cross-town Browns. In 1946, the Cardinals won the World Series again, this time defeating the Red Sox in seven games."}, {"url": "https://www.espn.com/mlb/story/_/id/13938886/world-series-line-1926-50", "page_content": "JUMP TO ...\n\nIntro | 1903-25 | 1926-50 | 1951-75 | 1976-2000 | 2001-15\n\n1926\n\nSt. Louis (NL) 4, New York (AL) 3\n\nYankees star Babe Ruth shakes hands with Cardinals star Rogers Hornsby before the start of the 1926 World Series. Mark Rucker/Transcendental Graphics/Getty Images\n\nWhy the Cardinals won: Veteran hurler Pete Alexander won two games and saved Game 7.\n\nWhy the Yankees lost: Babe Ruth was caught stealing second base for the final out of Game 7 with slugger Bob Meusel at the plate.\n\nMemorable moment: Alexander entered in the seventh inning of Game 7 with the bases loaded and struck out Tony Lazzeri -- after a long fly that drifted foul.\n\nKey stat: 11. The combined number of runs scored by the Yankees in every game but Game 4, in which they scored 10 behind Ruth's three home runs.\n\n1927\n\nNew York (AL) 4, Pittsburgh (NL) 0\n\nYankees first baseman Lou Gehrig slides home safely as Pirates catcher Johnny Gooch tries to make the play during Game 2 of 1927 World Series. Mark Rucker/Transcendental Graphics/Getty Images\n\nWhy the Yankees won: The team many consider the greatest of all time actually won with its pitching as it hit just two home runs (both by Babe Ruth, who hit .400 and drove in seven runs).\n\nWhy the Pirates lost: Myth has it that the Series was over when the Pirates saw the Yankees take batting practice before the opener, launching ball after ball over the fence.\n\nMemorable moment: Yankees pitcher Herb Pennock retired the first 22 batters in Game 3.\n\nKey stat: 4. The number of walks allowed by the Yankees' staff, which wasn't overpowering, striking out just seven hitters.\n\n1928\n\nNew York (AL) 4, St. Louis (NL) 0\n\nThe Yankees' pitching staff -- Henry Johnson, left, Waite Hoyt, Tom Zachary, George Pipgras, Rosy Ryan, Fred Heimac and Miles Thomas\n\n-- poses before Game 1 of the 1928 World Series. Mark Rucker/Transcendental Graphics/Getty Images\n\nWhy the Yankees won: They swept their second straight World Series as they outhomered St. Louis nine to one.\n\nWhy the Cardinals lost: After hitting .281 as a team, they batted .206 and scored just 10 runs.\n\nMemorable moment: Babe Ruth, playing on a bad ankle, hit three home runs in a World Series game for the second time, homering in the fourth, seventh and eighth innings of Game 4.\n\nKey stat: 7. The combined number of home runs for Lou Gehrig (four, .545) and Ruth (three, .625), who were a two-man wrecking crew.\n\n1929\n\nPhiladelphia (AL) 4, Chicago (NL) 1\n\nDespite the efforts of A's catcher Mickey Cochrane, the Cubs' Riggs Stephenson scores during Game 4 of the 1929 World Series. AP Photo\n\nWhy the Athletics won: Trailing Game 4 8-0 in the seventh, they scored 10 runs.Trailing Game 5 2-0 in the ninth, Mule Haas hit a two-run homer and Bing Miller doubled home the winning run.\n\nWhy the Cubs lost: Rogers Hornsby and Hack Wilson combined for 78 home runs and 308 RBIs that season, but had just one RBI in the Series.\n\nMemorable moment: Surprise Game 1 starter Howard Ehmke fanned 13 for the A's.(He'd start just twice more in his career.)\n\nKey stat: 10.The number of hits the A's had during their 10-run inning in Game 4, including Haas' three-run inside-the-park home run.\n\n1930\n\nPhiladelphia (AL) 4, St. Louis (NL) 2\n\nSome of the Philadelphia Athletics pose for a dugout shot before Game 1 of the 1930 World Series. Lefty Grove is standing behind the two men in street clothes, and Jimmie Foxx is leaning on Mule Haas' shoulders. Mark Rucker/Transcendental Graphics/Getty Images\n\nWhy the Athletics won: They hit only .197, but the 1-2 combo of George Earnshaw and Lefty Grove was dominant.\n\nWhy the Cardinals lost: They hit .314 and scored more than 1,000 runs in the regular season, but hit just .200 and averaged two runs per game.\n\nMemorable moment: Jimmie Foxx broke a 0-0 tie in the ninth inning of Game 5 with a two-run homer off Burleigh Grimes.\n\nKey stat: 1. The amount of rest (one day) for Earnshaw, who pitched seven innings in Game 5 and returned to the mound two days later to throw a five-hit complete game in the finale.\n\n1931\n\nSt. Louis (NL) 4, Philadelphia (AL) 3\n\nCardinals catcher Jimmie Wilson tags out A's outfielder Al Simmons during the second inning of Game 5 of the 1931 World Series. Mark Rucker/Transcendental Graphics/Getty Images\n\nWhy the Cardinals won: Pepper Martin, a 27-year-old rookie, wreaked havoc on the A's, going 12-for-24 (.500) with five runs, five extra-base hits, five RBIs and five steals.\n\nWhy the A's lost: Hall of Fame catcher Mickey Cochrane had a poor series (4-for-25).In Game 7, the A's allowed two first-inning runs on a wild pitch and an error and lost 4-2.\n\nMemorable moment: Martin made a spectacular running catch on Max Bishop's two-on, two-out line drive in the bottom of the ninth to end the Series.\n\nKey stat: 8. It was the eighth and final World Series for venerable A's manager Connie Mack.\n\n1932\n\nNew York (AL) 4, Chicago (NL) 0\n\nBabe Ruth swats one of his two home runs in Game 3 of the 1932 World Series. It's unknown if this is the alleged 'Called Shot' home run. Bruce Bennet/Getty Images\n\nWhy the Yankees won: Led by Lou Gehrig (.529, three HRs, 1.718 OPS), the Yankees scored 37 runs in four games.\n\nWhy the Cubs lost: The Cubs' starting pitchers combined to post a 9.15 ERA with 14 walks in 20 2/3 innings.\n\nMemorable moment: Babe Ruth's legendary \"Called Shot\" HR in the fifth inning of Game 3 at Wrigley Field remains a moment cloaked in mystique.\n\nKey stat: 13. The number of future Hall of Famers who played in the Series.\n\n1933\n\nNew York (NL) 4, Washington (AL) 1\n\nSenators second baseman Buddy Myer completes the double play after receiving the feed from shortstop Joe Cronin, left, and forcing out a sliding Travis Jackson at second base during Game 3 of the 1933 World Series. Bruce Bennet/Getty Images\n\nWhy the Giants won: Carl Hubbell dominated the Senators, allowing no earned runs in 20 innings, including an 11-inning complete-game victory in Game 3.\n\nWhy the Senators lost: The Senators lost the final two games by one run in extra innings despite having the winning run on base both times when the games ended.\n\nMemorable moment: Mel Ott's solo home run in the 10th inning off the glove of center fielder Fred Schulte, who tumbled into the crowd, was the difference in the decisive Game 5.\n\nKey stat: .115. The Senators' batting average (3-for-26) with runners in scoring position.\n\n1934\n\nSt. Louis (NL) 4, Detroit (AL) 3\n\nCardinals left fielder Joe Medwick stands amid debris thrown by irate Tigers fans during Game 7 of the 1934 World Series. AP Photo\n\nWhy the Cardinals won: The Dean brothers, Dizzy and Paul, accounted for all four wins and had a combined ERA of 1.43 in 44 innings.\n\nWhy the Tigers lost: Leading 3-2, the Tigers couldn't close the series at home and wasted a key chance in Game 6, with runners on second and third and one out in the eighth.\n\nMemorable moment: In Game 7, the Detroit fans pelted the Cardinals' Joe Medwick with garbage when he took his position in left field after a hard slide into Tigers third baseman Marv Owen the previous inning.Commissioner Judge Landis had Medwick removed from the game.\n\nKey stat: 6.The number of doubles hit by the Tigers' Pete Fox.It remains a Series record.\n\n1935\n\nDetroit (AL) 4, Chicago (NL) 2\n\nThe Cubs protest after Phil Cavarretta was called out on an attempted steal during Game 3 of the 1935 World Series. AP Photo\n\nWhy the Tigers won: After dropping Game 1, the Tigers won four of the next five games, three by one run, getting two strong starts from Tommy Bridges.\n\nWhy the Cubs lost: They couldn't win without Lon Warneke on the mound.Warneke was brilliant, 2-0 with an 0.54 ERA.The other six pitchers? 0-4, 4.26 ERA.\n\nMemorable moment: In Game 6, Goose Goslin's single in the bottom of the ninth scored Mickey Cochrane to clinch the Tigers' first-ever World Series title.\n\nKey stat: .050. The batting average (1-for-20) of Marv Owen, who replaced the Tigers' Hall of Fame first baseman Hank Greenberg (broken wrist) in Game 2.\n\n1936\n\nNew York (AL) 4, New York (NL) 2\n\nGiants left-hander Carl Hubbell delivers a pitch to the Yankees' Bill Dickey during Game 1 of the 1937 World Series. AP Photo\n\nWhy the Yankees won: Led by Jake Powell (.455, 1.175 OPS), the Yankees battered the Giants, outscoring them 43-23 and hitting .302 as a team.\n\nWhy the Giants lost: Other than Carl Hubbell (1-1, 2.25 ERA), no other Giants pitcher could slow down the Yankees' attack.Their staff ERA was 6.79.\n\nMemorable moment: Prized rookie Joe DiMaggio made a running catch in center field to end Game 2 ...and he kept on running up the clubhouse steps at the Polo Grounds.\n\nKey stat: 17. The number of consecutive decisions won by Hubbell before the Yankees beat him in Game 3.\n\n1937\n\nNew York (AL) 4, New York (NL) 1\n\nYankees center fielder Joe DiMaggio hits a solo home run off the Giants' Cliff Melton during Game 5 of the 1937 World Series. AP Photo\n\nWhy the Yankees won: The Bombers' offense outscored the Giants 16-2 in the first two games, but the real star was pitcher Lefty Gomez (2-0, 1.50 ERA, 2 CGs).\n\nWhy the Giants lost: Aside from their Game 4 victory, they managed only five runs and hit only .209 in the other four games combined.\n\nMemorable moment: In the ninth inning of Game 4, his last in the Fall Classic, Carl Hubbell surrendered Lou Gehrig's final World Series HR.\n\nKey stat: 0. The number of errors committed by the Yankees, making them the Series' first-ever errorless team.\n\n1938\n\nNew York (AL) 4, Chicago (NL) 0\n\nYankees pitcher Charles 'Red' Ruffing warms up before Game 1 of the 1938 World Series. AP Photo/Tom Sande\n\nWhy the Yankees won: Red Ruffing (2-0, 1.50 ERA) led a Yankees staff that gave up plenty of hits (33) but still managed a 1.75 ERA.\n\nWhy the Cubs lost: While Stan Hack, Phil Cavarretta and Joe Marty combined to go 20-for-42 (.476), the Cubs mustered only nine runs in four games.\n\nMemorable moment: Down 3-2 with two outs in the eighth in Game 2, Frankie Crosetti hit a stunning two-run homer off Dizzy Dean to put the Yankees ahead to stay.\n\nKey stat: 3. The number of consecutive World Series titles won by the Yankees, who became the first team to record a three-peat.\n\n1939\n\nNew York (AL) 4, Cincinnati (NL) 0\n\nYankees outfielder Charlie Keller slides into third base with triple as Reds third baseman Billy Werber fields the throw in Game 1 of the 1939 World Series. AP Photo\n\nWhy the Yankees won: Rookie Charlie \"King Kong\" Keller blasted the Reds, hitting .438 with a 1.188 slugging percentage, three homers, six RBIs and eight runs scored.\n\nWhy the Reds lost: There were several black holes in the Reds' lineup, including Wally Berger (0-for-15), Lonny Frey (0-for-17) and Harry Craft (1-for-11).\n\nMemorable moment: In the ninth inning of Game 4, in a play known as \"Lombardi's Snooze,\" Keller collided with Reds catcher Ernie Lombardi, who was left rolling on the ground as another run scored.\n\nKey stat: 4. The number of home runs allowed by Reds pitcher Junior Thompson in Game 3, tying a single-game Series record.\n\n1940\n\nCincinnati (NL) 4, Detroit (AL) 3\n\nThe Reds' Bill Baker slides in safely at home as Tigers catcher Birdie Tebbetts tries to apply the tag in Game 3 of the 1940 World Series. AP Photo\n\nWhy the Reds won: Bucky Walters and Paul Derringer were tough on the Tigers; the two Reds starters went 4-1 with a 2.17 ERA.\n\nWhy the Tigers lost: Up 3-2 in the series, they scored one run over the final two games, getting 12 hits and only two for extra bases.\n\nMemorable moment: Tigers starter Bobo Newsom, whose father died in his hotel room after watching his son win Game 1, threw a shutout \"for Dad\" in Game 5.\n\nKey stat: .353. The series batting average of 40-year-old Jimmie Wilson, a Reds coach who became the backup catcher after former backup Willard Hershberger committed suicide in August.\n\n1941\n\nNew York (AL) 4, Brooklyn (AL) 1\n\nYankees second baseman Joe Gordon slides into third base with a triple during Game 3 of the 1941 World Series. AP Photo\n\nWhy the Yankees won: Joe Gordon (.500 BA, 1.595 OPS) and Charlie Keller (.389, .976) combined to drive in 10 of the Yankees' 17 runs.\n\nWhy the Dodgers lost: They had no offense, scoring 11 runs and hitting .182 with one home run in five games.No regular hit higher than .235.\n\nMemorable moment: One out away from a one-run Game 4 win, Dodgers catcher Mickey Owens' passed ball on a third strike allowed Tommy Henrich to reach base.The Yankees then scored four runs and won the game.\n\nKey stat: 7. The number of times Gordon walked, tying a five-game Series record.\n\n1942\n\nSt. Louis (NL) 4, New York (AL) 1\n\nCardinals players Whitey Kurowski, left, Enos Slaughter and Johnny Beazley celebrate after winning Game 5 to clinch the 1942 World Series title. AP Photo\n\nWhy the Cardinals won: They received clutch pitching from undaunted rookie Johnny Beazley, a 21-game winner who beat the Yankees twice -- in Games 2 and 5.\n\nWhy the Yankees lost: In Game 1, their only victory, they scored the first seven runs of the Series, but then got outscored 23-11 the rest of the way.\n\nMemorable moment: Whitey Kurowski, who'd gone 3-for-14 in the Series, hit a tie-breaking, two-run homer in the top of the ninth in Game 5 to win the title for St. Louis.\n\nKey stat: 8.The number of consecutive World Series appearances won by the Yankees until the Cardinals finally beat them.\n\n1943\n\nNew York (AL) 4, St. Louis (NL) 1\n\nStarting pitchers Spud Chandler of the Yankees and Max Lanier of the Cardinals shake hands before Game 1 of the 1943 World Series. AP Photo\n\nWhy the Yankees won: AL MVP Spud Chandler pitched like an ace with a pair of complete-game victories, a seven-hitter in Game 1 and a 10-hit shutout to clinch the Series in Game 5.\n\nWhy the Cardinals lost: Other than their Game 2 victory, the Cardinals never scored more than two runs in a game.They went scoreless in 22 of the final 23 innings.\n\nMemorable moment: With the Yankees down 2-1 in Game 3, Billy Johnson's bases-loaded triple capped a five-run eighth inning as the Yankees took control of the Series.\n\nKey stat: 3-4. The scheduled Series format (three games in New York, four in St. Louis) due to wartime travel restrictions.\n\n1944\n\nSt. Louis (NL) 4, St. Louis (AL) 2\n\nThe Browns' George McQuinn is congratulated by Gene Moore and Mark Christman after hitting a two-run homer in the 1944 World Series opener. National Baseball Hall of Fame Library\n\nWhy the Cardinals won: Pitchers Harry Brecheen, Mort Cooper, Max Lanier and Ted Wilks held the Browns to two runs total in winning the final three games.\n\nWhy the Browns lost: Other than George McQuinn, who hit .438 (7-for-16) and had five RBIs, the rest of the Browns batted only .160 and drove in four runs.\n\nMemorable moment: Ken O'Dea's walk-off pinch-hit single in the 11th inning, his only hit of the series, won Game 2 for the Cardinals.\n\nKey stat: 1. The number of home runs the Browns hit the entire series (McQuinn in Game 1).\n\n1945\n\nDetroit (AL) 4, Chicago (NL) 3\n\nRoy Cullenbine tips the cap of winning pitcher Hal Newhouser after the Tigers defeated the Cubs in Game 7 of the 1945 World Series. Icon SMI\n\nWhy the Tigers won: The Tigers got the great series they needed from Hank Greenberg, who had an 1.162 OPS and drove in seven runs with five extra-base hits.\n\nWhy the Cubs lost: Despite a 49-26 home record, the Cubs lost three of four at Wrigley Field.Their only win, Game 6 in 12 innings, was called \"the worst game of baseball ever played in this country.\"\n\nMemorable moment: In Game 7, Cubs manager Charley Grimm started Hank Borowy on only one day of rest.Borowy gave up three straight hits before being replaced, and the Tigers scored five runs in the first and won easily.\n\nKey stat: 26. The record number of players the Tigers used in the series, since tied by the '46 Red Sox and '97 Marlins.\n\n1946\n\nSt. Louis (NL) 4, Boston (AL) 3\n\nCardinals outfielder Enos Slaughter slides home with the winning run in Game 7 of the 1946 World Series. Mark Rucker/Transcendental Graphics/Getty Images\n\nWhy the Cardinals won: They rode the masterful pitching of Harry Brecheen, who had two complete-game victories (Games 2 and 6), won Game 7 in relief and allowed one earned run in 20 innings.\n\nWhy the Red Sox lost: Over the final two games, Boston's inability to hit with runners in scoring position (1-for-13) was its undoing.In Game 7, the Red Sox put two runners on with no outs in the ninth and didn't score.\n\nMemorable moment: Known as the \"Mad Dash,\" Enos Slaughter scored from first base on Harry Walker's double to break a 3-3 eighth-inning tie in Game 7.\n\nKey stat: .200. Ted Williams' batting average in the only World Series appearance of his career.\n\n1947\n\nNew York (AL) 4, Brooklyn (NL) 3\n\nYankees shortstop Phil Rizzuto sails over the head of the Dodgers' Jackie Robinson at second base during Game 6 of the 1947 World Series. AP Photo/Harry Harris\n\nWhy the Yankees won: Although Johnny Lindell (9-for-18, 1.403 OPS) led the offense, Joe Page's clutch relief effort in Game 7 (five scoreless innings) was the difference.\n\nWhy the Dodgers lost: The Dodgers' starting pitching was a glaring weakness; no starter pitched beyond the fifth inning, and the rotation had a collective ERA of 9.64.\n\nMemorable moment: In Game 4, Bill Bevens was one out from a no-hitter when Cookie Lavagetto lined a two-run double to right field to beat the Yankees.\n\nKey stat: 6. The appearances by the Dodgers' Hugh Casey, who won twice, had one save and an 0.87 ERA.\n\n1948\n\nCleveland (AL) 4, Boston (NL) 2\n\nYankees shortstop Phil Rizzuto sails over the head of the Dodgers' Jackie Robinson at second base during Game 6 of the 1947 World Series. AP Photo/Harry Harris\n\nWhy the Indians won: While Bob Feller struggled, the other three starters, Bob Lemon, Gene Bearden and Steve Gromek, picked up the slack, accounting for all four wins with a combined 1.00 ERA.\n\nWhy the Braves lost: Beating Feller twice, the first time on Johnny Sain's brilliant Game 1 shutout, went for naught, as the Braves dropped four of the final five games, scoring only five runs in the four losses.\n\nMemorable moment: In Game 1, Feller had pinch-runner Phil Masi picked off at second base; Masi was called safe.Tommy Holmes then singled home Masi for the only run.\n\nKey stat: 86,288. The Game 5 attendance at Cleveland Stadium, the most ever for a World Series game.\n\n1949\n\nNew York (AL) 4, Brooklyn (NL) 1\n\nYankees shortstop Phil Rizzuto sails over the head of the Dodgers' Jackie Robinson at second base during Game 6 of the 1947 World Series. AP Photo/Harry Harris\n\nWhy the Yankees won: Third baseman Bobby Brown was the Yankees' chief bomber; he pounded the Dodgers over the final two games, going 5-for-7 with five RBIs.\n\nWhy the Dodgers lost: With the series tied, Ralph Branca's ninth-inning meltdown in Game 3 proved critical for the Dodgers, whose starters in Games 4 and 5 didn't last past the fourth inning.\n\nMemorable moment: In Game 1, Tommy Henrich's walk-off homer beat the Dodgers' Don Newcombe and ended his scoreless duel with Allie Reynolds.\n\nKey stat: 11. The number of strikeouts for Newcombe in Game 1, tying the single-game record for a losing pitcher.\n\n1950\n\nNew York (AL) 4, Philadelphia (NL) 0\n\nYankees shortstop Phil Rizzuto sails over the head of the Dodgers' Jackie Robinson at second base during Game 6 of the 1947 World Series. AP Photo/Harry Harris\n\nWhy the Yankees won: Very little offensive support was needed since the rotation allowed only three earned runs over the four games.\n\nWhy the Phillies lost: Other than Granny Hamner (6-for-14), the Phillies' hitters posed no threat; Del Ennis and Willie Jones, who'd combined for 214 RBIs during the season, had zero in the series.\n\nMemorable moment: In Game 2, Joe DiMaggio made an outstanding running catch on Del Ennis' deep fly near the 400-foot marker in right-center field at Shibe Park.\n\nKey stat: 21. The age of Yankees lefty Whitey Ford, who made his Series debut with a winning effort in Game 4."}]}