{"Whitey Kurowski also led the league in RBIs in 1945 with 108.": [{"url": "https://www.historyofcardinals.com/whitey-kurowski/", "page_content": "Whitey Kurowski, known for his white hair, debuted with the St. Louis Cardinals on Sept. 22, 1941 and played for eight seasons before an elbow problem curtailed his career in 1949.\n\nHis best season was likely in 1947 when he batted .310 and swatted 27 home runs, scored 108 runs, knocked in 104 RBI’s, which included 27 doubles and a .544 SLG%.\n\nHe was a 5-time All Star (1943-1947) that finished with .286 average and 106 home runs and 529 runs batted in while playing 916 games. He was a key part in 3 World Championships (1942, 1944, 1946) with the Cardinals.\n\nSABR article\n\nIn four World Series appearances, Kurowski hit .253 (21-for-83) with one home run and nine RBI in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only home run in the Series, in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for St. Louis over the New York Yankees. He also appeared five times in the MVP ballot, in 1942 and from 1944 through 1947."}, {"url": "https://www.baseball-reference.com/players/k/kurowwh01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Whitey Kurowski born?\n\nWhitey Kurowski was born on April 19, 1918.\n\nWhere was Whitey Kurowski born?\n\nWhitey Kurowski was born in Reading, PA.\n\nHow tall was Whitey Kurowski?\n\nWhitey Kurowski was 5-11 (180 cm) tall.\n\nHow much did Whitey Kurowski weigh when playing?\n\nWhitey Kurowski weighed 193 lbs (87 kg) when playing.\n\nHow many seasons did Whitey Kurowski play?\n\nWhitey Kurowski played 9 seasons.\n\nIs Whitey Kurowski in the Hall of Fame?\n\nWhitey Kurowski has not been elected into the Hall of Fame.\n\nWhat position did Whitey Kurowski play?\n\nWhitey Kurowski was a Third Baseman.\n\nHow many hits did Whitey Kurowski have?\n\nWhitey Kurowski had 925 hits over his career.\n\nHow many home runs did Whitey Kurowski have?\n\nWhitey Kurowski had 106 home runs over his career.\n\nWhat was Whitey Kurowski's average?\n\nWhitey Kurowski had a .286 average over his career.\n\nHow many teams has Whitey Kurowski played for?\n\nWhitey Kurowski played for 1 team, the St. Louis Cardinals.\n\nHow many World Series has Whitey Kurowski won?\n\nWhitey Kurowski won 3 World Series.\n\nWhen did Whitey Kurowski retire?\n\nWhitey Kurowski last played in 1949."}, {"url": "http://historicbaseball.com/players/k/kurowski_whitey.html", "page_content": "\n\nHistory Players Teams Obituaries Site search Contact Us Sponsor a page on Historic Baseball! Click here for details Whitey Kurowski George John Kurowski\n\nBorn: April 19, 1918 in Reading, Penn.\n\nDied: Dec. 9, 1999 in Sinking Springs, Penn.\n\nDebut: 1941 | Pos: 3B\n\nH: 5'11\" | W: 193 | B: R | T: R YR G AB R H HR RBI SB BA 9 916 3229 518 925 106 529 19 .286 >> Visit the Whitey Kurowski biography on Baseball Almanac for complete statistics. Wally Kurowski, who hit a home run in the 1942 World Series, died on Dec. 9, 1999 in Sinking Springs, Tenn. The third baseman spent nine seasons in the major leagues and compiled a .286 career average with 106 home runs and 529 RBI. His career inclued the 1942, 1943, 1944 and 1946 World Series and he hit .253 in 83 career World Series at-bats. In 1942, he collected four hits for the Cardinals in the World Series victory over the Yankees. He hit a home run in the ninth inning of Game 5 off the Yankees' Red Ruffing to clinch the title for St. Louis. During his career, the Cardinals won the 1942, 1944 and 1946 World Series. He was named to four All-Star rosters -- 1943, 1944, 1946 and 1947 -- and he led the National League in putouts three times, in fielding twice and once in double plays. He finished in the top 10 in MVP voting in 1945 (5th) and 1947 (9th). One of his best seasons came in 1947 when he hit .310 in 513 at-bats with 27 home runs and 104 RBI. He also drove in 102 runs in 1945. His playing career came to an end in 1949 due to an arm problem. Following his career as a player, he coached and managed in the minor leagues for 18 years. He also worked for the Berks County Bureau of Weights and Measures until his retirement in 1980."}, {"url": "https://www.remembermyjourney.com/Memorial/Obituary/234810", "page_content": "COPYRIGHT DISCLAIMER\n\nThe Funeral Home and/or Cemetery’s policy is to NOT reproduce any copyrighted or other proprietary materials without verification from the User that they have the lawful right and/or authority to use.\n\nBy using this service, you agree and certify to the Funeral Home and/or Cemetery that you either own all copyright or proprietary rights to the materials you are uploading OR that you have the authority or right to use these materials.\n\nIf there are any infringement claims for the use of the materials, you agree to indemnify, defend, and hold harmless the Funeral Home and/or Cemetery.\n\nThe Funeral Home and/or Cemetery reserves the right to refuse to use any materials that it may believe to be protected.\n\nThe Funeral Home and/or Cemetery respects the intellectual property of others, and if you believe that your work has been used in a way that constitutes copyright infringement, please contact us."}, {"url": "https://www.baseball-reference.com/bullpen/Whitey%20Kurowski", "page_content": "George John Kurowski\n\nBR page\n\nBiographical Information [ edit ]\n\nWhitey Kurowski played nine seasons in the major leagues, all for the St. Louis Cardinals in the 1940's. He hit over .300 several times and posted a career Adjusted OPS+ of 125, equal to that of Ron Santo and Bobby Grich. He was a third baseman who appeared in four World Series and five All Star games in his relatively short career.\n\nIn 1945 he was fifth in the league in batting average and also fifth in the MVP voting and second in slugging percentage. In 1947 he was second in the league in OBP. He was once third in the league in doubles, once fourth in the league in RBI and twice fourth in the league in homers. He led the league in hit-by-pitch in 1947.\n\nNone of the most similar players (by the similarity scores method) has as high an Adjusted OPS+ as Kurowski does.\n\nHis minor league playing career ran from 1937 to 1949 with some appearances after that as a player-manager through 1959.\n\nAfter retiring, Kurowski became a minor league manager in the St. Louis Cardinals chain from 1950 to 1962. He also managed the Buffalo Bisons for the New York Mets in 1964, the Cleveland Indians with the Reading Indians in 1965, and for the Washington Senators from 1970 to 1971 with the Denver Bears in 1970 and Burlington Senators in 1970 and 1971. Overall his teams were 983-916 in 15 years.\n\nNotable Achievements [ edit ]\n\n5-time NL All-Star (1943-1947)\n\n20-Home Run Seasons: 3 (1944, 1945 & 1947)\n\n100 RBI Seasons: 2 (1945 & 1947)\n\n100 Runs Scored Seasons: 1 (1947)\n\nWon three World Series with the St. Louis Cardinals (1942, 1944 & 1946)\n\nYear-by-Year Managerial Record [ edit ]\n\nFurther Reading [ edit ]\n\nRick Swaine: \"Whitey Kurowski\", in Bill Nowlin, ed.: Van Lingle Mungo: The Man, The Song, The Players, SABR, Phoenix, AZ, 2014, pp. 55-58. ISBN 978-1-933599-76-2"}, {"url": "https://www.baseball-almanac.com/players/player.php?p=kurowwh01", "page_content": "Whitey Kurowski was born on Friday, April 19, 1918, in Reading, Pennsylvania. Kurowski was 23 years old when he broke into the big leagues on September 23, 1941, with the St. Louis Cardinals. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Whitey Kurowski baseball stats page.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that you can compare Whitey Kurowski to other rookies who also had their Major League debut during the 1941 National League season?\n\nYou can follow the team links in the chart above to locate common statistics (singles), advanced statistics (WHIP Ratio & Isolated Power), and unique statistics (plate appearances & times on bases) not found on any other website.\n\nIf you find this type of \"free\" data useful please consider making a donation to Baseball Almanac : a privately run / non-commercial site in need of financial assistance."}, {"url": "https://sabr.org/journal/article/hank-greenbergs-american-league-rbi-record/", "page_content": "This article was written by Herm Krabbenhoft\n\nThis article was published in Spring 2012 Baseball Research Journal\n\nHall of Fame slugger Hank Greenberg wrote, “My goal in baseball was always RBIs, to break (Lou) Gehrig’s record of 184 RBIs.” Did he come closer than he thought to doing so?\n\n\n\nAccording to the American League’s official records, Hank Greenberg amassed a total of 1,202 runs batted in during his junior circuit career, which was spent entirely with the Detroit Tigers and spanned the 17-year period from 1930 through 1946. (See Chart 1.)\n\nTwelve hundred RBIs over 17 years probably does not sound impressive. However, Greenberg was a full-season player for just eight of those 17 campaigns. Except for a solitary at-bat at the tail end of the 1930 season, he was a full-time minor leaguer for his first three years in professional baseball (1930–1932) and did not appear in a Tigers uniform again until 1933. He suffered a broken wrist in the twelfth game of the 1936 season and was out the rest of the year. And he was in military service from early in the 1941 campaign (after the 19th game) through the middle of the 1945 season.\n\nDuring the eight full AL seasons that Greenberg did have (1933–1935, 1937–1940, and 1946), he batted in a total of 1,114 runs—an average of 139 RBIs per year. For comparison, Lou Gehrig averaged 148 RBIs per year for the eight-year period from 1931 through 1938 and Jimmie Foxx averaged 135 RBIs per season for the eight-year period from 1933 through 1940. In four of those seasons (1935, 1937, 1940, and 1946) Greenberg topped the AL in RBIs, while Gehrig and Foxx led the AL in RBIs in five and three seasons, respectively. Hammerin’ Hank’s RBI numbers certainly place him in an elite group of run-producing first basemen.\n\nHank Greenberg’s official RBI numbers are impressive. But are they correct?\n\nAs described in my recent article in the Baseball Research Journal, Lou Gehrig’s official RBI record is plagued with numerous errors. Thirty-four errors were discovered and corrected in Gehrig’s official RBI record for the 1923–1930 period alone. Significantly, the corrections of the RBI errors resulted in changes in Gehrig’s league-leading RBI totals in 1927, 1928, and 1930.[fn]Herm Krabbenhoft, “Lou Gehrig’s RBI Record,” The Baseball Research Journal (Fall, 2011): 1[/fn]\n\nSo, what about the accuracy of the RBI statistics in Greenberg’s official record? Not surprisingly, his official RBI record is also compromised with numerous errors, the corrections for which are given in this article. One of these corrections could mean a major change in baseball’s record book.\n\nRESEARCH PROCEDURE\n\nTo ascertain the accuracy of Greenberg’s official RBI record one needs to obtain the specific details for each run scored by the Detroit Tigers in each game Greenberg played. For each of these runs I determined:\n\nwho scored the run;\n\nthe run-scoring event (e.g., a 1-RBI single, a 1-RBI groundout, a 1-RBI safe-on-error, a 0-RBI safe-on-error, a 0-RBI steal of home, a 0-RBI balk, etc.)\n\nthe player who completed his plate appearance during the run-scoring event.\n\nI examined newspaper accounts for each game, including the three major daily Detroit newspapers (the Free Press, News, and Times) and at least one major daily newspaper from the city of the team that opposed the Tigers. In this way I was able to ascertain the exact details for each of the runs the Tigers scored in 1,234 (97.2%) of the 1,269 games in which Greenberg appeared, leaving 35 games extant. Fortunately, for 32 of those 35 games the run-scored and RBI information in the accompanying box scores agreed with the runs scored and runs batted in numbers in the official day-by-day (DBD) records. For the three games where the newspaper box scores and the official DBD information are not in agreement regarding the RBI information, and the newspaper text accounts do not resolve the discrepancies, one must consider the official DBD RBI information to be correct. (See Appendix One, available online at sabr.org, for specific information on each of the 35 games with incomplete details for runs scored and runs batted in.)\n\nFrom the detailed run-scored information I generated a game-by-game RBI ledger for Greenberg, which I then compared with the RBI information provided in his official DBD record. For those games where Greenberg’s RBI statistics from the newspaper accounts did not agree with the official DBD records, I proceeded to examine all relevant newspaper accounts so as to unequivocally ascertain the RBIs Greenberg actually achieved. (Appendix Two, available online at sabr.org, provides the comprehensive supporting documentation for the corrections of the RBI errors in the official records.)\n\nRESULTS\n\n1930—Greenberg’s First Major League “Season.” After spending most of 1930 with Raleigh—the Tigers farm club in the Class C Piedmont League—Hank Greenberg made his major league debut on September 14, 1930, at Navin Field in Detroit in a game against the Yankees. He entered the contest with the bases empty in the eighth inning as a pinch hitter for the Tigers pitcher Charlie Sullivan; Detroit was on the short end of a 10–1 score. It turned out to be a match-up of future Hall of Famers: Red Ruffing got Hank to pop out to second baseman Ben Chapman. Obviously there was no RBI for Hank (which is in agreement with his official DBD record). That was his only appearance in the Big Show until the 1933 campaign.\n\n1933—Greenberg’s First “Full” Major League Season. After having spent the 1931 and 1932 seasons in the minors (Evansville of the Class B Three-I League and Beaumont of the Class AA Texas League), Greenberg headed north with the Tigers from spring training in 1933. On the bench during Detroit’s first seven games, Hank was the starting first baseman against the Browns on April 22. At the plate, Hank went 0-for-3 with a walk, and while he did score a run, he did not bat in any runs. After another week of sitting on the bench, Hank got his next start in St. Louis on April 30. Hank collected his first major league RBI when his seventh-inning single knocked in Charlie Gehringer. A week later at Navin Field Greenberg slugged his first big league big fly, a solo homer off Washington’s Earl Whitehill. During the next two weeks, Hank saw limited action, appearing in just three more games. However, on May 21, Detroit’s 30th game, he became the regular first baseman for the Tigers, relegating Harry Davis to the back-up role.\n\nFor the season, Hank Greenberg fashioned a commendable batting record—in 117 games, he compiled (officially) a .301 batting average (behind only Gehr-inger’s .325 on the team) with 12 homers (the most on the Tigers) and 87 runs batted in (second behind Gehringer’s 105 RBIs). League-wise, the only AL rookie with better numbers was Pinky Higgins of the Phila-delphia Athletics—.314 with 13 homers and 99 RBIs in 152 games.\n\nBut is Greenberg’s official 87-RBIs figure accurate? Unfortunately, no. I discovered three games with RBI errors:\n\nJune 3, 1933: Official DBD, 1 RBI; actual, 0 RBI ….. -1 RBI\n\nOfficial DBD, 1 RBI; actual, 0 RBI ….. -1 RBI Sept 16, 1933 : Official DBD, 2 RBI; actual, 0 RBI ….. -2 RBI\n\nOfficial DBD, 2 RBI; actual, 0 RBI ….. -2 RBI Sept 23, 1933 : Official DBD, 0 RBI; actual, 1 RBI ….. +1 RBI\n\nBy this count, Greenberg achieved 85 RBIs (not 87 RBIs) in 1933. (See Appendix Two for complete supporting documentation.)\n\n1934—Greenberg’s First 100-RBI Season. Following his stellar rookie year, Hank avoided the classic “sophomore jinx.” Starting at first base in 153 of Detroit’s 154 games (every day but Yom Kippur), Greenberg primarily batted sixth and led the team in RBIs with 139. His official 139 RBIs tied the franchise record, Harry Heilmann also having officially driven in 139 runs in 1921. But Greenberg’s official RBI record is burdened with errors in two games:\n\nJune 13, 1934 : Official DBD, 3 RBI; actual, 2 RBI ….. -1 RBI\n\nOfficial DBD, 3 RBI; actual, 2 RBI ….. -1 RBI June 15, 1934 : Official DBD, 0 RBI; actual, 1 RBI ….. +1 RBI\n\nBecause the corrections of the two RBI errors are self-compensating (i.e., – 1 RBI + 1 RBI = 0 RBI), the net change in Greenberg’s official RBI record is zero—he did have 139 RBIs in 1934.\n\n1935—Greenberg’s “Record-Breaking” RBI Season. Going into the 1935 season, the official American League record for most runs batted in by a right-handed batter during a single season was 169 RBIs, held by Jimmie Foxx of the 1932 Philadelphia Athletics. Starting—and finishing—at first base in each of the 152 games the Tigers played in 1935, Hammerin’ Hank proceeded to carve out another phenomenal performance—he topped the junior circuit in runs batted in with 170—thereby establishing a new official mark for the most RBIs by a right-handed batter. But, are the RBI stats in Greenberg’s official DBD records correct? As it turns out, they are not.\n\nI discovered and corrected errors in two games:\n\nJune 29, 1935 : Official DBD, 1 RBI; actual, 0 RBI ….. -1 RBI\n\nOfficial DBD, 1 RBI; actual, 0 RBI ….. -1 RBI July 5, 1935 : Official DBD, 5 RBI; actual, 4 RBI ….. -1 RBI\n\nThus, for the entire 1935 season, Greenberg actually had 168 RBIs, not the record-setting 170 RBIs shown in his official DBD records. Therefore, he did not establish a new AL single-season record for the most RBIs by a right-handed batter. (Note: to my knowledge, the accuracy of Foxx’s official RBI record for 1932 has not yet been ascertained.)\n\n1936—Greenberg’s Fractured Season. Following his spectacular 1935 campaign, for which he was selected as the Most Valuable Player in the American League, Greenberg’s 1936 season began with high expectations. Through the first 11 games, the Tigers went 7–4 and were just one-half game behind the front-running Cleveland Indians. Greenberg himself was off to a fantastic start with 15 RBIs, a pace which translates into 210 RBIs for a 154-game season. However, on April 29 in Washington, Greenberg suffered a fractured left wrist during a collision at first base with Jake Powell as the Nat was running out a grounder. This was the same wrist he had broken in the second game of the 1935 World Series and Greenberg’s season was through. His final official DBD record shows Hank with 16 RBIs, crediting him with one in that fateful game. However, as clearly demonstrated by the evidence (Appendix Two at sabr.org), Greenberg did not have any RBIs in that final game:\n\nApril 29, 1936: Official DBD, 1 RBI; actual, 0 RBI ….. -1 RBI\n\nThus, for Greenberg’s abbreviated 1936 season, he actually had 15 RBIs, not 16 as shown in his official DBD records.\n\n1937—Greenberg’s “One-RBI-Short” Season. Would Greenberg rebound from the broken wrist when 1937 rolled around? Hammerin’ Hank did not disappoint, officially driving in a total of 183 runs—just one short of the AL record for the most RBIs in a single season, held by Lou Gehrig of the 1931 Yankees. At least that’s what Hank Greenberg’s official DBD records show. However, my in-depth and comprehensive investigation of each and every run scored by the Tigers revealed that there is one game with an error in the record:\n\nJune 20, 1937 (2nd game): Official DBD, 0 RBI; actual, 1 RBI ….. +1 RBI\n\nGreenberg actually had 184 RBIs—the same total that Lou Gehrig officially recorded in 1931.[fn]Trent McCotter reported the findings of his research on Gehrig’s RBIs in the 1931 season at the SABR national convention. While he discovered and corrected five games with RBI errors involving Gehrig, the net effect of correcting the errors was no change in Gehrig’s season total. See Herm Krabbenhoft and Trent McCotter, “Most Runs Batted In: By an Individual Player—During a Single Season—In the American League,” presentation at the National Convention of the Society for American Baseball Research (SABR), July 7, 2011, Long Beach, CA.[/fn] In his autobiography, Greenberg wrote, “My goal in baseball was always RBIs, to break Gehrig’s record of 184 RBIs. I would have loved to do that. I didn’t accomplish it, but I came awfully close.” As proven here, Hank came even closer than he thought.\n\n1938—Greenberg’s Almost-Ruthian Season. What could Hank Greenberg do in 1938 as an appropriate follow-up to his RBI performance in 1937? How about challenging the major league single-season record for home runs? Hammerin’ Hank fell just two homers short of tying Babe Ruth’s 60 in 1927. Greenberg’s 58 did match Jimmie Foxx’s 1932 major league record for right-handed batters (a figure which still stands in the American League). The homers helped him knock in 146 runs—according to the official DBD records. But I determined that there is one game which is incorrect:\n\nMay 4, 1938 : Official DBD, 0 RBI; actual, 1 RBI ….. +1 RBI\n\nSo, Greenberg actually had 147 RBIs—not 146.\n\n1939—Greenberg’s Not-Spectacular Season. In his autobiography, Greenberg states, “In 1939 the Tigers finished in fifth place. While I didn’t have a sensational year, I still led the team in hitting, with a .312 average [sic]; had 112 runs batted in, which was fourth in the American League; and hit 33 home runs, which was second in the league only to Jimmie Foxx, who hit 35. So, it wasn’t a total disaster as far as my personal record was concerned.”[fn]Gehringer actually led at .325.[/fn] But, according to my research, Hank did even better than he thought he did because of yet another error in his RBI statistics:\n\nJuly 2, 1939 : Official DBD, 1 RBI; actual, 2 RBI ….. +1 RBI\n\nSo, for the entire season, Greenberg actually had 113 RBIs, not 112.\n\n1940—Greenberg’s Third 150-RBI Season. According to the official baseball records, only 15 junior circuiteers have collected at least 150 RBIs in a single season. Lou Gehrig did it seven times, Babe Ruth five, Jimmie Foxx four, and Al Simmons and Hank Greenberg each three times. Hank’s third 150-RBI season came in the 1940 campaign according to his official DBD records. I found no errors or discrepancies in the 1940 season.\n\n1941—Greenberg’s First Two-Uniform Season. Before the 1941 regular season began, Greenberg was drafted into military service and scheduled for induction on May 7, 1941. Prior to donning US Army fatigues, Hank wore his Tigers uniform for Detroit’s first 19 games. According to his official DBD records, Hank batted in an even dozen runs in those 19 games. And, according to my research, the official DBD records are 100% correct with respect to Hank’s RBI performance in 1941.\n\n1945—Greenberg’s Second Two-Uniform Season. After having spent four years in military service, Greenberg was discharged on June 14, 1945, and gave up his Army khakis. After working out at Briggs Stadium for a couple of weeks, he returned to the baseball diamond wearing the “Old English D” on the first of July and slugged a home run. He went on to play in 78 games and drive in 60 runs according to his official DBD record. Had he played the entire season at that rate, he would have ended up with around 90 runs scored, 25 homers, and 120 runs batted in—the latter two figures would have topped the league. If he maintained his .311 batting average, as well, he would have claimed the triple crown. According to my research, there are no games with RBI errors in Greenberg’s official DBD records for 1945.\n\n1946—Greenberg’s Fourth RBI Crown. Throughout the history of the American League, several players have led the loop in RBIs in two or more seasons. With 127 official runs batted in during the 1946 campaign Hank Greenberg again captured the AL RBI throne. Significantly, it was Hammerin’ Hank’s fourth RBI crown. According to the list of the AL’s annual leaders in most RBIs presented in The Elias Book of Baseball Records, only one other AL player earned more first-place RBI trophies: Lou Gehrig, who finished first five times. Two other players led the AL in RBIs four times: Babe Ruth and Ted Williams.[fn]Ruth also led in RBIs before it became an official statistic, but pre-Elias records are outside the scope of this investigation.[/fn] Yet another significant aspect of Greenberg’s 1946 runs batted in blue ribbon is that with it he established the still-standing mark for longevity in being an RBI champion. Having first topped the league in 1935, Hank’s 1946 first-place certificate came 11 years later. The next-longest span between a player’s first and last RBI crowns is the 10-year span achieved by Teddy Ballgame (1939 and 1949). My research shows that there were no games with RBI errors in Hank’s official stats, and the 127-RBI record stands.\n\nSUMMARY\n\nFor Hank Greenberg’s American League career, I discovered 11 games with errors in his official RBI record. Chart 2 presents the pertinent details for each of the 11 games with errors. Also included are those players who were directly connected to the RBI errors for Greenberg.\n\nDISCUSSION\n\nThere are three topics that require discussion: (1) the reliability of the RBI information for Hank Greenberg presented in this article; (2) the consequences of making corrections to Greenberg’s official RBI record; (3) the implementation of the corrections in Greenberg’s RBI record.\n\nReliability of the RBI Information. The most important aspect of the information presented in Chart 2 is its reliability. Appendix Two compiles all the data used to determine the errors and provides the comprehensive supporting documentation for each of the RBI errors—and their corrections. Readers are encouraged to examine the evidence provided in Appendix Two, which is on the SABR website at sabr.org.\n\nIn the author’s opinion, each of the corrections is irrefutable and, in legal terminology, beyond reasonable doubt. Indeed, prior to the submission of this article, I provided the penultimate draft of the manuscript to three fellow SABR members for their assessments of the supporting documentation and my conclusions: David W. Smith, Tom Ruane, and Pete Palmer. Here are their assessments of the evidence:\n\nSmith: I have read the manuscript and have no changes to note. This is a fine job and is typical of your high standards for this painstaking research. Great job.[fn]David W. Smith, personal email, September 13, 2011 and December 3, 2011.[/fn]\n\nRuane: Thanks for the great work on this. Most of the games you discuss are pretty straightforward, with the exception of the June 15, 1934, game. In that case, I’m inclined to agree with your conclusions, but I would be surprised if Elias finds it definitive. Once again, I agree with your research on these eleven games.[fn]Tom Ruane, personal email, September 13, 2011 and 1 December 1, 2011.[/fn]\n\nPalmer: I believe your research is sound, so I don’t have any additional comments, except that we have to figure a way to handle these changes.[fn]Pete Palmer, personal email, October 13, 2011 and December 10, 2011.[/fn]\n\nCONSEQUENCES\n\nChart 3 presents the net effect of correcting the RBI errors in Hank Greenberg’s official American League DBD records. As can be seen, while Hammerin’ Hank “loses” two RBIs in both 1933 and 1935 and one RBI in 1936, he gains one RBI in each season from 1937 through 1939. Thus, overall, he actually had 1,200 RBIs in his AL career, two fewer than shown in Chart 1 and in most record books.\n\nThe most significant consequence of correcting the RBI errors in Greenberg’s official DBD records is that in 1937 he actually had 184 RBIs—the same number of RBIs credited to Lou Gehrig in his official DBD record for 1931, the number claimed by the Elias Book of Baseball Records to be the AL single-season record.\n\nThe inscription on the base of the statue of Hank Greenberg adorning Comerica Park will have to be changed. The inscription reads (in part):\n\nSELECTED AL MVP IN 1935 AFTER LEADING\n\nTHE LEAGUE WITH 39 HOMERS AND 170 RBI\n\nDROVE IN 183 RUNS IN 1937, ONE SHORT OF\n\nLOU GEHRIG’S 1931 LEAGUE RECORD\n\nAnother subject which the correction of RBI errors can impact is consecutive games batting in at least one run. The American League record is 14 games by Tris Speaker of the 1928 Philadelphia Athletics.[fn]Trent McCotter, “Record RBI Streak Discovered: Hall of Famer Tris Speaker Put Together a String of 14 Consecutive Games with an RBI in 1928 That Was Unrecognized for 79 Years,” Baseball Digest (May 2008): 62.[/fn] For Hank Greenberg, despite his impressive RBI totals, the longest Consecutive Games Run Batted In (CGRUNBI) streak he was able to achieve is the nine-gamer he assembled in 1937 from May 16 through May 25.[fn]The longest reported CGRUNBI streak for a Detroit Tigers player are the 12-gamers accomplished by Mickey Cochrane in 1934 and Rudy York in 1940; see Lyle, Spatz, Editor, The SABR Baseball List & Record Book, (2007): 145.[/fn] As it turned out, correcting the errors did nothing to unseat Speaker from the top of the CGRUNBI leaderboard.\n\nIMPLEMENTATION OF GREENBERG’S CORRECTED RBI INFORMATION\n\nThe final topic of discussion concerns the implementation of the corrected RBI information for Hank Greenberg: who is going to use it or where else will it appear?\n\nIn addition to the official DBD records compiled by the defunct Howe News Bureau for the American League, there are four fundamental databases of baseball statistics:\n\nPete Palmer’s database The Retrosheet database of game box scores and the derived daily statistical records for each player The STATS database The Elias Sports Bureau database\n\nAs previously indicated, Palmer has concurred with the corrections presented here. Since Palmer’s database of baseball statistics is contractually used by several prominent websites, including Baseball-Reference.com, Retrosheet.org, and SABR.org, implementation of these corrections will be broad-based and far-reaching. Similarly, Retrosheet’s Smith and Ruane have concurred and the corrections will be incorporated on the Retrosheet website. They have already been implemented in the Retrosheet database of box scores.\n\nWith regard to the STATS database, Don Zminda, a longtime SABR member and Vice President and Director of Research for STATS, explained, “We [STATS] have contractual relationships with some major media clients, and those clients expect us to match the official numbers reported by MLB.”[fn]Don Zminda, personal email, August 28, 2011.[/fn]\n\nThe “official numbers” for Major League Baseball are currently compiled by the Elias Sports Bureau.\n\nThe final draft of this article—including the comprehensive supporting documentation—was provided to Seymour Siwoff (president of Elias), requesting his review of the evidence and his concurrence with or rejection of my conclusions. Whether or not Elias concurs with my conclusions regarding the 1935 or 1937 seasons will be clearly evident in future editions of The Elias Book of Baseball Records, since it includes RBI leaderboards from 1920 forward. As shown in Chart 3 (above), Greenberg’s actual AL-leading figures are 168 RBIs (not 170) for 1935 and 184 RBIs (not 183) for 1937.\n\nElias has, in fact, made several statements regarding the RBI errors in the official DBD records for the 1937 Detroit Tigers players:\n\nIn a July 5, 2011, email to me, Steve Hirdt (executive vice president for Elias) wrote: “Thanks again for forwarding to Elias the work that you did on the Tigers RBIs in the 1937 season. As you know, as part of its duties for Major League Baseball, Elias reviews credible evidence potentially involving bookkeeping errors that affect statistics from past seasons, and makes judgments regarding whether a change is warranted. As you and I have discussed, the subject of your inquiry has some degree of complexity, and we want to be confident that we have gathered and evaluated all available evidence in order to make the best possible judgment. The material that you have forwarded to us will definitely assist in that effort. We hope to conclude that process and to reach a determination as soon as possible, consistent with the criteria for these matters.”[fn]Steve Hirdt, personal email, July 5, 2011.[/fn]\n\nIn a phone conversation with Seymour Siwoff on July 7, 2011, I asked if Elias would correct the RBI errors in the official DBD records for York and Greenberg for the second game of the double header on June 20, 1937. Here’s a close-to-verbatim version of what he said to me: “We can’t do this. It’s an embarrassment for us. We didn’t do it; Howe [News Bureau] did it. Do what you want; it’s a free country. Good luck; good luck.”[fn]Seymour Siwoff, telephone conversation, July 7, 2011; see also Cecilia Tan, “SABR 41: Day one research presentations,” Why I Like Baseball, www.whyilikebaseball.com, July 7, 2011.[/fn]\n\nIn an article in the Albany (NY) Times Union, Pete Iorizzo quoted Steve Hirdt as saying: “Herm is a dedicated researcher who has kindly shared with us the research that he did on RBIs for the Tigers’ 1937 season…. We are in the process of reviewing that material and trying to determine whether any other evidence exists that could be gathered and evaluated before making a judgment on the matter.”[fn]Pete Iorizzo, “Man Driven to Set the Record Straight,” Times Union (Albany, NY, July 10, 2011): C1.[/fn]\n\nIn an article in the Detroit News, Tim Twentyman wrote: “Krabbenhoft presented his findings to the Elias Sports Bureau, the official statistician for Major League Baseball, but thinks that Elias hasn’t amended the record because Gehrig is an icon.” “‘They do not want changes, especially in significant records involving icons,’ Krabbenhoft said. ‘Getting things changed by Elias is difficult.’” “But Steve Hirdt, executive vice president of Elias, says this particular case isn’t about protecting an icon. It’s about getting all the facts to make a decision with historical ramifications.” “‘As part of its duties for Major League Baseball, Elias reviews credible evidence that might involve bookkeeping errors,’ he said. ‘We hope to have a determination on it as soon as we can, but we want to determine if any other evidence exists, notably a play-by-play of the game. Herm’s evidence by some of the newspapers, while it suggests an error might have been made, and it looks like something may be fishy there, the key play involves a case where there was a runner on base and Greenberg hits a ground ball and at the end of the play someone had made an error and the run scored. However, I’ve not seen a play-by-play that indicates the runner started the play on third base or second base. We want to be satisfied before we announce a change and we’ve exhausted looking at everything we can look at,’ Hirdt said. ‘To this point, we have not concluded that effort.’”[fn]Tim Twentyman, “Greenberg Could Share RBI Mark,” Detroit News (July 22, 2011): B5.[/fn]\n\nIn an article in the Detroit Free Press, Steve Shrader quoted Hirdt as saying: “Where we are now is in the process of reviewing that material and trying to determine whether any other evidence exists that could be gathered and evaluated before we make a judgment.” And while Elias has made such changes, it doesn’t make such decisions lightly. It wants evidence “almost beyond a shadow of a doubt,” Hirdt said. “What’s the phrase, measure twice and cut once?” he said. “Well, we might add a zero. We might measure 20 times and cut once.”[fn]Steve Schrader, “Greenberg RBI Total Off Base?,” Detroit Free Press (August 2, 2011): B5.[/fn]\n\nWe await Elias’s determination. The final draft of this manuscript, including the comprehensive supporting documentation, was also provided to longtime SABR member John Thorn, Official Historian of Major League Baseball as well.\n\nCONCLUSION\n\nIn “Behind the Seams—the Stat Story,” a special program recently put out by MLB Productions, narrator Bob Costas says: “Numbers are the foundation of a lot of what we love and understand about the game of baseball. … They are numbers etched in memory and instantly and reverently recalled. They are a huge part of the foundation of baseball’s narrative. … The wealth of numbers begs to be analyzed, dissected and re-evaluated. … SABR’s research obviously impacts today’s game, but also seeks to confirm certain numbers from the past.”[fn]“Behind the Seams—the Stat Story,” MLB Productions, first aired on September 18, 2011.[/fn]\n\nLet’s reiterate that last clause: “SABR’s research … also seeks to confirm certain numbers from the past.”\n\nAs it has turned out, baseball’s official records, particularly those from the “pre-computer era” (i.e., prior to the early 1970s) are fraught with countless errors. For example, in my research on the longest consecutive games streaks for scoring at least one run by players on the Detroit Tigers, I discovered—and corrected—runs-scored errors in 13 games out of the 4,424 games the Tigers played during the period 1945 through 1972 (the last year that baseball’s official DBD records were compiled “by hand”). That corresponds to 99.71 % accuracy. For the period from 1973 forward, the official DBD records appear to be 100% correct with respect to the runs scored by the Tigers players.[fn]Dave Smith, personal email, November 14, 2006.[/fn]\n\nHowever, for the period from 1920 through 1944, I discovered—and corrected—runs-scored errors in 35 games out of the 3,871 games played by Detroit, corresponding to an accuracy of 99.10%. This value might seem pretty good on the surface but is totally unsatisfactory for ascertaining accurate consecutive game streaks for scoring at least one run. All told I have discovered—and corrected—a total of 83 runs-scored errors involving 56 players, including seven Hall of Famers: Al Kaline, George Kell, Hal Newhouser, Hank Greenberg, Charlie Gehringer, Heinie Manush, and Ty Cobb.[fn]Herm Krabbenhoft, “The Authorized Correction of Errors in Runs Scored in the Official Records (1945–2008) for Detroit Tigers players,” The Baseball Research Journal 37 (2008): 115.[/fn],[fn]Herm Krabbenhoft, “The Authorized Correction of Errors in Runs Scored in the Official Records (1920–1944) for Detroit Tigers players,” The Baseball Research Journal 40 (Spring 2011): 66.[/fn]\n\nMy conclusion is that one should not blindly rely on the statistics presented in baseball’s most popular encyclopedias (such as the Baseball-Reference.com website) and record books (such as The Elias Baseball Record Book). It is imperative that any researcher independently verify the accuracy of the statistics before drawing research conclusions.\n\nIt is my hope that others will also pursue research efforts to correct the errors in the official records for runs scored and runs batted in by the players on their favorite teams.\n\nACKNOWLEDGMENTS\n\nI would like to thank the following people for their fantastic cooperation in helping me complete the research needed to irrefutably correct the RBI errors in Hank Greenberg’s official DBD records: Ron Antonucci, Jeff Bartold, Freddy Berowski, Steve Boren, Rich Bowering, Keith Carlson, David Furyes, Mike Lynch, Bob McConnell, Trent McCotter, Mark Moore, Pete Palmer, Bernadette Preston, Dick Rosen, Tom Ruane, Dave Smith, Gary Stone, Dixie Tourangeau, and Tim Wiles.\n\nSUPPLEMENTAL MATERIAL\n\n\n\nView all of Herm Krabbenhoft’s online-only supplemental material here:\n\nHERM KRABBENHOFT, a SABR member since 1981, is a retired research chemist. His baseball research has focused on ultimate grand slam home runs, leadoff batters, triple plays, the uniform numbers of Detroit Tigers, and most recently, consecutive games streaks for scoring runs and batting in runs—which requires having accurate game-by-game runs and RBI statistics—which requires correcting the runs and RBI errors in baseball’s official records."}, {"url": "https://www.racctrusted.com/c/whitey-kurowski/biography/", "page_content": "A native of Reading, Pennsylvania, Kurowski overcame several personal problems. Kurowski overcame childhood osteomyelitis, which forced the removal of part of a bone on his right forearm. Before he started his baseball career, his older brother died in a mine accident, and his father died from a heart attack during spring training in 1942. His most productive season came in 1947, when he posted career-highs in average (.310), home runs (27), RBI (104), runs (108), doubles (27), slugging % (.544) and on-base % (.420).\n\n', '\n\n\n\nAn All-Star during five consecutive seasons (1943–47), Kurowski exceeded the 20 home run mark three times to set a major league record for a third baseman (1944–45, 1947), and hit over .300 three times (1945–47). He also led the National League three times in putouts, twice in fielding %, and once in double plays.\n\n', 'In four World Series appearances, Kurowski hit .253 (21-for-83) with one home run and nine RBI in 23 games, as the Cardinals were World Champions in 1942, 1944 and 1946. His only home run in the Series, in 1942, off Red Ruffing, broke a 2–2 tie in the ninth inning of Game Five to clinch the title for St. Louis over the New York Yankees. He also appeared five times in the MVP ballot, in 1942 and from 1944 through 1947.\n\n', '\n\n\n\nIn 1949, Kurowski developed arm and elbow problems and his playing career ended. After that, he coached and managed in the minor leagues for 18 years until 1972. He gained induction into the National Polish-American Hall of Fame in 1988.\n\n', '\n\n\n\n\n\nReturn to Whitey Kurowski Autograph Profile"}, {"url": "https://www.nytimes.com/1999/12/13/sports/whitey-kurowski-81-dies-beat-yankees-in-world-series.html", "page_content": "Whitey Kurowski, who surmounted a severe arm injury as a youngster and became one of the major leagues' top third basemen of the 1940's and a World Series hero for the St. Louis Cardinals, died last Thursday at a physical rehabilitation center in Shillington, Pa. He was 81.\n\nKurowski, who lived in Shillington, had been in failing health since suffering a stroke after heart bypass surgery in July, according to his wife, Joan.\n\nOn the afternoon of Oct. 5, 1942, a remarkable stretch of World Series success for the Yankees came to an end with one swing by a rookie infielder. George (Whitey) Kurowski's two-run home run off Red Ruffing into the left-field stands at Yankee Stadium in the ninth inning of Game 5 propelled the Cardinals to a 4-2 victory and a Series title, the first time the Yankees had been beaten in nine trips to the Series since they were defeated by the Cards in 1926.\n\nThat Kurowski was even in a major league uniform defied the odds. When he was growing up in Reading, Pa., he fell off a fence and landed in broken glass, severely cutting his right arm. Two years later, he began suffering severe pain and was found to have developed osteomyelitis, a bone inflammation. Three inches of bone above his wrist were surgically removed, leaving the arm weakened and with an unnatural bend. He strengthened his arm muscles as he embarked on a baseball career, but his right arm, his throwing arm, had become shorter than his left."}, {"url": "https://www.baseball-almanac.com/players/hittinglogs.php?p=kurowwh01&y=1945", "page_content": "Whitey Kurowski appeared in 133 Major League games during the 1945 regular season. The chart below is a comprehensive analysis of the games Kurowski appeared in, specifically relating to his 1945 hitting statistics. Notes: The Date / Box field has a link to the box score from the game being described. If the Date is followed by an asterisk (*), Kurowski started during that game at the first position listed in the Position(s) column. Cumulative monthly totals are provided where applicable.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that Whitey Kurowski appeared in 67 games at home, had 238 at-bats, drove in 48 runs, scored 35 times, had 77 hits (13 doubles / 1 triples / 8 home runs), walked 23 times (0 intentional), struck out 20 times, was hit by a pitcher 2 times, sacrificed 7 times (7 hits & 0 flies), and finished at home with a .323 batting average, .387 on base percentage and .487 slugging average?\n\nOn the road, Whitey Kurowski appeared in 66 games, had 273 at-bats, drove in 54 runs, scored 49 times, had 88 hits (14 doubles / 2 triples / 13 home runs), walked 22 times (0 intentional), struck out 25 times, was hit by a pitcher 3 times, sacrificed 5 times (5 hits & 0 flies), and finished at home with a .322 batting average, .379 on base percentage and .531 slugging average?\n\nAre you a Whitey Kurowski fan? Visit his page for comprehensive biographical data, year-by-year hitting stats, detailed fielding stats, pitching stats (where applicable), cumulative career totals for all stats, uniform numbers worn, salary data and other factual items-of-interest."}]}