{"NoFX's lyrics often focus on punk politics, humor, and pop culture.": [{"url": "https://genius.com/artists/Nofx", "page_content": "About NOFX\n\nTake the melody of The Descendents, some of Bad Religion’s political sense, add a handful of pills and there’s NOFX.\n\nScrewing up since 1983, the Californian group is one of the most influential bands in the history of punk rock. Rising in popularity during the 90’s, but never signing to a major label, remaining true to punk’s DIY roots, they released most of their stuff themselves or through Epitaph Records (owned by fellow punk rocker Brett Gurewitz from Bad Religion).\n\nSpreading sarcasm in every lyric, NOFX’s music range from hardcore punk to pop punk and even ska, but they’ve been doing it for so long and so characteristically that from the early days to their newest record, Single Album, it’s instantly recognizable: it sounds like NOFX."}, {"url": "https://www.grunge.com/287567/the-untold-truth-of-nofx/", "page_content": "NOFX formed in 1983, and five years later they had an incredible opportunity when Brett Gurewitz, lead songwriter and guitarist for legendary punk band Bad Religion (and founder of music label Epitaph Records), offered to produce an album for them. As noted in their book, NOFX: The Hepatitis Bathtub and Other Stories, the band scraped up $675 to record the album, and Gurewitz offered to release it on Epitaph. But the band wanted to launch their own label.\n\nPlus, NOFX themselves admit the album is awful. Lead singer Fat Mike considers the band's second album, 1989's S&M Airlines, to be their real first album and notes that NOFX was \"sounding, performing and behaving like sh*t\" prior to that. In fact, he says that the band had to rebuild their reputation from scratch with their second album because they had such a reputation for being terrible.\n\nIt's not just self-deprecation, either. Ron DePasquale at Allmusic.com says of the album, \"the sound is very raw and loose; the lyrics are slightly humorous at best and sophomoric at worst\" and speculates that the band just wasn't ready for the opportunity. After trying to sell the album on their own and failing miserably, NOFX sold the album to Epitaph after all, but it remains an album for dedicated fans only."}, {"url": "https://genius.com/Nofx-punk-guy-lyrics", "page_content": "Crazier than GG\n\nMore PC than Ian\n\nGot colored teeth like Johnny\n\nExudes a vicious disposition\n\nHis hair sticks out like Colin's did, he jumps\n\nSimilar to Springa, yeah\n\nVoted biggest asshole\n\nAnd role model of the year\n\nGot a face like Charles Bronson\n\nHe should've been on the cover\n\nHe should've been on the cover\n\nHe should've been on the cover of Punk and Disorderly, yeah\n\n[Verse]He points his middle finger[Chorus]Not just the singer in the bandStraight outta Green Bay, WisconsinNot just a singer in the band[Outro]He'll puke on youHe'll fuck your momHe'll smoke while huffing gasHe was the punkest mother fucker I ever did see\"Ah hell, he's even more punk than me\""}, {"url": "https://www.udiscovermusic.com/stories/punk-politics-music-rebellion/", "page_content": "Illustration: uDiscoverMusic\n\nIn Sex Pistols’ movie, The Great Rock’n’Roll Swindle, Malcolm McLaren gives an insight into the punk politics of the 70s, telling Helen Wellington-Lloyd that she should “never trust a hippie – look for the current event,” before admitting that Queen Elizabeth II’s Silver Jubilee provided the perfect political and populist subject for Sex Pistols’ anarchic rock’n’roll to “exploit to the hilt.”\n\nEntertaining though it is, no one’s saying that the film’s colorful version of events is what really went down in 1977. Yet, the late Pistols manager got one thing right: punk has never shied away from duking it out with mainstream politics. After all, if we recall punk’s original manifesto, wasn’t one of the main principles meant to be the adoption of an anti-establishment stance and a rejection of the political idealism of the day?\n\nPublic enemies\n\nCertainly, a strong political content is a common thread that weaves itself through the history of punk since the genre emerged as a musical force on both sides of the Atlantic during the mid-to-late 70s. Starting as they meant to go on, Sex Pistols immediately put the wind up the authorities by swearing on prime-time TV on the Today show, and they effectively became Public Enemy No.1 after the police shut down their infamous River Thames jubilee boat cruise in June 1977.\n\nADVERTISEMENT\n\nThe Pistols’ legendary singles “Anarchy In The UK” and “God Save The Queen” remain the clearest manifesto of punk politics on record, drawing the blueprint for virtually every political punk song of value, while The Clash’s self-titled 1977 debut contained Summer Of Hate-era classics “Career Opportunities,” “London’s Burning,” and their smart punky reggae cover of Junior Murvin’s “Police & Thieves,” dealing with issues such as unemployment, civil unrest, and police oppression – all topics which have since become political punk footballs.\n\nPunk also aligned itself with socio-political movements early on, with The Clash, The Ruts, Tom Robinson Band, Sham 69, and Stiff Little Fingers playing gigs in support of Rock Against Racism in the UK in 1978-79. Indeed, even as punk began to fragment into differing factions, those informed by punk’s ethics often retained a political focus, with The Slits, The Raincoats, and Gang Of Four tackling questions of consumerism and gender politics, and the growing political awareness of The Jam’s leader, Paul Weller, leading him to pen classic songs such as “Mr Clean,” “Down In The Tube Station At Midnight,” and “Eton Rifles,” in which he addressed political issues including right-wing-related violence and the British class system.\n\nThe Jam - Down In The Tube Station At Midnight\n\nWatch this video on YouTube Click to load video\n\nChanging political regimes in both the US and UK in the 80s also impacted on punk. Californian punk trailblazers Dead Kennedys’ first two singles, “California Über Alles” and “Holiday In Cambodia,” attacked political targets at home (Californian governor Jerry Brown) and abroad (Cambodian dictator Pol Pot), but, during the 80s, the band led the charge against America’s new conservative Republican president, Ronald Reagan, releasing brilliantly satirical albums such as Plastic Surgery Disasters and Frankenchrist, and organizing a series of Rock Against Reagan concerts.\n\nHow does it feel?\n\nThe era’s domestically repressive regime also helped spawn a newer breed of harder, faster “hardcore” punk acts such as California’s Black Flag, blistering Washington DC punk-reggae fusionists Bad Brains, and the same city’s Minor Threat, who advocated a “straight edge” mentality, abstaining from drink, drugs and eating meat – a philosophy akin to the UK punk collective Crass, whose anarcho-punk philosophy also put the emphasis on animal rights, feminism and ecological issues, while openly rejecting the methods of the mainstream music industry.\n\nBlack Flag - Rats Eyes - (Live at the Bierkellar, Leeds, UK, 1984)\n\nWatch this video on YouTube Click to load video\n\nThe punk politics of Crass and the UK’s other leading anarcho-punk outfits, such as Poison Girls and Conflict, also stood in vehement opposition to the British Conservative government, led by Margaret Thatcher, as did other pacifist-inclined UK punks such as Discharge and Charged GBH, who played a faster, more aggressive brand of punk (often now referred to as “UK82”) influenced by metal pioneers Motörhead.\n\nDuring the 80s, punk politics also led the charge in response to the UK’s brief but devastating war with Argentina over the Falklands Islands. Though coming from very different ends of the spectrum, new wave star Elvis Costello’s yearning “Shipbuilding” (performed by Robert Wyatt) and Crass’ seething anthem “How Does It Feel (To Be The Mother Of A Thousand Dead)?” were among the most resonant responses to the conflict. Later in the decade, punk-era luminaries such as Paul Weller, Billy Bragg and Tom Robinson also threw their weight behind a collective called Red Wedge, designed to foster support for the Labour Party against the Margaret Thatcher-led Conservatives in the UK’s 1987 election.\n\nIn the US, President George HW Bush failed to inspire the same level of rage as Ronald Reagan, though, in January 1991, punk played a major part during a memorable Gulf War protest concert staged in front of the White House while he was in residence. Organized by Washington DC activist collective Positive Force and headlined by ex-Minor Threat mainstay Ian MacKaye’s second legendary punk outfit, Fugazi, the event attacked both America’s burgeoning homelessness problem and North America’s involvement in Iraq.\n\nFormidable agents of change\n\nDuring the 90s’ alt.rock revolution, US bands such as Green Day, Rancid, and The Offspring inadvertently dragged punk politics back into the mainstream. However, after the horrific events of 9/11, President George W Bush came to represent everything that was wrong with US politics, and the country’s punks protested en masse in the early years of the 21st Century.\n\nRecalling Dead Kennedys’ Rock Against Reagan shows, punk outfit NOFX organized a series of Rock Against Bush concerts and compilations which drew widespread support from the contemporary punk community. A little later, in 2004, punk politics again hit the headlines when Green Day’s outspoken American Idiot album (written partially in response to the band’s view that the media was brainwashing the US public) arrived in a sleeve with artwork inspired by Chinese Communist propaganda, yet went on to sell six million copies in the States and reignited the band’s popularity with a younger generation.\n\nThe digital age has made grassroots punk activism easier to organize, and punk as a potent political force continues to rear its head. In 2012, Russian feminist punk collective Pussy Riot became household names after three of their members were sent to prison for “hooliganism motivated by religious hatred” following their arrest during a guerrilla gig at Moscow’s Cathedral Of Christ The Saviour. Elsewhere, Icelandic punk turned politician Jon Gnarr formed the Best Party in the wake of the country’s financial meltdown, in 2008, and, after he was elected mayor of Reykjavik, his party of ex-punks successfully ran the country for four years, employing ideals based upon Crass’ anarcho-punk philosophy.\n\nAnti-Flag - American Attraction\n\nWatch this video on YouTube Click to load video\n\nIn the US, too, the country’s most politically-aware alt.rockers remain vigilant in the age of fake news and alternative facts. To this end, punk-influenced grunge stars Pearl Jam recently donated 90 percent of the profits from their Seattle stadium shows to helping the city’s homeless, while acts such as Pittsburgh punks Anti-Flag and incendiary rap-punk crossover supergroup Prophets Of Rage continue to speak eloquently against injustice.\n\nNone of it will take us back to 1977 for a second time, but the best of our politically-motivated punk bands have it in them to be formidable agents of change.\n\nListen to the best punk music on Spotify."}, {"url": "https://www.rollingstone.com/music/music-news/nofx-break-up-2023-1234586045/", "page_content": "NOFX will call it quits in 2023. “Fat Mike” Burkett, singer and bassist of the punk rock group, announced the pending split in a reply to an Instagram comment on an unrelated post, noting that next year “will be our last year.” Rolling Stone has confirmed the news.\n\nAsked why the band doesn’t come to Canada more often, Fat Mike replied, “Actually, we love Canada, it’s just that next year will be our last year. We will be announcing our final shows soon. It’s been an amazing run….” In response to a separate comment, the musician added, “Los Angeles will be the last place we play. It’s where we started, it’s where we’ll end.”\n\n2023 would be a fitting conclusion for the prolific band as it marks NOFX’s 40th anniversary. The group’s most recent release, Single Album, dropped in 2021 on Fat Mike’s label Fat Wreck Chords. NOFX was formed in Los Angeles in 1983, and together they have released 14 full-length albums.\n\nEarlier this year, Fat Mike collaborated with rapper the D.O.C. after the pair met through documentary producer Gary Ousdahl. The punk rocker played D.O.C. some music he had been recording with a new group called the Codefendants, which led to the pair recording the joint song “The Fast Ones,” which dropped in June.\n\n“I have such a new respect for hip-hop,” Fat Mike told Rolling Stone of the song. “I’m fucking 55 and I get to do new stuff. No matter how good a NOFX record is, who cares? I mean, people care. Our record last year got great reviews … [but] I think this is the best record I’ve ever produced.”\n\nNOFX has not yet made an official statement addressing the breakup."}, {"url": "https://consequence.net/2016/07/a-brief-history-of-punk-rock-and-presidential-politics/", "page_content": "Photo by Debi Del Grande\n\nPunk as Fuck is a monthly column in which Associate Editor Collin Brennan discusses issues in punk music and culture. With the Republican National Convention one week away, this inaugural column explores the many ways in which punk has inserted itself into presidential politics.\n\nSince its inception in the 1970s, punk rock has never shied from jumping into the ring with mainstream politics. The genre (or the movement, if you prefer) positioned itself as a rejection of political idealism from the outset, whether it was the Sex Pistols hijacking Queen Elizabeth II’s Silver Jubilee or Dead Kennedys using the occasion of their first single to declare California Governor Jerry Brown a fascist pig.\n\nRelated Video\n\nAs punk evolved over the years, it split into subgenres with different ideologies and approaches to politics. In the ‘80s, DIY hardcore bands such as Fugazi and the Minutemen took a more ground-level view, their rigid ethical stance based less on getting out the vote than on playing safe, affordable shows at non-corporate venues. Other American punk bands, such as New York City’s Reagan Youth and Michigan’s Crucifucks, took a different tack, aggressively (and often hilariously) confronting national movements such as the Young Republicans and the Christian Right.\n\nAdvertisement\n\nAs the years passed and the White House swapped residents, punk saw its place in the national political conversation shift, too. The ‘90s brought the rise of pop punk and emo, subgenres that predominantly cast politics aside in favor of a more palatable brand of male romanticism. Bands such as Green Day and enterprises such as the Vans Warped Tour solidified punk’s connection with mainstream culture, giving the genre more of a platform but making it harder to take seriously.\n\nRage Against the Machine and other outspoken groups counteracted this trend somewhat, but they also had to work from within an uncomfortably corporate framework to spread their radically progressive, anti-consumerist ideas (“Know Your Enemy”, right?). The disastrous presidency of George W. Bush gave punk bands an easy target in the 2000s, but the genre was growing into an easier target itself.\n\nThese days, it’s difficult to tell what role punk rock has in shaping political narratives. In light of the Black Lives Matter movement and the growing focus on racial inequality, hip-hop and R&B seem like the more potent vehicles for social change. While artists such as Kendrick Lamar and Beyoncé steer the national conversation toward more progressive issues (and take legitimate risks in doing so), punk is hanging out on the fringes, a traditionally white, traditionally male genre searching for a new injection of relevancy. Groups such as Downtown Boys and G.L.O.S.S. are a good start, as is, surprisingly, the newly formed supergroup Prophets of Rage.\n\nAdvertisement\n\nWith the Republican National Convention and its attendant dunghill set to invade Cleveland next week, the US is on the brink of what once seemed unthinkable: a presidential election starring combustible potato sack and progressive Public Enemy No.1 Donald J. Trump. If Trump’s positions on immigration (kick ‘em out), foreign policy (kill ‘em all), and civil liberties (take ‘em away) aren’t enough to get punk engine’s back into full swing, nothing will be. Fortunately, it looks as if things are already headed that way, according to rumors that Prophets of Rage may attempt to crash the RNC and kick off a presidential season in which punk may actually mean something.\n\nIn light of this development, and in honor of scumbag politicians everywhere, let’s look back on the past five commanders-in-chief and consider what the prominent punk musicians of the time had to say about them. This is by no means an exhaustive history, but hopefully it functions as a reminder of a time in presidential politics when punks weren’t content to sit on the sidelines.\n\nThe Reagan Era (1981–1989)\n\nRock Against Reagan concert flyer\n\nPunk may have been born under Gerald Ford and Jimmy Carter, but it came of age during the Reagan years. Swept into office on a wave of hardcore conservatism, Ronald Reagan was the direct result of white Americans feeling scared about an influx of minorities and trying desperately to hold onto a way of life rooted in a steep economic advantage over everyone else.\n\nAdvertisement\n\nThis, of course, was the exact way of life punks at the time were so intent on rebelling against. Black Flag released “White Minority” in 1980, the same year Reagan successfully ran for office, and the song’s lyrics drip with sarcasm. “Gonna be a white minority!,” screams Latino vocalist Ron Reyes, stoking the fears of white suburbanites and revealing the underlying racism fueling Reagan’s campaign.\n\nDead Kennedys also led the charge against Reagan, helping to organize a series of concerts called “Rock Against Reagan” in cities such as San Francisco, Washington, DC, and Dallas. Joined by MDC and other political punk bands featured on singer Jello Biafra’s independent Alternative Tentacles label, Dead Kennedys drew headlines with public, provocative performances at Dolores Park and DC’s National Mall.\n\nPerhaps the best way to calculate punk’s response to Reagan, however, is simply to look at the artwork that dominated punk singles and LPs at the time. The Gipper inspired an impressive amount of obscene and hilarious illustrations, several of which poked fun at his penchant for jellybeans and others which made no qualms about comparing him to hate groups such as the KKK and Hitler’s Nazis. Flyers everywhere advertised bands with names like Reagan Youth, Domino Theory, Agnostic Front, and Capitol Punishment, all expressing their distaste for the neoliberal policies that dominated the Reagan era.\n\nThe George H. W. Bush Era (1989–1993)\n\nAdvertisement\n\nFugazi at the White House // Photo via Dischord Records\n\nThe milquetoast George H. W. Bush failed to inspire the same level of rage as his predecessor, but punk maintained a healthy stance of opposition throughout his short presidency. No event embodies the punk spirit of this era more fully than the Gulf War protest concert staged in front of the White House on January, 12, 1991. Organized by the activist collective Positive Force and headlined by DIY post-punk legends Fugazi, the event was initially conceived as a response to America’s homelessness problem. It morphed into something more geopolitical in scope when Bush announced the beginning of Operation Desert Storm.\n\nThanks to the genre’s rise in mainstream culture, other punk bands were pulled into Desert Storm in ways they had never intended. The Clash’s “Rock the Casbah” — a song loosely inspired by Iran’s ban on Western music — was reportedly the first song Armed Forces Radio chose to broadcast during the operation, which probably isn’t what the band had envisioned. In any case, punk remained a vital force throughout the first years of the ‘90s, as evidenced by the rise of riot grrrl, an explicitly politicized feminist movement with origins in DC’s self-publishing culture.\n\nThe Clinton Era (1993–2001)\n\nAlbum Cover: Fugazi – In on the Kill Taker (1993)\n\nIf you think a Democratic president might incite less ire among the punk community than a Republican, you’re both right and wrong. Bill Clinton’s election in 1993 was less of a reaction against conservatism than it was an indictment of Bush’s ineffectual first term, and the new president was about the furthest from revolutionary a politician could be. Punks gave Clinton some time to prove them wrong, but they responded with vigor once they realized he was more of the same. A case in point: Rage Against the Machine hosted a radio broadcast in Los Angeles on the night of Clinton’s second Presidential inauguration, inviting other musicians and political commentators to voice their displeasures over a rigged political system. Later, the band would hold a free concert at the 2000 Democratic National Convention to usher in a tumultuous end to the Clinton era.\n\nAdvertisement\n\nStill, the Clinton years are defined more by general angst than by a direct movement opposed to the sitting President. While punk shifted to a more pop-friendly sound in the mid-’90s, popular bands such as Green Day, Blink-182, and The Offspring steered away from controversy by writing more or less apolitical songs. Bands such as Rage and Fugazi carried the mantle, with the former attempting to fly the American flag upside down on SNL in protest of Republican presidential nominee Steve Forbes and the latter releasing two of their most politicized records, 1993’s In on the Kill Taker and 1995’s Red Medicine, during Clinton’s first term as President.\n\nThe George W. Bush Era (2001–2009)\n\nGeorge W. Bush gave punk rock the easiest, juiciest target since Reagan, and bands took the bait with a level of enthusiasm that hadn’t registered since the late ‘80s. Presiding over one of the most disastrous presidencies in US history in the aftermath of 9/11, Bush came to represent everything wrong with American politics, from the corporate greed that led to the invasion of Iraq to the Christian conservatism that led to a radically right-wing remake of the Supreme Court (and thus restricted rights for gays and women).\n\nThe biggest punk pushback against the Bush presidency came in the form of the Rock Against Bush and Punk Voter projects, both founded by Fat Mike of NOFX and Fat Wreck Chords. A direct descendant of the Rock Against Reagan campaign of the ‘80s, Rock Against Bush consisted of a series of concerts and compilation albums conceived in opposition to the Iraq War and the Bush presidency in general. The compilations featured entries from the likes of Alkaline Trio, Sum 41, Descendents, and other hugely popular punk bands that weren’t exactly known for taking a strong stance on anything beyond their current love life.\n\nAdvertisement\n\nThis is probably what made Rock Against Bush so impactful; whether Fat Mike knew it or not, he was mobilizing the punk community in a way that hadn’t been seen in over a decade. All of this in spite of the rising emo trend, which showered itself in eyeliner and male insecurity and threatened to push punk rock permanently into joke territory. Thankfully, Drive-Thru Records and the like didn’t succeed.\n\nFat Wreck Chords, on the other hand, had a goddamn field day with Bush. Aside from the comps, the label featured some of the most pointed Bush criticism of the era. Against Me!’s 2005 album, Searching for a Former Clarity, stands apart as the best of the label’s anti-Bush screeds (it even features a bizarro love song for Condoleezza Rice). Against Me! have obviously come to symbolize the struggle for gender equality, but before that, the band did everything they could to position themselves as a force in presidential politics. Hence their appearance in a PSA for Rock the Vote in the lead-up to the 2008 presidential election, which met with mixed reviews from the true believers but probably did end up getting some butts off the couch.\n\nThe Obama Era (2009–Present)\n\nLooking around America circa 2008, it would have been difficult to find any progressive voices — punk or otherwise — criticizing Barack Obama. The moderate liberal US Senator from Illinois rode into the office on a wave of goodwill, promising sweeping changes from the way things had been under Bush. Not everyone from the punk community bought into Obama immediately, though. In an open letter posted to the Alternative Tentacles website, Biafra voiced his hesitance:\n\nYou are the first president in my lifetime to have a bona fide grassroots movement behind you and ready to rock. I hope those crowds’ hope and urgency has penetrated deeply enough that you won’t let that bridge be washed away.\n\nI remember another person who had the audacity to exploit and toss aside people’s hope, and his name is Bill Clinton. Democrats fail time and again when they shirk responsibility and settle for being dealmakers instead of leaders. As important as it is to find common ground and build consensus for change, our situation is so dire we cannot afford any more dealmakers. The people voted for a leader. Anything less risks breaking the hearts of an entire galvanized generation who may then decide it is not worth it to get involved and participate any more.\n\nAdvertisement\n\nOther politically outspoken punk musicians took a softer stance on Obama, including Fat Mike, who hailed his second election in 2012 as a “slam dunk” and sent Punk Voter to an early grave. Punk music in general has lost a great deal of its anti-establishment mojo in the years since Obama came into office, partially because the critics have become less outspoken and partially because, well, punk may not be the prescription we need anymore.\n\nJust look at the 2016 election and its most vocal progressive candidate, Bernie Sanders. Though Sanders bowed out of the race this week, his campaign was notable for inspiring a level of support among the music community that had never been seen before. The 74-year-old Vermont senator’s democratic socialist platform inspired events such as Brooklyn Is Berning and the Red Hot Chili Peppers’ Feel the Bern concert in LA. Smaller punk benefits have been held in cities across the country, but prominent punk voices have largely been muted. The sexier and/or more vocal endorsements — Killer Mike, Lil B, Jenny Lewis — came from other genres (though punk notables, including Biafra and Mike Watt, did sign an endorsement on Sanders’ website).\n\nDesign by Mark Mendez and Rob Campbell\n\nSanders may no longer be an option, but the punk community needs to get its political act together in a hurry. Whatever Prophets of Rage are planning for the RNC next week may serve as a catalyst or invitation for punk voices to return to mainstream politics. But it’s just as likely to register as a blip, an aberration in an era when punk and alternative music don’t hold the same cultural sway they once did. For the sake of the genre and the country’s health, it’s high time that punk rock started fucking shit up again."}, {"url": "https://www.lyricsondemand.com/n/nofxlyrics/thepunksonglyrics.html", "page_content": "Am I supposed to do things right? No!\n\nI don't have the time\n\nThis is how I live my life\n\nI haven't got much pride\n\nAnd it's ok if I live like a slob\n\n'Cause this is my life,\n\nand I will waste it if I want,\n\n\"A wasted life ain't no crime\""}, {"url": "https://www.liveabout.com/political-punk-bands-2803360", "page_content": "If you've recently opened a newspaper, turned on the TV or taken a look at any media, you're already sick of all the politics flying around. Even so, here are 10 (technically 11) political punk bands you should know. They won’t tell you who to vote for, but they will open your eyes, and they won’t give you a headache like the political commentary on Fox News will.\n\nSince its inception punk rock has, as often as not, been a forum for political expression, and political punk bands have always been around. Many of punk bands use their music as a vehicle for spreading ideas and to motivate their audiences toward political change.\n\nCrass Stations of the Crass. Crass Records Formed in England 1977, Crass were one of the founders of political punk and the founders of the anarcho-punk movement. The band picked up many ideals from bands from the ‘60s, and in addition to spreading their anarchist beliefs, the band advocated feminism, anti-racism, environmentalism and animal rights. While the band’s political beliefs are easy to lay out, their sound is not. It’s often confusing to the uninitiated. Angry rants are laid out alongside heavy blasts of hardcore guitar and drum noise and interspersed with tape loops and sound collages. It may take some work to wrap your head around, but Crass is worth getting to know. Essential album: Stations of The Crass\n\nTrademark political song: \"White Punks on Hope\"\n\nAnti-Flag Underground Network. Fat Wreck Chords A relatively recent arrival to the political punk scene, Anti-Flag is still one of the most political, standing up against war and capitalism, and addressing such issues as fascism in the punk scene, American foreign policy and racism. Their anti-capitalist position attracted a lot of criticism when they signed with RCA Records. Detractors said the band had sold out and would lose its passion and voice. Anti-Flag’s best defense against this was to simply not tone down their message or stance, and to let their music speak for itself. Essential album: Underground Network\n\nTrademark political song: \"Die For the Government\"\n\nMinor Threat Minor Threat. Dischord Although they only existed for a few years, Minor Threat's influence on punk music is undeniable. Not only did the band create a sound that was influential for all hardcore bands that would follow, they inspired straightedge. A song on their first EP, “Straight Edge,” with its anti drug and alcohol stance, launched a dedicated movement that continues today, putting Minor Threat in the ranks of political punk bands whether or not they intended it. Minor Threat frontman Ian MacKaye has gone on to front many other influential groups, most notably Fugazi, and to co-found Dischord Records, a label with a strong identity and DIY ethics. Essential album: Complete Discography\n\nTrademark political song: \"Straight Edge\"\n\nAgainst Me! Searching For a Former Clarity. Fat Wreck Chords Arguably one of the most popular modern anarchist bands, Against Me! has helped bring anarchist ideals to the masses, as well as the ever-popular anti-war, anti-Bush stance. The band combines elements of the original anarcho-punk movement and folk rock, and ends up coming across as a band less focused on a genre, and more intent on expressing their ideas effectively through simply making great music. Essential album: Searching For A Former Clarity\n\nTrademark political song: \"White People For Peace\"\n\nNOFX Punk In Drublic. Epitaph Records The clown princes of political punk rock, NOFX veers toward satire with their politics. Nobody is safe from Fat Mike’s sarcasm, and the band has, over the years, targeted political, social, religious and gender-based issues. NOFX also makes a point of avoiding mainstream media and major record labels. They made few videos, and would not let them air on MTV or similar music channels. Fat Mike founded Fat Wreck Chords, the label responsible for the Rock Against Bush compilations. He is also the man behind Punk Voter, an organization focused on getting America’s youth registered to vote and educated on political issues. Essential album: Punk In Drublic\n\nTrademark political song: \"The Brews\"\n\nPropaghandi Less Talk, More Rock. Fat Wreck Chords A Canadian anarchist band, Propaghandi is another band that managed to be overtly political, while still maintaining a hook and not sounding overly preachy. Although recent releases have found the band exploring more metal-based influences, their earlier records were pop-punk explosions that attacked racism, capitalism and just about any other -ism the band could think of. Chris Hannah and Jord Samolesky, founders of Propaghandi, also founded the now-defunct record label, G7 Welcoming Committee, a label focused on giving a voice to bands and political speakers who had radical points of view. Essential album: Less Talk, More Rock\n\nTrademark political song: \"And We Thought That Nation-States Were a Bad Idea\" (Free Download)\n\nRise Against The Sufferer & The Witness. Geffen Recordings While this Chicago hardcore band’s “pet issue” is animal rights and vegetarianism (along with their open support of PETA), and speaking out against sport hunting, factory farming and other animal rights-related issues, Rise Against, especially vocalist Tim McIlrath, is openly liberal in many other areas, speaking out for human rights (as well as animal) and against the current political administration. Their video for “Ready to Fall” was a sometimes disturbing look at environmental issues and the way they affect wildlife, and animal cruelty in general. It can be viewed here. Trademark political song: \"Drones\"\n\nDead Kennedys Fresh Fruit For Rotting Vegetables. Cleopatra Records A major player in the ‘80s hardcore scene, the Dead Kennedys were critical of ‘80s capitalism and culture, taking aim at the Reagan administration and economic policies, and the commercialization of punk rock music. In 1986, the band was brought up for obscenity charges based on a Giger poster included with their album Frankenchrist. The band was eventually acquitted, though they disbanded during the trial, due to legal costs. After the band’s breakup, frontman Jello Biafra went to become a spoken word activist, politician and a co-founder of Alternative Tentacles, a label with a partial political focus. Essential album: Fresh Fruit For Rotting Vegetables\n\nTrademark political song: \"California Uber Alles\"\n\nI Object! Teaching Revenge. Alternative Tentacles One of the most fiercely political hardcore bands running at the moment, upstate New York’s I Object! stands behind the straightedge vegan lifestyle. Fronted by Barb Object, the band tackles a wide range of issues, from abortion to healthcare to prison reform, and presents issues in a positive way, motivating for change. A refreshing part of the band’s politics that sets them apart from many similar bands is their ideal that veganism and straightedge are personal decisions, and that preaching either way of life or being militant about it simply makes people uncomfortable and causes division in the punk scene. Essential album: Teaching Revenge\n\nTrademark political song: \"Empty Minds = Empty Lives\""}, {"url": "https://genius.com/Nofx-a-theme-from-a-nofx-album-lyrics", "page_content": "We're professional punkers\n\nWe come from the suburbs\n\nAfter 15 years, we're still having fun\n\nNow we're over 30, not looking so purty\n\nAt least we got a beat up accordion\n\nThat's Erik our drummer, his father's a plumber\n\nHe drank enough booze to get Rhode Island drunk\n\nNow sober but smelly he's got one big belly\n\nFrom livin' the good life provided by punk\n\nThat's Melvin on six-string \"some tell me I can't sing\"\n\nOh I think you can just don't do it 'round me\n\nStick with what you know playing guitar solo\n\nWith Hetson and Watt in punk karaoke\n\nSingin' singin' singin'Buy me a Becks beer or pass me a bongGimmie some Bushmills I'll sing you this songOpen another big box of cheap wineWe're over 30 we're doing just fineHefe's not satanic he's one hip HispanicHe grew up with one dozen cousins and kinHe wears baggy pants he know how to break-danceYou've seen him do every impersonation"}, {"url": "https://genius.com/Nofx-the-punk-song-lyrics", "page_content": "4 Contributors The Punk Song Lyrics\n\nAm I supposed to do\n\nThings right? NO\n\nI don't have the time\n\nThis is how I live my life\n\nI haven't got much pride\n\nAnd it's ok if I live like\n\nA slob cause this is my\n\nLife, and I will waste\n\nIt if I want, \"A wasted\n\nLife ain't no crime\""}]}