{"NoFX is an American punk rock band from Los Angeles, California.": [{"url": "https://www.latimes.com/entertainment-arts/music/story/2022-09-02/nofx-breakup-in-2023-after-40-years", "page_content": "NOFX, the Los Angeles punk band known for “Linoleum” and “Don’t Call Me White,” will be no more in 2023.\n\nOn Wednesday, frontman Fat Mike casually dropped the news in the comments section of a post on his Instagram page. A frustrated fan asked the singer-bassist why NOFX “barely” performs in Canada. The fan received a response, but it probably wasn’t the one expected.\n\n“Actually, We love Canada, it’s just that next year will be our last year,” Fat Mike, whose real name is Michael John Burkett, replied. “We will be announcing our final shows soon. It’s been an amazing run.”\n\nThat run began nearly 40 years ago in 1983 with Fat Mike, guitarist Eric Melvin and drummer Erik Sandin as the founding members. In 1991, Aaron “El Hefe” Abeyta joined the group as lead guitarist and trumpet player.\n\nMusic Punk, Politics and Platitudes From NOFX Musically, there isn’t much that distinguishes L.A.’s NOFX from countless other neo-punk outfits.\n\nAdvertisement\n\nResponding to a separate comment on his Instagram post, Fat Mike said, “Los Angeles will be the last place we play. It’s where we started, it’s where we’ll end.”\n\nNOFX has yet to release an official statement on the impending breakup, but Rolling Stone confirmed the news.\n\nThe band released its first recording, “Thalidomide Child,” in 1984 and dropped its first self-titled EP a year later.\n\nNOFX’s debut album, “Liberal Animation,” arrived in 1988 and featured songs such as “Beer Bong” and “Shut Up Already.” A sophomore album, “S&M Airlines,” was released in 1989.\n\nMusic Nose-Thumbers NOFX as Obnoxiously Fun as Ever Although MTV exposure virtually guarantees bands a certain amount of success, there is a small but exceptional network of (mostly punk) rock groups that shun the commercial machine and still manage to sell tons of records.\n\nIn the ’90s, NOFX rose to popularity as part of a wave of California punk bands that included Green Day, the Offspring and Rancid. That decade proved to be a busy as NOFX released six albums including “Ribbed” (1991), “Punk in Drublic” (1994) and “Heavy Petting Zoo” (1996).\n\n“Its musicianship has improved since it formed in the mid-’80s, and despite singer-bassist Fat Mike’s unremarkable voice, NOFX easily holds its own alongside such contemporaries as Green Day, the Offspring and Rancid,” The Times wrote in February 1998.\n\nThe band’s latest album was 2021’s “Single Album,” which came nearly five years after “First Ditch Effort.”\n\nSince May, NOFX has been making its way around Europe and North America as part of its Punk in Drublic festival. The band will next perform on Saturday at the Edmonton Expo Centre in Alberta, Canada."}, {"url": "https://www.songkick.com/artists/214756-nofx", "page_content": "In 1983 Mike Burkett (Fat Mike) and Eric Melvin met and started the band, and were later joined by Erik Sandin. The group released their first album in 1985 with Mystic Records. The band then underwent a lineup change, but through the changes, the original three members remained intact. In 1986 the band released an album attacking the PMRC (Parents Music Resource Center) for their campaign against music censorship with “The P.M.R.C Can Suck On This.” Following this album was “Liberal Animation” in 1988, which was recorded with Bad Religion’s Brett Gurewitz.\n\nThe collaboration with Gurewitz led to the band signing with Epitaph Records, and releasing their third studio album “Ribbed.” Shortly after the release, Aaron Abeyta, aka El Hefe, replaced Steve Kidwiller on guitar, followed by “White Trash, Two Heebs and A Bean” being released in 1992. In 1994 they released their best selling album, “Punk in Drublic” and received support from the mainstream media, as well as reaching certified gold.\n\nFollowing a series of record releases that all fared well, the band made the move to sign with Fat Wreck Chords in 2005. The band continued to release albums that challenged the social and political systems that they didn’t agree with, and did so in true punk fashion."}, {"url": "https://returnofrock.com/nofx-songs-ranked/", "page_content": "NOFX (/ˌnoʊɛfˈɛks/) is an American punk rock band, formed in Los Angeles, California in 1983. Vocalist/bassist Fat Mike, guitarist Eric Melvin, and drummer Erik Sandin are original founding and longest-serving members of the band, who have appeared on every release of the band, although Sandin departed briefly in 1985 only to rejoin the following year. El Hefe joined the band in 1991 to play lead guitar and trumpet, rounding out the current line-up. Their latest studio album, First Ditch Effort, was released on October 7, 2016. The group has sold over eight million records worldwide, making them one of the most successful independent bands of all time. NOFX broadcasts its own show on Fuse TV entitled NOFX: Backstage Passport. Here are all of the NOFX albums ranked.\n\nDon’t miss out on the TIMELESS NOFX music below! Click to experience the band at their finest!\n\n12. Vincent (45 or 46 Songs That Weren’t Good Enough to Go on Our Other Records, 2002)\n\n“I know they say this is their worst stuff, but to me it’s some of their best. It shows a lot of the more human side of nofx that they show in their older stuff (before war on errorism) and the half-made “crap” songs sometimes show the full potential of nofx for doing whatever the hell they want and making it look good anyway.”\n\n11. All His Suits Are Torn (So Long and Thanks for All the Shoes, 1997)\n\n“In my opinion, this is one of NOFX’s most eclectic albums because of the blend of blazing skate punk, the gentler punk rock songs edging on pop punk, and then the straight-up ska punk.”\n\n10. 72 Hookers (Self / Entitled, 2012)\n\n“Looking at the lyrics, this is a song about what motivates terrorists to do what they do. Looking deeper, it becomes a protest about why we should pity terrorists rather than just hate them. Fantastic guitar work; a fun, catchy tune and though provoking lyrics without being overly serious or maudlin.”\n\n9. Happy Guy (Punk in Drublic, 1994)\n\n“There’s nothing I don’t enjoy about the album but it’s also not a record I admire or deeply love, it’s what it is, one of the best skate punk albums, with lyrics that are just as dumb as the one on Smash, and vocals that I like even though they barely hit a right note.”\n\nSee more: NOFX Albums Ranked\n\n8. The Brews (Punk in Drublic, 1994)\n\n“Punk at its best. NOFX is true to the punk genre and The Brews is one of the best songs on this album.”\n\n7. Seeing Double at the Triple Rock (Wolves in Wolves’ Clothing, 2006)\n\n“The best fast song is Seeing Double At The Triple Rock which is just them doing what they’ve always done well.”\n\n6. Bath of Least Resistance (45 or 46 Songs That Weren’t Good Enough to Go on Our Other Records, 2002)\n\n“This is one of those cd’s that you can listen to over and over again and not get sick of it. it’s catchy without being pop-ish. every song has intelligent lyrics and the instruments are… incredible. great cd overall. I can’t tell you enough.”\n\n5. Bob (White Trash, Two Heebs and a Bean, 1992)\n\n“Bob’s a good song if you don’t mind those stupid ska horns. That skinny dreadlocked dude rips on lead guitar and their drummer is pretty good too!\n\nSee more: Darius Rucker Albums Ranked\n\n4. Dinosaurs Will Die (Pump Up the Valuum, 2000)\n\n“Dinosaurs Will Die” is arguably the third most offensive, insulting the five main US record companies and how they have followed the same ‘tradition’ of a seven-record deal, all seven records only having “one good song.”\n\n3. Franco Un-American (The War on Errorism, 2003)\n\n“Franco Un-American” is about being aware of the problems in the world. What makes this track stand out is the use of keyboards, and it sounds great.”\n\n2. Linoleum (Punk in Drublic, 1994)\n\n“As soon as your needle drops, your immediately punched in the face by the roaring opening guitar riffs from linoleum, that sets the tone of the album as a exhilarating ride!!!”\n\n1. The Decline (The Decline, 1999)"}, {"url": "https://returnofrock.com/nofx-albums-ranked/", "page_content": "NOFX is an American punk rock band, formed in Los Angeles, California in 1983. Vocalist/bassist Fat Mike, guitarist Eric Melvin, and drummer Erik Sandin are original founding and longest-serving members of the band, who have appeared on every release of the band, although Sandin departed briefly in 1985 only to rejoin the following year. El Hefe joined the band in 1991 to play lead guitar and trumpet, rounding out the current line-up. Their latest studio album, First Ditch Effort, was released on October 7, 2016. The group has sold over eight million records worldwide, making them one of the most successful independent bands of all time. NOFX broadcasts its own show on Fuse TV entitled NOFX: Backstage Passport. Here are all of NOFX Albums Ranked.\n\nDon’t miss out on the TIMELESS NOFX music below! Click to experience the band at their finest!\n\n8. Wolves In Wolves’ Clothing (2006)\n\n“There are some melodies on Wolves that I can hum along to. And after enough listens, I’ll have the words in my head. And then one day I’ll find myself humming a song or two, and I’ll go back and listen to it. And that’s good. Because in the end, it’s just more NoFX, and that’s really not all that bad of a thing.”\n\n7. Ribbed (1991)\n\n“The opening three tracks (“Green Corn,” “The Moron Brothers,” and “Showerdays”) kick this record off ferociously and fearlessly… and if you don’t love that blistering trio, you’re very likely a weak excuse for a NOFX fan. Either that, or you’re just too young to know any better. Beware, the opening riff of “Showerdays” will violate you like a tornado and is not for the common poppy-punky power-chord strumming Green Day fan. There is some really rippin’ riffage all over this album.”\n\n6. White Trash, Two Heebs And A Bean (1992)\n\n” Every track is fantastic, and some of them are quite different. Hang on, I’ve just realised, not EVERY song is fantastic – Buggly Eyes is a bit, well, stupid. The subject of the song is slightly funny the first time you hear it, but gets more ridiculous with every listen. Perhaps it would be bearable without the “jazz voice”? I really hate the jazz voice, which also pops up on Straight Edge.”\n\nSee more: Boys Like Girls Albums Ranked\n\n5. Heavy Petting Zoo (1996)\n\n“This is melodic-punk that is so fashionable nowadays at its very best. All of the guys are talented musically (catch Fat Mike playing trumpet). These set of songs are among the longest the band ever put out. Most of them are clever and funny without resorting to dick jokes and other pieces of misogyny of commercial bands that NOFX paved the way for.”\n\n4. Pump Up The Valuum (2000)\n\n“Songs throughout are very listenable. If there’s a weak point, it’s that NOFX have passed their songwriting prime. The really fast punk songs tend to blend together lately, and some of the ones here sound like excerpts from “The Decline.” But nothing is bad; there’s less filler than on any of their previous albums except “Punk in Drublic.”\n\nSee more: Hinder Albums Ranked\n\n3. The War On Errorism (2003)\n\n“NOFX has never failed to deliver a listenable album, and The War On Errorism is no exception. This is a pretty solid punk record with a few tracks that delve into the more experimental side of the genre. A lot of leftist politics, a good deal of the usual NOFX humor, and a collection of catchy songs.”\n\n2. So Long And Thanks For All The Shoes (1997)\n\n“This is undoubtedly one of NOFX’s best albums ever. It is very underrated and definitely deserves a spot on their top three best album put out to date. If you are a true and die hard NOFX fan, this album is a must have no questions asked. You won’t regret getting it. It has some of the best songs ever made and pretty much every single song is very enjoyable and catchy.”\n\n1. Punk In Drublic (1994)"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Music/NOFX", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Music/NOFX\n\nNOFX is a Punk Rock band from Los Angeles , California. They have 12 albums. Their members are as follows: Fat Mike (Michael Burkett) on bass and lead vocals, El Hefe (Aaron Abeyta) on lead guitar, Eric Melvin on rhythm guitar, and Erik Sandin on drums. Scott Sellers, Scott Aldahl, Dave Allen, Dave Casillas, and Steve Kidwiller were previous members in NOFX, however Fat Mike and Eric Melvin have both been there since they formed NOFX in 1983.\n\nDiscography:\n\nLiberal Animation (1988)\n\nS&M Airlines (1989)\n\nRibbed (1991)\n\nMaximum Rocknroll (compilation album of demos, 1992)\n\nWhite Trash, Two Heebs, and a Bean (1992)\n\nPunk in Drublic (1994)\n\nI Heard They Suck Live! (live album, 1995)\n\nHeavy Petting Zoo (1996)\n\nSo Long And Thanks For All The Shoes (1997)\n\nPump Up The Valuum (2000)\n\n45 Or 46 Songs That Weren't Good Enough To Go On Our Other Records (compilation album, 2002)\n\nThe War On Errorism (2003)\n\nThe Greatest Songs Ever Written (By Us!) (greatest hits album, 2004)\n\nWolves in Wolves' Clothing (2006)\n\nThey've Actually Gotten Worse Live! (live album, 2007)\n\nCoaster (2009)\n\nSelf Entitled (2012)\n\nFirst Ditch Effort (2016)\n\nSingle Album (2021)\n\nDouble Album (2022)\n\nTropes that apply to this band:"}, {"url": "https://www.songlyrics.com/nofx-lyrics/", "page_content": "NOFX (pronounced \"no ef-ex\") is an American punk rock band that was formed in Los Angeles, California (now based in San Francisco), in 1983.\n\n\n\nThe band was formed by vocalist and bassist Fat Mike and guitarist Eric Melvin. Drummer Erik Sandin joined them shortly afterward. In 1991 El Hefe joined to play lead guitar and trumpet, rounding out the current line-up. The band rose to popularity in 1994 with their album Punk in Drublic which was certified gold.\n\n\n\nNOFX has released 12 studio full lengths, 15 EPs, and many 7\" singles. The group has independently sold over 6 million records worldwide, making them one of the most successful independent acts of all time. The band also aired their own show on Fuse TV entitled NOFX: Backstage Passport.\n\nSource: http://en.wikipedia.org/wiki/Nofx"}, {"url": "https://www.lyrics.com/lyric/33240421/NOFX/Generation+Z", "page_content": "NOFX NOFX\n\n93 Views\n\nI think that our kids will probably see The end of humanity, as we know it Cause this world's about to blow it Will they see what they saw in ancient Rome The destruction of the home Will they see the end of civility? Cause when morality's been blurred Procreation seems absurd And human rights and freedom are just words That have lost all their meaning In a world that is bleeding Like an animal in slaughter I hope that my daughters never know What it feels like to give up To know the whole world is corrupt To realize they are really on their own And there's no one left who cares About the future Infected cuts don't need a suture There's a feeling that the human race Has seen the checkered flag And the laps that are given Are the last ones ever driven And everyone who's still living knows that It's a shame that the earth Will live on but can't give birth To a baby planet where we could start over again We've been divided, we've been bled Like a chicken without a head Running frantically amuck Taking but not giving a f*ck History is just an alibi It's believing every lie Man has ever dared to write It's so much easier to see That complex reality A lifetime full of misery and blight So we tell our daughters and our sons That they're not the final ones To see this planet as a decent place to live We use our telescope To give them faith, to give them hope Anything to help them cope With their future cause there's no alternative Kings and queens rule the land There's more and more lines drawn in the sand Pawns are crooks, Castles are rooks It's too bad the good books Written for the sub-classes to introduce morality Had nothing to do with reality But then again, who would have ever read them? We read the par-Quran for lunch Eat old testaments for a snack And a little Lulla-bible before bed There's no more points of view when your only thought is food (It's sad I'm gonna see) The bible has been replaced with a survival guide (The end of history) That uses perishables instead of parables Because there's no stories left to preach (We don't wanna be) There's no life lessons is left to teach anyone, why bother? (The Generation Z) Who are we? Are we the intellects or the insects? We're not the ones who will ever know the answer (We don't wanna see) It's impossible for us to imagine what is right in front of us (A species you and me) I guess that's what makes us think we're human But being human only lets us see a little farther than animals (The end of history) Feel depression from spending most of your life working? (The Generation Z) Try chemicals! Chemicals make everything better (The end of history) Hate, love, morality They're just chemical reactions (The Generation Z) Are we just chemically imbalanced ants on chemically fueled rants? (Generation Z, Generation Z) It really just comes down to sex and power (Generation Z) I bet the last man standing, the last human on this planet (Generation Z, Generation Z) The last person on the earth doesn't give a shit (Generation Z) Or has any idea that he or most likely she is the last one (Generation Z, Generation Z) The last person on this planet Will f*ck the dead and die thinking not about why didn't anyone care But why her life was so unfair It's time, it needs to be said, I'm sorry to be the one to inform you But man and woman kind has unfortunately been pronounced dead (Generation Z)"}, {"url": "https://genius.com/artists/Nofx", "page_content": "About NOFX\n\nTake the melody of The Descendents, some of Bad Religion’s political sense, add a handful of pills and there’s NOFX.\n\nScrewing up since 1983, the Californian group is one of the most influential bands in the history of punk rock. Rising in popularity during the 90’s, but never signing to a major label, remaining true to punk’s DIY roots, they released most of their stuff themselves or through Epitaph Records (owned by fellow punk rocker Brett Gurewitz from Bad Religion).\n\nSpreading sarcasm in every lyric, NOFX’s music range from hardcore punk to pop punk and even ska, but they’ve been doing it for so long and so characteristically that from the early days to their newest record, Single Album, it’s instantly recognizable: it sounds like NOFX."}]}