{"NoFX has released twelve studio albums, fifteen extended plays, four live albums, and numerous 7\" singles.": [{"url": "https://www.fillmoreauditorium.org/events/nofx/", "page_content": "7 Dec NOFX Tickets Fillmore Auditorium | Denver, CO\n\nPunk’s not dead! And yes, NOFX are still out there, at large, still spreading music and mayhem all over the country. Catch them while you can on their one-night only performance here at the Fillmore Auditorium on the 12th of December. Gates will swing wide open starting at 6:00 pm.\n\nPunk music traces its roots back in the 80s, and has now morphed into all sounds and noises…and yet, it still sounds pretty damn good, right? One of the punk pioneers and was responsible for the rebellious flame that still burns to this day is NOFX. They banded together 1983, founded by vocalist/bassist Fat Mike and guitarist Eric Melvin. Drummer Erik Sandin joined NOFX shortly after. In 1991, El Hefejoined to play lead guitar and trumpet, rounding out the current line-up.\n\nNOFX is the antithesis of most mainstream rock superstars around. They haven’t been signed to any record label. They grant and consent only to very few select interviews. They only have a handful of music videos. They refused airplay of their music videos on MTV, VH1, and other video shows. They have songs that range to as short as 32 seconds, to as long as 18 minutes. They poke friendly-fun at fellow punk acts like The Offspring. They seem to have defied every rule in the music marketing rule book; yet their accomplishments could be the envy of aspiring indie bands. NOFX has released twelve studio albums, fifteen extended plays and a number of seven-inch singles; and has sold over 6 million records worldwide.\n\nIf you want pure, unadulterated, hardcore, the real-deal punk, you’ve come to the right place. NOFX will serve it to you with no frills, no chills, yet high on thrills! Go ahead punk, make your day by scoring yourself tickets — now!"}, {"url": "https://www.theaudiodb.com/artist/111558", "page_content": "\n\nStickin in My Eye\n\nFranco Un-American\n\nBob\n\nXmas Has Been X'ed\n\nMr. Jones\n\n3 users NOFX - Bob3 users NOFX - Linoleum3 users NOFX - Linoleum3 users NOFX - Linoleum2 users NOFX - Dinosaurs Will DieAvailable in: NOFX (pronounced \"No-ef-ex\") is an American punk rock band from Los Angeles, California (later relocating to San Francisco).The band was formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin. Drummer Erik Sandin joined NOFX shortly after. In 1991, El Hefe joined to play lead guitar and trumpet, rounding out the current line-up. The band rose to popularity with its album Punk in Drublic (1994), which was certified gold, and is now considered a classic punk album by fans and critics alike. NOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, along with fellow California bands Pennywise, Rancid, Bad Religion, Green Day, The Offspring and Sublime. Unlike some of those bands, however, NOFX has never been signed to a major label.NOFX has released eleven studio albums, fifteen extended plays and a number of seven-inch singles. They recently finished recording a twelfth studio album, Self Entitled, which is due for release on September 11, 2012. The group has sold over 6 million records worldwide, making them one of the most successful independent bands of all time. The band also broadcasted their own show on Fuse TV entitled NOFX: Backstage Passport."}, {"url": "https://celebritynetworthwiki.org/richest-musicians/nofx-net-worth/", "page_content": "NOFX Net Worth is\n\n$17 Million\n\nNOFX Bio/Wiki, Net Worth, Married 2018\n\nStructural Info\n\nFilmography Profession Soundtrack Soundtrack Title Year Status Character Rubber Bordello 2012 Video performer: \"Buggley Eyes\" The Virginity Hit 2010 performer: \"Timmy the Turtle\" Tony Hawk: Ride 2009 Video performer: \"Just the Flu\" Guitar Hero World Tour 2008 Video Game performer: \"Soul Doubt\" Punk's Not Dead 2007 Documentary performer: \"Beer Bong\", \"Timmy the Turtle\" Crank 2006 performer: \"Kill All the White Man\" The Sasquatch Gang 2006 performer: \"The Idiots Are Taking Over\" NCAA Football 2006 2005 Video Game performer: \"Jeff Wears Birkenstocks?\" One Tree Hill 2004 TV Series performer - 1 episode Tony Hawk's Underground 2003 Video Game performer: \"The Seperation of Church and Skate\" Happy Homicidal 2002 Short performer: \"Gin and Juice\" Grind Session 2000 Video Game performer: \"Linoleum\" Terror Firmer 1999 performer: \"Stranger Than Fishin\" - as NoFX The Underground Comedy Movie 1999 performer: \"Soul Doubt\" Nirvana 1997 \"Reeko\", \"Scavenger Type\" Glory Daze 1995 performer: \"Kill All the White Man\", \"Fucking My Mom\", \"The Moron Brothers\" The Chase 1994 performer: \"Please Play this Song on the Radio\", \"Warm\" Self Title Year Status Character Last Call with Carson Daly 2015 TV Series Themselves - Musical Guests Warped Hall of Fame 2007 TV Series Band Punk's Not Dead 2007 Documentary Themselves Warped: Inside & Out 2006 TV Mini-Series Themselves Warped Tour 2002 2003 Video Themselves Sick of It All: The Story So Far 2001 Video documentary Himself Archive Footage\n\nKnown for movies\n\nCrank (2006)\n\nas Soundtrack Nirvana (1997)\n\nas Soundtrack The Chase (1994)\n\nas Soundtrack The Sasquatch Gang (2006)\n\nas Soundtrack\n\nTags\n\nNOFX /?n??f??ks/ is California punk rock band from Los Angeles, California (later relocating to San Francisco). The band was formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin. Drummer Erik Sandin joined NOFX shortly after. In 1991, El Hefe joined to play lead guitar and trumpet, rounding out the current line-up. The band rose to popularity with their fifth studio album Punk in Drublic (1994), which was certified gold in both the United States and Canada, and is now considered a classic punk album by fans and critics alike. Their seventh studio album So Long and Thanks for All the Shoes (1997) was also certified gold in Canada.NOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, but unlike many of their contemporaries, they have never been signed to a major label. NOFX has released twelve studio albums, fifteen extended plays and a number of seven-inch singles. Their latest studio album, Self Entitled, was released on September 11, 2012. The group has sold over 6 million records worldwide, making them one of the most successful independent bands of all time. The band also broadcast their own show on Fuse TV entitled NOFX: Backstage Passport.﻿﻿﻿﻿﻿﻿"}, {"url": "https://www.wikifame.org/wiki/NOFX", "page_content": "NOFX /ˌnoʊɛfˈɛks/ is an American punk rock band from Los Angeles, California\n\nNOFX Net worth 2023 (estimated) How much is NOFX worth? Under review\n\n\n\n\n\nNOFX facts They were formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin\n\nDrummer Erik Sandin joined NOFX shortly after\n\nIn 1991, El Hefe joined to play lead guitar and trumpet, rounding out the current line-up\n\nThe band rose to popularity with their fifth studio album Punk in Drublic (1994)\n\nNOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, but unlike many of their contemporaries (including Bad Religion, Green Day and The Offspring), they have never been signed to a major label\n\nNOFX has released twelve studio albums, fifteen extended plays and a number of seven-inch singles\n\nTheir latest studio album, First Ditch Effort, was released on October 7, 2016\n\nThe group has sold over 8 million records worldwide, making them one of the most successful independent bands of all time\n\nNOFX broadcast their own show on Fuse TV entitled NOFX: Backstage Passport Bio / wiki sources: Wikipedia, accounts on social media, content from our users.\n\n\n\n\n\n\n\n\n\n\n\nWiki & wealth sources: Wikipedia, TMDb, social media accounts, users content, wealth specialized websites\n\nPhoto credit: https://www.wikipedia.org/ We do our best for being accurate. If something seems incorrect, please contact us!"}, {"url": "https://rawkbawx.rocks/details.php?id=ab9c0e95cbc39d1b7b601529ae4506845f5f1bbc", "page_content": "\n\nRockbox Search Search Active Torrents\n\n\n\n\n\n\n\nIrc Channel info\n\nWebIRC Login irc.p2p-network.net\n\n#rockbox\n\nMirc link Come Join Us\n\nTorrent's details Page Links: Other Torrents - Comments File Name: NOFX Backstage Passport Season 1 (avi)(mpg) Download Torrent: NOFX Backstage Passport Season 1 (avi)(mpg) Description: NOFX\n\n\n\n\n\n\n\nNOFX (pronounced \"no-ef-ex\" is an American punk rock band from Los Angeles, California (later relocating to San Francisco). The band was formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin. Drummer Erik Sandin joined NOFX shortly after. In 1991 El Hefe joined to play lead guitar and trumpet, rounding out the current line-up. The band rose to popularity with its album Punk in Drublic (1994), which was certified gold, and is now considered a classic punk album by fans and critics alike. NOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, along with fellow California bands Pennywise, Rancid, Bad Religion, Green Day, The Offspring, Sublime and Blink-182. Unlike some of those bands, however, NOFX has never been signed to a major label.\n\n\n\nNOFX has released eleven studio albums, fifteen extended plays and a number of seven-inch singles. The group has sold over 6 million records worldwide, making it one of the most successful independent bands of all time. The band also broadcasted its own show on Fuse TV entitled NOFX: Backstage Passport.\n\n\n\nNOFX: Backstage Passport is a documentary series that was shown on the music network Fuse about NOFX's 2008 world tour. The show documents the stops on the tour and the band's reaction to various events. The creation of the show was noteworthy, due to the band's often noted disdain for the media including music television.\n\n\n\nNOFX: Backstage Passport was released on DVD on March 17, 2009. Genre: Music DVD Subgenre: Punk Bitrate: Webrip Size: 1.65 GB Show/Hide Files: File Name Size NOFX - Backstage passport Episode 01.mpg 206.21 MB NOFX - Backstage passport Episode 02 part 1.mpg 190.16 MB NOFX - Backstage passport Episode 02 part 2.mpg 15.73 MB NOFX - Backstage passport Episode 03.mpg 205.17 MB NOFX - Backstage passport Episode 04.mpg 209.31 MB NOFX - Backstage passport Episode 05.mpg 209.21 MB NOFX - Backstage passport Episode 06.mpg 209.38 MB NOFX - Backstage passport Episode 07.avi 233.01 MB NOFX - Backstage passport Episode 08.mpg 209.42 MB 9 files Added: 24/08/2011 Peer(s): Seed(s): 0, Leecher(s): 0 = 0 Peer(s) Last Seed Update 19/07/2016 15:13:21\n\n\n\nBack"}, {"url": "https://www.gigantic.com/nofx-tickets", "page_content": "About NOFX\n\nPunk legends NOFX are teaming up with Alkaline Trio for a must-see co-headline UK summer tour, which is set to take place throughout June and July.\n\n\n\nNOFX:\n\nNOFX are a punk rock band from Los Angeles, California. The band was formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin and today also features drummer Erik Sandin and lead guitarist and trumpet player El Hefe.\n\n\n\nNOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, but unlike many of their contemporaries, they have never been signed to a major label. NOFX has released twelve studio albums, fifteen extended plays and a number of seven-inch singles. Their latest studio album, Self Entitled, was released on September 11, 2012. The group has sold over 6 million records worldwide, making them one of the most successful independent bands of all time.\n\n\n\nALKALINE TRIO:\n\nAlkaline Trio is a three-member Illinois punk rock band from McHenry, Illinois, formed in 1996. The band consists of Matt Skiba (vocals, guitar), Dan Andriano (vocals, bass), and Derek Grant (drums).\n\n\n\nFounded in late 1996, by Matt Skiba, bassist Rob Doran and drummer Glenn Porter, Alkaline Trio released its debut single, ‘Sundials’, in 1997. Following its release, Doran departed from the band and was replaced by Dan Andriano. The band subsequently recorded an EP, ‘For Your Lungs Only’ (1998), and its debut studio album, ‘Goddamnit’ (1998). Following the release of the band's second album, ‘Maybe I'll Catch Fire’ (2000), Glenn Porter left the band and was replaced by Mike Felumlee for its subsequent album, ‘From Here to Infirmary’ (2001).\n\n\n\nBacked by the singles ‘Stupid Kid’ and ‘Private Eye’, From Here to Infirmary significantly increased the band's exposure, and its follow-up, ‘Good Mourning’ (2003), charted highly on the Billboard 200. ‘Good Mourning’ (2003) marked the recording debut of current drummer Derek Grant. In 2005, the band released ‘Crimson’ which expanded upon the band's punk rock influences, with prominent overdubs and additional instrumentation, and continued with this direction on ‘Agony & Irony’ (2008), which was released on V2 Records.\n\n\n\nIn 2010, the band released ‘This Addiction’ on its own label Heart & Skull and Epitaph. Recorded in the band's hometown of Chicago, with early producer Matt Allison, the album was a conscious effort to return to its punk rock roots, and became the highest charting album of their career, debuting on the Billboard 200 at No. 11. In 2011 the band celebrated its 15-year anniversary with the release of ‘Damnesia’, which featured new, acoustic-based recordings of songs from across the band's career. The band's eighth studio album, ‘My Shame Is True’ was released on April 2, 2013.\n\n\n\nWe only have limited supplies of NOFX concert tickets so book early or risk missing out on seeing the young star play live. We are proud to offer you excellent customer service on a huge range of essential gig tickets. So, make Gigantic your first choice whenever you book your big night out."}, {"url": "https://www.rockit.gr/punk_ska_t-shirts/nofx_t-shirts", "page_content": "NOFX\n\nNOFX (pronounced \"no-ef-ex\") is an American punk rock band from Los Angeles, California (later relocating to San Francisco).The band was formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin.Drummer Erik Sandin joined NOFX shortly after. In 1991 El Hefe joined to play lead guitar and trumpet, rounding out the current line-up. The band rose to popularity with its album Punk in Drublic (1994), which was certified gold, and is now considered a classic punk album by fans and critics alike. NOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, along with fellow California bands Pennywise, Rancid, Bad Religion, Green Day, The Offspring and Sublime. Unlike some of those bands, however, NOFX has never been signed to a major label.\n\nNOFX has released eleven studio albums, fifteen extended plays[6] and a number of seven-inch singles. The group has sold over 6 million records worldwide,making it one of the most successful independent bands of all time. The band also broadcasted its own show on Fuse TV entitled NOFX: Backstage Passport."}, {"url": "https://www.freemidi.org/artist-1791", "page_content": "band info\n\nNOFX /ˌnɵɛfˈɛks/ are an American punk rock band from Berkeley, California (later relocating to Los Angeles). The band was formed in 1983 by vocalist/bassist Fat Mike and guitarist Eric Melvin. Drummer Erik Sandinjoined NOFX shortly after. In 1991, El Hefe joined to play lead guitar and trumpet, rounding out the current line-up. The band rose to popularity with their fifth studio album Punk in Drublic (1994).\n\nNOFX's mainstream success was signified by a growing interest in punk rock during the 1990s, but unlike many of their contemporaries, they have never been signed to a major label. NOFX has released twelve studio albums, fifteen extended plays and a number of seven-inch singles. Their latest studio album, Self Entitled, was released on September 11, 2012. The group has sold over 6 million records worldwide, making them one of the most successful independent bands of all time.[citation needed] The band also broadcast their own show on Fuse TV entitled NOFX: Backstage Passport.\n\nclose"}, {"url": "https://genius.com/artists/Slayer", "page_content": "About Slayer\n\nSlayer was an American thrash metal band from Huntington Park, California, formed in 1981 by guitarists Jeff Hanneman and Kerry King, bassist-singer Tom Araya and drummer Dave Lombardo. Araya and King were the only two constant members, with Lombardo twice replaced by Paul Bostaph and Gary Holt taking over guitar after Hanneman’s death in 2013.\n\nSlayer rose to fame with its widely acclaimed 1986 release Reign in Blood, and is credited as one of the “Big Four” thrash metal bands, along with Metallica, Megadeth, and Anthrax, as well as being one of the heaviest and fastest metal bands of all time. Between 1991 and 2004, the band sold more than 3.5 million albums in the United States.\n\nSlayer’s musical style involves fast tremolo picking, double bass drumming, riffs in irregular scales and shouted vocals. Throughout the band’s career, King, Hanneman, and Araya have all contributed to the band’s lyrics, which, along with some of their album art, cover topics such as serial killers, necrophilia, Satanism, religion, and warfare. As a result, album bans, delays, lawsuits, along with criticism from religious groups, far-right conservatives, and the media, spawned forth in response to Slayer’s controversial subject matter. However, their music has been highly influential, often being cited by many bands as an influence musically, visually, and lyrically.\n\nStarting with its 1983 debut album, Show No Mercy, Slayer released twelve studio albums, four live albums, a box set, fourteen music videos, two extended plays and sixteen singles. Four of the band’s studio albums have received Gold certification in the United States. The band has received five Grammy nominations, winning two of them; one in 2007 for the song “Eyes of the Insane,” and another in 2008 for the song “Final Six” (both, of which, were written by Hanneman and Araya, and were from 2006’s Christ Illusion). Slayer also played at several music festivals worldwide, including Unholy Alliance, Download and Ozzfest. In January 2018, the band announced they would be embarking on their farewell tour. The tour began in May 2018 and ended in November 2019 with the band officially disbanding two days after the final concert. By that point, Slayer had been active for thirty-eight years.\n\nPast Lineup:\n\nTom Araya – Vocals, Bass Guitar (1981 – 2019)\n\nKerry King – Guitars (1981 – 2019)\n\nJeff Hanneman – Guitars (1981 – 2013)\n\nDave Lombardo – Drums (1981 – 1986, 1987 – 1992, 2001 – 2013)\n\nPaul Bostaph – Drums (1992 – 1996, 1997 – 2001, 2013 – 2019)\n\nGary Holt – Guitars (2013 – 2019; touring musician 2011 – 2013)\n\nJon Dette – Drums (1996 – 1997; touring musician 2013)\n\nTony Scaglione – Drums (touring musician 1986-1987)\n\nPat O’Brien – Guitars (touring musician 2011)\n\nPhil Demmel – Guitars (touring musician 2018)"}, {"url": "https://genius.com/artists/Nofx", "page_content": "About NOFX\n\nTake the melody of The Descendents, some of Bad Religion’s political sense, add a handful of pills and there’s NOFX.\n\nScrewing up since 1983, the Californian group is one of the most influential bands in the history of punk rock. Rising in popularity during the 90’s, but never signing to a major label, remaining true to punk’s DIY roots, they released most of their stuff themselves or through Epitaph Records (owned by fellow punk rocker Brett Gurewitz from Bad Religion).\n\nSpreading sarcasm in every lyric, NOFX’s music range from hardcore punk to pop punk and even ska, but they’ve been doing it for so long and so characteristically that from the early days to their newest record, Single Album, it’s instantly recognizable: it sounds like NOFX."}]}