{"NoFX's sound is characterized by irreverent and humorous lyrics, catchy melodies, and a fast, energetic sound.": [{"url": "https://www.grunge.com/287567/the-untold-truth-of-nofx/", "page_content": "NOFX formed in 1983, and five years later they had an incredible opportunity when Brett Gurewitz, lead songwriter and guitarist for legendary punk band Bad Religion (and founder of music label Epitaph Records), offered to produce an album for them. As noted in their book, NOFX: The Hepatitis Bathtub and Other Stories, the band scraped up $675 to record the album, and Gurewitz offered to release it on Epitaph. But the band wanted to launch their own label.\n\nPlus, NOFX themselves admit the album is awful. Lead singer Fat Mike considers the band's second album, 1989's S&M Airlines, to be their real first album and notes that NOFX was \"sounding, performing and behaving like sh*t\" prior to that. In fact, he says that the band had to rebuild their reputation from scratch with their second album because they had such a reputation for being terrible.\n\nIt's not just self-deprecation, either. Ron DePasquale at Allmusic.com says of the album, \"the sound is very raw and loose; the lyrics are slightly humorous at best and sophomoric at worst\" and speculates that the band just wasn't ready for the opportunity. After trying to sell the album on their own and failing miserably, NOFX sold the album to Epitaph after all, but it remains an album for dedicated fans only."}, {"url": "https://genius.com/artists/Nofx", "page_content": "About NOFX\n\nTake the melody of The Descendents, some of Bad Religion’s political sense, add a handful of pills and there’s NOFX.\n\nScrewing up since 1983, the Californian group is one of the most influential bands in the history of punk rock. Rising in popularity during the 90’s, but never signing to a major label, remaining true to punk’s DIY roots, they released most of their stuff themselves or through Epitaph Records (owned by fellow punk rocker Brett Gurewitz from Bad Religion).\n\nSpreading sarcasm in every lyric, NOFX’s music range from hardcore punk to pop punk and even ska, but they’ve been doing it for so long and so characteristically that from the early days to their newest record, Single Album, it’s instantly recognizable: it sounds like NOFX."}, {"url": "https://www.sputnikmusic.com/review/285/NOFX-Ribbed/", "page_content": "NOFX\n\nRibbed\n\n4.0\n\nexcellent Review by spoon_of_grimbo USER (74 Reviews)\n\nJanuary 14th, 2005 | 26 replies by\n\nRelease Date: 1991 | Tracklist\n\nI must say I was wary of buying this album, as I own almost every album that NOFX made with El Hefe on guitar, and I had my suspicions that this album (made in 1991, before the arrival of El Hefe) would be inferior to their later works. Upon listening, I thoroughly kicked myself for ever thinking that a NOFX album could be bad.\n\nOkay, so I am a huge NOFX fan, and so you could accuse me of being biased, but I genuinely think that this album can stand its ground next to most of their newer albums. It shows the origins of their sound, and how they developed it, not to mention the humorous lyrics which are now a staple part of NOFX's songs.\n\n\n\nSo, here we go, track by track:\n\n\n\n#1: GREEN CORN\n\nStraight from the start you hear that typical NOFX sound put to good effect with speedy drumming and riffs and Fat Mike's distinctive nasal-yet-tuneful vocals. Not the best song on the album, but shows their talent for writing killer album-openers, this time with a absolutely mental wailing solo.\n\n\n\n#2: THE MORON BROTHERS\n\nA song about two dumb thugs, strangely catchy, with a nice breakdown of \"do-do-do's\" in the middle, and the anthemic chorus really adds to the effect. One of the better songs on the album.\n\n\n\n#3: SHOWERDAYS\n\nThe albums first really big stand-out track (ok, so I heard it before I bought the album!), which caught my listening mainly due to the lightning fast bass intro. A joyous ode to hating showers and generally being a grubby bastard. The riffs are reminiscent of \"The Death Of John Smith\" from \"The Longest Line\" EP, but that EP does show how much Fat Mike's voice has improved since this album. Overall a very good song, and very memorable.\n\n\n\n#4: FOOD, SEX, AND EWE\n\nThe first ska number on the album, and not a bad one, just not very memorable. Resist the initial urge to skip, and you'll find a reasonably good song.\n\n\n\n#5: JUST THE FLU\n\nAfter the release of \"The War On Errorism\" Fat Mike apparently got a lot of stick from people who thought NOFX shouldn't try to be political since they never had been before. Well these detractors should take a look at this song. Although not directly decrying any particular government, this song is a cautionary tale of the dangers of nuclear war and how it will eventually kill us all if it goes ahead. Sadly this is still a danger we face today, it seems NOFX can see into the future...\n\n\n\n#6: EL LAY\n\nA royal piss-taking of trumped up trendies from Los Angeles, this song is short and to the point, with a similar effect to short songs like \"Murder The Government\" and \"Monosyllabic Girl\". Another memorable and fantastic song.\n\n\n\n#7: NEW BOOBS\n\nThis a close contender for best song on the album. Kicking in with a great intro featuring a traditional NOFX spazzout riff, this song continues the theme of ripping it out of rich americans which started in \"El Lay\", with Fat Mike moaning \"My boobs are not as big as i want them to be, i want 36D\". Not only is this a catchy and hilarious song, it also contains a sort of album interlude at the end, which is equally funny, but i wont spoil it for you.\n\n\n\n#8: CHEESE / WHERE'S MY SLICE?\n\nTwo songs in one? Sounds good to me! \"Cheese\" is a short but pretty good song which serves as an intro to \"Where's My Slice?\" an anthemic rant at greedy bastards everywhere, and another contender for best song.\n\n\n\n#9: TOGETHER ON THE SAND\n\nIt seems El Hefe was not the only NOFX guitarist who was capable of taking lead vocals on a funny song (see \"Johnny Appleseed\"), as Izzy Drew Lynn, the lead guitarist on this album wrote and performed this song on his own. Although it sounds as un-NOFX as is imaginable, this is hilarious, and sounds like a hula-girl hawaii sorta song. Excellent!\n\n\n\n#10: NOWHERE\n\nAnother political song, written during the Cold War, and not a bad song either. Pretty standard.\n\n\n\n#11: BRAIN CONSTIPATION\n\nSomehow this song sounds really happy, despite the depressing lyrics, and is another album highlight, although not the best. Kinda reminds me of \"August 8th\" (from \"Heavy Petting Zoo\") but heavier.\n\n\n\n#12: GONOHERPASYPHILAIDS\n\nA song about the dangers of casual sex and AIDS etc. with the usual NOFX humorous twist. Good song, but again not the best.\n\n\n\n#13: I DON'T WANT YOU AROUND\n\nPossibly the best ska song NOFX have ever done; its catchy, its got brass, its got stupifyingly fast bass, and the signature ska chords. The rhythm is kinda offbeat, but it adds to the quirky effect of the song. Another contender for best song of the album, and one of the catchiest to boot.\n\n\n\n#14: THE MALACHAI CRUNCH\n\nWhat the title means, I'll never know, but this song is edgy, fast, powerful, and condemns gangs who beat up people for fun. Again, one of the best songs on the album, and a great ending track, with a great bridge section too.\n\n\n\nOverall, this isn't NOFX's best album (I'd say either \"Punk In Drublic,\" \"Heavy Petting Zoo,\" or \"So Long And Thanks For All The Shoes\"), but nevertheless, it is incredibly good, and not too long either. If you are new to NOFX, I would suggest starting off with a newer album, or the greatest hits, and working backwards, but nevertheless, this is a great album in it's own right.\n\n\n\nSo...\n\n\n\nBEST SONGS: Showerdays, El Lay, New Boobs, Where's My Slice, Together On The Sand, Brain Constipation, I Don't Want You Around, The Malachai Crunch.\n\n\n\n\n\nTHE VERDICT: 4/5\n\n\n\nTweet\n\n\n\nRecent reviews by this author Matthew Reynolds Come Pouring North Lincoln Midwestern Blood Mike Hale Lives Like Mine Stereotyperider Songs in the Keys of F and U In the Red Volume 2 Ship Thieves Chris Wollard and the Ship Thieves I must say I was wary of buying this album, as I own almost every album that NOFX made with El Hefe on guitar, and I had my suspicions that this album (made in 1991, before the arrival of El Hefe) would be inferior to their later works. Upon listening, I thoroughly kicked myself for ever thinking that a NOFX album could be bad.Okay, so I am a huge NOFX fan, and so you could accuse me of being biased, but I genuinely think that this album can stand its ground next to most of their newer albums. It shows the origins of their sound, and how they developed it, not to mention the humorous lyrics which are now a staple part of NOFX's songs.So, here we go, track by track:#1: GREEN CORNStraight from the start you hear that typical NOFX sound put to good effect with speedy drumming and riffs and Fat Mike's distinctive nasal-yet-tuneful vocals. Not the best song on the album, but shows their talent for writing killer album-openers, this time with a absolutely mental wailing solo.#2: THE MORON BROTHERSA song about two dumb thugs, strangely catchy, with a nice breakdown of \"do-do-do's\" in the middle, and the anthemic chorus really adds to the effect. One of the better songs on the album.#3: SHOWERDAYSThe albums first really big stand-out track (ok, so I heard it before I bought the album!), which caught my listening mainly due to the lightning fast bass intro. A joyous ode to hating showers and generally being a grubby bastard. The riffs are reminiscent of \"The Death Of John Smith\" from \"The Longest Line\" EP, but that EP does show how much Fat Mike's voice has improved since this album. Overall a very good song, and very memorable.#4: FOOD, SEX, AND EWEThe first ska number on the album, and not a bad one, just not very memorable. Resist the initial urge to skip, and you'll find a reasonably good song.#5: JUST THE FLUAfter the release of \"The War On Errorism\" Fat Mike apparently got a lot of stick from people who thought NOFX shouldn't try to be political since they never had been before. Well these detractors should take a look at this song. Although not directly decrying any particular government, this song is a cautionary tale of the dangers of nuclear war and how it will eventually kill us all if it goes ahead. Sadly this is still a danger we face today, it seems NOFX can see into the future...#6: EL LAYA royal piss-taking of trumped up trendies from Los Angeles, this song is short and to the point, with a similar effect to short songs like \"Murder The Government\" and \"Monosyllabic Girl\". Another memorable and fantastic song.#7: NEW BOOBSThis a close contender for best song on the album. Kicking in with a great intro featuring a traditional NOFX spazzout riff, this song continues the theme of ripping it out of rich americans which started in \"El Lay\", with Fat Mike moaning \"My boobs are not as big as i want them to be, i want 36D\". Not only is this a catchy and hilarious song, it also contains a sort of album interlude at the end, which is equally funny, but i wont spoil it for you.#8: CHEESE / WHERE'S MY SLICE?Two songs in one? Sounds good to me! \"Cheese\" is a short but pretty good song which serves as an intro to \"Where's My Slice?\" an anthemic rant at greedy bastards everywhere, and another contender for best song.#9: TOGETHER ON THE SANDIt seems El Hefe was not the only NOFX guitarist who was capable of taking lead vocals on a funny song (see \"Johnny Appleseed\"), as Izzy Drew Lynn, the lead guitarist on this album wrote and performed this song on his own. Although it sounds as un-NOFX as is imaginable, this is hilarious, and sounds like a hula-girl hawaii sorta song. Excellent!#10: NOWHEREAnother political song, written during the Cold War, and not a bad song either. Pretty standard.#11: BRAIN CONSTIPATIONSomehow this song sounds really happy, despite the depressing lyrics, and is another album highlight, although not the best. Kinda reminds me of \"August 8th\" (from \"Heavy Petting Zoo\") but heavier.#12: GONOHERPASYPHILAIDSA song about the dangers of casual sex and AIDS etc. with the usual NOFX humorous twist. Good song, but again not the best.#13: I DON'T WANT YOU AROUNDPossibly the best ska song NOFX have ever done; its catchy, its got brass, its got stupifyingly fast bass, and the signature ska chords. The rhythm is kinda offbeat, but it adds to the quirky effect of the song. Another contender for best song of the album, and one of the catchiest to boot.#14: THE MALACHAI CRUNCHWhat the title means, I'll never know, but this song is edgy, fast, powerful, and condemns gangs who beat up people for fun. Again, one of the best songs on the album, and a great ending track, with a great bridge section too.Overall, this isn't NOFX's best album (I'd say either \"Punk In Drublic,\" \"Heavy Petting Zoo,\" or \"So Long And Thanks For All The Shoes\"), but nevertheless, it is incredibly good, and not too long either. If you are new to NOFX, I would suggest starting off with a newer album, or the greatest hits, and working backwards, but nevertheless, this is a great album in it's own right.So...BEST SONGS: Showerdays, El Lay, New Boobs, Where's My Slice, Together On The Sand, Brain Constipation, I Don't Want You Around, The Malachai Crunch.THE VERDICT: 4/5 user ratings (325) rate it Awful - 1 Very Poor - 1.5 Poor - 2 Average - 2.5 Good - 3 Great - 3.5 Excellent - 4 Superb - 4.5 Classic - 5 3.6\n\ngreat Rank: #177 for 1991 related reviews\n\nPods and Gods\n\nThe Longest EP\n\nCoaster\n\nSelf Entitled recommended by reviewer NOFX White Trash, Two Heebs, And A Bean\n\nLagwagon Duh!\n\nStrung Out Another Day In Paradise\n\ndiscussion On 15 Music Lists\n\n"}, {"url": "https://www.punknews.org/review/11488/nofx-self-entitled", "page_content": "If you have any interest in punk rock then you must have spent a vast amount of time with your head in the sand if you have no idea about NOFX and the band's frontman/Fat Wreck head honcho, Fat Mike. The band has been fairly prolific in releasing music over almost 30 years and has maintained a high profile without ever reaching the levels achieved by bands like Green Day and the Offspring; something many view as a positive. Despite retaining a sense of humor, a love of alcohol and the occasional ridiculously themed song, in the past decade the band has grown up a bit in terms of the message it sends out through its music as well as appearing a bit more serious over a variety of events both national and globalâ\u0080\u0093a welcomed progression I think many would agree.\n\n\n\nFollowing on from 2009's decidedly average Coaster, Self Entitled comes out at a time when, for me anyway, the band's significance is clearly on a downward trajectory. From seeing them in the early '90s playing to 40 or so people and doing so with gusto, humor and a gung ho attitude that was a joy to behold, to seeing them play to over 1,500 people about five years ago when the humor seemed forced and the set was disjointed at best, I find myself in a position where NOFX are in danger of being consigned to the \"Just Another Band\" category.\n\n\n\nOpening with \"72 Hookers,\" it doesn't take too long here to realize that this is NOFX's cunning plan to dissuade those with a desire to inflict terror on the Western World in the name of Islam from carrying out their plans, which is done only in the hope of meeting with the fabled 72 virgins. Basically 100,000 hookers or one million whores to turn the heads of those intent on waging such are what are needed according to the bandâ\u0080\u0093simple! This track starts well with a very good long intro which builds nicely and once the lyrics kick in I'm at first mildly amused at the concept before being more than slightly put off by the idea of enlisting women (prostitutes/whores as described in the lyrics) to solve the problem. Yes, I know it's supposed to be entertaining but it just gets on the wrong side of my funny bone and doesn't make for an auspicious start.\n\n\n\nThe second offering, \"I Believe in Goddess,\" is a much better effort, being short, punchy and with a lyrical content that is not pushing itself to be anything other than mildly interesting and amusing. The recent single \"Ronnie and Mags\" is another let down in that it's not funny, it's not particularly relevant and it seems to be an idea that just seems superfluous in that surely there are more needy targets in today's fucked up world. For me the album finally kicks into gear with the fourth track, \"She Didn't Lose Her Baby,\" a more serious tale and one that mirrors \"My Orphan Year\" off Coaster in that it creates a sense of melancholy, something that NOFX can actually do quite well. \"Secret Society\" could easily be a Bad Religion song and is a slight move away from the more frantic pace often set by NOFX, but it does constantly make me think that perhaps Graffin and Co could do it better. However, it is one of the better tracks on the album.\n\n\n\nFrom there, \"I, Fatty\" isn't too bad and \"Cell Out\" is just \"mediocore\" but neither really do anything for me; at least with \"Down With The Ship\" Fat Mike and his crew manage to pull their heads above water for almost two and a half minutes.\n\n\n\nThe poignancy that NOFX is capable of is once again demonstrated on \"I've Got One Jealous Again, Again,\" the unfortunate follow up to \"We've Got Two Jealous Agains\" off The War on Errorism. The original song dealt with the coming together of two record collections when Fat Mike met his wife whilst the new version deals with the divorce of the couple and the subsequent separation of that one collection. It is nuggets like these that help display a less brash side of the band which I find more appealing these days. However, they are few and far between on this album and I'll no doubt create playlists including maybe five songs from Self Entitled. Despite the trademark NOFX sound remaining, there is the sense of decay here and what once seemed fresh and vibrant is now slightly stale and lackluster, with few high points to remark on. I like the style of music that NOFX play, and always have, but the quality of the content seems to be lacking and doesn't match up with previous work. I had hoped to like this record much more than I do but unfortunately that's not the case.\n\n\n\nFor me it's official then: NOFX are just another band these days.\n\n\n\n"}, {"url": "https://trouserpress.com/reviews/nofx/", "page_content": "NOFX fuses I-got-the-world-up-my-ass (think Circle Jerks) attitude, British punk-era political cynicism and a snotty vocal tenor wedged somewhere between Dead Milkmen bratcore and an air of early Social Distortion disillusion. The Hollywood-formed foursome jabs at the ill effects of capitalist society — repression, prejudice, the poor — all with an underlying sense of paranoia. But rather than stand on a soapbox, vocalist/bassist Fat Mike and crew opt for sarcasm and humor, producing a one-two punch that, on the early releases, helped distract from the music’s monotony and continues to set the band apart from the power- punk pack. In recent years, with Fat Mike and guitarist Eric Melvin as the only remaining original members, the group has, to the disappointment of punk purists, become more pop-friendly.\n\nExpressing blatant distaste for ’80s just-say-no conservatism, NOFX debuted with a 7-inch “The PMRC Can Suck on This,” released on Fat Mike’s own Fat Wreck Chords label. Soon after, the band put out Liberal Animation, a generally straightforward punk-paced collection produced by Brett Gurewitz (who, according to NOFX, offered to put it out on Epitaph, an offer they initially rejected and then regretted). It has a few reggae rhythms and “Here Comes the Neighborhood,” which mixes a slow, introspective intro and hard-rock guitar solos. The songs are a bit sloppy, but one look at the lyric sheet and cover illustration (three cows, one sporting a Dead Milkmen T-shirt, sitting at the dinner table partaking of roast human) makes it apparent the band’s not very serious about its agit-prop. There are silly songs (“On the Rag,” “Beer Song,” “Truck Stop Blues” and “A200 Club,” about crabs) and digs at non-carnivores. “Vegetarian Mumbo Jumbo” asks “Why should I be sad about cows getting hit in the head…It’s survival of the fittest and we’re winning.” The band does offer up a bit more insight with the anti-politics stance of “Free Dumb” and the focus on hypocrisy in the lifestyle of peace punks in “Piece.” The main feat here is that Fat Mike pulls off stupid and sarcastic equally well.\n\nS&M Airlines maintains the breakneck speed but expands the band’s stylistic repertoire with more prominent guitar solos and ska/dub grooves. Parts of the amusing “Professional Crastination” recall the beginning of Iggy’s “The Passenger,” though the song quickly jumps to hyperspeed and then back to the reggaefied breaks; “Life O’Riley” also toggles between ska and fast punk. Many of the lyrics again poke fun at American society — “Jaundiced Eye” supports minority pride — but the band is no less prone to spouting un-PC humor. “You Drink, You Drive, You Spill” puts a twist on the statistic that 35 percent of auto deaths are alcohol-related. “The other 65-percent are not alcohol-related/What does this tell us about the drunk drivers/They seem to have a better record than the sober team.”\n\nRibbed continues the lyrical levity in “Moron Brothers” “Food, Sex and Ewe” and “Shower Days.” “New Boobs” is a funny take on silicone society and an example of the band’s broadening style: the song devolves into a Sha Na Na-like ’50s parody. NOFX even offers up its first ballad, “Together in the Sand,” penned by short-term guitarist Izzy Drew Lynn. Mike doesn’t alter his bratty delivery, but the record’s increased use of harmonies would become permanent.\n\nIt’s on The Longest Line — which introduces new guitarist, singer and trumpet-player El Hefe — that the NOFX sound really comes together and spreads apart. On “Kill All the White Man,” NOFX takes its affinity for reggae one stop further by imitating the form’s vocal style. Though the band is serious about its anti-racist stance on that cut, the “Batman”-like chorus of “white man” lightens the touch. On the title track, you can taste their soured view of life; “The Death of John Smith” offers further commentary on the void in middle-class America.\n\nWhite Trash, Two Heebs and a Bean adds poppier melodies, softening the edge but not the attitude. A guide to creating formulaic hits (“Please Play This Song on the Radio”) sticks in a slew of curses just to mess with DJs. Tracks that dive into untested waters serve to break up the more predictable fare: a jazzed-up cover of Minor Threat’s “Straight Edge” complete with Louis Armstrong-style vocals, the Al Jolson-era ditty “Buggley Eyes,” the “Oi!” chants and ska beats of “Bob.”\n\nThere’s not much change in Punk in Drublic. The pace is still brisk; most of the songs hold to the standard Offspring/Green Day style. The highlights are the jokes: “The Brews” is a takeoff on typical Oi skinhead sound with lyrics that would make a rabbi proud, “My Heart Is Yearning” is an operatic vocal parody. As far as that Top 40 punk style, the sound works best on “The Quass,” “Don’t Call Me White” and “Punk Guy,” where the band brings back some of the old British flavor.\n\nAnnouncing that “NOFX are: same as last album but older and fatter,” Heavy Petting Zoo continues the band’s crude and catchy socio-political-sexual analysis in Weezer-tight pop blurts like “Hobophobic (Scared of Bums),” “Bleeding Heart Disease” and the weight-conscious “Hot Dog in a Hallway.” Fat Mike revels in his Howard Stern-like sensibilities: “The Black and White” attempts to settle the feminist anti-pornography movement with the predictable “I think they need a good hard fuck,” “Freedom Lika Shopping Cart” accuses the homeless of chronic irresponsibility and “Release the Hostages” tastefully praises Johnnie Walker Red for “keep[ing] my insides warm like a cunt.” Musically unassailable and lyrically unforgivable (but with an impressively principled printed nose-thumb at TV, major labels and commercial radio), Heavy Petting Zoo is a punk album in spirit if not always in sound.\n\nThe brilliantly titled I Heard They Suck Live, recorded in early ’95 at a Hollywood club, contains solid, straightforward live versions of songs from each of the band’s prior releases plus a cover of Rudimentary Peni’s “Nothing but a Nightmare.”"}, {"url": "https://www.sputnikmusic.com/review/12224/NOFX-SM-Airlines/", "page_content": "NOFX\n\nS&M Airlines\n\n3.5\n\ngreat Review by pogostick1 USER (10 Reviews)\n\nMay 31st, 2007 | 10 replies by\n\nRelease Date: 1989 | Tracklist Review Summary: A good buy, but not the the classic NOFX sound of the 90's, it is surprisingly influenced by metal, and there are few great songs. However, it's essential for any NOFX fan looking to see how they developed as a band.\n\nThis was NOFX’s 2nd album, released in 1989, (Liberal Animation was originally released before this, but then re-released in 1991 on Epitaph). It is 12 tracks long, although one of them is a cover of a Fleetwood Mac song, and the album is under 34 minutes long.\n\n\n\nThis album is just the beginning, it is part of the start of NOFX’s career, and that is reflected in the change of the music they play in terms of hooks, - there are not that many to be found on this album, although in NOFX’s later years there are hooks a-plenty. Lyrically as well, this album is not too strong, although we do see the wicked brand of NOFX humour displayed here, in songs such as “You Drink You Drive You Spill” among others.\n\n\n\nNOFX here use lots of metal influenced guitar riffs, far more than on most of their other albums, and this album is far more hardcore / metal influenced than the later works which in turn took a ska and pop feel to them. Examples of this are “Five Feet Under” and “Scream for Change” . The former of these has fast, sharp guitar riffs, which to my mind are similar to Metallica; the guitar riffs, not the song as a whole. Infact, it would not be too far astray from the mark to describe this album as a strange Metallica-Offspring hybrid, although far more of the latter than the former. The latter is metallic too, but less so, and has a bizarre interlude partway through the song, which some will find amusing.\n\n\n\n“You Drink You Drive You Spill” and “Drug Free America” both are typical NOFX humour, the former talking about the perils of drink driving from a unique perspective – how much beer is spilt (I’m not so worried about how many I kill / I’m much more concerned with how much beer I spill), and the second song encourages people to give up drugs, albeit with the sly motive of only using free ones, in a cry for lower drug prices. The first song however, musically, could have come off of a later NOFX album, but the 2nd has far more foreboding, metallic riffs at the beginning and a longer intro than most punk songs have. At 3:43 minutes it’s also quite long for a punk song, and certainly for a NOFX song, bearing in mind “The Decline” was a long way in the future.\n\n\n\n“Vanilla Sex” is a (more nasal than normal) cry for less state intrusion and more privacy, and again could have come off of a more recent record, as could possibly “Professional Crastination”, which is an explanation of the band, and many of its fans, and also, many of the people in the world who are NOT fans of the band’s ability to waste time. This melds the two NOFX’s together, because you can still taste the metal influence here, although halfway through, the song slows down and you can see the modern day NOFX’s roots here, in the steady slow down and build up of sound. There is even debatably, a lick of ska in this slowed down part, and it’s one of the best songs here.\n\n\n\n“Mean People Suck” is a song that whilst true in its nature (mean people DO suck) is not a great song here, and the whole first half is an intro. The song only starts its lyrics at the halfway mark, and even then, the lyrics are underdeveloped, informing the listener, unsurprisingly, that “mean people suck”. “Day to Daze” is a track that whilst engaging lyrically and musically will never feature in any NOFX fans wish list for a live show, because its an average number in comparison to most of their songs.\n\n\n\n“Jaundiced Eye” lyrically is the best track on the album (excluding the amusing “You Drink...”, condemning racism and fascism alike, and has an occasional jaunty riff, but is not a brilliant song for the music. The title track “S&M Airlines” is amusing in the lyrics department, but the music doesn’t fit with it so well, almost as if NOFX hadn’t discovered how to pair funny songs with equally funny music, and were forced to put this with the harder style music. The cover of Fleetwood Mac’s song “Go Your Own Way” is punk-messy, and sprawled everywhere, but that is NOFX adding their own style to the track, and it is useful because it adds some much needed melody to the proceedings, for a punk album to go with the riffage.\n\n\n\nThe album is difficult to categorise, because it doesn’t sit happily in the punk category, and has metal influences, although it would be frankly ridiculous to label it metal. It is an example of NOFX in the transition stage, on their way to developing a style, their style that they maintain today.\n\n\n\nThe best songs on the album are:\n\n\n\n“You Drink You Drive You Spill”\n\n“Professional Crastination”\n\nand “Go Your Own Way”, although, in the scheme of things, and for someone looking to chart the development of NOFX as a band, replace the last song with the progressive “Vanilla Sex”\n\n\n\nTweet\n\n\n\nRecent reviews by this author The King Blues Save the World, Get the Girl Metallica Death Magnetic Less Than Jake GNV FLA No Use for a Name The Feel Good Record of the Year NOFX They've Actually Gotten Worse Live NOFX Wolves in Wolves' Clothing This was NOFX’s 2nd album, released in 1989, (Liberal Animation was originally released before this, but then re-released in 1991 on Epitaph). It is 12 tracks long, although one of them is a cover of a Fleetwood Mac song, and the album is under 34 minutes long.This album is just the beginning, it is part of the start of NOFX’s career, and that is reflected in the change of the music they play in terms of hooks, - there are not that many to be found on this album, although in NOFX’s later years there are hooks a-plenty. Lyrically as well, this album is not too strong, although we do see the wicked brand of NOFX humour displayed here, in songs such asamong others.NOFX here use lots of metal influenced guitar riffs, far more than on most of their other albums, and this album is far more hardcore / metal influenced than the later works which in turn took a ska and pop feel to them. Examples of this areand. The former of these has fast, sharp guitar riffs, which to my mind are similar to Metallica; the guitar riffs, not the song as a whole. Infact, it would not be too far astray from the mark to describe this album as a strange Metallica-Offspring hybrid, although far more of the latter than the former. The latter is metallic too, but less so, and has a bizarre interlude partway through the song, which some will find amusing.andboth are typical NOFX humour, the former talking about the perils of drink driving from a unique perspective – how much beer is spilt (I’m not so worried about how many I kill / I’m much more concerned with how much beer I spill), and the second song encourages people to give up drugs, albeit with the sly motive of only using free ones, in a cry for lower drug prices. The first song however, musically, could have come off of a later NOFX album, but the 2nd has far more foreboding, metallic riffs at the beginning and a longer intro than most punk songs have. At 3:43 minutes it’s also quite long for a punk song, and certainly for a NOFX song, bearing in mind “The Decline” was a long way in the future.is a (more nasal than normal) cry for less state intrusion and more privacy, and again could have come off of a more recent record, as could possibly, which is an explanation of the band, and many of its fans, and also, many of the people in the world who are NOT fans of the band’s ability to waste time. This melds the two NOFX’s together, because you can still taste the metal influence here, although halfway through, the song slows down and you can see the modern day NOFX’s roots here, in the steady slow down and build up of sound. There is even debatably, a lick of ska in this slowed down part, and it’s one of the best songs here.is a song that whilst true in its nature (mean people DO suck) is not a great song here, and the whole first half is an intro. The song only starts its lyrics at the halfway mark, and even then, the lyrics are underdeveloped, informing the listener, unsurprisingly, that “mean people suck”.is a track that whilst engaging lyrically and musically will never feature in any NOFX fans wish list for a live show, because its an average number in comparison to most of their songs.lyrically is the best track on the album (excluding the amusing, condemning racism and fascism alike, and has an occasional jaunty riff, but is not a brilliant song for the music. The title trackis amusing in the lyrics department, but the music doesn’t fit with it so well, almost as if NOFX hadn’t discovered how to pair funny songs with equally funny music, and were forced to put this with the harder style music. The cover of Fleetwood Mac’s songis punk-messy, and sprawled everywhere, but that is NOFX adding their own style to the track, and it is useful because it adds some much needed melody to the proceedings, for a punk album to go with the riffage.The album is difficult to categorise, because it doesn’t sit happily in the punk category, and has metal influences, although it would be frankly ridiculous to label it metal. It is an example of NOFX in the transition stage, on their way to developing a style,style that they maintain today.The best songs on the album are:and, although, in the scheme of things, and for someone looking to chart the development of NOFX as a band, replace the last song with the progressive user ratings (260) rate it Awful - 1 Very Poor - 1.5 Poor - 2 Average - 2.5 Good - 3 Great - 3.5 Excellent - 4 Superb - 4.5 Classic - 5 3\n\ngood related reviews\n\nPods and Gods\n\nThe Longest EP\n\nCoaster\n\nSelf Entitled recommended by reviewer The Offspring The Offspring\n\ndiscussion On 7 Music Lists\n\n"}, {"url": "https://www.sputnikmusic.com/review/71/NOFX-The-War-on-Errorism/", "page_content": "reviews\n\ncharts\n\nnews\n\nlists\n\nblog login\n\nbrowse genres\n\nnew releases\n\nstaff reviews\n\nbest new music NOFX\n\nThe War on Errorism\n\n3.0\n\ngood Review by IntoTheFire USER (3 Reviews)\n\nJanuary 14th, 2005 | 60 replies by\n\nRelease Date: 2003 | Tracklist\n\nThis CD isn't anything new, so don't go into it expecting anything revolutionary and defining. I was dissapointed to see that it had the same over-polished and clean sound as their last two CDs, but that's the case with most Fat Wreck CDs. Some of the songs also sounded all too similar to other NOFX songs. But that aside, this is still a pretty good CD, if you know what to expect from NOFX. The lyrics are probably the best NOFX has put out in a while on this CD, and also the most political. It was a nice change to hear songs actually about things that matter, not clams and vaginas. There are still some stupid and humorous songs, but they are few and far between. Anyways, here's a song breakdown(I've bolded the standout tracks):\n\n\n\n\n\nThe Seperation Of Church and Skate - Great song. Probably the best on the CD. I love the guitars on this song, they blend ing with each other with much awsomeness. The screaming vocals by Melvin and Mike in the chorus are awsome, too.\n\n\n\nThe Irrationality Of Rationality - Very average song. Typical fast pounding drums with some melodic singing. The guitar sounds very similar to another NOFX song, though I forget which one right now..\n\n\n\nFranco Un-American - I don't really like this song. It sounds really clean and poppy. It is catchy, but that doesn't stop me from disliking it. (Also, the chorus sound waaaaay to similar to Quart In Session)\n\n\n\nIdiots Are Taking Over - Great song. I thought it was really average at first, but it grew on me. Fast pace, some of the best lyrics on the CD, and an awsome bassline. The ska part in the middle is great.\n\n\n\nShes Nubs - This song has its moments, but then gets ruined with its sillyness. Mikes voice in the beginning(and a few other parts of the song) sounds really stupid and childish, and the \"slipping on the bannana peel\" sound effect doesn't help.\n\n\n\nMattersville - This song was already released before WOE, so you might have alright heard it. Some love it, some hate it. I don't like it that much. Again, very average.\n\n\n\nDecom-poseur - The third of the great songs on the CD, and one of the heavier ones, too. Great Hefe solo in the middle, too.\n\n\n\nMedio-core -Probably the most unique song on the CD. It is a good song, but it just doesn't float my boat. Still, most people love it. There's some awsome transitions in the song, and it does stray from the usual NOFX song-style, so I give them props for that.\n\n\n\nAnarchy Camp - I hate this song. I like ska and all, but this is one boring ska song. Is it even ska? I dunno, all I know is that I hate it. Infact, maybe I'll burn this song to a disc, and then smash the disc with a hammer. Yes, it's that bad.\n\n\n\nAmerican Errorist (I Hate Hate Haters) - Fast paced, nice solo, good lyrics. Great song. I don't know what else to say.\n\n\n\nWe Got Two Jelous Agains - Great blend of melody and heavyness(..? Sorry, I can't think of any other word right now -_-). A good song. I think it's a love song, but I don't even know. Judge for yourself.\n\n\n\n13 Stitches - One of the slower songs, but definitely better than Anarchy Camp. It's pretty straight-forward, but the less polished sound and trumpet makes it all the better.\n\n\n\nRe-gaining Unconsciousness - Again, a pretty straight-forward song, almost boring, but not quite. The lyrics make it worthwhile. Sounds like it was made as more of a rant than anything.\n\n\n\nWhoops, I OD'd - Failed attempt at an emotional/love song.\n\n\n\nOverall Rating : 6/10\n\n\n\nTweet\n\nThis CD isn't anything new, so don't go into it expecting anything revolutionary and defining. I was dissapointed to see that it had the same over-polished and clean sound as their last two CDs, but that's the case with most Fat Wreck CDs. Some of the songs also sounded all too similar to other NOFX songs. But that aside, this is still a pretty good CD, if you know what to expect from NOFX. The lyrics are probably the best NOFX has put out in a while on this CD, and also the most political. It was a nice change to hear songs actually about things that matter, not clams and vaginas. There are still some stupid and humorous songs, but they are few and far between. Anyways, here's a song breakdown(I've bolded the standout tracks):- Great song. Probably the best on the CD. I love the guitars on this song, they blend ing with each other with much awsomeness. The screaming vocals by Melvin and Mike in the chorus are awsome, too.The Irrationality Of Rationality - Very average song. Typical fast pounding drums with some melodic singing. The guitar soundssimilar to another NOFX song, though I forget which one right now..Franco Un-American - I don't really like this song. It sounds really clean and poppy. It is catchy, but that doesn't stop me from disliking it. (Also, the chorus sound waaaaay to similar to Quart In Session)- Great song. I thought it was really average at first, but it grew on me. Fast pace, some of the best lyrics on the CD, and an awsome bassline. The ska part in the middle is great.Shes Nubs - This song has its moments, but then gets ruined with its sillyness. Mikes voice in the beginning(and a few other parts of the song) sounds really stupid and childish, and the \"slipping on the bannana peel\" sound effect doesn't help.Mattersville - This song was already released before WOE, so you might have alright heard it. Some love it, some hate it. I don't like it that much. Again, very average.- The third of the great songs on the CD, and one of the heavier ones, too. Great Hefe solo in the middle, too.Medio-core -Probably the most unique song on the CD. It is a good song, but it just doesn't float my boat. Still, most people love it. There's some awsome transitions in the song, and it does stray from the usual NOFX song-style, so I give them props for that.Anarchy Camp - I hate this song. I like ska and all, but this is one boring ska song. Is it even ska? I dunno, all I know is that I hate it. Infact, maybe I'll burn this song to a disc, and then smash the disc with a hammer. Yes, it's that bad.- Fast paced, nice solo, good lyrics. Great song. I don't know what else to say.We Got Two Jelous Agains - Great blend of melody and heavyness(..? Sorry, I can't think of any other word right now -_-). A good song. I think it's a love song, but I don't even know. Judge for yourself.13 Stitches - One of the slower songs, but definitely better than Anarchy Camp. It's pretty straight-forward, but the less polished sound and trumpet makes it all the better.Re-gaining Unconsciousness - Again, a pretty straight-forward song, almost boring, but not quite. The lyrics make it worthwhile. Sounds like it was made as more of a rant than anything.Whoops, I OD'd - Failed attempt at an emotional/love song.Overall Rating : 6/10 user ratings (688) rate it Awful - 1 Very Poor - 1.5 Poor - 2 Average - 2.5 Good - 3 Great - 3.5 Excellent - 4 Superb - 4.5 Classic - 5 3.6\n\ngreat Rank: #175 for 2003 other reviews of this album pogostick1 (4.5)\n\nNOFX demonstrate furious punk rock from olden days, combined with melodious harmonies, and topped of...\n\n\n\nMister Mop (3.5)\n\n...\n\n\n\nrelated reviews\n\nFirst Ditch Effort\n\nSelf Entitled\n\nThe Longest EP\n\nCoaster discussion On 28 Music Lists\n\n\n\nComments: Add a Comment 1\n\n2\n\n3\n\nNext\n\nmy overal rating 7/10\n\nthe fact that they had bush on the album was very clever.this is probably one of the most political nofx albums ive heard.\n\n\n\n\n\nthis is one of my favourite albums\n\n\n\nI'm going to give my own review here;\n\n\n\nseparation of church and skate:\n\n\n\nkiller guitar riff at the start. You can tell that melvin and hefe have killer chops on the guitar, but don't show them off as often as they probably should. I love when Mike and Melvin switch vocals the way they did in the decline. Also, there was a third singer near the end... maybe. Still not sure, but it didn't really sound like either Mike or Melvin, and I have certain theories that it could be Eric the drummer. Great song though, and amazing riffs on the outro.\n\n\n\nirrationality of rationality:\n\n\n\nI like Mike's tone in the intro. It's so smooth, and flows good. Hefe and Melvin have a real talent for playing power chords all over the fretboard, without having to resort to dropped tuning like a lot of nu metals do. A cool cello part that does a good job of breaking the song up a bit, so it's not too boring.The lyrics are ok, but seem a little bit off. I love the \"and the shareholders were on the bed, legs in air, asscheeks opened wide.. they were about to get fuc[/i]ked like it was their first time\" part. Good song, but not great.\n\n\n\nFranco Unamerican:\n\n\n\nI love this song. It's as poppy as hell, but nofx can bust out poppy tunes like no other, so there's no reason not to. The synth is fun. The lyrics are great in some parts, but misinformed in others. A very enjoyable song though. Simple, but still takes great song writing talent to produce.\n\n\n\nidiots are tkaing over:\n\n\n\nthis song has to be given time to grow on you. It's kind of bland the first few times you hear it, but then it suddenly gets really catchy. The bass line is very Fat Mikish, heh. Not many people can do what he does, and he does it well. The ska part is great, and totally necessary, otherwise the rest of the song would be too repetitive. Best lyrics on the cd.\n\n\n\nshe's nubs:\n\n\n\nI fell in love with this song. It's so goofy and fun. The vocals at the start sound like adam sandler, but meh. From the fast palm muted chords, to the blazing lead part, this song kicks as[i]s. And holy shi[i][/i]t!! the way they take turns with the chorus is so cool.\n\n\n\nmattersville:\n\n\n\nI fell in love with this song since I first heard it on the fat compilation. Nofx is great for being so fast and heavy, while still taking the time to break out the xylophone for a song once in awhile. Also, this songs shows how Mike has a talent for coming up with chord progressions that really shouldn't make sense, but still sound good. Not sure who plays the guitar in the verses, but that's talent right there. Nofx sometimes uses an excessive amount of talent to come up with the simplest soudning songs. There's also a trombone on this song, but you can't hear it.\n\n\n\nmediocre:\n\n\n\nI can't believe how good this song is. I guess you either love it or don't, but I love it. Great basslines, great use of chromatics, great transitions, and the lyrics fit perfectly. It's ironic, but as soon as Fat Mike say \"predictability...\" I knew exactly what was about to come. And man, it rocks like no other. The outro is great too with the tuba, and the little melody. Best song on the cd I think.\n\n\n\ndecomposeur:\n\n\n\ncool riff at the start. Nice use of time sig switchage. I love the bass tone, and how it sounds with just the drums. The solo is really cool, and I like how the second guitar decends through the octave chords with the bass plays the progression. Great lyrics, and a great unique sound.\n\n\n\nanarchy camp:\n\n\n\nlots of people don't like it. I love it. Cool lyrics, and a good happy feeling. The saxophone is cool.\n\n\n\nthen the albums goes downhill\n\n\n\namerican errorist (I hate hate haters):\n\n\n\nthis is an ok song. I love the intro with the muted guitars and the bass and everything, but I just think this is a bland song.\n\n\n\nwe got two jealous agains:\n\n\n\nsome really catchy parts. Some funny lyrics. It's an ok song, but not all that good. It's sort of bland, and relies on it's speed to be qualified as a decent song.\n\n\n\n13 stitches:\n\n\n\nreally catchy. really weird quality to it. The trumpet part is really cool. A very unique song. It would have been horribly average if it wasn't for the unique high-mid-low-bass-low-treble-old-time-radio-bad-quality production to it.\n\n\n\nregaining consciouness:\n\n\n\ngreat lyrics; bad song. It just doesn't have anything that appeals to the listener.\n\n\n\nwhoops I OD'd:\n\n\n\nI might be biased, but I love this long. It's really cool how it's just bass and vocals. Fat Mike shows how his great song writing ability can stand up on it's own, without any speed or distorted guitars to back it up.\n\n\n\noverall, it's a great album. Very different from nofx' ususal style, but still has that standard nofx sound to it. On the first few listens it might seem bland and boring, but once you get used to it, you can appreciate it for how good it really is.\n\n\n\n9/10\n\n\n\n\n\ncds alright its good unlike other bands who are releasing new and crappy albums but my favourite cd of theires will always be punk in drublic still war on errorism was a 7/10 for me good job NOFX\n\n\n\n\n\ni love this album!!! NOFX... the best band ever. 8/10\n\n\n\n\n\nI really like this album. Anarchy Camp is one the koolest song ive ever heard.\n\n\n\n\n\nThere is better NOFX cd's.. But I like this one, too. The high points on the cd for me are: Seperation of Church and Skate, Anarchy Camp, American Errorist.\n\n\n\nNice review :thumb:\n\n\n\n\n\nThis album is one I really enjoy. A few weak moments but I would tip towards Fattys review. 7.5/10\n\n\n\n\n\nI love this album. I was hoping it would be along the lines of \"Punk In Drublic\", but still, this album is great!\n\n\n\nI agree completely with Fattymattk's review. :thumb:\n\n\n\n\n\ni will give this cd 2/5 i didnt like it too well and i thought that their old stuff was a lot better...but i will tell u what is a new and good song \"idiot son of an asshole\" if u have never heard this song u should go download this song right now!! it is about how the lead singer of NOFX hates our prez and our govt. sooo much\n\n\n\n\n\nI love Nofx, they are one of my favorite bands, and one of the first Punk bands I started listening to, but this cd is so contridictinal (sp?) that it is kind of lame. It seems like in most songs, they poke fun at Good Charlotte, but I know that in real life, they are friends. And making fun of Pop-Punk, yet all the riffs on that cd are Pop-Punk. I still really all the songs on this cd though, so it gets a 4/5.\n\n\n\nEDIT: Oh yea, it also really bothered me that almost NONE of the lyrics ever rhymed.\n\n\n\n\n\nThis is not one of my favorite NOFX albums. Not near as good as some of their other ones. Anyways, great job on the review. :thumb:\n\n\n\n\n\ndidnt like the CD that much\n\ngood review though\n\n\n\n\n\nI've heard \"Separation of...\" on the \"Tony Hawk's Underground\" soundtrack. Although I haven't heard the rest of this album, I'm still willing to bet that it's one of the better songs, because it's good.\n\n\n\nAlbum Rating: 4.0\n\n\n\nIt is an alright album. Not my favorite, but it has highs and lows.\n\n\n\n\n\n\n\nMy favs:\n\n\n\nSeparation Of Church and Skate\n\n\n\nFranco Un-American\n\n\n\nMedio-Core\n\n\n\nShes Nubs\n\n\n\n\n\n9/10\n\n\n\nlove it - what more can i say?\n\n\n\n\n\nGood album, althought they've definately done better. Highlights are Separation of church and skate, mattersville, franco un-american, medio-core, anarchy camp. Good review fatmattk\n\n\n\n\n\nA lot of good stuff on this album. I have to say, I have a bias for this album being the first album i bought but i find some of the older stuff a little better. Seperation of Church and Skate is a great song, the fact that they bring in each instrument in a nice way makes it a cool song. As for Whoop's, I OD'd, It sounds a little better live, but the way Fat Mike shows that an acoustic song can be bass and vocals only makes it a nice song. All-in-all, great two reviews and i think ill agree with the 9/10 rating because there are great songs and there are ok songs, but a good album none the less.\n\n\n\n\n\nWhen fattymattk talked about a third singer in seperation of church and skate, im pretty sure it is spike slawson. From the gimme gimmes and swinging utters or lagwagon (not sure which). I liked this album better than pump up the valuum. It is no where near their best though.\n\n\n\n\n\nsorry lynch the landlord, but thats el hefe. apart from the fact that you can hear who it is mike also said in AMP magaize \"I like seperation.. since me, melvin and hefe all get to sing\".\n\n\n\n\n\nI think this a great album. It's fast and fun but it also gives us a look at NOFX's views on politics.\n\n\n\nBest Songs:\n\nFranco Un-American\n\nMedio-core\n\nAmerican Errorist\n\nWhoops I Od'd\n\n\n\n1\n\n2\n\n3\n\nNext\n\nAdd a Comment:\n\nYou have to be logged in to post a comment. Login | Create a Profile\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://www.punknews.org/review/5109/nofx-never-trust-a-hippy", "page_content": "Note to the reader:\n\n\n\nIf you do not know what NOFX sounds like by this point, you are either (A) 15 years old or younger, or (B)living under a rock in Alabama. Close this window, hop in the car, and drive to your nearest record store to pick up either Punk in Drublic or So Long and Thanks for All the Shoes. After a few listens, return back to read the rest of the review.\n\n\n\nFor the rest of you, this EP is not likely to change your opinion of the band. If you're a fan of NOFX, you will almost certainly enjoy the six songs featured on the Never Trust a Hippy EP; if you hate the band, that won't suddenly change with this release.\n\n\n\nFans of NOFX's earlier material -- dating as far back as Ribbed and White Trash... -- will be pleased to find out that most of the songs on this EP sound similar to songs recorded during that era. The only difference would be in the lyrics; instead of writing about lesbians and boobs, the majority of the songs are political in nature or are speaking out against religious extremism (although NOFX has always had political songs on all of their albums, so I really don't understand the recent backlash against some of their political lyrics).\n\n\n\nThe EP starts out with \"Seeing Double at the Triple Rock,\" a fun, midtempo song about the greatness of beer; \"I'm a religious drunk, and this is where I pray...we're praying that the taps will keep the holy water flowing.\" The song reminds me of earlier material mostly due to the lead guitar part that sounds like it came straight from White Trash.\n\n\n\n\"The Marxist Brothers\" is a slow paced, reggae-sounding song with lyrics poking fun of \"idealist bourgeoisie\" and is, what appears to be, a response to Propagandhi's diss of NOFX on their most recent album. But Propagandhi fans should not take it too seriously -- it's all in good fun, and the mood is similar to that of \"Anarchy Camp\" from The War on Errorism, so it's light-hearted.\n\n\n\nThe effort continues with \"Golden Boys,\" a song whose double-time beginning sounds very similar to the classic song \"Green Corn\" and is played in the signature NOFX style. Next up is the acoustic \"You're Wrong,\" which was also part of the 7 Inch of the Month Club. Nothing special in particular here, although the lyrics are quite bold and funny all at the same time. Ann Coulter is appropriately labeled as a \"cunted cunt\" and Fat Mike lets you know that you're wrong if you agree with Sean Hannity. NOFX has been playing this song on their latest tour, and according to Fat Mike, it will be on the new album, except it will be a full-band \"punked-out\" version.\n\n\n\nHippy closes out with \"Everything in Moderation (Especially Moderation)\" and \"I'm Going to Hell for This One.\" The former is a very basic, fast-paced NOFX song about the band's career and age: \"When your band has been a band longer than the Ramones, and critics coin you 'the punk Rolling Stones,' that's when you know this is for life.\"\n\n\n\n\"I'm Going to Hell for This One\" was also on the 7 Inch of the Month Club, and is about Jesus -- well, the Jesus that NOFX believes in. They take a stab at fundamentalist Christianity and promote the belief that Jesus was a pretty cool guy...just not the person that Christians believe he was. Stylistically, this song reminds me a lot of \"The Decline,\" which is certainly a plus.\n\n\n\nOverall, this is a wonderful listen, everything from the hilarious cover art, to the lyrical content, to the classic NOFX sound we all know and love. If the new album Wolves in Wolves' Clothing sounds anything like this, then we are in for a treat.\n\n\n\n"}, {"url": "https://www.punknews.org/review/634/nofx-ribbed", "page_content": "\"All Nofx songs sound the same blah blah blah, they're just as stupid as Blink blah blah blah, why won't they just fucking die blah blah blah\". Whatever.\n\n\n\n'Ribbed' goes like this.\"Green Corn\" is fast. \"Moron Brothers\" is fast and funny, about two assholes who fuck everyone over. \"Shower Days\" is funny. He only wan't to take a bath 2 times a week. Now that they mentioned it, I don't smell too fresh myself. \"Food, Sex, and Ewe\" is a ska song with a cool, 80's metal intro. \"Just the Flu\" is fast. \"El Lay\" is about Los Angeles, and people seem to like this song a lot. \"New Boobs\" is great. Fast, and about a chick who finnaly gets the boob job she wants, only then she causes dudes to squirt all over themselves before she can even get any action.HA! \"Cheese/Where's My Slice\" is fast and funny in a whiny sort of way. \"Together on the Sand\" sounds like a lounge tune, and he's talking about fingerin' some chick on the beach. \"Nowhere\" is also fast. \"Brain Constipation\" is kinda slow and metalish. \"Gonoherpasyphilaids\" is about some dude who got a new STD from some funky ho, and it's fast too. \"I Don't Want You Around\" isn't fast, but it isn't slow either, and it makes fun of the Grateful Dead. \"The Malachi Crunch\" is at the end of the record and it's really fast, with cool lyrics.\n\n\n\nNOFX has two really good guitar players, and really fast drummer, and a not-so-good bass player/singer. They are funny too.\n\n\n\n"}, {"url": "https://www.afroplug.com/afro-music-genres/", "page_content": "Are you a musician looking to expand your knowledge and appreciation of Afro music? Look no further! In this guide, we’ll explore the many genres of Afro music and their unique characteristics, histories, and cultural significance.\n\nFrom the rhythmic beats of Afrobeat and the soulful melodies of Afro-soul to the infectious grooves of Kuduro and the fiery passion of Salsa and Reggae, Afro music is a diverse and vibrant musical tradition that has captivated listeners around the world.\n\nIn this guide, you’ll learn about the origins and evolution of each genre, as well as key artists and influential recordings. We’ll also provide tips on how to incorporate Afro music into your own musical practice and performances.\n\nSo whether you’re a seasoned musician or just starting out, this guide is a must-read for anyone looking to deepen their understanding and appreciation of Afro music. So, stay tuned!\n\n1. Afrobeat\n\nAfrobeat is a popular African music genre that originated in Nigeria in the 1960s and has since spread throughout the continent and the world. It is characterized by its fast tempo, typically around 120-140 beats per minute (BPM), and its incorporation of elements from traditional African music, such as highlife, jazz, funk, and percussion.\n\nIt was popularized by the musician Fela Kuti, who blended these various musical influences to create a unique sound that has had a lasting influence on the music industry.\n\n2. Kuduro\n\nKuduro is a fast-paced dance music genre that originated in Angola in the 1980s and has since gained popularity in other Portuguese-speaking countries such as Mozambique and Portugal. It typically ranges in tempo from 130-150 BPM and is characterized by its heavy use of electronic instruments and electronic dance music (EDM) production techniques.\n\nIt is known for its energetic and upbeat sound, and is often played at parties and events.\n\n3. Highlife\n\nHighlife is a popular music genre that originated in West Africa in the early 20th century and has since spread throughout the continent. It is characterized by its upbeat tempo, typically around 120-140 BPM, and its incorporation of elements from traditional African music, such as percussion and brass instruments.\n\n4. Soukous\n\nSoukous is a popular dance music genre that originated in the Democratic Republic of Congo in the 1960s and has since spread throughout Africa and the diaspora. It is characterized by its fast tempo, typically around 130-150 BPM, and its incorporation of elements from traditional African music, such as percussion and guitar.\n\n5. Gqom\n\nGqom is a South African music genre that originated in the early 2000s and has gained popularity throughout the continent. It is characterized by its fast tempo, typically around 130-150 BPM, and its use of electronic production techniques and percussion.\n\n6. Azonto\n\nAzonto is a fast-paced dance music genre that originated in Ghana in the late 2000s and has since gained popularity throughout West Africa. It typically ranges in tempo from 130-150 BPM and is characterized by its heavy use of electronic instruments and EDM production techniques.\n\n7. Afrobeats\n\nAfrobeats is a genre of popular music that originated in Nigeria in the late 1960s and has since spread throughout West Africa and beyond. It is characterized by its upbeat rhythms, catchy melodies, and Afrocentric lyrics, often sung in local languages. Afrobeats is often associated with the dance party culture in Nigeria, and its music videos are known for their colorful, high-energy visuals and choreography. Afrobeats has gained widespread popularity in recent years, thanks in part to the success of artists like WizKid, Davido, and Burna Boy, who have brought the genre to a global audience through their collaborations with mainstream artists and tours around the world. Afrobeats has also been described as a fusion of various African and global musical styles, including highlife, fuji, hip hop, and electronic dance music.\n\n8. Amapiano\n\nAmapiano is a subgenre of South African house music that originated in the 2010s. It is characterized by its use of piano melodies, deep basslines, and a relaxed, laid-back vibe. Amapiano is often associated with the townships of Johannesburg and Pretoria, and it has become a popular genre at parties and events throughout South Africa. The term “amapiano” is derived from the Zulu word for “piano,” and it refers to the genre’s emphasis on piano melodies and synthesized versions of traditional South African instruments. Amapiano has also been described as a fusion of various musical styles, including kwaito, house, and jazz. Some of the most popular amapiano artists include Kabza De Small, DJ Maphorisa, and De Mthuda.\n\n9. Makossa\n\nMakossa is a popular dance music genre from Cameroon that originated in the 1970s. It is characterized by its upbeat rhythms, catchy melodies, and playful, humorous lyrics, often sung in the Duala language. Makossa has roots in traditional Cameroonian music, but it also incorporates elements of other African and global musical styles, including soukous, highlife, funk, and rumba. Makossa gained widespread popularity in Cameroon and throughout West Africa in the 1970s and 1980s, thanks in part to the success of artists like Manu Dibango, who blended makossa with other musical styles and brought it to a global audience through his tours and recordings. Today, makossa continues to be a popular genre in Cameroon and other parts of Africa, and it is enjoyed by listeners of all ages.\n\n10. Congolese Rumba\n\nCongolese rumba is a popular dance music genre from the Democratic Republic of Congo (DRC) that originated in the 1940s. It is characterized by its upbeat rhythms, catchy melodies, and socially conscious lyrics, often sung in the Lingala language. Congolese rumba has roots in traditional Congolese music, but it also incorporates elements of other African and global musical styles, including soukous, salsa, and jazz. Congolese rumba gained widespread popularity in the DRC and throughout Africa in the 1950s and 1960s, thanks in part to the success of artists like Franco and TPOK Jazz, who blended rumba with other musical styles and brought it to a global audience through their tours and recordings. Today, Congolese rumba continues to be a popular genre in the DRC and other parts of Africa, and it is enjoyed by listeners of all ages.\n\n11. Afrocongo\n\nAfrocongo is a popular dance music genre from the Democratic Republic of Congo (DRC) that originated in the 1960s. It is characterized by its upbeat rhythms, catchy melodies, and Afrocentric lyrics, often sung in the Lingala language. Afrocongo has roots in traditional Congolese music, but it also incorporates elements of other African and global musical styles, including soukous, salsa, and jazz. Afrocongo gained widespread popularity in the DRC and throughout Africa in the 1960s and 1970s, thanks in part to the success of artists like Franco and TPOK Jazz, who blended Afrocongo with other musical styles and brought it to a global audience through their tours and recordings. Today, Afrocongo continues to be a popular genre in the DRC and other parts of Africa, and it is enjoyed by listeners of all ages.\n\nAfrohouse\n\nAfrohouse is a popular dance music genre from South Africa that originated in the 2010s. It is characterized by its use of deep, driving basslines, melodic synthesizers, and a strong African influence, often incorporating traditional African instruments and vocal styles. Afrohouse has roots in traditional African music, but it also incorporates elements of other global musical styles, including house, techno, and electronic dance music. Afrohouse gained widespread popularity in South Africa and beyond in the 2010s and 2020s, thanks in part to the success of artists like Black Coffee, who blended Afrohouse with other musical styles and brought it to a global audience through their tours and recordings. Today, Afrohouse continues to be a popular genre in South Africa and around the world, and it is enjoyed by listeners of all ages.\n\nAfro-Caribbean music\n\nAfro-Caribbean music is a term that encompasses a wide range of music genres from the Caribbean region that incorporate elements from traditional African music. These genres include soca, calypso, and reggaeton, which typically range in tempo from 100-150 BPM. Afro-Caribbean music is known for its lively and energetic sound, and has had a significant influence on popular music genres such as salsa and reggae.\n\nThe Caribbean is a region with a rich and vibrant music culture that has produced a wide range of genres and styles. From traditional folk music to modern electronic dance music, Caribbean music has had a significant influence on the global music industry. In this article, we will take a closer look at some of the most popular Caribbean music genres and their characteristic tempos.\n\n12. Reggae\n\nReggae is a music genre that originated in Jamaica in the late 1960s and has since gained popularity throughout the world. It is characterized by its relaxed and laid-back tempo, typically around 60-80 beats per minute (BPM), and its incorporation of elements from traditional African music, such as ska and rocksteady. Reggae is known for its positive and uplifting lyrics, and has had a significant influence on popular music genres such as reggaeton and dancehall.\n\n13. Soca\n\nSoca is a fast-paced dance music genre that originated in Trinidad and Tobago in the 1970s and has since gained popularity throughout the Caribbean region. It typically ranges in tempo from 100-150 BPM and is characterized by its incorporation of elements from traditional African music, such as calypso, and its heavy use of electronic instruments and electronic dance music (EDM) production techniques. Soca is known for its energetic and upbeat sound, and is often played at parties and events.\n\n14. Calypso\n\nCalypso is a music genre that originated in Trinidad and Tobago in the 19th century and has since spread throughout the Caribbean region. It is characterized by its fast tempo, typically around 120-140 BPM, and its incorporation of elements from traditional African music, such as percussion and brass instruments. Calypso is known for its playful and lighthearted lyrics, and has had a significant influence on popular music genres such as soca and reggae.\n\n15. Dancehall\n\nDancehall is a popular music genre that originated in Jamaica in the late 1970s and has since gained popularity throughout the Caribbean region. It is characterized by its fast tempo, typically around 100-150 BPM, and its incorporation of elements from reggae, hip hop, and electronic dance music. Dancehall is known for its energetic and upbeat sound, and is often played at parties and events\n\n16. Zouk\n\nZouk is a popular dance music genre from the French Caribbean islands of Guadeloupe and Martinique that originated in the 1980s. It is characterized by its upbeat rhythms, catchy melodies, and romantic, sensual lyrics, often sung in French, Antillean Creole, or Portuguese. Zouk has roots in traditional Caribbean music, but it also incorporates elements of other African and global musical styles, including kompa, salsa, and reggae. Zouk gained widespread popularity in the French Caribbean and throughout the Caribbean in the 1980s and 1990s, thanks in part to the success of artists like Kassav’, who blended zouk with other musical styles and brought it to a global audience through their tours and recordings. Today, zouk continues to be a popular genre in the French Caribbean and other parts of the Caribbean, and it is enjoyed by listeners of all ages.\n\n17. Kompa\n\nKompa is a popular dance music genre from Haiti that originated in the 1950s. It is characterized by its upbeat rhythms, catchy melodies, and romantic, sensual lyrics, often sung in Haitian Creole or French. Kompa has roots in traditional Haitian music, but it also incorporates elements of other African and global musical styles, including zouk, salsa, and reggae. Kompa gained widespread popularity in Haiti and throughout the Caribbean in the 1950s and 1960s, thanks in part to the success of artists like Nemours Jean-Baptiste, who blended kompa with other musical styles and brought it to a global audience through his tours and recordings. Today, kompa continues to be a popular genre in Haiti and other parts of the Caribbean, and it is enjoyed by listeners of all ages.\n\n18. Bouyon\n\nBouyon is a popular dance music genre from Dominica that originated in the 1980s. It is characterized by its upbeat rhythms, catchy melodies, and Afrocentric lyrics, often sung in English or French Creole. Bouyon has roots in traditional Caribbean music, but it also incorporates elements of other African and global musical styles, including soca, reggae, and hip hop. Bouyon gained widespread popularity in Dominica and throughout the Caribbean in the 1980s and 1990s, thanks in part to the success of artists like WCK and Burning Flames, who blended bouyon with other musical styles and brought it to a global audience through their tours and recordings. Today, bouyon continues to be a popular genre in Dominica and other parts of the Caribbean, and it is enjoyed by listeners of all ages.\n\nAfro-Latin music\n\nAfro-Latin music is a term that encompasses a wide range of music genres from Latin America that incorporate elements from traditional African music. These genres include salsa, merengue, and reggaeton, which typically range in tempo from 100-150 BPM. Afro-Latin music is known for its lively and danceable sound, and has had a significant influence on popular music genres such as salsa and reggae.\n\n19. Salsa\n\nSalsa is a popular music genre that originated in Cuba in the 1950s and has since spread throughout Latin America and the world. It is characterized by its fast tempo, typically around 100-150 beats per minute (BPM), and its incorporation of elements from traditional African music, such as percussion and brass instruments. Salsa is known for its lively and danceable sound, and has had a significant influence on popular music genres such as reggaeton and merengue.\n\n20. Merengue\n\nMerengue is a popular music genre that originated in the Dominican Republic in the 19th century and has since spread throughout Latin America and the Caribbean region. It is characterized by its fast tempo, typically around 120-140 BPM, and its incorporation of elements from traditional African music, such as percussion and brass instruments. Merengue is known for its energetic and danceable sound, and is often played at parties and events.\n\n21. Reggaeton\n\nReggaeton is a popular music genre that originated in Puerto Rico in the 1990s and has since gained popularity throughout Latin America and the world. It is characterized by its fast tempo, typically around 100-150 BPM, and its incorporation of elements from reggae, hip hop, and electronic dance music. Reggaeton is known for its energetic and upbeat sound, and is often played at parties and events.\n\n22. Bachata\n\nBachata is a popular music genre that originated in the Dominican Republic in the 1960s and has since spread throughout Latin America and the world. It is characterized by its slow tempo, typically around 90-100 BPM, and its incorporation of elements from traditional African music, such as percussion and guitar. Bachata is known for its romantic and emotional lyrics, and is often played at social events and celebrations.\n\n23. Cumbia\n\nCumbia is a popular music genre that originated in Colombia in the 19th century and has since spread throughout Latin America and the Caribbean region. It is characterized by its fast tempo, typically around 120-140 BPM, and its incorporation of elements from traditional African music, such as percussion and brass instruments. Cumbia is known for its energetic and danceable sound, and is often played at parties and events.\n\n24. Baile Funk\n\nBaile funk is a popular dance music genre from Brazil that originated in the 1980s in the favelas (shantytowns) of Rio de Janeiro. It is characterized by its upbeat rhythms, catchy melodies, and energetic, party-oriented lyrics, often sung in Portuguese. Baile funk has roots in traditional Brazilian music, but it also incorporates elements of other African and global musical styles, including hip hop, reggaeton, and electronic dance music. Baile funk gained widespread popularity in Brazil and throughout Latin America in the 1980s and 1990s, thanks in part to the success of artists like MC Marcinho, who blended baile funk with other musical styles and brought it to a global audience through their tours and recordings. Today, baile funk continues to be a popular genre in Brazil and other parts of Latin America, and it is enjoyed by listeners of all ages.\n\n25. Bossa Nova\n\nBossa nova is a popular music genre from Brazil that originated in the 1950s. It is characterized by its smooth, rhythmic melodies, sophisticated harmonies, and introspective, poetic lyrics, often sung in Portuguese. Bossa nova has roots in traditional Brazilian music, but it also incorporates elements of other African and global musical styles, including samba, jazz, and pop. Bossa nova gained widespread popularity in Brazil and throughout the world in the 1950s and 1960s, thanks in part to the success of artists like João Gilberto and Antonio Carlos Jobim, who blended bossa nova with other musical styles and brought it to a global audience through their tours and recordings. Today, bossa nova continues to be a popular genre in Brazil and around the world, and it is enjoyed by listeners of all ages.\n\n26. Dembow\n\nDembow is a popular dance music genre from the Dominican Republic that originated in the 1990s. It is characterized by its upbeat rhythms, catchy melodies, and energetic, party-oriented lyrics, often sung in Spanish. Dembow has roots in traditional Dominican music, but it also incorporates elements of other African and global musical styles, including reggaeton, salsa, and electronic dance music. Dembow gained widespread popularity in the Dominican Republic and throughout Latin America in the 1990s and 2000s, thanks in part to the success of artists like El Cata and El Prodigio, who blended dembow with other musical styles and brought it to a global audience through their tours and recordings. Today, dembow continues to be a popular genre in the Dominican Republic and other parts of Latin America, and it is enjoyed by listeners of all ages.\n\nIn conclusion, salsa, merengue, reggaeton, bachata, and cumbia are just a few of the many diverse and vibrant music genres that have emerged from the Afro-Latin music tradition. These genres are characterized by their fast tempos and their incorporation of elements from traditional African music, and have gained widespread popularity throughout the world.\n\nAfrica is a vast and diverse continent, with a rich and varied music culture that has produced an array of genres and styles. From traditional folk music to modern electronic dance music, Afro music has had a profound influence on the global music industry. In this article, we will take a closer look at some of the most popular Afro music genres and their unique characteristics.\n\nAfro-Caribbean music is a term that encompasses a wide range of music genres from the Caribbean region that incorporate elements from traditional African music. These genres include soca, calypso, and reggaeton, which typically range in tempo from 100-150 BPM.\n\nAfro-Latin music is a term that encompasses a wide range of music genres from Latin America that incorporate elements from traditional African music. These genres include salsa, merengue, and reggaeton, which typically range in tempo from 100-150 BPM.\n\nIn conclusion, Afrobeat, kuduro, highlife, soukous, Afro-Caribbean music, Afro-Latin music, gqom, and azonto are just a few of the many diverse and vibrant music genres that have emerged from the African continent and its diaspora. These genres are characterized by their fast tempos and their incorporation of elements from traditional African music, and have gained widespread popularity throughout the world.\n\nAfro Musicians Essentials Created by Musicians From West Indies & Africa Commercial Ready Afro Genres Samples Library & AI Creative Tools Shop nowAI Creative Tools"}]}