{"Hisashi Iwakuma previously played for the Tokyo Yakult Swallows of Nippon Professional Baseball's (NPB) Central League.": [{"url": "https://english.kyodonews.net/news/2021/10/19a5ef30d93b-baseball-swallows-capture-8th-central-league-pennant.html", "page_content": "KYODO NEWS - Oct 26, 2021 - 22:19 | Sports, All\n\nThe Yakult Swallows captured their eighth Central League championship and first since 2015 on Tuesday in manager Shingo Takatsu's second season at the helm.\n\nThe title marked the second time in team history that the Swallows have won a championship a year after finishing last, a feat they also accomplished in 2015.\n\n\"The day before we started camp, we talked about remembering the frustration of two straight last-place finishes and taking that into the season with us,\" Takatsu said. \"We got off to a rough start and I think the players took that to heart, too, and just played their hearts out up until now.\"\n\nThe club made huge improvements on both sides of the ball, but the most noticeable was on the pitching side, where the Swallows entered Tuesday's games having walked the fewest batters in either league, while leading the CL in strikeouts.\n\n\"Our pitching has been improving year by year, and this season we felt the staff could put us in contention,\" said Takatsu.\n\nThe pitching was helped by having catcher Yuhei Nakamura healthy for most of the season, and got a great contribution from rookie right-hander Yasunobu Okugawa, as well as big seasons from setup man Noboru Shimizu and closer Scott McGough.\n\nFirst-year imports, pitcher Cy Sneed, outfielder Domingo Santana and first baseman Jose Osuna, all provided important contributions after arriving in April.\n\nThe franchise founded ahead of the 1950 season was handicapped by having to play home games away from Tokyo's Jingu Stadium, which was closed for much of the summer due to its proximity to the National Stadium, the centerpiece of the Tokyo Olympics and Paralympics."}, {"url": "https://english.kyodonews.net/news/2022/09/1a12347287f7-urgent-baseball-yakult-swallows-win-central-league-title.html", "page_content": "KYODO NEWS - Sep 25, 2022 - 22:35 | Sports, All\n\nThe Yakult Swallows won their second straight and ninth overall Central League pennant Sunday, edging the second-place DeNA BayStars 1-0 in a ninth-inning walk-off.\n\nThe Swallows clinched the title with six games left to play in their regular season and got to the final stage of the Climax Series playoffs, where they will play the winning team of the first stage for a place in the Japan Series.\n\nKazuya Maruyama, who replaced injured Domingo Santana in the right field in the top of the eighth, plated the pennant-winning run with a double off Edwin Escobar (4-2) with a runner on second and one out at Jingu Stadium.\n\n\"I'm as happy as all you fans,\" said skipper Shingo Takatsu to the home crowd as the Swallows won the CL two straight years for the first time since 1993 when he was playing for the team.\n\n\"Winning once is difficult, winning two in a row is even more difficult. I want everyone to give the team a big round of applause.\"\n\nIn a pitching duel, Yakult was held to a single hit by DeNA lefty Shota Imanaga, who struck out 11 over seven innings, through the first six innings. Two singles and a walk loaded bases in the seventh, but Kotaro Yamasaki grounded out with two outs.\n\nYakult's Yasuhiro Ogawa hurled six shutout innings on two hits. DeNA had a runner on third with two outs in the eighth, but Shugo Maki struck out as the visitors also missed a huge chance to take the lead.\n\nSlugger Munetaka Murakami went without a home run for the ninth straight game and remains one short of his 56th homer, which will put him alone in second on Japan's all-time single-season home run list.\n\n\"He fought alone in July and led the team well. Congratulations to him,\" said Takatsu in reference to the period when the team was hit heavily by COVID-19 infections.\n\n\"We still have a high mountain to climb, but we want to scale the real big one that is waiting after the Climax Series,\" added Takatsu as Yakult looks to win the second straight Japan Series.\n\nThe Chunichi Dragons beat the Yomiuri Giants 7-1 in the other CL game.\n\nThe SoftBank Hawks shed their magic number to secure the Pacific League pennant to five with a 10-0 rout over the Lotte Marines, while the Rakuten Eagles blanked the Nippon Ham Fighters 6-0.\n\nRelated coverage:\n\nBaseball: Munetaka Murakami ties Oh's best with 55th home run\n\nBaseball: Shingo Kawabata pinch-hit drives Swallows to Japan Series title\n\nBaseball: Swallows capture 8th Central League pennant"}, {"url": "https://www.japantimes.co.jp/tag/tokyo-yakult-swallows/", "page_content": "It looks like you're using an ad blocker.\n\nTo enjoy our content, please include The Japan Times on your ad-blocker's list of approved sites.\n\nThank you for supporting our journalism."}, {"url": "https://www.yakult-swallows.co.jp/news/detail/27022", "page_content": "Detail\n\nMeiji Jingu Stadium is a part of the huge sports complex including rugby and soccer stadiums. It opened for Tokyo Big 6 Baseball League in 1926, ten years before the first professional baseball game was played in Japan.\n\nThe stadium has been the home field of the Swallows since 1964 season. Still, University games are still being held there. In its history, Jingu has hosted 6 Japan Series and 13 All-Star games."}, {"url": "https://stepintothebox.com/step-into-the-box/stepintothebox/2021/12/07/the-tokyo-yakult-swallows-win-their-6th-japan-series-title/", "page_content": "Hello! I’m Evyn. こんにちは！エヴィンです。\n\nThe Nippon Professional Baseball League (NPB) or (日本のプロ野球) crowned new champions last week. The Tokyo Yakult Swallows ( 東京 ヤクルトスワローズ) of the Central League (セントラル・リーグ) have won the 2021 Japan Series to earn their 6th title in franchise history after defeating the ORIX Buffaloes in six games. This recent championship gives the Swallows their 3rd championship of the millennium and 2nd since 2015.\n\nThe Tokyo (東京) team based out of Shinjuku clinched their 2-1 victory in the top of the 12th inning off a pinch-hit single into left field by infielder and 2015 セントラル・リーグ batting champ, Shingo Kawabata.\n\nShingo Kawabata, who had 30 pinch-hits in the regular season (2nd all-time), gets the go-ahead knock in the top of the 12th off Yoshida Ryo. pic.twitter.com/Gzy4Jm7Uus — Yakyu Cosmopolitan (@baseballcosmo) November 27, 2021\n\nThe Swallows (73-52-18) ended their regular season with a winning record and in top position in the セントラル・リーグ, while their Japan Series opponent, the ORIX Buffaloes (70-55-18) did the same in the Pacific League (パシフィック・リーグ).\n\nCoincidentally, the Swallows and Buffaloes were the worst teams in 日本のプロ野球 in 2020, both landing the bottom spots in their respective leagues. 2021 proved to be an effective campaign for 2020’s two worst teams as both completed 180’s and made it all the way to the title series.\n\nTokyo Yakult Swallows manager, Shingo Takatsu is thrown in the air by his players following their 2021 Japan Series victory on Nov. 27. (via Official Tokyo Yakult Swallows Twitter)\n\nIf you were wondering why earlier in this article three separate numbers were written in the teams’ record it is because in 日本のプロ野球 there are ties. Prior to the beginning of the 2021 season, teams would play up to 12 innings of baseball, if there was no clear winner at the end of 12 innings and if the outcome had not changed, teams would draw and their records would reflect that.\n\nWith the continuation of the COVID-19 pandemic into 2021, 日本のプロ野球 decide to push back on the number of innings it would take for a draw to occur to 9 instead of the usual 12, this measure inevitably led to significantly more ties across the sport.\n\nOnly time will tell if 日本のプロ野球 will continue it’s 9-inning tie game policy; as a 日本のプロ野球 fan I can only hope that the 2022 season will bring back 12-inning games for draws.\n\nEnglish – Japanese Terms:\n\nHello – こんにちは\n\nI’m Evyn – エヴィンです\n\nJapan – 日本\n\nTokyo – 東京\n\nMonth – 月\n\nDay – 日\n\nJapanese (In reference to a person)- 日本人\n\nCentral League – セントラル・リーグ\n\nPacific League – パシフィック・リーグ\n\nJapanese/Nippon Professional Baseball – 日本のプロ野球\n\nTokyo Yakult Swallows – 東京ヤクルトスワローズ\n\n*I’m no expert in the Japanese language, in fact I’m barely a beginner. I try my best with what I know and with what I can look up. I might make language errors, but it’s all part of the learning process for me as I try to incorporate Japanese into SITB’s articles.\n\n*Stats (some or all) from: MLB/Statcast, Baseball-Reference/Stathead, ESPN, NPB.\n\n**Stats are accurate as of published date.\n\n***Step Into The Box makes every effort to be as accurate as possible. Grammar, spelling and other style errors will be automatically fixed. If a more serious, factual error is unfortunately made, an edit will be added the end of the piece.\n\nShare this: Twitter\n\nFacebook\n\nWhatsApp\n\nLinkedIn\n\nPrint\n\n"}, {"url": "https://www.japantimes.co.jp/sports/2021/04/01/baseball/japanese-baseball/swallows-baystars/", "page_content": "Yasutaka Shiomi and Munetaka Murakami combined to drive in five runs as the Tokyo Yakult Swallows beat the DeNA BayStars 5-3 on Wednesday after the Central League club deactivated six players due to coronavirus issues.\n\nStar second baseman Tetsuto Yamada, two-time batting champion Seiichi Uchikawa and former major leaguer Norichika Aoki were among five Swallows players sent home after backup catcher Akihisa Nishida’s test came back positive.\n\nEven without three of their best players, Yakult blasted Taisei Irie (0-1), the BayStars’ top draft pick last fall, for five runs in his five-inning pro debut."}, {"url": "https://www.japantimes.co.jp/sports/2021/11/25/baseball/japanese-baseball/ishikawa-oldest-winner/", "page_content": "Masanori Ishikawa joined the Tokyo Yakult Swallows two decades ago through a now-abolished free signing system at the 2001 draft — about a month after the Swallows defeated the Kintetsu Buffaloes in the Japan Series.\n\nThere have been a lot of changes — in both baseball and the world as a whole — since then, but Ishikawa in a Swallows uniform has been a constant throughout. He’s also been nothing if not solidly consistent with a 177-176 career record and 3.86 ERA across 2,953 innings in 504 games.\n\nAt 6:04 p.m. at Tokyo Dome on Wednesday night, the 41-year-old lefty became one of the oldest pitchers to start a Japan Series game. At 8:54 p.m., he became the oldest Central League pitcher to win one, narrowly outdueling a hurler 18-years his junior to help bring the Swallows to the brink of their first Japan Series title since 2001 with a 2-1 win over the Orix Buffaloes in Game 4."}, {"url": "https://www.nytimes.com/2011/10/23/sports/baseball/japans-standardized-baseballs-are-popular-with-pitchers.html", "page_content": "TOKYO — Unlike Major League Baseball, for whom Rawlings has been the official supplier of baseballs since 1977, Japan’s top league has long used multiple manufacturers.\n\nThis season, however, for the first time in the 75-year history of Nippon Professional Baseball, every team is using the same supplier.\n\nIn any given season, as many as nine manufacturers had supplied baseballs to Japan’s 12 teams. Many clubs, in fact, contracted with multiple suppliers and freely switched the balls they used in their home games depending on the series, the month or some other variable that had to be revealed in advance to the commissioner’s office.\n\nCiting rising costs and declining domestic production, Commissioner Ryozo Kato began the tedious and touchy process of unifying Japan’s ball last year. Mizuno emerged as the lone supplier."}, {"url": "https://www.travelawaits.com/2471665/how-to-see-tokyo-baseball/", "page_content": "Even if you’re not a big sports fan, a Tokyo baseball game offers a thrilling experience that you’ll never forget. You’ll join thousands of Japanese fans as they support their team — and in Japan, that doesn’t mean throwing on a cap, grabbing a hot dog, and ignoring the game for the first seven innings. While the people of Tokyo are often quiet and reserved in public spaces, that changes in the frenetic atmosphere of the ballpark.\n\nIf you’re considering attending a Tokyo baseball game, here’s everything you need to know to make the most of the experience.\n\nWhat Baseball Teams Play In Tokyo?\n\nThe highest level of Japanese baseball is Nippon Professional Baseball (NPB), which consists of two leagues, the Pacific League and the Central League. It’s comparable to Major League Baseball (MLB) in the United States, and many of the teams have several former MLB players on their rosters.\n\nEach NPB league has six teams, and two of those teams are based in Tokyo: the Tokyo Yakult Swallows and the Yomiuri Giants. Three other teams are close enough to Tokyo for a day trip: the Chiba Lotte Marines, the Yokohama DeNA BayStars, and the Saitama Seibu Lions.\n\nOf these teams, the Yomiuri Giants are the most popular. They’re sometimes referred to as the New York Yankees of the NPB due to their winning history and large fan base. They play home games in the Tokyo Dome, which makes them a safe ticket for Western tourists (since rain won’t cause a cancellation or delay).\n\nYomiuri Giants tickets can be expensive, and if you’re on a budget, Tokyo Swallows tickets might be a better option. The Swallows play their games at Meiji Jingu Stadium, which is within walking distance of the Tokyo Dome. It’s an open-air stadium, so you’ll want to check the weather when purchasing tickets.\n\nWhen To See A Baseball Game In Tokyo\n\nThe NPB baseball season typically starts in late March or early April and concludes with playoffs in October (as with the MLB, exact opening dates and playoff dates change from one season to the next). Games occur almost every day, but most teams take Mondays off. There are a total of 146 games per year.\n\nAs with American baseball games, the most exciting contests typically occur at the beginning and end of the season, but Japanese crowds make the game fun even in the dog days of summer. You can grab a ticket any time and enjoy the experience. However, if you’re buying tickets to a big game — such as opening day, or any playoff game — you’ll want to buy as early as possible. Fortunately, that’s a fairly easy process.\n\nHow To Get Tickets For A Baseball Game In Tokyo\n\nWhile you can buy your tickets at the stadium, sellouts aren’t unheard of. All NPB teams have English websites, although some have significant translation issues. We purchased tickets on the Tokyo Yakult Swallows website, which wasn’t exactly a straightforward process; however, if you’re patient enough to read carefully, you won’t have a problem.\n\nPer an email we received after making the purchase, we’d have received a full refund if our game had been rained out. We picked up our tickets from will call without issue; the ticket attendants asked for our names, and we were on our way into the stadium.\n\nIf you have trouble with team websites, you can use a third-party site that caters to Westerners. Sites like Voyagin feature a more streamlined ordering process, but if you use them, be prepared to pay more for your tickets.\n\nIf you’d prefer to wait, you can usually buy tickets at the gate, particularly if you’re seeing the Swallows (we’re told the Yomiuri Giants sell out more frequently). As a last resort, you can always get tickets from scalpers (yes, scalpers exist in Japan), but of course, you’ll pay for the privilege.\n\nA word of warning: NPB stadiums have dedicated sections for visiting fans. If you’re planning on rooting for a particular team, make sure you’re sitting in the right section. Otherwise, you might find yourself decked out in Yomiuri Giants gear while sitting next to dozens of unimpressed BayStars fans.\n\nWhat To Expect From A Baseball Game In Tokyo\n\nThe experience of watching a baseball game in Japan is substantially different from the experience of watching an American game. Generally speaking, Japanese baseball games move faster; tie games can occur, except under special circumstances in the playoffs, and game lengths are usually limited to 12 innings. That being said, it’s still baseball, and baseball is a fairly slow game, so expect to spend 3 or 4 hours at the ballpark.\n\nIn general, we found Japanese fans to be more attentive than their American counterparts; we didn’t see a single person gazing at a phone when teams had scoring opportunities, and all of the fans in our section seemed invested in every at-bat. By the end of the game, we were cheering loudly for our team — and we still look for Swallows highlights on YouTube on occasion.\n\nIn Japan, there’s an emphasis on fan safety that might seem unusual to Westerners. Large nettings cover most areas where fans sit, protecting against hard-hit foul balls. When a pop-up heads toward the stands, you might hear a loud whistle, which warns you to watch out.\n\nJohn Krane\n\nFood And Beverage Options At Tokyo Baseball Stadiums\n\nJust as you’d find a variety of food options in a modern MLB stadium, you’ll have no shortage of options at an NPB game. American classics like hot dogs and burgers are available, along with bento boxes filled with sushi and other traditional Japanese fare. The food attendants are polite, and they deal with foreigners regularly; if you don’t know the Japanese word for an item, you can simply point at a picture on the menu.\n\nAs in the United States, food and drinks are significantly more expensive once you’re inside the ballpark. However, many stadiums will allow you to bring food and drinks — including alcoholic beverages — into the park. You’ll have to transfer alcoholic drinks into paper cups at the gate (the park staff will give you some direction here).\n\nMost stadiums will also allow visitors to bring one or two snacks, so if you’re hoping to save money, stock up on your way in. If you don’t bring your own stuff, don’t worry. Concession attendants (typically young women) walk the park, offering beer, soda, and other treats. When paying, don’t tip them, since it isn’t customary in Japan.\n\nIf you have dietary restrictions, we recommend carrying a card that explains your needs. JustHungry offers a variety of free printable cards here.\n\nTraditions At Tokyo Baseball Games\n\nAll NPB teams have special team songs, and in some cases, several songs. The fans around you will start singing occasionally. Don’t worry if you don’t know Japanese — you won’t feel out of place if you simply clap along and cheer at the end of the tune.\n\nOther celebrations help to enhance the experience. Tokyo Swallows fans are famous for their umbrella dance, performed after their team scores a run. It’s something to behold, particularly for Western baseball fans who aren’t used to large choreographed celebrations (other than the Wave).\n\nSome teams also release balloons called jet fusen during the seventh-inning stretch. This tradition makes for a colorful display — imagine 40,000 balloons drifting into the open air all at once — but it’s gradually falling out of fashion in Japan due to health concerns. Nevertheless, if you see the people in your section pulling out balloons, get your camera ready.\n\nBecause Japanese fans are typically very invested in their teams, it’s a good idea to pick up some team gear on your way into the ballpark. You’ll find stores selling merchandise outside every stadium, and you can pick up a cap for $20.\n\nWhether you’re traveling alone or with family, a Tokyo baseball game makes for a memorable excursion. Go with an open mind and allow yourself to let loose; you’ll learn a bit about modern Japanese culture, enjoy some great comfort food, and maybe even learn a song or two (if you can track down the English lyrics). You’ll certainly leave with a new appreciation for one of Japan’s most popular sports.\n\nPhoto Credit: Cao Luning / Shutterstock"}, {"url": "https://english.kyodonews.net/news/2022/11/3b0e7bf3c2a8-baseball-yakult-swallows-star-murakami-reveals-mlb-ambitions.html", "page_content": "KYODO NEWS - Nov 14, 2022 - 18:04 | Sports, All\n\nThe Yakult Swallows' record-breaking slugger Munetaka Murakami revealed Monday he has his sights set on a move to the majors as soon as possible.\n\nOne of Japanese baseball's brightest talents, the 22-year-old third baseman was unequivocal about wanting to join the likes of countryman Shohei Ohtani in MLB when quizzed by reporters during a media conference at the Japan National Press Club in Tokyo.\n\n\"Of course I want to try. I don't know how old I'll be, but I'm still young, so the sooner the better,\" Murakami said. \"It will involve discussions with (the Swallows), but if I can go, I want to go soon.\"\n\nThe Kumamoto Prefecture native was named Central League MVP last year and is in strong contention to repeat this year.\n\nHe became Japan's youngest Triple Crown winner in the 2022 Nippon Professional Baseball season, during which he belted 56 home runs to surpass all-time great Sadaharu Oh's previous record for a Japanese-born player of 55.\n\nWhile Murakami is firmly on the radar of major league teams, the path to MLB is not always a straight one for Japanese players, and can often depend on the whims of their NPB clubs.\n\n\"Of course, since I first joined (Yakult), the challenge (of the majors) is something that I have eventually wanted to take on, if allowed the opportunity,\" Murakami said."}]}