{"Hisashi Iwakuma is a three-time NPB All-Star.": [{"url": "https://www.baseball-reference.com/players/i/iwakuhi01.shtml", "page_content": "Frequently Asked Questions\n\nHow old is Hisashi Iwakuma?\n\nHisashi Iwakuma is 42 years old.\n\nWhen was Hisashi Iwakuma born?\n\nHisashi Iwakuma was born on April 12, 1981.\n\nWhere was Hisashi Iwakuma born?\n\nHisashi Iwakuma was born in Higashi Yamato, Tokyo.\n\nHow tall is Hisashi Iwakuma?\n\nHisashi Iwakuma is 6-3 (190 cm) tall.\n\nHow much did Hisashi Iwakuma weigh when playing?\n\nHisashi Iwakuma weighed 210 lbs (95 kg) when playing.\n\nHow many seasons did Hisashi Iwakuma play?\n\nHisashi Iwakuma played 6 seasons.\n\nIs Hisashi Iwakuma in the Hall of Fame?\n\nHisashi Iwakuma has not been elected into the Hall of Fame.\n\nWhat position did Hisashi Iwakuma play?\n\nHisashi Iwakuma was a Pitcher.\n\nHow many strikeouts did Hisashi Iwakuma have?\n\nHisashi Iwakuma had 714 strikeouts over his career.\n\nHow many teams has Hisashi Iwakuma played for?\n\nHisashi Iwakuma played for 1 team, the Seattle Mariners.\n\nHow many World Series has Hisashi Iwakuma won?\n\nHisashi Iwakuma has never won a World Series.\n\nWhen did Hisashi Iwakuma retire?\n\nHisashi Iwakuma last played in 2017.\n\nWhat are Hisashi Iwakuma's nicknames?\n\nKuma is a nickname for Hisashi Iwakuma."}, {"url": "https://www.mlb.com/player/hisashi-iwakuma-547874", "page_content": "2017\n\nHisashi Iwakuma…he and his wife, Madoka, have the three kids, daughter Uta, son Towa and daughter Rima…attended Horikoshi High School…played in 2004 Athens Olympics and 2009 World Baseball Classic…originally selected by Osaka Kintetsu in fifth round of the 1999 NPB amateur draft…nicknamed \"Kuma,\" which is Japanese for \"Bear.\"\n\nWas 0-2 with a 4.35 ERA (15 ER, 31.0 IP) with 16 strikeouts in 6 starts with Seattle… underwent arthroscopic right shoulder debridement surgery on September 27…surgery was performed by Dr. Keith Meister in Dallas, Texas…on 10-day DL May 10 (retro to May 7) with inflammation in right shoulder before being transferred to 60-day DL on July 24… sent on rehab assignment on June 14 and made two starts with High-A Modesto, going 0-1 with a 6.00 ERA (4 ER, 6.0 IP) before recall (but not activation) from rehab on June 22.\n\n2016\n\nThe Totals - Was 16-12 with a 4.12 ERA (91 ER, 199.0 IP) with 147 strikeouts and 46 walks in 33 starts...Team Leader - Led the Mariners in wins (16), starts (33), innings (199.0) and strikeouts (147)... Leaderboard - Among American League leaders, ranked T6th in wins (16), T4th in starts (33), 11th in innings (199.0 IP)... Just Win - Earned a career high 16 wins (previous: 15, 2014)…became the 7th Mariners pitcher to record at least 2 seasons with 15 or more wins, joining Jamie Moyer (4x), Freddy Garcia (3x), Felix Hernandez (3x), Randy Johnson (3x), Marc Langston (3x) and Aaron Sele (2x)... Eating Innings - Tossed 199.0 innings, the 2nd-most in his MLB career (219.2 IP in 2013)... Honors - Named Mariners Pitcher of the Year by the Seattle chapter of BBWAA…the 2nd such honor in his career (also: 2013)...Quite the Finish - Was 15-8 with a 4.03 ERA (67 ER, 149.2 IP) with 109 strikeouts in his final 25 starts of the season... Winner - His 15 wins from May 20 through the end of the season were T4th-most in MLB, trailing Cleveland's Corey Kluber (16), Boston's Rick Porcello (16) and Washington's Max Scherzer (16) and tied with Toronto's J.A. Happ and Chicago-NL's Jon Lester... Japanese Leaderboard - Recorded a career-high 16 wins, T2nd-most in a single season by a Japanese-born pitcher, trailing only 18 wins by Daisuke Matsuzaka-BOS in 2008… joins Yu Darvish-TEX (16 in 2012), Hiroki Kuroda-NYY (16 in 2012) and Hideo Nomo-LAD (16 in 1996, 2002 & 2003) as the only Japanese-born pitchers to record 16 wins in a season...Streaker - Posted a 5-game winning streak, June 28-July 23...marked the second time in his career that he has won five straight starts (also: Aug. 8-Sept 5, 2014)…won a career best 7 straight starts Aug. 16, 2013-May 20, 2014... Rotation Rock - Was the only member of the Mariners Opening Day rotation to make every scheduled start...Eight was Great - Won 8 straight home starts, May 25-Aug.8…went 8-0 with 2.62 ERA (16 ER, 55.0 IP) in those 8 starts...only 2 Mariners pitchers (4x) have won more than 8 straight home starts (R. Johnson, 16 & 11; J. Moyer, 10, 2x)...Paul Abbott also won 8 straight... Cloud Nine - Won 9 games in the first half, a career-high for wins before the All-Star Break (8 in 2013 & 2014)...He's Got Backup - Had a 5.43 run support average, 10th-highest in the American League (120 runs in 199.0 innings).\n\n2015\n\nThe Totals - Was 9-5 with a 3.54 ERA (51 ER, 129.2 IP) with 111 strikeouts in 20 starts. ... Strong Finish - Was 4-2 with a 2.17 ERA (11 ER, 45.2 IP) with 43 strikeouts in last 7 starts of season…was 5-3 with 4.29 ERA (40 ER, 84.0 IP) with 68 strikeouts in first 13 starts, including 0-1 with 6.61 ERA (12 ER, 16.1 IP) in first 3 starts before going on DL. ... Winning Ways - Seattle won 11 of his final 16 starts after losing first four to start season. ... No-No - Threw the 5th no-hitter in Mariners history (4th by a single pitcher) on Aug. 12 vs. Baltimore…was his first MLB complete game…2nd Japanese-born pitcher with an MLB no-hitter (Hideo Nomo, 2x)…4th no-no in MLB in 2015…first no-hitter in American League since Felix Hernandez (Aug. 15, 2012 vs. TB)…according to ESPN Stats & Info, threw his lowest percentage of pitches in strike zone in his career (41 percent, 11 percentage points below his season average entering the day), still throwing 77 of 116 pitches for strikes. ... Player of the Week - Named American League Player of the Week for Aug. 10-16 after tossing no-hitter in his start vs. Baltimore…was his first career Player of the Week honor, and the first by a Mariners pitcher since Felix Hernandez (June 9, 2014). ... Tough No-Decision - Allowed a solo HR (Dozier) w/1 out in the 9th Oct. 2 at MIN, the 1st earned run he'd allowed in his career vs. the Twins, snapping a string of 41 2/3 innings… per STATS Inc., the longest streak to begin career vs. any team since 1974 (as far back as their records go); previous record was 40.0 IP, Troy Percival vs. MIN (5/16/95-8/27/04)…in six career starts vs. the Twins, Iwakuma is 5-0 with a 0.21 ERA (1 ER / 42.1 IP). ... Limiting Damage - Allowed two runs or less in 11 of 20 starts, three or less in 14. ... Road Warrior - Was 5-1 with a 2.56 ERA (17 ER, 59.2 IP) with 51 strikeouts • 500 - Recorded 500th career strikeout by fanning Mitch Moreland in 2nd inning of his win at Texas on Aug. 18…hit milestone while walking 118 batters…according to STATS LLC, T6th-fewest walks before recording 500th strikeout since 1914 (LAD's Kenley Jansen leads with 104 BB/500K)…had 1,175 strikeouts over 11 years in Japan before MLB career. ... Rehab Assignment - In 3 rehab starts with Everett & Tacoma was 1-0 with a 1.35 ERA (2 ER, 13.1 IP) with 13 strikeouts. ... Injury - Suffered right lat strain and was placed on the disabled list April 24 (retro to April 21)…on DL April 21-July 6. ... As Starter - Since making first MLB start July 2, 2012 has gone 46-24 with 3.09 ERA (214 ER, 623.1 IP) in 97 starts… among pitchers with 50+ starts during this stretch, ERA is 10th-best in the Majors\n\n2014\n\nWent 15-9, 3.52ERA (70 ER, 179.0 IP) with 154strikeouts in 28 starts (17 quality starts)... Recorded single-season career-high in wins with15, going 15-9 in 28 starts... Ranked 4th in the AL witha 1.050 WHIP, fourth-best in clubhistory (holds 2nd-best mark with 1.006 in 2013)... Walked only 21 batters in 28 starts…ranked second in MLB with 1.06 BB/9.0IP (P. Hughes, MIN - 0.69) and 3rd with 7.33 strikeout-to-walk ratio…recorded 14 starts without issuing a walk, 2nd-best in MLB (Hughes - 19)... Went 8-6 with a 3.02 ERA (34 ER, 101.1 IP) in 15 starts at Safeco Field…owns a career 2.82 ERA in 49 G/42 GS at Safeco Field... Career-high 8.2 innings July 12 vs. Oakland…held the A's scoreless until a 2-out, 2-run home run by Brandon Moss in the top of the ninth... Recorded pair of 10-plus strikeout games, July 7 vs. Minnesota (10) and Aug. 19 at Philadelphia (11)…has 4 career 10+ strikeout games... Allowed 70 runs, all earned, in 28 starts; 2nd-most runs allowed in a seasonin club history without allowing an UER (Pineiro, 118 in 2005)... Recorded season-high 20.0 consecutive scoreless innings July 1-12…three separate scoreless streaks of at least 20.0 innings in his MLB career: July1-12, 2014 (20.0 IP), Sept. 13, 2013-May 3, 2014 (25.0 IP) and May 26-June 10, 2013(23.2 IP)…became the ﬁrst pitcher since Joe Nathan in 2004-05 to have three 20.0+scoreless innings streaks over a two-season span (ﬁrst in Mariners history),and the ﬁrst starter since Dwight Goodenin 1984-85 (4 steaks of 20.0+ scorelessinnings)... Did not allow a stolen base during the season, with attempted basestealers going 0-for-8... Became the fifth Japanese-born pitcher with 15 wins in a season: Hideo Nomo (3x), Daisuke Matsuzaka (2x), Yu Darvish, Hiroki Kuroda... Set a clubrecord for consecutive scoreless inningsat 27.0, ending after 2.0 innings in hisseason debut May 3 at Houston… streakdated back to Aug. 21, 2013...previousrecord was 25.0 innings, shared by Brian Holman (6/27-7/19/84) and Randy Johnson (5/25-6/15/94)... Posted a 7-3 road record(4.17 ERA)…loss Aug. 3 at Baltimore was ﬁrst road loss since July 4, 2013 at Texas... Opened the season on the disabled list witha strained tendon in his right middle ﬁnger…made one rehab start with Triple-A Tacoma... Passed 2,000 innings for his career (including Japan) in his start July 29 at Cleveland…has 2,065.0 combined career innings... Participated in the MLBJapan All-Star Series in his native country ofJapan, making one start... Since making his ﬁrst MLB start July 2, 2012 has gone 37-19 with a 2.97 ERA(163 ER, 493.2 IP) in 77 starts…among pitchers with at least 50 starts during this stretch, ERA is ninth-best in the Majors.\n\n2013\n\nFinished his second Major League season going 14-6 with a 2.66 ERA (65 ER, 219.2 IP) in 33 starts (23 quality starts). Finished 3rd in the AL Cy Young voting with 73.0 votes. Ranked 3rd in the American League with a 2.66 ERA. Selected to his first All-Star Game, but did not pitch due to starting the final game before the All-Star break. Named Mariners Pitcher of the Year by the Seattle chapter of the Baseball Writers Association of America. Finalist for the Male Athlete of the Year for 2013 in the 79th Seattle Star of the Year. Among AL leaders ranked 3rd in innings pitched (219.2), 3rd in opponent batting average (.220), T4th in quality starts (23), T4th in games started (33), 5th in opponent OPS (.630) and 12th in strikeouts (185). Led the Majors and set a Mariners record with 10 starts in which he pitched at least 6.0 innings and did not allow an ER (5-0, 5 no-decisions)…Felix Hernandez recorded 9 starts of 6.0 or more IP, 0 ER in 2009. Ranked 2nd in the AL and set a Mariners single-season record with a 1.006 WHIP. Went 4-0 with a 1.62 ERA (10 ER, 55.2 IP) over his final 8 starts of the season (8/16-9/25) to lower ERA from 3.02 to 2.66. Went 2-0 with a 0.76 ERA (3 ER, 35.2 IP) in 5 starts in September…2nd-lowest ERA in a month in club history (min. 4 GS), trailing only the 0.50 mark by Mark Langston in September 1988 (3 ER, 53.2 IP, 6 GS). Pitched in a career-high 219.2 innings, besting his Japanese career high of 201.2 IP during his Pacific League MVP season in 2008…IP total was T3rd-most by a Japanese-born pitcher trailing only Hideo Nomo (228.1 in 1996, 220.1 in 2002). Ended the season with a streak of 23.0 consecutive scoreless innings, including 8.0 scoreless innings in his season finale Sept. 25 vs. KC. Recorded a career-high 23.2 scoreless innings streak May 26-June 10 (8th-longest in club history)…did not allow an ER in 31.2 consecutive innings (5/26-6/17), the 2nd-longest streak in club history (34.0 IP, Mark Langston, 1988). Was the only MLB pitcher with two scoreless streaks of at least 20.0 innings during the season…joins Freddy Garcia (2001) as the only pitcher in club history with a pair of scoreless innings streaks of at least 20.0 IP in a single season. Recorded 25.0 consecutive scoreless innings on the road to end the season, tied for the longest streak in club history (8/21-9/18)…Brian Holman (6/27-7/19/89) and Randy Johnson (5/25-6/15/94) also had road scoreless streaks of 25.0 innings…recorded the 3rd-lowest road ERA in club history at 2.45, trailing Felix Hernandez (1.99 in '09) & Randy Johnson (2.45 in '95). Recorded 10 starts without walking a batter, T2nd-most in the AL (Colon, OAK - 12, Price, TB - 10) and T2nd-most in club history (Moyer - 11 in 2002)…ranked 3rd in AL with 1.72 BB/9.0 IP and 4th with 4.40 strikeout-to-walk ratio. Matched career high (6 times) with 8.0 innings pitched…was only 2-0 with 4 no-decisions (1.69 ERA) when pitching 8.0 innings. Opened the season going 7-1, 1.79 ERA in his first 14 starts of the season (ranked 2nd in the AL in ERA following 6/10 start vs. HOU). Held opponents to a .184 average with runners in scoring position (26x141) and .111 with RISP/2 outs (7x63). Since making his first MLB start on July 2, 2012, combined\n\n2012\n\n2011\n\n2010\n\n2009\n\n2008\n\n2007\n\n2006\n\n2005\n\n2004\n\n2003\n\n2002\n\n2001\n\nIn 16 starts went 8-4 with a 2.65 ERA (28 ER, 95.0 IP) to rank first in club history in starter ERA by a rookie (2nd, Felix Hernandez, 2.67 in 2005)...in 14 relief appearances posted a 1-1 record with 2 saves and a 4.75 ERA (16 ER, 30.1 IP)... overall ranked 2nd on team with 3.16 ERA (min. 100.0 IP) ... Finished the season going 6-2, 1.83 ERA (11 ER, 54.0 IP) with 43 strikeouts over his last 9 starts...posted the 2nd-best ERA amongst AL starters during the 9-start stretch (8/17-end of season, min. 5 GS) ... Went 4-0 with a 1.23 ERA (4 ER, 29.1 IP) with 22 strikeouts in 5 G/4 GS vs. the Angels (4-0, 1.37 in 4 GS)...became just the third pitcher in club history to record 4 wins vs. the Angels in a season: Freddy Garcia (5-0, 0.96 in '01) & Jamie Moyer (4-2, 1.67 in '03) ... Mariners won 8 of the last 10 Iwakuma starts, and went 10-6 in his starts overall ... Amongst AL pitchers with at least 100.0 IP, ranked 7th with a 3.16 ERA (44 ER, 125.1 IP)... ranked 3rd amongst AL starters (min. 15 GS) with a 2.65 ERA (28 ER, 95.0 IP) in 16 starts ... Posted the 5th-lowest ERA by an AL starting pitcher since 1988 at 2.65 (min. 15 GS)...the last rookies to have a lower starter ERA were Minnesota's Francisco Liriano (1.92) and the Angels Jered Weaver (2.56) in 2006 ... Set Mariners rookie record with 13 strikeouts in first MLB win as a starter July 30 vs. Toronto (8.0,4,1,1,3,13,HR)...old record was 12 by Freddy Garcia (1999), Randy Johnson (1989) and Mark Langston (3x, 1984)...most strikeouts by a MLB rookie since Stephen Strasburg (14) in 2010...only Japanese born pitcher with as many strikeouts in a MLB game is Hideo Nomo (7 G w/13+ strikeouts) ... Made first start July 2 vs. Baltimore (5.0,3,3,3,3,4,HR)...joined Ichiro (RF) and Munenori Kawasaki (2B) as first Japanese trio in a starting lineup...became 2nd Japanese born pitcher in club history to start on the mound, first since Mac Suzuki in 1999 ... Made 6 relief appearances of at least 3.0 innings (3.05 ERA in those games) ... Notched first MLB win with 2.0 shutout innings June 16 vs. San Francisco ... Recorded first MLB loss June 27 vs. Oakland, allowing only a solo HR in 3.2 IP (1 H, 3 SO)...replaced injured starter Kevin Millwood in 3rd inning ... Earned save in consecutive appearances May 30 at Texas (3.0 IP, 5 H, 3 R) and June 2 at Chicago-AL (1.0 IP, BB, K) ... Made Mariners debut April 20 vs. Chicago (AL)...was the last MLB player on Opening Day roster to appear in a game ... Signed a contract extension through 2014 with an option for 2015 on Nov. 2.Made 17 starts for Rakuten, going 6-7 with a 2.42 ERA (32 ER, 119.0 IP)...averaged 7.0 innings and 99.8 pitches per start...on the disabled list from May 18-July 26 with a sore right shoulder...was 3-2 with a 1.72 ERA at the time of his injury...struck out seasonhigh 13 batters in CG shutout April 26 at Seibu.Posted second season of 200-plus innings of his career...went 10-9, 2.82 with 4 CG and 153 strikeouts in 28 starts...awarded to Oakland via the posting system, but could not reach agreement during 30-day negotiating period.Named Rakuten's Opening Day starter for third consecutive season...part of gold medal winning Japan squad in the World Baseball Classic...went 1-1 with 1.35 ERA (3 ER, 20.0 IP) in 4 G/3 GS in WBC play.Named the Pacific League MVP going 21-4, 1.87 ERA in 28 starts...also named a NPB All-Star, Best Nine Award and the Eiji Sawamura Award winner (Cy Young equivalent)... became the first 20-game winner in the Pacific League since Kazumi Saito in 2003...led the league in ERA and winning percentage...allowed just 3 home runs in 201.2 innings.Named Rakuten's Opening Day starter...sidelined with back soreness and a left oblique strain...returned to full strength following the All-Star break...finished the season 5-5, 3.40 in 16 starts...underwent arthroscopic surgery on his right elbow in October.Limited by lingering shoulder soreness, made only 6 starts...made season debut Aug. 29 vs. Nippon Ham...went 1-2 with a 3.73 ERA (16 ER, 38.2 IP).Went 9-15 with 4.99 ERA (101 ER, 182.1 IP) while making 27 starts.Opened the season going 12-0, setting a club record for consecutive wins to open a season...starting pitcher in the NPB All-Star Game...led the league in both wins and winning percentage (.882)...pitched in Game 5 of the NPB-MLB Post-Season All-Star Series...earned Best Nine Award...pitched in the 2004 Athens Olympics as a member of the Japanese national team (bronze medal).Led the league with 11 complete games...went 15-10, 3.45 with 149 strikeouts in 27 starts...named NPB All-Star.Made 23 starts, going 8-7 with 3.69 ERA (58 ER, 141.1 IP) and 131 strikeouts.Made his NPB debut May 29 vs. Nippon Ham...went 4-2 with a 4.53 ERA (22 ER, 43.2 IP) in 9 appearances (8 GS)...threw CG, 2-hit shutout Sept. 18 vs. Seibu."}, {"url": "https://www.calendarz.com/on-this-day/april/12/hisashi-iwakuma", "page_content": "Birth\n\nApr, 12\n\nHisashi Iwakuma\n\nHisashi Iwakuma, Japanese baseball pitcher\n\nHisashi Iwakuma (岩隈 久志, Iwakuma Hisashi, born April 12, 1981) is a Japanese former professional baseball pitcher. He has played in Nippon Professional Baseball (NPB) for the Osaka Kintetsu Buffaloes from 2000 to 2004, Tohoku Rakuten Golden Eagles from 2005 to 2011, and Yomiuri Giants in 2019, and all of his time in Major League Baseball (MLB) for the Seattle Mariners from 2012 to 2017. Iwakuma retired in 2020 due to lingering shoulder issues that had prevented him from playing that year.\n\n\n\nIwakuma made his professional debut with the Buffaloes in 2000. He was named a NPB All-Star in 2003 and 2004, and played in the 2004 Athens Olympics. He joined the Eagles in 2005. As the Eagles' reigning staff ace, Iwakuma won the Eiji Sawamura Award in 2008, and was also a NPB All-Star that year. He appeared in the 2009 World Baseball Classic for the Japanese national team.\n\n\n\nIwakuma was posted to Major League Baseball after the 2010 season, but he failed to come to an agreement with the winning bidder. After the 2011 season, Iwakuma signed with the Mariners. He was an MLB All-Star in 2013, as well as the third-place finisher for the 2013 American League Cy Young Award.\n\n\n\nOn August 12, 2015, Iwakuma became the second Japanese player ever to pitch a no-hitter in Major League Baseball (joining Hideo Nomo, who threw two), throwing a three-walk, seven-strikeout 3–0 win over the Baltimore Orioles at Safeco Field. It was also his first MLB complete game, and the Mariners' fifth no-hitter in team history."}, {"url": "https://www.fanrankings.com/mlb/articles/top-10-mlb-asian-baseball-players-of-all-time-rankings", "page_content": "AAPI Heritage Month\n\nThe international landscape of baseball continues to grow as baseball popularity increases around the world. This popularity continues to be seen in Asian countries as baseball continues to rank among the most popular sports played within the countries.\n\nThe level of talent continues to grow within the Nippon Professional Baseball league (NPB) and Korean Baseball Organization (KBO) to name a few which has helped open the door for some talented Asian baseball players to make it to Major League Baseball.\n\nAs you look at the Top 10 MLB Asian Baseball Players All-Time Rankings list the list is loaded with players who have made key impacts to Major League Baseball since arriving.\n\nOne of those players who ranks among the best MLB Asian baseball players to play within the league is MLB Hall of Famer Ichiro Suzuki.\n\nSuzuki put together an impressive MLB resume after a stellar NPB career. After arriving with the Seattle Mariners in 2001, Suzuki made 10 MLB All-Star teams, won an AL MVP Award, won 10 Gold Glove Awards, and was the 2001 AL Rookie of the Year.\n\nAs Suzuki is an easy candidate to take home the top spot, other top MLB Asian baseball players include current Los Angeles Angels All-Star Shohei Ohtani as well as former players Hideo Nomo, Hideki Matsui, and Shin Soo Choo. Here is a look at the Top 10 MLB Asian Baseball Players All-Time Rankings list:\n\n\n\n\n\n\n\n\n\nHonorable Mention\n\nChan Ho Park\n\nPosition(s): Starting Pitcher, Relief Pitcher\n\nTeam(s): Los Angeles Dodgers, Texas Rangers, San Diego Padres, New York Mets, Pittsburgh Pirates, Philadelphia Phillies, & New York Yankees\n\nLanding just outside of the Top 10 MLB Asian Baseball Players All-Time Rankings list is the 17-year MLB asian pitcher Chan Ho Park. Park, who started his career with the Los Angeles Dodgers back during the 1994 MLB Season.\n\nThe long-time pitcher star would go on to post six different MLB seasons with at least 12 wins including his 15-11 performance during the 2001 MLB season earning him a spot among the NL All-Star team.\n\nWhen his career was completed in 2010, the South Korean native finished with a career 124-98 record to go along with a 4.36 earned run average over 1993 career innings of work.\n\n\n\n\n\n\n\n\n\nHiroki Kuroda\n\nPosition(s): Starting Pitcher\n\nTeam(s): Los Angeles Dodgers & New York Yankees\n\nAnother former MLB Japanese baseball player and pitcher who put together a solid MLB career is the former Los Angeles Dodgers and New York Yankees starting pitcher Hiroki Kuroda.\n\nKuroda who made his way over to the United States after making five NPB All-Star teams. After arriving in 2008, Kuroda won at least eight games in all seven of his MLB seasons including five straight double-digit win seasons.\n\nTo go along with the five straight double-digit win seasons, Kuroda never allowed higher than a 3.76 earned run average mark over his seven-year career while posting a career 3.45 earned run average while going 79-79 over that stretch.\n\nKuroda posted his best season during the 2012 MLB season winning 16 of his 33 starts while posting a 3.32 earned run average and striking out 167 batters.\n\n\n\n\n\n\n\n\n\nTop 10 Asian MLB Players All-Time\n\n10. Kazuhiro Sasaki\n\nPosition(s): Closer\n\nTeam(s): Seattle Mariners\n\nComing in at number 10 on the Top 10 MLB Asian Baseball Players All-Time Rankings is the former Seattle Mariners closer Kazuhiro Sasaki.\n\nAfter pitching within the NPB from 1990 to 2005, the longtime NPB star made his transition to Major League Baseball with the Mariners where he would play for the four solid seasons in the league before leaving to return to Japan.\n\nIn his first season with the Mariners, Sasaki would post 37 saves to go along with a 3.16 earned run average while winning the 2000 AL Rookie of the Year.\n\nOver the next two seasons Sasaki would make two AL All-Star teams while posting 82 saves over that stretch while ranking among the best closers in baseball.\n\n\n\n\n\n\n\n\n\n9. Koji Uehara\n\nPosition(s): Starting Pitcher, Relief Pitcher, Closer\n\nTeam(s): Baltimore Orioles, Texas Rangers, Boston Red Sox & Chicago Cubs\n\nOne Japanese player who had all the stuff to be a great baseball player is Koji Uehara who joined the league after making nine NPB All-Star teams.\n\nUnfortunately, Uehara struggled to stay healthy during his playing days but showed his potential at times over his MLB career posting a career 22-26 record to go along with a 2.66 earned run average with 95 career saves.\n\nAfter converting from a starting pitcher in 2009, Uehara posted his best season as a closer with the Boston Red Sox in 2014 finishing with a 2.52 earned run average and posting 26 saves. From 2013 to 2015, Uehara posted at least 21 saves to go along with a 2.52 or lower earned run average.\n\n\n\n\n\n\n\n\n\n8. Hisashi Iwakuma\n\nTeam(s): Seattle Mariners\n\nPosition(s): Pitcher\n\nAnother former NPB All-Star who ranks among the best Asian baseball players to play in Major League Baseball is Hisashi Iwakuma.\n\nIwakuma who was a three-time NPB All-Star and Pacific League MVP signed with the Seattle Mariners before the start of the 2012 MLB Season would go on to pitch six seasons for the Mariners posting a 63-39 career record to go along with a career 3.42 earned run average.\n\nIn 2013, Iwakuma posted his best season within Major League Baseball posting a 14-6 overall record to go along with a 2.66 earned run average, 185 strikeouts while making his only MLB All-Star team.\n\n\n\n\n\n\n\n\n\n7. Masahiro Tanaka\n\nPosition(s): Starting Pitcher\n\nTeam(s): New York Yankees\n\nOne of the most exciting players to be posted to Major League Baseball was the former Tohoku Rakuten Golden Eagles starting pitcher Masahiro Tanaka.\n\nAfter being posted six teams made bids for Tanaka before the New York Yankees landed him. After joining the Yankees Tanaka would pitch from 2014 to 2020 with the team posting a 78-46 career record to go with a 3.74 career earned run average mark and 991 career wins.\n\nTanaka posted at least 11 wins in each of his first six seasons while earning an AL All-Star selection during the 2014 MLB season and 2019 MLB season. Tanaka would return to the Golden Eagles after the 2020 MLB season and remains one of the highest paid players within the league.\n\n\n\n\n\n\n\n\n\n6. Yu Darvish\n\nPosition(s): Starting Pitcher\n\nTeam(s): Texas Rangers, Chicago Cubs, Los Angeles Dodgers, San Diego Padres (Active)\n\nOne of two current Top 10 MLB Asians of All-Time who are still actively playing in Major League Baseball is the San Diego Padres starting pitcher Yu Darvish.\n\nSince arriving in the United States, Darvish has made five MLB All-Star teams, led the National League in wins, led the American League in strikeouts, and was an All-MLB First Team selection during the 2020 MLB season.\n\nThe current San Diego Padres starting pitcher has won 16 games twice during his MLB career including during the 2020 MLB season while posting an earned run average below 3.50 in five different MLB seasons. Darvish entered the 2023 MLB season with a career 95-75 record on the mound to go along with 1,788 career strikeouts.\n\n\n\n\n\n\n\n\n\n5. Hideo Nomo\n\nPosition(s): Starting Pitcher\n\nTeam(s): Los Angeles Dodgers, New York Mets, Milwaukee Brewers, Detroit Tigers, Boston Red Sox, Tampa Bay Devils Rays, & Kansas City Royals\n\nRounding out the Top 5 on the Top 10 MLB Asian Baseball Players All-Time Rankings is the former 12-year MLB pitcher Hideo Nomo.\n\nNomo who was known for his unorthodox windup deliveries was brilliant over his career while posting a career 123-109 record to go along with 1,918 strikeouts and a 4.24 career earned run average.\n\nOver his 12-year career, Nomo posted at least 12 wins in seven different seasons including a 13-6 record in his rookie season in 1995 earning him his only MLB All-Star selection and the 1995 NL Rookie of the Year Award.\n\nIn addition to those numbers Nomo threw two career no-hitters while leading the league in strikeouts in two different MLB seasons.\n\n\n\n\n\n\n\n\n\n4. Shin-Soo Choo\n\nPosition(s): Outfielder\n\nTeam(s): Seattle Mariners, Cleveland Indians, Cincinnati Reds, & Texas Rangers\n\nOne of the most popular MLB Asian baseball players is the former longtime Texas Ranger and Cleveland Indians outfielder Shin-Soo Choo.\n\nChoo who made his MLB debut during the 2005 MLB season played from 2005 to 2020 before joining the KBO where he has played in each of the past few seasons.\n\nChoo racked up 218 career home runs over 7,157 career at bats over his career to go along with 782 runs batted in. Over his 16-year MLB career, Choo posted at least 20 home runs in seven different seasons while picking up at least 140 hits in eight different seasons.\n\n\n\n\n\n\n\n\n\n3. Hideki Matsui\n\nPosition(s): Left Fielder, Designated Hitter\n\nTeam(s): New York Yankees, Los Angeles Angels, Oakland A’s & Tampa Bay Rays\n\nWhen it comes to the top three MLB Asian Baseball players to play, each is well deserving of a mention as three of the greatest of All Time. One of those three is the former New York Yankees All-Star outfielder Hideki Matsui who also was known as Godzilla.\n\nMatsui prior to signing with the New York Yankees was a 9-time NPB All-Star and three-time Central League MVP. After joining the Yankees Matsui would make back-to-back All-Star teams in 2003 and 2004 while driving in at least 106 runs in each season.\n\nMatsui would finish his career with four 100 plus runs batted in seasons and five seasons with at least 21 home runs. The 10-year MLB would make two All-Star teams and win a World Series MVP during his time with the Yankees.\n\n\n\n\n\n\n\n\n\n2. Shohei Ohtani\n\nPosition(s): Starting Pitcher, Designated Hitter\n\nTeam(s): Los Angeles Angels\n\nAs of now the current Los Angeles Angels All-Star Shohei Ohtani lands at number two among the greatest Asians to play in Major League Baseball.\n\nThe current Angels starting pitcher and designated hitter continues to perform among the best players in the league both on the mound as well as at the plate. Ohtani, who is doing something that MLB fans have not seen since Babe Ruth, has dominated both as a hitter as a hitter.\n\nHis performance since arriving in Major League Baseball includes being selected to back-to-back All-Star teams, winning the 2021 AL MVP Award, the 2018 AL Rookie of the Year Award, and a member of the Cycle Club after hitting for the cycle during the 2019 MLB Season.\n\n\n\n\n\n\n\n\n\n1. Ichiro Suzuki\n\nPosition(s): Outfielder\n\nTeam(s): Seattle Mariners, New York Yankees, & Miami Marlins\n\nIn at number one on the Top 10 MLB Asian Baseball Players All-Time Rankings is the former Seattle Mariners Hall of Famer Ichiro Suzuki. It is hard to look past Suzuki as not only the best Japanese baseball player but also the greatest Asian baseball player to play in Major League Baseball.\n\nThe NPB seven-time All-Star was as dominant as any player after arriving in the United States while making 10 straight MLB All-Star teams and 10 Gold Glove Awards.\n\nIn his first season during the 2001 MLB season, Suzuki won the AL Rookie of the Year Award as well as the 2001 AL MVP Award. Suzuki would go on to win two AL Batting crowns, lead the AL in stolen bases, and post an MLB record 262 career hits during a single season.\n\nSuzuki would finish his career with 10 straight 200 plus hit seasons, 3089 career hits, 362 doubles, 780 runs batted in, 509 stolen bases and a career .311 batting average.\n\n\n\n\n\n\n\nHow would rank these Asian Baseball Players? Rank below to be added in the Power Rankings\n\nRelated Links:"}, {"url": "http://www.npbtracker.com/2009/03/the-life-and-times-of-hisashi-iwakuma/", "page_content": "More than anyone else on the Japan team, it was Hisashi IwakumaÂ that made a name for himself in this year’s WBC. Iwakuma put in an outstanding performance in the round two elimination game against Cuba, and again in the final when he left the game with a lead over Korea. He isn’t a new face to NPB fans, but he’s not a phenom likeÂ Yu DarvishÂ and hasn’t gotten much exposure abroad.Â\n\nIt’s been somewhat of a winding road to this point for Iwakuma. Let’s take a look at how he got here.\n\n2002\n\nI was living near Osaka in 2002, when Iwakuma arrived on the scene for the local Kintetsu Buffaloes. The Buffaloes were coming off a Japan Series appearance, but had a pretty weak rotation, and he put up respectable numbers in his first full year. More than anything, I recall his funky two-stage delivery, and that people were talking about his as someone to watch in coming years.\n\n2003\n\nIwakuma broke out with a 15-10 record and 3.45 ERA in 195 2/3 innings, and along with Jeremy Powell gave the Buffaloes a solid front-end rotation. Â Kintetsu’s power lineup was aging at that point though, and they weren’t able to compete with the strong Fukuoka Daiei Hawks for the Pacific League title.\n\n2004\n\nIwakuma started the season with a 12-game winning streak and was the top vote-getting pitcher in the Pacific League for the All-Star game. Â Iwakuma plays in the Olympics later in the summer and finished with a 15-2 record.\n\nMore signficantly, the Kintetsu Buffaloes and Orix Blue Wave agreed to merge their baseball operations in the summer of ’04, leading to the establishment of team currently known as the Orix Buffaloes. The merger spurred talks of contraction, which eventually led to a fan-supported players’ strike and the creation of the Tohoku Rakuten Golden Eagles franchise. The merge was a sad event for me, as it meant the end of the Blue Wave name, which I really liked.\n\n2004-5 Offseason\n\nIwakuma refused to play for the merged Buffaloes team, and was traded to the Rakuten expansion team. Rakuten seemed to have a decent foundation to its rotation with Iwakuma and college ace Yasuhiro Ichiba. Ichiba never panned out, and was just recently traded.\n\n2005-7\n\nWilderness years. Two-stage delivery’s were banned in NPB, forcing IwakumaÂ to re-work his mechanics. This video gives you a sense of the changes he had to make; you can see his Kintetsu-era windup from about 1:00-1:20*. He also struggled through injuries and had a doormat of an expansion team behind him until 2007.\n\nÂ *note about the video: click the large button that says å†\u008dç”Ÿ to play the video. There is also an annoying comment feature that can be disabled if you click the button in the lower right of the video player, the one that kind of looks like a chick with a cartoon talk-bubble.Â\n\n2008\n\nA big return to form. Iwakuma stayed healthy and apparently mastered his mechanics. The video I linked to above shows a change he made to his arm slot, which resulted in him getting more groundball outs, and dramatically reduced his home run rate. Despite his excellent season, Iwakuma was snubbed from the Olympic team, which in part allowed him to win a league-leading 21 games. He was the first 20-game winner in NPB since Kei IgawaÂ and Kazumi SaitoÂ both won 20 in 2003, and the first 21-game winner since Yoshinori SatoÂ in 1985.Â\n\nFor his efforts, he was awarded the Sawamura Award as NPB’s best pitcher, and the Pacific League MVP despite playing for a 5th-place team.\n\nThe Future\n\nIwakuma signed a 3-year, 1.1bn yen ($11m) deal with Rakuten after the 2008 season. It’s uncommon for NPB players to sign multi-year deals prior to reaching free agency, so his contract is evidence that Rakuten really thinks highly of him. Â Since I was getting asked this during the NPB chats, as far as I can tell he has about five years of NPB service time, which means he has another four to go before reaching international free agency. Rakuten seems to be commited to building a competitive team around him."}, {"url": "https://www.celebsagewiki.com/hisashi-iwakuma", "page_content": "Age, Biography and Wiki\n\nHisashi Iwakuma was born on 12 April, 1981 in Higashiyamato, Tokyo, Japan, is a Japanese baseball player. Discover Hisashi Iwakuma's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 42 years old?\n\nPopular As N/A Occupation N/A Age 42 years old Zodiac Sign Aries Born 12 April 1981 Birthday 12 April Birthplace Higashiyamato, Tokyo, Japan Nationality Japan\n\nWe recommend you to check the complete list of Famous People born on 12 April. He is a member of famous Player with the age 42 years old group.\n\nHisashi Iwakuma Height, Weight & Measurements\n\nAt 42 years old, Hisashi Iwakuma height is 1.9 m .\n\nPhysical Status Height 1.9 m Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Hisashi Iwakuma's Wife?\n\nHis wife is Madoka Iwakuma\n\nFamily Parents Not Available Wife Madoka Iwakuma Sibling Not Available Children Uta Iwakuma, Towa Iwakuma\n\nHisashi Iwakuma Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Hisashi Iwakuma worth at the age of 42 years old? Hisashi Iwakuma’s income source is mostly from being a successful Player. He is from Japan. We have estimated Hisashi Iwakuma's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Player\n\nHisashi Iwakuma Social Network\n\nInstagram Hisashi Iwakuma Instagram Linkedin Twitter Facebook Wikipedia Hisashi Iwakuma Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.mlb.com/news/facts-about-hisashi-iwakumas-no-hitter/c-142750382", "page_content": "Hisashi Iwakuma's no-hitter -- a 3-0 gem against the Orioles on Wednesday afternoon at Safeco Field -- was the fifth no-no in Mariners history. All five have been thrown at home. Here's a rundown of some other facts about the no-no.\n\n• The no-hitter was Iwakuma's first career complete game.\n\nComplete coverage: Hisashi Iwakuma's no-hitter\n\n• The last three no-hitters thrown by American League pitchers have been authored by the Mariners -- Felix Hernandez threw a perfect game in a 1-0 victory over the Rays on Aug. 15, 2012, and six pitchers combined to toss a no-hitter against the Dodgers in a 1-0 win on June 8, 2012.\n\n• Iwakuma and Hernandez's no-hitters bookended the longest streak of no-hitters in Major League history by one league -- and Iwakuma's came nearly three years to the day after Hernandez's.\n\n• In that span, the National League threw 12 no-hitters.\n\n• Iwakuma's no-no marked the first time one team has accounted for three consecutive no-hitters by a respective league since 1960-61, when the Braves were responsible for three straight no-hitters league-wide. Lew Burdette tossed the first no-no of the streak on Aug. 18, 1960, against the Phillies, before Warren Spahn hurled the league's next two no-hitters, on Sept. 16, 1960, and April 28, 1961.\n\n• Including White Sox right-hander Philip Humber's perfect game at Safeco Field in April 2012, four of the last five AL no-hitters have involved the Mariners.\n\nVideo: [email protected]: Iwakuma one out from no-no with groundout\n\n• The last pitcher to throw a no-hitter in his first career complete game was Humber (it is still his only career complete game).\n\n• Hideo Nomo (with two) is the only other Japanese pitcher in MLB history to throw a no-hitter. Nomo also no-hit the Orioles, doing so on April 4, 2001.\n\nVideo: [email protected]: Double play sends Iwakuma's no-no into 9th\n\n• The Orioles have been no-hit seven times in franchise history. Prior to Wednesday, the last time they were no-hit was on Sept. 1, 2007, against Red Sox right-hander Clay Buchholz.\n\n• Iwakuma's no-hitter was the first no-no to take place place on Aug. 12 of any year.\n\n• The outing came one start after Iwakuma threw a career-high 118 pitches. He threw 116 (77 strikes) on Wednesday.\n\nVideo: [email protected]: Seager makes a great grab in foul territory\n\n• Iwakuma's three walks on Wednesday tied a season high; he walked three on April 14 against the Dodgers.\n\n• The 34-year-old Iwakuma is the oldest pitcher to throw a no-hitter since 40-year-old Randy Johnson threw a perfect game for the D-backs against the Braves at Turner Field on May 18, 2004."}, {"url": "https://www.amazinavenue.com/2010/10/9/1740017/scouting-the-npb-hisashi-iwakuma", "page_content": "Hisashi Iwakuma is a 29-year-old (He will be 30 by the time baseball season begins, having a birthday in April) veteran pitcher who currently pitches for the Tohoku Rakuten Golden Eagles, the NPB's first expansion team. With the Golden Eagles, Iwakuma was their first staff ace, and continued to hold that position until the present, when he was given permission to be posted.\n\nInjuries plagued Iwakuma for a three-year period from 2005 until 2007, and cost him virtually the entire 2006 and 2007 seasons. His 2005 stats were bloated, and at the end of the season, Iwakuma revealed that he had been pitching with a weak shoulder for nearly the entire baseball season, all 182 innings that he pitched. Nippon Professional Baseball also changed certain rules governing two-stage motions (the motion that most Japanese pitchers have, where they come to a hitch, or a stop in the middle of their delivery) also threw off his mechanics, which, in turn, threw off his performance. Because of his shoulder problems, Iwakuma was out for more than half of the 2006 season, pitching only 38 innings. The 2007 season was more of the same, with Iwakuma succumbing to a left oblique strain, limiting him to 90 innings. He had arthroscopic surgery on his right elbow that October, and it did wonders.\n\nIwakuma's best season was 2008, when he won the Pacific League MVP Award, as well as the Eiji Sawamura Award. He took that good karma into the 2009 World Baseball Classic, where he pitched 19 innings of three-run baseball over the course of the tournament. The manager of Team Japan chose Iwakuma to pitch in the final game against Korea, and when everything was said and done, the right-handed possessed a sterling 1.35 ERA, was selected as a member of the All-Tournament Team, and was easily the best pitcher in the competition, edging out even Tournament MVP Daisuke Matsuzaka.\n\nHere are his stats, thanks to NPBtracker.com:\n\nPart I: Scouting Report\n\nAccording to NPBtracker.com, Iwakuma possesses:\n\nA fastball that sits between 87 and 91 MPH.\n\nA shuuto that sits between 87 and 90 MPH.\n\nA forkball that hovers around 85 MPH.\n\nA cutter that hovers around 85 MPH.\n\nA slider that hovers around 80 MPH.\n\nA curveball thrown between 70 and 75 MPH.\n\nIwakuma is primarily a groundball pitcher, but his strikeouts per nine rate and walks per nine are extraordinarily high for a groundball pitcher- he has a career mark of 6.74 K/9 and 2.19 BB/9. It is important to keep in mind that, for three years, he had limited playing time, thereby artificially deflating the numbers he put up during those years, but even still, this shows the great deal of control and finesse that Iwakuma possesses.\n\nHis delivery can be seen here. Before 2005, his delivery was a bit more unique, with him letting his right arm hang at it's side while lifting his left leg, lowering it halfway, and then raising it again before lunging towards the plate. The NPB rule change, as well as his injuries, forced him to abandon it in favor of a more orthodox style of delivery.\n\nPart II: Costs\n\nThough he certainly has put up some sterling numbers in the NPB, there are many factors that, I think, would limit his posting/contractual value. His track record of injury, while it hasn't been a problem since 2007, is still something to keep in the back of ones mind. Iwakuma has never garnered massive amounts of attention in Japan, and thus, is not a media darling, like Daisuke Matsuzaka, or Yu Darvish. Though he is well established in Japan, like all other pitchers making the transition to the MLB, his ability to adapt to the MLB-regulation ball is something that also needs to be kept in mind.\n\nAt the same time, however, if Yu Darvish is posted this winter, Iwakuma's stock might rise exponentially because of it, much like how Kei Igawa's posting and contractual fees were extremely inflated, because he was hitting the market the same time that Dice-K was, and everyone wanted their own, new, shiny, \"Japanese import\". Should Darvish not be posted, however, I think that Iwakuma's posting fees and contractual demands will be much more in line with what was mentioned above.\n\nBecause he is turning 30, and is in the declining stage of his baseball career, factored in with the above-mentioned variables, I really can't foresee him signing with any team for an absurd amount of money, or for a very lengthy period of time. Brandon Siefken, and editor and writer at Japanball.com is reporting that the Japanese media is estimating his posting fee at $12 million dollars- a number that can very easily increase should a desperation-fueled bidding war erupts. I'd estimate that any contract that he signs will likely be for about three years or so, and would be in the neighborhood of $10 million dollars per year, or thereabouts. This is based on the deals that Kenshin Kawakami and Koji Uehara signed, with Iwakuma being both younger and closer to his glory days than either of the other two.\n\nPart III: Conclusion\n\nPersonally, I would take a pass on Iwakuma. His pitching repertoire does not contain any one, single amazing pitch. That is to say, there is nothing about it that blows me away, and makes me feel that, as a pitcher in the MLB, he can blow away opposing batters. His fastballs top out at just over 90 MPH, his out-pitch, the forkball, could theoretically be taken away from him by an MLB pitching coach, over injury concerns, and the transition from NPB-regulation baseballs to MLB-regulation baseballs might negate the above-average control that he possesses, at least for some period of time, as he accustoms himself with the MLB-regulation ball. In the past, he has had numerous injuries, and while he seems to have put that all behind him, this team is the Mets, and as we all know, whatever wrong that can happen will happen. Of late, the team certainly has a way of bringing out all of injury woes in players. I would rather pick up a free agent on the market (such as fellow countryman Hiroki Kuroda) who has proven their worth in the Major Leagues already than take a gamble on Iwakuma- especially if his price becomes artificially inflated due to other, more highly coveted Japanese pitchers."}, {"url": "https://www.mlbtraderumors.com/players/hisashi-iwakuma", "page_content": "Veteran right-hander Hisashi Iwakuma tells Ryan Divish of the Seattle Times that he will conclude his tenure with the Mariners and return to his native Japan. That does not mean, however, that he’s calling his playing career quits.\n\nIwakuma had been trying to return from shoulder surgery, but only made it to a pair of rehab appearances. While he was not able to get all the way back to the big league mound, the 37-year-old says he still hopes to pitch in the Nippon Professional Baseball League in the future.\n\nAs Iwakuma put it: “Looking at the big picture, it’s been long process of rehab, and finally in this long tunnel, I’m starting to see light. … I wanted to explore how much more I could do back in Japan and see if there any teams are interested in me.”\n\nThough he did not come to the majors until his age-31 season, following a strong decade-long NPB run, Iwakuma certainly made his mark at the game’s highest level. He ended up throwing 883 2/3 innings of 3.42 ERA ball, all of them coming with the Seattle organization.\n\nIt’s easy to forget just how effective ’Kuma was over the years. He never posted gaudy strikeout rates, but rarely gave up free passes and (in his first three seasons, at least) drew groundballs on about half the balls put in play against him.\n\nHis best overall season, unquestionably, came in 2013. Iwakuma came up one out shy of accumulating 220 frames and ended the year with a 2.66 ERA and 7.6 K/9 against 1.7 BB/9. He earned his lone All-Star nod in the midst of that campaign, which ended with a third-place finish in the American League Cy Young voting.\n\nOf course, injuries limited Iwakuma more recently. Problems identified on his physical scuttled a three-year, $45MM contract with the Dodgers after the 2015 season. He ended up returning to the M’s on a deal that included a $12MM guarantee and rolling vesting/club options. While the first campaign under that agreement worked out well enough, as Iwakuma threw 199 innings with a 4.12 ERA, he only made six starts with the team in the 2017 season. After the option was declined, Iwakuma ended up returning on a minor-league deal — the same contract that is now coming to a conclusion.\n\nAs he prepares to return to Japan, it’s interesting to look back on the circumstances surrounding his original decision to cross the Pacific. Iwakuma was actually posted in the fall of 2010, with the Athletics winning the bidding under the system in place at that time. When Oakland failed to work out a deal with Iwakuma, he pitched a final season in Japan before drawing interest again as a free agent.\n\nUnfortunately, though he was effective in that intervening campaign, Iwakuma also was limited that year by shoulder issues. He ended up signing an incentive-laden, one-year deal with the M’s for only a $1.5MM guarantee. The Seattle club wisely doubled down on that initial investment in the ensuing offseason with a two-year, $14MM extension that included a cheap, $7MM option for the 2015 season.\n\nThough he spent a relatively brief portion of his career in the majors, Iwakuma rates as one of the better Japanese starters ever to ply his trade at the game’s highest level. Where does he rate among them? That’s up for debate, certainly, but those interested in weighing the question can check out this list I compiled of ten prominent Japanese hurlers who’ve compile a notable number of MLB starts.\n\nPhoto courtesy of USA Today Sports Images."}, {"url": "https://www.lookoutlanding.com/2021/1/12/22227985/seattle-mariners-hisashi-iwakuma-special-assignment-coach-mlb-news", "page_content": "In the biggest Seattle coaching news of the day, the Mariners have brought in Hisashi Iwakuma as a Special Assignment Coach.\n\nI don’t know what that is. Sounds pretty made up.\n\nAccording to the club, Iwakuma will start his new gig during Spring Training and report directly to Jerry Dipoto. The most important part seems to be the specifics of this role, which involves working “with Mariners pitchers and pitching instructors at all levels” and the ability to “periodically visit the team’s minor league affiliates during the season”. Another interesting note stated that Kuma will do some scouting in Japan with Manabu Noto, the scout who helped the Mariners sign Yusei Kikuchi.\n\nSome pretty simple dot connecting tells us that Iwakuma will likely be working pretty heavily with Kikuchi, the Mariners’ most recent Japanese acquisition and the one who struggled the most upon arrival. Iwakuma is one of the more successful Japanese pitchers in recent MLB history; the Mariners are hoping Kikuchi doesn’t go down as one of the bigger failures. To avoid this, it seems, they’re going to have Iwakuma get in his ear regularly.\n\nWhat we don’t know, at least at this point, is how much of this role will be baseball-related and how much will be person-related. Surely Iwakuma can help Kikuchi (and the rest of the pitchers, for that matter) learn how to navigate an MLB lineup. But he can also help with the mental side of pitching in the big leagues, and for Kikuchi specifically, how to do that while living away from home.\n\nIwakuma’s credentials speak for themselves. He pitched 11 seasons in the NPB, won an MVP in 2008, a gold medal at the 2009 World Baseball Classic, made an MLB All-Star team, and pitched a no-hitter against the Orioles in 2015. All signs also indicate that Iwakuma is both a beloved clubhouse guy and a well of information.\n\nLove this! Kuma is the man! https://t.co/1abw8X7Bem — Taijuan Walker (@tai_walker) January 13, 2021\n\nHere’s part of Jerry Dipoto’s quote about the former Mariner pitcher who is now a Mariner coach.\n\n“He was always prepared, has a terrific work ethic, and the ability to communicate the things that made him a successful pitcher. We’re looking forward to adding him to our mix at both the Major and minor league level.”\n\nThe work in the minor leagues might low key be the most interesting part of this whole arrangement. It’s no secret at all that most of the Mariners’ currency is in the minor leagues. The team itself obviously thinks they have some good things going down there, but so much of that is either behind the scenes, dismissed by the common, MLB-centric fan, or both. Bringing on a respected figure with a track record of success to work with the minor league pitchers tells me that the front office believes they have some future MLB starters in the system. You wouldn’t bring in Iwakuma to turn non-prospects into the 26th guy on the roster. You bring in Hisashi Iwakuma to make sure the guys you’re banking on actually cash in on their prospect status.\n\nI have no idea if this will work! Neither do you! But having Hisashi Iwakuma back in the organization is, at the very least, a fun bit of news in this dormant offseason. It will be interesting to monitor this situation in terms of the updates that the team is willing to release to the public."}], "Hisashi Iwakuma won the Sawamura Award in 2008.": [{"url": "https://www.japantimes.co.jp/sports/2020/10/19/baseball/eagles-mariners-pitcher-hisashi-iwakuma-retire/", "page_content": "Yomiuri Giants pitcher Hisashi Iwakuma, who has a combined 170 wins over his career in Japan and the major leagues, plans to retire at the end of the season, his club announced Monday.\n\nIwakuma returned to Nippon Professional Baseball in 2019 after six years with the Seattle Mariners but has yet to pitch for the Giants’ top team due to lingering shoulder issues following a 2017 surgery that derailed his career in the majors.\n\nThe 39-year-old plans to speak at a press conference on Friday."}, {"url": "https://www.baseball-reference.com/bullpen/Hisashi_Iwakuma", "page_content": "Hisashi Iwakuma (岩隈 久志)\n\nBats Right, Throws Right\n\nRight, Right Height 6' 3\", Weight 210 lb.\n\n6' 3\", 210 lb. High School Horikoshi High School\n\nBR page\n\nBiographical Information [ edit ]\n\nHisashi Iwakuma has won the Sawamura Award and starred on the international stage and in the US. He is the son-in-law of Koju Hirohashi.\n\nIwakuma was the 5th-round pick of the Kintetsu Buffaloes in the 2000 NPB draft. Spending most of his rookie year in the minors, he joined the team's rotation in '02, going 8-7 with a 3.69 ERA. In 2003 Iwakuma established himself as Kintetsu's ace, going 15-10 with a 3.45 ERA. He was sixth in the Pacific League in ERA and fourth in wins despite playing on a fifth-place team. Iwakuma did even better in '04, with a 15-2, 3.01 season. He led the PL in wins, was second to Daisuke Matsuzaka in ERA and didn't suffer a defeat till after the All-Star Game (starting off the year 12-0). The rest of the Kintetsu staff went 46-68 during the year.\n\nIwakuma received even more fame after the 2004 season. When the Buffaloes announced a merger with the Orix Blue Wave, Kintetsu's ace said he would not play for the new team. The merged Orix Buffaloes selected him in a draft of the former Buffalo and Blue Wave players, but Iwakuma continued his refusals. The usually-docile players' union threw their weight behind Iwakuma and the Buffaloes relented, letting Iwakuma go to the expansion Rakuten Golden Eagles instead.\n\nIwakuma's first season with Rakuten paled statistically in comparison with his last Kintetsu season. He was clearly the ace of the new squad though - his 4.99 ERA was the best by a starter and his 9-15 record gave him more wins than the next two pitchers combined. He also threw half of the team's 18 complete games. Hisashi did not pitch much in 2006, going 1-2 with a 3.72 ERA in six games. Shoulder injuries and new rules about pitch deliveries limited his effectiveness and playing time.\n\nIwakuma went 5-5 with a 3.40 ERA in 2007. After his three ineffective seasons from 2005-2007, Iwakuma turned things around in a big way in 2008. He went 21-4 with a 1.87 ERA. He edged Yu Darvish by .01 for the PL lead in ERA, led the league in innings (201 2/3), was third with 159 strikeouts (trailing Toshiya Sugiuchi and Darvish) and tied for second with two shutouts. That earned him Pacific League MVP honors. He became just the third MVP in Nippon Pro Baseball history from a 5th-place team, following Hiromitsu Ochiai (1982) and Hiromitsu Kadota (1988. Iwakuma also won the Sawamura Award as the best pitcher in Japan. No one had won 21 games in a NPB season since Yoshinori Sato in 1985.\n\nIwakuma pitched for the Japanese national team in the 2009 World Baseball Classic. He went 1-1 with a 1.35 ERA, allowing only 12 hits in 20 innings while striking out 15. He lost a 1-0 duel to Jung-keun Bong of South Korea, giving up a 4th-inning run on a walk to Jong-wook Lee and hits by Keun-woo Jeong and Tae-kyun Kim. He tossed a scoreless 7th inning in a win over Cuba. Iwakuma started the second game against Cuba, a make-or-break game; he tossed only 69 pitches in six shutout innings before Toshiya Sugiuchi completed the whitewash. It was the earliest Cuba had ever been eliminated from a major baseball tournament. Iwakuma then got the call from Tatsunori Hara to start the finale against South Korea. He allowed only one run in the first 7 innings (a homer by Shin-soo Choo) before giving up a second score in the 8th; he left with a 3-2 lead but Yu Darvish blew the save. Japan went on to win in the 10th. Iwakuma led the tournament in innings (20) and was second to Darvish in strikeouts. He made the All-Tournament team alongside fellow pitchers Daisuke Matsuzaka and Bong. Matsuzaka beat him out for MVP honors, but said that Iwakuma deserved them more.\n\nIwakuma fell to 13-6, 3.25 in 2009. He was 7th in the PL in ERA (between D.J. Houlton and Takayuki Kishi), tied for 5th in wins (with Kishi and Satoshi Nagai) and allowed a league-worst 179 hits. He rebounded a bit at 10-9, 2.82 in 2010, finishing 4th in ERA behind Darvish, Masaru Takeda and Masahiro Tanaka. He was 4th in innings (201), was 7th in losses, tied Chihiro Kaneko for second with 184 hits allowed (only Hideaki Wakui was worse), fanned 153 (7th-most) and had a 1.09 WHIP (4th after Darvish, Yoshihisa Naruse and Takeda).\n\nIwakuma with Seattle\n\nFollowing the 2010 season, Iwakuma's name was placed on the posting system by the Golden Eagles. The Oakland Athletics posted the highest bid to secure the right to negotiate a major league contract with him. Iwakuma turned down a 4-year, $15,250,000 offer from Oakland and opted to remain with Rakuten. He missed part of the season with a shoulder injury, being sidelined from May 18th to July 26th. He had been 3-2, 1.72 in 6 starts before the injury, and went 3-5, 2.87 after his return. He became a free agent after the season, and this time truly made the jump across the Pacific Ocean, signing with the Seattle Mariners. Surprisingly, he only agreed to a one-year contract worth $1.5 million, with potential performance bonuses of $3.4 million, much less than what he had turned down a year earlier. However, he explained that having a good relationship with a team - something he had not felt with Oakland - was more important than the money. He added that he and his family had taken an immediate liking to the city of Seattle and that he was looking forward to being a teammate of the great Ichiro Suzuki.\n\nIwakuma's time in the major leagues did not start off well. He pitched poorly during the Mariners' spring training in 2012, forcing the hand of manager Eric Wedge who announced he would not be part of the team's starting rotation to start the season. The plan was to use him in the bullpen to allow him to build back strength in his shoulder. Thus, he was on the M's special 28-man roster for their season-opening series against the Oakland Athletics in his native Japan, but in one of three spots designated as being ineligible to play during the Series, even though he made the trip across the Pacific Ocean. It took him until April 20th to make his debut, when he pitched four innings in relief of Hector Noesi and Erasmo Ramirez in a game against the Chicago White Sox. He was outstanding, only giving up a single hit during his stint; it was a solo homer by Adam Dunn, although it made little difference in the final 7-3 score in favor of the White Sox. He was the last player from all 30 teams' opening day rosters to make his season debut. He won his first game as a starter on July 30th, beating the Toronto Blue Jays, 4-1. In that game, he set a Mariners rookie record with 13 strikeouts, after surrendering a leadoff homer to Rajai Davis to start the game. He settled down nicely after that rough start, giving up no more runs in completing 8 innings, before turning the ball to Josh Kinney. He had been inserted in the starting rotation just before the All-Star break, but had had to fly back to Japan to be at the side of his ill father only a few days before. He ended the season with a record of 9-5, 3.16, in 30 games, with 16 starts, pitching 125 1/3 innings and striking out 101.\n\nIwakuma started the 2013 season as one of the best pitchers in the major leagues, placing his name among the ERA leaders from the start. He had a scoreless string of 23 2/3 innings in June, only broken by an unearned run allowed to the Houston Astros on June 10th, in a game he won, 3-2. That win improved his record to 7-1 and lowered his ERA to 1.79, trailing only Clay Buchholz's 1.71 at that point of the season. He finished the year at a very solid 14-6, 2.66 with a 1.01 WHIP and 185 K in 219 2/3 IP. He was chosen for the 2013 All-Star Game but did not play due to the Sunday starter rule; Chris Tillman replaced him. He finished among the 2013 AL leaders in ERA (3rd behind Anibal Sanchez and Bartolo Colon), wins (tied for 8th), WHIP (2nd to Max Scherzer), fewest hits per 9 IP (4th behind fellow ex-PL star Darvish, Scherzer and Justin Masterson), fewest walks per 9 (3rd behind David Price and Colon), innings (3rd behind James Shields and R.A. Dickey) and ERA+ (138, 6th, between Chris Sale and Shields). He was third in voting for the 2013 AL Cy Young Award, behind Scherzer and Darvish.\n\nPreparing for spring training in 2014, Iwakuma injured a finger while working out in southern California in January. He showed up in camp wearing a splint due to a strained tendon and had to lay off throwing for a month. The Mariners then announced that as a result, he would not be ready for the start of the season. As a result, he only made his first start on May 3rd, then had back-to-back starts of 8 innings without allowing a run in his second and third outings of the season. After a couple of games in which he was touched for 9 runs in 15 innings and suffered two losses, he bounced back with a gem on June 4th when he shut out the Atlanta Braves for seven innings, combining with two relievers for a 2-0 win. He ended the season with an excellent record of 15-9, 3.52 in 28 starts, and 154 Ks in 179 innings. He tied for 8th in the 2014 AL in wins, was 4th in WHIP (behind teammate Felix Hernandez, Sale and Garrett Richards), was second in walk rate (behind Phil Hughes) and was second in K:BB ratio (also behind Hughes).The Mariners were hoping to take a step forward in 2015 and were counting on Hisashi as one of the team's pillars, but after making only three starts in April, with a record of 0-1 and a 6.61 ERA, he went on the disabled list and was out until July 6th. he was roughed up in his first start back, allowing 5 runs in as many innings to the Detroit Tigers, increasing his ERA to 7.17, but then began pitching well after that. On August 12th, he threw a no-hitter against the Baltimore Orioles, allowing 3 walks and striking out 7, in what was the first complete game and shutout of his big league career. The Mariners won the game, 3-0, as he improved to 4-2 on the year and lowered his ERA to 3.86. He was the second Japanese-born pitcher to throw a no-hitter, after Hideo Nomo. He finished the season with a record of 9-5, 3.54 in 20 starts, logging 129 2/3 innings.\n\nIwakuma became a free agent after the 2015 season and was sought after by the Los Angeles Dodgers, who were looking to strengthen their starting rotation following the departure of co-ace Zack Greinke through free agency. The two sides came to a preliminary agreement on a three-year contract worth $45 million, but after two weeks of intense negotiations, they were unable to agree on the final details of the deal and the Mariners took advantage of the snag to scoop him up back into the fold, inking him on December 17th to a guaranteed one-year contract with two option years. So back he went to Seattle in 2016, but he started off slowly as by mid-May, he was only 1-4 with a 4.38 ERA in 8 starts. However, he won his last three starts of the month, then after going 2-2 in his first four June starts, began a tremendous streak on June 28th, when he beat the Pittsburgh Pirates, 5-2. Starting with that game, he won 7 of 8 starts, topped off with a 3-0 win over the Detroit Tigers on August 8th in which he tossed 7 shutout innings. The streak improved his record to 13-7 while lowering his ERA to 3.79. He ended the season at 16-12, 4.12.\n\nIn 2017, Iwakuma was set back by injuries and made only 6 starts, going 0-2, 4.35. He underwent major shoulder surgery in September and as a result missed all of 2018 after some setbacks while rehabbing in the minors. At 37, there was some question as to whether he would try to make a comeback. He stated that September that he would likely pursue his career back in Japan.\n\nIn 2021, he returned to the Mariners as a special assignment coach.\n\nNotable Achievements [ edit ]\n\nAL All-Star (2013)\n\n15 Wins Seasons: 2 (2014 & 2016)\n\n200 Innings Pitched Seasons: 1 (2013)\n\nFurther Reading [ edit ]\n\nGreg Johns: \"Iwakuma feels Seattle is right place for him: 'It all worked out,' righty says of Mariners reaching out to him after deal with Dodgers fell through\", mlb.com, December 18, 2015. [1]"}, {"url": "http://www.npbtracker.com/2008/10/the-2008-sawamura-award/", "page_content": "Work and my upcoming home move have settled down a little bit, so it’s time to catch up on a little NPB bloggin’. There’s no immediate end in sight to my hectic schedule, but I’m hoping to be able to get back to posting 2-3 times a week.Â\n\nLet’s start the comeback with a look a this year’s race for the Sawamura Award. With apologies to Satoshi Komatsu and Colby Lewis, two pitchers have clearly separated themselves from the pack: Nippon Ham’sÂ Yu Darvish and Rakuten’sÂ Hisashi Iwakuma. Darvish’s regular season is over, while Iwakuma still has another start left, but we have enough numbers to compare. Here’s my fairly simplistic look at them head-to-head.\n\nSelected Rate Stats\n\nName ERA WHIP K/9IP HR/9IP K/BB Yu Darvish 1.88 0.90 9.35 0.49 4.73 Hisashi Iwakuma 1.93 0.99 7.15 0.14 4.43\n\nDarvish has an edge here, but it’s minimal. Both pitchers have sub-2.00 ERAs, sub-1.00 WHIPs, and 4+ K/BB ratios. Darvish has struck more guys out, but Iwakuma has better controlled the home run ball. Both guys have been outstanding by these metrics.\n\nSelected Accumulated Stats\n\nÂ Games Starts CG Shutouts No-walk CG Wins Loses Win % IP Yu Darvish 25 24 10 2 2 16 4 0.800 200.2 Hisashi Iwakuma 27 27 5 2 3 20 4 0.833 195.2\n\nIwakuma has a big edge here in hitting the 20 win mark, becoming the first NPB 20-game winner since Kazumi Saito and Kei Igawa both did it in 2003. This is a particularly phenomenal achievement for a guy pitching for a last place team.\n\nDarvish has been a workhorse, throwing 200 innings in just 24 starts. It should be noted, however, Â that he threw two meaningless innings in Nippon Ham’s 17-0 drubbing of RakutenÂ in the Fighters’ last regular season game to reach 200.\n\nÂ Hits Allowed HR Allowed K BB Runs Earned Runs Yu Darvish 136 11 208 44 44 42 Hisashi Iwakuma 158 3 155 35 48 42\n\nThe WHIP numbers shown above give an indication of how unhittable these guys have been this year, and these totals underscore that further. Despite Iwakuma’s remarkable HR allowed total, overall Darvish has been even less hittable.\n\nThe Sawamura Award\n\nThe recipient of the Sawamura Award is decided by a panel of great NPB pitchers, who in part base their decision on the following criteria (courtesy of Wikipedia):\n\nGames started: 25\n\nWins: 15\n\nComplete games: 10\n\nW/L Percentage: .600\n\nInnings Pitched: 200\n\nERA: 2.50\n\nStrikeouts: 150\n\nWith the exception of Iwakuma’s CG total (5), both pitchers meet all the criteria, or come so close that it doesn’t matter. So it’ll come down to what the selection committee values more highly: Iwakuma’s win total for his also-ran team, or Darvish’s general unhittable-ness.\n\nPersonally, my head says it’s Darvish but my gut says it’s Iwakuma. This would be an easier choice if the Fighters had scored a few more runs behind Darvish early in the season, but they didn’t. Iwakuma was consistent throughout the whole year and helped give Rakuten’s fans their first year of competitive baseball to cheer for. In the end, I think I’d go for Iwakuma.Â"}, {"url": "https://www.japantimes.co.jp/sports/2019/02/27/baseball/japanese-baseball/hisashi-iwakuma-throws-practice-first-time-since-returning-japan-giants/", "page_content": "Former major league pitcher Hisashi Iwakuma on Wednesday threw for the first time in practice since making his return to Japanese baseball with the Yomiuri Giants.\n\nThe 37-year-old right-hander tossed 45 pitches, testing out a variety of balls at the Giants’ preseason camp in Okinawa.\n\n“Right now, I’m just working out how much I can throw. I think it felt alright,” he said."}, {"url": "http://www.npbtracker.com/2008/11/03/", "page_content": "MLB veterans So Taguchi and Tadahito Iguchi both could be headed back to Japan next season.\n\nIguchi is said to be undecided about where he wants to play next year, but has expressed a strong desire in playing for Japan in the 2009 WBC (I don’t think he’s a lock to make the team though). Rakuten and his former organization Softbank have both hinted at interest.\n\nTaguchi’s option was unsurprisingly declined by the Phillies, so he’ll be looking for work for next season. His former team Orix is watching the situation unfold, but not commenting on an acquisition yet. A return to Orix for a farewell season would be a nice ending for a guy that won one Japan Championship and two World Series Championships."}, {"url": "https://www.espn.com/mlb/story/_/id/6824062/hisashi-iwakuma-japan-readies-mlb-hiring-new-agent", "page_content": "Hisashi Iwakuma, one of the top starting pitchers in Japan, has hired a new agent as a prelude to coming to Major League Baseball as a free agent in 2012.\n\nIwakuma, a star right-hander for the Tohoku Rakuten Golden Eagles, is expected to rank among the elite starters in a free-agent market that could include CC Sabathia, C.J. Wilson, Mark Buehrle, Japanese countryman Hiroki Kuroda of the Los Angeles Dodgers and Yu Darvish of Japan's Nippon Ham Fighters. Sabathia can become a free agent if he exercises an opt-out clause in his seven-year, $161 million contract with the New York Yankees this winter.\n\nIwakuma hired Paul Cobbe of Sosnick-Cobbe Sports as his new representative several months ago, but delayed the announcement out of respect for his community and the victims of the March earthquake and tsunami in Sendai, Japan, home of the Eagles. He had also been occupied until recently with rehabilitation from a shoulder injury that sent him to the disabled list in late May. Iwakuma recently rejoined Rakuten and his fastball was clocked at between 89 and 92 miles per hour in his last start.\n\nAlthough Iwakuma's decision will reverberate throughout Japan, Cobbe said the pitcher does not plan to address his professional future during the Golden Eagles' season.\n\n\"Iwakuma-san has instructed me not to discuss Major League Baseball with him during the 2011 season,\" Cobbe said. \"His sole focus is bringing a championship to Rakuten.\"\n\nIwakuma, 30, played in the 2004 Summer Olympics in Athens and the 2009 World Baseball Classic. In 2008 he won the Eiji Sawamura Award, the Japanese equivalent of the Cy Young Award.\n\nThe Oakland Athletics paid a reported $19.1 million posting fee to negotiate with Iwakuma last winter. But talks between the A's and Iwakuma's former agent, Don Nomura, broke down with no resolution, and the pitcher elected to return to Japan after the 30-day negotiating window expired. In early December, Nomura told reporters that the A's were insincere and \"never showed any respect\" to his client during the discussions.\n\nSince Iwakuma is currently in his 10th professional season in Japan, he will not be subject to a \"posting fee\" as a prelude to negotiations with a major league club. There are estimates that an MLB team will have to pay a posting fee in the $25 million-to-$50 million range to win the right to negotiate with Darvish this winter.\n\nSenior writer Jerry Crasnick covers Major League Baseball for ESPN.com."}, {"url": "http://www.npbtracker.com/2008/10/04/", "page_content": "Work and my upcoming home move have settled down a little bit, so it’s time to catch up on a little NPB bloggin’. There’s no immediate end in sight to my hectic schedule, but I’m hoping to be able to get back to posting 2-3 times a week.Â\n\nLet’s start the comeback with a look a this year’s race for the Sawamura Award. With apologies to Satoshi Komatsu and Colby Lewis, two pitchers have clearly separated themselves from the pack: Nippon Ham’sÂ Yu Darvish and Rakuten’sÂ Hisashi Iwakuma. Darvish’s regular season is over, while Iwakuma still has another start left, but we have enough numbers to compare. Here’s my fairly simplistic look at them head-to-head.\n\nSelected Rate Stats\n\nName ERA WHIP K/9IP HR/9IP K/BB Yu Darvish 1.88 0.90 9.35 0.49 4.73 Hisashi Iwakuma 1.93 0.99 7.15 0.14 4.43\n\nDarvish has an edge here, but it’s minimal. Both pitchers have sub-2.00 ERAs, sub-1.00 WHIPs, and 4+ K/BB ratios. Darvish has struck more guys out, but Iwakuma has better controlled the home run ball. Both guys have been outstanding by these metrics.\n\nSelected Accumulated Stats\n\nÂ Games Starts CG Shutouts No-walk CG Wins Loses Win % IP Yu Darvish 25 24 10 2 2 16 4 0.800 200.2 Hisashi Iwakuma 27 27 5 2 3 20 4 0.833 195.2\n\nIwakuma has a big edge here in hitting the 20 win mark, becoming the first NPB 20-game winner since Kazumi Saito and Kei Igawa both did it in 2003. This is a particularly phenomenal achievement for a guy pitching for a last place team.\n\nDarvish has been a workhorse, throwing 200 innings in just 24 starts. It should be noted, however, Â that he threw two meaningless innings in Nippon Ham’s 17-0 drubbing of RakutenÂ in the Fighters’ last regular season game to reach 200.\n\nÂ Hits Allowed HR Allowed K BB Runs Earned Runs Yu Darvish 136 11 208 44 44 42 Hisashi Iwakuma 158 3 155 35 48 42\n\nThe WHIP numbers shown above give an indication of how unhittable these guys have been this year, and these totals underscore that further. Despite Iwakuma’s remarkable HR allowed total, overall Darvish has been even less hittable.\n\nThe Sawamura Award\n\nThe recipient of the Sawamura Award is decided by a panel of great NPB pitchers, who in part base their decision on the following criteria (courtesy of Wikipedia):\n\nGames started: 25\n\nWins: 15\n\nComplete games: 10\n\nW/L Percentage: .600\n\nInnings Pitched: 200\n\nERA: 2.50\n\nStrikeouts: 150\n\nWith the exception of Iwakuma’s CG total (5), both pitchers meet all the criteria, or come so close that it doesn’t matter. So it’ll come down to what the selection committee values more highly: Iwakuma’s win total for his also-ran team, or Darvish’s general unhittable-ness.\n\nPersonally, my head says it’s Darvish but my gut says it’s Iwakuma. This would be an easier choice if the Fighters had scored a few more runs behind Darvish early in the season, but they didn’t. Iwakuma was consistent throughout the whole year and helped give Rakuten’s fans their first year of competitive baseball to cheer for. In the end, I think I’d go for Iwakuma.Â"}, {"url": "https://www.japantimes.co.jp/sports/2013/10/28/baseball/flawless-tanaka-wins-sawamura-award/", "page_content": "Masahiro Tanaka followed up an amazing career first with something even more impressive the second time around.\n\nLess than 24 hours after striking out 12 during a complete-game victory in his Japan Series debut, the Tohoku Rakuten Golden Eagles ace was named the Sawamura Award winner for the second time.\n\n“I’m so happy,” Tanaka told Kyodo News. “It’s the biggest award a pitcher can receive. For an entire year, I was able to keep my place in the starting rotation, and the numbers followed.”"}, {"url": "http://www.npbtracker.com/2009/03/the-life-and-times-of-hisashi-iwakuma/", "page_content": "More than anyone else on the Japan team, it was Hisashi IwakumaÂ that made a name for himself in this year’s WBC. Iwakuma put in an outstanding performance in the round two elimination game against Cuba, and again in the final when he left the game with a lead over Korea. He isn’t a new face to NPB fans, but he’s not a phenom likeÂ Yu DarvishÂ and hasn’t gotten much exposure abroad.Â\n\nIt’s been somewhat of a winding road to this point for Iwakuma. Let’s take a look at how he got here.\n\n2002\n\nI was living near Osaka in 2002, when Iwakuma arrived on the scene for the local Kintetsu Buffaloes. The Buffaloes were coming off a Japan Series appearance, but had a pretty weak rotation, and he put up respectable numbers in his first full year. More than anything, I recall his funky two-stage delivery, and that people were talking about his as someone to watch in coming years.\n\n2003\n\nIwakuma broke out with a 15-10 record and 3.45 ERA in 195 2/3 innings, and along with Jeremy Powell gave the Buffaloes a solid front-end rotation. Â Kintetsu’s power lineup was aging at that point though, and they weren’t able to compete with the strong Fukuoka Daiei Hawks for the Pacific League title.\n\n2004\n\nIwakuma started the season with a 12-game winning streak and was the top vote-getting pitcher in the Pacific League for the All-Star game. Â Iwakuma plays in the Olympics later in the summer and finished with a 15-2 record.\n\nMore signficantly, the Kintetsu Buffaloes and Orix Blue Wave agreed to merge their baseball operations in the summer of ’04, leading to the establishment of team currently known as the Orix Buffaloes. The merger spurred talks of contraction, which eventually led to a fan-supported players’ strike and the creation of the Tohoku Rakuten Golden Eagles franchise. The merge was a sad event for me, as it meant the end of the Blue Wave name, which I really liked.\n\n2004-5 Offseason\n\nIwakuma refused to play for the merged Buffaloes team, and was traded to the Rakuten expansion team. Rakuten seemed to have a decent foundation to its rotation with Iwakuma and college ace Yasuhiro Ichiba. Ichiba never panned out, and was just recently traded.\n\n2005-7\n\nWilderness years. Two-stage delivery’s were banned in NPB, forcing IwakumaÂ to re-work his mechanics. This video gives you a sense of the changes he had to make; you can see his Kintetsu-era windup from about 1:00-1:20*. He also struggled through injuries and had a doormat of an expansion team behind him until 2007.\n\nÂ *note about the video: click the large button that says å†\u008dç”Ÿ to play the video. There is also an annoying comment feature that can be disabled if you click the button in the lower right of the video player, the one that kind of looks like a chick with a cartoon talk-bubble.Â\n\n2008\n\nA big return to form. Iwakuma stayed healthy and apparently mastered his mechanics. The video I linked to above shows a change he made to his arm slot, which resulted in him getting more groundball outs, and dramatically reduced his home run rate. Despite his excellent season, Iwakuma was snubbed from the Olympic team, which in part allowed him to win a league-leading 21 games. He was the first 20-game winner in NPB since Kei IgawaÂ and Kazumi SaitoÂ both won 20 in 2003, and the first 21-game winner since Yoshinori SatoÂ in 1985.Â\n\nFor his efforts, he was awarded the Sawamura Award as NPB’s best pitcher, and the Pacific League MVP despite playing for a 5th-place team.\n\nThe Future\n\nIwakuma signed a 3-year, 1.1bn yen ($11m) deal with Rakuten after the 2008 season. It’s uncommon for NPB players to sign multi-year deals prior to reaching free agency, so his contract is evidence that Rakuten really thinks highly of him. Â Since I was getting asked this during the NPB chats, as far as I can tell he has about five years of NPB service time, which means he has another four to go before reaching international free agency. Rakuten seems to be commited to building a competitive team around him."}, {"url": "https://www.baseball-reference.com/bullpen/Hisashi%20Iwakuma", "page_content": "Hisashi Iwakuma (岩隈 久志)\n\nBats Right, Throws Right\n\nRight, Right Height 6' 3\", Weight 210 lb.\n\n6' 3\", 210 lb. High School Horikoshi High School\n\nBR page\n\nBiographical Information [ edit ]\n\nHisashi Iwakuma has won the Sawamura Award and starred on the international stage and in the US. He is the son-in-law of Koju Hirohashi.\n\nIwakuma was the 5th-round pick of the Kintetsu Buffaloes in the 2000 NPB draft. Spending most of his rookie year in the minors, he joined the team's rotation in '02, going 8-7 with a 3.69 ERA. In 2003 Iwakuma established himself as Kintetsu's ace, going 15-10 with a 3.45 ERA. He was sixth in the Pacific League in ERA and fourth in wins despite playing on a fifth-place team. Iwakuma did even better in '04, with a 15-2, 3.01 season. He led the PL in wins, was second to Daisuke Matsuzaka in ERA and didn't suffer a defeat till after the All-Star Game (starting off the year 12-0). The rest of the Kintetsu staff went 46-68 during the year.\n\nIwakuma received even more fame after the 2004 season. When the Buffaloes announced a merger with the Orix Blue Wave, Kintetsu's ace said he would not play for the new team. The merged Orix Buffaloes selected him in a draft of the former Buffalo and Blue Wave players, but Iwakuma continued his refusals. The usually-docile players' union threw their weight behind Iwakuma and the Buffaloes relented, letting Iwakuma go to the expansion Rakuten Golden Eagles instead.\n\nIwakuma's first season with Rakuten paled statistically in comparison with his last Kintetsu season. He was clearly the ace of the new squad though - his 4.99 ERA was the best by a starter and his 9-15 record gave him more wins than the next two pitchers combined. He also threw half of the team's 18 complete games. Hisashi did not pitch much in 2006, going 1-2 with a 3.72 ERA in six games. Shoulder injuries and new rules about pitch deliveries limited his effectiveness and playing time.\n\nIwakuma went 5-5 with a 3.40 ERA in 2007. After his three ineffective seasons from 2005-2007, Iwakuma turned things around in a big way in 2008. He went 21-4 with a 1.87 ERA. He edged Yu Darvish by .01 for the PL lead in ERA, led the league in innings (201 2/3), was third with 159 strikeouts (trailing Toshiya Sugiuchi and Darvish) and tied for second with two shutouts. That earned him Pacific League MVP honors. He became just the third MVP in Nippon Pro Baseball history from a 5th-place team, following Hiromitsu Ochiai (1982) and Hiromitsu Kadota (1988. Iwakuma also won the Sawamura Award as the best pitcher in Japan. No one had won 21 games in a NPB season since Yoshinori Sato in 1985.\n\nIwakuma pitched for the Japanese national team in the 2009 World Baseball Classic. He went 1-1 with a 1.35 ERA, allowing only 12 hits in 20 innings while striking out 15. He lost a 1-0 duel to Jung-keun Bong of South Korea, giving up a 4th-inning run on a walk to Jong-wook Lee and hits by Keun-woo Jeong and Tae-kyun Kim. He tossed a scoreless 7th inning in a win over Cuba. Iwakuma started the second game against Cuba, a make-or-break game; he tossed only 69 pitches in six shutout innings before Toshiya Sugiuchi completed the whitewash. It was the earliest Cuba had ever been eliminated from a major baseball tournament. Iwakuma then got the call from Tatsunori Hara to start the finale against South Korea. He allowed only one run in the first 7 innings (a homer by Shin-soo Choo) before giving up a second score in the 8th; he left with a 3-2 lead but Yu Darvish blew the save. Japan went on to win in the 10th. Iwakuma led the tournament in innings (20) and was second to Darvish in strikeouts. He made the All-Tournament team alongside fellow pitchers Daisuke Matsuzaka and Bong. Matsuzaka beat him out for MVP honors, but said that Iwakuma deserved them more.\n\nIwakuma fell to 13-6, 3.25 in 2009. He was 7th in the PL in ERA (between D.J. Houlton and Takayuki Kishi), tied for 5th in wins (with Kishi and Satoshi Nagai) and allowed a league-worst 179 hits. He rebounded a bit at 10-9, 2.82 in 2010, finishing 4th in ERA behind Darvish, Masaru Takeda and Masahiro Tanaka. He was 4th in innings (201), was 7th in losses, tied Chihiro Kaneko for second with 184 hits allowed (only Hideaki Wakui was worse), fanned 153 (7th-most) and had a 1.09 WHIP (4th after Darvish, Yoshihisa Naruse and Takeda).\n\nIwakuma with Seattle\n\nFollowing the 2010 season, Iwakuma's name was placed on the posting system by the Golden Eagles. The Oakland Athletics posted the highest bid to secure the right to negotiate a major league contract with him. Iwakuma turned down a 4-year, $15,250,000 offer from Oakland and opted to remain with Rakuten. He missed part of the season with a shoulder injury, being sidelined from May 18th to July 26th. He had been 3-2, 1.72 in 6 starts before the injury, and went 3-5, 2.87 after his return. He became a free agent after the season, and this time truly made the jump across the Pacific Ocean, signing with the Seattle Mariners. Surprisingly, he only agreed to a one-year contract worth $1.5 million, with potential performance bonuses of $3.4 million, much less than what he had turned down a year earlier. However, he explained that having a good relationship with a team - something he had not felt with Oakland - was more important than the money. He added that he and his family had taken an immediate liking to the city of Seattle and that he was looking forward to being a teammate of the great Ichiro Suzuki.\n\nIwakuma's time in the major leagues did not start off well. He pitched poorly during the Mariners' spring training in 2012, forcing the hand of manager Eric Wedge who announced he would not be part of the team's starting rotation to start the season. The plan was to use him in the bullpen to allow him to build back strength in his shoulder. Thus, he was on the M's special 28-man roster for their season-opening series against the Oakland Athletics in his native Japan, but in one of three spots designated as being ineligible to play during the Series, even though he made the trip across the Pacific Ocean. It took him until April 20th to make his debut, when he pitched four innings in relief of Hector Noesi and Erasmo Ramirez in a game against the Chicago White Sox. He was outstanding, only giving up a single hit during his stint; it was a solo homer by Adam Dunn, although it made little difference in the final 7-3 score in favor of the White Sox. He was the last player from all 30 teams' opening day rosters to make his season debut. He won his first game as a starter on July 30th, beating the Toronto Blue Jays, 4-1. In that game, he set a Mariners rookie record with 13 strikeouts, after surrendering a leadoff homer to Rajai Davis to start the game. He settled down nicely after that rough start, giving up no more runs in completing 8 innings, before turning the ball to Josh Kinney. He had been inserted in the starting rotation just before the All-Star break, but had had to fly back to Japan to be at the side of his ill father only a few days before. He ended the season with a record of 9-5, 3.16, in 30 games, with 16 starts, pitching 125 1/3 innings and striking out 101.\n\nIwakuma started the 2013 season as one of the best pitchers in the major leagues, placing his name among the ERA leaders from the start. He had a scoreless string of 23 2/3 innings in June, only broken by an unearned run allowed to the Houston Astros on June 10th, in a game he won, 3-2. That win improved his record to 7-1 and lowered his ERA to 1.79, trailing only Clay Buchholz's 1.71 at that point of the season. He finished the year at a very solid 14-6, 2.66 with a 1.01 WHIP and 185 K in 219 2/3 IP. He was chosen for the 2013 All-Star Game but did not play due to the Sunday starter rule; Chris Tillman replaced him. He finished among the 2013 AL leaders in ERA (3rd behind Anibal Sanchez and Bartolo Colon), wins (tied for 8th), WHIP (2nd to Max Scherzer), fewest hits per 9 IP (4th behind fellow ex-PL star Darvish, Scherzer and Justin Masterson), fewest walks per 9 (3rd behind David Price and Colon), innings (3rd behind James Shields and R.A. Dickey) and ERA+ (138, 6th, between Chris Sale and Shields). He was third in voting for the 2013 AL Cy Young Award, behind Scherzer and Darvish.\n\nPreparing for spring training in 2014, Iwakuma injured a finger while working out in southern California in January. He showed up in camp wearing a splint due to a strained tendon and had to lay off throwing for a month. The Mariners then announced that as a result, he would not be ready for the start of the season. As a result, he only made his first start on May 3rd, then had back-to-back starts of 8 innings without allowing a run in his second and third outings of the season. After a couple of games in which he was touched for 9 runs in 15 innings and suffered two losses, he bounced back with a gem on June 4th when he shut out the Atlanta Braves for seven innings, combining with two relievers for a 2-0 win. He ended the season with an excellent record of 15-9, 3.52 in 28 starts, and 154 Ks in 179 innings. He tied for 8th in the 2014 AL in wins, was 4th in WHIP (behind teammate Felix Hernandez, Sale and Garrett Richards), was second in walk rate (behind Phil Hughes) and was second in K:BB ratio (also behind Hughes).The Mariners were hoping to take a step forward in 2015 and were counting on Hisashi as one of the team's pillars, but after making only three starts in April, with a record of 0-1 and a 6.61 ERA, he went on the disabled list and was out until July 6th. he was roughed up in his first start back, allowing 5 runs in as many innings to the Detroit Tigers, increasing his ERA to 7.17, but then began pitching well after that. On August 12th, he threw a no-hitter against the Baltimore Orioles, allowing 3 walks and striking out 7, in what was the first complete game and shutout of his big league career. The Mariners won the game, 3-0, as he improved to 4-2 on the year and lowered his ERA to 3.86. He was the second Japanese-born pitcher to throw a no-hitter, after Hideo Nomo. He finished the season with a record of 9-5, 3.54 in 20 starts, logging 129 2/3 innings.\n\nIwakuma became a free agent after the 2015 season and was sought after by the Los Angeles Dodgers, who were looking to strengthen their starting rotation following the departure of co-ace Zack Greinke through free agency. The two sides came to a preliminary agreement on a three-year contract worth $45 million, but after two weeks of intense negotiations, they were unable to agree on the final details of the deal and the Mariners took advantage of the snag to scoop him up back into the fold, inking him on December 17th to a guaranteed one-year contract with two option years. So back he went to Seattle in 2016, but he started off slowly as by mid-May, he was only 1-4 with a 4.38 ERA in 8 starts. However, he won his last three starts of the month, then after going 2-2 in his first four June starts, began a tremendous streak on June 28th, when he beat the Pittsburgh Pirates, 5-2. Starting with that game, he won 7 of 8 starts, topped off with a 3-0 win over the Detroit Tigers on August 8th in which he tossed 7 shutout innings. The streak improved his record to 13-7 while lowering his ERA to 3.79. He ended the season at 16-12, 4.12.\n\nIn 2017, Iwakuma was set back by injuries and made only 6 starts, going 0-2, 4.35. He underwent major shoulder surgery in September and as a result missed all of 2018 after some setbacks while rehabbing in the minors. At 37, there was some question as to whether he would try to make a comeback. He stated that September that he would likely pursue his career back in Japan.\n\nIn 2021, he returned to the Mariners as a special assignment coach.\n\nNotable Achievements [ edit ]\n\nAL All-Star (2013)\n\n15 Wins Seasons: 2 (2014 & 2016)\n\n200 Innings Pitched Seasons: 1 (2013)\n\nFurther Reading [ edit ]\n\nGreg Johns: \"Iwakuma feels Seattle is right place for him: 'It all worked out,' righty says of Mariners reaching out to him after deal with Dodgers fell through\", mlb.com, December 18, 2015. [1]"}]}