{"Hisashi Iwakuma signed with the Mariners in January 2012.": [{"url": "https://theathletic.com/2147688/2020/10/19/appreciating-hisashi-iwakumas-memorable-mariners-moments/", "page_content": "The Mariners weren’t entirely sure what they were getting when they signed Japanese pitcher Hisashi Iwakuma to a one-year deal in January 2012.\n\nIwakuma, a right-hander, had a decorated past in Japan and a history of durability, but he was four months shy of his 31st birthday when he signed with Seattle. And on top of that, he was coming off a season where a sore right shoulder limited him to 17 starts and his diminished velocity raised red flags.\n\nAdvertisement\n\nSeattle’s caution was revealed in the terms of Iwakuma’s deal with the team — one year and $1.15 million, though the contract did come with incentives that could garner Iwakuma an additional $3 million. In an offseason where the Mariners had chased free agent slugger Prince Fielder, the deal for Iwakuma felt, well, a little underwhelming.\n\nBut over parts of the next six seasons, Iwakuma — who on Monday announced he will retire following the end of the season in Japan — not only proved a value for Seattle but provided plenty of memorable moments along the way, accumulating a 16.9 WAR and a 3.42 ERA before heading back to his home country in 2018.\n\n“Kuma is a warrior, is my best way to put it,” Mariners manager Scott Servais said in 2018. “He’d come into a ballgame and you’d look up in the first or second inning and think, ‘My gosh, he doesn’t have much today. How’s he going to get through it?’ And he’d find a way.”\n\nIwakuma was an All-Star and finished third in the American League Cy Young Award voting in 2013 when he had a 2.66 ERA. Two years later, he tossed the fifth no-hitter in franchise history. In September 2018, a year after undergoing shoulder surgery, Iwakuma decided to head back to Japan to finishing pitching where he started. He’s on the roster of the Tokyo Giants but has yet to pitch this season because of lingering shoulder issues.\n\nAs for his time in Seattle, Iwakuma said it was an unforgettable chapter in his professional and personal life.\n\n“This is a city that I played for, for seven years and a city that I not only lived in, it’s by far the best city that I can think of,” Iwakuma said in September 2018 through his interpreter, Antony Suzuki. “The city has treated me well. The fans were great. I only have good memories here.”\n\nWe decided to pay homage to Iwakuma’s time in Seattle by breaking down his three best starts with the Mariners (sorted by Baseball-Reference’s game scores).\n\n3. Sept. 25, 2013 vs. Royals (Game score: 82)\n\nHis line: 8 innings, 4 hits, 0 earned runs, 1 walk, 9 strikeouts\n\nAdvertisement\n\nThis was Iwakuma’s final start in his best season with the Mariners, who would finish 71-91 — 20 games ahead of the Astros (!). This was a pretty nice Royals lineup Iwakuma had his way with. Alex Gordon, Billy Butler, Eric Hosmer, Salvador Pérez, Mike Moustakas — a lot of these guys helped the Royals win the World Series two years later, but this loss eliminated the Royals from the postseason. Iwakuma got 13 swinging strikes and 17 called strikes while the Mariners turned two double plays behind him. In many ways, it was the perfect finish to an almost perfect season for Iwakuma, who was 4-0 with a 1.62 ERA over his final eight starts and didn’t allow a run in 23 consecutive innings over his last three games. Get this: He was the only big-league pitcher in 2013 to have two streaks of 20-plus scoreless innings. “He’s special,” Mariners third baseman Kyle Seager said.\n\n2. Aug. 19, 2014 at Phillies (Game score: 85)\n\nHis line: 8 innings, 4 hits, 0 earned runs, 0 walks, 11 strikeouts\n\nFacing a less-than-stellar lineup (the Phillies finished 2014 with a 73-89 record), Iwakuma carved up the Fightins with an outing that was equal part dominant and efficient, as 74 of the 96 pitches he threw were for strikes over his eight innings of work. The Phillies were guessing all night, as evidenced by the 23 called strikes he amassed. Iwakuma’s split-finger fastball proved devastating, especially against a team not used to seeing him — remember, this was interleague play. Only one player on the roster, Ben Revere, had ever faced Iwakuma. This was just the third interleague start in Iwakuma’s career. The results of those three starts? Twenty-two scoreless innings. “He was outstanding,” Seattle manager Lloyd McClendon said. “He commanded all of his pitches. He was in and out and up and down.”\n\n1. Aug. 12, 2015 vs Orioles (Game score: 91)\n\nHis line: 9 innings, 0 hits, 0 earned runs, 3 walks, 7 strikeouts\n\nYou were waiting for this one, right? Iwakuma authored the fifth no-hitter in franchise history during a Wednesday afternoon game against the Orioles, who weren’t actually awful in 2015 (finishing 81-81). He became just the second Japanese pitcher in Major League history to throw a no-hitter (Hideo Nomo was the first to do so in 2001). The funny thing (well, sort of funny) was that Iwakuma was neither overpowering (seven strikeouts), nor supremely in command (three walks). But he was plenty good, getting 19 swinging strikes. Said Orioles manager Buck Showalter after the game. “He didn’t miss.” There were no real close calls in the field for Iwakuma. Seager made a nice over-the-shoulder catch for the first out in foul territory to start the ninth inning, and the n0-no was complete when Iwakuma got Gerardo Parra to line out softly to center fielder Austin Jackson. This was the first American League no-hitter since Félix Hernández threw a perfect game against the Rays on Aug. 15, 2012. “I can’t find the words to express my feelings,” Iwakuma said after the game. “I’m truly happy.”\n\n(Photo of Iwakuma: Otto Greule Jr / Getty Images)"}, {"url": "https://mlb.nbcsports.com/2012/01/05/mariners-sign-hisashi-iwakuma-to-one-year-1-5m-contract/", "page_content": "From ESPN’s Jerry Crasnick comes word that the Mariners have signed Japanese right-hander Hisashi Iwakuma to a one-year, $1.5 million major league contract. The agreement also carries another $3.4 million in performance-based incentives.\n\nIwakuma, 30, registered a superb 2.42 ERA and 90/19 K/BB ratio in 119 innings last season for the Tohoku Rakuten Golden Eagles of Nippon Professional Baseball. He posted a 2.82 ERA and 153/36 K/BB ratio across 201 innings in 2010.\n\nThe A’s tried to sign Iwakuma last offseason, offering up a $19 million posting fee for exclusive negotiating rights, but the two sides ultimately failed to work out a major league contract. If everything goes well in spring training with the Mariners, the 6-foot-3 native of Tokyo should grab a spot at the back end of the Seattle starting rotation."}, {"url": "https://www.mlb.com/news/hisashi-iwakuma-mariners-special-assignment-coach", "page_content": "\n\n\",\"providerName\":\"Twitter\",\"providerUrl\":\"https://twitter.com\",\"type\":\"oembed\",\"width\":550,\"contentType\":\"rich\"},{\"__typename\":\"Markdown\",\"content\":\"The Tokyo native, who pitched in Nippon Professional Baseball for 11 seasons, could be an invaluable addition in this scouting arena for a Mariners club that has consistently had one of the stronger MLB imprints in Japan. Beyond signing Iwakuma in 2012, the club successfully signed Ichiro Suzuki in ‘00 and Kikuchi in ‘19, and it was believed to be the runner-up for Shohei Ohtani in ’17.\n\n\n\nIwakuma was among Japan’s top pitchers before joining Seattle as an international free agent in 2012, having won the Pacific League MVP Award in ’08. The right-hander retired from professional baseball in October after experiencing prolonged shoulder injuries, an issue that dated back to when he first signed with Seattle ahead of his age-31 season. His final appearances as a professional came for the Yomiuri Giants in '19.\n\n\n\nBut when healthy, Iwakuma was one of the Mariners’ most effective pitchers over his six seasons in Seattle (2012-17), going 63-39 with a 3.42 ERA in 150 games, including 136 starts. The ‘13 All-Star’s career ERA is tied for the lowest in club history (min. 500 innings) with Randy Johnson, Felix Hernandez and James Paxton. He was voted the most valuable Mariners pitcher in ’13 and ’16 by the Seattle chapter of the Baseball Writers’ Association of America, and he was a finalist for the AL Cy Young Award in ’13.\n\n\n\nIwakuma is most immortalized for throwing the fifth no-hitter in club history on Aug. 12, 2015, against Baltimore, when he joined Hideo Nomo as just the second Japanese-born pitcher to throw a no-no in the Majors.\",\"type\":\"text\"}],\"contentType\":\"news\",\"subHeadline\":null,\"summary\":\"SEATTLE -- The Mariners are bringing back a familiar face, as the club announced Tuesday that it has hired former pitcher Hisashi Iwakuma as a special assignment coach. Iwakuma will report directly to general manager Jerry Dipoto.\n\nHeralded for his finesse on the mound and his tireless work ethic off\",\"tagline({\\\"formatString\\\":\\\"none\\\"})\":null,\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"storytype-article\",\"title\":\"Article\",\"type\":\"article\"},{\"__typename\":\"ContributorTag\",\"slug\":\"daniel-kramer\",\"title\":\"Daniel Kramer\",\"type\":\"contributor\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-136\",\"title\":\"Seattle Mariners\",\"team\":{\"__ref\":\"Team:136\"},\"type\":\"team\"}],\"type\":\"story\",\"thumbnail\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/tx3uhvkdbihxsryddjcf\",\"title\":\"Hisashi Iwakuma joins Mariners as special assignment coach\"}},\"Person:547874\":{\"__typename\":\"Person\",\"id\":547874},\"Team:136\":{\"__typename\":\"Team\",\"id\":136}}} window.adobeAnalytics = {\"reportingSuiteId\":\"mlbglobal08,mlbcom08\",\"linkInternalFilters\":\"mlb\"} window.globalState = {\"tracking_title\":\"Major League Baseball\",\"lang\":\"en\"} window.appId = '' /*-->*/"}, {"url": "https://www.mlb.com/player/hisashi-iwakuma-547874", "page_content": "2017\n\nHisashi Iwakuma…he and his wife, Madoka, have the three kids, daughter Uta, son Towa and daughter Rima…attended Horikoshi High School…played in 2004 Athens Olympics and 2009 World Baseball Classic…originally selected by Osaka Kintetsu in fifth round of the 1999 NPB amateur draft…nicknamed \"Kuma,\" which is Japanese for \"Bear.\"\n\nWas 0-2 with a 4.35 ERA (15 ER, 31.0 IP) with 16 strikeouts in 6 starts with Seattle… underwent arthroscopic right shoulder debridement surgery on September 27…surgery was performed by Dr. Keith Meister in Dallas, Texas…on 10-day DL May 10 (retro to May 7) with inflammation in right shoulder before being transferred to 60-day DL on July 24… sent on rehab assignment on June 14 and made two starts with High-A Modesto, going 0-1 with a 6.00 ERA (4 ER, 6.0 IP) before recall (but not activation) from rehab on June 22.\n\n2016\n\nThe Totals - Was 16-12 with a 4.12 ERA (91 ER, 199.0 IP) with 147 strikeouts and 46 walks in 33 starts...Team Leader - Led the Mariners in wins (16), starts (33), innings (199.0) and strikeouts (147)... Leaderboard - Among American League leaders, ranked T6th in wins (16), T4th in starts (33), 11th in innings (199.0 IP)... Just Win - Earned a career high 16 wins (previous: 15, 2014)…became the 7th Mariners pitcher to record at least 2 seasons with 15 or more wins, joining Jamie Moyer (4x), Freddy Garcia (3x), Felix Hernandez (3x), Randy Johnson (3x), Marc Langston (3x) and Aaron Sele (2x)... Eating Innings - Tossed 199.0 innings, the 2nd-most in his MLB career (219.2 IP in 2013)... Honors - Named Mariners Pitcher of the Year by the Seattle chapter of BBWAA…the 2nd such honor in his career (also: 2013)...Quite the Finish - Was 15-8 with a 4.03 ERA (67 ER, 149.2 IP) with 109 strikeouts in his final 25 starts of the season... Winner - His 15 wins from May 20 through the end of the season were T4th-most in MLB, trailing Cleveland's Corey Kluber (16), Boston's Rick Porcello (16) and Washington's Max Scherzer (16) and tied with Toronto's J.A. Happ and Chicago-NL's Jon Lester... Japanese Leaderboard - Recorded a career-high 16 wins, T2nd-most in a single season by a Japanese-born pitcher, trailing only 18 wins by Daisuke Matsuzaka-BOS in 2008… joins Yu Darvish-TEX (16 in 2012), Hiroki Kuroda-NYY (16 in 2012) and Hideo Nomo-LAD (16 in 1996, 2002 & 2003) as the only Japanese-born pitchers to record 16 wins in a season...Streaker - Posted a 5-game winning streak, June 28-July 23...marked the second time in his career that he has won five straight starts (also: Aug. 8-Sept 5, 2014)…won a career best 7 straight starts Aug. 16, 2013-May 20, 2014... Rotation Rock - Was the only member of the Mariners Opening Day rotation to make every scheduled start...Eight was Great - Won 8 straight home starts, May 25-Aug.8…went 8-0 with 2.62 ERA (16 ER, 55.0 IP) in those 8 starts...only 2 Mariners pitchers (4x) have won more than 8 straight home starts (R. Johnson, 16 & 11; J. Moyer, 10, 2x)...Paul Abbott also won 8 straight... Cloud Nine - Won 9 games in the first half, a career-high for wins before the All-Star Break (8 in 2013 & 2014)...He's Got Backup - Had a 5.43 run support average, 10th-highest in the American League (120 runs in 199.0 innings).\n\n2015\n\nThe Totals - Was 9-5 with a 3.54 ERA (51 ER, 129.2 IP) with 111 strikeouts in 20 starts. ... Strong Finish - Was 4-2 with a 2.17 ERA (11 ER, 45.2 IP) with 43 strikeouts in last 7 starts of season…was 5-3 with 4.29 ERA (40 ER, 84.0 IP) with 68 strikeouts in first 13 starts, including 0-1 with 6.61 ERA (12 ER, 16.1 IP) in first 3 starts before going on DL. ... Winning Ways - Seattle won 11 of his final 16 starts after losing first four to start season. ... No-No - Threw the 5th no-hitter in Mariners history (4th by a single pitcher) on Aug. 12 vs. Baltimore…was his first MLB complete game…2nd Japanese-born pitcher with an MLB no-hitter (Hideo Nomo, 2x)…4th no-no in MLB in 2015…first no-hitter in American League since Felix Hernandez (Aug. 15, 2012 vs. TB)…according to ESPN Stats & Info, threw his lowest percentage of pitches in strike zone in his career (41 percent, 11 percentage points below his season average entering the day), still throwing 77 of 116 pitches for strikes. ... Player of the Week - Named American League Player of the Week for Aug. 10-16 after tossing no-hitter in his start vs. Baltimore…was his first career Player of the Week honor, and the first by a Mariners pitcher since Felix Hernandez (June 9, 2014). ... Tough No-Decision - Allowed a solo HR (Dozier) w/1 out in the 9th Oct. 2 at MIN, the 1st earned run he'd allowed in his career vs. the Twins, snapping a string of 41 2/3 innings… per STATS Inc., the longest streak to begin career vs. any team since 1974 (as far back as their records go); previous record was 40.0 IP, Troy Percival vs. MIN (5/16/95-8/27/04)…in six career starts vs. the Twins, Iwakuma is 5-0 with a 0.21 ERA (1 ER / 42.1 IP). ... Limiting Damage - Allowed two runs or less in 11 of 20 starts, three or less in 14. ... Road Warrior - Was 5-1 with a 2.56 ERA (17 ER, 59.2 IP) with 51 strikeouts • 500 - Recorded 500th career strikeout by fanning Mitch Moreland in 2nd inning of his win at Texas on Aug. 18…hit milestone while walking 118 batters…according to STATS LLC, T6th-fewest walks before recording 500th strikeout since 1914 (LAD's Kenley Jansen leads with 104 BB/500K)…had 1,175 strikeouts over 11 years in Japan before MLB career. ... Rehab Assignment - In 3 rehab starts with Everett & Tacoma was 1-0 with a 1.35 ERA (2 ER, 13.1 IP) with 13 strikeouts. ... Injury - Suffered right lat strain and was placed on the disabled list April 24 (retro to April 21)…on DL April 21-July 6. ... As Starter - Since making first MLB start July 2, 2012 has gone 46-24 with 3.09 ERA (214 ER, 623.1 IP) in 97 starts… among pitchers with 50+ starts during this stretch, ERA is 10th-best in the Majors\n\n2014\n\nWent 15-9, 3.52ERA (70 ER, 179.0 IP) with 154strikeouts in 28 starts (17 quality starts)... Recorded single-season career-high in wins with15, going 15-9 in 28 starts... Ranked 4th in the AL witha 1.050 WHIP, fourth-best in clubhistory (holds 2nd-best mark with 1.006 in 2013)... Walked only 21 batters in 28 starts…ranked second in MLB with 1.06 BB/9.0IP (P. Hughes, MIN - 0.69) and 3rd with 7.33 strikeout-to-walk ratio…recorded 14 starts without issuing a walk, 2nd-best in MLB (Hughes - 19)... Went 8-6 with a 3.02 ERA (34 ER, 101.1 IP) in 15 starts at Safeco Field…owns a career 2.82 ERA in 49 G/42 GS at Safeco Field... Career-high 8.2 innings July 12 vs. Oakland…held the A's scoreless until a 2-out, 2-run home run by Brandon Moss in the top of the ninth... Recorded pair of 10-plus strikeout games, July 7 vs. Minnesota (10) and Aug. 19 at Philadelphia (11)…has 4 career 10+ strikeout games... Allowed 70 runs, all earned, in 28 starts; 2nd-most runs allowed in a seasonin club history without allowing an UER (Pineiro, 118 in 2005)... Recorded season-high 20.0 consecutive scoreless innings July 1-12…three separate scoreless streaks of at least 20.0 innings in his MLB career: July1-12, 2014 (20.0 IP), Sept. 13, 2013-May 3, 2014 (25.0 IP) and May 26-June 10, 2013(23.2 IP)…became the ﬁrst pitcher since Joe Nathan in 2004-05 to have three 20.0+scoreless innings streaks over a two-season span (ﬁrst in Mariners history),and the ﬁrst starter since Dwight Goodenin 1984-85 (4 steaks of 20.0+ scorelessinnings)... Did not allow a stolen base during the season, with attempted basestealers going 0-for-8... Became the fifth Japanese-born pitcher with 15 wins in a season: Hideo Nomo (3x), Daisuke Matsuzaka (2x), Yu Darvish, Hiroki Kuroda... Set a clubrecord for consecutive scoreless inningsat 27.0, ending after 2.0 innings in hisseason debut May 3 at Houston… streakdated back to Aug. 21, 2013...previousrecord was 25.0 innings, shared by Brian Holman (6/27-7/19/84) and Randy Johnson (5/25-6/15/94)... Posted a 7-3 road record(4.17 ERA)…loss Aug. 3 at Baltimore was ﬁrst road loss since July 4, 2013 at Texas... Opened the season on the disabled list witha strained tendon in his right middle ﬁnger…made one rehab start with Triple-A Tacoma... Passed 2,000 innings for his career (including Japan) in his start July 29 at Cleveland…has 2,065.0 combined career innings... Participated in the MLBJapan All-Star Series in his native country ofJapan, making one start... Since making his ﬁrst MLB start July 2, 2012 has gone 37-19 with a 2.97 ERA(163 ER, 493.2 IP) in 77 starts…among pitchers with at least 50 starts during this stretch, ERA is ninth-best in the Majors.\n\n2013\n\nFinished his second Major League season going 14-6 with a 2.66 ERA (65 ER, 219.2 IP) in 33 starts (23 quality starts). Finished 3rd in the AL Cy Young voting with 73.0 votes. Ranked 3rd in the American League with a 2.66 ERA. Selected to his first All-Star Game, but did not pitch due to starting the final game before the All-Star break. Named Mariners Pitcher of the Year by the Seattle chapter of the Baseball Writers Association of America. Finalist for the Male Athlete of the Year for 2013 in the 79th Seattle Star of the Year. Among AL leaders ranked 3rd in innings pitched (219.2), 3rd in opponent batting average (.220), T4th in quality starts (23), T4th in games started (33), 5th in opponent OPS (.630) and 12th in strikeouts (185). Led the Majors and set a Mariners record with 10 starts in which he pitched at least 6.0 innings and did not allow an ER (5-0, 5 no-decisions)…Felix Hernandez recorded 9 starts of 6.0 or more IP, 0 ER in 2009. Ranked 2nd in the AL and set a Mariners single-season record with a 1.006 WHIP. Went 4-0 with a 1.62 ERA (10 ER, 55.2 IP) over his final 8 starts of the season (8/16-9/25) to lower ERA from 3.02 to 2.66. Went 2-0 with a 0.76 ERA (3 ER, 35.2 IP) in 5 starts in September…2nd-lowest ERA in a month in club history (min. 4 GS), trailing only the 0.50 mark by Mark Langston in September 1988 (3 ER, 53.2 IP, 6 GS). Pitched in a career-high 219.2 innings, besting his Japanese career high of 201.2 IP during his Pacific League MVP season in 2008…IP total was T3rd-most by a Japanese-born pitcher trailing only Hideo Nomo (228.1 in 1996, 220.1 in 2002). Ended the season with a streak of 23.0 consecutive scoreless innings, including 8.0 scoreless innings in his season finale Sept. 25 vs. KC. Recorded a career-high 23.2 scoreless innings streak May 26-June 10 (8th-longest in club history)…did not allow an ER in 31.2 consecutive innings (5/26-6/17), the 2nd-longest streak in club history (34.0 IP, Mark Langston, 1988). Was the only MLB pitcher with two scoreless streaks of at least 20.0 innings during the season…joins Freddy Garcia (2001) as the only pitcher in club history with a pair of scoreless innings streaks of at least 20.0 IP in a single season. Recorded 25.0 consecutive scoreless innings on the road to end the season, tied for the longest streak in club history (8/21-9/18)…Brian Holman (6/27-7/19/89) and Randy Johnson (5/25-6/15/94) also had road scoreless streaks of 25.0 innings…recorded the 3rd-lowest road ERA in club history at 2.45, trailing Felix Hernandez (1.99 in '09) & Randy Johnson (2.45 in '95). Recorded 10 starts without walking a batter, T2nd-most in the AL (Colon, OAK - 12, Price, TB - 10) and T2nd-most in club history (Moyer - 11 in 2002)…ranked 3rd in AL with 1.72 BB/9.0 IP and 4th with 4.40 strikeout-to-walk ratio. Matched career high (6 times) with 8.0 innings pitched…was only 2-0 with 4 no-decisions (1.69 ERA) when pitching 8.0 innings. Opened the season going 7-1, 1.79 ERA in his first 14 starts of the season (ranked 2nd in the AL in ERA following 6/10 start vs. HOU). Held opponents to a .184 average with runners in scoring position (26x141) and .111 with RISP/2 outs (7x63). Since making his first MLB start on July 2, 2012, combined\n\n2012\n\n2011\n\n2010\n\n2009\n\n2008\n\n2007\n\n2006\n\n2005\n\n2004\n\n2003\n\n2002\n\n2001\n\nIn 16 starts went 8-4 with a 2.65 ERA (28 ER, 95.0 IP) to rank first in club history in starter ERA by a rookie (2nd, Felix Hernandez, 2.67 in 2005)...in 14 relief appearances posted a 1-1 record with 2 saves and a 4.75 ERA (16 ER, 30.1 IP)... overall ranked 2nd on team with 3.16 ERA (min. 100.0 IP) ... Finished the season going 6-2, 1.83 ERA (11 ER, 54.0 IP) with 43 strikeouts over his last 9 starts...posted the 2nd-best ERA amongst AL starters during the 9-start stretch (8/17-end of season, min. 5 GS) ... Went 4-0 with a 1.23 ERA (4 ER, 29.1 IP) with 22 strikeouts in 5 G/4 GS vs. the Angels (4-0, 1.37 in 4 GS)...became just the third pitcher in club history to record 4 wins vs. the Angels in a season: Freddy Garcia (5-0, 0.96 in '01) & Jamie Moyer (4-2, 1.67 in '03) ... Mariners won 8 of the last 10 Iwakuma starts, and went 10-6 in his starts overall ... Amongst AL pitchers with at least 100.0 IP, ranked 7th with a 3.16 ERA (44 ER, 125.1 IP)... ranked 3rd amongst AL starters (min. 15 GS) with a 2.65 ERA (28 ER, 95.0 IP) in 16 starts ... Posted the 5th-lowest ERA by an AL starting pitcher since 1988 at 2.65 (min. 15 GS)...the last rookies to have a lower starter ERA were Minnesota's Francisco Liriano (1.92) and the Angels Jered Weaver (2.56) in 2006 ... Set Mariners rookie record with 13 strikeouts in first MLB win as a starter July 30 vs. Toronto (8.0,4,1,1,3,13,HR)...old record was 12 by Freddy Garcia (1999), Randy Johnson (1989) and Mark Langston (3x, 1984)...most strikeouts by a MLB rookie since Stephen Strasburg (14) in 2010...only Japanese born pitcher with as many strikeouts in a MLB game is Hideo Nomo (7 G w/13+ strikeouts) ... Made first start July 2 vs. Baltimore (5.0,3,3,3,3,4,HR)...joined Ichiro (RF) and Munenori Kawasaki (2B) as first Japanese trio in a starting lineup...became 2nd Japanese born pitcher in club history to start on the mound, first since Mac Suzuki in 1999 ... Made 6 relief appearances of at least 3.0 innings (3.05 ERA in those games) ... Notched first MLB win with 2.0 shutout innings June 16 vs. San Francisco ... Recorded first MLB loss June 27 vs. Oakland, allowing only a solo HR in 3.2 IP (1 H, 3 SO)...replaced injured starter Kevin Millwood in 3rd inning ... Earned save in consecutive appearances May 30 at Texas (3.0 IP, 5 H, 3 R) and June 2 at Chicago-AL (1.0 IP, BB, K) ... Made Mariners debut April 20 vs. Chicago (AL)...was the last MLB player on Opening Day roster to appear in a game ... Signed a contract extension through 2014 with an option for 2015 on Nov. 2.Made 17 starts for Rakuten, going 6-7 with a 2.42 ERA (32 ER, 119.0 IP)...averaged 7.0 innings and 99.8 pitches per start...on the disabled list from May 18-July 26 with a sore right shoulder...was 3-2 with a 1.72 ERA at the time of his injury...struck out seasonhigh 13 batters in CG shutout April 26 at Seibu.Posted second season of 200-plus innings of his career...went 10-9, 2.82 with 4 CG and 153 strikeouts in 28 starts...awarded to Oakland via the posting system, but could not reach agreement during 30-day negotiating period.Named Rakuten's Opening Day starter for third consecutive season...part of gold medal winning Japan squad in the World Baseball Classic...went 1-1 with 1.35 ERA (3 ER, 20.0 IP) in 4 G/3 GS in WBC play.Named the Pacific League MVP going 21-4, 1.87 ERA in 28 starts...also named a NPB All-Star, Best Nine Award and the Eiji Sawamura Award winner (Cy Young equivalent)... became the first 20-game winner in the Pacific League since Kazumi Saito in 2003...led the league in ERA and winning percentage...allowed just 3 home runs in 201.2 innings.Named Rakuten's Opening Day starter...sidelined with back soreness and a left oblique strain...returned to full strength following the All-Star break...finished the season 5-5, 3.40 in 16 starts...underwent arthroscopic surgery on his right elbow in October.Limited by lingering shoulder soreness, made only 6 starts...made season debut Aug. 29 vs. Nippon Ham...went 1-2 with a 3.73 ERA (16 ER, 38.2 IP).Went 9-15 with 4.99 ERA (101 ER, 182.1 IP) while making 27 starts.Opened the season going 12-0, setting a club record for consecutive wins to open a season...starting pitcher in the NPB All-Star Game...led the league in both wins and winning percentage (.882)...pitched in Game 5 of the NPB-MLB Post-Season All-Star Series...earned Best Nine Award...pitched in the 2004 Athens Olympics as a member of the Japanese national team (bronze medal).Led the league with 11 complete games...went 15-10, 3.45 with 149 strikeouts in 27 starts...named NPB All-Star.Made 23 starts, going 8-7 with 3.69 ERA (58 ER, 141.1 IP) and 131 strikeouts.Made his NPB debut May 29 vs. Nippon Ham...went 4-2 with a 4.53 ERA (22 ER, 43.2 IP) in 9 appearances (8 GS)...threw CG, 2-hit shutout Sept. 18 vs. Seibu."}, {"url": "https://www.lookoutlanding.com/2012/1/5/2685923/hisashi-iwakuma-seattle-mariners", "page_content": "As we've talked about, Japanese starter Hisashi Iwakuma first really appeared on the North American radar last offseason, when he was posted and the Oakland A's submitted a high bid of $19.1 million. The A's and Iwakuma, though, couldn't agree on a contract, and Iwakuma returned to Japan. I'd like to take you back for a moment:\n\nJapanese media had reported that Oakland made a four-year proposal worth $15.25 million. In terms of annual salary, it is equal to what Iwakuma made with the Eagles of Japan's Pacific League. \"Their offer was low and they weren't sincere,\" [agent] Nomura said.\n\nOkay, now keep that in mind. After the 2011 season, Iwakuma became a free agent. Recently, he's been linked to the Mariners, and, Jerry Crasnick, just a little while ago:\n\nFree agent Hisashi Iwakuma has agreed on one-year deal with Mariners\n\nFurther:\n\nDeal will pay Iwakuma a guaranteed $1.5M. He can earn $4.9M with awards and incentive bonuses based on starts and IP.\n\nIn December 2010, Iwakuma walked away from a reported $15.25 million over four years. In January 2012, he's signed for $1.5 million and one year, with a chance to make another $3.4 million given health and success. I'm not saying that Iwakuma probably regrets not signing with the A's, because nobody should want to sign with the A's, but he just signed for 10% the guaranteed money.\n\nOf course, there's a pretty good reason for that. The 30-year-old Iwakuma missed significant time with a shoulder injury last season. He came back from it, and he's healthy now, but his velocity dropped, so there are more questions than there used to be. Salary + questions = reduced salary.\n\nEven with the injury, and possibly because of the injury, this looks like a heck of a deal for the Mariners. The worst-case scenario is that Iwakuma goes crazy and kills all of the team's good players. The realistic worst-case scenario is that Iwakuma is bad or hurt or both, and the M's are out $1.5 million. That's not much. If Iwakuma starts hitting his incentives, which begin at 20 starts and 140 innings, he's probably pitching well, and more than earning the money. This is practically all upside.\n\nAnd because it's a one-year contract, there's no future risk. That also means that Iwakuma could go somewhere else in 2013 if he's good, but he'd probably be open to re-signing with the Mariners if that's something the Mariners want to do. They'll cross that bridge several months from now.\n\nWe've talked a lot about Iwakuma lately. I don't need to re-hash it. It's hard to say whether he'll be good or bad or okay. His stuff could work, or his stuff could not work. But it's fun to consider the Hiroki Kuroda possibility, and it's just nice to see the Mariners making a Major League move. Welcome, Hisashi Iwakuma. Be awesome.\n\nStats"}, {"url": "https://www.mlbtraderumors.com/2012/01/mariners-agree-to-sign-hisashi-iwakuma.html", "page_content": "10:57pm: Geoff Baker of The Seattle Times reports (on Twitter) that the incentives kick in at 20 starts, at which point Iwakuma will be paid a $200K bonus. He will make $250K for 22 starts, $300K for 25 starts, and $400K for 30 starts. The innings bonuses kick in at 140 IP, and he can earn another $400K for 200 IP.\n\nIwakuma spent four days in Seattle back in December according to Baker, during which time he met GM Jack Zduriencik and was shown around town. He didn't speak to Ichiro Suzuki before signing, says Baker (on Twitter).\n\n7:35pm: The Mariners have agreed to sign right-hander Hisashi Iwakuma to a one-year contract worth $1.5MM, reports ESPN's Jerry Crasnick (all Twitter links). The deal includes $3.4MM in incentives based on starts and innings pitched. We heard the two sides were closing in on a deal earlier this week. Iwakuma is a Sosnick-Cobbe client.\n\nThe Rakuten Golden Eagles posted the 30-year-old righty a year ago and the A's won the rights to negotiate with him for $19.1MM. However, the sides didn't work out a deal and Iwakuma re-signed with Rakuten. He posted a 2.42 ERA with 6.8 K/9 and 1.4 BB/9 in 119 innings in 2011 and became a true free agent after the season. He figures to join Felix Hernandez, Jason Vargas, and Michael Pineda in Seattle's rotation with Blake Beavan and Charlie Furbush as candidates for the fifth spot."}, {"url": "https://www.mlb.com/news/hisashi-iwakuma-signs-with-mariners-c262446820", "page_content": "Iwakuma wrote on his Instagram account that the Mariners offered him a contract early in his rehab process and he was grateful for the team's help in his recovery and the opportunity to return.\n\n\"I signed a Minor League deal until I recover well, but I will definitely come back and contribute to win for the Mariners,\" Iwakuma wrote. \"Me and my family love [the] Mariners and the city of Seattle, so we're happy to stay here!\"\n\nIn six seasons with Seattle, Iwakuma has a 63-39 record and 3.42 ERA in 150 games, including 136 starts. He was an American League All-Star in 2013, threw a no-hitter in '15 and was voted the Mariners' Pitcher of the Year by the Seattle chapter of the Baseball Writers' Association of America in '13 and '16.\n\nSince joining the Mariners in 2012, Iwakuma ranks fifth among qualified pitchers in the AL in fewest walks per nine innings (1.88), sixth in winning percentage (.618), eighth in ERA (3.42) and strikeout-to-walk ratio (3.86) and ninth in wins (63).\n\nIwakuma is seventh on the Mariners' all-time list in wins, eighth in strikeouts and quality starts and 12th in starts and innings pitched.\n\nThe Mariners are expected to add further pitching this winter, so there's not a lot of pressure on Iwakuma to return by the start of the season. The club already has veterans James Paxton, Felix Hernandez, Mike Leake, Erasmo Ramirez and Ariel Miranda returning, as well as young rotation contenders Andrew Moore and Marco Gonzales."}, {"url": "https://english.kyodonews.net/news/2021/01/025d5014b7bb-baseball-iwakuma-joins-mariners-as-special-assignment-coach.html", "page_content": "KYODO NEWS - Jan 13, 2021 - 13:30 | Sports, All\n\nThe Seattle Mariners announced Tuesday their former pitcher Hisashi Iwakuma has rejoined the organization as a special assignment coach reporting directly to general manager Jerry Dipoto.\n\nHe will begin his new role, which will include scouting talent from Japan, during spring training, which is expected to open in mid-February.\n\n\"Kuma has demonstrated throughout his career skills that we think will make him a perfect fit working with our coaches and players,\" Dipoto said in a press release.\n\n\"He was always prepared, has a terrific work ethic, and the ability to communicate the things that made him a successful pitcher. We're looking forward to adding him to our mix at both the major and minor league level.\"\n\nThe 39-year-old Japanese spent six seasons with the Mariners from 2012 to 2017 compiling an impressive 63-39 record with a 3.42 ERA in 150 games.\n\nIn 2015 he became the second Japanese-born pitcher after Hideo Nomo to throw a major league no-hitter.\n\nIwakuma returned to Nippon Professional Baseball in 2019 but never fully recovered from shoulder surgery he underwent in 2017 and retired after two seasons with the Tokyo-based Yomiuri Giants. He never pitched for the Giants' top team."}, {"url": "https://www.japantimes.co.jp/sports/2019/02/27/baseball/japanese-baseball/hisashi-iwakuma-throws-practice-first-time-since-returning-japan-giants/", "page_content": "Former major league pitcher Hisashi Iwakuma on Wednesday threw for the first time in practice since making his return to Japanese baseball with the Yomiuri Giants.\n\nThe 37-year-old right-hander tossed 45 pitches, testing out a variety of balls at the Giants’ preseason camp in Okinawa.\n\n“Right now, I’m just working out how much I can throw. I think it felt alright,” he said."}, {"url": "https://www.espn.com/mlb/story/_/id/7430017/seattle-mariners-sign-hisashi-iwakuma-one-year-deal", "page_content": "The Seattle Mariners have signed free agent pitcher Hisashi Iwakuma to a one-year contract.\n\nIwakuma's agent, Paul Cobbe, told ESPN.com the deal is worth $1.5 million guaranteed, but the total value could increase to $4.9 million if Iwakuma reaches designated award bonuses and incentives based on starts and innings pitched.\n\nIwakuma, a 30-year-old right-hander, was a long-time star for the Tohoku Rakuten Golden Eagles in Japan. He slots into a Seattle rotation that's led by former Cy Young Award winner Felix Hernandez and also includes Michael Pineda and Jason Vargas.\n\nIwakuma attracted interest from seven or eight major league teams and received offers from five clubs -- with Oakland, Baltimore and Minnesota among his most active suitors. Cobbe said the pitcher received more than one multiyear offer and could have earned more money with other teams, but chose Seattle after developing a comfort level with the organization and the city during a visit in December.\n\nCobbe said Seattle general manager Jack Zduriencik and the team \"rolled out the red carpet\" for Iwakuma and showed him \"a lot of respect\" during his visit.\n\n\"This was Iwakuma's first time in the U.S., and he found the city of Seattle and the people there were a really strong fit for him and his family,\" Cobbe said.\n\nIwakuma joins 10-time All-Star and former American League MVP Ichiro Suzuki to give Seattle an added Japanese presence. Japanese infielder Munenori Kawasaki also says he's been invited to spring training by the Mariners.\n\nIwakuma, who played in the 2004 Summer Olympics in Athens and the 2009 World Baseball Classic, went 21-4 with a 1.87 ERA in 2008 and won the Eiji Sawamura Award, the Japanese equivalent of the Cy Young. But Iwakuma missed time with a shoulder injury this season and was 6-7 with a 2.42 ERA in 17 starts. After entering the free-agent market, Iwakuma decided to sign a one-year deal to re-establish his value in anticipation of 2013.\n\nThe Oakland Athletics paid a reported $19.1 million for the right to negotiate with Iwakuma last winter. But talks between the A's and Iwakuma's former agent, Don Nomura, broke down with no resolution, and the pitcher returned to Japan after the 30-day negotiating window expired.\n\nSince Iwakuma had reached 10 years of service time this winter, he wasn't subject to a posting fee like Nippon Ham Fighters pitcher Yu Darvish. The Texas Rangers recently bid more than $50 million for the negotiating rights to Darvish, and are working to sign him by Jan. 18. If the deadline passes with no agreement, the Rangers will get a refund and Darvish will return to Japan to pitch in 2012.\n\nJerry Crasnick is a senior writer for ESPN.com. Information from The Associated Press contributed to this report."}], "Hisashi Iwakuma made his MLB debut in August 2012.": [{"url": "https://www.baseball-reference.com/players/i/iwakuhi01.shtml", "page_content": "Frequently Asked Questions\n\nHow old is Hisashi Iwakuma?\n\nHisashi Iwakuma is 42 years old.\n\nWhen was Hisashi Iwakuma born?\n\nHisashi Iwakuma was born on April 12, 1981.\n\nWhere was Hisashi Iwakuma born?\n\nHisashi Iwakuma was born in Higashi Yamato, Tokyo.\n\nHow tall is Hisashi Iwakuma?\n\nHisashi Iwakuma is 6-3 (190 cm) tall.\n\nHow much did Hisashi Iwakuma weigh when playing?\n\nHisashi Iwakuma weighed 210 lbs (95 kg) when playing.\n\nHow many seasons did Hisashi Iwakuma play?\n\nHisashi Iwakuma played 6 seasons.\n\nIs Hisashi Iwakuma in the Hall of Fame?\n\nHisashi Iwakuma has not been elected into the Hall of Fame.\n\nWhat position did Hisashi Iwakuma play?\n\nHisashi Iwakuma was a Pitcher.\n\nHow many strikeouts did Hisashi Iwakuma have?\n\nHisashi Iwakuma had 714 strikeouts over his career.\n\nHow many teams has Hisashi Iwakuma played for?\n\nHisashi Iwakuma played for 1 team, the Seattle Mariners.\n\nHow many World Series has Hisashi Iwakuma won?\n\nHisashi Iwakuma has never won a World Series.\n\nWhen did Hisashi Iwakuma retire?\n\nHisashi Iwakuma last played in 2017.\n\nWhat are Hisashi Iwakuma's nicknames?\n\nKuma is a nickname for Hisashi Iwakuma."}, {"url": "https://www.mlb.com/player/hisashi-iwakuma-547874", "page_content": "2017\n\nHisashi Iwakuma…he and his wife, Madoka, have the three kids, daughter Uta, son Towa and daughter Rima…attended Horikoshi High School…played in 2004 Athens Olympics and 2009 World Baseball Classic…originally selected by Osaka Kintetsu in fifth round of the 1999 NPB amateur draft…nicknamed \"Kuma,\" which is Japanese for \"Bear.\"\n\nWas 0-2 with a 4.35 ERA (15 ER, 31.0 IP) with 16 strikeouts in 6 starts with Seattle… underwent arthroscopic right shoulder debridement surgery on September 27…surgery was performed by Dr. Keith Meister in Dallas, Texas…on 10-day DL May 10 (retro to May 7) with inflammation in right shoulder before being transferred to 60-day DL on July 24… sent on rehab assignment on June 14 and made two starts with High-A Modesto, going 0-1 with a 6.00 ERA (4 ER, 6.0 IP) before recall (but not activation) from rehab on June 22.\n\n2016\n\nThe Totals - Was 16-12 with a 4.12 ERA (91 ER, 199.0 IP) with 147 strikeouts and 46 walks in 33 starts...Team Leader - Led the Mariners in wins (16), starts (33), innings (199.0) and strikeouts (147)... Leaderboard - Among American League leaders, ranked T6th in wins (16), T4th in starts (33), 11th in innings (199.0 IP)... Just Win - Earned a career high 16 wins (previous: 15, 2014)…became the 7th Mariners pitcher to record at least 2 seasons with 15 or more wins, joining Jamie Moyer (4x), Freddy Garcia (3x), Felix Hernandez (3x), Randy Johnson (3x), Marc Langston (3x) and Aaron Sele (2x)... Eating Innings - Tossed 199.0 innings, the 2nd-most in his MLB career (219.2 IP in 2013)... Honors - Named Mariners Pitcher of the Year by the Seattle chapter of BBWAA…the 2nd such honor in his career (also: 2013)...Quite the Finish - Was 15-8 with a 4.03 ERA (67 ER, 149.2 IP) with 109 strikeouts in his final 25 starts of the season... Winner - His 15 wins from May 20 through the end of the season were T4th-most in MLB, trailing Cleveland's Corey Kluber (16), Boston's Rick Porcello (16) and Washington's Max Scherzer (16) and tied with Toronto's J.A. Happ and Chicago-NL's Jon Lester... Japanese Leaderboard - Recorded a career-high 16 wins, T2nd-most in a single season by a Japanese-born pitcher, trailing only 18 wins by Daisuke Matsuzaka-BOS in 2008… joins Yu Darvish-TEX (16 in 2012), Hiroki Kuroda-NYY (16 in 2012) and Hideo Nomo-LAD (16 in 1996, 2002 & 2003) as the only Japanese-born pitchers to record 16 wins in a season...Streaker - Posted a 5-game winning streak, June 28-July 23...marked the second time in his career that he has won five straight starts (also: Aug. 8-Sept 5, 2014)…won a career best 7 straight starts Aug. 16, 2013-May 20, 2014... Rotation Rock - Was the only member of the Mariners Opening Day rotation to make every scheduled start...Eight was Great - Won 8 straight home starts, May 25-Aug.8…went 8-0 with 2.62 ERA (16 ER, 55.0 IP) in those 8 starts...only 2 Mariners pitchers (4x) have won more than 8 straight home starts (R. Johnson, 16 & 11; J. Moyer, 10, 2x)...Paul Abbott also won 8 straight... Cloud Nine - Won 9 games in the first half, a career-high for wins before the All-Star Break (8 in 2013 & 2014)...He's Got Backup - Had a 5.43 run support average, 10th-highest in the American League (120 runs in 199.0 innings).\n\n2015\n\nThe Totals - Was 9-5 with a 3.54 ERA (51 ER, 129.2 IP) with 111 strikeouts in 20 starts. ... Strong Finish - Was 4-2 with a 2.17 ERA (11 ER, 45.2 IP) with 43 strikeouts in last 7 starts of season…was 5-3 with 4.29 ERA (40 ER, 84.0 IP) with 68 strikeouts in first 13 starts, including 0-1 with 6.61 ERA (12 ER, 16.1 IP) in first 3 starts before going on DL. ... Winning Ways - Seattle won 11 of his final 16 starts after losing first four to start season. ... No-No - Threw the 5th no-hitter in Mariners history (4th by a single pitcher) on Aug. 12 vs. Baltimore…was his first MLB complete game…2nd Japanese-born pitcher with an MLB no-hitter (Hideo Nomo, 2x)…4th no-no in MLB in 2015…first no-hitter in American League since Felix Hernandez (Aug. 15, 2012 vs. TB)…according to ESPN Stats & Info, threw his lowest percentage of pitches in strike zone in his career (41 percent, 11 percentage points below his season average entering the day), still throwing 77 of 116 pitches for strikes. ... Player of the Week - Named American League Player of the Week for Aug. 10-16 after tossing no-hitter in his start vs. Baltimore…was his first career Player of the Week honor, and the first by a Mariners pitcher since Felix Hernandez (June 9, 2014). ... Tough No-Decision - Allowed a solo HR (Dozier) w/1 out in the 9th Oct. 2 at MIN, the 1st earned run he'd allowed in his career vs. the Twins, snapping a string of 41 2/3 innings… per STATS Inc., the longest streak to begin career vs. any team since 1974 (as far back as their records go); previous record was 40.0 IP, Troy Percival vs. MIN (5/16/95-8/27/04)…in six career starts vs. the Twins, Iwakuma is 5-0 with a 0.21 ERA (1 ER / 42.1 IP). ... Limiting Damage - Allowed two runs or less in 11 of 20 starts, three or less in 14. ... Road Warrior - Was 5-1 with a 2.56 ERA (17 ER, 59.2 IP) with 51 strikeouts • 500 - Recorded 500th career strikeout by fanning Mitch Moreland in 2nd inning of his win at Texas on Aug. 18…hit milestone while walking 118 batters…according to STATS LLC, T6th-fewest walks before recording 500th strikeout since 1914 (LAD's Kenley Jansen leads with 104 BB/500K)…had 1,175 strikeouts over 11 years in Japan before MLB career. ... Rehab Assignment - In 3 rehab starts with Everett & Tacoma was 1-0 with a 1.35 ERA (2 ER, 13.1 IP) with 13 strikeouts. ... Injury - Suffered right lat strain and was placed on the disabled list April 24 (retro to April 21)…on DL April 21-July 6. ... As Starter - Since making first MLB start July 2, 2012 has gone 46-24 with 3.09 ERA (214 ER, 623.1 IP) in 97 starts… among pitchers with 50+ starts during this stretch, ERA is 10th-best in the Majors\n\n2014\n\nWent 15-9, 3.52ERA (70 ER, 179.0 IP) with 154strikeouts in 28 starts (17 quality starts)... Recorded single-season career-high in wins with15, going 15-9 in 28 starts... Ranked 4th in the AL witha 1.050 WHIP, fourth-best in clubhistory (holds 2nd-best mark with 1.006 in 2013)... Walked only 21 batters in 28 starts…ranked second in MLB with 1.06 BB/9.0IP (P. Hughes, MIN - 0.69) and 3rd with 7.33 strikeout-to-walk ratio…recorded 14 starts without issuing a walk, 2nd-best in MLB (Hughes - 19)... Went 8-6 with a 3.02 ERA (34 ER, 101.1 IP) in 15 starts at Safeco Field…owns a career 2.82 ERA in 49 G/42 GS at Safeco Field... Career-high 8.2 innings July 12 vs. Oakland…held the A's scoreless until a 2-out, 2-run home run by Brandon Moss in the top of the ninth... Recorded pair of 10-plus strikeout games, July 7 vs. Minnesota (10) and Aug. 19 at Philadelphia (11)…has 4 career 10+ strikeout games... Allowed 70 runs, all earned, in 28 starts; 2nd-most runs allowed in a seasonin club history without allowing an UER (Pineiro, 118 in 2005)... Recorded season-high 20.0 consecutive scoreless innings July 1-12…three separate scoreless streaks of at least 20.0 innings in his MLB career: July1-12, 2014 (20.0 IP), Sept. 13, 2013-May 3, 2014 (25.0 IP) and May 26-June 10, 2013(23.2 IP)…became the ﬁrst pitcher since Joe Nathan in 2004-05 to have three 20.0+scoreless innings streaks over a two-season span (ﬁrst in Mariners history),and the ﬁrst starter since Dwight Goodenin 1984-85 (4 steaks of 20.0+ scorelessinnings)... Did not allow a stolen base during the season, with attempted basestealers going 0-for-8... Became the fifth Japanese-born pitcher with 15 wins in a season: Hideo Nomo (3x), Daisuke Matsuzaka (2x), Yu Darvish, Hiroki Kuroda... Set a clubrecord for consecutive scoreless inningsat 27.0, ending after 2.0 innings in hisseason debut May 3 at Houston… streakdated back to Aug. 21, 2013...previousrecord was 25.0 innings, shared by Brian Holman (6/27-7/19/84) and Randy Johnson (5/25-6/15/94)... Posted a 7-3 road record(4.17 ERA)…loss Aug. 3 at Baltimore was ﬁrst road loss since July 4, 2013 at Texas... Opened the season on the disabled list witha strained tendon in his right middle ﬁnger…made one rehab start with Triple-A Tacoma... Passed 2,000 innings for his career (including Japan) in his start July 29 at Cleveland…has 2,065.0 combined career innings... Participated in the MLBJapan All-Star Series in his native country ofJapan, making one start... Since making his ﬁrst MLB start July 2, 2012 has gone 37-19 with a 2.97 ERA(163 ER, 493.2 IP) in 77 starts…among pitchers with at least 50 starts during this stretch, ERA is ninth-best in the Majors.\n\n2013\n\nFinished his second Major League season going 14-6 with a 2.66 ERA (65 ER, 219.2 IP) in 33 starts (23 quality starts). Finished 3rd in the AL Cy Young voting with 73.0 votes. Ranked 3rd in the American League with a 2.66 ERA. Selected to his first All-Star Game, but did not pitch due to starting the final game before the All-Star break. Named Mariners Pitcher of the Year by the Seattle chapter of the Baseball Writers Association of America. Finalist for the Male Athlete of the Year for 2013 in the 79th Seattle Star of the Year. Among AL leaders ranked 3rd in innings pitched (219.2), 3rd in opponent batting average (.220), T4th in quality starts (23), T4th in games started (33), 5th in opponent OPS (.630) and 12th in strikeouts (185). Led the Majors and set a Mariners record with 10 starts in which he pitched at least 6.0 innings and did not allow an ER (5-0, 5 no-decisions)…Felix Hernandez recorded 9 starts of 6.0 or more IP, 0 ER in 2009. Ranked 2nd in the AL and set a Mariners single-season record with a 1.006 WHIP. Went 4-0 with a 1.62 ERA (10 ER, 55.2 IP) over his final 8 starts of the season (8/16-9/25) to lower ERA from 3.02 to 2.66. Went 2-0 with a 0.76 ERA (3 ER, 35.2 IP) in 5 starts in September…2nd-lowest ERA in a month in club history (min. 4 GS), trailing only the 0.50 mark by Mark Langston in September 1988 (3 ER, 53.2 IP, 6 GS). Pitched in a career-high 219.2 innings, besting his Japanese career high of 201.2 IP during his Pacific League MVP season in 2008…IP total was T3rd-most by a Japanese-born pitcher trailing only Hideo Nomo (228.1 in 1996, 220.1 in 2002). Ended the season with a streak of 23.0 consecutive scoreless innings, including 8.0 scoreless innings in his season finale Sept. 25 vs. KC. Recorded a career-high 23.2 scoreless innings streak May 26-June 10 (8th-longest in club history)…did not allow an ER in 31.2 consecutive innings (5/26-6/17), the 2nd-longest streak in club history (34.0 IP, Mark Langston, 1988). Was the only MLB pitcher with two scoreless streaks of at least 20.0 innings during the season…joins Freddy Garcia (2001) as the only pitcher in club history with a pair of scoreless innings streaks of at least 20.0 IP in a single season. Recorded 25.0 consecutive scoreless innings on the road to end the season, tied for the longest streak in club history (8/21-9/18)…Brian Holman (6/27-7/19/89) and Randy Johnson (5/25-6/15/94) also had road scoreless streaks of 25.0 innings…recorded the 3rd-lowest road ERA in club history at 2.45, trailing Felix Hernandez (1.99 in '09) & Randy Johnson (2.45 in '95). Recorded 10 starts without walking a batter, T2nd-most in the AL (Colon, OAK - 12, Price, TB - 10) and T2nd-most in club history (Moyer - 11 in 2002)…ranked 3rd in AL with 1.72 BB/9.0 IP and 4th with 4.40 strikeout-to-walk ratio. Matched career high (6 times) with 8.0 innings pitched…was only 2-0 with 4 no-decisions (1.69 ERA) when pitching 8.0 innings. Opened the season going 7-1, 1.79 ERA in his first 14 starts of the season (ranked 2nd in the AL in ERA following 6/10 start vs. HOU). Held opponents to a .184 average with runners in scoring position (26x141) and .111 with RISP/2 outs (7x63). Since making his first MLB start on July 2, 2012, combined\n\n2012\n\n2011\n\n2010\n\n2009\n\n2008\n\n2007\n\n2006\n\n2005\n\n2004\n\n2003\n\n2002\n\n2001\n\nIn 16 starts went 8-4 with a 2.65 ERA (28 ER, 95.0 IP) to rank first in club history in starter ERA by a rookie (2nd, Felix Hernandez, 2.67 in 2005)...in 14 relief appearances posted a 1-1 record with 2 saves and a 4.75 ERA (16 ER, 30.1 IP)... overall ranked 2nd on team with 3.16 ERA (min. 100.0 IP) ... Finished the season going 6-2, 1.83 ERA (11 ER, 54.0 IP) with 43 strikeouts over his last 9 starts...posted the 2nd-best ERA amongst AL starters during the 9-start stretch (8/17-end of season, min. 5 GS) ... Went 4-0 with a 1.23 ERA (4 ER, 29.1 IP) with 22 strikeouts in 5 G/4 GS vs. the Angels (4-0, 1.37 in 4 GS)...became just the third pitcher in club history to record 4 wins vs. the Angels in a season: Freddy Garcia (5-0, 0.96 in '01) & Jamie Moyer (4-2, 1.67 in '03) ... Mariners won 8 of the last 10 Iwakuma starts, and went 10-6 in his starts overall ... Amongst AL pitchers with at least 100.0 IP, ranked 7th with a 3.16 ERA (44 ER, 125.1 IP)... ranked 3rd amongst AL starters (min. 15 GS) with a 2.65 ERA (28 ER, 95.0 IP) in 16 starts ... Posted the 5th-lowest ERA by an AL starting pitcher since 1988 at 2.65 (min. 15 GS)...the last rookies to have a lower starter ERA were Minnesota's Francisco Liriano (1.92) and the Angels Jered Weaver (2.56) in 2006 ... Set Mariners rookie record with 13 strikeouts in first MLB win as a starter July 30 vs. Toronto (8.0,4,1,1,3,13,HR)...old record was 12 by Freddy Garcia (1999), Randy Johnson (1989) and Mark Langston (3x, 1984)...most strikeouts by a MLB rookie since Stephen Strasburg (14) in 2010...only Japanese born pitcher with as many strikeouts in a MLB game is Hideo Nomo (7 G w/13+ strikeouts) ... Made first start July 2 vs. Baltimore (5.0,3,3,3,3,4,HR)...joined Ichiro (RF) and Munenori Kawasaki (2B) as first Japanese trio in a starting lineup...became 2nd Japanese born pitcher in club history to start on the mound, first since Mac Suzuki in 1999 ... Made 6 relief appearances of at least 3.0 innings (3.05 ERA in those games) ... Notched first MLB win with 2.0 shutout innings June 16 vs. San Francisco ... Recorded first MLB loss June 27 vs. Oakland, allowing only a solo HR in 3.2 IP (1 H, 3 SO)...replaced injured starter Kevin Millwood in 3rd inning ... Earned save in consecutive appearances May 30 at Texas (3.0 IP, 5 H, 3 R) and June 2 at Chicago-AL (1.0 IP, BB, K) ... Made Mariners debut April 20 vs. Chicago (AL)...was the last MLB player on Opening Day roster to appear in a game ... Signed a contract extension through 2014 with an option for 2015 on Nov. 2.Made 17 starts for Rakuten, going 6-7 with a 2.42 ERA (32 ER, 119.0 IP)...averaged 7.0 innings and 99.8 pitches per start...on the disabled list from May 18-July 26 with a sore right shoulder...was 3-2 with a 1.72 ERA at the time of his injury...struck out seasonhigh 13 batters in CG shutout April 26 at Seibu.Posted second season of 200-plus innings of his career...went 10-9, 2.82 with 4 CG and 153 strikeouts in 28 starts...awarded to Oakland via the posting system, but could not reach agreement during 30-day negotiating period.Named Rakuten's Opening Day starter for third consecutive season...part of gold medal winning Japan squad in the World Baseball Classic...went 1-1 with 1.35 ERA (3 ER, 20.0 IP) in 4 G/3 GS in WBC play.Named the Pacific League MVP going 21-4, 1.87 ERA in 28 starts...also named a NPB All-Star, Best Nine Award and the Eiji Sawamura Award winner (Cy Young equivalent)... became the first 20-game winner in the Pacific League since Kazumi Saito in 2003...led the league in ERA and winning percentage...allowed just 3 home runs in 201.2 innings.Named Rakuten's Opening Day starter...sidelined with back soreness and a left oblique strain...returned to full strength following the All-Star break...finished the season 5-5, 3.40 in 16 starts...underwent arthroscopic surgery on his right elbow in October.Limited by lingering shoulder soreness, made only 6 starts...made season debut Aug. 29 vs. Nippon Ham...went 1-2 with a 3.73 ERA (16 ER, 38.2 IP).Went 9-15 with 4.99 ERA (101 ER, 182.1 IP) while making 27 starts.Opened the season going 12-0, setting a club record for consecutive wins to open a season...starting pitcher in the NPB All-Star Game...led the league in both wins and winning percentage (.882)...pitched in Game 5 of the NPB-MLB Post-Season All-Star Series...earned Best Nine Award...pitched in the 2004 Athens Olympics as a member of the Japanese national team (bronze medal).Led the league with 11 complete games...went 15-10, 3.45 with 149 strikeouts in 27 starts...named NPB All-Star.Made 23 starts, going 8-7 with 3.69 ERA (58 ER, 141.1 IP) and 131 strikeouts.Made his NPB debut May 29 vs. Nippon Ham...went 4-2 with a 4.53 ERA (22 ER, 43.2 IP) in 9 appearances (8 GS)...threw CG, 2-hit shutout Sept. 18 vs. Seibu."}, {"url": "https://www.milb.com/player/hisashi-iwakuma-547874", "page_content": "March 16, 2019 RHP Hisashi Iwakuma assigned to Yomiuri Giants.\n\nNovember 2, 2018 RHP Hisashi Iwakuma elected free agency.\n\nSeptember 20, 2018 Tacoma Rainiers activated RHP Hisashi Iwakuma from the 7-day disabled list.\n\nAugust 25, 2018 Tacoma Rainiers sent RHP Hisashi Iwakuma on a rehab assignment to Everett AquaSox.\n\nApril 5, 2018 RHP Hisashi Iwakuma assigned to Tacoma Rainiers.\n\nNovember 27, 2017 Seattle Mariners signed free agent RHP Hisashi Iwakuma to a minor league contract and invited him to spring training.\n\nNovember 2, 2017 RHP Hisashi Iwakuma elected free agency.\n\nJuly 24, 2017 Seattle Mariners transferred RHP Hisashi Iwakuma from the 10-day disabled list to the 60-day disabled list. Inflammation in right shoulder.\n\nJune 19, 2017 Seattle Mariners sent RHP Hisashi Iwakuma on a rehab assignment to Tacoma Rainiers.\n\nJune 14, 2017 Seattle Mariners sent RHP Hisashi Iwakuma on a rehab assignment to Modesto Nuts.\n\nMay 10, 2017 Seattle Mariners placed RHP Hisashi Iwakuma on the 10-day disabled list retroactive to May 7, 2017. Inflammation in right shoulder.\n\nDecember 21, 2015 Seattle Mariners activated RHP Hisashi Iwakuma.\n\nDecember 18, 2015 Seattle Mariners signed free agent RHP Hisashi Iwakuma.\n\nNovember 2, 2015 RHP Hisashi Iwakuma elected free agency.\n\nJuly 6, 2015 Seattle Mariners activated RHP Hisashi Iwakuma from the 15-day disabled list.\n\nJune 25, 2015 Seattle Mariners sent RHP Hisashi Iwakuma on a rehab assignment to Tacoma Rainiers.\n\nJune 20, 2015 Seattle Mariners sent RHP Hisashi Iwakuma on a rehab assignment to Everett AquaSox.\n\nApril 24, 2015 Seattle Mariners placed RHP Hisashi Iwakuma on the 15-day disabled list retroactive to April 21, 2014. Right Lat Strain\n\nMay 3, 2014 Seattle Mariners activated RHP Hisashi Iwakuma from the 15-day disabled list.\n\nApril 27, 2014 Seattle Mariners sent RHP Hisashi Iwakuma on a rehab assignment to Tacoma Rainiers.\n\nApril 21, 2014 Seattle Mariners activated RHP Hisashi Iwakuma from the 15-day disabled list.\n\nMarch 29, 2014 Seattle Mariners placed RHP Hisashi Iwakuma on the 15-day disabled list retroactive to March 21, 2014. torn extensor tendon in right middle finger\n\nMarch 27, 2012 Hisashi Iwakuma roster status changed by Seattle Mariners."}, {"url": "https://www.espn.com/mlb/story/_/id/6824062/xxxxx", "page_content": "Hisashi Iwakuma, one of the top starting pitchers in Japan, has hired a new agent as a prelude to coming to Major League Baseball as a free agent in 2012.\n\nIwakuma, a star right-hander for the Tohoku Rakuten Golden Eagles, is expected to rank among the elite starters in a free-agent market that could include CC Sabathia, C.J. Wilson, Mark Buehrle, Japanese countryman Hiroki Kuroda of the Los Angeles Dodgers and Yu Darvish of Japan's Nippon Ham Fighters. Sabathia can become a free agent if he exercises an opt-out clause in his seven-year, $161 million contract with the New York Yankees this winter.\n\nIwakuma hired Paul Cobbe of Sosnick-Cobbe Sports as his new representative several months ago, but delayed the announcement out of respect for his community and the victims of the March earthquake and tsunami in Sendai, Japan, home of the Eagles. He had also been occupied until recently with rehabilitation from a shoulder injury that sent him to the disabled list in late May. Iwakuma recently rejoined Rakuten and his fastball was clocked at between 89 and 92 miles per hour in his last start.\n\nAlthough Iwakuma's decision will reverberate throughout Japan, Cobbe said the pitcher does not plan to address his professional future during the Golden Eagles' season.\n\n\"Iwakuma-san has instructed me not to discuss Major League Baseball with him during the 2011 season,\" Cobbe said. \"His sole focus is bringing a championship to Rakuten.\"\n\nIwakuma, 30, played in the 2004 Summer Olympics in Athens and the 2009 World Baseball Classic. In 2008 he won the Eiji Sawamura Award, the Japanese equivalent of the Cy Young Award.\n\nThe Oakland Athletics paid a reported $19.1 million posting fee to negotiate with Iwakuma last winter. But talks between the A's and Iwakuma's former agent, Don Nomura, broke down with no resolution, and the pitcher elected to return to Japan after the 30-day negotiating window expired. In early December, Nomura told reporters that the A's were insincere and \"never showed any respect\" to his client during the discussions.\n\nSince Iwakuma is currently in his 10th professional season in Japan, he will not be subject to a \"posting fee\" as a prelude to negotiations with a major league club. There are estimates that an MLB team will have to pay a posting fee in the $25 million-to-$50 million range to win the right to negotiate with Darvish this winter.\n\nSenior writer Jerry Crasnick covers Major League Baseball for ESPN.com."}, {"url": "https://www.japantimes.co.jp/sports/2019/02/27/baseball/japanese-baseball/hisashi-iwakuma-throws-practice-first-time-since-returning-japan-giants/", "page_content": "Former major league pitcher Hisashi Iwakuma on Wednesday threw for the first time in practice since making his return to Japanese baseball with the Yomiuri Giants.\n\nThe 37-year-old right-hander tossed 45 pitches, testing out a variety of balls at the Giants’ preseason camp in Okinawa.\n\n“Right now, I’m just working out how much I can throw. I think it felt alright,” he said."}, {"url": "https://www.baseball-reference.com/bullpen/Hisashi_Iwakuma", "page_content": "Hisashi Iwakuma (岩隈 久志)\n\nBats Right, Throws Right\n\nRight, Right Height 6' 3\", Weight 210 lb.\n\n6' 3\", 210 lb. High School Horikoshi High School\n\nBR page\n\nBiographical Information [ edit ]\n\nHisashi Iwakuma has won the Sawamura Award and starred on the international stage and in the US. He is the son-in-law of Koju Hirohashi.\n\nIwakuma was the 5th-round pick of the Kintetsu Buffaloes in the 2000 NPB draft. Spending most of his rookie year in the minors, he joined the team's rotation in '02, going 8-7 with a 3.69 ERA. In 2003 Iwakuma established himself as Kintetsu's ace, going 15-10 with a 3.45 ERA. He was sixth in the Pacific League in ERA and fourth in wins despite playing on a fifth-place team. Iwakuma did even better in '04, with a 15-2, 3.01 season. He led the PL in wins, was second to Daisuke Matsuzaka in ERA and didn't suffer a defeat till after the All-Star Game (starting off the year 12-0). The rest of the Kintetsu staff went 46-68 during the year.\n\nIwakuma received even more fame after the 2004 season. When the Buffaloes announced a merger with the Orix Blue Wave, Kintetsu's ace said he would not play for the new team. The merged Orix Buffaloes selected him in a draft of the former Buffalo and Blue Wave players, but Iwakuma continued his refusals. The usually-docile players' union threw their weight behind Iwakuma and the Buffaloes relented, letting Iwakuma go to the expansion Rakuten Golden Eagles instead.\n\nIwakuma's first season with Rakuten paled statistically in comparison with his last Kintetsu season. He was clearly the ace of the new squad though - his 4.99 ERA was the best by a starter and his 9-15 record gave him more wins than the next two pitchers combined. He also threw half of the team's 18 complete games. Hisashi did not pitch much in 2006, going 1-2 with a 3.72 ERA in six games. Shoulder injuries and new rules about pitch deliveries limited his effectiveness and playing time.\n\nIwakuma went 5-5 with a 3.40 ERA in 2007. After his three ineffective seasons from 2005-2007, Iwakuma turned things around in a big way in 2008. He went 21-4 with a 1.87 ERA. He edged Yu Darvish by .01 for the PL lead in ERA, led the league in innings (201 2/3), was third with 159 strikeouts (trailing Toshiya Sugiuchi and Darvish) and tied for second with two shutouts. That earned him Pacific League MVP honors. He became just the third MVP in Nippon Pro Baseball history from a 5th-place team, following Hiromitsu Ochiai (1982) and Hiromitsu Kadota (1988. Iwakuma also won the Sawamura Award as the best pitcher in Japan. No one had won 21 games in a NPB season since Yoshinori Sato in 1985.\n\nIwakuma pitched for the Japanese national team in the 2009 World Baseball Classic. He went 1-1 with a 1.35 ERA, allowing only 12 hits in 20 innings while striking out 15. He lost a 1-0 duel to Jung-keun Bong of South Korea, giving up a 4th-inning run on a walk to Jong-wook Lee and hits by Keun-woo Jeong and Tae-kyun Kim. He tossed a scoreless 7th inning in a win over Cuba. Iwakuma started the second game against Cuba, a make-or-break game; he tossed only 69 pitches in six shutout innings before Toshiya Sugiuchi completed the whitewash. It was the earliest Cuba had ever been eliminated from a major baseball tournament. Iwakuma then got the call from Tatsunori Hara to start the finale against South Korea. He allowed only one run in the first 7 innings (a homer by Shin-soo Choo) before giving up a second score in the 8th; he left with a 3-2 lead but Yu Darvish blew the save. Japan went on to win in the 10th. Iwakuma led the tournament in innings (20) and was second to Darvish in strikeouts. He made the All-Tournament team alongside fellow pitchers Daisuke Matsuzaka and Bong. Matsuzaka beat him out for MVP honors, but said that Iwakuma deserved them more.\n\nIwakuma fell to 13-6, 3.25 in 2009. He was 7th in the PL in ERA (between D.J. Houlton and Takayuki Kishi), tied for 5th in wins (with Kishi and Satoshi Nagai) and allowed a league-worst 179 hits. He rebounded a bit at 10-9, 2.82 in 2010, finishing 4th in ERA behind Darvish, Masaru Takeda and Masahiro Tanaka. He was 4th in innings (201), was 7th in losses, tied Chihiro Kaneko for second with 184 hits allowed (only Hideaki Wakui was worse), fanned 153 (7th-most) and had a 1.09 WHIP (4th after Darvish, Yoshihisa Naruse and Takeda).\n\nIwakuma with Seattle\n\nFollowing the 2010 season, Iwakuma's name was placed on the posting system by the Golden Eagles. The Oakland Athletics posted the highest bid to secure the right to negotiate a major league contract with him. Iwakuma turned down a 4-year, $15,250,000 offer from Oakland and opted to remain with Rakuten. He missed part of the season with a shoulder injury, being sidelined from May 18th to July 26th. He had been 3-2, 1.72 in 6 starts before the injury, and went 3-5, 2.87 after his return. He became a free agent after the season, and this time truly made the jump across the Pacific Ocean, signing with the Seattle Mariners. Surprisingly, he only agreed to a one-year contract worth $1.5 million, with potential performance bonuses of $3.4 million, much less than what he had turned down a year earlier. However, he explained that having a good relationship with a team - something he had not felt with Oakland - was more important than the money. He added that he and his family had taken an immediate liking to the city of Seattle and that he was looking forward to being a teammate of the great Ichiro Suzuki.\n\nIwakuma's time in the major leagues did not start off well. He pitched poorly during the Mariners' spring training in 2012, forcing the hand of manager Eric Wedge who announced he would not be part of the team's starting rotation to start the season. The plan was to use him in the bullpen to allow him to build back strength in his shoulder. Thus, he was on the M's special 28-man roster for their season-opening series against the Oakland Athletics in his native Japan, but in one of three spots designated as being ineligible to play during the Series, even though he made the trip across the Pacific Ocean. It took him until April 20th to make his debut, when he pitched four innings in relief of Hector Noesi and Erasmo Ramirez in a game against the Chicago White Sox. He was outstanding, only giving up a single hit during his stint; it was a solo homer by Adam Dunn, although it made little difference in the final 7-3 score in favor of the White Sox. He was the last player from all 30 teams' opening day rosters to make his season debut. He won his first game as a starter on July 30th, beating the Toronto Blue Jays, 4-1. In that game, he set a Mariners rookie record with 13 strikeouts, after surrendering a leadoff homer to Rajai Davis to start the game. He settled down nicely after that rough start, giving up no more runs in completing 8 innings, before turning the ball to Josh Kinney. He had been inserted in the starting rotation just before the All-Star break, but had had to fly back to Japan to be at the side of his ill father only a few days before. He ended the season with a record of 9-5, 3.16, in 30 games, with 16 starts, pitching 125 1/3 innings and striking out 101.\n\nIwakuma started the 2013 season as one of the best pitchers in the major leagues, placing his name among the ERA leaders from the start. He had a scoreless string of 23 2/3 innings in June, only broken by an unearned run allowed to the Houston Astros on June 10th, in a game he won, 3-2. That win improved his record to 7-1 and lowered his ERA to 1.79, trailing only Clay Buchholz's 1.71 at that point of the season. He finished the year at a very solid 14-6, 2.66 with a 1.01 WHIP and 185 K in 219 2/3 IP. He was chosen for the 2013 All-Star Game but did not play due to the Sunday starter rule; Chris Tillman replaced him. He finished among the 2013 AL leaders in ERA (3rd behind Anibal Sanchez and Bartolo Colon), wins (tied for 8th), WHIP (2nd to Max Scherzer), fewest hits per 9 IP (4th behind fellow ex-PL star Darvish, Scherzer and Justin Masterson), fewest walks per 9 (3rd behind David Price and Colon), innings (3rd behind James Shields and R.A. Dickey) and ERA+ (138, 6th, between Chris Sale and Shields). He was third in voting for the 2013 AL Cy Young Award, behind Scherzer and Darvish.\n\nPreparing for spring training in 2014, Iwakuma injured a finger while working out in southern California in January. He showed up in camp wearing a splint due to a strained tendon and had to lay off throwing for a month. The Mariners then announced that as a result, he would not be ready for the start of the season. As a result, he only made his first start on May 3rd, then had back-to-back starts of 8 innings without allowing a run in his second and third outings of the season. After a couple of games in which he was touched for 9 runs in 15 innings and suffered two losses, he bounced back with a gem on June 4th when he shut out the Atlanta Braves for seven innings, combining with two relievers for a 2-0 win. He ended the season with an excellent record of 15-9, 3.52 in 28 starts, and 154 Ks in 179 innings. He tied for 8th in the 2014 AL in wins, was 4th in WHIP (behind teammate Felix Hernandez, Sale and Garrett Richards), was second in walk rate (behind Phil Hughes) and was second in K:BB ratio (also behind Hughes).The Mariners were hoping to take a step forward in 2015 and were counting on Hisashi as one of the team's pillars, but after making only three starts in April, with a record of 0-1 and a 6.61 ERA, he went on the disabled list and was out until July 6th. he was roughed up in his first start back, allowing 5 runs in as many innings to the Detroit Tigers, increasing his ERA to 7.17, but then began pitching well after that. On August 12th, he threw a no-hitter against the Baltimore Orioles, allowing 3 walks and striking out 7, in what was the first complete game and shutout of his big league career. The Mariners won the game, 3-0, as he improved to 4-2 on the year and lowered his ERA to 3.86. He was the second Japanese-born pitcher to throw a no-hitter, after Hideo Nomo. He finished the season with a record of 9-5, 3.54 in 20 starts, logging 129 2/3 innings.\n\nIwakuma became a free agent after the 2015 season and was sought after by the Los Angeles Dodgers, who were looking to strengthen their starting rotation following the departure of co-ace Zack Greinke through free agency. The two sides came to a preliminary agreement on a three-year contract worth $45 million, but after two weeks of intense negotiations, they were unable to agree on the final details of the deal and the Mariners took advantage of the snag to scoop him up back into the fold, inking him on December 17th to a guaranteed one-year contract with two option years. So back he went to Seattle in 2016, but he started off slowly as by mid-May, he was only 1-4 with a 4.38 ERA in 8 starts. However, he won his last three starts of the month, then after going 2-2 in his first four June starts, began a tremendous streak on June 28th, when he beat the Pittsburgh Pirates, 5-2. Starting with that game, he won 7 of 8 starts, topped off with a 3-0 win over the Detroit Tigers on August 8th in which he tossed 7 shutout innings. The streak improved his record to 13-7 while lowering his ERA to 3.79. He ended the season at 16-12, 4.12.\n\nIn 2017, Iwakuma was set back by injuries and made only 6 starts, going 0-2, 4.35. He underwent major shoulder surgery in September and as a result missed all of 2018 after some setbacks while rehabbing in the minors. At 37, there was some question as to whether he would try to make a comeback. He stated that September that he would likely pursue his career back in Japan.\n\nIn 2021, he returned to the Mariners as a special assignment coach.\n\nNotable Achievements [ edit ]\n\nAL All-Star (2013)\n\n15 Wins Seasons: 2 (2014 & 2016)\n\n200 Innings Pitched Seasons: 1 (2013)\n\nFurther Reading [ edit ]\n\nGreg Johns: \"Iwakuma feels Seattle is right place for him: 'It all worked out,' righty says of Mariners reaching out to him after deal with Dodgers fell through\", mlb.com, December 18, 2015. [1]"}, {"url": "https://www.baseball-almanac.com/players/pitchinglogs.php?p=iwakuhi01&y=2012", "page_content": "Hisashi Iwakuma pitched in 30 Major League games during the 2012 regular season. The chart below is a comprehensive analysis of the games Iwakuma pitched in, specifically relating to his 2012 pitching statistics. Notes: The Date / Box field has a link to the box score from the game being described. If the Date is followed by an asterisk (*), Iwakuma started that game. Cumulative monthly totals are provided where applicable.\n\n\"Do you have a favorite quote from or about this particular Major League Baseball player that you would like to see here? If so, please send it to us , and we'll update this page immediately.\" - Baseball Almanac\n\nDid you know that Hisashi Iwakuma pitched 17 games at home, had an ERA of 2.49, pitched 76 innings, allowed 64 hits, had 21 earned runs, 23 runs, and 8 home runs, walked 26 batters (0 intentionally), threw 0 wild pitches, hit batters 0 times, and balked 0 times?\n\nOn the road, Hisashi Iwakuma pitched 13 games, had an ERA of 4.22, pitched 49.1 innings, allowed 53 hits, had 23 earned runs, 26 runs, and 9 home runs, walked 17 batters (1 intentionally), threw 0 wild pitches, hit batters 1 times, and balked 0 times.\n\nAre you a Hisashi Iwakuma fan? Visit his page for comprehensive biographical data, year-by-year hitting stats, detailed fielding stats, pitching stats (where applicable), cumulative career totals for all stats, uniform numbers worn, salary data and other factual items-of-interest."}, {"url": "https://www.mlb.com/news/hisashi-iwakuma-mariners-special-assignment-coach", "page_content": "\n\n\",\"providerName\":\"Twitter\",\"providerUrl\":\"https://twitter.com\",\"type\":\"oembed\",\"width\":550,\"contentType\":\"rich\"},{\"__typename\":\"Markdown\",\"content\":\"The Tokyo native, who pitched in Nippon Professional Baseball for 11 seasons, could be an invaluable addition in this scouting arena for a Mariners club that has consistently had one of the stronger MLB imprints in Japan. Beyond signing Iwakuma in 2012, the club successfully signed Ichiro Suzuki in ‘00 and Kikuchi in ‘19, and it was believed to be the runner-up for Shohei Ohtani in ’17.\n\n\n\nIwakuma was among Japan’s top pitchers before joining Seattle as an international free agent in 2012, having won the Pacific League MVP Award in ’08. The right-hander retired from professional baseball in October after experiencing prolonged shoulder injuries, an issue that dated back to when he first signed with Seattle ahead of his age-31 season. His final appearances as a professional came for the Yomiuri Giants in '19.\n\n\n\nBut when healthy, Iwakuma was one of the Mariners’ most effective pitchers over his six seasons in Seattle (2012-17), going 63-39 with a 3.42 ERA in 150 games, including 136 starts. The ‘13 All-Star’s career ERA is tied for the lowest in club history (min. 500 innings) with Randy Johnson, Felix Hernandez and James Paxton. He was voted the most valuable Mariners pitcher in ’13 and ’16 by the Seattle chapter of the Baseball Writers’ Association of America, and he was a finalist for the AL Cy Young Award in ’13.\n\n\n\nIwakuma is most immortalized for throwing the fifth no-hitter in club history on Aug. 12, 2015, against Baltimore, when he joined Hideo Nomo as just the second Japanese-born pitcher to throw a no-no in the Majors.\",\"type\":\"text\"}],\"contentType\":\"news\",\"subHeadline\":null,\"summary\":\"SEATTLE -- The Mariners are bringing back a familiar face, as the club announced Tuesday that it has hired former pitcher Hisashi Iwakuma as a special assignment coach. Iwakuma will report directly to general manager Jerry Dipoto.\n\nHeralded for his finesse on the mound and his tireless work ethic off\",\"tagline({\\\"formatString\\\":\\\"none\\\"})\":null,\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"storytype-article\",\"title\":\"Article\",\"type\":\"article\"},{\"__typename\":\"ContributorTag\",\"slug\":\"daniel-kramer\",\"title\":\"Daniel Kramer\",\"type\":\"contributor\"},{\"__typename\":\"TeamTag\",\"slug\":\"teamid-136\",\"title\":\"Seattle Mariners\",\"team\":{\"__ref\":\"Team:136\"},\"type\":\"team\"}],\"type\":\"story\",\"thumbnail\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/tx3uhvkdbihxsryddjcf\",\"title\":\"Hisashi Iwakuma joins Mariners as special assignment coach\"}},\"Person:547874\":{\"__typename\":\"Person\",\"id\":547874},\"Team:136\":{\"__typename\":\"Team\",\"id\":136}}} window.adobeAnalytics = {\"reportingSuiteId\":\"mlbglobal08,mlbcom08\",\"linkInternalFilters\":\"mlb\"} window.globalState = {\"tracking_title\":\"Major League Baseball\",\"lang\":\"en\"} window.appId = '' /*-->*/"}, {"url": "https://www.japantimes.co.jp/tag/hisashi-iwakuma/page/2/", "page_content": "It looks like you're using an ad blocker.\n\nTo enjoy our content, please include The Japan Times on your ad-blocker's list of approved sites.\n\nThank you for supporting our journalism."}, {"url": "https://www.mlb.com/news/hisashi-iwakuma-perfect-in-spring-debut-c166446300", "page_content": "SURPRISE, Ariz. -- Hisashi Iwakuma made his Cactus League debut on Sunday with two perfect innings in a 7-3 victory over the Rangers as the standout right-hander opened his fifth season with the Mariners in efficient fashion.\n\nThe 34-year-old Iwakuma zipped through what looked close to the Rangers' regular-season lineup, retiring the six batters he faced on 22 pitches. Iwakuma threw 16 strikes and induced four ground balls, one pop up and a fly out to center.\n\n\"It was a good game, my first game in a long time, so I wanted to get back in the groove and get a feel for every pitch,\" Iwakuma said through translator Antony Suzuki. \"I felt I was able to command every pitch on each corner, where I wanted to. So overall, I feel I passed the test. Yeah, it was good.\"\n\n• Spring:Tickets | Ballpark | 40-man roster | NRIs\n\nIwakuma, who re-signed with the Mariners after a free-agent deal with the Dodgers fell through, finds himself back in a familiar place, albeit with a new manager, pitching coach and numerous new teammates.\n\n\"We have a lot of new faces, but we're all going through the learning process,\" he said. \"I think we have a very good atmosphere, good chemistry in the clubhouse. So far, it's been great.\"\n\nIwakuma is plenty familiar with the Rangers. He's 8-3 with a 3.43 ERA in 14 regular-season meetings with Texas over the past four years. And with Seattle opening at Texas in a three-game series from April 4-6 and then hosting the Rangers at Safeco Field a week later, he'll likely line up against them for his first two starts of the season.\n\n\"I look forward to the competition,\" he said. \"Hopefully I will throw two games in the first two weeks and I look forward to it.\""}]}