{"Virginia Bottomley worked as a management consultant before entering politics.": [{"url": "https://www.theguardian.com/business/2010/jun/10/virginia-bottomley-interview", "page_content": "At a time when most people would be contemplating spending more time with the grandchildren, there are some who still relish being in the office every day to deal with problems.\n\nVirginia Bottomley – Baroness Bottomley of Nettlestone, to give her full title, is in the latter category. She's not an ardent reader — a collection of boring business books on her office shelves testifies to that. And rather than enjoying one of her three homes — Westminster, Surrey and the Isle of Wight — the former Tory cabinet minister turned City headhunter finds fulfilment in spotting the right people for the right jobs, and especially in helping more women obtain high-powered business positions.\n\nAt Odgers Berndtson, Britain's largest headhunting firm with £50m of turnover and 400 staff, Bottomley placed former City minister Paul Myners on the Marks & Spencer board, put Paul Deighton in charge of delivering London Olympics, made Barbara Stocking director of Oxfam and Richard Lambert leader of the CBI.\n\n\"Temperamentally, I am more suited for headhunting — politics is about policy, but the issue is not who's going to make it happen,\" she says in her unpretentious office overlooking Hanover Square behind Oxford Street.\n\nA photo of John Major's 1992 cabinet hangs on the wall, showing her standing next to Michael Portillo. She was health secretary for three years before taking over at national heritage for the remainder of that turbulent administration, and the ups and downs of public life taught her that the best leaders are those who get back on their feet after being wounded. And so it seems that the unpredictable nature of Westminster politics has left her with an attraction to the more complex business problems and an aversion to starry appointments.\n\n\"We don't do prima donna school of headhunting – we solve an insolvable equation,\" she says of her team, which employs 31 people. \"Some people go on the easy ride, but I like people who've been through the storm – it's the people who can stand straight.\"\n\nOdgers delivered City veteran Simon Walker to the role of chief executive of the British Private Equity and Venture Capital Association when buyout firms faced a public backlash for inflating their companies with debt, without generating enough jobs or growth. Bottomley says she knows how it feels to be in the firing line from her cabinet days, when there was the possibility that she could be sacked, or resign, almost every month.\n\nBut her favourite battle is about women — with men. Ten years ago, when she started at Odgers, chairmen of large companies told her that they \"just couldn't have a woman\" on their boards, and couldn't understand why women wanted to have a two- or three-year career break to have children. Men used the golf course for fun, but also for networking, leaving women out of the running for potential jobs.\n\nNow, after years of explaining, networking and hand-shaking, \"even men\" can understand career breaks, she says. Almost a quarter of board positions filled by Odgers' hunts are allocated to women, and no shortlist is all-male any more. One client recently offered a bonus of £30,000 if Odgers could find a woman to occupy a boardroom seat.\n\nChanging attitudes\n\nFor a start, the middle-class, middle-aged men who dominate business and politics have understood that their own children could be jeopardised by their own policies, Bottomley says. \"They know that their hugely intelligent daughters are at a disadvantage,\" she says, also speaking as someone whose daughter is a City trader.\n\nBottomley has also pressed hard to persuade directors that boards should include legal, communications and marketing experts, a move that may open the door to more women, as they more often fill high positions in those areas than in finance or sales. Retail, food, and financial service companies are also realising who most of their customers are, and the need to represent them at the top of the company, she says.\n\nBut Britain's boards are still far from representative of the population as a whole. Only 10% of directors in the country's top 100 companies are women, and 25 of the top firms have no women board members at all. \"It's still work in progress – individuals are inclined to look in the mirror, and appoint in their image, rather than look through the window and recognise the diversity of the work environment,\" Bottomley says. \"A board should be an orchestra that can play a harmonious tune, not just a group of violins.\"\n\nCompanies need to search in a wider pool of candidates. To lead by example, Bottomley boasts that she employs former bankers, journalists and even an admiral because \"if he can unite a ship, he can run a team\".\n\nStill, access to board positions is tough, since most openings are not even advertised. Instead, word of mouth and the ties of friendship are the main way into these highly paid and influential positions. Board members of large FTSE 100 companies can be paid as much as £100,000 a year to attend a few meetings and read over the company's documents. Occupying one board seat can usually lead into another one, as companies seek experience from other firms.\n\nWomen also need to stop \"selling themselves short,\" Bottomley says, adding that men are better at highlighting their strengths. As an example, Bottomley remembers when Margaret Thatcher offered her a job in environment, and she replied that she didn't know anything about the subject. \"You'll have to read up,\" the former primer minister answered.\n\nWomen's access to top positions may be improving – especially for those like Bottomley, the third generation of female graduates of the London School of Economics. She has a privileged background – family members include cousins Peter Jay, the economist and broadcaster, Liberal Democrat treasury spokesman Lord Oakeshott and brother Christopher Garnett, until recently chief executive of GNER. Bottomley, who counts the chancellorship of Hull university among her various roles, put her three children through Cambridge.\n\nWary of politicians\n\nHowever, Bottomley says that she is aware Britain is still a country divided by differences so wide that people at its extremes barely know each other. When asked how the Eton-educated David Cameron is going to change that, she argues that the prime minister has made \"a great effort\" to make his party \"look more like Britain today\".\n\nPeople should always have a chance – to fight, to stand up, to change, she says. She's all for mid-life career changes, proud of her move from politics into headhunting after reaching the age of 50. But she's wary of former politicians — perhaps a certain former prime minister — going into business, especially those \"moving into the celebrity world\". Rather than finding gate-openers, Odgers is \"here to advise on who's got the real technical skills\".\n\nAbove all that, lack of ego, integrity, desire to bring change and good references will weigh more in the final reckoning, she says – adding that she isn't fooled by self-boosting propaganda. \"I don't necessarily believe anything people say to me,\" she says.\n\nOne shouldn't. No nepotism in headhunting? Asked who she would hire to lead the Labour party now that Gordon Brown has departed, Bottomley immediately picks historian and newly elected MP Tristram Hunt – a nephew."}, {"url": "https://www.odgersberndtson.com/en-gb/people/virginia-bottomley", "page_content": "Virginia Bottomley\n\nChair, Board Practice\n\nLondon\n\nRt Hon Baroness Virginia Bottomley DL chairs the Odgers Berndtson Board Practice. She conducts searches for Chairs, CEOs and Non-Executive Directors for plcs, private companies and major public organisations. She joined Odgers Berndtson in 2000.\n\nVirginia was formerly an NED at AkzoNobel NV, BUPA, Smith & Nephew and ICC UK. She was a member of the Chugai International Council (Japan). As part of her pro-bono activities Virginia is a Trustee of The Economist Newspaper and Chancellor of the University of Hull.\n\nVirginia was a member of the House of Commons from 1984 to 2005 serving successively as Secretary of State for Health and National Heritage (now Culture, Media and Sport) in both John Major’s and Margaret Thatcher's Governments. Virginia was appointed a Life Peer in 2005.\n\nFollowing her first degree, Virginia gained an MSc in Social Administration from the London School of Economics."}, {"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/bottomley-virginia-1948", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.newstatesman.com/politics/politics-interview/2021/10/peter-bottomley-interview-the-longest-serving-mp-on-why-politicians-should-be-paid-as-much-as-doctors", "page_content": "Peter Bottomley MP, photographed in his old constituency of Eltham in South London. Photos by David Bebber for the New Statesman\n\nBeing on the road with a former roads minister makes you see the UK differently. “That’s the Rochester Way Relief Road,” says Peter Bottomley, pointing from the window of his baby blue MG hybrid to the A2 dual carriageway roaring beneath Eltham station, as if it’s the eighth wonder of the world. There is a moment of awed silence.\n\n“I got the campaign going for that. Because this had been a marginal seat, people had always feared that building a road through it might lose you 500 votes – you might lose the seat, you might lose the government, you might then leave Nato, world peace, all the rest…”\n\nNevertheless, Bottomley won this south-east London constituency – then called Woolwich West – off Labour in a 1975 by-election by 2,382 votes. It was the first by-election fought by the Tories under Margaret Thatcher (Bottomley believes if it hadn’t been for his victory, there “would’ve been a heavy movement to topple her”).\n\nHe has served as an MP ever since, winning his current coastal West Sussex seat of Worthing West in 1997, and is the longest-serving member of the House of Commons. Now 77, he inherited parliament’s most avuncular title, Father of the House, after the December 2019 general election. “There’s no pay, no merit and no responsibility” to the role, he smiles, his blue eyes twinkling.\n\nRelated\n\nDressed smartly in a pink shirt, blue and pink patterned tie, grey suit trousers and with his white hair neatly brushed back, Bottomley drives us around significant spots of his old constituency of Eltham. When we stop off to walk, he uses a walking stick adorned with a green flag bearing the yellow House of Commons portcullis.\n\nNewsletters from the New Statesman View all newsletters The best of our politics, international affairs, culture and business coverage, straight to your inbox Sign up here Select and enter your email address Morning Call A quick and essential guide to domestic politics from the New Statesman's Westminster team. The Saturday Read Your new guide to the best writing on ideas, politics, books and culture each weekend - from the New Statesman. The Crash A weekly newsletter helping you understand the global economic slowdown. Green Times The New Statesman’s weekly environment email. Events and Offers Stay up to date with NS events, subscription offers & updates. Your email address Job title Job title\n\nAdministration / Office\n\nArts and Culture\n\nBoard Member\n\nBusiness / Corporate Services\n\nClient / Customer Services\n\nCommunications\n\nConstruction, Works, Engineering\n\nEducation, Curriculum and Teaching\n\nEnvironment, Conservation and NRM\n\nFacility / Grounds Management and Maintenance\n\nFinance Management\n\nHealth - Medical and Nursing Management\n\nHR, Training and Organisational Development\n\nInformation and Communications Technology\n\nInformation Services, Statistics, Records, Archives\n\nInfrastructure Management - Transport, Utilities\n\nLegal Officers and Practitioners\n\nLibrarians and Library Management\n\nManagement\n\nMarketing\n\nOH&S, Risk Management\n\nOperations Management\n\nPlanning, Policy, Strategy\n\nPrinting, Design, Publishing, Web\n\nProjects, Programs and Advisors\n\nProperty, Assets and Fleet Management\n\nPublic Relations and Media\n\nPurchasing and Procurement\n\nQuality Management\n\nScience and Technical Research and Development\n\nSecurity and Law Enforcement\n\nService Delivery\n\nSport and Recreation\n\nTravel, Accommodation, Tourism\n\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\n\nHis eyes moisten at the spot where Stephen Lawrence was killed, marked by a stone plaque and covered in flowers. He remembers driving the murdered teenager’s father, Neville, around London, talking about what he’d taught his children. He points out the street where he first visited the grieving family. “It’s a road which is seared into my life,” he says.\n\nCommitted to the lives of his constituents, he sees his work as an MP “trying to do the right things in the right way”. He likens it to throwing starfish washed up by the tide back into the sea. “There are hundreds of thousands, you can’t save them all, but I can save a small number.”\n\nFrom child benefit and discrimination in Whitehall to the minimum wage and pension justice, to his latest fight against leaseholders shouldering post-Grenfell fire safety costs, Bottomley’s career is defined by successive campaigns against a constellation of injustices. “You ought to get to the stage where neither your chromosomes nor the colour of your skin should matter more than the colour of your eyes or the colour of your hair, and when will that be true?” he asks. “It’s better, but it’s [still] not right.”\n\nWhen congratulating him on his Fatherhood of the House two years ago, the former Labour leader Jeremy Corbyn told MPs he would always go to him when seeking “all-party consensus” and a “Conservative character” to his causes.\n\nBottomley never wanted to be a minister – though he served stints as a junior minister for employment, transport and Northern Ireland under Thatcher between 1984 and 1990. Party politics only interests him “in the same way playing squash or tennis interests me”, he says.\n\n“There’s no pay, no merit and no responsibility to being Father of the House”\n\n“I’m basically liberal. Liberals are wasted in the Liberal party. Virginia, my wife, says you should join the Tory party to make them socially aware, and you should join the Labour party to make them economically responsible.”\n\nBut the Tories very nearly missed out on him altogether. In 1972, a 28-year-old Bottomley headed to Smith Square in Westminster, where the offices of major parties and unions were based. He knocked on the door of Labour HQ and said “I’m thinking of joining the Labour Party”. They gave him a membership form, which asked if he accepted the party’s constitution. He bought a copy for thruppence, and was put off by the idea of party conference setting policy.\n\n“The only thing I knew about the party conference is that the ordinary members are the smallest group, the trade unionists the biggest, except for the journalists who are even larger.”\n\nInstead, within an hour he had joined the Transport & General Workers’ Union and the Tory party. (“When they said ‘we don’t have a constitution’, I couldn’t rule them out, so I joined.”)\n\nIt sounds like an unusual combination, but Bottomley worked as a lorry driver after completing his Cambridge economics degree. During our drive, he points out the Well Hall Pleasaunce gardens in Greenwich, where he used to deliver ice cream.\n\n“If you go back a decade or more, most companies had their own drivers, vans, recruitment, training,” he says of the latest shortage of HGV drivers. “Since the growth of logistics firms, that’s changed operations.\n\n“Then there’s cabotage [rules that restrict the number of trips European drivers can take in the UK], coronavirus interrupting things and the drop in the value of the pound since Brexit came along, coupled with when you’re earning money in this country, you’re sending less back home to your own countries.”\n\n“I’m basically liberal. Liberals are wasted in the Liberal party”\n\nAs a former transport under-secretary for Thatcher, he is used to building things. He believes the Tories’ latest priority to “level up” should mean connecting “the old industrialised parts of Britain, London of course being the biggest industrial part of Britain… If there’s difficulty getting from Stoke to the centre of Europe, and there are traffic jams in the south, the answer is to [make it so people can] get there more easily.”\n\nYet it shouldn’t just be about infrastructure: “There’s health, there’s wealth, there’s opportunity and being a place where if you have get-up-and-go you can get up and stay.”\n\nBottomley believes the whips see him as “independent, singular”, but he has “never said an adverse word privately or publicly about any prime minister, even Labour ones”. He even has a positive word to say about Keir Starmer, under whom he believes Labour could “overcome the idea that they’re not in favour of order and law”.\n\nHe and his wife, the Tory peer and former health secretary Virginia Bottomley, “have worked with poor and troubled people with an intensity that most people have not”.\n\nWhile he predicts the current cost-of-living crisis will last “no more than six months” – “it’s bad but it’s not disastrous” – he does not believe the £20 uplift to Universal Credit should be removed overnight.\n\n“It would’ve been better to have tapered it off in two goes, down from £20 to £10, and then from £10”, he says, adding the new fund for vulnerable households over winter should have been announced earlier than “a week before the change”.\n\nAs the sea rises over the horizon and we approach Worthing, Bottomley points out the number of fields and green spaces on his satnav subject to planning applications.\n\n“Every bit of greenfield between the built-up area of Worthing and Littlehampton appears to be under attack by developers,” he says. “It’s absolutely against the government’s intention but they don’t wake up… It’s an uphill struggle to get them to pay attention” to the threat to greenfield sites in constituencies like his.\n\nIt’s a hot topic in southern Tory circles, and the government has already started relaxing planning rules – most notably allowing an extra two storeys to be built upon existing blocks, which Bottomley calls a “straight gift to landlords”.\n\n“Things aren’t right. The government made a number of incredible mistakes [on planning]… When the [housing] minister [Chris Pincher] wound up the debate [about change allowing the two extra storeys], he didn’t mention the leaseholders once – that’s crackers. That’s crazy.”\n\n“Every bit of greenfield between the built-up area of Worthing and Littlehampton appears to be under attack by developers”\n\nBottomley believes “some” of these problems may be addressed with Michael Gove as Housing Secretary, but warns building new housing “needs a bit of imagination”.\n\n“Some ministers will say ‘as long as the design’s ok, it’s ok’, but they should be commenting on whether it should be there in the first place… Start trying to judge by the rules you published, rather than doing situational selectivity.”\n\nWe stop off for a copy of the Worthing Herald and a packet of T-bone steak-flavoured Roysters crisps at a local newsagent, and then settle in Bottomley’s cosy ground-floor flat.\n\nPhotos of the coast line the walls, alongside a mirror framed in shells, and a model of a sailboat on the window sill. Virginia’s presence is indicated by a vibrantly coloured oil portrait, a red cushion reading “Her Ladyship” in golden thread, and I sip tea from a mug championing “Votes for Women”. Bottomley lays out punnets of mini cucumbers, chopped raw mushrooms, tomatoes and grapes on the kitchen table for us to munch on.\n\n“I’m still an MP because I’m still alive and people vote for me,” he shrugs, when I ask what keeps him in the Commons.\n\nThe only time he considered stepping down was in 1982. Virginia had given up most of her paid work to run as a candidate on the Isle of Wight, and they had “two and half dependent children” to look after. “MPs’ pay was low, and I wasn’t going to go either broke or crooked to keep going,” he recalls.\n\nToday, he believes MPs should have higher salaries. “I take the view that being an MP is the greatest honour you could have, but a general practitioner in politics ought to be paid roughly the same as a general practitioner in medicine,” he says. (The average GP salary in England is £100,700.)\n\n“Being an MP is the greatest honour you could have, but a general practitioner in politics ought to be paid roughly the same as a general practitioner in medicine”\n\n“Doctors are paid far too little nowadays. But if they would get roughly £100,000 a year, the equivalent for an MP to get the same standard of living would be £110-£115,000 a year – it’s never the right time, but if your MP isn’t worth the money, it’s better to change the MP than to change the money.”\n\nWhile Bottomley no longer suffers the financial strains, he believes the situation is “desperately difficult” for his newer colleagues. “I don’t know how they manage. It’s really grim.”\n\nAs he drives me to Worthing station, the Father of the House speaks with all the enthusiasm of a first-time candidate, listing his hotchpotch set of priorities for the parliamentary term ahead: from reducing the abortion rate by four-fifths with “no change of law, just improving people’s understanding”, to rescuing leaseholders from the cladding crisis: “The government must find the places that need fixing, fix it, fund it, then get the money back, full stop.”\n\n“If Boris Johnson can make people happy, fine. If he and his advisers could occasionally ask the person who’s driving your car now for a view, he’d probably give them some good advice,” Bottomley smiles, eyes fixed on the road.\n\n“The only people who know how to run the country are either driving your car or cutting your hair – I’m not cutting your hair, but I’m driving your car.”\n\n[See also: Can Keir Starmer break Labour’s losing streak?]"}, {"url": "https://www.islandlifemagazine.co.uk/virginia-my-passion-for-island/", "page_content": "In her 10 years as a Cabinet Minister Virginia Bottomley was one of the most powerful women in British politics. But even she will admit she didn’t quite carry the clout of the woman who virtually ordered her to become a Member of Parliament – none other than former Prime Minister, ‘Iron Lady’ Margaret Thatcher.\n\nDuring her decade at the cutting edge of Government, and in all during her 21 years as a serving MP, Virginia never lost sight of the education of life and good values that were instilled into her as a young girl growing up, for the most part, here on the Island.\n\nDespite being born in Scotland, simply because her father was working there at the time, she, along with numerous family members, calls the Island her home. She is here as often as she can be, despite now being an active member of the House of Lords as Baroness Bottomley of Nettlestone, as well as working as a head-hunter for a high-profile company in London. She chairs the Odgers Berndtson Board & CEO Practice, which conducts searches for Chairmen, CEOs and non-executive directors for plcs and private companies.\n\nDuring a break away from life in the fast lane that she still enjoys, Virginia took time out to give ‘Island Life’ readers an insight into her interesting and rewarding career as an MP, and her love of the Island.\n\nShe revealed: “My great grandfather Sir Edward Poulton came to St Helens Cottage in about 1890, and in 1915 he gave St Helens Common to the National Trust. My other grandfather Dr. William Garnett bought a house in Seagrove Bay around 1900.\n\n“My grandparents met playing hockey in Priory Bay, and we still play hockey there, so the family have been doing that for more than 100 years. All my family were quite academic and very involved in public policies. Dr William Garnett was involved in introducing education to London as one of the original signatories of the London School of Economics where I studied, so I am very proud of him.”\n\nHer family bought half of Priory Bay in 1926, and the family home was built the following year. Since then the whole family has been down here constantly, with often as many as 100 relations gathering in the summer.\n\nVirginia points out: “We all share a passion for the Island. As a young girl I remember we had these appalling traditions, so every Easter Monday we would walk from Horestone Point to Whitecliff Bay – again a walk that was started by my great grandfather in 1890. The other tradition is swimming to St Helens Fort. My great uncles who were killed in the First World War did it, and I swam to the Fort when I was 10 years old.\n\n“Another childhood memory was when we loaded up the dinghies and drove to Freshwater and then rowed around and had a picnic in Scratchells Bay. Another time we had a running race from Freshwater to home. We really went for it, and couldn’t move for a week afterwards. It was a competitive environment.\n\n“When we were young Priory Bay was quite distant from Ryde because people didn’t have cars and we went everywhere by boat. I think we learned a great resilience. Sometimes the tide and wind are against you and you make no progress. On other occasions you have the tide and wind with you, and even though you don’t make much effort you travel like a rocket. I think that is the most wonderful lesson for life – sometimes you work so hard and it doesn’t happen, but other times you just sail through it.”\n\nVirginia recalls one of the most influential people in her life was her ‘very special’ aunt Peggy Jay. She said: “She was in politics and had a massive influence on me, and I say my husband Peter only married me because he thought I would turn out like Peggy Jay. She was a member of the Greater London Council, and was forceful. She was a great reformer and campaigner. She was brought up on the Island, and was a wonderful mentor.”\n\nDespite being married to a Tory MP, Virginia had never given much thought to joining him in the Commons. Then one day her whole life changed when she received a call from 10 Downing Street, on the orders of PM Margaret Thatcher, saying more female MPs were required, and she was on the ‘wanted list’.\n\nShe continued: “I decided Peggy Jay should have been an MP, but she wasn’t so I would be. I wanted Peter to be the MP for the Isle of Wight long ago, and then in 1982 it came up for the following year’s General Election. I worked so hard and actually got 34,900 votes – only five people in the country got more votes than I did, but one of those was Liberal Stephen Ross, the sitting MP, who beat me.\n\n“I was devastated. The campaign was ‘Turn Wight Blue’ and Mrs. Thatcher even came over to visit. The day after I had lost she rang me to say ‘what bad luck’ and I burst into tears. But it made me realise much more about the Island; the huge delights, but also some of the difficulties and dilemmas.\n\n“I learned how hugely entrepreneurial and creative the Island is with lots of small businesses and so many dedicated people. We all hope it can become an Island of real enterprise and creativity in small businesses. With modern technology, distance working and IT, my senses are that it is going to become ever more possible to realise this vision. The Island really has everything going for it.\n\n“Whatever I have done, I have always felt part of my energy was put into developing and promoting the Island in any way I could. The Island needs all the help it can get to make people realise what a wonderful and exciting place it is.”\n\nVirginia became MP for South West Surrey in 1984. There were 365 applicants to be the Tory candidate, but she was chosen and subsequently won the seat. She said: “At the time there were just 23 women MPs in a House of Commons of more than 600, so we were like an endangered species. Now the ratio is about one in four. I loved the constituency life and being involved in every aspect.”\n\nInitially she served under Margaret Thatcher and then John Major, and received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment. She was appointed Minister of State at the Department of Health in 1989, and was appointed a member of the Privy Council upon joining Major’s Cabinet as Secretary of State for Health in 1992, serving until 1995.\n\nShe then served as Secretary of State for National Heritage until 1997. After the 1997 General Election, she returned to the back benches, saying: “I had been working 24 hours a day, seven days a week, and returning to the back benches enabled me to re-connect with my family. After 10 years I felt I had done my time and needed my life back.”\n\nLooking back on her 10 years as a Minister, Virginia recalls: “Mrs. Thatcher called me one day to see her on a Monday, which was unusual. I said I was busy and could it be later in the week. But I was summoned and she offered me a job as a Minister. I was so surprised. She wanted me to go to Environment, but I had only ever spoken about Defence, Agriculture or transport, and knew nothing about it.\n\n“She replied very smartly that I would have to read up on it! It was very interesting getting people to use unleaded petrol, and recycle. But I loved being Secretary of State for Health because it was so demanding and intense. It was a job where I had a real role with serious responsibilities. I had to take difficult decisions, so I had to be courageous and tenacious to survive.“When I first became a Minister I had a very bright young man in Central Office. He was 23 and used to coach and brief me when I went on television’s ‘Question Time’. He was a very clever, positive person, and his name was David Cameron!”\n\nThat is one of the main reasons why Virginia is very supportive of the present team, even though she believes coalition must be ‘incredibly frustrating, compromising and complex’.\n\nAfter quitting the Cabinet Virginia continued to work closely with Tory leaders William Hague, Ian Duncan Smith and Michael Howard. It was Howard who put her in the House of Lords in 2005. She said: “I was absolutely delighted, and it was unexpected. Some of the debates in the Lords are phenomenal, and it will be a great loss if it goes. But I accept it is hard to justify.”\n\nVirginia added: “I am someone who is constantly restless, so I am never really satisfied. I have been married coming up 45 years to the same person, and that is something that gives great strength. But if you can find a role in life that in your way plays to your strengths and minimises your many failings then you are privileged.”"}, {"url": "https://www.odgersberndtson.com/en-se/people/virginia-bottomley", "page_content": "Virginia Bottomley\n\nChair, Board Practice\n\nLondon\n\nRt Hon Baroness Virginia Bottomley DL chairs the Odgers Berndtson Board Practice. She conducts searches for Chairs, CEOs and Non-Executive Directors for plcs, private companies and major public organisations. She joined Odgers Berndtson in 2000.\n\nVirginia was formerly an NED at AkzoNobel NV, BUPA, Smith & Nephew and ICC UK. She was a member of the Chugai International Council (Japan). As part of her pro-bono activities Virginia is a Trustee of The Economist Newspaper and Chancellor of the University of Hull.\n\nVirginia was a member of the House of Commons from 1984 to 2005 serving successively as Secretary of State for Health and National Heritage (now Culture, Media and Sport) in both John Major’s and Margaret Thatcher's Governments. Virginia was appointed a Life Peer in 2005.\n\nFollowing her first degree, Virginia gained an MSc in Social Administration from the London School of Economics."}, {"url": "https://www.latimes.com/archives/la-xpm-1992-08-30-op-8435-story.html", "page_content": "Thomas Plate is editor of the editorial pages for The Times. William Tuohy is London bureau chief for The Times. They interviewed Virginia Bottomley in the health secretary's office\n\nShe has brought more than a touch of glamour to the British Cabinet--so much so that Health Secretary Virginia Bottomley is depicted on the irreverent Spitting Image TV show as Prime Minister John Major’s girlfriend. But she is hardly the dumb-blonde caricature of the series. Rather, Bottomley, 44, holds one of the toughest jobs in the Cabinet--con stantly under fire from the opposition, which accuses the government of trying to undermine Britain’s famed National Health Service.\n\nAnd as health secretary, boss of one of the big “spending” departments in government, she is frequently locked in battle with Treasury officials who are in the business of trimming her $62 billion-a-year NHS budget. However, she has had plenty of training for her arduous job.\n\nBorn in Scotland as Virginia Hilda Brunette Maxwell Garnett, she grew up in a middle-class, socially aware family. “For me, there wasn’t really a decision about whether or not to do something in the public arena,” she recalls. “It was almost taken for granted that I would.”\n\nAdvertisement\n\nShe studied sociology at Essex University and took a master’s degree at the London School of Economics. At 19, she married Peter Bottomley, who became a member of Parliament and transportation minister. A mother of three, she was a researcher in child psychiatry, and was appointed a magistrate at age 27. She won election as a Conservative MP in 1984. In government, she served in various sub-Cabinet posts: in the Departments of Education, Overseas Development, the Foreign Office and Environment, before moving to Health, from which she was appointed to the Cabinet as secretary last April.\n\nBottomley denies that the Major government is trying to privatize the NHS, insisting that she herself has never received private medical care, and points out that her daughter is a doctor with the NHS.\n\nShe supports women’s rights and equality, and is responsible for the governmental department that is the country’s largest employer of women--some 750,000--mostly nurses.\n\nIf she doesn’t blot her copybook, her political future is bright indeed. As opposition Labor MP Frank Field, with whom she worked on joint committees, says of her “English rose” attraction and clear speaking voice: “She knows that she is incredibly good-looking--and this government is short of talking heads on the box that don’t make voters beg for the return of steam (early) radio.”\n\nQuestion: There is growing criticism that, over the years, the medical research Establishment has wavered on issues that concern women more than men. For example, many critics both inside and outside the medical Establishment insist that breast cancer research has been neglected in relation to its incidence among women. Does that resonate in Britain?\n\nAnswer: I think there is little resonance of that here. Indeed, in this country we have taken forward a number of health programs directly related to women’s health. We were one of the first countries in the world to have a national call and recall program for breast cancer and cervical cancer screening. And the new steps we have taken in our general practitioner contract--our family doctors contract--give them additional rewards for reaching almost universal coverage in the cancer-screening program. So one of the strengths of the National Health Service is its universality, its accessibility to all and, through the family doctor service, we are particularly determined to reach the groups who would otherwise be reluctant to come forward for health care, and, within that target audience, the needs of women--both in terms of cancer-screening and maternity services--are a clear priority.\n\nLast year I launched a document, “Your Health--a Guide to Services to Women,” available free to anyone who applied for it. It was extremely popular. Women are interested in health. They want to know what is available--they want to know for themselves and they want to know for their families.\n\nQ: The allocation of resources here has been a running argument. As people live longer, health care costs are higher. How does your government, or any government, cope with these costs vs. treatment? Do you foresee solutions as to how to deal with this in a time of dwindling revenues?\n\nA: Around the world it is clear that every country is facing the same challenges: aging population, rising expectations and the incredible ability of new medical techniques to combat diseases and disabilities that in the past would have been inconceivable. Our health service is one of the most efficient in the world. We spend a smaller share of our GNP, although a rising one, than many other countries, and it has great strength in that it is universally available, accessible to all and free at the point of delivery.\n\nThose are fundamental principles which I shall hold to. The reforms we have introduced have been about trying to ensure that we use those resources more effectively, that we integrate what I call the cultures of caring and costing. But, because we’ve had a free health service, we’ve very often been divorced from any knowledge or understanding of price or cost at all. In the minds of professionals and patients, it felt like a free service.\n\nOur reforms have been to try to secure better management control over resources so that we can maximize the ability of the service to deliver patient care. At the same time we have been introducing a health strategy so we actually get health authorities to begin to identify and assess the health need of the local population and spell out how they are going to meet that health need. Of course, that means making difficult choices between investment in intensive care, investment in the latest equipment and providing ever-improved services for mental illness or learning disabilities, for example.\n\nSome new techniques result in greater cost effectiveness--a rapid expansion in day surgery, for example. Whereas in the past patients would have gone into hospital for days or weeks, some use of pharmaceutical products can then reduce the need for hospital admission. So it is not necessarily the case that all medical advances lead to escalating costs. But as policy-makers we are in a much stronger position in this country, on the basis of our health reforms, to try to take the process forward, maximizing our ability to use those resources that we fight hard for, to get the best possible health benefit for the population.\n\nQ: Often you use the phrase “health reforms.” What specifically do you mean by health reforms in the general sense?\n\nA: We have tried to reduce some of the bureaucracy and the monolithic nature of our National Health Service--so that hospitals can become free-standing organizations answerable to the (health) secretary--still part of the National Health Service but with a more effective management structure. Above all, we have separated out the role of commissioning health care, to the role of providing health care through the hospitals, both part of the National Health Service, but a clearer recognition of the functions and a greater transparency of the cost elements.\n\nQ: You do have an elaborate health service, and you also have very good private practices. Is there any fear--either from a government point of view or from an average patient--that somehow the government service may be second-rate compared with private health care?\n\nA: We have a modest private sector compared with almost any other country’s, and ... my position is one of respect for the private sector; but my program is almost entirely concerned with ensuring that our National Health Service is and remains the envy of the world.\n\nPerhaps the most effective way of responding to your question is to make a personal statement, which is that I, my family, use the National Health Service. . . . I think it provides the best health care for me and my family. And what I am committed to is safeguarding that National Health Service, free, available to all, for the people of this country.\n\nQ: You don’t want to privatize it?\n\nA: Not remotely on the agenda. I want to use the skills though, if there are management skills in the private sector--about the use of resources, about information technology, about management, about communication--that we can apply in the public sector.\n\nIf you are characterizing our health service in the past, I would say that our clinicians were outstanding, their techniques were in the forefront. We have to make sure that our management skills are as good in a public service as our clinical skills. And this is, of course, the whole focus of the Prime Minister’s Citizens Charter program. Citizens Charter is about making sure that public services are accountable, that they give value for money, that they put the user in the forefront of concern. Our patients Charter has been the pioneer of the Citizens Charter movement, spelling out what are the rights and standards that patients can expect from the National Health Service, and we have been seeing real results in terms of falling waiting times, improved quality of service.\n\nQ: Do you think the British experience with the National Health Service bears lessons that the United States could learn?\n\nA: The strengths of the National Health Service are its universality, its availability to all. It seems that any health service ... needs to think about how to reach those groups who are often most at risk in terms of health need. So when it comes to HIV and AIDS, there are many anxieties about people coming forward, but having to pay for their treatment is not one of them. And those who are sick already have one handicap; we want to be sure that there is no further disincentive for them seeking treatment. The advantages of a system that encourages prevention is that you want to achieve the access. So that the strength is the universality.\n\nAn additional strength is our family doctor service, so that virtually every individual person in the country is signed on with a general practitioner--a generalist--who is the gatekeeper, the filter, a source of communication for the individual who is referred on to a hospital. Any other country taking forward a proposal has to examine those proposals in the context of its own traditions.\n\nQ: Specifically, how does Britain keep down the cost of health care?\n\nA: The issue will always be, for health secretaries, how to hold the ring between investing and encouraging those areas which don’t necessarily hit the headlines. In addition, some of the more glamorous, experimental treatments, which cost huge resources, but result in relatively modest improvements in the quality of life, have to be balanced against areas where there is less public and political interest, but relatively modest sums can achieve substantial improvements. . . ."}, {"url": "https://www.independent.co.uk/news/uk/politics/inside-parliament-conservatives-lose-patience-as-mrs-bottomley-loses-hospitals-1614362.html", "page_content": "Sign up for the View from Westminster email for expert analysis straight to your inbox Get our free View from Westminster email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nView from Westminster email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nVirginia Bottomley's political judgement was questioned by senior Conservatives in an extraordinary Commons performance yesterday as the last day before the Easter recess became one of impassioned 11th-hour appeals.\n\nDennis Skinner wanted to save the jobs of 74 disabled people at a Remploy factory in Derbyshire; his Labour colleague Ann Campbell urged the Government to intervene to save murderer Nicholas Ingram from the electric chair, and Tony Banks wanted to unscramble the £60m sale of London's County Hall to the Japanese company Shirayama.\n\nBut the loudest appeal was against the \"death warrant\" served by the Secretary of State for Health on historic St Bartholomew's hospital in the City, on accident and emergency services at Guy's and on locally-valued units elsewhere in London.\n\nPeter Brooke, MP for the City of London, forced his former Cabinet colleague Mrs Bottomley to come to the Commons to defend the closures for a gruelling 64 minutes.\n\nIn a succession of damaging exchanges, senior Tories accused her of insensitivity to public opinion and questioned her competence as a Cabinet minister. Sir Edward Heath murmured darkly about the \"political implications\" of Mrs Bottomley's decisions for Conservatives representing London seats. On Tuesday, Mr Brooke criticised the Secretary of State's lack of \"moral courage\" after she confirmed the closure of Bart's and the transfer of most of Guy's patients to St Thomas's in a Commons written reply rather than making a statement.\n\nRaising the issue yesterday, he told the House: \"If a hospital has been around for 900 years, for it to receive its death warrant through a written answer doesn't seem to me to be wholly worthy of the traditions of our party.\" Barts was founded in 1123.\n\nLater, having obliged Mrs Bottomley to make a statement by tabling a private notice question, Mr Brooke was comparatively restrained. \"Bart's is a national and international asset and in the post-industrial society such assets are of the highest importance in communicating British medical excellence to the world,\" he said.\n\nA former minister, Sir Rhodes Boyson, compared the closures to the abolition of grammar schools he fought against. \"We are now, on this side of the House, destroying the same traditions in the hospitals, which to my mind is a form of vandalism.\"\n\nThe normally loyal Roger Sims, MP for Chislehurst and vice-chairman of the Tory backbench health committee, praised Mrs Bottomley's \"courage\" in grasping the nettle of reorganisation but pleaded with her to show \"rather more sensitivity\". \"Consultation implies listening to what people have to say and taking account of their views,\" he said.\n\nWith closure of the accident and emergency unit at Edgware hospital raising as much passion as Bart's, Sir John Gorst, MP for Hendon North, asked if Mrs Bottomley accepted \"that democratic politics is about delivering to people what the majority want, and not about telling the majority of people what they should have?\n\n\"Does she not accept now that she is doing the wrong thing in the wrong way at the wrong time and in the wrong place?\"\n\nBut the most wounding criticism came from Hugh Dykes, MP for Harrow East: \"Mrs Bottomley has not succeeded as a senior member of the Cabinet because she has not - having listened to the half-baked account of some bureaucrat in her department or elsewhere, reached her own essential, human, social, clinical, medical and indeed political judgements on these matters.\"\n\nMr Dykes said the proposal to close the Edgware A&E unit was \"outrageous\" and Mrs Bottomley should think again.\n\nMrs Bottomley was supported by out-of-London Tories who have long complained that the capital's hospitals get too big a share of resources and by her husband, Peter Bottomley, MP for Eltham.\n\nSimon Hughes, Liberal Democrat MP for Guy's, said more than 1 million people had signed a petition in support of the hospital and only 23 people had taken the opposite view. Wasn't there something wrong with public consultation when the Secretary of State had sided with the 23? Her work largely done by others, Margaret Beckett, the Labour health spokeswoman, told Mrs Bottomley: \"I hope you now recognise that your case is as dubious as your excuses for not putting that case to the House?\"\n\nBut though sounding nervous at times, the Secretary of State, stuck by her plans. They enjoyed \"widespread support within the clinical and academic worlds\" she said, and quoted so many eminent figures that Speaker Betty Boothroyd lost patience.\n\nMrs Bottomley's vision was of \"multi-faculty colleges with hospital clusters around them. That is the way to be world-class centres for research and education\". Longer journeys to hospital would be met by increased use of paramedics at the scene, she suggested.\n\nShe said the changes - covering hospitals in south and east London and around Barnet and Edgware - would be backed by £400m of capital investment on top of the £210m already being spent on improving primary care.\n\nRevenue savings would amount to some £75m a year compared to a cost of £28m at the moment from duplication and fragmentation.\n\n\"My job must be, if we are to have a comprehensive service, free at the point of use, able to pioneer new treatments ... to address the need for change,\" Mrs Bottomley insisted.\n\nBut the shouts of \"resign\" from the Opposition benches and the steam from Tory MPs spoke more of a change for the minister."}, {"url": "https://therealslog.com/2012/10/10/revealed-at-last-the-hunt-bottomley-link/", "page_content": "The one-word secret of Hunt’s success:\n\nNEPOTISM\n\nHis relationship to Virginia Bottomley…..his dealings with the British Council….his inheritance of the SW Surrey constituency….his father’s history in UK Health provision….the Health interests for whom Bottomley now works….his capture of the Health portfolio in the recent reshuffle.\n\n♣ ♣ ♣ ♣ ♣ ♣ ♣\n\nThroughout his career, Jeremy Hunt’s advancement somehow always seemed to involve his path crossing that of the former Virginia Bottomley, known since 2005 as Baroness Nettlestone. Now – with the help of some initial sleuthing by regular Slogger Jackie – I can offer readers a big clue: they are cousins. Laid out below (for anyone with any feeling for the importance of meritocracy) is how still, in 2012, career progress of the type admired by David Cameron – “the leg up” – is alive and well. One where the right tie, who you know, and above all a well-connected family, are all you need to prosper.\n\nHaving studied the modus operandi of Health Secretary Jeremy Hunt for some eighteen months now, the most striking thing about him is a penchant for toughing out any and all criticisms with a bare face. Almost nothing uttered in public by this man is ever anything other than an embellishment, or a distortion, or a boldly stated but clearly inaccurate statement: “I gave full disclosure”, “I have done nothing wrong”, “It was a purely fact-finding mission” and so forth.\n\nToday at the Conservative Party conference, Hunt excelled himself by suggesting to his audience that his father “worked as a manager for the NHS”. It is an exaggeration served with lashings of deception: Sir Nicholas John Streynsham Hunt (Daddy) was Admiral of the Fleet in his main career and, once retired, became a quangoista par excellence. He was Chairman of the South West Surrey District Health Authority from 1990 to 1995 and then Chairman of Nuffield Hospitals from 1996 to 2001.\n\nRing any bells? The clues are ‘South West Surrey’, ‘Health’ and ‘Nuffield’. And it might not be too hard to imagine where he got the assist into those cosy sinecures: for not long previously, his niece Virginia Bottomley had been….Minister of Health.\n\nAdmiral Sir John had an elder brother (now carefully airbrushed out of the Wikipedias and other genealogies), one Roland Colin Charles Hunt. He married Hilda Pauline Garnett, whose brother was W. John Garnett. WJG had a daughter called Hilda Brunette Maxwell Garnett….aka, Virginia Bottomley.\n\nVirginia Bottomley eventually became MP for South West Surrey.\n\nRing any bells? Ah yes, that’ll be the same South West Surrey for which her cousin Jeremy Hunt became MP when Virginia decided to quit open politics and become a quangoista…just like her uncle the Admiral of the Fleet.\n\nAnd this wasn’t the first time La Bottomley had been helpful to cousin Jeremy. She’d joined infamous quango The British Council. And it might not be too hard to imagine where Jezzer got the assist into becoming a monopoly supplier to the British Council with his company Hotcourses.\n\nNor would it involve much of a lateral leap in thought to understand how – after Hotcourses completely cocked up the first job it did for the Council – an elaborate system of shelf companies and oddly-headed invoices enabled Jeremy to carry on secretly being a preferred monopoly supplier to The British Council for the next five years…on the back of which he amassed the fortune of which he is so proud today.\n\nThen Virginia moved upwards into Another House, becoming Baroness Bottomley of Nettlestone in 2005 – handing her seat to Jeremy Hunt as if it might be a family heirloom. Hunt was duly elected, and South West Surrey thus became a Rotten Borough.\n\nThis is what Baroness Nettlestone mainly gets up to in the Lords: she lobbies on behalf of the private health sector via her directorship of BUPA. She must’ve been a shoe-in for that little earner, she having been Health Secretary in charge of the public sector an’ all…but then, probably Uncle Admiral’s contacts at Nuffield helped. You know how these things work.\n\nRight then….private health lobbying, and a creeping pauperisation of NHS hospitals by former Health Secretary Andrew Lansley. But Andrew was a bit accident-prone – rather like his Cabinet colleague Jeremy Hunt, who partnered Newscorp in his educational supplies business, went to New York to broker a change of Newscorp’s Party preference from Labour to Tory, and then was quite coincidentally put in charge of adjudicating on the Newscorp bid for BSkyB. As we all know, that ended in tears.\n\nBut Jeremy Richard Streynsham Hunt didn’t go down a snake like the luckless Lansley. He went two rungs up the ladder to become….Secretary of State for Health. To paraphrase the old Lord Robert Cecil gag about ‘Bob’s yer uncle’ it seems the only way is up if Ginny’s yer cousin. As I blogged yesterday, Cameron didn’t want to give Jezzer the job. But Mr Hunt appears to have three very strong holds on the Prime Minister.\n\nFirst, he is very – like I mean extremely – well in at Newscorp. “Jeremy is our man now: don’t mess with him”. Second, he is bankrolled by murky mega-donor JHJ Lewis – Chairman of the Groucho Club (a media-luvvie venue proven to have illegally recorded the coke-snorting antics of its celebrity customers) and influential eminence grise in the Conservative Party. And third, he has the influence and contacts via Bottomley to oil wheels here and there in the gradual sale of an insolvent NHS to organisation like – and here I’m only offering suggestions of course – BUPA and Nuffield.\n\nSo there’s Jeremy newly installed as Health Secretary after just seven short years as an MP. This is a summary of his meteoric rise:\n\nHe made a fortune at the taxpayers’ expense as monopoly supplier to a notorious quango where, by happy coincidence, his cousin sat on the Board. He became MP for SW Surrey where, by happy coincidence, his cousin had been MP previously. He became Minister in charge of Media & Culture where, by happy coincidence, he wound up steering his pals at Newscorp in the right direction. And he became Health Secretary partly because, by happy coincidence, his cousin is a lobbyist for the private health sector.\n\nThe Conservative Party claims to be all about the Bonfire of the Quangos, the Party where everyone who wants to work hard can get an even break, and the Big Society. But its members, acolytes and backers remain what they’ve always been: a small Secret Society where who is far more important than what you know. Hilariously, Virginia Bottomley has described herself as “a one-nation” Conservative. Well I guess we now know which of Disraeli’s two nations she was talking about.\n\nSadly, ‘Red’ Ed’s flimsy attempt to take on the mantle of Benjamin Dizziband last week is no kind of alternative to the privatisation and commercial exploitation of Westminster by the Tory Party’s mates in big business and banking. The Ed Miller Band too has its UNITE mates who must be satisfied, its largely pro-Labour immigrants who must be loved up, its teachers who resist real educational reform, and its public sector employees who vote Labour by a margin of two to one.\n\nThe truth is that none of our triumvirate of Westminster Parties has the majority citizen in mind when formulating policy. The Libdems represent slavish support for Brussels and all its works. Labour thinks equality is about affirmative, favouritist action for noisy minorities. And the Tories think they work for anyone with money and power. Brick by brick, the Wall of Class knocked down during the 1950s has been replaced by the Barrier of Influence in the 21st century. Merit? It doesn’t even get a look in. Decency? That’s for wimps.\n\nAll this disgusting graft, influence and interest-group manipulation can only be ended by banning all monied political lobbying and all political Party contributions, whatever their size. I repeat, the State must fund all political Parties and keep commerce out: it is the only way our once great and respected political culture can be revived.\n\nI would urge all those reading this piece to examine the evidence presented as to the character of Our Jeremy at The Slog’s dedicated page, Hunt Balls.\n\nI think the time may have come for an all-voter petition demanding the removal of Mr Hunt from the Health Secretaryship.\n\nRelated in a rather vomit-inducing way: why the forces ranged against Cameron will prove irresistible\n\n"}, {"url": "https://www.howold.co/person/virginia-bottomley/biography", "page_content": "Virginia Bottomley Biography\n\nBritish politician\n\nPersonal detailsBorn (1948-03-12) 12 March 1948 (age:75)Dunoon, ScotlandPolitical partyConservativeSpousePeter Bottomley ​(m.:1967)​ChildrenJosh · Cecilia · AdelaEducationPutney High SchoolAlma materUniversity of Essex (BA)London School of Economics (MA)SignatureWebsiteOfficial websiteVirginia Bottomley's voicefrom the BBC Front Row, 25 April 2013\n\nVirginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone, PC DL (née Garnett, born 12 March 1948) is a British Conservative Party politician and headhunter. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She became a member of the House of Lords in 2005.\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon, Scotland, to Barbara Rutherford-Smith, Jarrow hunger marcher, a teacher and elected Conservative member of the Inner London Education Authority and W. John Garnett CBE, former director of what was then called The Industrial Society, grandson of Cambridge physicist and educational adviser William Garnett and of Sir Edward Poulton, Hope professor of zoology at Oxford. Her paternal aunt was Labour Greater London Council member Peggy Jay. She first met Peter Bottomley, her future husband, when she was 12 years old; they wed in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in southwest London, before going up to the University of Essex to study sociology (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA).\n\nShe began her working life as a social scientist and was a researcher for the Child Poverty Action Group. She has also been a social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 general election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan), as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment and was appointed Minister of State at the Department of Health in 1989. She was appointed a member of the Privy Council (PC) upon joining John Major's Cabinet as Secretary of State for Health in 1992, becoming the ninth woman to serve in the British cabinet. She served as Health Secretary until 1995.\n\nBottomley and Ann Widdecombe have been listed as co-founders of Lady Olga Maitland’s pro-nuclear Women and Families for Defence group.\n\nShe served as Secretary of State for National Heritage from 1995 to 1997. During this period, she appeared in the Eurovision Song Contest 1996, wishing luck to the United Kingdom's entrant, Gina G.\n\nAfter the 1997 general election, she returned to the backbenches, and become a headhunter at Odgers, where she headed and now chairs the company's Board & CEO Practice.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called. On 24 June 2005 she was created a life peer with the *le Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She was on the founding Council of the University of the Arts, London. She was a Council Member of the Ditchley Foundation and was President of Farnham Castle, Centre for International Briefing. From 2000 until May 2012 she sat on the Supervisory Board of Akzo Nobel, taking over Courtaulds and then ICI. She was a non-executive director of Bupa, a healthcare company. She was on the Advisory Council of the International Chamber of Commerce UK (ICC UK) and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She was a lay canon of Guildford Cathedral, and a Freeman of the City of London.\n\nIn 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull since 2013. She is the longest serving trustee of The Economist newspaper.\n\nVirginia Garnett married Peter Bottomley in 1967, after the birth of their eldest child; since 1975 he has been an MP.\n\nDuring her time in Prime Minister John Major's cabinet, the satirical puppet show Spitting Image often portrayed Major as having an unrequited crush on Bottomley; years later, it was revealed that Major was having an affair with Edwina Currie at the time.\n\nBottomley's family includes many figures in politics and public life. Her brother, Christopher Garnett, was the chief executive of train operating company GNER. Her aunt Pauline married Roland Hunt who is not connected to Sir Nicholas Hunt, father of Jeremy Hunt who succeeded her as MP.\n\nHer cousins include Peter Jay (the former British Amb*ador to the United States and son-in-law to James Callaghan), and Lord Hunt of Chesterton (father of historian and former Labour MP Tristram Hunt).\n\nMore distant relatives include Lord Oakeshott of Seagrove Bay and Baron Jay of Ewelme (former FCO PUSS and British Amb*ador to France).\n\nJulia Cleverdon married Bottomley's late father, John. Her husband's niece is Kitty Ussher (a former Labour minister).\n\nReferences\n\nExternal links"}]}