{"Virginia Bottomley was born in London and educated at the independent Putney High School and the University of Leicester, where she graduated with a degree in economics.": [{"url": "https://www.encyclopedia.com/women/dictionaries-thesauruses-pictures-and-press-releases/bottomley-virginia-1948", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://www.odgersberndtson.com/en-gb/people/virginia-bottomley", "page_content": "Virginia Bottomley\n\nChair, Board Practice\n\nLondon\n\nRt Hon Baroness Virginia Bottomley DL chairs the Odgers Berndtson Board Practice. She conducts searches for Chairs, CEOs and Non-Executive Directors for plcs, private companies and major public organisations. She joined Odgers Berndtson in 2000.\n\nVirginia was formerly an NED at AkzoNobel NV, BUPA, Smith & Nephew and ICC UK. She was a member of the Chugai International Council (Japan). As part of her pro-bono activities Virginia is a Trustee of The Economist Newspaper and Chancellor of the University of Hull.\n\nVirginia was a member of the House of Commons from 1984 to 2005 serving successively as Secretary of State for Health and National Heritage (now Culture, Media and Sport) in both John Major’s and Margaret Thatcher's Governments. Virginia was appointed a Life Peer in 2005.\n\nFollowing her first degree, Virginia gained an MSc in Social Administration from the London School of Economics."}, {"url": "https://www.howold.co/person/virginia-bottomley/biography", "page_content": "Virginia Bottomley Biography\n\nBritish politician\n\nPersonal detailsBorn (1948-03-12) 12 March 1948 (age:75)Dunoon, ScotlandPolitical partyConservativeSpousePeter Bottomley ​(m.:1967)​ChildrenJosh · Cecilia · AdelaEducationPutney High SchoolAlma materUniversity of Essex (BA)London School of Economics (MA)SignatureWebsiteOfficial websiteVirginia Bottomley's voicefrom the BBC Front Row, 25 April 2013\n\nVirginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone, PC DL (née Garnett, born 12 March 1948) is a British Conservative Party politician and headhunter. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She became a member of the House of Lords in 2005.\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon, Scotland, to Barbara Rutherford-Smith, Jarrow hunger marcher, a teacher and elected Conservative member of the Inner London Education Authority and W. John Garnett CBE, former director of what was then called The Industrial Society, grandson of Cambridge physicist and educational adviser William Garnett and of Sir Edward Poulton, Hope professor of zoology at Oxford. Her paternal aunt was Labour Greater London Council member Peggy Jay. She first met Peter Bottomley, her future husband, when she was 12 years old; they wed in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in southwest London, before going up to the University of Essex to study sociology (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA).\n\nShe began her working life as a social scientist and was a researcher for the Child Poverty Action Group. She has also been a social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 general election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan), as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment and was appointed Minister of State at the Department of Health in 1989. She was appointed a member of the Privy Council (PC) upon joining John Major's Cabinet as Secretary of State for Health in 1992, becoming the ninth woman to serve in the British cabinet. She served as Health Secretary until 1995.\n\nBottomley and Ann Widdecombe have been listed as co-founders of Lady Olga Maitland’s pro-nuclear Women and Families for Defence group.\n\nShe served as Secretary of State for National Heritage from 1995 to 1997. During this period, she appeared in the Eurovision Song Contest 1996, wishing luck to the United Kingdom's entrant, Gina G.\n\nAfter the 1997 general election, she returned to the backbenches, and become a headhunter at Odgers, where she headed and now chairs the company's Board & CEO Practice.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called. On 24 June 2005 she was created a life peer with the *le Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She was on the founding Council of the University of the Arts, London. She was a Council Member of the Ditchley Foundation and was President of Farnham Castle, Centre for International Briefing. From 2000 until May 2012 she sat on the Supervisory Board of Akzo Nobel, taking over Courtaulds and then ICI. She was a non-executive director of Bupa, a healthcare company. She was on the Advisory Council of the International Chamber of Commerce UK (ICC UK) and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She was a lay canon of Guildford Cathedral, and a Freeman of the City of London.\n\nIn 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull since 2013. She is the longest serving trustee of The Economist newspaper.\n\nVirginia Garnett married Peter Bottomley in 1967, after the birth of their eldest child; since 1975 he has been an MP.\n\nDuring her time in Prime Minister John Major's cabinet, the satirical puppet show Spitting Image often portrayed Major as having an unrequited crush on Bottomley; years later, it was revealed that Major was having an affair with Edwina Currie at the time.\n\nBottomley's family includes many figures in politics and public life. Her brother, Christopher Garnett, was the chief executive of train operating company GNER. Her aunt Pauline married Roland Hunt who is not connected to Sir Nicholas Hunt, father of Jeremy Hunt who succeeded her as MP.\n\nHer cousins include Peter Jay (the former British Amb*ador to the United States and son-in-law to James Callaghan), and Lord Hunt of Chesterton (father of historian and former Labour MP Tristram Hunt).\n\nMore distant relatives include Lord Oakeshott of Seagrove Bay and Baron Jay of Ewelme (former FCO PUSS and British Amb*ador to France).\n\nJulia Cleverdon married Bottomley's late father, John. Her husband's niece is Kitty Ussher (a former Labour minister).\n\nReferences\n\nExternal links"}, {"url": "https://wiki2.org/en/Virginia_Bottomley", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish politician\n\nVirginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone, (née Garnett, born 12 March 1948) is a British Conservative Party politician and headhunter. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She became a member of the House of Lords in 2005.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 1 661 583 3 035\n\nBritain's Next PM? | Michael Howard, Anna Soubry, Liz Truss, Jon Lansman, Ella Whelan, David Malone\n\nSir Peter Bottomley MP | THH No Confidence in Her Majesty's Gov't | Cambridge Union (6/6)\n\nInterview with Dr Marijn Dekkers - Chairman of Unilever Transcription\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon, Scotland, to Barbara Rutherford-Smith, Jarrow hunger marcher, a teacher and elected Conservative member of the Inner London Education Authority and W. John Garnett CBE, former director of what was then called The Industrial Society, grandson of Cambridge physicist and educational adviser William Garnett and of Sir Edward Poulton, Hope professor of zoology at Oxford.[3][4] Her paternal aunt was Labour Greater London Council member Peggy Jay. She first met Peter Bottomley, her future husband, when she was 12 years old; they wed in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in southwest London, before going up to the University of Essex to study sociology (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA).\n\nShe began her working life as a social scientist and was a researcher for the Child Poverty Action Group.[5] She has also been a social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.[6]\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 general election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan),[7] as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment[8][9] and was appointed Minister of State at the Department of Health in 1989.[9] She was appointed a member of the Privy Council (PC) upon joining John Major's Cabinet as Secretary of State for Health in 1992,[10][11] becoming the ninth woman to serve in the British cabinet.[12] She served as Health Secretary until 1995.[13]\n\nBottomley and Ann Widdecombe have been listed as co-founders of Lady Olga Maitland’s pro-nuclear Women and Families for Defence group.[14]\n\nShe served as Secretary of State for National Heritage from 1995 to 1997.[11][15] During this period, she appeared in the Eurovision Song Contest 1996, wishing luck to the United Kingdom's entrant, Gina G.[16]\n\nAfter the 1997 general election, she returned to the backbenches, and become a headhunter at Odgers, where she headed and now chairs the company's Board & CEO Practice.[17]\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called.[7] On 24 June 2005 she was created a life peer with the title Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight,[11][18] the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She was on the founding Council of the University of the Arts, London. She was a Council Member of the Ditchley Foundation and was President of Farnham Castle, Centre for International Briefing. From 2000 until May 2012 she sat on the Supervisory Board of Akzo Nobel, taking over Courtaulds and then ICI. She was a non-executive director of Bupa, a healthcare company. She was on the Advisory Council of the International Chamber of Commerce UK (ICC UK) and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society[19] and a Vice-Patron of Carers and of Cruse Bereavement Care. She was a lay canon of Guildford Cathedral, and a Freeman of the City of London.\n\nIn 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006.[20] She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull since 2013.[21] She is the longest serving trustee of The Economist newspaper.[22]\n\nVirginia Garnett married Peter Bottomley in 1967, after the birth of their eldest child;[23][24] since 1975 he has been an MP.[25]\n\nDuring her time in Prime Minister John Major's cabinet, the satirical puppet show Spitting Image often portrayed Major as having an unrequited crush on Bottomley; years later, it was revealed that Major was having an affair with Edwina Currie at the time.[26]\n\nBottomley's family includes many figures in politics and public life. Her brother, Christopher Garnett, was the chief executive of train operating company GNER.[27] Her aunt Pauline married Roland Hunt who is not connected to Sir Nicholas Hunt, father of Jeremy Hunt who succeeded her as MP.[citation needed]\n\nHer cousins include Peter Jay (the former British Ambassador to the United States[28] and son-in-law to James Callaghan), and Lord Hunt of Chesterton (father of historian and former Labour MP Tristram Hunt).\n\nMore distant relatives include Lord Oakeshott of Seagrove Bay[28] and Baron Jay of Ewelme (former FCO PUSS and British Ambassador to France).\n\nJulia Cleverdon married Bottomley's late father, John.[29] Her husband's niece is Kitty Ussher (a former Labour minister).[30]\n\nReferences"}, {"url": "https://fampeople.com/cat-virginia-bottomley", "page_content": "Virginia Bottomley : biography\n\nVirginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (née Virginia Hilda Brunette Maxwell Garnett, born 12 March 1948, Dunoon, Scotland) is a British Conservative Party politician. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She was raised to the peerage in 2005. Considered to be a \"One Nation Conservative\", Bottomley is a Life Member of the Tory Reform Group.\n\nShe was a member of the Supervisory Board of Akzo Nobel NV from 2000-2012, she is currently an NED on BUPA and Smith and Nephew and a Trustee of The Economist Newspaper. As part of her pro-bono activities, Virginia is Chancellor of the University of Hull and Governor of the London School of Economics. She is a member of the UK Advisory Council of the International Chamber of Commerce. She has been Chair of the Board Practice at executive head-hunting firm Odgers Berndtson since 2000.\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon to W. John Garnett, former director of what was then called The Industrial Society, and Barbara Rutherford-Smith, former pupil of the School of St Helen and St Katharine, teacher and elected Conservative member of the Inner London Education Authority. Her aunt on her father’s side was Labour Greater London Council Member Peggy Jay. She first met Peter, now Sir Peter Bottomley her husband, when she was 12 and they married in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in south-west London, before going up to the University of Essex (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA). She began her working life as a social scientist, researcher for Child Poverty Action Group, social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She is a Governor of the London School of Economics and a Pro-Chancellor of the University of Surrey. She was on the founding Council of the University of the Arts, London. She is also a Council Member of the Ditchley Foundation and President of Farnham Castle Centre for International Briefing. From 2000 until May 2012 she has sat on the Supervisory Board of Akzo Nobel. She is a non-executive director of Bupa. She is on the Advisory Council of the and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She is a lay Canon of Guildford Cathedral, and a Freeman of the City of London. In 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull in 2013.BBC , 7 February 2013\n\nVirginia Garnett married Sir Peter Bottomley in 1967; since 1975 he has been an MP. They live in Milford, Surrey and also maintain residences in London and Worthing; they holiday on the Isle of Wight. They have three children, Cecilia, Adela and Joshua.\n\nHer brother, Christopher Garnett, is a former chief executive of the GNER railway, and Peter Jay, the former British Ambassador to the United States, is a cousin, as are Lord Hunt of Chesterton (Labour), Lord Oakshott of Seagrove Bay (Lib-Dem) and Baron Jay of Ewelme, former British Ambassador to France. Her stepmother is Dame Julia Cleverdon who married Bottomley’s father, John, late in his life.Davidson, Andrew (2007) \"\", Management Today, 28 September 2007, retrieved 2011-01-03 Her niece is Kitty Ussher (former Labour minister) and her other cousin is the Labour MP and historian Tristram Hunt and she is distantly related to Isabel Oakeshott, political editor of The Sunday Times.\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 General Election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan), as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment and was appointed Minister of State at the Department of Health in 1989. She was appointed a member of the Privy Council (PC) upon joining John Major’s Cabinet as Secretary of State for Health in 1992 and served until 1995.\n\nShe then served as Secretary of State for National Heritage from 1995 to 1997. After the 1997 general election, she returned to the backbenches, also becoming a headhunter in the charity and public sectors, now also leading the Odgers Board practice.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 General Election was called. On 24 June 2005 she was created a Life Peer with the title Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage."}, {"url": "https://www.liquisearch.com/virginia_bottomley/early_life", "page_content": "“Men and women are not born inconstant: they are made so by their early amorous experiences.”\n\n—Andre Maurois (1885\u00961967)\n\n“For Jeremy, direct, unmediated experience was always hard to take in, always more or less disquieting. Life became safe, things assumed meaning, only when they had been translated into words and confined between the covers of a book.”\n\n—Aldous Huxley (1894\u00961963)"}, {"url": "https://www.independent.co.uk/news/uk/diary-1590911.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nPoor old Virginia Bottomley. No sooner is she relieved of her mantle as bogeywoman in chief of the national Health Service - a job most people considered to be the bane of her existence - than she is transferred to the Department of National Heritage, and the jokes and anecdotes about her ignorance of cultural matters start doing the rounds.\n\nThe best story I've come across was an overheard conversation from the mid-Eighties. Mrs Bottomley encountered the academic and artistic guru Sir Claus Moser, eminent chairman of the Royal Opera House.\n\n\"So, Sir Claus, what do you do?\" inquired la Bottomley. Sir Claus explained that he had given up his work in government statistics to concentrate on looking after Covent Garden. \"How very, very interesting,\" said Virginia, vaguely recalling that the fruit and veg market had just moved to Nine Elms. \"Has it changed much since it moved south of the river?\"\n\nJohn Redwood may have lost the leadership election, but one facet of his campaign is accumulating iconic status among the Tory right. I refer to That Blazer. The monstrous multicoloured stripy number, the Old Wellingtonian's blazer donned by Tony Marlow, the Tory MP for Northampton, whose girth, alongside Teresa Gorman's emerald suit, provided the garish background scenery for Mr Redwood's historic first press conference. Astonishingly, despite the lampooning of Mr Marlow's lack of dress sense in the press, blazer sales are subsequently up at The Wellington College Shop. \"When I watched the Redwood campaign and saw the old boys' blazer, I thought it could have interesting repercussions,\" says the school's salesman, \"and, sure enough, there has been a burst of inquiries and sales. Things are looking up.\"\n\nPotential purchasers might wish to know that the blazer - which is black with yellow, light blue, orange and amber stripes - costs a mere pounds 94.99, and availability is not restricted to OWs. Despite all the criticisms, Mr Marlow tells me he thoroughly enjoyed wearing it. He has every intention of wearing it again. \"I wore it,\" he says, \"because I felt like a bit of fun. I am fed up with the tyranny of the suit.\"\n\nI have encountered for the first time Auberon Waugh, acerbic columnist and son of the late novelist and staunch Roman Catholic Evelyn Waugh. We chatted last week about the merits of audio-books, as I had recently heard and much enjoyed the tape of Scoop!, Waugh senior's masterful satire on journalism. It seems that his son, though, is unlikely ever to digest his father's prose in this aural manner. \"Unfortunately, I cannot listen to an audio-book for more than five minutes before falling asleep,\" he explained. \"It's because of my Roman Catholic upbringing.\" Pause. \"You see, I became so accustomed to falling asleep the second the priest began his sermon in church that now, anybody delivering a monologue has the same effect.\"\n\nWe may all forget about her as she wafts off into Pakistani obscurity - although I doubt it somehow - but Jemima Goldsmith, or Haiqa Kahn as she is now known, is indelibly marked on the brains of the police in Bristol, where Ms Goldsmith was a student. A former crony recalls that Jemima was recently driving in a new white convertible MG back to mundane university life after a cocktail party in London, when (presumably distracted by heady thoughts of Imran Kahn) she got confused at a roundabout. Just like Sherman McCoy in probably the most famous scene of Tom Wolfe's novel Bonfire of the Vanities, Jemima took a wrong turn. Instead of driving into the smart area of Clifton, she found herself in St Pauls, scene of the Eighties' riots and very definitely Bristol's equivalent of the Bronx. Ms Goldsmith, however, is no lily-livered, hesitant Sherman. Quick as a flash, she picked up her mobile and called for police assistance. The boys in blue arrived and escorted her all the way back home - creating a spectacle that caused certain left-wingers among the undergraduates to \"want to chuck into the nearest dustbin\".\n\nAt the launch of The Way To Win: Strategies for Success in Business and Sport, a tome by the England rugby captain Will Carling and Robert Heller, a middle-aged business consultant and writer, Heller jovially described himself to me as \"the old fart\" in the authorial process. Luckily - I turned round to check - none of the England rugby selection committee were nearby to hear him.\n\nCarling was utterly charming. I asked him for a few tips for my forthcoming wedding day, seeing that he had only tied the knot a year ago himself. \"I remember being more nervous than I've ever been for any rugby match,\" he said, \"but I did manage to absorb every bit of the day. The stag had been two nights before, so I'd had the Friday to recover - which I'd needed. We started off in Julie's restaurant in Notting Hill (where Prince Charles had his stag) and finished up in the Atlantic Bar. After that,\" he sighed and grinned, \"my memory fails me.\"\n\nChampagne corks are popping at the London offices of Sight & Sound, the monthly film magazine owned by the British Film Institute. Sales have reached an all-time high of 40,000 - not entirely, it has to be said, because of the efforts of all the staff. Aid has arrived from an unexpected source: the Australian TV soap Neighbours. \"In the last month or so we have noticed that for some inexplicable reason every time Ramsey Street's local newsagent is featured, the Sight & Sound sticker is plastered in the middle of the screen. We couldn't ask for more.\" says the magazine's marketing director, Caroline Moore, adding more soberly: \"We wouldn't have known if one of us had not been reduced to watching it in slow-motion on the video.\"\n\nSo folks, this is it. The moment you've all been waiting for. You will never have to read my guff about my wedding ever again ... it happens this Saturday. The dress is ready (to my dressmaker's horror it has had to be let out, not in), the seating plan is done, the hat for the going-away outfit is bought and, as I write this, I feel sick just thinking about the whole thing. I have not been helped by my colleagues. Last week there were incessant jests about \"lambs going to the slaughter\", \"virginal sacrifices\" and, to top it all, my present, which I found on my desk yesterday morning, is a book. Its title? How to Do Your Own Divorce. Friends ... who needs 'em?"}, {"url": "https://www.independent.co.uk/news/bottomley-admits-more-help-is-needed-for-mentally-ill-catalogue-of-failure-and-missed-opportunity-in-schizophrenic-s-treatment-led-to-killing-1396224.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nVIRGINIA BOTTOMLEY yesterday insisted action was in hand to improve treatment of mentally ill people after a damning report condemned as a 'catalogue of failure and missed opportunity' the care of Christopher Clunis, the paranoid schizophrenic who stabbed a stranger to death.\n\nThe inquiry blamed no one person, service or agency. However, it said police, psychiatrists, social workers, the Crown Prosecution Service, hostel staff, the probation service and the private sector must all share the blame for their failure to prevent Clunis killing Jonathan Zito at Finsbury Park tube station, north London, on 17 December 1992. 'It was one failure or missed opportunity on top of another.'\n\nThe inquiry, chaired by Jean Ritchie QC, found that 'the more disturbed Christopher Clunis became, the less effective was the care he received.' Its report added that the police, among others, failed to protect the public; they tended 'to overlook or minimise violent incidents' involving the mentally ill.\n\nThe inquiry stated bluntly that lack of resources and psychiatric beds was only part of the story; for deficiencies to be made good 'a considerable injection of funds' was 'the only answer'.\n\nIt also warned that 'we have heard time and again . . . Christopher Clunis is not alone, that there are many more like him living in the community who are\n\na risk either to themselves or others'.\n\nWhile backing the community care policy, it warned that some patients will always require long-term 'haven-type' care. The more than 50 recommendations include providing: special teams funded with earmarked money to supervise and support an estimated 3,000-4,000 most disturbed and difficult patients; a national register of those compulsorily detained in hospital; and a supervised discharge order so patients who fail to take medication or comply with treatment can be recalled to hospital. The Department of Health must require health authorities to set minimum standards of manpower and facilities.\n\nMrs Bottomley yesterday said she had anticipated many of the recommendations, with supervision registers starting in April, the supervision of those discharged having been agreed, but not legislated for, and a pounds 45m plan in place to provide 1,000 more medium secure beds by 1995-96.\n\nShe announced an extra pounds 10m for community-based mental health services in London from next year.\n\nHer moves do not set nationally enforceable minimum standards or create special supervision teams or meet Ms Ritchie's estimate that an increase of more than 20 to 30 per cent in inner London psychiatric beds is needed. Mrs Bottomley said she would now 'urgently consider' further action. The inquiry said 'only if the whole package is provided (will) care in the community work effectively'.\n\nJayne Zito, Mr Zito's widow, said unless all recommendations were implemented 'we cannot call ourselves a civilised society and Jonathan's murder was in vain'.\n\nThe report was welcomed by Marjorie Wallace, chief executive of the mental health charity Sane, for 'acknowledging care in the community is failing'. The National Schizophrenia Fellowship said the pounds 2bn spent on mental illness services needed to be raised by pounds 500m a year.\n\n(Photograph omitted)\n\nAnalysis, page 5\n\nLeading article, page 17"}, {"url": "https://prabook.com/web/virginia.bottomley/879699", "page_content": "Virginia Bottomley\n\ngovernment official\n\nMarch 12, 1948 England, UK\n\nMember of Parliament for Surrey South West, since 1984. Secretary, Backbench Employment Committee, 1985-1986. Secretary, All Party Social Science and Policy Committee, 1984-1986. PPS to Mr. Chris Patten, Minister of State, Dept, of Education and Science, 1985-1986 and then Minister of State, Foreign and Commonwealth Office and Minister for Overseas Development. PPS to Sir Geoffrey Howe Queen’s Counsel, Secretary of State for Foreign and Commonwealth Affairs, 1987-1988. Parliamentary Under-Secretary, Dept, of the Environment, 1988-1989. Minister of State for Health, November since 1989. Government Co-Chairwoman, Women’s National Commission, January since 1991. Professional career: researcher, Child Poverty Action Group, 1971-1973. Tutor, further education, 1971-1973. Psychiatric social worker in Child Guidance Unit, 1973-1984. Inner London Magistrate (Juvenile) 1975-1984. Chairman, Lambeth Juvenile Court, 1980-1984. Director, Mid Southern Water Company, 1987-1988. Member of Court of Governors, London School of Economics, since 1985. Freeman, City of London, since 1989."}, {"url": "https://commons.wikimedia.org/wiki/Category:Virginia_Bottomley", "page_content": "Position held\n\nMember of the House of Lords (2005–)\n\nSecretary of State for Culture, Media and Sport (1995–1997)\n\nSecretary of State for Health and Social Care (1992–1995)\n\nMinister of State for Health (1989–1992)\n\nMember of the Privy Council of the United Kingdom\n\nmember of the 53rd Parliament of the United Kingdom (2001–2005)\n\nmember of the 52nd Parliament of the United Kingdom (1997–2001)\n\nmember of the 51st Parliament of the United Kingdom (1992–1997)\n\nmember of the 50th Parliament of the United Kingdom (1987–1992)\n\nmember of the 49th Parliament of the United Kingdom (1984–1987)\n\nShadow Secretary of State for Culture, Media and Sport (1997–1997)"}]}