{"After the 1997 general election, Virginia Bottomley returned to the backbenches.": [{"url": "https://wiki2.org/en/Virginia_Bottomley", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish politician\n\nVirginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone, (née Garnett, born 12 March 1948) is a British Conservative Party politician and headhunter. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She became a member of the House of Lords in 2005.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 1 661 583 3 035\n\nBritain's Next PM? | Michael Howard, Anna Soubry, Liz Truss, Jon Lansman, Ella Whelan, David Malone\n\nSir Peter Bottomley MP | THH No Confidence in Her Majesty's Gov't | Cambridge Union (6/6)\n\nInterview with Dr Marijn Dekkers - Chairman of Unilever Transcription\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon, Scotland, to Barbara Rutherford-Smith, Jarrow hunger marcher, a teacher and elected Conservative member of the Inner London Education Authority and W. John Garnett CBE, former director of what was then called The Industrial Society, grandson of Cambridge physicist and educational adviser William Garnett and of Sir Edward Poulton, Hope professor of zoology at Oxford.[3][4] Her paternal aunt was Labour Greater London Council member Peggy Jay. She first met Peter Bottomley, her future husband, when she was 12 years old; they wed in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in southwest London, before going up to the University of Essex to study sociology (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA).\n\nShe began her working life as a social scientist and was a researcher for the Child Poverty Action Group.[5] She has also been a social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.[6]\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 general election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan),[7] as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment[8][9] and was appointed Minister of State at the Department of Health in 1989.[9] She was appointed a member of the Privy Council (PC) upon joining John Major's Cabinet as Secretary of State for Health in 1992,[10][11] becoming the ninth woman to serve in the British cabinet.[12] She served as Health Secretary until 1995.[13]\n\nBottomley and Ann Widdecombe have been listed as co-founders of Lady Olga Maitland’s pro-nuclear Women and Families for Defence group.[14]\n\nShe served as Secretary of State for National Heritage from 1995 to 1997.[11][15] During this period, she appeared in the Eurovision Song Contest 1996, wishing luck to the United Kingdom's entrant, Gina G.[16]\n\nAfter the 1997 general election, she returned to the backbenches, and become a headhunter at Odgers, where she headed and now chairs the company's Board & CEO Practice.[17]\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called.[7] On 24 June 2005 she was created a life peer with the title Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight,[11][18] the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She was on the founding Council of the University of the Arts, London. She was a Council Member of the Ditchley Foundation and was President of Farnham Castle, Centre for International Briefing. From 2000 until May 2012 she sat on the Supervisory Board of Akzo Nobel, taking over Courtaulds and then ICI. She was a non-executive director of Bupa, a healthcare company. She was on the Advisory Council of the International Chamber of Commerce UK (ICC UK) and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society[19] and a Vice-Patron of Carers and of Cruse Bereavement Care. She was a lay canon of Guildford Cathedral, and a Freeman of the City of London.\n\nIn 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006.[20] She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull since 2013.[21] She is the longest serving trustee of The Economist newspaper.[22]\n\nVirginia Garnett married Peter Bottomley in 1967, after the birth of their eldest child;[23][24] since 1975 he has been an MP.[25]\n\nDuring her time in Prime Minister John Major's cabinet, the satirical puppet show Spitting Image often portrayed Major as having an unrequited crush on Bottomley; years later, it was revealed that Major was having an affair with Edwina Currie at the time.[26]\n\nBottomley's family includes many figures in politics and public life. Her brother, Christopher Garnett, was the chief executive of train operating company GNER.[27] Her aunt Pauline married Roland Hunt who is not connected to Sir Nicholas Hunt, father of Jeremy Hunt who succeeded her as MP.[citation needed]\n\nHer cousins include Peter Jay (the former British Ambassador to the United States[28] and son-in-law to James Callaghan), and Lord Hunt of Chesterton (father of historian and former Labour MP Tristram Hunt).\n\nMore distant relatives include Lord Oakeshott of Seagrove Bay[28] and Baron Jay of Ewelme (former FCO PUSS and British Ambassador to France).\n\nJulia Cleverdon married Bottomley's late father, John.[29] Her husband's niece is Kitty Ussher (a former Labour minister).[30]\n\nReferences"}, {"url": "https://www.islandlifemagazine.co.uk/virginia-my-passion-for-island/", "page_content": "In her 10 years as a Cabinet Minister Virginia Bottomley was one of the most powerful women in British politics. But even she will admit she didn’t quite carry the clout of the woman who virtually ordered her to become a Member of Parliament – none other than former Prime Minister, ‘Iron Lady’ Margaret Thatcher.\n\nDuring her decade at the cutting edge of Government, and in all during her 21 years as a serving MP, Virginia never lost sight of the education of life and good values that were instilled into her as a young girl growing up, for the most part, here on the Island.\n\nDespite being born in Scotland, simply because her father was working there at the time, she, along with numerous family members, calls the Island her home. She is here as often as she can be, despite now being an active member of the House of Lords as Baroness Bottomley of Nettlestone, as well as working as a head-hunter for a high-profile company in London. She chairs the Odgers Berndtson Board & CEO Practice, which conducts searches for Chairmen, CEOs and non-executive directors for plcs and private companies.\n\nDuring a break away from life in the fast lane that she still enjoys, Virginia took time out to give ‘Island Life’ readers an insight into her interesting and rewarding career as an MP, and her love of the Island.\n\nShe revealed: “My great grandfather Sir Edward Poulton came to St Helens Cottage in about 1890, and in 1915 he gave St Helens Common to the National Trust. My other grandfather Dr. William Garnett bought a house in Seagrove Bay around 1900.\n\n“My grandparents met playing hockey in Priory Bay, and we still play hockey there, so the family have been doing that for more than 100 years. All my family were quite academic and very involved in public policies. Dr William Garnett was involved in introducing education to London as one of the original signatories of the London School of Economics where I studied, so I am very proud of him.”\n\nHer family bought half of Priory Bay in 1926, and the family home was built the following year. Since then the whole family has been down here constantly, with often as many as 100 relations gathering in the summer.\n\nVirginia points out: “We all share a passion for the Island. As a young girl I remember we had these appalling traditions, so every Easter Monday we would walk from Horestone Point to Whitecliff Bay – again a walk that was started by my great grandfather in 1890. The other tradition is swimming to St Helens Fort. My great uncles who were killed in the First World War did it, and I swam to the Fort when I was 10 years old.\n\n“Another childhood memory was when we loaded up the dinghies and drove to Freshwater and then rowed around and had a picnic in Scratchells Bay. Another time we had a running race from Freshwater to home. We really went for it, and couldn’t move for a week afterwards. It was a competitive environment.\n\n“When we were young Priory Bay was quite distant from Ryde because people didn’t have cars and we went everywhere by boat. I think we learned a great resilience. Sometimes the tide and wind are against you and you make no progress. On other occasions you have the tide and wind with you, and even though you don’t make much effort you travel like a rocket. I think that is the most wonderful lesson for life – sometimes you work so hard and it doesn’t happen, but other times you just sail through it.”\n\nVirginia recalls one of the most influential people in her life was her ‘very special’ aunt Peggy Jay. She said: “She was in politics and had a massive influence on me, and I say my husband Peter only married me because he thought I would turn out like Peggy Jay. She was a member of the Greater London Council, and was forceful. She was a great reformer and campaigner. She was brought up on the Island, and was a wonderful mentor.”\n\nDespite being married to a Tory MP, Virginia had never given much thought to joining him in the Commons. Then one day her whole life changed when she received a call from 10 Downing Street, on the orders of PM Margaret Thatcher, saying more female MPs were required, and she was on the ‘wanted list’.\n\nShe continued: “I decided Peggy Jay should have been an MP, but she wasn’t so I would be. I wanted Peter to be the MP for the Isle of Wight long ago, and then in 1982 it came up for the following year’s General Election. I worked so hard and actually got 34,900 votes – only five people in the country got more votes than I did, but one of those was Liberal Stephen Ross, the sitting MP, who beat me.\n\n“I was devastated. The campaign was ‘Turn Wight Blue’ and Mrs. Thatcher even came over to visit. The day after I had lost she rang me to say ‘what bad luck’ and I burst into tears. But it made me realise much more about the Island; the huge delights, but also some of the difficulties and dilemmas.\n\n“I learned how hugely entrepreneurial and creative the Island is with lots of small businesses and so many dedicated people. We all hope it can become an Island of real enterprise and creativity in small businesses. With modern technology, distance working and IT, my senses are that it is going to become ever more possible to realise this vision. The Island really has everything going for it.\n\n“Whatever I have done, I have always felt part of my energy was put into developing and promoting the Island in any way I could. The Island needs all the help it can get to make people realise what a wonderful and exciting place it is.”\n\nVirginia became MP for South West Surrey in 1984. There were 365 applicants to be the Tory candidate, but she was chosen and subsequently won the seat. She said: “At the time there were just 23 women MPs in a House of Commons of more than 600, so we were like an endangered species. Now the ratio is about one in four. I loved the constituency life and being involved in every aspect.”\n\nInitially she served under Margaret Thatcher and then John Major, and received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment. She was appointed Minister of State at the Department of Health in 1989, and was appointed a member of the Privy Council upon joining Major’s Cabinet as Secretary of State for Health in 1992, serving until 1995.\n\nShe then served as Secretary of State for National Heritage until 1997. After the 1997 General Election, she returned to the back benches, saying: “I had been working 24 hours a day, seven days a week, and returning to the back benches enabled me to re-connect with my family. After 10 years I felt I had done my time and needed my life back.”\n\nLooking back on her 10 years as a Minister, Virginia recalls: “Mrs. Thatcher called me one day to see her on a Monday, which was unusual. I said I was busy and could it be later in the week. But I was summoned and she offered me a job as a Minister. I was so surprised. She wanted me to go to Environment, but I had only ever spoken about Defence, Agriculture or transport, and knew nothing about it.\n\n“She replied very smartly that I would have to read up on it! It was very interesting getting people to use unleaded petrol, and recycle. But I loved being Secretary of State for Health because it was so demanding and intense. It was a job where I had a real role with serious responsibilities. I had to take difficult decisions, so I had to be courageous and tenacious to survive.“When I first became a Minister I had a very bright young man in Central Office. He was 23 and used to coach and brief me when I went on television’s ‘Question Time’. He was a very clever, positive person, and his name was David Cameron!”\n\nThat is one of the main reasons why Virginia is very supportive of the present team, even though she believes coalition must be ‘incredibly frustrating, compromising and complex’.\n\nAfter quitting the Cabinet Virginia continued to work closely with Tory leaders William Hague, Ian Duncan Smith and Michael Howard. It was Howard who put her in the House of Lords in 2005. She said: “I was absolutely delighted, and it was unexpected. Some of the debates in the Lords are phenomenal, and it will be a great loss if it goes. But I accept it is hard to justify.”\n\nVirginia added: “I am someone who is constantly restless, so I am never really satisfied. I have been married coming up 45 years to the same person, and that is something that gives great strength. But if you can find a role in life that in your way plays to your strengths and minimises your many failings then you are privileged.”"}, {"url": "https://academickids.com/encyclopedia/index.php/Virginia_Bottomley", "page_content": "From Academic Kids\n\nThe Right Honourable Virginia Hilda Brunette Maxwell Bottomley (born March 12, 1948), née Garnett, is a British Conservative Party politician. She was a Member of Parliament from 1984 to 2005 and was considered to be a 'One Nation Conservative'.\n\nShe studied at the London School of Economics. She was a researcher for Child Poverty Action Group and then became a social worker and a magistrate (Justice of the Peace).\n\nShe was elected to Parliament in a by-election in 1984, as the Member for Surrey South West, and received her first ministerial position in 1988, as junior Environment minister, and was appointed Minister of Health in 1989. She become a member of the Privy Council, and joined John Major's cabinet, serving as Secretary of State for Health from 1992 to 1995, and then Secretary of State for National Heritage from 1995 to 1997. After the 1997 general election, she returned to the backbenches also becoming a headhunter for the charity and public sectors. She stepped down from the House of Commons before the 2005 general election\n\nShe is also involved with charitable and academic bodies. She is a Governor of the London School of Economics and the University of the Arts, London. She is also a Council Member of the Ditchley Foundation and President of Farnham Castle Centre for International Briefing. She is on the Advisory Council of the International Chamber of Commerce UK and the Judge School of Management, Cambridge. Virginia is a trustee and fellow of the Industry and Parliament Trust. She is National President of the Abbeyfield Society and a Vice-Patron of Carers and Cruse. She is a lay Canon of Guildford Cathedral, and a Freeman of the City of London.\n\nShe married Peter Bottomley in 1967; since 1975 he has been an MP. Her brother, Christopher Garnett, is the chief executive of the GNER railway, and Peter Jay, the former British Ambassador to the United States, is a cousin.\n\nOn 13 May 2005 it was announced that she would be created a life peer.\n\n\n\n"}, {"url": "https://en-academic.com/dic.nsf/enwiki/196731", "page_content": "Infobox Politician\n\n\n\n\n\nhonorific-prefix = The Right Honourable\n\n\n\nname = Virginia Bottomley\n\nhonorific-suffix =\n\nThe Baroness Bottomley of Nettlestone, PC, DL\n\n\n\nbirth_date = birth date and age|1948|03|12|df=y\n\nbirth_place = Dunoon , Scotland , UK\n\noffice = Secretary of State for National Heritage\n\nterm_start = 5 July , 1995\n\nterm_end = 2 May , 1997\n\nprimeminister = John Major\n\npredecessor = Stephen Dorrell\n\nsuccessor = Chris Smith\n\noffice2 = Secretary of State for Health\n\nterm_start2 = 9 April 1992\n\nterm_end2 = 5 July 1995\n\npredecessor2 = William Waldegrave\n\nsuccessor2 = Stephen Dorrell\n\nreligion = Anglican\n\nparty = Conservative Party\n\nVirginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone PC DL, \"née\" Virginia Garnett (born 12 March 1948 in Dunoon , Scotland), is a British Conservative Party politician. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005 and was considered to be a ' One Nation Conservative '. Virginia is a Life Member of the Tory Reform Group .\n\nEarly life\n\nVirginia was born to W. John Garnett, ex-director of what was then called The Industrial Society, and Barbara Rutherford-Smith, teacher and elected member of the Inner London Education Authority. Virginia's father's sister was Peggy Jay , of the Labour dynasty . Virginia was educated at Putney High School , and later graduated from the University of Essex before her Master's at the London School of Economics . She was a social scientist, researcher for Child Poverty Action Group , social worker , magistrate ( Justice of the Peace ), and chairman of the Inner London Juvenile Court.\n\nMember of Parliament and In government\n\nShe was elected to Parliament in a by-election in 1984, as the Member for South West Surrey, received her first ministerial position in 1988 as junior Environment minister and was appointed Minister of Health in 1989. She become a member of the Privy Council, and joined John Major 's cabinet, serving as Secretary of State for Health from 1992 to 1995, and then Secretary of State for National Heritage from 1995 to 1997. After the 1997 general election, she returned to the backbenches also becoming a headhunter in the charity and public sector s, now also leading the Odgers Board practice.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called. On June 24 2005 she became a life peer with the title Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nShe is also involved with charitable and academic bodies in addition to business. She is a Governor of the London School of Economics and a Pro Chancellor of the University of Surrey . She was on the founding Council of the University of the Arts, London . She is also a Council Member of the Ditchley Foundation and President of Farnham Castle Centre for International Briefing. Since 2000 she has sat on the Supervisory Board of Akzo Nobel . She is a non executive director of BUPA. She is on the Advisory Council of the International Chamber of Commerce UK and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She is National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She is a lay Canon of Guildford Cathedral , and a Freeman of the City of London . In 2006, she was elected and installed as Chancellor of the University of Hull , succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year.\n\nVirginia Garnett married Peter Bottomley in 1967, six years after they met; since 1975 he has been an MP. They live in Milford, Surrey .\n\nHer brother, Christopher Garnett , is a former chief executive of the GNER railway, and Peter Jay , the former British Ambassador to the United States , is a cousin, as are Lord Hunt of Chesterton (Labour) and Lord Oakshott of Seagrove Bay (Liberal)."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-030-14288-9_12", "page_content": "‘Watch out, boys – they’re coming. From now on, the House of Commons will no longer be a men-only club’. 1 One hundred and one Labour women won seats as MPs in the 1997 general election . 2 There had never been so many women in Parliament, let alone from one political party. Inevitably, the press could not resist a bit of sexism and the women MPs soon came to be dubbed ‘Blair’s Babes’. Blair himself did not escape scot-free: newspapers referred to him as ‘Bambi’ for quite some time. Neither Labour nor women were seen as natural rulers by the largely Conservative press.\n\nTony Blair can claim little credit for the dramatic increase in the number of women MPs in the 1997 election. Exasperated by the overwhelming male Parliament, women took action. In 1980, Lesley Abdela set up the 300 Group, a cross-party organisation dedicated to getting women into Parliament. The group put on staged debates in the House of Commons and ran courses around the country to help train women in the art of presenting themselves. In 1987, the number of women MPs increased to 41 (21 Labour) and in 1992 to 60 (37 Labour). It was still not enough—women remained grossly under-represented in the House of Commons . The Labour Party , historically committed to women’s equality, decided it ‘must give immediate attention to developing a strategy’ for encouraging women to enter Parliament. 3 It recommended a five-point programme: to make the party aware of the disproportionately small number of women in public life; to have a discussion on the problems women faced in getting elected; to promote an intensive education and training programme; and to encourage constituency labour parties to include women on selection lists. 4 At the 1982 party conference, female delegates proposed that every constituency be compelled to include at least one woman on their shortlist for the selection of its parliamentary candidate: the larger trade unions voted against and the motion failed.\n\nAfter yet another defeat in 1987, Clare Short initiated ‘a quiet revolution … inspired by the need for Labour to win more women’s votes, the need to regenerate the party and to improve women’s representation in public life’. 5 The Labour leadership set about introducing quota systems to select women at local party and executive levels. In 1992, following another electoral defeat, the Women’s Committee recommended that all-women shortlists be adopted, a resolution which was passed a year later at the Labour Party Conference. ‘It is clear’ Short argued in her Briefing for MPs ‘that the selection process so far has excluded women, especially in the most winnable seats. Increasing women’s representation in parliament is essential if we are to build a House of Commons which more truly represents the whole population. As more women come into the Commons, the culture will change, the agenda of politics will broaden, and the institution itself will be transformed’. 6 There was strong opposition to all-women shortlists: in 1995, Tony Blair announced he would abandon the policy after the 1997 election; in 1996, an industrial tribunal found that all-women shortlists contravened the 1975 Sex Discrimination Act by precluding men. Both Blair and the tribunal were thwarted. In 2002, Labour now the party of government introduced the Sex Discrimination Act which permitted positive discrimination in the selection of candidates.\n\nIn 1997, Tony Blair appointed five women to his first Cabinet. Margaret Beckett , 7 Harriet Harman , 8 Mo Mowlam , 9 Clare Short 10 and Ann Taylor 11 were all experienced politicians, all elected to Parliament before Blair took office and most importantly all members of the Shadow Cabinet . A few years earlier, encouraged by the then Labour leader Neil Kinnock , women MPs had pressed for a minimum of 4 women to be elected by the Parliamentary Labour Party to serve in the Shadow Cabinet. Critics within the party called their proposal a ‘tart’s charter’, a ‘skirt too far’ and fiercely opposed it. In 1993, the policy was adopted and MPs were required to vote for at least four women to the Shadow Cabinet . In July 1996, just one year before the general election , expectations were surpassed when five women were elected: Margaret Beckett , Ann Taylor and Clare Short came top of the polls, beating all the men on a list which included Robin Cook, Gordon Brown and David Blunkett. Mo Mowlam and Harriet Harman were also elected. Tony Blair , his freedom of action circumscribed by party expectations, dutifully promoted all five women . Never before had so many women served together as Cabinet Ministers ; not all of them continued in the post.\n\nWomen’s political participation had certainly improved since the beginning of the twentieth century: in 1900, women could not vote, let alone become MPs or Cabinet Ministers. In 1929, when Margaret Bondfield became the first-ever female Cabinet Minister, it was only 11 years after women over 30 gained the vote, only 10 years after the first woman took her seat in Parliament and only one year after women could vote on the same terms as men. Many hoped, and some feared, for an upward trajectory, but after Bondfield resigned, it took 14 years for a second woman—Ellen Wilkinson —to be appointed to Cabinet. When Wilkinson died in 1947, women had to wait even longer—17 years—to hold high office in a Labour Government . In 1964, when Harold Wilson became Prime Minister , the country was on the brink of a sexual revolution which in turn generated a new awareness of gender inequality. Three women—Barbara Castle , Judith Hart and Shirley Williams —served as Labour Cabinet Ministers in the 1960s and 1970s. After Callaghan’s defeat in 1979 and Thatcher’s election, it took 18 years for the Conservative political hegemony to be overturned and thus for Labour women to occupy Cabinet posts. By the time, Blair became Prime Minister in 1997 women’s place in the political workforce was established, helped by the fact that the Labour Party had taken action to improve women’s electoral opportunities. Naturally, the story of women Cabinet Ministers is inextricably related to the fortunes of their party: in the twentieth century, Labour was in government for 23 years, during which time 11 women were appointed to Cabinet posts. Labour had a significantly better record of promoting women than the Conservatives : during the same period, Conservative Prime Ministers —who were in government for far longer—appointed only five women. 12 Six Conservative Prime Ministers —Andrew Bonar Law, Stanley Baldwin , Neville Chamberlain , Anthony Eden , Harold Macmillan and Alec Douglas-Hume—appointed no women at all. Margaret Thatcher appointed one in her first Cabinet, but none in her later ones. 13\n\nThe election of 101 Labour women and the promotion of five of them to the Cabinet was some sort of progress to be sure. But is the job done merely because a number of women are elected to Parliament and chosen for leading positions? Obviously, the answer is no. Labour women are needed, not just because they make the House of Commons more representative of the country at large, but because they bring a different perspective to politics. As we know, the Labour Party was formed as a party to represent the interests of the working class. Both male and female Labour MPs had a class consciousness: they fought for better pay and working conditions, for health services, for education, better housing and other social and economic developments which benefitted the majority of the British population not just the wealthy. In addition, the Labour Party was—and is—committed to equal rights for women , though it has often been women who have set the agenda and who have fought for women’s needs to be taken into account.\n\nThe first five Labour women Cabinet Ministers made a mark out of all proportion to their numbers. These Cabinet Ministers were strong, determined and effective women—socialist women —who in various ways helped improve the lives of their own sex: for example Margaret Bondfield’s work as a trade unionist improved the lives of working-class women 14 ; Ellen Wilkinson’s outspoken commitment to equal suffrage helped gain women the vote on the same terms as men; Barbara Castle’s dedicated advocacy of equal pay resulted in the Equal Pay Act; Judith Hart’s focus on rural development helped women in British colonies and protectorates overseas, often the poorest in poor societies; and Shirley Williams ’ efforts to keep down prices in the turbulent 1970s made a significant difference to working-class women trying to balance their household budgets.\n\nIn 1997, for the first time in parliamentary history, there were more than two women in the Cabinet. This is not the place to discuss the achievements of these women—another book is needed here—but all broke through the political glass ceiling. Margaret Beckett was the first woman appointed President of the Board of Trade, then to Leader of the House of Commons ; Harriet Harman became Secretary of State for Social Security and the first-ever Secretary of State for Women; Mo Mowlam became the first woman to hold the post of Secretary of State for Northern Ireland ; Clare Short was the first Secretary of State for International Development; and Ann Taylor was the first woman to serve as Leader of the House of Commons , the first to serve as Lord President of the Privy Council and the first to serve as Chief Whip. In 1998, Margaret Jay, daughter of Jim Callaghan , was appointed the first woman Leader of the House of Lords . 15 Most of these women considered themselves feminists, two of them well known for campaigning for women’s rights . 16\n\nWith greater numbers of women both in Parliament and in Cabinet, there was renewed hope for women’s equality. In her first major speech after the election, Harriet Harman announced that a turning point for women had now been reached, claiming that the government was committed to ‘building and sustaining a new habit of governance that has women’s voices and women’s interest at its very heart’. 17 Jesse Phillips , elected in 2015 as MP for Birmingham Yardley, was 16 years old in 1997. She spoke of how she grew up in a Labour world where there were free nursery places, Sure Start, tax credits, children’s savings accounts, maternity leave, paternity leave, attendance allowances, improved hospitals, better educational facilities and improved health care. 18 All these policies had a major impact on the lives of women. Phillips said that ‘the list of things those women rose to their feet from the green benches to demand for girls like me meant everything’. 19 Labour also brought in the minimum wage, a policy advanced by Clare Short and the leading trade unionist Rodney Bickerstaffe . 20 Certainly, many of the newly elected women MPs spoke of putting forward a new political agenda that focussed on women’s issues such as childcare, education, equal opportunities, violence against women, women’s health and family law. 21\n\nHowever, it was not at all ‘bread and roses’, a term used in a speech by a friend of Margaret Bondfield in which she urged that ‘the worker must have bread, but she must have roses too’. In reality, the newly elected female MPs had an ‘immediate effect of introducing an inexperienced group of women to an intensely competitive masculine environment’. 22 It also, according to Germaine Greer, produced a ‘biddable House of Commons ’ full of naïve women who could be manipulated more easily than seasoned politicians like the women Cabinet Ministers . 23 This new intake of Labour women was regarded, as numbers of trade union -sponsored MPs had been before them, as lobby fodder who could be relied upon to vote for the government, especially one which demanded strong party discipline. When Harriet Harman proposed to cut benefits to some single parents, a cut which would largely affect the poorest women in society, Donna Covey, a union official in the GMB, criticised Labour women MPs who supported the cuts arguing that ‘they had no right to get elected on the back of women-only shortlists and then vote for anti-women policies’. 24 The policy proved to be hugely unpopular: it remained in force, but Harriet Harman left the Cabinet.\n\nDespite these setbacks, it was hoped that the election of so many women would herald an irreversible advance of women into politics which in turn would change the nature of parliamentary politics. Senior Labour women prophesied that the culture of the House of Commons would undergo a radical overhaul because the number of women MPs had more than doubled. ‘Any male institution’ it was predicted ‘can survive more or else unchanged as long as the proportion of women within it remains small. But there comes a point at which the minority becomes large enough to influence the majority, and, through them, the institution itself, in much more effective ways. … They will rewrite the agenda and the language of politics’. 25\n\nThese newly appointed women Cabinet Ministers were all too aware that their political forbears had worked in an overwhelmingly male environment not just within the Cabinet but within Parliament the civil service and the wider world. Four of them—Margaret Bondfield , Ellen Wilkinson , Barbara Castle and Shirley Williams —experienced being the only woman in the Cabinet; Ellen Wilkinson twice faced being the only woman on the opposition benches. All were subjected to sexist behaviour of one form or another, ranging from comments about their appearance to unwanted sexual advances from colleagues and equals. Moreover, all were expected to respond amicably to such conduct or be classified as sour, grim and humourless.\n\nJournalists had often noted the ‘extreme school-boyishness of the House of Commons with its public-school rules, gangs, drinking and shouting’. 26 Jo Richardson, at one time Labour’s spokesperson on women , complained that when ‘it’s a special debate to do with women , yahoos tend to come into take the mickey. It makes me so angry. It’s so juvenile’. 27 In 1997, there was real hope that such a huge increase in the numbers of women would bring a change to the ‘yah-boo’ culture of the Commons and with it a ‘softer, more gentle style of politics’. 28 However, the election of so many women appeared to make little difference: in 2009, the Times remarked that the House of Commons ‘with its baying and bellowing, remains a place of men, shaped by men’. 29 Anyone watching Prime Ministers ’ Question Time today will witness adults shouting and baying at each other across the floor of the House of Commons . Such conduct may be acceptable to members of the Bullingdon Club or the Piers Gaveston Society, but if teenagers behaved in this unruly way in school, they would be excluded from the class and reprimanded. 30 Appalled by the ill-mannered conduct of MPs in the Commons, a petition in 2018 asked for ‘no shouting or jeering whilst an MP is speaking. We feel that this is unsatisfactory behaviour and unbecoming of a member of parliament. MPs should act in a manner that is expected in boardrooms and classrooms across the country’. 31 The petition was rejected, but the question remains: if so many MPs show such little respect to other politicians, how can the rest of the country in turn respect them?\n\nHistorically, the Labour Party has rarely wavered in its commitment to women’s equality: it appointed the first-ever female Minister, the first-ever female Cabinet Minister and resolved women’s under-representation in Parliament by positive action. Given its commitment to women’s equality, it is surprising that no woman has ever been elected Leader, let alone Prime Minister . Between 1918 and 2000, there were 156 female Labour MPs and eleven Cabinet Ministers , yet no woman reached the very top position in politics. Three of the first five women Cabinet Ministers—Barbara Castle , Judith Hart and Shirley Williams —were tipped by newspapers to become Labour leader and Britain’s first female Prime Minister . None of the three achieved this. In fact, not one of these women put herself forward to stand as Labour leader, an obvious prerequisite for the premiership should the party be elected.\n\nIn 1994, the tragic death of John Smith swept Margaret Beckett into becoming the Labour Party’s first female leader, albeit in an acting capacity. It was an accident, rather than a job she seemed destined to take, and her chance of seizing the ultimate prize was seen as slim. When the elections took place, Beckett became the first-ever woman to stand for the leadership of the party: she came third, beaten by John Prescott and Tony Blair . At the time, the Labour Party Leader was chosen by three separate electorates: MPs, affiliated societies, which were mainly trade unions , and constituencies. In the first category, only thirteen out of 37 women MPs and 28 men out of 327 voted for Beckett . 32 Twenty women and 178 men voted for Blair , 4 women and 60 men for Prescott. Overall Beckett only received 18.9% of the MPs vote. Beckett also did badly in the other two electorates, receiving 19.3% of the vote from the affiliated societies and only 17.4% from party members. Tony Blair won 57% of the overall vote.\n\nIn 2007, when Blair stood down, Gordon Brown was elected uncontested. After an electoral defeat in 2010, Brown resigned and five MPs: Diane Abbot, Ed Balls, Andy Burnham, David Miliband and Ed Miliband stood for election. Abbot, who was the first black woman to take her seat in the House of Commons , stood in the leadership election only to be eliminated in the first round, winning only 7 votes from MPs, whereas David Miliband won 111. 33 Only two female MPs—Katy Clark and Linda Riordan—voted for Abbott. Ed Miliband, who had garnered more trade union votes, won and became Leader of the Labour Party . His tenure was not to last. In May 2015 when Labour lost yet again, Ed Miliband stood down, Harriet Harman became Acting Leader, and new leadership elections were held. For the first time in Labour history, two women , Yvette Cooper 34 and Liz Kendall, 35 stood as candidates. Harriet Harman did not. This time only members of the Labour Party , registered supporters and affiliated supporters could vote. The two women came bottom of the poll—Yvette Cooper with 71,928 votes and Liz Kendall with 18,857—probably rejected as much for their close association with Blairism than because they were women. Jeremy Corbyn won overwhelmingly with 251,417 votes, the first leader to be elected by one member, one vote. The power of the PLP and the trade unions to choose the leader of the Labour Party had disappeared.\n\nA year later, Corbyn’s leadership was challenged by Angela Eagle 36 and Owen Smith. Eventually, Eagle stood down leading to a contest between two white men. Some criticised the Labour Party for allowing a strong female contender to withdraw in favour of Owen Smith. A toxic masculinity was blamed. One female journalist insisted that ‘the lingering backwash of the patriarchal world of industry, trade unionism and smoke-filled constituency rooms, which did for Barbara Castle all those years ago, had one more outing, felling a candidate who would have stood head and shoulders above her rivals in any general election ’. 37 However, this analysis is inaccurate as trade unions , and the Labour Party had jointly led the way in advancing women’s political participation throughout the centuries. Moreover, in 2017 electoral procedures had changed dramatically, giving individual members overwhelming command and the PLP and trade unions a drastically reduced role in leadership elections. Once more, principles rather than gender prevailed: Labour Party activists—men and women —wanted a leader willing to return to what was they saw as a purer version of socialism . Corbyn was re-elected with an overwhelming majority.\n\nThis is a story without an ending. In 2018, Harriet Harman suggested that the next leadership election should be a woman-only contest in order to give the Labour Party its first female leader. Her comments were ridiculed, just as woman-only shortlists had been in the twentieth century and just as the suggestion that women could vote and even become MPs had been in the century before that. Despite being mocked, women had always fought for justice and equality: the many unknown women who campaigned and suffered to win the vote for women set the drama of women in politics in motion, a drama that will never, can never be finished. But what is certain is that the five women Cabinet Ministers in this book stand proud in the Labour tradition of trying to create a more fair and equal society. Collectively, they helped make Britain and other parts of the world a better place for all, not just for the privileged.\n\nFormalPara\n\n1. Fran Abrams, The Independent, May 3, 1997, p. 8. 2. In contrast, only 13 Conservative women were elected. 3. Women Candidates May 1979— General Election , Private and Confidential Memo, NEC July 25, 1979. 4. Women Candidates May 1979—General Election, Private and Confidential Memo, NEC July 25, 1979. 5. Clare Short , ‘Women and the Labour Party’ in Joni Lovenduski and Pippa Norris, Women in Politics, OUP, 1997. 6. Judith Squires ‘Quotas for Women : Fair Representation’, in Joni Lovenduski and Pippa Norris, Women in Politics, 1997. 7. As Secretary of State for Trade and Industry and President of the Board of Trade (later Lord President of the Council and Leader of the House of Commons ). 8. As Secretary of State for Social Security and Minister for Women. 9. As Secretary of State for Northern Ireland (later Cabinet Office Minister and Chancellor of the Duchy of Lancaster). 10. As Secretary of State for International Development. 11. As Lord President of the Council and Leader of the House of Commons (later Chief Whip). 12. Florence Horsburgh 1953–1954, Margaret Thatcher 1970–1954, Lady Young 1981–1953, Gillian Shephard 1992–1997 and Virginia Bottomley 1992–1997. 13. Janet Young, Baroness Young was created a life peer in 1971 and so sat in the House of Lords . She joined the Cabinet in September 1981 and remained there until June 1983. 14. ‘Makers of the Labour Movement’, The Labour Magazine, October 1923. 15. She attended Blackheath Grammar School in spite of the fact that her father had promoted comprehensives. 16. Margaret Beckett has said she was a feminist and regards the term as a ‘title of honour’; both Clare Short and Harriet Harman have championed women’s rights ; Ann Taylor pushed through legislation to change working hours in the House of Commons , a policy which was seen to help women . There were exceptions: in 1998, Baroness Jay insisted that she was not a feminist. She was roundly condemned by feminist journalists who saw her as betraying women who had transformed the political landscape and in doing so had helped Jay succeed. 17. Quoted in Helen Jones, Women in British Public Life, 1914–1950, Longman, 2000, p2. 18. Jesse Phillips , ‘Conclusion: Kicking Away the Stumbling Blocks’, in Sally Keble (editor), This Woman Can, Fabian Society , 2017, p. 89. 19. Jesse Phillips , ‘Conclusion: Kicking Away the Stumbling Blocks’, in Sally Keble (editor), This Woman Can, Fabian Society, 2017, p. 89. 20. In 1968 Barbara Castle set up a committee to examine the introduction of a minimum wage. If Labour had passed a law about 75% of women would have benefited and 10% of men. 21. See Sarah Childs, ‘The New Labour Women MPs in the 1997 British Parliament: Issues of Recruitment and Representation’, Women’s History Review, Vol. 8, No. 1, 2000 for an analysis of this. 22. Germaine Greer, ‘Women in Parliament’, in Andrew Duff (editor), Making the Difference: Essays in Honour of Shirley Williams , Biteback, 2010, p. 32. 23. Ibid. 24. Sally Keble (editor), This Woman Can, 2017. 25. The Guardian, April 15, 1995, p. 23. 26. Lesley Abdela , The Guardian, June 30, 1989, p. 11. 27. Ibid. 28. Sarah Childs, ‘The New Labour Women MPs in the 1997 British Parliament: Issues of Recruitment and Representation’, Women’s History Review, Vol. 8, No. 1, 2000, p. 67. 29. The Times, April 29, 2009, p. 2. 30. The Bullingdon Club is an all-male dining club for Oxford University students. Many local restaurants refuse to host their dinners because of its reputation for vandalising properties and creating mayhem. In 2005, members of the club smashed 17 bottles of wine, every single piece of china and window at a pub near Oxford . Since 1927, when it smashed 400 windows in Christchurch College, it has been banned from meeting within a 15-mile radius. The Piers Gaveston Society is an exclusive men-only club, known for its ostentatious decadence. While being initiated into the Piers Gaveston Society, David Cameron was accused of putting a private part of his anatomy into a dead pig’s head. 31. Petition submitted February 2, 2018. 32. Diane Abbott, Margaret Beckett , Jean Corston, Angela Eagle, Maria Fyfe, Mildred Gordon, Helen Jackson, Lynne Jones, Alice Mahon, Dawn Primarolo, Barbara Roche, Clare Short and Audrey Wise voted for Margaret Beckett . 33. Diane Abbott was first elected in 1987 for Hackney North and Stoke Newington. Born to parents from Jamaica—her father was a welder, her mother a nurse—she gained a place at grammar school and then at Cambridge University where she read History. 34. Yvette Cooper was part of the Labour elite. Her father was General Secretary of the Prospect trade union ; her mother was a maths teacher. She attended a comprehensive school before going to read PPE at Oxford , where she gained a first-class honour. In 1997, she became an MP for Pontefract and Castleford. In 2008, she was appointed to the Cabinet as Secretary of State for Work and Pensions. 35. Liz Kendall’s father was a senior Bank of England official; her mother was a primary school teacher. She attended grammar school , then Cambridge where she read History. In 2010, after a time working in government departments, she was elected MP for Leicester West. 36. Angela Eagle’s father was a print worker and her mother a factory worker. She attended a grammar school and then read PPE at Oxford University. In 1992, she was elected as MP for Wallasey. In 1997, her twin sister joined her in the Commons. 37. Anne Perkins , The Guardian, July 19, 2016.\n\nNotes"}, {"url": "https://www.howold.co/person/virginia-bottomley/biography", "page_content": "Virginia Bottomley Biography\n\nBritish politician\n\nPersonal detailsBorn (1948-03-12) 12 March 1948 (age:75)Dunoon, ScotlandPolitical partyConservativeSpousePeter Bottomley ​(m.:1967)​ChildrenJosh · Cecilia · AdelaEducationPutney High SchoolAlma materUniversity of Essex (BA)London School of Economics (MA)SignatureWebsiteOfficial websiteVirginia Bottomley's voicefrom the BBC Front Row, 25 April 2013\n\nVirginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone, PC DL (née Garnett, born 12 March 1948) is a British Conservative Party politician and headhunter. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She became a member of the House of Lords in 2005.\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon, Scotland, to Barbara Rutherford-Smith, Jarrow hunger marcher, a teacher and elected Conservative member of the Inner London Education Authority and W. John Garnett CBE, former director of what was then called The Industrial Society, grandson of Cambridge physicist and educational adviser William Garnett and of Sir Edward Poulton, Hope professor of zoology at Oxford. Her paternal aunt was Labour Greater London Council member Peggy Jay. She first met Peter Bottomley, her future husband, when she was 12 years old; they wed in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in southwest London, before going up to the University of Essex to study sociology (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA).\n\nShe began her working life as a social scientist and was a researcher for the Child Poverty Action Group. She has also been a social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 general election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan), as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment and was appointed Minister of State at the Department of Health in 1989. She was appointed a member of the Privy Council (PC) upon joining John Major's Cabinet as Secretary of State for Health in 1992, becoming the ninth woman to serve in the British cabinet. She served as Health Secretary until 1995.\n\nBottomley and Ann Widdecombe have been listed as co-founders of Lady Olga Maitland’s pro-nuclear Women and Families for Defence group.\n\nShe served as Secretary of State for National Heritage from 1995 to 1997. During this period, she appeared in the Eurovision Song Contest 1996, wishing luck to the United Kingdom's entrant, Gina G.\n\nAfter the 1997 general election, she returned to the backbenches, and become a headhunter at Odgers, where she headed and now chairs the company's Board & CEO Practice.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called. On 24 June 2005 she was created a life peer with the *le Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She was on the founding Council of the University of the Arts, London. She was a Council Member of the Ditchley Foundation and was President of Farnham Castle, Centre for International Briefing. From 2000 until May 2012 she sat on the Supervisory Board of Akzo Nobel, taking over Courtaulds and then ICI. She was a non-executive director of Bupa, a healthcare company. She was on the Advisory Council of the International Chamber of Commerce UK (ICC UK) and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She was a lay canon of Guildford Cathedral, and a Freeman of the City of London.\n\nIn 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull since 2013. She is the longest serving trustee of The Economist newspaper.\n\nVirginia Garnett married Peter Bottomley in 1967, after the birth of their eldest child; since 1975 he has been an MP.\n\nDuring her time in Prime Minister John Major's cabinet, the satirical puppet show Spitting Image often portrayed Major as having an unrequited crush on Bottomley; years later, it was revealed that Major was having an affair with Edwina Currie at the time.\n\nBottomley's family includes many figures in politics and public life. Her brother, Christopher Garnett, was the chief executive of train operating company GNER. Her aunt Pauline married Roland Hunt who is not connected to Sir Nicholas Hunt, father of Jeremy Hunt who succeeded her as MP.\n\nHer cousins include Peter Jay (the former British Amb*ador to the United States and son-in-law to James Callaghan), and Lord Hunt of Chesterton (father of historian and former Labour MP Tristram Hunt).\n\nMore distant relatives include Lord Oakeshott of Seagrove Bay and Baron Jay of Ewelme (former FCO PUSS and British Amb*ador to France).\n\nJulia Cleverdon married Bottomley's late father, John. Her husband's niece is Kitty Ussher (a former Labour minister).\n\nReferences\n\nExternal links"}, {"url": "https://fampeople.com/cat-virginia-bottomley", "page_content": "Virginia Bottomley : biography\n\nVirginia Bottomley, Baroness Bottomley of Nettlestone, PC, DL (née Virginia Hilda Brunette Maxwell Garnett, born 12 March 1948, Dunoon, Scotland) is a British Conservative Party politician. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She was raised to the peerage in 2005. Considered to be a \"One Nation Conservative\", Bottomley is a Life Member of the Tory Reform Group.\n\nShe was a member of the Supervisory Board of Akzo Nobel NV from 2000-2012, she is currently an NED on BUPA and Smith and Nephew and a Trustee of The Economist Newspaper. As part of her pro-bono activities, Virginia is Chancellor of the University of Hull and Governor of the London School of Economics. She is a member of the UK Advisory Council of the International Chamber of Commerce. She has been Chair of the Board Practice at executive head-hunting firm Odgers Berndtson since 2000.\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon to W. John Garnett, former director of what was then called The Industrial Society, and Barbara Rutherford-Smith, former pupil of the School of St Helen and St Katharine, teacher and elected Conservative member of the Inner London Education Authority. Her aunt on her father’s side was Labour Greater London Council Member Peggy Jay. She first met Peter, now Sir Peter Bottomley her husband, when she was 12 and they married in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in south-west London, before going up to the University of Essex (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA). She began her working life as a social scientist, researcher for Child Poverty Action Group, social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She is a Governor of the London School of Economics and a Pro-Chancellor of the University of Surrey. She was on the founding Council of the University of the Arts, London. She is also a Council Member of the Ditchley Foundation and President of Farnham Castle Centre for International Briefing. From 2000 until May 2012 she has sat on the Supervisory Board of Akzo Nobel. She is a non-executive director of Bupa. She is on the Advisory Council of the and the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She is a lay Canon of Guildford Cathedral, and a Freeman of the City of London. In 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull in 2013.BBC , 7 February 2013\n\nVirginia Garnett married Sir Peter Bottomley in 1967; since 1975 he has been an MP. They live in Milford, Surrey and also maintain residences in London and Worthing; they holiday on the Isle of Wight. They have three children, Cecilia, Adela and Joshua.\n\nHer brother, Christopher Garnett, is a former chief executive of the GNER railway, and Peter Jay, the former British Ambassador to the United States, is a cousin, as are Lord Hunt of Chesterton (Labour), Lord Oakshott of Seagrove Bay (Lib-Dem) and Baron Jay of Ewelme, former British Ambassador to France. Her stepmother is Dame Julia Cleverdon who married Bottomley’s father, John, late in his life.Davidson, Andrew (2007) \"\", Management Today, 28 September 2007, retrieved 2011-01-03 Her niece is Kitty Ussher (former Labour minister) and her other cousin is the Labour MP and historian Tristram Hunt and she is distantly related to Isabel Oakeshott, political editor of The Sunday Times.\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 General Election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan), as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment and was appointed Minister of State at the Department of Health in 1989. She was appointed a member of the Privy Council (PC) upon joining John Major’s Cabinet as Secretary of State for Health in 1992 and served until 1995.\n\nShe then served as Secretary of State for National Heritage from 1995 to 1997. After the 1997 general election, she returned to the backbenches, also becoming a headhunter in the charity and public sectors, now also leading the Odgers Board practice.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 General Election was called. On 24 June 2005 she was created a Life Peer with the title Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage."}, {"url": "https://www.bbc.co.uk/news/special/politics97/background/pastelec/ge97con.shtml", "page_content": "\n\nThe Conservative Campaign He did it once, but could he confound the pollsters a second time? Background Almost immediately after winning his surprise general election victory in April 1992, John Major's political fortunes slumped. Holding together his 21 seat majority over the life of a Parliament was always going to be tough, especially with the Conservatives so divided over Europe, but it is a testimony to his dogged determination that the Tories were not forced to go to the country before May 1997. The 1992-97 Parliament was not an easy one for the Tories. The government was consistently rocked by scandals, resignations, by-election defeats, a long recession, defeat in the Commons over VAT on fuel, the BSE crisis, divisions over Europe, defecting MPs, a rolling leadership contest, 'sleaze' as well as the arms to Iraq affair and the Nolan Committe into standards in public life. When the then Chancellor, Norman Lamont, was forced to take Britain out of the European Exchange Mechanism in September 1992, the government began trailing Labour in the opinion polls by an alarming 20 points. It was a lead that was to remain more or less constant for the next four and a half years. By the beginning of 1997, the Government's parliamentary majority was more shaky than ever, and after Labour's victory in the Wirral South by-election Mr Major found himself at the head of a minority administration. If, as some commentators suggest, elections are not decided by the campaign itself but by the performance of the government during its time in office, then it seems safe to say John Major had little chance of victory. His government, according to the polls, was one of the most unpopular in recent history. Yet despite this, Mr Major was consistently seen by the public as more popular than the party he led. As the election approached, he and his reassuringly ordinary wife Norma were seen by Conservative party strategists as the party's greatest single assets. As the campaign gathered pace, Mr Major's image makers hoped to capitalise on his personal popularity by projecting him in a presidential light. With a long campaign ahead, which Mr Major hoped would \"smoke out\" Tony Blair, and a buoyant economy with low inflation and low unemployment, Mr Major still believed a Conservative victory was possible. The Pre-election Campaign Dr Mawhinney struggled to find the right approach to tackle Mr Blair Tony Blair's election as Labour leader in 1994 wrong-footed the Tories. He moved with astonishing speed to neutralise the Conservatives' traditional lines of attack. Labour's commitment to nationalisation was dropped, links with the unions were weakened, the market economy was embraced and most worrying of all for the Tories, Labour pledged not to raise income tax. The Conservative party chairman, Dr Brian Mawhinney, was unable to make claims stick that New Labour was really a re-packaged old Labour. More worrying still, the old Conservative line of reminding the electorate about the poor record of the last Labour government in 1979 and the winter of discontent no longer struck a chord with the voters, 40% of whom did not even remember the last Labour government. The Conservatives certainly had their work cut out for them. New Labour New Danger Britian might have been \"booming\" but Major didn't benefit In July 1996, Tory research chief Danny Finkelstein and the party's ad-man, Maurice Saatchi, believed they had at last found the right approach to combat Mr Blair. They went negative. The launch of the now infamous \"New Labour New Danger\" poster campaign marked one of the low points in what was to become Britain's most negative general election since the war. The adverts, which showed Tony Blair with glowing demon eyes, received a censure from the Advertising Standards Authority, which described the posters as \"offensive\". One former Cabinet minister said, \"A party of government which can run a broadcast like that has lost all sense of decency and deserves a spell in opposition\". Once the controversy over the posters had died down, Mr Major and his wife Norma embarked on a pre-election nationwide tour. The Prime Minister hoped that the definite up-swing in the economy and a long election campaign offered the Tories their best chance of success. The new campaign slogan \"Life's Better With the Conservatives\" attempted to tie the government to the economy in the eyes of the voters. But the much talked about 'feelgood factor' proved elusive. The voters seemed insistent in their refusal to give the government the credit for the healthy state of the economy. One key area in which the Tories maintained an undisputed advantage over Labour was the size of their election war chest. In September, they launched the biggest single mailshot by a political party in British history. Twenty-five thousand households in 104 key marginal seats received personal letters from the Prime Minister. In December, another new advertising campaign, showing people crying red tears under a Labour government, was launched costing an estimated Ł7 million. (A sum nearly three times higher than the total the Liberal Democrats had to spend on the whole campaign.) The Tories hoped that by starting the campaign early they would tempt Labour into bankrupting itself in an attempt to keep up. It was a ploy that failed. The decision to start early contained other problems for the Tories themselves. Keeping the public interested in politics and motivating Tory party workers, many of whom were over 60, during a long campaign was an uphill struggle. The Campaign John Major names the day The Sun came out for Blair When John Major finally named the day of the election as May 1, the last possible date, the Tory campaign immediately ran into serious trouble. The Sun, traditionally relied on by the Tory party to lead the charge against Labour, switched sides. The Sun came out for Mr Blair, saying the Tories were, \"tired, divided and rudderless\". As if this wasn't bad enough, a tidal wave of 'sleaze' overwhelmed the Conservative campaign for a full fortnight. 'Sleaze' Neil Hamilton and his wife Christine When the Prime Minister called the election, several Conservative MPs were still being investigated by Sir Gordon Downey, the Parliamentary Commissioner, for allegations of corruption in the cash-for-questions affair. Ex-ministers Neil Hamilton and Tim Smith both refused to stand down as Conservative candidates even when the Sunday Express frontpage headline on the 23 March screamed, \"Major Wants The Sleaze MPs Out\". The Prime Minister was forced into the uncomfortable position of supporting the MPs in public while privately wishing for their resignations. Mr Smith did eventually stand down but Mr Hamilton stayed on until the bitter end. Worse was to follow. Within days of the Sun'sdesertion, Piers Merchant, the Conservative MP for Beckanham, found himself splashed on the paper's front page, apparently in an adulterous liaison with a 17-year-old Soho nightclub hostess, Anna Cox. Micheal Heseltine found the allegations an embrassment for the party Michael Heseltine asks Piers Merchant to consider his position Michael Heseltine, the Deputy Prime Minister, sternly warned Mr Merchant that he should \"consider his position\" - code for \"resign\". Yet Mr Merchant denied the allegations and stayed on with the backing of his constituency party. He eventually resigned in October 1997 after reports that he had resumed his relationship with Ms Cox. Further scandal was to befall the Conservative Party, this time in Scotland. Allan Stewart, the MP for Eastwood, resigned as a Conservative candidate due to allegations about his personal life. Mr Stewart's resignation was quickly followed by that of Sir Michael Hirst, the chairman of the Scottish Conservative Party, over what he called \"past indiscretions\". You Can Only Be Sure With The Conservatives Tory manifesto delivered mixed messages Luckily with the launch of the manifestos, the Tories had the chance to put the events of the first two weeks of the campaign behind them and start afresh. The Conservative manifesto, entitled You Can Only Be Sure With The Conservatives, attempted to square the circle of appearing reassuring and radical at the same time. Instead it came over as confused. The Conservatives presented the voters with the mixed message that they were better off sticking with the devil they knew, while insisting that after 18 years in office they were still capable of delivering change. The manifesto spoke of a desire to make Britain, \"the best place in the world to live\". Its proposals included a Ł1.2 billion tax break to married couples were one partner stayed at home to look after children or a dependent relative, the eventual aim to lower the basic rate of income tax to 20 pence in the pound, and the privatisation of the London Underground. The Institute of Fiscal Studies costed the Conservatives' proposals at around Ł12 billion. When the government promised both to reduce taxes and deliver better public services, some argued that the manifesto lacked credibility. Europe John Horam, the first minister to come out against a single currency John Horam on the single currency Soon after the manifesto's launch, the issue that had always threatened to sow disunity in Conservative ranks exploded across the headlines in a spectacular fashion. Some Conservative candidates, under pressure from the Referendum Party, decided to use their personal election addresses to contradict the Government's official \"wait and see\" policy on a single European currency. Despite the Prime Minister's plea that his MPs should not send him, \"naked into the negotiating chamber\", the movement within the Conservative Party to come out publicly against a single currency gathered pace. Eventually, more than 230 Conservative candidates, supported by donations from the Euro-sceptic businessman Paul Sykes, came out against the single currency. Mr Major was forced to let Tory candidates have their way but insisted that members of the government should still toe the official line. When John Horam, a junior minister in the Department of Health, came out against the currency, Mr Major was again forced to back down and offer his party a free vote on the subject. The Prime Minister's earlier blunt dismissal of the claim that ministers would abandon the 'wait and see\" policy during the campaign as \"complete fantasy\" appeared, in retrospect, ill-judged. The extent of the Conservative divisions in the middle of a general election campaign were unprecedented. Divided parties have, over the years, been punished by the electorate at the polls, as Labour had discovered to its cost in 1983, and the Conservatives proved no exemption in 1997. John Major's capitulation to the Euro-sceptics and his refusal to sack John Horam delighted the oppostion parties, as did the Prime Minister's failure to notify Kenneth Clarke of the change in policy and his subsequent remark that he did not have to notify \"Kenneth Clarke or Joe Bloggs\" of a change in policy. Sir Edward Heath was not impressed with the Tory attack on Europe The party's increasingly anti-European stance attracted criticism from some of the most senior Tory figures. Kenneth Clarke was obviously uncomfortable with the new policy and when a new Tory advertising campaign was released showing a puppet-sized Tony Blair sat on the lap of German Chancellor Helmut Kohl, it drew fire from both former Prime Minister Sir Edward Heath and ex-Foreign Secretary Sir Geoffrey Howe. When Labour made a decision towards the end of the campaign to go negative, claiming that a fifth Tory term would see the end of the National Health Service and an end to state pensions, it provoked John Major into a passsionate response. He attacked the allegations head-on, saying \"If anybody in my Cabinet actually prevailed in an argument like that, I would not only leave Downing Street, I would leave politics and call a general election\". The Final Days Major defends tory commitment to the state pension John and Norma Major campaigning to save the union in Wales The Conservative decision to be tough on Europe was followed by John Major's decision to step up the Tories' attack on Labour's plans for devolution and a Welsh assembly. With just three days to go until the election, John Major rounded on Labour's constitutional reforms, telling voters that there were only \"72 hours to save the union\". John Major campaigns to save the union Mr Major believed his decision to attack Labour on the constitution had played a significant part in the Conservative election victory in 1992. He attempted to repeat the trick in 1997, embarking on a day-long tour of Northern Ireland, Scotland, Wales and England. With just one day to go, the Prime Minister launched what he called \"the Battle for Britain\" calling election day a \"day of destiny\". He attempted to rally Conservative support by laying out what he believed the British people had to lose if Labour were to be swept to power in a landslide, as the polls suggested. Too good to give up? \"No one can honestly question that the transformation in Britain has been anything less than an economic miracle. It's too good to give up. \"They would throw away our economic success by embracing the European social model, just as it is seen to be failing. They'd weaken the nation forever by a double threat to our Westminster Parliament - ceding power to devolved parliaments within Britain and handing over power to an integrationist federal Europe at the same time.\" After finishing his final day of campaigning, the Prime Minister returned to his constituency of Huntingdon to vote, still claiming to be confident of a Conservative victory. The Count Micheal Portillo, the Defence Secretary, was one of the seven cabinet ministers to fall As soon as the exit poll was released at 10pm on May 1, a Labour landslide of historic proportions looked imminent. Conservative seats fell like ninepins and John Major had little choice but to concede the election to Labour; 18 years of Tory government was finally over.\n\nEdwina Currie, one of the many big names to lose their seats The Conservatives were reduced to just 165 MPs in the House of Commons, their lowest number since 1906. They held no seats in Scotland or Wales. Seven cabinet ministers inlcuding Michael Portillo, Ian Lang, Malcolm Rifkind and Michael Forsyth, all lost their seats as did many leading figrure in the Conservative party such as Edwina Currie, David Mellor, Dame Angela Rumbold, Sir Marcus Fox and Jonathan Aitken. Mr Major lost no time in resigning as party leader. After visiting Buckingham Palace to offer the Queen his resignation as Prime Minister, he then announced his decision to stand down as head of the Conservative Party, saying \"When the curtain falls, it's time to get off the stage - and that's what I propose to do.\" Major resigns as Tory leader The field was now open for a broken and battered Conservative Party to re-group, lick its wounds, choose a new leader and begin preparations for the next general election."}, {"url": "https://www.liquisearch.com/virginia_bottomley/member_of_parliament_and_in_government", "page_content": "“When I reach the shades at last it will no doubt astonish Satan to discover, on thumbing my dossier, that I was a member of the Y.M.C.A.”\n\n—H.L. (Henry Lewis)\n\n“And the member for the constituency\n\nFeeds the five thousand, and has plenty back.”\n\n—William Robert Rodgers (1909\u00961969)\n\n“The war shook down the Tsardom, an unspeakable abomination, and made an end of the new German Empire and the old Apostolic Austrian one. It ... gave votes and seats in Parliament to women.... But if society can be reformed only by the accidental results of horrible catastrophes ... what hope is there for mankind in them? The war was a horror and everybody is the worse for it.”\n\n—George Bernard Shaw (1856\u00961950)\n\n“Whatever it is that the government does, sensible Americans would prefer that the government do it to somebody else. This is the idea behind foreign policy.”\n\n—P.J. (Patrick Jake)"}, {"url": "https://alchetron.com/Virginia-Bottomley", "page_content": "Virginia Hilda Brunette Maxwell Bottomley, Baroness Bottomley of Nettlestone, PC, DL (née Garnett, born 12 March 1948) is a British Conservative Party politician. She was a Member of Parliament (MP) in the House of Commons from 1984 to 2005. She was raised to the peerage in 2005.\n\nShe was a member of the Supervisory Board of Akzo Nobel NV from 2000–12, an NED on BUPA 2007–2013 and currently Smith and Nephew, she is a Trustee of The Economist Newspaper. As part of her pro-bono activities, Virginia is Chancellor of the University of Hull. She was a Governor of the London School of Economics for 31 years. She is a member of the UK Advisory Council of the International Chamber of Commerce. She has been Chair of the Board Practice at executive head-hunting firm Odgers Berndtson where she has been since 2000.\n\nEarly life and career\n\nVirginia Hilda Brunette Maxwell Garnett was born in Dunoon, Scotland to W. John Garnett CBE, former director of what was then called The Industrial Society, and Barbara Rutherford-Smith, a teacher and elected Conservative member of the Inner London Education Authority. Her paternal aunt was Labour Greater London Council Member Margaret (Peggy) Jay. She first met Peter Bottomley, her future husband, when she was 12 years old; they wed in 1967.\n\nBottomley was educated at Putney High School, an independent school for girls in Putney in south-west London, before going up to the University of Essex to study sociology (BA). She later graduated from the London School of Economics with the degree of Master of Arts (MA). She began her working life as a social scientist, researcher for Child Poverty Action Group, social worker, magistrate (Justice of the Peace), and Chairman of the Inner London Juvenile Court.\n\nMember of Parliament and in government\n\nAfter unsuccessfully contesting the Isle of Wight in the 1983 general election (34,904 votes), she was elected to Parliament with 21,545 votes in a by-election in 1984 (filling the seat left vacant by the death of Maurice Macmillan, son of former prime minister Harold Macmillan), as the Member for South West Surrey, was PPS to Chris Patten and then to Foreign Secretary Sir Geoffrey Howe, received her first ministerial position in 1988 as a Parliamentary Under-Secretary at the Department of the Environment and was appointed Minister of State at the Department of Health in 1989. She was appointed a member of the Privy Council (PC) upon joining John Major's Cabinet as Secretary of State for Health in 1992 and served until 1995. She was the 9th woman in the British cabinet.\n\nShe then served as Secretary of State for National Heritage from 1995 to 1997. After the 1997 general election, she returned to the backbenches, also become a headhunter at Odgers.\n\nRetirement\n\nShe stepped down from the House of Commons when the 2005 general election was called. On 24 June 2005 she was created a Life Peer with the title Baroness Bottomley of Nettlestone, of St Helens in the County of Isle of Wight, the parish where she was baptised and celebrated her marriage.\n\nPersonal life\n\nBottomley is involved with charitable and academic bodies in addition to business. She was on the founding Council of the University of the Arts, London. She is also a Council Member of the Ditchley Foundation and was President of Farnham Castle, Centre for International Briefing. From 2000 until May 2012 she has sat on the Supervisory Board of Akzo Nobel. She was a non-executive director of Bupa, a healthcare company. She is on the Advisory Council of the International Chamber of Commerce UK (ICC UK) and was for the Judge School of Management, Cambridge. Bottomley has been a trustee and is a fellow of the Industry and Parliament Trust. She was National President of the Abbeyfield Society and a Vice-Patron of Carers and of Cruse Bereavement Care. She was a lay canon of Guildford Cathedral, and a Freeman of the City of London. In 2006, she was elected and installed as Chancellor of the University of Hull, succeeding Lord Armstrong of Ilminster in April 2006. She was also appointed a Deputy Lieutenant of Surrey in March of that year and Sheriff of Hull in 2013.\n\nVirginia Garnett married Sir Peter Bottomley in 1967, after the birth of their eldest child; since 1975 he has been an MP. They live in Westminster and Milford, Surrey; they have three children, Cecilia, Adela and Joshua and eight grandchildren.\n\nBottomley's family includes many figures in politics and public life. Her brother, Christopher Garnett, was the chief executive of train operating company GNER. Her cousins include Peter Jay, the former British Ambassador to the United States and son-in-law to James Callaghan, and Lord Hunt of Chesterton (Labour), father of Labour MP and historian Tristram Hunt. More distant relatives include Lord Oakshott of Seagrove Bay (Lib Dem), and Baron Jay of Ewelme, former British Ambassador to France. Dame Julia Cleverdon married Bottomley's father, John. Her husband's niece is Kitty Ussher (former Labour minister)."}]}