{"John Liscio began his career in the financial services industry in the early 1970s, working as a stockbroker and financial analyst.": [{"url": "https://www.wikiwand.com/en/John_Liscio", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nQuick facts: John Liscio, Born, Died, Alma mater, Occ... ▼\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders.[1] Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.[2]\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}, {"url": "https://prabook.com/web/john.liscio/2231476", "page_content": "John Liscio\n\njournalist\n\n1949 (age 51)\n\nHe served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at United States. News & World Report and worked at Barron\"s in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders. Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne. Liscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection."}, {"url": "https://www.nytimes.com/2000/12/09/business/john-liscio-51-bond-newsletter-publisher.html", "page_content": "John Liscio, who wrote and published The Liscio Report, a financial newsletter, died on Nov. 29 at Mount Sinai Hospital in Manhattan. He was 51 and lived in Upper Montclair, N.J.\n\nThe cause was liver and kidney failure related to hepatitis C, said his wife, Frances.\n\nMr. Liscio, whose motto was ''To trust is good, not to trust is better,'' founded his influential bond market newsletter in 1992 after working briefly as a senior editor of U.S. News & World Report. In the late 1980's and early 90's, he was on the staff of the financial weekly Barron's.\n\nIn October, Barron's said that Mr. Liscio had made a success of himself on his own, writing for the last eight years The Liscio Report, ''an astute and irreverent look at the credit markets and economy.''\n\nMr. Liscio told Barron's at that time: ''I don't try to forecast. I don't think forecasting is something within the realm of human possibility.'' But he had made a reputation for himself by forecasting the recession in the early 1990's."}, {"url": "https://www.encyclopedia.com/history/dictionaries-thesauruses-pictures-and-press-releases/financial-services-industry", "page_content": "FINANCIAL SERVICES INDUSTRY\n\nFINANCIAL SERVICES INDUSTRY. Until the 1970s, the financial services industry consisted of a few well-defined and separate industries that dealt in money. These included banks and savings and loan associations for personal savings, checking accounts, and mortgages; brokerage houses, such as Merrill Lynch, for investment in stocks, bonds, and mutual funds; and credit card companies, such as Visa USA or MasterCard International, for consumer credit.\n\nThe Decline of Banks\n\nBeginning in the 1970s, the profitability of banks declined due in large part to federal regulations that restricted banks from offering the variety of products, such as insurance, mutual funds, and stocks, that their less strictly controlled competitors offered. The gradual shift away from banks as the center of the American financial services industry occurred between 1973 and 1979, when the Organization of the Petroleum Exporting Countries (OPEC) dramatically increased oil prices, leading to double-digit inflation by the end of the decade. As a result, investors with savings accounts receiving the federally imposed 5.25 percent interest rate were losing money. Coupled with inflation was the emergence of investment companies offering consumers money market mutual funds, which enabled the average investor to earn market-rate interest. Mutual funds were also a safe instrument, as they were invested primarily in high-interest federal securities and certificates of deposit (CDs). Mutual funds grew as small investors, lured by huge gains in the stock market during the 1980s, sought ways to earn returns greater than the rate of inflation. The shift to mutual funds hit American banks hard. In the years between 1977 and 1981, consumers went from investing $3.9 billion to investing $181.9 billion in mutual funds rather than putting their money in the bank.\n\nStill, many Americans used their local banks for routine checking and savings. But bank assets continued to decline; in 1960 banks held 34 percent of the total assets of Americans. By 1989 that figure had declined to 26 percent. In the meantime, consumers had a number of alternatives to conventional savings accounts, including CDs and money market funds, both of which yielded higher interest than standard savings accounts.\n\nDespite the approximately 1,295 bank failures between 1985 and 1992, banking advocates stated that the industry was competing effectively in the newly competitive financial services market. Although the traditional business of banks, taking deposits and making loans, had declined, other services more than made up for the loss, resulting in record profits in 1992 and 1993. To remain competitive, banks exploited loopholes in the Glass-Steagall Banking Act of 1933, which sharply restricted their activities. During the 1980s and 1990s, banks responded to competition by selling money market and mutual funds, creating mortgage and financing subsidiaries, and fashioning a huge network of automatic teller machines (ATMs).\n\nThe Diversification of the Financial Services Industry\n\nBy the mid-1990s, many observers believed that the banking industry and other companies offering financial services were no longer clearly defined, separate entities. Now banks, insurance companies, and brokerage houses converged. Insurance giant Prudential acquired brokerage houses to form Prudential-Bache, and such traditional Wall Street players as Merrill Lynch began to offer accounts that allowed customers to do their banking.\n\nAnalysts disagree about the effects these changes have had on the American finance scene. By the early 1990s, some believed that the United States was becoming a bankless society, with such corporations as the Ford Motor Company, General Electric, and General Motors able to offer loans to businesses and credit to consumers, all financial services previously reserved for banks and savings and loans.\n\nCredit Cards\n\nBy 1995, Americans faced a bewildering array of choices for even the most routine financial transactions. Credit cards became increasingly popular, with $480 billion in purchases made in 1993 alone. Credit cards offered by an ever-growing number of companies and associations granted premiums and bonuses if consumers used their cards. Those who used the GM MasterCard or Visa, for example, could get credit toward their next auto purchase from General Motors; Exxon Visa cardholders could get back 3 percent of every gasoline purchase made at an Exxon station. Other credit cards offered frequent flyer miles and donations to charities. Other companies issuing credit cards included Sears, AT&T, Chrysler, and Ford Motor Company. Credit cards account for 25 percent of all profits at the ten largest banks in the United States, but with only 14 percent of all merchandise purchased via credit card, there is still room for growth.\n\nSince the early 1970s, the use of credit cards has expanded from infrequent large purchases to include such everyday purchases as groceries, fast food, and telephone calls. Thanks to less stringent underwriting criteria at major credit card companies, credit cards are also more easily available than ever before. In 1989, 56 percent of American families had at least one general use credit card such as MasterCard or Visa. By 1998, that number had climbed to 67.5 percent. Credit card companies have also targeted new groups for their product. Offering cards to students on many college and university campuses has led to easier access to credit for those who may not yet have established a credit history. For credit card companies, this persistence has paid off: Americans charged more than $1 trillion in purchases with their credit cards in the year 2000, more than they spent in cash.\n\nIndustry Convergence\n\nThe convergence of companies offering financial services has blurred the conventional boundaries that once separated banks, brokerages, and insurance companies. This trend has now become global. As a result, the convergence of financial services has created a new class of financial provider. These financial services conglomerates strive to provide customers with a vast portfolio of integrated financial services.\n\nPerhaps the most significant example of convergence came in April 1998 with the announcement of the merger of Citicorp and Travelers Insurance. The creation of Citigroup, already a financial giant with a presence in 100 countries across six continents, offered a glimpse of a new business model in the financial services industry: a full-service provider with formidable assets in banking, insurance, stockbrokerage, mutual funds, and more. With assets valued at $697.5 billion, Citigroup became the largest financial services company in the world. A week later, on 13 April, Banc One announced its merger with First Chicago NBD Corporation, with the new company's value now estimated at $116 billion. That very same day, Nations Bank joined with Bank America, creating a new corporation with deposits of $346 billion, making it the second largest bank in the United States and the fifth largest in the world.\n\nIt was clear that through these mergers a complex and ongoing revolution was transforming the very nature of the financial services industry. At the very center of this revolution, however, was a conflict between what banking experts called \"consolidation\" and the process called \"disintermediation,\" which meant the removal of intermediaries such as banks from financial transactions. Proponents of disintermediation, such as the software giant Microsoft, believed that the future belonged to those companies who mastered the new technology, which in turn, would give customers and investors almost complete control over their finances.\n\nTurbulent Times\n\nDespite its growth and its profits, the financial services industry has not escaped crises or disasters. On 19 October 1987, the New York Stock Exchange experienced the largest single-day drop in its history, losing 508.32 points, or 22.6 percent of its value. Although many factors accounted for this huge decline, a major concern was the impact of computerized trading programs, which bought and sold huge blocks of securities automatically. The market quickly rebounded from Black Monday, but the Securities and Exchange Commission enacted rules that limited the ability of computerized programs to affect the market.\n\nOne of the defining moments in the financial services industry came during the 1980s with the failure of hundreds of savings and loan (S&L) institutions. Unlike the fall of the stock market, the S&L disaster produced much more enduring consequences. A partial explanation for the failures came from the debt burden that the S&Ls carried as the result of offering low-interest mortgages, in some cases as low as 3 percent, during the 1970s when inflation was high and interest payments to depositors were as much as 12 percent. Fraud and corruption also played a role in approximately half of the failures. A government bailout costing an estimated $500 billion to $1 trillion implemented over a period of thirty years was required to pay insured depositors of failed institutions.\n\nLike much of the United States, the financial services industry suffered a terrible tragedy in 2001 when terrorists attacked the World Trade Center (WTC) in New York City and the Pentagon in Washington, D.C. The assault had a profound and lasting impact on the financial services industry because the WTC was home to dozens of banks, insurance companies, brokerages, and securities firms. Many companies with offices in the WTC lost dozens of key personnel. Some companies were virtually wiped out, losing all their documents and records. As of 2002, other companies have recovered from effects of 11 September, but are still experiencing cash flow problems because of the interruption of normal business.\n\nThe industry felt the effects of the attacks in other ways as well. In addition to their own financial losses, they suffered from the further general contraction of an already languishing American economy. The events of 11 September have led the financial service industry to reevaluate how the industry will function in the future. Many foresee a move toward electronic and virtual markets.\n\nThe Financial Services Industry and the Law\n\nIn 1999, Congress passed the Gramm-Leach-Bliley Act (GLBA), or the Financial Modernization Act, the most sweeping legislation directed at banks and other financial institutions since the Great Depression. Intended to monitor cross-industry mergers and affiliations, customer privacy, and lending to lower-income communities, the GLBA created opportunities for financial institutions to engage in a broader spectrum of activities. The legislation also placed additional burdens on financial institutions, such as new consumer privacy safeguards and disclosure requirements.\n\nThe law permits the convergence of the banking, insurance, and securities industries as long as appropriate safeguards are in place to protect the consumer and guarantee the solvency of the institution. At the same time, the law almost completely eliminated the legal barriers that once separated the various components of the financial services industry. Although superseding state legislation, the GLBA also recognized the importance of state regulation of financial services companies and so endorsed the \"functional regulation\" of institutional activities by both state and federal regulatory agencies. State laws could not discriminate against banks in licensing or authorizing securities and insurance activities, but a state could impose reasonable and necessary licensing and consumer protection requirements consistent with federal regulations.\n\nThe law also limited the extent to which financial institutions could share personal information about customers, stating that individuals must be informed about the privacy policies and practices of financial institutions. The law also gave consumers limited control over how financial institutions used and shared personal information.\n\nThree years after the law was enacted, the freedom that the GLBA granted was in jeopardy. In 2002, the financial services industry became the subject of federal scrutiny as Congress debated new legislation that would more closely regulate the industry. The inquiries came amid scandals involving such high-profile financial firms as J. P. Morgan Chase and Company and Merrill Lynch, with accusations that company executives were guilty of deception and fraud with regard to the financial collapse of the Enron Corporation. Once willing to keep government out of the way, legislators now called for tougher laws that would mandate keener overseeing of corporate finances. Additional legislation would overhaul the Financial Accounting Standards Board.\n\nThe USA Patriot Act, also passed in 2001, will require mutual fund companies, operators of credit card systems, registered broker-dealers, futures merchants, and money services businesses to adopt programs similar to those that banks have been required to use since 1987. This piece of legislation law is aimed at curbing money-laundering activities, including those that help fund terrorism. As of 2002, some sectors of the financial services industry, such as insurance, finance, and non-mutual fund companies, remained exempt from the law.\n\nThe Future Is Now\n\nAs the financial services industry becomes more fast-paced and competitive, technology will be an even more important component of success. Probably more than any other sector of the American economy, financial services rides the crest of technological innovation. Finance is increasingly a twenty-four-hour, seven-day-a-week global activity with vast sums flashing between markets over the electronic communications web. The ability to instantaneously interpret the financial markets and anticipate their movement can bring huge profits or avoid disastrous losses. With large sums committed in the markets, financial organizations need to calculate how much risk they are accepting.\n\nThe sheer speed and complexity of financial markets has compelled banks and other financial institutions to look beyond conventional analytical techniques and computer systems. A bank's technological stockpile can include object-oriented technology, neural networks, data visualization, and virtual reality. The Citibank Corporation, for instance, files its annual report with its regulator by sending the document electronically; the physical copy is posted later merely to satisfy the requirements of law. The Federal Reserve Board, which functions as the central bank of the United States, posts complete information on bond and money markets each day on a computer bulletin board.\n\nAs more financial information is disseminated electronically, the ability to manipulate it is also growing. Advertisements on electronic bulletin boards match buyers with sellers, and borrowers with lenders. Transactions are instantly verified and settled through a global, real-time payment system. Innovations in self-service delivery, such as ATMs, telephone transactions, kiosks, and more recently, Web-enabled services through Internet \"portals,\" have forever altered consumer expectations. Technology has also enabled new and often nontraditional competition to enter the market space of traditional providers. In response, many financial services companies are currently deploying new technologies to support an integrated product approach, wagering that their customers will find value and convenience in getting all their financial services from a single institution.\n\nThanks to the growing electronic market, many analysts believe that this diversification will dampen both inflation and, possibly, speculation. Bankers may also become an endangered species. At present, they control payment systems, assess creditworthiness, and transform short-term deposits into long-term loans. In the future, some experts say, many, if not all, of these functions will be performed either by individual customers or by more specialized firms, removing whatever influence banks still have over other financial service companies. If they are to survive and prosper, banks will need to find different niches, such as credit card processing, asset management, or, as in the case of Bankers Trust, the pricing and management of financial and other types of risk. Securities houses may also find themselves in jeopardy. As the costs of doing business begin to virtually disappear, consumers will have even greater opportunities to bypass financial firms all together. Finally, one of the most provocative of the claims that financial experts now put forth is that today's financial services customers could become tomorrow's rivals. Bypassing banks and securities firms, corporations might soon bid against them for financial business.\n\nBIBLIOGRAPHY\n\nAspatore Books Staff, ed. Inside the Minds: The Financial Services Industry—Industry Leaders Share Their Knowledge on the Future of the Financial Services Industry. Boston: Aspatore Publishing, 2002.\n\n\"Bankers Trust's 2020 Vision.\" The Economist 330, no. 7856 (March 26, 1994): 91–92.\n\nBanks, Erik. e-Finance: The Electronic Revolution. New York: John Wiley & Sons, 2001.\n\nDay, Kathleen. S&L Hell: The People and the Politics Behind the $1 Trillion Savings and Loan Scandal. New York: Norton, 1993.\n\nDuran, Nicole, and Barbara A. Rehm. \"Policymakers GO Activist; Will They Overreach?\" American Banker 167, no. 86 (May 6, 2002): 1–2.\n\nGart, Alan. Regulation, Deregulation, Reregulation: The Future of the Banking, Thrift, Insurance, and Securities Industries. New York: John Wiley & Sons, 1994.\n\nGarver, Rob. \"Launder Rules Will Apply Across Financial Services.\" American Banker 67, no. 77 (April 23, 2002): 1–2.\n\nKirsch, Clifford E., ed. The Financial Services Revolution: Understanding the Changing Roles of Banks, Mutual Funds, and Insurance Companies. Chicago: Irwin Professional Publishing, 1997.\n\nMayer, Martin. The Money Bazaars: Understanding the Banking Revolution Around Us. New York: E. P. Dutton, 1984.\n\nRatner, Ellis, and Mark Coler. Financial Services: Insider's Views of the Future. New York: New York Institute of Finance, 1987.\n\nWendel, Charles B., and Elaine S. Svensson, eds. The New Financiers: Profiles of the Leaders Who Are Reshaping the Financial Services Industry. Chicago: Irwin Professional Publishers, 1996.\n\nMeg GreeneMalvasi"}, {"url": "https://www.oppenheimer.com/about-us/management-committee.aspx", "page_content": "Ed Harrington is the Executive Vice President of the Private Client Division at Oppenheimer & Co. Inc. Ed is responsible for the strategic management and growth of the Firm’s Financial Advisor and branch network. He brings together resources that enable Financial Advisors to deliver valued investment advice and comprehensive wealth management to a variety of clients, including families and high-net-worth individuals, foundations and endowments, pensions, charities, and corporate executive services for all businesses.\n\nEd has spent 25 years with Oppenheimer, excelling in product development, sponsor engagement, operations and product marketing. In his most recent role as Managing Director, Head of Sales & Marketing for Oppenheimer Asset Management Inc., he built a sales and marketing team that delivers an end-to-end capability including 12 investment platforms, new product capabilities across all asset classes, sales enablement activities and field support. He led successful investment management distribution efforts across 92 U.S. retail locations and 1,100 advisors and played an important collaborative role in the launch of the Firm’s Private Market Opportunity Platform, which delivers private investment vehicles to qualified investors.\n\nEd received his Bachelor of Science from the University of Scranton and has earned his Certified Investment Management Analyst designation. In his free time, Ed can be found taking on challenging trails on his mountain bike and spending time with his family, including coaching his children’s youth sport programs."}, {"url": "https://www.merceradvisors.com/locations/boston/", "page_content": "Of course, a well-managed investment portfolio is the cornerstone to building wealth. And we strive to do that exceptionally well.\n\n\n\nBut if returns are your sole focus, those returns can quickly be offset by what happens in the other parts of your financial life. Like not preparing for major taxable events, having an incomplete estate plan, a retirement plan that’s on autopilot, or a less than ideal business succession strategy.\n\n\n\nSo, unlike most firms, we have expertise across financial planning, investing strategy, tax and estate planning, trust services, insurance coverage, and more. With specialists across each of these areas communicating with each other about you, and with you."}, {"url": "https://guardiancapital.com/our-people", "page_content": "George Mavroudis is President and CEO, Guardian Capital Group Limited (Guardian). He joined Guardian in 2005 in a senior executive role, progressively assuming overall responsibility for the business management of the firm’s investment operations, including both institutional and private wealth management. George became a Board Director in November 2011.\n\nHis career in the financial services industry began in 1992 at Coopers & Lybrand. Prior to joining Guardian, George was a managing director at JPMorgan Fleming Asset Management, holding several senior management roles across their network of offices including London, New York and Toronto. He also served as CEO for Robert Fleming's Russia institutional brokerage and investment banking business, from his base in Moscow from 1995-1998.\n\nGeorge graduated with a B.Comm from University of Toronto. He is a Fellow of the Chartered Professional Accountants (CPA) of Ontario. George holds the Certified Financial Planner designation from the Financial Planners Standards Council."}, {"url": "https://www.getsmarter.com/blog/market-trends/the-history-of-fintech/", "page_content": "The History of Fintech\n\nThe history of fintech innovation goes as far back as the 1860s. By learning about fintech’s origin and evolution, it’s easier to understand where these exciting and disruptive technologies are currently headed.\n\nThe fintech revolution begins Financial innovations The emergence of modern fintech trends Significant fintech advancements A new era of fintech trends Fintech introduces the world to online banking and trading Fintech innovations in the new millennium Prepare yourself for the financial possibilities of fintech\n\nThe fintech revolution begins\n\nThe origins of fintech can be traced back to the 1800s:\n\n1860s\n\nGiovanni Caselli developed the pantelegraph in the 1860s – a period now considered the beginning of the history of financial innovation.1\n\nThe pantelegraph was mostly used to verify signatures in banking transactions by sending and receiving transmissions on telegraph cables. This verification process was slow and cumbersome – it took about 108 seconds for a sheet of paper with around 25 written words to transmit.2\n\n1880\n\nBy the 1880s in the U.S., consumers and merchants began exchanging goods and services for credit using charge coins and plates.3\n\nCharge coins were metallic tokens that displayed the customer’s identification number and an image associated with the vendor, and were roughly the same size and shape as modern coins. Charge plates were either aluminum or white metal plates embossed with a customer’s name and address on the front and a paperboard insert on the back with the issuer’s name and cardholder’s signature.\n\nCharge coins were mostly forgotten by 1960, followed by charge plates, which were replaced with modern credit cards.\n\nFinancial innovations\n\nThe 1900s saw more rapid financial innovations than the previous century:\n\n1918-1970\n\nThe next early fintech innovation was when the United States Federal Reserve Banks devised a system to move funds electronically. This system was first known as the Federal Reserve Wire Network and is now known as Fedwire.4\n\nConnecting all 12 Reserve Banks across the country, the Morse code-based system was used as a real-time gross settlement funds transfer system until the 1970s. During this decade, the process shifted from telegraphy toward telex, and finally to computer operations and proprietary communication networks. Telex was an international network of teleprinters that transferred messages securely from one teleprinter to another.5\n\n1919\n\nIn what’s arguably the first allusion to fintech and the future of financial services, economist John Maynard Keynes wrote about the link between finance and technology in his book, The Economic Consequences of the Peace.6\n\nThe emergence of modern fintech trends\n\nThe 1950s saw the emergence of credit cards:\n\n1950\n\nDiner’s Club Inc. invented the first iteration of the modern credit card. Purchasing on credit was a laborious and segmented process before this universal credit card was introduced. Those who were lucky enough to get hold of a Diner’s Club card could dine on credit at a variety of establishments.7 Originally, the Diner’s Club had 200 members; within two years, it grew to 42,000 across the U.S. The concept quickly caught on.8\n\n1958\n\nShortly after the Diner’s Club card exploded in popularity, the American Express Company credit card was introduced. This innovation helped American Express to evolve into the largest global payments network.9\n\nSignificant fintech advancements\n\nTechnology advanced quickly in the 1960s, impacting the financial sector in several revolutionary ways:\n\n1960\n\nQuotron, a Los Angeles-based company, was the first to offer stockbrokers and money managers stock market quotes on an electronic screen instead of on printed ticker tape. By 1986, Quotron was renting 100,000 terminals to the brokerage industry, equal to roughly 60 percent of the 1986 market. This attracted the attention of Citicorp, which acquired Quotron shortly after.10\n\nThe speed and agility accompanying digital recall meant brokers could receive up-to-the-minute prices for securities such as stocks, bonds, and other types of traded investments.\n\n1966\n\nThe telex network replaced the telegraph as the standard for long-distance, instantaneous communication of information.11\n\nAny user on a telex exchange could deliver messages to any other user around the world. This flexibility opened the doors for the global communication of financial transactions and information.\n\nThough telex is still in use today, it’s taken a backseat to email.12\n\n1967\n\nNorth London’s Enfield Town branch of Barclays Bank was the first to have an automated teller machine (ATM) installed. Customers had to insert paper checks issued by a teller or a cashier to facilitate the convenience of receiving money from a machine. These checks were marked with carbon-14 as a security measure to improve machine readability and, for additional protection, a six-digit pin was added. This set a trend for the future of financial services being faster and more convenient.13\n\nA new era of fintech trends\n\nFintech quickly transforms as technology advances.\n\n1971\n\nThe establishment of the U.S. National Association of Securities Dealers Automated Quotations, otherwise known as the NASDAQ, further transformed the fintech industry in 1971. As the world’s first electronic stock market, NASDAQ helped reduce the bid-ask spread (the difference between the bidding price and asking price of a stock) and heralded the end of fixed securities commissions. NASDAQ helped modernize the initial public offering (IPO).14 IPO’s are when a company that is privately owned allows the general public to purchase its shares on a stock exchange.15\n\nFintech introduces the world to online banking and trading\n\nToday, we jump on our phones, open an app, and log in to our online banking accounts. Just a few decades ago, the transaction process wasn’t this easy, but things were changing rapidly.\n\nTwo great fintech leaps were taken in the 1980s, affecting the wealth management sector. These were electronic trading (e-trading) and online banking.\n\n1982-1983\n\nE-Trade Financial Corporation, originally founded under the name of TradePlus, became the first online brokerage firm in 1982. Today, E-Trade still serves self-directed investors as a public company16 and was purchased by Morgan Stanley in 2020.17\n\nIn 1983, customers of the Nottingham Building Society were the first to access online banking provided by the Bank of Scotland18 – another major step in the evolution of fintech. Online banking was then introduced in the U.S. by Chemical Bank – also in 1983.19 However, due to a lack of customer draw in the U.S., the idea was canned in 1989.20 Other banks had a similar experience and it wasn’t until much later that online banking was widely adopted.\n\nBecause of the success of internet banking in the U.K., the majority of U.S. banks set up their first transactional websites for internet banking in the late 1990s.\n\nFintech innovations in the new millennium\n\nThe turn of the century introduced even more exciting financial technologies:\n\n2009\n\nBitcoin was released in 2009.21 Bitcoin is considered by investors to be the first type of cryptocurrency, opening the door to an entirely different type of currency trading.22\n\n2011\n\nFormerly known as Google Wallet, Google Pay Send was developed and released in 2011. It allowed smartphone users with Near-Field Communication (NFC) chips in their devices to make payments through their phones by tapping against a reader at the cash register, rather than using credit cards or cash.23 Now, Google Pay allows you to pay others, or businesses, and put your credit cards and accounts on your phone, in one easy-to-use app.24\n\n2017\n\nIn this year, Alibaba introduced “smile to pay” facial recognition payments at KFCs in China, a service that allowed users to pay for their food by simply smiling at a 3D camera.25\n\nPrepare yourself for the financial possibilities of fintech\n\nThe fintech industry has grown in leaps and bounds in recent years and the future holds great promise. One way to stay on the cutting edge of the latest technologies in 2022 and beyond is to learn more about fintech trends and evolutions, such as the future of money, marketplaces, and infrastructure.\n\nBeyond 2020\n\nLooking back to 2018, when just $1.5 billion was invested in blockchain, worldwide investment is expected to be 10 times that amount in 2023, growing to $15.9 billion.26 The adoption of fintech is a testament not only to the willingness of the financial industry to adapt and evolve but also to the speed at which it’s prepared to do so.\n\nFind out how to step beyond current fintech disruptions and build a career in this exciting field with a six-week FinTech online short course. Guided by faculty from Harvard’s Office of the Vice Provost for Advances in Learning (VPAL), in association with HarvardX, you’ll learn how to successfully tackle transformative initiatives within the financial technology sector. Gain a solid understanding of fintech’s innovation possibilities as you explore highly relevant case studies, and begin to propel your career in finance forward.\n\nExpand your knowledge with an online fintech course"}, {"url": "https://www.biography.com/business-leaders/jp-morgan", "page_content": "(1837-1913)\n\nWho Was J.P. Morgan?\n\nBorn into a prominent New England family in 1837, J.P. Morgan began his career in the New York financial industry in the late 1850s. He co-founded the banking firm that became J.P. Morgan & Co. in 1871, and in the 1880s he established himself as a power player in the country's railroad industry. Along with amassing immense wealth through the creation of such corporations as U.S. Steel, Morgan led efforts to bail out the U.S. Treasury in 1895 and 1907. He died in Rome in 1913, leaving behind a world-renowned art collection and a business that remained a financial powerhouse into the 21st century.\n\nEarly Years\n\nJohn Pierpont Morgan was born into a prominent New England family on April 17, 1837, in Hartford, Connecticut. His paternal grandfather, Joseph, was a founder of the Aetna Insurance Company, and his father, Junius, became a partner in a successful dry goods business around the time he married Juliet Pierpont, daughter of noted minister and poet John Pierpont.\n\nA sickly child who suffered seizures and other mysterious ailments, Pierpont, as he was known, spent long periods sheltered at home. When healthy, he frequented galleries and concerts with his parents, sparking a lifelong fascination with the arts. Initially a smart but indifferent student, he began showing improved grades by the time he attended English High School in Boston.\n\nIn 1854, Junius Morgan moved the family to London to begin his new career as a partner in the banking firm of George Peabody & Co. Pierpont was sent to the Institute Sillig in Switzerland, where he became fluent in French and displayed an aptitude for mathematics, and then to Göttingen University in Germany.\n\nEarly Career and Marriages\n\nAfter finishing his education in 1857, Morgan moved to New York to work as a clerk at Duncan, Sherman & Co., the American branch of his father's firm. In one early example of his ingenuity, Morgan was in New Orleans for business when he encountered a ship captain with a boatload of coffee and no buyer. Morgan used his company's funds to purchase the coffee, and then sold it to local merchants for a profit. His success emboldened him to strike out on his own, and he continued to work with his father after founding J. Pierpont Morgan & Co. in the early 1860s.\n\nThrough his New York social circle, Morgan grew close to Amelia \"Memie\" Sturges, the daughter of a successful merchant. Their blossoming romance was jarred by her diagnosis of tuberculosis in 1861, and they quickly married and moved to Algiers with the hope of spurring a recovery. However, despite Morgan's best efforts to nurse his bride back to health, she passed away in February 1862.\n\nDevastated, the young businessman returned to New York and plunged himself into his work. In 1864, at the urging of his father, he paired with senior partner Charles Dabney to form Dabney, Morgan & Co. With Junius Morgan now heading the London banking firm, the Morgans continued to expand their wealth and influence by funneling overseas investments into American businesses.\n\nMeanwhile, Pierpont struck up a new romance with Frances Louisa \"Fanny\" Tracy, the daughter of a New York lawyer. They married in May 1865 and had four children, with son John Pierpont \"Jack\" Morgan Jr. going on to take over his father's business many years later.\n\nRailroad Magnate\n\nWith the retirement of Dabney in 1871, Morgan joined forces with Philadelphia banker Anthony Drexel to found Drexel, Morgan & Co., which took up residence in a towering new building in lower Manhattan. Entering his mid-30s, Morgan was developing into the outsized figure that would dominate the financial world with his enormous frame, piercing eyes and brusque nature.\n\nMorgan's already successful career took a leap forward in 1879 when William Vanderbilt approached him about the sale of 250,000 shares of stock in the New York Central Railroad. Morgan pulled off the massive transaction without driving down the share price, and in return he secured a seat on the New York Central board of directors. The following year, he fronted a syndicate that sold $40 million in bonds to finance the Northern Pacific Railroad, then the largest transaction of railroad bonds in U.S. history.\n\nUnderscoring his influence in the industry, Morgan in 1885 arranged a meeting with the feuding directors of the New York Central and Pennsylvania Railroad aboard his yacht, the Corsair. As they sailed up and down the Hudson River, Morgan made it clear that the yacht would not return to port until they reached a compromise that fostered suitable competition. The executives eventually agreed to terms in what became known as the Corsair Compact.\n\nFinancial Empire and Government Savior\n\nMorgan's life and career took another turn after the death of his father in 1890. Following a decade of railroad consolidation, he broke new ground by arranging the merger of Edison General Electric and Thomson-Houston Company to form General Electric in 1892. Additionally, the lifelong art enthusiast began exponentially expanding an already impressive collection of valuable works.\n\nThe immense scope of Morgan's power came to light in the wake of the Panic of 1893. With U.S. gold reserves seriously depleted, Morgan formed a syndicate of international investors willing to supply gold in exchange for a favorable rate on 30-year bonds. He then reassured a skeptical President Grover Cleveland by citing an obscure 1862 statute that gave the Secretary of the Treasury the power to pull off such a transaction without congressional approval. The syndicate bought and quickly resold the bonds in early 1895, stabilizing the shaky economy.\n\nFollowing the death of Drexel that year, Pierpont again reorganized his company into J.P. Morgan & Co. The firm soon became a major player in the steel industry by financing the formation of Federal Steel in 1898. Three years later, after purchasing Andrew Carnegie’s steel company for nearly $500 million, Morgan merged the entities into U.S. Steel, creating the first billion-dollar corporation.\n\nPresidential Foe and Ally\n\nAlso in 1901, Morgan teamed with James J. Hill to form the Northern Securities Company. Northern Securities held the majority of shares in the Northern Pacific, the Great Northern and the CB&Q railroads, giving Morgan control of approximately one-third of the country's railways.\n\nHowever, he soon encountered resistance from President Theodore Roosevelt, who sought to leverage the populist tide against the wealthy \"robber barons\" of Wall Street. In 1902, the Justice Department charged Northern Securities with violating the Sherman Antitrust Act of 1890. A protracted legal battle was settled when the Supreme Court ruled in favor of the government in 1904.\n\nRegardless, Morgan continued to exert his authority in both industries and in government. In 1903, J.P. Morgan & Co. was appointed fiscal agent for a newly independent Panama, with responsibilities that included overseeing the transfer of $40 million to the New Panama Canal Co.\n\nIn 1907, Morgan again was called to aid the U.S. government in the grips of economic panic. Seeking to stabilize a series of collapsing trust banks, he called several bank presidents to his Manhattan library, and, in an echo of his Corsair meeting of 1885, locked the door until a solution could be reached. After all-night negotiations went nowhere, Morgan ended the stalemate by drawing up a bailout contract and ordering the exhausted presidents to sign.\n\nIn semi-retirement by the time the crisis was resolved, Morgan devoted much of his energy to his art collection and philanthropy. He returned to the spotlight one final time in 1912, when he testified before the Pujo Committee's congressional investigation into the collaborations of Wall Street bankers.\n\nDeath and Legacy\n\nMorgan set sail on an overseas voyage after the hearings, but his health steadily declined, and he died at a hotel in Rome, Italy, on March 31, 1913. To commemorate his passing, the New York Stock Exchange remained closed until noon on the day of his funeral.\n\nMorgan's astounding success transformed the financial industry and left behind a powerful legacy. Although he twice bailed out the U.S. Treasury, his ability to do so left many unsettled, spurring the creation of the Federal Reserve System in late 1913. His name lives on through the massive international banking firm he created, which entered the 21st century as JPMorgan Chase & Co.\n\nAdditionally, the financial giant left behind a personal art collection to rival that of any king. His ornate library was built to house most of his works, which, thanks to the efforts of Jack Morgan, was unveiled to the public in the 1920s with the opening of the Morgan Library & Museum.\n\nQUICK FACTS\n\nName: John Pierpont Morgan\n\nBirth Year: 1837\n\nBirth date: April 17, 1837\n\nBirth State: Connecticut\n\nBirth City: Hartford\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: J.P. Morgan became one of the wealthiest and most powerful businessmen in the world through his founding of private banks and industrial consolidation in the late 1800s.\n\nIndustries\n\nArt\n\n\n\nBusiness and Industry\n\nAstrological Sign: Aries\n\nSchools\n\nGöttingen University\n\n\n\nSillig Institute\n\nDeath Year: 1913\n\nDeath date: March 31, 1913\n\nDeath City: Rome\n\nDeath Country: Italy\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: J.P. Morgan Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/business-leaders/jp-morgan\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: March 26, 2021\n\nOriginal Published Date: April 3, 2014\n\nQUOTES"}, {"url": "https://www.investopedia.com/articles/financialcareers/06/financialanalyst.asp", "page_content": "One of the most coveted careers in the financial services industry is that of the analyst. The main role of a financial analyst is to pore over data to identify opportunities or evaluate outcomes for business decisions or investment recommendations. Financial analysts can work in junior and senior capacities within a firm, and it is a niche that often leads to other career opportunities.\n\nThe financial services industry is competitive, and it can be tough to break into the field. If you're interested in a career as a financial analyst, read on to find out what you can do to prepare yourself for the job.\n\nKey Takeaways A financial analyst pores over data to identify business opportunities or make investment recommendations.\n\nMore junior analysts tend to do a lot of data gathering, financial modeling, and spreadsheet maintenance.\n\nMore senior analysts tend to spend time developing investment theses, speaking with company management teams and other investors, and marketing ideas.\n\nA bachelor's degree in a math or finance-related major is often sought.\n\n1:37 What it Takes to be a Financial Analyst\n\nWhat Is a Financial Analyst?\n\nFinancial analysts examine financial data and use their findings to help companies make business decisions. Often, their analysis is meant to inform the investing decisions of companies.\n\nMore specifically, financial analysts research macroeconomic and microeconomic conditions along with company fundamentals to make predictions about businesses, sectors, and industries. They also often recommend a course of action based on its overall performance and outlook, such as buying or selling a company's stock.\n\nAn analyst must be aware of current developments in the field in which they specialize and prepare financial models to predict future economic conditions for any number of variables.\n\nNot all financial analysts analyze the stock or bond markets or help their employers make investments. Businesses that utilize the franchise model often have financial analysts responsible for tracking individual franchises or groups of franchises within a geographic region. The analysts determine where the strengths and weaknesses lie and make profit and loss forecasts.\n\nRequired Skills and Education\n\nCompared to many high-paying careers, the qualifications to become a financial analyst are much less rigid and well-defined. Unlike law and medicine, no career-wide educational minimums exist. Whether you face any required licensing depends on factors such as your employer and specific job duties.\n\nThat said, in the 21st century, a bachelor's degree—preferably with a major in economics, finance, or statistics—has become a de facto requirement for becoming a financial analyst. Other majors that are looked upon favorably include accounting, math, and even biology and engineering—especially if one is interested in specializing as an analyst in those industries. The competition is too great, and undergraduate or advanced degrees are too common in the job market to have a serious chance of applying for an analyst position with less than a bachelor's degree.\n\nThe big investment banks, where the huge first-year salaries get paid, recruit almost exclusively at elite colleges and universities, such as Harvard University and Princeton University. These MBA graduates are often hired as associates right out of business school.\n\nRegardless of education, a successful career as a financial analyst requires strong quantitative skills, expert problem-solving abilities, adeptness in logic, and above-average communication skills. Financial analysts have to crunch data, but they also have to report their findings to their superiors clearly, concisely, and persuasively.\n\nCertification Exams to Take\n\nIf you are not an MBA graduate student or an economics major as an undergraduate, you may want to consider studying for and taking the Series 7 and Series 63 exams. Keep in mind that participating in the Series 7 exam will require sponsorship from a FINRA member firm or a regulatory organization. In October 2018, FINRA created a new exam called the Securities Industry Essentials (SIE) exam to reduce duplicative testing of knowledge when taking exams to register in multiple categories and to make it easier to enter the securities industry.\n\nWhile the CFA exam is highly technical, the Series 7 and Series 63 exams are other ways to demonstrate a basic familiarity with investment terms and accounting practices. If you look at a sample CFA exam that seems overwhelming, start by taking the SIE and then work your way up to the CFA exam, or begin interviewing for junior analyst positions after passing the SIE. Many institutions also have training programs for candidates who show promise in the field.\n\nTypes of Analyst Positions\n\nThe field of financial analysis is broad, featuring a variety of job titles and career paths. Within the financial/investment industry, the three major categories of analysts are those who work for:\n\nBuy-side firms (investment houses that manage their own funds)\n\nSell-side firms\n\nInvestment banks\n\nFinancial analysts may also work for local and regional banks, insurance companies, real estate investment brokerages, and other data-driven companies. Any business frequently making weighty decisions on how to spend money is where a financial analyst can potentially add value.\n\nBuy-Side Analysts\n\nThe majority of financial analysts work on what is known as the buy-side. They help their employers decide how to spend their money, whether that means investing in stocks and other securities for an in-house fund, buying income properties (in the case of a real estate investment firm), or allocating marketing dollars. Some analysts perform their jobs not for a specific employer but for a third-party company that provides financial analysis to its clients. This shows the value of what a financial analyst does; an entire industry exists around it.\n\nBuy-side financial analysts rarely have the final say in how their employers or clients spend their money. However, the trends they uncover and their forecasts are invaluable in decision-making. With global financial markets evolving faster than ever and regulatory environments changing seemingly daily, it stands to reason that the demand for skilled buy-side financial analysts will only increase in the future.\n\nSell-Side Analysts\n\nAt a sell-side firm, analysts evaluate and compare the quality of securities in a given sector or industry. Based on this analysis, they then write research reports with certain recommendations, such as \"buy,\" \"sell,\" \"strong buy,\" \"strong sell,\" or \"hold.\" They also track the stocks in a fund's portfolio to determine when/if the fund's position in that stock should be sold. The recommendations of these research analysts carry a great deal of weight in the investment industry, including for people employed at buy-side firms.\n\nPerhaps the most prestigious (and highest-paid) financial analyst job is that of a sell-side analyst for a big investment bank. These analysts help banks price their own investment products and sell them in the marketplace. They compile data on the bank's stocks and bonds and use quantitative analysis to project how these securities will perform in the market. Based on this research, they make buy and sell recommendations to the bank's clients, steering them into certain securities from the bank's menu of products.\n\nEven within these specialties, there are subspecialties: analysts who focus on stocks or on fixed-income instruments. Many analysts also specialize even further within a specific sector or industry. An analyst may concentrate on energy or technology, for example.\n\nInvestment Banking and Equity Analysts\n\nAnalysts in investment banking firms often play a role in determining whether or not certain deals between companies, such as initial public offerings (IPOs), mergers, and acquisitions (M&A) are feasible based on corporate fundamentals. Analysts assess current financial conditions–as well as relying heavily on modeling and forecasting–to make recommendations as to whether or not a certain merger is appropriate for that investment bank's client or whether a client should invest venture capital in an enterprise.\n\nAnalysts who help make buy and sell decisions for big banks and who attempt to locate auspicious IPO opportunities are called equity analysts. Their focus is primarily on equity markets; they help find companies that present the most lucrative opportunities for ownership. Typically, equity analysts are among the highest-paid professionals in the field of financial analysis. This is partly a function of their employers; the big investment banks use huge salaries to lure the best talent.\n\nEquity analysts often deal with huge sums of money. When they make a winning prediction, the gain for the employer is often in the millions of dollars. As such, equity analysts are handsomely compensated.\n\nMedian Salary Is Not Mediocre\n\nMost financial analysts make significantly less than those in other professions in the finance industry, particularly in New York City. However, the median annual income for an entry-level financial analyst is significantly higher than the median annual income for a full-time wage or salary worker in the United States overall. For 2021, according to the U.S. Bureau of Labor Statistics (BLS), the average income for any full-time wage or salary worker in the U.S. on a weekly basis was $1,010. For a 40-hour work week, this translates to a yearly income of approximately $52,520.\n\nCompare that to the median annual income for financial analysts across all experience levels in 2021 was $95,570 per year. So, on average, financial analysts start out much better paid than the typical worker, although they may work more than twice as much. It's not unusual for analysts to work 80 or more hours per week.\n\nFinancial Analyst Job Outlook\n\nEmployment-wise, the outlook is good for the financial analyst profession. While it's a competitive field, in 2020 there were around 492,100 total jobs in this field according to the latest available BLS statistics, the profession should grow about 6% in the decade between 2020-2030. The BLS notes:\n\nDemand for financial analysts tends to grow with overall economic activity. Financial analysts will be needed to evaluate investment opportunities when new businesses are established or existing businesses expand. In addition, emerging markets throughout the world are providing new investment opportunities, which require expertise in geographic regions where those markets are located.\n\nWhat to Expect on the Job\n\nFinancial analysts need to remain vigilant about gathering information on the macroeconomic level, as well as gathering information about specific companies, specifically assessing their financial fundamentals via company balance sheets. In order to stay on top of the financial news, analysts will need to do a lot of reading on their own time. Analysts tend to peruse publications such as The Wall Street Journal, The Financial Times, and The Economist, as well as financial websites.\n\nBeing an analyst also often involves a significant amount of travel. Some analysts visit companies to get a first-hand look at operations on the ground level. Analysts also frequently attend conferences with colleagues who share the same specialty as they do.\n\nWhen in the office, analysts learn to be proficient with spreadsheets, relational databases, and statistical and graphics packages. They use these tools in order to develop recommendations for senior management and to produce detailed presentations and financial reports that include forecasting, cost-benefit analysis, and trend analysis. Analysts also interpret financial transactions and must verify documents for their compliance with government regulations.\n\nOpportunities for Advancement\n\nIn terms of interoffice protocol, analysts usually interact with each other as colleagues, while also reporting to a portfolio manager or other more senior management role. A junior analyst may work their way up to senior analyst over a period of three to five years. For senior analysts who continue to look for career advancement, there is the potential to become a portfolio manager, a partner in an investment bank, or a senior manager in a retail bank or insurance company. Some analysts go on to become investment advisors or financial consultants.\n\nSkill Set for Success\n\nThe most successful junior analysts are those who develop proficiency in the use of spreadsheets, databases, and PowerPoint presentations and learn other software applications. Most successful senior analysts, however, are those who not only put in long hours but also develop interpersonal relationships with superiors and mentor other junior analysts. Analysts who are promoted also learn to develop communication and people skills by crafting written and oral presentations that impress senior management.\n\nWhat Is the Job Outlook for a Financial Analyst? According to U.S. government estimates, employment of financial analysts is projected to grow 6 percent from 2020 to 2030 (about as fast as the average for all occupations), with 41,000 new job openings per year. Many of those openings are expected to result from the need to replace workers who transfer to different occupations or exit the labor force, such as to retire.\n\nWhat's the Difference Between a Financial Analyst and an Equity Research Analyst? Financial analysts look at market trends to help with investment decisions or examine financial statements of companies to identify an investment's potential. An equity research analyst instead looks closely at a company's financial information, examining, interpreting, and reporting on the data collected in order to come up with a price target for a stock.\n\nWhat Type of Education Do I Need to Become a Financial Analyst? According to the BLS, a majority of financial analysts hold a bachelor's degree in a field related to finance, including finance and accounting, economics, statistics, analytics, business management, or mathematics.\n\nThe Bottom Line\n\nA career as a financial analyst requires preparation and hard work. It also has the potential to deliver not just financial rewards, but the genuine satisfaction that comes from being an integral part of the business landscape."}]}