{"John Liscio has also appeared on CNBC, Bloomberg TV, and Fox Business News.": [{"url": "https://www.wikiwand.com/en/John_Liscio", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nQuick facts: John Liscio, Born, Died, Alma mater, Occ... ▼\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders.[1] Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.[2]\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}, {"url": "https://www.cnbc.com/2022/07/11/-cnbc-affirms-its-position-as-the-number-1-business-news-brand-in-europe-.html", "page_content": "LONDON, July 6th 2022– CNBC, First in Business Worldwide, today announced that in the recent IPSOS Affluent Europe 2022 survey, it has affirmed its position as the number one business news provider in Europe on a multiplatform basis, driven by a 12% growth at a brand level.\n\nThe IPSOS Affluent Europe 2022 survey covers the top 20% of households across 21 European countries and is based on fieldwork conducted between January-December 2021. The survey is one of the primary research reports advertisers use to determine their target audience reach and engagement, as well as how to allocate their advertising budgets.\n\nThe survey revealed a 6% rise in monthly TV reach and a 23% increase in monthly digital reach for CNBC, contributing to a 12% expansion in monthly multiplatform reach.\n\nCNBC has significantly increased its brand growth in major European markets, specifically by 19% in Germany, 20% in France, and 18% in the UK. The TV channel continues to gain viewers, with the data showing a bounce back in monthly and daily viewers following the pandemic. CNBC reaches 6.1 million affluent adults across Europe, making it the top business TV station in nearly every territory covered by IPSOS. Digital growth has also outpaced the rise seen by most of competitor brands.\n\nJohn Casey, President and Managing Director of CNBC International said, \"These results reflect the incredible work done by the CNBC editorial teams in providing actionable insights on air and online, chronicling developments in an ever-changing world and drawing out the key links for market participants.\"\n\n__________________________________________________________________________________________________________________\n\nAbout CNBC International\n\nCNBC International is the leading international business and financial news network. Its mission is to help the influential and aspirational to make astute decisions to get ahead. With international headquarters in London, Singapore and Abu Dhabi, CNBC International provides consumers with a 24-hour global business briefing.\n\nIn addition to its global TV channel, available in more than 365 million households worldwide, CNBC.com provides users with video, real-time market analysis, web-exclusive live video and analytical financial tools. CNBC International's award-winning content can also be found on Facebook, Twitter, Instagram, YouTube and LinkedIn.\n\nCNBC International is a division of NBCUniversal. For more information, visit www.cnbc.com.\n\nMedia Contact:\n\nArabella Benson\n\nCommunications Manager, International\n\narabella.benson@nbcuni.com"}, {"url": "https://www.nytimes.com/2000/12/09/business/john-liscio-51-bond-newsletter-publisher.html", "page_content": "John Liscio, who wrote and published The Liscio Report, a financial newsletter, died on Nov. 29 at Mount Sinai Hospital in Manhattan. He was 51 and lived in Upper Montclair, N.J.\n\nThe cause was liver and kidney failure related to hepatitis C, said his wife, Frances.\n\nMr. Liscio, whose motto was ''To trust is good, not to trust is better,'' founded his influential bond market newsletter in 1992 after working briefly as a senior editor of U.S. News & World Report. In the late 1980's and early 90's, he was on the staff of the financial weekly Barron's.\n\nIn October, Barron's said that Mr. Liscio had made a success of himself on his own, writing for the last eight years The Liscio Report, ''an astute and irreverent look at the credit markets and economy.''\n\nMr. Liscio told Barron's at that time: ''I don't try to forecast. I don't think forecasting is something within the realm of human possibility.'' But he had made a reputation for himself by forecasting the recession in the early 1990's."}, {"url": "https://www.prnewswire.com/news-releases/richard-bernstein-advisors-names-dan-suzuki-deputy-cio-300981227.html", "page_content": "NEW YORK, Jan. 6, 2020 /PRNewswire/ -- Richard Bernstein Advisors (RBA), one of the largest ETF Strategist investment firms with a focus on top-down macro asset and equity allocation announced today that Dan Suzuki will take on additional responsibilities as Deputy CIO reporting to both Richard Bernstein, RBA's CIO and CEO, and John McCombe, RBA's President.\n\nDan Suzuki, Deputy CIO, Richard Bernstein Advisors\n\n\"Dan has excelled during his tenure here,\" Richard Bernstein noted. \"As our firm enters its second decade, we want our investors to fully recognize RBA's deep investment team beyond just me. We see this as a natural progression for both Dan and the firm from the investment side, as well as, representing RBA with clients or in the media.\"\n\nJohn McCombe added, \"We have seen strong organic growth the last several years and Dan is well suited to help continue that growth through his investment acumen and strong media and client presence.\"\n\nPrior to joining RBA in 2018, Dan served as Senior Equity Strategist at Bank of America Merrill Lynch Global Research where he worked for over 15 years. Dan is a frequent guest on CNBC, Bloomberg TV, and Fox Business News, and is often quoted in leading financial publications, including The Wall Street Journal, Financial Times, and Barron's. Dan has a BS in Economics from Duke University and is a CFA charterholder.\n\n\"I'm excited to continue my journey at RBA working alongside Rich and the broader team,\" Suzuki said. \"RBA offers a unique approach to investing that focuses on fundamentals via an arsenal of inhouse strategic indicators that are based on Rich's almost 40-year career. Performance is critical, and investors have more choices than ever. I hope to continue to add value along with my colleagues in generating attractive returns with the appropriate amount of risk for our investors.\"\n\nAbout Richard Bernstein Advisors\n\nRichard Bernstein Advisors LLC is an investment manager focusing on long-only, global equity and asset allocation investment strategies. RBA runs ETF asset allocation SMA portfolios at leading wirehouses, independent broker/dealers, TAMPS and on select RIA platforms. Additionally, RBA partners with several firms including Eaton Vance Corporation and First Trust Portfolios LP, and currently has $9.2 billion collectively under management and advisement as of November 30th, 2019. RBA acts as sub‐advisor for the Eaton Vance Richard Bernstein Equity Strategy Fund, the Eaton Vance Richard Bernstein All‐Asset Strategy Fund and also offers income and unique theme‐oriented unit trusts through First Trust. RBA is also the index provider for the First Trust RBA American Industrial Renaissance® ETF. RBA's investment insights as well as further information about the firm and products can be found at www.RBAdvisors.com.\n\n© Copyright 2020 Richard Bernstein Advisors LLC. All rights reserved.\n\nNothing contained herein constitutes tax, legal, insurance or investment advice, or the recommendation of or an offer to sell, or the solicitation of an offer to buy or invest in any investment product, vehicle, service or instrument. Such an offer or solicitation may only be made by delivery to a prospective investor of formal offering materials, including subscription or account documents or forms, which include detailed discussions of the terms of the respective product, vehicle, service or instrument, including the principal risk factors that might impact such a purchase or investment, and which should be reviewed carefully by any such investor before making the decision to invest. RBA information may include statements concerning financial market trends and/or individual stocks, and are based on current market conditions, which will fluctuate and may be superseded by subsequent market events or for other reasons. Historic market trends are not reliable indicators of actual future market behavior or future performance of any particular investment which may differ materially, and should not be relied upon as such. The investment strategy and broad themes discussed herein may be unsuitable for investors depending on their specific investment objectives and financial situation. Information contained in the material has been obtained from sources believed to be reliable, but not guaranteed. You should note that the materials are provided \"as is\" without any express or implied warranties. Past performance is not a guarantee of future results. All investments involve a degree of risk, including the risk of loss. No part of RBA's materials may be reproduced in any form, or referred to in any other publication, without express written permission from RBA. Links to appearances and articles by Richard Bernstein, whether in the press, on television or otherwise, are provided for informational purposes only and in no way should be considered a recommendation of any particular investment product, vehicle, service or instrument or the rendering of investment advice, which must always be evaluated by a prospective investor in consultation with his or her own financial adviser and in light of his or her own circumstances, including the investor's investment horizon, appetite for risk, and ability to withstand a potential loss of some or all of an investment's value. Investing is subject to market risks. Investors acknowledge and accept the potential loss of some or all of an investment's value. Views represented are subject to change at the sole discretion of Richard Bernstein Advisors LLC. Richard Bernstein Advisors LLC does not undertake to advise you of any changes in the views expressed herein.\n\nCONTACT:\n\nJordan Rosen\n\n(212) 692-4028\n\n[email protected]\n\nSOURCE Richard Bernstein Advisors\n\nRelated Links\n\nhttp://www.rbadvisors.com\n\n"}, {"url": "https://talkingbiznews.com/they-talk-biz-news/cnbc-fox-business-bloomberg-television-and-market-share/", "page_content": "TALKING BIZ NEWS EXCLUSIVE\n\nWith Fox Business Network announcing Tuesday that it would start having its shows tracked by Nielsen in terms of audience size, Talking Biz News decided to see what available information was already out there in terms of business news audiences on television.\n\nData is already available for CNBC and Fox Business Network, but scarce to find for Bloomberg Television.\n\nAccording to the 2010 Mendelsohn Affluent Survey, which looks at heads of households with more than $100,000 in annual income, CNBC has an audience of just less than 13.1 million viewers. That’s almost twice the number of viewers of Fox Business Network, which has 5.3 million such viewers, and Bloomberg Television, which has 2.6 million such viewers, combined.\n\nFrom the same Mendelsohn survey, CNBC reaches about one third of all C-level executives and about 30 percent of all affluent consumers. Fox Business reaches more than 10 percent of affluent consumers, and about 14 percent of C-level executives.\n\nBoth CNBC and Fox Business reach more C-level executives and affluent consumers than any other business media, including The Wall Street Journal, Bloomberg Television and Yahoo Finance, according to the Mendelsohn survey.\n\nAccording to Nielsen Marketbreaks data for the first quarter through March 22, CNBC has an audience of 269,000 viewers when the stock market is open — from 9:30 a.m. to 4 p.m. EST. In comparison, Fox Business Network has 57,000 viewers during the same time period. In the key demographic of 25 to 54 year olds, CNBC has 55,000 viewers during that time period, while Fox Business has 8,000 viewers.\n\nIn terms of market share, that gives CNBC an 83 percent share and Fox Business a 17 percent share of the total audience during market hours.\n\nDuring the business day, CNBC’s audience is 219,000, with 53,000 of those being between 25 and 54 years old, for the first quarter through March 22. Fox Business Network’s audience is again 57,000 viewers, with 11,000 in the key 25- to 54-year-old demographic. In terms of market share, CNBC has a 79 percent share of the business day audience, compared to 21 percent for Fox Business.\n\nThe data for Fox Business includes “Imus in the Morning.”\n\nNielsen estimates that CNBC is currently in 98.4 million homes, while Fox Business Network is in 57.3 million homes. In October 2007, when Fox Business launched, it was in 30 million homes compared to 94.8 million homes for CNBC at that time."}, {"url": "https://www.investopedia.com/articles/investing/102015/how-bloomberg-makes-billions-hint-not-just-news.asp", "page_content": "One of the most successful limited partnerships in existence, Bloomberg L.P. bills itself as “the global business and financial information and news leader.” Bloomberg’s founder and former mayor of New York, Michael Bloomberg, owns 88% of the company’s stock, making him one of the dozen or so richest men on the planet. The privately-held company is believed to generate over $10 billion in annual revenue, the large majority of that courtesy of its Professional Services division, which began with the inescapable Bloomberg terminals. Obligatory for almost anyone with an occupation in finance, the terminals and their software-as-a-service successors offer comprehensive and vital information to 320,000 paying customers around the world.\n\nWhile the bulk of Bloomberg's money comes from Professional Services, the company has several other subsidiaries, the most notable of which are its news-gathering operations via Bloomberg News. Investopedia readers are probably also familiar with Bloomberg Television. The 24-hour network is an anomaly in that it runs more live programming than competitors CNBC and Fox Business Network. Bloomberg Television also offers a deeper analysis and less light entertainment than the other financial broadcasters, which often air infomercials, paid programming, and repeat broadcasts throughout much of the day. Bloomberg Television also offers regional channels of international interest in the Philippines, India, Turkey, Canada, and other destinations.\n\nKey Takeaways Bloomberg LP is a global media and financial data and analytics conglomerate.\n\nThe company generates revenue from subscriptions and fees associated with Bloomberg terminals as well as a variety of other services including Bloomberg News and Bloomberg Business, focused on venture capital, brokerage, and more.\n\nBloomberg terminals are essentially unrivaled within the finance world and have contributed to the company's massive growth in its 39-year history.\n\nHistory of Bloomberg\n\nBloomberg was founded in 1981 as Innovative Market Systems and has since grown into a major international operation employing more than 20,000 individuals. The central component of the company—the Bloomberg terminal, which provides real-time market data and analytics—was already in place at the founding. Over the years, Bloomberg has acquired a variety of competitors across different industries, including media (New York radio station WNEW and BusinessWeek magazine), data companies (New Energy Finance), and even government and legal entities (Bureau of National Affairs).\n\nAs a privately-held company, details of Bloomberg's financials can be difficult to come by. However, a report by Business Insider indicated that the company generated more than $10 billion in revenue in 2018.\n\nFast Fact Bloomberg founder and former mayor of New York City Michael Bloomberg launched the company in 1981 after receiving a settlement when his former firm, Salomon Brothers, was acquired.\n\nBloomberg's Business Model\n\nBloomberg has parlayed its tremendous brand recognition into a widely-diverse array of product offerings. Central to the company is the Professional Services wing, which at some points in Bloomberg's history has accounted for close to 90% of its yearly revenue. This product, also known as the Bloomberg terminal, is the computer system that analyzes and generates real-time market and financial information for finance professionals.\n\nOne of the company's fastest-growing areas is data analytics. This includes a wide variety of products, including Portfolio Management & Analytics products, Real-Time & Trading Data products, and more.\n\nBloomberg News is the company's news service branch, responsible for delivering news content to Bloomberg terminal users and across a variety of the company's subsidiary media channels, including Bloomberg Television, Bloomberg BusinessWeek, and Bloomberg Radio.\n\nBloomberg Law is another of the most significant branches of the company. Launched in 2010, Bloomberg Law is a subscription service providing access to real-time legal data for research purposes. Bloomberg Government provides a similar service for government professionals.\n\nThroughout its history, Bloomberg has also launched a venture capital wing (Bloomberg Beta), an agency brokerage (Bloomberg Tradebook), and many other arms as well.\n\nBloomberg's Professional Services Business\n\nBeing a Bloomberg Professional Services customer isn’t for the penurious, not at an annual cost between $20,000 and $24,000. That isn’t the company’s only subscription service, nor is it the most expensive. Bloomberg Law and Bloomberg Government sell specialized information for, you guessed it, lawyers and those who work in politics, respectively. The former service costs approximately $475 per subscriber per month, the latter $5,700.\n\nBloomberg's terminal revenues for 2018 accounted for approximately 76.6% of all company revenues, according to a report by analyst Jennifer Milton.\n\nBloomberg's Law Business\n\nBloomberg Law opened for business in 2010, and its model is unusual in comparison to its established competitors such as LexisNexis. The former charges a flat monthly fee, rather than per use. Bloomberg Law subscribers can learn about breaking decisions, which judge owns how many shares of which publicly-traded company, the implications of the latest sections added to the existing ones of the Internal Revenue Code, and more. Yes, that information might be available to anyone willing to dig for it, but Bloomberg knows digging can be labor-intensive and daunting for its customers.\n\nBloomberg's Government Business\n\nFor $5,700 a month, Bloomberg Government will tell you which bills are passing through which houses at what level at what time, and even when non-legislative regulations change. Care to know what happened during the Senate Appropriations Committee’s last meeting? Probably not, but if you do, Bloomberg Government will gladly give you access to a full transcript, from opening to adjournment. Rely on the Senate’s own devices to tell you which Senator stuck which foot in his or her mouth, and you could literally be waiting years. Bloomberg Government will tell you almost instantly. The inefficiency and sclerosis of the legislative process might be tiresome for ordinary voters, but it offers a market opportunity for Bloomberg.\n\nBloomberg's Venture Capital Business\n\nFinally, there’s Bloomberg Beta, the limited partnership’s venture capital firm. Appropriately ensconced in Silicon Valley, the $75-million fund has put its money into some startups that have become famous, such as Codeacademy, the online programming tutorial warehouse that claims 24 million users. Other Bloomberg Beta investments, such as Newsle (a news service that delivers stories about one’s favorite personal contacts) don’t appear to have quite as broad an appeal, but Newsle did sell to LinkedIn Corp. for an undisclosed amount in 2014.\n\nAccording to Bloomberg Beta’s own manual, made available to the general public, venture capital operations offer a relatively inexpensive way for Bloomberg to detect startup trends before they become too well-publicized or expensive. Bloomberg Beta was created to stand on its own merits and turn a profit rather than be bankrolled by the existing Bloomberg businesses.\n\nFast Fact Bloomberg's fastest-growing revenue stream for 2018 was research products.\n\nBloomberg's Other Businesses\n\nBloomberg also operates a handful of other, smaller concerns, such as its enterprise data management division, PolarLake, which manages and interprets complex data sets for clients both large and small, saving them money and time. There’s also Bloomberg View, the editorial counterpart to the Bloomberg News service. Bloomberg View has a roster of renowned columnists whose work is syndicated in various print publications and online. Again, all this is minor compared to the billions upon billions brought in by Bloomberg Professional Services. Bloomberg is under no obligation to disclose which of its departments make how much money, but any observer can calculate just how much the company’s biggest division earns relative to the other divisions.\n\nFuture Plans\n\nThroughout its history, Bloomberg has been in the position of either brash new competitor or individual player with a market unto itself. Rarely has it been the legacy company facing off against young and nimble competitors, at least not until the advent of Symphony, the Alphabet Inc. backed company that threatened to eat into Bloomberg’s large profits.\n\nBut Bloomberg is still the go-to service for hundreds of thousands of financial professionals who swear by its ease of use and reliability. This is enough to justify Bloomberg’s high price tags. Even the infamous 2013 privacy breach, which inadvertently or otherwise allowed company reporters access to customers’ personal information, was but a temporary blip. Somehow Bloomberg came out of the scandal without sustaining any long-term damage.\n\nIn 2018, Bloomberg continued a long-term process of diversifying its revenue streams. While Bloomberg terminals still enjoy what is essentially a monopoly, that may not be the case forever. With non-terminal revenues totaling about 23% for 2018, an increase of about 9% over the previous year, it's possible that the company will continue to search for other ways to generate revenue into the future.\n\nKey Challenges\n\nBloomberg has enjoyed being the dominant player in what has essentially been an industry of one for most of its existence. That being said, the company has not taken that for granted, and in nearly four decades has grown its list of offerings tremendously. With greater diversification—outside of the Bloomberg terminal product, or even outside of the world of finance altogether—comes the increased likelihood that the company will weather future storms.\n\nBloomberg has faced legal troubles in its past, including a 2007 class action suit regarding female employees and maternity leave, and it has also faced challenges related to data breaches, as indicated above. Newcomers in the finance data analytics field have come and gone, but that's no guarantee of Bloomberg's dominance in the future. Still, though, it seems unlikely that this dominant company is going anywhere anytime soon."}, {"url": "https://www.bloombergmedia.com/talent/people/jonathan-ferro/", "page_content": "Jonathan Ferro is the co-anchor of “Bloomberg Surveillance” on Bloomberg Television and Radio, weekdays from 6-9am ET. He is also the anchor of “Bloomberg Markets: The Open” on Bloomberg Television, weekdays from 9-10am ET and the weekly program “Bloomberg Real Yield,” Fridays from 1-1:30pm ET.\n\nFerro has interviewed numerous central bank officials from the Federal Reserve, European Central Bank and the Bank of England. He has also interviewed many of the world’s most influential business leaders, including the CEOs of Adidas and Shell, as well as the Chairmen of HSBC and Barclays.\n\nPrior to moving to New York, Ferro was based in Bloomberg’s European headquarters in London where he anchored “On The Move.”\n\nHe earned his Masters degree in International Political Economy from the University of Warwick, with distinction."}, {"url": "https://www.businessinsider.com/fox-business-beating-cnbc-embracing-politics-2017-10", "page_content": "FBN's competitors acknowledge the network's success in wooing a larger audience. But critics argue the network has gotten there by deviating from its implied purpose. Anaele Pelisson/Business Insider\n\nRoger Ailes never thought Fox Business Network would work.\n\nWhen Rupert Murdoch asked the former Fox News CEO to launch the network, Ailes voiced his doubts to the executive chairman of 21st Century Fox, saying, \"The world doesn't need another business network.\"\n\n\"Rupert Murdoch was smarter than both of us in retrospect,\" Neil Cavuto, senior vice president and managing editor of business news, told Business Insider.\n\n\"His view — a patient, long-term view — was that the other guys sucked, so that we were going to suck less, and then we were going to do a lot better.\"\n\nA decade since the network's inception, Fox Business Network believes it is in perhaps in its best position yet.\n\nDespite sexual-harassment scandals that have roiled FBN and its sister network, over the past three years the network's Nielsen ratings ratings have skyrocketed.\n\nFor critics of the network, its success has little to do with a growing interest in the way FBN covers the markets and more to do with its lineup of right-leaning programming and embrace of President Donald Trump's economic and cultural vision.\n\nOn Monday, \"Fox & Friends Weekend\" anchor Pete Hegseth appeared on \"Fox & Friends First\" to slam Sgt. Bowe Bergdahl, who pleaded guilty to desertion and misbehavior for walking off his base in Afghanistan in 2009.\n\n\"The least he could do is serve behind bars for the rest of his life,\" Hegseth said. \"Most of us would say he should be put to death for it. This was a treasonous act.\"\n\nA few hours later on FBN's \"Varney & Co.,\" Hegseth made virtually identical remarks.\n\n\"Frankly, a lot of us feel like he's a traitor who should be executed. Life in prison is the least this guy should get,\" he said.\n\nThe moment typified what some critics and others view as a key formula to FBN's success: Its embrace of the political red meat that tantalizes cable news viewers.\n\nFBN beat CNBC — the longtime television business news juggernaut — in total viewers for a week for the first time in September 2016, a milestone that it has repeated consistently for the past year. The network is profitable and has 17 times the number of advertisers it did when it launched a decade ago, and has won some key recent business news days, including on Snapchat IPO's and when the Dow crossed recent milestones.\n\nFBN's competitors privately acknowledge the network's success in wooing a larger viewing audience. But critics, including more than a half-dozen former employees, suggest that the network has gotten there by deviating from its implied purpose.\n\n\"The question is, how much longer can you call it a business network?\" one former top-level employee asked, requesting anonymity to speak freely about working at FBN.\n\nFBN's Neil Cavuto. AP Photo/Seth Wenig\n\n'A contradiction we lived with'\n\nFBN first hit the air on October 15, 2007, launching with the goal of \"demystifying\" televised business news for regular viewers, betting that if the network eschewed business jargon, it'd make financial news more easily understandable and digestible.\n\n\"We didn't assume that everybody is a chief financial officer, and knows what fed funds futures are,\" longtime anchor Liz Claman — who decamped from CNBC and joined the network in its infancy — said in a phone interview.\n\nBut almost immediately, the network faced problems.\n\nMany critics wrote off Fox Business as unserious, and in its first several years, the network went through a number of major lineup changes.\n\nThe network's early-morning shows failed to attract ratings, so in 2009 FBN hired controversial shock jock Don Imus, which resulted in an immediate viewership boon but ceded airtime to a host with little interest in serious markets news that drove rival business radio and television programs in the same time slot.\n\nIt wasn't just the early-morning shows that were in trouble. In 2012, the network canceled its entire primetime lineup, choosing to replay earlier programming in the evening.\n\nPart of the turnover was the result of an internal identity crisis as the fledgling network was figuring out how seriously to embrace the ratings force that had made Fox News' opinion programs successful — a heavy diet of politics news and a right-leaning political agenda.\n\nA number of earlier higher-ups were more committed to traditional business coverage with a Fox News tint.\n\nIn an internal memo in 2011, then executive vice president Kevin Magee urged staffers not to \"imitate our sibling network\" because audiences would choose Fox News over Fox Business Network.\n\nBut at the same time the network was seeing positive ratings for shows led by some of their most opinionated hosts, including Imus, Lou Dobbs — who decamped from CNN after embracing birther conspiracies and hardline anti-illegal-immigration positions — and Stuart Varney, a right-leaning veteran of CNBC and CNN who has been critical of The New York Times and Hollywood.\n\n\"There was a contradiction we lived with,\" one former top Fox Business staffer said.\n\nOver the past several years, the network has more fully embraced political coverage and opinion segments.\n\nThe network shook up its leadership structure, promoting Gary Schreier and Tom Bowman to senior vice president of programming and vice president of programming. Former colleagues said they were stronger producers for politics and general topics than their predecessors.\n\nIt has also become a bigger pipeline to Fox News. Though hosts such as Varney and Cavuto have had a presence on both networks for years, others such as Melissa Francis appear regularly on FBN's larger sister network. Other hosts like Maria Bartiromo have weekend shows on Fox News, a sort of dual citizenship that former network higher-ups were initially hesitant to give to many hosts.\n\nEarlier this year, The Daily Beast found that the network used phrases like \"liberal media\" and \"left-wing media\" more than Fox News during the same time frame.\n\nA similar audit last week of the use of the same terms yielded essentially identical results between Fox News and FBN, though the vast majority of the uses of the terms were on Fox News' \"Hannity\" and FBN's \"Lou Dobbs Tonight.\"\n\nAnd according to an Adweek analysis earlier this month, Trump was mentioned 390 times during FBN's program day, compared to 172 times on CNBC.\n\n\"It's been a network that's been shameless in a way that even Fox News has never been,\" said John Whitehouse, who monitors the network for Media Matters, the left-leaning media watchdog. \"Whatever journalism you have at Fox News, if you take that journalism out, you have a wildly pro-Trump network.\"\n\nCavuto and Bartiromo with Wall Street Journal editor Gerry Baker at a Republican presidential debate in 2015. AP Photo/Morry Gash\n\nMany of the top figures at the network say that FBN hasn't shifted to covering politics more so than any other network, noting that some hosts like Cavuto have criticized the president.\n\nFBN higher-ups publicly attribute the network's success to increased visibility during the presidential debates and a broader availability. The network launched a decade ago in 30 million homes; it now reaches 80 million.\n\nBowman, the vice president of programming at FBN, said in an interview with Business Insider that their \"approach to business news has changed,\" saying the network had spent years \"trying to do CNBC at their own game.\" But he pushed back against the notion that FBN was changing its mission to cover politics.\n\n\"We don't have an agenda,\" Bowman said. \"We were just covering the news and covering things that people care about, and they care about their pockets.\n\n\"If we're going to be labeled as doing too much politics, I think that's very unfair,\" he added. \"A businessman in the White House focusing on economic issues is a great story and a great storyline for business.\"\n\nSchreier, the senior vice president of programming, pointed out that the network continues to nab major business guests, and said that if competitors were critical of FBN's editorial decisions to cover the Trump administration closely, they were \"really being critical of themselves being slower.\"\n\n'Hunting season'\n\nWhile there was a push and pull over politics over the years, one goal was always clear: Murdoch and Ailes' commitment to beating CNBC.\n\nIn the press tour before Fox Business' launch, then-CEO Ailes repeatedly targeted the network he used to helm, saying CNBC's audience was FBN's prime target, mocking the infomercials the network ran on the weekends and accusing it of stealing ideas from FBN before it even launched.\n\nOn its first day on the air, FBN reporter Liz Macdonald stood outside CNBC's headquarters in New Jersey and declared it was \"hunting season.\"\n\nCNBC was initially frightened of its competitor, having seen how Ailes helped shape CNBC and push Fox News ahead of CNN and MSNBC.\n\n\"CNBC got extremely concerned,\" Claman said of her time at CNBC in the months before FBN's launch. \"Every once in a while, someone from the management floor would run down and say, 'Going into every break, start saying \"America's Business Network,\"' because they thought that's how Fox would attack a successful business network.\"\n\nStill, the timing was difficult for FBN. The network was starting out during the early stages of the recession.\n\nCNBC's ratings rose during the financial crisis as it embraced politics, allowing its hosts to take more opinionated stances and increasing coverage of Washington's response to economic crises brought on by the collapse of the housing market in 2008. But over the past year the network's ratings have stagnated.\n\nLast quarter, FBN averaged 187,000 total viewers for its business-day programming, which it measures between 9:30 a.m. and 5 p.m., while CNBC averaged 152,000 during the same period and dipped 30% from the same quarter last year in advertisers' coveted demographic of 25- to 54-year-old viewers.\n\nFor CNBC the caveats abound.\n\nIn total day programming, the network continues to beat FBN among younger viewers, which matter more to advertisers. CNBC beats FBN in the traditional prime-time evening hours, and \"Squawk Box\" beats FBN's \"Mornings With Maria,\" which occupies a key time slot before the markets open.\n\nIn 2015, CNBC abandoned Nielsen ratings, a measurement system that many in the television industry believe is an inaccurate tool for measuring ratings, saying they did not accurately measure where CNBC believes its daytime audience is — in offices, executive suites, and on trading floors.\n\nInstead, CNBC switched to Cogent and IPSOS, which show that CNBC reaches an audience that is younger than the audience that tunes into FBN. A recent IPSOS study claimed that, by its measurements, CNBC had a more than 53% share of total business-news viewership, more than Bloomberg and FBN combined.\n\nStill, FBN insists that CNBC happened to abandon Nielsen at the moment when it was most beneficial for it to use other ratings sources. Indeed, the longtime business leader had no problem mocking Fox Business about its Nielsen ratings when Fox's numbers were poor.\n\n\"I do find it interesting that the very same people who were touting their own success, their own ratings and rubbing our noses in the dirt — when the numbers change for them, all of a sudden the data wasn't quite right,\" Cavuto said. \"I'd love to say ... there are different ways to score a baseball game or different ways to score a football game. But it's generally who has the most points.\"\n\nFBN has also continued to fill its lineup with talent from CNBC.\n\n\"They all feel like they survived a jailbreak,\" Cavuto said of CNBC ex-pats working at FBN. \"You know, before they were making hostage tapes and now they're able to just be real. No one is policing their emotions.\"\n\n'Their success was sort of overshadowed by whatever else was going on'\n\nDespite its ability to tout its ratings dominance over CNBC, FBN still faces a number of problems.\n\nProminent Trump supporter and TV pundit Scottie Nell Hughes sued Fox News last month, claiming she was raped by FBN anchor Charles Payne and subsequently blacklisted by the network. The lawsuit came after Payne was suspended from FBN for two months after harassment allegations but was cleared to return to the air (though the circumstances of the internal investigation remain private).\n\nFBN higher-ups said that the departure of Ailes, former host Eric Bolling, and others amid harassment allegations have affected staff.\n\n\"It's impacted the rank and file,\" Bowman, the vice president of programming, said. \"What we've tried to do as managers is have an open-door policy and just tell the staff that they should keep their head down and work and do their jobs, and some things are beyond their control.\n\n\"I really think the only drawback that the staff probably saw was that their success was sort of overshadowed by whatever else was going on.\"\n\nBut FBN likely faces a larger industry-wide problem in the coming years.\n\nThe easy accessibility of to-the-second markets information online has cannibalized some of the audience for televised markets information during the peak hours of investing. Fewer physical investors also helped contribute to a ratings dip across all the networks just a few years ago as more investing decisions have been made by algorithms.\n\nFBN president Brian Jones said his No. 1 concern was attracting a younger audience, as the average Fox Business Network viewer is 68 years old — compared with 67 for CNBC — and programs in key demographics are even older. Fox says the median age for \"Mornings With Maria,\" in the coveted 6 a.m. slot, is 67.\n\n\"It's a problem,\" Bowman said. \"A lot of people in your generation are cutting cords and they don't rely on television ... So our challenge is in developing younger talent.\""}, {"url": "https://www.businessinsider.com/women-of-bloomberg", "page_content": "Last week we introduced you to all 35 female anchors and reporters at CNBC.\n\nThe feature was such a hit that we thought it would only be fair to take a look at CNBC's competition: Bloomberg TV.\n\nAcross all of Bloomberg TV's international bureaus, there are 28 female on-air personalities.\n\nSome of them came from CNBC (just like eight of the CNBC ladies came from Bloomberg).\n\nAnd there have been some recent additions: Melissa Long (from CNN.com), Cali Carlin (from CBS News), Margaret Brennan (from CNBC) and Gigi Stone (from ABC) have all joined Bloomberg TV since 2009, reportedly because the network has been trying to ramp up its competition not with CNBC, but with Fox.\n\nAlso, one of these gals was Miss Jamaica Universe 2001! But you'll have to click through to find out who it is.\n\nNow..."}, {"url": "https://www.politico.com/blogs/media/2013/02/at-cnbc-a-strict-guest-policy-157149", "page_content": "On Media Blog Archives Select Date… December, 2015 November, 2015 October, 2015 September, 2015 August, 2015 July, 2015 June, 2015 May, 2015 April, 2015 March, 2015 February, 2015 January, 2015\n\nAt CNBC, a strict guest policy\n\nPro tip for financial executives and billionaire investors: If you want to appear on CNBC on Tuesday, do not give an interview to Bloomberg TV on Monday.\n\nCNBC, until recently the only player in the financial television news game, has established a strict, some say ruthless, policy for its guests: Come to us first, or don't come to us at all.\n\nIn interviews with POLITICO, current and former CNBC guests, including financial executives from major American companies, said that they had to decline booking requests from rival networks, including Bloomberg TV and Fox Business, due to \"CNBC rules.\" Some said their appearance on a rival network had resulted in CNBC cancelling a previously scheduled booking.\n\n\"CNBC always wants to be first, so they will insist on having the first interview or they will not cover you,\" one financial services executive told POLITICO. \"That's true even if it's a day later on a totally different topic. It's juvenile.\"\n\n\"If they see you on a competing channel they won't invite you back for a week or so,\" said one source who was formerly a regular guest on CNBC. \"They'll call and ask if you've been on another network. If you say, 'Yes,' then they won't invite you. If you say, 'No,' they'll book you and ask you to hold a time. But then they might cancel the booking at the last minute. I don't know of any other channel that does this.\"\n\nThe extent of the freeze-out varied, according to sources who had experienced it. Some said it was only for a 24-hour period, others a 48-hour period. One said he was forced to turn down a Thursday booking with a rival network because he was scheduled to appear on CNBC the Tuesday of that same week.\n\nBrian Steel, senior vice president of public relations at CNBC, did not directly dismiss the charge, though he noted that there was no written policy regarding guests' appearances on other networks.\n\n\"I spoke with several reporters and checked our news practices and guidelines manual and I could not find the policy,\" he told POLITICO. \"However, nobody seemed surprised that CEOs would cancel appearances on other networks to appear on CNBC first.\"\n\nThat attitude indicates just how long CNBC has been the top — and until recently, the only — player in the financial television news business. But in recent years, Bloomberg TV has gained traction. The exact growth is hard to measure, because Bloomberg TV is not rated by Nielsen. But its access to the full resources of the Bloomberg media and financial services empire, including the Bloomberg terminal, have made it an influential player on Wall Street. As a result, some sources said, CNBC's booking strategy had become stricter.\n\nAndrew Morse, the head of Bloomberg TV, declined to comment on CNBC's practices, but said that blocking guests from rival networks was harmful to the free flow of information.\n\n\"I can't comment on the specifics here, but we're in the news business. It's a contact sport. That said, I believe it's our job to report the news, and to be sure that we don't, in any way, impede the free flow of news for our audience,\" he said.\n\nBooking is a cut-throat business across the television industry, as evidenced by the competition between morning network shows like NBC's \"Today\" and ABC's \"Good Morning America.\" But sources said they didn't know of any channel that would forgo a high-profile guest solely because he or she had already appeared on another network.\n\n\"Of course Bloomberg would like to have you first. But they'd rather have you second then not have you at all, and they tend to be adults about it,\" a financial executive said. \"CNBC is the only one who is petulant about it. It's so junior-high it's absurd.\""}]}