{"John Liscio founded his own firm, John Liscio Report, in 1982.": [{"url": "https://www.wikiwand.com/en/John_Liscio", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nQuick facts: John Liscio, Born, Died, Alma mater, Occ... ▼\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders.[1] Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.[2]\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}, {"url": "https://www.nytimes.com/2000/12/09/business/john-liscio-51-bond-newsletter-publisher.html", "page_content": "John Liscio, who wrote and published The Liscio Report, a financial newsletter, died on Nov. 29 at Mount Sinai Hospital in Manhattan. He was 51 and lived in Upper Montclair, N.J.\n\nThe cause was liver and kidney failure related to hepatitis C, said his wife, Frances.\n\nMr. Liscio, whose motto was ''To trust is good, not to trust is better,'' founded his influential bond market newsletter in 1992 after working briefly as a senior editor of U.S. News & World Report. In the late 1980's and early 90's, he was on the staff of the financial weekly Barron's.\n\nIn October, Barron's said that Mr. Liscio had made a success of himself on his own, writing for the last eight years The Liscio Report, ''an astute and irreverent look at the credit markets and economy.''\n\nMr. Liscio told Barron's at that time: ''I don't try to forecast. I don't think forecasting is something within the realm of human possibility.'' But he had made a reputation for himself by forecasting the recession in the early 1990's."}, {"url": "https://peoplepill.com/people/john-liscio/", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders. Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}, {"url": "https://www.crunchbase.com/organization/liscio", "page_content": "Headquarters Location\n\nNumber of Employees\n\nIPO Status\n\nWebsite\n\nCB Rank (Company)\n\nTotal number of Crunchbase contacts associated with this organization\n\nTotal number of employee profiles an organization has on Crunchbase\n\nTotal number of organizations similar to the given organization\n\nPremium Feature\n\nDescriptive keyword for an Organization (e.g. SaaS, Android, Cloud Computing, Medical Device)\n\nWhere the organization is headquartered (e.g. San Francisco Bay Area, Silicon Valley)\n\nDate the Organization was founded\n\nFounders of the organization\n\nOperating Status of Organization e.g. Active, Closed\n\nAlternate or previous names for the organization\n\nThe legal name of the organization\n\nWhether an Organization is for profit or non-profit\n\nGeneral contact email for the organization\n\nOrganization's general phone number"}, {"url": "https://case-law.vlex.com/vid/esmond-v-liscio-894486535", "page_content": "Page 793\n\nJoseph ESMOND\n\nv.\n\nJohn Francis LISCIO and the Ohio Casualty Insurance Company,\n\nAppellants.\n\nJoseph ESMOND\n\nv.\n\nJudd William Thomas YOUKERS and Erie Insurance Exchange and\n\nthe Ohio Casualty Insurance Company, Appellants.\n\nSuperior Court of Pennsylvania.\n\nDec. 16, 1966.\n\nApplication for Allocatur Denied Feb. 6, 1967.\n\n[209 Pa.Super. 202]\n\nPage 794\n\nJames A. Stranahan, III, Mercer, Bernard Goldstone, Sharon, for appellant on cross-appeals.\n\n[209 Pa.Super. 203] Albert E. Acker, Sharon, for appellee.\n\n[209 Pa.Super. 202] Before ERVIN, P.J., and WRIGHT, WATKINS, MONTGOMERY, JACOBS, HOFFMAN, and SPAULDING, JJ.\n\n[209 Pa.Super. 203] HOFFMAN, Judge:\n\nOn October 19, 1963, Michael Liscio was approached by his son John and a friend, Robert Spinelli. John asked if he might borrow his father's automobile for the evening. Mr. Liscio readily agreed, provided that John did not drive, since his license had been suspended several months earlier. The two youths proceeded to a tavern in Ohio, where John met another friend, Judd Youkers. John, who had been drinking heavily, gave the car keys to Youkers, who then drove toward Sharon, Pennsylvania. John was seated as a passenger in the front of the automobile.\n\nWhile driving on State Line Road in Sharon, Youkers struck Joseph Esmond, a pedestrian, with the right front fender of the car. Liscio then opened the car door, striking Esmond a second time.\n\nPage 795\n\nEsmond brought actions in trespass against both youths. He secured a judgment of $4000, including $1000 punitive damages, against John Liscio, and a judgment of $2000, including $500 punitive damages, against Judd Youkers.\n\nEsmond then instituted these garnishment proceedings against the Ohio Casualty Insurance Company, (hereinafter, Ohio), Michael Liscio's insurer. He also named the Erie Insurance Exchange, Youkers' insurer, as garnishee on the Youkers judgment.\n\nMichael Liscio is the named insured under a Garage Liability Policy issued by Ohio. The policy provides:\n\n'Part I--Liability. Coverage A--Bodily Injury Liability * * *. Persons insured. Each of the following is an [209 Pa.Super. 204] insured under Part I * * * (1) The named insured * * * (and) (3) With respect to the Automobile Hazard: (a) any person while using, with the permission of the named insured, an automobile to which the insurance applies * * * provided such person's actual operation or (if he is not operating) his other actual use thereof is within the scope of such permission * * *.'\n\nThe policy further provides: 'The company will pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of: A. Bodily injury * * * caused by accident * * *.'\n\nThe following provision appears at the end of Part I: 'Assault and Battery. Assault and battery shall be deemed an accident unless committed by or at the direction of the insured.'\n\nBoth garnishment actions were consolidated for trial and heard by the court below sitting without a jury. The court found that John Liscio was using the car whit his father's permission and was, consequently, an 'omnibus insured' under the Ohio policy. The court further found that John Liscio's act in opening the car door was wanton, not intentional. It, therefore, entered a finding against Ohio in the sum of $3000 on the Liscio judgment, but denied recovery against the insurer on the $1000 punitive damages award. The court also found that Judd Youkers had the elder Liscio's implied permission to operate the automobile and was entitled to coverage under the Ohio policy. It therefore entered a finding against Ohio in the sum of $1500 on the Youkers judgment, again denying recovery on the punitive damages award. No finding was entered against Erie Insurance Exchange, because its policy provided Youkers with 'excess' coverage only.\n\nOn exceptions, the court reversed its original finding that John Liscio's act in opening the car door was wanton, describing it instead as an intentional assault. The court then denied any recovery to Esmond on the [209 Pa.Super. 205] Liscio judgment, stating that an intentional act was not an 'accident' within the meaning of the Ohio policy. On reargument, the court reversed itself again and held that the Ohio policy did cover liability arising from John Liscio's assault. The $3000 judgment against Ohio was reinstated.\n\nThe Ohio Company now appeals from both judgments, arguing that Judd Youkers was not an insured under the terms of its policy and that John Liscio's assault is excluded from coverage. Plaintiff Esmond appeals from the dismissal of his claims for punitive damages against the insurer.\n\nI\n\nOhio first contends that Judd Youkers was not operating the Liscio automobile with the permission of Michael Liscio, the named insured. Consequently, it argues, Youkers was not entitled to the status of an additional insured under the policy's 'omnibus' clause.\n\nThe lower court found that Judd Youkers '* * * had permission to drive Michael Liscio's car at the time the plaintiff was injured. Though the permission was not\n\nPage 796\n\nspecifically given to Youkers, it is clearly implied * * *.' The evidence amply supports such a finding.\n\nJohn Liscio testified that his father had permitted him to use the car, in the company of a licensed driver, on many previous occasions. Five different boys, including Youkers, had driven the car before. On the night of the accident, Mr. Liscio allowed John to use the car for his own pleasure, without limitation as to time or place. He attached only one condition: John was not to do the actual driving.\n\nMichael Liscio corroborated this testimony. Any licensed driver, who was also an acquaintance of his son, had permission to drive the car. Mr. Liscio had [209 Pa.Super. 206] no specific objection to Youkers' driving the car on the night in question. He did not tell his son that only Spinelli was to drive, and he did not intend that no one else should operate the vehicle.\n\nThe permission necessary to entitle Youkers to the status of an additional insured need not be express. It may by in the form of an 'implied affirmative consent or it may result by implication from the relationship of the parties or a course of conduct in which the parties have mutually acquiesced.' Snyder v. Carlson, 135 Pa.Super. 390, 392, 5 A.2d 588, 589 (1939). Michael Liscio knew that his son's license had been suspended. When he permitted John to use the car, he clearly contemplated that any of the boy's friends who were qualified drivers might operate the vehicle. Indeed, he stated as much on cross-examination:\n\n'Q. In other words Mr. Liscio, you didn't object at all to any driver of your car while your son was in it, is that what you are stating, who was licensed?\n\n'A. Well, providing they were acquaintances of my boy.\n\n'Q. In other words, any acquaintance of John's could drive the car, is that correct, provided he was a licensed driver?\n\n'A. Well, I guess I would say that.'\n\nIn these circumstances, the court properly concluded the Judd Youkers had permission to drive Michael Liscio's car when the plaintiff was injured. See Conrad v. Duffin, 158 Pa.Super. 305, 44 A.2d 770 (1945).\n\nOhio relies on Helwig v. Esterly, 205 Pa.Super. 185, 208 A.2d 10 (1965). There, however, the son's permission to use the car was qualified by an express prohibition against its use by his fiancee, who was driving when the accident occurred. No such prohibition appears in the record before us.\n\n[209 Pa.Super. 207] Nor is Volk v. Cacchione, 395 Pa. 636, 150 A.2d 849 (1959), pertinent here. In that case, the evidence showed, at best, an implied permission to Cacchione to drive the car while accompanied by the owner's son. At the time of the accident, however, Cacchione was alone in the car. In order to recover, the Court held, the plaintiff 'would have (had) to prove that (the owner) permitted Cacchione to use the automobile for his Unlimited personal pleasure and With no younger member of the (owner's) family present.' (Emphasis supplied). Id. at 641--642, 150 A.2d at 852.\n\nWe conclude, therefore, that Judd Youkers was operating the Liscio automobile on the night in question with the permission of Michael Liscio, the named insured. Consequently, he was entitled to coverage as an additional insured under the Ohio policy.\n\nII\n\nOhio next contends that John Liscio's act in striking plaintiff Esmond with the car door was an intentional assault and, as such, excluded from policy coverage.\n\nPage 797\n\nWe agree with Judge McKAY, in his opinion sustaining defendant insurer's exceptions, that the trial court's 17th finding of fact ('The act was wanton, not intentional,') is not supported by the evidence. Liscio testified specifically that he opened the car door to 'hit the person that was walking the other way.' Apart from one equivocal answer, he stood by this assertion throughout an intensive and searching cross-examination.\n\nThe trial judge evidently believed that Liscio was so intoxicated at the time he struck Esmond as to be incapable of committing an intentional assault. Quite apart from the fact that there was no medical [209 Pa.Super. 208] testimony in the record to support such a conclusion, it is refuted by Liscio's own admissions:\n\n'Q. Now Mr. Liscio, isn't it a fact that you have between ten and fifteen shots of liquor and maybe four or five beers before you left with Mr. Youkers?\n\n'A. Yes.\n\n'Q. And isn't it a fact, sir, that you really don't know what happened as you were driving down the street in that automobile?\n\n'A. No.\n\n'Q..."}, {"url": "https://case-law.vlex.com/vid/estate-of-liscio-in-892952932", "page_content": "Page 1019\n\n638 A.2d 1019\n\n432 Pa.Super. 440\n\nIn re ESTATE OF John LISCIO, deceased.\n\nAppeal of Kimberley A. SOMMA, Administratrix of the Estate\n\nof John Liscio, deceased.\n\nSuperior Court of Pennsylvania.\n\nArgued Nov. 10, 1993.\n\nFiled March 17, 1994.\n\nPage 1020\n\n[432 Pa.Super. 441] Ruth A. Zittrain, Pittsburgh, for appellant.\n\nRaymond Radakovich, Pittsburgh, for participating party.\n\nBefore TAMILIA, HUDOCK and CERCONE, JJ.\n\nHUDOCK, Judge:\n\nKimberley A. Somma, Administratrix of the Estate of John Liscio, deceased, appeals from the order sustaining the exceptions of Mary DiPerna to the estate's award of counsel fees and costs pursuant to 42 Pa.C.S. § 2503 as sanctions for the vexatious, arbitrary, dilatory, frivolous, and bad faith action of Ms. DiPerna and her counsel during the pendency of the underlying claim they had brought against the estate. We reverse.\n\nOn June 10, 1989, John Liscio died intestate, survived by his daughter, Sherilynn Liscio. Because Ms. Liscio resided in [432 Pa.Super. 442] Florida, she renounced her right to administer her father's estate. Thereafter, Mrs. Kimberley Ann Somma was appointed to administer the estate. Letters of administration were duly issued to Mrs. Somma on June 15, 1989. On July 6, 1989, Ms. DiPerna, through her counsel, Raymond Radakovich, Esquire, filed a petition for revocation of letters, requesting the court to remove Mrs. Somma as Administratrix of the Estate of John Liscio and substitute Ms. DiPerna, based on Ms. DiPerna's allegation that she was decedent's natural daughter. A rule was issued by the Register of Wills, and the administratrix defended on two bases: 1) that Ms. DiPerna was not the natural daughter of the decedent, and 2) that Ms. DiPerna had been adopted legally shortly after her birth by persons other than decedent or his former wife; thus, her right, if any, to administer and inherit under decedent's estate was terminated by reason of the adoption. See 20 Pa.C.S. § 2108. The petition to revoke the letters subsequently was withdrawn, when counsel for the estate agreed to give notice to Ms. DiPerna of the filing of an account and to permit the issue of Ms. DiPerna's right to inherit from the estate to be decided by the Orphans' Court following the filing of the account.\n\nIn accordance with that agreement, Ms. DiPerna was notified of the filing of the account, and she filed objections, again contending that she was an equal heir with Ms. Sherilynn Liscio in the estate by virtue of her status as a natural daughter to decedent. A hearing was held on her claim on July 11, 1990, where the following was established: Ms. DiPerna, adopted as a baby, decided in 1979 to discover the identity of her natural parents. Ms. DiPerna eventually found, met, and developed a relationship with her natural mother, who informed her that her natural father was the decedent. However, Ms. DiPerna never met decedent prior to his death.\n\nAt the hearing, Ms. DiPerna acknowledged that she was adopted, but contested the fact that she was adopted \"legally\". Specifically, Ms. DiPerna contended that, because her alleged father, John Liscio, had not been present at the adoption [432 Pa.Super. 443] proceedings, and because he had not been notified of the proceedings, her adoption was tainted. Ms. DiPerna alleges that it was not until sometime after the proceedings had been completed that John Liscio was informed of the adoption. Since Ms. DiPerna's adoption proceedings had never been made available for her review, she suggested that the estate could not sustain a finding that she was legally adopted. In 1979, Ms. DiPerna attempted to gain access to her adoption file by instituting an action against the children's home that handled her adoption. It is established in the record of this proceeding that, in the 1979 action, Ms. DiPerna averred that she was adopted on July 5, 1950, through the children's home. The Orphan's Court in this action had the adoption file, and, over Ms. DiPerna's protest, reviewed the adoption file in camera. Ms. DiPerna was shown the cover of the file, and the hearing was concluded.\n\nOn July 11, 1990, the Orphans' Court determined that Ms. DiPerna was adopted legally and dismissed her objections to the first and final account. Ms. DiPerna timely filed an appeal to this Court. This Court affirmed,\n\nPage 1021\n\n413 Pa.Super 661\n\n596 A.2d 257\n\n529 Pa. 621\n\n600 A.2d 537\n\n, and the Supreme Court denied Ms. DiPerna's petition for allocatur,. Subsequently, the estate filed a motion for counsel fees and costs, pursuant to 42 Pa.C.S. § 2503, for Ms. DiPerna's dilatory, vexatious, arbitrary and bad faith actions in continuing to pursue a frivolous and meritless claim. This motion included Ms. DiPerna's attorney as a sanctionable party for his actions in promoting and proceeding with a claim he knew was frivolous, meritless, and against settled law. Briefs were prepared and argument was heard on December 20, 1991, by the Honorable Michael J. O'Malley. On April 9, 1992, the court ordered that Ms. DiPerna and/or her counsel, Raymond Radakovich, Esquire, reimburse the estate of John Liscio the sum of $15,563. Ms. DiPerna and her counsel filed exceptions, which were granted on January 21, 1993, after hearing oral argument by the Orphans' Court en banc, thereby reversing the award. This appeal followed.\n\nOn appeal, the estate raises the sole question of:"}, {"url": "https://law.justia.com/cases/pennsylvania/superior-court/1966/209-pa-super-200-0.html", "page_content": "209 Pa. Superior Ct. 200 (1966)\n\nEsmond, Appellant, v. Liscio (et al., Appellant).\n\nSuperior Court of Pennsylvania.\n\nArgued November 15, 1966.\n\nDecember 16, 1966.\n\n*202 Before ERVIN, P.J., WRIGHT, WATKINS, MONTGOMERY, JACOBS, HOFFMAN, and SPAULDING, JJ.\n\nJames A. Stranahan, III, with him Stranahan & Stranahan, for Ohio Casualty Insurance Company, appellant.\n\n*203 Albert E. Acker, with him Cusick, Madden, Joyce, Acker and McKay, for Erie Insurance Exchange, appellee.\n\nBernard Goldstone, with him Routman, Moore and Goldstone, for plaintiff, appellant, appellee.\n\nOPINION BY HOFFMAN, J., December 16, 1966:\n\nOn October 19, 1963, Michael Liscio was approached by his son John and a friend, Robert Spinelli. John asked if he might borrow his father's automobile for the evening. Mr. Liscio readily agreed, provided that John did not drive, since his license had been suspended several months earlier. The two youths proceeded to a tavern in Ohio, where John met another friend, Judd Youkers. John, who had been drinking heavily, gave the car keys to Youkers, who then drove toward Sharon, Pennsylvania. John was seated as a passenger in the front of the automobile.\n\nWhile driving on State Line Road in Sharon, Youkers struck Joseph Esmond, a pedestrian, with the right front fender of the car. Liscio then opened the car door, striking Esmond a second time.\n\nEsmond brought actions in trespass against both youths. He secured a judgment of $4000, including $1000 punitive damages, against John Liscio, and a judgment of $2000, including $500 punitive damages, against Judd Youkers.\n\nEsmond then instituted these garnishment proceedings against the Ohio Casualty Insurance Company (hereinafter, Ohio), Michael Liscio's insurer. He also named the Erie Insurance Exchange, Youkers' insurer, as garnishee on the Youkers judgment.\n\nMichael Liscio is the named insured under a Garage Liability Policy issued by Ohio. The policy provides:\n\n\"Part I Liability. Coverage A Bodily Injury Liability. . . . Persons insured. Each of the following is an *204 insured under Part I . . . (1) The named insured . . . [and] (3) With respect to the Automobile Hazard: (a) any person while using, with the permission of the named insured, an automobile to which the insurance applies . . . provided such person's actual operation or (if he is not operating) his other actual use thereof is within the scope of such permission. . . .\"\n\nThe policy further provides: \"The company will pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of: A. Bodily injury . . . caused by accident. . . .\"\n\nThe following provision appears at the end of Part I: \"Assault and Battery. Assault and battery shall be deemed an accident unless committed by or at the direction of the insured.\"\n\nBoth garnishment actions were consolidated for trial and heard by the court below sitting without a jury. The court found that John Liscio was using the car with his father's permission and was, consequently, an \"omnibus insured\" under the Ohio policy. The court further found that John Liscio's act in opening the car door was wanton, not intentional. It, therefore, entered a finding against Ohio in the sum of $3000 on the Liscio judgment, but denied recovery against the insurer on the $1000 punitive damages award. The court also found that Judd Youkers had the elder Liscio's implied permission to operate the automobile and was entitled to coverage under the Ohio policy. It therefore entered a finding against Ohio in the sum of $1500 on the Youkers judgment, again denying recovery on the punitive damages award. No finding was entered against Erie Insurance Exchange, because its policy provided Youkers with \"excess\" coverage only.\n\nOn exceptions, the court reversed its original finding that John Liscio's act in opening the car door was wanton, describing it instead as an intentional assault. The court then denied any recovery to Esmond on the *205 Liscio judgment, stating that an intentional act was not an \"accident\" within the meaning of the Ohio policy. On reargument, the court reversed itself again and held that the Ohio policy did cover liability arising from John Liscio's assault. The $3000 judgment against Ohio was reinstated.\n\nThe Ohio Company now appeals from both judgments, arguing that Judd Youkers was not an insured under the terms of its policy and that John Liscio's assault is excluded from coverage. Plaintiff Esmond appeals from the dismissal of his claims for punitive damages against the insurer.\n\nOhio first contends that Judd Youkers was not operating the Liscio automobile with the permission of Michael Liscio, the named insured. Consequently, it argues, Youkers was not entitled to the status of an additional insured under the policy's \"omnibus\" clause.\n\nThe lower court found that Judd Youkers \". . . had permission to drive Michael Liscio's car at the time the plaintiff was injured. Though the permission was not specifically given to Youkers, it is clearly implied. . . .\" The evidence amply supports such a finding.\n\nJohn Liscio testified that his father had permitted him to use the car, in the company of a licensed driver, on many previous occasions. Five different boys, including Youkers, had driven the car before. On the night of the accident, Mr. Liscio allowed John to use the car for his own pleasure, without limitation as to time or place. He attached only one condition: John was not to do the actual driving.\n\nMichael Liscio corroborated this testimony. Any licensed driver, who was also an acquaintance of his son, had permission to drive the car. Mr. Liscio had *206 no specific objection to Youkers' driving the car on the night in question. He did not tell his son that only Spinelli was to drive, and he did not intend that no one else should operate the vehicle.\n\nThe permission necessary to entitle Youkers to the status of an additional insured need not be express. It may be in the form of an \"implied affirmative consent or it may result by implication from the relationship of the parties or a course of conduct in which the parties have mutually acquiesced.\" Snyder v. Carlson, 135 Pa. Superior Ct. 390, 392, 5 A.2d 588, 589 (1939). Michael Liscio knew that his son's license had been suspended. When he permitted John to use the car, he clearly contemplated that any of the boy's friends who were qualified drivers might operate the vehicle. Indeed, he stated as much on cross-examination:\n\n\"Q. In other words Mr. Liscio, you didn't object at all to any driver of your car while your son was in it, is that what you are stating, who was licensed?\n\n. . .\n\n\"A. Well, providing they were acquaintances of my boy.\n\n\"Q. In other words, any acquaintance of John's could drive that car, is that correct, provided he was a licensed driver?\n\n\"A. Well, I guess I would say that.\"\n\nIn these circumstances, the court properly concluded that Judd Youkers had permission to drive Michael Liscio's car when the plaintiff was injured. See Conrad v. Duffin, 158 Pa. Superior Ct. 305, 44 A.2d 770 (1945).\n\nOhio relies on Helwig v. Esterly, 205 Pa. Superior Ct. 185, 208 A.2d 10 (1965). There, however, the son's permission to use the car was qualified by an express prohibition against its use by his fiancée, who was driving when the accident occurred. No such prohibition appears in the record before us.\n\n*207 Nor is Volk v. Cacchione, 395 Pa. 636, 150 A.2d 849 (1959), pertinent here. In that case, the evidence showed, at best, an implied permission to Cacchione to drive the car while accompanied by the owner's son. At the time of the accident, however, Cacchione was alone in the car. In order to recover, the Court held, the plaintiff \"would have [had] to prove that [the owner] permitted Cacchione to use the automobile for his unlimited personal pleasure and with no younger member of the [owner's] family present.\" (Emphasis supplied). Id at 641-642.\n\nWe conclude, therefore, that Judd Youkers was operating the Liscio automobile on the night in question with the permission of Michael Liscio, the named insured. Consequently, he was entitled to coverage as an additional insured under the Ohio policy.\n\nII\n\nOhio next contends that John Liscio's act in striking plaintiff Esmond with the car door was an intentional assault and, as such, excluded from policy coverage.\n\nWe agree with Judge McKAY, in his opinion sustaining defendant insurer's exceptions, that the trial court's 17 finding of fact (\"The act was wanton, not intentional,\") is not supported by the evidence. Liscio testified specifically that he opened the car door to \"hit the person that was walking the other way.\" Apart from one equivocal answer, he stood by this assertion throughout an intensive and searching cross-examination.\n\nThe trial judge evidently believed that Liscio was so intoxicated at the time he struck Esmond as to be incapable of committing an intentional assault. Quite apart from the fact that there was no medical *208 testimony in the record to support such a conclusion, it is refuted by Liscio's own admissions:\n\n\"Q. Now Mr. Liscio, isn't it a fact that you had between ten and fifteen shots of liquor and maybe four or five beers before you left with Mr. Youkers?\n\n. . .\n\n\"A. Yes.\n\n\"Q. And isn't it a fact, sir, that you really don't know what happened as you were driving down the street in that automobile?\n\n\"A. No.\n\n\"Q. Pardon?\n\n\"A. No.\n\n\"Q. It's not a fact?\n\n\"A. No.\n\n\"Q. You do know what you were doing?\n\n\"A. I knew that I opened the door.\n\n\"Q. And that's all you know, is that correct?\n\n\"A. Until I felt the door being forced closed, yes, that's correct.\n\n\"Q. And that you didn't intentionally open this door to hit this gentleman, did you?\n\n. . .\n\n\"A. No, that's not correct.\n\n\"Q. What is your testimony now sir?\n\n\"A. That I opened the door for the purpose of hitting the man.\n\n\"Q. You opened the door for the purpose of hitting the man, and that's what you are saying now, under oath?\n\n\"A. Yes.\"\n\nMoreover, while voluntary intoxication may so cloud the mind as to deprive it of the power of premeditation and deliberation, Commonwealth v. Simmons, 361 Pa. 391, 65 A.2d 353 (1949), it will not prevent the formation of the general intent necessary for the commission of an assault and battery. See *209 6 C.J.S. \"Assault and Battery\" § 25 (b) (1), and, generally, Hall, Intoxication and Criminal Responsibility, 57 Harvard Law Review 1045 (1944).\n\nWe conclude, therefore, that Liscio's act was an intentional assault.[1] That determination, however, does not dispose of the question of policy coverage. While the policy insures only against liability for bodily injury caused by accident, an assault is deemed an accident \"unless committed by or at the direction of the insured.\"\n\nOhio contends that the phrase \"by . . . the insured\" refers back to the policy's \"omnibus clause,\" which defines \"an insured\" as the named insured and any person using the automobile with his permission. Thus, the qualifying clause would operate as an exclusion in every case where the assault was committed by a person entitled to protection under the policy. Plaintiff Esmond argues, on the other hand, that the phrase \"by . . . the insured\" refers only to the named insured, Michael Liscio, who, concededly, did not commit or direct the commission of the assault and battery in this case. We reject both constructions.\n\nThe reasonable interpretation of such a clause is that it was intended to embody the maxim of public policy that a person should not be indemnified by insurance against the consequences of his willful, criminal assault.[2]Western Casualty & Surety Co. v. *210 Aponaug Mfg. Co., 197 F.2d 673 (5th Cir. 1952). It means that when the coverage of the policy as to a particular insured is at issue and that insured either committed or directed the assault, then, as to that insured, the assault is not deemed an accident. Morgan v. Greater New York Taxpayers Mutual Insurance Association, 305 N.Y. 243, 112 N.E.2d 273 (1953); Malanga v. Manufacturers Casualty Insurance Co., 28 N.J. 220, 146 A.2d 105 (1958); Arenson v. National Automobile and Casualty Insurance Co., 45 Cal. 2d 81, 286 P.2d 816 (1955); Employers Surplus Lines of Boston, Mass. v. Stone, 388 P.2d 295 (Okl. 1963); 12 Couch, Insurance (2d ed.), § 45.41; but cf. Jernigan v. Allstate Insurance Co., 269 F.2d 353, rehearing 272 F.2d 857 (5th Cir. 1959).\n\nSo interpreted, the assault and battery provision is not hopelessly contradictory, as the lower court thought. It would protect Mr. Liscio, for example, if he were held vicariously liable for an assault by an employee or agent entrusted with the use of the automobile.[3] The qualifying clause could not have been intended to operate as an exclusion in such a case, because public policy does not forbid indemnification of an insured for losses arising from an assault in which he took no part. Morgan v. Greater New York Taxpayers Mutual Insurance Association, supra. This construction is further supported by decisions which hold that a policy extending coverage *211 to several persons creates several obligations on the part of the insurer, so that a particular insured is not precluded from recovering merely because the claim of another insured is barred under the terms of an exclusion provision. See Arenson v. National Automobile and Casualty Insurance Co., supra, and cases there cited.\n\nWe recognize that an ambiguity in a contract of insurance is to be construed most strongly against the insurer. Blue Anchor Overall Co. v. Pennsylvania Lumbermens Mutual Insurance Company, 385 Pa. 394, 123 A.2d 413 (1956). Nevertheless, we can see no warrant for adopting plaintiff's reading of the provision in question: \"Assault and battery shall be deemed an accident [and hence covered by the policy] unless committed by or at the direction of the named insured.\" It is difficult to see why the ambiguity here demands a resolution furnishing broader coverage to the additional insured than to the named insured himself. Furthermore, the public policy forbidding indemnification to one who personally commits an assault would seem to apply with equal force, whether the tortfeasor is the named or additional insured. We think the parties intended the qualifying clause to mean \"unless committed by or at the direction of the insured seeking coverage.\"\n\nIn the instant case, we are confronted with a liability arising directly from a wilfull, intentional, and criminal assault by an insured, for which a judgment was rendered against the perpetrator alone. See Haser v. Maryland Casualty Company, 78 N.D. 893, 53 N.W.2d 508 (1952). We hold that all liability arising therefrom, including punitive damages assessed against John Liscio, is excluded from coverage under the insurance policy before us.\n\n*212 III\n\nFinally, plaintiff Esmond contends that Ohio should be compelled to pay the $500 in punitive damages awarded him against Judd Youkers. While the insurance policy before us does not expressly exclude such coverage,[4] we agree with the court below that public policy does not permit a tortfeasor, in these circumstances, to shift the burden of punitive damages to his insurer.\n\nPennsylvania adheres to the orthodox view that punitive damages are in no sense intended as compensation to the injured plaintiff. They are, rather, a penalty, imposed to punish the defendant and to deter him and others from similar \"outrageous\" conduct. Voltz v. General Motors Acceptance Corporation, 332 Pa. 141, 2 A.2d 697 (1938); International Electronics Company v. N.S.T. Metal Products Company, Inc., 370 Pa. 213, 88 A.2d 40 (1952); Chambers v. Montgomery, 411 Pa. 339, 192 A.2d 355 (1963); Stevenson v. Economy Bank of Ambridge, 413 Pa. 442, 197 A.2d 721 (1964); Restatement of Torts § 908 (1) (1939).\n\nWhen socially irresponsible drivers are guilty of reckless and grossly offensive conduct on the highways, there are sound and compelling policy reasons for not allowing them to escape the element of personal punishment in punitive damages. To permit insurance against the sanction of punitive damages would be to permit such offenders to purchase a freedom of misconduct altogether inconsistent with the theory of civil punishment which such damages represent.\n\nIn the words of Judge WISDOM, in Northwestern National Casualty Company v. McNulty, 307 F. 2d *213 432, 441-42 (5th Cir. 1962), \"It is no answer to say, society imposes criminal sanctions to deter wrongdoers; that it is enough when a civil offender, through insurance, pays what he is adjudged to owe. A criminal conviction and payment of a fine to the state may be atonement to society for the offender. But it may not have a sufficient effect on the conduct of others to make the public policy in favor of punitive damages useful and effective. . . . [T]he delinquent driver must not be allowed to receive a windfall at the expense of the purchasers of insurance, transferring his responsibility for punitive damages to the very people the driving public to whom he is a menace. We are sympathetic with the innocent victim here. . . . But his interest in receiving non-compensatory damages is small compared with the public interest in lessening the toll of injury and death on the highways; and there is such a thing as a state policy to punish and deter by making the wrongdoer pay.\" See also, Nicholson v. American Fire & Casualty Insurance Co., 177 So. 2d 52 (Fla. 1965); Crull v. Gleb, 382 S.W.2d 17 (Mo. 1964).\n\nOf course, the imposition of liability for compensatory damages also tends to discourage wrongful conduct. But the function of compensatory damages is primarily to shift the loss from a wholly innocent party to one who is at fault. \"The rationale of compensatory damages is not so much a policy that the responsible party should pay; it is more a policy that the wholly innocent party should not pay. Insurance against compensatory liability therefore does not frustrate the reason for imposing the liability.\" Northwestern National Casualty Company v. McNulty, supra, at 438.\n\nIt is true that a majority of the courts confronted with this question have held insurers liable for punitive damages. But the rule apparently to be derived from *214 these decisions will not bear close scrutiny. Thus, two often-cited Alabama cases are of little value as precedent. Capital Motor Lines v. Loring, 238 Ala. 260, 189 So. 897 (1939); American Fidelity and Casualty Company v. Werfel, 230 Ala. 552, 162 So. 103 (1935). Because of the peculiar nature of Alabama's wrongful death statute, all damages awarded in such actions are considered \"punitive,\" even though their purpose may be compensatory. Another line of cases, represented by Ohio Casualty Ins. Co. v. Welfare Finance Co., 75 F.2d 58, 60, (8th Cir. 1934), is also readily distinguishable. There, the plaintiff won a judgment for punitive damages against the insured arising out of a wanton act by the insured's servant. The court stated: \"In this situation where there was no direct or indirect volition upon the part of the master in the commission of the act, no public policy is violated by protecting him from the unauthorized and unnatural act of his servant.\" In general, allowing one who is only vicariously liable for punitive damages to shift the burden of satisfying the judgment to his insurer does not conflict with the rule of policy which we announce today. In such cases, the insured is guilty of no wrongdoing, nor is the award of punitive damages made to punish him. See Note, Automobile Liability Insurance and Punitive Damages, 39 Temple Law Quarterly 459 (1966). Nearly all of the remaining decisions imposing liability on the insurer fail to consider the critical public policy question, which we believe to be controlling.\n\nWe conclude, therefore, that Ohio is not required to pay the award of punitive damages levied against its additional insured, Judd Youkers.\n\nIn summary, we hold that:\n\n(1) Judd Youkers was operating the Liscio automobile with the implied permission of Michael Liscio, the named insured. Consequently, he was entitled to *215 coverage under the Ohio Casualty Insurance Company policy, and the insurer must pay the compensatory damages awarded plaintiff as a result of Youker's negligence.\n\n(2) Ohio is not required to pay the punitive damages awarded against Youkers, because public policy does not permit a tortfeasor who is personally guilty of wanton misconduct to shift the burden of punitive damages to his insurer.\n\n(3) Ohio is not liable on any part of the judgment secured by plaintiff Esmond against John Liscio, because the insurance contract before us affords no protection to an insured who has himself committed an intentional assault and battery.[5]\n\nAccordingly, the judgment of the lower court directing the payment of $3000 plus interest by Ohio to the plaintiff, by reason of John Liscio's assault, is reversed. In all other respects, the judgments appealed from are affirmed.\n\nNOTES\n\n[1] An assault is an act which \"is a legal cause of a contact with another's person . . . and which is offensive to a reasonable sense of personal dignity . . . if (a) the act is done with the intention of inflicting a harmful or offensive contact upon the other. . . .\" Commonwealth v. Bird, 152 Pa. Superior Ct. 648, 653, 33 A.2d 531, 533 (1943). (Emphasis supplied).\n\n[2] See the dictum of Mr. Chief Justice HORACE STERN in Wilson v. Maryland Casualty Company, 377 Pa. 588, 589 n., 105 A.2d 304, 305 n. (1954): \"Of course a person could not contract for indemnity against liability for damage or injury caused by his own wilful act, much less an assault and battery committed by him. A contract to insure against such liability would obviously be void as being in violation of public policy.\" But cf. Brower v. Employers' Liability Assurance Company, Ltd., 318 Pa. 440, 442, 177 A. 826, 827 (1935); Sky v. Keystone Mutual Casualty Company, 150 Pa. Superior Ct. 613, 616-17, 29 A.2d 230, 231-32 (1942).\n\n[3] It should be noted that the Ohio insurance contract is a Garage Liability Policy. It applies, inter alia, to liability arising from the \"ownership, maintenance or use of any automobile for the purpose of garage operations. . . .\"\n\n[4] It provides: \"The company will pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of A. bodily injury . . . caused by accident. . . .\" (Emphasis supplied)\n\n[5] Of course, nothing in our opinion today relieves Youkers and Liscio from personal liability on the unsatisfied judgments against them."}, {"url": "https://alchetron.com/John-Liscio", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders. Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}, {"url": "https://prabook.com/web/john.liscio/2231476", "page_content": "John Liscio\n\njournalist\n\n1949 (age 51)\n\nHe served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at United States. News & World Report and worked at Barron\"s in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders. Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne. Liscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection."}, {"url": "https://alchetron.com/John-Liscio", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders. Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}]}