{"John Liscio Report provides research and analysis on the stock market, mutual funds, and other investments.": [{"url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3850494", "page_content": "34 Pages Posted: 24 May 2021 Last revised: 23 Sep 2022\n\nDate Written: May 21, 2021\n\nAbstract\n\nTechnical analysis is the study for forecasting future asset prices with past data. In this survey, we review and extend studies on not only the time-series predictive power of technical indicators on the aggregated stock market and various portfolios, but also the cross-sectional predictability with various firm characteristics. While we focus on reviewing major academic research on using traditional technical indicators, but also discuss briefly recent studies that apply machine learning approaches, such as Lasso, neural network and genetic programming, to forecast returns both in the time-series and on the cross-section."}, {"url": "https://www.businesswire.com/news/home/20191108005564/en/The-Liscio-Report-on-the-Economy-Sunscription---ResearchAndMarkets.com", "page_content": "DUBLIN--(BUSINESS WIRE)--The \"TLR on the Economy\" newsletter has been added to ResearchAndMarkets.com's offering.\n\nSubscribers to TLR on the Economy receive, via email, two detailed reports a month, one reporting the results of our proprietary survey of state withheld receipts, a discussion of what the trend means for the economy, related research and analysis, and a forecast of the upcoming Employment Report from the Bureau of Labor Statistics; the other does the same thing but is based on our survey of state-level sales tax receipts and includes a forecast of the upcoming Retail Sales print from Census.\n\nIn addition, we breakdown the releases themselves, and send updates whenever we spot a new trend developing. This could be in any of the secondary releases, or something noticed by a tax contact, or that we ferreted out in a regional paper or study. TLR is designed for active money managers and traders. We put everything in long-term context, have extensive databases, and look beyond the noise.\n\nThe proprietary surveys of state-level withholding and sales tax receipts are the backbone of its researcher's work. We have long-standing relationships with senior revenue estimators in tax departments around the country, whose insights give us a unique take on the state of the US economy. Instead of looking at total personal income receipts, which include non-wage income, we track withheld taxes since they are levied on wages and bonuses, not capital gains and the like.\n\nThe researchers do their own macro-economic research, and, unlike many other research-providers, do not manage money: they are beholden to no one but their subscribers and ourselves.\n\nPhilippa Dunne and Douglas Henwood were John Liscio's closest associates and, since John's untimely death in 2000, are honored to be carrying on the research techniques he pioneered when he established The Liscio Report on the international scene in 1992.\n\nThey are known for their meticulous dissection of federal data, for pointing out technical anomalies glossed over in the mainstream press (and related debunking of market rumours), and for ferreting out market-moving shifts in the economic landscape as they develop, getting the news out to their readers before the mainstream media catches on. They also grill the highly informed senior tax officials who participate in our surveys on their favored indicators, like diesel-fuel consumption, and collect their thoughts on emerging economic trends for our subscribers. They are watching the cash flow into the state coffers so they know what they are talking about.\n\nFor more information about this newsletter visit https://www.researchandmarkets.com/r/ue2ocb"}, {"url": "https://www.marketresearch.com/Service-Industries-c1598/Financial-Services-c83/Mutual-Funds-c158/", "page_content": "A mutual fund is a type of collective investment. These collective investments are a collection of money from many investors. These mutual funds are then professionally managed to buy stocks, bonds or other securities including short-term money market instruments.\n\nThere are several types of mutual funds which may have different advantages and disadvantages. These include open-end funds, closed-end funds. Two other types of mutual funds are exchange-traded funds and unit investment trusts.\n\nMutual funds gained popularity in the United States beginning in the 1920s. The popularity of mutual funds has changed as the confidence in the stock market has altered over time.\n\nThere are many advantages to mutual funds. Service and convenience, professional investment management, ease of comparison and government oversight are a few of the top advantages of mutual funds. Other advantages include daily liquidity and increased diversification. Mutual funds may also give investors the ability to participate in investment opportunities which are normally only available to larger investors.\n\nHowever, mutual funds may not be for everyone. There are some disadvantages to mutual funds. They are not able to be customized in the same manner as other investments. The outcomes may be less predictable and there is less control over the timing of recognition of gains. Also, there are many fees involved with investing in mutual funds.\n\nIn the United States, some of the top mutual fund complexes are Fidelity Investments, Vanguard Group, Goldman Sachs and Co, JP Morgan Chase and Co and BlackRock Funds."}, {"url": "https://www.tlranalytics.com/about/", "page_content": "About The Report\n\nManaged by Philippa Dunne and Doug Henwood, The Liscio Report is an independent research outfit located in New York City. In addition to our two proprietary surveys of state withholding and sales tax receipts, we do our own macro-economic research, and, unlike many other research-providers, do not manage money: we are beholden to no one but our subscribers and ourselves.\n\nPhilippa Dunne and Douglas Henwood were John Liscio’s closest associates and, since John’s untimely death in 2000, are honored to be carrying on the research techniques he pioneered when he established The Liscio Report on the international scene in 1992.\n\nWe are known for our meticulous dissection of federal data, for pointing out technical anomalies glossed over in the mainstream press (and related debunking of market rumors), and for ferreting out market-moving shifts in the economic landscape as they develop, getting the news out to our readers before the mainstream media catches on. We also grill the highly informed senior tax officials who participate in our surveys on their favored indicators, like diesel-fuel consumption, and collect their thoughts on emerging economic trends for our subscribers. They are watching the cash flow into the state coffers so they know what they are talking about.\n\nLook for us in Barron’s, the FT, Reuters; on MSNBC and Bloomberg; and around the web.\n\nPhilippa Dunne\n\nPhilippa Dunne was hired by John Liscio in 1996 to work on special projects, and in 1997 began full-time work as the “research department,” specifically to develop her own set of states for our monthly surveys of state tax collections and to handle the burgeoning demands of The Liscio Report. She often appears on television discussing wage and labor issues, as well as specific Federal Reserve research.\n\nShe graduated from University of California and has a Master’s Degree from Wesleyan University.\n\nDouglas Henwood\n\nWhile working toward his PhD in English at the University of Virginia, Doug returned to his earlier interest, the dismal science, and by the mid-1980s was regularly writing about the world economy with special attention to finance and the labor markets.\n\nHe caught the attention of John Liscio and as the “resident wise man” he crunched stats and analyzed them for John from the report’s very first days. A widely recognized economic analyst, Doug has given talks at venues all over the U.S. and abroad as well. He’s also frequently quoted or cited in the media, including newspapers ranging from The Asia Times to the New York Times to the Times of London.\n\nHale Stewart\n\nFrequent contributor Hale Stewart was a bond broker with Vining Sparks, where his clients included mutual funds, insurance companies, and money managers, until he decided to go to law school that is. He made that decision in 2001, graduating from the South Texas School of Law in 2003. After law school, he opened his law practice focusing on transactional work. He continued his education at the Thomas Jefferson School of Law in 2007 where he obtained an LLM in domestic and international taxation, graduating Magna Cum Laude. He is the author of the book U.S. Captive Insurance Law and is a registered investment adviser with Thompson Creek Wealth Advisors."}, {"url": "https://www.investopedia.com/terms/m/mutualfund.asp", "page_content": "What Is a Mutual Fund?\n\nA mutual fund is a financial vehicle that pools assets from shareholders to invest in securities like stocks, bonds, money market instruments, and other assets. Mutual funds are operated by professional money managers, who allocate the fund's assets and attempt to produce capital gains or income for the fund's investors. A mutual fund's portfolio is structured and maintained to match the investment objectives stated in its prospectus.\n\nMutual funds give small or individual investors access to professionally managed portfolios of equities, bonds, and other securities. Each shareholder, therefore, participates proportionally in the gains or losses of the fund. Mutual funds invest in a vast number of securities, and performance is usually tracked as the change in the total market cap of the fund—derived by the aggregating performance of the underlying investments.\n\nMost mutual funds are part of larger investment companies such as Fidelity Investments, Vanguard, T. Rowe Price, and Oppenheimer. A mutual fund has a fund manager, sometimes called its investment adviser, who is legally obligated to work in the best interest of mutual fund shareholders.\n\nKey Takeaways A mutual fund is a type of investment vehicle consisting of a portfolio of stocks, bonds, or other securities.\n\nMutual funds give small or individual investors access to diversified, professionally managed portfolios.\n\nMutual funds are divided into several kinds of categories, representing the kinds of securities they invest in, their investment objectives, and the type of returns they seek.\n\nMutual funds charge annual fees, expense ratios, or commissions, which may affect their overall returns.\n\nEmployer-sponsored retirement plans commonly invest in mutual funds.\n\nHow Are Mutual Funds Priced?\n\nThe value of the mutual fund depends on the performance of the securities in which it invests. When buying a unit or share of a mutual fund, an investor is buying the performance of its portfolio or, more precisely, a part of the portfolio's value. Investing in a share of a mutual fund is different from investing in shares of stock. Unlike stock, mutual fund shares do not give their holders any voting rights. A share of a mutual fund represents investments in many different stocks or other securities.\n\nThe price of a mutual fund share is referred to as the net asset value (NAV) per share, sometimes expressed as NAVPS. A fund's NAV is derived by dividing the total value of the securities in the portfolio by the total amount of shares outstanding. Outstanding shares are those held by all shareholders, institutional investors, and company officers or insiders.\n\nMutual fund shares can typically be purchased or redeemed at the fund's current NAV, which doesn't fluctuate during market hours, but is settled at the end of each trading day. The price of a mutual fund is also updated when the NAVPS is settled.\n\nThe average mutual fund holds different securities, which means mutual fund shareholders gain diversification. Consider an investor who buys only Google stock and relies on the success of the company's earnings. Because all of their dollars are tied to one company, gains and losses are dependent on the company's success. However, a mutual fund may hold Google in its portfolio where the gains and losses of just one stock are offset by gains and losses of other companies within the fund.\n\nHow Are Returns Calculated for Mutual Funds?\n\nWhen an investor buys Apple stock, they are buying partial ownership or a share of the company. Similarly, a mutual fund investor is buying partial ownership of the mutual fund and its assets.\n\nInvestors typically earn a return from a mutual fund in three ways, usually on a quarterly or annual basis:\n\nIncome is earned from dividends on stocks and interest on bonds held in the fund's portfolio and pays out nearly all of the income it receives over the year to fund owners in the form of a distribution. Funds often give investors a choice either to receive a check for distributions or to reinvest the earnings to purchase additional shares of the mutual fund. If the fund sells securities that have increased in price, the fund realizes a capital gain, which most funds also pass on to investors in a distribution. When the fund's shares increase in price, you can then sell your mutual fund shares for a profit in the market.\n\nWhen researching the returns of a mutual fund, an investor will see \"total return,\" or the change in value, either up or down, of an investment over a specific period. This includes any interest, dividends, or capital gains the fund generated as well as the change in its market value over some time. In most cases, total returns are calculated for one, five, and 10-year periods as well as since the day the fund opened, or the inception date.\n\n\n\nTypes of Mutual Funds\n\nThere are several types of mutual funds available for investment, though most mutual funds fall into one of four main categories which include stock funds, money market funds, bond funds, and target-date funds.\n\n\n\nStock Funds\n\nAs the name implies, this fund invests principally in equity or stocks. Within this group are various subcategories. Some equity funds are named for the size of the companies they invest in: small-, mid-, or large-cap. Others are named by their investment approach: aggressive growth, income-oriented, value, and others. Equity funds are also categorized by whether they invest in domestic (U.S.) stocks or foreign equities. To understand the universe of equity funds is to use a style box, an example of which is below.\n\nFunds can be classified based on both the size of the companies, their market caps, and the growth prospects of the invested stocks. The term value fund refers to a style of investing that looks for high-quality, low-growth companies that are out of favor with the market. These companies are characterized by low price-to-earnings (P/E) ratios, low price-to-book (P/B) ratios, and high dividend yields.\n\nConversely, growth funds, look to companies that have had strong growth in earnings, sales, and cash flows. These companies typically have high P/E ratios and do not pay dividends. A compromise between strict value and growth investment is a \"blend,\" which simply refers to companies that are neither value nor growth stocks and are classified as being somewhere in the middle.\n\nImage by Julie Bang © Investopedia 2019\n\nLarge-cap companies have high market capitalizations, with values over $10 billion. Market cap is derived by multiplying the share price by the number of shares outstanding. Large-cap stocks are typically blue-chip firms that are often recognizable by name. Small-cap stocks refer to those stocks with a market cap ranging from $250 million to $2 billion. These smaller companies tend to be newer, riskier investments. Mid-cap stocks fill in the gap between small- and large-cap.\n\nA mutual fund may blend its strategy between investment style and company size. For example, a large-cap value fund would look to large-cap companies that are in strong financial shape but have recently seen their share prices fall and would be placed in the upper left quadrant of the style box (large and value). The opposite of this would be a fund that invests in startup technology companies with excellent growth prospects: small-cap growth. Such a mutual fund would reside in the bottom right quadrant (small and growth).\n\nBond Funds\n\nA mutual fund that generates a minimum return is part of the fixed income category. A fixed-income mutual fund focuses on investments that pay a set rate of return, such as government bonds, corporate bonds, or other debt instruments. The fund portfolio generates interest income, which is passed on to the shareholders.\n\nSometimes referred to as bond funds, these funds are often actively managed and seek to buy relatively undervalued bonds in order to sell them at a profit. These mutual funds are likely to pay higher returns and bond funds aren't without risk. For example, a fund specializing in high-yield junk bonds is much riskier than a fund that invests in government securities.\n\nBecause there are many different types of bonds, bond funds can vary dramatically depending on where they invest and all bond funds are subject to interest rate risk.\n\nIndex Funds\n\nIndex Funds invest in stocks that correspond with a major market index such as the S&P 500 or the Dow Jones Industrial Average (DJIA). This strategy requires less research from analysts and advisors, so there are fewer expenses passed on to shareholders and these funds are often designed with cost-sensitive investors in mind.\n\nBalanced Funds\n\nBalanced funds invest in a hybrid of asset classes, whether stocks, bonds, money market instruments, or alternative investments. The objective of this fund, known as an asset allocation fund, is to reduce the risk of exposure across asset classes.\n\nSome funds are defined with a specific allocation strategy that is fixed, so the investor can have a predictable exposure to various asset classes. Other funds follow a strategy for dynamic allocation percentages to meet various investor objectives. This may include responding to market conditions, business cycle changes, or the changing phases of the investor's own life.\n\nThe portfolio manager is commonly given the freedom to switch the ratio of asset classes as needed to maintain the integrity of the fund's stated strategy.\n\nMoney Market Funds\n\nThe money market consists of safe, risk-free, short-term debt instruments, mostly government Treasury bills. An investor will not earn substantial returns, but the principal is guaranteed. A typical return is a little more than the amount earned in a regular checking or savings account and a little less than the average certificate of deposit (CD).\n\nIncome Funds\n\nIncome funds are named for their purpose: to provide current income on a steady basis. These funds invest primarily in government and high-quality corporate debt, holding these bonds until maturity to provide interest streams. While fund holdings may appreciate, the primary objective of these funds is to provide steady cash flow​ to investors. As such, the audience for these funds consists of conservative investors and retirees.\n\nInternational/Global Funds\n\nAn international fund, or foreign fund, invests only in assets located outside an investor's home country. Global funds, however, can invest anywhere around the world. Their volatility often depends on the unique country's economy and political risks. However, these funds can be part of a well-balanced portfolio by increasing diversification, since the returns in foreign countries may be uncorrelated with returns at home.\n\nSpecialty Funds\n\nSector funds are targeted strategy funds aimed at specific sectors of the economy, such as financial, technology, or healthcare. Sector funds can be extremely volatile since the stocks in a given sector tend to be highly correlated with each other.\n\nRegional funds make it easier to focus on a specific geographic area of the world. This can mean focusing on a broader region or an individual country.\n\nSocially responsible funds, or ethical funds, invest only in companies that meet the criteria of certain guidelines or beliefs. For example, some socially responsible funds do not invest in \"sin\" industries such as tobacco, alcoholic beverages, weapons, or nuclear power. Other funds invest primarily in green technology, such as solar and wind power or recycling.\n\nExchange Traded Funds (ETFs)\n\nA twist on the mutual fund is the exchange-traded fund (ETF). They are not considered mutual funds but employ strategies consistent with mutual funds. They are structured as investment trusts that are traded on stock exchanges and have the added benefits of the features of stocks.\n\nETFs can be bought and sold throughout the trading day. ETFs can also be sold short or purchased on margin. ETFs also typically carry lower fees than the equivalent mutual fund. Many ETFs also benefit from active options markets, where investors can hedge or leverage their positions.\n\nETFs also enjoy tax advantages from mutual funds. Compared to mutual funds, ETFs tend to be more cost-effective and more liquid.\n\nMutual Fund Fees\n\nA mutual fund has annual operating fees or shareholder fees. Annual fund operating fees are an annual percentage of the funds under management, usually ranging from 1–3%, known as the expense ratio. A fund's expense ratio is the summation of the advisory or management fee and its administrative costs.\n\nShareholder fees are sales charges, commissions, and redemption fees, that are paid directly by investors when purchasing or selling the funds. Sales charges or commissions are known as \"the load\" of a mutual fund. When a mutual fund has a front-end load, fees are assessed when shares are purchased. For a back-end load, mutual fund fees are assessed when an investor sells their shares.\n\nSometimes, however, an investment company offers a no-load mutual fund, which doesn't carry any commission or sales charge. These funds are distributed directly by an investment company, rather than through a secondary party. Some funds also charge fees and penalties for early withdrawals or selling the holding before a specific time has elapsed.\n\nClasses of Mutual Fund Shares\n\nCurrently, most individual investors purchase mutual funds with A-shares through a broker. This purchase includes a front-end load of up to 5% or more, plus management fees and ongoing fees for distributions, also known as 12b-1 fees. Financial advisors selling these products may encourage clients to buy higher-load offerings to generate commissions. With front-end funds, the investor pays these expenses as they buy into the fund.\n\nTo remedy these problems and meet fiduciary-rule standards, investment companies have started designating new share classes, including \"level load\" C shares, which generally don't have a front-end load but carry a 12b-1 annual distribution fee of up to 1%.\n\nFunds that charge management and other fees when an investor sells their holdings are classified as Class B shares.\n\nPros of Mutual Fund Investing\n\nThere are a variety of reasons that mutual funds have been the retail investor's vehicle of choice with an overwhelming majority of money in employer-sponsored retirement plans invested in mutual funds.\n\nDiversification\n\nDiversification, or the mixing of investments and assets within a portfolio to reduce risk, is one of the advantages of investing in mutual funds. A diversified portfolio has securities with different capitalizations and industries and bonds with varying maturities and issuers. Buying a mutual fund can achieve diversification cheaper and faster than buying individual securities.\n\nEasy Access\n\nTrading on the major stock exchanges, mutual funds can be bought and sold with relative ease, making them highly liquid investments. Also, when it comes to certain types of assets, like foreign equities or exotic commodities, mutual funds are often the most feasible way—in fact, sometimes the only way—for individual investors to participate.\n\nEconomies of Scale\n\nMutual funds also provide economies of scale by forgoing numerous commission charges needed to create a diversified portfolio. Buying only one security at a time leads to large transaction fees. The smaller denominations of mutual funds allow investors to take advantage of dollar-cost averaging.\n\nBecause a mutual fund buys and sells large amounts of securities at a time, its transaction costs are lower than what an individual would pay for securities transactions. A mutual fund can invest in certain assets or take larger positions than a smaller investor could.\n\nProfessional Management\n\nA professional investment manager uses careful research and skillful trading. A mutual fund is a relatively inexpensive way for a small investor to get a full-time manager to make and monitor investments. Mutual funds require much lower investment minimums so these funds provide a low-cost way for individual investors to experience and benefit from professional money management.\n\nVariety and Freedom of Choice\n\nInvestors have the freedom to research and select from managers with a variety of styles and management goals. A fund manager may focus on value investing, growth investing, developed markets, emerging markets, income, or macroeconomic investing, among many other styles. This variety allows investors to gain exposure to not only stocks and bonds but also commodities, foreign assets, and real estate through specialized mutual funds. Mutual funds provide opportunities for foreign and domestic investment that may not otherwise be directly accessible to ordinary investors.\n\nTransparency\n\nMutual funds are subject to industry regulation that ensures accountability and fairness to investors.\n\nPros Liquidity\n\nDiversification\n\nMinimal investment requirements\n\nProfessional management\n\nVariety of offerings Cons High fees, commissions, and other expenses\n\nLarge cash presence in portfolios\n\nNo FDIC coverage\n\nDifficulty in comparing funds\n\nLack of transparency in holdings\n\n1:32 Mutual Funds: How Many is Too Many?\n\nCons of Mutual Fund Investing\n\nLiquidity, diversification, and professional management all make mutual funds attractive options, however, mutual funds have drawbacks too.\n\nNo Guarantees\n\nLike many other investments without a guaranteed return, there is always the possibility that the value of your mutual fund will depreciate. Equity mutual funds experience price fluctuations, along with the stocks in the fund's portfolio. The Federal Deposit Insurance Corporation (FDIC) does not guarantee mutual fund investments.\n\nCash Drag\n\nMutual funds require a significant amount of their portfolios to be held in cash to satisfy share redemptions each day. To maintain liquidity and the capacity to accommodate withdrawals, funds typically have to keep a larger portion of their portfolio as cash than a typical investor might. Because cash earns no return, it is often referred to as a \"cash drag.\"\n\nHigh Costs\n\nMutual funds provide investors with professional management, but fees reduce the fund's overall payout, and they're assessed to mutual fund investors regardless of the performance of the fund. Since fees vary widely from fund to fund, failing to pay attention to the fees can have negative long-term consequences as actively managed funds incur transaction costs that accumulate over each year.\n\n\"Diworsification\" and Dilution\n\n\"Diworsification\"—a play on words—is an investment or portfolio strategy that implies too much complexity can lead to worse results. Many mutual fund investors tend to overcomplicate matters. That is, they acquire too many funds that are highly related and, as a result, lose the benefits of diversification.\n\nDilution is also the result of a successful fund growing too big. When new money pours into funds that have had strong track records, the manager often has trouble finding suitable investments for all the new capital to be put to good use.\n\nThe Securities and Exchange Commission (SEC) requires that funds have at least 80% of assets in the particular type of investment implied in their names. How the remaining assets are invested is up to the fund manager. However, the different categories that qualify for the required 80% of the assets may be vague and wide-ranging. A fund can, therefore, manipulate prospective investors via its title. A fund that focuses narrowly on Congolese stocks, for example, could be sold with a far-ranging title like \"International High-Tech Fund.\"\n\nEnd of Day Trading Only\n\nA mutual fund allows you to request that your shares be converted into cash at any time, however, unlike stock that trades throughout the day, many mutual fund redemptions​ take place only at the end of each trading day.\n\nTaxes\n\nWhen a fund manager sells a security, a capital-gains tax is triggered. Taxes can be mitigated by investing in tax-sensitive funds or by holding non-tax-sensitive mutual funds in a tax-deferred account, such as a 401(k) or IRA.\n\nEvaluating Funds\n\nResearching and comparing funds can be difficult. Unlike stocks, mutual funds do not offer investors the opportunity to juxtapose the price to earnings (P/E) ratio, sales growth, earnings per share (EPS), or other important data. A mutual fund's net asset value can offer some basis for comparison, but given the diversity of portfolios, comparing the proverbial apples to apples can be difficult, even among funds with similar names or stated objectives. Only index funds tracking the same markets tend to be genuinely comparable.\n\nExample of a Mutual Fund\n\nOne of the most notable mutual funds is Fidelity Investments' Magellan Fund (FMAGX). Established in 1963, the fund had an investment objective of capital appreciation via investment in common stocks. The fund's height of success was between 1977 and 1990 when Peter Lynch served as its portfolio manager. Under Lynch's tenure, Magellan's assets under management increased from $18 million to $14 billion.\n\nFidelity's performance continued strong, and assets under management (AUM) grew to nearly $110 billion in 2000. By 1997, the fund had become so large that Fidelity closed it to new investors and would not reopen it until 2008.\n\nAs of March 2022, Fidelity Magellan has nearly $28 billion in assets and has been managed by Sammy Simnegar since Feb. 2019. The fund's performance has tracked or slightly surpassed that of the S&P 500.\n\nAre Mutual Funds a Safe Investment? All investments involve some degree of risk when purchasing securities such as stocks, bonds, or mutual funds. Unlike deposits at FDIC-insured banks and NCUA-insured credit unions, the money invested in securities typically is not federally insured.\n\nCan Mutual Fund Shares Be Sold at Any Time? Mutual funds are considered liquid assets and shares can be sold at any time, however, review the fund's policies regarding exchange fees or redemption fees. There may also be tax implications for capital gains earned with a mutual fund redemption."}, {"url": "https://www.alliedmarketresearch.com/mutual-fund-assets-market-A06932", "page_content": "Mutual Fund Assets Market Outlook - 2027\n\nThe global mutual fund assets market size was valued at $54.93 trillion in 2019, and is projected to reach $101.2 trillion by 2027, growing at a CAGR of 11.3% from 2020 to 2027. A mutual fund is one of the most preferred investment alternatives for small investors in the market. In addition, it offers an opportunity to invest in a professionally managed & diversified portfolio at a relatively low cost. Moreover, it pools money from several investors and invests the money in securities such as stocks, bonds, short-term debt, and others. Furthermore, each share represents an investor’s ownership in the fund and the income generated from the investments.\n\nThe mutual fund assets industry has been largely affected due to the outbreak of the COVID-19 pandemic, due to the uncertainty underlying in companies’ profitability, economic slowdown, and investors ability to repay funds in the market.\n\nSurge in investment toward mutual fund, which enables small & large fund savers to participate in investment plans is becoming a major growth factor to the market. In addition, advanced portfolio management services, convenience & fair pricing in terms of investments, and implementation of digitalized technologies propel the mutual fund assets market growth. However, highly volatile capital market environment and high expense ratio & sales charges are some of the factors that limit the market growth. Furthermore, developing economies offer significant opportunities for mutual fund providers to expand & develop their existing portfolio with affordable & better returns on investments. In addition, increased support and new initiatives by governments toward the mutual fund assets market are expected to provide lucrative opportunities during the forecast period.\n\nThe equity funds segment dominated the mutual fund assets market in 2019 and is projected to maintain its dominance during the forecast period. This is attributed to the fact that investors invest primarily in individual stocks of publicly traded companies. Moreover, factors such as diversification, systematic investments & withdrawals, and professionally money management with analyzing current & potential holdings for stock funds are driving the growth of this segment during the forecast period.\n\nThe report focuses on the growth prospects, restraints, and trends of the mutual fund assets market analysis. The study provides Porter’s five forces analysis to understand the impact of various factors, such as bargaining power of suppliers, competitive intensity of competitors, threat of new entrants, threat of substitutes, and bargaining power of buyers, on the mutual fund assets market.\n\nSegment review\n\nThe mutual fund asset market is segmented on the basis of fund type, distribution channel, investor type, and region. In terms of fund type, it is segmented into equity funds, bond funds, money market funds, and hybrid & other funds. On the basis of distribution channel, it is classified into banks, financial advisors/brokers, direct sellers, and others. By investor type, it is divided into institutional and individual. Region-wise, the market is analyzed across North America, Europe, Asia-Pacific, and LAMEA.\n\nThe report analyses the profiles of key players operating in the market, including BlackRock, Inc., BNP Paribas Mutual Fund, Capital Group, Citigroup Inc., Goldman Sachs, JPMorgan Chase & Co., Morgan Stanley, PIMCO, State Street Corporation, and The Vanguard Group, Inc. These players have adopted various strategies to increase their market penetration and strengthen their position in the industry.\n\nMutual Fund Assets Market By Distribution Channel Your browser does not support the canvas element. Direct Sellers is projected as one of the most lucrative segments. Get more information on this report : Request Sample Pages\n\nCOVID-19 impact analysis\n\nCOVID-19 pandemic has a moderate impact on the mutual fund assets market, owing to increased cases of corporate defaults as the cash flow position has been hampered tremendously. However, as lockdown in several regions has severely impacted the movement of consumers and disruption of businesses across the globe, customers are availing offers of mutual funds via online platforms. This, in turn, has become one of the major growth factors for the mutual fund assets market during the pandemic situation.\n\nTop impacting factors\n\nImplementation of digitalized technologies\n\nThe mutual fund industry has become the fastest adopter of technologies such as robo-advisors, artificial intelligence, blockchain, cloud computing, Big Data & analytics, and others. In addition, mutual fund companies implement these technologies to provide easy access to complex services, centralize processes to create efficiencies, and reduce cost & risk for the mutual fund marketplace. This has helped to achieve customer loyalty by installing more integrated and value-added services. Therefore, to provide convenient & efficiency services and reduce operational cost, there is increased deployment and implementation of technologies, which are driving the market growth.\n\nMutual Fund Assets Market By Fund Type Your browser does not support the canvas element. Equity Funds accounted for the largest market share in 2019. Get more information on this report : Request Sample Pages\n\nIncreased investment in mutual funds\n\nIncrease in emphasis on domestic savings, rise in disposable income, and mobilization & allocation of the income toward profitable investments are some of the factors that propel the growth of investments in mutual funds. Moreover, it enables small & large fund savers globally to participate in investment plans and derive the benefits of the capital market growth. Furthermore, the mutual fund industry has witnessed massive expansion & standardization in terms of products & services offered, increased proliferation of a large number of private sector funds, and regulatory mechanism, which consequently fueled the market growth.\n\nSurge in government support & initiatives for the mutual fund assets market\n\nGovernments, regulatory bodies, and other authorities across several countries are expected to boost and expand their existing mutual funds industry. In addition, the regulatory bodies continue to look for enhancing the expansion & penetration by executing tie-ups with e-wallets, e-commerce distribution, and other such platforms in the market. Furthermore, the distributors of mutual funds in several regions play an active role and are largely encouraged by the respective country’s government. Therefore, this factor is accelerating the revenue growth of mutual fund providers by enhancing quality & depth of the engagement with channel partners. Furthermore, increased government support and advanced initiatives toward mutual funds are expected to provide lucrative opportunities to the market in the coming years.\n\nMutual Fund Assets Market By Region 2027 North America Europe Asia-Pacific LAMEA Asia-Pacific would exhibit the highest CAGR of 13.7% during 2020-2027. Get more information on this report : Request Sample Pages\n\nKey benefits for stakeholders\n\nThe study provides in-depth analysis of the global mutual fund assets market share along with the current & future trends to illustrate the imminent investment pockets.\n\nInformation about key drivers, restrains, & opportunities and their impact analysis on the market size are provided in the report.\n\nPorter’s five forces analysis illustrates the potency of the buyers and suppliers operating in the industry.\n\nAn extensive analysis of the key segments of the industry helps to understand the global mutual fund assets market trends.\n\nThe quantitative analysis of the global mutual fund assets market from 2020 to 2027 is provided to determine the market potential.\n\nKey market segments\n\nBy Fund Type\n\nEquity Funds\n\nBond Funds\n\nMoney Market Funds\n\nHybrid & Other Funds\n\nBy Distribution Channel\n\nBanks\n\nFinancial Advisors/Brokers\n\nDirect Sellers\n\nOthers\n\nBy Investor Type\n\nInstitutional\n\nIndividual\n\nBy Region\n\nNorth America U.S. Canada\n\nEurope UK Germany France Italy Ireland Netherlands Rest of Europe\n\nAsia-Pacific China Japan India South Korea Hong Kong Australia Rest of Asia-Pacific\n\nLAMEA Latin America Middle East Africa\n\n\n\nKey market players\n\nBlackRock, Inc.\n\nBNP Paribas Mutual Fund\n\nCapital Group\n\nCitigroup Inc.\n\nGoldman Sachs\n\nJPMorgan Chase & Co.\n\nMorgan Stanley\n\nPIMCO\n\nState Street Corporation\n\nThe Vanguard Group, Inc.\n\nMutual Fund Assets Market Report Highlights"}, {"url": "https://www.wikiwand.com/en/John_Liscio", "page_content": "John Liscio (1949 – November 29, 2000) was an American journalist covering finance and the economy as well as an independent financial analyst. He was the founder of the influential bond market newsletter, The Liscio Report.\n\nQuick facts: John Liscio, Born, Died, Alma mater, Occ... ▼\n\nLiscio was born to Armand and Josephine Liscio in Manhattan and matriculated from Fordham Preparatory School in the Bronx to Fordham University where he earned a bachelor's degree. He served in the Marine Corps before becoming a financial writer and analyst in the late 1970s. He was a senior editor at U.S. News & World Report and worked at Barron's in the late 1980s into the early 1990s. In 1992 he started The Liscio Report, a financial newsletter that became influential on Wall Street and especially so among bond traders.[1] Upon his death in 2000 the newsletter was continued by trusted associates Doug Henwood and Phillipa Dunne.[2]\n\nLiscio died, aged 51, on November 29, 2000, at Mount Sinai Hospital in Manhattan from liver and kidney failure complications due to a hepatitis C infection. He was survived by his wife, Frances Pelzman Liscio, a humor writer, two preadolescent children, both his parents, and a sister."}, {"url": "https://link.springer.com/article/10.1007/s11156-019-00800-z", "page_content": "Arslanalp S, Liao W, Piao S, Seneviratne D (2016) China’s growing influence on Asian financial markets. International Monetary Fund Working Paper WP/16/173\n\nBarras L, Scaillet O, Wermers R (2010) False discoveries in mutual fund performance: measuring luck in estimated alphas. J Finance 65(1):179–216. https://doi.org/10.1111/j.1540-6261.2009.01527.x\n\nBollen NPB, Busse JA (2005) Short-term persistence in mutual fund performance. Rev Financ Stud 18(2):569–597. https://doi.org/10.1093/rfs/hhi007\n\nBrown SJ, Goetzmann WN (1995) Performance persistence. J Finance 50(2):679–698. https://doi.org/10.1111/j.1540-6261.1995.tb04800.x\n\nCarhart MM (1997) On persistence in mutual fund performance. J Finance 52(1):57–82. https://doi.org/10.1111/j.1540-6261.1997.tb03808.x\n\nChang JR, Hung MW, Lee CF (2003) An intertemporal CAPM approach to evaluate mutual fund performance. Rev Quant Finance Acc 20(4):415–433. https://doi.org/10.1023/A:1024076518110\n\nChen HL, Jegadeesh N, Wermers R (2000) The value of active mutual fund management: an examination of the stockholdings and trades of fund managers. J Finance Quant Anal 35(3):343–368. https://doi.org/10.2307/2676208\n\nChen J, Hong H, Huang M, Kubik JD (2004) Does Fund size erode mutual fund performance? The role of liquidity and organization. Am Econ Rev 94(5):1276–1302. https://doi.org/10.1257/0002828043052277\n\nChina Securities Regulatory Commission (2008) China Capital Markets Development Report. The CSRC, Beijing\n\nChina Securities Regulatory Commission (2014) Annual Report. The CSRC, Beijing\n\nChung R, Fung S, Patel J (2015) Alpha–beta–churn of equity picks by institutional investors and the robust superiority of hedge funds. Rev Quant Finance Acc 45(2):363–405. https://doi.org/10.1007/s11156-014-0440-x\n\nCuthbertson K, Nitzsche D (2013) Performance, stock selection and market timing of the German equity mutual fund industry. J Empir Finance 21:86–101. https://doi.org/10.1016/j.jempfin.2012.12.002\n\nCuthbertson K, Nitzsche D, O’Sullivan N (2008) UK mutual fund performance: skill or luck? J Empir Finance 15:613–634. https://doi.org/10.1016/j.jempfin.2007.09.005\n\nCuthbertson K, Nitzsche D, O’Sullivan N (2012) False discoveries in UK mutual fund performance. Eur Financ Manag 18(3):444–463. https://doi.org/10.1111/j.1468-036X.2009.00536.x\n\nElton EJ, Gruber MJ, Das S, Hlavka M (1993) Efficiency with costly information: a reinterpretation of evidence from managed portfolios. Rev Financ Stud 6(1):1–22. https://doi.org/10.1093/rfs/6.1.1\n\nFama EF, French KR (1993) Common risk factors in the returns on stocks and bonds. J Financ Econ 33(1):3–56. https://doi.org/10.1016/0304-405X(93)90023-5\n\nFama EF, French KR (2010) Luck versus skill in the cross-section of mutual fund returns. J Finance 65(5):1915–1947. https://doi.org/10.1111/j.1540-6261.2010.01598.x\n\nFerruz L, Muñoz F, Vargas M (2010) Does the size of a fund family matter when choosing an investment strategy? Evidence from Spain. Rev Quant Finance Acc 35(3):315–334. https://doi.org/10.1007/s11156-009-0106-2\n\nFirth M, Lin C, Zou H (2010) Friend or foe? The role of state and mutual fund ownership in the split share structure reform in China. J Financ Quant Anal 45(3):685–706. https://doi.org/10.1017/S0022109010000190\n\nGelos G (2011) International mutual funds, capital flow volatility, and contagion—a survey. International Monetary Fund Working Paper WP/11/92\n\nGong J, Jiang P, Tian S (2016) Contractual mutual fund governance: the case of China. Rev Quant Finance Acc 46(3):543–567. https://doi.org/10.1007/s11156-014-0475-z\n\nGrinblatt M, Titman S (1992) The persistence of mutual fund performance. J Finance 47(5):1977–1984. https://doi.org/10.1111/j.1540-6261.1992.tb04692.x\n\nHendricks D, Patel J, Zeckhauser R (1993) Hot hands in mutual funds: short-run persistence of relative performance, 1974–1988. J Finance 48(1):93–130. https://doi.org/10.1111/j.1540-6261.1993.tb04703.x\n\nHu GX, Chen C, Shao Y, Wang J (2018) Fama-French in China: size and value factors in Chinese stock returns. Int Rev Finance. https://doi.org/10.1111/irfi.12177\n\nJegadeesh N, Titman S (1993) Returns to buying winners and selling losers: implications for stock market efficiency. J Finance 48(1):65–91. https://doi.org/10.1111/j.1540-6261.1993.tb04702.x\n\nKacperczyk M, Sialm C, Zheng L (2005) On the industry concentration of actively managed equity mutual funds. J Finance 60(4):1983–2011. https://doi.org/10.1111/j.1540-6261.2005.00785.x\n\nKacperczyk M, Nieuwerburgh SV, Veldkamp L (2014) Time-varying fund manager skill. J Finance 69(4):1455–1484. https://doi.org/10.1111/jofi.12084\n\nKim S, In F, Ji PI, Park RJ (2014) False discoveries in the performance of Australian managed funds. Pac Basin Finance J 26:244–256. https://doi.org/10.1016/j.pacfin.2013.09.005\n\nKosowski R, Timmermann A, Wermers R, White H (2006) Can mutual fund “stars” really pick stocks? New evidence from a bootstrap analysis. J Financ 61(6):2551–2595. https://doi.org/10.1111/j.1540-6261.2006.01015.x\n\nLu T, Ren J, Zhao Y (2018) Costly long-short strategies under short-sale constraints: chinese evidence. Int Rev Financ 18(4):743–751. https://doi.org/10.1111/irfi.12160\n\nMalkiel B (2007) The efficiency of the Chinese stock markets: Some unfinished business of the road to economic transformation. CEPS Working Paper No. 154, Princeton University\n\nPopescu M, Xu Z (2018) Leading the herd: evidence from mutual funds’ buy and sell decisions. Rev Quant Finance Acc 50(4):1131–1146. https://doi.org/10.1007/s11156-017-0656-7\n\nRahman S, Lee CF, Xiao Y (2017) The investment performance, attributes, and investment behavior of ethical equity mutual funds in the US: an empirical investigation. Rev Quant Finance Acc 49(1):91–116. https://doi.org/10.1007/s11156-016-0581-1\n\nRohleder M, Schulte D, Wilkens M (2017) Management of flow risk in mutual funds. Rev Quant Finance Acc 48(1):31–56. https://doi.org/10.1007/s11156-015-0541-1\n\nSapp TR (2011) The 52-week high, momentum, and predicting mutual fund returns. Rev Quant Finance Acc 37(2):149–179. https://doi.org/10.1007/s11156-010-0199-7\n\nShiller RJ (2015) Irrational exuberance. Princeton University Press, Princeton\n\nStorey JD (2002) A direct approach to false discovery rates. J R Stat Soc Series B Stat Methodol 64(3): 479–498. https://doi.org/10.1111/1467-9868.00346\n\nTosun OK (2017) Is corporate social responsibility sufficient enough to explain the investment by socially responsible funds? Rev Quant Finance Acc 49(3):697–726. https://doi.org/10.1007/s11156-016-0605-x\n\nWang CC, Yu J (2018) The holdings markup behavior of mutual funds: evidence from an emerging market. Rev Quant Finance Acc 50(2):393–414. https://doi.org/10.1007/s11156-017-0633-1\n\nWermers R (2000) Mutual fund performance: an empirical decomposition into stock-picking talent, style, transactions costs, and expenses. J Finance 55(4):1655–1695. https://doi.org/10.1111/0022-1082.00263\n\nYang L, Liu W (2015) Luck versus skill: can chinese funds beat the market? Emerg Mark Finance Trade 53(3):629–643. https://doi.org/10.1080/1540496X.2015.1097951\n\nYi L, He L (2016) False discoveries in style timing of Chinese mutual funds. Pac Basin Finance J 38:194–208. https://doi.org/10.1016/j.pacfin.2016.04.005\n\nYi L, Hu Z (2016) Fund performance evaluation based on the FDR control. Syst Eng Theory Pract 36(4):846–856 (in Chinese)\n\nYuan R, Xiao JZ, Zou H (2008) Mutual funds’ ownership and firm performance: evidence from China. J Bank Finance 32(8):1552–1565. https://doi.org/10.1016/j.jbankfin.2007.08.001\n\nZhang X, Du S (2002) Can chinese mutual funds beat the market? J Financ Res 2002(1):1–22 (General No. 259) (in Chinese)"}, {"url": "https://apnews.com/article/business-economy-c36e982fa73e4f7ba50e207865be45e7", "page_content": "DUBLIN--(BUSINESS WIRE)--Nov 8, 2019--\n\nThe “TLR on the Economy” newsletter has been added to ResearchAndMarkets.com’s offering.\n\nSubscribers to TLR on the Economy receive, via email, two detailed reports a month, one reporting the results of our proprietary survey of state withheld receipts, a discussion of what the trend means for the economy, related research and analysis, and a forecast of the upcoming Employment Report from the Bureau of Labor Statistics; the other does the same thing but is based on our survey of state-level sales tax receipts and includes a forecast of the upcoming Retail Sales print from Census.\n\nIn addition, we breakdown the releases themselves, and send updates whenever we spot a new trend developing. This could be in any of the secondary releases, or something noticed by a tax contact, or that we ferreted out in a regional paper or study. TLR is designed for active money managers and traders. We put everything in long-term context, have extensive databases, and look beyond the noise.\n\nThe proprietary surveys of state-level withholding and sales tax receipts are the backbone of its researcher’s work. We have long-standing relationships with senior revenue estimators in tax departments around the country, whose insights give us a unique take on the state of the US economy. Instead of looking at total personal income receipts, which include non-wage income, we track withheld taxes since they are levied on wages and bonuses, not capital gains and the like.\n\nThe researchers do their own macro-economic research, and, unlike many other research-providers, do not manage money: they are beholden to no one but their subscribers and ourselves.\n\nPhilippa Dunne and Douglas Henwood were John Liscio’s closest associates and, since John’s untimely death in 2000, are honored to be carrying on the research techniques he pioneered when he established The Liscio Report on the international scene in 1992.\n\nThey are known for their meticulous dissection of federal data, for pointing out technical anomalies glossed over in the mainstream press (and related debunking of market rumours), and for ferreting out market-moving shifts in the economic landscape as they develop, getting the news out to their readers before the mainstream media catches on. They also grill the highly informed senior tax officials who participate in our surveys on their favored indicators, like diesel-fuel consumption, and collect their thoughts on emerging economic trends for our subscribers. They are watching the cash flow into the state coffers so they know what they are talking about.\n\nFor more information about this newsletter visit https://www.researchandmarkets.com/r/ue2ocb\n\nView source version on businesswire.com:https://www.businesswire.com/news/home/20191108005564/en/\n\nCONTACT: ResearchAndMarkets.com\n\nLaura Wood, Senior Press Manager\n\npress@researchandmarkets.com\n\nFor E.S.T Office Hours Call 1-917-300-0470\n\nFor U.S./CAN Toll Free Call 1-800-526-8630\n\nFor GMT Office Hours Call +353-1-416-8900\n\nKEYWORD:\n\nINDUSTRY KEYWORD: PROFESSIONAL SERVICES OTHER PROFESSIONAL SERVICES\n\nSOURCE: Research and Markets\n\nCopyright Business Wire 2019.\n\nPUB: 11/08/2019 02:21 PM/DISC: 11/08/2019 02:21 PM\n\nhttp://www.businesswire.com/news/home/20191108005564/en"}, {"url": "https://markets.financialcontent.com/stocks/news/read?GUID=39109686", "page_content": "The \"TLR on the Economy\" newsletter has been added to ResearchAndMarkets.com's offering.\n\nSubscribers to TLR on the Economy receive, via email, two detailed reports a month, one reporting the results of our proprietary survey of state withheld receipts, a discussion of what the trend means for the economy, related research and analysis, and a forecast of the upcoming Employment Report from the Bureau of Labor Statistics; the other does the same thing but is based on our survey of state-level sales tax receipts and includes a forecast of the upcoming Retail Sales print from Census.\n\nIn addition, we breakdown the releases themselves, and send updates whenever we spot a new trend developing. This could be in any of the secondary releases, or something noticed by a tax contact, or that we ferreted out in a regional paper or study. TLR is designed for active money managers and traders. We put everything in long-term context, have extensive databases, and look beyond the noise.\n\nThe proprietary surveys of state-level withholding and sales tax receipts are the backbone of its researcher's work. We have long-standing relationships with senior revenue estimators in tax departments around the country, whose insights give us a unique take on the state of the US economy. Instead of looking at total personal income receipts, which include non-wage income, we track withheld taxes since they are levied on wages and bonuses, not capital gains and the like.\n\nThe researchers do their own macro-economic research, and, unlike many other research-providers, do not manage money: they are beholden to no one but their subscribers and ourselves.\n\nPhilippa Dunne and Douglas Henwood were John Liscio's closest associates and, since John's untimely death in 2000, are honored to be carrying on the research techniques he pioneered when he established The Liscio Report on the international scene in 1992.\n\nThey are known for their meticulous dissection of federal data, for pointing out technical anomalies glossed over in the mainstream press (and related debunking of market rumours), and for ferreting out market-moving shifts in the economic landscape as they develop, getting the news out to their readers before the mainstream media catches on. They also grill the highly informed senior tax officials who participate in our surveys on their favored indicators, like diesel-fuel consumption, and collect their thoughts on emerging economic trends for our subscribers. They are watching the cash flow into the state coffers so they know what they are talking about.\n\nFor more information about this newsletter visit https://www.researchandmarkets.com/r/ue2ocb\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191108005564/en/"}]}