{"John Vallely was selected by the Lakers in the second round of the 1970 NBA draft.": [{"url": "https://www.landofbasketball.com/draft/1970_nba_draft.htm", "page_content": "403 Error - Forbidden\n\nFor some reason this resource can't be accessed.\n\n(If your browser version is too old it might have been blocked for security reasons. Try updating its version)."}, {"url": "https://a1squad.com/1970-nba-draft/", "page_content": "1970 NBA Draft: 12 Reasons (Players) It’s One Of The Best Ever\n\nThe 1970 NBA Draft was the 24th in league history after its founding during the 1946-1947 season. The Detroit Pistons were awarded the first overall pick after finishing the previous season with a 31-51 record, the worst in the Eastern Conference. It was the first draft to include the Buffalo Braves, Cleveland Cavaliers, and Portland Trail Blazers, 3 new expansion teams who were assigned the 7-9 picks in each round.\n\nThe 1970 NBA Draft\n\nAlthough it doesn’t get the recognition of the 1984, 1996, and 2003 drafts, the 1970 NBA draft was one of the best drafts in NBA history, producing an impressive array of legendary basketball players. Each of the first 4 picks was inducted into the Naismith Memorial Basketball Hall of Fame, although #2 pick Rudy Tomjanovich was inducted for his career as a coach.\n\nThe 1970 NBA draft class produced 12 players who were named to at least 1 all-star team, 4 players were named to at least 1 All-NBA team, and an NBA draft class record 8 members of the hall of fame.\n\nWho won the Rookie of the Year?\n\nCenter Dave Cowens of the Boston Celtics and shooting guard Geoff Petrie of the Portland Trail Blazers were co-winners of the NBA Rookie of the Year award after posting impressive individual seasons. Cowens averaged 17 PPG, 15 RPG, and 2.8 APG, all while helping the Celtics to a modest 10-win improvement from the previous season. Petrie was one of the lone bright spots for the inaugural season for the Trail Blazers, who would end up with a paltry 29-53 record, averaging 24.8 PPG, 4.8 APG, and 3.4 RPG.\n\nWho was in the 1970 NBA Draft Class?\n\nFIRST ROUND\n\nBob Lanier (Detroit Pistons) Rudy Tomjanovich (San Diego Rockets) Pete Maravich (Atlanta Hawks) Dave Cowens (Boston Celtics) Sam Lacey (Cincinnati Royals) Jim Ard (Seattle SuperSonics) John Johnson (Cleveland Cavaliers) Geoff Petrie (Portland Trail Blazers) George Johnson (Baltimore Bullets) Greg Howard (Phoenix Suns) Jimmy Collins (Chicago Bulls) Al Henry (Philadelphia 76ers) Jim McMillian (Los Angeles Lakers) John Vallely (Atlanta Hawks) John Hummer (Buffalo Braves) Gary Freeman (Milwaukee Bucks) Mike Price (New York Knicks)\n\nSECOND ROUND\n\nCalvin Murphy (San Diego Rockets) Nate Archibald (Cincinnati Royals) Jake Ford (Seattle SuperSonics) Rex Morgan (Boston Celtics) Doug Cook (Cincinnati Royals) Pete Cross (Seattle SuperSonics) Cornell Warner (Buffalo Braves) Walt Gilmore (Portland Trail Blazers) Dave Sorenson (Cleveland Cavaliers) Fred Taylor (Phoenix Suns) Paul Ruffner (Chicago Bulls) Joe DePre (Phoenix Suns) Earnie Killum (Los Angeles Lakers) Dan Hester (Atlanta Hawks) Ken Warzynski (Detroit Pistons) Bill Zopf (Milwaukee Bucks) Howie Wright (New York Knicks)\n\nTHIRD ROUND\n\nCurtis Perry (SDR) Earle Higgins (SFW) Bob St. Pierre (DET) Willie Williams (BOS) Greg Hyder (CIN) Gar Heard (SEA) Surry Oliver (CLE) Bill Cain (POR) Chip Case (BUF) Greg McDivitt (PHO) Lou Herndon (CHI) Dennis Awtrey (PHI) Jim Hayes (DET) Vann Williford (PHO) Seabern Hill (BAL) Marv Winkler (MIL) Al Williams (NYK)\n\nFOURTH ROUND\n\nJody Finney (SDR) Ralph Ogden (SFW) Bill Stricker (BAL) Jon McKinney (BOS) Wade Fuller (CIN) John Davis (CHI) Erwin Polnick (BUF) Jim Penix (POR) Glenn Vidnovic (CLE) Bob Lienhard (PHO) Jim Wilson (CHI) Dan Crenshaw (PHI) Larry Mikan (LAL) Fred Davis (ATL) Billy Jones (BAL) Virgle Fredrick (MIL) John Marren (NYK)\n\nFIFTH ROUND\n\nJames Gilbert (SDR) Levi Fontaine (SFW) Bill Jankans (DET) Tom Carter (BOS) Uluss Thompson (CIN) Boyd Lynch (SEA) Wayne Sokolowski (CLE) Ron Knight (POR) Robert Moore (BUF) John Canine (PHO) George Johnson (CHI) Perry Wallace (PHI) John Fultz (LAL) Bob Riley (ATL) Gary Zeller (BAL) Mike Grosso (MIL) Jim Oxley (NYK)\n\nSIXTH ROUND\n\nMike Kretzer (SDR) Vic Bartolome (SFW) Sevira Brown (DET) Rod McIntyre (BOS) Charles Bishop (CIN) Samuel Robinson (SEA) Doug Hess (BUF) George Janky (POR) Joe Cooke (CLE) Joe Thomas (PHO) Lonnie Kluttz (CHI) Jerry Venable (PHI) Jerry Kroll (LAL) Dave Parker (ATL) Marvin Polnick (BAL) Willie Watson (MIL) Jim Signorile (NYK)\n\nSEVENTH ROUND\n\nBilly Paultz (SDR) Joe Bergman (SFW) Marv Copeland (DET) Charlie Scott (BOS) Mike Bernard (CIN) James Morgan (SEA) Narvis Anderson (CLE) Claude English (POR) Cliff Shegogg (BUF) Heyward Dotson (PHO) Lou West (CHI) Carlton Poole (PHI) Willie Woods (LAL) John Shinall (ATL) Charlie Wallace (BAL) John Rinka (MIL) Ray Hodge (NYK)\n\nEIGHTH ROUND\n\nDon Adams (SDR) Jeff Sewell (SFW) Dan Issel (DET) Bobby Croft (BOS) Joe McBride (CIN) George Irvine (SEA) Larry Woods (BUF) Doug Boyd (POR) Walter Robertson (CLE) Steve Patterson (PHO) Mike Casey (CHI) Fran O’Hanlon (PHI) Rick Mount (LAL) Herb White (ATL) Tom Dykstra (BAL) Jim Sarno (MIL) Greg Fillmore (NYK)\n\nNINTH ROUND\n\nJim Gottschall (SDR) Lou Small (SFW) Alex Winn (DET) Tom Little (BOS) Bob Mabry (CIN) Claude Virden (SEA) Tom Lagodich (CLE) Billy Gaskins (POR) Larry Duckworth (BUF) Carl Ashley (PHO) Glen Johnson (CHI) Mike Hauer (PHI) Bobby Sands (LAL) Larry Jackson (ATL) Will Hetzel (BAL) Joe Hamilton (MIL) Walker Banks (NYK)\n\nTENTH ROUND\n\nToke Coleman (SDR) Coby Dietrick (SFW) Bruce Chapman (DET) Mike Maloy (BOS) Carl Johnson (CIN) Chuck Lloyd (SEA) Joe Taylor (BUF) Israel Oliver (POR) Ken Johnson (CLE) Gerhard Schreur (PHO) Dale Blaut (CHI) Gordon Stiles (PHI) Kindell Stephens (LAL) Manuel Raga (ATL) Ron Becker (BAL) Bob Seemer (MIL) Don Curnutt (NYK)\n\nELEVENTH ROUND\n\nRon Belton (SDR) Rick Anheuser (DET) Ted Hillary (CIN) Andy Owens (SEA) Dave Schneider (CLE) Dan McLemore (POR) Dick Walker (BUF) Jim Walls (PHO) Doug Howard (CHI) David Whitley (PHI) Bob Dukiet (LAL) Deno Mengham (ATL) Mel Bell (BAL)\n\nTWELFTH ROUND\n\nJim Brooks (SDR) Don Ogletree (DET) Reggie Roach (CIN) Joe Brunson (SEA) Paul Adams (POR) Oliver Taylor (CLE) Ric Cobb (PHO) Booker Brown (CHI) Dewey Varner (LAL) Ben McGilmer (BAL)\n\nTHIRTEENTH ROUND\n\nHarry Lozon (SDR) Ernest Hardy (DET) Larry Gray (CIN) Allen McManus (SEA) Kevin Wilson (CLE) Alex Boyd (POR) Fred Carpenter (PHO) Charles Bloodworth (CHI) Gary Elliot (LAL) Don Debardelaben (BAL)\n\nFOURTEENTH ROUND\n\nClyde Oatis (SDR) Randy Smith (DET) Andy Jennings (CIN) Dan Beeson (SEA) Frank Lothridge (POR) Don Tomilson (CLE) Chad Calabria (PHO) Paul Funkhouser (CHI) Ron Sanford (LAL) Mike Williams (BAL)\n\nFIFTEENTH ROUND\n\nJay Bond (SDR) Denis Clark (DET) Mike Neer (CIN) Steve Wannamaker (SEA) Wayne Canaday (POR) Walt Williams (PHO) Paul Otay (CHI) Will Teague (LAL) Ted Rose (BAL)\n\nSIXTEENTH ROUND\n\nDean Elofson (SDR) Harvey Marlatt (DET) Paul Favorite (CIN) Doug Williams (POR) Stephen Wilson (CLE) Pete Walthour (LAL) Don Rather (BAL)\n\nSEVENTEENTH ROUND\n\nDennis Dickens (SDR) Rich Peterson (CLE) Bob Thati (LAL) Vince Fritz (BAL)\n\nEIGHTEENTH ROUND\n\nJeff Cunningham (SDR) Bruce Butchko (POR) Emmanuel Cannon (CLE)\n\nNINETEENTH ROUND\n\nRick Erickson (SDR) Allen Waller (CLE) Mark Gabriel (POR)\n\nWho were the 3 Best Players from the 1970 NBA Draft?\n\nPete Maravich\n\nAfter being selected 3rd overall by the Atlanta Hawks, Pete Maravich quickly burst onto the scene as one of the most electrifying offensive players in the NBA. For his first 8 seasons in the NBA, Maravich was arguably the best guard in the NBA, although he would only make the playoffs 4 times in his career and win just 1 playoff series.\n\nMaravich’s career was ultimately cut short due to knee problems, forcing him to retire after 10 seasons in the NBA. Maravich averaged 24.2 PPG, 5.4 APG, 4.2 RPG, and shot 82% from the free-throw line during his career. He was named to the All-NBA 1st Team twice, was named to the All-NBA 2nd Team twice, and was named to 5 all-star games.\n\nPistol Pete was named one of the 50 Greatest Players in NBA History and was named a member of the NBA 75th Anniversary Team. Maravich was inducted into the Naismith Memorial Basketball Hall of Fame in 1987.\n\nDave Cowens\n\nDave Cowens was selected with the 4th pick by the Boston Celtics and immediately became one of the best centers in the NBA during the 1970s. He became famous for his constant intensity and hustle on both ends of the court that never faltered at any point during his career.\n\nCowens bridged the gap for the Celtics between their more famous 60s and 80s teams, helping the Celtics to win 2 championships during the 1970s. He averaged 17.6 PPG, 13.6 RPG, 3.8 APG, and shot 78.3% from the free-throw line.\n\nCowens was named to the All-NBA 2nd Team 3 times, was named to the All-Defensive 1st Team once, was named to the All-Defensive 2nd Team twice, and was named to 8 all-star games. He was named one of the 50 Greatest Players in NBA History and a member of the NBA 75th Anniversary Team. Cowens was inducted into the Naismith Memorial Basketball Hall of Fame in 1991.\n\nNate Archibald\n\nNate Archibald was selected with the 19th overall pick in the 2nd round and completely overachieved his relatively modest draft status. He became the best point guard in the NBA during the early 70s, famously leading the league in both points and assists during the 1972-1973 season.\n\nArchibald’s 1972-1973 season is regarded as one of the best individual seasons in NBA history and saw him average 34 PPG and 11.4 APG, all while shooting 84.7% from the free-throw line and playing an incredible 46 minutes per game. Later in his career, Archibald would play for the Boston Celtics and would win a championship with them during the 1980-1981 season.\n\nArchibald averaged 18.8 PPG, 7.4 APG, 1.1 SPG, and shot 81% from the free-throw line during his career. He was named to the All-NBA 1st Team 3 times, was named to the All-NBA 2nd Team 2 times, and was named to 6 all-star games. He was named one of the 50 Greatest Players in NBA History and a member of the NBA 75th Anniversary Team. Archibald was inducted into the Naismith Memorial Basketball Hall of Fame in 1991.\n\nOther Standouts from the 1970 NBA Draft\n\nBob Lanier\n\nAlthough he was the #1 overall pick and ended up having a great career at the center position, Bob Lanier was one of the most underrated and underappreciated players in the NBA. He was overshadowed by many other centers during the 70s, such as Kareem Abdul-Jabbar, Dave Cowens, Wes Unseld, and Bill Walton. He averaged 20.1 PPG, 10.1 RPG, 3.1 APG, and shot 51.4% from the field, and was named to 8 all-star games. Lanier was inducted into the Naismith Memorial Basketball Hall of Fame in 1992.\n\nRudy Tomjanovich\n\nWhile he is better known for his coaching days where he guided the Rockets to their only 2 championships in franchise history, Rudy Tomjanovich also had a successful playing career for the Rockets after being selected #2 overall in the draft. He averaged 17.4 PPG and 8.1 RPG over his career, mostly at the power forward position, and also shot 50.1% from the field and 78.4% from the free-throw line. Tomjanovich was also named to 5 all-star games during his 11-year NBA career.\n\nSam Lacey\n\nSam Lacey was taken with the 5th overall selection and had a good career as a starting center, though not nearly reaching the heights of Cowens or Lanier. He was a part of one of the most successful drafts in the history of the Cincinnati Royals franchise, which saw them select future hall of fame inductee Nate Archibald in the next round. He averaged 10.3 PPG and 9.7 RPG over his career and was named to one all-star game during the 1974-1975 season.\n\nJohn Johnson\n\nJohn Johnson was selected with the #7 pick by the historically incompetent Cleveland Cavaliers franchise and would be one of the few bright spots for the team during the 3 years he spent with the team. He averaged 12.9 PPG, 5.5 RPG, and 3.8 APG during his playing days, while also shooting 77.9% from the free-throw line. Johnson was named to 2 all-star games, both during his time with the Cavaliers.\n\nGeoff Petrie\n\nGeoff Petrie was the first draft pick in the history of the Portland Trail Blazers at the #8 pick and would end up having a successful career with the team at shooting guard. Unfortunately, a serious knee injury ended his career after just 6 seasons in the NBA. Petrie averaged 21.8 PPG, 4.6 APG, and shot 80.5% from the free-throw line during his career, all while being named to 2 all-star games.\n\nCalvin Murphy\n\nStanding at just 5 feet, 9 inches tall, and being selected with the #18 pick in the 2nd round by the Houston Rockets, point guard Calvin Murphy was not expected to make a major impact in the NBA. However, he was able to average 17.9 PPG, 4.4 APG, and 1.5 SPG over a successful 13-year career, and also shoot an incredible 89.2% from the free-throw line. Murphy was named to 1 all-star game during the 1978-1979 season and was inducted into the Naismith Memorial Basketball Hall of Fame in 1993.\n\nCharlie Scott\n\nAlthough he was selected by the Boston Celtics in the 7th round, Charlie Scott had already signed a contract with the Virginia Squires of the American Basketball Association and would spend the early part of his career in the ABA. He would eventually join the NBA and averaged 20.7 PPG, 4.9 APG, 4 RPG, and 1.3 SPG at both the point guard and shooting guard positions during his playing days. He was named to 3 NBA and 2 ABA all-star games over his career and was also named to the All-ABA 1st Team and All-ABA 2nd Team one time each. Scott was inducted into the Naismith Memorial Basketball Hall of Fame in 2018.\n\nDan Issel\n\nDan Issel was taken in the 1st round of the ABA draft by the Kentucky Colonels and the 8th round of the NBA draft by the Detroit Pistons. He would opt to play in the ABA until the league folded in 1976 and would then spend several more years in the NBA. He averaged 22.6 PPG and 9.1 RPG for his career, playing both the center and power forward positions. He was named to the All-ABA 1st Team once, was named to the All-ABA 2nd Team 4 times, was named to 6 ABA all-star games, and was named to 1 NBA all-star game. Issel was inducted into the Naismith Memorial Basketball Hall of Fame in 1993.\n\nRandy Smith\n\nDespite being selected in the 14th round of the draft by the Buffalo Braves, Randy Smith would prove to be one of the biggest overachievers in NBA history, posting a very successful NBA career. Smith averaged 16.7 PPG, 4.6 APG, 3.7 RPG, and 1.7 SPG during his career at the shooting guard position. He was named to the All-NBA 2nd Team once and was named to 2 all-star games.\n\nOne Of The Best Drafts Ever\n\nThe 1970 NBA draft was one of the best drafts in league history, producing a significant number of hall of fame players. The draft class boasted both significant top-line talent and strong overall depth, providing a significant boost to both the NBA and ABA for years to come. Its lack of recognition probably arises from the fact that it occurred over 50 years ago and opened the decade of the 70s, which was a low point for the NBA in terms of popularity."}, {"url": "https://basketball.realgm.com/player/John-Vallely/Summary/66807", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://basketball.realgm.com/nba/teams/Atlanta-Hawks/1/Rosters/Regular/1971", "page_content": "Bob Christian was selected as the #10 pick in the 8 Round of the 1969 NBA Draft by the Atlanta Hawks. Bob Christian signed a multi-year contract with the Atlanta Hawks on September 1, 1970.\n\nLou Hudson was selected as the #4 pick in the First Round of the 1966 NBA Draft by the St. Louis Hawks. Lou Hudson signed a multi-year contract with the St. Louis Hawks on September 1, 1966.\n\nPete Maravich was selected as the #3 pick in the First Round of the 1970 NBA Draft by the Atlanta Hawks. Pete Maravich signed a multi-year contract with the Atlanta Hawks on April 1, 1970.\n\nJohn Vallely was selected as the #14 pick in the First Round of the 1970 NBA Draft by the Atlanta Hawks. John Vallely signed a multi-year contract with the Atlanta Hawks on May 8, 1970.\n\nHerb White was selected as the #14 pick in the 8 Round of the 1970 NBA Draft by the Atlanta Hawks. Herb White signed a contract with the Atlanta Hawks on September 1, 1970."}, {"url": "https://amickamookandamic.com/2022/04/john-vallely-2x-ucla-basketball-champion-joins-mick-mook-on-4-13/", "page_content": "Frank & Billy are looking forward to a visit from the legendary UCLA basketball star and a first round pick in the NBA draft, John Vallely, on the April 13th episode of A Mick A Mook and A Mic.\n\nVallely, a former NBA player and 2x NCAA Basketball Champion, was a star and All-American for the John Wooden led UCLA Bruins. He won his two NCAA championships in 1969 and 1970, and was a teammate of Kareem Abdul Jabbar (then known as Lew Alcindor) in ’69.\n\nThe 14th player drafted in the First Round of the 1970 NBA Draft by the Atlanta Hawks, the 6’2” guard also played for the Houston Rockets.\n\nAs impressive as Vallely was in hoops, the Newport Beach, CA born athlete was equally dominant in volleyball. Introduced to beach volleyball while in high school, John was a member of one of beach volleyball’s greatest two-man duos ever. In 1969, Vallely and his partner, the legendary Von Hagen, put together a perfect season, winning all of the five open tournaments they entered.\n\nVallely was recognized for his beach volleyball accomplishments by being inducted into the California Beach Volleyball Association (CBVA) Hall of Fame.\n\nFollowing his basketball career, Vallely built a successful real estate portfolio and a sports apparel business. Since the passing of his daughter, Erin, from cancer at the age of 12, he has been actively involved in pediatric cancer research, serving on the Board of Director of the Pediatric Cancer Research Foundation with Rod Carew.\n\nVallely faced his own battle with cancer, being diagnosed with non-Hodgkin’s lymphoma in 2002, and was later blessed with a successful stem cell/bone marrow transplant in 2006. He called on the lessons he learned from Coach Wooden to come out triumphant in that battle as well.\n\nJohn currently works in Orange County, CA where he lives with his wife Karen of 50+ years, and close to his son Eric and granddaughter Erin.\n\nA basketball legend and a California Beach Volleyball Hall of Famer, the affable John Vallely will be a special ‘MMM’ guest on April 13th.\n\n###"}, {"url": "https://basketball.realgm.com/player/John-Vallely/Teammates/66807", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://basketball.realgm.com/nba/teams/Houston-Rockets/10/Rosters/Regular/1972", "page_content": "Elvin Hayes was selected as the #1 pick in the First Round of the 1968 NBA Draft by the San Diego Rockets. Elvin Hayes signed a multi-year contract with the San Diego Rockets on May 1, 1968.\n\nStu Lantz was selected as the #1 pick in the 3 Round of the 1968 NBA Draft by the San Diego Rockets. Stu Lantz signed a multi-year contract with the San Diego Rockets on September 1, 1968.\n\nCliff Meely was selected as the #7 pick in the First Round of the 1971 NBA Draft by the San Diego Rockets. Cliff Meely signed a multi-year contract with the Houston Rockets on September 1, 1971.\n\nCalvin Murphy was selected as the #1 pick in the Second Round of the 1970 NBA Draft by the San Diego Rockets. Calvin Murphy signed a multi-year contract with the San Diego Rockets on September 1, 1970.\n\nMike Newlin was selected as the #7 pick in the Second Round of the 1971 NBA Draft by the Houston Rockets. Mike Newlin signed a multi-year contract with the Houston Rockets on April 27, 1971.\n\nRudy Tomjanovich was selected as the #2 pick in the First Round of the 1970 NBA Draft by the San Diego Rockets. Rudy Tomjanovich signed a multi-year contract with the San Diego Rockets on September 1, 1970."}, {"url": "https://www.britannica.com/biography/LeBron-James", "page_content": "LeBron James has won three National Basketball Association (NBA) championships. He won his first two championships with the Miami Heat in 2012 and 2013. He won a third championship with the Cleveland Cavaliers in 2016.\n\nSelected first overall in the 2003 National Basketball Association (NBA) draft by the Cleveland Cavaliers , LeBron James played for the Cavaliers through the end of the 2009–10 season. He then signed with the Miami Heat and won two championships before returning to the Cavaliers in 2014. James joined the Los Angeles Lakers in 2018.\n\nBorn and raised in Akron , Ohio, LeBron James was a locally known basketball prodigy. In high school James led St. Vincent–St. Mary High School to three state championships in four years. He was named Ohio’s Mr. Basketball, or high-school player of the year, three times during 2001–03.\n\nLeBron James is an American professional basketball player. James has won three National Basketball Association (NBA) championships and four NBA MVP awards (2008–09, 2009–10, 2011–12, and 2012–13). He has competed in several men’s Olympic basketball tournaments. Today he is widely considered one of the greatest all-around basketball players of all time.\n\nLeBron James, in full LeBron Raymone James, byname King James, (born December 30, 1984, Akron, Ohio, U.S.), American professional basketball player who is widely considered one of the greatest all-around players of all time and who won National Basketball Association (NBA) championships with the Miami Heat (2012 and 2013), the Cleveland Cavaliers (2016), and the Los Angeles Lakers (2020). In 2023 he became the NBA’s all-time leading scorer, breaking the record (38,387) previously held by Kareem Abdul-Jabbar.\n\nA locally known basketball prodigy since elementary school, James was named Ohio’s Mr. Basketball (high-school player of the year) three times while leading Akron’s St. Vincent–St. Mary High School to three Ohio state championships in his four years on the team. He became a national media sensation in his junior year after appearing on the cover of Sports Illustrated, where he was billed by the magazine as “The Chosen One.” James was the consensus national high-school player of the year in his senior season, and he was selected by the Cleveland Cavaliers with the first overall selection of the 2003 NBA draft. Additionally, he signed an unprecedented $90 million endorsement contract with the Nike shoe company before he ever played a professional game.\n\nBritannica Quiz Basketball Quiz\n\nDespite the pressures brought on by these singular circumstances, James led the Cavaliers in scoring, steals, and minutes played over the course of the 2003–04 season, winning the league’s Rookie of the Year award in the process. A 6-foot 8-inch (2.03-metre) “point forward” who was as adept at bringing the ball down the court as at playing near the basket, James presented a unique challenge for opposing teams; his unmatched athleticism and well-muscled body would not have been out of place in the National Football League.\n\nHis game progressed over the following years. He was voted one of the starting forwards on the Eastern Conference All-Star team during his second season, and in his third season he led the Cavaliers to their first playoff berth in nine years. These accomplishments were exceeded during the 2006–07 season, when James guided Cleveland to the franchise’s first berth in the NBA finals. After the Cavaliers upset the favoured Detroit Pistons in the Eastern Conference finals, the Cavaliers were swept by the San Antonio Spurs in the NBA finals, but James’s impressive postseason play led many observers to place him among the very best players in the league. He led the NBA in scoring during the 2007–08 season and earned first team All-NBA honours, but the Cavaliers lost to the eventual champion Boston Celtics in a dramatic seven-game series in the Eastern Conference semifinals. James piloted the Cavaliers to a team-record 66 wins during the 2008–09 season, which helped to earn him the league’s Most Valuable Player (MVP) award. The following season James averaged nearly 30 points per game as he was again named MVP.\n\nAt the end of the 2009–10 season, James became arguably the most sought-after free agent in NBA history when his contract with the Cavaliers expired, and he began a prolonged courtship process with a number of teams that had in some cases been planning for his free agency for over two years. In an unprecedented hour-long television special, criticized by many for its undue grandiosity, James announced that he was signing with the Heat. He helped Miami reach the NBA finals in his first year with the team, but the Heat lost the championship to the Dallas Mavericks. In the 2011–12 season James averaged 27.1 points per game and won his third MVP award while helping Miami advance to its second consecutive NBA finals appearance. Backed by his stellar play—James was named the finals MVP—the Heat defeated the Oklahoma City Thunder to win the championship.\n\nHe had arguably his greatest individual season in 2012–13, as he averaged 26.8 points, 7.3 assists, and a career-high 8.0 rebounds per game while posting a .565 field-goal percentage, a remarkable rate of made shots for someone who so frequently played away from the basket. James also helped Miami win 27 consecutive games that season (the second longest such streak in NBA history), and he was rewarded with his fourth league MVP award. In the following postseason, the Heat defeated the San Antonio Spurs in a seven-game series to win the NBA championship, and James was again named the finals MVP. He continued his stellar play in the following season, even increasing his shooting percentage by .002, and he again led the Heat to an appearance in the NBA finals. However, Miami lost that rematch with the Spurs in a five-game series.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nAfter that finals loss, James opted out of his contract with the Heat, leaving an aging Miami roster, and—after a week of frenzied speculation among fans and media—he decided to return to Cleveland. Although his 25.3 points per game was James’s lowest scoring average since his rookie season, he nevertheless guided a young and inexperienced Cavaliers roster to the second best record in the Eastern Conference in 2014–15. In the following postseason he led an injury-laden Cleveland team to just two playoff losses en route to a berth in the NBA finals. There James had one of the greatest individual performances in finals history, averaging 35.8 points, 13.3 rebounds, and 8.8 assists per game while leading the undermanned Cavaliers to the franchise’s first two finals victories before ultimately losing a six-game series to the Golden State Warriors.\n\nJames had another strong regular season in 2015–16 but, once again, truly shined in the playoffs. He led the Cavaliers to a rematch against the Warriors, who had set a league record with 73 wins during the regular season, in the NBA finals. There the Cavaliers became the first team to come back from a 3–1 finals deficit to capture the first title in franchise history and end a 52-year title drought for Cleveland professional sports teams. James averaged 29.7 points, 11.3 rebounds, 8.9 assists, 2.6 steals, and 2.3 blocks per game in the finals—becoming the first person to lead all five statistical categories for players on both teams in the finals—and was unanimously named finals MVP.\n\nIn 2016–17 James had arguably his best regular season by setting career highs with averages of 8.7 assists and 8.6 rebounds per game while still scoring 26.4 points per game. He sustained his excellence in the Eastern Conference playoffs, scoring 32.5 points per game (which included his 5,988th career postseason point, breaking Michael Jordan’s all-time NBA playoff scoring record) while leading the Cavaliers to a third consecutive match-up against the Warriors in the NBA finals. There Cleveland could not overcome the team James referred to as a “juggernaut,” losing to the Warriors in five games despite James becoming the first player in NBA history to average a triple-double over the course of the finals (with 33.6 points, 12 rebounds, and 10 assists per game).\n\nIn 2017–18 he played a full 82-game regular season for the first time in his career and led the NBA in minutes played per game (36.9) while averaging 27.5 points, 8.6 rebounds, and a new career-high 9.1 assists per game. James again excelled in the following playoffs, scoring more than 40 points seven times in the team’s 18 Eastern Conference postseason games (which included two seven-game series) to lead the Cavaliers to their fourth straight NBA finals series against the Warriors. He continued his strong individual play in the finals, but it was not enough to overcome Golden State’s overwhelming talent advantage, and the Warriors swept the series.\n\nIn the following off-season, James, a free agent, joined the Los Angeles Lakers. He continued to play at a high level, averaging 27.4 points, 8.5 rebounds, and 8.3 assists per game, but he missed significant playing time because of an injury (a strained groin) for the first time in his career. The Lakers struggled in his absence and ultimately finished the 2018–19 season with a 37–45 record, ending James’s personal playoff streak at 13 seasons. The following season was disrupted by the COVID-19 pandemic, which caused a four-month suspension. Play resumed in July 2020 with a shortened schedule, and the Lakers ultimately defeated the Miami Heat to claim the franchise’s 17th NBA title. James’s dominating performance—he averaged 29.8 points, 11.8 rebounds, and 8.5 assists per game—earned him his fourth finals MVP award.\n\nIn addition to his achievements in the NBA, James was a member of the U.S. men’s Olympic basketball teams that won the bronze medal at the 2004 Games, the gold medal at the 2008 Games, and the gold at the 2012 Games. He also published a memoir, Shooting Stars (2009; cowritten with Buzz Bissinger), that chronicles his years as a high-school standout."}]}