{"John Vallely was inducted into the UCLA Athletics Hall of Fame in 2003.": [{"url": "https://uclabruins.com/honors/hall-of-fame/john-valley/131", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://uclabruins.com/sports/2013/4/17/208274086.aspx", "page_content": "Since 1950, UCLA continues its tradition into the 21st century as having the most impressive collegiate sports history of any university in the nation. Come see the original Heisman Trophy won by Gary Beban, the Wooden Awards won by Marques Johnson and Ed O'Bannon and the Honda-Broderick Cups won by our stellar female athletes Lisa Fernandez, Jackie Joyner-Kersee, Ann Meyers Drysdale, and Natasha Watley.\n\nWatch video highlights, view pictures and read engaging information about every UCLA student-athlete who lettered in a sport from 1919 to the present. Admire the many \"Bruin legends\" who utilized their UCLA experiences to become professional athletes and Olympians while excelling in the nation's #1 collegiate athletic program.\n\nVisit the Hall of Fame\n\nHours"}, {"url": "https://uclabruins.com/honors/hall-of-fame", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://new.dailybruin.com/post/former-ucla-basketball-player-leads-11th-annual-dribble-for-the-cure", "page_content": "John Vallely and his wife held their daughter in their arms.\n\nAfter fighting for two and a half years, Erin died of cancer at the age of 12.\n\nVallely – a former UCLA men’s basketball player – established Dribble for the Cure at UCLA in 2008 as a way to combine his love for the sport and determination to improve cancer research.\n\nCancer has played a huge role in Vallely’s life.\n\nHe began the fight of pediatric cancer with his daughter in 1988. Erin was diagnosed with rhabdomyosarcoma, a rare cancer of the soft muscle tissue.\n\n“As a result of losing Erin that day, we’ve been giving our time and funds and effort to try to change the world for these children that fight cancer,” Vallely said.\n\nThe UCLA Hall of Famer fought a long battle of non-Hodgkins lymphoma himself in 2003, pulling inspiration from his daughter’s perseverance in his long journey to remission.\n\nAfter undergoing multiple rounds of stem cell treatment, Vallely decided that serving as a longtime member on the board of directors for the Pediatric Cancer Research Foundation wasn’t enough.\n\n“(Vallely) had this idea,” said Ashley Armstrong, an associate athletic director. “And so he brought it to me and (Director of Athletics Dan Guerrero) and talked about wanting to partner with the basketball programs.”\n\nIn 2008, Dribble for the Cure debuted as an annual event hosted by UCLA. PCRF, the Cancer Research Program at Mattel Children’s Hospital and UCLA Athletics put on the event for kids, students and families.\n\n“(Guerrero) kind of left it up to me to decide how we wanted to do the event,” Armstrong said. She was the director of student-athlete development at the time.\n\nParticipants receive pledges to raise money for pediatric cancer by dribbling a 1-mile course from Drake Stadium to Pauley Pavilion.\n\nDribble for the Cure has brought in $1,464,350 from 7,425 participants over the past 10 years. Participants raised just over $80,000 in the event’s inaugural year, but has since increased in proceeds each year.\n\nSt. John’s University – the only other institution that currently hosts the event – held its eighth Dribble for the Cure on Sept. 22 and has raised over $500,000 since it first ran the event in 2011.\n\nThe money raised is split evenly between PCRF and the Cancer Research Program at Mattel Children’s Hospital.\n\nUCLA’s men’s and women’s basketball players have also played an integral role in the event, dribbling the course with the participants and signing autographs at the end.\n\n“Over the last 11 years, we’ve had different coaches (both men’s and women’s),” said Ric Coy, the current director of student-athlete development. “Each coach that we have brought in has totally been happily involved in this event because they see the purpose of it.”\n\nCoy has been assisting Armstrong in Dribble for the Cure since 2008, but took over coordinating duties in 2016. This will be Coy’s third year leading the event.\n\nStudent-athlete participation has also grown. About 100 student-athletes from men’s volleyball, women’s water polo and gymnastics participated in 2017. “They may not be fundraising,” Armstrong said. “But they’re there to help out with registration, they’re painting faces, they’re handing out goodies, they’re hanging out with the kids and participating some way in the event.”\n\nOther student groups including Bruins Fighting Pediatric Cancer as well as fraternities and sororities have participated in previous years. Armstrong said local middle schools and high schools have also been participating.\n\nUCLA’s 11th annual Dribble for the Cure will be held on Sunday, coincidentally falling on what would have been coach John Wooden’s 108th birthday.\n\nVallely, who came to UCLA as a junior transfer out of Orange Coast College, played on Wooden’s 1969 and 1970 championship teams, and was picked by the Atlanta Hawks in the first round of the 1970 NBA Draft.\n\n“Coach (Wooden) taught us that finding the true meaning of success in our lives would be more important than probably anything we would ever do on the basketball court,” Vallely said. “So I think he would be thrilled that anything was happening in relationship to him as it relates to giving others.”\n\nKids will be given backpacks with the words “Happy Birthday, Coach Wooden” on them to honor the former UCLA coach Sunday.\n\nAs 12 year olds dribble toward Pauley Pavilion this weekend, their efforts will make strides in the fight against pediatric cancer.\n\n“We’ve managed to help improve the survival rate in children,” Vallely said. “So it’s kind of cool to know that we’ve had a hand in that.”"}, {"url": "https://uclabruins.com/news/2021/6/29/bruin-athletics-ucla-athletic-hall-of-fame-class-of-2021-revealed.aspx", "page_content": "Eight outstanding Bruins will join the UCLA Athletic Hall of Fame in the Class of 2021. The members of the star-studded class are as follows: Trevor Bauer (baseball), Jeanette Bolden (track & field), Tiffany Joh (women's golf), Megan Langenfeld (softball), Marcedes Lewis (football),(men's basketball), Keiko Price (women's swimming & diving), and Kate Richardson (gymnastics). Induction details will be announced at a later date.\n\nThe Hall of Fame class includes two Olympians (Bolden and Richardson), a Golden Spikes and Cy Young Award winner (Bauer), UCLA's only Mackey Award winner (Lewis), a member of the UCLA men's basketball top 10 scoring list (Murray), a four-time All-American and current LPGA pro (Joh), the Most Outstanding Player at the Women's College World Series (Langenfeld) and a 22-time All-American (Price). Bolden, Langenfeld and Richardson also won NCAA Championships as Bruins.\n\nFollowing are biographies on the 2021 UCLA Athletic Hall of Fame members:\n\nTrevor Bauer (Baseball, 2009-11)\n\nThe 2011 Golden Spikes Award winner and Baseball America National Player of the Year, Trevor Bauer has mirrored his collegiate success in the Major Leagues, winning the National League Cy Young Award in 2020 after leading the league with a 1.73 ERA. At UCLA, Bauer was a three-time All-American and the 2009 National Freshman Pitcher of the Year. Over three years, he posted a 34-8 record with a 2.36 ERA and 460 strikeouts in 373 1/3 innings. He remains the lone Bruin to reach the single-season 200-strikeout plateau, whiffing a Pac-12 record 203 batters in 2011. Bauer holds UCLA records for career and single-season strikeouts, along with career victories (34). He helped the Bruins reach the College World Series finals in 2010, earning a spot on the All-CWS Team. Selected by the Arizona Diamondbacks as the No. 3 overall in the 2011MLB Draft, he made his MLB debut in 2012 and was an All-Star for the Cleveland Indians in 2018, finishing the year ranked first in the American League with a 2.44 FIP (fielding independent production).\n\nJeanette Bolden (Track & Field, 1981-83 student-athlete, 1991-93 assistant coach, 1994-2013 women's head coach)\n\nJeanette Bolden saw tremendous success at UCLA as both an athlete and coach. A five-time All-American and still the collegiate indoor record-holder in the 50m (6.13), she helped lead the Bruins to the first NCAA women's outdoor title in 1982. Two years later, she won Olympic gold as a member of the 4x100m relay and placed fourth in the 100m. She joined the UCLA coaching staff in 1991 and became women's head coach in 1993. Under her supervision, the UCLA women won NCAA indoor titles in 2000 and 2001, the NCAA outdoor title in 2004 and a total of 10 Pac-10 titles, including eight-straight from 1997-2004. A 10-time Pac-10 Coach of the Year, Bolden coached over 50 All-Americans and six NCAA champions during her tenure. She also served as head coach of the U.S. women's track and field team for the 2008 Olympics, becoming the first head coach in U.S. Olympic history to have won an Olympic medal as an athlete. She helped lead the U.S. to 23 medals, including three won by a trio of Bruins. Bolden was inducted into the USTFCCCA Hall of Fame in 2010.\n\nTiffany Joh (Women's Golf, 2006-09)\n\nTiffany Joh made history by becoming the first four-time All-American in UCLA women's golf history and was just the third UCLA freshman ever to earn first-team All-America acclaim. She earned Pac-10 Freshman of the Year honors in 2006 while helping lead UCLA to the Pac-10 team title, won conference individual medalist honors in 2007, and was named the 2008 Pac-10 Golfer of the Year. Joh totaled two Top 5 NCAA finishes, placing second in a playoff in 2008 after finishing fifth in 2007. She won a total of three collegiate tournaments and is tied for second all-time at UCLA in Top 10 finishes (24), fourth in rounds in the 60s (22) and fifth in rounds under par (41). As a Bruin, she won U.S. Women's Amateur Publinks titles in 2006 and 2008 and was a member of the 2008 U.S. team that won the Curtis Cup. As a professional, Joh won two tournaments on the Futures Tour and earned a runner-up finish at the 2011 Navistar LPGA Classic. In 2019, she recorded two Top 5 finishes, including a third-place showing at the Thornberry Creek LPGA Classic.\n\nMegan Langenfeld, Softball (2007-10)\n\nMegan Langenfeld's performance at the 2010 Women's College World Series was legendary. Named the Most Outstanding Player at the WCWS, she hit .706 with a then-record four home runs and earned three victories in the circle. Most memorably, she hit two home runs in Game 1 of the Championship Series against Arizona, including a walk-off home run in the bottom of the eighth inning that gave her a WCWS record 10 total bases in the game. The Bruins went on to sweep the Wildcats in the series to capture UCLA's 11th NCAA title. Langenfeld was a three-time All-American, the 2010 Pac-10 Player of the Year and the 2010 Los Angeles Sportswoman of the Year. She finished her UCLA career with a 53-9 record, 1.42 ERA and 348 strikeouts. In the school record books, she still ranks first in career saves (12), second in on-base percentage (.515) and fifth in slugging (.671). Langenfeld is now an assistant coach for the Oregon softball team.\n\nMarcedes Lewis, Football (2002-05)\n\nThe only Bruin to win the Mackey Award as the nation's top collegiate tight end, Marcedes Lewis capped a four-year UCLA career in 2005 with the prestigious award, along with consensus first-team All-America honors. Lewis' 21 career touchdowns still rank second on UCLA's all-time list, and his 58 receptions in 2005 rank as the second-most ever by a Bruin tight end. He finished his UCLA career with 126 receptions. Lewis was selected in the first round of the 2006 NFL Draft by the Jacksonville Jaguars, where he played for 12 seasons. He was selected to the Pro Bowl in 2010 after setting a franchise record with 10 touchdown catches, and he led all NFL tight ends in yards averaged per catch in 2009 and 2010. In 2011, he was named Jacksonville's team captain and received the franchise tag. Lewis, who currently plays for the Green Bay Packers, started the Marcedes Lewis Foundation in 2009 to support youth opportunities in sports.\n\nTracy Murray , Men's Basketball (1990-92)\n\nOne of the greatest shooters in UCLA men's basketball history, Tracy Murray still ranks in the Top 10 on UCLA's career scoring list with 1,792 points (10th). He is also in the Top 10 in career scoring average (fifth, 18.3 ppg), career three-pointers made (sixth, 197), and career 3-point percentage (10th, 41.1%). In three seasons at UCLA, he led the Bruins to three NCAA Tournaments, including the 1990 Sweet 16 and the 1992 Elite Eight. Murray earned Pac-10 All-Freshman honors in 1990. As a sophomore and junior, he was named the team's MVP and secured back-to-back All-Pac-10 accolades. During his final season in Westwood, he averaged 21.4 points and 7.0 rebounds per game and shot a Pac-12-leading 50.5% from the 3-point line, a percentage that still ranks No. 3 in school history. Murray was selected in the first round of the 1992 NBA Draft by the San Antonio Spurs. He concluded his 12-year NBA career with averages of 9.0 points and 2.5 rebounds in 659 total contests and is now a member of UCLA men's basketball's radio broadcast team.\n\nKeiko Price, Women's Swimming & Diving (1997-2001)\n\nA 22-time All-American and NCAA postgraduate scholarship recipient, Keiko Price shattered records and broke barriers during her four years at UCLA. As a freshman in 1997, she earned a team-best 26 first-place finishes and was awarded the team's Most Outstanding Newcomer/Freshman. The following three years, she earned the team's Most Valuable Swimmer award and was a three-time Pac-10 All-Academic selection. In 1999, she won the Pac-10 championship in the 100 Free with a winning mark of 49.54. Price once held five different Bruin records, and her best mark of 48.59 in the 100 free still ranks No. 3 all-time at UCLA. A member of the U.S. National Team, she qualified to three Olympic Trials. She is currently the Director of Athletics at Emory University after spending 14 years in administrative leadership and academic support.\n\nKate Richardson, Gymnastics (2003-06)\n\nCanadian standout Kate Richardson came to UCLA two years after her first Olympic Games and made history after her sophomore season in 2004 by becoming the first current Bruin gymnast to make an Olympic team. She also became the first Canadian woman ever to qualify for event finals on floor exercise, where she placed seventh. As a Bruin gymnast, she won two NCAA team titles in 2003 and 2004 and three NCAA individual titles, capturing the 2003 uneven bars and balance beam titles and the 2006 floor crown. Richardson won a multitude of honors at UCLA, including 13 All-America awards, 14 All-Pac-10 awards, and three Academic All-America honors. She was named the 2003 Pac-10 Freshman of the Year, 2006 Pac-10 Gymnast of the Year and a 2006 NCAA Today's Top VIII Award-winner. She scored nine perfect 10s in her career, including 10.0s on floor to win the 2003 and 2004 Pac-10 Championships. She also won the 2003 Pac-10 all-around title with a score of 39.825, a Pac-10 record that held for 16 years. Richardson was selected to the Pac-12 All-Century Team for floor exercise."}, {"url": "https://uclabruins.com/news/2022/7/6/bruin-athletics-ucla-athletic-hall-of-fame-class-of-2022-selected.aspx", "page_content": "Nine Bruin standouts have been selected for induction into the UCLA Athletic Hall of Fame Class of 2022. The members of the class are:(men's golf),(baseball),(football),(women's volleyball),(track & field),(softball coach),(men's soccer),(men's volleyball) and Extraordinary Service honoree(football/administration). The induction ceremony will take place on campus on Oct. 7, and the class will be introduced at halftime of the Oct. 8 UCLA vs. Utah football game.\n\nThe Hall of Fame class includes two current UCLA coaches in Inouye-Perez and Foster, the reigning PGA Tour Player of the Year Cantlay, Olympic gold medalists Harper-Nelson and Saunders, four-time MLB All-Star Cole, UCLA soccer's all-time leading scorer Mikkelsen, three-time All-American and 1996 Olympian Robertson Hanley and unbeaten football coach Kezirian. The class combined for 12 NCAA championships while at UCLA.\n\nFollowing are biographies for the 2022 UCLA Athletic Hall of Fame members:\n\nPatrick Cantlay, Men's Golf (2010-12)\n\nCantlay had one of the greatest seasons in collegiate golf as a freshman in 2010-11, winning the Jack Nicklaus Award as the Division I Player of the Year by the Golf Coaches Association of America (GCAA), the Fred Haskins Award as the most outstanding male collegiate golfer, and the Golfweek Player of the Year. He also became UCLA's first and only winner of the Phil Mickelson Award as the GCAA Freshman of the Year and the Ben Hogan Award as the collegiate and amateur golfer of the year. Additionally, Cantlay was awarded the Pac-12 Golfer and Freshman of the Year. He won four tournament titles during his historic freshman season, the fourth-most in program history, and he led UCLA to five tournament wins, including victories at the NCAA Regional and during NCAA Stroke Play. Cantlay ranks first all-time in program history with a 70.80 career scoring average (65 rounds/4,602 strokes). Since leaving for the professional ranks, Cantlay has become one of the preeminent golfers on the PGA Tour, ranking as high as third in the official World Golf Rankings and winning 2021 PGA Tour Player of the Year honors after winning four titles during the season. He also helped Team USA win the 2021 Ryder Cup.\n\nGerrit Cole, Baseball (2009-11)\n\nOne of the top active pitchers in Major League Baseball, Cole set the stage for his professional success with a standout three-year career atop the rotation at UCLA. Over 50 career appearances in Westwood, Cole recorded a 3.38 ERA and 376 strikeouts over 322 1/3 innings. At the conclusion of his junior year, he was selected No. 1 overall in the 2011 MLB Draft by Pittsburgh, becoming the first-ever No. 1 pick in program history. A Freshman All-American in 2009 and second-team All-American in 2010, Cole helped the Bruins to back-to-back NCAA Tournament berths in 2010 and 2011, including a trip to the 2010 College World Series. He still ranks second in program history in career strikeouts, while also ranking fifth in games started (49) and seventh in innings pitched. Cole, currently in his 10th MLB season, totaled 117 wins, a 3.20 ERA, and 1,673 strikeouts over the first nine years of his career. He has finished top-five in Cy Young voting five times in his career, including each of the last four seasons. A four-time MLB All-Star, Cole signed with the New York Yankees, earning the largest contract for a pitcher in baseball history.\n\nDeShaun Foster , Football (student-athlete, 1998-2001; assistant coach, 2017-present)\n\nUCLA All-American and NFL standout Foster is one of the most accomplished running backs in school history and returned to Westwood following his professional playing career to serve on the football staff. He completed his Bruin playing career second on the all-time touchdowns scored list (44), third on the school's all-time rushing list (3,194 yards) and fifth on the all-time Bruin scoring list (266 points). Foster was ranked 18th on the Pac-10 career rushing list when he left for the NFL, and his 722 career rushing attempts were the most in school history. As a senior in 2001, he led the Pac-10 in rushing (138.6 yards per game), scoring (9.75 points per game), and all-purpose yardage (154.75 yards per game). In his seven-year NFL career, he recorded more than 4,500 total yards and 16 touchdowns, including a 33-yard run in Super Bowl XXXVIII. During his tenure on the Bruin coaching staff, he has been instrumental in the development of some of the most productive running backs in the Pac-12, Paul Perkins, Joshua Kelley, Demetric Felton Jr. and Zach Charbonnet .\n\nLinda Robertson Hanley, Women's Volleyball (1978-81)\n\nRobertson Hanley, an All-American left-handed outside hitter for UCLA in 1978, 1979 and 1981, racked up 1,768 kills, which rank fifth all-time in program history. Robertson led the Bruins to 132 victories over four seasons, and in her freshman season in 1978, she helped the Bruins win the Western Collegiate Athletic Association conference title and advance to the national final. UCLA finished in the top four nationally every year during her career, and she was named to the 1981 NCAA All-Tournament team. Following her graduation in 1983, Robertson Hanley become one of the most prolific women's beach volleyball players in the history of the game, taking home beach titles in four different decades, one of just two players ever to do so. She finished her career playing in over 200 professional beach volleyball tournaments, winning 46 events. Robertson Hanley represented Team USA at the 1996 Olympics on the beach with Barbra Fontana Harris, just missing a medal in the bronze medal match. In 2004, she was inducted into the CBVA Beach Volleyball Hall of Fame.\n\nDawn Harper-Nelson, Women's Track & Field (2003-06)\n\nOne of the top hurdlers in UCLA history, Harper-Nelson led the women's track & field program to the 2004 NCAA Outdoor Championship and earned a total of four All-America honors outdoors and seven indoors. Harper-Nelson is the only woman in UCLA history to break the eight-second barrier in the 60m hurdles, running 7.98 in March 2006, and she holds UCLA's No. 4 mark in the 100m hurdles with a time of 12.80, set in 2006. In 2004, she contributed to the Bruins' No. 1 and No. 2 4x100m relay times that stood for 18 years. Harper-Nelson has had a long and successful international career, winning the gold medal in the 100m hurdles at the 2008 Olympics with a personal-best time of 12.54. Four years later, she won silver at the 2012 Olympics, running another lifetime best time of 12.37 in the Olympic final. Although she missed qualifying for a third Olympics in 2016 by .01 seconds, Harper-Nelson continued to excel internationally, winning the silver medal in the 100m hurdles at the 2017 World Championships.\n\nKelly Inouye-Perez , Softball (head coach, 2007-present; assistant coach, 1994-2006; student-athlete, 1989-93)\n\nThe only person ever to win a NCAA Softball Championship as both a player and coach, Inouye-Perez completed her 16th season as head coach at UCLA with two NCAA Championships and eight Women's College World Series appearances. Inouye-Perez has been affiliated with eight of UCLA softball's 12 NCAA championships – two as head coach (2010, 2019), three as an assistant coach (1999, 2003, 2004) and three as a player (1989, 1990, 1992). The Bruins are the all-time winningest program at the Women's College World Series with 107 wins in the tournament's 40-year history, and UCLA has journeyed to Oklahoma City in seven-straight postseasons for the longest active streak in softball. Inouye-Perez leads all active Pac-12 softball coaches with 723 overall victories and 238 conference victories, securing three regular season Pac-12 titles in her tenure as head coach. Inouye-Perez coached Rachel Garcia to two Honda Broderick Cups and three USA Softball Player of the Year awards and produced four 2020 Olympians in Garcia, Bubba Nickels, Delaney Spaulding and Ally Carda. Inouye-Perez and her staff have been consistently recognized for their efforts on and off the field, with the staff being awarded NFCA National Coaching Staff of the Year honors in 2010, 2019 and 2021, and Inouye-Perez herself being named the Pac-12 Coach of the Year in 2010 and 2021. As the starting catcher on three NCAA championship teams, she earned All-Pac-10 honors in 1989, 1990 and 1992 and was named to the All-Women's College World Series Team in 1992.\n\nOle Mikkelsen, Men's Soccer (1977-80)\n\nThe most prolific scorer in UCLA men's soccer history, Mikkelsen re-wrote the program record book during a four-year stint in Westwood. His career marks of 82 goals and 194 points are both school records and still rank No. 7 all-time in NCAA history. He is the lone player in program history with three seasons of 19 or more goals. Mikkelsen was a first- team All-American in 1978 after notching 52 points, and he earned all-region honors in each of his final three seasons as a Bruin. As a senior in 1980, he logged career-bests of 27 goals and 60 points (both second in single-season program history) to become just the third UCLA player all-time with multiple 50-point seasons. Following his time at UCLA, he went on to play parts of five professional seasons in the NASL, MISL, and Western Soccer League.\n\nDave Saunders, Men's Volleyball (1979-82)\n\nSaunders, a two-time Olympic gold medalist, played on UCLA men's volleyball teams which compiled an overall record of 124-5 and captured three NCAA championships (1979, 1981 and 1982). The 1979 UCLA men's volleyball squad was the sport's first to complete an undefeated season, going 30-0. The 1982 squad also posted an undefeated record (29-0) on its way to the national championship. Saunders' Bruin teams also produced a perfect 49-0 record in Pauley Pavilion matches. Saunders, who earned a gold medal for the U.S. playing in the 1984 and 1988 Olympic Games, was honored as first-team All-America selection in 1982. He was recognized on the all-conference teams in 1982, 1981 and 1980. Saunders was inducted into the SoCal Indoor Volleyball Hall of Fame in 2019.\n\nEd Kezirian, Extraordinary Service (Football, Administration)\n\nKezirian, also known as Coach K, was a standout football player at UCLA and then returned as an assistant coach on some of the most successful teams in school history. After his coaching career, his contributions to his alma mater continued as an administrator for academics and student development, where he helped mentor hundreds of student-athletes throughout their education. An all-conference offensive lineman in 1973 who was presented UCLA's Kenneth S. Washington Award as the team's outstanding senior offensive player, Kezirian helped pave the way for a Bruin rushing attack that led the nation (400.3 yards per game) and an offense which established school records for scoring average (42.7 ppg) and single-season rushing yards (4,403) in 1973. As a coach, he helped guide Bruin teams to wins in eight-straight bowl game appearances, including three Rose Bowl victories in 1983, 1984 and 1986, and as interim head coach at the 2002 Las Vegas Bowl he led the Bruins to victory. Three of the teams for which he served as an assistant coach equaled the school record for wins in a season with 10."}, {"url": "https://uclabruins.com/news/2013/7/3/208580962.aspx", "page_content": "UCLA Athletics Hall of Fame\n\nThe UCLA Athletics Hall of Fame enters its 33rd year of its existence and its 16th in a new location facing Westwood Plaza. The current Hall of Fame, double the size of its predecessor, opened in July of 2001.\n\nThe first floor in the east wing of the J.D. Morgan Athletics Center features the 8,000-square foot Athletics Hall of Fame and serves as the main entrance to the Department of Intercollegiate Athletics.\n\nThe Hall of Fame features the \"John Wooden - The Den\" exhibit, an exact replica of the late Coach's den; state-of-the-art interactive displays; a mini-theater where Bruin video clips and highlights re-create past championship moments; a timeline of important U.S., California and UCLA dates showing how sports weave into the great moments in history; a collection of Bruin memorabilia and much more.\n\nUCLA athletic teams have won a national-best 112 NCAA team championships, and each of those first-place trophies grace the Hall of Champions. Other exhibits include photos of UCLA's first-team All-Americans in football and basketball, Gary Beban's Heisman Trophy, Wooden Awards won by Marques Johnson and Ed O'Bannon and a special display highlighting all of UCLA's Honda and Broderick Cup winners. Displays on UCLA's football bowl victories, the Bruins' NCAA basketball tradition and UCLA's Olympic Games medal winners are featured in the new Hall of Fame.\n\nEach of UCLA's sports has its own individual display area within the Hall of Fame. In addition, there are displays honoring Jackie Robinson, UCLA's Academic All-Americans and women in sports. There are also sample lockers of former Bruin greats in various sports.\n\nIn connection with the building, which originally opened in November of 1983, UCLA established a Hall of Fame with 25 charter members representing a cross-section of the school's athletic history. Each year, a minimum of one and a maximum of eight former UCLA athletes, coaches or administrators are added to the Hall of Fame. Following is a list of the members:\n\n1984 (25 charter members): Bill Ackerman, athletic director; Lew Alcindor (Kareem Abdul-Jabbar), basketball; Arthur Ashe, tennis; Gary Beban, football; Mike Burton, swimming; Paul Cameron, football; Chris Chambliss, baseball; Elvin 'Ducky' Drake, track coach and trainer; Gail Goodrich, basketball; Walt Hazzard (Mahdi Abdul-Rahman), basketball; Cecil Hollingsworth, football scout and gymnastics and wrestling coach; Rafer Johnson , track; Kirk Kilgour, volleyball; Billy Kilmer, football; Donn Moomaw, football; J.D. Morgan, athletic director and tennis coach; Jackie Robinson, football, baseball, basketball and track; Henry 'Red' Sanders, football coach; Al Sparlis, football; Bill Spaulding, football coach; Bill Walton, basketball; Kenny Washington, football; Bob Waterfield, football; Keith (Jamaal) Wilkes, basketball; and John Wooden, basketball coach.\n\n1985 (6): Bob Davenport, football; Craig Dixon, track; Wilbur Johns, athletic director/basketball coach; Tommy Prothro, football coach; George Stanich, basketball; and Sidney Wicks, basketball.\n\n1986 (8): Kermit Alexander, football; Burr Baldwin, football; Keith Erickson, basketball; Mike Frankovich, football; Jimmy LuValle, track; Willie Naulls, basketball; Jerry Norman, basketball player and assistant coach; and Don Paul, football.\n\n1987 (8): Don Barksdale, basketball; George Dickerson, football; Jack Ellena, football; Bert LaBrucherie, football; Dick Linthicum, basketball; Jim Salsbury, football; John Smith, track; Jack Tidball, tennis.\n\n1988 (6): Sam Balter, basketball; Mel Farr Sr., football; Robert Fischer, athletic director; Marques Johnson, basketball; Ann Meyers , basketball; and C.K. Yang, track.\n\n1989 (7): Pete Dailey, football; Tom Fears, football; Vic Kelley, sports information director, Carl McBain, track; Karen Moe-Thornton, swimming; Ernie Suwara, volleyball; and Pat Turner, track.\n\n1990 (7): Evelyn Ashford, track; Dr. Bobby Brown, baseball; Stan Cole, water polo; Denny Crum, basketball; Norm Duncan, football/administration; Mike Marienthal, football/special service; Mike Warren, basketball.\n\n1991 (7): Willie Banks, track; Kenny Easley, football; Brian Goodell, swimming; Briggs Hunt, wrestling; Tim Leary, baseball; Jerry Robinson, football; Sinjin Smith , volleyball.\n\n1992 (9): Wayne Collett, track; Terry Condon, volleyball; Jim Johnson, football; Robin Leamy, swimming; Freeman McNeil, football; Dave Meyers, basketball; Jack Myers, baseball; Corey Pavin, golf; Woody Strode, football.\n\n1993 (8): Sue Enquist, softball; Greg Foster, track; Maurice (Mac) Goodstein, football; Karch Kiraly, volleyball; Jose Lopez, soccer; Don Manning, football; Bill Putnam, basketball; Curtis Rowe, basketball.\n\n1994 (7): Donald Bragg, basketball; Denise Curry, basketball; John Richardson, football; Larry Rundle, volleyball; John Sciarra, football; Kiki Vandeweghe, basketball; Peter Vidmar, men's gymnastics.\n\n1995 (8): Jimmy Connors, tennis; Debbie Doom, softball; Mitch Gaylord, men's gymnastics; Ricci Luyties, volleyball; Stephen Pate, golf; John Peterson, football/track; Jerry Shipkey, football; Mike Tully, track.\n\n1996 (7): Bill Barrett, swimming; Jackie Joyner-Kersee, track; Liz Masakayan, volleyball; Eddie Merrins, golf coach; Dot Richardson, softball; Skip Rowland, football; Dick Wallen, football.\n\n1997 (8): Jim Bush, track coach; Paul Caligiuri, soccer; Tim Daggett, men's gymnastics; David Greenwood, basketball; Frank Lubin, basketball; Doug Partie, volleyball; Cal Rossi, football/baseball; Charles Young, chancellor.\n\n1998 (12): Glenn Bassett, tennis coach; Sheila Cornell, softball; Randy Cross, football; Gaston Green, football; Florence Griffith-Joyner, track; Tom Jager, swimming; Eric Karros, baseball; Reggie Miller, basketball; Ken Norton Jr., football; Tom Ramsey, football; Art Reichle, baseball coach; Cy Young, track.\n\n1999 (12): Troy Aikman, football; Sam Boghosian, football; Kay Cockerill, golf; Tracy Compton, softball; Denise Corlett, volleyball/basketball; Dave Dalby, football; Gail Devers, track; Bob Horn, water polo; Ernie Johnson, football; Torey Lovullo, baseball; Sharon Shapiro, women's gymnastics; Kevin Young, track.\n\n2000 (10): Lucius Allen, basketball; Jeanne Beauprey-Reeves, volleyball; John Brenner, track and field; George Farmer, football; Kim Hamilton, women's gymnastics; Carnell Lake, football; Billie Moore, basketball; Steve Salmons, volleyball; Eddie Sheldrake, basketball; Dick Vermeil, football.\n\n2001 (11): Jill Andrews, women's gymnastics; Sharron Backus, softball; Jim Brown, football; Charles Cheshire, football; Gary Cunningham, basketball; Terry Donahue, football; Warren Edmonson, track and field; John Green, basketball; John Lee, football; Lisa Longaker, softball; and Ozzie Volstad, volleyball.\n\n2002 (9): Denny Cline, volleyball; Bob Day, track and field; Cobi Jones, soccer; Don MacLean, basketball; Shane Mack, baseball; Ted Narleski, football; Anita Ortega, basketball; Duffy Waldorf, golf; Russell Webb, water polo/swimming.\n\n2003 (8): Danny Everett, track and field; Lisa Fernandez , softball; Brad Friedel, soccer; Ryan McGuire, baseball; Jerome \"Pooh\" Richardson, basketball; Don Rogers, football; Al Scates , volleyball; Tim Wrightman, football.\n\n2004 (8): Henry Bibby, basketball; Dennis Dummit, football; Carlton Gray, football; Steve Lewis, track & field; James Owens, football/track & field; Sigi Schmid, soccer; Fred Slaughter, basketball; Natalie Williams, basketball/volleyball.\n\n2005 (8): Hardiman Cureton, football; Dawn Dumble, track & field; Allen Fox, tennis; John Godina, track & field; Ed O'Bannon, basketball; Mike O'Hara, volleyball; Art Shurlock, men's gymnastics; Kenneth Washington, basketball.\n\n2006 (8): Carol Bower, rowing; Herb Flam, tennis; Monte Nitzkowski, swimming/water polo; Jonathan Ogden, football/track and field; Annette Salmeen, swimming; Dennis Storer, soccer/rugby; John Vallely, basketball; Elaine Youngs, volleyball.\n\n2007 (8): Amy Acuff, Track & Field; George Brown, Track & Field; Jennifer Brundage, Softball; Jim Ferguson, Water Polo; Troy Glaus, Baseball; John Moore, Basketball; Jeff Nygaard, Volleyball; Keri Phebus, Tennis\n\n2008 (8): Traci Arkenberg, Soccer; Peter T. Dalis, Athletic Director/Administration; Kurt Krumpholz, Water Polo/Swimming; Leah Homma, Women's Gymnastics; Robert Seaman, Track & Field; Jackie Tobian-Steinmann, Women's Golf Coach; Eric Turner, Football; Todd Zeile, Baseball\n\n2009 (8): Tyus Edney , basketball; James \"Cap\" Haralson, track & field, football, basketball, baseball; Cade McNown, football; Stein Metzger , volleyball; Nicolle Payne, water polo; J.J. Stokes, football; Daiva Tomkus, volleyball; Walt Torrence, basketball\n\n2010 (8): David Ashleigh, water polo, swimming; Andy Banachowski, volleyball; Valorie Kondos Field , women's gymnastics; Dr. Judith Holland, women's athletic director, administration; Mebrahtom Keflezighi, track & field, cross country; Seilala Sua, track & field; Chase Utley, baseball; Catharine von Schwarz, water polo\n\n2011 (8): Gary Adams, baseball; Ato Boldon, track & field; Theotis Brown, football; Ernie Case, football; Larry Nagler, tennis; Mel North, fencing; Alex Rousseau, water polo; Janeene Vickers-McKinney, track & field\n\n2012 (9): Ron Ballatore, swimming; Dr. Julie Bremner Romias, volleyball; Jack Hirsch, basketball; Fred McNeill, football; Stacey Nuveman, softball; Charles Pasarell, tennis; Coralie Simmons, water polo; Stella Umeh, women's gymnastics; Dr. Gerald Finerman , sports medicine\n\n2013 (8): Mohini Bhardwaj, women's gymnastics; Carlos Bocanegra, men's soccer; Fred Bohna, wrestling; Eric Byrnes, baseball; Yvonne Gutierrez, softball; Don Johnson, men's basketball; Maylana Martin Douglas, women's basketball; Nandi Pryce, women's soccer\n\n2014 (7): Guy Baker, water polo; James Butts, men's track & field; Joanna Hayes , women's track & field; Joe-Max Moore, men's soccer; Francis Wai, football, basketball, track & field, rugby; Natasha Watley, softball; Onnie Willis, women's gymnastics."}, {"url": "https://prod.pac-12.com/article/2023/06/08/ucla-athletic-hall-fame-class-2023-announced", "page_content": "Eight new members will be officially inducted into the UCLA Athletic Hall of Fame Class of 2023 on Friday, Oct. 6 in on-campus festivities. The members of the incoming class are: B'Ann Burns Jacobs (softball), Kevin Craig (men's water polo), Carrie Forsyth (women's golf), Heidi Moneymaker (gymnastics), Kelly Rulon (women's water polo), Randy Schwartz (baseball), Lynn Shackelford (men's basketball), and Erik Sullivan (men's volleyball).\n\nThese new Hall of Fame members combined to win 20 NCAA Championships and 25 All-America honors. Included in the group are a pair of two-time Olympians.\n\nFollowing are biographies on the 2023 UCLA Athletic Hall of Fame members, who will be recognized at halftime of the Oct. 7 UCLA vs. Washington State football game:\n\n\n\nB'Ann Burns Jacobs (Softball, 1994-97)\n\nA feared pitcher for the UCLA softball team in the mid-90's, B'Ann Burns Jacobs appeared in the Women's College World Series every season she played. She earned NFCA first-team All-America honors in 1996 and second-team acclaim in 1997 and was a three-time All-Pac-10 selection. Burns tossed four career solo no-hitters and six combined no-hitters and led the team in wins every season, including a 31-win junior campaign that ranks eighth in school history. She finished her Bruin career with a 1.49 earned run average and 591 strikeouts and set a then-school record with 96 career wins, surpassing Lisa Fernandez' benchmark of 94. She remains ranked third all-time at UCLA with 98 complete games, fourth with 767.1 innings pitched and sixth with 96 wins and 131 appearances.\n\n\n\nKevin Craig (M. Water Polo, 1969-72)\n\nWater polo player Kevin Craig made history as the first-ever four-time All-American in any sport, earning honors from 1969-72. He helped lead UCLA to NCAA Championships in 1969, 1971 and 1972, earning all-tournament honors in 1972, and came within an overtime goal of winning four titles. The Bruins' goalkeeper compiled a record of 73-4 all-time, including 10-2 against USC. Craig continued to stay involved in the sport long after his UCLA years, playing on the FINA Masters World Championships second-place team in 2006 and coaching the boys' varsity team at La Costa Canyon High School in 2009.\n\n\n\nCarrie Forsyth (Women's Golf head coach, 1999-2023; student-athlete, 1990-93)\n\nCarrie Forsyth completed her 24th and final season as the UCLA women's golf head coach. During her tenure, she led the Bruins to two NCAA titles (2004 and 2011), eight Top 3 NCAA finishes, three runner-up finishes and 20 NCAA Championship appearances. Her Bruins won nine NCAA Regional Championships, five Pac-12 titles, and 74 tournament victories. A two-time National Coach of the Year, Forsyth won four Regional Coach of the Year awards and six Pac-12 Coach of the Year honors. Forsyth coached two ANNIKA Award winners, two PING WGCA Players of the Year, 14 first-team All-Americans and three golfers who went on to win an LPGA Major event. Forsyth was a walk-on at UCLA and competed at the Pac-10 and NCAA Championships her freshman season before earning a scholarship by her sophomore year.\n\n\n\nHeidi Moneymaker (Women's Gymnastics, 1997-2000)\n\nEleven-time All-American Heidi Moneymaker was a key member of UCLA Gymnastics' first two NCAA Championship teams in 1997 and 2000 and won two individual titles of her own, becoming the Bruins' first-ever NCAA uneven bars champion in 1998 and winning vault in 1999. She made history in 1999 when she became the first-ever Bruin to earn the maximum five first-team All-America honors in a single year. Following that season, she competed for the U.S. at the World University Games, earning Top 8 finishes on bars and beam, and at the USA Championships. As a senior in 2000, she was named the Pac-10 Gymnast of the Year and scored a pair of perfect 10s on vault. Moneymaker, who was named to the Pac-12 Team of the Century for vault, parlayed her gymnastics into a long-standing career as one of the leading stuntwomen in Hollywood.\n\n\n\nKelly Rulon (Women's Water Polo, 2003-07)\n\nOne of the most accomplished players in UCLA Water Polo history, Kelly Rulon won four NCAA Championships, two NCAA Tournament MVP awards, two National Player of the Year Awards and the 2007 Cutino Award. She scored 70 goals in 2005, 2006 and 2007, ranking third on UCLA's single-season scoring list, and held the school record for career goals for 15 years with 237. She still ranks first on UCLA's single-season steals list with 72 in 2006 and second in career steals with 181. Rulon competed for the U.S. at the 2004 and 2012 Olympics, winning gold in 2012 and bronze in 2004, and was inducted into the USA Water Polo Hall of Fame in 2020.\n\n\n\nRandy Schwartz (Baseball, 1963-64)\n\nUCLA Baseball's first-ever All-American, Randy Schwartz earned second-team All-America honors in 1963 and first-team acclaim in 1964. His .369 career batting average still ranks third in UCLA history, and he remains ranked in UCLA's Top 10 for single-season batting average (ninth, .386 in 1964) and single-season walks (10th, 50). In 1963, he led the team in batting average (.354), hits (51), doubles (14), home runs (five), RBI (26), runs scored (24) and total bases (84). In 1964, he led in batting average (.386), hits (59), triples (three), home runs (13), RBI (59) and total bases (111). Schwartz also played football for the Bruin team in 1962 and went on to play two Major League Baseball seasons for the Kansas City Athletics.\n\n\n\nLynn Shackelford (Men's Basketball, 1966-69)\n\nLynn Shackelford finished his Bruin career as a starter on three NCAA Championship teams, helping to lead the Bruins to titles in 1967, 1968 and 1969 and being named to the 1968 Final Four All-Tournament Team. He is one of just six players in NCAA history to achieve that feat. During his time on the varsity squad, he averaged 9.7 points and 5.0 rebounds per game as UCLA compiled a three-year record of 88-2. Shackelford was also a starter on the famed 1966 UCLA freshman team with fellow UCLA Hall of Famers Lew Alcindor and Lucius Allen that beat the Bruin varsity squad, averaging 20.9 points and 9.3 rebounds per game. He was selected by San Diego in the seventh round of the 1969 NBA Draft and played one season in the ABA with the Miami Floridians before embarking on a successful broadcasting career.\n\n\n\nErik Sullivan, Men's Volleyball (1992-95)\n\nTwo-time All-American Erik Sullivan was a starter on two UCLA Men's Volleyball national championship teams in 1993, 1995 and captained the Bruins to a 31-1 record as a senior in 1995. He earned freshman All-America honors in 1992 and was selected to the NCAA Championship All-Tournament Team in 1994. Sullivan spent eight years with the U.S. Indoor National Team and was a member of the U.S. Olympic team in 2000 and 2004, serving as co-captain in 2000. He also played beach volleyball professionally and was named the 4-Man Beach Rookie of the Year in 1996 and the Left Side Player of the Year in 1997. Following his playing career, he coached 36 All-Americans at Colorado, Nebraska and Texas and won two NCAA women's volleyball championships as an assistant coach at Texas. He has also coached the U.S. Junior National Team and was the team leader for the 2016 men's team that won bronze in Rio.\n\n"}, {"url": "https://www.johnvallelymotivates.com/", "page_content": "“John was a perfect fit into the goals of our meeting as well as teaching us all to be better team members on our quest to being \"One Ply Gem\". His thoughts and ideas were professional, educational and inspirational. The thing i liked the most was that he stayed the entire meeting and joined us for every meeting.....as well as social events, getting to know as many of our leaders as possible. I know our team appreciated his thoughts, and i have heard many comments about how everyone was impressed that he hung around for the entire meeting.” Gary Robinette President & CEO\n\nPly Gem Industries, Inc. “It is with great pleasure and respect that I write a testimonial for Mr. John Vallely. As a fellow Bruin I had the great opportunity to watch John play, and the honor of sneaking in a listen to Coach Wooden whenever I could. As Coach inspired me, and unbeknownst to him gave me a path to follow for my life, I never thought that in my post UCLA days I would ever hear a more eloquent, wise, and thoughtful intellect. I was wrong. John Vallely is a living breathing testimonial on actually living the ‘Pyramid of Success’. During times of incredible adversity and heartbreak, he and his family have emerged through it all with unbelievable courage and faith, and he gives all who he comes in contact with, that same magnificent gift of hope through purpose. Although his modesty would probably not permit him from believing this, John Vallely to me stands at the apex of The Pyramid of Success, because he truly encompasses the ideal of being the best that he is capable of becoming. Thank you for being a true inspiration. P.S. Thanks to your son Eric who epitomizes your personal success, and is a realization of God’s greatest gift to all of us who are blessed to be fathers.” Gary Barragan Director of Administration/HR \"I've had the pleasure of meeting many great UCLA student-athletes. I have found them to also be great people, many of whom display with abundance such qualities as competitive fire, sportsmanship, heart, inspiration, leadership, and social conscience. Some of them combine all such attributes and employ them in unique and substantive ways. Indeed, the ones that do are the truly special individuals who not only make you proud to watch them, but to know them. These are the superstars who use their athletic achievements as not only building blocks, but as stepping stones to life's grander assignments. John Vallely is one such person, a man who knows how to win in life...the right way. You'll not only enjoy, but be entertained and empowered by his words and message. I am every time\". Dan Guerrero Director of Athletics\n\nUCLA\n\n“The purpose of this letter is to recommend John Vallely as an excellent public speaker. As a former teammate, I have heard him on a number of occasions, including most recently at his induction into the UCLA Hall of Fame Induction ceremony in October of 2006. He has a good message and story to tell of his own life experiences that tie into his many accomplishments in life. He has experienced many highs athletically and in his personal life, many lows. During his speech at the Hall of Fame Induction one could hear a pin drop to the floor as he covered some of the difficult parts of his life’s journey.\n\n\n\nWhen one has reached the pinnacle of accomplishments athletically in basketball and beach volleyball and seen the lows in life, it is a truly compelling story. He conveys this concisely and articulately in a straightforward manner without needless whining or complaining. It is indeed inspiring to hear\". Lynn Shackelford “I was uplifted by the humble message and giant heart of an athlete who has walked the walk of cancer that stole the life of his precious young daughter, Erin; yet later spared his own.\n\n\n\nI am grateful and forever changed as I journeyed in spirit with the dynamic John Vallely. The depth of his experience and good humor enlightens the struggles, doubt, loss, restored hope, triumphs, and convictions that he and we all may face as we each seek to make sense of life.\n\n\n\nJohn made me cry, he made me laugh, and he touched my soul. Give yourself the warming gift of his message--it's awesome--it will renew you!” Deedreea Rich, DDS Newport Beach, California “John's speech at his induction into the UCLA Hall of Fame was one of the most inspirational I have ever heard. It's obvious that John's passion for life and his belief in the \"Pyramid of Success\" has served him well from the glory days at UCLA to the unimaginable pain of losing a child to cancer. He tells his life story with heartfelt candor and wit, including examples of how the many facets of the \"Pyramid\" shape his daily life. I feel honored to have John as a friend, and thank him for one of the most entertaining evenings I have ever experienced.” Dee DeVaney Retired Airline Pilot\n\n“John's story moves his listeners to both tears and laughter, and his ability to weave his life's message around John Wooden's Pyramid of Success is masterful. From the pinnacles of athletic success, to the depths of despair over the death of his beautiful 12 year old daughter, to his own two life-and-death struggles with lymphoma, his faith has been shaken, renewed, and then solidified. John's commitment to useing the Pyramid of Success to face and overcome life's adversites is truly inspirational.” Bob Kendall, Self-employed Mathematics Tutor Karen Kendall, School Administrator “Never have I been so proud. You were on fire last night.That was the greatest moment in the history not only of UCLA Basketball but in the history of Western civilization. You have changed my life. You are an unbelievable humanitarian. I want to thank you for everything, John. You are up there with Nelson Mandela, Desmond Tutu, Martin Luther King, Mahatma Gandhi, and John Vallely. The list is endless. Oh my gosh! What a performance! Forget the jump shot, forget the rebounds, forget the defense, forget the leadership, what you did last night was the greatest thing that any man has ever done in this world as we know it. Intergalactic transmission is the next order of the day. Please, Lets get it going. I have never been so proud. I have been 6ft 11 since I was 19 yrs old; today I have broken the 7 ft. barrier. I have reached nirvana because of you. We are so happy for you. We could not have been more honored to have been in that room last night when the future of all worlds known and unknown were changed irreversibly for the better thanks to one John Vallely. Oh, what a speech!” Bill Walton Class of 1974 “When you were speaking at the UCLA Induction Dinner,I was taking notes.” Rafer Johnson Olympic Gold Medalist\n\n“John Vallely captivated our audience and his genuine warmth and caring came through in all his words. John wove the concept of team building and relationships into everything he said and presented a talk that was interesting and motivational at the same time. Best of all, he did his homework about the group he was speaking to and included specific references about them in his talk. This personalized presentation was impressive. We have already asked him to return for two more events.” Volunteer Endowment for Patient Support MD Anderson “As the speaker chairman for the Breakfast Club of Newport Beach, I can confidently say that John's presentation deeply touched everyone in our group on many levels. In telling his life's story, his ability to blend his humility, strength and humor was powerful. What our group especially appreciated was the way John wove the principles of the great John Wooden into his own life in a such an honest manner that any one could relate, even a die-hard Trojan like myself. He is truly a terrific communicator of John Wooden's principles and of his own hard won wisdom.” Bob Bernatz, Ph.D. President – InsightGlobal “I am grateful that John Vallely participated as one of the Distinguished Speaker’s for the Volcom University. His willingness to speak to our employees and share how we may achieve competitive greatness through “The Pyramid of Success” was both humbling and a learning experience. I appreciated his intimate stories and personal life experiences, proving how successful this tool has been in his life. I truly believe that everyone who attended felt inspired and learned some tips on how they could individually reach competitive greatness at work and in their personal lives. What a terrific and moving message and I would recommend anyone who wants to be motivated to listen to John speak.” Tara Bennett Sr. Director of the People’s Department\n\nVolcom, Inc."}, {"url": "https://amickamookandamic.com/2022/04/john-vallely-2x-ucla-basketball-champion-joins-mick-mook-on-4-13/", "page_content": "Frank & Billy are looking forward to a visit from the legendary UCLA basketball star and a first round pick in the NBA draft, John Vallely, on the April 13th episode of A Mick A Mook and A Mic.\n\nVallely, a former NBA player and 2x NCAA Basketball Champion, was a star and All-American for the John Wooden led UCLA Bruins. He won his two NCAA championships in 1969 and 1970, and was a teammate of Kareem Abdul Jabbar (then known as Lew Alcindor) in ’69.\n\nThe 14th player drafted in the First Round of the 1970 NBA Draft by the Atlanta Hawks, the 6’2” guard also played for the Houston Rockets.\n\nAs impressive as Vallely was in hoops, the Newport Beach, CA born athlete was equally dominant in volleyball. Introduced to beach volleyball while in high school, John was a member of one of beach volleyball’s greatest two-man duos ever. In 1969, Vallely and his partner, the legendary Von Hagen, put together a perfect season, winning all of the five open tournaments they entered.\n\nVallely was recognized for his beach volleyball accomplishments by being inducted into the California Beach Volleyball Association (CBVA) Hall of Fame.\n\nFollowing his basketball career, Vallely built a successful real estate portfolio and a sports apparel business. Since the passing of his daughter, Erin, from cancer at the age of 12, he has been actively involved in pediatric cancer research, serving on the Board of Director of the Pediatric Cancer Research Foundation with Rod Carew.\n\nVallely faced his own battle with cancer, being diagnosed with non-Hodgkin’s lymphoma in 2002, and was later blessed with a successful stem cell/bone marrow transplant in 2006. He called on the lessons he learned from Coach Wooden to come out triumphant in that battle as well.\n\nJohn currently works in Orange County, CA where he lives with his wife Karen of 50+ years, and close to his son Eric and granddaughter Erin.\n\nA basketball legend and a California Beach Volleyball Hall of Famer, the affable John Vallely will be a special ‘MMM’ guest on April 13th.\n\n###"}]}