{"John Vallely was a member of the Lakers' 1972–73 championship team.": [{"url": "https://www.lakersuniverse.com/championships/1972_roster.htm", "page_content": "403 Error - Forbidden\n\nFor some reason this resource can't be accessed.\n\n(If your browser version is too old it might have been blocked for security reasons. Try updating its version)."}, {"url": "https://lakersnation.com/1972-73-los-angeles-lakers-roster-stats-schedule-and-results/", "page_content": "<< 1971-72 Los Angeles Lakers | 1973-74 Los Angeles Lakers >>\n\nThe 1972-73 Los Angeles Lakers were the defending champions for the first time since 1954 and the first time since moving to L.A. That certainly helped fuel them in the regular season, as they went 60-22, tied with the Milwaukee Bucks for the second-best record in basketball.\n\nThe best record belonged to the 68-14 Boston Celtics, who were re-invigorated by a core of Dave Cowens, John Havlicek, and Jo Jo White.\n\nThanks to a first round upset by the Golden State Warriors, the Lakers did not have to see the Bucks during the playoffs, instead breezing through to the NBA Finals. Out East, the Celtics fought it out in a tough seven-game series, but ultimately lost to the New York Knicks.\n\nThis meant it would be Knicks and Lakers for the second straight year. And while it could have been a well-fought series, the Knicks ensured they would not lose again, needing just five games to get past L.A. and win their second title in franchise history.\n\nRoster\n\nNBA regular season statistics\n\nNBA regular season schedule and results\n\nNBA playoffs statistics\n\nNBA playoffs schedule and results"}, {"url": "https://vallely.com/johnvallely.htm", "page_content": "John Vallely:\n\n\n\nBackground\n\nBy Tom Vallely\n\n\n\nJohn Vallely was an All American basketball player at UCLA and was a first round draft choice of the Atlanta Hawks of the NBA in 1971. The UCLA teams were both NCAA Champs and pretty legendary. They were coached by John Wooden.\n\n1969 UCLA Bruins NCAA Champions TOP (l to r): Lynn Shackelford, Curtis Rowe, Steve Patterson, Lew Alcindor, Sidney Wicks, John Ecker, Bill Seibert. MIDDLE: George Farmer, Bill Sweek, Ken Heitz, John Vallely, Terry Schofield. BOTTOM: Ducky Drake, Denny Crum, John Wooden, Gary Cunningham, Bob Marcucci (manager).\n\n1970 UCLA Bruins NCAA Champions TOP (l to r): Kenny Booker, Rick Betchley, John Ecker, Sidney Wicks, Steve Patterson, Jon Chapman, Curtis Rowe, Bill Seibert, John Vallely. MIDDLE: George Morgan (manager), Gary Cunningham, John Wooden, Denny Crum, Ducky Drake. BOTTOM: Henry Bibby, Terry Schofield, Andy Hill.\n\nJohn Vallely Today\n\n\n\n\n\nJohn Vallely, age 53, was raised in Orange County and now lives in Newport Beach. During his college days, John was a member of the UCLA Bruins basketball team and participated in two National Championship seasons, 1969 and 1970, under legendary coach John Wooden. John and wife Karen met during college and were married in 1970, the year John graduated with a degree in sociology. The couple had two children: a son, Eric, and a daughter, Erin. When Erin was 9 years old she was diagnosed with cancer, and eventually lost her battle, at the age of 12, in 1991. Since then, John and Karen have been committed to fighting pediatric cancer.\n\n\n\n\n\nToday, John is completing treatment for his own illness, lymphoma, and is very optimistic about his recovery. John says he uses Wooden’s Pyramid of Success strategy to deal with his cancer. Wooden’s philosophy, according to Vallely, focuses on success rather than winning. “I have no conflict in my heart about knowing that I am the best I can be and so I have peace of mind,” John says. “Success is the absence of conflict. Actually it’s harder to do than winning. It’s possible to win a game without doing your best. But knowing have been the best husband, the best father, the best patient I can, is all I can do.”\n\nSurviving With Strength\n\nA Former UCLA Basketball Star Writes About Dealing with the Loss of a Daughter from Cancer, and Then, Fighting His Own Battle with Lymphoma\n\nBy John Vallely\n\n\n\nA random attack of cancer strikes fear in anyone. Why me? Am I going to die? What did I do wrong? Why did this have to strike my daughter at such a young age? It’s not possible to answer these questions. What matters most, is our response to these life challenges.\n\n\n\nMy experience with cancer began in 1988. My 9- year-old daughter Erin was diagnosed with rhabdomyosarcoma. Surgeons removed a cantaloupe- sized tumor from her abdomen, but were unable to get the entire growth. Until her death in 1991, she endured multiple s u r g e r i e s , chemotherapy and radiation that severely burned her already ill body. I learned so much from her. I miss her.\n\n\n\nIn April 2002, at 53 years old, I was diagnosed with lymphoma. I cannot tell you how astonished I was to learn of my condition. How could this be? Haven't we had enough? My wife and I had already experienced our child dying in our arms. What could be next for us? What about our son Eric? Again I was filled with fear, but once we all began to fight back it gradually subsided.\n\n\n\nThe first step of each patient’s process is correct diagnosis. I believe you must have at least two opinions regarding pathology. If a patient is incorrectly diagnosed, the treatment will not attack their disease. I have spoken with patients who were disappointed with treatment outcome. They later learned that the course of medications would have been different had they researched their circumstances more thoroughly. Consensus on diagnosis is good. Differing opinions lead to better decisions, so patient and family must be proactive and explore options. The relationship with the medical system should be considered a partnership.\n\n\n\nThe next step is launching a plan of attack. After all, this is War! Most things, including my cancer, are not simply about winning and losing. My disease is about the process. I believe it is important to have a positive attitude. Mine is: \"I will be the best I can be. I will do all that I can do to get well and to help my loved ones. I will follow all of the doctor’s directions. I will do everything in my power to give myself and loved ones every chance to survive this disease. And then I will pray!\"\n\n\n\nI believe \"hope\" is important. One can benefit from faith in something. The mental, physical and spiritual obstacles related to cancer are severe. A positive outlook may not have the power to heal -— but, then again, it might. I believe, at the very least, it can make the process more manageable. Hope and faith are very personal. I was broken-hearted and disappointed when God did not heal my daughter. Yet, I believe she is in heaven. When I was diagnosed, I was angry with God. My lonely walks on the beach brought on another series of questions: What kind of God are you? Do you care? What do you want with my family? Even so, I never gave up my trust that God is watching over Erin.\n\n\n\nMy journey forward has been steady but difficult. It requires a willingness to participate on so many levels and I’m always seeking answers. I believe that the process will lead to living my life at the highest level, regardless of the outcome. Prayer and reflection are part of my daily vigilance. I am grateful that doctors, nurses, chemotherapy, and other drugs are available. I consider these to be gifts from God. I also believe this is part of a grand plan that will give me, the cancer patient, an opportunity to fight and a chance to get well.\n\n\n\nWhen our daughter Erin died my wife, Karen, and I made our decision to fight back. We joined with others in an organization called the Pediatric Cancer Research Foundation (PCRF) to raise funds for research aimed at curing pediatric cancer. I’m a past president of PCRF, and currently a member of the PCRF board of directors. Karen spends countless hours on the PCRF Holiday Card Program — their major fund raising activity for the last 20 years. Our family shares the goals of PCRF.\n\n\n\nRaising funds to support research will help fight this terrible disease. Over the last 20 years the survival rate for children with cancer has more than doubled because of research. Regardless of the outcome of my disease, I know that we are making a difference in this big battle, that we are committed until cancer is defeated.\n\n\n\n\n\n\n\nRelated Links John Vallely Motivates\n\nLatest News Article\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "http://www.vallely.com/johnvallely.htm", "page_content": "John Vallely:\n\n\n\nBackground\n\nBy Tom Vallely\n\n\n\nJohn Vallely was an All American basketball player at UCLA and was a first round draft choice of the Atlanta Hawks of the NBA in 1971. The UCLA teams were both NCAA Champs and pretty legendary. They were coached by John Wooden.\n\n1969 UCLA Bruins NCAA Champions TOP (l to r): Lynn Shackelford, Curtis Rowe, Steve Patterson, Lew Alcindor, Sidney Wicks, John Ecker, Bill Seibert. MIDDLE: George Farmer, Bill Sweek, Ken Heitz, John Vallely, Terry Schofield. BOTTOM: Ducky Drake, Denny Crum, John Wooden, Gary Cunningham, Bob Marcucci (manager).\n\n1970 UCLA Bruins NCAA Champions TOP (l to r): Kenny Booker, Rick Betchley, John Ecker, Sidney Wicks, Steve Patterson, Jon Chapman, Curtis Rowe, Bill Seibert, John Vallely. MIDDLE: George Morgan (manager), Gary Cunningham, John Wooden, Denny Crum, Ducky Drake. BOTTOM: Henry Bibby, Terry Schofield, Andy Hill.\n\nJohn Vallely Today\n\n\n\n\n\nJohn Vallely, age 53, was raised in Orange County and now lives in Newport Beach. During his college days, John was a member of the UCLA Bruins basketball team and participated in two National Championship seasons, 1969 and 1970, under legendary coach John Wooden. John and wife Karen met during college and were married in 1970, the year John graduated with a degree in sociology. The couple had two children: a son, Eric, and a daughter, Erin. When Erin was 9 years old she was diagnosed with cancer, and eventually lost her battle, at the age of 12, in 1991. Since then, John and Karen have been committed to fighting pediatric cancer.\n\n\n\n\n\nToday, John is completing treatment for his own illness, lymphoma, and is very optimistic about his recovery. John says he uses Wooden’s Pyramid of Success strategy to deal with his cancer. Wooden’s philosophy, according to Vallely, focuses on success rather than winning. “I have no conflict in my heart about knowing that I am the best I can be and so I have peace of mind,” John says. “Success is the absence of conflict. Actually it’s harder to do than winning. It’s possible to win a game without doing your best. But knowing have been the best husband, the best father, the best patient I can, is all I can do.”\n\nSurviving With Strength\n\nA Former UCLA Basketball Star Writes About Dealing with the Loss of a Daughter from Cancer, and Then, Fighting His Own Battle with Lymphoma\n\nBy John Vallely\n\n\n\nA random attack of cancer strikes fear in anyone. Why me? Am I going to die? What did I do wrong? Why did this have to strike my daughter at such a young age? It’s not possible to answer these questions. What matters most, is our response to these life challenges.\n\n\n\nMy experience with cancer began in 1988. My 9- year-old daughter Erin was diagnosed with rhabdomyosarcoma. Surgeons removed a cantaloupe- sized tumor from her abdomen, but were unable to get the entire growth. Until her death in 1991, she endured multiple s u r g e r i e s , chemotherapy and radiation that severely burned her already ill body. I learned so much from her. I miss her.\n\n\n\nIn April 2002, at 53 years old, I was diagnosed with lymphoma. I cannot tell you how astonished I was to learn of my condition. How could this be? Haven't we had enough? My wife and I had already experienced our child dying in our arms. What could be next for us? What about our son Eric? Again I was filled with fear, but once we all began to fight back it gradually subsided.\n\n\n\nThe first step of each patient’s process is correct diagnosis. I believe you must have at least two opinions regarding pathology. If a patient is incorrectly diagnosed, the treatment will not attack their disease. I have spoken with patients who were disappointed with treatment outcome. They later learned that the course of medications would have been different had they researched their circumstances more thoroughly. Consensus on diagnosis is good. Differing opinions lead to better decisions, so patient and family must be proactive and explore options. The relationship with the medical system should be considered a partnership.\n\n\n\nThe next step is launching a plan of attack. After all, this is War! Most things, including my cancer, are not simply about winning and losing. My disease is about the process. I believe it is important to have a positive attitude. Mine is: \"I will be the best I can be. I will do all that I can do to get well and to help my loved ones. I will follow all of the doctor’s directions. I will do everything in my power to give myself and loved ones every chance to survive this disease. And then I will pray!\"\n\n\n\nI believe \"hope\" is important. One can benefit from faith in something. The mental, physical and spiritual obstacles related to cancer are severe. A positive outlook may not have the power to heal -— but, then again, it might. I believe, at the very least, it can make the process more manageable. Hope and faith are very personal. I was broken-hearted and disappointed when God did not heal my daughter. Yet, I believe she is in heaven. When I was diagnosed, I was angry with God. My lonely walks on the beach brought on another series of questions: What kind of God are you? Do you care? What do you want with my family? Even so, I never gave up my trust that God is watching over Erin.\n\n\n\nMy journey forward has been steady but difficult. It requires a willingness to participate on so many levels and I’m always seeking answers. I believe that the process will lead to living my life at the highest level, regardless of the outcome. Prayer and reflection are part of my daily vigilance. I am grateful that doctors, nurses, chemotherapy, and other drugs are available. I consider these to be gifts from God. I also believe this is part of a grand plan that will give me, the cancer patient, an opportunity to fight and a chance to get well.\n\n\n\nWhen our daughter Erin died my wife, Karen, and I made our decision to fight back. We joined with others in an organization called the Pediatric Cancer Research Foundation (PCRF) to raise funds for research aimed at curing pediatric cancer. I’m a past president of PCRF, and currently a member of the PCRF board of directors. Karen spends countless hours on the PCRF Holiday Card Program — their major fund raising activity for the last 20 years. Our family shares the goals of PCRF.\n\n\n\nRaising funds to support research will help fight this terrible disease. Over the last 20 years the survival rate for children with cancer has more than doubled because of research. Regardless of the outcome of my disease, I know that we are making a difference in this big battle, that we are committed until cancer is defeated.\n\n\n\n\n\n\n\nRelated Links John Vallely Motivates\n\nLatest News Article\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://www.zimbio.com/John+Vallely", "page_content": "Overview\n\nAll you need to know about John Vallely, complete with news, pictures, articles, and videos. He also graduated from West Coast High School and the California International University Hockey Federation team. Vallely's grandfather was a professional basketball player that played professional baseball and basketball with the Los Angeles Dodgers... more\n\nAll you need to know about John Vallely, complete with news, pictures, articles, and videos. He also graduated from West Coast High School and the California International University Hockey Federation team.\n\n\n\nVallely's grandfather was a professional basketball player that played professional baseball and basketball with the Los Angeles Dodgers from 1933 - 1938 while the Vallely brothers played basketball with the Anaheim All-Star game team for nine years and remained teammates on both teams. Vallely played three seasons for the Los Angeles Lakers...\n\nBorn: ( 1948-10-03) October 3, 1948 (age 72) Newport Beach, California\n\nNationality: American\n\nListed height: 6 ft 3 in (1.91 m)\n\nListed weight: 185 lb (84 kg)\n\nHigh school: Corona del Mar (Newport Beach, California)\n\nCollege: Orange Coast (1966–1968) UCLA (1968–1970)\n\nNBA draft: 1970 / Round: 1 / Pick: 14th overall\n\nPlaying career: 1970–1975\n\nPosition: Shooting guard\n\nNumber: 40, 33\n\nThis content is based on data from multiple web sources. If you see any errors, please contact us."}, {"url": "https://www.espn.com/nba/story/_/id/15566047/jim-mcmillian-won-1972-title-los-angeles-lakers-dies-68", "page_content": "LOS ANGELES -- Jim McMillian, who helped the Los Angeles Lakers to a 33-game win streak and the 1972 NBA championship as a second-year pro playing with Wilt Chamberlain and Jerry West, died Monday. He was 68.\n\nMcMillian died from complications of heart failure at a hospital in Winston-Salem, North Carolina, after being in failing health in recent months, according to his sister-in-law, Denise Sheridan.\n\nThe Lakers made McMillian the 13th pick in the first round of the 1970 draft out of Columbia University. He was also drafted in the first round by the New York Nets of the ABA, but he chose the Lakers.\n\nHe averaged 15.3 points per game in three seasons in Los Angeles and was a key member of the Lakers' first championship team in the city after their move from Minneapolis. He averaged 19.1 points in replacing retired Elgin Baylor at forward, a move that coincided with the start of the team's 33-game win streak. The roster included Chamberlain, West, Gail Goodrich, Happy Hairston, Keith Erickson and Pat Riley. They were coached by Bill Sharman.\n\nDespite his relative youth, McMillian fit in seamlessly with his veteran teammates.\n\n\"Jim could run and fill the lanes with the best of them. He had a great, 15-foot jump shot,\" Erickson said. \"Jim was young and eager. He was a perfect complement on our team.\"\n\nAfter he played one more season in Los Angeles, the Lakers traded the 6-foot-5 forward to the Buffalo Braves for Elmore Smith.\n\n\"Jim was an important part of Lakers history, as a key member of our first championship team in Los Angeles in 1972,\" said Jeanie Buss, Lakers president and co-owner. \"His passing is a sad day for us.\"\n\nMcMillian later played for the New York Knicks and Portland Trail Blazers during his nine-year NBA career. After leaving the league, he moved to Italy and played two years for a team in Bologna. He returned home to work in a wholesale retail business before founding his own clothing business. He later worked for a clothing manufacturing company.\n\nMcMillian attended occasional reunions of the '72 team. Sharman's widow, Joyce, got to know McMillian when she helped produce a film about that championship season.\n\n\"To know Jim is to love him. He is a big, gentle giant,\" said Sharman, who last saw McMillian six months ago at a dinner in Los Angeles. He turned down the organizers' offer of a ride and told Sharman he wanted her to drive him, even though she has a small car.\n\n\"His knees were up to the roof of the car,\" she recalled. \"We laughed the whole way there and the whole way back.\"\n\nBorn March 11, 1948, in Raeford, North Carolina, McMillian was raised in Brooklyn, where he starred at Thomas Jefferson High School before going to Columbia. He led the Lions to a 63-14 record in three seasons and, as a sophomore, their most recent NCAA Tournament appearance in 1968, when he averaged 17 points and 11 rebounds in the team's three-game tournament run.\n\nColumbia lost to Davidson in overtime of the East Regional semifinal before beating St. Bonaventure in the consolation game. McMillian is second on the school's career scoring list with 22.9 points and still holds the records for field goals in a season (253) and career (677).\n\nNicknamed \"Jimmy Mac,\" McMillian was a three-time All-American and All-Ivy League player.\n\n\"Jim was a quiet and powerful leader,\" said Jonathan Schiller, chairman of Columbia's board of trustees and former teammate of McMillian. \"Jim was a supportive and close friend to each of his teammates. We know well that Jim was and will always be remembered as one of the most gifted student-athletes to attend Columbia University.\"\n\nErickson recalled that McMillian carried a book with him everywhere.\n\n\"He was quiet,\" he said. \"He read a lot, very thoughtful.\"\n\nMcMillian is survived by his wife of 43 years, Alexis, his son, Aron, his daughters Erica and Emon and seven grandchildren."}, {"url": "https://www.espn.com/nba/story/_/id/9139635/new-york-knicks-honor-1972-73-champs-40th-anniversary", "page_content": "NEW YORK -- The New York Knicks hope to end their 40-year title drought later this spring.\n\nOn Friday, they recognized the last Big Apple team to win the crown.\n\nDirector Spike Lee, front left, joins the 1972-73 championship Knicks team during a halftime ceremony Friday night. AP Photo/Frank Franklin II\n\nThe Knicks honored the 1972-73 championship team with a ceremony at halftime of the game against Milwaukee. Eleven of the 12 living members of the team were on hand.\n\nCoached by Red Holzman, the '72-73 team featured six future Hall of Fame players and beat the Los Angeles Lakers in five games to win their second title in four years.\n\nThe Knicks haven't won a title since and have been back to the Finals just twice.\n\nWalt \"Clyde\" Frazier said he'd be stunned if someone told him in 1973 that the Knicks would have to endure a 40-year drought after winning that season.\n\n\"It would have shocked me. It would have shocked me. (Being in) New York, and what we had, we had a dominant team. So you figured it would continue. It's just astounding,\" Frazier said.\n\nAs former Knick Bill Bradley said, \"Once a Knicks fan, always a Knicks fan and for 40 years we've been suffering Knicks fans.\"\n\nThe Knicks were one of the strongest teams in the league in the late 1960s and early 1970s, thanks to elite players such as Frazier.\n\nNew York won its first title in 1969-70 and made it to the NBA Finals in 1972. That team lost to the Lakers but bounced back to beat Los Angeles in five games the next spring.\n\n\"We were very confident in our capabilities and we knew we were a unique team,\" Phil Jackson said. \"Small, quick good ball handlers and a great passing team ... We bonded in a way in which I've tried to coach the players that I've coached over the years.\"\n\nJackson received a loud ovation during the halftime ceremony. Some wondered if Jackson would be booed by the Knicks crowd because he called the Carmelo Anthony-Amar'e Stoudemire pairing \"clumsy\" last summer and, as coach, won 11 NBA titles with the Chicago Bulls and Lakers to keep the Knicks' drought alive."}, {"url": "https://www.washingtonpost.com/sports/jim-mcmillian-who-helped-la-lakers-win-1972-nba-championship-dies-at-68/2016/05/17/b48d2fbc-1c41-11e6-8c7b-6931e66333e7_story.html", "page_content": "Comment on this story Comment Gift Article Share\n\nJim McMillian, who helped the Los Angeles Lakers to a 33-game winning streak and the 1972 National Basketball Association championship as a second-year pro playing with Wilt Chamberlain and Jerry West, died May 16 at a hospital in Winston-Salem, N.C. He was 68. Wp Get the full experience. Choose your plan ArrowRight The cause was a heart ailment, after months of failing health, said a sister-in-law, Denise Sheridan.\n\nThe Lakers made the 6-foot-5 Mr. McMillian, out of Columbia University, the 13th overall pick in the first round of the 1970 draft. He was also drafted in the first round by the New York Nets of the ABA but chose the Lakers. He averaged 15.3 points during three seasons in Los Angeles.\n\nHe was a key member of the Lakers’ first championship team after the team moved from Minneapolis. He averaged 19.1 points in replacing retired Elgin Baylor at forward, a move that coincided with the start of the team’s 33-game winning streak, an NBA record. The team finished 69-13, a regular-season record that stood for 24 years.\n\nDespite his relative youth, Mr. McMillian fit in seamlessly with his veteran teammates, who included Chamberlain, West, Gail Goodrich, Happy Hairston, Keith Erickson and Pat Riley. They were coached by Bill Sharman.\n\n“He had a great 15-foot jump shot,” Erickson said. “Jim was young and eager. He was a perfect complement on our team.”\n\nAdvertisement\n\nAfter one more year in Los Angeles, Mr. McMillian was traded from the Lakers to the Buffalo Braves for Elmore Smith.\n\nMr. McMillian later played for the New York Knicks and Portland Trail Blazers during his nine-year NBA career. After leaving the league, he moved to Italy and played two years for a team in Bologna. After his return to the United States, he started a clothing business. He later worked for a clothing manufacturing company.\n\nMr. McMillian attended occasional reunions of the ’72 team.\n\nJames M. McMillian was born March 11, 1948, in Raeford, N.C., and grew up in Brooklyn. As a college player, he led the Columbia Lions to a 63-14 record during three seasons, including an NCAA Tournament appearance in 1968, when he was a sophomore. He is ranked second on the school’s career scoring list, at 22.9 points per game, and he still holds the team marks for field goals in a season (253) and career (677).\n\nMr. McMillian was an All-Ivy League player and was named to All-America teams.\n\nErickson recalled that Mr. McMillian carried a book with him everywhere. “He was quiet,” he said. “He read a lot, very thoughtful.”\n\nSurvivors include his wife of 43 years, Alexis McMillian; three children; and seven grandchildren.\n\n— Associated Press\n\nRead more Washington Post obituaries\n\nGiftOutline Gift Article"}, {"url": "https://basketball.realgm.com/player/John-Vallely/Summary/66807", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://www.latimes.com/local/obituaries/la-me-ln-jim-mcmillian-obituary-20160518-snap-story.html", "page_content": "Jim McMillian, who helped the Los Angeles Lakers to a 33-game winning streak and the 1972 NBA championship as a second-year pro playing with Wilt Chamberlain and Jerry West, has died. He was 68.\n\nHe died Monday from complications of heart failure at a hospital in Winston-Salem, N.C., after being in failing health in recent months, according to his sister-in-law Denise Sheridan.\n\nThe Lakers made McMillian the 13th overall pick in the first round of the 1970 draft out of Columbia University. He was also drafted in the first round by the New York Nets of the ABA, but chose the Lakers. He averaged 15.3 points during three seasons in Los Angeles.\n\nAdvertisement\n\nHe was a key member of the Lakers’ first championship team in the city after their move from Minneapolis. He averaged 19.1 points in replacing retired Elgin Baylor at forward, a move that coincided with the start of the team’s 33-game winning streak.\n\nThe roster included Chamberlain, West, Gail Goodrich, Happy Hairston, Keith Erickson and Pat Riley. They were coached by Bill Sharman.\n\nDespite his relative youth, McMillian fit in seamlessly with his veteran teammates.\n\n“Jim could run and fill the lanes with the best of them. He had a great 15-foot jump shot,” Erickson said. “Jim was young and eager. He was a perfect complement on our team.”\n\nAfter one more year in Los Angeles, the Lakers traded the 6-foot-5 forward to the Buffalo Braves for Elmore Smith.\n\n“Jim was an important part of Lakers history, as a key member of our first championship team in Los Angeles in 1972,” said Jeanie Buss, Lakers president and co-owner. “His passing is a sad day for us.”\n\nMcMillian also played for the New York Knicks and Portland Trail Blazers during his nine-year NBA career. After leaving the league, he moved to Italy and played two years for a team in Bologna. He returned home to work in a wholesale retail business before founding his own clothing business. He later worked for a clothing manufacturing company.\n\nMcMillian attended occasional reunions for the ‘72 team. Sharman’s widow, Joyce, got to know McMillian when she helped produce a film about that championship season.\n\n“To know Jim is to love him. He is a big gentle giant,” said Sharman, who last saw McMillian six months ago in Los Angeles at a dinner. He turned down the organizers’ offer of a ride and told Sharman he wanted her to drive him even though she has a small car.\n\n“His knees were up to the roof of the car,” she recalled. “We laughed the whole way there and the whole way back.”\n\nBorn March 11, 1948, in Raeford, N.C., McMillian was raised in Brooklyn, where he starred at Thomas Jefferson High School before going on to Columbia. He led the Lions to a 63-14 record during three seasons and their last NCAA tournament appearance in 1968 as a sophomore, when he averaged 17 points and 11 rebounds during their three-game tournament run.\n\nThey lost to Davidson in overtime of the East Regional semifinal before beating St. Bonaventure in the consolation game. McMillian is second on the school’s career scoring list with 22.9 points and still holds the marks for field goals in a season (253) and career (677).\n\nNicknamed “Jimmy Mac,” McMillian was a three-time All-America and All-Ivy League player.\n\n“Jim was a quiet and powerful leader,” said Jonathan Schiller, chairman of Columbia’s board of trustees and former teammate of McMillian. “Jim was a supportive and close friend to each of his teammates. We know well that Jim was and will always be remembered as one of the most gifted student-athletes to attend Columbia University.”\n\nErickson recalled McMillian carried a book with him everywhere.\n\n“He was quiet,” he said. “He read a lot, very thoughtful.”\n\nHe is survived by his wife of 43 years, Alexis, son Aron, daughters Erica and Emon and seven grandchildren."}], "John Vallely was a part of the Rockets' 1979–80 championship team.": [{"url": "https://basketball.realgm.com/player/John-Vallely/Summary/66807", "page_content": "The Improbable, Inevitable Miami Heat by John Wilmes It was not foreseeable Miami would defeat the most talented teams in the sport, flaring an unusual ability to find and corner the frightened child within some of the NBA's biggest stars.\n\nNBA Draft Report: Cason Wallace Of Kentucky by Zachary Cohen Cason Wallace is a plus defender with an NBA ready jumper that can immediately help a lot of basketball teams, and he's going to be a chameleon in the league when it comes to fit.\n\nFor The Nuggets, Attention Isn't the Prize by John Wilmes Your life is certainly better if you don't make yourself think like a media executive, but the exercise may be useful to those acting confused about why a business-first basketball team with minimal mainstream history and no loud characters has been under-publicized."}, {"url": "https://www.statscrew.com/basketball/roster/t-HOU/y-1979", "page_content": "1979-80 Houston Rockets Roster\n\nThe Houston Rockets of the National Basketball Association ended the 1979-80 season with a record of 41 wins and 41 losses, finishing second in the NBA's Central Division of the Eastern Conference. The team compiled a postseason mark of 2-5.\n\nHouston tossed in 9,084 points and allowed 9,070. Moses Malone scored a team-best 2,119 points for the Rockets, and Calvin Murphy contributed 18 or more per game, too. Moses Malone accounted for 1,190 boards. Allen Leavell dished out 417 assists for the squad.\n\nOn the defensive side of the ball, Calvin Murphy added 143 steals.\n\nDel Harris coached the team. The 1979-80 Houston Rockets lost in the conference semifinals.\n\nClick on column headings to sort."}, {"url": "http://www.vallely.com/johnvallely.htm", "page_content": "John Vallely:\n\n\n\nBackground\n\nBy Tom Vallely\n\n\n\nJohn Vallely was an All American basketball player at UCLA and was a first round draft choice of the Atlanta Hawks of the NBA in 1971. The UCLA teams were both NCAA Champs and pretty legendary. They were coached by John Wooden.\n\n1969 UCLA Bruins NCAA Champions TOP (l to r): Lynn Shackelford, Curtis Rowe, Steve Patterson, Lew Alcindor, Sidney Wicks, John Ecker, Bill Seibert. MIDDLE: George Farmer, Bill Sweek, Ken Heitz, John Vallely, Terry Schofield. BOTTOM: Ducky Drake, Denny Crum, John Wooden, Gary Cunningham, Bob Marcucci (manager).\n\n1970 UCLA Bruins NCAA Champions TOP (l to r): Kenny Booker, Rick Betchley, John Ecker, Sidney Wicks, Steve Patterson, Jon Chapman, Curtis Rowe, Bill Seibert, John Vallely. MIDDLE: George Morgan (manager), Gary Cunningham, John Wooden, Denny Crum, Ducky Drake. BOTTOM: Henry Bibby, Terry Schofield, Andy Hill.\n\nJohn Vallely Today\n\n\n\n\n\nJohn Vallely, age 53, was raised in Orange County and now lives in Newport Beach. During his college days, John was a member of the UCLA Bruins basketball team and participated in two National Championship seasons, 1969 and 1970, under legendary coach John Wooden. John and wife Karen met during college and were married in 1970, the year John graduated with a degree in sociology. The couple had two children: a son, Eric, and a daughter, Erin. When Erin was 9 years old she was diagnosed with cancer, and eventually lost her battle, at the age of 12, in 1991. Since then, John and Karen have been committed to fighting pediatric cancer.\n\n\n\n\n\nToday, John is completing treatment for his own illness, lymphoma, and is very optimistic about his recovery. John says he uses Wooden’s Pyramid of Success strategy to deal with his cancer. Wooden’s philosophy, according to Vallely, focuses on success rather than winning. “I have no conflict in my heart about knowing that I am the best I can be and so I have peace of mind,” John says. “Success is the absence of conflict. Actually it’s harder to do than winning. It’s possible to win a game without doing your best. But knowing have been the best husband, the best father, the best patient I can, is all I can do.”\n\nSurviving With Strength\n\nA Former UCLA Basketball Star Writes About Dealing with the Loss of a Daughter from Cancer, and Then, Fighting His Own Battle with Lymphoma\n\nBy John Vallely\n\n\n\nA random attack of cancer strikes fear in anyone. Why me? Am I going to die? What did I do wrong? Why did this have to strike my daughter at such a young age? It’s not possible to answer these questions. What matters most, is our response to these life challenges.\n\n\n\nMy experience with cancer began in 1988. My 9- year-old daughter Erin was diagnosed with rhabdomyosarcoma. Surgeons removed a cantaloupe- sized tumor from her abdomen, but were unable to get the entire growth. Until her death in 1991, she endured multiple s u r g e r i e s , chemotherapy and radiation that severely burned her already ill body. I learned so much from her. I miss her.\n\n\n\nIn April 2002, at 53 years old, I was diagnosed with lymphoma. I cannot tell you how astonished I was to learn of my condition. How could this be? Haven't we had enough? My wife and I had already experienced our child dying in our arms. What could be next for us? What about our son Eric? Again I was filled with fear, but once we all began to fight back it gradually subsided.\n\n\n\nThe first step of each patient’s process is correct diagnosis. I believe you must have at least two opinions regarding pathology. If a patient is incorrectly diagnosed, the treatment will not attack their disease. I have spoken with patients who were disappointed with treatment outcome. They later learned that the course of medications would have been different had they researched their circumstances more thoroughly. Consensus on diagnosis is good. Differing opinions lead to better decisions, so patient and family must be proactive and explore options. The relationship with the medical system should be considered a partnership.\n\n\n\nThe next step is launching a plan of attack. After all, this is War! Most things, including my cancer, are not simply about winning and losing. My disease is about the process. I believe it is important to have a positive attitude. Mine is: \"I will be the best I can be. I will do all that I can do to get well and to help my loved ones. I will follow all of the doctor’s directions. I will do everything in my power to give myself and loved ones every chance to survive this disease. And then I will pray!\"\n\n\n\nI believe \"hope\" is important. One can benefit from faith in something. The mental, physical and spiritual obstacles related to cancer are severe. A positive outlook may not have the power to heal -— but, then again, it might. I believe, at the very least, it can make the process more manageable. Hope and faith are very personal. I was broken-hearted and disappointed when God did not heal my daughter. Yet, I believe she is in heaven. When I was diagnosed, I was angry with God. My lonely walks on the beach brought on another series of questions: What kind of God are you? Do you care? What do you want with my family? Even so, I never gave up my trust that God is watching over Erin.\n\n\n\nMy journey forward has been steady but difficult. It requires a willingness to participate on so many levels and I’m always seeking answers. I believe that the process will lead to living my life at the highest level, regardless of the outcome. Prayer and reflection are part of my daily vigilance. I am grateful that doctors, nurses, chemotherapy, and other drugs are available. I consider these to be gifts from God. I also believe this is part of a grand plan that will give me, the cancer patient, an opportunity to fight and a chance to get well.\n\n\n\nWhen our daughter Erin died my wife, Karen, and I made our decision to fight back. We joined with others in an organization called the Pediatric Cancer Research Foundation (PCRF) to raise funds for research aimed at curing pediatric cancer. I’m a past president of PCRF, and currently a member of the PCRF board of directors. Karen spends countless hours on the PCRF Holiday Card Program — their major fund raising activity for the last 20 years. Our family shares the goals of PCRF.\n\n\n\nRaising funds to support research will help fight this terrible disease. Over the last 20 years the survival rate for children with cancer has more than doubled because of research. Regardless of the outcome of my disease, I know that we are making a difference in this big battle, that we are committed until cancer is defeated.\n\n\n\n\n\n\n\nRelated Links John Vallely Motivates\n\nLatest News Article\n\n\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://www.stadiumtalk.com/s/1980-us-olympic-hockey-team-then-now-b0603bc7cb2a4f48", "page_content": "Where Are They Now: 1980 U.S. Olympic Hockey Team You won't believe what happened to the \"Miracle On Ice\" players after they won the gold.\n\nWhere Are They Now: 1980 U.S. Olympic Hockey Team Is there a greater team accomplishment in sports history than what the U.S. Olympic hockey team did at the 1980 Winter Olympics in Lake Placid, New York? When the Americans won the gold medal, they took down the Soviet Union, the most powerful team in the world, in the semifinals. The game become known as the \"Miracle on Ice\" and is the leader in the clubhouse as the greatest sports upset of all time. With U.S. head coach Herb Brooks leading a team of college all-stars against the greatest team in the world — the Russians were de facto professionals — the story of the American team has been made into a movie, twice, and is part of sports culture around the world. But what happened to the team after the Olympics? What paths would their destinies take? Here's a look at the 1980 U.S. Olympic hockey team after they won the gold, and where they are now.\n\nKen Morrow, Defenseman Born: Oct. 17, 1956 (Davison, Michigan) High school: Davison High School (Davison, Michigan) College: Bowling Green State University\n\nCareer Highlights: Ken Morrow NHL career: New York Islanders (1979-89) Career highlights: CCHA Player of the Year (1979), four-time All-CCHA (1976-79), four-time Stanley Cup champion (1980-83)\n\nWhat Happened Next: Ken Morrow You might not know his name like some of the other players on the 1980 Olympic team, but Ken Morrow may have been the best player on the team pound for pound. \"Wolfman\" was drafted by the New York Islanders after his freshman season at Bowling Green, and after the 6-foot-4, 209-pound defenseman won the gold medal, he went straight to the NHL and was a key player on four consecutive Stanley Cup championship teams. Morrow has been the director of pro scouting for the Islanders since 1995.\n\nMike Ramsey, Defenseman Born: Dec. 3, 1960 (Minneapolis, Minnesota) High school: Roosevelt High School (Minneapolis, Minnesota) College: University of Minnesota NHL career: Buffalo Sabres (1979-93), Pittsburgh Penguins (1992-94), Detroit Red Wings (1994-97)\n\nCareer Highlights: Mike Ramsey NHL career: Buffalo Sabres (1979-93), Pittsburgh Penguins (1992-94), Detroit Red Wings (1994-97) Career highlights: All-NCAA tournament team (1979), Stanley Cup champion (1997), four-time NHL All-Star (1982, 1983, 1985, 1986)\n\nWhat Happened Next: Mike Ramsey Mike Ramsey was one of nine players on the 1980 team who played for Herb Brooks at the University of Minnesota and was the youngest player on the Olympic hockey team at 19 years old. Ramsey had one of the best NHL careers of any player from the Olympic team. He played 18 seasons in the NHL, with the first 14 on the Buffalo Sabres and made four NHL All-Star teams. Ramsey only played in the Stanley Cup Final once and retired after two games with the Detroit Red Wings at the beginning of the 1996-97 season. And the Red Wings went on to win the Stanley Cup. Ramsey moved back to Minnesota after his playing career was over to run a sporting goods store (Gold Medal Sports) and was an assistant coach with the Minnesota Wild from 2000 to 2010.\n\nMark Johnson, Center Born: Sept. 22, 1957 (Minneapolis, Minnesota) High school: James Madison Memorial High School (Madison, Wisconsin) College: University of Wisconsin\n\nCareer Highlights: Mark Johnson NHL career: Pittsburgh Penguins (1979-82), Minnesota North Stars (1982), Hartford Whalers (1982-85), St. Louis Blues (1985), New Jersey Devils (1985-90) Career highlights: NHL All-Star (1984), WCHA Most Valuable Player (1979), WCHA Freshman of the Year (1977), two-time AHCA West All-American (1978, 1979)\n\nWhat Happened Next: Mark Johnson No one was better against the Soviet Union than University of Wisconsin star Mark Johnson, who scored two goals in a 4-3 win and had an assist on the game-winning goal in the gold medal win over Finland. Johnson then played in the NHL for 12 seasons and was an NHL All-Star in 1984 with the Hartford Whalers. Johnson has been the women's hockey coach at the University of Wisconsin since 2002, where he's won six national championships and been named National Coach of the Year four times. He also was the head coach for the U.S. women's Olympic team in 2010, leading them to a silver medal.\n\nRob McClanahan, Left Wing Born: Jan. 9, 1958 (Saint Paul, Minnesota) High school: Mounds View High School (Arden Hills, Minnesota) College: University of Minnesota\n\nCareer Highlights: Rob McClanahan NHL career: Buffalo Sabres (1979-81), Hartford Whalers (1981-82), New York Rangers (1982-83) Career highlights: All-NCAA tournament team (1977, 1978), two-time All-ECAC (1977, 1978), NCAA champion (1978)\n\nWhat Happened Next: Rob McClanahan Rob McClanahan came to the Olympic team after winning a national championship with the University of Minnesota and U.S. head coach Herb Brooks in 1979. McClanahan scored what proved to be the game-winning goal for the U.S. in the gold medal game against Finland and scored five goals in seven games at the 1980 Olympics. His argument with Brooks during intermission of an Olympic game against Sweden, when Brooks goaded an injured McClanahan into coming back into the game, is one of the more famous moments in the team's history. McClanahan played five seasons in the NHL before becoming an investment banker.\n\nDave Silk, Right Wing Born: Jan. 1, 1958 (Scituate, Massachusetts) High school: Thayer Academy (Braintree, Massachusetts) College: Boston University\n\nCareer Highlights: Dave Silk NHL career: New York Rangers (1979-83), Boston Bruins (1983-85), Detroit Red Wings (1985), Winnipeg Jets (1985-86) Career highlights: NCAA champion (1978), New England Rookie of the Year (1977), two-time All-New England (1977, 1978)\n\nWhat Happened Next: Dave Silk Dave Silk was one of four players from Boston University on the 1980 Olympic team, alongside college teammates Mike Eruzione, Jim Craig and Jack O'Callahan. Silk was a star in college, helping the Terriers win the 1978 national championship. Silk played seven seasons in the NHL, then played five more seasons of professional hockey in Germany. Following his playing career, he used his MBA from Boston University and went into finance.\n\nBill Baker, Defenseman Born: Nov. 29, 1956 (Grand Rapids, Minnesota) High school: Grand Rapids High School (Grand Rapids, Minnesota) College: University of Minnesota\n\nCareer Highlights: Bill Baker NHL career: Montreal Canadiens (1980), Colorado Rockies (1980-82), St. Louis Blues (1982), New York Rangers (1982-83) Career highlights: WHCA All-American (1979), All-WHCA (1979), CHL Adams Cup champion (1984)\n\nWhat Happened Next: Bill Baker Bill Baker was the captain for Herb Brooks at the University of Minnesota when the Gophers won the national championship in 1979 before making the 1980 Olympic team. Baker scored the final goal in a 2-2 tie with Sweden, which allowed the U.S. to advance to the medal round. His jersey is on display at the Smithsonian Institute in Washington, D.C. Baker played three seasons in the NHL before he returned to school, becoming a doctor of oral and maxillofacial medicine who specializes in jaw surgeries and soft-palate tissue repairs.\n\nNeal Broten, Center Born: Nov. 29, 1959 (Roseau, Minnesota) High school: Roseau High School (Roseau, Minnesota) College: University of Minnesota\n\nCareer Highlights: Neal Broten NHL career: Minnesota North Stars/Dallas Stars (1980-95, 1997), New Jersey Devils (1995-97), Los Angeles Kings (1997) Career highlights: NCAA champion (1979), WHCA Rookie of the Year (1979), Hobey Baker Award (1981), Stanley Cup champion (1995)\n\nWhat Happened Next: Neal Broten Neal Broten was an electric goal scorer who won a national championship at the University of Minnesota in 1979. Broten and Canadian goaltender Ed Belfour are the only two players in hockey history to win an NCAA championship, Olympic gold medal and Stanley Cup championship. Broten played 17 seasons in the NHL, where he scored over 50 points nine times and played over 1,000 games, including a 105-point season in 1985-86, when he became the first American to score over 100 points in a single season. He also was a two-time NHL All-Star and won the Stanley Cup with the New Jersey Devils in 1995, when he scored the title-clinching goal.\n\nDave Christian, Right Wing Born: May 12, 1959 (Warroad, Minnesota) High school: Warroad High School (Warroad, Minnesota) College: University of North Dakota\n\nCareer Highlights: Dave Christian NHL career: Winnipeg Jets (1979-83), Washington Capitals (1983-90), Boston Bruins (1990-91), St. Louis Blues (1991-92), Chicago Blackhawks (1992-94) Career highlights: NCAA runner-up (1979), NHL All-Star (1991)\n\nWhat Happened Next: Dave Christian Dave Christian was the only member of the 1980 Olympic team from the University of North Dakota. They lost to U.S. head coach Herb Brooks and the University of Minnesota (and many of his Olympic teammates) in the 1979 NCAA championship game. Christian was playing in the NHL with the Winnipeg Jets one week after winning a gold medal, and still holds the NHL record by scoring just 7 seconds into his first NHL game. Christian went on to play 15 seasons and 1,009 career games in the NHL and played in the Stanley Cup Final once, when the Boston Bruins lost to the Edmonton Oilers in 1990. Christian, who played in the 1991 NHL All-Star Game, wasn't the first one in his family to win a gold medal. His father, Bill Christian, and his uncle, Roger Christian, were both on the 1960 U.S. Olympic hockey team.\n\nSteve Christoff, Right Wing Born: Jan. 23, 1958 (Springfield, Illinois) High school: Richfield High School (Richfield, Minnesota) College: University of Minnesota\n\nCareer Highlights: Steve Christoff NHL career: Minnesota North Stars (1979-82), Calgary Flames (1982-83), Los Angeles Kings (1983-84) Career highlights: NCAA champion (1979), two-time All-ECAC (1978, 1979), All-NCAA tournament team (1979)\n\nWhat Happened Next: Steve Christoff Steve Christoff was one of the most highly recruited high school hockey players of all time coming out of Richfield (Minnesota) High School before starring at the University of Minnesota for Olympic head coach Herb Brooks. After winning the gold medal, Christoff played five seasons and led the Minnesota North Stars to the Stanley Cup Final, where they lost to Olympic hockey teammate Ken Morrow and the New York Islanders. After retiring from hockey, Christoff went to work for Endeavor Air as an airline pilot.\n\nJohn Harrington, Right Wing Born: May 24, 1957 (Virginia, Minnesota) High school: Virginia High School (Virginia, Minnesota) College: University of Minnesota-Duluth\n\nCareer Highlights: John Harrington NHL career: None Career highlights: NCAA Frozen Four (1984, as head coach)\n\nWhat Happened Next: John Harrington John Harrington was an underdog all the way. He started as a walk-on at the University of Minnesota-Duluth and eventually made the 1980 Olympic roster. Harrington was credited with an assist on Mike Eruzione's game-winning goal in the semifinal win over the Soviet Union. Undrafted by the NHL, Harrington played for the U.S. again in the 1984 Olympics. He was a college assistant for several years before he became head coach at Saint John's University in Collegeville, Minnesota, where he coached for 15 years.\n\nSteve Janaszak, Goaltender Born: Jan. 7, 1957 (Saint Paul, Minnesota) High school: Hill-Murray School (Saint Paul, Minnesota) College: University of Minnesota\n\nCareer Highlights: Steve Janaszak NHL career: Minnesota North Stars (1979-80), Colorado Rockies (1981-82) Career highlights: NCAA champion (1979), NCAA Tournament Most Valuable Player (1979), IHL Rookie of the Year (1981)\n\nWhat Happened Next: Steve Janaszak Steve Janaszak was the MVP of the 1979 NCAA tournament after he led the University of Minnesota to the national championship and was the backup to Jim Craig on the 1980 U.S. Olympic team, where he was the only player on the roster who did not play in the Olympics. Janaszak played four seasons of professional hockey after winning the gold medal, including two in the NHL, then became an investment banker in New York after his career was over.\n\nJack O'Callahan, Defenseman Born: July 24, 1957 (Charlestown, Massachusetts) High school: Boston Latin School (Boston, Massachusetts) College: Boston University\n\nCareer Highlights: Jack O'Callahan NHL career: Chicago Blackhawks (1982-87), New Jersey Devils (1987-89) Career highlights: NCAA champion (1978), NCAA Tournament Most Valuable Player (1978),\n\nWhat Happened Next: Jack O'Callahan Jack O'Callahan starred at Boston University and injured his knee in the 1980 Olympic opener agains Sweden, but returned to play in the \"Miracle on Ice\" game against the Soviet Union. O'Callahan played seven seasons in the NHL, mostly for the Chicago Blackhawks, then went into financial services in Chicago following his retirement from hockey.\n\nMark Pavelich, Center Born: Feb. 28, 1958 (Eveleth, Minnesota) Died: March 4, 2021, 63 years old (Sauk Centre, Minnesota) High school: Eveleth High School (Eveleth, Minnesota) College: University of Minnesota-Duluth\n\nCareer Highlights: Mark Pavelich NHL career: New York Rangers (1981-86), Minnesota North Stars (1986-87), San Jose Sharks (1991-92) Career highlights: All-WCHA (1979), All-WHCA West All-American (1979)\n\nWhat Happened Next: Mark Pavelich Mark Pavelich was the son of Croatian immigrants and starred at Eveleth High School before staying close to home to play college hockey for the University of Minnesota-Duluth. Pavelich, who had the assist to Mike Eruzione on the game-winning goal against the Soviet Union, lived a life marked by tragedy. When he was 18 years old, he accidentally killed his 15-year-old friend in a hunting accident. In 1994 his second wife, Kara Burmachuk, died after accidentally falling from the a balcony on the second floor of their home. Pavelich auctioned off his gold medal for approximately $263,000 in 2014. He was arrested in 2019 for assaulting a neighbor and possession of firearms. Ruled incompetent to stand trial, he was committed to a mental health facility, where he committed suicide on March 3, 2021. He was 63 years old.\n\nBuzz Schneider, Left Wing Born: Sept. 14, 1954 (Grand Rapids, Minnesota) High school: Babbitt High School (Babbitt, Minnesota) College: University of Minnesota\n\nCareer Highlights: Buzz Schneider NHL career: None Career highlights: NCAA champion (1974)\n\nWhat Happened Next: Buzz Schneider Buzz Schneider was the oldest player on the 1980 Olympic hockey team. It was actually his second Olympics after playing for the U.S. in 1976. At the 1980 Olympics, Schneider was part of the famous \"Coneheads\" line with Mark Pavelich and John Harrington. In seven games on the way to winning the gold medal, Schneider scored five goals and had three assists. After Schneider retired from hockey in 1983, he was a sales executive for a semi-trailer company in Minnesota before going into real estate. In the 2004 Disney film \"Miracle,\" he was portrayed by his son, Billy.\n\nEric Strobel, Right Wing Born: June 5, 1958 (Rochester, Minnesota) High school: Mayo High School (Rochester, Minnesota) College: University of Minnesota\n\nCareer Highlights: Eric Strobel NHL career: None Career highlights: NCAA champion (1979)\n\nWhat Happened Next: Eric Strobel Eric Strobel was one of the many players from the University of Minnesota's 1979 national championship team to play on the 1980 Olympic hockey squad. He had a short professional career end when he broke his ankle playing on the Buffalo Sabres' top farm club. Strobel's father, Art Strobel, played for the New York Rangers.\n\nBob Suter, Defenseman Born: May 16, 1957 (Madison, Wisconsin) Died: Sept. 9, 2014, 57 years old (Middleton, Wisconsin) High school: Madison East High School (Madison, Wisconsin) College: University of Wisconsin\n\nCareer Highlights: Bob Suter NHL career: None Career highlights: NCAA champion (1977), All-WHCA (1979)\n\nWhat Happened Next: Bob Suter At only 5-foot-9 and 180 pounds, Bob Suter didn't look the part, but he was the closest thing the 1980 Olympic team had to an enforcer. He earned the reputation while winning a national championship at the University of Wisconsin and setting the school record for penalty minutes in 1979. Suter was the first player off the 1980 Olympic team to die when he had a fatal heart attack at the Capitol Ice Arena in Middleton, Wisconsin, in 2014. The arena was eventually named after him. Suter's brother, Gary Suter, played in the NHL from 1985 to 2002 and Bob's son, Ryan Suter, has played in the NHL since 2004.\n\nPhil Verchota, Left Wing Born: Dec. 28, 1956 (Duluth, Minnesota) High school: Duluth East High School (Duluth, Minnesota) College: University of Minnesota\n\nCareer Highlights: Phil Verchota NHL career: None Career highlights: Two-time NCAA champion (1976, 1979)\n\nWhat Happened Next: Phil Verchota Phil Verchota was a football and hockey star at Duluth East High School. He was good enough that he had scholarship offers from the University of Minnesota in both sports. The aspiring defensive tackle decided to ditch football and won a pair of national championships playing for Herb Brooks with the Gophers before making the 1980 Olympic team and winning the gold medal. He returned as the U.S. captain at the 1984 Olympics. Verchota retired from hockey after the 1984 Olympics and went into banking, where he eventually became president of First American Bank in Willmar, Minnesota.\n\nMark Wells, Center Born: Sept. 18, 1957 (St. Clair Shores, Michigan) High school: Lake Shores High School (St. Clair Shores, Michigan) College: Bowling Green State University\n\nCareer Highlights: Mark Wells NHL career: None Career highlights: Two-time All-CCHA (1977, 1979)\n\nWhat Happened Next: Mark Wells Mark Wells was one of two players from Bowling Green to make the 1980 Olympic team, alongside star defenseman Ken Morrow. He played two seasons of minor league hockey after winning the gold medal but never played in the NHL. Following his hockey career, Wells went to work in the restaurant industry. He suffered a catastrophic injury unloading crates that fractured his spine. After surgery, he wasn't able to work again. Wells was forced to sell his gold medal to a collector in 2010 for $40,000 to pay for living expenses. It was immediately turned around and sold for $310,000 at an auction.\n\nJim Craig, Goaltender Born: May 31, 1957 (Easton, Massachusetts) High school: Oliver Ames High School (Easton, Massachusetts) College: Boston University\n\nCareer Highlights: Jim Craig NHL career: Atlanta Flames (1979-80), Boston Bruins (1980-81), Minnesota North Stars (1983-84) Career highlights: NCAA champion (1978), NCAA All-American (1979)\n\nWhat Happened Next: Jim Craig After Mike Eruzione, goaltender Jim Craig is perhaps the most well-known player from the 1980 Olympic team. His heroic performance in the semifinals and finals went down as one of the best performances by a goalie in Olympic history. Craig played three seasons in the NHL and was charged with \"driving to endanger\" after a crash on a rural Massachusetts highway left one woman dead and another critically injured in 1982. He was eventually found not guilty after waiving his right to a jury trial and going directly before a judge.\n\nMike Eruzione, Left Wing Born: Oct. 25, 1954 (Winthrop, Massachusetts) High school: Winthrop High School (Winthrop, Massachusetts) College: Boston University\n\nCareer Highlights: Mike Eruzione NHL career: None Career highlights: IHL Rookie of the Year (1978), IHL Turner Cup champion (1978)\n\nWhat Happened Next: Mike Eruzione The most famous player on the 1980 U.S. Olympic hockey team, team captain Mike Eruzione was once described by Ringer podcast host Bill Simmons as \"America's houseguest.\" It was an apt description of the Massachusetts native and former Boston University star who scored the game-winning goal against the Soviet Union. Eruzione played one season in the IHL and one season in the AHL before the Olympics, but went undrafted by the NHL and never played professionally after the gold medal. What has Eruzione done since 1980? Mostly he's made a career out of being Mike Eruzione.\n\nCraig Patrick, Assistant General Manager/Assistant Coach Born: May 20, 1946 (Detroit, Michigan) Career highlights: Olympic gold medal (1980), Olympic silver medal (2002)\n\nWhat Happened Next: Craig Patrick Craig Patrick played eight seasons in the NHL and was still competing for the U.S. into his mid-30s before retiring in 1979, when he moved into administration and coaching. He was the assistant general manager for U.S. hockey and the assistant coach for the 1980 Olympic team. Patrick was the youngest general manager in New York Rangers history before becoming the general manager of the Pittsburgh Penguins in 1989, winning two Stanley Cup championships with the team. In a crazy twist, Patrick is one of seven family members who have won Stanley Cups as players, coaches or administrators.\n\nWalter Bush, General Manager Born: Sept. 25, 1929 (Minneapolis, Minnesota) Died: Sept. 22, 2016, 86 years old (Minneapolis, Minnesota) Career highlights: U.S. Hockey Hall of Fame (1980), Hockey Hall of Fame (2000), IIHF Hall of Fame (2009)\n\nWhat Happened Next: Walter Bush Walter Bush was a builder. He helped build the Central Hockey League, was key in bringing the NHL to Minnesota with the Minnesota North Stars, and was the president of U.S. Hockey for two decades, bringing Herb Brooks in to coach the 1980 U.S. Olympic team. He also was instrumental in adding women's hockey to the U.S. roster of Olympic sports. Bush died in 2016, at 86 years old.\n\nAl Michaels, Broadcaster Born: Nov. 12, 1944 (Brooklyn, New York) Career highlights: Five-time Sports Emmy Award winner - Outstanding Sports Personality, three-time NSMA National Sportscaster of the Year, Walter Cronkite Award for Excellence in Journalism, Hollywood Walk of Fame, Television Academy Hall of Fame, Pro Football Hall of Fame Pete Rozelle Radio & Television Award (2013), Baseball Hall of Fame Ford C. Frick Award (2021)\n\nWhat Happened Next: Al Michaels Al Michaels is one of the most famous sports broadcasters of all time and called his seventh Super Bowl in 2022. None of that sentence happens without the 1980 Olympics. Michaels was the voice of the iconic broadcasting moment when the Americans beat the Soviet Union in the semifinals.\"Do you believe in miracles?! Yes!\" We've been lucky to have those velvety pipes in our lives ever since.\n\nHerb Brooks, Head Coach Born: Aug. 3, 1937 (Saint Paul, Minnesota) Died: Aug. 11, 2003, 66 years old (Forest Lake, Minnesota) Career highlights: Olympic gold medalist (1980), Olympic silver medalist (2002), three-time NCAA national champion (1974, 1976, 1979)"}, {"url": "https://basketballnoise.com/who-won-the-nba-championship-in-1994-and-1995/", "page_content": "The 1993-94 NBA season was without a doubt one of most peculiar seasons in the league’s history for a number of reasons. Chief among them was the void that then three-time NBA Champion, Michael Jordan, left after the three-time NBA Finals MVP unceremoniously retired from the league following a personal tragedy that prompted the Chicago Bulls star to take a temporary hiatus from the sport that had become synonymous with him.\n\nWho won the NBA Championship in 1994 and 1995? The Houston Rockets won the NBA Championship in 1994 and 1995. The Rockets were led by Hakeem Olajuwon.\n\nIn His Airness’ absence, teams, especially the top contenders, scrambled on realizing that the league’s top prize was anyone’s for the taking after having firmly been in Jordan’s and the Bulls’ vice-like grip for the previous three seasons. No team capitalized on this power vacuum more than the Houston Rockets, who led by Hall of Fame center Hakeem “The Dream” Olajuwon, went on to win the 1993-94 and 1994-95 NBA World Championships against the New York Knicks and Orlando Magic respectively.\n\nBefore going ahead, we wanted you to look at some of the recommendations we’ve picked for NBA fans. These are NBA essentials that all NBA fans should have. You can check out and buy these products from the NBA Store.\n\nGrowing Pains\n\nFor many years, the Houston Rockets were at best considered a second-tier NBA team. Their fortunes however took a turn for the better after selecting highly-touted center Hakeem Olajuwon as the first pick of the 1984 NBA draft. In Olajuwon, the Rockets had identified a centerpiece worth building a championship team around and he, alongside fellow big Ralph Sampson, would form arguably the largest frontcourt duo in NBA history dubbed the “Twin Towers.”\n\nHouston’s decision to bring Hakeem onboard paid dividends immediately and after an impressive rookie season where the ex-University of Houston standout finished second in the NBA Rookie of the Year voting and an even more impressive second season, the Rockets made it to the 1986 NBA Finals where they lost to the Larry Bird-led Boston Celtics in six games.\n\nOlajuwon would continue to get better every year and lead the league in rebounds and blocks per game on numerous occasions, joining the exclusive company of NBA greats Kareem Abdul-Jabbar and Bill Walton as the only players in the league to have done so by that point. Houston would however struggle to find their footing in an ultra-competitive western conference and fail to make it past the first round in four of the five playoff appearances they made since losing to the Celtics in the 1986 NBA Finals.\n\nFrom “Choke City” to “Clutch City”\n\nBy the end of 1991-92 season, Olajuwon had admittedly become frustrated with the Rockets for a number of reasons including a bad contract that underpaid him for a player of his stature and Houston’s unwillingness to break bank and surround him with the necessary talent to get them over the hump. The Nigerian-American’s relationship with the franchise deteriorated to the point that it was rumored that the Rockets were actively pursuing a trade on account of the differences, which Olajuwon’s agent had gone on record to describe as “irreconcilable” at the time.\n\nHouston however came to their senses and rather than lose a once in a generation talent like The Dream, opted to make a coaching change by bringing in tactician Rudy Tomjanovich. The Rockets also made some much-needed adjustments to their roster. These decisions paid off and elevated both Olajuwon’s and the team’s play enabling them to set a new franchise record with 55 wins in the 1992-93 season. Houston also made it deeper into the playoffs than in previous seasons with Hakeem, who was entering his prime, finishing second in the regular season MVP voting behind Phoenix Suns legend Charles Barkley.\n\nThe Rockets started their 1993-94 campaign as one of the league’s top contenders, comfortably cruising through the regular season and securing themselves a playoff berth. Their resolve would nevertheless be tested in the second round where after having effortlessly dispatched the Portland Trailblazers 3-1, fell 0-2 to perennial conference rivals, the Phoenix Suns, earning the moniker “Choke City” from local publication The Houston Chronicle.\n\nMotivated by this blatant insult, Olajuwon and company rallied to beat the Suns in seven games earning the nickname “Clutch City” from their detractors and a date with the Utah Jazz in the conference finals, who they beat in just five games to secure their first NBA Finals appearance in almost a decade. In the finals, The Rockets lived up to their new label and after a hard-fought seven game series against the New York Knicks, who were led by point guard John Starks and Hakeem’s long-time rival Patrick Ewing, clinched their franchise’s first NBA World Championship.\n\nOlajuwon led the way with 26.9 points per game on 50% shooting and outclassed Ewing in every game to earn the NBA Finals Most Valuable Player award – the cherry on top of the championship trophy and an acknowledgment of Hakeem’s on-court brilliance.\n\nDouble Clutch\n\nIn an interview with CBS at the beginning of the 1994-95 season, Olajuwon said, “Last year, it was Clutch City. This year, if we win, it will be Double Clutch.” These prophetic words would define Houston’s mission to repeat the fete they had accomplished the previous season and they appeared on course to do just that after opening their campaign with an impressive 9-0 record.\n\nThis development inadvertently made the defending champions complacent to the point that they forgot that they had the proverbial bull’s eye on their backs. What followed was a shocking slump in which the Rockets were simply outworked by their opposition night in and night out culminating in a shocking loss to the Los Angeles Clippers, who then had the worst record in the league.\n\nRecognizing that they were at a crossroads between salvaging their season and possibly failing to even make the playoffs, coach Rudy Tomjanovich went against his initial decision to run it back with his championship-clinching squad as was then constituted and pulled off arguably the biggest trade in franchise history to bring in marksman Clyde “The Glide” Drexler mid-season from the Portland Trailblazers. This move was initially met with opposition by the old guard who felt a little betrayed after their fellow teammates were traded away for a player in Drexler who unlike them, had yet to prove he could win the big one at his former team. Only long-time friend and fellow University of Houston alum, Olajuwon, appeared sold on the breath of fresh air the shooting guard would bring.\n\nDrexler quickly put those doubts to rest and hit the ground running returning the Rockets to championship form with performance after spectacular performance. The Glide continued to silence his doubters after his fellow “Phi Slama Jama” teammate, Olajuwon, was temporary sidelined by injury by keeping the Rockets afloat en route to clinching the sixth seed with a 47-35 regular season record.\n\nThe postseason provided the Rockets an opportunity to focus on their season-long goal of winning back-to-back championships, which they seized despite facing stiff competition in the western conference. Houston first sent the Utah Jazz packing in five games after being down 2-1 after the first three games then beat the Phoenix Suns in seven games despite trailing 3-1 after four games. The underdogs would then meet top-seeded bitter rivals, the San Antonio Spurs, led by the then just-crowned regular season MVP, David Robinson, in the conference finals. Olajuwon would go on to record arguably his best performance in a playoff series and absolutely dismantle Robinson and his Spurs in six games to book their ticket back to the NBA Finals.\n\nIn the finals, the Rockets squared off against up-and-comers, the Orlando Magic, led by their young dynamic duo of center Shaquille O’Neal and playmaker Penny Hardaway. Their championship experience ultimately proved to be the deciding factor and with Olajuwon’s and Drexler’s undeniable presence coupled with timely performances from guards Kenny “The Jet” Smith, Sam Cassell and Mario Elie and forward Robert Horry, Houston beat Orlando 4-0 to clinch their second title in just as many seasons.\n\nWith the victory, the Rockets set four NBA records establishing them as one of the best teams in the league’s history. Houston became the first defending NBA champions to keep their title with a sweep and the first team to lose all their playoff home games and still advance on to the next rounds by winning all their road games.\n\nAdditionally, the two-time NBA World Champions also became the first team to bag the Larry O’Brien trophy without home-court advantage in the four playoff rounds since the NBA introduced the 16-team format in 1984 and the first team to beat four 50-win teams in a single postseason in their quest for a championship."}, {"url": "https://www.nasa.gov/centers/kennedy/about/history/timeline/80s-decade.html", "page_content": "1980s: All Eyes Focus on Space Shuttle\n\nAnna Heiney\n\nNASA's John F. Kennedy Space Center\n\nDuring the 1980s, Kennedy Space Center made a critical shift in focus. Instead of moving relatively quickly from one human spaceflight program to another, as in the fast-paced 1960s and 1970s, the spaceport's workforce and facilities now were geared toward preparing and launching a revolutionary new spacecraft that would further advance our capabilities in orbit: the space shuttle.Kennedy was tasked with the vital role of maintaining the \"processing flow\" -- refurbishing and preparing each vehicle between flights, launching it safely, ensuring the safety of orbiter and crew after landing, and returning it to Kennedy's orbiter processing facility to begin the process again. During this decade, the Kennedy team launched 32 flights of the space shuttle, then known as the Space Transportation System (STS).Commander John Young and Pilot Bob Crippen flew aboard Columbia on the Space Shuttle Program's first mission, STS-1.\"Before we did STS-1, there had been some, I guess, things going on in the (United) States that -- the morale of the United States, I don't think, was very high,\" recalled Crippen, who later served as director of Kennedy.\"It was truly a morale booster for the United States, and I was pleasantly surprised to find that it was welcomed by what I would call our allies abroad. So it was obvious that it was a big deal,\" Crippen said.As 1980 began, work already was well under way readying Columbia for the STS-1 mission, still months away. But at the same time, teams at Cape Canaveral Air Force Station were preparing for the spaceport's first NASA launch of the decade. The Solar Maximum Mission, or \"SolarMax,\" was lofted into space by a Delta rocket Feb. 14, 1980, embarking on a flight to study our sun during the peak of the solar cycle.The first launch of the space shuttle on April 12, 1981, became an iconic moment for NASA and for the nation. Columbia's launch plume was a welcome sight to the Kennedy workforce who had labored for years to reach this point. Liftoff came after a precise, on-schedule countdown.\"Everything was going good. The weather was looking good. About one minute to go, I turned to John. I said, 'I think we might really do it,' and about that time, my heart rate started to go up,\" Crippen said. \"And sure enough, the count came on down, and the main engines started. The solid rockets went off, and away we went.\"Columbia stayed aloft for two days as Young and Crippen kept busy verifying the spacecraft's systems. The final test came April 14 when the orbiter and crew completed the program's first deorbit burn, decelerated out of orbit and glided to a landing, kicking up dust as its main landing gear made contact with the dry lake bed at Edwards Air Force Base in California.The flight's success garnered worldwide attention, even intersecting with early-1980s pop culture. Canadian rock band Rush was so inspired by Columbia's first launch, the group recounted the experience in \"Countdown,\" the closing track on the trio's \"Signals\" album.MTV kicked off its first broadcast at 12:01 a.m. August 1, 1981, with footage of Columbia's countdown and liftoff, the Apollo 11 launch, then the landing on the moon as an astronaut saluted the MTV flag and a voice-over announced, \"Ladies and gentlemen: rock and roll.\"The \"firsts\" ticked by one after another as the Space Shuttle Program progressed. The STS-2 mission marked the first reuse of a space vehicle, as Columbia made its second flight. Sally Ride became the first American woman in space when she flew aboard Challenger in 1983; the next mission was the first to launch and land at night, and included the first African-American astronaut, Guion \"Guy\" Bluford. Challenger was the first orbiter to come home for landing, touching down on Kennedy's Shuttle Landing Facility in 1984 to conclude the STS-41B mission.Another major \"first\" took place on the very next flight, STS-41C, when the crew of Challenger successfully captured, repaired and redeployed the SolarMax spacecraft, prolonging its life in orbit.NASA developed the Tracking and Data Relay Satellite system in order to provide reliable communications for the space shuttle and other spacecraft in low Earth orbit. Today, a total of nine TDRS satellites have been placed in orbit, including six deployed during space shuttle missions and three carried aloft aboard Atlas IIa rockets.Kennedy kept pace as shuttle missions flew with increasing frequency, from only two flights in 1981 to nine in 1985.Then, the nation received a sharp reminder that spaceflight is never routine.Jan. 28, 1986, dawned bitterly cold. Temperatures hovered just a few degrees above freezing as space shuttle Challenger and its seven astronauts lifted off on the STS-51L mission. The flight ended just 73 seconds later when an O-ring in the right solid rocket booster failed, causing a fireball that led to the loss of the vehicle and crew: Commander Francis Scobee, Pilot Michael Smith, Mission Specialists Judith Resnik, Ellison Onizuka and Ronald McNair, and Payload Specialists Gregory Jarvis and Sharon Christa McAuliffe, a teacher.The Kennedy family grieved along with the nation. With a new center director, Forrest S. McCartney, at the helm, the workforce focused its efforts on preparing space shuttle Discovery for the next mission, STS-26. Brevard County roads were packed with spectators on Sept. 29, 1988, as Discovery lifted off on the first flight after the Challenger accident, returning the space shuttle to flight after two-and-a-half years.\"It was a privilege and honor to have been a part of the Kennedy Space Center team during the Return to Flight activities following the Challenger accident,\" McCartney said. \"The KSC shuttle workforce was a world class group of professionals that made their mark on space flight history. I will always be grateful to them for letting me join their team.\"The space shuttle paved the way for scientific research across a wide variety of disciplines, including biology and materials science. The reusable Spacelab research module, Spacelab pallet or Spacelab Multipurpose Experiment Support Structure flew in the payload bay to further expand the vehicle's capacity for in-orbit science.Kennedy closed out the 1980s as busy as ever, with five shuttle missions launched in 1989. On two of those flights, Atlantis deployed spacecraft that made a lasting impact on our understanding of our planetary neighbors: the Magellan spacecraft to Venus and the Galileo probe to Jupiter.President Ronald Reagan set the stage for the future of U.S. human spaceflight in his State of the Union address on Jan. 25, 1984, when he challenged NASA to develop an international, permanently crewed space station.\"A space station will permit quantum leaps in our research in science, communications, and in metals and lifesaving medicines which could be manufactured only in space,\" Reagan stated. \"We want our friends to help us meet these challenges and share in their benefits. NASA will invite other countries to participate so we can strengthen peace, build prosperity, and expand freedom for all who share our goals.\"The experiences and triumphs achieved at Kennedy during the 1980s helped put the agency on course to make Reagan's vision a reality in the decades to come."}, {"url": "https://elitesportsny.com/2018/01/15/new-york-arrows-nassau-coliseum-sports-dynasty/", "page_content": "The New York Arrows run of four straight Major Indoor Soccer League titles started in 1979, one year before the Islanders Stanley Cup dynasty began.\n\nWhen you think about the 43-year pre-renovation history of the Nassau Veterans Memorial Coliseum , the Islanders’ run of four straight Stanley Cups from 1979-80 through 1982-83 is certainly one of the first things that come to mind. That team was loaded with superstars like Mike Bossy, Denis Potvin, Bryan Trottier, Billy Smith, Clark Gillies and Billy Smith.\n\nBut the Islanders weren’t the only dynasty that called the Coliseum home during that era.\n\nA year before the Islanders first championship, the New York Arrows of the brand new Major Indoor Soccer League commenced play during the 1978-79 season.\n\nThe Arrows arrived on the New York area sports scene while the Cosmos were in the middle of their glory days in the original North American Soccer League playing in front of huge crowds at Giants Stadium. So the concept of soccer being played indoors on top of a hockey rink was new to local fans.\n\n“Indoor soccer at the start of the MISL was a monumental shift in the landscape of professional soccer in this country,” said former Arrows goalkeeper Shep Messing. “We had played an exhibition game in front of a sold-out crowd in Philadelphia the previous year, a USA all-star team against the Russian Army team.”\n\nAfter that successful showcase game, the Major Indoor Soccer League was born and Messing, who had previously played with the Cosmos and won a Soccer Bowl with Pele in 1977, jumped at the chance to return to New York. The league needed a name player that would help spark interest, especially in the biggest market in the country.\n\n“I became the first player signed to join the league,” recalled Messing who left the Cosmos to join the Oakland Stompers in 1978. “The Arrows meant coming home to New York after playing in Oakland and joining a new league that I believed in.”\n\nMessing was already a familiar name to local sports fans but he would soon have company in that category. The Arrows named Don Popovic as their first ever coach and he put together one of the greatest clubs in American soccer history with players like Messing, Steve Zungul and Branko Segota.\n\nThe Arrows made their debut against the Pete Rose-owned Cincinnati Kids on Dec. 22, 1978, in front of 10,386 fans at the Nassau Coliseum. With the Islanders on the precipice of being a championship team, the Arrows fit right in on Long Island and finished the regular season in second place with a record 16-8. They would go on to beat the Philadelphia Fever in the finals to win the league’s first championship.\n\nZungul quickly became the Arrows’ version of Mike Bossy with a scoring touch second to none. He was the league’s best player and an unstoppable scoring machine. Sports Illustrated would later call him “Lord Of All Indoors” and when he was on the field, you paid attention to number seven like you would have when Pele graced the outdoor pitches all over the world.\n\nHe was simply amazing.\n\n“Zungul was a gifted player with all the physical tools to become the best player ever to play in the MISL,” said Messing. “Quick, smart, left and right foot, good in the air and instinctual goal scorer.”\n\nZungul was a quiet superstar but certainly lit up the Coliseum scoreboard and was considered a great teammate. However, after that first championship win over Philadelphia, Zungul was not named the finals MVP. That honor went to Messing and Zungul was furious. In fact, things got pretty heated on the bus ride home to Long Island.\n\n“As a teammate, he was competitive beyond belief,” recalled Messing. “Zungul got into a shouting and shoving fight with me saying that he deserved the award. (He was) pretty funny, but a competitor to say the least.”\n\nZungul provided so many memorable moments for the Arrows but the most exciting was when he scored the game-winning goal in the 1981 MISL Championship Game at St. Louis. His tally with thirty seconds left stunned the crowd and gave the Arrows a 6-5 win over the Steamers for title number three.\n\nIt was one of Messing’s favorite moments along with the first championship and any road game that the Arrows played against their biggest rival.\n\n“Championship in Philly, Championship in the Checkerdome in St. Louis and every game against the Blast in Baltimore,” said Messing regarding the moments he will remember most.\n\nMessing also cherishes the fact that he had Popovic as his head coach. He was to the Arrows what General Manager Bill Torrey and Head Coach Al Arbour were to the Islanders. He was the architect and leader of one of the greatest soccer teams ever assembled.\n\n“Don Popovic was a genius and the perfect man to lead the Arrows to four consecutive MISL championships,” said Messing.” “He understood the game and created systems to benefit from the rules including changing players on the fly.”\n\nThe nucleus of the Arrows was mainly intact during their run of four straight MISL titles but they also tweaked the roster each year. After the second title, the Arrows were fortunate to add a gifted forward in Frantz St. Lot, now an assistant men’s soccer coach at NYIT on Long Island. A veteran of the NASL, the talented Haitian was excited to join what was already a championship club.\n\nHe also had a feeling that the NASL wasn’t going to be around much longer.\n\n“I knew the league was going to be going under because the money that I wanted I couldn’t get it, said St. Lot. “Coach Popovic spoke with my agent and the next thing you know he says listen they are very very interested in you to play for the New York Arrows. That team was one of the best teams that money can buy.”\n\nThe Arrows also would hire a former Cosmos executive who actually tried to get the two local championship soccer teams to square off against each other.\n\nIn 1981, Krikor Yepremian, the brother of former NFL kicker Garo Yepremian, resigned as the Cosmos Vice-President and General Manager and a week later joined the Arrows as President and General Manager. After Yepremian joined the Arrows, there was a proposal made for the two local clubs to play a home and home series, one game at the Nassau Coliseum and one game on Cosmos turf, presumably at the Meadowlands Arena.\n\n“We challenged them,” said St. Lot. “If they want to play us, we got the building. We could play one game at home and one away. There was no response to that.”\n\nThe Cosmos would eventually dabble in the indoor game but there was never a head to head matchup with the Arrows who simply focused on winning games and championships. They combined with the Islanders to spoilsports fans on Long Island with eight titles over a five-season period between 1979 and 1983.\n\nWhile the Coliseum was known as “Fort Neverlose” because of the Islanders’ success there, you could have said the same thing about the Arrows time in the barn. It’s not often that two sports teams playing in the same building can enjoy so much success at the same time.\n\nBut the Arrows and Islanders enjoyed dynasties at just about the same time.\n\n“In that building, what we achieved and what the Islanders achieved I don’t think there could ever be two championship teams like this ever,” said St. Lot.\n\nOne of the neat things about that era was that you could see players from both teams out and about in the community. You might be having dinner at a restaurant and see one of the players from either team or you might run into one of them just walking down the street because they might have lived in your neighborhood.\n\nAs it turns out, the Arrows and Islanders spent some time interacting with fans in the community but also the players from both teams did so much winning and shared so much in common that they forged plenty of friendships along the way.\n\n“The Islanders and Arrows dominating at the Nassau Coliseum those years was one of the greatest times for Long Island pro sports,” said Messing. “I became friendly and trained with many of those great Islanders like (Bryan) Trottier, (Mike) Bossy, (Clark) Gillies, (Bobby) Nystrom, and Billy Smith. Several of us competed in the ABC “Superstars” competition in the Bahamas after the season and some of those friendships are lasting today.”\n\nOverall, the Arrows played six seasons in the Major Indoor Soccer League, but their last two campaigns weren’t nearly as successful as the first four.\n\nAfter the fourth championship in 1982, the team was sold and then in January of 1983, the cash-strapped franchise traded Zungul to the San Jose Earthquakes. The Arrows finished in fourth place during their final two seasons and they folded in 1984.\n\nTwo years later, indoor soccer returned to the Coliseum for the 1986-87 MISL season with the expansion New York Express. Shep Messing was a co-owner of that club and he also played but the Express didn’t produce the same magic as the Arrows. They began the season 0-10 and they were 3-23 when they folded at the All-Star break because of financial problems.\n\nOver three decades later, maybe it’s time to give indoor soccer another shot on Hempstead Turnpike.\n\n“I would be the happiest person,” said St. Lot. “I would love to see soccer get back.”\n\nIt’s not crazy to think it could happen.\n\nAfter the Islanders left the Coliseum for Brooklyn in 2015, the old barn went through a massive renovation and the arena reopened in April 2017 as “NYCB Live, home of the Nassau Veterans Memorial Coliseum. The renovated Coliseum has hosted concerts and family shows, Long Island Nets basketball games, one Islanders pre-season game, college basketball and college hockey.\n\nThere’s been some chatter about the Islanders returning to play some if not all of their games over the next few seasons while the Belmont Park Arena is built. It’s also possible that an AHL franchise eventually calls the Coliseum home and there are rumors of an Indoor Lacrosse team coming to Long Island.\n\nIf Messing has his way, there will be another indoor soccer team as well.\n\n“I am still looking to resurrect an indoor pro team on Long Island,” said Messing. “Stay tuned.”\n\nIndoor soccer is just the type of sport that could work at NYCB Live. It would be affordable family entertainment and the sport is already part of the Coliseum’s DNA. If and when a new team arrives, it would be cool to have a retro night to honor the Arrows and maybe even retire a few numbers like “Messing-1,” “Zungul-7,” and “Segota-20.”\n\nHere’s hoping the rocket red ball or any color soccer ball eventually makes its way back to the Coliseum."}, {"url": "https://www.stadiumtalk.com/s/most-nba-playoff-games-a76699fe36cc4e3a", "page_content": "Most Playoff Games in NBA History These players delivered the goods in the postseason.\n\nMost Playoff Games in NBA History There's a big difference between the regular season and playoffs in the NBA. Every possession is magnified in the postseason, and the pressure mounts each game. Some players rise to the challenge and win championships. But it takes more than superstars to get rings in the NBA. The franchises that rack up titles have strong role players on the roster and household names. These players played the most playoff games in NBA history and almost always delivered the goods. They have the glory to prove it.\n\n30. Al Horford — 167 Playoff Games (Tie) Position: Power Forward College: Florida NBA career: 16 seasons (2007-present) Teams: Atlanta Hawks (2007-16), Boston Celtics (2016-19, 2021-present), Philadelphia 76ers (2019-20), Oklahoma City Thunder (2020-21) Height/weight: 6-foot-9, 240 pounds Career highlights: Five-time NBA All-Star (2010, 2011, 2015. 2016. 2018), All-NBA Team (2011), NBA All-Defensive Team (2018), NBA All-Rookie Team (2008), Five-time NBA All-Star (2010, 2011, 2015. 2016. 2018), All-NBA Team (2011), NBA All-Defensive Team (2018), NBA All-Rookie Team (2008) Bottom line: Al Horford has been a steadying presence for NBA teams over the last 20 years. Horford, the son of former NBA forward Tito Horford, has been in the postseason with every team he's played on except the one season he spent with the Oklahoma City Thunder in 2020-21. One thing still missing for Horford? An NBA championship.\n\n30. Sam Perkins — 167 Playoff Games (Tie) Sam Perkins, right, is one of the few players on this list to never win an NBA title. Position: Forward/center College: North Carolina NBA career: 17 seasons (1984-2001) Teams: Dallas Mavericks (1984-90), Los Angeles Lakers (1990-93), Seattle SuperSonics (1993-98), Indiana Pacers (1998-2001) Height/weight: 6-foot-9, 235 pounds Career highlights: NBA All-Rookie Team (1985) Bottom line: Sam Perkins had game. Part of the legendary NCAA championship team at North Carolina in 1982 alongside James Worthy and Michael Jordan, \"Big Smooth\" was snakebit when it came to winning a title in the NBA. Perkins played in the NBA for 17 seasons and and made it to the playoffs 15 times, averaging double figures in points in 12 postseasons. He made the NBA Finals three times, with three different teams, but lost each time.\n\n29. Michael Cooper — 168 Playoff Games Michael Cooper won five NBA titles with the Los Angeles Lakers. Position: Shooting guard College: New Mexico NBA career: 12 seasons (1978-90) Teams: Los Angeles Lakers Height/weight: 6-foot-5, 175 pounds Career highlights: Five-time NBA champion (1980, 1982, 1985, 1987, 1988), NBA Defensive Player of the Year (1987), eight-time All-NBA Defensive Team (1981-88) Bottom line: Michael Cooper found the perfect fit with the Los Angeles Lakers after an All-American career at the University of New Mexico. He carved out a role as a defensive stopper on some of the greatest teams in NBA history, making eight All-NBA Defensive Teams and being named NBA Defensive Player of the Year in 1987. He also could score when needed and was on the receiving end of many Magic Johnson alley-oop passes during the Showtime era, making the Coop-a-Loop world-famous.\n\n26. Danny Green — 169 Playoff Games (Tie) Position: Shooting guard/small forward College: North Carolina NBA career: 14 seasons (2009-present) Teams: Cleveland Cavaliers (2009-10, 2023-present), San Antonio Spurs (2010-18), Toronto Raptors (2018-19), Los Angeles Lakers (2019-20), Philadelphia 76ers (2020-22), Memphis Grizzlies (2022-23), Cleveland Cavaliers (2023-present) Height/weight: 6-foot-6, 215 pounds Career highlights: Three-time NBA champion (2014, 2019, 2020), NBA All-Defensive Team (2017) Bottom line: Danny Green is one of the biggest winners in basketball history over the last 20 years, first winning an NCAA championship at North Carolina before embarking on a 14-year NBA career that has seen him win three NBA championships with three different teams. Green has never been a passive bystander on those championships and was a key player for the San Antonio Spurs in 2014, Toronto Raptors in 2019 and the Los Angeles Lakers in 2020.\n\n26. Kevin McHale — 169 Playoff Games (Tie) Kevin McHale was named to the NBA's 50th Anniversary Team. Position: Power forward College: Minnesota NBA career: 13 seasons (1980-93) Teams: Boston Celtics Height/weight: 6-foot-10, 210 pounds Career highlights: Three-time NBA champion (1981, 1984, 1986), seven-time NBA All-Star (1984, 1986-91), All-NBA (1987), six-time All-NBA Defensive Team (1983, 1986-90), two-time NBA Sixth Man of the Year (1984, 1985), NBA All-Rookie Team (1981), NBA 50th Anniversary Team Bottom line: Kevin McHale's moves in the post were so hard to stop that opponents called guarding him \"The Torture Chamber.\" He was a key piece on three NBA championship teams for the Boston Celtics in the 1980s. McHale also was one of the NBA's greatest defensive players during his era, making the All-NBA Defensive Team six times.\n\n26. Dennis Rodman — 169 Playoff Games (Tie) Dennis Rodman, left, was one of the greatest defensive players and rebounders in NBA history. Position: Power forward College: Southeastern Oklahoma State NBA career: 14 seasons (1986-2000) Teams: Detroit Pistons (1986-93), San Antonio Spurs (1993-95), Chicago Bulls (1995-98), Los Angeles Lakers (1999), Dallas Mavericks (2000) Height/weight: 6-foot-7, 228 pounds Career highlights: Five-time NBA champion (1989, 1990, 1996-98), two-time NBA All-Star (1990, 1992), two-time NBA Defensive Player of the Year (1990, 1991), two-time All-NBA (1992, 1995), eight-time NBA All-Defensive Team (1989-96) Bottom line: Dennis Rodman is one of the greatest defensive players in NBA history and one of the greatest rebounders of all time as well. That success extended to the postseason, where he first made his mark with the Detroit Pistons on the infamous \"Bad Boys\" teams that won back-to-back NBA titles in 1989 and 1990. Rodman one-upped that by joining the Bulls and winning three straight NBA titles from 1996 to 1998.\n\n24. Horace Grant — 170 Playoff Games (Tie) Horace Grant, right, was drafted No. 10 overall by the Chicago Bulls in 1987. Position: Power forward College: Clemson NBA career: 15 seasons (1987-2002) Teams: Chicago Bulls (1987-94), Orlando Magic (1994-99, 2001-02), Seattle SuperSonics (1999-2000), Los Angeles Lakers (2000-01, 2003-04), Orlando Magic (2001-02) Height/weight: 6-foot-10, 215 pounds Career highlights: Four-time NBA champion (1991-93, 2001), NBA All-Star (1994), four-time NBA All-Defensive Team (1993-96) Bottom line: One of the greatest NBA drafts of all time for any single franchise came in 1987 when the Chicago Bulls selected Horace Grant and traded for draft pick Scottie Pippen — two players who were cornerstones for their dynasty in the 1990s. Grant won three titles with the Bulls in the early 1990s, had playoff success with the Orlando Magic and won another title with the Lakers in 2001.\n\n24. Paul Pierce — 170 Playoff Games (Tie) Paul Pierce should have been nominated for an Emmy for Best Actor for his histrionics in the 2008 NBA Finals. Position: Small forward College: Kansas NBA career: 19 NBA career (1998-2017) Teams: Boston Celtics (1998-2013), Brooklyn Nets (2013-14), Washington Wizards (2014-15), Los Angeles Clippers (2015-17) Height/weight: 6-foot-7, 235 pounds Career highlights: NBA champion (2008), NBA Finals MVP (2008), 10-time NBA All-Star (2002-06), four-time All-NBA (2002, 2003, 2008, 2009), NBA All-Rookie Team (1999) Bottom line: Paul Pierce had one of the best nicknames in NBA history — \"The Truth.\" And no one in the NBA had more of a green light than him during his first decade in the league. The biggest reason for that was the Celtics didn't surround Pierce with very much talent early in his career. When they did, he thrived. Pierce teamed with Ray Allen and Kevin Garnett to win the 2008 NBA title, bringing home Finals MVP honors.\n\n23. Ray Allen — 171 Playoff Games Ray Allen was one of the greatest shooters to ever step on a basketball court. Position: Shooting guard College: Connecticut NBA career: 18 seasons (1996-2014) Teams: Milwaukee Bucks (1996-2003), Seattle SuperSonics (2003-07), Boston Celtics (2007-12), Miami Heat (2012-14) Height/weight: 6-foot-5, 205 pounds Career highlights: Two-time NBA champion (2008, 2013), 10-time NBA All-Star (2000-02, 2004-09, 2011), two-time All-NBA (2005, 2011), NBA All-Rookie Team (1997) Bottom line: Ray Allen's jump shot was truly a work of art and made him one of the greatest 3-point shooters in NBA history. The reason Allen wound up with so many misses was because he had the absolute green light to put up shots on any team he was on. His corner 3-pointer against the San Antonio Spurs in Game 6 of the 2013 NBA Finals is one of the most clutch shots in NBA history.\n\n22. John Havlicek — 172 Playoff Games John Havlicek, with ball, was one of the greatest winners in the history of North American professional sports. Position: Guard/forward College: Ohio State NBA career: 16 seasons (1962-78) Teams: Boston Celtics Height/weight: 6-foot-5, 203 pounds Career highlights: Eight-time NBA champion (1963-1966, 1968, 1969, 1974, 1976), NBA Finals MVP (1974), 13-time NBA All-Star (1966-78), 11-time All-NBA (1964, 1966, 1968-76), NBA All-Rookie Team (1963), NBA 50th Anniversary Team Bottom line: John Havlicek was the first true swingman in NBA history — a player who was indistinguishable from a guard or a forward because he did everything on the floor for both positions. His eight NBA titles trail only teammates Bill Russell and Sam Jones for the most in league history, and he also won an NCAA title playing for Ohio State in 1960.\n\n19. Andre Iguodala — 166 Playoff Games (Tie) Andre Iguodala shocked the world when he was named NBA Finals MVP in 2015. Position: Small forward/shooting guard College: Arizona NBA career: 19 seasons (2004-present) Teams: Philadelphia 76ers (2004-12), Denver Nuggets (2012-13), Golden State Warriors (2013-19, 2021-present), Miami Heat (2020-21) Height/weight: 6-foot-6, 215 pounds Career highlights: Four-time NBA champion (2015, 2017, 2018, 2022), NBA Finals MVP (2015), NBA All-Star (2012), two-time NBA All-Defensive Team (20111, 2014), NBA All-Rookie Team (2005) Bottom line: Andre Iguodala has played almost two decades in the NBA, and when his career is over, it'll be his play in the postseason that people point to first as the biggest part of his legacy. Iguodala caught lightning in a bottle with the Golden State Warriors, where he has won four NBA titles and played in the NBA Finals six times, including winning NBA Finals MVP in 2015. Iguodala made it back to the NBA Finals in 2020 with the Miami Heat.\n\n19. Rasheed Wallace — 177 Playoff Games (Tie) Rasheed Wallace, right, was a force on the basketball court. Position: Power forward College: North Carolina NBA career: 18 seasons (1995-2013) Teams: Washington Bullets (1995-96), Portland Trail Blazers (1996-2004), Atlanta Hawks (2004), Detroit Pistons (2004-09), Boston Celtics (2009-10), New York Knicks (2012-13) Height/weight: 6-foot-10, 230 pounds Career highlights: NBA champion (2004), four-time NBA All-Star (2000, 2001, 2006, 2008), NBA All-Rookie Team (1996) Bottom line: Rasheed Wallace might be a surprising name to see on this list, but he played in 14 postseasons and made the NBA Finals twice, winning once with the Detroit Pistons in 2004. Wallace set the NBA record for technical fouls in a single season with 41 in 2000-01, but he was much more than a hothead with a quick fuse. He had an all-around game and great basketball IQ and became something of an elder statesman for teams in the second half of his career.\n\n19. Dwyane Wade — 177 Playoff Games (Tie) Dwyane Wade was named NBA Finals MVP in 2006. Position: Shooting guard College: Marquette NBA career: 15 seasons (2003-18) Teams: Miami Heat (2003-16, 2018-19), Chicago Bulls (2016-17), Cleveland Cavaliers (2017-18) Height/weight: 6-foot-4, 224 pounds Career highlights: Three-time NBA champion (2006, 2012, 2013), NBA Finals MVP (2006), 13-time NBA All-Star (2005-16, 2019), eight-time All-NBA (2005-07, 2009-13) Bottom line: Dwyane Wade is one of the greatest NBA players of all time, making the All-Star team 13 times in 15 seasons and winning three NBA titles with the Miami Heat. Wade won NBA Finals MVP in 2006 teamed with Shaquille O'Neal, then paired up with LeBron James and Chris Bosh to win two more NBA titles in 2012 and 2013.\n\n18. Michael Jordan — 179 Playoff Games Michael Jordan commissioned a documentary called \"The Last Dance\" that was simply wonderful. Position: Shooting guard College: North Carolina NBA career: 14 seasons (1984-93, 1995-98, 2001-03) Teams: Chicago Bulls (1984-1993, 1995-1998), Washington Wizards (2001-2003) Height/weight: 6-foot-6, 210 pounds Career highlights: Six-time NBA champion (1991-93, 1996-98), six-time NBA Finals MVP (1991-93, 1996-98), five-time NBA MVP (1988, 1991, 1992, 1996, 1998), 14-time NBA All-Star (1985-93, 1996-98, 2002, 2003), three-time NBA All-Star Game MVP (1988, 1996, 1998), 11-time All-NBA (1985, 1987-93, 1996-98), NBA Defensive Player of the Year (1988), nine-time All-NBA Defensive Team (1988-93, 1996-98), NBA Rookie of the Year (1985) Bottom line: Michael Jordan was a scoring machine his entire career, but in the first six NBA career of his career, almost every offensive possession for the Chicago Bulls ran through His Airness. When Jordan started shooting less and getting his teammates involved more, the Bulls were unstoppable and won six NBA titles. Jordan's playoff games total was impacted somewhat by missing one entire postseason in his prime to play professional baseball.\n\n17. Dennis Johnson — 180 Playoff Games Dennis Johnson died of a heart attack in 2007. Position: Guard College: Pepperdine NBA career: 14 seasons (1976-90) Teams: Seattle SuperSonics (1976-80), Phoenix Suns (1980-83), Boston Celtics (1983-90) Height/weight: 6-foot-4, 185 pounds Career highlights: Three-time NBA champion (1979, 1984, 1986), five-time NBA All-Star (1979-82, 1985), two-time All-NBA (1980, 1981), nine-time All-NBA Defensive Team (1979-87) Bottom line: Dennis Johnson was known as a troublemaker during his time in college and the early part of his NBA career — but he was also known as a winner. Johnson won an NBA championship with the Phoenix Suns in 1979 and then two more with the Boston Celtics in the mid-1980s as a reliable veteran. Johnson, who died of a heart attack in 2007, was also one of the greatest defensive players in NBA history.\n\n16. John Stockton — 182 Playoff Games John Stockton is the NBA's all-time leader in assists. Position: Point guard College: Gonzaga NBA career: 19 seasons (1984-2003) Teams: Utah Jazz Height/weight: 6-foot-1, 170 pounds Career highlights: 10-time NBA All-Star (1989-97, 2000), NBA All-Star Game MVP (1993), 11-time All-NBA (1988-97, 1999), five-time All-NBA Defensive Team (1989, 1991, 1992, 1995, 1997), NBA 50th Anniversary Team Bottom line: John Stockton played his entire NBA career with the Utah Jazz, teaming with power forward Karl Malone to lead the team to the only two NBA Finals appearances in franchise history. Stockton owns two NBA records by large margins that could never be broken — career assists (15,806) and steals (3,265). He also was a member of the famed 1992 U.S. Olympic Dream Team.\n\n15. Byron Scott — 183 Playoff Games Byron Scott missed the NBA playoffs just once in 14 seasons. Position: Shooting guard College: Arizona State NBA career: 14 seasons (1983-97) Teams: Los Angeles Lakers (1983-93, 1996-97), Indiana Pacers (1993-95), Vancouver Grizzlies (1995-96) Height/weight: 6-foot-4, 205 pounds Career highlights: Three-time NBA champion (1985, 1987, 1988), NBA All-Rookie Team (1984) Bottom line: Byron Scott won three NBA titles in his first five seasons in the league, all with the Los Angeles Lakers. He only missed the playoffs once in 14 seasons, during his one season with the Vancouver Grizzlies in 1995-96. Scott was also an NBA head coach for 15 seasons, making the NBA Finals in two of his first three seasons with the New Jersey Nets.\n\n14. Robert Parish — 184 Playoff Games The Boston Celtics got Robert Parish in one of the all-time draft heists in NBA history. Position: Power forward College: Centenary NBA career: 21 seasons (1976-97) Teams: Golden State Warriors (1976-80), Boston Celtics (1980-94), Charlotte Hornets (1994-96), Chicago Bulls (1996-97) Height/weight: 7-foot-1, 230 pounds Career highlights: Four-time NBA champion (1981, 1984, 1986, 1997), nine-time NBA All-Star (1981-87, 1990, 1991), two-time All-NBA (1982, 1989), NBA 50th Anniversary Team Bottom line: Robert Parish's 1,611 career games are the most in NBA history, and he was also at the center of one of the greatest trades in NBA history. Celtics president Red Auerbach swapped his No. 1 overall pick in 1980 for Parish and the No. 3 overall pick. The Warriors took all-time draft bust Joe Barry Carroll No. 1, and the Celtics took Hall of Famer Kevin McHale at No. 3. Parish, also known \"The Chief,\" and McHale and company in Boston then helped the Celtics win three NBA titles in the 1980s.\n\n13. Magic Johnson — 190 Playoff Games Magic Johnson could do anything with a basketball. Position: Point guard College: Michigan State NBA career: 13 seasons (1978-91, 1996) Teams: Los Angeles Lakers Height/weight: 6-foot-9, 220 pounds Career highlights: Five-time NBA champion (1980, 1982, 1985, 1987, 1988), three-time NBA Finals MVP (1980, 1982, 1987), three-time NBA MVP (1987, 1989, 1990), 12-time NBA All-Star (1980, 1982-92), two-time NBA All-Star Game MVP (1990, 1992), 10-time All-NBA (1982-91), NBA All-Rookie Team (1980), NBA 50th Anniversary Team Bottom line: Magic Johnson is many things. The greatest point guard of all time. One of the most exciting, dynamic players in NBA history. And a global sports icon. Magic's rivalry with Boston Celtics forward Larry Bird, which started in the 1979 NCAA championship game between Michigan State and Indiana State put the NBA on the path to becoming the global behemoth it is today, generating approximately $8 billion in revenue annually.\n\n11. Karl Malone — 193 Playoff Games (Tied) Karl Malone, left, never won an NBA title. Position: Power forward College: Louisiana Tech NBA career: 19 seasons (1985-2004) Teams: Utah Jazz (1985-2003), Los Angeles Lakers (2003-04) Height/weight: 6-foot-9, 250 pounds Career highlights: Two-time NBA MVP (1997, 1999), 14-time NBA All-Star (1988-98, 2000-02), two-time NBA All-Star Game MVP (1989, 1993), 14-time All-NBA (1988-2001), four-time All-NBA Defensive Team (1988, 1997-99), NBA All-Rookie Team (1986) Bottom line: Karl Malone had the great luck of spending almost his entire career playing alongside point guard John Stockton, a player who could create offense for other players in a variety of ways. Stockton was a perfect complement to the hard-running Malone, who was almost impossible to stop with a head of steam. But Malone, like Stockton, never won an NBA title, losing to the Chicago Bulls in back-to-back seasons in 1997 and 1998.\n\n11. Danny Ainge — 193 Playoff Games (Tied) Danny Ainge played three seasons in the majors before deciding to switch sports and play in the NBA. Position: Shooting guard College: BYU NBA career: 14 seasons (1981-95) Teams: Boston Celtics (1981-89), Sacramento Kings (1989-90), Portland Trail Blazers (1990-92), Phoenix Suns (1992-95) Height/weight: 6-foot-5, 190 pounds Career highlights: Two-time NBA champion (1984, 1986), NBA All-Star (1988) Bottom line: No player in NBA history had the ability to get underneath the skin of his opponents like Danny Ainge. The shooting guard won two NBA titles with the Boston Celtics and played in the NBA Finals two more times with the Portland Trail Blazers and Phoenix Suns. Ainge actually played three years of Major League Baseball with the Toronto Blue Jays before deciding to switch sports and play in the NBA.\n\n10. Scottie Pippen — 208 Playoff Games Scottie Pippen was the NBA's equivalent of Robin to Michael Jordan's Batman. Position: Small forward College: Central Arkansas NBA career: 17 seasons (1987-2004) Teams: Chicago Bulls (1987-98, 2003-04), Houston Rockets (1998-99), Portland Trail Blazers (1999-2003) Height/weight: 6-foot-8, 228 pounds Career highlights: Six-time NBA champion (1991-93, 1996-98) Bottom line: The perfect complement to Michael Jordan during the Chicago Bulls dynasty of the 1990s, Scottie Pippen was also one of the greatest defensive players in NBA history. Pippen and Jordan's Batman and Robin routine produced six championships in nine full NBA seasons together. The run cemented both players as two of the greatest of all time.\n\n9. Shaquille O'Neal — 216 Playoff Games Why was Shaquille O'Neal guarding Hakeem Olajuwon out at the three-point line? Position: Center College: LSU NBA career: 19 seasons (1992-2011) Teams: Orlando Magic (1992-96), Los Angeles Lakers (1996-2004), Miami Heat (2004-08), Phoenix Suns (2008-09), Cleveland Cavaliers (2009-10), Boston Celtics (2010-11) Height/weight: 7-foot-1, 325 pounds Career highlights: Four-time NBA champion (2000-02, 2006), three-time NBA Finals MVP (2000-02), NBA Most Valuable Player (2000), 15-time NBA All-Star (1993-98, 2000-07, 2009), three-time NBA All-Star Game MVP (2000, 2004, 2009), 14-time All-NBA (1994-2006, 2009), three-time All-NBA Defensive Team (2000, 2001, 2003), NBA Rookie of the Year (1993), NBA 50th Anniversary Team Bottom line: Shaquille O'Neal was one of the most dominant players in NBA history. The behemoth center teamed up with Kobe Bryant to win three consecutive NBA titles from 2000 to 2002 and got another title with Dwyane Wade and the Miami Heat in 2006. O'Neal captured one NBA MVP trophy in his career, in 2000, and also won three consecutive NBA Finals MVP trophies.\n\n8. Manu Ginobili — 218 Playoff Games Manu Ginobili didn't play in the NBA until he was 25 years old. Position: Shooting guard College: None NBA career: 16 seasons (2002-18) Teams: San Antonio Spurs Height/weight: 6-foot-6, 205 pounds Career highlights: Four-time NBA champion (2003, 2005, 2007, 2014), two-time NBA All-Star (2005, 2011), two-time All-NBA (2008, 2011), NBA Sixth Man of the Year (2008), NBA All-Rookie Team (2003) Bottom line: Manu Ginobili's career playoff games total would be much higher had he not played the first seven seasons of his career overseas. Ginobili was a sensation once he joined the NBA in 2002, at 25 years old, winning three NBA titles in his first five seasons with the San Antonio Spurs.\n\n7. Kobe Bryant — 220 Playoff Games Kobe Bryant died in a helicopter accident on Jan. 26, 2020. Position: Shooting guard College: None NBA career: 20 seasons (1996-2016) Teams: Los Angeles Lakers Height/weight: 6-foot-6, 212 pounds Career highlights: Five-time NBA champion (2000-02, 2009, 2010), two-time NBA Finals MVP 2009, 2010), NBA MVP (2008), 18-time NBA All-Star (1998, 2000-16), four-time NBA All-Star Game MVP (2002, 2007, 2009, 2011), 15-time All-NBA (1999-2013), 12-time NBA All-Defensive Team (2000-04, 2006-12) Bottom line: The late Kobe Bryant's legacy was defined by him being a winner. He won five NBA titles in 20 seasons. He also missed the playoffs five times. In the final game of his career, Bryant scored 60 points on 22-of-50 shooting in a 101-96 win over the Utah Jazz, including 10-of-12 from the free-throw line and 6-of-21 from beyond the three-point arc.\n\n6. Tony Parker — 226 Playoff Games Tony Parker started playing professional basketball in France when he was 17 years old. Position: Point guard College: None NBA career: 18 seasons (2001-19) Teams: San Antonio Spurs (2001-18), Charlotte Hornets (2018-19) Height/weight: 6-foot-2, 185 pounds Career highlights: Four-time NBA champion (2003, 2005, 2007, 2014), NBA Finals MVP (2007), six-time NBA All-Star (2006, 2007, 2009, 2012-14), four-time All-NBA (2009, 2012-14), NBA All-Rookie Team (2002) Bottom line: Tony Parker played two seasons of professional basketball in his native France before joining the San Antonio Spurs in 2001 at just 19 years old. Parker never missed a postseason in 17 seasons with the Spurs and won four NBA championships, earning NBA Finals MVP in 2007. Parker was also married to the Spurs' greatest celebrity fan of all time, actress Evan Longoria, from 2007 to 2010.\n\n5. Kareem Abdul-Jabbar — 237 Playoff Games Kareem Abdul-Jabbar won his first NBA title with the Milwaukee Bucks. Position: Center College: UCLA NBA career: 20 seasons (1969-1989) Teams: Milwaukee Bucks (1969-1975), Los Angeles Lakers (1975-1989) Height/weight: 7-foot-2, 225 pounds Career highlights: Six-time NBA champion (1971, 1980, 1982, 1985, 1987, 1988), two-time NBA Finals MVP (1971, 1985), six-time NBA MVP (1971, 1972, 1974, 1976, 1977, 1980), 19-time NBA All-Star (1970-77, 1979-89), 15-time All-NBA (1970-74, 1976-81, 1983-86), 11-time All-NBA Defensive Team (1970, 1971, 1974-81, 1984), NBA Rookie of the Year (1970), NBA 50th Anniversary Team Bottom line: Kareem Abdul-Jabbar made the playoffs in 18 out of his 20 seasons. The two seasons he missed were inexplicably in his prime and in back-to-back years — his last season with the Milwaukee Bucks and first season with the Los Angeles Lakers. Abdul-Jabbar won six NBA titles to go with three NCAA championships at UCLA and is the NBA's career leading scorer with 38,387 points.\n\n4. Robert Horry — 244 Playoff Games Robert Horry hit a lot of big shots in his career. Position: Forward College: Alabama NBA career: 16 seasons (1992-2008) Teams: Houston Rockets (1992-96), Phoenix Suns (1996-97), Los Angeles Lakers (1997-2003), San Antonio Spurs (2003-08) Height/weight: 6-foot-9, 240 pounds Career highlights: Seven-time NBA champion (1994, 1995, 2000-02, 2005, 2007), All-NBA Rookie Team (1993) Bottom line: No player in NBA history — not a single one — has built their reputation on the ability to hit clutch shots more than Robert Horry, who won seven NBA titles with three different teams in 16 seasons. Horry first established himself as \"Big Shot Rob\" on back-to-back title teams with the Rockets, three consecutive titles with the Lakers and two more titles, just for good measure, to close out his career with the Spurs.\n\n3. Tim Duncan — 251 Playoff Games Tim Duncan's nickname was \"The Big Fundamental,\" and it was very fitting. Position: Forward/center College: Wake Forest NBA career: 19 seasons (1997-2016) Teams: San Antonio Spurs Height/weight: 6-foot-11, 250 pounds Career highlights: Five-time NBA champion (1999, 2003, 2005, 2007, 2014), three-time NBA FInals MVP (1999, 2003, 2005), two-time NBA MVP (2002, 2003), 15-time NBA All-Star (1998, 2000-11, 2013, 2015), 15-time All-NBA (1998-2009, 2013), 15-time NBA All-Defensive Team (1998-2010, 2013, 2015), NBA Rookie of the Year (1998) Bottom line: Arguably the greatest power forward in NBA history, Tim Duncan won five NBA titles with the Spurs in his 19-year career. Duncan's offensive workload was made much easier to bear with the addition of guards Tony Parker and Manu Ginobili, and Duncan's 50.6 career field-goal percentage speaks to his efficiency. That the Spurs never missed the playoffs once with Duncan speaks to his greatness.\n\n2. Derek Fisher — 259 Playoff Games Derek Fisher won five NBA titles with the Los Angeles Lakers. Position: Point guard College: Central Arkansas NBA career: 18 seasons (1996-2014) Teams: Los Angeles Lakers (1996-2004, 2007-12), Golden State Warriors (2004-06), Utah Jazz (2006-07), Oklahoma City Thunder (2012, 2013-14), Dallas Mavericks (2012) Height/weight: 6-foot-1, 200 pounds Career highlights: Five-time NBA champion (2000-02, 2009, 2010) Bottom line: The term \"glue guy\" seems to have been in part defined by Derek Fisher's 18-year NBA career, one in which he played in the NBA Finals eight times and won five championships. Fisher's career numbers are not that impressive — 8.3 points, 2.1 rebounds and 3.0 assists. Especially for a point guard. But he found his way onto winning teams and stuck, which speaks to a value that goes beyond the statistical columns."}, {"url": "https://www.statscrew.com/basketball/stats/p-vallejo01", "page_content": "John Vallely\n\nJohn Stephen Vallely\n\nBorn: October 3, 1948\n\nPosition: G\n\nHigh School: Corona Del Mar\n\nCollege: UCLA, Orange Coast JC\n\nDrafted: 1970, Round 1 Pick 14, #14 Overall\n\nHeight: 6'3\"\n\nWeight: 180\n\nCareer: 1970-71-1971-72\n\n\n\nJohn Vallely averaged 3.6 points, 0.7 rebounds and 0.8 assists per game in his 100-game career with the Atlanta Hawks and Houston Rockets. He began playing during the 1970-71 season and last took the court during the 1971-72 campaign.\n\nClick on column headings to sort.\n\nPlayer Totals:\n\nPlayer Pos GP GS Min FGA FGM 3PA 3PM FTA FTM Off Def Reb Ast Stl Blk TO PF Pts 1970-71 Atlanta Hawks 51 0 430 204 73 59 45 0 0 34 47 0 0 0 50 191 1971-72 Atlanta Hawks 9 0 110 43 20 20 13 0 0 11 9 0 0 0 13 53 1971-72 Houston Rockets 40 1 256 128 49 25 17 0 0 21 28 0 0 0 37 115 Totals 100 1 796 375 142 0 0 104 75 0 0 66 84 0 0 0 100 359\n\nPlayer Averages:"}, {"url": "https://www.statscrew.com/basketball/roster/t-HOU/y-1979", "page_content": "1979-80 Houston Rockets Roster\n\nThe Houston Rockets of the National Basketball Association ended the 1979-80 season with a record of 41 wins and 41 losses, finishing second in the NBA's Central Division of the Eastern Conference. The team compiled a postseason mark of 2-5.\n\nHouston tossed in 9,084 points and allowed 9,070. Moses Malone scored a team-best 2,119 points for the Rockets, and Calvin Murphy contributed 18 or more per game, too. Moses Malone accounted for 1,190 boards. Allen Leavell dished out 417 assists for the squad.\n\nOn the defensive side of the ball, Calvin Murphy added 143 steals.\n\nDel Harris coached the team. The 1979-80 Houston Rockets lost in the conference semifinals.\n\nClick on column headings to sort."}]}