{"Johannes Andreas August Grabau was a professor at the University of Kiel from 1881 to 1891, and then at the University of Berlin from 1891 to 1922.": [{"url": "https://www.wikiwand.com/en/Johannes_Andreas_August_Grabau", "page_content": "Johannes Andreas August Grabau (March 18, 1804—June 2, 1879) was an influential German-American Old Lutheran pastor and theologian. He is usually mentioned as J. A. A. Grabau.\n\nQuick facts: Johannes Andreas August Grabau, Born, Died, E... ▼\n\nGrabau was born in Olvenstedt, Prussia (now a part of greater Magdeburg, Germany). He was the son of Johann Andreas Grabau and Anna Dorothea Jericho. Grabau was educated at the grammar school in Olvenstedt (1809–1818), the Magdeburg Gymnasium (1818–1825) and at the University of Halle (1825–1829).[1]\n\nAfter three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew's Church in Erfurt in June 1834. Grabau was jailed twice for refusing to use the Prussian union Agenda and was permitted to immigrate to America in summer 1839 with members of Lutheran congregations in Erfurt and Magdeburg. They settled in Buffalo, New York, where he served as pastor of a Lutheran congregation for 40 years. On July 15, 1845, along with four pastors, Grabau founded \"The Synod of the Lutheran Church emigrated from Prussia\" (German: Synode der aus Preussen ausgewanderten lutherischen Kirche) which became known as the Buffalo Synod. Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau's synod after 1866 was Die Wachende Kirche, under his editorship.[2]\n\nGrabau was married on July 15, 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm, and Beata. Grabau died on June 2, 1879, in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States.[3]"}, {"url": "http://concordiahistoricalinstitute.libraryhost.com/repositories/2/resources/1031", "page_content": "Johann Andreas August Grabau was born 18 March 1804 in Olvenstedt, Saxony, in the Kingdom of Prussia, the son of Johann Andreas Grabau (d. 1822) and Anna Dorothea Grabau née Jericho. J.A.A. Grabau had a brother John and a sister Lisette. He was married in Erfurt on 15 July 1834, to Christine Sophia née Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth née Beulke. They had at least three children: Johann (pastor in Bergholz, New York), Wilhelm (married Maria von Rohr, pastor in Cedarburg, Wisconsin), and Beata (whose married name was Gram). Grabau died on 2 June 1879 in Buffalo, New York.\n\n\n\nGrabau was educated at the grammar school in Olvenstedt (1809-1818), the Magdeburg Gymnasium (1818-1825) and finally at the University of Halle (1825-1829). After three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew’s Church in Erfurt in June 1834.\n\n\n\nIn 1836 Grabau ran afoul of the Prussian state church for his opposition to the Union Agenda. After two years’ imprisonment (1837-1839), Grabau was finally granted permission to emigrate along with his congregation. This group, under the leadership of Grabau and Captain Heinrich von Rohr, departed for America in the summer of 1839. Grabau and a majority of his congregation settled in Buffalo while von Rohr and some of the families continued to Wisconsin. In Buffalo the settlers established Trinity Old Lutheran Church, quickly followed by the founding of a school.\n\n\n\nGrabau and his congregation soon met with controversy, however. First was a split with a congregation of Silesian Lutherans who had accompanied Grabau’s congregation across the Atlantic. While the Silesian pastor, Leberecht Friedrich Ehregott Krause, was in Germany, Grabau excommunicated the Silesians because of an unsettled debt to the shipping agent who had arranged their passage. The Silesians denied Grabau’s authority in the matter, but Pr. Krause, who passed through Buffalo again in 1841 on his way to take up a call to Wisconsin, sided with Grabau. The Silesians approached the Saxon pastor E.M. Bürger [Buerger] who was passing through Buffalo at the time, intending to return to Germany, and Bürger, having investigated the situation, finally accepted their call and became the pastor of the congregation, known in distinction from Grabau’s as First Trinity Evangelical Lutheran Church.\n\n\n\nRelations between Grabau’s group and the Saxon Lutherans in Missouri had already been placed on a shaky footing by Grabau’s 1840 Hirtenbrief, a letter which he had written in response to the situation of the emigrants who had traveled with von Rohr to Freistadt, Wisconsin. In the absence of a pastor, they had appointed a schoolteacher to preach and administer the sacraments among them, a practice of which Grabau strongly disapproved. Grabau sent a copy of the Hirtenbrief to C.F.W. Walther and G.H. Loeber. The Missouri pastors disagreed with Grabau’s teaching but were not able to send a response until 1843. An increasingly acrimonious exchange between the two groups continued for several decades, providing impetus for Walther’s Voice of our Church on the Question Concerning the Church and the Ministry. The gap between Grabau and the Saxons widened further as portions of the Wisconsin congregations in Freistadt, Milwaukee, and Kirchhayn, offended by Pr. Krause’s liberal use of excommunication, sought Saxon pastors to serve them.\n\n\n\nMeanwhile, Grabau proceeded with the work of church organization. In 1845 the Synod of the Lutheran Church Emigrated from Prussia [Synode der aus Preussen ausgewanderten lutherischen Kirche] was formed by Grabau, von Rohr (who had in the meantime been trained and ordained as a pastor), Krause and Pr. G. A. Kindermann, a Pomeranian whose congregation had emigrated to Wisconsin. Grabau was elected senior ministerii or president of the synod, popularly known as the Buffalo Synod. The synodical paper, Kirchliches Informatorium, was established in 1851 under Grabau’s editorship. In 1853/4 the Synod established the German Martin Luther College in Buffalo with Grabau as its rector.\n\n\n\nIn 1866 a schism arose within the Buffalo Synod itself. At the synodical assembly in June of that year, a majority of the Buffalo pastors, including von Rohr, turned against Grabau, accusing him of false doctrine. Grabau and three pastors withdrew, claiming to constitute the legitimate Buffalo Synod. In November von Rohr and his fellow pastors agreed to a colloquium with representatives of the Missouri Synod. As a result of this meeting, a majority of the Buffalo Synod pastors, under the leadership of Pr. Christian Hochstetter of Buffalo, joined the Missouri Synod at once. A rump group, under von Rohr’s leadership until his death in 1874, continued to constitute a separate Buffalo Synod until 1877.\n\n\n\nGrabau continued as pastor of Trinity Old Lutheran Church in Buffalo and as president of the Buffalo Synod, which consisted of Grabau and those pastors who had refused to join in the condemnation of 1866. After a legal battle with von Rohr’s Buffalo Synod, Grabau retained control of the Martin Luther College in Buffalo and remained as its rector. The official organ of Grabau’s synod after 1866 was Die Wachende Kirche, under his editorship. He continued in these responsibilities until his death on 2 June 1879."}, {"url": "https://wiki.alquds.edu/?query=Johannes_Andreas_August_Grabau", "page_content": "Johannes Andreas August Grabau (March 18, 1804—June 2, 1879) was an influential German-American Old Lutheran pastor and theologian. He is usually mentioned as J. A. A. Grabau.\n\nGrabau was born in Olvenstedt, Prussia (now a part of greater Magdeburg, Germany). He was the son of Johann Andreas Grabau and Anna Dorothea Jericho. Grabau was educated at the grammar school in Olvenstedt (1809–1818), the Magdeburg Gymnasium (1818–1825) and at the University of Halle (1825–1829).[1]\n\nAfter three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew's Church in Erfurt in June 1834. Grabau was jailed twice for refusing to use the Prussian union Agenda and was permitted to immigrate to America in summer 1839 with members of Lutheran congregations in Erfurt and Magdeburg. They settled in Buffalo, New York, where he served as pastor of a Lutheran congregation for 40 years. On July 15, 1845, along with four pastors, Grabau founded \"The Synod of the Lutheran Church emigrated from Prussia\" (German: Synode der aus Preussen ausgewanderten lutherischen Kirche) which became known as the Buffalo Synod. Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau's synod after 1866 was Die Wachende Kirche, under his editorship.[2]\n\nGrabau was married on July 15, 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm, and Beata. Grabau died on June 2, 1879, in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States.[3]\n\nReferences [ edit ]\n\nOther sources [ edit ]\n\nClifford E. Nelson, Lutherans in North America (Minneapolis, MN: Augsburg Fortress Publishers. 1980)\n\nThis article incorporates text from a publication now in the public domain: Jackson, Samuel Macauley, ed. (1914). New Schaff–Herzog Encyclopedia of Religious Knowledge (third ed.). London and New York: Funk and Wagnalls.\n\n\n\n"}, {"url": "https://prabook.com/web/johannes.grabau/2218052", "page_content": "Johannes Grabau\n\ntheologian\n\n1804 (age 75) Olvenstedt, Prussia\n\nHe is usually mentioned as J. A. A. Grabau. After three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of Saint Andrew’s Church in Erfurt in June 1834. They settled in Buffalo, New York where he served as pastor of a Lutheran congregation for 40 years. Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau’s synod after 1866 was Die Wachende Kirche, under his editorship. Grabau was married on July 15, 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm, and Beata. Grabau died on June 2, 1879 in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States."}, {"url": "https://www.liquisearch.com/johannes_andreas_august_grabau", "page_content": "Johannes Andreas August Grabau (March 18, 1804—June 2, 1879) was an influential German-American Old Lutheran pastor and theologian. He is usually mentioned as J.A.A. Grabau.\n\nGrabau was born in Olvenstedt, Prussia (now a part of greater Magdeburg, Germany). He was the son of Johann Andreas Grabau and Anna Dorothea Jericho. Grabau was educated at the grammar school in Olvenstedt (1809–1818), the Magdeburg Gymnasium (1818–1825) and at the University of Halle (1825–1829).\n\nAfter three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew’s Church in Erfurt in June 1834. Grabau was jailed twice for refusing to use the Prussian union Agenda and was permitted to immigrate to America in summer 1839 with members of Lutheran congregations in Erfurt and Magdeburg. They settled in Buffalo, New York where he served as pastor of a Lutheran congregation for 40 years. On July 15, 1845, along with four pastors, Grabau founded \"The Synod of the Lutheran Church emigrated from Prussia\" (German: Synode der aus Preussen ausgewanderten lutherischen Kirche) which became known as \"the Buffalo Synod\". Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau’s synod after 1866 was Die Wachende Kirche, under his editorship.\n\nGrabau was married on 15 July 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm and Beata. Grabau died on 2 June 1879 in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States."}, {"url": "https://peoplepill.com/people/johannes-andreas-august-grabau/", "page_content": "Johannes Andreas August Grabau (March 18, 1804—June 2, 1879) was an influential German-American Old Lutheran pastor and theologian. He is usually mentioned as J. A. A. Grabau.\n\nGrabau was born in Olvenstedt, Prussia (now a part of greater Magdeburg, Germany). He was the son of Johann Andreas Grabau and Anna Dorothea Jericho. Grabau was educated at the grammar school in Olvenstedt (1809–1818), the Magdeburg Gymnasium (1818–1825) and at the University of Halle (1825–1829).\n\nAfter three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew’s Church in Erfurt in June 1834. Grabau was jailed twice for refusing to use the Prussian union Agenda and was permitted to immigrate to America in summer 1839 with members of Lutheran congregations in Erfurt and Magdeburg. They settled in Buffalo, New York where he served as pastor of a Lutheran congregation for 40 years. On July 15, 1845, along with four pastors, Grabau founded \"The Synod of the Lutheran Church emigrated from Prussia\" (German: Synode der aus Preussen ausgewanderten lutherischen Kirche) which became known as the Buffalo Synod. Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau’s synod after 1866 was Die Wachende Kirche, under his editorship.\n\nGrabau was married on July 15, 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm, and Beata. Grabau died on June 2, 1879 in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States.\n\nOther sources"}, {"url": "https://wiki2.org/en/Johannes_Andreas_August_Grabau", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nJohannes Andreas August Grabau (March 18, 1804—June 2, 1879) was an influential German-American Old Lutheran pastor and theologian. He is usually mentioned as J. A. A. Grabau.\n\nGrabau was born in Olvenstedt, Prussia (now a part of greater Magdeburg, Germany). He was the son of Johann Andreas Grabau and Anna Dorothea Jericho. Grabau was educated at the grammar school in Olvenstedt (1809–1818), the Magdeburg Gymnasium (1818–1825) and at the University of Halle (1825–1829).[1]\n\nAfter three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew's Church in Erfurt in June 1834. Grabau was jailed twice for refusing to use the Prussian union Agenda and was permitted to immigrate to America in summer 1839 with members of Lutheran congregations in Erfurt and Magdeburg. They settled in Buffalo, New York, where he served as pastor of a Lutheran congregation for 40 years. On July 15, 1845, along with four pastors, Grabau founded \"The Synod of the Lutheran Church emigrated from Prussia\" (German: Synode der aus Preussen ausgewanderten lutherischen Kirche) which became known as the Buffalo Synod. Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau's synod after 1866 was Die Wachende Kirche, under his editorship.[2]\n\nGrabau was married on July 15, 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm, and Beata. Grabau died on June 2, 1879, in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States.[3]\n\nReferences\n\nOther sources\n\nClifford E. Nelson, Lutherans in North America (Minneapolis, MN: Augsburg Fortress Publishers. 1980)\n\nThis article incorporates text from a publication now in the public domain: Jackson, Samuel Macauley, ed. (1914). New Schaff–Herzog Encyclopedia of Religious Knowledge (third ed.). London and New York: Funk and Wagnalls.\n\n\n\n"}, {"url": "https://alchetron.com/Johannes-Andreas-August-Grabau", "page_content": "Johannes Andreas August Grabau (March 18, 1804—June 2, 1879) was an influential German-American Old Lutheran pastor and theologian. He is usually mentioned as J. A. A. Grabau.\n\nGrabau was born in Olvenstedt, Prussia (now a part of greater Magdeburg, Germany). He was the son of Johann Andreas Grabau and Anna Dorothea Jericho. Grabau was educated at the grammar school in Olvenstedt (1809–1818), the Magdeburg Gymnasium (1818–1825) and at the University of Halle (1825–1829).\n\nAfter three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew’s Church in Erfurt in June 1834. Grabau was jailed twice for refusing to use the Prussian union Agenda and was permitted to immigrate to America in summer 1839 with members of Lutheran congregations in Erfurt and Magdeburg. They settled in Buffalo, New York where he served as pastor of a Lutheran congregation for 40 years. On July 15, 1845, along with four pastors, Grabau founded \"The Synod of the Lutheran Church emigrated from Prussia\" (German: Synode der aus Preussen ausgewanderten lutherischen Kirche) which became known as the Buffalo Synod. Grabau also founded the Martin Luther College in Buffalo. Grabau retained control of the Martin Luther College and remained as its rector. The official organ of Grabau’s synod after 1866 was Die Wachende Kirche, under his editorship.\n\nGrabau was married on July 15, 1834, to Christine Sophia Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth Beulke. They had at least three children: Johann, Wilhelm, and Beata. Grabau died on June 2, 1879 in Buffalo, New York, shortly before the 40th anniversary of his arrival in the United States."}, {"url": "https://prabook.com/web/johannes_andreas_august.grabau/1097408", "page_content": "Johannes Andreas August Grabau\n\nclergyman\n\nMarch 18, 1804 (age 75)\n\nTaught school, Magdeburg, Sachsa, Germany, circa 1830-1834. Elected pastor St. Andreas, Erfurt, 1834. Ordained to ministry Lutheran Church, 1834. Opposed Union liturgy and carried on services in private homes while he was not in prison, 1836-1838, finally allowed to emigrate with group of about 1000 parishioners. Settled in Buffalo, New York, 1839. Pastor Derifaltigkets-Kirche, 1839-1879. Opened school later known as Martin Luther Seminary, 1840, trained candidates for ministry. Met at Milwaukee with Heinrich von Rohr (his 1st pupil) and 3 other clergymen, 1845, organized Synod of Lutheran Church Emigrated from Prussia (became known as Buffalo Synod). Visited Germany with von Rohr to confer with William Lohe on matters of doctrine, 1853-1854. Buffalo Synod split into 3 factions over subject of ordination, 1866, largest splinter joined Missouri Synod. Started new paper Die Wachende Kirche to defend his synod’s views."}, {"url": "https://link.springer.com/article/10.1007/BF03175848", "page_content": "A.W. Grabau (1870–1946), one of the world’s greatest sedimentary geologists divided his working life between the United States (1890–1920) and China (1920–1946). My early acquaintance with the publications of Grabau was through one of my fellow students Mrs. Mary Welleck Garretson (1896–1971) who had been a student of Grabau’s at Columbia University. Grabau served as Professor of Geology and Mineralogy at Rensselaer Polytechnic Institute before he joined the faculty of Columbia University. Grabau may truly be considered the Father of Modern Sedimentology.\n\nThis paper focuses on (1) Mary Garretson’s recollections of Grabau; (2) surviving correspondence in the Archives of the Geological Survey of China which include handwritten letters in German script addressed by Johannes Walther (1860–1937) to Grabau which reveal an intimate personal friendship; and (3) glimpses of Grabau’s personal life.\n\nGrabau’s tomb is located in a pleasant memorial park of the campus of the new university of Beijing, where a white marble headstone with English and Chinese inscriptions adorns his grave."}]}