{"The Grabau Zone is a sequence of strata that can be used to identify a particular geological period.": [{"url": "https://geo.libretexts.org/Courses/University_of_California_Davis/GEL_109%3A_Sediments_and_Strata_(Sumner)/Textbook_Construction/Biostratigraphy_%E2%80%93_Biozones_and_Zone_Fossils", "page_content": "Colin Boisvert\n\nIntroduction While specific minerals such as zircon or elements such as uranium, argon or strontium can provide a more precise geochronology value for a unit what if these elements/minerals are not detected in the rock? These minerals/elements are rare and often hard to find. Stratigraphy offers an alternative solution to radioactive minerals. Stratigraphy is the branch of geology concerned with the relative dating and sequence of rock units on the geologic timescale. This method is a relative dating method for rock units because while the Law of Superposition we can tell us undeformed layers further down are older than layers closer to the top, we don't how the exact age difference. Interpreting stratigraphy can be difficult due to geologic processes such as folding,faulting and unconformities which deform the stratigraphy in a region.Scientists use a variety of different branches of stratigraphy with different methods to date strata units.So what about fossils discovered in the stratigraphic layers? Finding fossils in Phanerozoic strata is relatively easy to do and scientists can use the relative age of fossils in the rock layers to build the geological time scale. Biostratigraphy is the branch of stratigraphy that uses widespread, quick evolving and well-studied fossils found in the rocks to date strata. It is a very helpful tool for scientists to build and modify the geological timescale!\n\nSo what is Biostratigraphy? Biostratigraphy is the specific branch of stratigraphy that uses index fossils found in the strata to serve as biological markers and give a more precise estimate of the rock unit's age. Index fossils are fossils found in stratigraphic units that meet a set of criteria that allows us to date the stratigraphic unit rock to a range because of the animal's evolutionary and geologic record. Since an index fossil is unique and found only during a certain span of time, finding a specific index fossil in the strata provides a small span of time that we can date this unit to. When we find the same index fossil in stratigraphic units located far apart, we can use chronostratigraphy to correlate these units to the same age because they both contain the same index fossil. Chronostratigraphy studies the age of rock units relative to time so discovering the same index fossil pinpoints the age of two different rock units because of the same index fossil found in both. Figure 1: This figure gives the geologic timescale coupled with correlated species-specific index fossils for the different period of Earth's History (The USGS,2013). Biostratigraphy is an extremely powerful tool for chronostratigraphic correlation. Life evolves through time, with new species emerging and other species going extinct. For time intervals and species that are well studied, the process of evolution provides a detailed temporal framework for correlating stratigraphic columns. The basic idea is for the geologist to identify a fossil's biozone. This is done by identifying the fossil species in the stratigraphic columns, compare them to the known age ranges of those species , and then constraining the age of the rocks from documented extinction and origination events of the identified species. This is an extremely powerful approach to correlating stratigraphic columns because each species is unique and changes through time. Magnetostratigraphy,another branch of stratigraphy that uses polarity switches recorded in the rock record to date strata units is often connected with biostratigraphy as seen in figure 3. Figure 2: This figure illustrates how index fossils can help with chronostratigraphic correlation(Rosenkrantz, 2013). If we assume that the distance between the columns is hundred of miles, we can use the ammonite fossil to correlate the layer on the left with the one in the middle and the right. Then using the age range for that specific species we will have an idea how old the strata is with a range. This will tell us all strata below the ammonite are older than that age and the ones above are younger. If the gastropod species per rock layers are different we can do the same with them. Biozones are zones of well-documented fossil species with distinct origination and extinction times. Specific biozones can be defined a number of ways: The total time of a fossil's existence.\n\nIt could consist of the total time where two or more fossils coexist .\n\nIt could be defined as the time between the origination of one fossil and the extinction of a different fossil, etc. An example of a biozone chart, combined with magnetostratigraphic reversals can be found at: http://www-odp.tamu.edu/publications/189_IR/chap_02/c2_f6.htm Figure shows some of the members of the Diatom family, a good index fossil and how they were used at one site in conjunction with magnetostratigraphy to date the rock units in the Paleogene-Neogene. (Gersonde et al., 1998, and Shipboard Scientific Party, 1999b).\n\nCriteria for a good index fossil vs a bad one? There are 4 main criteria that all have to be met for an organism to be considered a good index fossil. Have short geological ranges, e.g. they did not live for millions of years, and evolved quickly; Quick evolution means scientists can track the morphological changes in a species. When a species evolves into a new species , scientists can use this information to build the timescale for that specific species as an index fossil. If we can track the evolution from species to species then we can easily pinpoint the beginning and end of one species and the transition to a new one . This combination allows us to identify an index fossil in the strata and have a more precise idea of what window of time we are looking at for the age of the rock unit. Distribution over a large region of the earth; Since most of the Earth is covered in water it is easier for a marine fossil to be considered an index fossil vs land fossils which can be restricted to one continent usually.Oceans have risen and fallen with as much as 85% percent of the planet covered by the sea making it easier to find marine fossils. Since marine animals could more easily spread over a large portion of the globe, this helps with the potential for burial in marine strata millions of years later.On land an animal is more restricted in how far a species can spread so this makes it easier for marine animals to be classified as index fossils. Easily preserved and abundant; Hard parts, such as bones, shells, or exoskeletons, are more easily preserved in sediment because they are not subject to erosion and decay in the way that soft tissues are. Because hard parts can still be eroded through weathering, some of those hard parts will have a better chance of preservation if a high number of them are buried. Sufficiently studied; Fossils that aren't well-studied do not make good index fossils because we do not know enough about their evolutionary histories or over what time span they existed. With well-studied fossils, we do have this information and understand that the presence of a certain fossil signals a particular time range. For example, ammonites and trilobites are well-studied with specific age ranges so it is easy to use them as index fossils. Reasons Why your favorite dinosaur Tyrannosaurus rex is not a good index fossil Your Favorite Dinosaurian predator is not a good index fossil because while it is well-studied and its bones are easily preserved, it only lived in Western North America (Limited range over the Earth) and it lived for around 2-3 million years and it did not evolve quickly. Most dinosaurs in fact are not good index fossils because of their restricted geographical range , slow evolution and limited knowledge. In fact, many tetrapod macrofossils that people know are not good index fossils because they do not fit one of the four criteria. If an organism is only found in one region, such as dire wolves in North America, or contains mostly soft parts like cartilage in most sharks fossils, then this makes them a poor candidate for an index fossil. Furthermore, if the organism has a long geological range or are rare fossils and not well studied this makes the species a poor candidate for being an index fossil as well. Fossils that contain a lot of soft parts, single species that lived for long periods of time,were endemic to a specific region or are rare in the field today are criteria for being a poor index fossil that should not be used. This would make using living fossils like the Coelacanth difficult to use as well as many living fossils have few fossils but ancient lineages making it seem like one species lived for a long time which is a criteria for being a poor index fossil. All together, if you see a shark tooth,Tyrannosaurus femur, and an ammonite shell in the strata unit you are studying, pick the ammonite for biostratigraphic purposes.\n\nIndex fossils of the Phanerozoic Common examples of index fossils include: Phanerozoic : Foraminfera (542-0 million years ago) Forams are an extant group of organisms withnumerous species that are well studied, have short temorpal ranges and are widespread. Since we find forams all over the place their evolution is well studied and their record of 18O means we can use them for stable isotpe studies with paleoclimates and as an index fossil. Paleozoic :Trilobites (542-252 million years ago) Trilobites are a numerous group of marine arthropods with correlated species temporal ranges allowing for specific chronostratigraphic correlation based on specific index fossils of trilobites. Specific examples include Paradoxides as stated in Figure 1 which was a genus of Trilobite that contained 19 species that lived during the Mid-Late Cambrian Period. Species of this genus have been found up and down both sides of the Atlantic Coastline from Canada to Africa. All together these 19 species provide a temporal range from 514-497ma .Another genus example includes Phacops. Figure 4: This figure illustrates a Trilobite fossil which were common in the Paleozoic and used as index fossils for this era as they are found all over the world for short periods of time with rapid evolution. Trilobites are arthropods related to insects arachnids and crustaceans ( James St John,2010). Mesozoic :Ammonites (252-66 million years ago) Once again this group of cephalopods was a prosperous marine group that thrived during the Mesozoic and this prosperity means we can follow the evolution of different species to help constrain certain species to different stages of the Mesozoic. This combined with their geographic range makes them a great index fossil. An example genera is Perisphinctes with 4 species covering the Middle-Late Jurassic epoch. Figure 5: This picture illustrates an ammonite fossil which is a common index fossil for the Mesozoic as they are found all over the world for short periods of time with rapid evolution. In medieval times people believed ammonite fossils were serpents God had coiled up and turned to stone but now we know they are cephalopods related to the Nautilus and octopus.(Becks,2013). Cenozoic : Diatoms (66-0 million years ago) This marine group also has a numerous amount of species that lived over short temporal ranges. Figure 6: This figure illustrates a chart showing common index fossils as well as when and where they are appropriate to use across the Phanerozic and the world (Bond 2016). Case study: Using index fossils to date rocks in India In India, specifically the Triassic Spiti Basin, Jurassic Kachchh Basin, and Cretaceous Kachchh and Cauvery Basins, scientists used mainly Ammonoid Biostratigraphy coupled with biozones to help correlate and date the regions for a more precise chronostratigrpahic correlation of these basins in India during the Mesozoic (Krishna,2017). Scientists were unclear on how the basins formed and wished to accurately date the regions and start of the geologic events. Ammonites are aquatic molluscs meaning wherever we find their fossils we can correlate this strata to an aquatic paleoenviornment. As for all the layers deposited in the sea, scientists examined these layers of rock to search for species of ammonites. When one was found it was identified by species and using the range of time for the known species, the scientists refined the strata into the relevant temporal stages of the respective periods(ex.the Barremanian stage of the Cretaceous). This built zones where certain species were connected to specific strata based on the age correlation. For the Triassic Spiti Basin , they were only able to build 35 ammonoid zones and mark the Early and Middle Triassic (Krishna 2017). For the Middle to late Jurassic in the Kachchh they created 35 ammonoid biozones and used ammonites found in other Jurassic basins to fill gaps in the earlier parts of the Jurassic (Krishna 2017). For the Cretaceous using mainly the Kachchh and Cauvery basins but exploring others such as the Cretaceous Spiti scientists were able to correlate roughly 18 informal zones to 9 or 10 of the stages of the Cretaceous (Krishna 2017). Correlating these strata, allowed scientists to build a picture of how these basins changed in regards to sea elevation and shifting geology of the moving subcontinent on its eventual path to Asia. To summarize scientists identified different ammonite species in the strata to create a chronostratigraphic record of the Mesozoic. By identifying the ammonites present at the in the strata of specific basins, scientists could then use the known age ranges of those fossils to more precisely date the rock units.They then correlated basins together based on lithostratigraphy to form a larger picture of the Mesozoic basins of India. Using successive species of ammonoids that evolved and died one after another the scientists were able to create ammonoid biozones that correlated stratigraphic units with a specific period of time plus or minus an error interval"}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-94-007-6644-0_178-1", "page_content": "Brown, L. F., Jr., and Fisher, W. L., 1977. Seismic stratigraphic interpretation of depositional systems: examples from Brazilian rift and pull apart basins. In Payton, C. E. (ed.), Seismic Stratigraphy – Applications to Hydrocarbon Exploration. Tulsa: American Association of Petroleum Geologists. American Association of Petroleum Geologists Memoir, Vol. 26, pp. 213–248.\n\nCatuneanu, O., 2002. Sequence stratigraphy of clastic systems: concepts, merits, and pitfalls. Journal of African Earth Sciences, 35, 1–43.\n\nCatuneanu, O., 2006. Principles of Sequence Stratigraphy. Elsevier, p. 375.\n\nCatuneanu, O., Galloway, W. E., Christopher, G. S., Kendall, C., Miall, A. D., Posamentier, H. W., Strasser, A., and Tucker, M. E., 2011. Sequence stratigraphy: methodology and nomenclature. Stuttgart, Newsletters on Stratigraphy, 44(3), 173–245.\n\nDott, R. H., and Batten, R. L., 1976. Evolution of the Earth, 2nd edn. New York: McGraw-Hill. 504 p. ISBN 0070176191.\n\nGalloway, W. E., 1989. Genetic stratigraphic sequences in basin analysis. I. Architecture and genesis of flooding surface bounded depositional units. American Association of Petroleum Geologists Bulletin, 73, 125–142.\n\nJervey, M. T., 1988. Quantitative geological modeling of siliciclastic rock sequences and their seismic expression. In Wilgus, C. K., Hasting, B. S., Kendall, C. G. S. C., Posamentier, H. W., Ross, C. A., and Van Wagoner, J. C. (eds.), Sea-Level Changes: An Integrated Approach. Tulsa: Society of Economic Paleontologists and Mineralogists. Special Publication No. 42, pp. 47–69.\n\nLyell, C., 1830. Principles of Geology, 1st edn. London: John Murray, Vol. 1.\n\nLyell, C., 1832. Principles of Geology, 1st edn. London: John Murray, Vol. 2.\n\nLyell, C., 1833. Principles of Geology, 1st edn. London: John Murray, Vol. 3.\n\nMiddleton, G. V., 1973. Johannes Walther’s law of the correlation of facies. Geological Society of America Bulletin, 84, 979–988.\n\nPomar, L., 2001. Ecological control of sedimentary accommodation: evolution from a carbonate ramp to rimmed shelf, Upper Miocene, Balearic Islands. Palaeogeography, Palaeoclimatology, Palaeoecology, 175, 249–272.\n\nPosamentier, H. W., Jervey, M. T., and Vail, P. R., 1988. Eustatic controls on clastic deposition. I. Conceptual framework. In Wilgus, C. K., Hastings, B. S., Kendall, C. G. St. C., Posamentier, H. W., Ross, C. A., Van Wagoner, J. C. (Eds.), Sea Level Changes – An Integrated Approach. SEPM Special Publication No 42, pp. 110–124.\n\nSchwarzacher, A., 2000. Repetition and cycles in stratigraphy. Earth-Science Reviews, 50, 51–75.\n\nSprague, A. R., Patterson, P. E., Hill, R. E., Jones, C. R., Campion, K. M., Van Wagoner, J. C., Sullivan, M. D., Larue, D. K., Feldman, H. R., Demko, T. M., Wellner, R.W., Geslin, J. K., 2002. The Physical Stratigraphy of Fluvial Strata: A Hierarchical Approach to the Analysis of Genetically Related Stratigraphic Elements for Improved Reservoir Prediction. (Abs) AAPG Annual Meeting, Official Program, p. A167.\n\nVail, P. R., Mitchum, R. M., Jr., and Thompson, S., III, 1977. Seismic stratigraphy and global changes of sea level, part four: global cycles of relative changes of sea level. American Association of Petroleum Geologists Memoir, 26, 83–98.\n\nVan Wagoner, J. C., 1995. Sequence stratigraphy and marine to nonmarine facies architecture of Foreland Basin Strata, Book Cliffs, Utah, U.S.A. In Van Wagoner, J. C., and Bertram, G. T. (Eds.), Sequence Stratigraphy of Foreland Basin Deposits. American Association Petroleum Geologists Memoir. Vol. 64, pp. 137–223.\n\nVan Wagoner, J. C., Posamentier, H. W., Mitchum, R. M., Vail, P. R., Sarg, J. F., Loutit, T. S., and Hardenbol, J., 1988. An overview of sequence stratigraphy and key definitions. In Wilgus, C. K., Hastings, B. S., Kendall, C. G. St. C., Posamentier, H. W., Ross, C. A., and Van Wagoner, J. C. (Eds.), Sea Level Changes – An Integrated Approach. SEPM Special Publication. Vol. 42, pp. 39–45."}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-3-319-73568-9_310", "page_content": "Abdulkader A, Sadaqah R, Mamdouh A-J (2007) Sequence stratigraphy and evolution of Eshidiyya phosphorite platform, southern Jordan. Sediment Geol 198(3–4):209–219\n\nBachu S, Adams J (2003) Sequestration of CO 2 in geological media in response to climate change: capacity of deep saline aquifers to sequester CO 2 in solution. Energy Convers Manag 44(20):3151–3175\n\nBaye A, Rathfelder K, Wei M, Yin J (2016) Hydrostratigraphic, hydraulic and hydrogeochemical description of Dawson Creek-Groundbirch areas, Northeast BC. Province of British Columbia, Water Science Series No. 2016-04, 58 pages\n\nBünz s, Mienhart J, Berndt C (2003) Geological controls on the Storegga gas-hydrate system on the mid-Norwegian continental margin. Earth Planet Sci Lett 209(3–4):291–307\n\nBurgess P, Lammers H, van Oosterhout C, Granjson D (2006) Multivariate sequence stratigraphy: tackling complexity and uncertainty with stratigraphic forward modeling, multiple scenarios and conditional frequency maps. Am Assoc Pet Geol Bull 90(1):1883–1901\n\nBurkhalter R (1995) Ooidal ironstones and ferruginous microbialites: origin and relation to sequence stratigraphy (Aalenian and Bajocian, Swiss Jura mountains). Sedimentology 42(1):57–74\n\nClague JJ, Bobrowsky PT (1994) Evidence for a large earthquake and tsunami 100–400 years ago on western Vancouver Island, British Columbia. Quat Res 41:176–184\n\nCohen K, Finney B, Gibbard P, Fan J (2013) The international commission on stratigraphy international chronostratigraphic chart. Episodes 36:199–204\n\nDietrich J, Dixon J, McNeil D, McIntyre D, Snowdon L, Cameron A (1989) The geology, biostratigraphy and organic geochemistry of the Natsek E-56 and Edlok N-56 Wells, western Beaufort Sea. Geological Survey of Canada Current Research Part G, Frontier Geoscience Program, Arctic Canada, paper 89-1G, pp 133–157\n\nEmbry AF (2009) Practical sequence stratigraphy. Canadian Society of Petroleum Geologists. Online www.cspg.org [URL 2017]\n\nEisenstein Z (1994) Large undersea tunnels and the progress of tunnelling technology. Tunn Undergr Space Technol 9(3):283–292\n\nFigueroa J, Fout T, Plasynski S, McIlvried H, Srivastava R (2008) Advances in CO2 capture technology – the US Department of Energy’ carbon sequestration program. Int J Greenh Gas Control 2:9–20\n\nFilbà M, Salvany J, Jubany J, Carrasco L (2016) Tunnel boring machine collision with an ancient boulder beach during the excavation of the Barcelona city subway L10 line: a case of adverse geology and resulting engineering solutions. Eng Geol 200:31–46\n\nGarven G, Freeze A (1984) Theoretical analysis of the role of groundwater flow in the genesis of stratabound ore deposits. Am J Sci 284(10):1085–1124\n\nGee J, Gawthorpe R, Friedman S (2006) Triggering and evolution of a giant submarine landslide, offshore Angola, revealed by 3D seismic stratigraphy. J Sediment Res 76(1):9–19\n\nGeological Society (2018) Channel tunnel. Geological Society, geolsoc.org.uk [URL 2018]\n\nHelland-Hansen W, Gjelberg J (1994) Conceptual basis and variability in sequence stratigraphy: a different perspective. Sediment Geol 92:1–52\n\nHickin A (2009) The role of Quaternary geology in northeastern British Columbiaâ€™s oil and gas Industry: a summary. BC Ministry of Energy, Mines and Petroleum Resources, Geoscience Reports 2009:25–37\n\nHuang X, Griffiths C, Liu J (2015) Recent developments in stratigraphic forward modelling and its application in petroleum exploration. Aust J Earth Sci 62(8):903–919\n\nHuntley D, Bobrowsky P (2014) Surficial geology and monitoring of the Ripley Slide, near Ashcroft, British Columbia, Canada. Geological Survey of Canada, open file 7531, 21 pages\n\nHuntley D, Bobrowsky P, Best M (2017) Combining terrestrial and waterborne geophysical surveys to investigate the internal composition and structure of a very slow-moving landslide near Ashcroft, British Columbia, Canada. In: Landslide Research and Risk Reduction for Advancing Culture and Living with Natural Hazards, 4th World Landslide Forum (ICL-IPL) 2, 15 pages\n\nHutchinson I, Clague JJ (2017) Were they all giants? Perspectives on late Holocene plate-boundary earthquakes at the northern end of the Cascadia subduction zone. Quat Sci Rev 169(1):29–49\n\nKamp PJJ, Naish T (1998) Forward modelling of the sequence stratigraphic architecture of shelf cyclothems: application to the late Pliocene sequences, Wanganui Basin (New Zealand). Sediment Geol 116(1–2):57–80\n\nKetzer J, Iglesias R, Einloft S, Dullius J, Ligabue R, de Lima V (2009) Water-rock-CO 2 interactions in saline aquifers aimed for carbon dioxide storage: experimental and numerical modeling studies of the Rio Bonito formation (Permian), southern Brazil. Appl Geochem 24(5):760–767\n\nKim J (2001) Quaternary geology and assessment of aggregate resources of Korea for national industrial resources exploration and development. Quat Int 82(1):87–100\n\nKumar N, Helwig J, Dinkelman M (2009) Preliminary evaluation of a potential major petroleum province from BeaufortSPAN™ seismic data: Canadian Arctic passive margin, Banks Island segment. Can Soc Explor Geophys, Recorder 34(5):26–33\n\nLackner K (2003) A guide to CO 2 sequestration. Science 300(5626):1677–1678\n\nLamb R, Harding R, Huuse M, Stewart M, Brocklehurst S (2017) The early Quaternary North Sea basin. J Geol Soc, 16 pages. https://doi.org/10.1144/jgs2017-057\n\nLevson V, Hickin A, Ferbey T, Best M (2006) Mapping high resistivity buried channel deposits with airborne electromagnetic surveys and other methods. In: Proceedings of the 19th symposium on the application of geophysics to engineering and environmental problems, Seattle, Washington, DC, pp 152–161\n\nLui J, Liu D, Song K (2015) Evaluation of the influence caused by tunnel construction on groundwater environment: a case study of Tongluoshan Tunnel, China. Adv Mater Sci Eng 2015:14. Article: 149265\n\nMacDonald E, Harrison B, Baldwin J, Page W, Rood D (2017) Denudational slope processes on weathered basalt in northern California: 130 ka history of soil development, periods of slope stability and colluviation, and climate change. Geophys Res Abstr, EGU General Assembly, vol 19, 1 page\n\nMyagkiy A, Truche L, Cathelineau M, Golfier F (2017) Revealing the conditions of Ni mineralization in the laterite profiles of New Caledonia: insights from reactive geochemical transport modelling. Chem Geol 466:274–284\n\nNadeau S, Rosa E, Cloutier V (2017) Stratigraphic sequence map for groundwater assessment and protection of unconsolidated aquifers: a case example in the Abitibi-Témicamingue region, Quebec, Canada. Can Water Res J, 23 pages. https://doi.org/10.1080/07011784.2017.1354722\n\nOpen Learn (2018) Energy resources: coal. Open Learning University, open.edu [URL 2018]\n\nSaadatpoor E, Bryant S, Sepehrnoori K (2010) New trapping mechanism in carbon sequestration. Transp Porous Media 82(1):33–17\n\nSalvador A (ed) (1994) International stratigraphic guide: a guide to stratigraphic classification, terminology and procedure. International Subcommission on Stratigraphic Classification, IUGS International Commission on Stratigraphy, 2nd edn, 214 pages\n\nScheidler S, Huggenberger, P., Butscher C, Dresman H et al (2017) Tools to stimulate changes in hydraulic flow systems in comple geological settings affected by tunnel excavations. Bull Eng Geol Environ: 1–12. https://doi.org/10.1007/s10064-017-1113-5\n\nSEPM (2017) Sequence stratigraphy. Society for Sedimentary Geology, sepmstrata.org [URL 2017]\n\nShaw J, Stacey CD, Wu Y, Lintern DG (2017) Anatomy of the Kitimat fiord system, British Columbia. Geomorphology 293:108–129\n\nVail P, Mitchum R, Thompson S (1977) Seismic stratigraphy and global changes in sea level, part 1. In: Payton C (ed) Seismic stratigraphy: applications to hydrocarbon exploration. American Association of Petroleum Geologists, Tulsa. Memoir 26:49–212\n\nWarrlich G, Bosence D, Waltham D, Wood C, Boylan A, Badenas B (2008) 3D stratigraphic forward modelling for analysis and prediction of carbonate platform stratigraphies in exploration and production. Mar Pet Geol 25(1):35–58\n\nWarren C, Mortimore R (2003) Chalk engineering geology – channel tunnel rail link and north downs tunnel. Q J Eng Geol Hydrogeol 36(1):17–34\n\nZarei H, Uromeihy A, Sharifzadeh M (2012) Identifying geological hazards related to tunneling in carbonate karstic rocks – Zagros, Iran. Arab J Geosci 5(3):457–464"}, {"url": "https://link.springer.com/referenceworkentry/10.1007/978-1-4020-4409-0_3", "page_content": "Binford, L. R., 1983. In Pursuit of the Past: Decoding the Archaeological Record. New York: Thames and Hudson.\n\nBjörck, S., 2007. Younger Dryas oscillation, global evidence. In Elias, S. A. (ed.), Encyclopedia of Quaternary Science. Amsterdam: Elsevier, pp. 1985–1993.\n\nClarke, D. L., 1968. Analytical Archaeology. London: Methuen.\n\nColcutt, S. N., 1987. Archaeostratigraphy: a geoarchaeologist’s viewpoint. Stratigraphica Archaeologica, 2, 11–18.\n\nCordy, J.-M., 1987a. Modalités d‘application de la stratigraphie à l’archéologie. Stratigraphica Archaeologica, 2, 23–26.\n\nCordy, J.-M., 1987b. Réflexions sur l'ethnostratigraphie. Stratigraphica Archaeologica, 2, 27–34.\n\nDe Meyer, L. (ed.), 1984. Stratigraphica Archeologica, 1. Archaeostratigraphic Classification and Terminology Workshop, Ghent, University of Ghent.\n\nDunnell, R. C., 1982. Science, social science, and common sense: the agonizing dilemma of modern archaeology. Journal of Anthropological Research, 38(1), 1–25.\n\nDunnell, R. C., and Stein, J. K., 1989. Theoretical issues in the interpretation of microartifacts. Geoarchaeology, 4(1), 31–41.\n\nFarrand, W. R., 1984. More on stratigraphic practice. Quarterly Review of Archaeology, 5(4), 3.\n\nFedele, F. G., 1976. Sediments as palaeo-land segments: the excavation side of study. In Davidson, D. A., and Shackley, M. L. (eds.), Geoarchaeology. Boulder, CO: Westview Press, pp. 23–48.\n\nFedele, F. G., 1984. Towards an analytical stratigraphy: stratigraphic reasoning and excavation. Stratigraphica Archaeologica, 1, 7–15.\n\nFedele, F. G., and Franken, H. J., 1987. Report on the meeting in Brescia, Italy, July 5–8, 1984. Stratigraphica Archaeologica, 2, 3–6.\n\nFladmark, K. R., 1982. Microdebitage analysis: initial considerations. Journal of Archaeological Science, 9(2), 205–220.\n\nFord, J. A., 1954. The type concept revisited. American Anthropologist, 56(1), 42–53.\n\nGasche, H., and Tunca, O., 1983. Guide to archaeostratigraphic classification and terminology: definitions and principles. Journal of Field Archaeology, 10(3), 325–335.\n\nGibbard, P., and Cohen, K. M., 2008. Global chronostratigraphical correlation table for the last 2.7 million years. Episodes, 31(2), 43–47.\n\nHarris, E. C., 1977. Units of archaeological stratification. Norwegian Archaeological Review, 10(1), 84–94.\n\nHarris, E. C., 1979. Principles of Archaeological Stratigraphy. London: Academic.\n\nHarris, E. C., 1989. Principles of Archaeological Stratigraphy, 2nd edn. London: Academic Press.\n\nHarris, E. C., Brown, M. R., III, and Brown, G. J. (eds.), 1993. Practices of Archaeological Stratigraphy. London: Academic Press.\n\nHaynes, C. V., and Huckell, B. B. (eds.), 2007. Murray Springs: A Clovis Site with Multiple Activity Areas in the San Pedro Valley, Arizona. Tucson: University of Arizona Press.\n\nHedberg, H. D. (ed.), 1976. International Stratigraphic Guide: A Guide to Stratigraphic Classifications, Terminology, and Procedure. New York: Wiley.\n\nHull, K. L., 1987. Identification of cultural site formation processes through microdebitage analysis. American Antiquity, 52(4), 772–783.\n\nKrieger, A. D., 1944. The typological concept. American Antiquity, 9(3), 271–288.\n\nLaury, R. L., and Albritton, C. C., Jr., 1975. Geology of middle stone age archaeological sites in the main Ethiopian Rift Valley. Bulletin of the Geological Society of America, 86(7), 999–1011.\n\nLe Tensorer, J.-M., 1984. L’archéostratigraphie: Problèmes méthodologiques et terminologiques, l’exemple de la fouille et des observations sur le terrain. Stratigraphica Archaeologica, l, 24–27.\n\nLyman, R. L., and O’Brien, M. J., 1999. Americanist stratigraphic excavation and the measurement of culture change. Journal of Archaeological Method and Theory, 6(1), 55–108.\n\nMeltzer, D. J., and Holliday, V. T., 2010. Would North American Paleoindians have noticed Younger Dryas age climate changes? Journal of World Prehistory, 23(1), 1–41.\n\nMills, B. J., and Vega-Centeno, R., 2005. Sequence and stratigraphy. In Maschner, H. D. G., and Chippendale, C. (eds.), Handbook of Archaeological Methods. Lanham, MD: AltaMira Press, Vol. I, pp. 176–215.\n\nMurphy, M. A., and Salvador, A. (eds.), 2000. International Subcommission on Stratigraphic Classification of IUGS International Commission on Stratigraphy. International Stratigraphic Guide—An abridged version. GeoArabia5(2), 231–266.\n\nNorth American Commission on Stratigraphic Nomenclature, 1983. North American stratigraphic code. American Association of Petroleum Geologists Bulletin, 67(5), 841–875.\n\nNorth American Commission on Stratigraphic Nomenclature, 2005. North American stratigraphic code. American Association of Petroleum Geologists Bulletin, 89(11), 1547–1591.\n\nO’Brien, M. J., and Lyman, R. L., 1999. Seriation, Stratigraphy, and Index Fossils: The Backbone of Archaeological Dating. New York: Kluwer Academic/Plenum Publishers.\n\nRosen, A. M., 1986. Cities of Clay: The Geoarchaeology of Tells. Chicago: University of Chicago Press.\n\nRoskams, S. (ed.), 2000. Interpreting Stratigraphy: Site Evaluation, Recording Procedures and Stratigraphic Analysis. Papers presented to the interpreting stratigraphy conferences, 1993–1997. Oxford: Archaeopress.\n\nSalvador, A. (ed.), 1994. International Stratigraphic Guide: A Guide to Stratigraphic Classifications, Terminology, and Procedure, 2nd edn. Trondheim, Norway/Boulder, CO: International Union of Geological Sciences/Geological Society of America.\n\nSchiffer, M. B., 1972. Archaeological context and systemic context. American Antiquity, 37(2), 156–165.\n\nSchiffer, M. B., 1976. Behavioral Archeology. New York: Academic Press.\n\nSchiffer, M. B., 1983. Toward the identification of formation processes. American Antiquity, 48(4), 675–706.\n\nSchiffer, M. B., 1987. Formation Processes of the Archaeological Record. Albuquerque, NM: University of New Mexico Press.\n\nSpaulding, A. C., 1953. Statistical techniques of the discovery of artifact types. American Antiquity, 18(4), 305–313.\n\nStafford, T. W., Jr., 1981. Alluvial geology and archaeological potential of the Texas Southern high plains. American Antiquity, 46(3), 548–565.\n\nStein, J. K., 1987. Deposits for archaeologists. Advances in Archaeological Method and Theory, 11, 337–393.\n\nStein, J. K., 1990. Archaeological stratigraphy. In Lasca, N. P., and Donahue, J. (eds.), Archaeological Geology of North America. Boulder, CO: Geological Society of America. Centennial Special Volume, Vol. 4, pp. 513–523.\n\nStein, J. K., 2000. Stratigraphy and archaeological dating. In Nash, S. E. (ed.), It’s About Time: A History of Archaeological Dating in North America. Salt Lake City: University of Utah Press, pp. 14–40.\n\nStein, J. K., and Teltser, P. A., 1989. Size distributions of artifact classes: combining macro- and micro-fractions. Geoarchaeology, 4(1), 1–30.\n\nTunca, Ö., 1987. Stratigraphie en archéologie du Proche Orient. Stratigraphica Archaeologica, 2, 35–39.\n\nVan der Plas, L., 1987. Dust into dust, and under dust to lie: a discussion note on archaeostratigraphy. Stratigraphica Archaeologica, 2, 19–22.\n\nWalker, M. J. C., Berkelhammer, M., Björck, S., Cwynar, L. C., Fisher, D. A., Long, A. J., Lowe, J. J., Newnham, R. M., Rasmussen, S. O., and Weiss, H., 2012. Formal subdivision of the Holocene Series/Epoch: a discussion paper by a working group of INTIMATE (Integration of ice-core, marine and terrestrial records) and the Subcommission on Quaternary Stratigraphy (International Commission on Stratigraphy). Journal of Quaternary Science, 27(7), 649–659.\n\nWatson, R. A., and Wright, H. E., Jr., 1980. The end of the Pleistocene: a general critique of chronostratigraphic classification. Boreas, 9(3), 153–162.\n\nWatson, P. J., LeBlanc, S. A., and Redman, C. L., 1984. Archeological Explanation: The Scientific Method in Archeology. New York: Columbia University Press."}, {"url": "https://www.britannica.com/science/geochronology/The-concepts-of-facies-stages-and-zones", "page_content": "The significance of the facies concept for the analysis of geologic history became fully apparent with the findings of the Swiss geologist Amanz Gressly . While conducting survey work in the Jura Mountains in 1838, Gressly observed that rocks from a given position in a local stratigraphic succession frequently changed character as he traced them laterally. He attributed this lateral variation to lateral changes in the depositional environments responsible for producing the strata in question. Having no term to apply to the observed changes, he adopted the word facies. While Gressly employed the term specifically in the context of lithologic character, it is applied more broadly today. As now used, the facies concept has come to encompass other types of variation that may be encountered as one moves laterally (e.g., along outcroppings of rock strata exposed in stream valleys or mountain ridges) in a given rock succession. Lithologic facies, biological facies, and even environmental facies can be used to describe sequences of rocks of the same or different age having a particularly unique character.\n\nDuring the latter half of the 18th and early 19th centuries, most of the research on the distribution of rock strata and their fossil content treated lithologic boundaries as events in time representing limits to strata that contain unique lithology and perhaps a unique fossil fauna, all of which are the result of unique geologic processes acting over a relatively brief period of time. Hutton recognized early on, however, that some variations occur in the sediments and fossils of a given stratigraphic unit and that such variations might be related to differences in depositional environments . He noted that processes such as erosion in the mountains of Scotland, transportation of sand and gravels in streams flowing from these mountains, and the deposition of these sediments could all be observed to be occurring concurrently. At a given time then, these diverse processes were all taking place at separate locations. As a consequence, different environments produce different sedimentary products and may harbour different organisms. This aspect of differing lithologic type or environmental or biological condition came to be known as facies. (It was Steno who had, in 1669, first used the term facies in reference to the condition or character of the Earth’s surface at a particular time.)\n\nStages and zones\n\nThe extensive review of the marine invertebrate fauna of the Paris Basin by Deshayes and Lyell not only made possible the formalization of the term Tertiary but also had a more far-reaching effect. The thousands of marine invertebrate fossils studied by Deshayes enabled Lyell to develop a number of subdivisions of the Tertiary of the Paris Basin based on the quantification of molluskan species count and duration. Lyell noted that of the various assemblages of marine mollusks found, those from rocks at the top of the succession contained a large number of species that were still extant in modern environments. Progressively older strata yielded fewer and fewer forms that had living counterparts, until at the base of the succession, a very small number of the total species present could be recognized as having modern counterparts. This fact allowed Lyell to consider subdividing the Tertiary of the Paris Basin into smaller increments, each of which could be defined according to some relative percentage of living species present in the strata. The subdivision resulted in the delineation of the Eocene, Miocene, and Pliocene epochs in 1833. Later this scheme was refined to further divide the Pliocene into an Early and a Late Pliocene.\n\nLyell’s biostratigraphically defined concept of sequence, firmly rooted in concepts of faunal succession and superposition, was developed on mixed but stratigraphically controlled collections of fossils. It worked, but it did not address the faunal composition of the various Paris Basin strata other than in gross intervals—intervals that were as much lithologically as paleontologically defined. Alcide d’Orbigny, a French geologist, demonstrated correlational and superpositional uniqueness by utilizing paleontologically distinct intervals of strata defined solely on the basis of their fossil assemblages in his study of the French Jurassic Terrains Jurassiques (1842). This departure from a lithologically based concept of paleontologic succession enabled d’Orbigny to define paleontologically unique stages. Each stage represented a unique period in time and formed the basis of later work that resulted in the further subdivision of d’Orbigny’s original stages into 10 distinct stage assemblages. In spite of the work of Smith and to a lesser extent Lyell and others, d’Orbigny’s approach was essentially that of a catastrophist. Stage boundaries were construed to represent unusual extrinsic geologic events, with significant implications for faunal continuity. The applicability of d’Orbigny’s stages to areas outside of France had only limited success. At this point in the development of paleontology as a science, little was understood about the geologic time range of various fauna. Even less was known about the habitats—the environmental limits—of ancient fauna. Could certain groups of organisms have sufficiently widespread distribution in the rock record to enable correlations to be made with certainty? The Jurassic of western Europe consisted mostly of shallow marine sediments widely deposited throughout the area. It is now known that some of the mollusks with which d’Orbigny worked were undergoing very rapid evolutionary change; they were thus relatively short-lived as distinct forms in the geologic record and had a wide-ranging environmental tolerance. The result was that some forms, notably of the group of mollusks called ammonite cephalopods, were distributed extensively within a variety of sedimentary facies. The correlating of strata based on the faunal stage approach was widely accepted. Interestingly, most of d’Orbigny’s Jurassic stages, with refinements, are still in use today.\n\nOnly a short time after d’Orbigny’s original analysis of Jurassic strata, the German mineralogist and paleontologist Friedrich A. Quenstedt challenged (in 1856–58) the validity of using stages to effect correlations in cases where the actual geologic ranges and bed-by-bed distribution of individual component fossils of an assemblage were unknown. In retrospect, this seems blatantly obvious, but at the time the systematic stratigraphic documentation of fossil occurrence was not always carried out. Much critical biostratigraphic data necessary for the proper characterization of faunal assemblages was simply not collected. As argued, individual fossil ranges and their distributions could have profound influence on the concept of faunal succession and evolutionary dynamics.\n\nSeveral of Quenstedt’s students at the University of Tübingen followed up on this latter concern. One in particular, Carl Albert Oppel, essentially refined his mentor’s concepts by paying particular attention to the character of the range of individual species in a succession of fauna. These intervals of unique biological character, which he called zones, were essentially subdivisions of the stages proposed by Quenstedt. Oppel’s recognition of the earliest occurrence of a fossil species (or its first appearance), its range through a succession of strata, and its eventual loss from the local record (or its last appearance) led him to compare such biostratigraphic data from many species. By making use of such data on species that overlap in some or all of their stratigraphic ranges and from widely separated areas, Oppel was able to erect a biochronology based on a diverse record of first appearances, last appearances, and individual and overlapping range zones. This fine-scale refinement of a biologically defined sense of succession found wide applicability and enabled not only biochronological (or temporal) but also biofacies (spatial) understanding of the succession in question."}, {"url": "https://geo.libretexts.org/Courses/University_of_California_Davis/GEL_109%3A_Sediments_and_Strata_(Sumner)/Textbook_Construction/Chronostratigraphy", "page_content": "Loosely based on Chronostratigraphy\n\nWhat is Chronostratigraphy? Chronostratigraphy is the branch of geology that studies the age of rock strata in relation to time. The basic idea is to correlate which rocks around the world formed at the same time in an effort to reconstruct past events and determine depositional environments in Earth history. Another useful thing about chronostratigraphy is that can help us find valuable resources. For example, most of the oil deposits found today were deposited in the Mesozoic, so with this knowledge scientists can look for rock units of similar age to locate the oil deposits. While not an all-inclusive list, some of the different techniques used in chronostratigraphy are: event stratigraphy, magnetostratigraphy, sequence stratigraphy, and biostratigraphy. Below are explanations of each of these techniques.\n\nWhat is Event Stratigraphy? Event stratigraphy involves identifying the sedimentary effects of an unusual event in multiple stratigraphic columns. If one can demonstrate the the effects were all produced by the same event, one can reasonably interpret the effects to have happened at the same time in the different columns. This is done via marker beds and event horizons. A marker bed is a bed/thin subdivision of a layer with distinctly different characteristics from the host sediment above or below it. For a marker bed to be useful, it must be easily traced over long distances. An event horizon is a discontinuity surface within the stratigraphic sequence where the normal progression of the stratigraphy is altered. Events can be an erosional,depositional, or biological episode where the evidence of the event can be clearly seen in stratigraphic sequence. Figure 1: Fairport Chalk bentonite marker bed beneath a shallow ledge of limestone Photo: Libretexts https://upload.wikimedia.org/wikipedia/commons/a/ab/Fairport_Chalk_bentonite_marker_bed_F-1_20171230.jpg The usefulness of event stratigraphy is that one can prove that the sedimentary effects of an event happened at the same time in different stratigraphic columns. For example, volcanoes often spread ash out over wide areas and this ash is preserved in stratigraphic section. If geologists can prove the ash in different stratigraphic sections came from the same volcanic event, a chronostratigraphic correlation can be made between the sections. The issue with event stratigraphy is that the event has to impact multiple depositional environments. Since each depositional environment is governed by different processes, an individual event may not be universally impactful enough to distinguish it from normal depositional processes across each affected environment. Another issue is that the event has to be specific to the area of study in interest (ash deposits may not help you when looking for evidence of a tsunami event) and often there are multiple events within a stratigraphic sequence which can complicate chronological correlations with other sequences.\n\nWhat is Magnetostratigraphy? Magnetostratigraphy is a geophysical technique concerned with the correlation/dating of sedimentary and volcanic sequences. In rocks, magnetic minerals can become magnetized and align with the Earth's magnetic field. When these minerals become lithified, the magnetization is preserved and the direction of magnetization can be measured. This is useful because over Earth's history there has been several reversals of the magnetic poles and this occurred globally so paleomagnetists have been able to use this data to map out the times in Earth's history where the magnetic field was normal and reversed. In sedimentary rocks, clay-sized minerals align like magnets to the Earth's poles and when an igneous rock cools it acquires a thermoremanent magnetization from the Earth's magnetic field. Any stratigraphic section that preserved remanent magnetism containing a series of reversals ought to be matchable to the global magnetic polarity time scale. Some of the strengths of this method are: the unique patterns of geomagnetic reversals are isochronous (occurring at the same time) global marker beds\n\nthe reversals are present as long as minerals containing remanent magnetism are present (this is totally independent of facies). This is why geologists are able to correlate marine to continental units with magnetostratigraphy\n\nradiometric dating is always subject to margins of error, whereas a rock's paleomagnetic polarity is absolute. Knowing the paleomagnetic polarity of a sample can give a means of constraining its age independent of radiometric methods. Figure 2: This is the Magnetic Polarity Time Scale correlated to the Geologic time scale. Black periods are \"normal\" (North points to today's true north) and white periods are \"reversed\". Figure: from Libretexts The drawbacks of magnetostratigraphy are: Magnetostratigraphy requires a stratigraphic section in which a pattern of reversals is visible! Whereas a lithostratigraphic marker bed, biozone, or chemostratigraphic anomaly might be recognized from a single outcrop.\n\nChanges in depositional rate or disconformities can obscure/alter the magnetostratigraphic pattern within a stratigraphic section\n\nSome intervals of geologic time are not useful because they contain few reversals so it is hard to correlate it to the Magnetic Polarity Time Scale\n\nWhat is Sequence Stratigraphy? This section based on this webpage Sequence stratigraphy is the branch of sedimentary stratigraphy that deals with the order/sequence in which depositionally related strata (rock units) were laid down in the available spaces at the time of deposition. Basically, it is the analysis of sedimentary deposits in a time-stratigraphic context and involves subdividing sedimentary basin fill into individual sequences of deposition which can then be linked to changes in the two parameters of sediment supply and accommodation. The main purpose of this technique is to reconstruct how sediments filled a basin and how the stratigraphy was formed through space and time. Sequence stratigraphy can help geologists figure out how sea level has changed by looking for where coarse and fine grained sediments were deposited within a basin. Below are some terms used in sequence stratigraphy: Eustasy - sea level at a given time (influenced by tectonic movement)\n\nTransgression - periods of sea level rise which leave retrogradational stacking patterns of strata\n\nRegression - periods of sea level fall which leave progradational stacking patterns of strata Figure 3: The depositional effects of sea rise and fall on stratigraphy. Note the different stratigraphic layers and how transgression and regression have distinct patterns. Photo: SEPM Strata In the figure above, the effects of transgression and regression are shown. Sea level rise results in a retrogradational stacking pattern while sea level fall results in a progradational stacking pattern. In B, the beach layer is spread out and moved up the beach as the sea level rises. In C, the beach layer is spread out and pulled back in to the ocean as the sea level falls. In sequence stratigraphic models, sediment supply is often assumed to be constant while accommodation (the space available for potential sediment accumulation) changes through time as a result of fluctuations in sea level. The different sedimentary sequences refer to the amount of stratigraphy that was deposited during an episode of sea level fall and subsequent rise. Sequence stratigraphic models are a simplification of of what actually happened and are often complicated and full of difficult terminology, but it is still a very useful tool for economic geologists because it allows them to better understand the stratigraphy of sedimentary basins of value."}, {"url": "https://geo.libretexts.org/Bookshelves/Geology/Book%3A_An_Introduction_to_Geology_(Johnson_Affolter_Inkenbrandt_and_Mosher)/07%3A_Geologic_Time/7.01%3A_Relative_Dating", "page_content": "Relative dating is the process of determining if one rock or geologic event is older or younger than another, without knowing their specific ages—i.e., how many years ago the object was formed. The principles of relative time are simple, even obvious now, but were not generally accepted by scholars until the scientific revolution of the 17th and 18th centuries [3]. James Hutton (see Chapter 1) realized geologic processes are slow and his ideas on uniformitarianism (i.e., “the present is the key to the past”) provided a basis for interpreting rocks of the Earth using scientific principles.\n\nFigure \\(\\PageIndex{1}\\): A Geologic Time Scale\n\nRelative Dating Principles Stratigraphy is the study of layered sedimentary rocks. This section discusses principles of relative time used in all of geology, but are especially useful in stratigraphy. Figure \\(\\PageIndex{1}\\): Lower strata are older than those lying on top of them. Principle of Superposition: In an otherwise undisturbed sequence of sedimentary strata, or rock layers, the layers on the bottom are the oldest and layers above them are younger. Principle of Original Horizontality: Layers of rocks deposited from above, such as sediments and lava flows, are originally laid down horizontally. The exception to this principle is at the margins of basins, where the strata can slope slightly downward into the basin. Figure \\(\\PageIndex{1}\\): Lateral continuity Principle of Lateral Continuity: Within the depositional basin, strata are continuous in all directions until they thin out at the edge of that basin. Of course, all strata eventually end, either by hitting a geographic barrier, such as a ridge, or when the depositional process extends too far from its source, either a sediment source or a volcano. Strata that are cut by a canyon later remain continuous on either side of the canyon. Figure \\(\\PageIndex{1}\\): Dark dike cutting across older rocks, the lighter of which is younger than the grey rock. Principle of Cross-Cutting Relationships: Deformation events like folds, faults and igneous intrusions that cut across rocks are younger than the rocks they cut across. Principle of Inclusions: When one rock formation contains pieces or inclusions of another rock, the included rock is older than the host rock. Figure \\(\\PageIndex{1}\\): Fossil succession showing the correlation among strata. Principle of Fossil Succession: Evolution has produced a succession of unique fossils that correlate to the units of the geologic time scale. Assemblages of fossils contained in strata are unique to the time they lived and can be used to correlate rocks of the same age across a wide geographic distribution. Assemblages of fossils refer to groups of several unique fossils occurring together.\n\nGrand Canyon Example Figure \\(\\PageIndex{1}\\): The Grand Canyon of Arizona The Grand Canyon of Arizona illustrates the stratigraphic principles. The photo shows layers of rock on top of one another in order, from the oldest at the bottom to the youngest at the top, based on the principle of superposition. The predominant white layer just below the canyon rim is the Coconino Sandstone. This layer is laterally continuous, even though the intervening canyon separates its outcrops. The rock layers exhibit the principle of lateral continuity, as they are found on both sides of the Grand Canyon which has been carved by the Colorado River. Figure \\(\\PageIndex{1}\\): The rocks of the Grand Canyon The diagram called “Grand Canyon’s Three Sets of Rocks” shows a cross-section of the rocks exposed on the walls of the Grand Canyon, illustrating the principle of cross-cutting relationships, superposition, and original horizontality. In the lowest parts of the Grand Canyon are the oldest sedimentary formations, with igneous and metamorphic rocks at the bottom. The principle of cross-cutting relationships shows the sequence of these events. The metamorphic schist (#16) is the oldest rock formation and the cross-cutting granite intrusion (#17) is younger. As seen in the figure, the other layers on the walls of the Grand Canyon are numbered in reverse order with #15 being the oldest and #1 the youngest [4]. This illustrates the principle of superposition. The Grand Canyon region lies in Colorado Plateau, which is characterized by horizontal or nearly horizontal strata, which follows the principle of original horizontality. These rock strata have been barely disturbed from their original deposition, except by a broad regional uplift. Figure \\(\\PageIndex{1}\\): The red, layered rocks of the Grand Canyon Supergroup overlying the dark-colored rocks of the Vishnu schist represents a type of unconformity called a nonconformity. The photo of the Grand Canyon here show strata that were originally deposited in a flat layer on top of older igneous and metamorphic “basement” rocks, per the original horizontality principle. Because the formation of the basement rocks and the deposition of the overlying strata is not continuous but broken by events of metamorphism, intrusion, and erosion, the contact between the strata and the older basement is termed an unconformity. An unconformity represents a period during which deposition did not occur or erosion removed rock that had been deposited, so there are no rocks that represent events of Earth history during that span of time at that place. Unconformities appear in cross-sections and stratigraphic columns as wavy lines between formations. Unconformities are discussed in the next section.\n\nUnconformities Figure \\(\\PageIndex{1}\\): All three of these formations have a disconformity at the two contacts between them. The pinching Temple Butte is the easiest to see the erosion, but even between the Muav and Redwall, there is an unconformity. There are three types of unconformities, nonconformity, disconformity, and angular unconformity. A nonconformity occurs when sedimentary rock is deposited on top of igneous and metamorphic rocks as is the case with the contact between the strata and basement rocks at the bottom of the Grand Canyon. The strata in the Grand Canyon represent alternating marine transgressions and regressions where sea level rose and fell over millions of years. When the sea level was high marine strata formed. When sea-level fell, the land was exposed to erosion creating an unconformity. In the Grand Canyon cross-section, this erosion is shown as heavy wavy lines between the various numbered strata. This is a type of unconformity called a disconformity, where either non-deposition or erosion took place. In other words, layers of rock that could have been present, are absent. The time that could have been represented by such layers is instead represented by the disconformity. Disconformities are unconformities that occur between parallel layers of strata indicating either a period of no deposition or erosion. Figure \\(\\PageIndex{1}\\): In the lower part of the picture is an angular unconformity in the Grand Canyon known as the Great Unconformity. Notice the flat-lying strata over dipping strata (Source: Doug Dolde). The Phanerozoic strata in most of the Grand Canyon are horizontal. However, near the bottom horizontal strata overlie tilted strata. This is known as the Great Unconformity and is an example of an angular unconformity. The lower strata were tilted by tectonic processes that disturbed their original horizontality and caused the strata to be eroded. Later, horizontal strata were deposited on top of the tilted strata creating an angular unconformity. Here are three graphical illustrations of the three types of unconformity. Figure \\(\\PageIndex{1}\\): Disconformity Disconformity, where is a break or stratigraphic absence between strata in an otherwise parallel sequence of strata. Figure \\(\\PageIndex{1}\\): Nonconformity (the lower rocks are igneous or metamorphic) Nonconformity, where sedimentary strata are deposited on crystalline (igneous or metamorphic) rocks. Figure \\(\\PageIndex{1}\\): Angular unconformity Angular unconformity, where sedimentary strata are deposited on a terrain developed on sedimentary strata that have been deformed by tilting, folding, and/or faulting. so that they are no longer horizontal."}, {"url": "https://stratigraphy.org/guide/bio", "page_content": "Stratigraphic Guide\n\nChapter 7. Biostratigraphic Units\n\nA. Nature of Biostratigraphic Units\n\nBiostratigraphic units (biozones) are bodies of strata that are defined or characterized on the basis of their contained fossils.\n\nBiostratigraphic units exist only where the particular diagnostic feature or attribute on which they are based has been identified. Biostratigraphic units, therefore, are descriptive units based on the identification of fossil taxa. Their recognition depends on the identification of either their defining or characterizing attributes. Biostratigraphic units may be enlarged to include more of the stratigraphic record, both vertically and geographically, when additional data are obtained. In addition, since they depend on taxonomic practice, changes in their taxonomic base may enlarge or reduce the body of strata included in a particular biostratigraphic unit.\n\nA biostratigraphic unit may be based on a single taxon, on combinations of taxa, on relative abundances, on specified morphological features, or on variations in any of the many other features related to the content and distribution of fossils in strata. The same interval of strata may be zoned differently depending on the diagnostic criteria or fossil group chosen. Thus, there may be several kinds of biostratigraphic units in the same interval of strata that may have gaps between them or overlaps of their vertical and horizontal ranges.\n\nBiostratigraphic units are distinct from all other kinds of stratigraphic units in that the organisms whose fossil remains define them show evolutionary changes through geologic time that are not repeated in the stratigraphic record.\n\nThis makes the fossil assemblages of any one age distinctive from any other.\n\nThe relationship of biostratigraphic units to other kinds of stratigraphic units is discussed in Chapter 10.\n\nB. The Fossils\n\n1. Value of fossils\n\nFossils were once living organisms and as such are sensitive indicators of past environments, sedimentation patterns, and their distributions.\n\nIn addition, because of the irreversibility of evolution, fossils are particularly useful in working out the relative times of origin of sedimentary strata.\n\n2. Fossil assemblages\n\nNot all sedimentary rocks contain fossils but when they are present they reflect assemblages which have either lived and were buried in the area (biocoenosis), or they lived somewhere else and were brought into the area after death (thanatocoenosis), or they contain organisms transported alive away from their normal environment.\n\nThese may be mixed or interbedded in any proportion. All categories of fossil-bearing strata may be the basis for biostratigraphic zonation. Intervals lacking identifiable fossils or entirely without fossils are not subject to biostratigraphic classification.\n\n3. Reworked fossils\n\nFossils from rocks of one age that have been eroded, transported, and redeposited in sediments of a younger age. Because of the difference in their significance with respect to age and environment, they should be treated apart from those believed to be indigenous.\n\n4. Introduced or infiltrated fossils\n\nFossils introduced into older or younger rocks by fluids, through animal burrows or root cavities, or by sedimentary dikes or diapirs.They should be distinguished from indigenous fossils in biostratigraphic zonation.\n\n5. Effects of stratigraphic condensation\n\nExtremely low rates of sedimentation may result in fossils of different ages and different environments being mingled or very intimately associated in a very thin stratigraphic interval, even in a single bed.\n\nC. Definitions\n\n1. Biostratigraphy\n\nThe element of stratigraphy that deals with the distribution of fossils in the stratigraphic record and the organization of strata into units on the basis of their contained fossils.\n\n2. Biostratigraphic classification\n\nThe systematic subdivision and organization of the stratigraphic section into named units based on their fossil content.\n\n3. Biostratigraphic zone (Biozone)\n\nA general term for any kind of biostratigraphic unit regardless of thickness or geographic extent. See section 3.A.7. After initial usage of a formal term, such as the Globigerina brevis Taxon-range Biozone, a simplified version of the formal nomenclature may be used, e.g. Globerigina brevis Zone. Biozones vary greatly in thickness, geographic extent, and represented time span.\n\n4. Biostratigraphic horizon (Biohorizon)\n\nA stratigraphic boundary, surface, or interface across which there is a significant change in biostratigraphic character.\n\nA biohorizon has no thickness and should not be used to describe very thin stratigraphic units that are especially distinctive.\n\n5. Subbiozone (Subzone)\n\nA subdivision of a biozone.\n\n6. Superbiozone (Superzone)\n\nA grouping of two or more biozones with related biostratigraphic attributes.\n\n7. Zonule\n\nThe use of this term is discouraged. It has received different meanings and is now generally used as a subdivision of a biozone or subbiozone.\n\n8. Barren intervals\n\nStratigraphic intervals with no fossils are common in the stratigraphic section, both betweeen successive biozones and within a biozone. They are not subject to biostratigraphic classification but may be referred to as barren intervalls.\n\nD. Kinds of Biostratigraphic Units\n\n1. General\n\nFive kinds of biozones are in common use:range zones, interval zones, assemblage zones, abundance zones, and lineage zones. These types of biozones have no hierarchical significance, and are not based on mutually exclusive criteria. A single stratigraphic interval may, therefore, be divided independently into range zones, interval zones, etc., depending on the biostratigraphic features chosen.\n\n2. Range Zone\n\nThe body of strata representing the known stratigraphic and geographic range of occurrence of a particular taxon or combination of two taxa of any rank.\n\nThere are two principal types of range zones: taxon-range zones and concurrent-range zones.\n\na. Taxon-range Zone\n\ni. Definition\n\nThe body of strata representing the known range of stratigraphic and geographic occurrence of specimens of a particular taxon. It is the sum of the documented occurrences in all individual sections and localities from which the particular taxon has been identified.\n\nii. Boundaries\n\nThe boundaries of a taxon-range zone are biohorizons marking the outermost limits of known occurrence in every local section of specimens of the taxon whose range is to be represented by the zone. The boundaries of a taxon-range zone in any one section are the horizons of lowest stratigraphic occurrence (LO) and highest stratigraphic occurrence (HO) of the specified taxon in that section.\n\niii. Name\n\nThe taxon-range zone is named from the taxon whose range it expresses.\n\niv. Local Range of a Taxon\n\nThe local range of a taxon may be specified in some local section, area, or region as long as the context is clear.\n\nb. Concurrent-range Zone\n\ni. Definition\n\nThe body of strata including the overlapping parts of the range zones of two specified taxa.\n\nThis type of zone may include taxa additional to those specified as characterizing elements of the zone, but only the two specified taxa are used to define the boundaries of the zone.\n\nii. Boundaries\n\nThe boundaries of a concurrent-range zone are defined in any particular stratigraphic section by the lowest stratigraphic occurrence (LO) of the higher-ranging of the two defining taxa and the highest stratigraphic occurrence (HO) of the lower-ranging of the two defining taxa.\n\niii. Name\n\nA concurrent-range zone is named from both the taxa that define and characterize the biozone by their concurrence.\n\n3. Interval Zone\n\na. Definition\n\nThe body of fossiliferous strata between two specified biohorizons.\n\nSuch a zone is not itself necessarily the range zone of a taxon or concurrence of taxa; it is defined and identified only on the basis of its bounding biohorizons.\n\nIn subsurface stratigraphic work, where the section is penetrated from top to bottom and paleontological identification is generally made from drill cuttings, often contaminated by recirculation of previously drilled sediments and material sloughed from the walls of the drill hole, interval zones defined as the stratigraphic section comprised between the highest known occurrence (first occurrence downward) of two specified taxa are particularly useful.\n\nIn subsurface stratigraphic work, where the section is penetrated from top to bottom and paleontological identification is generally made from drill cuttings, often contaminated by recirculation of previously drilled sediments and material sloughed from the walls of the drill hole, interval zones defined as the stratigraphic section comprised between the highest known occurrence (first occurrence downward) of two specified taxa are particularly useful. This type of interval zone has been called “last-occurrence zone” but should preferably be called “highest-occurrence zone”.\n\nInterval zones defined as the stratigraphic section comprised between the lowest occurrence of two specified taxa (“lowest-occurrence zone”) are also useful, preferably in surface work. Interval zones defined between the highest occurrence of an oldest taxon and the lowest occurrence of a younger taxon are also used, particular in plankton stratigraphy.\n\nb. Boundaries\n\nThe boundaries of an interval zone are defined by the occurrence of the biohorizons selected for its definition.\n\nc. Name. The names given to interval zones may be derived from the names of the boundary horizons, the name of the basal boundary preceding that of the upper boundary; e.g. Globigerinoides sicanus-Orbulina suturalis Interval Zone.\n\nIn the definition of an interval zone, it is desirable to specify the criteria for the selection of the bounding biohorizons, e.g. lowest occurrence, highest occurrence etc.\n\nAn alternative method of naming uses a single taxon name for the name of the zone. The taxon should be a usual component of the zone, although not necessarily confined to it.\n\n4. Lineage Zone\n\nLineage zones are discussed as a separate category because they require for their definition and recognition not only the identification of specific taxa but the assurance that the taxa chosen for their definition represent successive segments of an evolutionary lineage.\n\na. Definition\n\nThe body of strata containing specimens representing a specific segment of an evolutionary lineage.\n\nIt may represent the entire range of a taxon within a lineage or only that part of the range of the taxon below the appearance of a descendant taxon.\n\nThe boundaries of lineage zones have strong time significance and approach the boundaries of chronostratigraphic units. However, a lineage zone differs from a chronostratigraphic unit in being restricted to the actual presence of the segment of the evolutionary lineage upon which it is based.\n\nLineage zones are the most reliable means of correlation of relative time by use of the biostratigraphic method.\n\nb. Boundaries\n\nThe boundaries of a lineage zone are determined by the biohorizons representing the lowest occurrence of successive elements of the evolutionary lineage under consideration\n\nc. Name\n\nA lineage zone is named for the taxon in the lineage whose range or partial range it represents.\n\n5. Assemblage Zone\n\na. Definition\n\nThe body of strata characterized by an assemblage of three or more fossil taxa that, taken together, distinguishes it in biostratigraphic character from adjacent strata.\n\nb. Boundaries\n\nThe boundaries of an assemblage zone are drawn at biohorizons marking the limits of occurrence of the specified assemblage that is characteristic of the unit. Not all members of the assemblage need to occur in order for a section to be assigned to an assemblage zone, and the total range of any of its constituents may extend beyond the boundaries of the zone.\n\nc. Name\n\nThe name of an assemblage zone is derived from the name of one of the prominent and diagnostic constituents of the fossil assemblage.\n\n6. Abundance zone (or acme zone)\n\na. Definition\n\nThe body of strata in which the abundance of a particular taxon or specified group of taxa is significantly greater than is usual in the adjacent parts of the section.\n\nUnusual abundance of a taxon or taxa in the stratigraphic record may result from a number of processes that are of local extent, but may be repeated in different places at different times.For this reason, the only sure way to identify an abundance zone is to trace it laterally.\n\nb. Boundaries\n\nThe boundaries of an abundance zone are defined by the biohorizons across which there is notable change in the abundance of the specified taxon or taxa that characterize the zone.\n\nc. Name\n\nThe abundance zone takes its name from the taxon or taxa whose significantly greater abundance it represents.\n\nE. Hierarchy of Biostratigraphic Units\n\nThe different kinds of biostratigraphic units described above do not represent different ranks of a biostratigraphic hierarchy, except in the case of subzones and superzones, where the prefix indicates the position in a hierarchy.\n\nF. Procedures for establishing Biostratigraphic Units\n\nIt is recommended that the definition or characterization of a biostratigraphic unit include the designation of one or more specific reference sections that demonstrate the stratigraphic context of the taxon or taxa diagnostic of the unit.\n\nG. Procedures for extending Biostratigraphic Units - Biostratigraphic Correlation\n\nBiostratigraphic units are extended away from the areas where they were defined or from their reference sections by biostratigraphic correlation, which is the establishment of correspondence in biostratigraphic character and position between geographically separated sections or outcrops based on their fossil content. Biostratigraphic correlation is not necessarily time-correlation. It may approximate time correlation, or it may be the identification of the same biofacies, which may be diachronous; unconformities may also truncate the ranges of taxa, reducing considerably their normal ranges.\n\nH. Naming Biostratigraphic Units\n\nThe formal name of a biostratigraphic unit should be formed from the names of one, or no more than two, appropriate fossils combined with the appropriate term for the kind of unit in question. The function of a name is to provide a unique designation for the biozone. Thus, any taxon in the characteristic assemblage of a biozone may serve as name-bearer unless it is already part of the name of a biozone in a different zonal scheme.\n\nThe printing of fossil names for stratigraphic units should be guided by the rules laid down in the International Code of Zoological Nomenclature or the International Code of Botanical Nomenclature. The initial letter of the unit-term (Biozone, Zone, Assemblage Zone) should be capitalized as well as that of the generic names; the initial letter of the specific epithets should be in lowercase; taxonomic names of genera and species should be in italics, for example Exus albus Range Zone.\n\nThe name of the taxon chosen to designate a biozone should include the entire name of the taxon. Thus, Exus albus is correct. After the first mention, the name may be abbreviated in any way consistent with clarity.\n\nCodification of biostratigraphic zones by letters or numbers or a combination of both is common practice. If used consistently and judiciously such code designations can be extremely useful. They are brief, generally indicate the sequence and relative positions of the zones, and they facilitate communication between biostratigraphers, geologists, and other professionals. However, they do not lend themselves to insertions, combinations, deletions, or other modifications once the zonation has been published. Also, they may be a source of confusion if more than one zonation of a particular sequence of strata employs the same designations but in different ways. Code designations of biostratigraphic units should be considered informal nomenclature.\n\nI. Revision of Biostratigraphic Units\n\nRevision of biostratigraphic units honors priority for the sake of stability and precision in communication.\n\nHowever, the first biostratigraphic zonation to be described is not necessarily the most useful. Revision or new biozonations should be clearly defined and/or characterized, be more widely applicable, offer greater precision, and be more easily identified.\n\nChanges in nomenclature of biostratigraphic units conform with changes in the names of taxa as required by the International Codes of Zoological and Botanical Nomenclature.\n\nNamed biostratigraphic units will automatically change scope to accord with changes in the scope of taxa defining or characterizing them. A fossil name once used for a biozone is not available for use in a different zonal sense by a later author. If it is desirable to continue the use of a taxonomic term that is no longer valid, the term should be placed in quotation marks, e.g. “Rotalia” beccari Zone."}, {"url": "https://www.vedantu.com/geography/stratigraphy", "page_content": "Understanding the stratigraphy meaning becomes quite simple when you get familiar with the stratigraphy principle of geology. Stratigraphy is a branch of geology that deals with the description of rock or interpretation of geologic time scale. It also renders insight into the geologic history of strata. As a geological discipline, stratigraphy takes into account the spatial location and temporal sequence of rock bodies. With the help of stratigraphy, bodies of rock are dated and interlinked with each other. Stratigraphic studies are mainly conducted to study sedimentary and volcanic layered rocks.\n\n[Image will be Uploaded Soon]\n\nThe Stratigraphic Principle\n\nStratigraphy organizes bodies of rock chronologically and spatially in accordance with their contained characteristics. It puts indirectly connected rock units together in a relationship. Stratigraphy is the substructure for remodelling the Earth’s history. It also plays a part in solving general geological questions.\n\n\n\n\n\nThe stratigraphic principle was initially introduced in 1669 by Nicolaus Steno in his documented work ‘Dissertations prodromus’. It has been founded and formulated on the foundation that, with a smooth sequence of sedimentary layers, the layer in the footwall (below) is older (matured) than the layer in the hanging wall (above).\n\nTypes of Stratigraphy\n\nFollowing are the most important sub-disciplines in stratigraphy with their elements of study:\n\nLithostratigraphy (Lithostratigraphic unit) Biostratigraphy (Zones) Chronostratigraphy [(Chronostratigraphic units) {Age, Period, Epoch}] Magnetostratigraphy (Reversals, chrons) Sequence stratigraphy (Allostratigraphic units) Pedostratigraphy – (Pedostratigraphic unit) Geo Chronostratigraphy — (Geochronostratigraphic unit) Chemostratigraphy (Isotope zones)\n\nStratigraphic Relationship\n\nThere are two types of contact in stratigraphy i.e.: conformable and unconformable.\n\nConformable: Non-fragmented accumulation, no breakages or hiatus (interruption or impairment in the continuity of the geological record). The resulting surface strata are known as conformity. Further, there are two forms of contact between conformable strata: abrupt contacts (directly isolated beds of distinctly distinguished lithology, minor depositional break, referred to diastems) and gradational contact (steady change in deposition, mixing zone). Unconformable: Period of weathering/non-deposition. The surface stratum resulting is known as an unconformity. There are further\n\nFour Kinds of Unconformity:\n\nAngular Unconformity: younger sediment lies upon a weathered surface of folded or slanted older rocks. The older rock steeps at a different angle from the younger.\n\nDisconformity: the contact between older and younger beds is noted by apparent, non-uniform weathering surfaces. Paleosol might form right above the disconformity surface due to the non-deposition setting.\n\nNonconformity: comparatively young sediments are accumulated right above older igneous or metamorphic rocks.\n\nParaconformity: the bedding planes below and above the unconformity run parallel to one another. A time gap exists, as depicted by a faunal break, but there is no weathering, just a period of non-accumulation.\n\nStratigraphic Subdivision\n\nConcept of Zone\n\nWith respect to stratigraphic subdivision, there is the concept of stage. A stage is a crucial subdivision of strata, each minutely following each other while bearing a unique, distinctive assemblage of fossils. Thus, stages can be described as a group of strata consisting of the same major fossil assemblages. French palaeontology Alcide d’Orbigny is felicitated for the introduction and implementation of this concept. He named stages after geographic localities with specifically finer sections of rock strata that carry the characteristic fossils on which the stages are established.\n\nConcept of Zone\n\nThe zone is an elementary biostratigraphic unit. The thickness of the unit ranges from a few to hundreds of metres, and its extent ranges from local to global. Biostratigraphic units are further classified into 6 principal kinds of biozones that are as below:\n\nAssemblage Biozones: These are strata that consist of a special correlation of three or more taxa. Abundance Biozones: These are strata in which the abundance of a specific taxon or group of taxa is considerably higher than in the adjacent part of the section. Concurrent Range Biozone: It includes the coincident, concurrent or overlapping part of the range of two particular taxa. Interval Biozone: It includes the strata between two particular biostratigraphic surfaces. It can be established on either the highest or lowest occurrences. Lineage Biozone: These are strata consisting of species demonstrating a particular segment of an evolutionary lineage. Taxon Range Biozone: It depicts the known stratigraphic and geographic range of formation of a single taxon.\n\nSequence Stratigraphy\n\nSequence stratigraphy is an evaluation of sedimentary deposits in a time-stratigraphic aspect. It generally includes subdividing a sedimentary basin fill into individual sequences of accumulation (thus the name), which can then be associated with alterations in the two elementary parameters of sediment supply and shelter (the amount of space available for accumulation). A key purpose of this is to reconstruct how sediments filled a basin and thus, how the stratigraphy occurred through time and space. This can enable geologists and scientists to identify many significant aspects like finding out where fine and coarse-grained sediments are located and how sea level changed.\n\nUses of Sequence Stratigraphy\n\nOver the years, sequence stratigraphy has transpired to be an extensively used, methodological framework that confines many contexts of sedimentology and stratigraphy and has different useful applications and anticipating capacities."}, {"url": "https://preparmy.com/physical-science/geology/stratigraphic-classification-nomenclature-descriptions/", "page_content": "Stratigraphic Classification and nomenclature\n\nOf the many possible kinds of stratigraphic units, three have been particularly useful. They are\n\nLithographic (or Rock-stratigraphic) Units: Biostratigraphic units Chronostratigraphic (or Time-rock or Time-stratigraphic) units.\n\nThe above three types units are interrelated in many ways. However, a separate scheme of classification and terminology has developed for each type of unit. Considerable controversy exists about the relative importance of these three separate classification. However, each is important for particular purposes and relative importance varies with the circumstances. Lithostratigraphic studies constitute the first step in establishing the stratigraphy of any area/region and though lithostratigraphic and biostratigraphic studies should generally precede chronostratigraphic classification.\n\nSome basic Definitions of Stratigraphic\n\nStratum: A geologic stratum is a layer of rock with some unifying characters, properties or attributes, distinguishing it from adjacent layers. Adjacent strata may be separated by visible planes of bedding or parting or by less perceptible boundaries of changes in lithology, mineralogy, fossil content, chemical constitutions, physical properties, age or other properties of rocks. Stratigraphic units: A stratigraphic unit is a stratum or assemblage of adjacent strata, recognized as an unit (or distinct entity) in the classification of the Earth’s rock sequence, with respect to any of the many characters, properties or attributes which the rock may possess. Formal vs. Informal Stratigraphical terminology: Stratigraphic units and their names are classified as informal if they are not formally proposed and are used in a broad or a free sense without the precise connotation as required by the code of stratigraphic nomenclature. A formal unit is a name representative of an established or conventionally agreed scheme of classification.\n\nEarlier established stratigraphic units and their nomenclature, if they do not conform to the code and satisfy the rules are considered as “informal”. They are placed in inverted comma or parentheses if they are used. The initial letter of a named formal unit/term should be in capital.\n\nCorrelation: To correlate in a stratigraphic sense is to show correspondence in character of the strata and their stratigraphic positions. Lithological correlation is a demonstration of correspondence in lithologic character and stratigraphic position. A correlation of two fossil beds is a demonstration of correspondence in their content and in their stratigraphic position. A chronostratigraphic correlation is a demonstration of correspondence in age and stratigraphic position.\n\nLithostratigraphic units:\n\nThe lithostratigraphic units are the subdivision of rocks in the Earth’s crust distinguished and delimited on the basis of lithologic characteristics. The units are recognized and defined by observable physical features rather than by inferred geological history; boundaries may be placed at sharp contacts or drawn arbitrarily within a zone of gradation. Both vertical and lateral lithostratigraphic boundaries are placed where the lithology changes. Rock-stratigraphic units are the practical units of general geological work that serve as a foundation for describing, mapping and studying lithology, local and regional structures, stratigraphy, economic resources and geologic history. The units are independent of any time concept. Their boundaries may coincide with or transgress time horizons. The ‘Formation’ is the fundamental unit in rock stratigraphic classifications. A formation is a body of rock characterized by lithologic homogeneity; it is mappable at the Earth’s surface or traceable in the subsurface.\n\nRanks of Lithostratigraphic Units\n\nThe following hierarchy of formal lithostratigraphic units is recognized\n\nSupergroup\n\nGroup\n\nSubgroup\n\nFormation\n\nMember\n\nBed\n\nA member is next in rank below a formation it is not defined by specified shape, extent or thickness. A bed is the lowest rank in formal lithostratigraphic unit. A group consists of two or more successive and naturally related or associated formation and is higher in rank than a “Formation”. In certain areas stratigraphers have named and defined assemblages of formations, within already established useful groups of formations; these constitute supergroups eg., Vindhyan Supergroups\n\nBiostratigraphic Units: A biostratigraphic unit is a body of rock strata characterized by its content of fossils contemporaneous with the deposition of strata. All fossils contained in a biostratigraphic unit are remains of organisms that lived when the sediment surrounding them was deposited. The organisms might have been buried in situ or transported to their place of burial, but in either case, they belong to the deposit as contemporaneous original constituents. Some sedimentary rocks contain reworked fossils derived from other rocks; they can be distinguished from the fauna and flora indigenous to the deposits and are to be ignored in defining a biostratigraphic unit. Biostratigraphic units are fundamentally different from rock stratigraphic units. The boundaries of these two types of units may or may not coincide. The biostratigraphic evidence is the most useful means of determining time-stratigraphic boundaries. Fossils reflect irreversible evolutionary change and adoption to the environment and all biostratigraphic units are records of time and biofacies\n\nTypes of Biostratigraphic Zones:\n\nTwo types of formal biostratigraphic zones are recognized viz.,\n\nThe assemblage zone The range zone\n\nAn assemblage zone is body of strata characterized by a certain natural assemblage or association of fossils, with regard to their ranges, eg. Meeker as assemblage zone of Spiti. Thus, it is a body of strata whose content of fossils of a certain kind taken in its entirety constitutes a natural assemblage or association from adjacent strata. An assemblage zone should have a specifically designated and decimated type section or reference section, eg., the otoceras – Ophiceras assemblage zone, Lilang, and Spiti, characteristics fossils of an assemblage zone are called guide fossils.\n\nA range zone is a body of strata representing the total horizontal and vertical range of occurrence of one particular species or genus, e.g., Miscellanes miscella range zone. The principal reference of a range zone is the type specimen or reference specimen.\n\nAn epibole (acme zone/peak zone) is the body of strata representing the maximum development of a species/genus. It is a special type of range zone. Eg., Glossopteris acme zone in the flora of Raniganj Formation.\n\nThe fossil names are to be italicized. The initial letter of formal zone terms, except the name of species should be capitalized.\n\nBiostratigraphic boundaries may be directly or indirectly applicable to establishing both rock stratigraphic and time-stratigraphic units. They contribute to a better understanding of the correlation, depositional and faunal history of strata sequence.\n\nChronostratigraphic units and Geological Time units:-\n\nA chronostratigraphic unit is a body of rock strata unified by representing the rocks formed during a specific interval of geological time. The geologic time units are abstract units and are defined after the chronostratigraphic unit.\n\nA chronostratigraphic unit is defined after a specifically designate and delimited type section or reference section. Each unit is the record of an interval of time that extended from the part to the end of its deposition. These units are used for\n\nCorrelation of rocks of different areas on the basis of age equivalence or contemporaneity of origin Establishing the systematic geologic time sequence of rocks for indicating their relative position and age with respect to Earth’s history.\n\nBoth the upper and lower limit of a chronostratigraphic unit should be defined in the type section for providing a standard for the unit. In the type area, the boundary should preferably be based on stratigraphically useful objective criteria representing some significant geological episodes. In the type area, the boundaries are usually made to coincide with one of the observable stratigraphic units (either biostratigraphic or lithostratigraphic). Paleontological parameters provide the most successful way of local and worldwide correlation of all rank of Phanerozoic chronostratigraphic units. Relationship to adjacent strata, unconformities, and intrusions, lithologic similarity, radioactive ages, et., are also useful in local time correlation.\n\nThe isotopic age determination technique can be applied to sedimentary rock by dating authigenic minerals and to igneous rocks by dating suitable primary minerals. Radiometric age determination is of great importance for interregional and intraregional chronostratigraphic correlation of Precambrian rocks.\n\nRanks of Chronostratigraphic and Geologic Time Units: The hierarchy of these units is as under:\n\nA system is chronostratigraphic unit of major representing a major division or grouping of rock strata corresponding to a specific major interval of geological time\n\nThe Phanerozoic rocks are formerly classified into the following system:\n\nCambrian, Ordovirian, Silurian, Devonian, Carboniferous, Permian, Triassic, Jurassic, Cretaceous, Tertiary and Quartrary.\n\nMost of the formal systems have their region in Europe. Subdivisions of some of the standard systems may be used locally, eg., Paleogene and Neogene subsystems of the Tertiary system.\n\nA series is a chronostratigraphic unit next in rank, below a system. The rocks of a series represent the specific interval of geological time of the type section of strata for the series. Both the boundaries of the types section or reference section should be defined with precise stratigraphic boundaries. Upper, Middle, and Lower may be used for series divisions of a system.\n\nA stage is a chronostratigraphic unit next in rank below a series. It is defined after a type section or reference section. It is an important unit for chronostratigraphic classification and correlation. Generally, it is based on a succession of zone of biostratigraphy. A stage can be subdivided into sub-stages, if necessary, ‘Chronozone’ may be used in informally to cover a body of strata formed during any minor interval of geological time. The time span is represented after a lithostratigraphic or biostratigraphic unit. ‘Age’ and ‘Time’ may be used informally to cover any geological time.\n\nA formal chronostratigraphic unit is usually given a binomial name. The initial letters should be capitalized e.g. Lower Cretaceous series: Devonian System. It should be named after a geographic feature in the type area. When fossil name is used, the fossil name (genus and species) should be capitalized and printed in Roman type to distinguish it from a biostratigraphic unit. Standard name approved by the International Subcommission on Stratigraphic Classification should be followed for the systems.\n\nThe term for the geologic time corresponding to a system is a period and bears the same name as the system. Eg. Cambrian period, Triassic Period. A period can be subdivided and referred to as Late, Middle, and Early. An era is geological time unit of higher rank, than the period and consists of several periods, eg., Paleozoic Era. A series is named after its position within a system qualified by capitalized adjective – Upper, Middle, and Lower, eg., Upper Triassic Series. A stage should preferably be named after the type area, eg., Camic Stage. The term for the geologic time corresponding to a stage is ‘age’ and bears the same name as the ‘stage’. The name of a sub stage should be derived from its type area.\n\nGeologic-Climatic units:\n\nA geologic Climatic unit is an inferred widespread climatic episode from a subdivision of Quaternary rocks. It is an abstract unit. A geologic-climatic unit is defined from the records which include rock bodies, soil and organic material. Such units can be extended geographically as far as the geologic climate record can be recognized. These units are used for correlating episodes of Quaternary deposition in different areas and in establishing the historical sequence of climatic events in the Quaternary period. Glaciation and interglaciation are the two units of geologic-climatic classification. These are named after a lithostratigraphic and soil stratigraphic units.\n\nSouth Africa and the erstwhile USSR differed from stratigraphers of the other parts of the world and did not approve of the three tier, Litho, Bio and Chronostratigraphic classification. South African geologists use only one set of stratigraphic terms- Group system, Series, stage., and consider the use of these terms, prefixed where necessary, by the qualifications Litho- or Chronostratigraphic, is to be preferred to separate series of terms for such system of classification. Soviet geologists believe that the system of stratigraphic subdivisions should represent natural stages of geological change of Earth as a whole or of individual large regions, and correspondingly should be based on the combination of all manifestations of deposition which objectively indicate these stages, namely by overall analysis of the complex data of evolution of the organic and non-organic world. They are of the view that each of the subdivisions of the Earth and in the evolution of the organic world. Thus, the Soviet geologist feels that in stratigraphy, there can only be one scale which unifies the stratigraphic subdivisions. They do not believe in the concept of differentiation into several stratigraphic divisions (litho-, bio- and chrono-) with non-coinciding boundaries.\n\nThe Soviet stratigraphic commission uses, in brief, the following criteria\n\nCorrelation on the basis of a single geochronological scale based on “natural” stages and evolution organic life; Stratigraphic scale should be evolved taking into account all the evidence together Irreversibility of geological phenomena, alternation of large transgressions and regression of the sea and corresponding changes in the course of organic evolution The presently recognized system are natural divisions their boundaries are characterized by unconformities and/or stratigraphic breaks, abrupt changes of species and evidence of igneous activity. The system is paleontology distinct and is successively marked by the development of new life groups.\n\nA few Russian Stratigraphers have pleaded for the modification of Russian Code to fall in line with the International Code of stratigraphic nomenclature. The important points touch upon this text, are tabulated below"}]}