{"Johannes Andreas August Grabau was a pioneer in the field of stratigraphy.": [{"url": "http://concordiahistoricalinstitute.libraryhost.com/repositories/2/resources/1031", "page_content": "Johann Andreas August Grabau was born 18 March 1804 in Olvenstedt, Saxony, in the Kingdom of Prussia, the son of Johann Andreas Grabau (d. 1822) and Anna Dorothea Grabau née Jericho. J.A.A. Grabau had a brother John and a sister Lisette. He was married in Erfurt on 15 July 1834, to Christine Sophia née Burgraf, the daughter of Johann Andreas Burggraf and Friedericke Louise Elizabeth née Beulke. They had at least three children: Johann (pastor in Bergholz, New York), Wilhelm (married Maria von Rohr, pastor in Cedarburg, Wisconsin), and Beata (whose married name was Gram). Grabau died on 2 June 1879 in Buffalo, New York.\n\n\n\nGrabau was educated at the grammar school in Olvenstedt (1809-1818), the Magdeburg Gymnasium (1818-1825) and finally at the University of Halle (1825-1829). After three years as a teacher in Magdeburg and Sachsa bei Nordhausen, Grabau was ordained and installed as pastor of St. Andrew’s Church in Erfurt in June 1834.\n\n\n\nIn 1836 Grabau ran afoul of the Prussian state church for his opposition to the Union Agenda. After two years’ imprisonment (1837-1839), Grabau was finally granted permission to emigrate along with his congregation. This group, under the leadership of Grabau and Captain Heinrich von Rohr, departed for America in the summer of 1839. Grabau and a majority of his congregation settled in Buffalo while von Rohr and some of the families continued to Wisconsin. In Buffalo the settlers established Trinity Old Lutheran Church, quickly followed by the founding of a school.\n\n\n\nGrabau and his congregation soon met with controversy, however. First was a split with a congregation of Silesian Lutherans who had accompanied Grabau’s congregation across the Atlantic. While the Silesian pastor, Leberecht Friedrich Ehregott Krause, was in Germany, Grabau excommunicated the Silesians because of an unsettled debt to the shipping agent who had arranged their passage. The Silesians denied Grabau’s authority in the matter, but Pr. Krause, who passed through Buffalo again in 1841 on his way to take up a call to Wisconsin, sided with Grabau. The Silesians approached the Saxon pastor E.M. Bürger [Buerger] who was passing through Buffalo at the time, intending to return to Germany, and Bürger, having investigated the situation, finally accepted their call and became the pastor of the congregation, known in distinction from Grabau’s as First Trinity Evangelical Lutheran Church.\n\n\n\nRelations between Grabau’s group and the Saxon Lutherans in Missouri had already been placed on a shaky footing by Grabau’s 1840 Hirtenbrief, a letter which he had written in response to the situation of the emigrants who had traveled with von Rohr to Freistadt, Wisconsin. In the absence of a pastor, they had appointed a schoolteacher to preach and administer the sacraments among them, a practice of which Grabau strongly disapproved. Grabau sent a copy of the Hirtenbrief to C.F.W. Walther and G.H. Loeber. The Missouri pastors disagreed with Grabau’s teaching but were not able to send a response until 1843. An increasingly acrimonious exchange between the two groups continued for several decades, providing impetus for Walther’s Voice of our Church on the Question Concerning the Church and the Ministry. The gap between Grabau and the Saxons widened further as portions of the Wisconsin congregations in Freistadt, Milwaukee, and Kirchhayn, offended by Pr. Krause’s liberal use of excommunication, sought Saxon pastors to serve them.\n\n\n\nMeanwhile, Grabau proceeded with the work of church organization. In 1845 the Synod of the Lutheran Church Emigrated from Prussia [Synode der aus Preussen ausgewanderten lutherischen Kirche] was formed by Grabau, von Rohr (who had in the meantime been trained and ordained as a pastor), Krause and Pr. G. A. Kindermann, a Pomeranian whose congregation had emigrated to Wisconsin. Grabau was elected senior ministerii or president of the synod, popularly known as the Buffalo Synod. The synodical paper, Kirchliches Informatorium, was established in 1851 under Grabau’s editorship. In 1853/4 the Synod established the German Martin Luther College in Buffalo with Grabau as its rector.\n\n\n\nIn 1866 a schism arose within the Buffalo Synod itself. At the synodical assembly in June of that year, a majority of the Buffalo pastors, including von Rohr, turned against Grabau, accusing him of false doctrine. Grabau and three pastors withdrew, claiming to constitute the legitimate Buffalo Synod. In November von Rohr and his fellow pastors agreed to a colloquium with representatives of the Missouri Synod. As a result of this meeting, a majority of the Buffalo Synod pastors, under the leadership of Pr. Christian Hochstetter of Buffalo, joined the Missouri Synod at once. A rump group, under von Rohr’s leadership until his death in 1874, continued to constitute a separate Buffalo Synod until 1877.\n\n\n\nGrabau continued as pastor of Trinity Old Lutheran Church in Buffalo and as president of the Buffalo Synod, which consisted of Grabau and those pastors who had refused to join in the condemnation of 1866. After a legal battle with von Rohr’s Buffalo Synod, Grabau retained control of the Martin Luther College in Buffalo and remained as its rector. The official organ of Grabau’s synod after 1866 was Die Wachende Kirche, under his editorship. He continued in these responsibilities until his death on 2 June 1879."}, {"url": "https://link.springer.com/chapter/10.1007/978-94-011-3770-6_2", "page_content": "Stratigraphy and paleontology in China enjoy the advantage of a solid foundation, particularly that created by the pioneer studies of A. W. Grabau (Zhao, 1961). The two volumes of Grabau’s Stratigraphy of China appeared in 1923–1924 and 1928 respectively. Both volumes, which present much of China’s ‘classic’ geological information, contain still invaluable references, and they form a lasting monument to the profound influences that Grabau himself exercised upon the geology of China. Also of great importance in the history of China’s geology was the publication in 1939 of Li Siguang’s (J. S. Lee) Geology of China in English.\n\nKeywords\n\nCoal Seam\n\nTarim Basin\n\nLower Cambrian\n\nType Section\n\nJunggar Basin\n\nThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, {"url": "https://newsen.pku.edu.cn/news_events/news/people/7071.html", "page_content": "Peking University, April 24, 2018: “What makes a university great is not the buildings but the scholars and masters it has”, said Mei Yiqi during his inauguration speech at Tsinghua University in 1931. The line has since then influenced Chinese higher education greatly, Beida included. When Beida was founded in 1898 (known as the Imperial University of Peking then), one of the greatest problems it had was the lack of capable teachers. Missionaries, scholars and professors from England, Germany, the US and many other countries came to China to help build the first modern institution for higher education. Their contribution is unique and unparalleled. Amadeus William Grabau is one of them.\n\n\n\nThe year 2009 marked the 100th anniversary of Beida Department of Geology. To celebrate the anniversary, the department published an article looking back at its 100-year development. The article mentions Amadeus William Grabau in particular, an American geology professor, who joined the department in 1920. “By joining the department, Grabau exerted a significant and far-fetching influence on both the education at the department and the communication between Chinese and Western geologists”.\n\n\n\n\n\nThe third from left (Group photo of graduation, Department of Geology, 1934)\n\n\n\nGrabau was born in 1870 in a small Wisconsin town called Cedarburg. His father ministered to the German Lutheran community there. He finished his undergraduate study at MIT and got his doctorate at Harvard. His dissertation was “Phylogeny of Fusus and Its Allies”. In 1901, he started to teach at Columbia and left there in 1919. Despite his fame in China, he might not be so well-known in the US compared with his wife Mary Antin, the author of The Promised Land.\n\nWhen he set foot in Shanghai in 1920, Grabau might never have thought that he was going to spend the rest of his life in China. In truth, he devoted the second half of his life to the geological education at Beida and cultivated outstanding geological talents who would later compose half of the academia of geology in China. Besides, he united the geological talents during his time, bridging the communication between scholars from China, England, France, Germany, the US, etc. Besides educating students, Grabau also continued his research in the fields of geology and paleontology. His most well-known works include Principles of Stratigraphy, Stratigraphy of China, Rhythm of the Ages and the posthumous The World We Live In, the latter three finished during his years in China.\n\nAt the beginning of the 20th century, geology was quite a new subject in China. Beida Department of Geology was established in 1909, marking the beginning of the geological education in China. Unfortunately, the department of geology saw only two students graduating in 1913. It was not until 1917 that it re-opened and welcomed its second class of students.\n\nBesides, lack of faculty members also threatened the newly born department. Ding Wenjiang, a famous Chinese geologist and social activist who later became one of Grabau’s best friends, was appointed to take on the mission of finding teachers for the department. And it is for the two teachers that Ding recruited, namely Grabau and another young scholar Li Siguang, who brought the department of geology to rapid development and helped establish its fame worldwide in the next two decades.\n\n\n\n\n\n\n\nAmadeus William Grabau\n\nGrabau arrived in late October, 1920 and started to teach at Beida on November 3. According to The University Daily, the first class he was going to teach on that day was Paleontology Lab. Until 1926, Grabau offered 8 courses in total, ranging from Theory of Evolution, Advanced Stratigraphy to Paleontology and Fossil Study. Students showed great enthusiasm to Grabau’s courses as well. There were fifty students in his paleontology class, forty in historical geology and sixty in a newly opened comparative study course.\n\nGrabau taught his students more than geological knowledge. He told his students that they were “pioneers in the development of this science in your country” and he wanted them to “search out and make known the geological structure and history of this vast country”. After noticing Chinese students’ “reliance upon authority, their predilection for book learning”, Grabau asked his students to put away all books and lecture notes and taught them to observe, to reason, to develop the power of independent judgment and self-reliance, “to wean them from undue reliance on authority”. He had faith not only in his students, but also in China: “In spite of all the present unrest and disorganization, this young republic has a great future, and we must help by giving the men who are to do the work of the future the sounded training possible.” He believed that American scholars’ efforts in this aspect would be a great part in “cementing the friendship between the two countries”.\n\nHowever, Grabau also met with difficulties. In his letter to Ray Bassler, an American geologist, he said that “geological work in China is difficult…on account of the lack of good maps, the time consuming and fatiguing journeys before you reach the field—much of the area can only be reached on mule back…over atrocious roads or no roads at all…”. But still, he said that the fieldwork was “wonderful” because of the abundance of fossils he collected. In one expedition to Kaiping basin, he brought back forty boxes of fossils. No doubt, his years at Peking stimulated the scholar’s passion once again and motivated him to finish more than half of his whole lifetime’s publications. In 1924 and 1928, he published the two-volume Stratigraphy of China. Weng Wenhao, Grabau’s colleague and also a famous geologist, praised that the book “give[s] a clear and comprehensive history of the successive stages of the geological and paleontological evolution in this part of the world”.\n\nApart from in-class education, Grabau also contributed greatly to the mixing together of Chinese and Western scholars. In 1922, the Geological Society of China was founded, which was one of the earliest academic groups in China. Grabau was among the twenty-six charter members. What’s more, Grabau generously provided his residence at Peking as the meeting places for scholars and students of geology from different nations. Allan Mazur, Grabau’s biographer who wrote “Amadeus Grabau in China: 1920-1946”, comments that Grabau “was the glue that held Chinese and Western scientists together” and that Grabau “was a pillar of all these associations”. Grabau’s sister Adele, who came to China to look after Grabau in 1934, also observed that “Amadeus…just sits somewhere in a room and at once all gather around him”. Sven Hedin, a Swedish geographer and Grabau’s friend, gave a detailed description of dinner at Grabau’s house: “the guests frequently formed small academic groups to discuss scientific problems. Grabau’s home became a focus, a salon, for the academic circles in Peking, and his hospitality knew no bounds”.\n\nGrabau’s influence was not limited to his students or colleagues. From December, 1920 to December, 1921, Grabau held a series of public speeches on “The Earth and the Evolution of Its Creatures”. It happened that Bertrand A. W. Russel, the English philosopher, was lecturing around China at that time as well. The two scholars’ speeches were so popular that they\n\nwere published in The University Daily and other newspapers. Shen Bao (also known as Shanghai News) commented that among the foreign lecturers in Peking, Russel and Grabau were the most popular.\n\nWhile playing a rather active role in the geology academia, Grabau had always been troubled with arthritis and had to use crutches. His sister Adele recorded that when Grabau left the house, he would “have both legs bandaged from foot to knee. One leg has an open sore like a dollar size—not running but just does not form skin over it”. The illness “hurts him much” that when he could not walk to the classroom he would ask his students to come to his house and continue his teaching. Also, it was a common thing for teachers to get their salaries late at that time. There was one time when teachers did not receive their salaries until six months later. Despite the situation, Grabau would continue his teaching at home while the campus was closed for teachers’ protests.\n\nGrabau’s last few years were far from comfortable. He had been interned by the Japanese army in a vacated British embassy in the Legation Quarter since 1943. And it is during the years of internment from 1943 until his release in 1945 that Grabau’s health deteriorated fast for lack of medical support. At that time, he was “invalided by age, severe arthritis, broken hip-bone, and other ailments. He is without funds or property, and is badly in need of financial assistance”. When his students rescued him out of the compound, his first words were: “Are you my students?” A few months after his release, Grabau passed away.\n\nIn 1947, the Geological Society of China published volume 27 of the Bulletin of the Geological Society of China in memorial of Grabau. Zhang Hongzhao wrote the following poem for his friend Grabau, who contributed the second half of his life to the geological education and spread in China:\n\n\n\nA mighty mountain has been cleft in twain\n\nSo passed away a great man from our throng\n\nHis worthy work forever would remain\n\nTo vie with moon and stars and last as long\n\nThe world just tast'd the hard-earn'd cup of peace\n\nHe passed away, a life without regret;\n\nFor twenty years he lived a true Chinese\n\nAnd in this land his soul will linger yet\n\nGrabau was buried at the campus of Beida, “a simple grave, but obviously regularly and lovingly tended”.\n\n\n\n\n\n\n\n\n\nThe grave of Professor Amadeus William Grabau (Photo credit to Zhang Yixin)\n\nSources:\n\n潘云唐 . “葛利普 —— 中国地质科学工作者的良师益友 . ” 中国科技史杂志 , no. 3, 1982, pp. 22-30.\n\n孙承晟 . “‘ 他乡桃李发新枝 ’ ：葛利普与北京大学地质学系 .” 自然科学史研究 , vol. 35, no. 3, 2016, pp. 341-357.\n\n夏红卫， and 北京大学国际合作部 . 北大洋先生 . 北京大学出版社，北京， 2012."}, {"url": "https://www.ancestry.com/genealogy/records/johannes-andreas-august-grabau-24-213b7lb", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.geni.com/people/Amadeus-Grabau/6000000063008817027", "page_content": "About Amadeus William Grabau\n\nGrabau was a versatile scientist, a substantial contributor to systematic paleontology, an imaginative pioneer in stratigraphic geology, and a highly respected teacher and prolific writer. After spending the first half of his professional life in the United States, he went to China for the last twenty-five years. Grabau was the son of William Henry Grabau, a Lutheran pastor, and Maria von Rohr Grabau, who died when he was a small boy; he was the third of ten children. He was educated in parochial and public schools, becoming interested in natural history, first in botany and subsequently in paleontology and mineralogy. Correspondence with William O. Crosby at Massachusetts Institute of Technology led to his attending that institution; he received the B.S. in 1896. After a year as instructor he proceeded to graduate study at Harvard, gaining the M.S. and D.Sc. in 1898 and 1900.\n\nGrabau soon became professor of paleontology at Columbia University after a short stay (1899–1901) at Rensselaer Polytechnic Institute in Troy, New York. In the succeeding twenty years he became a leading scientist in paleontology, stratigraphy, and sedimentary petrology, as well as a highly respected teacher. During the hysteria of World War I, Grabau’s tenure at Columbia was embittered by accusations of pro-German sympathies and hints and rumors originating at the highest levels. Moving to China in 1920, he became professor of paleontology at the National University and chief paleontologist of the Geological Survey of China.\n\nGrabau married Mary Antin, a Polish immigrant and a distinguished author and sociologist, in 1901. Her health was poor when he left for China, and she remained with a daughter in the United States. Grabau, rather a stocky man, suffered a deterioration of circulation that limited his capacity to work in the field during his later years in the United States; he became an invalid, requiring a wheelchair or requiring crutches after moving to China. Students, associates, and books increasingly became his sources of information.\n\nThe principal distinction of Grabau’s work is his anticipation of several principles of stratigraphy and paleontology that were to become more generally recognized by later geologists. Of North American stratigraphers of the early years of the century, he seems to have been the best informed on the relationships in foreign lands. Yet he traveled to Europe only once, when he was over forty, and to Asia at the age of fifty. He was imaginative and philosphical. A pioneer in sedimentary petrology, he proposed a genetic classification of sedimentary rocks that strongly influenced advances in the field. Grabau early emphasized the importance of the environment of deposition in determining rock characters and organic assemblages: the field of paleoecology. He produced such theories as the polar control theory of climatic control through the movement of the crust over the interior of the earth, and the pulsation theory, which endeavored to attribute the changing distribution of lands and seas to fluctuations in sea level. Moreover, he made substantial contributions in paleontology, both in the systematic study of fossils of several classes and in the interpretation of their phylogeny and classification.\n\nThe relationship of marine bionomy to stratigraphy was the subject of a fifty-page paper published in 1899, a pioneering analysis of knowledge of the living conditions of modern organisms applied to the environment of ancient sedimentary rocks. The article is a masterly outline of the principles of what is now the science of paleoecology. Grabau early emphasized the impact of environment on the fauna and its relationship to the facies of the rocks, that the lateral changes in time-equivalent rocks might be analogous to their succession. In this respect he was a great admirer of Johannes Walther, who held similar views. Grabau was an antagonist of Edward Oscar Ulrich, the popular authority of the early twentieth century who held that faunas relate to marine invasions from several independent oceanic realms; and in general he concurred with Charles Schuchert in his emphasis on environment and lateral facies.\n\nIn paleontology Grabau was influenced in his interest in phylogeny and ontogeny by his association at Cambridge with the great paleobiologists Alpheus Hyatt and Robert T. Jackson. His own early studies were directed toward these ends, particularly his work on gastropods. Subsequently he prepared several monographs on such diverse subjects as Chinese Paleozoic corals, Devonian brachiopods, and Permian faunas; these were excellent systematic paleontologic treatises in the manner of the nineteenth-century classic monographs in North America, with attention to anatomic details that might relate to genetic relationships. He had the good fortune to be in Peking when the Peking man was discovered, and he advised on its study.\n\nGrabau’s “Classification of Sedimentary Rocks” (American Geologist, 33 [1904]) was a portent of the emphasis on the interpretation of origin, as well as texture and composition, in the classification of the deposited rocks. The original terminology was cumbersome in its having Latin-based names formed from terms for origin, texture, and composition; thus hydrosilicarenyte referred to a marine-laid quartz rock with the texture of sand. The use of a genetic term introduced a subjective element that deterred the direct application of the classification to the rock specimens. Adopted only reluctantly in the beginning, the textural-composition elements became widely used in the middle years of the century, only to be succeeded by other, more sophisticated classifications that further emphasize the aspects he recognized as most pertinent. Thus, Grabau had a great influence in directing the critical study of sedimentary petrology.\n\nEarly excursions in the Buffalo, New York, region brought Grabau into contact with the deposits of the continental glaciers. In the 1930’s he developed the polar control theory of the distribution of climatic zones through the geologic record. He thought that the poles remained stable with respect to the earth’s interior, retaining latitudinal climatic zones, but that the outer crust wandered from these poles. Thus the changing relations of continents to poles caused climatic changes, such as led to glaciation. In his day only a heretic could question the relative permanence of present relationships; half a century later, such a hypothesis came to be appreciably reasonable.\n\nGrabau further believed that the continents once formed a single continental mass, Pangaea, that had been disrupted through relative movements among its dismembered parts. Thus, he was an early protagonist of a theory of continental drift, but one different from those devised by Frank B. Taylor and Alfred Wegener. He thought mountains were rising at the fore of the shifting continental plates and volcanism was at their rear. These theories were ingenious and nearly plausible, for few stratigraphic geologists had Grabau’s broad grasp of world geology or his interest in its collation. With the great advances in geophysical science in the latter half of the twentieth century, many such conjectures became subject to more rigorous analysis. Although Grabau could not have anticipated some of this present knowledge, his concepts of the nature of continental movements and climatic zonations have much to commend them.\n\nThe pulsation theory attributed the distribution of the principal stratigraphic units to great rhythmic advances and regressions of the seas, which were in turn dependent on restriction and expansion of capacities of ocean basins: eustatic control. He gave distinctive names to his pulsation systems, such as Taconian, Cambrian, Cambrovician, Skiddavian, Ordovician, Silurian, and Siluronian. Fourteen of these cycles were placed in the Paleozoic era, five in the Mesozoic, and two in the Cenozoic, partially to replace the conventional systems. He thought each pulsation had had a duration of about 30 million years, the contraction of seas at the close of each period leading to marked changes in organisms.\n\nPerhaps Grabau thought his pulsation theory was his greatest contribution, for he wrote many volumes endeavoring to relate the distribution of lands and seas to pulsing transgressions and retrogressions and saying that it was further controlled by provincial warping movements accentuating or reversing the effects, of the eustatic movements. As has been the case with other endeavors to alter the general geologic classification, based appreciably on historical accidents rather than on clearly natural principles, authorities have never agreed on more ubiquitous natural spans and thus continue to use the established systems.\n\nThe greatest effect of Grabau’s scientific work probably has been in his contributions to the principles of paleoecology and to the genetic aspects of sedimentary petrology. His stratigraphic work was influential in bringing about a three-dimensional attitude toward sedimentary rock distribution, rather than merely emphasizing the faunal correlation of exposed rock sections. His stratigraphy was dynamic, the source of understanding earth movements. He anticipated the attitudes that became prevalent when the petroleum industry added knowledge of subsurface sections to that of the surface outcrops. The concepts involved in his polar control theory, pulsation theory, and the separation of Pangaea encouraged imaginative syntheses of geologic evidence. This heritage, brought to his students and associates, has contributed far beyond the words and thoughts that he recorded.\n\nThe esteem in which Grabau was held was reflected in the honors and prizes that he received but was shown more fittingly in the commemorative volumes that were published by Chinese geologists on his sixtieth birthday and in his burial within the gates of the National University. Among his greatest contributions were the stimulus that he gave to scientific life in China and the instruction and enthusiasm that was productive in his many students. For example, in the first ten years of his residence in China, nineteen of the twenty-five monographs of Palaeontologia sinica were prepared by his students.\n\nGrabau was a fellow of the Geological Society of America, the New York Academy of Science (vicepresident, 1906–1907), and the Geological Society of China (vice-president, 1925); corresponding member of the Philadelphia Academy of Sciences and the Deutsche Akademie der Naturforscher; and an honorary member of the Peking Society of Natural History, the China Institute of Mining and Metallurgy, the Academia Sinica, and the Academia Peipinensis.\n\nBIBLIOGRAPHY\n\nI. Original Works. Grabau was the author of some 300 publications, of which more than a score were substantial monographs and other books. The full bibliography is listed in the publications in the secondary literature. The principal volumes are listed in three categories: paleontological studies, stratigraphic studies, and textbooks and collative works.\n\nThe paleontological treatises contain substantial systematic descriptions of fossil organisms. Because his associates were exploring in regions that had not been known, the greatest contributions are to faunas from China: Phylogeny of Fusus and Its Allies (Washington, D. C., 1904); Ordovician Fossils From North China (Peking, 1922); Silurian Faunas of Eastern Yunnan (Peking, 1926);Paleozoic Corals of China (Peking, 1928); Devonian Brachiopods of China (Peking, 1931); and Early Permian Fossils of China, 2 vols. (Peking, 1934–1936). The Relations of Marine Bionomy to Stratigraphy (Buffalo, 1899) is a substantial introduction to the field of paleoecology.\n\nIn stratigraphic geology, Grabau’s first publications were descriptions of stratigraphic sequences in various localities: Geology and Paleontology of Eighteen Mile Creek and the Lakesbore Section of Erie County, New York (Buffalo. 1898); Guide to the Geology and Paleontology of Niagara Falls and Vicinity (Albany, 1901); “Classification of Sedimentary Rocks,” in American Geologist, 33 (1904), 228–247 and Guide to the Geology and Paleontology of the Schoharie Valley in Eastern New York, (Albany, 1906). The Monroe Formation of Southern Michigan and Adjacent Regions (Lansing, Mich., 1910) was prepared with W. H. Sherzer. The Permian of Mongolia (New York, 1931) included description of faunas collected on the central Asia expeditions of the American Museum of Natural History. The Stratigraphy of China was essentially a summary of knowledge. Probably his best-known work is The Principles of Stratigraphy (New York, 1913), repr. with preface by Marshall Kay (New York, 1960), one of the most influential texts of the early twentieth century.\n\nGrabau published Textbook of Geology, 2 vols. (New York. 1920–1921), which did not receive wide usage. His five-volume Paleozoic Formations in the Light of the Pulsation Theory (Peking. 1936–1938), intended to be the first encyclopedic summary of world stratigraphy, was developed to support his pulsation theory. Rhythm of the Ages (Peking, 1940) and the posthumously published, twenty year-old MS of The World We Live In (Taipei, 1961), were popular summaries of his philosophy. North American Index Fossils (New York, 1909–1910), written with W. H. Shimer, with illustrations of more than 2,000 distinctive invertebrate fossils, was the standard reference work for more than thirty years. He also published Principles of Salt Deposition (New York, 1920).\n\nII. Secondary Literature. The full bibliography of Grabau is contained in three biographic papers, H. W. Shimer, in Proceedings of the Geological Society of America for 1946 (1947), 161–166; V. K. Ting in Grabau Anniversary. the commemorative vol. presented to Grabau on his fiftieth birthday, Bulletin of the Geological Society of China, 10 (l931). ix-xviii; and the intro. to The World We Live In (Taipei, 1961), xii-xxv.\n\nMarshall Kay"}, {"url": "https://www.britannica.com/biography/Amadeus-William-Grabau", "page_content": "Amadeus William Grabau, (born Jan. 9, 1870, Cedarburg, Wis., U.S.—died March 20, 1946, Beijing), American geologist and paleontologist, known for his works on paleoecology and Chinese stratigraphy.\n\nGrabau was a member of the faculty of the Massachusetts Institute of Technology, Cambridge, from 1892 until 1897 and of the Rensselaer Polytechnical Institute from 1899 until 1901, when he became a professor at Columbia University. In 1919 he became a professor at the Peking National University and served as the chief paleontologist for the Chinese Geological Survey.\n\nBritannica Quiz Faces of Science\n\nGrabau’s work emphasized the importance of the depositional environment of rocks and fossil organisms. He traced the evolution of certain groups of invertebrates and developed the pulsation and polar control theories that state that the crustal features of the Earth were caused by the rhythmic rise and fall of sea level. Grabau also formulated an early hypothesis of continental drift. He wrote North American Index Fossils (1909, 1910), Principles of Stratigraphy (1913), Textbook of Geology, 2 vol. (1920–21), Silurian Fossils of Yunnan (1920), Ordovician Fossils of North China (1921), Paleozoic Corals of China (1921), Stratigraphy of China (1924–25), Migration of Geosynclines (1924), Early Permian Fossils of China (1934), and Rhythm of the Ages (1940)."}, {"url": "https://link.springer.com/article/10.1007/BF03175848", "page_content": "A.W. Grabau (1870–1946), one of the world’s greatest sedimentary geologists divided his working life between the United States (1890–1920) and China (1920–1946). My early acquaintance with the publications of Grabau was through one of my fellow students Mrs. Mary Welleck Garretson (1896–1971) who had been a student of Grabau’s at Columbia University. Grabau served as Professor of Geology and Mineralogy at Rensselaer Polytechnic Institute before he joined the faculty of Columbia University. Grabau may truly be considered the Father of Modern Sedimentology.\n\nThis paper focuses on (1) Mary Garretson’s recollections of Grabau; (2) surviving correspondence in the Archives of the Geological Survey of China which include handwritten letters in German script addressed by Johannes Walther (1860–1937) to Grabau which reveal an intimate personal friendship; and (3) glimpses of Grabau’s personal life.\n\nGrabau’s tomb is located in a pleasant memorial park of the campus of the new university of Beijing, where a white marble headstone with English and Chinese inscriptions adorns his grave."}, {"url": "https://www.ancestry.com/genealogy/records/the-buffalo-synod-founder-johannes-andreas-august-grabau-24-19rwj7k", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}]}