{"Rich Williams was born on October 19, 1949.": [{"url": "https://hollywoodlife.com/feature/who-is-richard-williams-4582803/", "page_content": "“A rare sighting,” Serena Williams captioned a Nov. 9 Instagram post of her daughter, Olympia, riding her bicycle while a man recorded her ride. “The one and only G.O.A.T still motivating. King Richard, but I call him daddy.” The man in question was Richard Williams, whose story was the subject of King Richard, the new biopic starring Will Smith. With the movie already generating Oscar buzz for Will, many might forget that the man he portrays is the real-life father of two of tennis’ greatest players (and arguably, the greatest of all time in Serena.) For those unfamiliar, here’s what you need to know about Richard Williams.\n\n1. Richard Williams Hails From Louisiana.\n\nRichard Dove Williams was born on Feb. 14, 1942, in Shreveport, Louisiana. “In Shreveport, my family and I lived in a three-room shack on East Seventy-Ninth Street, next to the railroad tracks. The house was so raggedy a strong wind could have blown it down,” Richard wrote in an excerpt of his book, Black and White: The Way I See It, published by the New York Daily News in 2014. Richard’s father left his mother, Julia, and her five children to survive on their own. “When my father never gave anything to me, I decided I was going to give my family everything I had,” he wrote. “The more I worked, the more I helped Mama and my sisters, and the prouder of myself I became.” After graduating from high school, he eventually found his way to California.\n\n2. He’s Been Married Multiple Times.\n\nWhile out in California, Richard met Betty Johnson. Betty had one child from a prior relationship, and after she and Richard married in 1965, they had five children together, per Page Six. They divorced in 1973. Seven years later, he married Oracene Prince. She and Richard had two biological daughters together – Venus and Serena – before divorcing in 2002. In 2010, Richard married Lakeisha Juanita Graham, a woman 37 years younger than he was. They welcomed a son, Dylan, in 2012 and divorced in 2017, per Heavy.\n\n3. Richard Had No Background In Tennis\n\nAfter Richard saw Virginia Ruzici receive a $30,000 check on television after she won a tennis tournament, he decided that his next two kids would play the sport, according to Sports Illustrated. “When we got started in tennis, it was to go out and make a lot of money. Believe me, we have made tons, and I’ll make even more.”\n\nHe bought books and tapes to learn everything about the sport, taught Oracene – a gifted athlete – how to play, and began to coach the three girls from his first marriage, according to a 2018 Serena profile in GQ. When Venus and Serena were 3 and 4, he started them playing at the public courts in Compton, California. Richard also drew up a 78-page training regime. As Venus and Serena developed, Richard moved the family to South Florida, where the daughters – Serena was 10, Venus was 11 – could train at Rick Macci’s tennis academy. Richard eventually pulled the girls out of the school and did all the coaching himself at home. It was a successful risk, with Venus and Serena exploding on the scene, racking up wins left and right.\n\n“I don’t feel like I was really in a bubble, to be honest,” Serena told GQ. “I had friends. And you know, my dad wouldn’t let us be pro full-time until we finished high school.”\n\n4. His Tennis Dreams Were Supported By His Wife\n\n“My dad at one point was working, and then, he stopped,” Serena said in the Nov. 16 episode of Red Table Talk, per PEOPLE. “He’s like, ‘This is what we’re going to do. I’m not going to have a job. I’m gonna go with Venus and Serena and train them every day.’ Now that would be impossible for me if my husband [Alexis Ohanian] were to tell me that.” Serena credited her mother for supporting the family while Richard chased tennis\n\n5. Richard Was Ahead Of His Time, According To Serena\n\n“My dad was and still is way before his time,” Serena Williams told GQ’s Wesley Lowery for a profile on Will Smith. “You see, when someone is different—when they don’t act or look how a person assumed they would—the first reaction is often fear. They think, How do we break them? My dad anticipated that, but he would not allow himself or his family to be broken.” Serena also gave praise to Will Smith for the accuracy of his portrayal, telling Lowery that “there were moments she had to remind herself that it wasn’t actually her father on the screen.”"}, {"url": "https://happyhappybirthday.net/en/age/rich-williams-person_xxassxy", "page_content": "Rich Williams\n\nAmerican rock guitarist – Rich Williams was born in Topeka (capital of the state of Kansas, United States; county seat of Shawnee County) on February 1st, 1950 and is 73 years old today.\n\nAge How old is Rich Williams? 73 Rich Williams is 73 years old.\n\nBiographical data\n\nRich Williams\n\nBirthday When was Rich Williams born? Rich Williams was born on February 1st, 1950.\n\nPlace of Birth Where was Rich Williams born? Topeka (capital of the state of Kansas, United States; county seat of Shawnee County).\n\n♒ ♒ Zodiac What is the zodiac sign of Rich Williams? Rich Williams was born in the zodiac sign Aquarius (The Water-Bearer)."}, {"url": "https://www.celebsagewiki.com/rich-williams", "page_content": "Age, Biography and Wiki\n\nRich Williams was born on 1 February, 1950, is a Musician. Discover Rich Williams's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 73 years old?\n\nPopular As N/A Occupation Musician Age 73 years old Zodiac Sign Aquarius Born 1 February 1950 Birthday 1 February Birthplace N/A Nationality\n\nWe recommend you to check the complete list of Famous People born on 1 February. He is a member of famous Musician with the age 73 years old group.\n\nRich Williams Height, Weight & Measurements\n\nAt 73 years old, Rich Williams height not available right now. We will update Rich Williams's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nRich Williams Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Rich Williams worth at the age of 73 years old? Rich Williams’s income source is mostly from being a successful Musician. He is from . We have estimated Rich Williams's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nRich Williams Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Rich Williams Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.newsunzip.com/wiki/richard-williams-biography/", "page_content": "Richard Williams (born February 14, 1942, Age: 79 years) is a professional Tennis Coach and a Writer from the United States of America. Being a native of America he has trained many sports players in Tennis. The legendary coach is usually recognized as the father and coach of his two master Tennis players Venus and Serena William. His work and services were so legendary and famous that a film has been released on his life and struggle through life. The movie is recently got released on 19th November 2021 titled King Richard.\n\nTennis sports lovers were already aware of Mr. Richard’s struggle and achievement but for those who don’t know him, I have shared all the detail of Richard under this article of mine. You will find all about her early life, net worth career, family, children, siblings, and more.\n\nRichard Williams’ Biography, Wikipedia (Early Life & Education)\n\nBiodata – The master coach and great teacher Mr. Richard Williams was actually born on February 14, 1942, and has reached the 79th year of his age this year in 2021. Growing as a normal kid Richard has never thought to be a Tennis coach but yes he was good at sports and sometimes use to do different sports activities at his school and even with his friend in neighbors.\n\nHe was born in Shreveport, Louisiana with her sisters and parents but he later moved to Saginaw, Michigan after completing his school and college education and then to California. It is the Saginaw. Michigan City and California have made him a legendary coach.\n\nRichard Williams’ Bio\n\nRichard Williams Wiki / Bio\n\nFull Real Name Richard Williams Age (as of 2021) 79 years old Nickname Richard, William, King Richard Popular as Tennis Coach and father of Venus and Serena Profession Tennis Coaching Date of Birth February 14, 1942 (Saturday) Place of Birth Shreveport, Louisiana Current Residence California Education Graduate School High school in Saginaw, Michigan. Net worth $10 million US Dollars. Nationality American Ethnicity Afro-American Religion Christianity Zodiac Sign Not Known Languages English\n\nRichard Williams’ Family (Nationality & Ethnicity)\n\nRichard Williams Biography / Wiki – Sharing in-depth about Richard then I can say that he has a large family. His father Mr. Richard Dove Williams has given birth to William and her 4 other younger sisters while living in Shreveport Louisiana with William’s mother.\n\nAs William was the only son in the family William’s mother Mrs. Julia Mae Metcalf has loved him more than his sisters. Growing older Richard also becomes a very understanding brother of her four sisters Barbara, Pat, Penny, and Faye. When they were living in Shreveport, Louisiana the Richard family also resided for a time in East 79th street near railroad tracks.\n\nRichard Williams’ Father, Mother’s Name, Siblings & More\n\nFather’s Name Richard Dove Williams Mother’s Name Julia Mae Metcalf Brother None Sister Barbara, Pat, Penny, and Faye Religion Christianity Ethnicity Afro-American Nationality American\n\nRichard Williams’ Age, Birthday & Zodiac Sign\n\nAge 79 years Birthdate February 14, 1942 (Saturday) Zodiac Sign Not Known\n\nRichard Williams’ Height, Weight & Physical Appearance\n\nTalking about the sports personality Richard then he is tall and active. He even at the age of 79 used to keep himself fit by following regular exercises and eating healthy diet food. Looking at the current picture it doesn’t look like that he is 79 years old as he looks equal to 60 years old man.\n\nWeight (approx.) In Kilograms: 87 kg\n\nIn Pounds: 191 Lbs. Height (approx.) In Feet Inches: 6′”\n\nIn Meters: 1.85 m\n\nIn Centimetres: 185 cm Distinctive Features Short White and Black Hairs Tattoos No Tattoo. Eye Color Black Hair Color Black Hair Length Short Body Measurements Chest- 42, Waist- 36, Bicep-16 Plastic Surgery No. Shoe Size 11US (10 UK)\n\nRichard Williams’ Career, Tennis Coaching & Matches\n\nIn the years of his career as a Tennis coach, he has learned and even taught many things related to Tennis to his students. He knows each and every little technique of smashing the opponent in the tennis courts. Mr. Richard has actually started learning tennis from the person whose name he shared earlier as Old Whiskey. At that time when he was learning Tennis, he decided that he will train his future daughters and will make them international tennis players. This idea came to his mind when he once saw famous legendary tennis player Virginia Ruzici on TV playing in a Tennis Match.\n\nWilliam once shared that he started writing a plan and wrote an 85-page long plan after her daughter Venus and Serena were born in 1980 and 1981.\n\nHe also shared that he began teaching them when they were almost 4 and 5 years old. Mr. Richard use to take them to a public tennis court in order to give lessons on tennis to them.\n\nAfter years of his teaching, Richard got succeeded in getting her daughter to the Shreveport Tennis Tournaments. William has also admitted their daughters in the sports academy but due to their bad performance at the tournaments, Richard decided to pull them out in the year 1995 and started training them himself.\n\nSee Also- Who is Lucy Currey? Wiki, Biography, Height, Age, Net worth, Boyfriend & News\n\nLater in 1999, Serena Richard’s daughter made history when she won the US Open. And later his other daughter Venus defeated Lindsay Davenport and won the 2000 Wimbledon title. From here the actual journey of Richard with her two professional tennis players’ daughters started and they appeared in many international tournaments.\n\nTo date, Serena and Venus have won many titles under the coaching of their father Richard. They have won Career Golden Slam, 3 Olympic Gold Medals, French Open, and many more.\n\nNot only this William has not only trained her daughter but her sisters have also been trained by him and they have also won the titles like US Open, Australian Open, and others.\n\nAdding more than in the year 2014 Richard presented himself as a writer and has written one book partnering with Bart Davis. His first and only book name is Black and White: The Way I See It.\n\nRichard Williams’ Biopic Movie – King Richard (2021)\n\nWill Smith in King Richard (2021)\n\nRecently the popular Hollywood actor has been seen appearing in his latest release King Richard. This movie is connected to coach Richard William (Played by Actress Will Smith) because it has been pictured as the real-life story of Mr. Richard and his two daughters Venus Williams (Played by Actress Saniyya Sidney) and Serena Williams (Played by Actress Demi Singleton). King Richard’s movie has recently released on 19th November 2019 and has become a topic to talk about for media persons.\n\nWill Smith is playing the lead role as a coach Richard William in this movie. It is another star that actor Will Smith has added to his list of Sports-bio dramas. As earlier he has been seen appearing in the biography films of different sports personalities.\n\nKing Richards based on the true story of Coach Richard William as been developed with a total budget of $50 million USD.\n\nKing Richard Movie Trailer\n\nRichard Williams’ Wife, Girlfriend & Relationships\n\nRichard looks like a lucky person as during his life he remained in a relationship with three women and also married them separately. Since moving to California after completing studies he first met Betty Johnson. He married Betty in the year 1965 and loved her a lot.\n\nRichard Williams with his wife Oracene Price\n\nThe love of Betty and William has given birth to three sons and two daughters. Sabrina, Ronner, Reluss, Richard III, and Reneeka are all the names of his five children with Betty Johnson. When Betty married Richard she was already having one daughter named Katrina who has also raised and brought up with Betty other five children with Richard. Later Betty got Divorced with Richard in the year 1973.\n\nRichard Williams with his daughters Venus and Serena\n\nLater after 6 years of his Divorce, Richard met Oracene “Brandy” Price in 1979 who was also a divorcee with her three daughters. Richard married her in the years 1980 and gave birth to Venus on Jue 17, 1980, and Serena on September 26, 1981. After Mr. Richard got married to Oracene her second wife they started living in Compton, California. But this second marriage of Richard didn’t last long and he again get separated from Oracene in the year 2002.\n\nRichard becomes the public figure just after divorcing her second wife in the year 2002.\n\nRichard Williams with his third wife Lakeisha Graham\n\nLiving alone for a few years Richard again found someone perfect for his life as his life partner. He started dating his new girlfriend Lakeisha Graham who was servicing as a grocery store owner at that time. Juanita is just one year older than Richard’s Second wife daughter Venus. After dating for a long Richard and Lakeisha Juanita Graham got married in the year 2010 and now they have a there son named Dylan who came into existence in the year 2012. But this time his marriage again didn’t last long and Richard filed a divorce against Lakeisha in the year 2017.\n\nRichard Williams’ Children / Daughters / Sons\n\nRichard Williams daughters with their mother Oracene Price\n\nMarital Status Married Relationship Status Separated Wife(s) Betty Johnson, Oracene Brandy Price, Lakeisha Graham Girlfriend List Betty Johnson, Oracene Brandy Price, Lakeisha Juanita Graham Children 1st Wife-Sabrina Williams, Richard II Williams, Ronner Williams, Reluss Williams, Reneeka and Katrina Williams\n\n2nd Wife– Venus Williams and Serena Williams\n\n3rd Wife– Dylan Williams\n\nRichard Williams Net Worth & Income Source\n\nAccording to a recent edition of a popular news portal, the actual net worth of Richard is estimated to be $10 million USD. Throughout his career as a coach, he has earned so much fame and has endorsed several brands which have eventually increased his net worth.\n\n6 Facts You Need to Know About Richard Williams\n\nRichard has been listed by Wikipedia for his popularity.\n\nMr. Richard doesn’t use any social media platforms.\n\nHe started wearing spectacle in his old age.\n\nWill Smith has been seen promoting Richard real life story movie King Richard.\n\nRichard real life movie will stream on HBO max.\n\nRichard faced a stroke attack in the year 2016.\n\nFAQ of Richard Williams\n\nQ.1 Who is Richard Williams?\n\nAns. He is Tennis Coach from America.\n\nQ.2 What is the age of Richard Williams?\n\nAns. He is 79 years old as of 2021.\n\nQ.3 What is the height of Richard Williams?\n\nAns. He is 6 feet tall.\n\nQ.4 What is the Net worth of Richard Williams?\n\nAns. His net worth is $ 10 million USD.\n\nQ.5 What is the birth date of Richard Williams?\n\nAns. He was born on February 14, 1942.\n\nQ.6 Who are Serena and Venus Williams?\n\nAns. Serena and Venus Williams are International tennis players and daughters of Coach Richard Williams.\n\nQ.7 When did Richard Start his coaching career with her two daughters?\n\nAns. He is a coach of her two daughters since 1994.\n\nQ. 8 Is Richard Williams still alive?\n\nAns. Yes, he is alive as of November 2021.\n\nQ.9 Is Richard Williams Still Married?\n\nAns. No, he is not married now and living alone with his kids.\n\nSocial Media Profiles & More"}, {"url": "https://www.ancientfaces.com/person/richard-williams-birth-1948-death-1984/87444233", "page_content": "Refresh this page to see various historical events that occurred during Richard's lifetime.\n\nIn 1948, in the year that Richard Williams was born, on May 14th, the State of Israel was proclaimed by David Ben-Gurion, who became Israel's first Premier, and the U.S. officially recognized Israel. That evening, Egypt launched an air assault on Israel.\n\nIn 1956, Richard was merely 8 years old when on May 20th, the U.S. tested the first hydrogen bomb dropped from a plane over Bikini Atoll. Previously, hydrogen bombs had only been tested on the ground. The Atomic Age moved forward.\n\nIn 1960, by the time he was just 12 years old, on September 26th, the first televised debate for a Presidential campaign in the United States - Kennedy vs Nixon - was held. Seventy million people watched the debate on TV. The debate pre-empted the very popular Andy Griffith Show.\n\nIn 1977, at the age of 29 years old, Richard was alive when on January 20th, Jimmy Carter became the 39th President of the United States. Running against incumbent Gerald Ford, he won 50.1% of the popular vote to Ford's 48.0%. He was elected to only one term.\n\nIn 1984, in the year of Richard Williams's passing, due to outrage about \"Indiana Jones and the Temple of Doom\" (it seemed too \"dark\" to many and it was rated PG), a new rating was devised - PG-13. The first film rated PG-13 was \"Red Dawn\"."}, {"url": "https://www.ancientfaces.com/person/william-rich-williams-birth-1889-death-1949-austra/144165768", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1889, in the year that William Rich Williams was born, on March 31st, the Eiffel Tower was inaugurated. Because the elevators were not yet in operation, officials had to climb to the top of the tower - it took an hour. On May 15th, the Tower opened to the public - still without working elevators - but around 30,000 visitors still made the climb. The elevators went into operation on the 26th. The Tower wasn't considered aesthetically pleasing at the time but is now one of the most iconic structures in the world.\n\nIn 1890, when he was just 1 year old, on July 3rd, Idaho became the 43rd state in the United States. On July 10th, Wyoming became the 44th state.\n\nIn 1918, by the time he was 29 years old, on November 1, an elevated train on the Brooklyn line of the subway - driven by an inexperienced operator because of a strike - tried to navigate a turn at 30mph. The limit on the curve was 6 mph. The 2nd and 3rd cars of the 5 car wooden train were badly damaged and at least 93 people were killed, making it the deadliest crash in New York subway history.\n\nIn 1926, by the time he was 37 years old, on November 15th, NBC was founded. It was the U.S.'s first major broadcast network. Ownership of the network was split between RCA (a majority partner at 50%), its founding corporate parent General Electric (which owned 30%), and Westinghouse (which owned the remaining 20%).\n\nIn 1949, in the year of William Rich Williams's passing, on April 4th, NATO (the North Atlantic Treaty Organization) was established. Twelve nations originally signed the North Atlantic Treaty - the United States, Great Britain, France, Belgium, the Netherlands, Denmark, Italy, Luxembourg, Norway, Iceland, Canada, and Portugal. Greece, Turkey, and West Germany later joined. Today, there are 26 nations in NATO."}, {"url": "https://www.vanityfair.com/hollywood/2021/11/king-richard-williams-serena-venus-true-story", "page_content": "For years during the trailblazing tennis careers of his daughters Venus and Serena, Richard Williams was an animated public presence—waving signs from the crowd, offering bombastic soundbites, and even, on occasion, dancing on a television booth.\n\nBut when Richard, now 79, learned that he was going to be the subject of a movie, King Richard, with Will Smith playing him, he balked at the idea.\n\n“He’d say, ‘I don’t know if I want them to do the film. I don’t want people to hate me,’” remembers Isha Price, Venus and Serena’s older half sister—a lawyer who, along with Venus and Serena, is credited as an executive producer on the movie.\n\n“I’m like, ‘Daddy, first of all, we would never be a part of anything where people were going to vilify you [just] because they didn’t understand you. But we got to tell the truth.’ He said, ‘Oh, I always want you to be honest.’”\n\nAdmits King Richard producer Trevor White in a separate interview, “I think there’s a sensitivity to the way in which Richard used to be portrayed in the media, and the family wanted to make sure we weren’t after that kind of false portrayal.”\n\nPrice, the lynchpin between the film and her family, says she was convinced to participate after reading Zach Baylin’s script and realizing that Baylin, Trevor, and fellow King Richard producer Tim White genuinely wanted the family’s cooperation. As Price explained to her family members, “This is technically our story. But somebody is going to tell it eventually. Why not let us, at least, tell the truth and have our own voice out there and not have it be some fabricated thing about stuff that never happened, or things that people don’t understand? That’s where you get to the vilification of certain people.”\n\nThough Richard stayed removed from the process, the rest of the family got involved. Serena and Venus submitted script feedback; their sister Lyndrea Price worked in the costume department; and Isha helped with everything from choosing the director, Reinaldo Marcus Green, to making sure minute details of her family life were accurately depicted. (“I was mad that the van was dusty,” laughs Isha about one nitpick. “Daddy washed the van every week.”) Isha, Venus, and Williams matriarch Oracene Price also spent considerable time speaking with the filmmakers to make sure that they understood the private side of Richard Williams.\n\n“In the ’90s and the early 2000s, when he was much more forward-facing, Richard was a very controversial and contentious figure in the tennis world,” says Baylin. “He really saw his job as their coach being not just about what was happening on the court, but about being their hype man. At the time, I think people saw that somewhat contentiously. But what was brilliant was he knew that without the resources [to fund Venus and Serena’s tennis training], he was going to have to build up this aura and myth around them to get people to invest in them.… I think the outward impression was that that bombastic-ness and that contentiousness would’ve been there in the family as well. But it was really the opposite. He was an extremely soft and encouraging father and coach.”\n\nAdds Isha, “There were a lot of tennis parents out there that were more villainous. The reason that he took us out of—or took Venus and Serena out of—the juniors was because of the way that the parents were acting.” He wanted to protect his daughters from that environment, she says. “We wanted that to be shown.”\n\nBaylin especially valued input from Oracene, a more private figure who also coached her daughters and committed to the family dream of them becoming world champions."}, {"url": "https://www.ancientfaces.com/person/william-t-rich-birth-1921-death-1995/122309652", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1921, in the year that William T Rich was born, on March 4, Warren G. Harding became President. Previously a U.S. Senator, Lieutenant Governor, and Ohio State Senator, Harding was a popular President. But many scandals plagued his short administration (he died in office after 2 and a half years), including the revelations of one of his mistresses and the Teapot Dome scandal. Historically, Harding is rated as one of the worst Presidents.\n\nIn 1939, by the time he was 18 years old, on the 1st of September, Nazi Germany invaded Poland. On September 17th, the Soviet Union invaded Poland as well. Poland expected help from France and the United Kingdom, since they had a pact with both. But no help came. By October 6th, the Soviet Union and Nazi Germany held full control of the previously Polish lands. Eventually, the invasion of Poland lead to World War II.\n\nIn 1950, at the age of 29 years old, William was alive when in February, Joe McCarthy gave a speech alleging that he had a list of \"members of the Communist Party and members of a spy ring\" who worked in the State Department. He went on to chair a committee that investigated not only the State Department but also the administration of President Harry S. Truman, the Voice of America, and the U.S. Army for communist spies - until he was condemned by the U.S. Senate in 1954.\n\nIn 1987, William was 66 years old when on October 19th, stock exchanges around the world crashed. Beginning in Hong Kong then spreading to Europe, the crash then hit the United States. It was called Black Monday. The Dow Jones fell 508 points to 1,738.74 (22.61%).\n\nIn 1995, in the year of William T Rich's passing, on September 3rd, eBay was founded in San Jose California. Beginning as simply a place for Pierre Omidyar's girlfriend (now wife) to share her Pez passion and collection online, the site has become a multibillion-dollar business and operates in 30 countries."}, {"url": "https://www.ancientfaces.com/person/william-rich-birth-1904-death-1959/40904560", "page_content": "Refresh this page to see various historical events that occurred during William's lifetime.\n\nIn 1904, in the year that William Rich was born, the \"Teddy's Bear\" was first produced. After seeing a political cartoon of President Teddy Roosevelt refusing to kill a clubbed and tied up bear, Jewish Russian immigrant Morris Michtom - who owned a candy shop and sold stuffed animals that he and his wife made at night at the store - made a \"Teddy's Bear\" and put it in his shop's window. The stuffed bears were an immediate success and Michtom and his wife went on to found the Ideal Novelty and Toy Co.\n\nIn 1911, he was merely 7 years old when British physicist Ernest Rutherford (born in New Zealand), along with German physicist Hans Geiger, discovered the structure of an atom. He found that atoms had nuclei (a nucleus) and were circled by electrons, much as planets orbit the sun.\n\nIn 1920, by the time he was 16 years old, Italian born factory worker Nicola Sacco and fish peddler Bartolomeo Vanzetti were picked up by police on May 5th in connection with the April 15th murder and robbery of a guard and a paymaster at the Slater and Morrill Shoe Company in South Braintree, Mass. Although in later years they were thought to be innocent, they were anarchists and were convicted of the crime and put to death.\n\nIn 1933, when he was 29 years old, the day after being inaugurated, the new President, Franklin Roosevelt, declared a four-day bank holiday to stop people from withdrawing their money from shaky banks (the bank run). Within 5 days of his administration, the Emergency Banking Act was passed - reorganizing banks and closing insolvent ones. In his first 100 days, he asked Congress to repeal Prohibition (which they did), signed the Tennessee Valley Authority Act, signed legislation that paid commodity farmers to leave their fields fallow, thus ending surpluses and boosting prices, signed a bill that gave workers the right to unionize and bargain collectively for higher wages and better working conditions as well as suspending some antitrust laws and establishing a federally funded Public Works Administration, and won passage of 12 other major laws that helped the economy.\n\nIn 1959, in the year of William Rich's passing, on January 3rd, Alaska became the 49th state of the United States and the first state not a part of the contiguous United States. The flag was changed to display 49 stars."}, {"url": "https://www.thehistorymakers.org/biography/ronald-williams", "page_content": "Corporate chief executive Ronald Williams was born on November 11, 1949 in Chicago, Illinois to Dorothy Portwood and Henderson Williams. Williams received his B.A. degree in psychology from Roosevelt University in 1970, and his M.S. degree in management from the MIT Sloan School of Management in 1984.\n\n\n\nIn 1978, Williams joined Control Data Corporation as group marketing executive, before serving as president and co-founder of Integrative Systems. From 1984 to 1987, Williams served as the co-founder and senior vice president at Vista Health Corporation. In 1987, Williams joined WellPoint Health Networks as group president of its Large Group and president of its Blue Cross of California subsidiary. He later joined Aetna Insurance Company in 2001 where he assumed the role of executive vice president and chief of health operations. Williams focused on creating innovation in the industry, especially through health information technology. In 2006, Williams became chairman and chief executive officer, making him the first African American CEO in the company’s 200 year history. In 2011, Williams retired as chairman of Aetna.\n\n\n\nIn 2007, Williams joined the board of the American Express Company; and, in 2010, he was elected to The Boeing Company board of directors. In 2011, he joined the board of directors of the Johnson & Johnson Company. From 2011 to 2017, Williams served on President Obama’s President's Management Advisory Board; and, in 2016, he served as chairman of the board of Agilon Health. He has also served on the board of Lucent Technologies, Inc. and Envision Healthcare. Williams was named a trustee of The Conference Board and the Connecticut Science Center Board, and was a member of The Business Council and Business Roundtable.\n\n\n\nWilliams has written on specific health care industry reforms, with pieces published in The Wall Street Journal, Washington Post and The Financial Times. Williams has been the recipient of numerous accolades including being named one of Black Enterprise magazine’s The 100 Most Powerful Executives in Corporate America in 2010.\n\n\n\nWilliams and his wife, Cynthia Williams, reside in Delray Beach, Florida. They have one son, Christopher.\n\n\n\nRon A. Williams was interviewed by The HistoryMakers on May 14, 2019."}], "Rich Williams is American.": [{"url": "https://www.rottentomatoes.com/celebrity/rich_williams", "page_content": "Highest Rated: 80% Cut and Chop (2020)\n\nLowest Rated: 24% Tammy (2014)\n\nBirthday: Jun 7, 1944\n\nBirthplace: Louisville, Kentucky, USA\n\nRich Williams was an actor who had a successful Hollywood career. Williams worked on a variety of projects during his early entertainment career, including \"Garth Live From Central Park\" (HBO, 1996-97), \"From the Earth to the Moon\" (1997) and \"The Nickellennium\" (Nickelodeon, 1999-2000). Later, he acted in \"Gilmore Girls\" (2000-07), \"Shadow of the Blair Witch\" (Syfy, 2000-01) and \"The Division\" (Lifetime, 2000-04). He also appeared in \"The Guardian\" (2001-04), \"Constantine\" (NBC, 2014-15) and the Melissa McCarthy comedy \"Tammy\" (2014). More recently, Williams acted in the drama \"Runoff\" (2015) with Joanne Kelly."}, {"url": "https://www.the-sun.com/entertainment/4135064/richard-williams-walked-out-family/", "page_content": "RICHARD Williams walked out on his family to become a millionaire, leaving them in poverty, his daughter has said.\n\nSabrina Williams - the half sister of Serena and Venus - has slammed the new Hollywood biopic 'King Richard' saying he was \"only a king in his head\".\n\n9 Richard Williams left his first family and focused on making Serena and Venus champions Credit: Getty\n\n9 Her half sister Sabrina Williams has slammed the film, calling it 'a comedy' Credit: These photos are the www.thisischriswhite.com and cannot be reprinted unless authorised to\n\n9 Sabrina said Williams is only 'king in his head' Credit: Getty\n\nRichard, 79, married Sabrina's late mom Betty Johnson in Los Angeles in the early sixties and they had four other children - Richard III, 56, Ronner, 55, Reluss, 54, and 49-year-old Reneeka.\n\nHe dumped his wife and five kids, allegedly walking out of the door to buy her a bike - and never returning - then went onto marry Serena and Venus's mother Oracene.\n\nIn an exclusive interview with The Sun, Sabrina said of the new film, which stars Will Smith as Williams: \"I think the title is completely over the top.\n\n\"He thinks he's the king of the world, but no one that's ever been around him thinks he's King Richard. It is an outrageous title, but to truth be told, it fits him.\n\n\"He's not the king of the world. If you look at him psychologically, it's something he's never achieved apart from in his head - he’s lived only through two of his daughters forsaking all his other children.\n\n\"Truth be told, those girls rose to the top while his other children had to suffer because of the choices my dad made, we were raised in poverty after he left.\n\n\"He choose tennis for them, as he knew it could also make him a millionaire.\"\n\nWilliams left when Sabrina was just eight and another sister eight weeks old.\n\nHe made it his number one priority for his daughters to become tennis professionals, even writing a 78-page manifesto outlining his blueprint for success.\n\nSabrina says she had \"two childhoods\" - before and after Williams left.\n\n\"The first was OK because we had money, but the second period was very difficult,\" she said.\n\n\"It was like an instant change. If it wasn't for the churches that we belonged to, I don't think my mom would have made it.\"\n\nShe laughs out loud that his first thirty years have been ignored by King Richard director Reinaldo Marcus Green.\n\nHe hasn't cast a single family member from her dad's first marriage, according to movie directory IMDb.com.\n\nHe choose tennis for them, as he knew it could also make him a millionaire Sabrina Williams\n\n\"It's a comedy, no? How can you make a movie by telling half the story?,\" said Sabrina, a 57-year-old hospice chaplain.\n\nSabrina said that despite being estranged from her dad, she still believes he still thinks about his first family.\n\n\"I think it's just sad, because there's no way that my dad doesn't think about me, or my other brothers and sisters.\n\n\"There's just no way in your life that you can put that to the side and not think about it. I feel sympathy for him like, dude, you need to come to terms with this.\n\n\"He hasn't forgotten us, he’s just put us in a compartment. You know that part of your world exists, but you just don't want to deal with it - and that's a sad thing.\n\nRAISED IN POVERTY\n\n\"I can chase my dad around for the rest of my life in my head, or I can come to terms that I believe my dad loves me in his own way. That's all I can do.\"\n\nSince he walked out on Sabrina and her siblings, she has seen her father just a handful of times.\n\nShe said it's unlikely she'll see her dad again - and won't be going to his funeral.\n\n\"I don't think I'll see him alive. I've even buried my dad in my head because I know I won't be able to attend his funeral.\n\n\"That's just not going to be an option, they’re not going to let me, they won't even tell me. I’ll find out from the media reports or a friend.\n\nRichard Williams is now being looked after by another son - Chavoita LeSane - who has a lengthly rap sheet, as he's \"incapacitated\" and barely able to talk after two strokes.\n\n9 Serena and Venus' father Richard is being portrayed in a new movie starring Will Smith Credit: Getty Images - Getty\n\n9 Sabrina now lives in Las Vegas and has only met her half siblings by chance once in California Credit: These photos are the www.thisischriswhite.com and cannot be reprinted unless authorised to\n\n9 The 57-year-old says she is no longer angry with her father and has come to terms with his painful departure from their lives Credit: These photos are the www.thisischriswhite.com and cannot be reprinted unless authorised to\n\nThe Sun has reached out to Smith's production team and Richard Williams' son, who has power of attorney, for comment.\n\nSabrina alleges he also snubbed the family during the worst times in her life - including when her mother was battling cancer in 1998 and couldn't afford vital medical care before she died.\n\n\"My sister Reneeka was a baby eight weeks old when my dad left,\" she said.\n\n\"How do you leave a baby? I was eight years old, and he left under the pretense 'I'm gonna get you a bike?' I can laugh about it now.\"\n\nShe says: \"If my mom was still alive, she'd laugh: 'That rat b******' - she had a great sense of humor.\n\n\"She stopped giving a damn about my dad a long time before she died.\"\n\nShe also said that actor Will Smith should be \"ashamed of himself\" for starring in the movie.\n\n\"They say Will Smith is probably getting an Academy Award for this, I held him in a deep regard, but, as a black American, he should have wanted to tell the full story.\n\n\"Will Smith is not dumb. They got to grow up better, and didn't have to harvest for food, or worry about their next meal. It would have been nice to have a backstory.\"\n\n'NOT A GOOD DAD'\n\nShe's met her tennis playing half-siblings only once, by chance, at Knott's Berry Farm, a theme park in California, when the pair were teenagers.\n\n\"I wouldn't swap places with Venus or Serena. I was just driving now, listening to music and thinking, would I change anything about my life? No, I wouldn't, I'd go through all the struggles I went through again,\" she said.\n\n\"I don't think I will ever meet Serena or Venus another time. I'd love to be able to meet my niece [Serena’s daughter Olympia, four] because she's so cute and adorable, I love kids.\"\n\nMost of the barbs against her father are punctuated with laughter and self-reflection, as Sabrina feels she's finally found contentment after spending her younger years with unresolved anger issues.\n\n\"How many times are we going to blame our parents for everything?\" she said.\n\n\"My dad is not a good dad, he was never a good dad and that's the truth. But, at some point, you have to take responsibility.\n\n\"That's why I went to counseling - I'm a better person because I realize I can't just blame my dad.\"\n\n9 Will Smith is being tipped for an Academy Award for his role in the movie Credit: Alamy\n\n9 Richard had a manifesto for turning his girls into tennis superstars Credit: AFP\n\n9 Sabrina has not seen her estranged father in years and claims he abandoned their family Credit: These photos are the www.thisischriswhite.com and cannot be reprinted unless authorised to"}, {"url": "https://www.celebsagewiki.com/rich-williams", "page_content": "Age, Biography and Wiki\n\nRich Williams was born on 1 February, 1950, is a Musician. Discover Rich Williams's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 73 years old?\n\nPopular As N/A Occupation Musician Age 73 years old Zodiac Sign Aquarius Born 1 February 1950 Birthday 1 February Birthplace N/A Nationality\n\nWe recommend you to check the complete list of Famous People born on 1 February. He is a member of famous Musician with the age 73 years old group.\n\nRich Williams Height, Weight & Measurements\n\nAt 73 years old, Rich Williams height not available right now. We will update Rich Williams's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nRich Williams Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Rich Williams worth at the age of 73 years old? Rich Williams’s income source is mostly from being a successful Musician. He is from . We have estimated Rich Williams's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nRich Williams Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Rich Williams Wikipedia Imdb\n\nTimeline"}, {"url": "https://peoplepill.com/people/rich-williams/", "page_content": "Richard Allen \"Rich\" Williams (born February 1, 1950) is the guitarist for the rock band Kansas, and has been with them since their 1974 self-titled debut album. Williams lost his right eye in a childhood fireworks accident. He wore a prosthetic eye for many years, but now wears an eye patch instead.\n\nIn the beginning, Williams shared guitar duties with keyboardist/guitarist Kerry Livgren. In the late 1980s, he shared guitar-playing with Steve Morse. After various personnel changes in Kansas, Williams became the band's only guitarist (guitarist Zak Rizvi joined the band in 2016), although David Ragsdale would play the extra guitar parts when the band plays songs with little or no violin, such as \"Portrait (He Knew)\", \"Fight Fire With Fire\", and \"Carry On Wayward Son\". Williams and Phil Ehart are the only two members of Kansas who have never left the band, and have played on all Kansas' albums.\n\nAmong the songs he co-wrote with the band are \"Can I Tell You\", \"No Room for a Stranger\", and the hit \"Play the Game Tonight\".\n\nDiscography"}, {"url": "https://www.guitarworld.com/features/richard-williams-not-to-sound-pompous-but-kansas-pretty-much-gave-birth-to-american-prog-bands", "page_content": "Mention the band Kansas to the average listener, and he or she will instantly name two classic rock staples: Carry On Wayward Son and Dust in the Wind.\n\n“Oh, sure, those are the big ones,” says guitarist Richard Williams, who co-founded the progressive rock outfit back in 1970. “I could let it get to me and go, ‘Hey, we’ve got a whole body of work,’ but that would be a waste of time. Those are the songs that brought us to the table. Without Wayward Son and Dust in the Wind, we wouldn’t be around today.”\n\nWilliams recalls how in 1976, with the band deep in debt to their record label and facing an uncertain future after their first three albums (Kansas, Song for America and Masque) stiffed, they approached the recording of their fourth album, Leftoverture, with a sense of impending doom.\n\n“It was a pretty dark time. We were bleeding money pretty seriously,” he says. “We were signed to Kirshner Records, and our benefactor, Don Kirshner, could have easily said, ‘Guys, it’s been fun, but you need to find another record company.’ We needed a hit, and thank goodness we came up with Carry On Wayward Son. It saved us so we could go on. And then we had Dust in the Wind. Those songs exploded and our worlds changed forever.”\n\nKansas were in a unique position in the mid Seventies. Not only did they represent the last trace of progressive rock on AM playlists that were suddenly ruled by disco, but they were also one of the very few purveyors of American prog, period.\n\n“Not to sound pompous, but we pretty much gave birth to American prog bands,” Williams says. “What’s amazing is, we did it pretty sneakily. We were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material.\n\n“So we’d slip in one of our own tunes and tell the crowd that we were playing the B-side of Smoke on the Water. We’d stretch songs out and go crazy, and the people loved it. It became our thing.”\n\nWe were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material\n\nOf the seven current members of Kansas, only Williams and drummer Phil Ehart remain from the original crew. Singer Steve Walsh, who ended his on-and-off association with the band in 2014, has been replaced by two co-lead vocalists, Billy Greer and Ronnie Platt, who double on bass and keyboards, respectively.\n\nWilliams’ longtime guitar foil Kerry Livgren, who also served as Kansas’ chief songwriter, split in 2000, and in his place is New Jersey picker Zak Rizvi.\n\n(Image credit: Paul Natkin/Getty Images)\n\n“It feels like a different band sometimes because we’ve got a bunch of newer faces,” Williams says, “but at the same time, it feels like the original band because we’ve got seven guys who really love to perform and create. Back in the day, we let money and business get in the way. This bunch of guys just wants to make music.”\n\nThe band has a new album out, 2020’s The Absence of Presence, and all told, it sounds like quintessential Kansas: there’s muscular, epic prog-rockers like Throwing Mountains and the eight-minute-plus title track, symphonic power ballads such as Jets Overhead and Memories Down the Line, and there’s even a “how-over-the-top-can-we-go?” instrumental in the form of Propulsion 1.\n\n“We’re kind of always in a state of having to prove ourselves,” Williams says. “We had to do it on our last album, [2016’s] The Prelude Implicit, because it was our first new music in 16 years, and I think this time we had to prove that we still mean it.”\n\nHe lets out a laugh, then adds, “I imagine on the next one, we’ll have to do the same thing. That’s OK – I’m used to it.”\n\nBefore the band got started, who were the guitar players that you were really listening to and emulating?\n\n“I was copying anybody who was there. The Yardbirds were pretty big to me. My introduction to blues wasn’t through the Americans; I dug the British guys. John Mayall and the Bluesbreakers, Eric Clapton – Clapton’s first solo album was like Guitar 101 to me.\n\n“Instead of this twangy rhythmic instrument, suddenly here’s this ballsy guitar with a guttural saxophone lead voice. Suddenly, I was hearing blues in a different way. Of course, I also loved Jimmy Page and Jeff Beck – those guys made a big impression on me. That stuff really formed the basis of my sound and style.“\n\nGrowing up in Topeka, was it easy for you to get good guitars living where you were?\n\n“Oh, yeah. I had Marshall amps and Les Pauls. I had a Gibson ES-335, which I still have to this day. Everything that you could buy in Los Angeles you could buy in Topeka. When I was 15, I had a charge account at the local music store. If I wanted something, I’d charge it and make weekly payments on it.\n\n“This was a pretty cool time. When The Beatles were on Ed Sullivan’s show, Topeka exploded, just like every other town in the country. Everybody had to be in a band. There was a garage band on every block.“\n\nKansas played covers in clubs for a few years. Do you remember when you first heard prog from England and when it started to influence the band?\n\n“It took a while. For a time it seemed as if only the two coasts were hearing the prog stuff. Gradually the stations in Kansas started playing it – I guess somebody’s ears were tuned to it. We’d be like, 'Wow, have you heard this band called ELP?' Or 'Have you heard Genesis’ Selling England by the Pound?'\n\n“It was very exciting to find all these new, creative ways of addressing rock ‘n’ roll. I don’t even know if 'rock ‘n’ roll' was the correct term for that music.“\n\nSome bands were resistant to chance, but we embraced it... We cut our teeth on rock ‘n’ roll. But we were looking to be different\n\nEven so, it didn’t seem as if American bands were jumping on the prog bandwagon. You guys were outliers.\n\n“Some bands were resistant to chance, but we embraced it. I mean, we played Mitch Ryder & the Detroit Wheels-type stuff; we cut our teeth on rock ‘n’ roll. But we were looking to be different. I remember playing cover songs during our club days. You’d get to a part and be like, 'Man, this song sucks. I hate the middle part.'\n\n“So we started thinking that we could do some sort of interlude at the beginning, or maybe we could play the song at half-time. We did anything to change it up and put some balls to the music. In hindsight, we were doing something very important: We were learning how to be us.“\n\n(Image credit: Dimitri Hakke/Redferns)\n\nDid it seem as if playing throughout your home state was a dead end? Did the band consider relocating to one of the two coasts to get noticed?\n\n“Well, what happened was, we made a demo tape, and that’s what we sent out to the coasts. One of them wound up on Don Kirshner’s desk. The people at Don’s company loved it – they really dug the violin – and they sent a guy named Wally Gold to check us out.\n\n“We put together a show and did that old free-beer trick: 'Come to the show and the drinks are free.' So Wally showed up and the place was packed; everybody was drunk and partying. So Wally called Don and said, 'Man, there’s something going on here. People are crawling through the windows to get in the place.' That sealed the deal. Next thing you know, we signed a deal with Don Kirshner and were making records.“\n\nLeftoverture [1976] and Point of Know Return [1977] hit one after the other. After being hitless for several years, that must have felt remarkable.\n\n”I’m still here today doing this because of that explosion. We didn’t really know how huge it was at the time. We were just blue-collar guys from the Midwest. I remember arriving at Madison Square Garden in a limo with our manager, and he was going, 'Madison Square Garden! This is so big!'\n\n”We were like, 'Yeah, yeah, whatever.' We’d been on the road for so long, so to us this was just a natural progression of more and more shows. Today I realize how big it was, but back then we didn’t really see it.”\n\nHow much of Carry On Wayward Son had Kerry written before the band got to dive into it? And how long did it take to work out that intricate guitar and keyboard solo section?\n\n“That was the last song we did for the album, on the final day or recording. Kerry came in and said he had a new song. We learned the structure of it and got to it. The version you hear on the record is probably the first time we ever played it correctly.\n\n“The solo thing didn’t take long. My approach to guitar is just wing it. I didn’t really have a planned solo. I just responded to what everybody else was doing and threw stuff out there. I was kind of like, 'I’ll just play stuff. Let me know if it sounds right.'“\n\nFor rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression\n\nThe acoustic guitar figure of Dust in the Wind is so recognizable. I understand that Kerry wrote it as a fingerpicking exercise.\n\n“Yeah, Kerry didn’t write the song to write a song; he wrote this chord pattern to teach himself fingerstyle guitar. His wife thought it was a song, and he was like, 'No, this isn’t Kansas. The band would never play this.' But he brought it in and we thought it was really nice.\n\n“The figure was there; it didn’t have the middle section or the violin solo. But it came together fast. I remember when we were listening back to it, somebody said, 'That’s the next single.' Kerry didn’t think so, but the rest of us knew. And sure enough – boom. The track exploded on the radio.“\n\nThe way you approached the solo section of Wayward Son – is that still the way you compose leads in the studio? I’m thinking of the title track of the new album, which has a similar solo structure.\n\n“It’s sort of the same. What happens is, somebody lays something down and everybody else plays off of it. It’s very collaborative, but not as instant as it was back in the day. Somebody else’s solo will dictate what you’re going to do, and you take inspiration from what they’ve done to go somewhere else.\n\n“It’s always fun to do it that way. I’ll lay down the foundation, and then Zak will play something; Tom will do a smoking keyboard part. Sometimes we redo our parts based on what somebody does.“\n\nThe riff in the song Throwing Mountains sounds as tough and mean as early grunge. Did any of that stuff ever make an impression on you?\n\n”Not really at first. I could appreciate the honesty of grunge. It’s like, I loved The Beatles for their polish, but I loved The Rolling Stones for their rawness. You listen to Bob Dylan – his recordings are very elementary, but they’re honest.\n\n”For rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression. So you mention grunge and that song, sure, I’ll take that. It reminds me of how punk obliterated disco back in the day. Let’s get back to being raw.”\n\nHow are you enjoying playing live with Zak Rizvi?\n\n”Oh, I’m loving it. Zak has a deep love and knowledge of the band. He’s a tremendous engineer and guitarist – just brilliant musically. He’s a real scholar of music. Playing with him and having him in the band is great. There isn’t much he can’t play. I mean, he played trombone in a symphony. I have a blast working with him.”\n\nWhat was it like working with Steve Morse during his time in the band?\n\n”What an interesting guy! When he came in, he had just won every guitar award imaginable; they had to invent awards to give him. I’ll be honest: I was a little intimidated at first, but I was pleased to find out that he’s the least intimidating man around. He’s fascinated by everything.\n\n”We would be on tour, and we would see some crappy band playing at a Holiday Inn or wherever. We would be like, 'Let’s go. This band sucks.' But Steve would say, 'Did you see what that guitar player just did with his on/off switch?' The guitarist wasn’t even that good, but Steve was learning from him anyway.”\n\n﻿For a while you played PRS guitars, but I understand you’ve moved back to Les Pauls now.\n\n”I still play PRS guitars occasionally, but I got my hands on a Les Paul that blew me away. It’s one of the Lee Roy Parnell signature models – a reissue of the ’57 Goldtop – and it’s fabulous.\n\n”It’s got a support in the back of the headstock, so if it falls over it won’t break, and the heel has a cutaway so you can get up the neck a lot easier. I run that through a Fractal Axe-Fx III and I’m good to go. I used to have to spend hours getting tones. Now I can just dial in the sound, and boom – let’s play.”"}, {"url": "https://www.mynewsgh.com/richard-williams-iii-bio-age-parents-siblings-wife-children-net-worth/", "page_content": "Richard Williams is a celebrated American Tenis Coach.\n\nHe has trained several Tenis greats in America and is known to be the face behind the two leading Tenis players Serena and Vernus Williams.\n\nRichard Williams was born February 14, 1942. Richard Williams is 80 years in 2022.\n\nHe was born in Shreveport, Louisiana with her sisters and parents but he later moved to Saginaw, Michigan after completing his school and college education and then to California.\n\nIt is the Saginaw. Michigan City and California have made him a legendary coach.\n\nRichard Williams is 6″ tall and weighs 87 kg.\n\nRichard Williams Age\n\nRichard Williams was born February 14, 1942. Richard Williams is 80 years in 2022.\n\nRichard Williams Parents\n\nRichard Williams the Great Tenis Coach was born to Richard Dove Williams and Julia Mae Metcalf. The couple had four other children.\n\nRichard Williams Siblings\n\nRichard Williams had four other siblings. Records of his family say they include Barbara, Pat, Penny, and Faye.\n\nRichard Williams Children\n\nFrom records Richard has been married to three women in his lifetime. Information on his marriages are scanty but reports say he first met Betty Johnson. He married Betty in the year 1965 who he had kids including Sabrina, Ronner, Reluss, Richard III, and Reneeka with. However, they divorced.\n\nRichard moved on and married Oracene “Brandy” Price in 1979 who was also a divorcee with her three daughters. Richard married her in the years 1980 and gave birth to Venus on Jue 17, 1980, and Serena on September 26, 1981. However, this marriage too hit a snag in 2002.\n\nRichard after his second marriage collapsed met Lakeisha Graham who was servicing as a grocery store owner at that time. They fell in love and got married. They gave birth to Dylan in 2012 but divorced at later in 2017."}, {"url": "https://www.fresherslive.com/latest/articles/ricky-williams-net-worth-how-rich-is-he-now-1000010759", "page_content": "How much is Ricky Williams's Net Worth?\n\nSo how much is Ricky Williams actually worth? According to our research, Ricky Williams's net worth is estimated to be $7 million Dollars. Ricky Williams's net worth is largely the result of his success as an American Football player.\n\nName Ricky Williams Net Worth( 2023) $7 million Dollars Profession American Football player Date of Birth 21 May 1977 Age 45 years old Height 180 cm (5 Feet 10 Inches) Weight (229 lbs) 104 kg Birthplace San Diego, California, United States Nationality American\n\nWho is Ricky Williams?\n\nRicky Williams is a former American football player who played in the National Football League (NFL) for over a decade. He was born on May 21, 1977, in San Diego, California, and was raised in Texas. Williams attended the University of Texas at Austin, where he played college football for the Texas Longhorns.\n\nIn 1999, Williams was selected fifth overall in the NFL Draft by the New Orleans Saints. He played for the Saints for three seasons before being traded to the Miami Dolphins in 2002. Williams had some of his best years in the NFL while playing for the Dolphins, leading the league in rushing yards in 2002 and earning Pro Bowl honors in both 2002 and 2003.\n\nDespite his success on the field, Williams had a tumultuous career due to his battles with drug addiction and his controversial decision to retire from the NFL in 2004. He returned to the league in 2005, playing for the Dolphins and later the Baltimore Ravens before retiring for good in 2012.\n\nOff the field, Williams has been an advocate for the use of marijuana for medical and therapeutic purposes. He has also become a certified yoga instructor and founded the Ricky Williams Foundation, which aims to promote wellness and personal growth through yoga, meditation, and other holistic practices.\n\nTRENDING\n\nHow old is Ricky Williams?\n\nAs of 2023, Ricky Williams will be 46 years old. He was born on May 21, 1977, in San Diego, California, which makes him a Taurus. Taurus is known for being reliable, patient, and practical, which may have contributed to Williams' successful football career and his post-football endeavors as a yoga instructor and wellness advocate.\n\nDespite some of the challenges he faced during his NFL career, Williams has remained resilient and has continued to pursue his passions. As he approaches his late 40s, he may find new opportunities to share his expertise and inspire others to prioritize their physical and mental health.\n\nHow tall is Ricky Williams?\n\nRicky Williams is known for his powerful running style, which was complemented by his impressive physical stature. He is 180 cm (5 Feet 10 Inches) tall and weighs approximately (229 lbs) 104 kg. His height and weight made him a formidable opponent on the football field, as he was able to break tackles and push through defenders with ease.\n\nWhile Williams' physical attributes were certainly an asset in his football career, he has also found success in other areas of his life by focusing on holistic wellness and incorporating practices like yoga and meditation into his daily routine. As a certified yoga instructor, he encourages others to prioritize their mental and physical health, regardless of their size or shape.\n\nRicky Williams Biography\n\nRicky Williams is a fascinating figure whose life and career have been marked by a series of twists and turns. Born in San Diego, California, in 1977, Williams grew up in a military family that moved frequently during his childhood. Despite this, he excelled in football and eventually earned a scholarship to play for the University of Texas at Austin.\n\nAfter a successful college career, Williams was drafted by the New Orleans Saints in 1999 and quickly established himself as one of the league's top running backs. However, his career was marked by controversy and personal struggles, including battles with drug addiction and a controversial decision to retire from the NFL in 2004.\n\nDespite these setbacks, Williams remained resilient and eventually returned to the NFL in 2005, playing for several more seasons before retiring for good in 2012. Since then, he has become a certified yoga instructor and founded the Ricky Williams Foundation, which promotes wellness and personal growth through holistic practices. Throughout his life, Williams has been driven by a deep curiosity about the world around him, which has led him to explore a variety of interests and pursue multiple careers. He remains a fascinating and inspiring figure, both on and off the football field.\n\nReal Name Ricky Williams Nick Name Little Earl Date of birth 21 May 1977 Age 45 years old Height 180 cm (5 Feet 10 Inches) Weight (229 lbs) 104 kg Birth Place San Diego, California, United States Gender Male Profession American Football player Religion Christian Nationality American Eye Colour Dark Brown Hair Colour Black Education The University of Texas, Austin Zodiac Sign Gemini Sexual Orientation Heterosexual Kids/Children Name Kekoa Williams, Elijah Williams, Prince Williams, Marley Williams, Asha Williams Parents Errick Williams, Sandy Williams Girlfriend Kristin Barnes Spouse Linnea Miron (m. 2017)\n\nRicky Williams Social Media Accounts\n\nInstagram Click here Twitter Not available YouTube Not available Linkedin Not available Facebook Not available\n\nWhat is Ricky Williams Nationality?\n\nRicky Williams is an American by nationality. He was born in San Diego, California, and spent much of his childhood moving around the country due to his family's military background. Despite this, Williams has always identified as an American and has represented his country both on and off the football field.\n\nAs a football player, Williams played for multiple NFL teams, including the New Orleans Saints, the Miami Dolphins, and the Baltimore Ravens. He was known for his powerful running style and was considered one of the top running backs in the league during his prime.\n\nOff the field, Williams has remained active in American society as an advocate for holistic wellness and alternative medicine. He has been a vocal supporter of the use of marijuana for medical and therapeutic purposes, and has used his platform to raise awareness about the benefits of yoga, meditation, and other holistic practices.\n\nRicky Williams Career\n\nRicky Williams' career has been marked by both success and controversy. He burst onto the scene as a star college football player at the University of Texas at Austin, where he won the Heisman Trophy in 1998 and set numerous school and NCAA records.\n\nAfter being drafted by the New Orleans Saints in 1999, Williams quickly established himself as one of the top running backs in the NFL. He led the league in rushing yards in 2002 and was named to the Pro Bowl in both 2002 and 2003.\n\nHowever, Williams' career was also marked by personal struggles, including battles with drug addiction and a controversial decision to retire from the NFL in 2004. He returned to the league in 2005 and played for several more seasons, but was never able to replicate the success he had earlier in his career.\n\nDespite these challenges, Williams has remained an influential figure in the football world and has continued to inspire others through his work promoting holistic wellness and alternative medicine. Today, he is widely regarded as one of the most talented and enigmatic players in NFL history.\n\nDisclaimer: The above information is for general informational purposes only. All information on the Site is provided in good faith, however we make no representation or warranty of any kind, express or implied, regarding the accuracy, adequacy, validity, reliability, availability or completeness of any information on the Site."}, {"url": "https://www.fresherslive.com/latest/articles/robin-williams-net-worth-how-rich-is-he-now-1000007006", "page_content": "How Much is Robin Williams's Net Worth?\n\nSo how much is Robin Williams actually worth? According to our research, Robin Williams's net worth is estimated to be $50 Million Dollars. Robin Williams's net worth is largely the result of his success as an American Actor.\n\nName Robin Williams Net Worth( 2014) $50 Million Dollars (As of 2014) Profession American Actor Date of Birth 21 July 1951 Age 63 years old (at the time of his death) Height 170 cm (5 Feet 7 Inches) Weight (170 lbs) 77 kg Birthplace Chicago, Illinois, United States Nationality American\n\nWho Was Robin Williams?\n\nRobin Williams was a famous American actor, comedian. Born in Chicago in 1951, Williams grew up in a well-to-do family and attended prestigious schools. He started his career as a stand-up comedian in the 1970s, performing in clubs and on television. His quick wit, improvisational skills, and diverse range of characters quickly made him a fan favorite.\n\nWilliams went on to become one of the most successful and beloved actors of his generation, starring in a string of hit movies, including \"Good Morning, Vietnam,\" \"Dead Poets Society,\" \"Mrs. Doubtfire,\" and \"Good Will Hunting.\" He won numerous awards for his performances, including an Academy Award for Best Supporting Actor for his role in \"Good Will Hunting.\"\n\nThroughout his career, Williams was known for his high-energy performances, his ability to improvise and ad-lib, and his rapid-fire delivery. He also struggled with addiction and depression and tragically took his own life in 2014. Despite his personal struggles, Williams remains an icon of American comedy and a beloved figure in popular culture.\n\nTRENDING\n\nHow old was Robin Williams?\n\nRobin Williams was born on July 21, 1951, at St. Luke's Hospital in Chicago, Illinois, and became one of the most beloved and iconic actors and comedians of his generation. While his untimely death on August 11, 2014, at the age of 63 was a great loss, his legacy continues to live on, and his memory is cherished by millions of fans around the world.\n\nLooking ahead to 2023, it's inspiring to consider what Williams might have accomplished had he lived to see his 72nd birthday. While we can only speculate about what his future might have held, it's not difficult to imagine him continuing to push boundaries and break down barriers in the entertainment industry, inspiring future generations of artists and performers.\n\nDespite his passing, Williams's impact on popular culture remains undiminished, and his work continues to bring joy and laughter to countless people around the globe. So while we can only imagine what his life might have looked like in 2023, we can be confident that his legacy will endure for many years to come.\n\nHow tall is Robin Williams?\n\nRobin Williams was known for his larger-than-life personality, but he was not a particularly tall man. He stood at a height of 5 feet 7 inches (1.7 meters), which is average for a male of his generation. In terms of weight, Williams struggled with fluctuating weight throughout his life. At his heaviest, he weighed around 170 pounds (77 kilograms), and at his lightest, he was around 140 pounds (64 kilograms). His weight gain and loss were often related to his struggles with addiction and depression, which he battled for much of his life.\n\nRobin Williams Biography\n\nRobin Williams was a curious and complex individual, with a life and career that was as fascinating as it was tumultuous. Born in Chicago in 1951, Williams grew up in a privileged family, attending prestigious schools and developing an early interest in theater and comedy.\n\nHe began his career as a stand-up comedian in the 1970s, quickly gaining a reputation for his manic energy and rapid-fire delivery. He soon transitioned to television, starring in the hit sitcom \"Mork & Mindy\" and becoming a household name.\n\nWilliams then turned his attention to film, starring in a string of hit movies that showcased his range and versatility as an actor. He won numerous awards for his performances, including an Academy Award for Best Supporting Actor for his role in \"Good Will Hunting.\"\n\nDespite his success, Williams struggled with addiction and depression, which ultimately led to his tragic death in 2014. His passing was a shock to fans and colleagues alike, and his legacy as one of the greatest comedians and actors of all time continues to be felt to this day.\n\nReal Name Robin McLaurin Williams Nick Name Robin Williams Date of birth 21 July 1951 Age 63 years old Height 170 cm (5 Feet 7 Inches) Weight (170 lbs) 77 kg Birth Place Chicago, Illinois, United States Gender Male Profession American Actor Nationality American Eye Colour Blue Hair Colour Salt and Pepper Education Claremont McKenna College Zodiac Sign Cancer Kids/Children Name Zachary Pym Williams, Cody Alan Williams, Zelda Williams Parents Robert Fitzgerald Williams, Laura McLaurin Divorce Susan Schneider (2011 – 2014), Marsha Garces Williams (1989 – 2008), and Valerie Velardi (1978 – 1988).\n\nRobin Williams's Social Media Accounts\n\nInstagram Not available Twitter Not available YouTube Not available Linkedin Not available Facebook Not available\n\nWhat is Robin Williams's Nationality?\n\nRobin Williams was an American actor and comedian, born in Chicago, Illinois, in 1951. His parents were both American, with his father being a Ford Motor Company executive and his mother a former model. Williams spent much of his childhood in the Detroit area, where he attended a private school and developed an early interest in theater and comedy. After briefly attending college in California, he dropped out to pursue a career as a comedian. Throughout his life, Williams remained a proud American, and his work often reflected his love for his country. He was also a philanthropist, supporting causes such as education, health care, and the arts in the United States and around the world.\n\nRobin Williams Career\n\nRobin Williams's career spanned over four decades and was marked by incredible versatility and range. He began his career as a stand-up comedian, performing in clubs and on television in the 1970s. He soon transitioned to television, starring in the hit sitcom \"Mork & Mindy\" in the late 1970s and early 1980s. This led to his breakout role in the film \"Popeye\" in 1980.\n\nThroughout the 1980s and 1990s, Williams continued to star in a wide range of films, including dramas, comedies, and family-friendly fare. Some of his most memorable roles during this time included \"Good Morning, Vietnam,\" \"Dead Poets Society,\" \"Mrs. Doubtfire,\" and \"Good Will Hunting,\" for which he won an Academy Award for Best Supporting Actor.\n\nIn addition to his work in film and television, Williams was also a talented stage actor, appearing in numerous plays on Broadway and elsewhere. He was also a prolific voice actor, lending his distinctive voice to a wide range of animated films and television shows. Despite his success, Williams struggled with addiction and depression, which ultimately led to his tragic death in 2014. Nevertheless, his legacy as one of the greatest comedians and actors of all time continues to be felt to this day.\n\nRobin Williams Achievement and Awards\n\nRobin Williams had a highly successful career in the entertainment industry and was recognized with numerous awards and achievements throughout his life. Some of his most notable honors include:\n\nAcademy Award for Best Supporting Actor for his role in \"Good Will Hunting\" (1997)\n\nGolden Globe Award for Best Actor in a Motion Picture – Musical or Comedy for his role in \"The Fisher King\" (1991)\n\nGolden Globe Award for Best Actor in a Motion Picture – Drama for his role in \"Good Morning, Vietnam\" (1988)\n\nEmmy Award for Outstanding Individual Performance in a Variety or Music Program for his work on \"Carol, Carl, Whoopi and Robin\" (1987)\n\nGrammy Award for Best Comedy Album for his album \"Reality...What a Concept\" (1980)\n\nScreen Actors Guild Life Achievement Award (2009)\n\nHollywood Walk of Fame star for his contributions to the entertainment industry\n\nInduction into the Academy of Motion Picture Arts and Sciences (2006)\n\nThese awards and achievements are a testament to Williams's incredible talent and impact on the entertainment industry. His legacy continues to be celebrated and remembered by fans and colleagues alike.\n\nDisclaimer: The above information is for general informational purposes only. All information on the Site is provided in good faith, however we make no representation or warranty of any kind, express or implied, regarding the accuracy, adequacy, validity, reliability, availability or completeness of any information on the Site."}, {"url": "https://www.theguardian.com/film/2021/nov/20/king-richard-film-venus-serena-richard-williams", "page_content": "The first surprise came when he climbed into the battered Volkswagen van. “I get in the passenger side and I sit down in the front seat and I get harpooned in the buttock,” tennis coach Rick Macci recalls in a phone interview.\n\n“There’s a spring sticking up and there’s four months’ worth of garbage, McDonald’s wrappers, dirty clothes, tennis balls in the back. I mean, it was crazy, and there’s little Venus and Serena sitting in there and I’m going, ‘Jesus, this is like I’m in a movie.’”\n\nNow Macci is in a movie: King Richard, based on the true story of maverick Richard Williams guiding his daughters from working-class Compton, California, to the pinnacle of world tennis – with the help of that first encounter with Macci in May 1991.\n\nOnce out of the van, they headed for the Williams’s regular tennis courts and were hailed by some basketball players who shouted: “Hey, King Richard!” Macci continues: “They call this guy ‘King Richard’ in 1991. We go across the basketball court and it parts like the Red Sea.”\n\nFor the first hour of practice, Macci was quite impressed by Venus, then aged 10, and nine-year-old Serena, but no more than that. Once he asked them to play competitive points, however, there was an epiphany. “What blew me away was their burning desire to get to the ball. I never saw two young female athletes try so hard to get to the ball. They’d run over broken glass to get a ball.\n\n“I could see the speed, the quickness, and I knew how tall they were going to be. I went right up to Richard and I said, ‘Let me tell you something. You’ve got the next female Michael Jordan on your hands.’ He puts his arm around me and he goes, ‘No, brother man, I got the next two.’”\n\nThis prophetic exchange is recreated by actors Will Smith as Williams and Jon Bernthal as Macci in King Richard, now out, directed by Reinaldo Marcus Green and executive produced by Venus and Serena along with their sister, Isha Price.\n\nThe biopic offers a touching portrayal of a family unit and of Williams as a fiercely determined, infuriatingly headstrong man with a plan, willing to shred conventions and upset the rarefied elites of a sport long synonymous with white privilege. It suggests this impulse flows at least partly from his own traumatic childhood in the deep south.\n\nNow 79, Williams, who is African American, was born in Shreveport, Louisiana, in the Jim Crow era of racial segregation. In his autobiography, Black and White, co-authored by Bart Davis, he writes: “Hatred fueled Shreveport. I often had to run from whites who tried to beat me up. I was chased with a stick, a bat, guns, and chains.\n\n“My body had a lot of reminders of the violence I knew as a child. My nose was broken three times and my teeth were knocked out. I limp to this day because, as a child, I was stabbed in the leg with a railroad spike and an ice pick by members of the Ku Klux Klan.”\n\nSmith convincingly portrays a man who still carries that world on his shoulders. In Compton he works unsociable hours as a security guard and, trying to protect his daughters, falls foul of violent gangs. But he and his wife, Oracene (Aunjanue Ellis), are resolved to give their daughters – Isha, Lyndrea, Tunde, Venus and Serena – the best possible education and opportunities.\n\nIn one scene, Williams tells them: “This world never had no respect for Richard Williams, but they are going to respect y’all.”\n\nIn his memoir, this can come over as tough love. Williams writes that Venus and Serena “didn’t have any choice but to be strong” and, when they were five years old, had to learn taekwondo to protect themselves.\n\nSerena Williams, Will Smith and Venus Williams. Photograph: Matt Baron/Rex/Shutterstock\n\nHe laments about society: “We’re too soft on ourselves and on our kids. We don’t demand excellence. We don’t train them to work hard from an early age. We want to give them kindergarten and ring-around-the-rosy and nonsense that does not really give you any security. Security comes from knowledge. Knowledge is power. Power is the ability to win.”\n\nWhen Venus and Serena – played on screen by 15-year-old Saniyya Sidney and 14-year-old Demi Singleton – emerged as incandescent sporting talents, Williams worked hard to preserve their focus on school, church and fun. Macci witnessed this first-hand after the family moved to Florida so Venus and Serena could join his tennis academy, which had produced stars such as Jennifer Capriati.\n\nSpeaking from Boca Raton, Florida, he recalls: “That’s why I love the guy, I tell everyone he’s the best father of all time. The public look at this tyrant but he always kept balance in their lives. He wanted them to be kids.\n\n“They would always bring their books to the court. If it rained, they would go up to my office and study. If they didn’t want to play, they didn’t play; they’d go to the mall or the beach or Disney World. The guy was in no hurry and that’s why I respect him so much.”\n\nWilliams’s irreverent and mercurial style, and determination to tear up the sporting parents’ playbook, posed challenges for the coach. Macci, who is 66 and still teaches 50 hours a week, says: “At the end of the day, the guy was amazing, even though I had to work around it. I told many people, ‘Listen, doing that for four years, I should be in the hall of fame just for that!’ But that’s part of coaching. I had to coach the parents too.\n\n“You figure out how to do it. It takes a certain personality but I was on a mission. The cost didn’t matter; nothing mattered because the girls were like family. Richard and I were best friends and when you love what you’re doing and you love the people you’re doing it with, you don’t keep score. You find a way to make it happen and the rest is history.”\n\nWill Smith with Demi Singleton, left, and Saniyya Sidney in King Richard. Photograph: Chiabella James/AP\n\nWilliams had no background in the sport and few financial resources but marched to the beat of his own drum, shrugging off media vilification as a brash self-promoter. In Smith’s portrayal he is a visionary unmolested by self-doubt.\n\nMacci comments: “The guy is bulletproof. He’s one of the most confident people I’ve ever met in my life, and I’ve met a lot of people in all walks of life. He early on instilled that into these two little girls.\n\n“If any two people would have felt more pressure – which ruins some people – it could have been Venus and Serena. It made them stronger because Richard and Oracene prepared them for how the world was going to react and respond. Venus said it best: ‘We were almost brainwashed to think we were going to be number one.’”\n\nThere is no doubt in Macci’s mind that Serena, who is now 40 years old and has won 23 career grand slam titles, is the greatest female player of all time, with Venus not far behind. He believes that both transcend tennis, and all sport, as role models.\n\nKing Richard depicts another coach earlier in the sisters’ career: Paul Cohen (Tony Goldwyn), who first met them when Venus was seven and Serena six. In an interview from his home in San Rafael, California, the 84-year-old disputed several details in the movie, including its portrayal of Williams repeatedly interfering during a lesson to argue over the girls’ on-court stance.\n\nCohen, who coached star players including John McEnroe, also rejected the film’s telling of how the men parted ways, insisting that he was not fired by Williams but simply relocated with his wife to northern California and so could not continue to coach Venus and Serena.\n\n“Richard and I got along really well,” he says of their three years together. “He was my assistant coach and he got an A-plus. We never had a disagreement; we were good friends. Venus was like a big sister to my daughter, who was like a little baby.\n\n“It couldn’t have been a better relationship and he couldn’t have been a nicer guy. They kind of portrayed him as pushy and manipulative. He never was that with me, ever. The girls were perfect students. Whatever I told them to do, they did. We never had an argument.”\n\nWhen Venus was nearly eight, Cohen recalls, she suffered a debilitating condition in her feet. “Richard said, ‘My baby can’t walk.’ I said, ‘Richard, that’s the best thing that could ever happen.’ He was shocked. I said, ‘I’m going to stand there and pitch balls to her underhanded. She’ll stand on the baseline and I’ll create a Michelangelo perfect tennis game.’ We did this for nine months. She couldn’t run and she was in pain but we just did it. Those nine months were the key.”\n\nRichard Williams at Wimbledon in 2007. Photograph: Andrew Parsons/PA\n\nKing Richard culminates with Venus’s debut in a professional tournament and a match against one of the best players in the world. It leaves viewers in no doubt about the historic significance of two young African American women rising to the top of the tennis world.\n\nStacey Allaster, chief executive of professional tennis at the United States Tennis Association, says: “They definitely helped to break barriers for our sport to be more inclusive of people of colour and of other diversity, and we still have a long way to go. We can’t as a sport say we’re there yet.\n\n“We’ve been given so many gifts from Serena and Venus and Richard and Oracene and the entire family, and one of them has been inspiring other little Black girls and other little Black boys that they could play tennis and they could achieve their dreams.”\n\nAllaster, who is the former chief executive of the Women’s Tennis Association, adds: “Richard knew Venus and Serena were going to shake up the world. They have, and it has transcended just tennis. Sport is a microcosm of society and, whether it was intentional or not, they have used their gifts on court to make a difference in the world.\n\n“It is one very strong family of courage and love and the film does a wonderful job sharing everything that family has sacrificed and gone through. It’s such an inspirational story.”"}, {"url": "https://factsbuddy.com/rick-williams/", "page_content": "Rick Williams Bio | Wiki\n\nRick Williams is an American reporter and anchor for 6abc. He anchors Action News at 5 and 11 p.m broadcasts. Rick is also a reporter for the weekly “Crimefighters” series at Action News. His favorite assignment has been hosting Thanksgiving Day Parade along with Cecily Tynan every year for 6abc since 2009. Previously, he was co-anchoring Action News Mornings. Before joining the station in 1988, Rick was working in Raleigh, North Carolina for WRAL-TV.\n\nRick Williams Age\n\nHe was born on February 7, 1961, in New York, in the United States. Rick is 61 years old.\n\nRicky Williams Height\n\nHe is a man of above-average stature. Rick’s height is 5 ft 9 in ( Approx 1.75m).\n\nRicky Williams Family\n\nHe was born in New York but considers Philadelphia his home. Rick was raised in a Black descent family. Furthermore, he grew up along with his younger sister.\n\nRick Williams Wife\n\nHe got married to his lovely wife Jocelyn Mitchell on September 21, 2000. Rick’s wife is an obstetrician-gynecologist in New Jersey. Furthermore, his wife is one of the 53 doctors specializing in the female reproductive system and pregnancy at Cooper University Health Care-Camden. Rick and his wife celebrated their 17th wedding anniversary in September 2017. During the anniversary, he celebrated his wife for making him a better man. The couple are proud parents of a son born on February 14, 2002, Nicholas Williams.\n\nRick Williams Son\n\nHe got married to his lovely wife Jocelyn Mitchell on September 21, 2000. Rick and his wife are proud parents of a son born on February 14, 2002, Nicholas Williams. Rick was proud of his son when he turned 18 on Valentine’s day in 2020. His son was an actor at Walnut Street Theater in 2015 in the cast, A Christmas Story. In the cast, Rick’s son played the role of a bratty kid in one of Santa’s scenes. His son is all grown and he is now in college.\n\nRich Williams Education\n\nHe graduated from Howard University in Washington D.C. in 1983 where he received a Bachelor of Science in Broadcast Journalism. While in college, Rick was working for a radio station in the area. Rick describes himself as a true Philadelphian who invests much of his time in serving as an inspiration to the academic endeavors of young people.\n\nRick Williams 6abc\n\nHe is an American reporter and anchor for 6abc. Rick anchors Action News at 5 and 11 p.m broadcasts. Additionally, Rick is also a reporter for the weekly “Crimefighters” series at Action News. While working for 6abc, he has worked alongside Cecily Tynan and Monica Malpass in co-anchoring Action News Mornings.\n\nHis favorite assignment has been hosting Thanksgiving Day Parade along with Cecily Tynan every year for 6abc since 2009. Before joining the station in 1988, Rick was working in Raleigh, North Carolina for WRAL-TV.\n\nDuring his career as a reporter, Rick has worked in Washington D.C, Huntington, and West Virginia. He has also interviewed various celebrities, politicians, and presidents. Additionally, Rick is a board member of Philadelphia Futures which mentors Philadelphia students who are college-bound. He has also taken the stage with his family and friends in a few musical productions and is a board member of Moorestown Theater Company.\n\nSome of Rick’s colleagues at 6abc include:\n\nTamala Edwards – co-anchor.\n\nNydia Han – consumer investigative reporter.\n\nTrish Hartman – correspondent.\n\nAnnie McCormick – general assignment reporter.\n\nRick Williams Salary\n\nHe has been working as a reporter and anchor for 6abc for more than 25 years. Rick’s salary is $110,000 annually.\n\nRick Williams Net Worth\n\nHe has been in media journalism for at least three decades, and therefore, there is no doubt that Rick has been able to accumulate a decent fortune for himself over the years. Rick’s net worth is $2.5 million.\n\nHow Old Is Rick Williams\n\nRick is 61 years old. He was born on February 7, 1961, in New York, the United States.\n\nAre Rick Williams And Sharrie Williams Related\n\nRick and Sharrie Williams are related work-wise, they both work for 6abc. Sharrie is a reporter and co-anchor for Action News on PHL17. She was born in Albany, Georgia in a family of four children, while Rick was born in New York. Therefore, Rick and Sharrie are not related by blood.\n\nIs Rick Williams Married\n\nYes, he has been married to his beautiful wife Jocelyn Mitchell since September 21, 2000. Rick’s wife is an obstetrician-gynecologist in New Jersey. The couple are proud parents of a son born on February 14, 2002, Nicholas Williams.\n\nHow Old Is Rick Williams Son\n\nRick’s son, Nicholas Williams is 20 years old. He was born on February 14, 2002.\n\nDoes Rick Williams have a daughter\n\nNo, Rick is a proud father of one son, Nicholas whom he shares with his wife Jocelyn Mitchell.\n\nRick Williams Facebook"}], "Rich Williams is a guitarist, singer, songwriter, and record producer.": [{"url": "https://www.guitarworld.com/features/richard-williams-not-to-sound-pompous-but-kansas-pretty-much-gave-birth-to-american-prog-bands", "page_content": "Mention the band Kansas to the average listener, and he or she will instantly name two classic rock staples: Carry On Wayward Son and Dust in the Wind.\n\n“Oh, sure, those are the big ones,” says guitarist Richard Williams, who co-founded the progressive rock outfit back in 1970. “I could let it get to me and go, ‘Hey, we’ve got a whole body of work,’ but that would be a waste of time. Those are the songs that brought us to the table. Without Wayward Son and Dust in the Wind, we wouldn’t be around today.”\n\nWilliams recalls how in 1976, with the band deep in debt to their record label and facing an uncertain future after their first three albums (Kansas, Song for America and Masque) stiffed, they approached the recording of their fourth album, Leftoverture, with a sense of impending doom.\n\n“It was a pretty dark time. We were bleeding money pretty seriously,” he says. “We were signed to Kirshner Records, and our benefactor, Don Kirshner, could have easily said, ‘Guys, it’s been fun, but you need to find another record company.’ We needed a hit, and thank goodness we came up with Carry On Wayward Son. It saved us so we could go on. And then we had Dust in the Wind. Those songs exploded and our worlds changed forever.”\n\nKansas were in a unique position in the mid Seventies. Not only did they represent the last trace of progressive rock on AM playlists that were suddenly ruled by disco, but they were also one of the very few purveyors of American prog, period.\n\n“Not to sound pompous, but we pretty much gave birth to American prog bands,” Williams says. “What’s amazing is, we did it pretty sneakily. We were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material.\n\n“So we’d slip in one of our own tunes and tell the crowd that we were playing the B-side of Smoke on the Water. We’d stretch songs out and go crazy, and the people loved it. It became our thing.”\n\nWe were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material\n\nOf the seven current members of Kansas, only Williams and drummer Phil Ehart remain from the original crew. Singer Steve Walsh, who ended his on-and-off association with the band in 2014, has been replaced by two co-lead vocalists, Billy Greer and Ronnie Platt, who double on bass and keyboards, respectively.\n\nWilliams’ longtime guitar foil Kerry Livgren, who also served as Kansas’ chief songwriter, split in 2000, and in his place is New Jersey picker Zak Rizvi.\n\n(Image credit: Paul Natkin/Getty Images)\n\n“It feels like a different band sometimes because we’ve got a bunch of newer faces,” Williams says, “but at the same time, it feels like the original band because we’ve got seven guys who really love to perform and create. Back in the day, we let money and business get in the way. This bunch of guys just wants to make music.”\n\nThe band has a new album out, 2020’s The Absence of Presence, and all told, it sounds like quintessential Kansas: there’s muscular, epic prog-rockers like Throwing Mountains and the eight-minute-plus title track, symphonic power ballads such as Jets Overhead and Memories Down the Line, and there’s even a “how-over-the-top-can-we-go?” instrumental in the form of Propulsion 1.\n\n“We’re kind of always in a state of having to prove ourselves,” Williams says. “We had to do it on our last album, [2016’s] The Prelude Implicit, because it was our first new music in 16 years, and I think this time we had to prove that we still mean it.”\n\nHe lets out a laugh, then adds, “I imagine on the next one, we’ll have to do the same thing. That’s OK – I’m used to it.”\n\nBefore the band got started, who were the guitar players that you were really listening to and emulating?\n\n“I was copying anybody who was there. The Yardbirds were pretty big to me. My introduction to blues wasn’t through the Americans; I dug the British guys. John Mayall and the Bluesbreakers, Eric Clapton – Clapton’s first solo album was like Guitar 101 to me.\n\n“Instead of this twangy rhythmic instrument, suddenly here’s this ballsy guitar with a guttural saxophone lead voice. Suddenly, I was hearing blues in a different way. Of course, I also loved Jimmy Page and Jeff Beck – those guys made a big impression on me. That stuff really formed the basis of my sound and style.“\n\nGrowing up in Topeka, was it easy for you to get good guitars living where you were?\n\n“Oh, yeah. I had Marshall amps and Les Pauls. I had a Gibson ES-335, which I still have to this day. Everything that you could buy in Los Angeles you could buy in Topeka. When I was 15, I had a charge account at the local music store. If I wanted something, I’d charge it and make weekly payments on it.\n\n“This was a pretty cool time. When The Beatles were on Ed Sullivan’s show, Topeka exploded, just like every other town in the country. Everybody had to be in a band. There was a garage band on every block.“\n\nKansas played covers in clubs for a few years. Do you remember when you first heard prog from England and when it started to influence the band?\n\n“It took a while. For a time it seemed as if only the two coasts were hearing the prog stuff. Gradually the stations in Kansas started playing it – I guess somebody’s ears were tuned to it. We’d be like, 'Wow, have you heard this band called ELP?' Or 'Have you heard Genesis’ Selling England by the Pound?'\n\n“It was very exciting to find all these new, creative ways of addressing rock ‘n’ roll. I don’t even know if 'rock ‘n’ roll' was the correct term for that music.“\n\nSome bands were resistant to chance, but we embraced it... We cut our teeth on rock ‘n’ roll. But we were looking to be different\n\nEven so, it didn’t seem as if American bands were jumping on the prog bandwagon. You guys were outliers.\n\n“Some bands were resistant to chance, but we embraced it. I mean, we played Mitch Ryder & the Detroit Wheels-type stuff; we cut our teeth on rock ‘n’ roll. But we were looking to be different. I remember playing cover songs during our club days. You’d get to a part and be like, 'Man, this song sucks. I hate the middle part.'\n\n“So we started thinking that we could do some sort of interlude at the beginning, or maybe we could play the song at half-time. We did anything to change it up and put some balls to the music. In hindsight, we were doing something very important: We were learning how to be us.“\n\n(Image credit: Dimitri Hakke/Redferns)\n\nDid it seem as if playing throughout your home state was a dead end? Did the band consider relocating to one of the two coasts to get noticed?\n\n“Well, what happened was, we made a demo tape, and that’s what we sent out to the coasts. One of them wound up on Don Kirshner’s desk. The people at Don’s company loved it – they really dug the violin – and they sent a guy named Wally Gold to check us out.\n\n“We put together a show and did that old free-beer trick: 'Come to the show and the drinks are free.' So Wally showed up and the place was packed; everybody was drunk and partying. So Wally called Don and said, 'Man, there’s something going on here. People are crawling through the windows to get in the place.' That sealed the deal. Next thing you know, we signed a deal with Don Kirshner and were making records.“\n\nLeftoverture [1976] and Point of Know Return [1977] hit one after the other. After being hitless for several years, that must have felt remarkable.\n\n”I’m still here today doing this because of that explosion. We didn’t really know how huge it was at the time. We were just blue-collar guys from the Midwest. I remember arriving at Madison Square Garden in a limo with our manager, and he was going, 'Madison Square Garden! This is so big!'\n\n”We were like, 'Yeah, yeah, whatever.' We’d been on the road for so long, so to us this was just a natural progression of more and more shows. Today I realize how big it was, but back then we didn’t really see it.”\n\nHow much of Carry On Wayward Son had Kerry written before the band got to dive into it? And how long did it take to work out that intricate guitar and keyboard solo section?\n\n“That was the last song we did for the album, on the final day or recording. Kerry came in and said he had a new song. We learned the structure of it and got to it. The version you hear on the record is probably the first time we ever played it correctly.\n\n“The solo thing didn’t take long. My approach to guitar is just wing it. I didn’t really have a planned solo. I just responded to what everybody else was doing and threw stuff out there. I was kind of like, 'I’ll just play stuff. Let me know if it sounds right.'“\n\nFor rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression\n\nThe acoustic guitar figure of Dust in the Wind is so recognizable. I understand that Kerry wrote it as a fingerpicking exercise.\n\n“Yeah, Kerry didn’t write the song to write a song; he wrote this chord pattern to teach himself fingerstyle guitar. His wife thought it was a song, and he was like, 'No, this isn’t Kansas. The band would never play this.' But he brought it in and we thought it was really nice.\n\n“The figure was there; it didn’t have the middle section or the violin solo. But it came together fast. I remember when we were listening back to it, somebody said, 'That’s the next single.' Kerry didn’t think so, but the rest of us knew. And sure enough – boom. The track exploded on the radio.“\n\nThe way you approached the solo section of Wayward Son – is that still the way you compose leads in the studio? I’m thinking of the title track of the new album, which has a similar solo structure.\n\n“It’s sort of the same. What happens is, somebody lays something down and everybody else plays off of it. It’s very collaborative, but not as instant as it was back in the day. Somebody else’s solo will dictate what you’re going to do, and you take inspiration from what they’ve done to go somewhere else.\n\n“It’s always fun to do it that way. I’ll lay down the foundation, and then Zak will play something; Tom will do a smoking keyboard part. Sometimes we redo our parts based on what somebody does.“\n\nThe riff in the song Throwing Mountains sounds as tough and mean as early grunge. Did any of that stuff ever make an impression on you?\n\n”Not really at first. I could appreciate the honesty of grunge. It’s like, I loved The Beatles for their polish, but I loved The Rolling Stones for their rawness. You listen to Bob Dylan – his recordings are very elementary, but they’re honest.\n\n”For rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression. So you mention grunge and that song, sure, I’ll take that. It reminds me of how punk obliterated disco back in the day. Let’s get back to being raw.”\n\nHow are you enjoying playing live with Zak Rizvi?\n\n”Oh, I’m loving it. Zak has a deep love and knowledge of the band. He’s a tremendous engineer and guitarist – just brilliant musically. He’s a real scholar of music. Playing with him and having him in the band is great. There isn’t much he can’t play. I mean, he played trombone in a symphony. I have a blast working with him.”\n\nWhat was it like working with Steve Morse during his time in the band?\n\n”What an interesting guy! When he came in, he had just won every guitar award imaginable; they had to invent awards to give him. I’ll be honest: I was a little intimidated at first, but I was pleased to find out that he’s the least intimidating man around. He’s fascinated by everything.\n\n”We would be on tour, and we would see some crappy band playing at a Holiday Inn or wherever. We would be like, 'Let’s go. This band sucks.' But Steve would say, 'Did you see what that guitar player just did with his on/off switch?' The guitarist wasn’t even that good, but Steve was learning from him anyway.”\n\n﻿For a while you played PRS guitars, but I understand you’ve moved back to Les Pauls now.\n\n”I still play PRS guitars occasionally, but I got my hands on a Les Paul that blew me away. It’s one of the Lee Roy Parnell signature models – a reissue of the ’57 Goldtop – and it’s fabulous.\n\n”It’s got a support in the back of the headstock, so if it falls over it won’t break, and the heel has a cutaway so you can get up the neck a lot easier. I run that through a Fractal Axe-Fx III and I’m good to go. I used to have to spend hours getting tones. Now I can just dial in the sound, and boom – let’s play.”"}, {"url": "https://www.musicradar.com/news/best-songwriters-2021", "page_content": "2021 has been a phenomenal year for writing. All of the music created by songwriters who spent 2020 killing time, facing down existential angst and penning tunes, filtered through this year.\n\nThe uncertain backdrop and enforced introspection endured by us all during that time did at least reap rich rewards for the writers among us. The competition was stiff then, but here’s who you voted for as the best of the year…\n\n1. Winner, Best Songwriter Guitarist 2021: Ed Sheeran\n\nThe one-man pop chart has run away with our songwriter poll, taking over 36% of the total votes for the 2021 top spot.\n\nThis year he became the first British solo artist to achieve a total of 52 weeks at number one on the singles chart (only The Beatles and Elvis have surpassed that – and they released a fair few covers).\n\nSheeran’s return single Bad Habits spent 11 weeks in pole position and was only unseated by his own follow-up, Shivers. Meanwhile, fifth album = (equals) went to number one in the UK and US simultaneously and the singer-songwriter has rounded out the year with charity Christmas single, with Elton John.\n\n2. Sam Fender\n\nYou don’t have to look far to find older musicians ranting about younger players’ lack of a political voice or appetite for change. Fender is name you can shove back in their faces. The North Shields songwriter makes being socially conscious and politically aware sound and look good. His 2021 album Seventeen Going Under examined how the headlines hit real people, in his own life and beyond, in the form of heart-aching, pulse racing, personal rock songs.\n\n3. Julien Baker\n\nThe US songwriter’s third album Little Oblivions cemented Baker’s place as a master of introspective songwriting, analysing the minutiae of her thoughts and interactions in touching and surprising ways. It all comes against a musical backdrop that is just as intricate and affecting.\n\n4. Ben Howard\n\nThe songwriter’s first collaboration with producer Aaron Dessner, Collections From The Whiteout, sharpened the experimental instincts found on Howard’s previous record Noonday Dream. The result was an album of richly varied writing, textural experimentation and memorable melodic elements.\n\n5. Marie Ulven (Girl In Red)\n\nUlven’s work as Girl In Red marries the charm from her early DIY efforts with punchy production and an open portrayal of her chaotic inner monologue. It’s a messy yet masterful montage of what it means to be of a teenager and young adult in 2021.\n\n6. John Smith\n\nSmith is heavily influenced by the great British folk guitarists and songwriters. 2021’s The Fray represents a changing stance – channeling peace and tranquility against a considerably more fraught backdrop, globally and personally. It’s a collected, emotive record – an exercise in musical meditation.\n\n7. Daniel Donato\n\nDonato’s 2021 collection Cosmic Country & Western Songs is a deftly honed blend of country music and psychedelia. He is a master of country playing techniques and the album is littered with fiery chicken-picking and memorable leads lines, yet it never overshadows the song.\n\n8. Lindsey Jordan (Snail Mail)\n\nSecond albums are often the sound of a songwriter disavowing their roots, Snail Mail’s is the opposite. Valentine was birthed as Jordan sheltered from the pandemic back home in her childhood bedroom. It proved a surprisingly fertile environment for an album that still evolves – it feels more mature and better paced – yet benefits from the creative freedom found in a comfortable space.\n\n9. Morgan Wade\n\nThe country songwriter has been endorsed by Jason Isbell and Sadler Vaden. Her debut album Reckless showcases an artist well-acquainted with that unhealthy dose of real life that is deemed so essential to country music, yet it also attempts to reconcile this against a shift to a brighter future, both in and out of music.\n\n10. Beatrice Laus (Beabadoobee)\n\nLaus’ released her debut album as Beabadoobee, Fake It Flowers, in 2020, so fans had to content themselves with the four-track Our Extended Play EP this year. Nonetheless, Laus shows no sign of running out ideas – it's a remarkably fresh collection of airy 90s-tinted addictive guitar pop that wears its heart on its sleeve."}, {"url": "https://www.guitarworld.com/magazine/dear-guitar-hero-richard-williams", "page_content": "Richard Williams. He’s played on every Kansas album since with the group’s self-titled 1974 debut. But what Guitar World readers really want to know is…\n\nWhy do you think the Seventies produced so many iconic bands? — Rich Fazio\n\nIt was a time of unrestricted experimentation. In addition to pop-music groups, there were bands that stuck out of the box, and it was allowed by the record companies.\n\nBut the music business squashed that a long time ago. Bands are still playing challenging stuff, but in the popular world of music most of them are never going to see the light of day. The Seventies bands were immediately identifiable, and each had its own stamp.\n\nKansas sold out Madison Square Garden when they played there [June 28, 1978]. What do you remember about that show? — Carmine D’urso\n\nThree things pop into my head right away. First, riding to the show in a limousine. It was just another arena show for us, because we were so unaffected by our success. In hindsight, though, I thought, Holy shit, we just played the Garden, and it sold out! The second thing that stands out is that, on the way to the show, Jeff Glixman, our road manager then, got pissed off after seeing people on the side streets selling bootleg Kansas T-shirts.\n\nSo he got out of the limo and told some guy to stop selling them, and the guy pointed a pistol at Jeff and told him to get out of his face. The third thing that comes to mind is we wanted to record our live album, Two for the Show, at the Garden. We had the mobile recording track with us at the venue that night, but the American Federation of Musicians wanted to charge us $50,000 to use it, so we told the union we weren’t paying that sum of money and recorded the album in Philadelphia and elsewhere.\n\nAlthough Kansas is best known for “Carry On Wayward Son” and “Dust in the Wind,” to me those songs don’t accurately represent the group’s sound. Overall, on the majority of your catalog, Kansas sounds like an American counterpart to European progressive rock bands such as Yes and King Crimson. Would you agree? — Albert Morris\n\nThe heart of Kansas is in that style of music, but we don’t sound like any of those groups. We’re a ballsy American rock band above all. But those bands were our heroes and made us realize that you could assemble songs in weird time signatures and didn’t have to format music in a traditional manner. Those are the types of influences that, collectively, brought the original members of Kansas together. Personally, I loved early Yes, early Genesis and Gentle Giant, and each of the bands from that genre were completely and uniquely different from each other.\n\nKansas’ level of musicianship is awesome, yet you’ve channeled that virtuosity into many catchy, memorable songs. What makes the band so versatile? — Mike Sabatino\n\nComing out of Topeka, Kansas, there were a lot of guitarists I knew who were better than me. If music were all about virtuosity and chops, we’d all be listening to very high-brow jazz and the opera and symphonies. Individually, the members of Kansas are all pretty darn good, but collectively, the sum of the parts is incomparable.\n\nOne of the great things about music is that you can sit down and play by yourself, but it’s far more joyful to hear the organic sound of people of like thought playing together. That’s what music is all about. The members of Kansas had a common direction. We were friends who stuck together and created something magical.\n\nI saw the promotional video for Kansas’ documentary, Miracles Out of Nowhere, online. I was happy to see artists as diverse as Brian May and Garth Brooks gush about the band. Why do you think Kansas’ music appeals to not just the public at large but big-name musicians as well? — John Dinapoli\n\nThere’s an honesty to our music; all people can relate to it. We’re not contrived, we’re not an act, and we’ve never chased fame. We’ve always been a hard-working, blue-collar band. Kansas was the opening act for Queen’s first U.S. tour, and we bonded with those guys. Brian’s appreciation for us has always been heartfelt.\n\nI’ve known for years that Garth was one of our biggest fans. He’s been able to incorporate the rock-concert experience into country music, which I’m proud to say was partly inspired by Kansas and his admiration of us. Regarding the documentary, we just wanted to tell the story of the original band members coming from Topeka and climbing to the top of the mountain.\n\nWhen all the original members were in the band, Kansas could replicate its studio recordings with great clarity and precision onstage. How did you guys pull this off so effortlessly? — Vincent Macrino\n\nIt was the mindset at the time. Onstage, we’d play our most demanding songs from our albums and pull them off. We’d record the songs as if we were playing them live.\n\nWhat was it like coming from Topeka to New York City to record Kansas’ first album at the Record Plant, where John Lennon and other famous artists also happened to be recording at the time? — Lauren Glaser\n\nIt was quite an experience. I didn’t get to see John Lennon—I would’ve shit myself had I did—because we were on the graveyard shift in Studio C while the big acts were recording in a different part of the building. The studio was near Times Square, which was not cleaned up like it is today. There were drug dealers, hookers and porn everywhere. It wasn’t safe walking those streets at night.\n\nPeople would approach you and say, “Wanna buy some shit?” It was terrifying. As for our first album, it was recorded, mixed and completed in three weeks. I cowrote the opening track, “Can I Tell You,” which was the song that caught [manager/producer] Don Kirshner’s attention and landed us a record deal.\n\nKerry Livgren was Kansas’ primary songwriter during the band’s heyday. How much input did you have on his songs? — Pete Bedrosian\n\nIt varied. Some songs were written entirely by Kerry, while others were a group effort. He has the remarkable ability to compose songs in his head in an evening; then he’d present them to the band, tell us what to play, and we’d help him arrange the parts and offer our suggestions.\n\nKerry was influenced by classical music, and it shows in his writing. Besides being a superb guitarist and keyboardist, Kerry is a songwriting genius. I mean, here’s a guy who was able to turn a fingerpicking exercise, “Dust in the Wind,” into one of the most popular songs of all time! There is and never has been a song like that on the radio.\n\n“Icarus (Borne on Wings of Steel)” is one of the heaviest yet most progressive songs I’ve ever heard. What inspired it? — Sid Rosenthal\n\nThe song revolves around the whole concept of flight. Kerry was very inspired by aviation. Both he and his father flew planes. The lyrics are about the story of Icarus, and musically the song has many shifts in dynamics. Whenever a band member would bring in a song, it would go through the Kansas “meat grinder,” in that we would just chew it to pieces. Each member of the band would challenge one another. Dave [Hope, bass], in particular, was brutal. He would say things like, “That middle section sucks! Crank it up! We need something with more backbone there.” “Icarus” goes over great live. The crowd goes wild when we play it.\n\nCan you talk about the incident that led up to you losing your right eye one Fourth of July in your early teens when a homemade bomb blew up in your face? — Gary Deleo\n\nIt was the summer between seventh and eighth grade. It was hotter than hell, and I had already blown up all my fireworks. So I took money out of my coin collection and got on my bicycle and rode to the outskirts of town to buy more fireworks. Then I went down to my basement and dumped all the powder from the firecrackers into a glass medicine bottle with a porcelain top with the intention of making a bomb that would make more of a statement than simply blowing up a bunch of firecrackers.\n\nBut when I twisted the lid shut, the friction from the threading on the bottle sparked, and the whole thing exploded and ripped me to pieces, and my parents rushed me to the hospital. I wore a prosthetic eye for a while, but I got rid of it because it wasn’t very comfortable.\n\nWhat inspired you to play guitar, and who are your musical influences? — Jerry Egan\n\nSeeing the Beatles on The Ed Sullivan Show in 1964 inspired me to want to be in a band. I didn’t begin playing guitar then, but that’s when I wanted to start. The guitarists in the Yardbirds had a huge influence on me—Page, Clapton and Beck contributed greatly to the development of rock guitar. And John Mayall’s Blues Breakers with Eric Clapton was mind blowing. It was an album where guitar was not a background accompaniment; it hit you right in your face. That was “Guitar 101” to me.\n\nPhoto: Neil Zlozower/Atlas Icons"}, {"url": "https://moneyinc.com/richest-guitarists-world/", "page_content": "Building a career in music might be a gamble, but if that gamble pays off, the rewards are huge. Some of the biggest names in music are sat on fortunes worth millions of dollars. Surprisingly, not all of them are singers or frontmen.\n\nThe leader and songwriter might get the lion’s share of a band’s riches, but there’s still plenty left over for the guitarist. If that guitarist also happens to tick the singer, songwriter, and band founder boxes, so much the better.\n\nIf you’re keen to find out which guitarist is the wealthiest of them all, take a look at our list of the 20 richest guitarists in the world.\n\n20. Mark Knopfler – Net Worth: $95 Million\n\nAs a songwriter, film score composer, guitarist, record producer, lead vocalist, and the founder of Dire Straits, Mark Knopfler is clearly a man of many talents… and many millions. By the latest reckoning, Knopfler is worth the grand total of $95 million, making him one of the richest men in rock and an easy candidate for our top 20.\n\n19. Tony Iommi – Net Worth: $140 Million\n\nUp next is Ozzy Osbourne’s long-suffering bandmate, Tony Iommi of Black Sabbath. As one of the pioneers of heavy metal, Iommi’s influence on rock metal can’t be overstated. Widely considered to be one of the greatest guitarists of all time, the techniques he developed during the band’s formative years are credited with changing the shape of music as we know it today. He’s currently estimated to be worth $140 million.\n\n18. Pete Townshend – Net Worth: $150 Million\n\nAuthor, rocker, vocalist, songwriter, and guitarist Pete Townshend is best known as one of the founding members of the legendary rock group, The Who. In addition to founding the band and playing the keyboard, mandolin, drums, bass guitar, banjo, and almost everything else for them, he also acted as their principal songwriter, penning over 100 songs in total and contributing to the sale of over 100 million albums worldwide.\n\nAcknowledged as one of the greatest guitarists of all time, he’s won numerous awards and accolades over the course of his career, including induction into the Rock and Roll Hall of Fame. His current net worth is around $150 million.\n\n17. Angus Young – Net Worth: $160 Million\n\nScottish-born Australian guitarist and songwriter Angus Young may dress like an overgrown schoolboy, but he’s clearly earning a lot more than just pocket money. These days, the AC/DC frontman and guitarist is worth a massive $160 million. Considering he’s the founding member of the 14th best-selling band of all time, with sales of over 200 million records worldwide, it’s hardly surprising.\n\n16. Jimmy Page – Net Worth: $180 Million\n\nUp next is Jimmy Page, a man who’s widely considered one of the most versatile and important guitarists in living memory. His work with Led Zeppelin needs little introduction. For those who prefer their music on the mellower side, neither does his contribution to The Yardbirds.\n\nA two-time inductee to the Rock and Roll Hall of Fame, a regular fixture on every ‘Greatest Guitarist’ list ever created, and an influence on almost every guitarist and musician born in the last 50 years, Page is clearly a man of immense talent, immense creativity, and, judging by his net worth of $180 million, immense wealth.\n\n15. Dave Gilmour – Net Worth: $180 Million\n\nYou don’t get to be the leader of one of the most commercially successful bands of all time and not have a decent amount stashed away in the bank. If you need proof, just look at Dave Gilmour, the lead guitarist and, following the death of Roger Waters, frontman of Pink Floyd.\n\nBy all accounts, Gilmour has $180 million squirreled away in real estate, bank accounts, pensions, and other kinds of assets. Considering Pink Floyd has sold over 250 million records, it’s really not surprising.\n\nOther than being very rich, Gilmour has a reputation for being charitable. Over the last few years, his work in raising awareness of climate change, homelessness, and other issues has marked him out as one of rock’s biggest philanthropists.\n\n14. Kirk Hammett – Net Worth: $200 Million\n\nAccording to Metalhead Zone, Kirk Hammett is the richest metal guitarist in the world. Considering he’s estimated to be worth a mammoth $200 million (a full $40 million more than the next richest, Tony Iommi), it’s not surprising.\n\nRegularly ranked as one of the greatest guitarists of all time (both metal and otherwise), Hammett’s influence on generations of metal fans and bands is hard to deny. Despite a history of substance abuse, Hammett is now clean and a happily married family man.\n\n13. Ronnie Wood – Net Worth: $200 Million\n\nUp next is the late Rolling Stones, Ronnie Wood. His wealth might not be in the same league as some of his bandmates, but it’s still considerable enough to get him a mention. A multi-instrumentalist who first found fame with the Small Faces, Wood was recruited by The Rolling Stones in 1975 after the departure of guitarist Mick Jones.\n\nDespite being an integral part of the Stones’ success over the coming decade, it would take until 1990 before the band made him an official financial partner. As Celebrity Net Worth notes, until that point, he was still technically an employee and was paid a monthly salary. Even so, his involvement with the Stones still makes up the vast bulk of his equally vast wealth.\n\n12. Brian May – Net Worth: $210 Million\n\nNo one’s quite sure exactly how many records Queen has sold in total. Some people put it at a conservative estimate of 170 million. Others put it at 300 million. Either way, it’s a lot of records, certainly enough to make them of the world’s best-selling bands of all time.\n\nAnd unlike certain other bands, their popularity never ceases to wane. Today, they’re still selling as many albums as they were doing their heyday, with the result that the fortune of each remaining bandmate continues to swell with each passing year. Guitarist Brian May is doing the best of all the band, with a net worth that’s estimated to be in the region of $210 million.\n\n11. James Hetfield – Net Worth: $300 Million\n\nJames Hetfield is best known as the co-founder, vocalist, rhythm guitarist, and primary songwriter for Metallica. According to IMDb, Hetfield grew up hunting, playing guitar, and was an ordinary quiet kid. By 1981, he’d clearly had enough of being quiet and ordinary and decided to form Metallica instead.\n\nSince then, he’s gone on to become one of the best known and influential figures on the metal scene, with a net worth that’s currently believed to be around $300 million.\n\n10. Dave Matthews – Net Worth: $300 Million\n\nIf there’s a job title missing from Dave Matthews’ resume, it’s yet to be found. Singer, songwriter, musician, actor, record label owner, producer, and, of course, frontman, vocalist, and guitarist for the Dave Matthews Band, he’s the very definition of a polymath.\n\nSince forming in 1991, the Dave Matthews Band has enjoyed phenomenal success: according to Wikipedia, they’ve sold more than 20 million concert tickets and a combined total of 38 million CDs and DVDs.\n\nThe band isn’t, however, Matthews’ sole source of income. Believe it or not, he’s one of the largest private landowners in Virginia, with a property portfolio that covers hundreds, if not thousands, of acres around the state. Despite his wealth, he lives a low-key lifestyle, residing in a modest home in Seattle purchased in 2001 for just $360,000.\n\n9. Dave Grohl – Net Worth: $320 Million\n\nHaving established himself as a drummer with Nirvana, Dave Grohl went on to prove he had more than one string to his bow as the lead singer, guitarist, and primary songwriter for the Foo Fighters. Since then, he’s sold a massive amount of records and accrued an equally massive fortune of $320 million.\n\n8. Toby Keith – Net Worth: $365 Million\n\nCountry artist Toby Keith is nothing if not prolific. Between 1993 and 2000, he released a new album each year, with each record shifting at least 500,000 copies. But he’s not just hard-working: he’s smart.\n\nIn 1999, his label rejected a bunch of songs from his upcoming album, “How Do You Like Me Now.” Keith bought back the rights to the album for $93,000, then sold it on to DreamWorks for $200,000. In the end, the album sold over 3 million copies.\n\nHis subsequent albums have proved equally successful, while his 10 percent stake in independent record label Big Machine means that every time the likes of Tim McGraw, Rascal Flatts, and Taylor Swift sell an album, at least a little of that money comes to Keith.\n\n7. Bob Dylan – Net Worth: $375 Million\n\nBob Dylan may be known best as a songwriter and singer, but it’s as rare to see him on stage without a guitar as it is to see him without a surly expression and his back to the audience.\n\nWhen he swapped his acoustic guitar for an electric one at The Newport Folk Festival in 1965, he changed the face of popular music forever. Since then, he’s sold over 100 million records, earned ten Grammy Awards, a Golden Globe, an Academy Award, a Presidential Medal of Freedom, and even the Nobel Prize in Literature.\n\nIn December 2020, Dylan sold 100 percent of his song catalog to Universal Music Publishing Group for $300 million. According to TheRichest, the deal increased his already considerable net worth to around $375 million.\n\n6. The Edge – Net Worth: $400 Million\n\nSurprisingly enough, The Edge wasn’t born ‘The Edge.’ Neither was he born a multimillionaire. Yet somewhere along the line, the man formerly known as David Evans has managed to gain a new name and a heaving bank account.\n\nAs a founding member of U2, The Edge has won 22 Grammy Awards and sold between 150 and 170 million albums worldwide; as a guitarist, he’s credited as one of the greatest of all time; and as an individual, he’s worth a monster $400 million.\n\n5. Eric Clapton – Net Worth: $450 Million\n\nWidely considered one of the most influential guitarists and musicians of the last century, Eric Clapton is a three-time Rock and Roll Hall of Fame inductee, one of the best selling artists in history, a Grammy winner, an Officer of the Order of the British Empire, a Commander of the Order of the British Empire, a Commandeur de Ordre des Arts et des Lettres, and a man with a $450 million fortune.\n\nNot all of his wealth comes from music, however: his vehicle assets, real estate, and art collection are all considered ‘significant.’\n\n4. Keith Richards – Net Worth: $500 Million\n\nAs a founding member of one of the best-selling rock bands of all time, Keith Richards is obviously not going to be short on cash at this point. And indeed, he’s not.\n\nHaving sold over 200 million records worldwide with the Rolling Stones, performed at sell-out arenas across the world, and somehow managed to survive both one of the most prodigious drug habits in rock and roll and a coconut falling on his head, ‘Keef’ is now worth the grand sum of $500 million.\n\n3. Bruce Springsteen – Net Worth: $500 Million\n\nOver the course of his career, Bruce Springsteen has managed to carve out a position for himself as one of rock’s most respected artists. His albums have won both commercial and critical acclaim, winning numerous awards and selling more than 135 million albums worldwide. The result? According to closerweekly.com, a net worth of $500 million.\n\n2. Jimmy Buffet – Net Worth: $600 Million\n\nJimmy Buffet might rank as one of the richest men in music, but music is by no means his only money-spinner. The global business empire spawned by his particular brand of “island escapism” music covers several very successful restaurant chains (“Cheeseburger in Paradise” and “Margaritaville”), several lines of products launched under the “Margaritaville” name (including Margaritaville Tequila, Margaritaville Records, Margaritaville Brewing, Margaritaville Footwear, and Margaritaville Foods), and even a $1 billion retirement village in Daytona Beach, Florida. With an annual income that’s believed to be around $50 million, Buffet now has a total net worth of $600 million.\n\n1. Paul McCartney – Net Worth: $1.2 Billion\n\nWho else could top our list other than Paul McCartney? His work with The Beatles needs no introduction, while his work as a solo artist is said to generate around $50-70 million per year in touring, royalties, and licensing fees, both from his own back catalog and those of artists whose portfolios are owned by his publishing company, MPL Communications. As of today, McCartney is worth an incredible $1.2 billion."}, {"url": "https://www.thefamouspeople.com/briton-musicians.php", "page_content": "British Musicians\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nBritain has a rich and varied musical history ranging from Church music to folk music to instrumentation. Classical music, one of the earliest forms of music in British history, was dominated by likes of composers such as Arthur Sullivan, Gustav Holst, Edward Elgar, Hubert Parry, Ralph Vaughan Williams and Benjamin Britten in the early 20th century. The nation is also known for its legacy in folk music which was revived in the mid-20th century, keeping folk music an important sub-culture within society. British music has been influenced by the musical traditions of other European countries as well as by the distinct traditions brought by immigrants from countries like Jamaica and India. In the contemporary era, many forms of popular music, including folk music, jazz, rapping/hip hop, pop and rock music, have flourished in Britain. In fact the nation produced the band, The Beatles, with members John Lennon, Paul McCartney, George Harrison and Ringo Starr who took the musical world by storm and went on to become the foremost and most influential act of the rock era. Adele, Ed Sheeran, Sam Smith, and George Ezra are popular in the contemporary era. This section provides you information about the life and works of famous British musicians.\n\nVote for Your Favourite British Musicians"}, {"url": "https://www.thefamouspeople.com/american-country-musicians.php", "page_content": "Famous American Country Musicians\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nRoll out the red carpet! It is time for country music's finest musical superstars to wow us for the umpteenth time, albeit this time it is not their music, but their rich and inspiring lives that will make your jaws drop in disbelief and admiration. That is true! When it comes to mainstream success, country musicians may not be as widely popular as rock stars. Nevertheless, they seem to be fast outpacing their pop, rock, hip-hop peers in a never before way. No wonder, country music's clout in the music arena seems to be getting stronger with each new Billboard success. From Taylor Swift and Carrie Underwood to Blake Shelton and Luke Bryan and from Miranda Lambert and Chris Young to Jake Owen and Justin Moore, country's contemporary musicians are taking the world by a storm. However, it is not just the current crop of country musicians to whom the genre owes its growing popularity. Country music fever has gripped America for decades now, thanks to maestros like Kenny Rogers, Randy Travis, Vince Gill, and Garth Brooks. Explore the inspiring lives of America's famous country musicians in the timeline, trivia, and facts mentioned in the biographies here.\n\nVote for Your Favourite American Country Musicians"}, {"url": "https://www.allmusic.com/artist/richard-barrett-mn0000348315/biography", "page_content": "One of the most important figures in 1950s and early-'60s rock & roll to come out of New York, Richard Barrett has been badly served by history in terms of the recognition he is due. A singer/songwriter turned producer, he became an essential part of George Goldner's Rama, End, and Gone Records operations, as well as Morris Levy's Roulette Records, and brought along several legendary groups of the period. He was one of the first successful independent Black record producers and also became a pioneering Black producer on Broadway.\n\nRichard Barrett (then known as Ritchie Barrett) was born and raised in Philadelphia and began singing with an R&B harmony group called the Angels during the early '50s. A charismatic singer with a fine voice, he was also a skilled dancer and choreographer, and had many good ideas about arrangements, even in those early days. Philadelphia in the early '50s wasn't the hotbed of music industry activity that it would become in the second half of the decade. Barrett took off for greener pastures in New York City around 1952 or early 1953, eking out a living as a day laborer, primarily in landscaping, and trying to find a music gig that would pay. He crossed paths with a group called the Dreamers, a local quartet he heard singing at a party, and began talking with them about the idea of joining them; he also presented them with a song that he'd written, \"Summer's Love,\" and the group was so taken with it that they added Barrett to the lineup just to get it. A quick name change to the Valentines seemed to jump-start their new configuration and the quintet began getting noticed locally; one of those who enjoyed the band's sound was Raoul Cita of the Harptones, who arranged an audition for the quintet with Monte Bruce, who was trying to start up a label called Bruce Records. A recording session yielded a tape of \"Summer's Love,\" which Bruce proved unable to release, but it did get airplay from Harlem-based DJ Willie Bryant. With Bryant's on-air help, the Valentines built up a following in Harlem and got a single released of a new version of \"Summer's Love\" backed with \"Tonight Kathleen\" on Old Town Records in November of 1954. Despite the quality of the song and its popularity on the radio, the official release of \"Summer's Love\" never charted, largely owing to Old Town's being a barely established label, but \"Tonight Kathleen\" extended the local popularity that \"Summer's Love\" had already earned the quintet. The group's next stop was George Goldner's Rama Records, another relatively new label, but one with better capitalization and distribution connections.\n\nThe group's debut Rama release, \"Lily Maebelle,\" co-authored by Barrett, was issued in the fall of 1955 and was picked up by DJ Alan Freed, who turned it into a regional hit that, in turn, transformed the Valentines into stars in Harlem. Even then, Barrett had begun pursuing other goals involving music with Rama Records. He was just as interested in the talent and business sides of the music business as he was in performing. He saw his opportunity to learn something and perhaps work in those areas with Goldner, who had five years' success behind him and knew the essentials of the business and then some; Goldner was also entering a field of music -- rhythm & blues -- that was new to Barrett. Goldner, in turn, didn't want to discourage him, recognizing him early on as a potentially serious music talent beyond his singing. Goldner had already enjoyed an unexpected national hit with \"Gee\" by the Crows, and was hoping to find acts that were good for more than a single hit record. Barrett began serving as a chauffeur and jack-of-all-trades at Goldner's office and was soon making suggestions on creative and promotional matters. What's more, even before the Valentines' record was released, Barrett was allowed to bring prospective artists in to audition and, if they were signed, he worked with Goldner producing the recording sessions that followed. Barrett also found that he fit in well working with what became the Rama (and later Gee Records) house band, led by saxman Jimmy Wright, and their method of working up arrangements on the fly.\n\nDuring the second half of 1955, Barrett lived up to Goldner's faith in him when he heard a quintet of Harlem teenagers doing a version of \"Lily Maebelle\" in the street outside of his apartment building. This was his introduction to Frankie Lymon & the Teenagers (as they were later called) and he brought them to Goldner, who duly signed them up. In late November or early December of 1955, the group recorded \"Why Do Fools Fall in Love,\" one of the defining hits of the early rock & roll era and the biggest-selling record that Goldner ever released. Meanwhile, Barrett and his group enjoyed a second local hit in the spring of 1956 with \"Woo Woo Train,\" but their fortunes were clearly on the wane. The group released two more singles without success in 1956, but by the end of that year, Barrett's involvement with the Valentines was receding rapidly as he began concentrating much more on his production activities for Goldner. Most notable was his connection with a newly signed group called the Cleftones, whose vocal arrangements and stage choreography Barrett had a major hand in shaping. Early in 1957, not long before the Valentines disbanded, he brought in another discovery in the guise of the Chantels, a quintet from New York -- whom he'd also heard singing on the street -- who are generally regarded as the first identifiable \"girl group\" in rock & roll history. Barrett became their manager and producer, and their second release, \"Maybe,\" was not only a huge hit, selling in excess of a million copies, but became an enduring classic, second only to \"Why Do Fools Fall in Love\" in the Goldner library. That same year, he also produced and arranged both sides of debut single by yet another R&B vocal group, the Channels, for Goldner's Gone Records.\n\nBarrett made one more major discovery, this time within the orbit of Roulette Records -- a successor to the Rama, Gee, End, and Gone labels, formed by Goldner's partner Morris Levy -- in the form of Little Anthony & the Imperials. He finally left Goldner and Levy in 1960 to start his own label, Princeton Records: his major signing was the Veneers, a group similar to the Chantels. The Veneers never sold many records, but having them under contract served Barrett well when Arlene Smith, the Chantels' original lead singer, decided to leave. He tried taking over as lead singer on a pair of singles, \"Come Softly to Me\" and \"Summer's Love,\" but those singles didn't sell; finally, Barrett moved the Veneers' lead singer, Annette Smith, into Arlene Smith's spot in the Chantels, and later moved this version of the Chantels to Carlton and Ludix Records, where they enjoyed more hit singles. He also produced early recordings by the Isley Brothers and Harold Melvin & the Blue Notes, and crossed paths with Kenny Gamble and Leon Huff before either was very well-known. After returning to Philadelphia three years later, he began producing the Three Degrees, the most enduring act with which Barrett has ever been associated. They enjoyed hits well into the '70s, including a number one record in 1974 of \"TSOP (The Sound of Philadelphia),\" produced in association with Kenny Gamble and Leon Huff. Barrett also worked in the late '90s producing the group Rap Machine."}, {"url": "https://www.thefamouspeople.com/american-musicians.php", "page_content": "Famous American Musicians\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nIf you love your Bob Dylan, Jim Morrison and Bob Marley and cannot do without your daily dose of Frank Sinatra, Bruce Springsteen and Stevie Wonder, you have landed in the right page. America has been blessed enough to home a world of soul-stirring, mind-blowing, Grammy-worthy musicians whose innovative, mellifluous, energizing and eclectic music have inspired several generations of musical buffs. They are the musicians whom you will find on every music lover’s playlist — young or old. They are the musical trendsetters, timeless in their music, fame and appeal. They are the true force behind America’s music legacy. These are the music makers who have left something lasting behind — music that won’t wither with time. They are America’s real musical survivors. Read on to explore to mind-bending biographies, trivia and facts on America’s most famous, most celebrated, most heard musicians who continue to awe the music lovers to this day.\n\nVote for Your Favourite American Musicians"}, {"url": "https://www.thefamouspeople.com/21st-century-musicians.php", "page_content": "21st Century Musicians\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nFind out more about the greatest 21st Century Musicians, including Dulce María, The Weeknd, Taylor Swift, Taj Mahal and Eminem\n\nVote for Your Favourite 21st Century Musicians"}, {"url": "https://www.thefamouspeople.com/briton-composers.php", "page_content": "Famous British Composers\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nFind out more about the greatest British Composers, including Paul McCartney, Elton John, David Gilmour, Marc Bolan and Dave Gahan\n\nVote for Your Favourite British Composers"}]}