{"Rich Williams has released several solo albums.": [{"url": "https://rockcellarmagazine.com/kansas-band-interview-rich-williams-point-of-know-return-live/", "page_content": "Facebook Twitter Email Reddit\n\nIt is sad to report that Kansas founder and violinist Robby Steinhardt has passed away. Steinhardt was the original violinist and vocalist on “Dust in the Wind,” “Point of No Return” and “Carry on Wayward Son.” Steinhardt, who was working on a solo album, was 71. The following interview with guitarist Rich Williams was conducted May 14, 2021.\n\nClassic rock bands have always experienced a revolving door of musicians. Kansas has seen its share of upheaval, but guitarist Rich Williams and drummer Phil Ehart have been with the band since its debut album. “We have a work ethic that we get from our parents and from where we grew up of just sticking to it,” says Williams. “Things get tough, you stick with it.”\n\nAfter years of false starts, the band signed with producer Don Kirshner’s label and released Kansas in 1974. Its mix of progressive rock and symphonic arrangements with the work of violinist Robby Steinhardt produced the band’s signature sound — a sound that has allowed the group to still maintain a steady presence today.\n\nThe band’s breakout LP was 1976’s Leftoverture, which featured the hit single “Carry On Wayward Son.” Point of Know Return followed in 1977. The success of the title track and “Dust in the Wind” secured the band’s spot as a major arena headliner.\n\nIn July 2020, Kansas released its 16th studio album, The Absence of Presence. The album introduced the band’s newest member, Tom Breslin, a vocalist who contributed music and lyrics.\n\nKansas in concert delivers performances that remain true to the original studio cuts. In 2016–2017 Kansas launched the Leftoverture 40th Anniversary Tour, which became the 2017 live album Leftoverture Live & Beyond. Kansas followed with its Point of Know Return Anniversary Tour. The band recorded every show and on May 28, 2021, released Point of Know Return Live & Beyond.\n\nClick here to pick up Point Of Know Return Live & Beyond on 2-CD from our Rock Cellar Store\n\nClick here to pick up Point Of Know Return Live & Beyond on 3-LP/2-CD from our Rock Cellar Store\n\n“We thought maybe one day we would release this,” says Williams. “And then with the pandemic, we figured, ‘we have the time, let’s put this together.’”\n\nRock Cellar talked with the guitarist shortly before the live album’s release, and it was made evident that decades of success have not changed his intensity and work ethic.\n\nWilliams explains how the band’s music — and members — evolved over more than four decades. It’s an object lesson that every musician should read before putting pen to contract.\n\nRock Cellar: Why was Point of No Return the focus of the new live album?\n\nRich Williams: We had previously released the Leftoverture Live & Beyond album. To have a recording done in its entirety, in its original running order, it had never been done. Until this tour, we’d never played all these songs ever. It also gave us the opportunity to go deeper into a lot of other albums. Like “Lonely Wind,” we hadn’t played it forever. If we played it, we didn’t play it for long. To bring certain songs back from the dead was just smart to do.\n\nWe recorded every night from out front, so we probably had 100 shows taped. That process becomes a lot easier, it’s almost like a studio at that point. You’ve got everything mic’d just right.\n\nRock Cellar: Kansas recently played its first live show in 14 months. What went into preparing for the show after such a long layoff?\n\nRich Williams: As far as the group, we showed up, we did the show. But fortunately we have the live album. And almost everything we’re playing at the moment comes off of that album. So we just compiled the setlist and then a playlist and everybody just did their homework.\n\nFor the last two months I’ve played that set twice a day. At home, I have the same setup as my live setup. So I can just stand there and go through all the motions of what I have to do and play along with the same guys, just through my studio speakers.\n\nThat’s really what everybody did. We just continued doing the show. We had a real brief hotel room rehearsal the night before. And then we jumped on stage and did it. The weirdest part was walking out on stage. It’s like another day. It didn’t seem like that much time had passed. The lights went on and we did the show.\n\nWe were just glad to see each other. That part was exciting, but everybody was very prepared. There was a bit of adrenaline, some nerves, it’s like, “how’s this going to go?” Normally, if we’re on the road, and we go three weeks without shows, one of us will put together a rehearsal. We probably won’t do that anymore now because we know we can do it without that. It’s six responsible guys that kept up on it.\n\nRock Cellar: How do you approach improvisation when performing live, especially on the best-known songs?\n\nRich Williams: For me, there are certain things I want to play not quite note-for-note, but I stick to the theme at least. There are other things I just don’t know. It’s like, “here comes a part, what are you going to play?” I don’t know. Then I just start playing.\n\nI’m just going to play in the moment, kind of the way I do it in the studio. I hate to over-rehearse. What moves me at the moment is what I usually tend to go for. There’s been so many times where, in the studio, “I don’t know what I’m going to play here. Just roll the tape.”\n\nFor example, in the song “The Voyage of Eight Eighteen” on The Prelude Implicit, I had no idea what I was going to play in the solo. I just knew I wanted to get this big, out of control-kind of a sound. Usually, I record in the control room but for this I went out and had the amp right next to me, just crankin’. I said, “just run it by, let me get a feel for this.”\n\nSo it went by, I was just kind of holding on, I didn’t know what I was gonna do exactly. And they said, “you’re done.” I said, “what?” That was great.\n\nI had no idea what I was doing whatsoever. I was just trying to get a feel for where the feedback points were and just get a general feel of it all. And it’s one of my favorite things I’ve ever done. That’s my approach to a lot of solos. “I have no idea, here it comes.” It’s the shotgun approach. I just aim it in the general direction and pull the trigger and see what happens.\n\nKANSAS will be extending the popular Point of Know Return Tour starting with new shows starting November 13, 2021. Before that, the band will be performing sets of KANSAS Classics later this summer & early fall. For more info & dates click here: https://t.co/0kY2dv39L3 pic.twitter.com/Q2CqYQwSGr — KANSAS (@KansasBand) June 8, 2021\n\nRock Cellar: What are the challenges of performing such musically complex songs live?\n\nRich Williams: Especially on the long ones, it’s just a lot of notes. It’s one thing to sit down and practice it but then you’ve got the lights and the crowd and so many distractions. To keep a constant focus on what you’re doing [can be tough], because if your mind wanders, you’re in the weeds really quickly. It’s mentally exhausting staying focused. But then on the other hand, there are some simpler songs that my mind will tend to wander and I will get lost. It’s like, pay attention! It’s funny how that works.\n\nMany bands of our era sit around and party before they go out and get half drunk and go out. We just have too much to do. There’s no way to do that and go out there and play. It’s too hard.\n\nRock Cellar: You’ve said that the success of Leftoverture and Point of Know Return changed the internal workings of the band. What did you mean?\n\nRich Williams: When we first started, we were young men. It’s not like we were from poor families, but leaving home, we all played in different bar bands, some together, some with other people, you’re not successful in any way. People living in band houses, you have kind of an all-for-one, one-for-all, you’re like pirates out on the open sea. It’s teamwork. And it goes like that. And time goes on.\n\nAnd this isn’t a complaint, it’s an observation. It’s just the way things go.\n\nThe way the money works with records, etc. is we did not sign a good deal with Don Kirshner. He was our benefactor, it was the only offer we got. Without him, nothing would have ever happened. But the first thing he did was say, “I am a publisher. I want to publish or go somewhere else.” So right away, we threw a third of the pie away. Another third of the pie is writer’s royalties. And the last part of it is the royalties that the band would bank.\n\nThat part has to pay for every possible recording cost of everything. It takes a long time to pay off recording debts. So no money comes to the band. But the songwriters, and rightfully so, they get paid from the first record sold. They get money from that. So after Leftoverture went gold, we paid off all of our previous debt. The songwriters had already made a small fortune. That starts to change the dynamic.\n\nAt that point in the band, we’re getting a little older, we’ve been together for a while, people are buying houses, cars, getting married. So that all-for-one, one-for-all mentality has taken its natural course and starts to change the dynamic within the band.\n\nThen Point of Know Return, some people have made a lot of money and they don’t want to work as much. Others are, “I’d like to get mine now.” So things just changed. People were going from young, dumb guys to maturing a bit.\n\nAnd money does change people. So people will wander in all sorts of directions.\n\nThings just take their natural course. People naturally drifted apart because it wasn’t really working anymore. But we’re all good friends to this day. No animosity towards anybody through all of that.\n\nThat’s just the dynamic of what happens within a band that’s been around for a little while.\n\nRock Cellar: How do you maintain the classic Kansas sound despite so many personnel changes?\n\nRich Williams: For the first album, everyone was involved in arranging things, in editing things, saying this works, this doesn’t work. Identifying what we’re comfortable with, what parts we like, which parts we don’t. My input is recognizing what fits within a quintessential Kansas part. Or what can we do to this to make it more Kansas-esque? I just have an ear for that.\n\nWe’ve surrounded ourselves with people who have done it for quite a while with us, people who came in very familiar.\n\nWe know who we are and we know who we were and what we want to continue to be, so it’s really not that difficult. Tom Breslin, the newest addition, brought in a lot of material and it wasn’t difficult for us to turn this into what sounds like Kansas.\n\nRock Cellar: The title, The Absence of Presence, is a reference of modern technology?\n\nRich Williams: Yes, but it’s a bit ambiguous. It tends to mean different things to different people. I like things that are ambiguous. The original concept of it was people are so out of touch with what’s around because of the technology in their hand or what they’re watching or computers, whatever.\n\nRock Cellar: The album continues the use of the band’s trademark violin. Explain the violin’s importance in the Kansas sound.\n\nRich Williams: We did a couple of albums, Steve Morse on guitar [Power and In the Spirit of Things], good albums but they sound like a different band. They just do. It is a signature sound, it does set us apart. I think it made us do something. What that is is the violinist needs something to do besides stand around and play fiddle parts. It changes my parts, it changes keyboard parts, because suddenly you find yourself in more of an orchestral sense.\n\nIt creates a more symphonic sound. If you take the violin away, all of a sudden the guitarist is just flashing, the keyboards are just playing away. You add that other dimension and suddenly you become more artistic in your approach.\n\nRock Cellar: You and Phil have been together since the first album. What’s the secret of your longevity together?\n\nRich Williams: The top of the list would be tenacity. We grew up in the Midwest, family life. My dad met my mother in England during World War II. They married and remained married until their death. He had a job at a place called Baker Truck Rental before the war. He came back, Baker Truck Rental became Ryder Truck Rental. He remained with them until he retired. Phil’s dad, he was a colonel in the Air Force. They travelled all over the world. His family life was very similar. He had one job, married until their death.\n\nWhat I learned was that sticking to a commitment is in my nature by birth and by example. We have a work ethic that we get from our parents and from where we grew up of just sticking to it. Things get tough, you stick with it. Things get good, you stick with it. I started at a certain age to take the next step: when something shitty happens, OK, fine, fuck it. Next step. I’ve never quit anything. So that part isn’t an effort. It’s my nature.\n\nPeople ask, when are you going to retire, Rich? I go, what would you have me do? Play more golf? Stamp collecting? I’ve got the best job on earth. And someone says, what do you do in your spare time? I practice. I’ve got a guitar room with 30 guitars in it, a wall of amplifiers and my computer is all set up so I can prepare for the next show. That’s what I do. And that’s true for both of us.\n\nWe talked about it recently. It comes up once in awhile, after the pandemic especially. It’s like, what do you think? Hey, I’m in. Good, I’m glad to hear that ’cause I am too. We will do this until we can’t. Because we love to do it.\n\nRock Cellar: Let’s do a Lightning Round. A Kansas song more people should have listened to.\n\nRich Williams: “The Voyage of Eight Eighteen.”\n\nRock Cellar: What would be a great song for Kansas to cover?\n\nRich Williams: We have done some in the past. We did “Eleanor Rigby” with the London Symphony Orchestra. We did “Bringing It Back” by J. J. Cale on the first album. A song that I always thought we’d do great is “Solsbury Hill” by Peter Gabriel.\n\nRock Cellar: Favorite guitarist.\n\nRich Williams: Jeff Beck.\n\nRock Cellar: If you weren’t in Kansas, what band, past or present, do you think you would have been a good fit for?\n\nRich Williams: AC/DC."}, {"url": "https://www.guitarworld.com/features/kansas-rich-williams-another-fork-in-the-road", "page_content": "One of America’s preeminent progressive rock outfits, Kansas, are celebrating their 50th anniversary this year, with the band set to hit the road in June for an extensive tour. Kansas also recently released a three-CD, career-spanning collection titled Another Fork in the Road – 50 Years of Kansas.\n\nGuitar World recently sat down with the band's longtime guitarist, Rich Williams, to discuss the guitars he connects with (and the ones he doesn't jive with), the making of Dust in the Wind, and the importance of keeping to a learning mindset.\n\nKansas’ blending of violin, synths and guitars was a much more orchestral approach than the usual straightforward rock and roll format of many bands of the time. How did you approach arrangements in that context?\n\n\"With the violin, we didn’t want it to be fiddle. We wanted it to be part of the sound. Robby [Steinhardt] would be playing a violin part and I'd be playing a harmony with him and maybe a synthesizer would be playing the third part of the harmony, too. So, we’d be creating like a string section of sorts – as if we were writing it for an orchestra – but we were still bashing the crap out of it. So, it was that approach to orchestrating with a violin.\n\n\"Had we not had [just] one, we might not have done it that way and we would have sounded different. Jethro Tull was a good example of showing you that you could add a delicate instrument to a really cool band and make it work.\"\n\nThe interaction between those instruments really gave the music a harder edge. Was that something that evolved naturally or something that you purposely set out to do?\n\n\"Prior to Kansas, Dave Hope [bass], and I had played together previously in a band. And we were playing the rock hits of the days and because none of us were trained, we didn’t understand a delicate approach to anything. Phil [Ehart] would beat the crap out of the drums, while Dave was an aggressive bass player and for me it was crank it up and play it aggressively! That was our approach to it.\n\n\"We had grown up with Mitch Ryder and The Detroit Wheels and bands like that, American blue eyed soul rock and roll. So those were our roots. But the progressive movement coming out of Europe and England was very eye-opening to us. And what we learned from that was to think outside of the box.\"\n\nDuring the band’s mid-1970s period, you mainly played a Gibson L6-S.\n\n\"The guitar was straight out the box, too. I did do a little work to it eventually where I moved the input jack to the bottom instead of the front, sort of vice-versa. I still had the six-way switch on it, and I think I might have added a tone control, too, where there was a switch. It's been that way for so long, and I still have it.\n\n\"Those guitars have such small necks. I had another one, too, but I didn’t like it. Kerry [Livgren, Kansas's former singer/guitarist] tried one and he didn't like it either. The one I have has very large inlays – big square ones, the same as the size of the Les Pauls inlays. Instead of the round shape, the ones on mine are square though. I’ve never seen another like it, so it might have been a prototype.\"\n\nDo you favor five-way switching on your guitars?\n\n\"Yes, I do, though I do have a PRS McCarty that has a three-way switch on it – I’m more comfortable with a five-way on PRS guitars. I really like [five-way switches] because it’s like going back to using the L6-S, but with the sound choices that are more like the Les Paul. Having said that, sometimes I do like the Les Paul better because of the ease of the switch.\"\n\nHave you ever tried switching over to a Strat?\n\n\"After the Gibson, I did buy a Strat, but I've never been a Strat guy. They’re such a mystery to me. I’d watch guys like Eric Johnson play a Strat and it's got such a beautiful sound, yet when I pick it up, it just sounds horrible! It truly was not designed for me, but I did use it on a few things.\n\n\"The Les Paul-style setup – from a PRS to a Les Paul to my Dean guitars, all of those, that's where I feel more at home.\"\n\n(Image credit: R. Diamond/Getty Images)\n\nYou have also played Dean guitars.\n\n\"After the L6-S, I started using Dean guitars. Prior to the L6-S, I was using an ES-335 but the band thought it was a cowboy guitar. And because we were not a cowboy band, they made me trade it for that L6-S. The L6-S was probably worth $500, while the ES-335 was probably worth $25,000! [laughs]\"\n\nYou first started using PRS guitars back in the 1980s, and you've played them ever since – what prompted the switch?\n\nWhen Paul Reed Smith was first getting started, I convinced him to put his pickups into my original series Dean Cadillac… Finally, one day Paul said, ‘Why don’t you just get one of my guitars?’\n\n\"When Paul Reed Smith was first getting started, I convinced him to put his pickups into my original series Dean Cadillac. So, I used that for a while. I had another red Dean which I had as a spare, yet never used it. Finally, one day Paul said, ‘Why don’t you just get one of my guitars?’, and so I did.\n\n\"I have the first year Dragon model, No. 36. My PRS is my go-to guitar. I also have two 2012 Les Pauls, the Lee Roy Parnell models with the classic pickups in them. I love those guitars.\"\n\nIn the early days of the band, you hardly used any effect pedals – it was mostly guitar into amp.\n\n\"Yes, that’s correct. My guitar went into my 100-watt Marshall, which I still have today. I did incorporate a volume pedal at one point too because there were so many quick changes, I needed a quick volume change, too. I also had a Mu-Tron Phasor at one point, but apart from that, there were never any effects used in the early days at all – my guitar never went into any distortion boxes of any kind.\n\n\"Eventually, I started going into a Furman PL Plus Power Conditioner and slamming the front end of the Marshall, but it was so noisy. I could use it in the studio, but I couldn’t use it in a live performance. For the past 10 years, I’ve been playing with a Fractal Axe-Fx III – it was only [after I bought it] that I started getting into using more effects.\"\n\n(Image credit: Chris McKay/WireImage)\n\nHave you got a large guitar collection?\n\n\"I used to have a lot more, but an ex-wife made me get rid of a lot of them. I currently have about 40 guitars.\"\n\nI want to ask you about one of the band’s signature songs, Dust in The Wind. Guitar-wise on that song, there are actually two differently tuned guitars – one in standard tuning and the other in Nashville tuning, correct?\n\n\"Yes, and with the Nashville tuning you usually need to replace the four lowest strings with thinner strings and tune them an octave higher. Now that’s hard to do because you’ll end up breaking five strings before you can get one to hold. Later, I started using a little Taylor three-quarter size guitar and found that I could get that string up there a lot easier.\n\n\"So, for Dust In The Wind, I double-tracked a Martin D-28 acoustic twice and then I did the high string part and added that on top of it. I think I also double-tracked that, too. Then a nylon-string, which was played by Kerry, added just a bit more body, and a digital delay was also added on later. There were at least seven guitars on there. The Nashville tuning was just mixed in so that it added this nice sparkle to the track.\"\n\nAdding Steve Morse to Kansas in 1986 really brought another dynamic to the band. What was it like having him in the band?\n\n\"When we first started rehearsing in Phil’s basement, I was sitting down with Steve and he had just been awarded the best guitar player ever for the third year in a row, and was now in the Hall of Fame. And here I am, in a room with him and we’re creating material together. For me, that was a terrifying experience, until I got to know what Steve was like. He’s the least threatening and intimidating guy you could ever meet. He’s a guitar wizard.\n\n\"I also learned a lesson from him that I thought was very valuable. We were on the road somewhere, had just done a show and walked into the hotel lobby and there was this crappy band playing in the lounge. I was about to make a joke about it when Steve turned to me and said, ‘Did you see what the guitar player just did there?’ It was something that the player did with his toggle switch. Steve said he had never seen anybody do it that way before.\n\n\"I thought, ‘He is the best guitar player in the world, and he is still always learning.’ He was looking for something that was different, like this kid did in that band. And I thought that, as a guitar player, it was such a great mindset to have.\"\n\nDid you ever think you’d be here and still touring 50 years later?\n\n\"We’ve kind of perpetually toured, but we never would have imagined we’d get 50 years. We thought we might get four or five good years and then I would go back to Kansas and maybe buy a bar, have a little stage there and play with my friends. But it just kept going.\n\n\"You know, those smallest little details, all those mini-steps have now taken us 50 years. It wasn’t a plan so much; it was just the simple motion of moving forward.\""}, {"url": "https://www.vice.com/en/article/qbv89x/rank-your-records-rich-williams-rates-all-14-kansas-albums", "page_content": "For those of you who don't know Kansas ​ (and I'm assuming a lot of you, because the majority of Noisey readers were born 18 to 34 years ago, and they released their most famous album, Leftoverture, in 1976), the band is a pioneering art-rock band formed in 1970 in, you guessed it, Kansas. They've had as many members as they have albums, and although many fans will jump at the opportunity to explain in detail which albums are canon and which aren't, every single album is, at least in this writer's opinion, worth at least one listen. They're the full embodiment of album-oriented rock, and while many of their songs are great as standalone tunes, you never really get the full experience until you listen to the whole album.\n\nDid Kerry want to make Vinyl Confessions more religious than it was? He kind of had been wanting to do that for a while. This is just what I feel about it. I think he tried that enough and knew he wasn't going to get anywhere with it. That was his calling. That's what he wanted to do and he knew he wouldn't be doing that through the vehicle of Kansas so it was his time to go.\n\nNoisey: Can you tell me a little bit about why Vinyl Confessions is last? Rich Williams: It just wasn't a good time in the band. There were just a lot of personal problems going on inside and outside of the band. Dave [Hope] and Kerry [Livgren] left soon after that record; their hearts weren't in it at all. As hard as we were trying, it just wasn't coming naturally at that point. Kerry was such a main writer up until then. He was wanting to do something else, and it was making the album hard to make. He wasn't into it anymore. When the whole team isn't on board, it just becomes a struggle. It should be a fun, exciting experience, and it just stopped being that.\n\nKansas released their 15th studio album, The Prelude Implicit, last week. It's the band's first album in seven years, the longest the band as ever gone without releasing new music. Now, buckle up and grab some snacks, because we're about to rank these records.\n\nRich Williams, the guitarist for the band since 1974, kindly spoke with me for over two hours about every single album the band has released, and while it sounds mean, I only had to remind him of what albums he hadn't ranked twice (after 14 albums I think you get a pass for forgetting if Drastic Measures came before or after _Point of Know Return). _\n\nDid you have a contingency plan if you didn't find a singer? No. [Laughs] I don't think we ever considered that an option. It was just: keep looking until we find somebody. John Elefante sent in a tape. We'd heard a lot of good singers, but we felt we needed someone who could sing the past songs and John had a similar voice to Steve. He was a tenor and had a powerful voice and that made a lot of sense. Plus, he was a songwriter. We were lacking material because Steve left with the material he'd written and we were in the studio and needed a bit more material. So it was all a scramble. We were in a complete panic. We were in damage-control mode and we just kept moving. We got John involved and we got it done but going through that album, things weren't the same anymore with any of us. When Steve left, that was the first real change we'd gone through. It was a bit like going through the motions because that's all we knew how to do, but I think it was inevitable it was going to fall apart after that.\n\nWhat was that like? It was a scramble. We never had to do that before. We'd been the same unit up until that point; it was tough. We were auditioning people in Atlanta, in Los Angeles, listening to tapes from different people auditioning while we were recording. We had tracks recorded and would have people come in and sing the tracks. It was very unsettling because a lot of money was being spent. Are we going to complete this project? Do we even have a band? So we had a lot going on; very disconcerting.\n\nWhy is this one 13? Kind of the same. On that album, Kerry was still struggling. He wanted Kansas to be a lot more of a Christian band. That's what he felt like he needed to do, but that's never what Kansas wanted to be as a unit, so there was dissatisfaction in that. We were working on the album, writing the songs, and that's when Steve Walsh quit. We had already booked studio time and the album was written, and Steve said he couldn't do it. So then he took the material he'd written and left, so we had an incomplete record. When we started recording that album, we didn't have a singer. While we were recording it, we were also auditioning singers.\n\nWhat makes this one number 11? It's one of our best sounding records. It sounds great and has got some great music on it, but there's nothing memorable about it, either. Lyrically, it didn't stand out; it was a bit dark. We went to Trinidad to kind of recapture the spirit of when we did Leftoverture, but we went to Louisiana in the middle of nowhere to be all together away from town, away from family, and be together and work. We went to Trinidad kind of for the same reason: there were too many distractions. It was a very well-formed and brilliant sounding record, but again, it was lacking anything memorable. As hard as we tried, we couldn't recreate what we were trying to recreate.\n\nWhen you say the band lost its hunger, what do you mean? Well, just before, you had nothing to compare it to, and now everyone's got money in the bank. You're up there, and you don't quite have the same drive to stay there sometimes. The dynamic changed in the band. We were younger men before, all with the same goal, but as people start having families and moving to different areas and going on with their lives—and I'm not saying anything is wrong with that; that's what happens in life—but it starts to be destructive to the unit.\n\nYou said it was disjointed. The band or the music? The band and the music seemed a bit disjointed; things weren't quite the same. Money changes everything. And songwriters made a lot more money so they had different incentives. They wanted to spend more time enjoying life. I'm really happy for you, but the rest of us aren't in your position yet, so money changes everything within an organization. It took the hunger out of the band. Before, we had something to prove. We'd proven it, and now we were just gathering stuff.\n\nHow about number 12? This is when Kerry really started distancing himself from us in what he wanted to do. So the album is disjointed to me. It was not the best of times again. The end was coming. You could feel it, but it still took three albums to get there.\n\nWhat makes that one number ten as opposed to Freaks of Nature? It was an odd record to make because Kerry had called Phil [Ehart]—he hadn't been in the band for a time, but we talked all the time—and said, \"I got a bunch of material here that I'm not going to put on a solo record, but it might be some good Kansas material.\" Kerry had moved back to Kansas and had a studio on his farm, so Phil and I went and listened and said, \"Let's do that.\" We'd never recorded in this fashion before. Steve [Walsh] was not into it. He was working on a solo album, doing his parts in Atlanta, mailing them in. Dave Hope came in and played bass on a song and was gone. People would come in and do the parts and leave. Kerry wasn't going to be in the band afterwards, we weren't going to tour this material. I like the album, it had some great material on it, but the way we assembled it and did it in such an uncharacteristic band sense is why I put it down in there. It could've been much better if we'd actually been involved as a unit.\n\nWhat exactly were you trying to recreate? The music was good but there was nothing special about the songs, melodically. Lyrically, it's hard for me to put into concise words. We were with a smaller label, and there wasn't a big push around it. We were irrelevant to the music scene—at that time, classic rock hadn't been a part of a comeback. We knew it probably wouldn't be heard or well received except for a few dedicated fans. It was a helpless feeling going through it. We wanted to be creative, we wanted to record, but the times had changed. Quite a bit of touring at that time wasn't all that enjoyable—riding around in a bus playing five clubs in a week for months on end for little money; it was a struggle. At the time, we were trying to keep our heads above water, but the time wasn't good for any classic rock bands. So that mood kind of prevailed above all.\n\nWhat was the draw? Why did you guys want to work with a symphony? We'd always tried to find a way to do something different, especially when we were going through a time when no new music was coming out with us. Kerry was no longer involved, Steve was not wanting to write anymore, we'd been on the road for two years doing the same things. We needed to re-package this, to find a different way to present the same stuff we were doing. We wanted to still feel creative even if we had to be creative with what had already been done, something to create some interest in us. That was a bit of the motivation behind all of that, and our music was always symphonic in nature, so from the very beginning we'd thought, \"Wouldn't it be great one day if we could do this with a symphony?\" It was that thought coming to fruition.\n\nWhy is this nine? I like what the album did for us. We were trying to reinvent ourselves a bit—we needed to do something different to shake it up—so we went in the studio and recorded a lot of songs and had it scored to record with a symphony orchestra. We did the re-records, then we took it to Abbey Road in London—really what that gave us was a blueprint and charts to where we could start playing symphony shows—and several years after that, we started playing with symphonies.\n\nDo you think the experiences with Freaks of Nature fed into those attitudes towards Somewhere to Elsewhere? Very much so. It was one of those things where touring was a struggle—still bussing around from club to club, not really making any money. We were one of the few classic rock bands still out there trying. I got in a band simply because I wanted to play in one. I liked the rehearsals and the camaraderie and the traveling. All of that to me is what being in a band is about. And recording the new album, it's all part of the process. It provides a vehicle to continue touring. At some point, you have to be creative or you get extremely stagnant.\n\nDo you think it not sounding as good had to do with the fact that you guys didn't travel to the studio? Sonically, I don't think it was great. I don't think the material was as strong, and, although we were trying hard, the times were changing, too. We had our moment in the sun, then all of the sudden everyone was wearing a leisure suit and disco was getting hot, so the times were changing. We were getting a lot of odd direction that we weren't following. Radio dictated popularity at that time and radio was changing, and we weren't going to, and I think the first time our relevance had seen its day. At the ripe old age of 30, we were starting to feel like old men.\n\nWhy is Monolith number eight? We had back-to-back huge albums, and this was the very first beginning of the end. Up until this point, we were going to destinations to record, but now everyone is married, everyone has a house. This was when we were officially becoming individuals more than a unit—again there's nothing wrong with that. The dynamic changes within a career—money, etc. People just grow up, and we just kind of wanted to stay at home and do things at a different pace. The drive was there. We were just a bit naive in thinking this one would naturally progress in the way it has been—\"we've got this down, we'll make another record and it's going to be successful.\" It was successful a lot more on the merit of what had come before it. It wasn't as good of a record. It didn't sound as good.\n\nIn the Spirit of Thing would be number six? So now we're with MCI, and we've got some great material. The record company is on fire about this, and we're really taking a lot of time putting this album together. It's well recorded and we were very excited about that. We really felt something great was going to happen out of this record. Towards the end, the record company said, \"Guys, we love the record but we're still lacking something that we feel really confident works for the radio.\" And then right before the album comes out, MCI fired everybody from the president on down. So then the album is almost not released. It sort of gets released, gets no backing, and then just sort of died. And that was very sad because we worked so hard on it and it was a great record and it never got a chance. So that knocked the wind out of our sails. Steve Morse went on to do other things, and we were down for a while. At that point, we were done but we weren't sure it was going to happen. Then things started to turn around and we started to get back on the road some, but from the first album to the fourth was a long time.\n\nNext would probably be Power, the first album with Steve Morse, when we got the band back together after the break with the new lineup. There's a lot of good stuff on it, and it was an interesting time to work with Steve Morse. Again, I like the album, it has some really good stuff on it, there was a good game plan, the album was well received, we were doing some good shows. This was going to be the new band, and the future was looking very bright. I guess what missed was not the album, but in the live shows. Steve was covering a lot of the violin parts—that was a lot of his role with the older material and he did it extremely well—but it wasn't the same to me. I guess I was missing that voice.\n\nWere they trying to push Kansas to have more of a disco sound? Yeah, something shorter, something more danceable. And, of course, these are your advisors—the record company and management. We wanted to please people, but we didn't want to do that, so it was a bit of a struggle, and for that, it was a hit-or-miss album. There was some great stuff on it and some stuff that was not so great.\n\nWhat do you mean by progressively? \"It Takes a Woman's Love\" is just a straightforward rock 'n' roll song, whereas we were starting to lean towards a very much more progressive style of music, getting away from basic predictable lyrics about predictable things. Steve was more in that vein. Kerry was starting to go further into progressive music, and that's where the band was leaning, too. So it was a bit disjointed. We hadn't quite found a comfort zone, and again, the record company put a lot of money into the first and second album. We're getting tour support now from the company so they've got lots of money in us, and they want to hear something get on the radio. Those songs were attempts at that. Also, it doesn't sound real good. It's not a great sounding record. The speakers we were mixing on, they weren't flat. So what we were hearing in the room sounded great, but when it went to vinyl, it was like, \"What is this?\" So, sonically, we weren't real happy with the album.\n\nNext would probably be Masque, there are some people where this is their favorite record, so it's hard, but there are some songs on this that I'm just not crazy about. \"The Pinnacle\" is one of the most quintessential hardcore Kansas fan songs. It's a brilliantly written song, it's very musical, but it's not a rock song either. It's definitely Kansas all the way. \"All the World\" was a great song by Steve; \"Icarus\" is probably the favorite of the album is a quintessential Kansas song; \"Two Cents Worth,\" odd song for us. I think Steve captures the mood brilliantly in singing it, I really like the song. \"It Takes a Woman's Love\" didn't make any sense to me—another song that was left over from the first demo tape that we made. It was like: record an album, tour, record an album, tour. Then, \"OK, we have to record an album, but shit, we haven't had a chance to write stuff.\" So we were going back into the vault, and while the band is starting to lean a little bit more progressively, some of these earlier writings weren't at all.\n\nWas that more on you guys as a band or the people producing the record? It was the process being moved along. We didn't have our own voice, strong enough to say, \"This isn't done, we're not happy with this, we're starting over.\" We were in awe of it all and didn't know what to say to speak up. There was a lot of great material on it, but I think we all wish we could've re-recorded that one. What it did was capture the essence of us, that's the album that got people to go, \"Wow, what is this?\" And that's the first time we really heard Steve's voice professionally recorded on tape. It was like, \"Holy crap, this is a world-class singer we got here, this is amazing.\" Suddenly, we were in awe of his talent.\n\nSo you guys had no idea of what you were doing? We figured they had more of an idea of what they were doing. We had a lot of questions, so on some songs, it's not like it was executed poorly, it was just put together in a rush, in a lot of panic and confusion.\n\nThe first album, that's the album I think we all wish we could re-record. We'd never done anything. We went from living in Kansas, playing in bars to flying to New York. We recorded in a little tiny demo studio before, but never had been in a real studio, and here are the hicks from Kansas. It was all intimidating, I guess. It was exciting, it was fun, but there's a lot of things we didn't know, so we just went along with it. Basically, it was done in two weeks and once it was over, we were like, \"What happened?\"\n\nDid any of that energy feed into recording Song for America? Yeah, we were very cocky. We definitely had something to prove. We were very confident in ourselves and in the band. We knew we had something different that other people weren't doing. We knew that we were unique and kind of cocky about it. \"You may not like us, but we're real good and you can kiss our butt,\" that was kind of our attitude. We didn't have that much of a past, and the future was too far to worry about, and we were young and dumb enough to experience the moment without a care about consequences or anything else. It was an innocent time for us as a band. \"Lamplight Symphonies\" is one of the most beautiful stories Kerry ever wrote. We haven't played that in years. When we do the tour coming up in October and the next year, we're going to start playing that song again. We've been wanting to play that for decades now.\n\nWhat is it about Song For America? You can really see we were starting to find ourselves. Looking at the tracklist. It starts to make sense. \"Down the Road\" was a very straightforward rock song. It was a great song to feature Robby [Steinhardt] singing. Then \"Song for America,\" which is probably in our top five, easily, of the best songs Kerry ever wrote. It's an epic piece of music. Overall, this album really sounded good. The engineers were very helpful getting us over the first album experience. It was fun. We had a great time staying on Sunset Blvd. The Kansas boys had been set free. It was fabulous, we were having the times of our lives.\n\nWhat is it about that song that gets you?\n\nOnce in a blue moon, you can record something and it has something indefinable about it; it has an atmosphere about. It captured a mood, but it's such a pumping story, and the music represents it well and everything about it… perfect package. Some songs do that. \"Like a Rolling Stone\" by Bob Dylan—when that song comes on, there's a perfection about it that I can't define, and not too many songs and recordings can do that. That one captures such a unique character and mood to it. \"Lonely Street,\" it's kind of a blues song but it's not typical, lyrically. A little questionable, but the song was a very strong show of a very aggressive side of us. \"Devil Game\" was a fun song to play live that just got lost in the times. Steve never wanted to play it anymore so we didn't play it for decades. \"Incomudro\" is a cool song. It had some great parts to it, definitely dabbling into being more progressive; it's got some beautiful music in it.\n\nWhat was it like creating this album then having to release Masque?\n\nThe Masque album was kind of a lateral move, it didn't sound quite as good. We were still hunting and packing a bit. We hadn't quite found where we were going with those two records. You can see where we were headed, looking at the timeline of things. We just hadn't gotten there yet.\n\n2. Point of Know Return (1977)\n\nWe went back to rehearsing and Kerry was loaded with a lot of great material. Steve had this instrumental thing—I'd never heard anything like it— it was the introduction to \"Portrait,\" a very strong song by Kerry. We always trying to come up with a twist with on things, and Steve suggested Point of Know Return for an album title, and so he wrote \"Point of Know Return,\" and it was a good single backing our success of \"Carry On Wayward Son.\" \"Paradox\" is a song we're starting to play again and it's a fun song to do. \"Closet Chronicle,\" we've been playing with the new band. Again, just a great song. So we've got a lot of really strong material. \"Sparks of the Tempest,\" great song for Robby, cool lyrics great piece of music. Once we started working with the symphony—\"Nobody's Home\" is not a good song to play outside at a bike rally—but once you're in a performance center with all the lights out, the symphony behind you, and the right mood is created… suddenly \"Nobody's Home\" was epic. It's such a mystical, unusual song. There's nothing about it that would ever be a favorite or a hit on the radio or anything, but for a Kansas fan, it really strikes home.\n\n1. Leftoverture (1976)\n\nWe'd been out on the road playing with Queen, and then it was time to start recording again and we're back working on material. Kerry was suddenly on fire. He was showing up with such an incredible variety of music that was just all so spectacular. \"Miracles Out of Nowhere\" I think was the first one we started working on—that whole beginning section when it comes back in a different key and re-invents itself. It only took us three days to do that, to try and get the feel of it; it was just so awkward. Other stuff was in Kerry's head, so we're deciphering what he's trying to interpret inside of his head, and it took a long time to do it. Then he'd go, \"I got another one I wrote last night!\" Suddenly, music was pouring through him in such an unprecedented way. Meanwhile, we had all these parts of songs, and it was like, \"Wouldn't it be kind of cool to try and assemble a song out of all of these parts?\" And so that's when we put together\"Leftoverture.\" It was made out of leftover parts. Then the record company goes, \"That's an album title. That's one of the best album titles I've ever heard.\" So we re-named the song \"Magnum Opus.\"\n\nHow would you describe the energy and the mood of band during Leftoverture?\n\nWe'd been working on material for a while now, so at the end of this creative spurt by Kerry, we're a day from packing up—last day of rehearsals, and we're just going to run through stuff before we pack up for Louisiana to record songs. Then Kerry goes, \"I got one more song.\" We were tired, we just wanted to go record, and he pulls out \"Carry On Wayward Son.\" We hadn't assembled it yet. We hadn't decided what comes when, but the song was there, and we thought it could be a really good song.\n\nWe were in the studio listening back to \"Wayward Son,\" and we thought it could be a game changer. It was us, not like anybody else. You could feel that everywhere, and the whole album had that feeling that there was something incredibly right about this record. You didn't know how it was going to be received, but it was hard to imagine how this wouldn't be received well. We knew this was a great record, the record company knew it was a great record. It had finally happened."}, {"url": "https://www.discogs.com/artist/472657-Rich-Williams", "page_content": "Real Name:\n\nRichard Williams\n\nProfile:\n\nRichard John \"Rich\" Williams (born February 1, 1950) is the guitarist for the American rock band Kansas, and has been with them since their 1974 self-titled debut album."}, {"url": "https://genius.com/artists/Rich-williams", "page_content": "About Rich Williams\n\nRich Williams, guitarist, is one of the founding members of legendary Progressive rock band Kansas. Williams, along with founding drummer Phil Ehart are the only members to appear on all Kansas studio albums. He was also part of the side project Native Window which released 1 self-titled album in 2009.\n\nWilliams wears an eyepatch because he lost his right eye in a fireworks accident as a small child. For a while, he used a glass eye before switching to using the eyepatch."}, {"url": "https://richwilliams1.bandcamp.com/album/ordinary-person", "page_content": "Digital Album Streaming + Download\n\nIncludes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nPurchasable with gift card"}, {"url": "https://www.vintageguitar.com/35009/richard-williams/", "page_content": "Unleashing pent-up creativity is a gratifying experience for a band, as Kansas guitarist Richard Williams can attest. The band known for the prog-/hard-rock hybrid exemplified by “Carry On Wayward Son” and “Dust in the Wind” recently released Leftoverture Live & Beyond, which included the 1976 classic Leftoverture performed in its entirety along with material from 2016’s The Prelude Implicit.\n\nOriginal members Williams and drummer Phil Ehart today lead a rejuvenated lineup that includes longtime bassist Billy Greer, violinist David Ragsdale along with three new members – vocalist Ronnie Platt, keyboardist David Manion, and guitarist Zak Rizvi. Their collective excitement is palpable on both Leftoverture Live & Beyond and The Prelude Implicit.\n\nLeftoverture Live & Beyond is 19 songs recorded at 12 shows in early 2017.\n\n“The only song we’d never played live from Leftoverture was ‘Questions of My Childhood.’ And we didn’t re-record anything or go back in and do overdubs,” Williams said.\n\n“Traditionally, we’ve done a lot of rearrangements of Kansas songs – sometimes for good, sometimes for not so good. With this new lineup, we’ve gone back as much as we can to the way the songs were written and recorded. We’re trying to lean more on the original arrangements.”\n\nBefore they started work on The Prelude Implicit, the band toured, and it went so well, he said, “…the restraints were off of us, musically.” At first, doubts nagged about their ability to write new songs because former vocalist/keyboardist Steve Walsh and guitarist/keyboardist Kerry Livgren had always been Kansas’ primary songwriters; Somewhere to Elsewhere was Livgren’s material with the original members performing, but Williams said it was “an assembly-line thing” with parts recorded separately.\n\n“It’s not the same as sitting in a room with a bunch of guys, developing ideas. That ebb and flow is really where some of our best stuff came from – not just from one person but by the combination and effort of everybody. We didn’t have that on Somewhere to Elsewhere. That’s what we had on The Prelude Implicit again,” he said. “We made the album for us as much as we made it for anything else. We didn’t know what it was going to be going into it. We had never done it this way before. We wanted to be quintessentially Kansas from the artwork to the lyrics to the music to the variety within the music – very well-thought-out to be as Kansas as we possibly can.”\n\nWilliams’ main concern has always been about what’s best for Kansas as a whole.\n\n“I’m a team player. There’s no Richard Williams solo album. I’ve never had a desire to do a solo album,” he said. “In my opinion, Kansas has always been the sum of its parts, not so much the talent of any one person. I’ve always just been very comfortable in the role of a team player.”\n\nHis attitude applies to working with other guitarists in Kansas, whether it’s been Livgren, Steve Morse, or Rizvi.\n\n“In our early days, we were doing an interview and they asked Kerry, ‘Who’s your biggest influence?’ He said, ‘Probably Rich, because we play together all the time.’ We were working on equipment together and guitars and guitar tones and different things. You’re not in competition, but constantly working together. That’s all very positive,” said Williams.\n\nFor more than 30 years, Williams’ main electric has been a PRS Custom from ’84 or ’85. Early in Kansas, he played a Gibson L-6S that’s still part of his collection of about 30 guitars. He also plays a Martin D-28 based on the one he used on “Dust in the Wind.”\n\nThe uncertainty nipping at Kansas’ heels in recent years has been replaced with forward-thinking confidence; pending is a tour during which they’ll perform 1977’s Point of Know Return in its entirety, and they’re set to record a new studio album.\n\n“The quality of the shows and the performance level of the band is at an all-time high,” said Williams. “The energy level, the crowd enjoyment – everything – is greater than it has been since the early days. It feels much like it did on the second, third, and fourth albums,” said Williams. “It’s that type of focused energy. It’s been a tremendous experience. None of us are looking back, remembering when. Our best days are in front of us.” – Bret Adams\n\nThis article originally appeared in VG‘s June 2018 issue. All copyrights are by the author and Vintage Guitar magazine. Unauthorized replication or use is strictly prohibited."}, {"url": "https://www.americanbluesscene.com/2022/04/the-57th-studio-album-for-hank-williams-jr-to-be-rich-white-honky-blues/", "page_content": "Larger than life, capable of summoning “all his rowdy friends” with a couple crashing downbeats and a blaring guitar riff, Hank Williams, Jr. has been one of country music’s truest outlaws for over half a century. But more than the swaggering singles, roughneck fantasy videos or relentless sense of blue-collar boogie, at his core, the 72-year-old legend is a bluesman. Pure, unqualified and unadulterated, the only son of Hank Williams has the same down low lonesome in his veins as the man Rufus “Tee-Tot” Payne taught to play guitar as a small child growing up in Greenville, Alabama.\n\nWith Rich White Honky Blues – set for release on June 17 – the second-generation Country Music Hall of Famer makes good on his legacy with a turpentine and rough wood take on the hill country blues that informed his father’s raw-boned style of putting his pain out there. GRAMMY-winning Producer of the Year Dan Auerbach recorded the set live, with a dozen songs reprising classics from Robert Johnson, Lightnin’ Hopkins, R.L. Burnside, Muddy Waters, Big Joe Turner and a few from Bocephus himself.\n\nThe blues is where it all comes from. It’s the start of everything musical in my family; everything starts with Tee-Tot and flows from there. I’ve always flirted with this stripped back blues – all the way back to the ‘80s. But I finally made an album that’s just that, and I like it. Hank Williams Jr.\n\nBlame it on the owner of Easy Eye Sound. Auerbach went straight to the essence. Assembling a wicked core band of electric slide guitarist Kenny Brown, claimed as “my adopted son” by R.L. Burnside, bassist Eric Deaton, who first toured with Fat Possum’s Juke Joint Caravan, backing up T-Model Ford and Paul “Wine” Jones, plus drummer Kinney Kimbrough, son of North Mississippi blues legend Junior Kimbrough, they tapped into the lifeblood of the blues at its most randy.\n\n“If you wanted to play this kind of music, you couldn’t have better players,” Auerbach explains. “The first time I ever saw Hank Jr. on TV, I was a kid raised on Robert Johnson and Hank Williams, Sr. records, and those things came through so clearly watching him. So, I tried to assemble the right parts to just sit in that piece of who he is.”\n\nIt started with a phone call, discussing what these sessions could be. Nothing definitive, no commitments made. But then Auerbach started receiving text messages the week leading up to the dates: pictures of Hank Williams, Jr. stationery, each with the title of a song he wanted to sing. Back and forth. Songs. Influences. Touchstones to draw upon.\n\nAnd then it was Day One.\n\n“First thing he said to me when he walked in was, ‘I don’t really feel like fucking with this shit!’,” Auerbach recalls. “And he walked into another room.”\n\nUndaunted, the producer had the band start playing; grindhouse blues, sweltering hill country shuffles, juke joint altar calls. Before too long, the man whose alter-ego is Thunderhead Hawkins emerged, curious and hungry.\n\nOver the course of just three days, Rich White Honky Blues was done, with Williams punctually declaring “I hope you got all of that. I bet YOU did. I’m going to listen – and smoke…”\n\nWilliams’ extremely impressive resume has spawned 70 million albums sold worldwide, six PLATINUM albums, 20 GOLD albums, 13 No. 1 albums and 10 No. 1 singles. 2016’s It’s About Time (Nash Icon Records) included the history-making “Are You Ready for the Country,” as well as tunes “Dress Like an Icon,” “Just Call Me Hank,” “It’s About Time” and “The Party’s On” in addition to re-recorded versions of classics “Mental Revenge” and “Born to Boogie” with Brantley Gilbert, Justin Moore and Brad Paisley on guitar. Following It’s About Time, Williams has released several compilations, including All My Rowdy Friends Are Coming Over: Great Tailgating Songs, A Country Boy Can Survive (Box Set), Hank Jr. Sings Hank Sr. and 35 Biggest Hits. He continues to add accolades to an extremely impressive resume, which includes ACM Entertainer of the Year, CMA Entertainer of the Year and BMI Icon, in addition to a GRAMMY win and coveted inductions into the Nashville Songwriters Hall of Fame and Country Music Hall of Fame.\n\nAs Williams prepares for the release of his 57th studio album, his family has been struck by tragedy with the sudden passing of his wife of 31 years, Mary Jane Thomas. While Williams considered delaying the project’s announcement, time with his family led to one conclusion: music offers solace in the most difficult times.\n\nIn this sense, it seems almost predestined that Rich White Honky Blues ends with a prayer for redemption as Williams invites the Savior to bring whatever grace He might have, to sow solace and forgiveness, suggesting the larger than life amongst us transcend mortal limitations. After all, Country blues informed his father’s raw-boned style of putting his pain out there, epitomizing the unquestionable truth that there is always a time for music in moments of need."}, {"url": "https://www.guitarworld.com/features/richard-williams-not-to-sound-pompous-but-kansas-pretty-much-gave-birth-to-american-prog-bands", "page_content": "Mention the band Kansas to the average listener, and he or she will instantly name two classic rock staples: Carry On Wayward Son and Dust in the Wind.\n\n“Oh, sure, those are the big ones,” says guitarist Richard Williams, who co-founded the progressive rock outfit back in 1970. “I could let it get to me and go, ‘Hey, we’ve got a whole body of work,’ but that would be a waste of time. Those are the songs that brought us to the table. Without Wayward Son and Dust in the Wind, we wouldn’t be around today.”\n\nWilliams recalls how in 1976, with the band deep in debt to their record label and facing an uncertain future after their first three albums (Kansas, Song for America and Masque) stiffed, they approached the recording of their fourth album, Leftoverture, with a sense of impending doom.\n\n“It was a pretty dark time. We were bleeding money pretty seriously,” he says. “We were signed to Kirshner Records, and our benefactor, Don Kirshner, could have easily said, ‘Guys, it’s been fun, but you need to find another record company.’ We needed a hit, and thank goodness we came up with Carry On Wayward Son. It saved us so we could go on. And then we had Dust in the Wind. Those songs exploded and our worlds changed forever.”\n\nKansas were in a unique position in the mid Seventies. Not only did they represent the last trace of progressive rock on AM playlists that were suddenly ruled by disco, but they were also one of the very few purveyors of American prog, period.\n\n“Not to sound pompous, but we pretty much gave birth to American prog bands,” Williams says. “What’s amazing is, we did it pretty sneakily. We were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material.\n\n“So we’d slip in one of our own tunes and tell the crowd that we were playing the B-side of Smoke on the Water. We’d stretch songs out and go crazy, and the people loved it. It became our thing.”\n\nWe were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material\n\nOf the seven current members of Kansas, only Williams and drummer Phil Ehart remain from the original crew. Singer Steve Walsh, who ended his on-and-off association with the band in 2014, has been replaced by two co-lead vocalists, Billy Greer and Ronnie Platt, who double on bass and keyboards, respectively.\n\nWilliams’ longtime guitar foil Kerry Livgren, who also served as Kansas’ chief songwriter, split in 2000, and in his place is New Jersey picker Zak Rizvi.\n\n(Image credit: Paul Natkin/Getty Images)\n\n“It feels like a different band sometimes because we’ve got a bunch of newer faces,” Williams says, “but at the same time, it feels like the original band because we’ve got seven guys who really love to perform and create. Back in the day, we let money and business get in the way. This bunch of guys just wants to make music.”\n\nThe band has a new album out, 2020’s The Absence of Presence, and all told, it sounds like quintessential Kansas: there’s muscular, epic prog-rockers like Throwing Mountains and the eight-minute-plus title track, symphonic power ballads such as Jets Overhead and Memories Down the Line, and there’s even a “how-over-the-top-can-we-go?” instrumental in the form of Propulsion 1.\n\n“We’re kind of always in a state of having to prove ourselves,” Williams says. “We had to do it on our last album, [2016’s] The Prelude Implicit, because it was our first new music in 16 years, and I think this time we had to prove that we still mean it.”\n\nHe lets out a laugh, then adds, “I imagine on the next one, we’ll have to do the same thing. That’s OK – I’m used to it.”\n\nBefore the band got started, who were the guitar players that you were really listening to and emulating?\n\n“I was copying anybody who was there. The Yardbirds were pretty big to me. My introduction to blues wasn’t through the Americans; I dug the British guys. John Mayall and the Bluesbreakers, Eric Clapton – Clapton’s first solo album was like Guitar 101 to me.\n\n“Instead of this twangy rhythmic instrument, suddenly here’s this ballsy guitar with a guttural saxophone lead voice. Suddenly, I was hearing blues in a different way. Of course, I also loved Jimmy Page and Jeff Beck – those guys made a big impression on me. That stuff really formed the basis of my sound and style.“\n\nGrowing up in Topeka, was it easy for you to get good guitars living where you were?\n\n“Oh, yeah. I had Marshall amps and Les Pauls. I had a Gibson ES-335, which I still have to this day. Everything that you could buy in Los Angeles you could buy in Topeka. When I was 15, I had a charge account at the local music store. If I wanted something, I’d charge it and make weekly payments on it.\n\n“This was a pretty cool time. When The Beatles were on Ed Sullivan’s show, Topeka exploded, just like every other town in the country. Everybody had to be in a band. There was a garage band on every block.“\n\nKansas played covers in clubs for a few years. Do you remember when you first heard prog from England and when it started to influence the band?\n\n“It took a while. For a time it seemed as if only the two coasts were hearing the prog stuff. Gradually the stations in Kansas started playing it – I guess somebody’s ears were tuned to it. We’d be like, 'Wow, have you heard this band called ELP?' Or 'Have you heard Genesis’ Selling England by the Pound?'\n\n“It was very exciting to find all these new, creative ways of addressing rock ‘n’ roll. I don’t even know if 'rock ‘n’ roll' was the correct term for that music.“\n\nSome bands were resistant to chance, but we embraced it... We cut our teeth on rock ‘n’ roll. But we were looking to be different\n\nEven so, it didn’t seem as if American bands were jumping on the prog bandwagon. You guys were outliers.\n\n“Some bands were resistant to chance, but we embraced it. I mean, we played Mitch Ryder & the Detroit Wheels-type stuff; we cut our teeth on rock ‘n’ roll. But we were looking to be different. I remember playing cover songs during our club days. You’d get to a part and be like, 'Man, this song sucks. I hate the middle part.'\n\n“So we started thinking that we could do some sort of interlude at the beginning, or maybe we could play the song at half-time. We did anything to change it up and put some balls to the music. In hindsight, we were doing something very important: We were learning how to be us.“\n\n(Image credit: Dimitri Hakke/Redferns)\n\nDid it seem as if playing throughout your home state was a dead end? Did the band consider relocating to one of the two coasts to get noticed?\n\n“Well, what happened was, we made a demo tape, and that’s what we sent out to the coasts. One of them wound up on Don Kirshner’s desk. The people at Don’s company loved it – they really dug the violin – and they sent a guy named Wally Gold to check us out.\n\n“We put together a show and did that old free-beer trick: 'Come to the show and the drinks are free.' So Wally showed up and the place was packed; everybody was drunk and partying. So Wally called Don and said, 'Man, there’s something going on here. People are crawling through the windows to get in the place.' That sealed the deal. Next thing you know, we signed a deal with Don Kirshner and were making records.“\n\nLeftoverture [1976] and Point of Know Return [1977] hit one after the other. After being hitless for several years, that must have felt remarkable.\n\n”I’m still here today doing this because of that explosion. We didn’t really know how huge it was at the time. We were just blue-collar guys from the Midwest. I remember arriving at Madison Square Garden in a limo with our manager, and he was going, 'Madison Square Garden! This is so big!'\n\n”We were like, 'Yeah, yeah, whatever.' We’d been on the road for so long, so to us this was just a natural progression of more and more shows. Today I realize how big it was, but back then we didn’t really see it.”\n\nHow much of Carry On Wayward Son had Kerry written before the band got to dive into it? And how long did it take to work out that intricate guitar and keyboard solo section?\n\n“That was the last song we did for the album, on the final day or recording. Kerry came in and said he had a new song. We learned the structure of it and got to it. The version you hear on the record is probably the first time we ever played it correctly.\n\n“The solo thing didn’t take long. My approach to guitar is just wing it. I didn’t really have a planned solo. I just responded to what everybody else was doing and threw stuff out there. I was kind of like, 'I’ll just play stuff. Let me know if it sounds right.'“\n\nFor rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression\n\nThe acoustic guitar figure of Dust in the Wind is so recognizable. I understand that Kerry wrote it as a fingerpicking exercise.\n\n“Yeah, Kerry didn’t write the song to write a song; he wrote this chord pattern to teach himself fingerstyle guitar. His wife thought it was a song, and he was like, 'No, this isn’t Kansas. The band would never play this.' But he brought it in and we thought it was really nice.\n\n“The figure was there; it didn’t have the middle section or the violin solo. But it came together fast. I remember when we were listening back to it, somebody said, 'That’s the next single.' Kerry didn’t think so, but the rest of us knew. And sure enough – boom. The track exploded on the radio.“\n\nThe way you approached the solo section of Wayward Son – is that still the way you compose leads in the studio? I’m thinking of the title track of the new album, which has a similar solo structure.\n\n“It’s sort of the same. What happens is, somebody lays something down and everybody else plays off of it. It’s very collaborative, but not as instant as it was back in the day. Somebody else’s solo will dictate what you’re going to do, and you take inspiration from what they’ve done to go somewhere else.\n\n“It’s always fun to do it that way. I’ll lay down the foundation, and then Zak will play something; Tom will do a smoking keyboard part. Sometimes we redo our parts based on what somebody does.“\n\nThe riff in the song Throwing Mountains sounds as tough and mean as early grunge. Did any of that stuff ever make an impression on you?\n\n”Not really at first. I could appreciate the honesty of grunge. It’s like, I loved The Beatles for their polish, but I loved The Rolling Stones for their rawness. You listen to Bob Dylan – his recordings are very elementary, but they’re honest.\n\n”For rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression. So you mention grunge and that song, sure, I’ll take that. It reminds me of how punk obliterated disco back in the day. Let’s get back to being raw.”\n\nHow are you enjoying playing live with Zak Rizvi?\n\n”Oh, I’m loving it. Zak has a deep love and knowledge of the band. He’s a tremendous engineer and guitarist – just brilliant musically. He’s a real scholar of music. Playing with him and having him in the band is great. There isn’t much he can’t play. I mean, he played trombone in a symphony. I have a blast working with him.”\n\nWhat was it like working with Steve Morse during his time in the band?\n\n”What an interesting guy! When he came in, he had just won every guitar award imaginable; they had to invent awards to give him. I’ll be honest: I was a little intimidated at first, but I was pleased to find out that he’s the least intimidating man around. He’s fascinated by everything.\n\n”We would be on tour, and we would see some crappy band playing at a Holiday Inn or wherever. We would be like, 'Let’s go. This band sucks.' But Steve would say, 'Did you see what that guitar player just did with his on/off switch?' The guitarist wasn’t even that good, but Steve was learning from him anyway.”\n\n﻿For a while you played PRS guitars, but I understand you’ve moved back to Les Pauls now.\n\n”I still play PRS guitars occasionally, but I got my hands on a Les Paul that blew me away. It’s one of the Lee Roy Parnell signature models – a reissue of the ’57 Goldtop – and it’s fabulous.\n\n”It’s got a support in the back of the headstock, so if it falls over it won’t break, and the heel has a cutaway so you can get up the neck a lot easier. I run that through a Fractal Axe-Fx III and I’m good to go. I used to have to spend hours getting tones. Now I can just dial in the sound, and boom – let’s play.”"}, {"url": "https://www.iconvsicon.com/2022/03/24/country-music-legend-hank-williams-jr-to-release-rich-white-honky-blues-album-in-june-2022/", "page_content": "Larger than life, capable of summoning “all his rowdy friends” with a couple crashing downbeats and a blaring guitar riff, Hank Williams, Jr. has been one of country music’s truest outlaws for over half a century. But more than the swaggering singles, roughneck fantasy videos or relentless sense of blue-collar boogie, at his core, the 72-year-old legend is a bluesman. Pure, unqualified and unadulterated, the only son of Hank Williams has the same down low lonesome in his veins as the man Rufus “Tee-Tot” Payne taught to play guitar as a small child growing up in Greenville, Alabama.\n\nWith Rich White Honky Blues – set for release on June 17 – the second-generation Country Music Hall of Famer makes good on his legacy with a turpentine and rough wood take on the hill country blues that informed his father’s raw-boned style of putting his pain out there. GRAMMY-winning Producer of the Year Dan Auerbach recorded the set live, with a dozen songs reprising classics from Robert Johnson, Lightnin’ Hopkins, R.L. Burnside, Muddy Waters, Big Joe Turner and a few from Bocephus himself.\n\n“The blues is where it all comes from,” concedes Williams. “It’s the start of everything musical in my family; everything starts with Tee-Tot and flows from there. I’ve always flirted with this stripped back blues – all the way back to the ‘80s. But I finally made an album that’s just that, and I like it.”\n\nBlame it on the owner of Easy Eye Sound. Auerbach went straight to the essence. Assembling a wicked core band of electric slide guitarist Kenny Brown, claimed as “my adopted son” by R.L. Burnside, bassist Eric Deaton, who first toured with Fat Possum’s Juke Joint Caravan, backing up T-Model Ford and Paul “Wine” Jones, plus drummer Kinney Kimbrough, son of North Mississippi blues legend Junior Kimbrough, they tapped into the lifeblood of the blues at its most randy.\n\nIt started with a phone call, discussing what these sessions could be. Nothing definitive, no commitments made. But then Auerbach started receiving text messages the week leading up to the dates: pictures of Hank Williams, Jr. stationery, each with the title of a song he wanted to sing. Back and forth. Songs. Influences. Touchstones to draw upon.\n\nAnd then it was Day One.\n\n“First thing he said to me when he walked in was, ‘I don’t really feel like fucking with this shit!’,” Auerbach recalls. “And he walked into another room.”\n\nUndaunted, the producer had the band start playing; grindhouse blues, sweltering hill country shuffles, juke joint altar calls. Before too long, the man whose alter-ego is Thunderhead Hawkins emerged, curious and hungry.\n\n“If you wanted to play this kind of music, you couldn’t have better players,” Auerbach explains. “The first time I ever saw Hank Jr. on TV, I was a kid raised on Robert Johnson and Hank Williams, Sr. records, and those things came through so clearly watching him. So, I tried to assemble the right parts to just sit in that piece of who he is.”\n\nOver the course of just three days, Rich White Honky Blues was done, with Williams punctuatingly declaring “I hope you got all of that. I bet YOU did. I’m going to listen – and smoke…”\n\nRich White Honky Blues Track List\n\n.44 Special Blues Georgia Women My Starter Won’t Start Take Out Some Insurance Rich White Honky Blues Short Haired Woman Fireman Ring the Bell Rock Me Baby I Like It When It’s Stormy Call Me Thunderhead TV Mama Jesus Will You Come By Here\n\nAs Williams prepares for the release of his 57th studio album, his family has been struck by tragedy with the sudden passing of his wife of 31 years, Mary Jane Thomas. While Williams considered delaying the project’s announcement, time with his family led to one conclusion: music offers solace in the most difficult times.\n\nIn this sense, it seems almost predestined that Rich White Honky Blues ends with a prayer for redemption as Williams invites the Savior to bring whatever grace He might have, to sow solace and forgiveness, suggesting the larger than life amongst us transcend mortal limitations. After all, Country blues informed his father’s raw-boned style of putting his pain out there, epitomizing the unquestionable truth that there is always a time for music in moments of need.\n\nAbout Hank Williams Jr.\n\nHank Williams Jr.’s extremely impressive resume has spawned 70 million albums sold worldwide, six PLATINUM albums, 20 GOLD albums, 13 No. 1 albums and 10 No. 1 singles. Marking 58 years since his first album in 1964, Williams Jr. is preparing to release his 57th studio album Rich White Honky Blues on June 17, featuring 12 songs recorded over a three-day period by GRAMMY-winning producer Dan Auerbach. 2016’s It’s About Time (Nash Icon Records) included the history-making “Are You Ready for the Country,” as well as tunes “Dress Like an Icon,” “Just Call Me Hank,” “It’s About Time” and “The Party’s On” in addition to re-recorded versions of classics “Mental Revenge” and “Born to Boogie” with Brantley Gilbert, Justin Moore and Brad Paisley on guitar. Following It’s About Time, Williams Jr. has released several compilations, including All My Rowdy Friends Are Coming Over: Great Tailgating Songs, A Country Boy Can Survive (Box Set), Hank Jr. Sings Hank Sr. and 35 Biggest Hits. He continues to add accolades to an extremely impressive resume, which includes ACM Entertainer of the Year, CMA Entertainer of the Year and BMI Icon, in addition to a GRAMMY win and coveted inductions into the Nashville Songwriters Hall of Fame and Country Music Hall of Fame."}], "Rich Williams has collaborated with other artists.": [{"url": "https://rockcellarmagazine.com/kansas-band-interview-rich-williams-point-of-know-return-live/", "page_content": "Facebook Twitter Email Reddit\n\nIt is sad to report that Kansas founder and violinist Robby Steinhardt has passed away. Steinhardt was the original violinist and vocalist on “Dust in the Wind,” “Point of No Return” and “Carry on Wayward Son.” Steinhardt, who was working on a solo album, was 71. The following interview with guitarist Rich Williams was conducted May 14, 2021.\n\nClassic rock bands have always experienced a revolving door of musicians. Kansas has seen its share of upheaval, but guitarist Rich Williams and drummer Phil Ehart have been with the band since its debut album. “We have a work ethic that we get from our parents and from where we grew up of just sticking to it,” says Williams. “Things get tough, you stick with it.”\n\nAfter years of false starts, the band signed with producer Don Kirshner’s label and released Kansas in 1974. Its mix of progressive rock and symphonic arrangements with the work of violinist Robby Steinhardt produced the band’s signature sound — a sound that has allowed the group to still maintain a steady presence today.\n\nThe band’s breakout LP was 1976’s Leftoverture, which featured the hit single “Carry On Wayward Son.” Point of Know Return followed in 1977. The success of the title track and “Dust in the Wind” secured the band’s spot as a major arena headliner.\n\nIn July 2020, Kansas released its 16th studio album, The Absence of Presence. The album introduced the band’s newest member, Tom Breslin, a vocalist who contributed music and lyrics.\n\nKansas in concert delivers performances that remain true to the original studio cuts. In 2016–2017 Kansas launched the Leftoverture 40th Anniversary Tour, which became the 2017 live album Leftoverture Live & Beyond. Kansas followed with its Point of Know Return Anniversary Tour. The band recorded every show and on May 28, 2021, released Point of Know Return Live & Beyond.\n\nClick here to pick up Point Of Know Return Live & Beyond on 2-CD from our Rock Cellar Store\n\nClick here to pick up Point Of Know Return Live & Beyond on 3-LP/2-CD from our Rock Cellar Store\n\n“We thought maybe one day we would release this,” says Williams. “And then with the pandemic, we figured, ‘we have the time, let’s put this together.’”\n\nRock Cellar talked with the guitarist shortly before the live album’s release, and it was made evident that decades of success have not changed his intensity and work ethic.\n\nWilliams explains how the band’s music — and members — evolved over more than four decades. It’s an object lesson that every musician should read before putting pen to contract.\n\nRock Cellar: Why was Point of No Return the focus of the new live album?\n\nRich Williams: We had previously released the Leftoverture Live & Beyond album. To have a recording done in its entirety, in its original running order, it had never been done. Until this tour, we’d never played all these songs ever. It also gave us the opportunity to go deeper into a lot of other albums. Like “Lonely Wind,” we hadn’t played it forever. If we played it, we didn’t play it for long. To bring certain songs back from the dead was just smart to do.\n\nWe recorded every night from out front, so we probably had 100 shows taped. That process becomes a lot easier, it’s almost like a studio at that point. You’ve got everything mic’d just right.\n\nRock Cellar: Kansas recently played its first live show in 14 months. What went into preparing for the show after such a long layoff?\n\nRich Williams: As far as the group, we showed up, we did the show. But fortunately we have the live album. And almost everything we’re playing at the moment comes off of that album. So we just compiled the setlist and then a playlist and everybody just did their homework.\n\nFor the last two months I’ve played that set twice a day. At home, I have the same setup as my live setup. So I can just stand there and go through all the motions of what I have to do and play along with the same guys, just through my studio speakers.\n\nThat’s really what everybody did. We just continued doing the show. We had a real brief hotel room rehearsal the night before. And then we jumped on stage and did it. The weirdest part was walking out on stage. It’s like another day. It didn’t seem like that much time had passed. The lights went on and we did the show.\n\nWe were just glad to see each other. That part was exciting, but everybody was very prepared. There was a bit of adrenaline, some nerves, it’s like, “how’s this going to go?” Normally, if we’re on the road, and we go three weeks without shows, one of us will put together a rehearsal. We probably won’t do that anymore now because we know we can do it without that. It’s six responsible guys that kept up on it.\n\nRock Cellar: How do you approach improvisation when performing live, especially on the best-known songs?\n\nRich Williams: For me, there are certain things I want to play not quite note-for-note, but I stick to the theme at least. There are other things I just don’t know. It’s like, “here comes a part, what are you going to play?” I don’t know. Then I just start playing.\n\nI’m just going to play in the moment, kind of the way I do it in the studio. I hate to over-rehearse. What moves me at the moment is what I usually tend to go for. There’s been so many times where, in the studio, “I don’t know what I’m going to play here. Just roll the tape.”\n\nFor example, in the song “The Voyage of Eight Eighteen” on The Prelude Implicit, I had no idea what I was going to play in the solo. I just knew I wanted to get this big, out of control-kind of a sound. Usually, I record in the control room but for this I went out and had the amp right next to me, just crankin’. I said, “just run it by, let me get a feel for this.”\n\nSo it went by, I was just kind of holding on, I didn’t know what I was gonna do exactly. And they said, “you’re done.” I said, “what?” That was great.\n\nI had no idea what I was doing whatsoever. I was just trying to get a feel for where the feedback points were and just get a general feel of it all. And it’s one of my favorite things I’ve ever done. That’s my approach to a lot of solos. “I have no idea, here it comes.” It’s the shotgun approach. I just aim it in the general direction and pull the trigger and see what happens.\n\nKANSAS will be extending the popular Point of Know Return Tour starting with new shows starting November 13, 2021. Before that, the band will be performing sets of KANSAS Classics later this summer & early fall. For more info & dates click here: https://t.co/0kY2dv39L3 pic.twitter.com/Q2CqYQwSGr — KANSAS (@KansasBand) June 8, 2021\n\nRock Cellar: What are the challenges of performing such musically complex songs live?\n\nRich Williams: Especially on the long ones, it’s just a lot of notes. It’s one thing to sit down and practice it but then you’ve got the lights and the crowd and so many distractions. To keep a constant focus on what you’re doing [can be tough], because if your mind wanders, you’re in the weeds really quickly. It’s mentally exhausting staying focused. But then on the other hand, there are some simpler songs that my mind will tend to wander and I will get lost. It’s like, pay attention! It’s funny how that works.\n\nMany bands of our era sit around and party before they go out and get half drunk and go out. We just have too much to do. There’s no way to do that and go out there and play. It’s too hard.\n\nRock Cellar: You’ve said that the success of Leftoverture and Point of Know Return changed the internal workings of the band. What did you mean?\n\nRich Williams: When we first started, we were young men. It’s not like we were from poor families, but leaving home, we all played in different bar bands, some together, some with other people, you’re not successful in any way. People living in band houses, you have kind of an all-for-one, one-for-all, you’re like pirates out on the open sea. It’s teamwork. And it goes like that. And time goes on.\n\nAnd this isn’t a complaint, it’s an observation. It’s just the way things go.\n\nThe way the money works with records, etc. is we did not sign a good deal with Don Kirshner. He was our benefactor, it was the only offer we got. Without him, nothing would have ever happened. But the first thing he did was say, “I am a publisher. I want to publish or go somewhere else.” So right away, we threw a third of the pie away. Another third of the pie is writer’s royalties. And the last part of it is the royalties that the band would bank.\n\nThat part has to pay for every possible recording cost of everything. It takes a long time to pay off recording debts. So no money comes to the band. But the songwriters, and rightfully so, they get paid from the first record sold. They get money from that. So after Leftoverture went gold, we paid off all of our previous debt. The songwriters had already made a small fortune. That starts to change the dynamic.\n\nAt that point in the band, we’re getting a little older, we’ve been together for a while, people are buying houses, cars, getting married. So that all-for-one, one-for-all mentality has taken its natural course and starts to change the dynamic within the band.\n\nThen Point of Know Return, some people have made a lot of money and they don’t want to work as much. Others are, “I’d like to get mine now.” So things just changed. People were going from young, dumb guys to maturing a bit.\n\nAnd money does change people. So people will wander in all sorts of directions.\n\nThings just take their natural course. People naturally drifted apart because it wasn’t really working anymore. But we’re all good friends to this day. No animosity towards anybody through all of that.\n\nThat’s just the dynamic of what happens within a band that’s been around for a little while.\n\nRock Cellar: How do you maintain the classic Kansas sound despite so many personnel changes?\n\nRich Williams: For the first album, everyone was involved in arranging things, in editing things, saying this works, this doesn’t work. Identifying what we’re comfortable with, what parts we like, which parts we don’t. My input is recognizing what fits within a quintessential Kansas part. Or what can we do to this to make it more Kansas-esque? I just have an ear for that.\n\nWe’ve surrounded ourselves with people who have done it for quite a while with us, people who came in very familiar.\n\nWe know who we are and we know who we were and what we want to continue to be, so it’s really not that difficult. Tom Breslin, the newest addition, brought in a lot of material and it wasn’t difficult for us to turn this into what sounds like Kansas.\n\nRock Cellar: The title, The Absence of Presence, is a reference of modern technology?\n\nRich Williams: Yes, but it’s a bit ambiguous. It tends to mean different things to different people. I like things that are ambiguous. The original concept of it was people are so out of touch with what’s around because of the technology in their hand or what they’re watching or computers, whatever.\n\nRock Cellar: The album continues the use of the band’s trademark violin. Explain the violin’s importance in the Kansas sound.\n\nRich Williams: We did a couple of albums, Steve Morse on guitar [Power and In the Spirit of Things], good albums but they sound like a different band. They just do. It is a signature sound, it does set us apart. I think it made us do something. What that is is the violinist needs something to do besides stand around and play fiddle parts. It changes my parts, it changes keyboard parts, because suddenly you find yourself in more of an orchestral sense.\n\nIt creates a more symphonic sound. If you take the violin away, all of a sudden the guitarist is just flashing, the keyboards are just playing away. You add that other dimension and suddenly you become more artistic in your approach.\n\nRock Cellar: You and Phil have been together since the first album. What’s the secret of your longevity together?\n\nRich Williams: The top of the list would be tenacity. We grew up in the Midwest, family life. My dad met my mother in England during World War II. They married and remained married until their death. He had a job at a place called Baker Truck Rental before the war. He came back, Baker Truck Rental became Ryder Truck Rental. He remained with them until he retired. Phil’s dad, he was a colonel in the Air Force. They travelled all over the world. His family life was very similar. He had one job, married until their death.\n\nWhat I learned was that sticking to a commitment is in my nature by birth and by example. We have a work ethic that we get from our parents and from where we grew up of just sticking to it. Things get tough, you stick with it. Things get good, you stick with it. I started at a certain age to take the next step: when something shitty happens, OK, fine, fuck it. Next step. I’ve never quit anything. So that part isn’t an effort. It’s my nature.\n\nPeople ask, when are you going to retire, Rich? I go, what would you have me do? Play more golf? Stamp collecting? I’ve got the best job on earth. And someone says, what do you do in your spare time? I practice. I’ve got a guitar room with 30 guitars in it, a wall of amplifiers and my computer is all set up so I can prepare for the next show. That’s what I do. And that’s true for both of us.\n\nWe talked about it recently. It comes up once in awhile, after the pandemic especially. It’s like, what do you think? Hey, I’m in. Good, I’m glad to hear that ’cause I am too. We will do this until we can’t. Because we love to do it.\n\nRock Cellar: Let’s do a Lightning Round. A Kansas song more people should have listened to.\n\nRich Williams: “The Voyage of Eight Eighteen.”\n\nRock Cellar: What would be a great song for Kansas to cover?\n\nRich Williams: We have done some in the past. We did “Eleanor Rigby” with the London Symphony Orchestra. We did “Bringing It Back” by J. J. Cale on the first album. A song that I always thought we’d do great is “Solsbury Hill” by Peter Gabriel.\n\nRock Cellar: Favorite guitarist.\n\nRich Williams: Jeff Beck.\n\nRock Cellar: If you weren’t in Kansas, what band, past or present, do you think you would have been a good fit for?\n\nRich Williams: AC/DC."}, {"url": "https://www.nature.com/articles/d41586-021-00469-2", "page_content": "Scientists and artists are working together as never before, finds a Nature poll. Both sides need to invest time, and embrace surprise and challenge.\n\nCenterbeam: MIT’s iconic art–science installation in 1977.Credit: Dietmar Löhrl/CAVS Special Collection, MIT\n\nExhilarating, challenging, enlightening, stimulating, inspiring, fun.\n\nThese were some of the words that Nature readers used to describe their experiences of art–science collaborations in a series of articles on partnerships between artists and researchers. Nearly 40% of the roughly 350 people who responded to an accompanying poll said they had collaborated with artists; and almost all said they would consider doing so in future.\n\nSuch an encouraging result is not surprising. Public engagement has become essential to many research projects. Scientists are increasingly seeking out visual artists and designers to help them to communicate their work to new audiences. “Artists help scientists reach a broader audience and make emotional connections that enhance learning,” one respondent said. “The experience is very liberating for me, as a scientist,” said another. “There’s often a visual aspect to my science that generating and publishing data does not convey.”\n\nOne example of how artists and scientists have together rocked the senses came last month when the Sydney Symphony Orchestra in Australia performed a reworked version of Antonio Vivaldi’s The Four Seasons. They reimagined the 300-year-old score by injecting the latest climate prediction data for each season — provided by Monash University’s Climate Change Communication Research Hub in Melbourne. The work was entitled The (Uncertain) Four Seasons, and variations of the score containing local data were sent to every major orchestra in the world. The performance was a creative call to action ahead of November’s United Nations Climate Change Conference in Glasgow, UK.\n\nHow to shape a productive scientist–artist collaboration\n\nAnother example is how researchers are able to ‘walk’ inside cells by incorporating nanometre-scale images from super-resolution microscopy into virtual-reality software (A. Spark et al. Nature Methods 17, 1097–1099; 2020). Researchers are also deploying scientific methods to study many aspects of literature and music.\n\nBut a genuine partnership must be a two-way street. Fewer artists than scientists responded to the Nature poll; however, several respondents noted that artists do not simply assist scientists with their communication requirements. Nor should their work be considered only as an object of study — even if these are reasons why scientists seek opportunities to work with artists. The alliances are most valuable when scientists and artists have a shared stake in a project, are able to jointly design it and can critique each other’s work. Such an approach can both prompt new research as well as result in powerful art.\n\nMore than half a century ago, the Massachusetts Institute of Technology (MIT) opened its Center for Advanced Visual Studies (CAVS) in Cambridge to explore the role of technology in culture. The centre was established during the Vietnam War, when many scientists in the United States were being criticized for working on defence contracts. Its founders believed that artists and scientists could, together, create a vision for a more humane world. They deliberately focused their projects around light — hence the ‘visual studies’ in the name. Light was a something that both artists and scientists had an interest in, and therefore could form the basis of collaboration, says Seth Riskin, a visual-arts researcher at the MIT Museum who previously worked at CAVS.\n\nHow the arts can help you to craft a successful research career\n\nAmong its many achievements, CAVS was responsible for Centerbeam, a 44-metre-long installation illustrating energy transfer. It included laser drawings against clouds of steam, holograms lit by mirrors tracking the Sun and huge nylon sculptures lifted into the air with helium-filled polyethylene tubing. As science and technology progressed, and divided into more sub-disciplines, the centre was simultaneously looking to a time when leading researchers could also be artists, writers and poets, and vice versa.\n\nNature’s poll findings suggest that this trend is as strong as ever, but, to make a collaboration work, both sides need to be prepared to be surprised and challenged, to invest time in getting to know one another and to trust their different expertise. “I enjoyed physics for its elegance and symmetry,” a quantum physicist said in response to the poll. Their artist collaborator was drawn more to the messy reality of the process of science, which is not always reflected in popular science communication.\n\nThe reach of art–science tie-ups needs to go beyond the necessary purpose of research communication, and participants must not fall into the trap of stereotyping each other. Artists and scientists alike are immersed in discovery and invention, and challenge and critique are core to both, too."}, {"url": "https://wrif.com/2023/02/10/kansas-guitarist-rich-williams-on-being-star-struck-meeting-the-rolling-stones/", "page_content": "My latest interviews featured Kansas guitarist, Rich Williams. One of the things I asked him about was the passing of Jeff Beck. He said he saw him, but never actually met the legend.\n\n“I saw him, yeah, but I never did, uh, actually meet him. He would be one of those people where he wouldn’t have been impressed because I would’ve just stood there and stammered, and mumbled, and then he would’ve finally just walked away just thinking I was an idiot. He was my personal fav.”\n\nThat lead me to ask him if there was any other artists he’d met that had him star struck…there was. “Yeah. Um, it was, let’s see, the summer of 1978. We played Boulder, Colorado with, in the football stadium, with the Rolling Stones. And so we had played a few weeks earlier with them at the old, uh, football stadium in Cleveland. But at this particular show, there was a tent city built back to stage and uh, there was screens. We were just in our dressing room rehearsing and I saw the entourage pull up in limousines.” He went on “The Stones are here. So sitting there I was just playing my guitar and all of a sudden, Mick Jagger and Keith Richards just walk in the door and says, “Hello, glad to have you on the show. Really love your band. If there’s anything you need, just let us know.” I just stood there like an idiot. I didn’t know what to say and so I said nothing. My jaw was open and I, I’m sure I looked like there was something wrong with me. I was star struck.”\n\nWatch the entire interview below, as we talk about the 50 anniversary of the band, his recent birthday, playing with Steve Morse and lots more.\n\n-Meltdown-\n\nRolling Stones: Their 25 Best Songs From The '80s, Ranked\n\nThe Rolling Stones were one of the biggest forces in rock and roll music and in popular culture in the ‘60s and ‘70s. By the ‘80s, many of their peers had broken up, or faded away, or were aiming to get play on adult contemporary radio and VH1. But somehow, every time the Stones released an album in the ‘80s, it still felt like an event. And while their ‘80s output wasn’t as revolutionary and world-changing as what they did during the prior decades, the Stones in the ‘80s still cranked out a number of classics, even as they released two of their weakest albums (Emotional Rescue and Dirty Work). But as Tattoo You celebrates its 40th anniversary, we thought we’d look at some of our favorite Stones jams of the decade."}, {"url": "https://www.discogs.com/artist/472657-Rich-Williams", "page_content": "Real Name:\n\nRichard Williams\n\nProfile:\n\nRichard John \"Rich\" Williams (born February 1, 1950) is the guitarist for the American rock band Kansas, and has been with them since their 1974 self-titled debut album."}, {"url": "https://www.udiscovermusic.com/stories/best-eminem-collaborations/", "page_content": "Photo: Kevin Mazur/Getty Images for The Rock and Roll Hall of Fame\n\nEminem’s career has been blessed with a slew of guest spots from some of the world’s most celebrated artists, which has us thinking about the best Eminem collaborations throughout his long and varied career. From legendary, scene-stealing guest spots to the times he combined forces with others on his own work, musical alliances have inspired Eminem to deliver some of his greatest performances.\n\nHere we celebrate 15 of the best Eminem collaborations of all time.\n\nListen to the best of Eminem on Apple Music and Spotify.\n\nADVERTISEMENT\n\nGuilty Conscience (featuring Dr. Dre) (1999)\n\nThis early single sees Eminem pit himself against his mentor in a battle of moral wills, with Dr. Dre playing the guilty-conscience angel to Eminem’s opposing devil (delivered in full nihilist Slim Shady mode). In an astonishingly cheeky sleight of hand, Em throws Dre’s past misdemeanors back at him.\n\nEminem - Guilty Conscience (Director's Cut) ft. Dr. Dre\n\nWatch this video on YouTube Click to load video\n\nDr. Dre: Forgot About Dre (2001)\n\nKeen to give full exposure to his young protégé, Dre returned the favor with a number of guest spots on his album 2001. “Forgot About Dre” remains one of the best Eminem collaborations, as the man born Marshall Mathers proves himself worthy of Dre’s confidence, delivering a series of rapid-fire, tongue-twisting rhymes over a classic Dre beat.\n\nEminem, Dr. Dre - Forgot About Dre (Explicit) (Official Music Video) ft. Hittman\n\nWatch this video on YouTube Click to load video\n\nJay Z: Renegade (2001)\n\nThe Jiggaman only handed out one guest spot on his sixth album, The Blueprint. Such was the jaw-dropping brilliance of Eminem’s slew of stunningly dexterous verses, he arguably outshone the in-form Jay Z himself. Rival Nas certainly thought so, later rapping the infamous diss: “Eminem killed you on your own s__t.”\n\nStan (featuring Elton John) (2001)\n\nEminem has pulled off no shortage of eye-opening collaborations in his career, but few can match the surprise that greeted this legendary rendition of “Stan” alongside Elton John at the 2001 Grammy Awards. Long vilified for his seemingly homophobic lyrics, the stirring performance and post-song embrace with the openly gay singer saw Eminem answering his critics in inimitable style. Its inclusion on the deluxe edition of greatest hits release Curtain Call ensured its place among the best Eminen collaborations.\n\nEminem - Stan (Long Version) ft. Dido\n\nWatch this video on YouTube Click to load video\n\nThe Notorious BIG: Dead Wrong (1999)\n\nTaken from the Brooklyn legend’s posthumous album Born Again, this paean to hip-hop nihilism finds Biggie delivering a set of grisly threats in his typically dexterous style before Eminem ups the ante with a series of rhymes as shocking in theme as they were creatively brilliant.\n\nDead Wrong (feat. Eminem) (2007 Remaster)\n\nWatch this video on YouTube Click to load video\n\n50 Cent: Patiently Waiting (2003)\n\nSigned jointly to Dre and Eminem’s record labels, Aftermath and Shady Records, Mathers gave his protégé the ultimate seal of approval with this appearance on Fiddy’s hugely successful debut album, Get Rich Or Die Tryin’. Em uses his bars to find common ground with his collaborator with some of his most memorably dramatic lyrics.\n\nEminem - You Don't Know (Official Music Video) ft. 50 Cent, Cashis, Lloyd Banks\n\nWatch this video on YouTube Click to load video\n\nBoB: Airplanes, Part II (featuring Hayley Williams and Eminem) (2010)\n\nIn this uplifting testament to realizing your dreams, Paramore singer Hayley Williams’ anthemic, rock-inflected chorus provides the hook for rapper BoB. and Em to swap pre-fame tales of struggle.\n\nLove The Way You Lie (with Rihanna) (2010)\n\nNot only one of the best Eminem collaborations but also one of his most controversial, “Love The Way You Lie” finds Em and Rihanna taking on the subject of domestic abuse from the point of view of both abuser and victim. Given that both rapper and singer have admitted to being in abusive relationships in the past, the song is imbued with palpable feeling. Such was the song’s potency it became Eminem’s biggest hit to date.\n\nEminem - Love The Way You Lie ft. Rihanna\n\nWatch this video on YouTube Click to load video\n\nXzibit: Don’t Approach Me (2000)\n\nArguably the best of the pair’s numerous collaborations, this cut from Xzibit’s Restless album finds them trading tales about the pitfalls of stardom. Providing the beats to the track himself, Eminem upstages his host as he relates a series of inventive rhymes dealing with his struggle for privacy. “And I’m the bad guy, ’cause I don’t answer my door/Like, ‘Hey, hi! You guys wants some autographs?/OK, form a straight line.’”\n\nDon't Aproach Me\n\nWatch this video on YouTube Click to load video\n\nRemember Me? (featuring RBX and Sticky Fingaz) (2000)\n\nEminem nearly gets upstaged on his own song – a classic cut from his most critically acclaimed album, The Marshall Mathers LP. Over a dark and moody Dr. Dre beat, Death Row rapper RBX delivers a solid start before Onyx’s Sticky Fingaz answers with an explosive set of tongue-twisting bars. Ever the competitor, Eminem steps up to the challenge with a furiously inventive closing verse full of violence and comedy.\n\nDr. Dre: What’s The Difference (featuring Eminem and Xzibit) (1999)\n\nAnother stand-out track from Dre’s 2001, “What’s The Difference” is a classic example of the conversational back and forth that have made collaborations between the pair so richly rewarding. Dre and Eminem profess their feelings for each other in typically inimitable style… by offering to help murder their respective enemies.\n\nGo To Sleep (featuring DMX and Obie Trice) (2003)\n\nThe trio combine brilliantly on this vicious diss song as they fire a well-aimed range of lyrical shots at the numerous enemies Eminem had beef with at the time, most explicitly Ja Rule and Benzino.\n\nNo Love (featuring Lil Wayne) (2010)\n\nBoth Lil Wayne and Eminem are in imperious form on this Just Blaze-produced highlight from 2010’s Recovery album, spitting a series of aggressive rhymes over a cleverly re-worked sample of Haddaway’s 1993 techno-pop hit “What Is Love.”\n\nEminem - No Love (Explicit Version) ft. Lil Wayne\n\nWatch this video on YouTube Click to load video\n\nWalk On Water (featuring Beyoncé) (2017)\n\nReleased as a surprise single in advance of Revival, “Walk On Water” instantly earned its place among the best Eminem collaborations and provided an enticing taster of the slew of guest spots that light up his new album. Beyoncé supplies a winning gospel hook on a song that sees Eminem taking a reflective look on his past, when “… when I had the world by the balls/Eatin’ out my palm.”\n\nEminem - Walk On Water (Official Video)\n\nWatch this video on YouTube Click to load video\n\nLooking for more? Discover the best Eminem songs."}, {"url": "https://www.guitarworld.com/features/richard-williams-not-to-sound-pompous-but-kansas-pretty-much-gave-birth-to-american-prog-bands", "page_content": "Mention the band Kansas to the average listener, and he or she will instantly name two classic rock staples: Carry On Wayward Son and Dust in the Wind.\n\n“Oh, sure, those are the big ones,” says guitarist Richard Williams, who co-founded the progressive rock outfit back in 1970. “I could let it get to me and go, ‘Hey, we’ve got a whole body of work,’ but that would be a waste of time. Those are the songs that brought us to the table. Without Wayward Son and Dust in the Wind, we wouldn’t be around today.”\n\nWilliams recalls how in 1976, with the band deep in debt to their record label and facing an uncertain future after their first three albums (Kansas, Song for America and Masque) stiffed, they approached the recording of their fourth album, Leftoverture, with a sense of impending doom.\n\n“It was a pretty dark time. We were bleeding money pretty seriously,” he says. “We were signed to Kirshner Records, and our benefactor, Don Kirshner, could have easily said, ‘Guys, it’s been fun, but you need to find another record company.’ We needed a hit, and thank goodness we came up with Carry On Wayward Son. It saved us so we could go on. And then we had Dust in the Wind. Those songs exploded and our worlds changed forever.”\n\nKansas were in a unique position in the mid Seventies. Not only did they represent the last trace of progressive rock on AM playlists that were suddenly ruled by disco, but they were also one of the very few purveyors of American prog, period.\n\n“Not to sound pompous, but we pretty much gave birth to American prog bands,” Williams says. “What’s amazing is, we did it pretty sneakily. We were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material.\n\n“So we’d slip in one of our own tunes and tell the crowd that we were playing the B-side of Smoke on the Water. We’d stretch songs out and go crazy, and the people loved it. It became our thing.”\n\nWe were playing bars in Topeka, doing all the hits of the day – Motown, the British Invasion, all that – but we really wanted to do our own material\n\nOf the seven current members of Kansas, only Williams and drummer Phil Ehart remain from the original crew. Singer Steve Walsh, who ended his on-and-off association with the band in 2014, has been replaced by two co-lead vocalists, Billy Greer and Ronnie Platt, who double on bass and keyboards, respectively.\n\nWilliams’ longtime guitar foil Kerry Livgren, who also served as Kansas’ chief songwriter, split in 2000, and in his place is New Jersey picker Zak Rizvi.\n\n(Image credit: Paul Natkin/Getty Images)\n\n“It feels like a different band sometimes because we’ve got a bunch of newer faces,” Williams says, “but at the same time, it feels like the original band because we’ve got seven guys who really love to perform and create. Back in the day, we let money and business get in the way. This bunch of guys just wants to make music.”\n\nThe band has a new album out, 2020’s The Absence of Presence, and all told, it sounds like quintessential Kansas: there’s muscular, epic prog-rockers like Throwing Mountains and the eight-minute-plus title track, symphonic power ballads such as Jets Overhead and Memories Down the Line, and there’s even a “how-over-the-top-can-we-go?” instrumental in the form of Propulsion 1.\n\n“We’re kind of always in a state of having to prove ourselves,” Williams says. “We had to do it on our last album, [2016’s] The Prelude Implicit, because it was our first new music in 16 years, and I think this time we had to prove that we still mean it.”\n\nHe lets out a laugh, then adds, “I imagine on the next one, we’ll have to do the same thing. That’s OK – I’m used to it.”\n\nBefore the band got started, who were the guitar players that you were really listening to and emulating?\n\n“I was copying anybody who was there. The Yardbirds were pretty big to me. My introduction to blues wasn’t through the Americans; I dug the British guys. John Mayall and the Bluesbreakers, Eric Clapton – Clapton’s first solo album was like Guitar 101 to me.\n\n“Instead of this twangy rhythmic instrument, suddenly here’s this ballsy guitar with a guttural saxophone lead voice. Suddenly, I was hearing blues in a different way. Of course, I also loved Jimmy Page and Jeff Beck – those guys made a big impression on me. That stuff really formed the basis of my sound and style.“\n\nGrowing up in Topeka, was it easy for you to get good guitars living where you were?\n\n“Oh, yeah. I had Marshall amps and Les Pauls. I had a Gibson ES-335, which I still have to this day. Everything that you could buy in Los Angeles you could buy in Topeka. When I was 15, I had a charge account at the local music store. If I wanted something, I’d charge it and make weekly payments on it.\n\n“This was a pretty cool time. When The Beatles were on Ed Sullivan’s show, Topeka exploded, just like every other town in the country. Everybody had to be in a band. There was a garage band on every block.“\n\nKansas played covers in clubs for a few years. Do you remember when you first heard prog from England and when it started to influence the band?\n\n“It took a while. For a time it seemed as if only the two coasts were hearing the prog stuff. Gradually the stations in Kansas started playing it – I guess somebody’s ears were tuned to it. We’d be like, 'Wow, have you heard this band called ELP?' Or 'Have you heard Genesis’ Selling England by the Pound?'\n\n“It was very exciting to find all these new, creative ways of addressing rock ‘n’ roll. I don’t even know if 'rock ‘n’ roll' was the correct term for that music.“\n\nSome bands were resistant to chance, but we embraced it... We cut our teeth on rock ‘n’ roll. But we were looking to be different\n\nEven so, it didn’t seem as if American bands were jumping on the prog bandwagon. You guys were outliers.\n\n“Some bands were resistant to chance, but we embraced it. I mean, we played Mitch Ryder & the Detroit Wheels-type stuff; we cut our teeth on rock ‘n’ roll. But we were looking to be different. I remember playing cover songs during our club days. You’d get to a part and be like, 'Man, this song sucks. I hate the middle part.'\n\n“So we started thinking that we could do some sort of interlude at the beginning, or maybe we could play the song at half-time. We did anything to change it up and put some balls to the music. In hindsight, we were doing something very important: We were learning how to be us.“\n\n(Image credit: Dimitri Hakke/Redferns)\n\nDid it seem as if playing throughout your home state was a dead end? Did the band consider relocating to one of the two coasts to get noticed?\n\n“Well, what happened was, we made a demo tape, and that’s what we sent out to the coasts. One of them wound up on Don Kirshner’s desk. The people at Don’s company loved it – they really dug the violin – and they sent a guy named Wally Gold to check us out.\n\n“We put together a show and did that old free-beer trick: 'Come to the show and the drinks are free.' So Wally showed up and the place was packed; everybody was drunk and partying. So Wally called Don and said, 'Man, there’s something going on here. People are crawling through the windows to get in the place.' That sealed the deal. Next thing you know, we signed a deal with Don Kirshner and were making records.“\n\nLeftoverture [1976] and Point of Know Return [1977] hit one after the other. After being hitless for several years, that must have felt remarkable.\n\n”I’m still here today doing this because of that explosion. We didn’t really know how huge it was at the time. We were just blue-collar guys from the Midwest. I remember arriving at Madison Square Garden in a limo with our manager, and he was going, 'Madison Square Garden! This is so big!'\n\n”We were like, 'Yeah, yeah, whatever.' We’d been on the road for so long, so to us this was just a natural progression of more and more shows. Today I realize how big it was, but back then we didn’t really see it.”\n\nHow much of Carry On Wayward Son had Kerry written before the band got to dive into it? And how long did it take to work out that intricate guitar and keyboard solo section?\n\n“That was the last song we did for the album, on the final day or recording. Kerry came in and said he had a new song. We learned the structure of it and got to it. The version you hear on the record is probably the first time we ever played it correctly.\n\n“The solo thing didn’t take long. My approach to guitar is just wing it. I didn’t really have a planned solo. I just responded to what everybody else was doing and threw stuff out there. I was kind of like, 'I’ll just play stuff. Let me know if it sounds right.'“\n\nFor rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression\n\nThe acoustic guitar figure of Dust in the Wind is so recognizable. I understand that Kerry wrote it as a fingerpicking exercise.\n\n“Yeah, Kerry didn’t write the song to write a song; he wrote this chord pattern to teach himself fingerstyle guitar. His wife thought it was a song, and he was like, 'No, this isn’t Kansas. The band would never play this.' But he brought it in and we thought it was really nice.\n\n“The figure was there; it didn’t have the middle section or the violin solo. But it came together fast. I remember when we were listening back to it, somebody said, 'That’s the next single.' Kerry didn’t think so, but the rest of us knew. And sure enough – boom. The track exploded on the radio.“\n\nThe way you approached the solo section of Wayward Son – is that still the way you compose leads in the studio? I’m thinking of the title track of the new album, which has a similar solo structure.\n\n“It’s sort of the same. What happens is, somebody lays something down and everybody else plays off of it. It’s very collaborative, but not as instant as it was back in the day. Somebody else’s solo will dictate what you’re going to do, and you take inspiration from what they’ve done to go somewhere else.\n\n“It’s always fun to do it that way. I’ll lay down the foundation, and then Zak will play something; Tom will do a smoking keyboard part. Sometimes we redo our parts based on what somebody does.“\n\nThe riff in the song Throwing Mountains sounds as tough and mean as early grunge. Did any of that stuff ever make an impression on you?\n\n”Not really at first. I could appreciate the honesty of grunge. It’s like, I loved The Beatles for their polish, but I loved The Rolling Stones for their rawness. You listen to Bob Dylan – his recordings are very elementary, but they’re honest.\n\n”For rock, it’s always best if it’s not perfect. You need an edge to it. I think that’s one thing about Kansas that’s always been cool – we have that aggression. So you mention grunge and that song, sure, I’ll take that. It reminds me of how punk obliterated disco back in the day. Let’s get back to being raw.”\n\nHow are you enjoying playing live with Zak Rizvi?\n\n”Oh, I’m loving it. Zak has a deep love and knowledge of the band. He’s a tremendous engineer and guitarist – just brilliant musically. He’s a real scholar of music. Playing with him and having him in the band is great. There isn’t much he can’t play. I mean, he played trombone in a symphony. I have a blast working with him.”\n\nWhat was it like working with Steve Morse during his time in the band?\n\n”What an interesting guy! When he came in, he had just won every guitar award imaginable; they had to invent awards to give him. I’ll be honest: I was a little intimidated at first, but I was pleased to find out that he’s the least intimidating man around. He’s fascinated by everything.\n\n”We would be on tour, and we would see some crappy band playing at a Holiday Inn or wherever. We would be like, 'Let’s go. This band sucks.' But Steve would say, 'Did you see what that guitar player just did with his on/off switch?' The guitarist wasn’t even that good, but Steve was learning from him anyway.”\n\n﻿For a while you played PRS guitars, but I understand you’ve moved back to Les Pauls now.\n\n”I still play PRS guitars occasionally, but I got my hands on a Les Paul that blew me away. It’s one of the Lee Roy Parnell signature models – a reissue of the ’57 Goldtop – and it’s fabulous.\n\n”It’s got a support in the back of the headstock, so if it falls over it won’t break, and the heel has a cutaway so you can get up the neck a lot easier. I run that through a Fractal Axe-Fx III and I’m good to go. I used to have to spend hours getting tones. Now I can just dial in the sound, and boom – let’s play.”"}, {"url": "https://www.republicworld.com/entertainment-news/music/5-times-taylor-swift-collaborated-with-other-artists-as-a-songwriter.html", "page_content": "Taylor Swift has proved her songwriting prowess on countless occasions. The Love Story singer is known to write all of her songs and has won plenty of awards for the same. But apart from writing songs for her albums, Taylor Swift also lends a helping hand to fellow singers and songwriters. Find out below apart from her albums, for which other artists did Swift work as a songwriter.\n\n5 times Taylor Swift got the songwriter credits\n\n1. Little Big Town’s Better Man\n\nBetter Man is one of the most popular songs in the country band, Little Big Town’s discography. The song was a preview of their album Breaker and garnered critical acclaim and was loved by fans. Moreover, it won the Song of the Year award at the 2017 Country Music Awards. Soon the band members revealed that Swift sent them the song and were shocked by her gesture but thanked her for the same.\n\n2. Sugarland’s Babe\n\nTaylor Swift collaborated with country band Sugarland and produced the hit single, Babe. In an interview with Billboard, Sugarland’s Jennifer Nettles revealed that Swift was the one who reached out to them. Since they knew each other for a long time due to Taylor’s country roots this collaboration was inevitable. Taylor not only wrote the song but also gave her backing vocals and starred in the Babe music video.\n\n3. Calvin Harris ft. Rihanna’s This Is What You Came For\n\nCalvin Harris and Taylor Swift dated during Swift’s 1989 era. As the couple dated Taylor eventually co-wrote a song with the DJ titled This What You Came For. But she chose to write the song under the pseudonym Nils Sjoberg. After Taylor Swift and Calvin Harris broke up the song was already a hit amongst the masses. Soon, Swift’s representative revealed that the Grammy winner wrote the song under the pseudonym.\n\n4. Cats’ soundtrack Beautiful Ghosts\n\nTaylor Swift starred as Bombalurina in the 2019 film adaptation of the musical Cats. She then got to collaborate with the musical theatre maestro Andrew Lloyd Webber for Cats’ original soundtrack Beautiful Ghosts. In the film, the song is sung by Francesca Hayward, but Swift has also recorded a studio version of it.\n\n5. Olivia Rodrigo’s 1 step forward 3 steps back\n\nOlivia Rodrigo and Taylor Swift finally met for the first time at the BRIT Music Awards 2021. Apart from clicking pictures, Swift and Jack Antonoff have been given songwriting credits on Olivia Rodrigo’s debut album Sour. Taylor Swift’s last from the Reputation album New Year’s Day has been interposed on Rodrigo’s track 1 step forward 3 steps back. This songwriting credit has given fans hope that Swift and Rodrigo might soon collaborate for a new song in the future.\n\nIMAGE: TAYLOR SWIFT'S INSTAGRAM"}, {"url": "https://www.republicworld.com/entertainment-news/music/miley-cyrus-collaborations-with-other-artists-in-some-of-her-love-song.html", "page_content": "Miley Cyrus is an American singer who has recorded songs for many big productions. She first gained prominence with her portrayal of Hannah Montana in the popular TV series of the same name in 2006. Since then, she has acted in several movies and churned out hit songs. Miley Cyrus's name was also in the Time 100 list in both 2008 and 2014. She was named MTV's Artist of the Year in 2013. She was ranked 62nd on Billboard's Top 125 Artists of All Time list in 2019. Here we bring to you some of her best love songs in collaboration with other artists-\n\nAlso read | 5 Best Heartbreak Songs By The Weeknd You Must Add To Your Playlist\n\nMiley Cyrus' collaborations with other artists\n\nNeed a Little Love\n\nThis famous song from the 2010 TV show Hannah Montana. The guest artist featuring in this song were Sheryl Crow. This was a great collaboration between Miley Cyrus and Sheryl.\n\nReal and True\n\nReal and True song was a hit Miley Cyrus and Future collaboration. It was hip-hop rap on love genre song. The artist of this song was Future and this song was from the album Real and True. The song was released in 2013.\n\nAlso read | Mariah Carey's Best Christmas Songs That Are Ideal For Your 2019 Party\n\nDecisions\n\nThe popular song Decision was a collaboration between Miley Cyrus and Borgore. This song was from the album Decisions – EP and was released in 2012. It was a song from the genre of pop music and focused on the themes of love and dance.\n\nAlso read | 5 Taylor Swift Songs Written For Other Artists; From 'Better Man' To 'Babe'\n\nFall Down\n\nThe popular artist Will.i.am collaborated with Miley Cyrus for the Fall Down song. This song formed the album will power. It was a hit pop number, released in 2013. The singers got many nominations for the song.\n\nCome Get it Bae\n\nIn this song, Pharrell Williams collaborated with Miley Cyrus to make it a super hit. Miley Cyrus was a featured artist and was from the album Girl. It was released in the year 2014. It was a love song in the pop genre and was well-received by fans and critics upon its release.\n\nAlso read | Selena Gomez's 5 Songs That You Can Draw Insta-caption Inspirations From"}, {"url": "https://www.highsnobiety.com/p/takashi-murakamis-15-collaborations/", "page_content": "in Art Words By Chris Danforth\n\nThis article was republished on February 1 in recognition of Takashi Murakami's 60th birthday\n\nFew pop artists have ticked more boxes than Takashi Murakami. His resume includes the likes of fashion titans like Louis Vuitton and Vogue, iconic musicians Pharrell Williams and Kanye West, and some of the most coveted clothing labels from around the world, not limited to Supreme, COMME des GARÇONS and visvim. Aside from pioneering his own style of Japanese anime melded with pop culture artwork, Murakami is a staunch supporter of philanthropic causes, while he also manages the careers of several younger artists and organizes the biannual art fair GEISAI.\n\nCheck out 25 of Takashi Murakami's best collaborative projects below ahead of his upcoming work with French mineral water brand, Perrier.\n\nTakashi Murakami x Kid Cudi x Kanye West Kids See Ghosts Show\n\nKid Cudi teased a new animated show in collaboration with Kanye West in June of 2020. The teaser clip for the project, named after Cudi and Kanye's 2018 album, Kids See Ghosts, was directed by Murakami. The show finds Cudi voicing a fox, while Kanye voices a bear similar to the one used in promotion for his early albums.\n\nSupreme\n\nTakashi Murakami x Supreme Box Logo T-Shirt\n\nIn April 2020, Supreme released a special edition box logo tee featuring original artwork by Takashi Murakami. The artist's unmistakable flower motif was incorporated into Supreme's iconic box logo, making it a must-have. All proceeds from the T-shirt were given to HELP USA, an organization that supports vulnerable groups facing homelessness during COVID-19. The collaborative project raised over $1 million for charity.\n\nGrailed\n\nTakashi Murakami x Billie Eilish x Uniqlo T-Shirts\n\nThe artist's most recent collaboration with Uniqlo welcomed singer-songwriter Billie Eilish into the mix. The joint effort, inspired by Eilish's \"You Should See Me In A Crown\" music video, which Murakami also worked on, consisted of 12 T-shirts, including four children's options.\n\nStockX\n\nTakashi Murakami x Crocs Classic Clog\n\nMurakami's Crocs collaboration was released exclusively at ComplexCon in 2019. Inspired by his vibrant illustrative style, the Crocs were decorated in a multicolor camouflage, then featuring a teddy bear Jibbitz charm and his smiling daisy on the strap. The footwear was also adorned with a special graphic on the insole and outsole.\n\nTakashi Murakami x J Balvin Colores Album Artwork\n\nPrior to their collaboration, J Balvin had admittedly been wanting to work with Takashi Murakami for years. And seeing as the title of his fifth studio album was Colores, there was no better time to show color than through Murakami's signature flowers. In addition to the album artwork, Balvin and Murakami also teamed up on a range of Colores merch, consisting of T-shirts and hoodies.\n\nPORTER\n\nTakashi Murakami x PORTER FW19\n\nIn 2019, Murakami released a baggage collection with PORTER. The collaboration consisted of a rucksack, two-way helmet bag, and waist bag, each incorporating the artist's iconic flower motif. The eyes and smile were stitched into PORTER's signature green nylon, as PORTER branding patches were implemented throughout.\n\nOVO\n\nTakashi Murakami x OVO Hoodie\n\nOVO dropped a highly sought-after hoodie in collaboration with Takashi Murakami after Drake was first spotted in the garment. The artist's familiar flower motif was featured on the OVO owl on the front of the black pullover hoodie.\n\nGagosian\n\nTakashi Murakami x Virgil Abloh “AMERICA TOO” T-Shirt\n\nTakashi Murakami and Virgil Abloh teamed up for a joint exhibition in 2018, titled AMERICA TOO. Accompanying the artwork on display at the Gagosian in Beverly Hills was a limited edition T-shirt that released through the gallery's online shop. The tee featured design elements used on large-scale sculptures and paintings, and was priced at a whopping $369. Needless to say, all 500 units sold out.\n\nBillionaire Boys Club\n\nTakashi Murakami x Billionaire Boys Club Accessories\n\nOne of Murakami's numerous collaborations with Billionaire Boys Club, his 2018 accessory lineup drew from his “Superflat” style. Some of the artist's most recognizable works were recreated on cushions, keychains, and other playful goods, as his flowers and octopus incorporated multicolored designs.\n\nTakashi Murakami x Vault by Vans\n\nMurakami's Vans Vault collection from 2015 showcased two of the artist's recurring motifs in the smiling flower and skull patterns. Inspired by traditional Japanese art, anime, and pop culture, the collaboration included Murakami's favorite Vans silhouette, the classic Slip-On, as well as graphic T-shirts and skate decks.\n\n\"Last Night, Good Night (Re:Dialed)\" - Pharrell Williams Remix\n\nNaturally, a cartoon Pharrell wearing his signature Vivienne Westwood hat features amongst dancing robots and Sailor Moon-esque anime characters in this Murakami-powered video. Created in conjunction with Murakami's Jellyfish Eyes film, the music video is set to a remix of the movie's theme song \"Last Night, Good Night.\" The film highlights the Japanese artist's signature approach to colors and sheer, unadulterated imagination.\n\nTakashi Murakami\n\nTakashi Murakami x Damien Hirst x Lionel Messi\n\nWidely regarded as the most talented footballer of the modern age, FC Barcelona's Lionel Messi was overlayed on a circular backdrop of Murakami flowers, for an initiative that was aimed at providing educational opportunities for disadvantaged children in Asia. As a UNICEF ambassador, the Argentinian attacker featured on a wide range of works, which were auctioned at Sotheby’s in London.\n\nTakashi Murakami\n\nTakashi Murakami x Billionaire Boys Club \"JELLYFISH EYES\" T-Shirt\n\nAnother article that was rolled out for Murakami's Jellyfish Eyes film, this co-branded T-shirt alongside Billionaire Boys Club was most likely facilitated by longtime friend and collaborator Pharrell Williams. In place of the well-liked BBC graphics that we have seen season after season, one of Murakami's anime-inspired caricatures adorns the front of the tee.\n\nTakashi Murakami\n\nTakashi Murakami x Hajime Asaoka \"Death Takes No Bribe\" Tourbillon Watch\n\nIn 2013, Murakami put pen to paper with independent Japanese watchmaker Hajime Asaoka for a custom timepiece. Thematically, the phrase “Death Takes No Bribe\" served as the main inspiration for the project, which is characterized by dark flower and skull imagery in Murakami’s trademark style. The covetable watch made its premiere at the Academie Horlogere des Createurs Independants watch fair in Basel, Switzerland.\n\nTakashi Murakami\n\nTakashi Murakami x Kaws for Christie's\n\nRenowned as visual artists in their own rights, Takashi Murakami teamed up with Brian Donnely aka KAWS and Christie's auction house to raise funds for victims of the earthquake and tsunami that hit the northeastern part of Japan in 2011. Based around a Spongebob Squarepants motif, the piece was titled Kawsbob Enters the Strange Forest, and fetched a lofty hammer price of $155,000.\n\nTakashi Murakami\n\nTakashi Murakami x Google \"Solstice\"\n\nTo coincide with the summer solstice of 2011, Google's homepage was decorated with two different doodled courtesy of Takashi Murakami. Stylistically, the images reflected Murakami's concept of \"Superflat,\" which refers to an art movement that attempts to introduce the international art scene to Japanese artists, animators, cartoonists and more.\n\nTakashi Murakami for Macy's\n\nMacy’s Thanksgiving Day Parade in 2010 was the venue for several of Murakami's cartoon characters to come to life, when 30-foot-tall inflatable versions of Kaikai and Kiki - two of the most recognizable figures from Murakami's catalog - made their way down West 81st Street in Manhattan. What's more - Murakami himself joined in the parade, but not before throwing on a flower costume of his own design.\n\nTakashi Murakami\n\nTakashi Murakami x Britney Spears for POP Magazine\n\nA 2010 issue of British fashion imprint POP Magazine featured this mashup of Britney Spears and Takashi Murakami visuals. Although the publication is headquartered in the UK, the cover features a quintessentially Japanese style of imagery. Perhaps an unexpected choice for the \"Oops, I Did It Again\" songstress, yet the result was oddly memorable.\n\nTakashi Murakami\n\nTakashi Murakami x Casio G-SHOCK Frogman Watch\n\nFor art collectors that may be used to paying tens of thousands of dollars for a Murakami original, the price tag of this collaboration alongside G-SHOCK must have been a breath of fresh air. Limited to 300 pieces and originally retailing for around $4,000 when it dropped in 2010, the Frogman iteration came in a custom display case and featured the subtle use of Murakami graphics throughout.\n\nTakashi Murakami\n\nTakashi Murakami x Kirsten Dunst x McG \"Akihabara Majokko Princess\"\n\n2009's exhibition at London's Tate Modern museum, \"Pop Life: Art in a Material World,\" included a somewhat unexpected partnership between Takashi and Kirsten Dunst, who provided the vocals for a cover of \"Turning Japanese\" by the English new wave rock band The Vapors. The cover was included in a four-minute film directed by one of Hollywood's biggest commercial directors McG, while the video itself showed Dunst donning a blue wig and bright pink skirt.\n\nTakashi Murakami\n\nTakashi Murakami x Louis Vuitton\n\nCertainly one of the most prolific collaborations in Murakami's career, this project with Louis Vuitton saw Murakami graphics used on a range of Louis bags, while the highlight of the collaboration was arguably the range of custom Monogramouflage patterned pieces. With Marc Jacobs at the helm of the initiative, the collaboration was by-and-large a huge success for Louis Vuitton, as well as for Murakami, who was propelled further into the public eye.\n\nTakashi Murakami\n\nTakashi Murakami x Pharrell Williams \"The Simple Things\"\n\nFor Art Basel Miami, Murakami linked up once again with Pharrell, while the duo brought Jacob the Jeweller on board to produce a rather schizophrenic sculpture titled Simple Things. Crafted from glass fiber, steel, acrylic, wood, LED lights and various objects (a bottle of Heinz ketchup, a Billionaire Boys Club sneaker, a bag of Doritos and a cupcake) made of gold, set with rubies, sapphires, emeralds and diamonds, the illustrious sculpture never actually went on sale.\n\nTakashi Murakami\n\nTakashi Murakami x VISVIM KEIFER Hi-Suede \"Multi Flower\"\n\nAlthough it wasn't the only occasion that Murakami was tapped by visvim for a sneaker, this \"Multi Flower\" iteration of the VISVIM KEIFER Hi-Suede silhouette was produced circa 2008. As per Murakami's modus operandi, a floral pattern dominates the upper of the hi-top sneaker, which also spills over onto the tongue.\n\nTakashi Murakami\n\nTakashi Murakami x Supreme Skate Decks\n\nSupreme has a penchant like none other for picking the best and brightest collaborative partners. In 2007, Takashi Murakami joined the ranks of Todd James, Peter Saville, Larry Clark, Roy Lichtenstein and other artists who have collaborated with the legendary New York-based brand. A total of three decks were released, once again utilizing the anime-inspired characters from Murakami's past archive of works.\n\nTakashi Murakami\n\nTakashi Murakami x Vogue x COMME des GARÇONS\n\nIn 2009, Takashi Murakami linked up with Vogue Nippon and COMME des GARÇONS to produce materials for a Tokyo-based pop-up shop. One of Murakami's signature characters was worked into a limited T-shirt, which was cooked up to celebrate the opening of the so-called “Magazine Alive” store, which at the time purveyed goods from UNDERCOVER and Maison Margiela, as well as goods bearing manga likenesses of Hedi Slimane, Marc Jacobs, and Donatella Versace."}, {"url": "https://www.hitc.com/en-gb/2021/08/29/donda-tracklist-features/", "page_content": "Kanye West’s long-awaited album, Donda, is officially here as of August 29th, 2021. The rapper has collaborated with many different artists on his 10th studio album. Here’s a look at the tracklist and features on Donda…\n\nFrom Through The Wire to Homecoming, Jesus Walks to Stronger, Kanye West has had many hits in his time. The rapper has collaborated with tonnes of talented artists, too, including Coldplay’s Chris Martin, Jay-Z, Twista, Jamie Foxx and many more.\n\nPhoto by Taylor Hill/FilmMagic,\n\nDonda tracklist\n\nA year since it was first promised, Donda is officially released and the tracklist is available on platforms such as YouTube and Spotify.\n\nThe 27-song tracklist is as follows:\n\nDonda Chant Jail God Breathed Off the Grid Hurricane Praise God Jonah Ok Ok Junya Believe What I Say 24 Remote Control Moon Heaven and Hell Donda Keep My Spirit Alive Jesus Lord New Again Tell the Vision Lord I Need You Pure Souls Come to Life No Child Left Behind Ok Ok, Pt. 2 Junya, Pt. 2 Jesus Lord, Pt. 2\n\nWhich artists feature on Donda?\n\nThrowing it right back to Kanye’s early days, Syleena Johnson, who was featured on All Falls Down back in 2004, is featured on Ye’s 10th album on the first track called Donda Chant.\n\nAs well as Syleena, the following artists feature on Donda:\n\nHappier Than Ever: A Love Letter to LA | Official Trailer | Disney+ BridTV 4472 Happier Than Ever: A Love Letter to LA | Official Trailer | Disney+ https://i.ytimg.com/vi/RKWQ2Pce74k/hqdefault.jpg 851115 851115 center 13872\n\nIs Donda available on Spotify?\n\nNow that Donda has been released, Kanye fans can get stuck in to his new music.\n\nThe father-of-four’s album is available to listen to via Apple Music and Spotify.\n\nListen to the full 27-song-track-list here.\n\nSome changes have been made prior to the album’s release such as the inclusion of Jay-Z on Track 2, Jail, over DaBaby."}]}