{"From 2009 to 2013, Guðlaugur Þór Þórðarson was Minister of Fisheries and from 2013 to 2017, he was Minister of Finance.": [{"url": "https://www.althingi.is/altext/cv/en/?nfaerslunr=33", "page_content": "Parliamentary career\n\nMember of Althingi for the Reykjavík North Constituency 2003–2009, for the Reykjavík South Constituency 2009–2016 and for the Reykjavík North Constituency since 2016 (Independence Party).\n\nParty group\n\nChair of the Independence Party's parliamentary group 2016–2017.\n\nDeputy Chair of the Independence Party's parliamentary group 2013–2016 and 2005–2007.\n\nPrevious committees\n\nMember of the Budget Committee 2016–2017 and 2013–2016 (1st Deputy Chair 2013–2016).\n\nMember of the Foreign Affairs Committee 2013–2014.\n\nMember of the Economic Affairs and Trade Committee 2011–2013.\n\nMember of the Health Committee 2009–2011.\n\nMember of the Trade Committee 2009–2011.\n\nMember of the Environment Committee 2003–2007 (Chair 2004–2007).\n\nMember of the Fisheries Committee 2003–2007.\n\nMember of the Social Affairs Committee on 2003–2006 (Deputy Chair 2003–2006).\n\nMember of the EU-Iceland joint Parliamentary Committee 2013–2016 (Chair 2013–2016).\n\nMember of the Icelandic delegation to the EFTA and EEA Parliamentary Committees 2013–2016 (Chair 2013–2016).\n\nMember of the Icelandic delegation to the EFTA Parliamentary Committee 2003–2007 (Chair 2005–2007).\n\nMinisterial career\n\nMinister of the Environment, Energy and Climate since 2021.\n\nMinister for Foreign Affairs and International Development Cooperation 2019–2021.\n\nMinister for Foreign Affairs and External Trade 2017–2019.\n\nMinister of Health and Social Security 2007–2009.\n\nPolitical party career\n\nMember of Reykjavík City Council 1998–2006. Member of the Board of The Consumers Association of Iceland 2004–2006. Deputy Chair of the International Young Democrat Union, IYDU, 1998–2002. Chair of the Independence Partys Committiee on Trade 1997. Member of the Board of Democrat Youth Community of Europe, DEMYC, 1997–2001. Member of the Executive Board of the Independence Party 1993–1997. Member of the Central Board of the Independence Party 1991–1997. Chair of the National Youth Organization of the Independence Party 1993–1997."}, {"url": "https://www.government.is/diplomatic-missions/embassy-article/2020/09/29/Speech-at-the-75th-United-Nations-General-Assembly-by-H.E.-Mr.-Gudlaugur-Thor-Thordarson-Minister-for-Foreign-Affairs-and-Development-Cooperation/", "page_content": "75 United Nations General Assembly\n\nSpeech by\n\nH.E. Mr. Guðlaugur Þór Þórðarson\n\nMinister for Foreign Affairs and Development Cooperation of Iceland\n\nMr President, Excellencies, ladies, and gentlemen,\n\n\n\nLet me start by thanking the UN Secretary-General, for his leadership in these difficult times. I also express gratitude to the dedicated staff of this organization, often working in very challenging circumstances, for their commitment and courage.\n\n\n\nThe international community comes together for the 75th anniversary of the United Nations under exceptional circumstances - amid a global crisis.\n\n\n\nIceland is fully committed to support the global response to the COVID-19 pandemic. We have contributed to the Global Humanitarian Response Plan, to the UN Response and Recovery Fund and to several other initiatives, including the development, distribution, and fair and equal access to a possible vaccine for every country.\n\n\n\nThis crisis will have long-term implications for our economies and societies, pushing millions of peoples further behind, not least the most vulnerable. We must, therefore, redouble our collective efforts and pursue the Sustainable Development Goals with vigour.\n\n\n\nMr. President,\n\n\n\nThe pandemic has revealed that our fate is interlinked with the successes and failures of others. This very same revelation brought the founders of this great organisation together in 1945, after having lived through the horrors of two world wars. They understood then, as we must now, that we are stronger together than apart.\n\n\n\nThis notion is evident to a small state like Iceland, but larger states also gain from a well-functioning international rules-based order: peace, prosperity and partnerships for our people and planet. For the gravest challenges we face today can only be addressed collectively.\n\n\n\nThe current situation provides us with a perspective. Even if we still have a long way to go, we have witnessed significant achievements over the past 75 years. States have gained their independence, women have gained agency, more parents see their children grow up to become healthy adults, and millions have risen from poverty. Wild polio has recently been eradicated in Africa, a welcome sign of hope in the context of today’s challenges. By most measures, we have been living in times of unprecedented prosperity, something we now know, should not be taken for granted.\n\n\n\nIt is critical that we fight to maintain and improve the multilateral system and oppose/question those who seek to undermine it. We must ensure that our institutions, actions and tools are fit for purpose – so that the system can continue to serve all of us. The Secretary-General's ongoing reform agenda has our full support.\n\n\n\nMr. President,\n\n\n\nThe greatest challenge of our time can only be addressed through joint efforts. Climate action needs to be at the heart of our efforts as we build back better and greener after the pandemic. The Paris Agreement is the global baseline, and Iceland is fully committed to its implementation. To build back greener, we need to make full use of science, innovation, and positive financial stimulus for the full participation of the private sector.\n\n\n\nIceland's new climate action plan, released earlier this summer, goes even further than was agreed in Paris. Our goal is to achieve 35% reduction in greenhouse gas emissions by 2030 and full carbon neutrality by 2040.\n\n\n\nSustainable management of natural resources and the use of renewable energy will be instrumental if we are to combat climate change. That includes the sustainable use of our oceans, a major carbon sink, continuously threatened by climate change, pollution, and mismanagement. Here, international law, namely the Law of the Sea, provides the foundation for action that should be based firmly in science. Iceland will continue to share its expertise in these fields through our development cooperation, public-private partnerships and our capacity-building programs, run under the auspices of UNESCO.\n\n\n\nMr. President,\n\n\n\nAs we embark on a Decade of Action, we need to be firmly focused on advancing gender equality - not only as a fundamental human right - but also as critical for accelerated progress so that individuals and nations can prosper and reach their full potential. The slow progress on Sustainable Development Goal 5 on gender equality is therefore deeply worrying, not least as we risk losing a generation or more of gains due to the current crisis.\n\n\n\nWe must act now to ensure the full and equal participation of women in economic and political life, access to education, essential health services, and fight against sexual and gender-based violence. Iceland is therefore committed to contributing in a meaningful way as a co-leader of the Generation Equality Action Coalition on gender-based violence.\n\n\n\n\n\nMr. President,\n\n\n\nGrowing nationalism, racism, religious intolerance, and homophobia will continue to undermine human rights and fundamental freedoms if we do not fight to reverse this trend. It is of major concern when the most powerful are ambivalent, even hostile, to the enjoyment of universal human rights by all. UN Members States must speak up and act when human rights are set aside or violated, and not hesitate to use the legal, economic, and political tools we have at our disposal.\n\n\n\nIn the past year, I have had the honour to meet many brave women and men who risk their life and freedom to call out their governments for violation of human rights and fundamental freedom. It is our duty to support and protect these human rights defenders and allow their voices to be heard. We must also protect media freedom, which has come under grave threat in too many countries around the world. Human rights underpin democratic and prosperous societies – which in turn are the fundamental basis for international stability and peace.\n\n\n\nAs a member of the UN Human Rights Council in 2018 and 2019, Iceland made an effort to demonstrate that all nations, also the smallest among us, can use their voice effectively to speak out for those suppressed or silenced. The experience was both encouraging and empowering, since most UN Member States belong to that group of smaller or mid-size countries.\n\n\n\nThe Human Rights Council is not without faults and shortcomings. We have been critical of the Council’s membership, and the apparent desire by those with less than stellar human rights records to consistently undermine the integrity of the Council. We have also pushed for reform of the council and its working methods.\n\n\n\nMember States serving on the Council should never lose sight of its main mission and purpose – to protect and promote universal human rights. They should call out violators and hold them accountable and be open to constructive criticism and cooperation, rather than seek refuge behind rhetoric of politicization.\n\n\n\nWith this in mind, and on the basis of the experience of our recent membership of the Human Rights Council, Iceland has decided to run for a seat on the Council for the term 2025-2027.\n\n\n\nMr President\n\n\n\nLet me thank the Secretary-General for his leadership in calling for a global ceasefire; a call which all nations should support, not least those that hold power to influence the situation on the ground.\n\n\n\nThe ongoing efforts to find political and peaceful solutions to the crisis in Syria, Yemen, and Libya must continue with full backing of those involved. The Middle East Peace Process also needs to be reinvigorated as the current stagnation on both sides only serves to deepen existing disagreements, moving us further away from the two-state solution.\n\n\n\nCloser to my own place of home, in Europe, the persistent unlawful violation by Russia of the sovereignty and territorial integrity of Ukraine and Georgia continues to undermine peace and stability, and recent developments in Belarus give cause for major concern.\n\n\n\nThe Security Council carries special responsibilities for the maintenance of international peace and security on behalf of the wider UN membership. The Council, not least some of its permanent members, need to act in accordance with the UN charter, instead of being motivated by narrow political gains in a zero-sum game, undermining the credibility of this vital body.\n\n\n\n\n\nMr President,\n\n\n\n\"The UN was not created to take mankind into paradise but rather to save humanity from hell\", former Secretary-General Dag Hammarskjöld famously once said.\n\n\n\nAs we celebrate the 75th Anniversary of the United Nations, we should be mindful that this organization has been a catalyst for human development and progress. And it is the most significant peace project of our times.\n\n\n\nThe UN remains the only international body equipped to bring together different nationalities, political ideologies, and religions, for the common good.\n\n\n\nIts shortcomings can neither serve as an excuse for disengagement nor for the promotion of national interests above the pursuit of our common wellbeing and prosperity.\n\n\n\nToo many seek to apply the principles and values of the UN Charter selectively, tilting the balance between rights and responsibilities – in international trade, rule of law, human rights, disarmament and in preventing conflicts and atrocities.\n\n\n\nOur organisations and institutions should never serve or shelter those who seek to undermine the basic principles of the international rule-based order, which we have all subscribed to, including the UN Charter and the Universal Declaration of Human Rights.\n\n\n\nIt remains, that what we see is our own making. That is why, we need to use the current crisis and the 75th anniversary to reinvigorate our cooperation, build trust and make our institutions more effective and resilient, for today and tomorrow.\n\n\n\nWe should reconfirm our commitment to the principles of the UN Charter, international law, and the liberal international order.\n\n\n\nWe should stand up for these principles when they are being pushed aside.\n\n\n\nWe should make our institutions more open, transparent, and inclusive.\n\n\n\nWe should reform, not rewrite or retreat.\n\nFor only together we can build the future we want, and the UN we need.\n\nPre-recorded statement"}, {"url": "https://commons.wikimedia.org/wiki/Category:Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "Position held\n\nMember of the 2016-2017 Parliament of Iceland (2016–)\n\nMember of the 2013-2016 Parliament of Iceland (2013–2016)\n\nMember of the 2009-2013 Parliament of Iceland (2009–2013)\n\nMinister of Health (2007–2009)\n\nMinister for Foreign Affairs and International Development Cooperation (2017–2021)\n\nMember of the 2017–2021 Parliament of Iceland\n\nMember of the 2021– Parliament of Iceland (2021–)\n\nMinister for the Environment, Energy and Climate (2021–)"}, {"url": "https://www.fmprc.gov.cn/mfa_eng/wjb_663304/zwjg_665342/zwbd_665378/202305/t20230511_11075362.html", "page_content": "Ambassador He Rulong met with Mr. Guðlaugur Þór Þórðarson, Minister of the Environment, Energy and Climate of Iceland on May 9th.\n\nAmbassador He said that China attaches great importance to green and low-carbon development. The development and utilization of renewable energy such as geothermal is the highlight of bilateral cooperation between China and Iceland. China is willing to further strengthen cooperation in this field with a view to injecting new impetus to the development of China-Iceland relations.\n\nMinister Þórðarson welcomed Ambassador He by saying that Iceland and China have broad prospects for cooperation in geothermal and other renewable energy fields. He is willing to further promote bilateral cooperation in environmental protection and climate change."}, {"url": "https://www.norden.org/en/person/gudlaugur-thor-thordarson", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}, {"url": "https://icelandmonitor.mbl.is/news/politics_and_society/2021/11/29/new_government_of_iceland_takes_office/", "page_content": "The new government, at Bessastaðir. Photo/Árni Sæberg\n\nA new government took office in Iceland yesterday, Morgunblaðið reports. Just like the previous government, it is a tri-party coalition of the Independence Party, the Progressive Party and the Left-Greeen Movement, headed by Katrín Jakobsdóttir.\n\nTwelve ministers make up the new government, instead of 11 before. Ten of the ministers in the new government were part of the previous one. The new ministers are Jón Gunnarsson, from the Independence Party, who will serve as minister of justice, and Willum Þór Þórsson, from the Progressive Party, who will serve as minister of health.\n\nMembers of the new government at Bessastaðir, the presidential residence, along with President of Iceland Guðni Th. Jóhannesson. mbl.is/Árni Sæberg\n\nMinisters from the Left-Green Movement are as follows:\n\nKatrín Jakobsdóttir continues to serve as prime minister.\n\nSvandís Svavarsdóttir , formerly minister of health, will serve as minister of fisheries and agriculture.\n\nGuðmundur Ingi Guðbrandsson , formerly minister for the environment, will serve as minister of social affairs and the labor market.\n\nThe Progressive Party , which gained support in the September elections, will be in charge of one additional ministry, compared with the previous government:\n\nSigurður Ingi Jóhannsson , the party leader, will be minister of infrastructure.\n\nLilja Dögg Alfreðsdóttir , formerly minister for education, will be minister of tourism, trade and culture.\n\nÁsmundur Einar Daðason will serve as minister of education and children’s affairs.\n\nWillum Þór Þórsson will serve as minister of health, as stated above.\n\nFive ministries will be in the hands of the Independence Party .\n\nBjarni Benediktsson will continue to serve as minister of finance and economic affairs.\n\nGuðlaugur Þór Þórðarson , formerly minister of foreign affairs, will serve as minister for the environment, energy and climate.\n\nÞórdís Kolbrún R. Gylfadóttir will serve as minister of foreign affairs and international development cooperation.\n\nÁslaug Arna Sigurbjörnsdóttir , formerly minister of justice, will serve as minister of science, industry and innovation.\n\nAs stated above, Jón Gunnarsson will serve as minister of the interior, but no more than 18 months from now, the plan is for Guðrún Hafsteinsdóttir to replace him."}, {"url": "http://is.china-embassy.gov.cn/eng/zbgx/202305/t20230510_11074195.htm", "page_content": "Ambassador He Rulong met with Mr. Guðlaugur Þór Þórðarson, Minister of the Environment, Energy and Climate of Iceland on May 9th.\n\n\n\n\n\n\n\n\n\nAmbassador He said that China attaches great importance to green and low-carbon development. The development and utilization of renewable energy such as geothermal is the highlight of bilateral cooperation between China and Iceland. China is willing to further strengthen cooperation in this field with a view to injecting new impetus to the development of China-Iceland relations.\n\nMinister Þórðarson welcomed Ambassador He by saying that Iceland and China have broad prospects for cooperation in geothermal and other renewable energy fields. He is willing to further promote bilateral cooperation in environmental protection and climate change.\n\n\n\n"}, {"url": "https://www.wef.org.in/gudlaugur-thor-thordarson/", "page_content": "Hon’ble Minister Guðlaugur Þór Þórðarson Minister for foreign affairs, Iceland Iceland\n\nParliamentary career\n\n• Member of Althingi for the Reykjavík North Constituency 2003-2009, for the Reykjavík South Constituency 2009-2016 and for the Reykjavík North Constituency since 2016.\n\nParty group\n\n• Chairman of the parliamentary group of the Independence Party 2016-2017.\n\n• Deputy Chairman of the parliamentary group of the Independence Party 2013-2016 and 2005-2007.\n\nCommittee work\n\n• 1st Deputy Chairman of the Budget Committee 2013-2016\n\n• Member of the Icelandic Delegation to the EFTA and EEA Parliamentary Committees 2013-2016 (Chairman 2013-2016) and 2003-2007 (Chairman 2005-2007).\n\n• Member of the EU-Iceland joint Parliamentary Committee 2013-2016 (Chairman 2013-2016)\n\n• Member of the Foreign Affairs Committee 2013-2014.\n\n• Member of the Economic Affairs and Trade Committee 2011-2013.\n\n• Member of the Health Committee 2009-2011.\n\n• Member of the Trade Committee 2009-2011.\n\n• Member of the Environment Committee 2003-2007 (Chairman 2004-2007).\n\n• Member of the Fisheries Committee 2003-2007.\n\n• Member of the Social Affairs Committee on 2003-2006 (Deputy Chairman 2003-2006).\n\nMinisterial Career\n\n• Minister of Health and Social Security 2007-2009.\n\nEducation\n\n• Bachelor of Arts in Political Science. University of Iceland 1996\n\nPersonal\n\n• Born 19 December 1967. Married with four children."}, {"url": "https://www.wef.org.in/honble-minister-gudlaugur-thor-thordarson/", "page_content": "Hon’ble Minister Guðlaugur Þór Þórðarson Minister for foreign affairs, Iceland Iceland\n\nParliamentary career\n\n• Member of Althingi for the Reykjavík North Constituency 2003-2009, for the Reykjavík South Constituency 2009-2016 and for the Reykjavík North Constituency since 2016.\n\nParty group\n\n• Chairman of the parliamentary group of the Independence Party 2016-2017.\n\n• Deputy Chairman of the parliamentary group of the Independence Party 2013-2016 and 2005-2007.\n\nCommittee work\n\n• 1st Deputy Chairman of the Budget Committee 2013-2016\n\n• Member of the Icelandic Delegation to the EFTA and EEA Parliamentary Committees 2013-2016 (Chairman 2013-2016) and 2003-2007 (Chairman 2005-2007).\n\n• Member of the EU-Iceland joint Parliamentary Committee 2013-2016 (Chairman 2013-2016)\n\n• Member of the Foreign Affairs Committee 2013-2014.\n\n• Member of the Economic Affairs and Trade Committee 2011-2013.\n\n• Member of the Health Committee 2009-2011.\n\n• Member of the Trade Committee 2009-2011.\n\n• Member of the Environment Committee 2003-2007 (Chairman 2004-2007).\n\n• Member of the Fisheries Committee 2003-2007.\n\n• Member of the Social Affairs Committee on 2003-2006 (Deputy Chairman 2003-2006).\n\nMinisterial Career\n\n• Minister of Health and Social Security 2007-2009.\n\nEducation\n\n• Bachelor of Arts in Political Science. University of Iceland 1996\n\nPersonal\n\n• Born 19 December 1967. Married with four children."}]}