{"Guðlaugur Þór Þórðarson was re-elected in 2007 and 2013.": [{"url": "https://icelandmonitor.mbl.is/news/politics_and_society/2022/11/07/benediktsson_gets_a_decicive_lead_to_chair_the_inde/", "page_content": "Bjarni Benediktsson continues to be the chairman of the Independence Party. mbl.is/Eggert Jóhannesson\n\nBjarni Benediktsson, Minister of Finance and Economic Affairs, got 59 percent of the votes for the leading position in the Independence Party whereas his challenger, Guðlaugur Þór Þórðarson, the Minister of Environment, Energy and Climate, got 40% of the votes. The party held its 44th National Convention last weekend with record attendance in Laugardalshöll in Reykjavík. Benediktsson received 1010 out of total 1712 votes cast whereas Þórðarson received 687 votes. Blank and void bills were 9 and others received 3 votes.\n\nA surprise challenge\n\nIt was only a few days before the meeting that Þórðarson announced his intention of challenging Benediktsson for the leadership role and it caused quite a stir in the party. It was widely thought that Þórðarson had been planning this move for up to two months, although it was only revealed shortly before the National meeting.\n\nBjarni Benediktsson and his wife, Þóra Margrét Baldvinsdóttir. mbl.is/Eggert Jóhannesson\n\n\"I'm in on it\"\n\n“When you say, ‘Let’s do better, let’s go further and jump a step higher,’ I say, ‘I’m in on it!’ ” said Bjarni when addressing party members once his win was secured and announced shortly after lunchtime on Sunday.\n\nBjarni has chaired the Independence Party since 2009, having succeeded Geir H. Haarde in his time.\n\nHe has been re-elected as chairman five times since then, at the party's national conferences, and this is therefore the sixth time. He has now been re-elected five times, and has had better representation on all occasions.\n\nBjarni Benediktsson and Guðlaugur Þór Þórðarson. Composition image\n\n\n\n\n\nFocusing on the results\n\nGuðlaugur Þór announced his candidacy on October 30th, or less than a week before the National Convention. It had become clear who would have a seat at the meeting. The last few days, the heat was turning up in the competition with supporters of each of the two candidates exchanging accusations of bad practices from the other.\n\nFew of the country's political scientists dared to predict the outcome, and it was widely assumed that a group of people would only make up their minds at the convention, after the end of each candidate's respective speeches.\n\nTurn defence into offense\n\nÞórðarson emphasized that the Independence Party must turn defense into a new offense, accusing the current leadership of having lost faith in the fact that it was a possibility. Benediktsson again pointed to the fact that party members were looking at the society that had been successfully created during the Independence Party’s leadership and its steady hand in government.\n\nDelivering results\n\n“I have always focused on delivering results for people, but this challenge shines a light on areas we can improve on, like being more active in listening to all the voices in the party,” said Benediktsson to mbl.is after the results were clear.\n\nÞórdís Kolbrún R. Gylfadóttir Minister of Foreign Affairs was elected vice chairman of the Independence Party. mbl.is/Eggert Jóhannesson\n\n“We need to heed to the call to continue the conversation but it is my belief that it is our good results and ongoing plans to continue delivering results that secured this win.”\n\nMembers of the party must be a team\n\n- Þórðarson got a fairly good vote, do you see that you’ll be doing a lot of work to re-unify the party after this election?\n\n\"On my part, I see us coming together and becoming one team, so I don't have any major concerns about it at this point.\"\n\n- So you have no concerns about the approximately 600 votes?\n\nVilhjálmur Árnason was elected the Secretary of the Independence Party. mbl.is/Eggert Jóhannesson\n\n“No, I mean Þórðarson got three thousand votes in a runoff election just over a year ago. He is leading the party in Reykjavik, which is of course a key constituency at the national level, and that’s why it was always expected that he had some group of supporters here at the meeting, but I think it was a decisive victory.”\n\nAsked what he takes with him from this experience of the National Convention, Bjarni says he feels the great will of all party members to participate and be active in the party.\n\nWill this change Þórðarson's position in the party?\n\n\"Everybody is willing to contribute. People come here because they are interested in political issues and the political process and they are concerned with their community. We need to mobilise that interest finding a platform for it and a way forward.”\n\n- Will these results have any consequences for Þórðarson within the party?\n\n\"No, I'm not thinking about any of that right now at this point. I'm just happy with the result.\"\n\n-How will you celebrate your victory?\n\n\"With all my best people, all the people who have been supporting me. My family has something planned.”\n\n\n\n"}, {"url": "https://www.althingi.is/altext/cv/en/?nfaerslunr=33", "page_content": "Parliamentary career\n\nMember of Althingi for the Reykjavík North Constituency 2003–2009, for the Reykjavík South Constituency 2009–2016 and for the Reykjavík North Constituency since 2016 (Independence Party).\n\nParty group\n\nChair of the Independence Party's parliamentary group 2016–2017.\n\nDeputy Chair of the Independence Party's parliamentary group 2013–2016 and 2005–2007.\n\nPrevious committees\n\nMember of the Budget Committee 2016–2017 and 2013–2016 (1st Deputy Chair 2013–2016).\n\nMember of the Foreign Affairs Committee 2013–2014.\n\nMember of the Economic Affairs and Trade Committee 2011–2013.\n\nMember of the Health Committee 2009–2011.\n\nMember of the Trade Committee 2009–2011.\n\nMember of the Environment Committee 2003–2007 (Chair 2004–2007).\n\nMember of the Fisheries Committee 2003–2007.\n\nMember of the Social Affairs Committee on 2003–2006 (Deputy Chair 2003–2006).\n\nMember of the EU-Iceland joint Parliamentary Committee 2013–2016 (Chair 2013–2016).\n\nMember of the Icelandic delegation to the EFTA and EEA Parliamentary Committees 2013–2016 (Chair 2013–2016).\n\nMember of the Icelandic delegation to the EFTA Parliamentary Committee 2003–2007 (Chair 2005–2007).\n\nMinisterial career\n\nMinister of the Environment, Energy and Climate since 2021.\n\nMinister for Foreign Affairs and International Development Cooperation 2019–2021.\n\nMinister for Foreign Affairs and External Trade 2017–2019.\n\nMinister of Health and Social Security 2007–2009.\n\nPolitical party career\n\nMember of Reykjavík City Council 1998–2006. Member of the Board of The Consumers Association of Iceland 2004–2006. Deputy Chair of the International Young Democrat Union, IYDU, 1998–2002. Chair of the Independence Partys Committiee on Trade 1997. Member of the Board of Democrat Youth Community of Europe, DEMYC, 1997–2001. Member of the Executive Board of the Independence Party 1993–1997. Member of the Central Board of the Independence Party 1991–1997. Chair of the National Youth Organization of the Independence Party 1993–1997."}, {"url": "https://www.mfa.gov.cn/eng/wjb_663304/zwjg_665342/zwbd_665378/202305/t20230511_11075362.html", "page_content": "Ambassador He Rulong met with Mr. Guðlaugur Þór Þórðarson, Minister of the Environment, Energy and Climate of Iceland on May 9th.\n\nAmbassador He said that China attaches great importance to green and low-carbon development. The development and utilization of renewable energy such as geothermal is the highlight of bilateral cooperation between China and Iceland. China is willing to further strengthen cooperation in this field with a view to injecting new impetus to the development of China-Iceland relations.\n\nMinister Þórðarson welcomed Ambassador He by saying that Iceland and China have broad prospects for cooperation in geothermal and other renewable energy fields. He is willing to further promote bilateral cooperation in environmental protection and climate change."}, {"url": "http://is.china-embassy.gov.cn/eng/zbgx/202305/t20230510_11074195.htm", "page_content": "Ambassador He Rulong met with Mr. Guðlaugur Þór Þórðarson, Minister of the Environment, Energy and Climate of Iceland on May 9th.\n\n\n\n\n\n\n\n\n\nAmbassador He said that China attaches great importance to green and low-carbon development. The development and utilization of renewable energy such as geothermal is the highlight of bilateral cooperation between China and Iceland. China is willing to further strengthen cooperation in this field with a view to injecting new impetus to the development of China-Iceland relations.\n\nMinister Þórðarson welcomed Ambassador He by saying that Iceland and China have broad prospects for cooperation in geothermal and other renewable energy fields. He is willing to further promote bilateral cooperation in environmental protection and climate change.\n\n\n\n"}, {"url": "https://wiki2.org/en/Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nIcelandic politician\n\nGuðlaugur. This is an Icelandic name . The last name is patronymic , not a family name ; this person is referred to by the given name\n\nGuðlaugur Þór Þórðarson ( Icelandic pronunciation: ​ [kvʏðlœiɣʏr̥ θouːr̥ θourðar̥son]; born 19 December 1967) is an Icelandic politician who has been serving as Minister for the Environment, Energy and Climate since 28 November 2021.[1]\n\nEarly life and education\n\nGuðlaugur Þór Þórðarson graduated with a BA degree in Political Sciences from the University of Iceland in 1996.[2]\n\nPolitical career\n\nGuðlaugur started his involvement in the Independence party in 1987 when he was elected on the board of the National Youth Organisation of the Independence Party in which he served until 1997 of which he was vice chairman 1989–1993 and chairman 1993–1997. He was then elected on the Reykjavík City Council in 1998 and sat two four-year terms there. He sat on the parliamentary committee on welfare issues 2003–2006, the committee on fisheries 2003–2007, and the committee on the environment 2003–2007 (chairman 2004–2007).[citation needed]\n\nHe has been a member of the Althing (Iceland's parliament) for the Independence Party since 2003 and served as the Minister of Health from 24 May 2007 to 1 February 2009.\n\nGuðlaugur represented Reykjavík North 2003–2009, then switched to Reykjavík South for the 2009 elections before returning to Reykjavík North in 2013, where he has topped the party list for the last three elections. In the party primary in 2006 he defeated then Minister of Justice and Ecclesiastical Affairs Björn Bjarnason for the top spot in Reykjavík North.\n\nHe has served as Minister for Foreign Affairs since 11 January 2017.[citation needed]\n\nGuðlaugur opposes Icelandic membership of the European Union.[3][4] He is strongly supportive of Iceland's membership of the European Economic Area, describing the benefits as substantial.[5][6]\n\nPersonal life\n\nHe is married and has four children.[2]\n\nSee also\n\nReferences"}, {"url": "https://commons.wikimedia.org/wiki/Category:Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "Position held\n\nMember of the 2016-2017 Parliament of Iceland (2016–)\n\nMember of the 2013-2016 Parliament of Iceland (2013–2016)\n\nMember of the 2009-2013 Parliament of Iceland (2009–2013)\n\nMinister of Health (2007–2009)\n\nMinister for Foreign Affairs and International Development Cooperation (2017–2021)\n\nMember of the 2017–2021 Parliament of Iceland\n\nMember of the 2021– Parliament of Iceland (2021–)\n\nMinister for the Environment, Energy and Climate (2021–)"}, {"url": "https://icelandmonitor.mbl.is/news/politics_and_society/2019/07/12/iceland_s_resolution_regarding_philippines_approved/", "page_content": "The United Nations Human Rights Council has approved a resolution, sponsored by Iceland, to launch an independent investigation into alleged crimes committed during the Philippine government’s war on drugs. The resolution was approved with a narrow margin yesterday, with 18 nations voting in its favor, 15 abstaining and 14 opposing.\n\nAmnesty International and Human Rights Watch have declared support for the resolution. They have for a long time brought attention to human rights violations in the Philippines.\n\nThe resolution mandates a comprehensive written report into the human rights situation in the Philippines, the BBC reports, with a focus on reports of extrajudicial killings, arbitrary arrests and enforced disappearances.\n\n“This is proof that our voice and our work make a difference,” Icelandic Foreign Minister Guðlaugur Þór Þórðarson tells mbl.is.\n\n“We are fortunate enough to enjoy human rights in Iceland, which we take for granted,” he notes, but adds that in many places in the world, such is not the case. “It is our duty to contribute to the fight for improving the state of human rights affairs in the world,” he states.\n\nIceland was elected to take a seat on the UN Human Rights Council in July of last year, replacing the United States, which had withdrawn its membership. Iceland’s membership is good through the end of this year.\n\nGuðlaugur notes that Iceland has emphasized how important it is for all nations with a seat on the UN Human Rights Council to follow the International Bill of Human Rights and, thereby, set a good example. “This is why we have, among other things, focused on issues related to the Philippines and Saudi Ariabia, too, and we will continue to do so,” he states.\n\nWhen asked about his reaction to comments made by Teodoro Locsin, foreign minister of the Philippines, who posted on Twitter that for “those who voted to insult us, the consequences will be far reaching,” Guðlaugur responds, “In my mind the matter is very clear. The Human Rights Council is not made for getting together for a cup of coffee, but for using the council to support human rights, which is what we do. Even though we receive some threats, so be it. We will not budge from our policy.”\n\nHere, you can read a joint statement, given by Harald Aspelund, Iceland’s representative on the council, on behalf of nations supporting the resolution on June 19."}, {"url": "http://cn.worldheritage.org/articles/Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://www.norden.org/en/person/gudlaugur-thor-thordarson", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}]}