{"Guðlaugur Þór Þórðarson has been a Member of the Althing for the Independence Party since 2003.": [{"url": "https://icelandmonitor.mbl.is/news/politics_and_society/2022/11/07/benediktsson_gets_a_decicive_lead_to_chair_the_inde/", "page_content": "Bjarni Benediktsson continues to be the chairman of the Independence Party. mbl.is/Eggert Jóhannesson\n\nBjarni Benediktsson, Minister of Finance and Economic Affairs, got 59 percent of the votes for the leading position in the Independence Party whereas his challenger, Guðlaugur Þór Þórðarson, the Minister of Environment, Energy and Climate, got 40% of the votes. The party held its 44th National Convention last weekend with record attendance in Laugardalshöll in Reykjavík. Benediktsson received 1010 out of total 1712 votes cast whereas Þórðarson received 687 votes. Blank and void bills were 9 and others received 3 votes.\n\nA surprise challenge\n\nIt was only a few days before the meeting that Þórðarson announced his intention of challenging Benediktsson for the leadership role and it caused quite a stir in the party. It was widely thought that Þórðarson had been planning this move for up to two months, although it was only revealed shortly before the National meeting.\n\nBjarni Benediktsson and his wife, Þóra Margrét Baldvinsdóttir. mbl.is/Eggert Jóhannesson\n\n\"I'm in on it\"\n\n“When you say, ‘Let’s do better, let’s go further and jump a step higher,’ I say, ‘I’m in on it!’ ” said Bjarni when addressing party members once his win was secured and announced shortly after lunchtime on Sunday.\n\nBjarni has chaired the Independence Party since 2009, having succeeded Geir H. Haarde in his time.\n\nHe has been re-elected as chairman five times since then, at the party's national conferences, and this is therefore the sixth time. He has now been re-elected five times, and has had better representation on all occasions.\n\nBjarni Benediktsson and Guðlaugur Þór Þórðarson. Composition image\n\n\n\n\n\nFocusing on the results\n\nGuðlaugur Þór announced his candidacy on October 30th, or less than a week before the National Convention. It had become clear who would have a seat at the meeting. The last few days, the heat was turning up in the competition with supporters of each of the two candidates exchanging accusations of bad practices from the other.\n\nFew of the country's political scientists dared to predict the outcome, and it was widely assumed that a group of people would only make up their minds at the convention, after the end of each candidate's respective speeches.\n\nTurn defence into offense\n\nÞórðarson emphasized that the Independence Party must turn defense into a new offense, accusing the current leadership of having lost faith in the fact that it was a possibility. Benediktsson again pointed to the fact that party members were looking at the society that had been successfully created during the Independence Party’s leadership and its steady hand in government.\n\nDelivering results\n\n“I have always focused on delivering results for people, but this challenge shines a light on areas we can improve on, like being more active in listening to all the voices in the party,” said Benediktsson to mbl.is after the results were clear.\n\nÞórdís Kolbrún R. Gylfadóttir Minister of Foreign Affairs was elected vice chairman of the Independence Party. mbl.is/Eggert Jóhannesson\n\n“We need to heed to the call to continue the conversation but it is my belief that it is our good results and ongoing plans to continue delivering results that secured this win.”\n\nMembers of the party must be a team\n\n- Þórðarson got a fairly good vote, do you see that you’ll be doing a lot of work to re-unify the party after this election?\n\n\"On my part, I see us coming together and becoming one team, so I don't have any major concerns about it at this point.\"\n\n- So you have no concerns about the approximately 600 votes?\n\nVilhjálmur Árnason was elected the Secretary of the Independence Party. mbl.is/Eggert Jóhannesson\n\n“No, I mean Þórðarson got three thousand votes in a runoff election just over a year ago. He is leading the party in Reykjavik, which is of course a key constituency at the national level, and that’s why it was always expected that he had some group of supporters here at the meeting, but I think it was a decisive victory.”\n\nAsked what he takes with him from this experience of the National Convention, Bjarni says he feels the great will of all party members to participate and be active in the party.\n\nWill this change Þórðarson's position in the party?\n\n\"Everybody is willing to contribute. People come here because they are interested in political issues and the political process and they are concerned with their community. We need to mobilise that interest finding a platform for it and a way forward.”\n\n- Will these results have any consequences for Þórðarson within the party?\n\n\"No, I'm not thinking about any of that right now at this point. I'm just happy with the result.\"\n\n-How will you celebrate your victory?\n\n\"With all my best people, all the people who have been supporting me. My family has something planned.”\n\n\n\n"}, {"url": "https://www.government.is/diplomatic-missions/embassy-article/2020/09/29/Speech-at-the-75th-United-Nations-General-Assembly-by-H.E.-Mr.-Gudlaugur-Thor-Thordarson-Minister-for-Foreign-Affairs-and-Development-Cooperation/", "page_content": "75 United Nations General Assembly\n\nSpeech by\n\nH.E. Mr. Guðlaugur Þór Þórðarson\n\nMinister for Foreign Affairs and Development Cooperation of Iceland\n\nMr President, Excellencies, ladies, and gentlemen,\n\n\n\nLet me start by thanking the UN Secretary-General, for his leadership in these difficult times. I also express gratitude to the dedicated staff of this organization, often working in very challenging circumstances, for their commitment and courage.\n\n\n\nThe international community comes together for the 75th anniversary of the United Nations under exceptional circumstances - amid a global crisis.\n\n\n\nIceland is fully committed to support the global response to the COVID-19 pandemic. We have contributed to the Global Humanitarian Response Plan, to the UN Response and Recovery Fund and to several other initiatives, including the development, distribution, and fair and equal access to a possible vaccine for every country.\n\n\n\nThis crisis will have long-term implications for our economies and societies, pushing millions of peoples further behind, not least the most vulnerable. We must, therefore, redouble our collective efforts and pursue the Sustainable Development Goals with vigour.\n\n\n\nMr. President,\n\n\n\nThe pandemic has revealed that our fate is interlinked with the successes and failures of others. This very same revelation brought the founders of this great organisation together in 1945, after having lived through the horrors of two world wars. They understood then, as we must now, that we are stronger together than apart.\n\n\n\nThis notion is evident to a small state like Iceland, but larger states also gain from a well-functioning international rules-based order: peace, prosperity and partnerships for our people and planet. For the gravest challenges we face today can only be addressed collectively.\n\n\n\nThe current situation provides us with a perspective. Even if we still have a long way to go, we have witnessed significant achievements over the past 75 years. States have gained their independence, women have gained agency, more parents see their children grow up to become healthy adults, and millions have risen from poverty. Wild polio has recently been eradicated in Africa, a welcome sign of hope in the context of today’s challenges. By most measures, we have been living in times of unprecedented prosperity, something we now know, should not be taken for granted.\n\n\n\nIt is critical that we fight to maintain and improve the multilateral system and oppose/question those who seek to undermine it. We must ensure that our institutions, actions and tools are fit for purpose – so that the system can continue to serve all of us. The Secretary-General's ongoing reform agenda has our full support.\n\n\n\nMr. President,\n\n\n\nThe greatest challenge of our time can only be addressed through joint efforts. Climate action needs to be at the heart of our efforts as we build back better and greener after the pandemic. The Paris Agreement is the global baseline, and Iceland is fully committed to its implementation. To build back greener, we need to make full use of science, innovation, and positive financial stimulus for the full participation of the private sector.\n\n\n\nIceland's new climate action plan, released earlier this summer, goes even further than was agreed in Paris. Our goal is to achieve 35% reduction in greenhouse gas emissions by 2030 and full carbon neutrality by 2040.\n\n\n\nSustainable management of natural resources and the use of renewable energy will be instrumental if we are to combat climate change. That includes the sustainable use of our oceans, a major carbon sink, continuously threatened by climate change, pollution, and mismanagement. Here, international law, namely the Law of the Sea, provides the foundation for action that should be based firmly in science. Iceland will continue to share its expertise in these fields through our development cooperation, public-private partnerships and our capacity-building programs, run under the auspices of UNESCO.\n\n\n\nMr. President,\n\n\n\nAs we embark on a Decade of Action, we need to be firmly focused on advancing gender equality - not only as a fundamental human right - but also as critical for accelerated progress so that individuals and nations can prosper and reach their full potential. The slow progress on Sustainable Development Goal 5 on gender equality is therefore deeply worrying, not least as we risk losing a generation or more of gains due to the current crisis.\n\n\n\nWe must act now to ensure the full and equal participation of women in economic and political life, access to education, essential health services, and fight against sexual and gender-based violence. Iceland is therefore committed to contributing in a meaningful way as a co-leader of the Generation Equality Action Coalition on gender-based violence.\n\n\n\n\n\nMr. President,\n\n\n\nGrowing nationalism, racism, religious intolerance, and homophobia will continue to undermine human rights and fundamental freedoms if we do not fight to reverse this trend. It is of major concern when the most powerful are ambivalent, even hostile, to the enjoyment of universal human rights by all. UN Members States must speak up and act when human rights are set aside or violated, and not hesitate to use the legal, economic, and political tools we have at our disposal.\n\n\n\nIn the past year, I have had the honour to meet many brave women and men who risk their life and freedom to call out their governments for violation of human rights and fundamental freedom. It is our duty to support and protect these human rights defenders and allow their voices to be heard. We must also protect media freedom, which has come under grave threat in too many countries around the world. Human rights underpin democratic and prosperous societies – which in turn are the fundamental basis for international stability and peace.\n\n\n\nAs a member of the UN Human Rights Council in 2018 and 2019, Iceland made an effort to demonstrate that all nations, also the smallest among us, can use their voice effectively to speak out for those suppressed or silenced. The experience was both encouraging and empowering, since most UN Member States belong to that group of smaller or mid-size countries.\n\n\n\nThe Human Rights Council is not without faults and shortcomings. We have been critical of the Council’s membership, and the apparent desire by those with less than stellar human rights records to consistently undermine the integrity of the Council. We have also pushed for reform of the council and its working methods.\n\n\n\nMember States serving on the Council should never lose sight of its main mission and purpose – to protect and promote universal human rights. They should call out violators and hold them accountable and be open to constructive criticism and cooperation, rather than seek refuge behind rhetoric of politicization.\n\n\n\nWith this in mind, and on the basis of the experience of our recent membership of the Human Rights Council, Iceland has decided to run for a seat on the Council for the term 2025-2027.\n\n\n\nMr President\n\n\n\nLet me thank the Secretary-General for his leadership in calling for a global ceasefire; a call which all nations should support, not least those that hold power to influence the situation on the ground.\n\n\n\nThe ongoing efforts to find political and peaceful solutions to the crisis in Syria, Yemen, and Libya must continue with full backing of those involved. The Middle East Peace Process also needs to be reinvigorated as the current stagnation on both sides only serves to deepen existing disagreements, moving us further away from the two-state solution.\n\n\n\nCloser to my own place of home, in Europe, the persistent unlawful violation by Russia of the sovereignty and territorial integrity of Ukraine and Georgia continues to undermine peace and stability, and recent developments in Belarus give cause for major concern.\n\n\n\nThe Security Council carries special responsibilities for the maintenance of international peace and security on behalf of the wider UN membership. The Council, not least some of its permanent members, need to act in accordance with the UN charter, instead of being motivated by narrow political gains in a zero-sum game, undermining the credibility of this vital body.\n\n\n\n\n\nMr President,\n\n\n\n\"The UN was not created to take mankind into paradise but rather to save humanity from hell\", former Secretary-General Dag Hammarskjöld famously once said.\n\n\n\nAs we celebrate the 75th Anniversary of the United Nations, we should be mindful that this organization has been a catalyst for human development and progress. And it is the most significant peace project of our times.\n\n\n\nThe UN remains the only international body equipped to bring together different nationalities, political ideologies, and religions, for the common good.\n\n\n\nIts shortcomings can neither serve as an excuse for disengagement nor for the promotion of national interests above the pursuit of our common wellbeing and prosperity.\n\n\n\nToo many seek to apply the principles and values of the UN Charter selectively, tilting the balance between rights and responsibilities – in international trade, rule of law, human rights, disarmament and in preventing conflicts and atrocities.\n\n\n\nOur organisations and institutions should never serve or shelter those who seek to undermine the basic principles of the international rule-based order, which we have all subscribed to, including the UN Charter and the Universal Declaration of Human Rights.\n\n\n\nIt remains, that what we see is our own making. That is why, we need to use the current crisis and the 75th anniversary to reinvigorate our cooperation, build trust and make our institutions more effective and resilient, for today and tomorrow.\n\n\n\nWe should reconfirm our commitment to the principles of the UN Charter, international law, and the liberal international order.\n\n\n\nWe should stand up for these principles when they are being pushed aside.\n\n\n\nWe should make our institutions more open, transparent, and inclusive.\n\n\n\nWe should reform, not rewrite or retreat.\n\nFor only together we can build the future we want, and the UN we need.\n\nPre-recorded statement"}, {"url": "https://www.biographies.net/biography/gu%C3%B0laugur-%C3%9E%C3%B3r-%C3%9E%C3%B3r%C3%B0arson/m/03gsdp_", "page_content": "Who is Guðlaugur Þór Þórðarson?\n\nGuðlaugur Þór Þórðarson is an Icelandic politician. He has been a member of the Althing for the Independence Party since 2003 and served as the Minister of Health from 24 May 2007 to 1 February 2009. He is the first MP of the Reykjavík North constituency, after beating the Minister of Justice and Ecclesiastical Affairs Björn Bjarnason in the primary election.\n\nGuðlaugur graduated with a BA degree in Political Sciences from the University of Iceland in 1996. He is married to Ágústa Johnson, and is the father of two children.\n\nGuðlaugur started his involvement in the Independence party in 1987 when he was elected on the board of the National Youth Organisation of the Independence Party in which he served until 1997 of which he was vice chairman 1989–1993 and chairman 1993–1997. He was then elected on the Reykjavík City Council in 1998 and sat two four year terms there. He sat on the parliamentary committee on welfare issues 2003–2006, the committee on fisheries 2003–2007, and the committee on the environment 2003–2007"}, {"url": "http://cn.worldheritage.org/articles/Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://www.norden.org/en/person/gudlaugur-thor-thordarson", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}, {"url": "https://nzt.eth.link/wiki/Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson.html", "page_content": "Guðlaugur. This is an Icelandic name . The last name is a patronymic , not a family name ; this person is properly referred to by the given name\n\nGuðlaugur Þór Þórðarson (Godhlaugur Thor Thordharson, born 19 December 1967) is an Icelandic politician. He has been a member of the Althing (Iceland's parliament) for the Independence Party since 2003 and served as the Minister of Health from 24 May 2007 to 1 February 2009. He is the first MP of the Reykjavík North constituency, after beating the Minister of Justice and Ecclesiastical Affairs Björn Bjarnason in the primary election.\n\nGuðlaugur graduated with a BA degree in Political Sciences from the University of Iceland in 1996. He is married to Ágústa Johnson, and is the father of two children.\n\nGuðlaugur started his involvement in the Independence party in 1987 when he was elected on the board of the National Youth Organisation of the Independence Party in which he served until 1997 of which he was vice chairman 1989–1993 and chairman 1993–1997. He was then elected on the Reykjavík City Council in 1998 and sat two four year terms there. He sat on the parliamentary committee on welfare issues 2003–2006, the committee on fisheries 2003–2007, and the committee on the environment 2003–2007 (chairman 2004–2007)\n\nPolitical offices Preceded by\n\nSiv Friðleifsdóttir\n\nas Minister of Health and Social Security Minister of Health\n\n2007–2009 Succeeded by\n\nÖgmundur Jónasson\n\n\n\n"}, {"url": "https://commons.wikimedia.org/wiki/Category:Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "Position held\n\nMember of the 2016-2017 Parliament of Iceland (2016–)\n\nMember of the 2013-2016 Parliament of Iceland (2013–2016)\n\nMember of the 2009-2013 Parliament of Iceland (2009–2013)\n\nMinister of Health (2007–2009)\n\nMinister for Foreign Affairs and International Development Cooperation (2017–2021)\n\nMember of the 2017–2021 Parliament of Iceland\n\nMember of the 2021– Parliament of Iceland (2021–)\n\nMinister for the Environment, Energy and Climate (2021–)"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=14666338&lang=en", "page_content": "Guðlaugur Þór Þórðarson ( Icelandic pronunciation: ​ [kvʏðlœiɣʏr̥ θouːr̥ θourðar̥son]; born 19 December 1967) is an Icelandic politician who has been serving as Minister for the Environment, Energy and Climate since 28 November 2021.\n\nEarly life and education\n\nGuðlaugur Þór Þórðarson graduated with a BA degree in Political Sciences from the University of Iceland in 1996.\n\nPolitical career\n\nGuðlaugur started his involvement in the Independence party in 1987 when he was elected on the board of the National Youth Organisation of the Independence Party in which he served until 1997 of which he was vice chairman 1989–1993 and chairman 1993–1997. He was then elected on the Reykjavík City Council in 1998 and sat two four-year terms there. He sat on the parliamentary committee on welfare issues 2003–2006, the committee on fisheries 2003–2007, and the committee on the environment 2003–2007 (chairman 2004–2007).\n\nHe has been a member of the Althing (Iceland's parliament) for the Independence Party since 2003 and served as the Minister of Health from 24 May 2007 to 1 February 2009.\n\nGuðlaugur represented Reykjavík North 2003–2009, then switched to Reykjavík South for the 2009 elections before returning to Reykjavík North in 2013, where he has topped the party list for the last three elections. In the party primary in 2006 he defeated then Minister of Justice and Ecclesiastical Affairs Björn Bjarnason for the top spot in Reykjavík North.\n\nHe has served as Minister for Foreign Affairs since 11 January 2017.\n\nGuðlaugur opposes Icelandic membership of the European Union. He is strongly supportive of Iceland's membership of the European Economic Area, describing the benefits as substantial.\n\nPersonal life\n\nHe is married and has four children.\n\nSee also\n\nList of foreign ministers in 2017\n\nReferences"}, {"url": "https://www.wef.org.in/gudlaugur-thor-thordarson/", "page_content": "Hon’ble Minister Guðlaugur Þór Þórðarson Minister for foreign affairs, Iceland Iceland\n\nParliamentary career\n\n• Member of Althingi for the Reykjavík North Constituency 2003-2009, for the Reykjavík South Constituency 2009-2016 and for the Reykjavík North Constituency since 2016.\n\nParty group\n\n• Chairman of the parliamentary group of the Independence Party 2016-2017.\n\n• Deputy Chairman of the parliamentary group of the Independence Party 2013-2016 and 2005-2007.\n\nCommittee work\n\n• 1st Deputy Chairman of the Budget Committee 2013-2016\n\n• Member of the Icelandic Delegation to the EFTA and EEA Parliamentary Committees 2013-2016 (Chairman 2013-2016) and 2003-2007 (Chairman 2005-2007).\n\n• Member of the EU-Iceland joint Parliamentary Committee 2013-2016 (Chairman 2013-2016)\n\n• Member of the Foreign Affairs Committee 2013-2014.\n\n• Member of the Economic Affairs and Trade Committee 2011-2013.\n\n• Member of the Health Committee 2009-2011.\n\n• Member of the Trade Committee 2009-2011.\n\n• Member of the Environment Committee 2003-2007 (Chairman 2004-2007).\n\n• Member of the Fisheries Committee 2003-2007.\n\n• Member of the Social Affairs Committee on 2003-2006 (Deputy Chairman 2003-2006).\n\nMinisterial Career\n\n• Minister of Health and Social Security 2007-2009.\n\nEducation\n\n• Bachelor of Arts in Political Science. University of Iceland 1996\n\nPersonal\n\n• Born 19 December 1967. Married with four children."}], "Guðlaugur Þór Þórðarson is born in 28 April 1956": [{"url": "https://www.mfa.gov.cn/eng/wjb_663304/zwjg_665342/zwbd_665378/202305/t20230511_11075362.html", "page_content": "Ambassador He Rulong met with Mr. Guðlaugur Þór Þórðarson, Minister of the Environment, Energy and Climate of Iceland on May 9th.\n\nAmbassador He said that China attaches great importance to green and low-carbon development. The development and utilization of renewable energy such as geothermal is the highlight of bilateral cooperation between China and Iceland. China is willing to further strengthen cooperation in this field with a view to injecting new impetus to the development of China-Iceland relations.\n\nMinister Þórðarson welcomed Ambassador He by saying that Iceland and China have broad prospects for cooperation in geothermal and other renewable energy fields. He is willing to further promote bilateral cooperation in environmental protection and climate change."}, {"url": "https://www.government.is/diplomatic-missions/embassy-article/2020/09/29/Speech-at-the-75th-United-Nations-General-Assembly-by-H.E.-Mr.-Gudlaugur-Thor-Thordarson-Minister-for-Foreign-Affairs-and-Development-Cooperation/", "page_content": "75 United Nations General Assembly\n\nSpeech by\n\nH.E. Mr. Guðlaugur Þór Þórðarson\n\nMinister for Foreign Affairs and Development Cooperation of Iceland\n\nMr President, Excellencies, ladies, and gentlemen,\n\n\n\nLet me start by thanking the UN Secretary-General, for his leadership in these difficult times. I also express gratitude to the dedicated staff of this organization, often working in very challenging circumstances, for their commitment and courage.\n\n\n\nThe international community comes together for the 75th anniversary of the United Nations under exceptional circumstances - amid a global crisis.\n\n\n\nIceland is fully committed to support the global response to the COVID-19 pandemic. We have contributed to the Global Humanitarian Response Plan, to the UN Response and Recovery Fund and to several other initiatives, including the development, distribution, and fair and equal access to a possible vaccine for every country.\n\n\n\nThis crisis will have long-term implications for our economies and societies, pushing millions of peoples further behind, not least the most vulnerable. We must, therefore, redouble our collective efforts and pursue the Sustainable Development Goals with vigour.\n\n\n\nMr. President,\n\n\n\nThe pandemic has revealed that our fate is interlinked with the successes and failures of others. This very same revelation brought the founders of this great organisation together in 1945, after having lived through the horrors of two world wars. They understood then, as we must now, that we are stronger together than apart.\n\n\n\nThis notion is evident to a small state like Iceland, but larger states also gain from a well-functioning international rules-based order: peace, prosperity and partnerships for our people and planet. For the gravest challenges we face today can only be addressed collectively.\n\n\n\nThe current situation provides us with a perspective. Even if we still have a long way to go, we have witnessed significant achievements over the past 75 years. States have gained their independence, women have gained agency, more parents see their children grow up to become healthy adults, and millions have risen from poverty. Wild polio has recently been eradicated in Africa, a welcome sign of hope in the context of today’s challenges. By most measures, we have been living in times of unprecedented prosperity, something we now know, should not be taken for granted.\n\n\n\nIt is critical that we fight to maintain and improve the multilateral system and oppose/question those who seek to undermine it. We must ensure that our institutions, actions and tools are fit for purpose – so that the system can continue to serve all of us. The Secretary-General's ongoing reform agenda has our full support.\n\n\n\nMr. President,\n\n\n\nThe greatest challenge of our time can only be addressed through joint efforts. Climate action needs to be at the heart of our efforts as we build back better and greener after the pandemic. The Paris Agreement is the global baseline, and Iceland is fully committed to its implementation. To build back greener, we need to make full use of science, innovation, and positive financial stimulus for the full participation of the private sector.\n\n\n\nIceland's new climate action plan, released earlier this summer, goes even further than was agreed in Paris. Our goal is to achieve 35% reduction in greenhouse gas emissions by 2030 and full carbon neutrality by 2040.\n\n\n\nSustainable management of natural resources and the use of renewable energy will be instrumental if we are to combat climate change. That includes the sustainable use of our oceans, a major carbon sink, continuously threatened by climate change, pollution, and mismanagement. Here, international law, namely the Law of the Sea, provides the foundation for action that should be based firmly in science. Iceland will continue to share its expertise in these fields through our development cooperation, public-private partnerships and our capacity-building programs, run under the auspices of UNESCO.\n\n\n\nMr. President,\n\n\n\nAs we embark on a Decade of Action, we need to be firmly focused on advancing gender equality - not only as a fundamental human right - but also as critical for accelerated progress so that individuals and nations can prosper and reach their full potential. The slow progress on Sustainable Development Goal 5 on gender equality is therefore deeply worrying, not least as we risk losing a generation or more of gains due to the current crisis.\n\n\n\nWe must act now to ensure the full and equal participation of women in economic and political life, access to education, essential health services, and fight against sexual and gender-based violence. Iceland is therefore committed to contributing in a meaningful way as a co-leader of the Generation Equality Action Coalition on gender-based violence.\n\n\n\n\n\nMr. President,\n\n\n\nGrowing nationalism, racism, religious intolerance, and homophobia will continue to undermine human rights and fundamental freedoms if we do not fight to reverse this trend. It is of major concern when the most powerful are ambivalent, even hostile, to the enjoyment of universal human rights by all. UN Members States must speak up and act when human rights are set aside or violated, and not hesitate to use the legal, economic, and political tools we have at our disposal.\n\n\n\nIn the past year, I have had the honour to meet many brave women and men who risk their life and freedom to call out their governments for violation of human rights and fundamental freedom. It is our duty to support and protect these human rights defenders and allow their voices to be heard. We must also protect media freedom, which has come under grave threat in too many countries around the world. Human rights underpin democratic and prosperous societies – which in turn are the fundamental basis for international stability and peace.\n\n\n\nAs a member of the UN Human Rights Council in 2018 and 2019, Iceland made an effort to demonstrate that all nations, also the smallest among us, can use their voice effectively to speak out for those suppressed or silenced. The experience was both encouraging and empowering, since most UN Member States belong to that group of smaller or mid-size countries.\n\n\n\nThe Human Rights Council is not without faults and shortcomings. We have been critical of the Council’s membership, and the apparent desire by those with less than stellar human rights records to consistently undermine the integrity of the Council. We have also pushed for reform of the council and its working methods.\n\n\n\nMember States serving on the Council should never lose sight of its main mission and purpose – to protect and promote universal human rights. They should call out violators and hold them accountable and be open to constructive criticism and cooperation, rather than seek refuge behind rhetoric of politicization.\n\n\n\nWith this in mind, and on the basis of the experience of our recent membership of the Human Rights Council, Iceland has decided to run for a seat on the Council for the term 2025-2027.\n\n\n\nMr President\n\n\n\nLet me thank the Secretary-General for his leadership in calling for a global ceasefire; a call which all nations should support, not least those that hold power to influence the situation on the ground.\n\n\n\nThe ongoing efforts to find political and peaceful solutions to the crisis in Syria, Yemen, and Libya must continue with full backing of those involved. The Middle East Peace Process also needs to be reinvigorated as the current stagnation on both sides only serves to deepen existing disagreements, moving us further away from the two-state solution.\n\n\n\nCloser to my own place of home, in Europe, the persistent unlawful violation by Russia of the sovereignty and territorial integrity of Ukraine and Georgia continues to undermine peace and stability, and recent developments in Belarus give cause for major concern.\n\n\n\nThe Security Council carries special responsibilities for the maintenance of international peace and security on behalf of the wider UN membership. The Council, not least some of its permanent members, need to act in accordance with the UN charter, instead of being motivated by narrow political gains in a zero-sum game, undermining the credibility of this vital body.\n\n\n\n\n\nMr President,\n\n\n\n\"The UN was not created to take mankind into paradise but rather to save humanity from hell\", former Secretary-General Dag Hammarskjöld famously once said.\n\n\n\nAs we celebrate the 75th Anniversary of the United Nations, we should be mindful that this organization has been a catalyst for human development and progress. And it is the most significant peace project of our times.\n\n\n\nThe UN remains the only international body equipped to bring together different nationalities, political ideologies, and religions, for the common good.\n\n\n\nIts shortcomings can neither serve as an excuse for disengagement nor for the promotion of national interests above the pursuit of our common wellbeing and prosperity.\n\n\n\nToo many seek to apply the principles and values of the UN Charter selectively, tilting the balance between rights and responsibilities – in international trade, rule of law, human rights, disarmament and in preventing conflicts and atrocities.\n\n\n\nOur organisations and institutions should never serve or shelter those who seek to undermine the basic principles of the international rule-based order, which we have all subscribed to, including the UN Charter and the Universal Declaration of Human Rights.\n\n\n\nIt remains, that what we see is our own making. That is why, we need to use the current crisis and the 75th anniversary to reinvigorate our cooperation, build trust and make our institutions more effective and resilient, for today and tomorrow.\n\n\n\nWe should reconfirm our commitment to the principles of the UN Charter, international law, and the liberal international order.\n\n\n\nWe should stand up for these principles when they are being pushed aside.\n\n\n\nWe should make our institutions more open, transparent, and inclusive.\n\n\n\nWe should reform, not rewrite or retreat.\n\nFor only together we can build the future we want, and the UN we need.\n\nPre-recorded statement"}, {"url": "https://www.norden.org/en/person/gudlaugur-thor-thordarson", "page_content": "Our Vision 2030 The Nordic region will become the most sustainable and integrated region in the world in 2030.\n\nPolicy areas Get insight into areas where the Nordic countries work together.\n\nCurrent initiatives Keep up with the latest Nordic initiatives and campaigns.\n\nInternational co-operation Get insight into the Nordic Council and the Nordic Council of Ministers’ international activities.\n\nNordic Council prizes The Literature Prize, the Children and Young People’s Literature Prize, the Music Prize, the Film Prize, and the Environment Prize.\n\nNordic Council cases Here you can gain insight into current issues under consideration by the Nordic Council as well as look at closed cases."}, {"url": "https://www.norden.org/en/speech/67-gudlaugur-thor-thordarson-presentation", "page_content": "Forseti. Ég þakka þér, Antti, fyrir framúrskarandi formennsku í norræna varnarsamstarfinu í ár og óska þér til hamingju með hana. Samstarfið hefur reynst framúrskarandi vettvangur til að ræða stöðu mála og næstu skref í norræna varnarsamstarfinu og öryggismálin út frá nærumhverfinu sem og öryggis- og varnarpólitík. Ég fagna því að hafa hér vettvang fyrir skoðanaskipti norrænna ríkja um þær áskoranir í varnarmálum sem við okkur blasa. Við norrænu ríkin stöndum öll frammi fyrir sömu ógnum við öryggi okkar og deilum strategískum hagsmunum þótt birtingarmyndin sé ekki ávallt hin sama. Samstarf okkar til að mæta þessum áskorunum þarf áfram að byggja á styrkleikum hvers og eins. Ég vil gjarnan tiltaka þrjár strategískar áskoranir í þessu sambandi sem kalla á athygli okkar um þessar mundir.\n\nÍ fyrsta lagi truflandi hegðun Rússlands, brot gegn alþjóðalögum og fjölþáttaaðgerðir sem áfram grafa undan alþjóðakerfinu sem byggist á alþjóðalögum. Atlantshafsbandalagið er staðfast í tvíþættri nálgun sinni gagnvart Rússlandi en það er augljóst að Rússland hefur ekki áhuga á að eiga samtalið. Það er því raunveruleg áskorun að koma á samtali. Við verðum samt sem áður áfram að leggja okkar lóð á vogarskálina til að af því geti orðið og erum á sama tíma staðföst í okkar meginreglum. Stuðningur Rússlands við stjórn Lúkasjenkós ýtir undir óstöðugleika í austurhluta Atlantshafsbandalagsins. Við stöndum með bandalagsríkjum okkar, Póllandi, Litháen og Lettlandi, sem standa frammi fyrir því að Belarús beiti mannfólki í fjölþáttaaðgerðum sínum gegn nágrönnum sínum.\n\nÍ öðru lagi er það Kínaríki sem ekki deilir lýðræðislegum gildum okkar, sem leitast við að laga alþjóðakerfið að eigin hagsmunum og er vaxandi öryggisáskorun fyrir Evrópu og í víðara samhengi eins og fulltrúi unga fólksins hér á þinginu fór ágætlega yfir. Við eigum að leitast við að efla samstarf, við eigum að efla og kynna gildin okkar, styrkja viðnámsþol, vernda stoðinnviði og halda tæknilegu forskoti okkar.\n\nÍ þriðja og síðasta lagi hafa loftslagsbreytingar djúpstæðar afleiðingar fyrir frið og öryggi á alþjóðavísu. Norðurlöndin geta gegnt mikilvægu hlutverki við að efla skilning og takast á við loftslagsbreytingar sem skýra og afgerandi öryggisógn.\n\nSkandinavisk översättning\n\nPræsident. Jeg vil takke dig, Antti, for dit fremragende formandskab i det nordiske forsvarssamarbejde i år, og jeg ønsker dig til lykke med det. Samarbejdet har været et glimrende diskussionsforum om den aktuelle situation, og de næste skridt i det nordiske forsvars- og sikkerhedssamarbejde, med udgangspunkt i nærområderne såvel som sikkerheds- og forsvarspolitik. Jeg er glad for at have et forum, hvor de nordiske lande kan udveksle synspunkter om de forsvarspolitiske udfordringer, vi står over for. Alle nordiske lande står for tilsvarende sikkerhedstrusler, og vi har fælles strategiske interesser, selvom de ikke altid antager de samme former. Vort samarbejde om at reagere på disse udfordringer må fortsat bygge på landenes egne styrkepositioner. Jeg har lyst til at nævne tre strategiske udfordringer i denne forbindelse, som kræver vores opmærksomhed for tiden.\n\nDen første er Ruslands disruptive adfærd, brud på international lov samt hybride aktiviteter, der fortsat undergraver den internationale orden, baseret på folkeretten. NATO viser standhaftighed i alliancens tostrengede tilgang til Rusland, men Rusland er tydeligvis ikke interesseret i at indgå en dialog. Derfor er det en reel udfordring at få en dialog i stand. Vi må dog fortsat lægge vores lod på vægtskålen for at dette kan blive en realitet, samtidigt med at vi står fast på vores principper. Ruslands støtte til Lukasjenkos styre har bidraget til øget ustabilitet i NATOs østlige regioner. Vi står sammen med vores allierede, Polen, Litauen og Letland, som står over for, at Belarus anvender mennesker i landets hybride aktioner mod deres naboer.\n\nDen anden udfordring er Kina, der ikke deler vores demokratiske værdier, der søger at tilpasse den internationale orden til sine egne interesser, er en voksende sikkerhedspolitisk udfordring for Europa og i en bredere sammenhæng, hvilket ungdommens repræsentant gennemgik på en forbilledlig vis her i plenum. Vi må stræbe os på at styrke samarbejdet, vi må styrke og profilere vores værdier, styrke vores resiliens, stå vagt om den bærende infrastruktur og bevare vores teknologiske forspring.\n\nDen tredje udfordring er klimaændringernes dybtgående konsekvenser for fred og sikkerhed i hele verden. Norden kan spille en vigtig rolle med henblik på at skabe øget forståelse og håndtere klimaændringerne som en tydelig og udslagsgivende sikkerhedstrussel."}, {"url": "http://cn.worldheritage.org/articles/Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "World Heritage Encyclopedia\n\nThe World Heritage Encyclopedia is the largest and most comprehensive Encyclopedia ever compiled. The combination of articles, dictionary, eBooks, journals, and primary source documents, offers a most unique resource for students and researchers. A combined aggregation of hundreds of article databases, with millions of articles in total. All the articles may be read online or download and save as eDocuments. All articles are Print-on-Demand ready.\n\n\n\nWorld Heritage Encyclopedia believes the Common Core Standards are important, and that is why at WorldHeritage.org you'll find tools to help improve student performance, strengthen instructional effectiveness, and maximize the use of your technology.\n\n\n\nWorld Heritage Encyclopedia supports learning for all grade levels, from K-12, with a user-friendly interface and grade appropriate content. World Heritage Encyclopedia has aligned itself with the Common Core and State Standards to ensure all of the nonfiction STEM content needed by any student could be found, all in one place.\n\n\n\nEvery month thousands of new articles, images, and multimedia elements are added.\n\n\n\n\n\nWhy Encyclopedias\n\nThe World Heritage Encyclopedia includes the great general encyclopedias of the past and the present but all types of works that claim to provide in an orderly arrangement the essence of \"all that is known\" on a subject or a group of subjects, translated from the Koine Greek enkyklios paideia, which literally means \"complete knowledge\". As French philosopher, and contributor of the Encyclopedie Denis Diderot, said \"Indeed, the purpose of an encyclopedia is to collect knowledge disseminated around the globe; to set forth its general system to the men with whom we live, and transmit it to those who will come after us, so that the work of preceding centuries will not become useless to the centuries to come; and so that our offspring, becoming better instructed, will at the same time become more virtuous and happy, and that we should not die without having rendered a service to the human race. \"\n\nAccessibility World Heritage Encyclopedia, (WorldHeritage.org) is a live collaboration differing from paper-based reference sources in important ways. Unlike printed encyclopedias, we are continually editing, updating, and appending, articles on historic events appearing within minutes, rather than months or years. WorldHeritage.org is fully accessible on a tablet, smartphone, laptop, desktop computer, or any Internet-connected device with a Web browser.\n\nIs Print Obsolete?\n\n\"Thinking beyond the format\", Encyclopedias join a long list of paper we once thought we couldn't live without, like the Sears catalog, Yellow Pages and maps. Even the world famous Encyclopedia Britannica will no longer be printed after 244 years, the final edition costing almost $1400. Today, the modern encyclopedia is often in electronic form and much more affordable then the traditional paper versions. Unlike many online encyclopedias, World Heritage Encyclopedia is an aggregation of professionally written, crowd sourced, peer reviewed, and edited articles, making our information the most reliable and complete encyclopedia. On-line encyclopedias offer the additional advantage of being dynamic; new information can be presented almost immediately as it is happening in the world. With modern technology we have the extra advantage of information being portable as well."}, {"url": "https://commons.wikimedia.org/wiki/Category:Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson", "page_content": "Position held\n\nMember of the 2016-2017 Parliament of Iceland (2016–)\n\nMember of the 2013-2016 Parliament of Iceland (2013–2016)\n\nMember of the 2009-2013 Parliament of Iceland (2009–2013)\n\nMinister of Health (2007–2009)\n\nMinister for Foreign Affairs and International Development Cooperation (2017–2021)\n\nMember of the 2017–2021 Parliament of Iceland\n\nMember of the 2021– Parliament of Iceland (2021–)\n\nMinister for the Environment, Energy and Climate (2021–)"}, {"url": "https://www.norden.org/en/speech/6-gudlaugur-thor-thordarson-main-speech", "page_content": "Forseti. Kæru norrænu kollegar og vinir. Mig langar að þakka þér, Pekka, fyrir skelegga framgöngu í formennsku norræna utanríkisráðherrasamstarfsins og óska þér til hamingju með hana. Norrænt samstarf er einstakt og sem ríkjahópur eiga Norðurlöndin sterka rödd á alþjóðavettvangi sem gerir þeim kleift að hafa umtalsverð áhrif í fjölþjóðlegu samstarfi.\n\nSkýrsla Björns Bjarnasonar, sem kom út á síðasta ári, varpar ljósi á nýjan kafla í norrænu samstarfi þar sem samvinna í öryggis- og utanríkismálum þarf í auknum mæli að taka mið af breyttu öryggisumhverfi og þeim áskorunum sem blasa við okkur í dag.\n\nLoftslagsbreytingar og fjölþáttaógnir á borð við netárásir og upplýsingaóreiðu grafa nú undan þeim stöðugleika sem við búum við og ekkert ríki getur eitt og sér tekið á þeim áskorunum. Árangurinn næst einungis með öflugri samvinnu og því er mikilvægt að við sameinum krafta okkar og byggjum á sterkum stoðum norrænnar samvinnu.\n\nVið eigum þegar farsælt samstarf á mörgum málefnasviðum sem tillögur skýrslunnar fjalla um en það má efla enn frekar með ýmsum hætti. Við getum til að mynda lagt enn meira af mörkum á sviði loftslagsmála, t.d. með auknu samráði á sviði hafrannsókna og útflutningi á grænum lausnum.\n\nAuk loftslagsmála fjalla tillögurnar um loftslagsöryggi og þróunarmál, viðbúnað vegna heimsfaraldra, samstarf um utanríkisþjónustu og rannsóknir á sviði utanríkismála, svo fátt eitt sé nefnt. Allt eru þetta mikilvæg málefni þar sem norræn samvinna getur reynst dýrmæt eins og reynsla síðastliðinna sjö áratuga hefur sýnt okkur. Við verðum að bregðast við áskorunum í loftslagsmálum og breyttu landslagi í öryggismálum af fullum þunga. Aðgerðir kalla á innleiðingu tillagna í æðstu stjórnsýslu, bæði hjá fagráðuneytum og utanríkisráðuneytum, en þær þarf einnig að samþætta samstarfi okkar við alþjóðastofnanir og önnur ríki.\n\nNú stendur loftslagsráðstefna Sameinuðu þjóðanna yfir. Væntingar til útkomu hennar eru miklar og ákall er um að ríki heims sýni aukinn metnað í loftslagsaðgerðum. Einnig má merkja nýjar áherslur í starfi norrænu ráðherranefndarinnar og almennt í norrænu samstarfi. Bjarnason skýrslan er mikilvægt tól í þessu samhengi og ég vil að lokum undirstrika þýðingu hennar fyrir norrænt samstarf. Við megum engan tíma missa.\n\nSkandinavisk översättning\n\nPræsident. Kære nordiske kolleger og venner. Jeg vil gerne takke dig, Pekka, for din dynamiske ageren under dit formandskab i samarbejdet mellem de nordiske udenrigsministre, og jeg ønsker dig tillykke med det. Det nordiske samarbejde er enestående, og som en gruppe stater har Norden en stærk stemme på den internationale arena, hvilket giver landene en væsentlig indflydelse i internationalt samarbejde.\n\nBjörn Bjarnasons rapport, der udkom sidste år, belyser et nyt kapitel i det nordiske samarbejde, hvor et samarbejde om sikkerheds- og udenrigspolitik i stigende grad skal tage højde for ændringer i det sikkerhedspolitiske landskab og de udfordringer, vi står overfor i dag.\n\nKlimaændringer og hybride trusler, såsom cyberangreb og misinformation, undergraver vore landes stabilitet, og intet land kan håndtere disse udfordringer på egen hånd. Resultater kan kun skabes gennem et stærkt samarbejde, og derfor er det vigtigt, at vi forener vores kræfter og bygger videre på det stærke fundament, som det nordiske samarbejde udgør.\n\nVi har allerede et succesrigt samarbejde på mange af de områder, som rapporten berører, men dette samarbejde kan styrkes yderligere på mange måder. Vi kan yde mere på klimaområdet, for eksempel med øget samråd inden for havforskning og eksport af grønne løsninger.\n\nUd over klimaet handler anbefalingerne om klimasikkerhed og udviklingsspørgsmål, pandemiberedskab, samarbejde inden for udenrigstjenesten og forskning på det udenrigspolitiske område, blot for at nævne nogle få. Der er tale om vigtige emner, hvor det nordiske samarbejde kan vise sig at være værdifuldt, som erfaringerne fra de sidste syv årtier har vist os. Vi må give klimaudfordringerne og det ændrede sikkerhedspolitiske landskab vor fulde opmærksomhed. Indsatser kræver at anbefalingerne bliver implementeret på højeste niveau inden for administrationen, både i fagministerier og udenrigsministerier, og de skal også integreres i vores samarbejde med internationale organisationer og andre stater.\n\nFN's klimakonference, COP26, er nu i gang. Der stilles høje forventningerne til dennes udfald, og alle verdens lande opfordres til at skærpe deres ambitionsniveau i klimaindsatsen. Der er også tegn på nye prioriteringer i Nordisk Ministerråds virksomhed og i det nordiske samarbejde generelt. Bjarnason-rapporten er et vigtigt redskab i denne sammenhæng, og afslutningsvis vil jeg gerne understrege rapportens betydning for det nordiske samarbejde. Vi har ingen tid at miste."}, {"url": "https://commons.wikimedia.org/wiki/File:Gu%C3%B0laugur_%C3%9E%C3%B3r_%C3%9E%C3%B3r%C3%B0arson_(19-07-2021).jpg", "page_content": "attribution to the specified copyright holder.\n\nNote that if the copyright holder is not the European Commission or its predecessors (such as the CEC) the material may not be released under this license.\n\nSee also Template:PD-European-Commission and Commons:Village pump/Copyright/Archive/2019/04#Stills from the European Union. While the stated copyright policy is not free to use, the law of the European Commission , which overrules a website policy, allows for only three specific restrictions. The Audiovisual Center's copyright policy's only relevant restriction allowed by law isNote that if the copyright holder is not the European Commission or its predecessors (such as the CEC) the material may not be released under this license."}]}