{"Laurier Lévesque was a key figure in the development of modern Quebec nationalism and the Quiet Revolution.": [{"url": "https://www.thecanadianencyclopedia.ca/en/article/quiet-revolution", "page_content": "Jean Lesage. His party came to power in 1960 and introduced the many reforms collectively called the Quiet Revolution. Québec Premier from 11 September 1959 to 2 January 1960 (Bibliothèque et Archives nationales du Québec, P560,S2,D1,P1457) . He became premier of Québec in 1966 and continued the reforms of the Quiet Revolution (courtesy Library and Archives Canada/PA-117516). Credit: © Ronald Desmarais/National Archives of Quebec/ P795,S1,D10783 Lévesque founded the Parti Québécois, whose main objective was Québec sovereignty (Canapress). Former Parti Québécois leader Jacques Parizeau, September 1989. In 1994, he became the second leader of the separatist PQ to become premier (photo by Jim Merrithew). PreviousNext\n\nThe Quiet Revolution (Révolution tranquille) was a time of rapid change experienced in Québec during the 1960s. This vivid yet paradoxical description of the period was first used by an anonymous writer in The Globe and Mail. Although Québec was a highly industrialized, urban and relatively outward-looking society in 1960, the Union Nationale party, in power since 1944, seemed increasingly anachronistic as it held tenaciously to a conservative ideology and relentlessly defended outdated traditional values. (See also Grande Noirceur.)\n\nIn the election of 22 June 1960, the Liberals broke the hold of the Union Nationale, taking 51 seats and 51.5 per cent of the popular vote as compared to the latter's 43 seats and 46.6 per cent of the vote. Under Jean Lesage, the Québec Liberal Party had developed a coherent and wide-ranging reform platform. The main issue of the election was indicated by the Liberal slogan, \"It's time for a change.\" As a new middle class battled for greater control over Québec's economic resources, bitter and divisive attempts were made to redefine the role of francophone society in Canada.\n\nLesage Administration Reforms\n\nIn two years, the Lesage administration managed to carry out or plan many reforms: amongst others, the establishment of a public hospital network (1961), the creation of ministries of cultural affairs and of federal-provincial relations (1961), and the foundation of the Société générale de financement (General Investment Corporation) in 1962. A new age began as every aspect of society came under scrutiny. The government attacked political patronage and changed the electoral map to provide better representation for urban areas. To reduce the size of secret electoral funds, it limited authorized expenditures during election periods. It also lowered the voting age from 21 to 18. Lesage attempted to put the public purse in order by promoting a dynamic provincial budget and by raising loans. From 1960–61 to 1966–67, the budget grew from $745 million to $2.1 billion. The rapid and dramatic development of government institutions and the vastly increased role of the state in the province's economic, social and cultural life unleashed forces that would have major consequences. Most notably, the Catholic Church's role in society diminished, prosperity for French-speaking Québécois grew, and a nationalist consciousness expanded.\n\nThe pressures exerted by the baby boom generation, which had now reached adolescence, created a dramatic situation and pushed Québec's weak educational system to its breaking point. The government introduced new legislation on education and established the Commission of Inquiry on Education, which was chaired by Mgr Alphonse-Marie Parent. The resulting 1964 Parent Report, tackled the entire system. In recommending the creation of a department of education, it questioned the role of the Catholic Church, which controlled the public school system. The church resisted recommended changes, but without success. The Parent Report contributed significantly to creating a unified, democratic and modern school system accessible to the entire population.\n\nThe desire to modernize was also evident in the social sphere. Upon taking power, the government decided to participate in the federal-provincial hospital insurance program. In 1964, it introduced three major pieces of legislation: an extensive revision of the labour code; Bill 16, which abolished a married woman's judicial restrictions by which her legal status was that of a minor; and a pension plan.\n\nMaîtres chez nous: Economic Nationalism\n\nThe government's main accomplishment in economics was the nationalization of private electricity companies, an idea that was promoted in 1962 by René Lévesque, minister of natural resources. The government decided to go to the electorate on this issue. On 14 November 1962, the Liberals won on a platform for the nationalization of power with 56.6 per cent of the vote and 63 seats. In 1963 all private hydroelectric companies were nationalized. As a result, Hydro-Québec (established in 1944) became one of the largest Crown Corporations in North America. Unlike in previous years, francophones were able to work entirely in French and to develop their technical, scientific, and managerial skills. Such francization also occurred in the fields of education, social welfare, and health services, as well as in all levels and departments of government bureaucracy.\n\nHydro-Québec's Manic 2 is the largest hollow-joint gravity dam in the world (Corel Professional Photos).\n\nThe objectives of nationalization included standardizing rates across the province, co-ordinating investments, integrating the system, encouraging industrialization, guaranteeing economic benefits for the Québec economy through a buy-Québec policy, and making French the language of work in the sector. Hydro-Québec met most of these objectives and became a symbol of success and source of pride for the Québécois. Another major success was the creation in 1965 of the Caisse de dépot et placement du Québec. The Caisse was made responsible for administering the assets of the Québec Pension Plan, which rapidly grew to several billion dollars.\n\nThe maîtres chez nous (\"masters in our own house\") philosophy that permeated the government and its reforms was bound to have an influence on Federal-Provincial Relations. The Lesage government demanded a review of federal policy and won a major victory following a stormy First Ministers' conference in 1964. After initially approaching the federal government for additional funds to meet its needs, Lesage withdrew Québec from several cost-sharing programs — such as pensions, health care, and tax-sharing — in exchange for fiscal compensation. The issue of special status arose when Québec became the only province to opt out of some 30 joint programs that the other provinces stayed with. It was perhaps to calm the anxieties of English Canada and to show his good will that in 1964 Lesage agreed to a proposal for patriating and amending the Canadian constitution by a method known as the Fulton-Favreau formula. This would have allowed the Parliament of Canada to repeal or amend any provision of the Constitution, subject to a veto by any given province on certain major issues, but to a two-thirds majority on others. However, because of the extreme reactions of various nationalist groups within the province, Lesage withdrew his support and dissociated from the other 10 governments that had accepted the formula.\n\nFederal Provincial Tensions\n\nThe Québec government also sought to stake out diplomatic ties. In 1961, it opened the Maisons du Québec in Paris, London and New York. However, when Québec signalled its intention to sign cultural and educational agreements with France, Ottawa intervened, asserting that there could be only one interlocutor with foreign countries.\n\nThese federal-provincial quarrels raised the question of the place of Québec and French Canadians in Confederation. In 1965, for instance, the Royal Commission on Bilingualism and Biculturalism noted that \"Canada, without being fully conscious of the fact, is passing through the greatest crisis in its history. The source of the crisis lies in the Province of Quebec.\" French Canadian nationalism, which was becoming more and more Québecois in nature, was exacerbated by this crisis. The number of separatist groups increased — some of which adopted more extreme positions — and the Front de Libération du Québec began to engage in acts of terrorism.\n\nAt the same time, other francophones were concerned by such growing nationalism. Among them were Jean Marchand, Gérard Pelletier and Pierre Elliott Trudeau, who joined the federal Liberal Party and were elected to Parliament in 1965.\n\nIn the mid-1960s, these so-called \"wise men\" had been recruited by the Liberal Party of Prime Minister Lester B. Pearson in order to enhance francophone participation in federal government and to help Ottawa quell potentially dangerous political clashes with Québec's increasingly neo-nationalist-inspired, and in some cases separatist-oriented, political parties and successive governments. When the Québec Liberals faced the electorate in 1966 they were confident of re-election. But the Union Nationale had renewed its image and attracted dissatisfied individuals among conservatives, nationalists and those who had voted Créditiste in the federal election. The party still had a solid base in the rural areas that were left largely untouched by the Quiet Revolution. On 5 June, the Union Nationale won 56 seats against the Liberals' 50. However, the Liberals obtained 47 per cent of the popular vote whereas the Unionistes, led by Daniel Johnson, obtained 41 per cent.\n\nIn the late sixties, the federal government under Prime Minister Trudeau proposed a two-fold strategy to improve federal-provincial relations. To enhance and encourage francophone participation in all national institutions, a policy of official bilingualism was set forth. To guarantee individual rights as well as the rights of Canada's two official linguistic communities, a renewed Constitution with an inserted Charter of Rights and Freedoms was tabled. The first goal was achieved in 1969, with the passing of the Official Languages Act. The second objective was accomplished with the Constitution Act, 1982 (see Patriation of the Constitution), which incorporated a Charter of Rights and Freedoms and a general amending formula based on seven provinces comprising over 50 per cent of the Canadian population. The Quiet Revolution is a major reference point used by successive Québec governments in power since the Liberal defeat in 1966. It is an event used to distinguish the old-guard socio-political structure of the past from the post-Revolutionary paradigm."}, {"url": "https://www.britannica.com/art/Canadian-literature/The-Quiet-Revolution", "page_content": "The \" Quiet Revolution\"\n\nDuring the 1960s Quebec society underwent the greatest upheaval of its history. A new Liberal government set about modernizing the province, revamping the educational system, and creating a powerful Ministry of Cultural Affairs. Campaigns for the independence of Quebec were launched by separatist organizations that coalesced in the Parti Québécois (founded 1968), which became the provincial government in 1976. Intellectuals became vocal, and literary production more than tripled during the decade. A group of writers, including André Brochu, Paul Chamberland, and André Major, founded the magazine Parti pris (1963–68; “Position Taken”) and a publishing house of the same name to press their demands for a secular, socialist, and independent Quebec. The Parti pris writers politicized joual, the Quebec working-class dialect, by using it to express their alienation in works such as Major’s short-story collection La Chair de poule (1965; “Goose Bumps”) and Jacques Renaud’s novel Le Cassé (1964; Broke City, or Flat Broke and Beat). In 1968 the young playwright Michel Tremblay revolutionized Quebec theatre with Les Belles-Soeurs (“The Sisters-in-Law”; Eng. trans. Les Belles-Soeurs), which was first read at the Centre d’Essai des Auteurs Dramatiques (Centre for Dramatic Authors), established in 1965 to give a forum to Quebec playwrights. The “new Quebec theatre” ushered in by Tremblay was characterized by experimental approaches, including improvisation and collective creation; by proletarian language (Tremblay, Jean-Claude Germain, and Jean Barbeau); by parody (Robert Gurik, Hamlet, prince du Québec [1968; Hamlet, Prince of Quebec]); and by audience participation (Françoise Loranger, Double jeu [1969; “Double Game”]).\n\nIn poetry the territory of Quebec (referred to as le pays) was rediscovered in Paul-Marie Lapointe’s Choix de poèmes: arbres (1960; “Selection of Poems: Trees”) and Gatien Lapointe’s Ode au Saint-Laurent (1963; “Ode to the St. Lawrence”). Nationalism adopted revolutionary language in Chamberland’s Terre Québec (1964), and personal rebellion triumphed in the avant-garde magazines La Barre du jour (founded 1965) and Les Herbes rouges (founded 1968). A preoccupation with freedom of expression (la parole) revealed itself in titles such as Giguère’s L’Âge de la parole (1965; “The Age of Speech”) and Yves Préfontaine’s Pays sans parole (1967; “Speechless Country”). Perhaps the most influential collection was Miron’s L’Homme rapaillé (1970; Embers and Earth: Selected Poems), a poetic record of the search for a Quebec identity. Michèle Lalonde’s ironic “Speak White” condemned the Anglo-American economic exploitation embedded in the racist jeer “Speak white,” often hurled at Québécois who chose not to speak English; the poem was first recited at a 1968 show and again at the Montreal cultural event Nuit de la Poésie (\"Night of Poetry\") in 1970 and was published in 1974. With chansonniers (singer-songwriters) such as Gilles Vigneault, the “Quebec song” became the poetry of the people. Fusing elements of traditional Quebec folk music with politically charged lyrics, the Quebec song gained new importance at this time for its role in sustaining political fervour and national pride. Vigneault’s music incorporated many elements of traditional Quebec folk music but was also influenced by contemporary French music.\n\nDuring the 1970s poetry was less political and more experimental: the concerns of American counterculture were adopted in the works of Lucien Francoeur and Raoul Duguay. Committed to the notion that there exists an essential harmony between music and poetry, Duguay founded the Infonie group and dedicated himself to the performance of his poetry (Or le cycle du sang dure donc [1967; “So the Cycle of the Blood Endures”]). Pierre Morency’s poetry embraced a holistic vision of life that found its expression in a celebration of nature (Le Temps des oiseaux [1975; “The Time of the Birds”], Quand nous serons [1988; “When We Will Be”]). Michel Beaulieu (Pulsions [1973; “Urges”]) created a poetry of intimacy and desire rooted in everyday life. But as published poetry became more esoteric, the general public turned to chansonniers such as Robert Charlebois, whose American-influenced rock was just as concerned with Quebec identity as Vigneault’s music.\n\nSince the 1970s, feminism has been a potent force in French Canadian literature. In contrast to their Anglophone peers, who took much of their inspiration from the social criticism of American feminists, Francophone feminists primarily turned to the literary theory of French critics. Important in the realm of theoretical explorations was the work of Nicole Brossard (L’Amer; ou, le chapitre effrité [1977; These Our Mothers; or, The Disintegrating Chapter] and Picture Theory [1982; Eng. trans. Picture Theory], both works of theory and fiction). With Le Désert mauve (1987; Mauve Desert), her feminist fiction was made more accessible to the general public. The gender assumptions embedded in the semantic and syntactic conventions of language as well as in the conventions of literary form were exposed in quite a number of works; of note in this endeavour was the work of Madeleine Gagnon (Lueur [1979; \"Glimmer\"]), France Théoret (Une Voix pour Odile [1978; \"A Voice for Odile\"]), and Yolande Villemaire (La Vie en prose [1980; “Life in Prose”]). In her utopian novel L’Euguélionne (1976; The Euguelion), Louky Bersianik (pseudonym of Lucile Durand) used the conventions of the fantastic to conjure up alternatives to the existing social structure and verbal discourse, and in Tryptique lesbien (1980; Lesbian Triptych), a mix of poetry, essays, and dramatic writing, Jovette Marchessault envisioned a society of women free from male domination.\n\nAn important part of this polemical movement was the emergence of women’s theatre, performed by groups such as the Théâtre Expérimental des Femmes and featuring controversial plays such as Denise Boucher’s Les Fées ont soif (1978; The Fairies Are Thirsty) and Marchessault’s La Saga des poules mouillées (1981; Saga of Wet Hens). Dramatist and novelist Marie Laberge continued the tradition of feminist theatre with, for example, C’était avant la guerre à l’Anse à Gilles (1981; \"Before the War, Down at l’Anse à Gilles\"), a historical drama centring on women’s rights in the 1930s, and L’Homme gris (1986; \"The Gray Man\"; Eng. trans. Night), which explores the issues of spousal abuse, eating disorders, and incest."}, {"url": "https://www.britannica.com/place/Quebec-province/The-Quiet-Revolution-to-the-present", "page_content": "The “ Quiet Revolution” to the present\n\nUnder the Duplessis administration, none of the neonationalist or liberal reforms were implemented. In the interim, the social and economic transformation of the Québécois community continued apace, thus creating the opportunity for rapid institutional change should a more sympathetic political party take office. The Quebec Liberal Party chose a former federal minister, Jean Lesage, as its new leader in 1958 and adopted a new political platform comprising elements from both the neonationalist and neoliberal platforms. Following Duplessis’s death in 1959, Lesage and the Liberals formed a government with a slim majority in 1960, and the “Quiet Revolution” began. Supported by an emerging new middle class of well-educated Québécois, the Lesage government created a modern, secular Quebec state that took control of all social, health, and educational institutions, opening thousands of jobs for educated Francophones. The government also created and managed numerous Crown corporations, including Hydro-Québec, where French was the language of the workplace. Many Québécois used this experience to create private companies that became part of Quebec, Inc., a consortium of large Québécois corporations. To finance all of these expensive reform programs, Lesage and his successors demanded and received a greater share of federal personal, corporate, and estate taxes. Quebec also opted out of many of the Canadian government’s shared-cost programs and received additional tax points. Quebec garnered the largest share (nearly 50 percent) of the equalization transfers made by Ottawa to Canada’s have-not provinces.\n\nThe Quebec government’s pursuit of additional tax revenue and jurisdictional power over domestic and foreign matters posed a serious political challenge to an already decentralized Canadian federation. Right- and left-wing secessionist political movements emerged in the mid-1960s. They coalesced around René Lévesque’s Parti Québécois, which was founded in 1968. Following defeats in the elections of 1970 and 1973, the Parti Québécois, promising a referendum on secession, was elected in November 1976. The Parti Québécois’s first legislation was Bill 101, the Charter of the French Language. Responding to this very serious threat to national unity, the Canadian Liberal government, led by Prime Minister Pierre Elliott Trudeau, prepared itself for the provincial referendum on secession that took place in May 1980. Garnering 60 percent of the vote, the federalist forces led by Trudeau defeated the secessionists. Trudeau acted immediately on his promise to renew the federation. The Canadian Parliament, with the support of nine provinces and a majority of Canadians, acted to “patriate” (a uniquely Canadian term meaning roughly to Canadianize) the country’s founding document, the British North America Act of 1867, which originally had been enacted by the British Parliament. The resultant Canada Act of 1982, augmented by the Charter of Rights and Freedoms (a bill of rights), provided the country with a new constitution. Lévesque’s Parti Québécois rejected the new constitution on the grounds that it diminished Quebec’s power over language and education and that it did away with Quebec’s constitutional veto.\n\nQuebec’s constitutional struggle with the federal government remained largely dormant until 1987, when Conservative Prime Minister Brian Mulroney negotiated a deal with the Quebec Liberal government of Robert Bourassa. The result, the Meech Lake Accord, recognized Quebec as a distinct society and gave the government and legislature of Quebec the right to preserve and promote its uniqueness. It also gave Quebec and the other provinces expanded powers, including a veto over all changes made to Canada’s central institutions. However, the Meech Lake Accord was not ratified by all 10 provinces within its required three-year limit because of opposition in Manitoba and Newfoundland.\n\nCanada’s constitutional wars continued when Bourassa, with support from Mulroney, threatened to hold another referendum on secession in October 1992 if his government was not offered an acceptable set of constitutional proposals by the federal government and the other provinces. Months of negotiations produced the Charlottetown Consensus Report, which called for enhanced autonomy not only for Quebec but for the country’s aboriginal groups. The proposal was rejected by Canadians in a national referendum by a margin of 55 to 45 percent. Mulroney resigned, and in the 1993 election the Conservative Party was shattered. Bourassa, ill with cancer, also resigned. His successor, Daniel Johnson, lost the 1994 election to Parti Québécois leader Jacques Parizeau, who promised to hold a referendum within the year. However, under pressure, Parizeau backed away from a referendum on outright secession. Instead, Quebecers were asked if they supported the concept of sovereignty partnership between an independent Quebec and the rest of Canada. In 1995 a powerful campaign for the “yes” vote nearly won the day for the separatist cause, as the referendum was defeated by fewer than 55,000 votes. Parizeau stepped down and was replaced by Lucien Bouchard, a founder of Bloc Québécois.\n\nPrime Minister Jean Chrétien was shocked by the narrow margin of victory. His government passed a resolution recognizing Quebec as a distinct society and a bill stating that the Canadian government would never ratify another major constitutional amendment without the approval of Quebec’s National Assembly. He also referred Quebec’s referendum law to Canada’s Supreme Court; it stipulated that the Quebec assembly had the right, under international law, to make a unilateral declaration of independence following a simple majority vote on secession. In August 1998 the Supreme Court justices, in their landmark Quebec Secession Reference decision, ruled that Quebec did not have, under domestic or international law, the right to secede unilaterally. The justices then opined that if Quebecers voted on a direct question pertaining to secession only, with a clear majority, the Canadian government would be obligated to negotiate secession with Quebec. The court made it clear that the negotiations would encompass all matters, including borders, and that there was no guarantee that they would succeed. They concluded that the Quebec state could proceed to take all the risks inherent in an illegal declaration of independence.\n\nThe vast majority of Québécois accepted the Supreme Court’s controversial decision, thereby preventing the Parti Québécois government from employing it as a catalyst for a third referendum on secession. Quebecers reelected Bouchard’s Parti Québécois to a second term in 1998. At a convention in May 2000, Bouchard pledged to promote with renewed vigour the cause of Quebec’s independence but refused to set a date for another referendum. He retired in 2001, citing his failure to make advancements toward sovereignty. Bouchard became the leader of a movement against another referendum on secession on the grounds that the Québécois society had far more urgent demographic, social, and economic problems to resolve to ensure its long-term viability, prosperity, and sustainability. In 2003, however, Parti Québécois and Bernard Landry, who had succeeded Bouchard as premier, were ousted from office by the Liberal Party and its leader, Jean Charest, who promised to restore the health care system and to lower taxes for the middle class.\n\nIn November 2005 Parti Québécois elected as its leader André Boisclair, a charismatic 39-year-old who had been a member of the party’s executive committee from 1985 and a member of the provincial assembly since 1989. The vast majority of the Québécois lost confidence in him, however, a result of what many considered a lack of political judgment and in response to a personal scandal (before his election as leader, he had admitted prior cocaine use). As a result, Charest’s Liberal government, despite failing to deliver on its two key promises, was reelected in 2007, though with only one-third of the seats, mostly in Anglophone and Allophone ridings. Mario Dumont’s Action Démocratique du Québec, which represented the interests of small-town rural Québécois and disgruntled middle-class suburbanites, garnered one-third of the seats from both the Liberal Party and Parti Québécois.\n\nIn the wake of Parti Québécois’s second defeat, many Québécois appeared to have no desire to be drawn into a third referendum on secession. Like Bouchard, most Québécois came to understand that it was necessary and urgent to resolve the many demographic, social, and economic problems confronting their society before confronting the risks inherent in seceding from the Canadian federation. Québécois also gambled that Prime Minister Stephen Harper’s Conservative federal government would grant the province of Quebec special constitutional status within a more decentralized and asymmetrical Canadian federation, thereby making secession unnecessary. A failure to deliver on this promise might well revive the secessionist movement, leaving Canadians once again facing a challenge to the political and territorial integrity of their nation-state.\n\nIn 2012 the Liberal Party’s provincial budget included a major increase in university tuition fees. The result was arguably the greatest student mobilization in the country’s history. For several months the student movement occupied the limelight of Quebec’s political news: tens of thousands of college and university students went on strike, blocking access to their campuses, and daily demonstrations were held in Montreal and elsewhere in the province.\n\nMeanwhile, the government continued to defend itself against growing allegations of collusion and corruption. In August 2012 Charest set the stage for an appeal to the “silent majority” by asking the lieutenant governor to dissolve the National Assembly of Quebec in order to hold new elections. In elections in September 2012, Parti Québécois won a plurality of seats in the Assembly, and the party’s leader, Pauline Marois, became Quebec’s first woman premier. Having failed to obtain a majority of seats, however, the Parti Québécois government faced the need to compromise with other political parties in order to pass new legislation. The 2012 election also confirmed the rise of the Coalition Avenir Québec. The new centre-right party (which had absorbed the former Action Démocratique du Québec) won 19 of the 125 seats in the Assembly. Only18 months later, in March 2014, Marois—seeking to obtain a majority—called a new provincial election for April. The Liberal Party won in a landslide, handing Parti Québécois its worst defeat in terms of seats won since 1970 and propelling Philippe Couillard to the premiership."}, {"url": "https://www.worldatlas.com/articles/the-quiet-revolution-of-quebec-canada.html", "page_content": "The Quebecois socioeconomic landscape underwent a major overhaul in the post-World War II era, leading to a separatist movement in the Canadian province. The Quiet Revolution refers to the social, economic, and political changes that swept through Quebec beginning 1960. By the end of the revolution it was a highly urbanized, industrialized and secular Quebec.\n\nBackground of the Revolution\n\nBefore the revolution, Quebec had been characterized by social conservatism and isolation under the Duplessis regime, a term coined by the then-Prime Minister Maurice Duplessis. The province became starkly contrasted from the rest of Canada by rejecting contemporary values in place of traditionalism. The more agrarian province of Quebec had subsequently fallen behind from the rest of the rapidly industrializing Canada. Quebec had a high poverty rate and low education standards than the rest of Canada, and this led to their lack of representation in executive ranks in the companies of the province.\n\nSocioeconomic Landscape in Canada after World War II\n\nResources in the province had been for years developed by foreign investors, most of whom were English speakers. The French Canadians who resided in Quebec had been forced to play a second role in economic and social matters. The Quebec population developed a high level of nationalism and sought to gain equality and respect from the rest of Canada. The pent up desire for reforms set the Quiet Revolution in motion.\n\nKey Figures in the Separatist Movement\n\nIn the quest for equal rights for Quebec’s population arose a movement which sought Quebec’s independence from Canada. The movement was fueled by economic disadvantages experienced by French Canadians. The movement gained ground in 1968 with the formation of the Parti Québécois by René Lévesque. This party used concession as a means to relay its demands for independence, in contrast to the previous violent organizations such as the Front De Libération Du Québec in 1963 and L’Armée de Libération de Quebec. Levesque was the ultimate separatist figure and led Quebec separatists on the quest to acquire political power from Canada.\n\nThe Role of a Shift in Religious Values\n\nThe Catholic Church and its virtues had thrived in Quebec during the Duplessis regime, especially in health and educational matters. At the start of the Revolution was a wave of secularism in Quebec’s society, which had previously been anchored in Christian values. Radical views began to take root in Quebec. Marriage was viewed as an option one may or not undertake, and sex as a means for recreation and not only for reproduction gained more acceptance. Women’s status in Quebec had previously not been seen as politically or socially significant, and many had opted to join religious orders to engage in educational and hospital services offered by the Catholic Church. At the start of the revolution, however, many women opted out of religious lives to participate in the rapidly industrializing Quebec.\n\nSocial and Economic Reforms\n\nSocial and economic reforms were first championed by the government led by the Liberal Jean Lesage starting in 1960. Some of the most notable reforms were done in the education sector. A Ministry of Education was founded in 1964, which overhauled the curriculum to produce a more skilled workforce. The school system which had previously been run by the Catholic Church was restructured to educate students in disciplines such as engineering, business, and science. The government nationalized hydroelectric utilities and integrated them under Hydro-Quebec. Lesage established the ministries of federal-provincial affairs and cultural affairs and also created the Quebec pension plan. He also established the General Investment Corporation and a public hospital network. The voting age was reduced to 18 and women were granted more rights than they previously had. Modernization efforts improved infrastructures such as hydro-electric dams and highways. With the modernization and industrialization of Quebec came the decline of the Catholic Church. Morals were liberalized, Western culture such as new forms of music was embraced, and the young people began to freely express themselves. A new breed of French-Canadian artists began to emerge in literature and music and redefined Quebec’s culture.\n\nMove for Independence from Canada\n\nA renewed sense of nationalism in Quebec’s society in the 1960s created the ideal conditions for a separatist movement. Some Quebec’s inhabitants became more aware of the existing ethnic discrimination and demanded autonomy from Canada. The movement was particularly aggressive in matters of language and economic power. The separatists sought the recognition of French as a national language and better living standards for Quebec’s society. A section of separatists resorted to using violence through bombings and robberies. Rene Levesque was at the helm of the independence movement and his party, the Parti Quebecois, won provincial elections in 1976. The party led Quebec on two referendums to achieve independence but was unsuccessful in both.\n\nLegacy of the Quiet Revolution\n\nThe Quiet Revolution is particularly significant for opening up Quebec to the world. The revolution redefined Quebec’s culture as it is accepted today and promoted the rise of the French middle class. Although the economic reforms slowed down with the recession in the 1980s, the impact of the revolution is still visible today. The revolution has however been criticized for the debt burden the province shoulders till date."}, {"url": "https://www.cbc.ca/news/canada/re-examining-the-roots-of-quebec-s-quiet-revolution-1.889130", "page_content": "Conrad Black has had many passions in his life, one of them, many people forget, was his love affair with Quebec in the 1960s.\n\nWhile still in his twenties, Black moved from Toronto to Quebec City to study law at Laval University and to learn French.\n\nThat was the year of Expo 67 in Montreal and Quebec was in the early stages of what has been called the Quiet Revolution, a period of heady social, political and economic change that began, many say, with the election of Jean Lesage's Liberal government on June 22,1960, 50 years ago.\n\nBlack would go on to write speeches in English for the man who succeeded Lesage, Union Nationale premier Daniel Johnson Sr., and he became co-owner and publisher of a weekly newspaper in the Eastern Townships, the beginnings of what would become his media empire.\n\nConrad Black, shown here in June 2007 outside a Chicago courthouse. (Associated Press)\n\nHe also stumbled into a life-long vocation — historical research and writing, in this first case motivated by a desire to tell the full story of the formidable ex-premier Maurice Duplessis, who had run Quebec for close to a generation.\n\nIn 1977, Black published his 737-page history of the life and times of Duplessis, having become convinced that he was an important and misunderstood transitional figure on Quebec's road to modernization.\n\nWith what some would call the 50th anniversary of the Quiet Revolution upon us, CBC Producer Jennifer Clibbon interviewed Conrad Black, via email from Coleman Correctional Complex near Orlando, Fla., where he is currently appealing a sentence for fraud and obstruction of justice relating to the sale of his U.S. media holdings.\n\nClbbon: When you arrived in Quebec, Jean Lesage and his Liberal government had just been voted out after six years of far-reaching reforms. Could you describe your impressions of what was going on?\n\nBlack: It was clear from the previous election, 1966, that there was great resentment of the heavy-handed authority of the new civil service that the Lesage government had imposed on the province.\n\nThere was a clear division between those who thought the tax increases, secularization and bureaucratization required were unjustified, and those who thought them a sensible investment for Quebec's future.\n\nThere was also the question of rising nationalism.\n\nOvertly separatist parties took nine per cent of the vote in the 1966 election and, following the Liberal defeat, René Lévesque only took about a year before he threw down the mask and acknowledged that he was an independentist, as had been widely assumed.\n\nObviously, this was going to become a tense struggle.\n\nWhat, in your view, were the greatest achievements — and failures — of the Lesage government?\n\nBlack: I think the Lesage government's greatest achievements were building on Duplessis's accomplishment in forcing the St. Laurent and Diefenbaker governments to concede Quebec's concurrent right to direct taxes.\n\nRene Levesque, one of the pillars of Jean Lesage's Liberal government in the early 1960s, shown here as the leader of the Parti Quebecois, trying to quiet the crowd in Montreal's Paul Sauve Arena as he conceded defeat in the Quebec referendum on sovereignty-association on May 20, 1980. His wife Corinne is behind him. (Canadian Press)\n\nAlso, the successful, and fairly priced, takeovers of the balance of Quebec's hydroelectric power companies in 1962 on behalf of Hydro-Quebec; and an increase in the post-secondary places available in the province's education system.\n\nThe greatest failures were that the education and health-care systems were handed over to radical teachers' and nurses' unions.\n\nEssentially Quebec had the same teachers teaching the same curriculum in the same schools, and the same nurses performing the same tasks in the same hospitals.\n\nBoth at 10 times the previous cost when they were mainly members of religious orders.\n\nThe resulting costs led to sharply higher taxes, which caused immense discontent, and the added strength of the public sector unions spread into the private sector and drove a great deal of investment capital away from Quebec.\n\nLesage and his ministers didn't reckon on the cost of their reforms, or the implications of tax increases and chaos in the public sector and industrial unions.\n\nWhile in Quebec, you developed a fascination with Duplessis. How did this come about?\n\nBlack: It quickly became clear that Daniel Johnson Sr., for whom I had great admiration, had immense respect for Duplessis, about whom I had the usual English-Canadian view that he was a corrupt and primitive dictator.\n\nWith a little research, I discovered that Quebec had made the greatest economic and social progress in its history under Duplessis and that his era was the only one in which the average per capita income of Quebec actually gained on Ontario's.\n\nHe had the most advanced pension regime and daycare system in Canada, and built most of Quebec's universities, 3,000 schools, and the autoroute system, while reducing taxes and provincial debt.\n\nHe extended electricity to rural Quebec, and, of course, took back from Ottawa, Quebec's rights over direct taxes.\n\nThe story of your enterprising research as you drove around rural Quebec and pieced together a portrait of Duplessis is fascinating. What did you learn from this?\n\nBlack: I went to a colloquy about Duplessis at the University of Quebec at Trois-Rivieres, where Robert Rumilly, the aged quasi-official historian of the Union Nationale and author of the 41-volume Histoire du Quebec, debunked a leftish panel that had spent 90 minutes criticizing Duplessis.\n\nI spoke to him afterward and he gave me a letter of introduction to Aurea Cloutier, who had been Duplessis's father's secretary, and then Duplessis's, from 1923 until his death in 1959, his entire public career.\n\nPremier Maurice Duplessis gestures vigorously as he delivers a speech during the 1956 provincial election. He died three years later at Schefferville, Que. (Canadian Press)\n\nShe showed me his papers, irregularly packed in random boxes in the basement of his house in Trois-Rivieres, where his sister lived.\n\nIt was obvious that these papers were a considerable historical find that had never seen the light of day, though Rumilly had been using them.\n\nI made an arrangement with Rumilly, whereby I drove us around Quebec interviewing the survivors of the Duplessis era. I provided the transport and he arranged the meetings.\n\nI had the good fortune to meet many of these people in the very extremes of old age. It seemed to me indicative of the gentility of traditional Quebec, a sudden trip in time, backwards, 50 years.\n\nEven more so was the meeting with Ernest Laforce, founder of the colonization movement, a back-to-the-land movement during the Depression.\n\nHe was then in his mid-90s and had accompanied Sir John A. Macdonald in his election campaign in Quebec in 1891, as a baggage boy, but observed a lot and spoke with the prime minister many times.\n\nIt became clear, talking to all these people, including many opponents of Duplessis, what an immense folkloric figure he had been in Quebec and how thoroughly he had dominated the public life of Quebec from 1935 to 1959.\n\nAnd yet, his era wasn't called \"La grande noirceur\" (the Great Darkness) for nothing. What, in your view, were Duplessis' great flaws?\n\nBlack: As for La grande noirceur, it was a complete fraud. As Claude Wagner, a leading figure in the Lesage government said to me: \"We had to believe we were bringing light to the province, so we had to believe that there was only darkness there before.\"\n\nIt was the agreed-upon umbrella beneath which sheltered the Liberals and the separatists, and their academic and journalistic allies.\n\nCertainly, the Quebec public didn't believe a word of it: They gave Duplessis big majorities for a whole generation and then pitched out Lesage's self-styled equipe du tonnerre in favour of Duplessis's chief disciple [Daniel Johnson] at the first real opportunity.\n\nDuplessis was unnecessarily authoritarian and stayed too long, and his party could have eased into a new era relatively painlessly, as a seamless continuation of the changes he had already effected.\n\nThis was the intention of his chosen and talented successor, Paul Sauvé, as well as his ultimate protegé, Daniel Johnson.\n\nQuebec's terrible misfortune was that these men, Sauvé and Johnson, who had most of Duplessis's strengths and few of his liabilities, lacked his physical strength and died in office at the ages of 52 and 53.\n\nWith this, the right that had held the nationalist torch in Quebec through Henri Bourassa, Lionel Groulx, and Duplessis, passed to Lévesque and the left and there was no conservative restraint on the left.\n\nSo the absurd language laws, which were all part of the Quiet Revolution — the language aptitude tests for six year olds, the language police and bans on bilingual commercial signs and so forth — and the industrial chaos, the tyranny of quasi-Communist teachers' unions, and the flight of people and capital from Quebec, all retarded the growth and damaged the credibility of Quebec.\n\nThey also hobbled Canada in the world with the spectre of the break up of the country.\n\nToday, some Quebec writers and commentators, who never lived through the Duplessis era, look back somewhat nostalgically What do you suppose they are nostalgic for?\n\nBlack: My impression is that Duplessis is coming out now from under the cloud.\n\nNostalgia for Duplessis is based on strong leadership, economic progress, protection of French Quebec, without chasing people and money out of the province, respect for minorities and the advance of Quebec jurisdictional autonomy without shaking the whole country to its foundations, as well as on Duplessis's formidable wit and personality.\n\nYou wouldn't compare him to Landry and Charest, (whom I like personally).\n\nDuplessis was remembered with respect by the average Quebecer. The academic-journalistic complex, composed of unambiguous separatists and federalists, attacked Duplessis for being neither, and fabricated all the rubbish about his having run a primitive regime.\n\nYou have written important biographies of Franklin Roosevelt and Richard Nixon, too. Are there any commonalities that your biographical subjects share?\n\nBlack: There isn't much in common between FDR, Richard Nixon, and Maurice Duplessis, apart from their occupation.\n\nThe difference in scale between their activities and jurisdictions was immense. Though, as Malcolm Muggeridge observed, Duplessis did possess the intelligence and stature to be a national leader and, in some respects, was.\n\nWhat they had in common as subjects was that I thought there was a critical absence of a comprehensive interpretation of each of them.\n\nRoosevelt was whipsawed between his admirers who thought him a guileless altruist, making him more vulnerable to the other faction that has represented him as a cynical socialist who was duped out of Eastern Europe by Stalin.\n\nI believed both versions were untrue and, I think, demonstrated that.\n\nNixon, of course, is torn between tremendous controversies and his achievements. As a result, the relatively limited proportions of his mistakes have been rather lost sight of. He was one of the country's most successful presidents, before the Watergate affair, which was absurdly exaggerated, partly through his own mishandling of it.\n\nDuplessis, as you have seen, was someone who I think has been very substantially misrepresented. I have no doubt that something close to my take on all three will ultimately prevail, because my analysis is based exclusively on indisputable facts.\n\nThey all aroused intense emotions that have terribly clouded the appreciation of them."}, {"url": "https://schoolworkhelper.net/quebecs-quiet-revolution-summary-significance/", "page_content": "The English-French relations have not always been easy. Each is always arguing and accusing the other of wrong doings. All this hatred and differences started in the past, and this Quiet revolution, right after a new Liberal government led by Jean Lesage came in 1960. Thus was the beginning of the Quiet Revolution.\n\nLesage had an excellent team of cabinet ministers which included Rene Levesque. The Liberals promised to do two things during the Quiet Revolution; one was to improve economic and social standards for the people of Quebec, and the other was to win greater respect and recognition for all the French people of Canada.\n\nThe Liberals started a program to take control of hydro-electric power companies. French-Canadian engineers from all over Canada returned to Quebec to work on the project. Slogans during these times were “we can do it” and “masters in our own homes”.\n\nThe government also started to replace programs the Church previously ran, which included hospital insurance, pension schemes and the beginning of Medi-Care. For these programs, the Quebec Liberals had to struggle with Ottawa for a larger share of the tax dollars.\n\nOne of the greatest reforms was the modernization of the entire school system. The Church used to own the schools of Quebec. Most of the teachers were Priests, Nuns and Brothers. They provided a good education but Quebec needed more in business and technology. Lesage wanted a government-run school system that would provide Quebec with people in engineering, science, business and commerce.\n\nWith the new freedom of expression, lots of books, plays and music about French culture were all developed in Quebec. French contemporary playwrights were very famous during that time. However, not all was going well in Quebec. The French-English relation was going bad.\n\nMany studies showed that French-Canadian Quebecers were earning the lowest wage in all of the ethnic groups in Canada. Other complaints were that the top jobs in Quebec were given to English speaking Canadians. Canada was going through the worst crisis in its history, and unless equal partnership was found a break-up would likely happen.\n\nSome Quebecers thought that separation was the only solution. They thought that as long as Quebec was associated with the rest of Canada, French-Canadians would never be treated equally.\n\nThe FLQ (Front De Libération Du Québec) was founded in 1963. It was a smaller, more forceful group of separatists. They were a collection of groups of young people whose idea was to use terrorism to achieve independence for Quebec.\n\nThe ALQ (L’Armée de Libération de Quebec) was even more of a violent separatist group. Some of their actions included robbing banks in order to get money. For their ammunition, they had to raid arms depots of the Canadian Armed Forces.\n\nThere were many Federalists that believed that separatism had no future and that French-Canadians could play a role in a bi-lingual Canada. There were three Quebec men that believed in Federalism. These men were Liberals and their names were Pierre Trudeau, Jean Marchand, and Gérard Pelletier.\n\nThe President of France, General De Gaulle came to Quebec in 1967 and gave speeches to separatist groups that deemed him an enthusiast of the thoughts of the separatists in the struggle to fight for the liberation of Quebec.\n\nThe Prime Minister at the time, Lester B. Pearson, criticized De Gaulle’s remarks and said that Quebec belonged to Canada and there was no need for their liberation. In 1970, British Trade Commissioner James R. Cross was kidnapped by FLQ and wanted in return for Cross, 23 political prisoners. Quebec Labour Minister, Pierre Laporte was also kidnapped which started a Quebec crisis.\n\nAfter a few months, Cross returned when Laporte was assassinated. The Quebec crisis ended several years of violence in Quebec. This crisis made many Quebecers upset because Ottawa sent the army into Quebec. Therefore English-French turmoil did not end.\n\nRene Levesque was a leader who became very popular in Quebec with his views on independence. In 1976, Rene Levesque and the Parti Quebecois won the Provincial election. Now many Quebecers thought he could build up Quebec. Since many French were lower than English in status, Quebecers thought the Parti Quebecois could do something about it.\n\nThen the two languages became a major issue. Many businesses had a sign in French only, and doctors and nurses had to speak French. These were all effects on Bill 101 by the Parti Quebecois. Immigrants were educated only in French. Businesses accused the Parti Quebecois of practicing economic blackmail.\n\nQuebec Nationalists wanted an independent state so that they could have full control over their territory. But many top authorities in Canada say it is not legal for a Province to leave. Levesque said that he wanted a Quebec that was independent but joined Canada in the market.\n\nLevesque wanted to protect Quebec culture. Many people in Quebec opposed the separation. An organization called the Positive Action Committee was formed to help fight the separation dispute.\n\nQuebec was not the only Province that wanted more political power for itself. Canada was working on a new Constitution and wanted to replace the BNA Act of 1867. If a new Constitution was made, Quebec might remain a part of Canada.\n\nThe Constitution had to make all the Provinces happy. It would have to recognize the partnership between the French and the English in the history of Quebec. The Federal Liberals probably helped tip the balance in favor of the no vote.\n\nThe referendum campaign in the early ’80s was intense. Premier of Quebec, Rene Levesque, and the PQ desperately wanted the vote to be a resounding “oui”. The referendum was a critical test for the PQ government. The PQ’s (Parti Quebecois) was elected out of the separatist platform. Their party represented the bone of forming independence of Quebec.\n\nIn order for the independence movement to take greater strides, the Parti Quebecois would have to encourage an “our” vote in the Referendum. There were intense battles to win the opinion and admiration of the Quebec population with ads in newspapers, magazines, on T.V and radio. With a resounding “no vote” in the makings, Prime Minister Pierre Trudeau was prepared to bring on the Constitution.\n\nTrudeau made a speech on May 14th, which was a sincere commitment to a new Canada. He was determined that Canada would have a new Federal system of government."}, {"url": "https://www.cbc.ca/history/EPISCONTENTSE1EP16CH1PA1LE.html", "page_content": "The Quiet Revolution\n\nThe provincial government spearheads revolution in Quebec\n\nIn the early 1960s, Quebec's church-based education system became a focal point in a series of rapid, sweeping government reforms. The changes would transform Quebec and mark the peak of the Quiet Revolution.\n\nBroadcaster turned politician, René Lévesque, was a key member of the Quebec Liberal government, which initiated sweeping reforms in province in the early 1960s. <! -----------TABLE INSERT1 END---------> Since the first days of New France, the Catholic Church had assumed the task of educating the young. In the early 1960s, the system - and the curriculum - were archaic, obsolete and produced one of the highest dropout rates in the country; half of all Quebec students were leaving school by the age of fifteen. Those who wanted a higher education found a system designed for a few chosen souls. \"Our mission was to train the elite,\" said Claude Brouillet who taught at a classical college near Montreal. \"We had some sons of working-class people. To be able to get (financial) help, they had to have a recommendation from the parish priest.\" In rural Quebec, education was a low priority. \"Here, in the country, it was the exception that could go on beyond sixth grade,\" said teacher Juliette Gagnon. \"People said that to pick up rocks and work the land, they didn't need an education.\" In 1960, Jean-Paul Desbiens, a teaching brother, denounced the school system in a book entitled The Impertinences of Brother - Anonymous. It was based on a series of letters hed written to the influential newspaper, Le Devoir. \"Lets give all the (education) officials all the medals there are,\" Desbiens wrote. \"Lets create some special ones, such as one for Solemn Mediocrity. Lets give them all a comfortable and well-paid retirement and send them home to their mamas.\" Desbiens struck a chord with Quebecers. The book was an unprecedented success, selling over 100,000 copies. As for Desbiens, the Church did not appreciate his criticisms. His Catholic order sent him off to Europe for three years of reflection. But the floodgates were open. The book's popularity revealed a Quebec society that was ripe for change after years of post-war prosperity and industrialization. The year the book was released, Quebecers elected a new reform-minded premier, Liberal Jean Lesage. Lesage was determined to fully modernize the province, which had been controlled for 18 years by the iron authority of Union Nationale Premier Maurice Duplessis. The Lesage government set about nationalizing the hydro-electric utilities. It also set up the Quebec pension plan and created new ministries for cultural affairs and federal/provincial relations. Brian Upton, a Montreal Star journalist, coined the phrase \"Quiet Revolution\" to describe the changes being wrought in Quebec. Lesages most radical reform, however, was in education. Youth Minister Paul Gérin-Lajoie was assigned the task of wresting control of education from the Catholic Church and making it a modern institution. \"We were concerned by the reality of the moment and this reality was brutal and easy to see: Quebec's education system was not up to the needs of the twentieth century.\" Archbishop Maurice Roy, the primate of the Canadian Catholic Church, defended the church's historic hold on education. \"There are, in this great enterprise established a hundred years ago, guiding principles that cannot be changed without endangering its solidity.\" But the government refused to back down. By 1964, the province had an education ministry which was highly government controlled. Within a few years, Quebec created secondary schools and a network of junior colleges. Claude Brouillet had left his small classical college and now taught in Montreal. \"I arrived at Édouard-Montpetit high schoolthe year it opened. I was coming from a school of 300 students to one where there were almost 2,000 of them. What a difference!\" But not everyone seemed prepared for the huge changes that Lesage had unleashed. The education reforms had upset a way of life that was centuries old. Lesage's government would be defeated in the 1966 election by Duplessis old party The Union Nationale. But the new premier Daniel Johnson would not try to turn back the clock. The Quiet Revolution would continue.\n\n"}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/rene-levesque", "page_content": "\\u00a9 Marie-Josée Hudon. All portraits reproduced are the property of the artist. Courtesy: Musée des Grands Québecois. Lévesque founded the Parti Québécois, whose main objective was Québec sovereignty (Canapress). PreviousNext\n\nRené Lévesque, premier of Québec 1976-85, politician, journalist, nationalist (born 24 Aug 1922 in Campbellton, NB; died 1 November 1987 in Montréal, QC). A prominent member of Jean Lesage's Liberal Cabinet during the Quiet Revolution, Lévesque later founded the Parti québécois (PQ), eventually bringing it to power in 1976. The PQ's main objective was Québec independence, and for 15 years Lévesque was the leading champion of that ideal — holding and losing the province's first referendum on sovereignty in 1980.\n\nGaspé Childhood\n\nLévesque grew up in the remote, coastal town of New Carlisle, among the fishermen and farmers of the Gaspé peninsula. Because there was no hospital there in 1922, he was born in nearby Campbellton, New Brunswick, the eldest child of Dominique Lévesque, a prominent lawyer, and Diane Dionne. Although the Lévesques were well-to-do, poverty was dire in the Gaspé at that time. René became aware at a young age that most of the French Canadians were poorer, with smaller homes and more wretched schools, than the English Canadian families — descendants of Loyalists who had fled the American Revolution — who were the self-appointed elites of the region.\n\nA bright student who impressed his Jesuit teachers, Lévesque resolved early on at the Séminaire de Gaspé that he was destined to be a leader. He idolized his father, who introduced him to politics, and to French and English literature — giving the boy a bilingual upbringing. When Lévesque was 14, however, his father died in hospital at the age of 48. His mother quickly remarried, the family relocated to Québec City, and Lévesque drifted away from both his family and his studies.\n\nExpelled from the Collège des Jésuites Saint Charles Garnier for low marks, he finished his formal schooling at the Séminaire de Québec and enrolled in the law school at Université Laval, but gave up on his studies before obtaining a degree.\n\nJournalism\n\nLévesque had discovered radio journalism in 1938, his last summer in New Carlisle. In Québec City he worked at CBV, a regional Radio-Canada station. When the Second World War broke out, he was keen to get into the action, not as a soldier but as a war correspondent. Radio-Canada refused to send him, so in 1944 Lévesque found a position in London with the French section of the United States government service, Voice of America — thereby avoiding conscription by the Canadian military. He didn't get to the front lines until February 1945, joining the American armies as they crossed the Rhine and swept through the devastated remains of Germany. He was among the first US correspondents to see the horrors of the Dachau concentration camp following its liberation.\n\nThe war instilled in Lévesque a fondness for Americans (versus English Canadians), and a deep awareness of the barbarism that can flow from the extremes of nationalism. It wasn't enough to erase his own nationalist impulses, but it did temper them; he was committed throughout his life to democracy.\n\nAfter the war Lévesque returned to Radio-Canada, becoming an announcer for La voix du Canada, a news program broadcast out of Montréal to French-speaking countries around the world. He quickly established himself as an engaging and widely-followed foreign newsman, reporting from the Korean War in 1951 and the Soviet Union in 1955. From 1956 he hosted the television series \"Point de mire\" (Focal Point) and became one of Québec's most influential TV commentators. Short, balding and chain-smoking, Lévesque lacked the good looks for this emerging visual medium, but his intelligence and wit, and his ability to explain world events to a domestic audience, enabled him to become one of Québec's first TV stars.\n\nIn 1947, Lévesque married Louise L'Heureux, his fiancée from before the war, with whom he wouldhave two sons and a daughter. Surrounded by admirers in the broadcasting world, Lévesque wasn't a faithful husband, and the couple would divorce in 1978.\n\nIn 1959, Lévesque became actively involved in a strike by Radio-Canada producers, who wanted to form a union. He was dismayed by the indifference of the Diefenbaker government in Ottawa, and of his English CBC colleagues, towards the strikers' goals, which only hardened his views towards English Canada and fuelled his political aspirations. He decided journalism wasn't enough — it was time to stop covering the world, and start changing it instead.\n\nLesage Cabinet\n\nLévesque joined Jean Lesage's Liberals in the provincial election of 1960, becoming a Member of the Legislative Assembly for Montréal and helping to defeat the old Union nationale government. It was the beginning of the Quiet Revolution, and Lévesque became one Lesage's most popular and energetic Cabinet ministers — helping to modernize Québec, to encourage its French-speaking majority to become \"masters in our own house,\" and to help ease the province away from the oppressive influence of the Roman Catholic clergy.\n\nAfter a brief stint as minister of water resources and public works, in which he fought corruption in the civil service, Lévesque was appointed minister of natural resources in 1961. He became point-man for the controversial but ultimately successful effort to nationalize the province's private electric utilities and fold them into what became the energy colossus of Hydro-Québec. If Francophone Québecers didn't own or control big business interests in their province, Lévesque insisted, they would at least control its vast natural resources, via their government.\n\nParti québécois\n\nIn 1966, the Lesage government was defeated and Lévesque — increasingly nationalistic, and critical of his party's relations with the federal government — quit the Liberals the following year to found the Mouvement souveraineté-association, which in October 1968 became the Parti québécois. The move was hardly surprising. Through the 1960s, even as a Liberal minister, Lévesque had made his views on independence increasingly clear, telling the Anglophone media in Canada that he wouldn't be upset if Québec separated. At the 1967 Québec Liberal Party convention he had even tabled an incendiary resolution, largely unsupported by other delegates, titled \"A sovereign Quebec within a Canadian economic union.\" Meanwhile, he grew increasingly antagonistic with Pierre Trudeau, who entered federal politics in 1965 advocating a very different vision.\n\nHaving managed to unite the various groups promoting independence and a new political status for Québec, Lévesque's party won 23 % of the vote in the 1970 provincial elections — although he himself failed to win a seat. Then the October Crisis erupted, and Trudeau, now prime minister, invoked the War Measures Act. Lévesque joined a coalition of prominent Québecers in condemning what they saw as Ottawa's anti-democratic response to the crisis. At the same time, Lévesque and his friends failed to unequivocally condemn the terror kidnappings of the Front de libération du Québec (FLQ) and the group's subsequent murder of Pierre Laporte. This allowed the PQ's critics to publicly equate the party with the FLQ, costing the PQ considerable support.\n\nIn the 1973 provincial election the Liberals won a landslide victory, and Lévesque once again failed to win himself a seat. The PQ, however, managed to become the official Opposition.\n\nPQ Comes to Power\n\nIn the next election, in 1976, Lévesque and his party faced off against the now-unpopular Liberal regime of Robert Bourassa, weary after years in power and beset by scandal and accusations of nepotism. Lévesque promised good government. He also downplayed the PQ's essential goal — sovereignty — while reassuring Québecers that a PQ government would commit to holding a referendum on the issue first, rather than declaring sovereignty unilaterally. The PQ won a majority of 71 seats, including one for Lévesque, who became the province's 23rd premier. He headed the first Québec government committed to breaking up Confederation. The rest of Canada was stunned.\n\nDuring its first term, the new government passed several progressive measures concerning automobile insurance, rezoning of agricultural lands and the abolition of secret electoral funding. One of the most important and controversial pieces of legislation was Bill 101, the Charter of the French Language, which formalized the status of French as the official language of Québec. Proclaimed lawin 1977, Bill 101 excluded English from the provincial legislature and courts, and restricted access to English schools to anyone other than children whose parents had attended English schools in Québec. French schooling became compulsory for English-speaking immigrants, even those from other Canadian provinces.\n\nAlthough strongly supported by the public and the PQ, the law triggered an exodus of more than 130,000 Anglophones from the province between 1976 and 1981 . As well, a number of Montréal-based companies, including Sun Life Assurance Company of Canada, relocated their head offices to Toronto. In the ensuing years, court rulings would strike down many of the law's measures as contrary to the Constitution, including the ban on English in the legislature and courts. Eventually, children whose parents had attended English schools elsewhere in Canada, were allowed into English schools in Québec.\n\n1980 Referendum\n\nIn the fall of 1979, as time was running out on his government's mandate, Lévesque finally introduced in the National Assembly a plan for sovereignty-association — a politically independent Québec, still economically tied to Canada. A referendum on the question was scheduled for 20 May 1980, only months after the defeat of Joe Clark's Conservatives in Ottawa, and the return to power of Lévesque's nemesis Pierre Trudeau.\n\nAfter an emotional campaign led on the \"non\" side by Liberal Opposition leader Claude Ryan and federal Cabinet minister Jean Chrétien (with key support from Trudeau), and on the \"oui\" side by Lévesque and his ministers, the sovereigntists won only 40 percent of the vote, failing to capture even a majority of the Francophone vote. It was the hardest defeat of Lévesque's career. If there was any consolation, Lévesque believed the vote had at least legitimized the right of Québecers to determine their own future regarding Confederation. Ottawa had recognized that fact through its active participation in the campaign.\n\nConstitution Battle\n\nAgainst all expectations, the PQ was re-elected in 1981, with Lévesque heading his second majority government. The party may have been helped at the polls by the emergence of new battle lines pitting Lévesque and other provincial premiers against Trudeau, who had announced his intention to repatriate the Constitution from Britain and to proceed unilaterally if the provinces opposed him.\n\nTrudeau had made the vague promise, during the 1980 referendum campaign, of \"renewing\" the Constitution. Now his government was proposing new, centralized federal powers over the economy, a constitutionally-entrenched Charter of Rights and Freedoms, and a new constitutional amending formula. After months of political debate and grandstanding among Trudeau, Lévesque and the other premiers, the First Ministers, as they were called, assembled in Ottawa in November, 1981, in a final bid to settle their differences.\n\nLévesque was one of several powerful and strong-willed premiers (along with Alberta's Peter Lougheed) — together comprising eight provinces, or the Gang of Eight — who opposed Trudeau's plans and had fought them through the courts. But huddled together in Ottawa that November, the seven English-speaking premiers in the coalition were won-over by the promise of a \"notwithstanding clause\" in the new Charter — limiting its power over provincial authority. The compromise was not enough for Lévesque, who had also insisted on constitutional recognition of Québec as a \"distinct society,\" and on a constitutional veto for Québec. He accused his fellow premiers of abandoning \"Québec at the moment of crisis.\"\n\nWith the agreement of nine provinces, Trudeau pressed ahead. The repatriated Constitution was signed by Queen Elizabeth in the spring of 1982 — with the support of all the premiers except Lévesque, whose government represented the second-most populous province in the country. It was a detail that would bedevil the country and its First Ministers for years to come.\n\nFinal Years in Office\n\nLévesque returned to the National Assembly to face the hard task of governing. Confronted with economic recession and spiralling provincial deficits, his government met with considerable opposition and public disapproval, including illegal public-sector union strikes, when it attempted to reduce spending to solve its grave financial problems.\n\nThere was also turmoil inside the PQ and growing doubts about Lévesque's leadership. In 1984, a party crisis erupted when Lévesque announced his intention of not fighting the next election on the issue of independence, while maintaining sovereignty-association as the party's official raison d'être. Several important ministers resigned in protest, but the party reaffirmed Lévesque's leadership at a special convention in January 1985. Still, exhausted by years of struggle — and the defeat of his fondest political goals — Lévesque, at 62, fell into depression and was even hospitalized against his will. In June 1985 he resigned as premier.\n\nLegacy\n\nLévesque enjoyed two years of retirement, before his heart gave out on 1 November, 1987. In that time he wrote his memoirs, which proved hugely popular. Upon his death, he was remembered across the country, by friends and foes alike, as a giant of Canadian politics.\n\nLévesque's mark on Québec, and Canada, is as indelible as any leader that province has produced: as a journalist he opened the minds of Francophone Québecers and awakened them to the wider world; he was a central figure of the Quiet Revolution; a creator of the energy powerhouse that became Hydro-Québec; founder of the PQ and leader of Québec's first openly separatist government; the angry, intransigent torch-bearer of the \"distinct society\" ideal, who refused to endorse the 1982 Constitution, leaving an open wound in the federation that festers still.\n\nThrough it all, Lévesque acknowledged that whatever injustices Québecers suffered inside Confederation, Canada was still a free and decent country. \"Canada's federal system,\" he once said, \"is not excessively oppressive or anything like a gulag.\" He was never the most ardent nationalist or separatist of his time, yet he fanned the flames of nationalist sentiment in pursuit of his aims. His insistence on wanting to break up the nation, in spite of the Canadian virtues he admired, are what made him such a perplexing — and often hated — figure in the minds of English-speaking Canadians, both inside Québec, and elsewhere."}, {"url": "http://faculty.marianopolis.edu/c.belanger/QuebecHistory/readings/lesage.htm", "page_content": "\n\nJean Lesage and the Quiet Revolution (1960-1966) Claude Bélanger,\n\nDepartment of History,\n\nMarianopolis College Born in 1912. Elected to the House of Commons in 1945 and reelected until 1958; elected to the Quebec Legislative Assembly 1960-1970. Minister of Northern Affairs and National Resources 1953-1957. Leader of the Liberal Party of Quebec 1958-1970; Prime Minister of Quebec 1960-1966. The Lesage years coincided with what has come to be called the \"Quiet Revolution\" years. The focus here is in outlining the major changes that occurred during the Quiet Revolution. The Quiet revolution was a period of intense social change, of modernisation of Quebec and of a profound redefinition of the role of Quebec and French Canadians within Confederation. The background to the Quiet Revolution years was the Duplessis regime which had been characterised by isolation, social conservatism and generally negative autonomist stands. The energies and hopes unleashed during the Quiet Revolution years shook the very foundations of Canada and are still being felt today. The slogan which best represents the Lesage years was \"Maîtres chez nous\" [Masters in our own house]. The underlying belief in Quebec, during this period, was that French Canadians should not be content to play a second class role in socio-politico-economic matters and that the key to a full, \u0091normal\u0092 development of the community rested in the utilisation of the only tool which collectively French Canadians controlled: the state of Quebec, and thus in the rejection of the anti-statism of the past. So, the government of Jean Lesage became the symbol and the tool of a whole people on the road to self-assertion. The government embarked on a series of reforms that altered substantially conditions in Quebec: creation of a provincial hospitalisation scheme (1961), creation of departments of Cultural Affairs and of Federal-provincial relations (both firsts in Canada ), nationalisation of all private hydro electric facilities in Quebec (1963) and their incorporation into the existing network of Hydro-Quebec, wholesale reforms in the field of education (the Parent Report and Bill 60) and creation of a Department of education (1964), creation of the Société Générale de Financement- SGF (1962), creation of the Quebec Pension Plan (1965), and of the Caisse de Dépot et de Placement (1965), creation of the Société Québécoise d'Exploration Minière- SOQUEM, electoral and social reforms, in particular by the introduction of a provincial family allowance scheme (though only implemented in 1967), etc.. For a while, there seemed no limits to the reforms that the government would bring about. However, such limits, existed and they rested, above all, on the restricted financial capabilities of the province. To implement its programme, the government of Jean Lesage built up a substantial and competent provincial bureaucracy, raised taxes substantially (by 1963, Quebec already had the highest provincial taxes on corporations, succession duties, sales, properties, and licences in Canada; its income tax on individuals was the third highest and its tax on gasoline ranked fifth), resorted to heavy borrowing (the net debt of Quebec increased by over 300% between 1960 and 1966) and raided continuously the federal treasury, demanding an ever increasing share of the taxes collected in the province. Thus, relation between the governments of Canada and Quebec were strained during this period. This tension resulted from a number of factors: 1) the Lesage government continued to support the autonomist stand which previous provincial administrations had taken; however, while previous provincial governments had been characterised by negative autonomy, the government of Jean Lesage not only refused federal initiatives in provincial matters but implemented its own programmes. In this respect, Lesage stated very clearly his position in 1964: \"Il ne s'agit plus de nous poser en objecteurs perpétuels à des politiques fédérales...Ce qui importe pour le moment, c'est que, face à n'importe quelle initiative fédérale dans les champs proviciaux, nous soyons toujours prêts à proposer une solution qui permette au Québec de sauvegarder ses droits.\" [The issue is not anymore to position ourselves as perpetual opponents to federal policies... What is important for the time being is that faced with federal initiatives we would always be ready to propose an alternative that safeguards our rights.] 2) The second source of tension has already been pointed out: the Lesage government brought in many reforms that necessitated the transfer of fiscal powers from the federal to the provincial government; the federal government was not about to relinquish some of its fiscal powers without opposing great resistance; 3) the third source of tension was that French Canadians now desired to be recognised, not only individually but also collectively, as equals in Confederation. It was this last factor which led to so many difficulties in federal-provincial relations during the Quiet Revolution years. The rest of Canada had welcomed the changes that had occurred in Quebec; they were also prepared to make accommodations in the distribution of fiscal powers in Canada (other provinces were making similar demands); they could understand, and to some extent accept, the autonomist stand that the province took but they, generally, were not prepared to go along with the new definition of the country that Quebec proposed. Originally, the position that Lesage took on constitutional matters was very traditionalist; to an audience at the first Congress on Canadian Affairs he had said, in 1961: \"It will not be necessary to rewrite Confederation in order to make it a success. It will suffice to live its true meaning. We of Quebec must learn to implement all the powers accorded us by the pact of 1867.\" But, imperceptibly, the position of the Lesage government shifted as the years passed. The government came to preach a belief that had been deeply imbedded in the subconscious of French Canadians since the days of Riel and of the Mercier government: the government of Quebec was the national government of French Canadians (increasingly referring to themselves as the Québécois) and Quebec was the fatherland of all French Canadians. Canada was implicitly a country of two people; such had been the wish and the aim of the Fathers of Confederation (many of these ideas are developed in the Tremblay Report, which the government of Lesage resurrected, and in Un Québec fort dans une nouvelle Confédération). This implied, in particular, two things: 1) French Canadians could not accept greater centralisation as this would result in the reduction of the amount of self-government that the community (many said nation) had; if centralisation continued, the fate of the nation would be put more and more in the hands of a government that had become of late, and increasingly, the political expression of the other nation (English Canadians); 2) the task of developing the French Canadian nation required not only the retention of such powers as had been granted to Quebec in 1867 but the enlargement of that self-government; the government of Jean Lesage demanded that Quebec, as much as possible, control the economic, social, political, and administrative means which would permit the realisation of the \u0091legitimate aspirations\u0092 of Quebec. Eventually, this led the government to demand a special status for Quebec though Lesage was always careful to point out that such powers that would be transferred to Quebec could also be transferred to the other provinces if they so wished. As nobody in Quebec expected that the other provinces would want such powers, in practice this amounted to asking for special status. The response of the federal government was originally somewhat favourable. The Pearson government was making an honest attempt to accommodate French Canadians in their demands. Moreover, his political position depended largely on solid support from Quebec (the Pearson governments were always minority governments). So accommodations were made: Quebec withdrew from some 30 odd joint programs with full fiscal compensation (1965) and the Pearson government instituted the Royal Commission on Bilingualism and Biculturalism to make recommendations so that Canada \"would develop along the lines of an equal partnership between the two founding people.\" [my emphasis] The recommendations of the B. and B. Commission displeased many English speaking Canadians and when Lesage, and later the Johnson government, pressed for more changes and more money the situation reached a breaking point. Quebec's refusal to accept the Fulton-Favreau formula angered a large cross-section of English Canada who started to search for a leader capable of resisting pressure from Quebec, indeed able to \u0091put Quebec in its place\u0092 and standing firm against the demands for more money and a special status. The Lesage government was defeated at the polls before the full force of the backlash could be felt. Three individuals (les trois colombes \u0091the three wise men\u0092) had come to the federal government in 1965 who were to play a significant role in arresting the process of accommodations and devolution which had been slowly emerging-: Gérard Pelletier, Jean Marchand and Pierre Elliott Trudeau. They brought with them a new vision- that of a bilingual country- which was to come to predominate as policy and solution to the problems of French-English relations in Canada within federal circles. Their policy could be summarised simplistically as: for French Canadians everything possible, for Quebec, no special status. To the concept of Quebec as the homeland of all French Canadians they would oppose the idea that all of Canada is the home of French Canadians; to the idea of a French Quebec, they would counter with the concept of a French Canada. Thus, it would not be necessary to grant more powers to Quebec since the federal government would see to the protection and the development of the French culture in all of Canada. The government of Jean Lesage had brought many changes, some of them, perhaps, too rapidly, and without spending enough time to explain and justify them to the population. These disturbed many in the population of the province that were still very traditionalist. Its policies had been expensive, leading to a heavy tax burden; ultra-nationalists undermined his political support by fielding, under the banners of the Rassemblement pour l'Indépendence Nationale and the Ralliement National, candidates in the 1966 elections. The ideologues and the technocrats in the government did not spend enough time to discuss their policies with the people and to adapt them in the various regions of the province. Every change made brought with it resistance with an increasingly important proportion of the population. The Lesage liberals were not advantaged by an electoral map that still overrepresented rural areas. His government was narrowly defeated, but the impetus for constitutional reform, although not as much for social change, continued to be strong in the government of Daniel Johnson that followed. Jean Lesage had not been alone. In fact, much of his success had been largely due to the important team, -\"l'équipe du tonnerre\" [the thunder's team] that he had surrounded himself with. Among the most important and influential cabinet ministers were: Eric Kierans, René Lévesque, Pierre Laporte, Georges-Emile Lapalme and Paul-Gérin Lajoie.\n\nFurther reading: Quiet Revolution © 1998 Claude Bélanger, Marianopolis College"}, {"url": "https://infogalactic.com/info/Quebec_sovereignty_movement", "page_content": "From Infogalactic: the planetary knowledge core\n\nFlag of Quebec\n\nThe province of Quebec shown in red-orange\n\nThe Quebec sovereignty movement (French: Mouvement souverainiste du Québec) is a political movement as well as an ideology of values, concepts and ideas that advocates independence for the Canadian province of Quebec.\n\nSeveral diverse political groups coalesced in the late 1960s in the formation of the Parti Québécois, a provincial political party. Since 1968 the party has appealed for constitutional negotiations on the matter of provincial sovereignty, in addition to holding two provincial referendums on the matter. The first, which occurred in 1980, asked whether Quebecers wished to open constitutional negotiations with the federal government (and other provinces) for the intended purpose of establishing a \"sovereignty-association\" pact between the province of Quebec and the rest of Canada. Approximately 60% of Quebec's voting public rejected the idea put forth by Parti Québécois leader René Lévesque. The matter was dropped by the party for most of the 1980s, especially after the patriation of the Canadian constitution without the consent of the Parti Québécois government, and the creation of the federal Charter of Rights and Freedoms, which enshrined the protection of the French language and French-Canadian culture in Canada. In 1995, after two failed attempts by the Mulroney government to secure Quebec's ratification of amendments to the constitution, the Parti Québécois held a second referendum, though on this occasion the question was, albeit obliquely asked, whether one wished for the independence of the province of Quebec from the rest of Canada. On this more precise question, the response was again in the negative, though this time by a far closer margin, with only 51% against the proposal.\n\nThough the Parti Québécois has long spearheaded the sovereignty movement, they are not alone. Other minority provincial political parties, such as Option nationale and Québec Solidaire, also support sovereignty, but are not always supportive of the Parti Québécois. The Quebec Liberal Party, Québec's other primary political party, is opposed to increasing political sovereignty for the province, but has also been historically at odds, on occasion, with various Canadian federal governments. Thus, Quebec politics is effectively divided into two camps, principally opposed over the sovereignty issue. Quebec sovereignty is politically opposed to the competing ideology of Canadian federalism.\n\nMost groups within this movement seek to gain independence through peaceful means, using negotiation-based diplomatic intervention, although fringe groups have advocated and used violent means. The overwhelming number of casualties were murdered at the hands of the FLQ, a terrorist organization which perpetrated a bombing and armed robbery campaign from 1963 to 1970, culminating in the October Crisis and the death of senior government minister Pierre Laporte. Since this time all mainstream sovereignist groups have sworn off violence, while extremist nationalist groups, though in the minority, support violent actions in the name of liberating Quebec from Canadian sovereignty.\n\nThe primary mainstream political vehicle for the movement is the Parti Québécois, which has governed Quebec on multiple occasions. In 2012 it was elected to a minority government, in which its leader, Pauline Marois, became the first female Premier of Quebec.[1][2] However, only 18 months later, the PQ was defeated by the Liberal Party of Quebec in the 2014 elections.\n\nTerminology\n\nIn practice, \"separatist\" and \"sovereignist\" are terms used to describe individuals wanting the province of Quebec to separate from Canada to become a country of its own; supporters of the movement generally prefer the latter term. The term \"independentist\" is preferred by some of these supporters.\n\nReasons for sovereignty\n\nJustifications for Quebec's sovereignty are historically ethno-nationalistic in tendency, claiming that the unique culture and French-speaking majority (80% of the provincial population) are threatened with assimilation by either the rest of Canada or, as in Metropolitan France, by Anglophone culture more generally, and that the best way to preserve language, identity and culture is via the creation of an independent political entity.[3][4] Other distinguishing factors, such as religious differences (given the Catholic majority in Quebec), are also used to justify either separation or ethno-nationalist social policies advocated by the Parti Québécois.\n\nThe historical justification is that Quebec should be independent by virtue of New France having been conquered by the British in 1763 and subsequently relinquished to the British in exchange for Guadeloupe. It argues that the people of Quebec are the descendants of a conquered people who are due their national sovereignty. This perspective was popular in the 1950s and 1960s[citation needed] when European countries were giving up their colonies in the name of independence throughout much of Africa, the Middle East and South Asia.\n\nEight of the other Canadian provinces are overwhelmingly (greater than 90%) English-speaking, while New Brunswick is officially bilingual and about one-third Francophone. Another rationale is based on resentment of anti-Quebec sentiment.[5] With regard to the creation of the sovereignist movement, language issues were but a sub-stratum of larger cultural, social and political differences. Many scholars point to historical events as framing the cause for ongoing support for sovereignty in Quebec, while more contemporary politicians may point to the aftermath of more recent developments like the Canada Act of 1982, the Meech Lake Accord or the Charlottetown Accord. Many supporters of Quebec sovereignty often compare their situation with Catalonia in regards to Spain and Tibet in regards to the People's Republic of China.[citation needed]\n\nOverview\n\nBackground\n\nTension between the francophone, Catholic population of Quebec and the largely anglophone, Protestant population of the rest of Canada has been a central theme of Canadian history, shaping the early territorial and cultural divisions of the country that persist to this day.[6] Supporters of sovereignty for Quebec believe that the current relationship between Quebec and the rest of Canada does not reflect Quebec's best social, political and economic development interests. Moreover, many subscribe to the notion that without appropriately recognizing that the people of Quebec are culturally distinct, Quebec will remain chronically disadvantaged in favour of the English-Canadian majority. There is also the question of whether the French language can survive within the geographic boundaries of Quebec and where French-Canadian society and culture fits into what is an increasingly multicultural country. Separatists and Independentists are generally opposed to some aspects of the federal system in Canada and do not believe it can be reformed in a way that could satisfy the needs of Quebec's French-speaking majority. A key component in the argument in favour of overt political independence is that new legislation and a new system of governance could best secure the future development of modern Québécois culture. Additionally, there is wide-ranging debate about defence, monetary policy, currency, international-trade and relations after independence and whether a renewed federalism would give political recognition to the Quebec nation (along with the other 'founding' peoples, including Canadian First Nations, the Inuit, and the British) could satisfy the historic disparities between these cultural \"nations\" and create a more cohesive and egalitarian Canada.\n\nSeveral attempts at reforming the federal system in Canada have thus far failed because of, particularly, the conflicting interests between Quebec's representatives and the other provincial governments' representatives. There is also a degree of resistance throughout Quebec and the rest of Canada to re-opening a constitutional debate, in part because of the nature of these failures—not all of which were the result simply of sovereignists and federalists not getting along. To cite one case, in a recent round of constitutional reform, Elijah Harper, an aboriginal leader from Manitoba, was able to prevent ratification of the agreement in the provincial legislature, arguing that the accord did not address the interests of Canada's aboriginal population. This was a move to recognize that other provinces represent distinct cultural entities, such as the aboriginal population in Canada's Prairies or the people of Newfoundland (which contains significant and culturally distinct French-Canadian, English-Canadian, Irish-Canadian and Aboriginal cultures- and many more).\n\nContemporary politics\n\nPerhaps the most significant basis of support for Quebec's sovereignty movement lies in more recent political events. For practical purposes, many political pundits use the political career and efforts of René Lévesque as a marker for the beginnings of what is now considered the contemporary movement, although more broadly accepted consensus appears on the contemporary movement finding its origins in a period called the Quiet Revolution.\n\nRené Lévesque, architect of the first referendum on sovereignty, claimed a willingness to work for change in the Canadian framework after the federalist victory in the referendum of 1980. This approach was dubbed le beau risque (\"the beautiful risk\"), and it led to many ministers of the Lévesque's government to resign in protest. The 1982 patriation of the Canadian constitution did not solve the issue in the point of view of the majority of sovereignists. The constitutional amendment of 1982 was agreed to by representatives from 9 of the 10 provinces (with René Lévesque abstaining). Nonetheless, the constitution is integral to the political and legal systems used in Quebec.\n\nThere are numerous possible reasons the 'Yes' campaign went down to defeat: The economy of Quebec suffered measurably following the election of the sovereignist Parti Québécois and continued to during the course of the campaign. The Canadian dollar lost much of its value and, during coverage of the dollar's recovery against US currency, there were repeated citations of the referendum and political instability caused by it cited as cause for the fall.[citation needed] Some suggest there were promises of constitutional reform to address outstanding political issues between the province and the federal government, both before and since, without any sign of particularly greater expectation those promises would be filled to any greater or lesser degree. There remains no conclusive evidence that the sovereignty movement derives significant support today because of anything that was promised back in the 1970s.\n\nProponents of the sovereignty movement sometimes suggest that many people in Quebec feel \"bad\" for believing the constitutional promises that the federal government and Pierre Trudeau made just before the 1980 Quebec referendum.[7] Those were not delivered on paper or agreed upon in principle by the federal government or the other provincial governments. But, one conclusion that appears to be universal is that one event in particular—dubbed \"the night of long knives\"—energized the sovereignist movement during the 1980s. This event involved a \"back-room\" deal struck between Trudeau, representing the federal government, and all of the other provinces, save Quebec. It was here that Trudeau was able to gain agreement on the content of the constitutional amendment, while the separatist Premier René Lévesque was left out. And it may well be that a certain number of Quebecers did and may even now feel \"bad\" both about the nature of that deal and how Trudeau (a Quebecer himself) went about reaching it.\n\nRegardless of Quebec government's refusal to approve the 1982 constitutional amendment because the promised reforms were not implemented, the amendment went into effect. To many in Quebec, the 1982 constitutional amendment without Quebec's approval is still viewed as a historic political wound. The debate still occasionally rages within the province about the best way to heal the rift and the sovereignty movement derives some degree of support from a belief that healing should take the form of separation from Canada.\n\n\"I also criticized the unilateral repatriation [sic] of 1982, concluding that 'even in their moments of greatest mistrust, the Québécois never imagined that the pact of 1867 could ever be changed without their consent. Hence the impression they had in 1982 of a breach of trust, of a violation of the national bond's integrity. The descendants of George-Étienne Cartier did not expect this from the descendants of John A. Macdonald. Perceived as trickery in Quebec, the repatriation [sic] of 1982 has placed a time bomb in the political dynamics of this country\". (p. 224, On the Record, Lucien Bouchard, former leader of the sovereignist federal political party, the Bloc Québécois.)\n\nThe failure of the Meech Lake Accord—an abortive attempt to redress the above issues—strengthened the conviction of most sovereignist politicians and led many federalist ones to place little hope in the prospect of a federal constitutional reform that would satisfy Quebec's purported historical demands (according to proponents of the sovereignty movement). These include a constitutional recognition that Quebecers constitute a distinct society, as well as a larger degree of independence of the province towards federal policy.\n\n\"In Montreal, June 25, I walked along rue Sherbrooke to Olympic Stadium, submerged in the immense river of white and blue that seemed unstoppable on its march to sovereignty. Three days earlier, Bourassa, former minister of federalism, had hurriedly changed his tune: 'English Canada must understand that... Quebec is, today and forever, a distinct society, free and able to assume its destiny and its development.'\" (p. 251, 'On the Record', Lucien Bouchard)\n\nThe contemporary sovereignty movement is thought to have originated from the Quiet Revolution of the 1960s, although the desire for an independent or autonomous French-Canadian state has periodically arisen throughout Quebec's history, notably during the 1837 Lower Canada Rebellion. Part of Quebec's continued historical desire for sovereignty is caused by Quebecers' perception of a singular English-speaking voice and identity that is dominant within the parameters of Canadian identity. (This is a point contested in other parts of Canada, particularly in places such as Manitoba, which has a significant French-speaking population and where, in the 1990s, that population tried to assert francophone language rights in schools. The separatist Parti Québécois-led government of Quebec offered up comment actually taking the side of the Manitoba government, which was opposing granting those rights. Speculation persists that the Quebec government opposed this assertion of francophone identity outside of the province because of the impact it would have on the assertion of anglophone language rights within its own borders.)\n\nFor a majority of Quebec politicians, whether sovereignist or not, the problem of Quebec's political status is considered unresolved to this day. Although Quebec independence is a political question, cultural concerns are also at the root of the desire for independence. The central cultural argument of the sovereignists is that only sovereignty can adequately ensure the survival of the French language in North America, allowing Quebecers to establish their nationality, preserve their cultural identity, and keep their collective memory alive (see Language demographics of Quebec).\n\n\"At the same time, a brutal gesture by the Saskatchewan legislature brought the first language crises to my doorstep. The legislature precipitously abrogated the only law guaranteeing linguistic rights to the French population. It was revenge for a recent Supreme Court decision that had confirmed the constraining power of the law requiring all provincial laws to be available in French. To avoid having to translate all their laws, Grant Devine's government moved to repeal the act. The French community reacted with indignation and asked for federal intervention\". (p. 186, On the Record, Lucien Bouchard)\n\nLegal and constitutional issues\n\nIt has been argued by Jeremy Webber and Robert Andrew Young that, as the office is the core of authority in the province, the secession of Quebec from Confederation would first require the abolition or transformation of the post of Lieutenant Governor of Quebec; such an amendment to the constitution of Canada could not be achieved without, according to Section 41 of the Constitution Act, 1982, the approval of the federal parliament and all other provincial legislatures in Canada.[8] Others, such as J. Woehrling, however, have claimed that the legislative process towards Quebec's independence would not require any prior change to the viceregal post.[9] Young also concluded that the lieutenant governor could refuse Royal Assent to a bill that proposed to put an unclear question on sovereignty to referendum or was based on the results of a referendum that asked such a question.[10]\n\nArguments against sovereignty\n\nIn a series of letters throughout the 1990s, Stéphane Dion (the federal Intergovernmental Affairs Minister at the time) laid out an argument against sovereignty.\n\nIt has also been argued by prominent Quebecers (sovereignists and ex-sovereignists, including former Quebec premier Lucien Bouchard) that sovereignty politics has distracted Quebecers from the real economic problems of Quebec, and that sovereignty by itself cannot solve those problems. In 2005 they published their position statement, \"Pour un Québec lucide\", (\"For a clear vision of Quebec\") which details the problems facing Quebec.[11]\n\nMany federalists oppose the Quebec sovereignty movement for economic and political reasons but many also oppose sovereignty on other grounds. For example, since the 1995 referendum, in regards to the declaration of Jacques Parizeau who blamed the loss on \"money and the ethnic vote\", many federalists considered the sovereignty movement as an expression of ethnic nationalism.\n\nSome arguments against sovereignty claim that the movement is illegitimate because of its Eurocentrism which alienates many among Canada's First Nations, as well as the Inuit, and Métis peoples and their sympathizers.[12] The sentiment is summed up by a quotation from a Mohawk from Akwsasne: \"How can Quebec, with no economic base and no land base, ask to become sovereign? How can Quebec be a nation when they have no constitution? We have had a constitution since before the American revolution.\" Here the argument expresses the claim that the Mohawk nation has a more legitimate claim to distinct nationhood on the basis of traditional lands and a constitution predating confederation (and the creation of Quebec and a Québécois identity) and thus should be afforded the right of self-determination.[13]\n\nSimilarly, the Cree have also asserted for many years that they are a separate people with the right to self-determination recognized under international law. They argue that no annexation of them or their territory to an independent Quebec should take place without their consent, and that if Quebec has the right to leave Canada then the Cree people have the right to choose to keep their territory in Canada. Cree arguments generally do not claim the right to secede from Canada; rather, the Cree see themselves as a people bound to Canada by treaty (see the James Bay and Northern Quebec Agreement), and as citizens of Canada.[14] The Cree have stated that a unilateral declaration of independence by Quebec would be a violation of fundamental principles of human rights, democracy and consent. If secession were to proceed, the Cree argue that they would seek protection through the Canadian courts as well as asserting Cree jurisdiction over its people and lands.[14]\n\nProfessor Peter Russell has said of Aboriginal peoples in Canada: \"(they) are not nations that can be yanked out of Canada against their will by a provincial majority.... With few exceptions (they) wish to enjoy their right to self-government within Canada, not within a sovereign Quebec.\"[15] International human rights expert Erica-Irene Daes says the change \"will leave the most marginalized and excluded of all the world's peoples without a legal, peaceful weapon to press for genuine democracy....\"[15] This concern is connected to the claim that if Quebec were to be considered its own autonomous nation-state then it need not honour the treaties and agreements that were formed between Aboriginal peoples and the British and French monarchies and is now maintained by the federal Canadian government.[16] Concern for this may stem from perception of neo-colonial or eurocentric attitudes in the leadership of former premiers, such as Robert Bourassa and self-proclaimed \"Conqueror of the North\".[17]\n\nAdditionally, those in favour Canadian federalism denounce Quebec separation as a 'Balkanization' of Canada.\n\nSovereignty-association\n\nThe history of the relations between French and British descendants in Canada is one filled with a lot of rocky moments. After discovering Canada and establishing some outposts and cities, France lost it to Great Britain. After the Seven Years' War ended in 1763, France abandoned claims on Canada (except for the two small islands of Saint Pierre and Miquelon) and Great Britain gave the West Indies islands of Guadeloupe, Martinique and some others back to France in the Treaty of Paris, at which time France limited its activities to parts of North America south of present-day Canada.\n\nFrom that point on, at different moments in Canada's history, some leaders and groups have risen to claim authority. The use of the word \"sovereignty\" and many of the ideas of this movement originated in the 1967 Mouvement Souveraineté-Association of René Lévesque. This movement ultimately gave birth to the Parti Québécois in 1968.\n\nSovereignty-association (French: Souveraineté-Association) is the combination of two concepts:\n\nThe achievement of sovereignty for the Quebec state. The creation of a political and economic association between this new independent state and Canada.\n\nIt was first presented in Lévesque's political manifesto, Option Québec.\n\nThe Parti Québécois defines sovereignty as the power for a state to levy all its taxes, vote on all its laws, and sign all its treaties (as mentioned in the 1980 referendum question).\n\nThe type of association between an independent Quebec and the rest of Canada was described as a monetary and customs union as well as joint political institutions to administer the relations between the two countries. The main inspiration for this project was the then-emerging European Community. In Option Québec Lévesque expressly identified the EC as his model for forming a new relationship between sovereign Quebec and the rest of Canada, one that would loosen the political ties while preserving the economic links. The analogy, however, is counterproductive, suggesting Lévesque did not understand the nature and purpose of the European Community nor the relationship between economics and politics that continue to underpin it. Advocates of European integration had, from the outset, seen political union as a desirable and natural consequence of economic integration.[18]\n\nThe hyphen between the words \"sovereignty\" and \"association\" was often stressed by Lévesque and other PQ members, to make it clear that both were inseparable. The reason stated was that if Canada decided to boycott Quebec exports after voting for independence, the new country would have to go through difficult economic times, as the barriers to trade between Canada and the United States were then very high. Quebec would have been a nation of 7 million people stuck between two impenetrable protectionist countries. In the event of having to compete against Quebec, rather than support it, Canada could easily maintain its well-established links with the United States to prosper in foreign trade.\n\nSovereignty-association as originally proposed would have meant that Quebec would become a politically independent state, but would maintain a formal association with Canada — especially regarding economic affairs. It was part of the 1976 sovereignist platform which swept the Parti Québécois into power in that year's provincial elections – and included a promise to hold a referendum on sovereignty-association. René Lévesque developed the idea of sovereignty-association to reduce the fear that an independent Quebec would face tough economic times. In fact, this proposal did result in an increase in support for a sovereign Quebec: polls at the time showed that people were more likely to support independence if Quebec maintained an economic partnership with Canada. This line of politics led the out-spoken Yvon Deschamps to proclaim that what Quebecers want is an independent Quebec inside a strong Canada, thereby comparing the sovereignist movement to a spoiled child that has everything it could desire and still wants more.\n\nIn 1979 the PQ began an aggressive effort to promote sovereignty-association by providing details of how the economic relations with the rest of Canada would include free trade between Canada and Quebec, common tariffs against imports, and a common currency. In addition, joint political institutions would be established to administer these economic arrangements. But the sovereignist cause was hurt as many politicians (most notably the premiers of several of the other provinces) publicly refused to negotiate an economic association with an independent Quebec, contributing to the Yes side losing by a vote of 60 percent to 40 percent.\n\nThis loss laid the groundwork for the 1995 referendum, which stated that Quebec should offer a new economic and political partnership to Canada before declaring independence. An English translation of part of the Sovereignty Bill reads, \"We, the people of Quebec, declare it our own will to be in full possession of all the powers of a state; to levy all our taxes, to vote on all our laws, to sign all our treaties and to exercise the highest power of all, conceiving, and controlling, by ourselves, our fundamental law.\"\n\nThis time, the sovereignists lost in a very close vote: 50.6 percent to 49.4 percent, or only 53,498 votes out of more than 4,700,000 votes cast. However, after the vote many within the sovereignist camp were very upset that the vote broke down heavily along language lines. Approximately 90 percent of English speakers and allophones (mostly immigrants and first-generations Quebecers whose native language is neither French or English) Quebecers voted against the referendum, while almost 60 percent of Francophones voted Yes, and 82 percent of Quebecers are French-speaking. Quebec premier Jacques Parizeau, whose government supported sovereignty, attributed the defeat of the resolution to money and the ethnic vote. His opinion caused an outcry among English speaking Quebecers, since it exposed the ethnocentric perspective of the leader, who focused blame for the defeat on minority communities as if to discount the influence of 40% of Francophones who voted no.\n\nAn inquiry by the director-general of elections concluded in 2007 that at least $500,000 was spent by the federalist camp in violation of Quebec's election laws. This law imposes a limit on campaign spending by both option camps. Parizeau's statement was also an admission of failure by the Yes camp in getting the newly arrived Quebecers to adhere to their political option.\n\nAccusations of an orchestrated effort of 'election engineering' in several polling stations located in areas with large numbers of non-francophone voters, which resulted in unusually large proportions of rejected ballots, were raised following the 1995 referendum.[citation needed] Afterward, testimony by PQ-appointed polling clerks indicated that they were ordered by PQ-appointed overseers to reject ballots in these polling stations for frivolous reasons that were not covered in the election laws.\n\nWhile opponents of sovereignty were pleased with the defeat of the referendum, most recognized[examples needed] that there were still deep divides within Quebec and problems with the relationship between Quebec and the rest of the country.\n\nHistory\n\nPrecursor ideas and events\n\nSovereigntism and sovereignty are terms that refer to the modern movement in favour of the political independence of Quebec. However, the roots of Quebec's desire for self-determination can be traced back as far as the Patriotes Rebellion, the Alliance Laurentienne of 1957, the writings of Lionel Groulx in the 1920s, the Francoeur Motion of 1917, and Honoré Mercier's flirtation with this idea (especially in his historic speech of 1893.)\n\nEmergence\n\nThe Quiet Revolution in Quebec brought widespread change in the 1960s. Among other changes, support for Quebec independence began to form and grow in some circles. The first organization dedicated to the independence of Quebec was the Alliance Laurentienne, founded by Raymond Barbeau on January 25, 1957.\n\nOn September 10, 1960, the Rassemblement pour l'indépendance nationale (RIN) was founded, with Pierre Bourgault quickly becoming its leader. On August 9 of the same year, the Action socialiste pour l'indépendance du Québec (ASIQ) was formed by Raoul Roy. The \"independence + socialism\" project of the ASIQ was a source of political ideas for the Front de libération du Québec (FLQ).\n\nOn October 31, 1962, the Comité de libération nationale and, in November of the same year, the Réseau de résistance were set up. These two groups were formed by RIN members to organize non-violent but illegal actions, such as vandalism and civil disobedience. The most extremist individuals of these groups left to form the FLQ, which, unlike all the other groups, had made the decision to resort to violence in order to reach its goal of independence for Quebec. Shortly after the November 14, 1962, Quebec general election, RIN member Marcel Chaput founded the short-lived Parti républicain du Québec.\n\nIn February 1963, the Front de libération du Québec (FLQ) was founded by three Rassemblement pour l'indépendance nationale members who had met each other as part of the Réseau de résistance. They were Georges Schoeters, Raymond Villeneuve, and Gabriel Hudon.\n\nIn 1964, the RIN became a provincial political party. In 1965, the more conservative Ralliement national (RN) also became a party.\n\nThe historical context of the time was a period when many former European colonies, such as Cameroon, Congo, Senegal, Algeria, and Jamaica, were becoming independent. Some advocates of Quebec independence saw Quebec's situation in a similar light; numerous activists were influenced by the writings of Frantz Fanon, Albert Memmi, and Karl Marx.[citation needed]\n\nIn June 1967, French president Charles de Gaulle, who had granted independence to Algeria, shouted \"Vive le Québec libre!\" during a speech from the balcony of Montreal's city hall during a state visit to Canada. In doing so, he deeply offended the federal government, and English Canadians felt he had demonstrated contempt for the sacrifice of Canadian soldiers who died on the battlefields of France in two world wars. The visit was cut short and de Gaulle left the country.\n\nFinally, in October 1967, former Liberal cabinet minister René Lévesque left that party when it refused to discuss sovereignty at a party convention. Lévesque formed the Mouvement souveraineté-association and set about uniting pro-sovereignty forces.\n\nHe achieved that goal in October 1968 when the MSA held its only national congress in Quebec City. The RN and MSA agreed to merge to form the Parti Québécois (PQ), and later that month Pierre Bourgault, leader of the RIN, dissolved his party and invited its members to join the PQ.\n\nMeanwhile, in 1969 the FLQ stepped up its campaign of violence, which would culminate in what would become known as the October Crisis. The group claimed responsibility for the bombing of the Montreal Stock Exchange, and in 1970 the FLQ kidnapped British Trade Commissioner James Cross and Quebec Labour Minister Pierre Laporte; Laporte was later found murdered.\n\nThe early years of the Parti Québécois\n\nJacques Parizeau joined the party on September 19, 1969, and Jérôme Proulx of the Union Nationale joined on November 11 of the same year.\n\nIn the 1970 provincial election, the PQ won its first seven seats in the National Assembly. René Lévesque was defeated in Mont-Royal by the Liberal André Marchand.\n\nThe referendum of 1980\n\nIn the 1976 election, the PQ won 71 seats — a majority in the National Assembly. With voting turnouts high, 41.4 percent of the electorate voted for the PQ. Prior to the election, the PQ renounced its intention to implement sovereignty-association if it won power.[19]\n\nOn August 26, 1977, the PQ passed two main laws: first, the law on the financing of political parties, which prohibits contributions by corporations and unions and set a limit on individual donations, and second, the Charter of the French Language.\n\nOn May 17 PQ Member of the National Assembly Robert Burns resigned, telling the press he was convinced that the PQ was going to lose its referendum and fail to be re-elected afterwards.\n\nAt its seventh national convention from June 1 to 3, 1979, the sovereignist adopted their strategy for the coming referendum. The PQ then began an aggressive effort to promote sovereignty-association by providing details of how the economic relations with the rest of Canada would include free trade between Canada and Quebec, common tariffs against imports, and a common currency. In addition, joint political institutions would be established to administer these economic arrangements.\n\nSovereignty-association was proposed to the population of Quebec in the 1980 Quebec referendum. The proposal was rejected by 60 percent of the Quebec electorate.\n\nIn September, the PQ created a national committee of Anglophones and a liaison committee with ethnic minorities.\n\nThe PQ was returned to power in the 1981 election with a stronger majority than in 1976, obtaining 49.2 per cent of the vote and winning 80 seats. However, they did not hold a referendum in their second term, and put sovereignty on hold, concentrating on their stated goal of \"good government\".\n\nRené Lévesque retired in 1985 (and died in 1987). In the 1985 election under his successor Pierre-Marc Johnson, the PQ was defeated by the Liberal Party.\n\nThe referendum of 1995\n\nThe PQ returned to power in the 1994 election under Jacques Parizeau, this time with 44.75% of the popular vote. In the intervening years, the failures of the Meech Lake Accord and Charlottetown Accord had revived support for sovereignty, which had been written off as a dead issue for much of the 1980s.\n\nAnother consequence of the failure of the Meech Lake Accord was the formation of the Bloc Québécois (BQ), a sovereignist federal political party, under the leadership of the charismatic former Progressive Conservative federal cabinet minister Lucien Bouchard. Several PC and Liberal members of the federal parliament left their parties to form the BQ. For the first time, the PQ supported pro-sovereigntist forces running in federal elections; during his lifetime Lévesque had always opposed such a move.\n\nThe Union Populaire had nominated candidates in the 1979 and 1980 federal elections, and the Parti nationaliste du Québec had nominated candidates in the 1984 election, but neither of these parties enjoyed the official support of the PQ; nor did they enjoy significant public support among Quebecers.\n\nIn the 1993 federal election, which featured the collapse of Progressive Conservative Party support, the BQ won enough seats in Parliament to become Her Majesty's Loyal Opposition in the House of Commons.\n\nAt the Royal Commission on the Future of Quebec (also known as the Outaouais Commission) in 1995, the Marxist-Leninist Party of Canada made a presentation in which the party leader, Hardial Bains, recommended to the committee that Quebec declare itself as an independent republic.[20]\n\nParizeau promptly advised the Lieutenant Governor to call a new referendum. The 1995 referendum question differed from the 1980 question in that the negotiation of an association with Canada was now optional. The open-ended wording of the question resulted in significant confusion, particularly amongst the 'Yes' side, as to what exactly they were voting for. This was a primary motivator for the creation of the 'Clarity Act' (see below).\n\nThe \"No\" campaign won, but only by a very small margin — 50.6% to 49.4%.[21] As in the previous referendum, the English-speaking (anglophone) minority in Quebec overwhelmingly (about 90%) rejected sovereignty, support for sovereignty was also weak among allophones (native speakers of neither English nor French) in immigrant communities and first-generation descendants. The lowest support for Yes side came from Mohawk, Cree and Inuit voters in Quebec, some first Nations chiefs asserted their right to self-determination with the Cree being particularly vocal in their right to stay territories within Canada. More than 96% of the Inuit and Cree voted No in the referendum. However, The Innu, Attikamek, Algonquin and Abenaki nations did partially support Quebec sovereignty. In 1985, 59 per cent of Quebec's Inuit population, 56 per cent of the Attikamek population and 49 per cent of the Montagnais population voted in favour of the Sovereignist Parti Québécois party. That year, three out of every four native reservations gave a majority to the Parti Québécois party.[22]\n\nBy contrast almost 60 percent of francophones of all origins voted \"Yes\". (82 per cent of Quebecers are Francophone.) Later inquiries into irregularities determined that abuses had occurred on both sides: some argue that some \"No\" ballots had been rejected without valid reasons, and the October 27 \"No\" rally had evaded spending limitations because of out-of-province participation.[23] An inquiry by \"Le Directeur général des élections\" concluded in 2007 that the \"No\" camp had exceeded the campaign spending limits by $500,000.\n\nAt the end of the 20th century\n\nQuebec general election, 1998\n\nThe Parti Québécois won re-election in the 1998 election despite losing the popular vote to Jean Charest and the Quebec Liberals. In the number of seats won by both sides, the election was almost a clone of the previous 1994 election. However, public support for sovereignty remained too low for the PQ to consider holding a second referendum during their second term. Meanwhile, the federal government passed the Clarity Act to govern the wording of any future referendum questions and the conditions under which a vote for sovereignty would be recognized as legitimate. Federal Liberal politicians stated that the ambiguous wording of the 1995 referendum question was the primary impetus in the bill's drafting.\n\nWhile opponents of sovereignty were pleased with their referendum victories, most recognized that there are still deep divides within Quebec and problems with the relationship between Quebec and the rest of Canada.\n\nClarity Act, 1999\n\nIn 1999, the Parliament of Canada, at the urging of Prime Minister Jean Chrétien, passed the Clarity Act, a law that, amongst other things, set out the conditions under which the Crown-in-Council would recognize a vote by any province to leave Canada. It required a majority of eligible voters for a vote to trigger secession talks, not merely a plurality of votes. In addition the act requires a clear question of secession to initiate secession talks. Controversially, the act gave the House of Commons the power to decide whether a proposed referendum question was considered clear, and allowed it to decide whether a clear majority has expressed itself in any referendum. It is widely considered by sovereignists as an illegitimate piece of legislation, who asserted that Quebec alone had the right to determine its terms of secession. However the Supreme Court of Canada disagreed when the matter was referred to that body, ruling that the Act is constitutional and, just as Canada is divisible, so is Quebec, a ruling that has significant implications for linguistic and ethnic minorities within Quebec, the bulk of whom have traditionally opposed secession. Chrétien considered the legislation among his most significant accomplishments.\n\nPresent\n\nModernization\n\n\"Sovereignty-Association\" is nowadays more often referred to simply as \"sovereignty\". However, in the 1995 Quebec referendum, in which the sovereignty option was narrowly rejected, the notion of some form of economic association with the rest of Canada was still envisaged (continuing use of the Canadian dollar and military, for example) and was referred to as \"Sovereignty-Partnership\" (in French Souveraineté-Partenariat). It remains a part of the PQ program[when?] and is tied to national independence in the minds of most Quebecers. This part of the PQ program has always been controversial, especially since Canadian federal politicians usually refuse the concept.\n\nIn 2003, the PQ launched the Saison des idées (\"Season of ideas\") which is a public consultation aiming to gather the opinions of Quebecers on its sovereignty project. The new program and the revised sovereignty project was adopted at the 2005 Congress.\n\nIn the 2003 election, the PQ lost power to the Liberal Party. However, in early 2004, the Liberal government of Paul Martin had proved to be unpopular, and that, combined with the federal Liberal Party sponsorship scandal, contributed to a resurgence of the BQ. In the 2004 federal elections, the Bloc Québécois won 54 of Quebec's 75 seats in the House of Commons, compared to 33 previously. However, in the 2006 federal elections the BQ lost three seats and in the 2008 federal elections lost an additional seat, bringing their total down to 49, but was still the most popular federal party in Quebec up until the 2011 Canadian federal election, when the BQ was devastated by the federalist NDP, with a total of 4 seats and loss of official party status in the Commons, compared to the NDP's 59, Conservatives' 5 and the Liberals' 7.\n\nPolling data by Angus Reid in June 2009 showed the support for Quebec separation was very weak at the time and separatism unlikely to occur in the near future. Polling data showed that 32% of Quebecers believe that Quebec had enough sovereignty and should remain part of Canada, 28% thought they should separate, and 30% say they believe that Quebec does need greater sovereignty but should remain part of Canada.[24] However the poll did reveal that a majority (79%) of Quebecers still desired to achieve more autonomy. The number one area of autonomy that those polled had hoped for was with regard to culture at 34%, the next highest areas of autonomy cherished were the economy at 32%, taxation at 26%, and immigration and the environment at 15% each.[24]\n\nThe 2009 Angus Reid poll also revealed some effects of the Clarity Act in which they asked two questions, one a straightforward question for a separate nation, and the other a more muddled version on separation similar to the one posed in the 1995 referendum. The data on the questions revealed as follows to the first hard line question of \"Do you believe that Quebec should become a country separate from Canada?\" 34% replied yes, 54% said no, and 13% were unsure.[24] To the less clear question of \"Do you agree that Quebec should become sovereign after having made a formal offer to Canada for a new economic and political partnership within a scope of the bill respecting the future of Quebec?\" support for separation increased to 40% yes, the no vote still led with 41%, and the unsure increased to 19%.[24] The most startling revelation of the poll was in the fact that only 20% or 1 in 5 polled believed that Quebec would ever separate from Canada.[24]\n\n2011 was considered a watershed year for the sovereignist movement. In the aftermath of the 2011 federal election, Léger Marketing and pro-sovereignist newspaper Le Devoir conducted a poll on the question.[25] When asked whether they would vote Yes or No in the event of a referendum, 41% of the respondents said they would vote Yes. In 2011, the sovereignist movement splintered, with several new parties being formed by disaffected politicians, with some politicians dissatisfied with slow progress towards independence, and others hoping to put the sovereignty question on the backburner. Leadership by PQ leader Pauline Marois was divisive.[26]\n\nAllies and opponents\n\nProvincial\n\nThe separatist movement draws above the left and right spectrum, a sizeable minority of more conservative Quebecers supporting the PQ's political agenda because of the sovereignty issue, despite reservations about its social democratic political agenda.\n\nRight and Left must be interpreted within the provincial context; Liberal Party politics generally coincide with those of other liberal parties, while PQ politics are more social democratic in orientation. There is no mass conservative movement in Quebec's political culture on the provincial level, due notably to strong government interventionism and Keynesianism shared by all parties since the 1960s (the so-called \"Quebec Consensus\" since the Quiet Revolution), and the province's Catholic heritage.\n\nThere are, of course, quite a few exceptions. Notable examples include:\n\nthe conservative but nationalist Action Démocratique du Québec supporting the Yes side in the 1995 Quebec referendum. They now support Quebec Autonomism: a decentralized view of the Canadian Confederation, and accept the 1995 \"No\" verdict;\n\nthe Progressive Conservative Party of Canada building links with the sovereignist in the 1980s;\n\nSovereignty has very little support among Quebec Anglophones, immigrant communities, and aboriginal First Nations. About 60% of Francophones voted \"Yes\" in 1995, and with the exception of weak \"Yes\" support from Haitian, Arab and Latin American communities, most non-Francophones massively voted \"No\" (see Demolinguistics of Quebec). The opponents of the sovereignty movement view the project as ethnically exclusive, based on its rejection by non-Francophones. This position is sometimes disputed by the PQ, which claims its goal is all-embracing and essentially civic in nature.\n\nPartitionism\n\nThere is an undercurrent of feeling amongst \"ethnic\" and \"anglo\" voters that sometimes surfaces as a desire to separate from Quebec. This would create a new province of Canada, from the southwestern and southern portions of the province (comprising half of Montreal, parts of the Outaouais, the Eastern Townships).\n\nThis feeling is exemplified by the statement — \"If Canada is divisible, then so is Quebec\" made by federalists in 1995 or \"If Quebec can separate from Canada, then we can separate from Quebec\".[27] In contemporary times most mainstream political parties in Quebec deny or refuse to comment on the idea that Quebec can be divided up. During the 2007 Quebec election, federalist and Liberal Party of Quebec leader Jean Charest said that \"All of these things are hypothetical questions...I do not think that Quebec is divisible. And if ever we were to go there, and end up in that situation, I know the question would be asked.\"[27]\n\nHowever the Supreme Court of Canada has ruled in favour of the legality in partitioning Quebec, determining that Quebec is in fact divisible according to the same logic, legalities, and democratic tests that render Canada divisible. A panel of Quebec civil servants, at the request of the ruling Parti Québécois at the time, wrote a report arguing that International law guarantees the territorial integrity of Quebec[28] should Quebec become an independent state.\n\nCree separation\n\nThere was a feeling amongst the Cree of Northern Quebec, that should the province separate, they would remain part of Canada, and would force the province to return to its pre-1912 boundaries, and re-establish the Ungava district of the Northwest Territories, or a new territory or province created in its place[citation needed] .\n\nRest of Canada\n\nThe other nine provinces of Canada have generally been opposed to Quebec sovereignty. Aside from marginal movements, the only major secessionist movement in English Canada has been the Maritimes Anti-Confederation movement immediately after Confederation occurred.\n\nIn general, francophones outside Quebec oppose sovereignty or any form of national recognition for Quebec, while non-francophones, particularly the anglophone minority in Montreal, also have remained opposed. After polling heavily on the subject, marketing firm president Mark Leger concluded: “These numbers surprise me, they’re so clear across the country.... You look at Francophones outside Quebec, it’s the same result.... Overall, outside the French in Quebec, all the other groups across the country are against this notion.” The exact question of the November 2006 poll was, \"Currently, there is a political debate on recognizing Quebec as a nation. Do you personally consider that Quebecers form a nation or not?\" Canadians from every region outside Quebec, non-Francophone Quebecers (62 per cent), Francophone Canadians outside Quebec (77 per cent) all rejected the idea.[29]\n\nFrance\n\nIn France, although openness and support is found on both sides of the political spectrum, the French political right has traditionally been warmer to sovereignists (like President Charles de Gaulle, who shouted his support of independence in Montreal in 1967) than the French left (like President François Mitterrand[citation needed]).\n\nThis used to be a paradoxical phenomenon because of the Parti Québécois and most sovereignists being to the political left and supporters of Quebec being as a province tend to be politically on the right. Michel Rocard (who became Prime Minister of the French Republic) has been one of the French Socialists that broke that so-called rule the most, maintaining a close and warm relationship with Quebec sovereignists. More recently, Ségolène Royal, a leader of the French Socialist Party, indicated support[citation needed] for \"Quebec sovereignty\" but it was seemingly a reflexive answer to an \"out of the blue\" question from a Quebec journalist in Paris. On a later visit to Quebec City she gave a more nuanced position, mentioning a Parliamentary motion recognizing the Québécois as a \"nation\", but also describing 400 years of \"oppression\" and resistance of francophones in Canada.\n\nThe French Foreign Office motto concerning Quebec \"national question\" is \"non-ingérence et non-indifférence\" (\"no interference and no indifference\"), which epitomizes the official position of the French State. In other words, while the Quebec people vote to stay within Canada, France will officially support the Canadian Confederation the way it is. That is why bilateral relations between both governments (Canada and France) have been so strong for many years[citation needed] .\n\nFormer French President Nicolas Sarkozy has stated on the record that he opposes the separation of Quebec from Canada.[30][31] This changed back to the view of the French Foreign Office under Sarkozy's successor, François Hollande.[32]\n\nSovereignist organizations\n\nPolitical parties\n\nNon-partisan organizations\n\nMouvement pour une Élection sur la Souveraineté\n\nMouvement de libération nationale du Québec\n\nConseil de la Souveraineté du Québec\n\nRéseau de Résistance du Québécois\n\nDefunct organizations\n\nSympathetic organizations\n\nSovereignist media\n\nQuebec sovereignty movement in fiction\n\nSee also"}]}